{"Summary":"Not a UFO, anomaly, have seen it IN THE SAME PLACE March 7th, 10th, and 18th 2008","Object Shape":"Circle, Fireball, Sphere","divs":["sighting detailson thurs., march 6, 2008 we had a good snow here in plano, tx. that evening 12:58 am march 7th, i started taking pictures from my balcony of what i thought was an orb under a tree(i'm familiar with ufos and orbs). i've lived here for several years and frequently enjoy my view. this night was especially interesting because of the snow. this was the first time i had ever seen, what i thought to be at the time, an orb from my balcony. i don't know what to call it so i will just refer to it as \"the light.\" in the attached pictures, the times and dates are correct and no photos have been altered or doctored in any way, shape, form or fashion. the light was on until i went to bed. i'm not sure what time that was but the last picture was taken at 1:35 am. i'm going to give you my story along with the pictures for simplification. the pics i'm sending are huge. my camera is a nikon d40x, 10k megapixil. most of the shots were take w\\ a 200 mm lens. the shots taken on the 7th are shaky, didn't have a tripod and the exposures were very long. the shots on the other evenings were taken w\\ a tripod but are still not especially clear because the exposure was very long and it's hard to focus a digital camera in the dark (think i got it figured out now). picture dsc_0031 - resize the shots in photoshop or whatever you prefer and you'll be able to follow me. this pic gives you an idea of where the light is in conjunction from where the pic is being taken (please note this was not taken on the first sighting of the light). on the bottom of the pic is the railing on my balcony. along the fence line you can see four trees. the second tree from the left, look at the base of the tree and follow up the base to almost the top. just to the left you can see a an orange light...bingo. the white object to the far left in the tree line is a plastic garbage bag. on the three occasions that i saw the light, it appeared in the exact same place. i estimate the distance to be 150-200 yards from me. speaking for all three occasions, i did not experience anything out of the ordinary other than seeing the light. it looks as if i can only attach three pics here. i'll be happy to send more to your email address. i'm not sending pics from the first sighting in the snow. those are the worst ones in the batch (no tripod). dsc_0027 - taken march 10, 12:28 am. just happened to look out and there it was. dsc_0035 - i never saw those green lights to the left of the light. i'm going to nutshell this, i have to run. on the 18th i found a great way to brace my binoculars. i did not and never did see what one would think of as an orb. what i saw...i swear to god, looked like glowing yellow, orange or gold light (never saw the actual source of this glow\\light) with sparks rotating \"in\" the light at varying speeds, brightness and intensity. the \"sparks\" themselves did not seem to be the source of light that they were contained in. the \"sparks\" more or less seemed to spin horizontally to the ground in a clockwise motion. i spent hours watching this and i'm still floored. the detail was amazing. i would see \"sparks\" outside of the glow and most of those seemed to keep appearing in the same places, mostly just to right of the light. bottom line - i have tried to get to the source of the light but have had no luck, will explain later. if you have any researchers in my neck of the woods, i'd be more than happy to interview with them. more than that, i'd like to have someone on call. should i see the light again, they can come over and take a look for themselves. give me a call. p.s. the three nights i saw the light had one thing in common...it was colder than usual. i know, big surprise."],"Sighting Duration":"Undisclosed","Object Features":"Other","City":"Frisco","Latitude":"33.153464","files":["/var/www/straped/mufon/html2text/10005.html.txt","/var/www/straped/mufon/more/10005_submitter_file1__DSC_0031.JPG","/var/www/straped/mufon/more/10005_submitter_file2__DSC_0027.JPG","/var/www/straped/mufon/more/10005_submitter_file2__DSC_0027.JPG.jpg","/var/www/straped/mufon/more/10005_submitter_file3__DSC_0035.JPG","/var/www/straped/mufon/mufon_json/10005.json","/var/www/straped/mufon/org/10005.html"],"trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around March 18th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Other","Log Number":"US-03212008-0008","Date of the Event":"03/18/2008 08:15 UTC","Longitude":"-96.818472","Case Number":"10005","Source":"MUFON","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.153464,+-96.818472(10005)&iwloc=A&hl=en\"> mufon case (10005) map </A>","Tags":"City","Disposition":"IFO","Region":"Texas","Country":"United States","Date Submitted":"03/18/2008 08:15 UTC","Weather Factors":"Unknown"}