{"Longitude":"-88.079615","Sighting Duration":"00:04:00","Date of the Event":"03/07/2008 07:30 UTC","Latitude":"41.526631","Viewing Distance":"101-500 Feet","Case Number":"10008","divs":["Sighting DetailsAs I was returning home from Chicago traveling along westbound I-80, I noticed an extremely bright light in the sky to the west as I was passing the Village of New Lenox, IL. I thought that it may be an airplane traveling east, which would explain why it did not appear to move. As I continued west, the light kept its brightness, and still did not move from its position. As I crossed the Des Plaines River Bridge in Joliet, I noticed that there were now two extremely bright lights. As I drove alongside the West Park area in Joliet, I looked up from my driver's seat at the light source and saw a cross-shaped object silhouetted by the light, and hovering at about 80 feet above the ground. I was traveling at approximately 60 mph, but was able to see this object clearly. It had no similarity to a helicopter. I had my window open, and could hear no sound above the road sound being made by my vehicle. It was definitely not an airplane because of its nearness to the ground, and its absolutely stationary position. As I continued west, I saw the second light, also along the south side of the interstate, but nearer the large garbage disposal area. As I drove alongside this light, I again looked up and saw an exact duplicate of the previous cross-shaped object, silently hovering at about the same height above the ground. As I passed, I thought to myself that I had just seen something very odd. I am a professional person that has never witnessed anything out of the ordinary, but this was a very strange observance."],"Country":"United States","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/10008.html.txt","/var/www/straped/mufon/mufon_json/10008.json","/var/www/straped/mufon/org/10008.html"],"Date Submitted":"03/07/2008 07:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.526631,+-88.079615(10008)&iwloc=A&hl=en\"> mufon case (10008) map </A>","Weather Factors":"Unknown","Object Features":"Appendage(s)","Object Shape":"Cross","Object Flight Path":"Stationary","Tags":"City","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around March 7th 2008"],"City":"Joliet","Region":"Illinois","Log Number":"US-03222008-0002","Summary":"Saw two extremely bright lights while driving west along I-80 in Joliet, IL. Silent objects hovering."}