{"Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"03/20/2008 12:00 UTC","Date Submitted":"03/20/2008 12:00 UTC","Viewing Distance":"Unknown","Log Number":"US-03212008-0006","Country":"United States","Summary":"ufo trangle star like blinking lights forming triangle","Object Features":"Undisclosed","Latitude":"36.750727","Longitude":"-119.768996","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=36.750727,+-119.768996(10003)&iwloc=A&hl=en\"> mufon case (10003) map </A>","Source":"MUFON","Region":"California","Object Flight Path":"Undisclosed","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/10003.html.txt","/var/www/straped/mufon/mufon_json/10003.json","/var/www/straped/mufon/org/10003.html"],"City":"Fresno","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around March 20th 2008"],"divs":["Sighting Detailsi see these triangles rotating alot in the skys here in fresno. somtimes there blinking somtimes they dont. i see helicopters and planes i believe there ufos pretending to be planes. i have very good reason to believe it sense i consider myself a expert. because the simple fact a ufo followed me home aug 2nd 2006 ever sense these objects hace bee comming around. i have filmed over 300 hours of very good footage that i really believe are real ufos. i have aliens on film as well. the aliens have been in the house in my room. i cant go into detail here but i assure you thise needs further investigation. i have very good reason to know that even the so called reptilians have come here i have seen them. i donty bull crap around and waist peoples time. i can show or tell you anything you want to know about thewse ufo aliens. some aliens appear to be friends other im not so sure. i have studied this ufo alien subject 30 years so i know. the aliens tap on my walls they ran acroos my roof one night. i have things i can tell that seem ridiculas but i assure you there not! please contact me asap"],"Case Number":"10003"}