{"Log Number":"US-03212008-0003","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10000.html.txt","/var/www/straped/mufon/mufon_json/10000.json","/var/www/straped/mufon/org/10000.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.086944,+-97.500556(10000)&iwloc=A&hl=en\"> mufon case (10000) map </A>","Disposition":"IFO","Case Number":"10000","Longitude":"-97.500556","Latitude":"30.086944","Region":"Texas","Tags":"City","City":"Cedar Creek","Date Submitted":"03/21/2008 12:00 UTC","trends":["There have been 2 other sightings in Cedar Creek","There was one other sighting in Cedar Creek on or around March 21st 2008"],"Source":"MUFON","Summary":"Have ~50min. of video shot this morning. Not a plane, star, or planet","divs":["Sighting DetailsLooked out my bathroom window about 5:30am and saw a bright light moving from directly south of my house toward the west. As I watched it I noticed there was no sound and this bright light coming from a cylinder shaped object had no red or green lights on it as a plane would. I continued to watch it for about 5 mintues as it moved up and toward the west until it reached a spot in the ssw sky and appeared to stop and remain for at least an hour. I got my video camera off my dresser and went outside and set up a tripod and took video for about 50 mintues. The light can be seen on the video changing size and shape for ~50 mintues until it got bright enough outside that the light could no longer be seen in the video. I could still see it with my naked eye but was no longer able to see it on video. I then went inside and veiwed the video on my Television. The light sometimes gets 10 times bigger but moves very little. It appears to have taken up a position in the sky and remains there until the sun eventually gets bright enough so the camera no longer picks it up. I am able to see it for another 10 mintues with my naked eye but shut the video off because it can no longer be seen by the camera. The video shows some very unusal shape and size changes. I have contacted 3 local Television stations to see if they are interested in observing the video and am waiting for their response.I am 55 years old and saw a disc shaped UFO in December 1965, in Pittsburgh PA. which was 30' across and my mother and step father all witnessed this object which was only 30' away and going about 2mph at tree top level. I was so close I could see the tops of equipment racks (baby blue) through the windows on the UFO. Since then I have seen nothing unusal until today. I did witness Ball Lighting in the mid 80's while driving north on Mopac in Austin, Texas where I now live. I never for one mintue though it was a UFO and I don't want to say this object was but the video shows some very unusal size and shape changes while the Sony CCD TR 940 recorded this object for over 50 mintues. If your interested in veiwing this video contact me soon. I would like for you to veiw it before any news media gets it. I don't trust anyone because I know the government can & will cover this up if they get half a chance. I am also interested in becoming one of your field operators for this area. There have been many reports lately of UFO's in this area. Stephenville and Lake Travis have reported UFO's in the last 6 months. The reports say the UFO was cigar shape and extremely large (1 Mile long). I never heard of UFO's this large before. The reports I've heard in the past were of cigar shaped UFO's about 300 to 400 yds. long.Anyway, contact me soon as I would like your people to see this video before any news or government get a hold of it. We know they can not be trusted. Thank you and have a great day. JAS"],"Object Shape":"Cigar, Cylinder, Egg, Oval","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"03/21/2008 12:00 UTC"}