{"Date of the Event":"03/21/2008 12:00 UTC","trends":["There have been 2 other sightings in Cedar Creek","There was one other sighting in Cedar Creek on or around March 21st 2008"],"Country":"United States","Region":"Texas","Date Submitted":"03/21/2008 12:00 UTC","divs":["Sighting DetailsLooked out bedroom window about 5:30am Central time and saw and unusal light in the southern sky. I figured it would be gone before I could get my video camera set up. There were no red or green lights flashing on it as required by the FAA so I continued to watch the light while my Ex went and got binoculars. After veiwing the light through the binoculars, I decided I should get the video camera (Sony CCD TR940). I set the camera up using a tripod and recorded for ~1hr. The quality is similar to the some of the Mexican UFO's filmed during the full eclispe several years ago. The light is pulsing and changes size significantly. At times it goes from the size of a dime on the TV screen to the size of a beach ball(entire screen full). It moves very little but does move some. It was moving when I first saw it, going from due south toward the west and up at a 45degree angle. It then reached a spot In the ssw sky where it stopped and remained relatively still for about an hour. Although the camera was not able to pick it up after the sun had risen, I could still see it with my naked eye for some time after the video was unable to detect it. If you want to see the video contact me at the number provided above and I will make it available. It's definately not a plane, helicopter, star, or planet. As the day got brighter the object gradually faded until you couldn't see it even with the naked eye."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.096204,+-97.495176(10001)&iwloc=A&hl=en\"> mufon case (10001) map </A>","Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"video of UFO taken this morning","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/10001.html.txt","/var/www/straped/mufon/mufon_json/10001.json","/var/www/straped/mufon/org/10001.html"],"Weather Factors":"None","Disposition":"Unknown","Object Flight Path":"Stationary,Path then hovering","Tags":"City","Longitude":"-97.495176","Latitude":"30.096204","City":"Cedar Creek","Object Shape":"Cigar, Cylinder, Egg","Source":"MUFON","Case Number":"10001","Log Number":"US-03212008-0004"}