{"Latitude":"41.086073","map":"<A HREF = \"http://maps.google.com/maps?q=41.086073,+-85.133521(10015)&iwloc=A&hl=en\"> mufon case (10015) map </A>","Log Number":"US-03232008-0002","Case Number":"10015","Object Flight Path":"Straight-line path","Weather Factors":"Does Not Apply","Source":"MUFON","Object Features":"None, Dome","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around March 22nd 2008"],"City":"Fort Wayne","Date of the Event":"03/22/2008 10:03 UTC","Summary":"five disc shaped objects gliding through the night sky in a perfectly straight diagonal formation","Longitude":"-85.133521","Tags":"City","Sighting Duration":"00:00:20","Date Submitted":"03/22/2008 10:03 UTC","files":["/var/www/straped/mufon/html2text/10015.html.txt","/var/www/straped/mufon/mufon_json/10015.json","/var/www/straped/mufon/org/10015.html"],"Object Shape":"Circle, Disc","Disposition":"Insufficient Data","Region":"Indiana","divs":["Sighting DetailsMy girlfriend and I stepped out of her apartment to go to the store at exactly 9:56. Where she lives there is little light pollution. We headed out and walked down the sidewalk, there was a full moon tonight and I remember I was going to comment on how the night sky would be perfect for telescopes. I had looked up and there I saw 5 whitish discs in a diagonal straight formation. It was a perfect line. They must have been spread apart by 15-20 feet each. I dont know how high up they were but I know they were lower than any plane should be. I could see the under belly of these craft based on the little light in the area that was being reflected off. I flipped out and ran around the other side of my girlfriends car and grabbed her head and pointed her eyes toward the spot where I saw them. At that time they were gone. There were no lights and no sound. I was shaking so badly and my palms were sweating. I always have wanted to see something like that but now, I dont want it, Im scared and I wish there was an explanation..."],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States"}