{"Longitude":"-82.881234","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsApproximately October 1, 1973, My husband and I were home in St. Clair Shores, Michigan. My sister-in-law and mother-in-law pulled into our driveway and directed us to view an object in the sky. We looked up and saw a white light in the sky. It was not moving. It seemed quite large. We stood and watched it for a while. I called my neighbor friend from across the street over. The five of us stood and watched it. I got out my binoculars. I told my husband to get the telescope out from the garage and he set it up. We passed the binoculars around so that everyone could see. I called Selfridge Air Force Base and inquired about it. They knew nothing about it. Then I called the News station. First the reporter stated it was a weather balloon. I said that thing is not a weather balloon. I said we have a telescope set up with a camera ready to photograph the comet Kohoutek. I was surprised when the reporter's voice changed and he then told me. \"Yea, we don't know what it is, but we have it on film and it is big as a house\". I thanked him and hung up (I was surprised). Most people at that time were not familiar with the comet Kohoutek so I guess the reporter thought I was a scientist. (I wish we did actually have a camera on the telescope) We kept watching the light in the sky. We then noticed something happening. A red light descended from the bottom of the sphere, straight down. The red light then stopped and waited until the white sphere began disintegrating. When the much larger white sphere had completely disintegrated, the red light began proceeding in a somewhat southwesterly direction. Because I had completed a Meteorology course, I didn't believe it to be a weather phenomena. It made no sound at any time. We could not see anything else other than the large white light and the much smaller red light. Our thoughts were that a small vehicle had left a mother ship. The white specks falling to earth from the disintegrating white sphere did not fall to earth so that one could collect or inspect them. I watched the newspapers. Two weeks later (around October 11, 1973) I read of the abduction of Calvin Parker and Charles Hikson in Pascagoula, Mississippi."],"Tags":"City","Object Features":"None","Object Shape":"Sphere","Case Number":"10016","Date of the Event":"10/01/1973 12:00 UTC","City":"St Clair Shores","files":["/var/www/straped/mufon/html2text/10016.html.txt","/var/www/straped/mufon/mufon_json/10016.json","/var/www/straped/mufon/org/10016.html"],"Latitude":"42.4951","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.4951,+-82.881234(10016)&iwloc=A&hl=en\"> mufon case (10016) map </A>","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Disposition":"Unknown","Date Submitted":"10/01/1973 12:00 UTC","Log Number":"US-03232008-0003","Weather Factors":"Unknown","trends":["There have been 9 other sightings in St Clair Shores","There were no other sightings in St Clair Shores on or around October 1st 1973"],"Region":"Michigan","Summary":"Large white sphere stationary in sky, small red object decends then waits for white sphere to disintegrate. The red object then flys away."}