{"trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=37.970113,+-91.824383(10011)&iwloc=A&hl=en\"> mufon case (10011) map </A>","Object Features":"Undisclosed","Log Number":"US-03222008-0005","Longitude":"-91.824383","Source":"MUFON","Tags":"City","Case Number":"10011","Disposition":"Unknown","City":"Undisclosed","divs":["Sighting DetailsI went out by myself to get gas for my car at a near by gas station and decided to drive around for a little while afterward. I turned onto Lindbergh going south from Watson rd.( rt. 66)in sunset hills. Driving down Lindbergh I noticed some lights really low in the sky to the left of the road. At first I thought it was a helicopter and rolled down my window to listen and see if it was a helicopter. There was no noise whatsoever. It was just gliding slowly across the road. There were three white lights in a triangle on the bottom and around the edge there were all different colored lights strobing in a line around it. It must have been about 40 feet across if not more. I could not distinguish a shape just the lights. It went directly over my car and was only a couple hundred feet or less above me. I turned right onto a subdivision street to follow it but it was going north and the street I was on was going west. I turned around and got back on Lindbergh going north but it was already really far away and disappeared from sight. Other people must have seen it because it was so ridiculously low. I wasn't scared or anything I was really excited because I had never seen one before but am interested in the subject."],"Latitude":"37.970113","Summary":"UFO hovers low across street","files":["/var/www/straped/mufon/html2text/10011.html.txt","/var/www/straped/mufon/mufon_json/10011.json","/var/www/straped/mufon/org/10011.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"Missouri","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Date of the Event":"03/21/2008 10:50 UTC","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/21/2008 10:50 UTC"}