{"Region":"Illinois","Country":"United States","Latitude":"40.036426","Date Submitted":"01/06/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/10028.html.txt","/var/www/straped/mufon/mufon_json/10028.json","/var/www/straped/mufon/org/10028.html"],"trends":["There has been one other sighting in Maroa","There were no other sightings in Maroa on or around January 6th 2008"],"Log Number":"US-03242008-0006","City":"Maroa","Date of the Event":"01/06/2008 12:00 UTC","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.036426,+-88.957026(10028)&iwloc=A&hl=en\"> mufon case (10028) map </A>","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-88.957026","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere","Viewing Distance":"20 Feet or Less","Case Number":"10028","divs":["Sighting Details I arrived home from work around two am in the morning. As I stepped from my truck I caught the glimpse of a light that was in the northern sky above the tree line. It seemed to be at a distance so I didnt pay it much mind. As I walked to the front door of my home, the source of light was not so far away. It was actually just above the trees. I stepped onto my porch and the light then slowly from hovering above the tree, moved over to about ten feet from the porch and about ten feet from the ground. There was no noise, and I did not feel threatened in any way. The light just hovered there. As I stood there for approx. two minutes just looking at it, the object then began to emit a sound from it. It was a low tone. It was as if the object was playing music to me. It went from a low tone to a high tone, then back to the low tone. As It stood there trying to figure out what it was the object then began to change color as the tone it was emmiting began to change in pitch and length of tone. The object \"played\" the \"music\" to me for a period of time I did not make a note of. As I stood there listening, I raised my hand and tried to feel if there was any heat coming from it, It then made two bright glows of a light blue light the became silent. It hovered there for a few seconds then it darted into the night sky at a high rate of speed. I have no idea what it was nor what it was doing in my presence. I do believe in life out in the universe, and on other planets, and I would like to believe some other species was attempting to make some kind of contact with me however I was unable to understand within my own mind what had taken place. What ever or whom ever it was I am hoping for another meeting."],"Summary":"attempted communication with unknown glowing sphere that \"played music\""}