{"map":"<A HREF = \"http://maps.google.com/maps?q=34.38472,+-118.530865(10023)&iwloc=A&hl=en\"> mufon case (10023) map </A>","Date of the Event":"03/22/2008 08:07 UTC","files":["/var/www/straped/mufon/html2text/10023.html.txt","/var/www/straped/mufon/mufon_json/10023.json","/var/www/straped/mufon/org/10023.html"],"Case Number":"10023","Tags":"City","Disposition":"IFO","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was grilling some thicks steaks on the bbq, well I was staring at the stars enjoying the cool breeze on a beautiful evening. as I stood there I saw what I thought to be a shooting star or some type of satellite. The dot of light came from behind a stand of trees so it was seen suddenly,and caught my eye, my first reaction or thought was an aircraft but it did not have marker lites. Just a single point of intense light. I was able to call for my wife and daughter and we all stood and watched the object cross the skyline west to east and fade into the distance in around 12-14 secs. The object looked like a very bright star and appeared to be in the outer atmosphere. The object was silent,and moved with intent,meaning that it did not appear to be in a orbit. In fact, before the steaks were done I had the family outside twice more looking at some run of the mill satellites, and a high altitude jetliner for comparison. In comparison the other two satellites were a fraction of the speed, but they were traveling south to north."],"Longitude":"-118.530865","Region":"California","Country":"United States","Log Number":"US-03242008-0001","Object Shape":"Star-like, Other","Weather Factors":"None","Object Features":"None","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around March 22nd 2008"],"Latitude":"34.38472","City":"Santa Clarita","Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"dot of light crossed sky west to east at highrate of speed silently or so high you could not hear it.","Date Submitted":"03/22/2008 08:07 UTC"}