{"City":"Everett","Viewing Distance":"Unknown","Source":"MUFON","Region":"Washington","Tags":"City","Date Submitted":"09/10/1968 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/10025.html.txt","/var/www/straped/mufon/mufon_json/10025.json","/var/www/straped/mufon/org/10025.html"],"Latitude":"47.982485","Disposition":"Unknown","Case Number":"10025","Summary":"round and glowing","Date of the Event":"09/10/1968 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-03242008-0003","divs":["Sighting DetailsMy friend and I were playing around in my back yard and he saw it first and told me to look up. When I did I saw just the bottom of it and it had 6 circles of mixed colors swirling around and a seventh circle in the middle of it doing the same thing. It must have have been the engines on it. It was about 1,000 feet in the air and it was heading north and it was a overcast night and I could see it clearly. I know what airplanes look like and helicopters look like and this was not either of them. It made no sound at all. And about 10 minutes later these 4 fighter jets came streaking over going the same direction as the UFO was going. I think that they were from Bainbridge Island, since that's the only naval base around the Everett area. Then after about 15 minutes the fighter jets came back over where I was standing going back south from where it had come from. Since that time I've been a believer in UFOs and have read several books on the subject. I wish back in 1968 there would have been the internet so I could have told somebody about it back then. To this day I really don't say too much about it because people may think I'm crazy, but I do believe in them. Now where them come from who knows?"],"Object Shape":"Circle","Longitude":"-122.199569","trends":["There have been 30 other sightings in Everett","There were no other sightings in Everett on or around September 10th 1968"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.982485,+-122.199569(10025)&iwloc=A&hl=en\"> mufon case (10025) map </A>"}