{"Object Shape":"Sphere, Star-like","Longitude":"-79.238223","Disposition":"Unresolved","Sighting Duration":"00:05:00","Country":"Canada","Region":"Ontario","Case Number":"10030","divs":["sighting detailsi was photographing the daytime sky on my back deck, pointing the camera towards the south-west\\western area of the sky from st. catharines, ontario which is in the eastern time zone. i did not notice this object while initially photographing, and probably could not have found it with the naked eye even if i had been trying, the sun was extremely bright and caused massive glare. once i seen i had caught it on the camera, i went back and took 4 more pictures, and the final one while trying to get the object without the sun within the picture. i did a little research, and assumed what i was looking at was venus. i read you can apparently see venus always near the sun, but from what i read, venus should be west of the sun, not east, unless im mistaken. it appears to have a comet like tail pointing towards the sun, yet looks like it had moved in various pictures. the one photo where i tried to get the object singularly, without the sun in the background, shows what appears to be two tails pointing in different directions, and showed up much more faint without the sun within the picture. photo sn850079.jpg shows the object much closer to sun, almost hidden within the glare, yet it is still there, just a little south-south-east of the sun if one were to use the exact middle of the sun as a reference point. i don't believe this is any kind of unknown craft, descriptions i have read of the credible unknowns people have caught in film\\photographs, do not match up with what i caught in the photo. i assume it is some astronomical object that i am unaware of. i have included the 6 photographs compressed in a zip file, along with 2 of the raw images for people to see while browsing the site, without having to download the whole 16.6 mb. hopefully someone at mufon could shed some light on what celestial object i had caught in the photo. i was using a samsung s85 8.2 megapixel digital camera."],"Date of the Event":"03/23/2008 04:00 UTC","Object Flight Path":"Undisclosed","Latitude":"43.166624","Tags":"City","Viewing Distance":"Unknown","Summary":"I caught this object in 6 pictures while photographing the daytime sky at around 4pm EST on March 23, 2008.","map":"<A HREF = \"http://maps.google.com/maps?q=43.166624,+-79.238223(10030)&iwloc=A&hl=en\"> mufon case (10030) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10030.html.txt","/var/www/straped/mufon/more/10030_submitter_file1__SN850066.JPG","/var/www/straped/mufon/more/10030_submitter_file2__SN850077.JPG","/var/www/straped/mufon/mufon_json/10030.json","/var/www/straped/mufon/org/10030.html"],"Log Number":"CA-03242008-0008","Date Submitted":"03/23/2008 04:00 UTC","Source":"MUFON","City":"St Catharines","trends":["There have been 9 other sightings in St Catharines","There was one other sighting in St Catharines on or around March 23rd 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown"}