{"Object Flight Path":"Path then hovering","City":"Santa Fe","divs":["Sighting DetailsMy son and I watched a vertical contrail with a bright tip at the base hang in the western sky (just to the left of the setting sun), wondering if a plane or rocket was crashing to earth, as the bottom clearly was a self-luminous object. I have never seen a contrail at that strangely vertical angle, my attention was drawn by the unusual shape as I sat on the sofa facing a picture window I rarely look out of. The short contrail did not lengthen downward, but remained the same size, which made me realize that the object at the bottom was not crashing to earth. The upper part of the contrail faded very slowly (4 minutes or so), leaving the bottom star-shaped circle brightly self-illuminated at the bottom. This light remained unchanged for at least 5 to seven minutes until it was out of view due to the eastward rotation of the earth. The condos across from us eventually covered our view of the bright star-like object, which did not move or fade at all. I have seen some obvious UFOs in my lifetime. This sighting is just an unknown. I did not have the definite feeling or knowledge as in former sighting that this one was extra terrestrial. It is merely very strange, as I can not imagine a plane or missile falling towards earth only to come to an abrupt stop and then hover, nor a metallic weather balloon that would dangle from the bottom of a vertical contrail. The sun has now set. It is 7:32 as I finish writing this note to you. Thank you"],"Latitude":"35.696575","trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around March 24th 2008"],"Log Number":"US-03242008-0012","Summary":"vertical contrail with bright object at bottom as sun was setting","Disposition":"IFO","Object Features":"Unknown","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=35.696575,+-105.928639(10034)&iwloc=A&hl=en\"> mufon case (10034) map </A>","Viewing Distance":"Over One Mile","Case Number":"10034","Weather Factors":"Unknown","Date Submitted":"03/24/2008 07:02 UTC","Object Shape":"Circle, Star-like","Date of the Event":"03/24/2008 07:02 UTC","files":["/var/www/straped/mufon/html2text/10034.html.txt","/var/www/straped/mufon/mufon_json/10034.json","/var/www/straped/mufon/org/10034.html"],"Source":"MUFON","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-105.928639"}