{"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.35907,+-95.291522(10041)&iwloc=A&hl=en\"> mufon case (10041) map </A>","Log Number":"US-03252008-0006","Object Features":"Other","Summary":"It was at 6am on Sunday at the SE quadrant of the sky. I live on a hill with no trees and i called a neighbor","Case Number":"10041","City":"Tyler","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around March 23rd 2008"],"Date Submitted":"03/23/2008 06:00 UTC","Date of the Event":"03/23/2008 06:00 UTC","Object Shape":"Sphere","Latitude":"32.35907","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10041.html.txt","/var/www/straped/mufon/mufon_json/10041.json","/var/www/straped/mufon/org/10041.html"],"Longitude":"-95.291522","Country":"United States","divs":["Sighting DetailsThis neighbor, Kay lives near me. The people who have trees could not see it. When i returned to make a call, there were two of them. They were the size of a pencil eraser with a horizontal strip through them. I mean the literal size of an eraser on a pencil. I am a designer and an artist so i notice things around me. I looked up and this object was slowly moving to the West. When i returned from calling Kay, there were two of them. I returned to call Jeff Buford, whose mother had been a close friend of mine and had started KLTV, but Jeff couid not see them,, as he had many trees around his house but Kay saw them. I had always poopooed the idea of UFO's and felt that they were overly dramatized. I tried to call the paper and the television station but they were closed. When I read the article in the current issue of The Texas Monthly, I realized that something must absolutely exist. My late husband and I traveled the world and knew many people in various governments. Before he died, he had founded The East Texas Council of World Affairs. I have a corner of the Tyler Public Library of \"CURRENT EVENTS\" that I supply books. I also give Foreign Affairs and Foreign Policy to Library of Texas College, a black college that is sorely lacking for funds. I donate books & magazines to Gorman School and Christ Episcopal Church (which is building a new library) So I do have a certain validity. I donated all of my husbands books recently (over 600) to the Library of Rhodes College and my Library of some 3000 art books are going to The Tyler Museum of Art. I have made a specialty of Islamic Art and have lectured on it at The University of Texas at Tyler."],"Region":"Texas","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change","Tags":"City","Weather Factors":"None"}