{"Latitude":"40.560176","Log Number":"","Date Submitted":"01/04/2001 12:00 UTC","Longitude":"-85.598634","Weather Factors":"Unknown","Region":"Indiana","City":"Bloomington/ NewUnionvill","map":"<A HREF = \"http://maps.google.com/maps?q=40.560176,+-85.598634(1004)&iwloc=A&hl=en\"> mufon case (1004) map </A>","Summary":"triangular craft seen hovering noislessly over hwy","Tags":"City","trends":["there have been no other sightings in bloomington\\ newunionvill","This sighting has never been favorited."],"Case Number":"1004","Object Features":"Other","divs":["Sighting DetailsI saw a very unusual aircraft on my way home from work in the evening.3EFrom a distance, driving east on Indiana 45, I saw a bright yellow light witha white light, not as bright, next to it5Bon the same craft5Dhovering in the sky.There were tiny red lights on top, none on the belly.As Irounded a bend5Bbetween Bloomington and New Unionville, Indiana5D I saw that the craft was about 50 feet above treetop and crossing the roadright to left, directly overhead.I pulled off to watch and noticed othervehicles behind me had also done so.There was no noise - I rolled down my windowto listen - nothing.As the craft passed over my car, I got a good look at itagainst night sky light pollution from Bloomington - it was triangle-shaped,with a white light in each of the three wing tipsand appeared to be black incolor.A mile or so down the road, the snow looked blown across the road likedrifting. The rest of the roadway was clear.I thought copter at first, until Isaw the thing.Not like any I had ever seen.It seemed like when motorists hadpulled off to watch it flew away."],"Source":"MUFON","Date of the Event":"01/04/2001 12:00 UTC","files":["/var/www/straped/mufon/html2text/1004.html.txt","/var/www/straped/mufon/mufon_json/1004.json","/var/www/straped/mufon/org/1004.html"],"Country":"United States","Object Shape":"Triangle","Sighting Duration":"00:00:59","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Disposition":"Unresolved"}