{"Sighting Duration":"Undisclosed","Date of the Event":"08/18/2007 06:00 UTC","Country":"United States","Source":"MUFON","Summary":"Dark Brown Disc Appeared Between the Treeline Traveling in a Straight Path, no sound.","Log Number":"US-03262008-0006","Viewing Distance":"501 Feet - 1 Mile","Case Number":"10050","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Clinton Township","There were no other sightings in Clinton Township on or around August 18th 2007"],"Date Submitted":"08/18/2007 06:00 UTC","Longitude":"-74.881278","Object Flight Path":"Straight-line path","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=40.640935,+-74.881278(10050)&iwloc=A&hl=en\"> mufon case (10050) map </A>","Region":"New Jersey","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/10050.html.txt","/var/www/straped/mufon/mufon_json/10050.json","/var/www/straped/mufon/org/10050.html"],"Latitude":"40.640935","Tags":"City","divs":["Sighting DetailsMy brother and I were in his backyard by the pool by the barbeque grill when I noticed a movement in the corner of my eyes just about treeline level. the object was a dark brown disc shaped object with a raised center, but a smooth underbelly. the object was about a quarter mile away at an altitude of about 1,000 ft. The object was moving in a southerly direction at about 60 knots and made no sound. I quickly asked my brother to look up and tell me that i was seeing what I thought I was seeing. As he looked it was just going behind the top of a tre and then it was again visible for agbout five more seconds before disappearing again behind the tree line as it moved from right to left above the treeline. We both confirmed what we say as he also said it looked brown. My brother works for The Newark Star Ledger and is a Pulitzer Prize Winning Photo Journalist. Figures, we were at the grill and his camera was in the house on his desk. I wanted to wait for some time before I reported the event to be sure that I internalized what me and my brohter both saw that early evening. The event occured in broad daylight with partly cloudy sky's, it was NOT an airplane or blimp. I am a member of MUFON's newly formed STAR Team and am available to discuss the event further."],"City":"Clinton Township"}