{"map":"<A HREF = \"http://maps.google.com/maps?q=32.300989,+-81.23342(10052)&iwloc=A&hl=en\"> mufon case (10052) map </A>","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Sphere, Star-like","Date of the Event":"03/25/2008 05:20 UTC","Region":"Georgia","Longitude":"-81.23342","Log Number":"PR-03262008-0008","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsAt around 4:45am I awoke got dressed and left the house for an early breakfast,had an early flight back to the states.opened the car entry gate and re-locked it with a chain.The time now was approx. 5:10am,then proceded to cross Rt.115 a short distance to the bakery.I found it closed and would have to return at 6:00am.As I walked back,crossed the road and as I started to un-lock the chained gate I looked up at the stars,I was facing west looking out toward the ocean I noticed 2 bright objects that looked like stars traveling very fast one behind the other in a south-west direction.There size I would say slightly smaller than a dime at arms distance.I tried to capture a video from my cell but wasn't able to,I glanced at the time on the cellphone and it was 5:20am. The height was a little more difficult,still dark looking west,best guess would be 10000-15000 ft.,I watched in awe as they flew across and disapeared in the direction of Lajas,Cabo Rojo.An area known for sightings Later that morning after 7am I was telling my cousin what I had seen and the local morning news was reporting the incident and someone had managed to capture a video that was shown that morning. I would just like to add a few more details,there was no sound that i could tell.They were traveling very fast,I knew the moment I saw them what they were,I see aircraft flying into JFK-La Guardia all the time, the lights were to big and did not strobe.They flew in a straight line formation and were out over the ocean off the coast of Rincon,Corsega beaches as it dissapered into clouds as it reached the SE coast."],"Object Flight Path":"Straight-line path","Tags":"City","Case Number":"10052","trends":["There have been 4 other sightings in Rincon","There were no other sightings in Rincon on or around March 25th 2008"],"Disposition":"Unresolved","Latitude":"32.300989","files":["/var/www/straped/mufon/html2text/10052.html.txt","/var/www/straped/mufon/mufon_json/10052.json","/var/www/straped/mufon/org/10052.html"],"Summary":"Two very fast bright spheres traverse the early morning sky off the west coast of Puerto Rico","City":"Rincon","Sighting Duration":"Undisclosed","Date Submitted":"03/25/2008 05:20 UTC"}