{"Object Shape":"Flash, Oval, Star-like, Other","Longitude":"-123.717295","trends":["There have been no other sightings in Elk","This sighting has never been favorited."],"Latitude":"39.13041","Region":"California","Date of the Event":"03/26/2008 08:31 UTC","Case Number":"10059","divs":["sighting details3\\26\\2008 elk ca 8:31-2 pm checking my grill to see if i should throw the pork shoulder on yet, my dog began barking to the ne. she has a different bark for catching scent some wildlife out in the woods and for telling me that some one has arrived on the property. this bark was the latter, so it got my attention. i looked up from the grill to the ne at my barking dog, in the reflection of my truck windshield i see a bright white light, that began to fade out. i turned around to face almost due sw and caught the end half of the light fading nearly strait up in the air travelling almost due ne. silently. my initial thought was that i had just caught the end of an irridium sattelite flash. as just as i was thinking how fortunate i was to have seen even the end half of an irridium flash by sheer chance, it got bright again. very bright. almost to bright to look at. a few seconds later it began to fade and i had mild light spots in my vision.(not sure what their called but like when you look at the sun, only not as intense). i was a bit enthralled with this light so it didn't occur to me to look down and see if i could see the light on the ground, but it was far brighter than anything i've ever seen in the sky. when it pulsed it dimmed to an orange-ish light as when a sodium halide light is turned off. the light's shape was an uneven oval, the long arc on the left side was like a soft angle rather than a curve. it took longer to fade out than fire up and i watched it pulse 6-8 times before it sank below my fairly proximal tree line. i watched it 30 - 40 seconds. my dog only barked when it was lit up bright and did this for about 70 seconds after it went out of sight. the tree line is about three hundred feet from me and i'd estimate about a 45 degree angle from my vantage. i couldn't make an estimate of how high in the sky it was being near dark and no noise to judge by. but it moved about the same speed as the coast guard helicopters do when they fly over at about 4-6000 feet (with significantly more noise of course). it flew in a strait line, due ne never changing trajectory or velocity that i could detect. the pork shoulder was uneffected by all this and delicious."],"City":"Elk","map":"<A HREF = \"http://maps.google.com/maps?q=39.13041,+-123.717295(10059)&iwloc=A&hl=en\"> mufon case (10059) map </A>","Source":"MUFON","Date Submitted":"03/26/2008 08:31 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Object Flight Path":"Straight-line path","Log Number":"US-03272008-0001","Country":"United States","Object Features":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/10059.html.txt","/var/www/straped/mufon/mufon_json/10059.json","/var/www/straped/mufon/org/10059.html"],"Sighting Duration":"00:00:40","Summary":"VERY bright gradually dimming pulsing white light. Oval. Silent. about 5-6 seconds per pulse."}