{"Weather Factors":"Unknown","Case Number":"10056","Log Number":"US-03262008-0012","Disposition":"Unknown","Tags":"City","Object Shape":"Star-like","Latitude":"34.934255","Summary":"very bright star-like","Object Features":"Undisclosed","City":"Corinth","Viewing Distance":"Unknown","trends":["There has been one other sighting in Corinth","There were no other sightings in Corinth on or around March 26th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsIt was about 8:25 in the PM. Not a cloud in the sky. It was very bright, brighter than any of the stars at that time, as bright as any star or planet I've ever seen. It was at pretty high altitude, I'd guess at least 10,000 ft & moving slowly, about the speed of a slow moving commercial jet. But it was a warm white light, like a star, with no red beacon light & no flashing strobe like a normal airplane. Also, it was heading south to north, which I never see airplanes go in the skies here. Also, airplanes heading away from you do not look like bright stars. After it went out of sight an airplane crossed its path at a similar altitude, which was a great reference because you could clearly see that the lights were totally different, as well as the UFO was going much slower. Also, the UFO made a couple of abrupt turns, about 20-30 degrees each, in a way that airplanes & helicopters can't. It also seemed to slow down almost to a stop at one point, then sped up again. It also went from very, very bright to extremely dim, almost out, then back to very, very bright. And there is not a cloud in the sky, which you can see from the satellite image I just got from the Weather Channel's website (see attached). It also didn't make a sound, which is not unusual, but several planes flew over within a few minutes & 2 out of 3 were easily heard. And it was very, very quiet out here. One other thing, is that it sometimes it seemed to leave a small brief trail of smoke or vapor behind it, but I thought that was maybe a trick of my eyes. But then I watched that plane fly through the same area a couple of minutes later & it didn't do that. I've watched the skies extremely carefully for about 20 years, I can tell the difference between a plane, a helicopter, a balloon, a shooting star, a satellite, weather, etc. This didn't fit into any of the normal categories. I'm not saying this was aliens, but it was unidentified, flying, & an object, hence the term UFO. Also I have only had one-third of one beer! Anyway, I just wanted to write down all of the details while they were fresh in my mind."],"Object Flight Path":"Undisclosed","Longitude":"-88.52227","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/10056.html.txt","/var/www/straped/mufon/more/10056_submitter_file1__timeofufo.jpg","/var/www/straped/mufon/mufon_json/10056.json","/var/www/straped/mufon/org/10056.html"],"Date Submitted":"03/26/2008 08:25 UTC","Date of the Event":"03/26/2008 08:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.934255,+-88.52227(10056)&iwloc=A&hl=en\"> mufon case (10056) map </A>","Region":"Mississippi","Sighting Duration":"Undisclosed"}