{"Sighting Duration":"00:00:10","divs":["Sighting DetailsI often sit on my patio watching for shooting stars. I live right in line of Moffet Field's landing approach and enjoy watching the planes coming in for landing. So, I've seen just about every type of plane, helicopter, you name it. Anyway, I was starring up and all of the sudden a craft appeared coming from the West direction. It had two white lights that seemed to be the front and rear. If I had to descrive the dark body it would be like a tear drop or figure eight shape. I would estimate that it could have been anywhere from 3 to 5 thousand feet in altitude based on two plane in the area as well, which I used as a reference point as the object flew by. It was traveling at least 3 to 5 times faster than anything I've seen coming into moffet or even into San Jose, Oakland or SFO. And I watch a lot. It had absolutely no sound and I watched it for about 10 seconds until it traveled too far east and out of my sight. Very cool indeed. This is my fifth siting in my life and the best one yet. I 've had one sighting Phoenix (not the famous lights like you always hear about) about 8 years ago, two sighting in Santa Clara, and two here in Sunnyvale. The one tonight was by far to most exciting."],"trends":[],"Log Number":"US-03272008-0003","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"10061","Disposition":"Hoax","Date Submitted":"03/26/2008 09:25 UTC","Date of the Event":"03/26/2008 09:25 UTC","Region":"California","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10061.html.txt","/var/www/straped/mufon/mufon_json/10061.json","/var/www/straped/mufon/org/10061.html"],"Longitude":"-119.409082","Summary":"Two lights that had consistant spacine, maybe front and rear light of a craft","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.787211,+-119.409082(10061)&iwloc=A&hl=en\"> mufon case (10061) map </A>","Viewing Distance":"Unknown","City":"Undisclosed","Country":"United States","Latitude":"36.787211","Object Shape":"Other","Weather Factors":"Unknown"}