{"Region":"Colorado","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Country":"United States","Latitude":"39.376082","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10060.html.txt","/var/www/straped/mufon/mufon_json/10060.json","/var/www/straped/mufon/org/10060.html"],"Object Features":"None","Log Number":"US-03272008-0002","Date of the Event":"03/26/2008 08:00 UTC","Tags":"City","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.376082,+-104.85023(10060)&iwloc=A&hl=en\"> mufon case (10060) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around March 26th 2008"],"Longitude":"-104.85023","City":"Castle Rock","Summary":"I watched it fly past my house at about the same altitude as air traffic","divs":["Sighting DetailsI was sitting in my couch near a back window, which is my normal sitting spot. I sit there because I always look out the window at birds, airplanes, etc. and the window sill makes for a good place for me to set my coffee, phone, remotes, etc. as we have no end tables. I looked up and watched as this strange white light crossed the sky moving from west to east on the south side of my home, about 1-2 miles south. At first I noticed that it was a constant light and wasn't strobing like the airplane traffic that usually crosses. So I thought well I guess its a sattelite or something, but it was very bright and clear and didn't look like it was at a very high altitude. I grabbed my binoculars which hang on my coat rack (I frequently watch military traffic to and from Ft Carson, as I'm a veteran and find such things interesting). I went out on my back deck to look with the binoculars. Again even through my high quality binoculars, all I could see was a solid white light, but also saw two aircraft in the same area with their blinking lights as usual. I called to my wife to come out and look at it, of which she did. She too, could only see a white light and being somewhat ignorant to anything that fly's failed to see anything strange about this solid white light. Even after seeing other aircraft with blinking lights around it. It then began to travel slightly north and was obscured by the corner of our house. I then ran to the front of the house and was able to see it again. I would guess it was about 3-4 miles (to the east) away by now. As I watched it, it turned almost directly north bound at a 90degree turn, I estimate the speed was 300-400MPH during the entire flight that I saw. After the turn it continued to fly at the same altitude (this never changed). I began to second guess myself because I thought it was an airplane on approach to land at Centennial airport (even though it had just made a 90 degree turn at high speed). Just as I was about to dismiss the thing as some strange sattelite or something, it just dissappeared in front of my eyes as I watched it through the binoculars. Very, very, strange. I noticed that my neighbors across the street were still working in their backyard, which faces that direction, and asked them if they saw it, but unfortunately they were doing yard work and had their noses in the dirt. I don't know what to make of this but it is strange. About 30 minutes later I called my friend in Grand Junction Colorado (300 miles west) to confirm our elk hunting plans as our applications are due in a few days, and his wife had seen the very same looking object not more than about 20 minutes earlier heading east. I don't know if its coincidence, but I'm very interested in hearing if anyoneelse has seen this thing today. As for describing my \"reactions, feelings, ect\", I had an amazing UFO experience about 10 years ago way more remarkable that scared the hell out of me, but I just don't know what to make of this one. It didn't look at all like what I saw 10 years ago, but all I could see was the light, but even that was a different color than last time. I'm just really interested in what this could be. I even referenced to see if NASA had something going on and almost thought I had it, but the shuttle landed before this happened. Has anyone reported anything similar today?"],"Case Number":"10060","Date Submitted":"03/26/2008 08:00 UTC","Object Flight Path":"Path with directional change"}