{"divs":["Sighting DetailsI was looking out my garage window (looking west to east)and a triangular object just appeared in my line of sight. It had 5-6 lights, was slightly tilted (which enabled me to see the triangular shape)and appeared to be much larger than an aircraft. My view was not obstructed in any way. It slowly moved from south to north for approx. 2-3 miles and then just disappeared. Right before it disappeared, it moved slightly toward some bare trees that are a block over from my home. I could still see it clearly through the branches. There is a municipal airport in that direction, so I am VERY used to seeing small aircraft, plus I live in the DFW area, so I also see a lot of commercial aircraft as well. I have been a radiographer (x-ray technologist)for 11 yrs. which requires me to be a keen observer. I also have perfect vision. There was no mistake! It had too many lights, and the lights were not in the same places as they would be on a conventional aircraft. When the craft disappeared, I immediately stood up and began to look for it, it was gone. It almost seemed like it turned in on itself. I wasn't going to report this, but after thinking about the importance of it all, I decided to go ahead."],"Log Number":"US-03272008-0007","trends":["There have been 43 other sightings in Arlington","There was one other sighting in Arlington on or around January 11th 2008"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/10065.html.txt","/var/www/straped/mufon/mufon_json/10065.json","/var/www/straped/mufon/org/10065.html"],"Latitude":"32.741387","Case Number":"10065","Object Features":"None","Viewing Distance":"Over One Mile","City":"Arlington","map":"<A HREF = \"http://maps.google.com/maps?q=32.741387,+-97.098276(10065)&iwloc=A&hl=en\"> mufon case (10065) map </A>","Object Shape":"Triangle","Date of the Event":"01/11/2008 08:30 UTC","Date Submitted":"01/11/2008 08:30 UTC","Country":"United States","Longitude":"-97.098276","Object Flight Path":"Straight-line path","Tags":"City","Disposition":"Unknown","Source":"MUFON","Summary":"triangular shape with 5-6 lights appeared and then seemed to disappear","Region":"Texas","Sighting Duration":"00:00:06"}