{"files":["/var/www/straped/mufon/html2text/1007.html.txt","/var/www/straped/mufon/mufon_json/1007.json","/var/www/straped/mufon/org/1007.html"],"Disposition":"Unresolved","City":"Brooklyn Park","Sighting Duration":"00:05:00","Log Number":"","Object Shape":"Triangle","Date of the Event":"12/05/2000 07:35 UTC","Country":"United States","Region":"Minnesota","Weather Factors":"Unknown","Date Submitted":"12/05/2000 07:35 UTC","Summary":"Brooklyn Park, MN Triangle CE1 - 05DEC2000","Longitude":"-93.35634","divs":["Sighting DetailsNarrative from CL Investigation Report:The witnesses (father and daughter) were driving home from an event thatevening, and had just turned south onto Noble Ave. N. in Brooklyn Park, from85th St. At 7:40 PM, as they were approximately two blocks south of 85th St.,The daughter noticed a large dark object high in the sky, near the moon. Sheobserved it for a second or two. On seeing the shape of the object close to themoon, she concluded that it was not an ordinary aircraft, and called herfathers attention to it.The father looked up and also observed the object. He described the object asbeing high in the windshield, making it somewhat awkward to look up at it. Hecontinued to look up at the object, and pulled the car over to the edge of theroad (Noble Ave N.), and they both continued to watch further. As they watched,the object moved from right to left, with a slight motion to the north (behind)as well. Upon pulling over, both witnesses also observed a small momentaryleftward \"twitch\" or \"jog\" in the objects flight path, which then continuedmoving smoothly and slowly on its right-to-left path. The initial angle of elevation of the object put it at, or slightly above thetop of the windshield. The object moved slowly from high in the south towardthe East Northeast. Both witnesses described the object as passing nearlydirectly overhead. The father moved his head forward until his nose was nearlytouching the glass, looking straight up through the windshield He then lookedup through the drivers side window as the object appeared on the left side ofthe car. As they watched, the object moved high overhead, passing nearly directly overtheir car. They continued to watch the object as it moved off to the east northeast, and receded into the eastern sky. At a point where it was low in theeastern sky, a dark object associated with the lights was visible against adistant group of clouds. It was still visible low in the east-northeast at the time the father pulled thecar back out onto the road, and they continued toward home. They bothestimated that they had observed it for approximately one minute. The flight motion of the object was described as slow, smooth and continuous,with the possible exception of a slight momentary \"jog\" (to the left a distanceof approximately 2 centimeters at arms length) at the moment in which theypulled to the side of the road. This was observed by both witnesses. The fatherindicated that at the time he thought that this might have been due to the cartires bumping against the curb. Following the momentary \"jog\" flight path thencontinued smoothly to the east-northeast.The object was described as triangular, slightly longer than it was wide. Ateach vertex, there was a yellow to amber light (about the color of a flashlightwith the battery depleted), which the father described as being slightly lessthan 10 times the brightness of the brightest visible star. The lights were adifferent color than those of a commercial aircraft, and the father felt thatthey were dimmer."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.094132,+-93.35634(1007)&iwloc=A&hl=en\"> mufon case (1007) map </A>","Latitude":"45.094132","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in Brooklyn Park","There were no other sightings in Brooklyn Park on or around December 5th 2000"],"Case Number":"1007"}