{"Date of the Event":"03/28/2008 12:35 UTC","divs":["sighting detailsit was about 12:30am and i stepped outside to smoke a cigarette while i waited for a phone call. i noticed a light in the distance. at first i thought it was a plane but i realized that it remained stationary rather flying toward the tampa airport. as i watched more closely i could see lights blinking red, blue, white and green very quickly. the shape seemed to be circular because of the lights, but (i'm not sure why)i thought the overall shape or configuration of the \"craft\" was box-like. (sorry if that doesn't make sense.) i started taking pictures. my hand is not always completly steady so i tried to zoom closer. then i decided to walk to the wood fence surrounding my house to rest the camera on top to keep it steady to hopefully get a better picture (closer and no blur.) several minutes had passed and the object stayed in the same position and continued to flash the colors. i had returend to the backdoor of my house. while i took a few more shots and a mosquito started to bother me so i stepped inside and closed the screen door. i decided to look at the object through a pair of binoculars. (i think this is really weird.) i guess the screen between the binoculars and the object had some sort of effect because now the object and lights were in a straight line. i could pretty much make out the shape of a rectangular object with three larger lights spaced and smaller blinking\\flashing lights in between. i tried to take pictures through the screen but they did not show anything but the screen for the most part. when i stepped outside again the object was still the original circular\\box shape. about twenty-five minutes had passed and the object seemed to very slowly move away into the distance. i tried to take photos with my pentax k1000 but not sure if those will turn out because of the darkness and i had no light to even view my depth of field measurements, etc. when i wanted to take pictures with digital camera again the object was gone. this occured in land o lake, fl around 12:30am march 28, 2008 and lasted roughly thiry minutes."],"Date Submitted":"03/28/2008 12:35 UTC","Source":"MUFON","Object Flight Path":"Undisclosed","Tags":"City","Longitude":"-82.454924","Latitude":"28.228759","Log Number":"US-03282008-0002","files":["/var/www/straped/mufon/html2text/10074.html.txt","/var/www/straped/mufon/more/10074_submitter_file1__March2801a.JPG","/var/www/straped/mufon/more/10074_submitter_file2__March2801b.jpg","/var/www/straped/mufon/more/10074_submitter_file3__March2803b.jpg","/var/www/straped/mufon/mufon_json/10074.json","/var/www/straped/mufon/org/10074.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.228759,+-82.454924(10074)&iwloc=A&hl=en\"> mufon case (10074) map </A>","Disposition":"Insufficient Data","Object Shape":"Undisclosed","trends":["There have been 8 other sightings in Land O' Lakes","There was one other sighting in Land O' Lakes on or around March 28th 2008","This sighting has never been favorited.",""],"Summary":"Third (possible) UFO sighting within about ten days","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Florida","Case Number":"10074","Object Features":"Undisclosed","Country":"United States","City":"Land O' Lakes","Weather Factors":"Unknown"}