{"Case Number":"10077","Tags":"City","Object Features":"None","Summary":"Light moving across sky, turning at right angles, zooming away","Weather Factors":"Unknown","Date Submitted":"06/15/1977 09:00 UTC","files":["/var/www/straped/mufon/html2text/10077.html.txt","/var/www/straped/mufon/mufon_json/10077.json","/var/www/straped/mufon/org/10077.html"],"Log Number":"US-03282008-0005","Source":"MUFON","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Region":"California","trends":["There have been 26 other sightings in Pasadena","There were no other sightings in Pasadena on or around June 15th 1977"],"Sighting Duration":"Undisclosed","Latitude":"34.155295","Disposition":"Unknown","Date of the Event":"06/15/1977 09:00 UTC","City":"Pasadena","Country":"United States","divs":["Sighting DetailsA friend and I were laying out by his pool in lounge chairs looking up at the sky talking about stars when both of us noticed a plane flying overhead at high altitude moving East, nothing new in LA. Then the light just stopped dead and we both said, \"Whoa, did you see that?\" It abruptly began moving again at a right angle to it's previous course. I think it headed south a little, then without changing velocity another right angle turn headed East again. At this point another plane approached from the East, now that both were in the sky together we could see that this new plane really was a plane as it had the typical blinking lights, red and green lights of a plane. The other light was just white. As the \"real\" plane approached the white light, the white light just blinked out. At first we thought it went behind a cloud, but there were none in the sky. The real plane flew on a steady course to the West. After about ten seconds, the white light blinked on again and moved around in a pattern of right angle turns and then it took off at an amazing rate of acceleration, quickly disappearing. My friend and I were stunned, we talked about what it could have been and nothing made sense. It was too high and to fast for a helicopter, turned too quickly for a plane or satellite. We ere a little freaked out by it all."],"Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=34.155295,+-118.137026(10077)&iwloc=A&hl=en\"> mufon case (10077) map </A>","Longitude":"-118.137026"}