{"Date of the Event":"03/28/2008 09:15 UTC","Viewing Distance":"Unknown","Date Submitted":"03/28/2008 09:15 UTC","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.491647,+-86.126833(10080)&iwloc=A&hl=en\"> mufon case (10080) map </A>","Longitude":"-86.126833","Disposition":"Unknown","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around March 28th 2008"],"Object Features":"Unknown","Log Number":"US-03282008-0008","divs":["Sighting DetailsI was driving west on Southway Boulevard. As I approached the intersection of Southway and U.S. 31 I noticed three bright, orange lights in the western sky in front of me. They were just above the treetops. The time was 9:15 P.M. I first saw one light. Then a second one developed and grew brighter. Finally a 3rd one developed and grew brighter. They were approximately the size of a baby aspirin at arms length. They were all steady for a brief moment and then one by one, they each sorta faded into the darkness and disappeared. It happened rather fast, a little less than a minute. I quickly drove to the post office parking lot where I could get a better look. As I drove, keeping my eyes on the spot where I saw them last, I saw one more light flash on for a second or two and then it faded into the night like someone dimmed the switch. It was VERY odd how it faded into nothingness from this immensely bright light. Just prior to my leaving the house for the Post Office, I noticed that my two outside dogs, A blonde lab and a golden retriever, were barking like maniacs at something outside. Even the inside dogs were hysterical. And so were the birds. (I have several pet birds) Now I wonder if it had something to do with these lights as they would have been clearly visible from my house and I know the last time I saw them, I saw them at about 7:45 PM and then my friend saw them at like 8:30 or quarter till 9, so I know they hang around for a while when they show up. I sure would like to know what they are. They are ABSOLUTELY NOT an airplane or anything I have EVER seen before. The weather was nice. Sky was clear and stars were abundant. The temp was cool, approximately 36 degrees. And P.S. Jerry: Abbe said she was sorry she hasn't gotten back to you yet but she was planning on it."],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Object Shape":"Circle","City":"Kokomo","Source":"MUFON","Latitude":"40.491647","files":["/var/www/straped/mufon/html2text/10080.html.txt","/var/www/straped/mufon/mufon_json/10080.json","/var/www/straped/mufon/org/10080.html"],"Summary":"Bright orange balls of light in western sky AGAIN tonight","Case Number":"10080","Weather Factors":"None","Region":"Indiana"}