{"Region":"Oregon","Country":"United States","Object Features":"Unknown","Object Shape":"Undisclosed","Date of the Event":"03/27/2008 12:00 UTC","trends":["There has been one other sighting in Gold Beach","There were no other sightings in Gold Beach on or around March 27th 2008"],"Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsWe were at the beach having a bonfire the sky was clear it was about 8:30 or 9 pm, and I was looking up at the stars. I noticed the small red looking light (star?) and thought that it started moving. Then I noticed it was areally bright light that was moving not the red light. It was moving northward and it seemed to be moving pretty fast. I had everyone look up and we were trying to figure out what it was and as it was moving across the sky heading to the north it quickly changed directions and started moving eastward, it didnt turn it moved quickly to the east and we continued watching it as it dissapeared into the sky it appeared to disapear into the stars I watched it untill it could no longer be seen. we all deducted that it moved too fast and changed direction to fast to be a plane also it was such a bright white light. We all tried to come up with a logical answer to what we were seeing but all we could figure out is what it wasnt a plane, a sattelite, a comet...... would love to know what it was"],"Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Latitude":"42.407333","Longitude":"-124.421774","Case Number":"10082","City":"Gold Beach","map":"<A HREF = \"http://maps.google.com/maps?q=42.407333,+-124.421774(10082)&iwloc=A&hl=en\"> mufon case (10082) map </A>","Log Number":"US-03282008-0010","Weather Factors":"Unknown","Date Submitted":"03/27/2008 12:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10082.html.txt","/var/www/straped/mufon/mufon_json/10082.json","/var/www/straped/mufon/org/10082.html"],"Summary":"bright light moving fast northward"}