{"City":"Culver","Country":"United States","Region":"Indiana","trends":["There have been 5 other sightings in Culver","There were no other sightings in Culver on or around March 28th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.225622,+-86.418055(10084)&iwloc=A&hl=en\"> mufon case (10084) map </A>","Latitude":"41.225622","Object Features":"Unknown","Weather Factors":"None","Log Number":"US-03292008-0002","Date of the Event":"03/28/2008 09:14 UTC","Date Submitted":"03/28/2008 09:14 UTC","files":["/var/www/straped/mufon/html2text/10084.html.txt","/var/www/straped/mufon/more/10084_submitter_file1__9948_report_file2__MOAMap.jpg","/var/www/straped/mufon/mufon_json/10084.json","/var/www/straped/mufon/org/10084.html"],"Tags":"City","Case Number":"10084","Viewing Distance":"Unknown","divs":["sighting detailsi was sitting watching tv joking with my husband how it was such a clear night to be ufo watching. (yes, we are going to start doing this since i have been seeing unexplained objects in our skies lately!)i was standing at my big window when i saw one bright orange light in the sky that sharply turned right (my left)or i guess it would be east. i didn't say a thing to my husband until it came back a second time in the same location. i gave my husband the strangest look as he was sitting on the couch. he told me that i was seeing things and that these things would not come back a second time!!(first occurrance was on march 6th at 8:02p sharp). he got up and couldn't believe his eyes. shortly after the first 2 orbs just towards the west we saw a linear line of 4 lights just above tree top height. these lights came on one at a time and dimmed one at a time but were much closer together and not as bright reddish\\orange this time. (as the march 6th incident). i would say that the lights\\orbs looked much different and acted much different almost as if it was a coverup. i was not scared by these lights. nothing really eerie about them. i called my sister north in rochester as i was outside this time watching these things. she was on her cell phone and walked outside as i was telling her to see these things. she said \"oh my god! i see three lights. they look like head lights on a car in the sky.\" as i watched these lights come and go they moved fairly slowly towards the east. i did notice a huge amount of jets in the skies this time but no sounds whatsoever. the incident only lasted maybe 15 minutes. if it's a clear night tonight, you bet i'm going to be watching the skies. if you are in northern indiana, i suggest that you do too. i need to know what these things are!! who is doing this and confusing the public. or is this a governmental cover up? what i saw on march 6th does not compare to these lights at all!!"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"Saw orange orbs in Culver's skies again last night!!!","Longitude":"-86.418055","Object Shape":"Fireball","Source":"MUFON","Object Flight Path":"Straight-line path"}