{"Country":"United States","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/10086.html.txt","/var/www/straped/mufon/mufon_json/10086.json","/var/www/straped/mufon/org/10086.html"],"Tags":"City","Object Features":"Other, Unknown","Disposition":"Unknown","divs":["Sighting DetailsI went out back to have a smoke and looked up and saw a dimely lit uneven triangle with about 8 to 10 lights moving to fast to be anything that it could have been. What I mean about uneven is that one side had 7 lights and the other side had 2 or three lights. It moved left a little then back right but the other parts of it as the center moved kept perfect pace with it. But the other parts moved around and back and forth but made the exact turns that the center did. Then it was just too far away too fast to see anymore. It was unbelievable. Beind my house is a flight path for airplanes and I see them constantly. There were also planes around that looked as if they were standing still compared to the speed that this or these things had. There were no clouds last night so I know it wasn't what my wife said it was when I told her, A light... I know better!!! With it moving so fast, there would have never have been time to photgraph it. I know someone else in the area had to see it. It was like it was following the river the way it was moving. There is an Airport reallt close to my house. They had to see it on radar!"],"Object Shape":"Triangle","Region":"Pennsylvania","Summary":"Uneven triangle moving very fast moving around and making weird turns but following the lead light","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.353547,+-79.857685(10086)&iwloc=A&hl=en\"> mufon case (10086) map </A>","Case Number":"10086","Date of the Event":"03/28/2008 11:40 UTC","Log Number":"US-03292008-0004","Longitude":"-79.857685","Latitude":"40.353547","City":"McKeesport","Date Submitted":"03/28/2008 11:40 UTC","Source":"MUFON","trends":["There have been 7 other sightings in McKeesport","There were no other sightings in McKeesport on or around March 28th 2008"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None"}