{"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"Unknown","Disposition":"Unknown","Latitude":"27.508627","Case Number":"10085","Region":"Texas","Date of the Event":"03/27/2008 09:30 UTC","Summary":"Blinking lights move South then North.","map":"<A HREF = \"http://maps.google.com/maps?q=27.508627,+-99.506442(10085)&iwloc=A&hl=en\"> mufon case (10085) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Path then hovering","Longitude":"-99.506442","Date Submitted":"03/27/2008 09:30 UTC","trends":["There have been 21 other sightings in Laredo","There was one other sighting in Laredo on or around March 27th 2008"],"files":["/var/www/straped/mufon/html2text/10085.html.txt","/var/www/straped/mufon/mufon_json/10085.json","/var/www/straped/mufon/org/10085.html"],"City":"Laredo","Tags":"City","divs":["Sighting DetailsI tried to make a video but was unable. Same spot as last time. Mines Rd. North of Laredo. At 9:00 I was watching the sky just below the Big Dipper. I had binoculars, Night Vision Goggles, and my Camera. At 9:30 the lights just kind of \"Appered\" in that area. I didn't see them move into the area. There were three or four. One would blink four or five times, then one or two would blink. The lights started moving South for a bit. then stay in one place. They moved around each other almost a circule. The movment looked very slow and because the lights were dark more than not it was hard to track. After four minutes from first sighting they started moving North at the same speed and disapeared from my veiw. On 3-28-08 I was unable to see them BUT after about an hour of looking, Not stedy jusy looking when I could, I came apon an Oilfield truck stopped on the road. The driver asked me what those lights were? I asked were he saw them and he pointed at the area of the Big Bipper and said, Six blinking lights, over San Antonio. San Antonio is North of us about that dirrection. He then said, If anyone asks me I'll say I saw an Oilrig Flair. He did NOT want to give me his name. Later one of my co-workers said he saw them too. He asked me outright if I thought they were UFOs. Well they are Unidentified, Flying and Objects. He tried looking at them with a thumal camera but they didn't show up. He also did NOT want to make a report. Once again I'm only trying to add a dot of info to anyone elses report. Almost missed adding this. Oilfield worker said one object had emited a blue \"Flaim\" like tail for a few seconds."],"Log Number":"US-03292008-0003"}