{"Region":"Indiana","Date of the Event":"04/30/1967 12:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"04/30/1967 12:00 UTC","Source":"MUFON","Summary":"you could see the curve of lthe craft and it had windows with a redbackground and silohuetted figures moving about.","Tags":"City","Latitude":"41.591412","Object Flight Path":"Straight-line path","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/10087.html.txt","/var/www/straped/mufon/more/10087_submitter_file1__Craft1967.JPG","/var/www/straped/mufon/more/10087_submitter_file2__BHilllObject.jpg","/var/www/straped/mufon/mufon_json/10087.json","/var/www/straped/mufon/org/10087.html"],"Log Number":"US-03292008-0005","divs":["Sighting DetailsI was a supervisor in a iocal rubber factory (Goshenb Rubber Co.)when a employee (Dick Dance) who was on supper break, called me outside to look at what was coming toward us. Due to the bright security lights outside the shop we could not see the whole shape of the craft. What we did see was part of a circle with solid windows or openings in it. There was a red background light inside the craft. While we watched we could see several silohuetted figures moving about, one even looked over the railing edge and appeared to be looking in our direction. Whatever it was was moving along at a leisurely pace of approximately 10 MPH. and approx. 200 ft. to 300 ft. from the ground. I could see that as it floated along it did not have a smooth float, but seemed to wobble on its axis. The vehicle was moving from the northwest to the southeast. All this took place after 8 p.m. and it was dark outside and was unable to determine the sized of the craft. I have kept this pretty much to myself over the years due to the jibbing that I had received for even mentioning it. I have always been a structured type of individual and tell things as they are. I have given you approximate dates on the sighting as I had never written this event down. PS: The window that the figure was looking down from was sloped out at the top and bottom forming a V shape."],"Disposition":"Unknown","Longitude":"-85.830448","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.591412,+-85.830448(10087)&iwloc=A&hl=en\"> mufon case (10087) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been 6 other sightings in Goshen","There were no other sightings in Goshen on or around April 30th 1967","This sighting has never been favorited.",""],"Case Number":"10087","City":"Goshen","Object Shape":"Circle"}