{"Country":"United States","Weather Factors":"Unknown","Date Submitted":"11/30/0002 03:00 UTC","Region":"Connecticut","Longitude":"-73.078839","map":"<A HREF = \"http://maps.google.com/maps?q=41.609861,+-73.078839(10096)&iwloc=A&hl=en\"> mufon case (10096) map </A>","Latitude":"41.609861","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Object Shape":"Unknown","trends":[],"Log Number":"US-03302008-0002","Summary":"White Tail","Date of the Event":"11/30/2002 12:00 UTC","Tags":"City","divs":["Sighting DetailsDuring the summer of 2005, a bright sunny day, I was driving on I-95 at approx. 3:00 PM in a northeasternly direction coming from New York City and headed towards Connecticut state when I saw a short white plume of what appeared to be like the exhaust of a military jet fighter of some kind at extremely high altitute. This is nothing unusual, but it caught my attention because I thought that it was at an extremely high altitude. I remember thinking that this jet had to be flying at least 70,000 - 80,000 feet up in the sky. (this is only my guess, I have no idea how high it was flying) I couldn't see the plane just a short white stream in its wake. This jet, what I thought was a military jet, was flying in a westernly direction, it then made a sudden 90 degree turn now going north and up. I could clearly see the perfect \"L\" shaped white plume and I thought, \"Wow, this could be my first UFO sighting\" It then just disappeared. I never gave it another thought until now that I decided to check your web site for the first time and I see a lot of reports from a significant number of people, but compared to other reports, my story probably means nothing."],"Case Number":"10096","Sighting Duration":"00:05:00","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/10096.html.txt","/var/www/straped/mufon/mufon_json/10096.json","/var/www/straped/mufon/org/10096.html"],"Object Features":"Unknown"}