{"Object Features":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=47.533287,+-111.721372(10099)&iwloc=A&hl=en\"> mufon case (10099) map </A>","Date of the Event":"03/29/2008 08:55 UTC","Country":"United States","Viewing Distance":"Unknown","City":"Sun River","Sighting Duration":"00:02:15","Latitude":"47.533287","Object Shape":"Star-like","Longitude":"-111.721372","Summary":"Brilliant White Light Moving Southwest to Northeast, fades out.","Source":"MUFON","divs":["sighting detailsat approximately 2055 on march 29th 2008 my wife and i were taking a break between two movies we were watching. my wife went for a potty break and i stepped out on the back steps. skies were clear, temp at 15 degrees and as usual on a clear montana night, the stars were very bright. i was watching a jet flying to the south that was heading west, could see the usual red and green beacons flashing. i turned to look north and caught a very bright light almost directly over head, watched the light moving from south west to the north east. realizing the size and brightness of the light(about 1\\2 the size of a dime at arms length), with no beacons to be seen, i called for my wife. she came out and also watched the light. it was moving at a steady rate, more at a downward trajectory than away from us. i asked my wife to compare it to the airplane with the beacons still in view and blinking. she did and could not make out any similairities with the light above and moving away from us. together we watched the light fade away, which took maybe three to five seconds. the total sighting lasted for at least 2 minutes. after the light faded out, no beacons or anything for that matter could be seen. there was no streaking effect with this light, no beacons, no sound(we listend for aircraft sound for a couple of minutes later). we see shooting stars and all types of aircraft all of the time in our skys, but nothing like this before."],"Tags":"City","trends":["There have been no other sightings in Sun River","This sighting has never been favorited."],"Log Number":"US-03302008-0005","files":["/var/www/straped/mufon/html2text/10099.html.txt","/var/www/straped/mufon/mufon_json/10099.json","/var/www/straped/mufon/org/10099.html"],"Region":"Montana","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"03/29/2008 08:55 UTC","Case Number":"10099"}