{"Object Shape":"Cone, Diamond, Oval, Square, Rectagular, Other","Source":"MUFON","Summary":"I was photographing the night sky on Aug..19.2007 and apparently took photographs of extreme unknown aerial objects","trends":["There have been 4 other sightings in Flatwoods","There were no other sightings in Flatwoods on or around August 19th 2007","This sighting has never been favorited.",""],"Tags":"City","Date Submitted":"08/19/2007 11:25 UTC","Date of the Event":"08/19/2007 11:25 UTC","Country":"United States","City":"Flatwoods","divs":["sighting detailsi took this photo and another one toward the northeast and ohio river_from flatwoods kentucky_that shows very anomalous shaped objects 34 seconds apart, and really close together, on august19, 2007. camera is canon powershot a550 7.1 mp. i take alot of random night photos, then just dump them off into my pc without looking at them till later. i did notice the green light that apparently was the horseshoe shaped object_that i passed of as atmospheric glow on a star..i did not see the 2 smaller glowing objects and green orbs. all objects were basically framed between 2 trees that were not even 60 feet away from me.i guess i just overlooked this one and the other when i reviewed my photos a few days later i was going through my photos a few days ago and seen the specks of light, decided to zoom for a closer look and i was like wow!!!!! i have a horseshoe shaped object attached to this report as well as diamond\\cone and square shaped objects with greenish orb like objects that are closer in my next report and photos. everyone that has seen them are completely blown away. this photo and the other photo with the diamond_square and green orb objects were taken 3 days after my initial photo and report of 8 possible ufos which was submitted in late aug.. i was at my house ouside by my porch when i took this and the next one. i cannot believe that ive had these photographs in my computer and on my camera card for 7 months and didnt even know it!!!! i added 2 enlargements as well as the original. in my original you can see the edge of my porch roof as well, but the craft is only a specks of light until you zoom in a little.. i will be submitting this report with the first object that i photographed including enlargements. i will submit another report following this with photos from the 2nd objects that were photographed 34 seconds after this object which it and its enlargements are attached to this report. thanks very much.......mark corbin."],"Object Features":"Appendage(s), Other","Object Flight Path":"Undisclosed","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/10095.html.txt","/var/www/straped/mufon/more/10095_submitter_file1__ORIGINALCOPYRIGHT372.JPG","/var/www/straped/mufon/more/10095_submitter_file2__EMCRAFTZOOM1.JPG","/var/www/straped/mufon/more/10095_submitter_file3__ULTRACRAFT.JPG","/var/www/straped/mufon/mufon_json/10095.json","/var/www/straped/mufon/org/10095.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03302008-0001","Case Number":"10095","map":"<A HREF = \"http://maps.google.com/maps?q=38.53079,+-82.712798(10095)&iwloc=A&hl=en\"> mufon case (10095) map </A>","Latitude":"38.53079","Disposition":"Unknown","Longitude":"-82.712798","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}