{"Region":"California","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was at Santa Monica Beach with a friend of mine and wanted to catch the sun before we headed back to the San Francisco Bay area. We were laying down and I was watching the airplanes above us. I then thought to myself \"Wouldnt it be something to see a ufo right now...\" Around 5 minutes after I had that thought, I saw a silver sphere-like object in the northwest side of the sky. I asked my friend if she saw what i was looking at and she did. 2 airplanes then criss-crossed it so it gave me an idea how big and low it was. It was flying low, it was silent, and had a decent glow. it then made 90 degree turns slowly towards us. We then realized it wasnt man made, nothing i've ever seen before could move like that and how slowly it kept its pace. Then it was DIRECTLY ABOVE us. it was meticulous and precise. it was like it calculated it move directly above us. I somehow felt it was trying to communicate with me. suddenly fear swept over me since i didnt know what it was going to do. then all the fear went away and felt overwhelmed and amazed at what was happening. my friend was going to record it but she felt the sun was too bright since it was 95 degrees outside. then i thought to myself \" show me something that nothing that i know of can do.\" right after that, the light that was emmitting from the object slowly started to fade and then it disappeared. my friend said \"oh my god did you see that! it just dissapeared!\" i told her of what i telepathically told them to do and she was shocked. we sat up and noticed that everyone around was oblivious as to what happened and out of everyone at the beach that day we were the only ones that saw them. For the past few months,ive been reading exquisite material on ufos and their ancient presence on earth. I have been having extreme, vivid, colorful and intense dreams everynight. For some reason i feel this recent awareness has led me to have a deeper consciousness on the world and universe around us. dont be afraid to watch the skies!!"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"Santa Monica beach, CA 1:30 pm, March 23,2008","Tags":"City","trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around March 23rd 2008"],"Log Number":"US-03292008-0012","Object Flight Path":"Path with directional change","Date of the Event":"03/23/2008 01:00 UTC","Object Features":"None","Weather Factors":"None","Country":"United States","Longitude":"-118.488391","files":["/var/www/straped/mufon/html2text/10094.html.txt","/var/www/straped/mufon/mufon_json/10094.json","/var/www/straped/mufon/org/10094.html"],"Latitude":"34.026034","Case Number":"10094","Date Submitted":"03/23/2008 01:00 UTC","Object Shape":"Sphere","City":"Santa Monica","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.026034,+-118.488391(10094)&iwloc=A&hl=en\"> mufon case (10094) map </A>"}