{"City":"Highland Beach","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.39952,+-80.065598(10092)&iwloc=A&hl=en\"> mufon case (10092) map </A>","Sighting Duration":"00:15:00","Viewing Distance":"Over One Mile","Latitude":"26.39952","Disposition":"Unknown","Longitude":"-80.065598","Object Shape":"Cross","Country":"United States","Weather Factors":"None","Log Number":"US-03292008-0010","divs":["Sighting DetailsI was at the pool at a condo in Highland Beach with my mom and wife, I went to sit with my wife and my mother in the shade. I laid down with my head resting on my wifes legs. My eyes were toward the sky, I put my hands & arm so the suns rays were not directly in my eyes. I saw two objects in the distant blue sky. The objects had a whitish tone to them and at times had a cross like appearance with one of the lengths a little bit longer, almost like looking at a white aircraft from below. The objects were farther apart in the begining at a position about 12:00 in the sky, basically stationary, then they got a little closer and were at about 1:00, a little more north of the original position, but not much. The objects were moving upward more than anything, but at a slow pace. They were not balloons, they were not effected by any upper air currents as they were not moving erractically, also I have never seen baloons that had a cross like shape, just to be noted for the good ole' skeptic. As they were ascending a few planes had passed below, the objects were much farther out and now not looking so much like a plane as the were not traveling horizontally. As they got farther away they appeared to become longer, lost the crosslike appearance and had more of a cigar shape. It is possible that the naked eye could not see the shorter part of the cross like appearance as the objects got farther away. After looking at the objects continuosly for about 15 minutes or so, a thin cloud started to obscure my view, and eventually over came the objects, I then decided to leave and did not see them again."],"trends":["There has been one other sighting in Highland Beach","There were no other sightings in Highland Beach on or around March 29th 2008"],"Case Number":"10092","Summary":"Two objects ascending at very slow pace approximatly 20,000 - 30,000+ft","Object Features":"Wings","Date Submitted":"03/29/2008 02:00 UTC","Source":"MUFON","Date of the Event":"03/29/2008 02:00 UTC","files":["/var/www/straped/mufon/html2text/10092.html.txt","/var/www/straped/mufon/mufon_json/10092.json","/var/www/straped/mufon/org/10092.html"],"Tags":"City","Object Flight Path":"Hovering then path"}