{"Longitude":"-77.288307","City":"Great Falls","Sighting Duration":"Undisclosed","Latitude":"38.998173","files":["/var/www/straped/mufon/html2text/10109.html.txt","/var/www/straped/mufon/mufon_json/10109.json","/var/www/straped/mufon/org/10109.html"],"Viewing Distance":"Unknown","Date of the Event":"06/01/1962 12:00 UTC","Object Shape":"Disc","Country":"United States","trends":["There have been 2 other sightings in Great Falls","There was one other sighting in Great Falls on or around June 1st 1962"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Case Number":"10109","Disposition":"Unknown","Log Number":"US-03302008-0015","Source":"MUFON","Date Submitted":"06/01/1962 12:00 UTC","Object Flight Path":"Undisclosed","Summary":"Large Saucer Shape with rectagular lights around the edge just above the trees","Region":"Virginia","Tags":"City","divs":["Sighting DetailsIt was dusk and I was only about 5 years old and playing on the see-saw with my younger brother when this large saucer shaped object with rectangular lights around the edge appeared from the west, over the trees, flying east it disappeared over the trees behind our house. It was north of our house but flying from west to east at a slow but steady pace just above the trees. Of course scared to death I hopped off the see-saw and dumped my brother on the ground and ran up the back steps past my grandmother and into the house. My brother never saw it because his back was to it but he remembers being dumped on the ground. My grandmother lived out of state, but was there watching us that night so my parents could go to a party. For years later I always remembered it but everyone thought I was crazy if I mentioned it so I never talked about it. I rarely saw my grandmother and years later had even forgotten that she had been there. One night more than 30 years later, my mom and dad stopped by my house with my grandmother. We were standing around talking and out of the blue my grandmother said \"Remember the night the flying saucer flew over the house?\" My mom and dad looked at her like she was crazy, most likely the way they did 30 years before when she probably told dad the next morning when he was driving her home on his way to work. She was discribing what happened. After so many years of no one talking about it, I was beginning to think I must have dreamed it or something, even though I always knew it was real. I confirmed her story to my mom and dad. Then my mother tells me, years ago, Buck Werner that ran the local country store, told her that a flying saucer had landed in the field next to his house one night. Well the one I saw was just above the trees and headed straight towards Bucks house which was less than a mile away. Of course this being more than 30 years later, Buck was now dead and his children had moved away from the area. I would have loved to have known about this years before, to ask Buck question about it. I always believed it was something government related due to being so close to Washington D.C. and the proximity to so many military installations. I am not sure of the year, I just know I was very young so it was in the early 60's."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.998173,+-77.288307(10109)&iwloc=A&hl=en\"> mufon case (10109) map </A>"}