{"trends":["There have been no other sightings in Bridgewater","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Circle, Oval","Country":"United States","Region":"Connecticut","divs":["Sighting DetailsI have seen two, both very different types of ufo's. this is the first one. I was coming home very early a.m. from visiting my husband who was hospitalized for several months. I was approx. 24 yrs old. I had the baby sitter and my son with me. as I got out of the car I looked up as light caught my attention, I yelled at Lori \"do you see that?\" we both watched in awe for a short time and it than went up and dissapeared. it had red lights, was very close to us, had white lights. and was hovering. we felt a small amount of strange heat. this was winter for us.with snow all around us. but it left as the craft left. I reported it to people than and only got laughed at. the second sighting: sometime in 1900 approx. My husband again in hospital, my son approx age was 17. we were riding talking to one another about his dad, when we both noticed this very large ovular very lit up object hovering over the drug and alcohol rehabilitation center that was all lit up. we both got out of the car, and saw the Bridgewater fireman at a nearby pond filling up their tankers, almost as in slow motion, in the lot above was a baseball team playing ball, we couldn't hear any noise from any of them, very odd. very warm sensation hit us both, and we both thought how odd it was that all around us seemed in slow motion and quiet. we watched for quite some time how long I do not know. we stood watching as it appeared to be hovering, only slight movement. shortly after we started walking towards it, as we did it rose and started coming towards us, my son was really scared so we went back to our car, and as we did, it went up and looked to slide sideways in the air. this object was huge, it was over powering the building it sat above and that building is huge. there were a lot of lights on in the building and we wondered if somehow this was attracting it. well it was a long time ago, but to this day I do believe there is another life form or being watching us. we have seen many strange things since, but never as close up as these two. so I saw your article and said what the heck i'll tell you about it."],"Latitude":"41.525833","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.525833,+-73.360833(10104)&iwloc=A&hl=en\"> mufon case (10104) map </A>","Date Submitted":"02/13/1974 12:00 UTC","Case Number":"10104","Log Number":"US-03302008-0010","City":"Bridgewater","Longitude":"-73.360833","files":["/var/www/straped/mufon/html2text/10104.html.txt","/var/www/straped/mufon/mufon_json/10104.json","/var/www/straped/mufon/org/10104.html"],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Summary":"got out of car and it was hovering over my driveway and home","Weather Factors":"None","Date of the Event":"02/13/1974 12:00 UTC","Object Features":"Dome","Disposition":"IFO"}