{"Log Number":"US-03312008-0002","files":["/var/www/straped/mufon/html2text/10117.html.txt","/var/www/straped/mufon/mufon_json/10117.json","/var/www/straped/mufon/org/10117.html"],"Date of the Event":"03/29/2008 08:00 UTC","Weather Factors":"Unknown","Latitude":"46.008797","Disposition":"Unknown","City":"Butte","Region":"Montana","trends":["There have been 13 other sightings in Butte","There were no other sightings in Butte on or around March 29th 2008"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI was on my front porch looking at the stars because it was a very clear night. When I seen this particular bright white orb moving from west to east. I thought it was a plane at first because of it slow speed, until I noticed it was following a smaller white orb barely visible. I ran inside to get my 8mm camcorder, and filmed it just over my house. I am currently trying to figure out how to get it off 8mm and on too my computer so I can submit it. Upon review of the tape, towards the end of the film the smaller craft, takes off at a right angle and disappears. I did not see this with my bare eyes. Then something else shoots from left to right of the screen next from the bigger bright orb. I could not identify what it was. I stopped filming when I went to move through my house to my back porch, so I turned off my camera cause I did not want to film the inside of my house. When I got to the back porch I lost track of it (big orb). There was no point to continue filming."],"Longitude":"-112.530966","Case Number":"10117","Tags":"City","Object Features":"None, Other, Unknown","Date Submitted":"03/29/2008 08:00 UTC","Summary":"A big orb chases smaller orb in the sky.","Country":"United States","Object Shape":"Circle, Egg, Oval, Sphere, Star-like, Teardrop, Other, Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"05:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=46.008797,+-112.530966(10117)&iwloc=A&hl=en\"> mufon case (10117) map </A>"}