{"Object Features":"Undisclosed","Log Number":"US-03302008-0016","Sighting Duration":"Undisclosed","Date of the Event":"08/31/1992 12:00 UTC","Object Flight Path":"Undisclosed","Case Number":"10110","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around August 31st 1992"],"Viewing Distance":"Unknown","Longitude":"-118.290356","Country":"United States","City":"Los Angeles","Disposition":"IFO","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.740032,+-118.290356(10110)&iwloc=A&hl=en\"> mufon case (10110) map </A>","Weather Factors":"Unknown","Date Submitted":"08/31/1992 12:00 UTC","files":["/var/www/straped/mufon/html2text/10110.html.txt","/var/www/straped/mufon/mufon_json/10110.json","/var/www/straped/mufon/org/10110.html"],"divs":["Sighting DetailsThis concerns the photograph from Capitola, CA. I saw that object in a dream (or maybe it wasn't) when I was still living in San Pedro, CA. The dream lasted only a few minutes (I think) Two Greys had this object suspended between them. In the dream, they looked at me. I awakened immediately afterwards, shaking uncontrollably. It had such a profound effect on me that after I moved to Sedona, AZ. a week later to take care of my mother, I had it made by Will Lawrence, a man who lived in Sedona. I'm trying to locate Will but he's moved and I have no idea where he lives. It is sitting in my garage at the moment, and looks so similar, that I nearly fainted when I saw the Capitola photograph. Don't think I'm crazy, please, but mine is a navigation wheel. Don't ask me how I know that. I just know it's a navigation wheel. Mine has the EXACT same blank space from 'noon' to '3PM' as the Capitola photograph, with spokes all the way around. I have a digital camera but I missplaced the hook-up to attach the camera to the computer. I'll get one tomorrow and email the photograph of my wheel if you think it worthy. Or an investigator from this area can contact me (pardon the pun)."],"Object Shape":"Undisclosed","Summary":"Something very similar to the Capitola object is sitting in my garage","Latitude":"33.740032","Source":"MUFON","Tags":"City"}