{"Log Number":"PR-04012008-0001","Case Number":"10126","map":"<A HREF = \"http://maps.google.com/maps?q=18.476164,+-66.101262(10126)&iwloc=A&hl=en\"> mufon case (10126) map </A>","Region":"","Disposition":"Unresolved","Date Submitted":"11/30/1963 09:00 UTC","trends":["There have been 12 other sightings in San Juan","There were no other sightings in San Juan on or around November 30th 1963"],"Date of the Event":"11/30/1963 09:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was 9 yrs. old living in San Juan, Puerto Rico with my family, due to my father's job. My mother, two brothers and myself were at the drive-in movies, parked in our vehicle toward the right rear of the lot. We and I'm sure most of the drive-in attendees noticed a solid silver-like titanium (not chrome)disc shaped UFO aprox. 500-600 feet across. It could have been larger. It had a briliance all it's own and it was a clear night with no moon. It was also silent. Rotating above, between us and the big movie screen. It was more to the right of the screen. As it hovered, it also rotated. The disc had a raised portion on the top and the bottom. But it was one solid object. Slowly rotating you could see 3 different lights on the bottom. As it rotated, you could only see one light at a time due to the distance or the angle of the bottom portion. We viewed the UFO for aprox. 20-30 seconds until it decided to leave. When it took off, it moved faster than anything I know moves to this day and still no noise at all. As it flashed across the sky to the left we could no longer see it due to the landscape. On our way home, the radio announcer mentioned UFO sightings that were seen by many that evening in the San Juan area. My older brother called the radio station and spoke with the announcer. He told him what we saw and he said he would get back to us. The Air Force said it was a helicopter with a neon sign on it. Being only 9 years old, I know exactly what I saw and that was no helicopter. Years later, still to this day, we discuss what we saw. Once you see one, you know we are not alone. It gives you a whole new perspective on life and the universe. When I'm outside day or night, I'm always looking up. It was a wonderful and enlightening experience."],"Country":"Puerto Rico","Tags":"City","Longitude":"-66.101262","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/10126.html.txt","/var/www/straped/mufon/mufon_json/10126.json","/var/www/straped/mufon/org/10126.html"],"Object Features":"Dome","Latitude":"18.476164","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Shape":"Disc, Saturn-like","Weather Factors":"None","Summary":"1964 UFO Sighting at Drive-In/San Juan, PR","City":"San Juan"}