{"files":["/var/www/straped/mufon/html2text/10129.html.txt","/var/www/straped/mufon/mufon_json/10129.json","/var/www/straped/mufon/org/10129.html"],"Date of the Event":"06/01/1975 12:00 UTC","Date Submitted":"06/01/1975 12:00 UTC","Latitude":"40.429044","Log Number":"US-04012008-0004","City":"Greeley","Region":"Colorado","Viewing Distance":"101-500 Feet","Tags":"City","Country":"United States","divs":["Sighting DetailsMy friends and I were out goofing off. Local coffee shop Sambo's was open 24 hours. they went in and I elected to stay outside in the car. I was reading the bible for the first time in my life.(Revelation) I looked up in the sky in the distance and what appeared to be a star I noticed kept getting brighter. I kind of started talking to it and the light kept getting closer. the closer it got I could make out 3 red blinking lights in the shape of a triangle. this was really freaking me out but I really enjoyed this kind of wierdness. anyway long story short when it came very close I sat my butt in the car window and looked over the car. they slowly moved and gradually were almost over my head when I realized that the pulsating red lights were not on one unit but three because they were not in sync perfectly. They made not a sound. I could see the units were silvery metalic and cigar shaped or bullet shaped like a blimp. they came immediately over my head. two gents drove into the parking lot and got out of their truck and I screamed at them to look at what I was witnessing. it was as if they did not hear me. However, my friends (about 6 or 7) finally exited the restaurant and I told them to look up and they all saw it too. I thought it was going to take me away so I started telling it to go away. when my friends all came outside it did start going away slowly. I was scared shitless because I had called it to me. I am not crazy but I have held that inside for many many years. You can take this information or leave it. I know what I saw and nothing will ever convince me otherwise. Hell yes they are out there."],"Object Features":"None","Object Shape":"Blimp, Cigar","trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around June 1st 1975"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"metallic cigar shaped with only one blinking red light on bottom center","Case Number":"10129","Object Flight Path":"Straight-line path","Longitude":"-104.706552","map":"<A HREF = \"http://maps.google.com/maps?q=40.429044,+-104.706552(10129)&iwloc=A&hl=en\"> mufon case (10129) map </A>","Source":"MUFON","Disposition":"Unknown"}