{"Object Shape":"Star-like","Case Number":"10139","Disposition":"Unknown","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around April 2nd 2008"],"Latitude":"38.899892","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=38.899892,+-77.027386(10139)&iwloc=A&hl=en\"> mufon case (10139) map </A>","Longitude":"-77.027386","Source":"MUFON","Date Submitted":"04/02/2008 12:15 UTC","City":"Washington","files":["/var/www/straped/mufon/html2text/10139.html.txt","/var/www/straped/mufon/mufon_json/10139.json","/var/www/straped/mufon/org/10139.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Log Number":"US-04022008-0006","Country":"United States","Region":"Maryland","Tags":"City","Sighting Duration":"00:03:00","Summary":"Very Big Giant Star Like Object","Weather Factors":"None","Date of the Event":"04/02/2008 12:15 UTC","divs":["Sighting DetailsLast night I saw something unusual in the night sky, this was not natural by any means it happened very quickly but I saw enough to know that I am convinced now that we are not alone, I have always read about aliens and ufo's but I always was sort of skeptical about the whole deal however I have now become a believer. This thing I saw in the sky looked like a star a very big star about the size of a small car it and it had a silver glow about it appeared triangular with small silvery circles around it, it is really hard to try and expain what I saw because even I cant explain it to myself, but it was hovering for about a few minutes then it looked as though it lowered a bit then back up and vanished. At the time I was sitting on my sofa watching a mvoie and I was sitting sideways infront of my apartments 3rd floor balcony but for some reason I tured my head at that exact moment and it was as if I was in a trance but I know it was not a trance it was shock or something like that, because I could not believe what I was seeing, when I finally could recollect myself I yelled, what was that? my fiancee who was sitting a little ways from the balcony watching the movie also looked at me in wonder as to why I was shouting at 12:15 Am, knowing we had neighboors. I told him what I saw and that I was sorry for the neighboors for yelling out but that I had never seen anything like that in my life and I admit I was a bit afraid at the time, still am a little afraid but I know I need to share my encounter with as many people as possible, I will defenitly never forget what I saw last night."]}