{"Summary":"Small UFO sighted inside house","Region":"Missouri","Object Flight Path":"Straight-line path","Object Features":"Dome, Window(s)","City":"Independence","Sighting Duration":"00:00:03","Longitude":"-94.410647","Latitude":"39.094076","Object Shape":"Disc","Disposition":"Unknown","Tags":"City","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around March 30th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/10137.html.txt","/var/www/straped/mufon/more/10137_submitter_file1__tinyufo.jpg","/var/www/straped/mufon/mufon_json/10137.json","/var/www/straped/mufon/org/10137.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.094076,+-94.410647(10137)&iwloc=A&hl=en\"> mufon case (10137) map </A>","Weather Factors":"Unknown","Case Number":"10137","Date of the Event":"03/30/2008 10:00 UTC","Log Number":"US-04022008-0004","Country":"United States","divs":["sighting detailsat 10:00 am as i just lay down in bed with my wife, who just returned from working the night shift as a nurse. i had the feeling i was being watched. then i saw a disc-shaped white color ufo approaching me overhead at an angle down towards me. i was still fully awake but my wife was tired and had her eyes closed. the object was flat on the bottom with a domed top and had a light or lights around the dome with black areas between the lights that reminded me of windows. the object was only 12\" in width and 12\" high. as i noticed it, it faded away and dissapeared. the entire sighting lasted only three seconds, but it was long enough for me to get a good look at it. i should note that i saw two chevron\\triangular-shaped black ufo's in this same room at night on previous occassions within the past year. both of those objects moved through a closet towards the chimney and my wife saw these, too. there is also a lot of paranormal activity in the house which may or may not be related to these objects."],"Viewing Distance":"20 Feet or Less","Date Submitted":"03/30/2008 10:00 UTC"}