{"Source":"MUFON","City":"McKinney","map":"<A HREF = \"http://maps.google.com/maps?q=33.200476,+-96.631082(10148)&iwloc=A&hl=en\"> mufon case (10148) map </A>","divs":["Sighting DetailsMy wife and I were out side with the video camera because I got a hunch that something was going to happen. I know this may sound cheeze, but I was taping UFO Hunters, when about 9:45 pm the DVD recorder shut off and we were watching a blue screen. I decided to grab the camera and run outside. I had the night vision on and just as soon as I panned the camera to the top of my house a bright streak shot across the feild of view. It seemed very close as it was quite large on the view finder. I transfered the tape to DVD and took a still shot of the TV set with my photo camera. The event took only one second but when I steped the DVD through the still frame it looks like the object just appears at almost the top of the screen then streaks to the bottom instantaineously this was fast. I have the tape but I'm just going to post the jpg. This may be nothing but if it were a meteor it would seem that the photo would show a long tail. This looks a lot like a cigar shaped light."],"Date of the Event":"04/02/2008 09:45 UTC","Longitude":"-96.631082","Region":"Texas","Object Flight Path":"Straight-line path","Disposition":"IFO","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around April 2nd 2008","This sighting has never been favorited.",""],"Log Number":"US-04032008-0003","Case Number":"10148","Country":"United States","Sighting Duration":"00:00:01","Object Features":"None","Latitude":"33.200476","Summary":"Vidieo of misting gray night , cigar shaped light streaked across camera","Weather Factors":"Fog","files":["/var/www/straped/mufon/html2text/10148.html.txt","/var/www/straped/mufon/more/10148_submitter_file1__UFO04-02-08small.jpg","/var/www/straped/mufon/mufon_json/10148.json","/var/www/straped/mufon/org/10148.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cigar","Date Submitted":"04/02/2008 09:45 UTC","Tags":"City"}