{"Country":"United States","Region":"Missouri","Object Features":"Undisclosed","Date of the Event":"08/07/1997 12:00 UTC","files":["/var/www/straped/mufon/html2text/10143.html.txt","/var/www/straped/mufon/mufon_json/10143.json","/var/www/straped/mufon/org/10143.html"],"City":"Washington","Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"A bright light in the sky like chess pieces","Case Number":"10143","trends":["There have been 2 other sightings in Washington","There were no other sightings in Washington on or around August 7th 1997"],"Object Flight Path":"Stationary","Viewing Distance":"Unknown","Date Submitted":"08/07/1997 12:00 UTC","Latitude":"38.558107","Longitude":"-91.012088","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.558107,+-91.012088(10143)&iwloc=A&hl=en\"> mufon case (10143) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsIt didn't seem to be anything flying it was just lights in the sky like chess pieces and different shapes flashing very quickly. I was out on my deck about midnight or two am. I looked up to the right and saw the best description I can give is chess pieces but they where bright and big for being so far away. They flashed repeatedly over and over. I can't imagine no one else seeing them. They where more than chess pieces they where just symbols they flashed so quick it was hard to tell what they where but they stayed up there for about five ten minutes. It seemed like a long time. I don't tell to many people this because it makes no sense to me either. I was in New Haven Missouri right outside of Washington Mo. It was a nice night I was up late and saw the lights they where hugh for being so far away. They just flashed different symbols and then stopped. Sorry thats all I can tell you it's not a ufo but its the weirdest thing I ever saw I can't explain they where high in the sky like the stars but not that far away just big about four feet in height from the sky. I thought what the hell was that about. There's no military bases that way or a spot light or nothing like that it was to distinct and clear and they flashed quickly and dissappeared. This was back in 1997."],"Log Number":"US-04022008-0010","Object Shape":"Chevron, Circle, Cross, Cylinder, Diamond, Flash, Oval, Sphere, Square, Rectagular, Other, Unknown","Tags":"City"}