{"Summary":"Seen Alien Craft Power Up and Leave Atmosphere in Under 2 seconds","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Flash, Other, Unknown","Date Submitted":"04/02/2008 12:00 UTC","Object Flight Path":"Undisclosed","City":"Undisclosed","Region":"Michigan","files":["/var/www/straped/mufon/html2text/10146.html.txt","/var/www/straped/mufon/mufon_json/10146.json","/var/www/straped/mufon/org/10146.html"],"Tags":"City","Latitude":"44.318764","divs":["sighting detailswell,this is my second definate alien craft incident i have seen since 2001,hands down alien for sure, please see my story under mi reports archive \"several ufos seen over lake fenton with my wife story\" anyways this is i guess luck because i went out tonight in metamora mi with my six year old to look for guess?, ufos, as he watches my laptop sometimes as i watch videos of ufo material and has really got into or shows interest in it. so tonight we went out to the top of our driveway and started looking up and talking,we seen several planes,2 satelites and had been out for about 40 minutes. i was looking south and i seen another commercial jet 30k feet or so. i pointed it out to him and we watched it for about 2 minutes,it was flying west,just for the record. anyways somthing in front of the path of the plane,probably several miles ahead of it,powered up or charged up because the sky was black infront of the plane until this vanilla\\white and very green like a sea foam green color came to a glow in front of the jet,i pointed to it and my son seen it and the plane kept flying towards it and then id say with the jet just 5-10 thousand feet behind it and closing in, the thing shot away from the jet and i swear it flew out of the atmosphere in 2 seconds with a trail behind it glowing green. i swear on my mothers grave thats exactly what happened. and my son seen the whole thing. this craft traveled the equivelent of mach 100 or something crazy. well there it is, i dont need to remain anonymous,i would take i lie detector test tonite or anytime. 810-280-2276 for people who want to talk. thanks mufon."],"Log Number":"US-04032008-0001","Case Number":"10146","Date of the Event":"04/02/2008 12:00 UTC","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=44.318764,+-85.597364(10146)&iwloc=A&hl=en\"> mufon case (10146) map </A>","Object Features":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-85.597364","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed"}