{"Country":"United States","Date of the Event":"04/02/2008 01:55 UTC","Case Number":"10144","files":["/var/www/straped/mufon/html2text/10144.html.txt","/var/www/straped/mufon/mufon_json/10144.json","/var/www/straped/mufon/org/10144.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Florida","Weather Factors":"None, Does Not Apply","City":"Bushnell","Object Features":"None","Date Submitted":"04/02/2008 01:55 UTC","Latitude":"28.667252","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Summary":"We were driving North on I-72, 50 miles past Wesley Chapel,","Tags":"City","Log Number":"US-04022008-0011","map":"<A HREF = \"http://maps.google.com/maps?q=28.667252,+-82.104583(10144)&iwloc=A&hl=en\"> mufon case (10144) map </A>","Source":"MUFON","Longitude":"-82.104583","Object Shape":"Other","trends":["There have been 2 other sightings in Bushnell","There were no other sightings in Bushnell on or around April 2nd 2008"],"divs":["Sighting DetailsWe were driving North on I-75, 50 miles past the Wesley Chapel, Florida exit, I was looking out the truck front window and saw a very large whitish object moving slowly south in the distance ahead. I said to my husband,\"that doesn't look like a plane, does it? Is that a plane?\" He replied,\"where?\" and then he spotted it and said \"no thats not a plane.\" As we continued to watch, the object turned west and disappeared. It reappeared facing south again, but now we could see it looked like several silver orbs in sync with each other and we could not see any connection between them...they seemed to move seperate but in sync. They turned west again and disappeared and reappeared under a cloud and then elongated or added more orbs or more came into view. This is difficult to explain but we saw these objects as if they were rounded on top but we could not see an underside or a bottom. They seemed to be at 30-40 degree off the horizon and we pulled over at a rest stop to see better but the treeline obscured our view. We observed a jet a few minutes later, and comparing the size, the objects were much larger as a group that the jet."]}