{"Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","City":"Brookings","Log Number":"US-04032008-0002","trends":["There have been 5 other sightings in Brookings","There were no other sightings in Brookings on or around June 30th 1991"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/10147.html.txt","/var/www/straped/mufon/mufon_json/10147.json","/var/www/straped/mufon/org/10147.html"],"Sighting Duration":"Undisclosed","Longitude":"-124.277612","map":"<A HREF = \"http://maps.google.com/maps?q=42.059961,+-124.277612(10147)&iwloc=A&hl=en\"> mufon case (10147) map </A>","Source":"MUFON","Latitude":"42.059961","Region":"Oregon","Case Number":"10147","Country":"United States","Viewing Distance":"101-500 Feet","Date Submitted":"06/30/1991 11:30 UTC","Object Features":"Other","Tags":"City","divs":["Sighting DetailsWhile driving up a road in curry county in the back woods me and two other friends wittnessed what looked like a flying triangle flying silently from NE to SW. it looked like it had one unlit circle under each corner with a very low dim light and larger circle in the middle of the craft. We slowed down and stopped in the middle of the road. The car we were driving suddenly turned off. Another vehicle driving towards us started driving slow and appeared to be looking at the same craft we were looking at but did not stop and appeared to have accelerated and drove fast passed us. As we watched the craft float right above us we kept track of time and it took the craft around 15 minutes to float by. The car we were driving never would restart and after a half mile walk down the road found a closed market with a pay phone and called for help. The next day my friend took his car in to get checked out and found that the alternator was fried and so was the battery. Both were less than a month old."],"Date of the Event":"06/30/1991 11:30 UTC","Summary":"Triangle shaped vehicle floating silently above car approxamtely 500 feet above","Weather Factors":"None"}