{"Source":"MUFON","Country":"United Kingdom","Object Flight Path":"Path with directional change","Date of the Event":"03/04/2008 12:00 UTC","Object Shape":"Other","Date Submitted":"03/04/2008 12:00 UTC","City":"Belfast","Weather Factors":"None","Tags":"City","Summary":"Copper coloured satelite that changed direction and speed several times","Sighting Duration":"Undisclosed","Object Features":"Unknown","Latitude":"54.602293","Case Number":"10157","Viewing Distance":"Over One Mile","Region":"Northern Ireland","Longitude":"-5.931038","Log Number":"GB-04042008-0003","divs":["Sighting DetailsIt was a very clear star filled night with no moon that I can remember. I was locking the garden shed and noticed what I thought was a satelite flying overhead,(I see satelites regularly on clear nights), It was going straight across the night sky, the only unusual thing I noticed at that time was that satelites normaly show up a greenish white colour and this was a coppery orange. this made me watch the object, after about 20 seconds it started to turn and did a curved turn in the sky so it was going back the way it came and then suddenly turned again to go back the original corse forming a backward S shape in the sky if you where to trace its corse. Then it sped up and shot off into the distance. It must have been at a very high altidude as planes flying overhead that night showed up crystal clear and stars likewise, but this had a fuzy glow around it as if it where amiting light rather than reflecting it. Please contact me over this issue as I would like to discuss it further. I have seen many shooting stars, planes, and other objects and vehicles, and I know that at that altidude this object was moving extremely fast, faster than anything civilian or military that I know of. This object was going slightly faster than a satelite and when it shot off it was like a bullet."],"Disposition":"Unresolved","trends":["There have been 5 other sightings in Belfast","There were no other sightings in Belfast on or around March 4th 2008"],"files":["/var/www/straped/mufon/html2text/10157.html.txt","/var/www/straped/mufon/mufon_json/10157.json","/var/www/straped/mufon/org/10157.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=54.602293,+-5.931038(10157)&iwloc=A&hl=en\"> mufon case (10157) map </A>"}