{"Source":"MUFON","Summary":"Very large disk appeared- went away- came back.","trends":["There have been 9 other sightings in Marshall","There were no other sightings in Marshall on or around October 5th 2000"],"divs":["Sighting DetailsI am a land surveyor since 1978, ex air force brat of 16 yrs. I have always had an eye and ear for aircraft, if I hear an aircraft I look for it. I have excellent eyesight and have been known to spot deer and coyotes as far as a mile away. On the day of the event my co-worker and I were staking a pad in the woods for a gas well to be drilled. We start @ 6 in the morning so we normally eat lunch by 11. Being as we waded through a beaver pond we were too wet to eat in the truck. While eating I happened to look up, there were BIG fair weather cumulus clouds in the sky. The two nearest overhead had a fairly large gap in between them and I saw this DISK. I asked my co-worker what he thought it might be. He looked up at it and I believe it kind of scared him. He said he didn't have any idea. so we watched it for a few minutes and it slowly moved to the SSW until it was gone from our sight. A few minutes later I looked back up and there IT was again in the same spot as before, a few minutes later it moved away to the SSW and it was gone. Okay, this thing was LARGE, if I were to estimate the size of this DISK I would have to say at least the diameter of a commercial airliners length. It was of a grey or metallic color, shaded underneath, with a flattish underside. The sun was high in the sky so it was shiny along the edges. It had no markings or appendages and made no noise. As far as the top and sides go I couldnt see enough of them to identify. It was well above the clouds. Another thing I failed to mention was the area I was working in, SWEPCO Power PLant is a few miles away, and the mining company had just moved into this area with a dragline in it's first Pit. Also when the disk moved away as noted it was going in the direction of another Power Plant & lignite mine outside of Tatum Texas. Now at first I thought this event to be odd but I wasn't shocked by it or anything. As more years have gone by I still keep my eye to the sky thinking I may see another. I have twins that love to spot planes, helicopters, and satellites if we happen to be out late, i'm teaching them to have a sharp eye. Anyone else see anything similiar around this time?"],"Date of the Event":"10/05/2000 11:30 UTC","Latitude":"32.545961","Case Number":"10158","Object Features":"None","Longitude":"-94.363578","Region":"Texas","Disposition":"Unknown","Date Submitted":"10/05/2000 11:30 UTC","Tags":"City","Sighting Duration":"00:10:00","Log Number":"US-04042008-0004","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","City":"Marshall","files":["/var/www/straped/mufon/html2text/10158.html.txt","/var/www/straped/mufon/mufon_json/10158.json","/var/www/straped/mufon/org/10158.html"],"Weather Factors":"None","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=32.545961,+-94.363578(10158)&iwloc=A&hl=en\"> mufon case (10158) map </A>","Country":"United States"}