{"Date of the Event":"03/03/2008 02:15 UTC","Log Number":"US-04032008-0006","Summary":"Awoke at @ 2 A.M. To Find Sky Lit Up As If It Was Daylight","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.360118,+-89.396668(10151)&iwloc=A&hl=en\"> mufon case (10151) map </A>","Longitude":"-89.396668","files":["/var/www/straped/mufon/html2text/10151.html.txt","/var/www/straped/mufon/mufon_json/10151.json","/var/www/straped/mufon/org/10151.html"],"Case Number":"10151","Region":"Mississippi","divs":["Sighting DetailsI have started sleeping in the living room of my house since I have problems sleeping in my room due to almost constantly waking up paralyzed and feeling that something is there. I have seen many sightings before and tried to initiate spiritual contact without being prepared for the results. I want to learn more, but I am too afraid because of the \"sensation\" that occurs when I do. I become entranced by the communication if I attempt it, but I am trying not to anymore. It started on March 3rd around 2:15 A.M., I was just finishing a movie that I was viewing on my laptop when I heard many of the neighborhood dogs barking ferociously outside at something. Out of previous \"experiences\", I did not attempt to find out what was happening since I could hear loud whirring mechanical sounds outside, sort of like a buzzer that sounded quickly the stopped periodically. I decided to close my eyes for a few minutes and just pretend that I did not hear anything, but then I reawoke to find a very orange light outside the sitting room window. Thinking it was morning, I looked at my portable alarm clock seated by me to see what time it was. \"What?\" I looked at the alarm clock in disbelief as I checked to make sure that my time was not wrong. All the clocks said 2:16 approximately. I turned to look out the large window and the woods were reflecting the orange glow as if the sun was rising. The whole house was lit orange inside. I tried to wake my parents by shaking the fiercely, but they had just gone to bed a couple of hours ago so they were completely exhausted. I then checked my sibling's room at around 2:18 and sure enough, the room was glowing orange. I finally summoned up the courage to look out the window and saw a ball of light which looked like the sun but you could actually look at it without hurting your eyes. I was immediately frightened and crouched by the window only to hear the strange buzzing and the screaming of dogs and horses in the country side where I live. In about two more minutes I peeked through the window and saw the light lift up into the sky and fade. I never want to see it again, but I know I must face facts. They are here. I have no reason to lie. But when the time comes, we should be ready. For more information please refer to my email. Thank you for listening. I am tired of being fearful and felt someone should know what is happening over here. P.S. Many strange phenomena appeared during the recent lunar eclipse. The were lots of visible objects in the sky."],"Object Features":"Unknown","Date Submitted":"03/03/2008 02:15 UTC","trends":[],"Source":"MUFON","Country":"United States","City":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Latitude":"32.360118","Disposition":"Unknown","Object Shape":"Flash, Other, Unknown","Sighting Duration":"00:05:35","Object Flight Path":"Stationary"}