{"divs":["Sighting DetailsMy daughter & I arrived home from town & were unloading the car when I looked up to the north-east through the trees & noticed what looked like the full moon. But it seemed to glow funny, it was the color reddish-orange. We couldn't tell from the yard so we got back into the car & drove down to the corner about 100 feet or so from our house. There we noticed a yellow-white, completely round object at tree top level above the highway to our left. There was a strange reddish-orange haze or dust falling down all around it. We just felt confused & a little scared as to what it was we were looking at. As we drove ahead to turn around in a neighbor's driveway it appeared to be following us. Then we noticed really black clouds that looked like fingers over the top of it. There were more black clouds around it. We must have decided it was the full moon but was never really sure. I checked out the window about an hour later & it was still there. I assume it was still there when we went to bed. We drew pictures of it the next morning. I discused it with Amanda's dad & suddenly discovered that it was a week after the full moon! We still felt unsure & restless."],"Tags":"City","Date of the Event":"11/04/2004 08:30 UTC","City":"Marshfield","Region":"Wisconsin","Country":"United States","Object Flight Path":"Stationary,Other","trends":["There have been 3 other sightings in Marshfield","There were no other sightings in Marshfield on or around November 4th 2004"],"Case Number":"10153","Viewing Distance":"21-100 Feet","Longitude":"-90.171799","Summary":"Full moon shape, yellow-white, reddish-orange haze/dust falling around it. Tree top level. Smokey black clouds around it. Witnessed 7 days after full moon.","Object Features":"None","Log Number":"US-04032008-0008","Sighting Duration":"02:00:00","Object Shape":"Oval, Sphere","Source":"MUFON","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.668852,+-90.171799(10153)&iwloc=A&hl=en\"> mufon case (10153) map </A>","files":["/var/www/straped/mufon/html2text/10153.html.txt","/var/www/straped/mufon/mufon_json/10153.json","/var/www/straped/mufon/org/10153.html"],"Date Submitted":"11/04/2004 08:30 UTC","Disposition":"Unknown","Latitude":"44.668852"}