{"Log Number":"US-04042008-0002","Tags":"City","City":"Austin","Date Submitted":"02/16/2008 12:00 UTC","Longitude":"-97.741571","Date of the Event":"02/16/2008 12:00 UTC","Case Number":"10156","Disposition":"Unknown","Summary":"Austin, Texas, 10 pm, multiple shere lights rise up, split and go in multiple directions, more rise up, split in multiple directions.","map":"<A HREF = \"http://maps.google.com/maps?q=30.272783,+-97.741571(10156)&iwloc=A&hl=en\"> mufon case (10156) map </A>","Source":"MUFON","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWhile visiting my mom, my mom and I took the dogs for a walk, in the hills of Westlake, before going to bed. It was around 10:00 pm, 16 February. We first walked up Ridgecrest and were walking back down Ridgecrest, when we saw the lights. Turning back towards the house, my mom noticed 4-5 reddish-orange slightly vertical spheres rising from behind the hill blocking our view of downtown Austin. My mom called my attention to the lights. As we continued walking down a hill staring at the lights and looking towards Austin to the east, 4-5 more light came up, south of where the first group appeared. The first group began to split up, going in multiple directions; primary heading east and south-east until they disappeared. A third group of lights rose to the north of the first group and then the 2nd group of lights split in multiple directions. I began running towards the house, to get my husband to come out and see the lights - but by the time he got outside, only one light was still visible in the far north sky. My mom called 311 and talked to the Travis county sheriff's department, but they had not heard of any reports of lights in the sky. The following day, while talking to a neighbor across the street, my mom mentioned the lights we saw the previous night. The neighbor says her (adult) son had told her on 13 February, he too had seen similar lights, one of which went directly overhead, at approx. the same time in the evening when we saw the lights. The lights were not like anything either of us have seen before and they were certainly unexplainable. The lights were not close, but we could hear powerful engine noises. The lights did not blink or flicker and they appeared to move at various speeds. For a short time, they seemed to be lined up horizontally before splitting up and going in multiple directions. I typically have a phone or a camera with me - but not when walking the dogs. After this experience, I will keep one handy at all times."],"files":["/var/www/straped/mufon/html2text/10156.html.txt","/var/www/straped/mufon/mufon_json/10156.json","/var/www/straped/mufon/org/10156.html"],"Object Features":"None","Latitude":"30.272783","Sighting Duration":"Undisclosed","Region":"Texas","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Circle, Sphere","Weather Factors":"None","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around February 16th 2008"]}