{"trends":["There have been 2 other sightings in Spring Valley","There were no other sightings in Spring Valley on or around April 2nd 2008"],"Disposition":"Insufficient Data","City":"Spring Valley","files":["/var/www/straped/mufon/html2text/10152.html.txt","/var/www/straped/mufon/mufon_json/10152.json","/var/www/straped/mufon/org/10152.html"],"Tags":"City","Country":"United States","Sighting Duration":"00:22:00","Latitude":"36.113899","Source":"MUFON","Date of the Event":"04/02/2008 10:38 UTC","Region":"Nevada","Summary":"ufo sighting appears after a boeing plane traveling east passes by","Date Submitted":"04/02/2008 10:38 UTC","Case Number":"10152","Object Features":"Unknown","divs":["Sighting Detailson april 4,2008, I went outside at 10:30pm waiting for a friend I kept looking at my cell phone,playin with the address book,and just causally looking up and around the sky at stars,plans,and police choppers etc. I then looked to the west and noticed a very large airline probably a boeing jet coming into mccarren airport,after a few seconds of it passing by I then noticed a circle of light(greenish in color) circling,and circling,after a few circles and the clouds cleared I noticed a beam of light at the end of each circle(sorta like it hitting something like a wall) when it would beam off light,4more beams of light would appear,and just vanish. But the circle never vanished,it would just run in a pattern of doing the same thing over and over. the circling was about 5-10seconds long. At about 10:50pm my friend showed up,and I told him to hurry up he had to come see what I saw. He saw it too. We watched it for another 10 minutes with me. It was almost like hypmotising to just watch it go around and around. During the waiting period it was making a freakwynnsee sound off the light pole. almost like a sos thing. hummmmingcracklingbuzzing noise. I was almost tempted to call the police(but they would have just laughed,or been upset for calling for a non emergency reason)thats why I'm glad my friend showed up to witness it. I told him I was gonna try and find someone to write to about what happen. So this is our story of what happened in the las vegas sky last night. A never forgetting experience. (i even drew the whole thing on paper)So after our last 10 minutes of gazing, we both went inside. About a hour later 12midnight he decides to leave,and I said I'm gonna walk you out,and see if its still there. It wasnt. I was sad. I could have been up and stayed up all night just watching it. P.S. I have a cell phone cam,but for some reason it would not show up.,and I had no video either!!!"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-04032008-0007","Longitude":"-115.299135","map":"<A HREF = \"http://maps.google.com/maps?q=36.113899,+-115.299135(10152)&iwloc=A&hl=en\"> mufon case (10152) map </A>","Object Flight Path":"Unknown","Object Shape":"Circle, Other"}