{"Sighting Duration":"Undisclosed","Longitude":"-75.974647","Weather Factors":"Unknown","Latitude":"40.958418","divs":["sighting detailsi did not personally witness this event which occured in the early 60's. it was related to me by my brother who was with his (our) cousin who also witnessed the event. my brother was about 10 years old at the time of his sighting and i,being 9 years older was in the navy at the time. anyway, here's the story as he related it to me just recently almost 46 years after it occured. my brother and our cousin were playing baseball in our cousin's backyard. all of a sudden my brother heard a very loud ,high pitched whooshing noise. he said it sounded like jet fighters flying overhead at a very low altitude. about 200 ft. from our cousins backyard there was a large 3 story house on the corner where a side street intersected garfield st. looking toward the sound of the noise my brother noticed a silvery torpedo shaped object, perhaps 12 to 15 feet long with a red tipped nose and small stubby wings zipping toward the large house on the corner. the object made a number of circles around the chimney on the roof and zipped off in seconds, as fast as it appeared. i know this happened over 45 years ago but i'm curious if anyone else remembers\\or saw this event in hazleton, pa. louis dorse mufon member # 10544"],"Summary":"12 to 15 foot long torpedo shaped object swirled around chimney and vanished.","Case Number":"10168","Object Shape":"Bullet, Missile","Tags":"City","Object Flight Path":"Path with directional change","Log Number":"US-04052008-0007","Country":"United States","Date Submitted":"11/30/1960 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.958418,+-75.974647(10168)&iwloc=A&hl=en\"> mufon case (10168) map </A>","trends":["There have been 5 other sightings in Hazleton","There were no other sightings in Hazleton on or around November 30th 1960"],"City":"Hazleton","Region":"Pennsylvania","Viewing Distance":"101-500 Feet","Date of the Event":"11/30/1960 12:00 UTC","files":["/var/www/straped/mufon/html2text/10168.html.txt","/var/www/straped/mufon/mufon_json/10168.json","/var/www/straped/mufon/org/10168.html"],"Source":"MUFON","Disposition":"Unknown","Object Features":"Wings"}