{"files":["/var/www/straped/mufon/html2text/10161.html.txt","/var/www/straped/mufon/mufon_json/10161.json","/var/www/straped/mufon/org/10161.html"],"Object Flight Path":"Stationary,Path with directional change","Longitude":"-4.399468","Country":"United Kingdom","Tags":"City","Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Disc","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=55.323941,+-4.399468(10161)&iwloc=A&hl=en\"> mufon case (10161) map </A>","Object Features":"Other","Date of the Event":"12/21/1999 10:00 UTC","Sighting Duration":"Undisclosed","Date Submitted":"12/21/1999 10:00 UTC","Latitude":"55.323941","Summary":"A bright light hovering above a forest and then moving swiftly across the sky.","Log Number":"GB-04042008-0007","City":"Dalmellington","Region":"Scotland","Case Number":"10161","Source":"MUFON","trends":["There have been no other sightings in Dalmellington","This sighting has never been favorited."],"divs":["Sighting DetailsMy uncle and I were walking his dogs on a very cold and clear night in Dalmellington, Scotland. I suddenly heard my uncle suddenly say 'what the hell is that?' I looked and I saw lights, probably around 1 mile away, approximately 20 degrees above the horizon. I did question this and said it may have been a car or tractor in a field or on a road. He said there are no roads in that direction, but just forests. My uncle knows this area very well as he was born and lived there until the present day. We then just saw this object slowly move up, and then stopped. Suprisingly we went back to the house, but I returned with a pair of binoculars. I saw nothing for a while, but then out of nowhere saw this object rapidly 'travel' across the sky in a 'V' pattern. It started from my right at around 45 degree elevation and then moved so quickly to almost the same elevation to my left. I was absolutely shocked what I saw and swore so loud, in amazement, that a neighbour poked his head out the window. The next thing I know is the object zoomimg so fast away. My uncle did tell me that a few years prior to that he and most of the neighbourhood saw an object just hovering above the hills for about two hours, about 1km away from his house. Soon after there were military aircraft inspecting the area. From my siting I know that this was not an object that can be built by our current technology. I have a Commercial Pilot's Licence and a university graduate in Physics, as well as having a diploma in Meteorology. I conclude this was not an atmospheric phenomena or any space debris, nor was it within our Aerospace technical capabilities."]}