{"City":"Carlisle","map":"<A HREF = \"http://maps.google.com/maps?q=39.582003,+-84.320219(10165)&iwloc=A&hl=en\"> mufon case (10165) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Latitude":"39.582003","files":["/var/www/straped/mufon/html2text/10165.html.txt","/var/www/straped/mufon/mufon_json/10165.json","/var/www/straped/mufon/org/10165.html"],"Disposition":"Insufficient Data","Country":"United States","Case Number":"10165","trends":["There have been no other sightings in Carlisle","This sighting has never been favorited."],"Date Submitted":"04/03/2008 08:20 UTC","divs":["Sighting DetailsI was returning home from the little market near my home , I looked up in the dark night sky & noticed 2 seperate dark triangles hovering over top of a home about 4 blocks from my home. so I drove nearer . I stopped my car in the road & simply watched these objects hovering overtop a home. The First or nearest triangle object was only about 50 feet above a house.Mind you Stopped in Mid-Air ! The other triangle object was hovering about another 50 feet or more above the first craft.They were triangle shaped with a light at each point. I suppose they noticed my sitting there on the road watching them after a minute or so they started moving towards the North East. Not fast at all. They just simply slowley moved across the night sky towards the north east. There was no sound. I listened hard for a sound & there was nothing at all. Trust me I was praying for some sort of Familar sound IE : Helicopter etc. I found it odd. When I first seen them I though \" wow , what the heck \". But as I watched more I had many thoughts. One of which I'de like to believe seeing as how they didnt seem to move very fast at all. That perhaps it's a Tactical type Craft. IE: DEA of some other Tacticle type departmental craft. Then again I thought well if it didnt want me to know it was a UFO it would have acted \" Normal \" ( Laughing to myself ) I was spooked never the less & made sure they were of clear distance befor I turned on my street & shut off my car lights in the dark night drove down the road & into my driveway for fear they might be watching me now. Mind you this is not the first time I have seen these triangle shaped objects in this area. I see them quite often actually. I dont live very far from Wright-Patterson AFB. It is not unusual to see several different types of aircraft flying . But they are the usual one's. Big or little , Still the usual type's. \"These are not usual\". And one would really think that if they were UFO ( Alien type Craft ) it would be able to jet off rather fast when it has been noticed. And why do they hover over homes ? I mean most people looking up in the night sky would say That is Noticible for sure ! A craft that is completly still in mid air, floating about someone's home ! and a Triangle shape with lights at each point at that! HELLO ( Laughing ) anyhow that is my story and I am sticking to it ."],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Date of the Event":"04/03/2008 08:20 UTC","Region":"Ohio","Log Number":"US-04052008-0004","Object Features":"Undisclosed","Summary":"Dark Triangle Shaped Object with Lights at each Point","Longitude":"-84.320219"}