{"Disposition":"Insufficient Data","trends":["There have been no other sightings in Solana Beach","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Latitude":"33.006981","Longitude":"-117.259292","Object Features":"Unknown","Date of the Event":"05/15/1978 12:00 UTC","files":["/var/www/straped/mufon/html2text/10166.html.txt","/var/www/straped/mufon/mufon_json/10166.json","/var/www/straped/mufon/org/10166.html"],"City":"Solana Beach","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.006981,+-117.259292(10166)&iwloc=A&hl=en\"> mufon case (10166) map </A>","Log Number":"US-04052008-0005","Object Shape":"Fireball","Case Number":"10166","Region":"California","Summary":"two flaming green to yellow to white (changing color) travelling east to west at Lake Cachuma","Object Flight Path":"Straight-line path","Date Submitted":"05/15/1978 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsThis was quite a while ago, 1978. I was on a school camping trip at lake Cachuma when I and five or six other students witnessed two large glowing objects at a distance of about a quarter of a mile travel from east to west and disappear over some mountains. What really strikes me as totally uncanny about the whole thing is that prior to the sighting, one of the students was totally engrossed with the whole UFO phenomena. In fact, I remember that not only would he not stop talking about ufos prior to our sighting, but he actually stayed up all night scanning the skies for ufos for two or three nights prior to the sighting. In fact, he was the one who initailly saw the object and woke everyone up shouting and yelling. My intitial reaction was, \"I am going to punch him out for waking everyone up and bothering evryone with this nonesense!\" But I quickly saw what he was hollering about and it was flabberghasting. Initially it was a greenish white light followed by a second much smaller light. As the two got closer to where I and five other students were watching them, they changed to a bright yellowish white light. I also observed what appeared to be chunks of perhaps molten material falling from the larger object. When it was at its closest point I stared straight into the light to try and make out what was producing the light. To be honest, it appeared to be some kind of wobbly molten stone. It could be written off as just a tremendous falling star except for the fact that it travelled parallel to the ground and may have maneuvered intelligently above some low mountains as it passed over them. That and the fact that one of the students seemed to know that it was going to happen make it all much more noteworthy than just a large falling star. I must say that due to the distance and the way in which the lights seemed to behave as some kind of meteor, I wasn't terribly emotional in any particular way as I witnessed the whole thing. I think I recall that we were all kind of laughing about it because of how the student who we thought had foolishly stayed up looking for the thing all night, night after night turned out to have been on to something. Perhaps it was the fact that I was sixteen and not terribly good friends with the guy that I never discussed it with him how he knew this thing was going to happen. I also am quite intuitive myself, so I think I just sort of accepted the fact that he somehow knew something peculiar was going to happen."],"Weather Factors":"Unknown","Country":"United States"}