{"Date Submitted":"03/13/2008 01:10 UTC","Object Flight Path":"Undisclosed","Region":"Arkansas","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.959643,+-89.950889(10169)&iwloc=A&hl=en\"> mufon case (10169) map </A>","Log Number":"US-04052008-0008","divs":["Sighting DetailsI am a Flight Attendant for a private charter airline that fly's DC9's for NCAA teams. On March 13th around 1:00pm I was traveling with my crew (empty flight) out of Northwest Arkansas Airport. We had departed during a storm with heavy clouds and wind. When we broke through the clouds, I was amazed with what I had seen above the storm. We were at approximately at 20,000 ft. when I start taking the pictures. I was sitting in the first row with no obstructions. In the photo's you will see a large object that was not visible to my eyes. I was simply snapping away at the sun and beautiful cloud formations. When I was looking at my pictures later in the day, I couldn't believe what I saw. I have looked at the pictures hundreds of times. I thought that it may had a been a reflection from the wing but I was too far in front of it. If you notice the object is up and to the far left. I have searched for over a month to find anything that may resemble what was in my pictures. I truly believe that they closely match the NASA images!"],"Country":"United States","Object Features":"Undisclosed","Case Number":"10169","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10169.html.txt","/var/www/straped/mufon/more/10169_submitter_file1__AC191-5.jpg","/var/www/straped/mufon/more/10169_submitter_file2__AC191-2.jpg","/var/www/straped/mufon/mufon_json/10169.json","/var/www/straped/mufon/org/10169.html"],"Summary":"Picture of object taken from a DC9 aircraft at approx 20, 000 ft.","Weather Factors":"Unknown","Object Shape":"Circle, Cylinder, Disc, Sphere, Other, Unknown","Viewing Distance":"Unknown","Longitude":"-89.950889","trends":["There has been one other sighting in Blytheville","There were no other sightings in Blytheville on or around March 13th 2008","This sighting has never been favorited.",""],"Date of the Event":"03/13/2008 01:10 UTC","Tags":"City","Latitude":"35.959643","City":"Blytheville","Disposition":"Unknown"}