{"Source":"MUFON","Latitude":"34.056854","map":"<A HREF = \"http://maps.google.com/maps?q=34.056854,+-118.234985(10164)&iwloc=A&hl=en\"> mufon case (10164) map </A>","Disposition":"Unknown","Case Number":"10164","Sighting Duration":"Undisclosed","Region":"California","Log Number":"US-04052008-0003","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10164.html.txt","/var/www/straped/mufon/mufon_json/10164.json","/var/www/straped/mufon/org/10164.html"],"Country":"United States","Date Submitted":"06/30/1982 12:00 UTC","Object Features":"Patterned Surface, Other","Object Flight Path":"Straight-line path","Object Shape":"Square, Rectagular","Summary":"Within 100 ft overhead,slow moving, huge, low hum, over back yard.","divs":["Sighting DetailsI do not know why I got up from bed and went into the back yard. The noise was not loud enough to wake me. No whirling sound, just a very low volume hum. The craft was larger than the house, back yard, and the lot next door. The house had four bedrooms, and the back yard was a third again as large. The bottom of the craft was straight across, three or four times as long as it was wide. The bottom was not smooth. There were formations that square or rectangular. There were some lights mostly blue and red. There might have been some green. They were spread throughout the bottom of the craft. These lights did not blink, but some went on while others went off, but did not do so frequently. No pattern whatsoever; and they were not bright enough to light anything up, not even the tops of the trees. There were 15 to 25 lights on at a time. The craft went over my head from the Fairfax district (the La Brea tar pits) toward Rancho Palos Verdes. I could never quite figure out the shape of the top of the craft as the craft was too dark. My friend in the house was angry that I did not wake her up so she could see it too. The window to where she was sleeping was directly behind me, but I could not even think of doing anything else but watching it. I did not light a cigarette, I think they might have been in the house. I came back in the house after I saw it near Rancho Palos Verdes and went to bed. I thought it might have been the Goodyear blimp, but it was such an unusual time of night."],"Viewing Distance":"21-100 Feet","Longitude":"-118.234985","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around June 30th 1982"],"Tags":"City","City":"Los Angeles","Date of the Event":"06/30/1982 12:00 UTC"}