{"map":"<A HREF = \"http://maps.google.com/maps?q=41.581439,+-85.199417(10162)&iwloc=A&hl=en\"> mufon case (10162) map </A>","trends":["There have been no other sightings in Stroh, IN","This sighting has never been favorited."],"Object Features":"Unknown","Log Number":"US-04052008-0001","Date Submitted":"04/04/2008 12:00 UTC","Date of the Event":"04/04/2008 12:00 UTC","Source":"MUFON","Country":"United States","Longitude":"-85.199417","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/10162.html.txt","/var/www/straped/mufon/mufon_json/10162.json","/var/www/straped/mufon/org/10162.html"],"Disposition":"Unknown","City":"Stroh, IN","Object Shape":"Star-like","divs":["Sighting DetailsMy friend told me of the recent ufo activity at night that he and his entire family witness on regular occasion, lights dancing in the night sky and hovering. After going to his house and witnessing it for several hours, these star like objects remained, with on average 7+ in the sky at any given time. They rapidly change colors, and when viewed through binoculars or telescope apear to have the colors blue white and red, like a flag. They have been out every clear night, and they just go in any direction, go side to side, circles, and i even witnessed two seperate objects split into two lights each, then form back into a single light of their own. Having just seen star like shapes recently, My friend told me about how bright they actually get, being so bright that you can name off each color with the naked eye. It seems like the objects are just sitting and observing in the sky, while \"dancing\" at the same time. Also, tonight i witnessed one shoot up in front of a plane headed east, as if to say \"hey look at me\". My feelings toward it is this, Ive always believed in them, but I tried ruling out every single possibility from shows ive watched and plane old common sense. They are DEF NOT planes, sattelites, weather balloons,stars, or any of the above listed."],"Latitude":"41.581439","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Tags":"City","Region":"Indiana","Case Number":"10162","Summary":"Multiple witnesses including myself over the past week+ have been witnessing star like ufos at night, with 7-8 in the sky at any given time, all night.","Weather Factors":"Unknown"}