{"Tags":"City","divs":["sighting details1-getting a driving lesson in my brothers car on a dirt road n.of subdivisionin bloomington mn,foresthaven suburb division. 2- we stopped to look west tosee the sunset. 3-lense\\ovalshaped clouds on horizon 502b miles away,sun a 1\\4 visible due to the hills a 1\\2mi away. 5- seeing lightcumulus and standing lenticular clouds, one of the clouds started moving. beforeor after, a large bird almost condor size, launched from the woods in front ofus and flew west. it looked like a large bat with a beek, we heard its wingsflap.we were calm and standing. q- 5266: two f4 phantoms,full after burners with the sonic booms from e.tow.flewdirectly overhead, 10002bfeet,markings and details easily visible, and they split to intercept. momentsafter the f4s passed our position, the object was already moving n.tos.i.e.right to left within our view and then west. it appeared to have a distrailbehind it and left our view due to hills, f4s also. 4- we stood motionless andemotionless for several minutes.. i didnt know what to do, but wanted tocontinue to observe the rest of the sunset.my brother started his car and saidlets get out of here!!we left26 arrived home late for dinner. was this an incursion of dewline? a soviettu-144? i was a student pilot flying clubwise though couldnt solo til age16.bro was a mechanicle tech at paper factory.before26after this incident,have had recurring thoughts of what i thought was achildhood dream when i was4-5,1964-5,this above incident happened in 1973. iwill now re-submit my thoughts\\experiences from what i believe happened then, in another mufon\\form now."],"Date Submitted":"09/30/1973 05:00 UTC","City":"Bloomington","Latitude":"44.842698","Summary":"Two F-4 Phantoms chased it!!!","Country":"United States","Longitude":"-93.29176","files":["/var/www/straped/mufon/html2text/1016.html.txt","/var/www/straped/mufon/mufon_json/1016.json","/var/www/straped/mufon/org/1016.html"],"Sighting Duration":"00:30:00","Viewing Distance":"Over One Mile","trends":["There have been 9 other sightings in Bloomington","There were no other sightings in Bloomington on or around September 30th 1973"],"Object Flight Path":"Unknown","Region":"Minnesota","Source":"MUFON","Object Shape":"Oval","Object Features":"Undisclosed","Case Number":"1016","Weather Factors":"Unknown","Log Number":"","Date of the Event":"09/30/1973 05:00 UTC","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=44.842698,+-93.29176(1016)&iwloc=A&hl=en\"> mufon case (1016) map </A>"}