{"Region":"Minnesota","Case Number":"10160","Weather Factors":"Does Not Apply","Object Features":"None, Other","Tags":"City","divs":["Sighting DetailsWhile driving on the Dewing hwy before the town of pine center, on my way home to Brainerd,MN I saw a large object in the sky above the tree line, it was a dull grey color it had a slight concave, or dip in the center it was almost triangular in shape, but with no distinct sharp edges. After a few moments of seeing it, my mind realized what was really happening as if for a few moments before I was mesmerized and needed a bit of time to sum up the event. I then instantly took note of the time on my clock, and noting every detail I could of this, for I knew this is very important, and Iam a very observant person to begin with.The object was large it was high above the tree line, and I had a very good referance point. There was also something weird about the bottom of this thing, it had a almost greenish hue along the bottom, just like a thin line, not bright, just like a hue of somekind that was hard to make out, but was all along the bottom edge length wise. I tried hard to see around the thing but couldnt tell its exact dimensions, I could only distinguish a triangle shape is all. It hadnt appeared to move during this time, but as I was now slowing down for some reason to pull over it slightly tilted to the right and up but not any other way, and it was gone, and almost as if there was a pocket in the sky or something, like a layer. Very hard to explain. This whole event probably only lasted a couple of minutes I would say at best. I had had my driver side window down prior, and during this, but there was never any sound that I heard coming from it nor any lights, flashing,etc. The sun was also still out when I saw it, and it was to the left of where the sun appeared in the sky and lower, but no glint or reflection from it, just a dull grey color. I cant be sure how large it was, but just a guess would be between 75-100 ft in length. Not sure how deep,etc it was, and no way to tell from where I was seeing it. There also was no other vehicles behind or in front of me from either side, so I dont know who else could have witnessed it. I drove 60 mph after this trying to gather myself, and trying to recall everything. I made it to town and immediately went to my local sherriffs dept. and spoke to an officer giving every detail I remember. That was all I could do, but I know this needed to be told to someone who may have experince in this type of area. I came home went on the internet, and looked for anything that I could that would give me a direction to who to contact, it was frustrating, I was nervous, and couldnt stop thinking about this, and I didnt find not one person, or link the night this happened. I hadnt until today saw any response to help from anyone, and I couldnt sleep at all the night that this happened so I was extremely tired after the next day. And this is how I got the info to contact you. I want to let you know, Iam not in any way mentally disabled,I also once lived in Dover Delaware with my sister, and later lived by Leavenworth air base as well. I have seen so many conventional aircraft to know this is not something like anythimng I have ever seen, no question,not even close. It was not any ballon, kite, mirage period. It was real. Ironically the only thing I can even say this could resemble is something from a science fiction movie. I cannot think of anything to add, and my typing is very slow, and Iam better talking with my voice than on a keypad. I hope that this information will be helpful. Unfortunately I didnt have access to any cell phone, or camera to capture this event.I think someone needs to know, and Iam not afraid to to talk about this experience, as I was the day after it happened. I had worried after reporting this I would either be labeled a lunatic or something by someone, or could stir up a hornets nest from depts. or any agencies, this is from what Ive seen on T.v. I guess. Just now read not to put personal info, so I will not put my ph.# no down unless it is needed later sometime. I tried to put all this down as best I was able."],"Date Submitted":"04/02/2008 07:01 UTC","Country":"United States","trends":["There has been one other sighting in Pine Center","There were no other sightings in Pine Center on or around April 2nd 2008"],"Object Flight Path":"Hovering then path","Log Number":"US-04042008-0006","Summary":"dull grey,concave like center","Latitude":"46.214406","map":"<A HREF = \"http://maps.google.com/maps?q=46.214406,+-93.914426(10160)&iwloc=A&hl=en\"> mufon case (10160) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10160.html.txt","/var/www/straped/mufon/mufon_json/10160.json","/var/www/straped/mufon/org/10160.html"],"Viewing Distance":"Unknown","Longitude":"-93.914426","Object Shape":"Chevron, Diamond, Triangle","Sighting Duration":"Undisclosed","City":"Pine Center","Disposition":"Unknown","Date of the Event":"04/02/2008 07:01 UTC"}