{"Case Number":"10170","Longitude":"-97.735711","City":"Austin","files":["/var/www/straped/mufon/html2text/10170.html.txt","/var/www/straped/mufon/mufon_json/10170.json","/var/www/straped/mufon/org/10170.html"],"Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Circle","Viewing Distance":"Unknown","Disposition":"Unknown","divs":["sighting detailsi'm taking care of my mother, who is disabled, and she woke me up just before 3:30am. not for the ufo but for her personal needs. after i got her settled, i went outside for a cigarette. i looked up from my chair on the porch, and saw the \"star\" looking object. then i noticed the smaller lights flashing in a circle around it. the lights were random, no particular order, and were fainter than the star-looking light. at one point a smaller light flashed on and went into the brighter light. i only watched it for about an hour, but it moved erratically, and i ran inside trying to find a camera. unfortunately i couldn't find one that would show the object\\s. so i just went back to watch it for a little while before i went back to sleep. this is not my first sighting, but it's the first i ever reported. after a while you don't get so excited with them. each one was different. anyway, i'll attach a computer drawing of what i saw, but there's not much detail. hope it's helpful. sorry i couldn't tell you when it stopped either."],"Country":"United States","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"30.269603","Source":"MUFON","Date Submitted":"04/05/2008 03:30 UTC","Weather Factors":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.269603,+-97.735711(10170)&iwloc=A&hl=en\"> mufon case (10170) map </A>","Log Number":"US-04052008-0009","Summary":"Bright light with small flashing lights flashing in circle around it","Date of the Event":"04/05/2008 03:30 UTC","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around April 5th 2008","This sighting has never been favorited.",""]}