{"Country":"United States","Object Shape":"Cone","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Summary":"cone-shaped craft descended from sky and hovered in back of garage","Object Flight Path":"Undisclosed","Case Number":"10179","Region":"Michigan","files":["/var/www/straped/mufon/html2text/10179.html.txt","/var/www/straped/mufon/mufon_json/10179.json","/var/www/straped/mufon/org/10179.html"],"Latitude":"45.753247","Longitude":"-87.05722","divs":["Sighting DetailsI am writing for my son who is mentally retarded.He neither has the imagination nor does he have the knowledge of U.F.O's to create such an elaborate story,although he is high-functioning and very verbal.On the night in question,my wife and I had gone to bed at about 9:30 P.M. James wanted to watch a T.V. program,so we let him stay up later.He decided to goe to the kitchen to make a sandwich when he noticed a light descending from the southern sky and \"float\" above the trees located at the back of a field that is approximately 350 yards long.The object then slowly lowered to about 20-feet above the ground at the edge of the back field.Suddenly,the object moved very slowly in a direct path towards the house.He said that it was shaped like an ice cream cone and was glowing with a purple and white light with small lights that surrounded it.The object floated up to an area between our garage and apple tree and hovered there for a minute or two;the garage is approximately 25-yards from the back of the house.He said that he fealt a \"tingling\" vibration on his feet but did not hear any sound.The craft then slowly \"floated\" to an area between the garage and our water pump-house.It then hovered directly above the pump house for a couple minutes and then soared upwards and south-easterly at a tremendous speed until it was a dot in the sky and then completely vanished! We grilled him several times about this story but he never waivers,repeating the same story,over and over...and James only has the mental capacity to repeat what he SAW!Is this unique that a mentally challenged person sees a U.F.O. with such fine detail of events? My wife and I completely believe him!"],"Source":"MUFON","Object Features":"Undisclosed","City":"Escanaba","map":"<A HREF = \"http://maps.google.com/maps?q=45.753247,+-87.05722(10179)&iwloc=A&hl=en\"> mufon case (10179) map </A>","Log Number":"US-04062008-0007","Tags":"City","Date Submitted":"06/08/1996 11:00 UTC","Date of the Event":"06/08/1996 11:00 UTC","trends":["There have been 9 other sightings in Escanaba","There were no other sightings in Escanaba on or around June 8th 1996"],"Weather Factors":"Unknown","Sighting Duration":"00:15:01"}