{"Case Number":"10174","divs":["Sighting DetailsObject change color,red, vivid blue, white. One was gold colored pulsating. We are located just west of Las Cruses 2 miles. During viewing a airline size plane flew in the same direction guessing his altitude 20000 feet, the objects were gauged to be in near earth orbit. We were looking southwest at about 5 degrees above horizon, colors visable with unaided eye brilliant color change but not stobe like flashes. Additional objects same discription using south as the 12 o clock position first object estimated above 100k feet agl, #2 at 3 o clock about 15 degree above horizon farther down range, with aided eye binocular 75 power visable color change mostly gold, but did flash multi color, next object multi colored lights very high intensity, flash colored unaided eye 30 degrees above horizon. Then, at the northeast, same object 30 degree above horizon, mulit colored flashing, much closer. This one much more active interval of color change. When viewed through binoculars it would actually reflect off the glass lense dust difusing. It was if we were standing right in the middle of the circle of these objects that were about 50 to 70 miles from our position, so that would put them about 140 miles from northeast to southwest. The sky was extreme clear, no visual oddities with star light or planets. Two shooting start observed, not identified with these objects. No audible noise heard. No movement observed. All objects seemed to be geo syncronus as time elapsed the object in the southwest seemed to move lower in the horizon. These objects have not been seen before as I routinely glance at the stars nightly. I was aware of the Big Dipper and Polaris in reference to the objects. Did not loose sight of objects, still visable. 6 adults with me also discribe the visual oddities. Have many photos, stills and video, will upload tomorrow."],"Weather Factors":"Unknown","Log Number":"US-04062008-0002","Disposition":"Unknown","Source":"MUFON","Date of the Event":"04/04/2008 11:30 UTC","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around April 4th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.32288,+-106.756984(10174)&iwloc=A&hl=en\"> mufon case (10174) map </A>","City":"Las Cruces","Region":"New Mexico","Date Submitted":"04/04/2008 11:30 UTC","Latitude":"32.32288","Summary":"More than 14 same type objects","files":["/var/www/straped/mufon/html2text/10174.html.txt","/var/www/straped/mufon/mufon_json/10174.json","/var/www/straped/mufon/org/10174.html"],"Longitude":"-106.756984","Object Flight Path":"Undisclosed","Object Shape":"Diamond, Flash, Sphere, Other, Unknown"}