{"divs":["Sighting DetailsI was driving East on CR 72 toward Auburn, AL between CR 188 and CR 82 about 1:45 am one morning when I noticed off to my right and ahead of me up in the dark sky was an orange-reddish spherical glow. The light stood out in the beautiful, clear night sky and grabbed my attention because of its illuminating light unparalleled in the night sky. I could not gauge how high the object was above the trees but it had to be maybe at least a quarter or half mile high. The object was a good mile or so from me or maybe even several miles away. I could not tell for sure, especially since it was over 2 years ago, although I remember the date and time of the event and the shape of the object like it appeared to me yesterday. I figured the light was maybe a star or something, yet the object could not have been the moon nor a star because the object was closer to the earth than a star or the moon would be... a lot closer. Not a second after I had noticed it, the stationary object immediately shot away leaving a streak of light as it flashed out of sight in the blackness of the sky. This streak of light resembled the streak of light left by the Millennium Falcon as the spaceship sped into hyper drive in the movie Star Wars. It all occurred so suddenly that I figured I saw a UFO because it was an object that I could not identify and it was hovering in one spot... flying... a UFO. I am intently interested in the UFO phenomenon. I had been studying and continue to this day to study the UFO phenomenon and read both fictional and non-fictional resources on the issue. A friend riding with me at the time of the sighting was studying and did not notice it at all for the sighting was over almost before it began. I have never seen anything like it before nor since. The reason I am just now coming forward is that I had been debating whether to share this information. Also, I would like to know if there were any other sightings in the Auburn area that fateful morning that may or may not be related to my own. Due to the abrupt sighting, no photo or video was taken of the event."],"Object Features":"None","Object Shape":"Sphere","Object Flight Path":"Stationary,Straight-line path","Summary":"Saw reddish-orange spherical glow up in night sky; larger light than moon or star or any other light in the sky.","files":["/var/www/straped/mufon/html2text/10182.html.txt","/var/www/straped/mufon/mufon_json/10182.json","/var/www/straped/mufon/org/10182.html"],"City":"Auburn","Date Submitted":"11/18/2005 01:45 UTC","Country":"United States","Sighting Duration":"00:00:01","Source":"MUFON","Longitude":"-85.472622","Disposition":"Unknown","Date of the Event":"11/18/2005 01:45 UTC","Viewing Distance":"Over One Mile","Log Number":"US-04062008-0010","Latitude":"32.618077","Tags":"City","Region":"Alabama","Weather Factors":"None","Case Number":"10182","map":"<A HREF = \"http://maps.google.com/maps?q=32.618077,+-85.472622(10182)&iwloc=A&hl=en\"> mufon case (10182) map </A>","trends":["There have been 2 other sightings in Auburn","There were no other sightings in Auburn on or around November 18th 2005"]}