{"files":["/var/www/straped/mufon/html2text/10187.html.txt","/var/www/straped/mufon/mufon_json/10187.json","/var/www/straped/mufon/org/10187.html"],"Object Features":"Undisclosed","Latitude":"41.293889","Date of the Event":"03/14/2008 09:09 UTC","Date Submitted":"03/14/2008 09:09 UTC","divs":["Sighting DetailsWitness called State Director the day after the first group of sightings and gave a lengthy report. The State Director and Assistant State Director went to the witnesses' house a few days later and interviewed witness, husband, son and daughter. Her report follows: I had stepped outside on my deck of our house in town for a smoke. I always look up, hoping to see a UFO. Suddenly I saw 3 lights in a triangle pattern which is a little wider than my hand at arm's length. They appeared to be hooked together, and I thought I could see a shadowy triangular shape with the lights at the corners. But they were moving too fast to be sure. The lights were round and not much smaller than the full moon. They were very pale amber in color and not very bright. They were going west to east and went across the sky in about 4 or 5 seconds. (Group 1) I called my husband to come out and watch. He didn't see the group and was skeptical, offering other explanations. Then we saw 5 lights in a V-shape come from the west to the east. The lights were similar to the first group in color and speed. (Group 2) We called our son and daughter to watch. Our son is a skeptical, logical type person and at first didn't believe us until another single light similar to the others came past. He tried to use binoculars but couldn't because it was traveling too fast. These groups and the next groups all had about 10 minutes in between them. (Group 3) Then we saw another single light. (Group 4) Then 5 or maybe 7 that flew together in a V formation, and then peeled off to the left and right. (Group 5) Then 5 more in a line, one behind the other. (Group 6) Always after the lights we saw several planes in all directions around them. These planes were similar to what we see at other times, but it seemed notable because there were more of them. They were quite high, but we could see them because each one had a row of many lights, bright and flashing red and white, on each wing and on the front of the fuselage. From that we could tell the shape. The wings went crossways, not swept back. Next I saw a much larger plane with swept-back wings. It came right over our house, very low, and made a lot of noise. We thought it very strange for a plane so large to come that low. My husband drew a sketch of it, showing a round jet opening at the back. Our daughter described seeing the lights too, but her sketch is more like a circle with lights inside it. She isn't sure whether the lights were round or more like trails because it moved so fast. She saw 9 or 10 of these altogether. The descriptions are not exactly the same, but since the objects came and went so fast that doesn't surprise me too much. I've always wanted to see a UFO. That's why I always look up when going outdoors. I'm very glad others corroborated my sighting so I know I'm not crazy. ******************************* Two weeks later, on March 28, about 8:30 p.m. we saw lots of planes going back and forth east and west. Then at 9:11 we saw about 20 lights in a very wide V, not a perfect shape, sort of like a flock of geese, but moving much faster. At about 11 my husband saw a very bright light. It first appeared to be a moving star, then it suddenly expanded to about the size of a cantaloupe at arm's length, then it WHISHED up and away very, very fast until lost to view. I have included the statements written by my husband and son as attachments."],"Country":"United States","Viewing Distance":"Unknown","Tags":"City","Case Number":"10187","Log Number":"US-04062008-0015","Disposition":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.293889,+-92.644444(10187)&iwloc=A&hl=en\"> mufon case (10187) map </A>","Object Shape":"Disc, Triangle, Other","Summary":"Several groups of lights separated by about 10 minutes","Region":"Iowa","trends":["There has been one other sighting in Oskaloosa","There were no other sightings in Oskaloosa on or around March 14th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","City":"Oskaloosa","Weather Factors":"None","Longitude":"-92.644444"}