{"trends":["There have been no other sightings in Menard","This sighting has never been favorited."],"Log Number":"US-04062008-0008","Longitude":"-99.786459","Disposition":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Latitude":"30.917674","Object Features":"None","Tags":"City","Case Number":"10180","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/10180.html.txt","/var/www/straped/mufon/mufon_json/10180.json","/var/www/straped/mufon/org/10180.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy brother inlaw and I were fishing on the san saba river in TX in the early morning houres 2-3 am of the early to mid 90s I can probley get a closer time frame if important.when we saw what at first we thought was a falling star when you first see them they seem to go slow then speed up. Well this thing just kept going at the same pace across the sky it was about the size and shape of any other star just brighter like a satellite but I had never seen one at that time.I have now and know that what we saw was not a satellite.We watchd it for probley a min or so and then it seem to stop and change directions almost at the same time and them sped off at twice the speed it had been covering the sky till it went out of sight. As best as I can tell it came from the East going west turning southeast. I googled the river we were on and got a satellite photo of the area and figerd out which way it was going when I backd the image out it look like it might have been following I-20.that area down ther is know as an oil burner route for military plains Infact we have seen many planes at treetop down there .This thing had No sound what so ever I don't know what the sr-71 would look like at 70,000 to 80,000' or if you would hear it .My wifes gradfather told me he walks with a retired policeman that described the same thing to him and for about the same time period and he was in San Angelo Tx at the time some sixty miles from mertzon."],"Date Submitted":"06/30/1993 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Path with directional change","Summary":"we thought it was a falling star or satellite but it change directions.and sped up","Region":"Texas","Date of the Event":"06/30/1993 12:00 UTC","City":"Menard","map":"<A HREF = \"http://maps.google.com/maps?q=30.917674,+-99.786459(10180)&iwloc=A&hl=en\"> mufon case (10180) map </A>"}