{"trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around November 30th 1972"],"Latitude":"26.127868","divs":["Sighting DetailsBack in either 1973 or 1975 (I am the world's worst on dates) I was driving across Florida at about midnight. A UFO crossed the highway in a northerly direction. It must have been about 30 feet in diameter. I say diameter because it was \"cigar shaped\" as one would expect a round shape to look when seen on edge. It glowed with the same Kelvin color as a cool flourscent light. Behind it was an Air Force jet chasing it. The UFO was leaving it at a rapid rate. I would guess that it was traveling at three times the speed of the chase plane. They were so low that I could have read the numbers on the jet if it had been daylight and I had time. They weren't much above tree top level. I am very glad the jet was in the picture because it gave me a reference point to determine size and altitude. It all happened fast but I was a. not drinking, b. not sleepy, c. not prone to fantasy. I have a theory about why the government won't admit they are real. Imagine yourself as the head poobah of an island nation that is yet undiscovered. You, your family and a priesthood are the one and only authorities. Your family has a monopoly on on the production of canoes, food, etc. Your hold on power is dependent on the population's awe of you and your power. Reports from fisherment start coming in about huge ships they have seen in the distance. Would you want the people to know about them and the fact that there is another great power out there? I don't think so. On two TV documentaries I have seen \"insiders\" say that their understanding of the government's reluctance to admit UFO's exist is the fear of what it might do to organized religion. Feel free to distribute this anywhere you would like and to contact me."],"Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/10186.html.txt","/var/www/straped/mufon/mufon_json/10186.json","/var/www/straped/mufon/org/10186.html"],"Viewing Distance":"21-100 Feet","City":"Fort Lauderdale","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.127868,+-80.134469(10186)&iwloc=A&hl=en\"> mufon case (10186) map </A>","Tags":"City","Object Features":"None","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"11/30/1972 12:00 UTC","Weather Factors":"None","Region":"Florida","Summary":"UFO was headed North and crossing Alligator Alley","Log Number":"US-04062008-0014","Disposition":"Unknown","Date of the Event":"11/30/1972 12:00 UTC","Case Number":"10186","Longitude":"-80.134469"}