{"Tags":"City","Date Submitted":"11/30/1979 12:00 UTC","trends":["There have been 24 other sightings in Fort Walton Beach","There were no other sightings in Fort Walton Beach on or around November 30th 1979"],"files":["/var/www/straped/mufon/html2text/1018.html.txt","/var/www/straped/mufon/mufon_json/1018.json","/var/www/straped/mufon/org/1018.html"],"Date of the Event":"11/30/1979 12:00 UTC","Log Number":"","Object Features":"Other","Region":"Florida","City":"Fort Walton Beach","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Windy","Summary":"UFO siting in 1980, Ft Walton Beach area.","Longitude":"-86.609391","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.421391,+-86.609391(1018)&iwloc=A&hl=en\"> mufon case (1018) map </A>","divs":["Sighting DetailsI will do my best to give the description of my encounter.This would have been around 1980. My family was living in Alabama, and a friendof mine had invited me to go to the Ft Walton, Fl area camping with her family. We stayed in a KOA camp ground. Her parents stayed in a small pop-up camper andmy friends father had set up a tent (one you could see all the way around)rightin front of the camper. I can remember we cut our camping trip short due to ahurricane forming. The one day we went to the beach the ocean was very rough andthere were a lot of dead fish on the beach. (Unusual weather conditions) Thatnight, it had yo be 1:00 to 2:00 am I woke up in the tent, and sat straight uplooking at the most incredible sight I have ever seen. The \"football\" shapedobject was hovering over the distant treeline of pine trees. It was glowinggold....and in the center was a round circle that was EVEN golder. It lookedlike a huge eye.....I remember thinking. I watched it and it moved along thetreeline, no sounds. I tried waking up one of the girls camping with us and sheonly saw it (sleepy eyed)for a split second and it vanished. I actually watchedthis object 5-6 min. The next morning I did tell my friends parents.I have told this story all of my life whenever \"sightings\"are talked about. Itwas the most incredible sight!! As I have grown older I have yet to be abe tologically to explain what I saw, but Ill never forget it, and can close my eyesand see it plain as day! I am glad to be able to finally be able to report thisto sighting to the proper organization. Thank you!"],"Viewing Distance":"101-500 Feet","Case Number":"1018","Sighting Duration":"00:05:00","Latitude":"30.421391","Country":"United States","Object Shape":"Oval"}