{"Date Submitted":"04/05/2008 11:00 UTC","Region":"Missouri","Object Shape":"Diamond","Date of the Event":"04/05/2008 11:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:03:00","Longitude":"-90.222611","divs":["Sighting DetailsI was walking into our bedroom to feed the baby and I was also talking on the phone to my mom. I walked to the window (facing west)to shut the blind when I noticed a bright yellowish light in the southwestern sky. I was looking sort of catty-corned towards the Missouri river. I thought it was just an airplane at first, but it appeared to hover for around a minute. I watched it a little longer, and it seemed to waver and quiver around, so I figured it was probably a planet, since I've seen Venus appear to do similar things due to atmospheric distortion. As I watched, the light sunk below the tree line, when this happened, I got off the phone in order to pay attention to this light better. As I watched, I could see the light moving back and forth and up and down behind the trees, I'm not sure just how long I watched it do that, then the light emerged from the trees at about treetop level and started across the road and into the field, heading directly towards our house(the tree line is maybe about 300 yards from us). The light appeared to be a diamond shape composed of 3 or 4 smaller yellowish lights, and there was no noise associated with it. When I saw it start towards the house, I yelled and shut the blind as fast as I could. My husband heard me yell, and asked what was going on. I ran into the living room and told him what I saw, so we both went outside to look. By the time we got outside, the light was gone."],"trends":["There have been no other sightings in West Alton","This sighting has never been favorited."],"Latitude":"38.865049","City":"West Alton","Disposition":"Unknown","Tags":"City","Object Features":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.865049,+-90.222611(10183)&iwloc=A&hl=en\"> mufon case (10183) map </A>","Case Number":"10183","Object Flight Path":"Hovering then path","Source":"MUFON","Log Number":"US-04062008-0011","Summary":"Bright yellowish light in sky hovered, moved behind trees and took off across field towards house","Country":"United States","files":["/var/www/straped/mufon/html2text/10183.html.txt","/var/www/straped/mufon/mufon_json/10183.json","/var/www/straped/mufon/org/10183.html"]}