{"Object Flight Path":"Straight-line path","Weather Factors":"Does Not Apply","Summary":"Star like UFO seen in south wales","Disposition":"Unresolved","Tags":"City","Date Submitted":"04/02/2008 08:20 UTC","Longitude":"-2.98153","Region":"Wales","City":"penperlleni","map":"<A HREF = \"http://maps.google.com/maps?q=51.735961,+-2.98153(10191)&iwloc=A&hl=en\"> mufon case (10191) map </A>","Sighting Duration":"Undisclosed","Case Number":"10191","Object Features":"Unknown","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/10191.html.txt","/var/www/straped/mufon/mufon_json/10191.json","/var/www/straped/mufon/org/10191.html"],"divs":["sighting detailsi was walking our dogs with my mother in the countryside not far from our home in penperlleni, south wales on 2\\4\\08 at 20:20pm. it was just starting to get dark and we saw what we initially thought was a really bright star,only then standing still looking at it we realised it was moving. it was bigger than the few other stars that were out and alot brighter. it was moving at a fast, steady pace at what looked to be at a high altitude. unlike shooting stars or comets it did not have a tail, it was very similar to a star only brighter. an aircraft was nearby this thing and looked like it was at the same altitude,this thing was bigger than that aircraft and faster. eventually after a couple of minutes it went into the clouds and was out of sight. after speaking to a few people and watching videos on youtube.com i thought it could be a satellite,althought i really have no idea what it was,and neither does my mother. i was pretty excited after seeing it but definetely felt on guard the rest of the way home. after seeing it there appeared to be alot of aircraft around that area although that could have easily just been a coincidence."],"trends":["There have been no other sightings in penperlleni","This sighting has never been favorited."],"Country":"United Kingdom","Date of the Event":"04/02/2008 08:20 UTC","Latitude":"51.735961","Source":"MUFON","Log Number":"GB-04072008-0003","Viewing Distance":"Unknown"}