{"Case Number":"10199","Tags":"City","Country":"United States","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","Date of the Event":"02/22/2008 12:00 UTC","Object Features":"Unknown","Region":"California","Summary":"chevron or delta 3 glowing orbs silent at night extremely low altitude","City":"San Francisco","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10199.html.txt","/var/www/straped/mufon/mufon_json/10199.json","/var/www/straped/mufon/org/10199.html"],"trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 22nd 2008","This sighting has never been favorited.",""],"Disposition":"Hoax","divs":["sighting detailsmy friends were driving in rain n to san fran after we had been hanging out in industrial district la. they had just recently purchased canon g9. the link below is for the video. they asked me to report object because they are less familiar with subject. this video is the end of the incident. allegedly the object had already buzzed them, seemingly land and or stop extremely close to ground then buzz them again at such a low altitude that in the video object the appearance of what looks like oncoming headlights but is actually the object. it passes them and case is able to follow with camera through passenger windows of suburu forrester so has good window views. then object passes them again mysteriously banking for the first time (strangely) during the whole incident. this object never banked during any of the maneuvers or landing according to both case and andrew. a car drives between them and object showing how low and close the object is. some evidence of hybrid antigrav\\conventional flight characteristics, intial story told to me by witnesses suggests pure antigrav. http:\\\\video.google.com\\videoplay?docid=2516411713694043799&q=burkeas&total=9&start=0&num=10&so=0&type=search&plindex=7 http:\\\\www.simmonsandburke.com\\"],"Longitude":"-122.417436","Source":"MUFON","Object Flight Path":"Path with directional change","Latitude":"37.78411","Log Number":"US-04072008-0011","Date Submitted":"02/22/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.78411,+-122.417436(10199)&iwloc=A&hl=en\"> mufon case (10199) map </A>"}