{"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=37.089987,+-94.505231(10198)&iwloc=A&hl=en\"> mufon case (10198) map </A>","Summary":"Black disc with no light reflecting off of it","Date Submitted":"08/10/2007 12:00 UTC","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10198.html.txt","/var/www/straped/mufon/mufon_json/10198.json","/var/www/straped/mufon/org/10198.html"],"Country":"United States","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around August 10th 2007"],"City":"Joplin","Date of the Event":"08/10/2007 12:00 UTC","Tags":"City","divs":["Sighting DetailsI was driving west on 32nd street in joplin when I came to the stoplight at 32nd and rangeline. I was about the 4th car back . I sat there for only moments when I noticed a black disc about 15ft across hovering over 32nd street at a very low altitude (aprox. 150ft). I thought at first it was a balloon tied to the ground to promote the local radio station , but the closer I looked the more I began to realize it was too large. The wind was blowing about 35-40mph at that altitude for anything to be stationary . Now this was a very sunny day with no clouds but there was no reflection of light from the sun beaming down on this disc. It was like it was absorbing the light instead of reflecting it. (even a black balloon reflects a little light) It began to wabble a bit and turned upright. The weird part of this sighting is that I looked around and there was only one other person that I could see that was watching this . Everybody else did not even look up. When I drove by I looked back and it was gone. I have also seen something of a bright light one other time that made no sound and did not react like a normal aircraft."],"Latitude":"37.089987","Log Number":"US-04072008-0010","Weather Factors":"Windy","Case Number":"10198","Sighting Duration":"Undisclosed","Longitude":"-94.505231","Region":"Missouri","Object Flight Path":"Stationary","Object Features":"None"}