{"Viewing Distance":"Unknown","Object Shape":"Oval, Sphere","Date Submitted":"05/31/1998 12:00 UTC","Sighting Duration":"Undisclosed","Region":"Colorado","Country":"United States","files":["/var/www/straped/mufon/html2text/10208.html.txt","/var/www/straped/mufon/mufon_json/10208.json","/var/www/straped/mufon/org/10208.html"],"Tags":"City","Object Features":"None","trends":["There have been no other sightings in La Veta","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.505012,+-105.007775(10208)&iwloc=A&hl=en\"> mufon case (10208) map </A>","Source":"MUFON","Disposition":"Unknown","Case Number":"10208","Date of the Event":"05/31/1998 12:00 UTC","divs":["Sighting Details WE had just checked on the horses and crossed the creek. I needed to get rid of some water,( no drinking ) stepped out of the truck and walked behind, my lady stayed in the truck, truck was faceing north,. I was looking at the peaks in the moon light when this round glowing sphere appeared, it was going east to west looked like one of those earth globs that was a soft night light, bluish gray glow, it looked like it came from nowere just next to the west peak. could see the object for just a short time, about a 5 to 6 degrees of travel then left just as quick as it appeared. there was no sound, no fire, this was huge, size was about 20% of the peak from were I was located. The peaks are about 20 to 30 miles from sighting point. Another way of discribing the sighting, is you are standing on one side of an open door way about two of three feet a way and something flies by. you can only see the object through the door way. I could not believe my eyes, I new this was not from present earth. I ask my lady if she hae seen it but she was faceing the wrong way. The reason I am just now saying something is I would like to know if anyone else has seen this type of ufo. Personally I have not seen this type of craft in any ufo files. The time of sighting could be off by a lot the timeing is a guestiment. But I will never forget the feeling or the UFO."],"Object Flight Path":"Straight-line path","Log Number":"US-04082008-0008","Summary":"faceing south towords the twin peaks on land just off of highway 160 mile marker 287","Latitude":"37.505012","City":"La Veta","Weather Factors":"Unknown","Longitude":"-105.007775"}