{"Longitude":"-88.1757","divs":["Sighting DetailsOn Friday April 4th, 2008 between 10pm and 10:30pm I was working in my home office with the TV on when I heard what sounded like a jet about to crash into the house. The noise became louder and louder and eventually passed over the house. Our house is on the flight path for O'Hare airport and we sometimes see light aircraft from a small local airport. We are familiar with the sights and sounds of jets, helicopters, and light aircraft flying overhead. This was louder and sounded like a jet was going to crash into the house. Later, my wife, who also heard the sound said that it woke our daughter up; who thought it was lightning and thunder although it was a perfectly clear beautiful night. I peeked through the blinds of the office window to catch a glimpse of the jet to see if it was in trouble, but all I saw was a set of lights slowly traveling due east away from the house. When I first caught site of it, it was about 100' away and 50' off the ground (much lower than any jet I've seen fly over our house on approach). It appeared to be following the same flight path many other jets use to get to O'Hare. My eyes had not adjusted from the bright office lighting to the night, so I could not make out the shape of the aircraft other than the lights. There were two white lights spread far apart (much farther apart than the runway lights on a typical jet, probably 200' apart). They were far enough apart that I had to turn my head a little to focus on each one. Centered between the white lights was a large blinking red strobe (possibly on the underside of the craft). The red strobe flashed about once per second. As the craft traveled farther away, a second strobe began flashing on what might have been the top of the craft. It flashed at about the same rate but was not synchronized with the other strobe. I specifically looked for red and green strobes on the sides to get an idea of the wingspan, but did not see any. After 10-20 seconds, the craft had drifted out of view (behind the houses in the foreground). I am familiar with many aircraft that have passed over my house, but I did not recognize this one. I thought it might be a B-2 stealth bomber but I have never seen one before except in pictures and I don't know what one would look like at night. If it was a B-2, why would it be flying toward O'Hare? A few minutes later a passenger jet flew on a similar path but more to the south and much higher up. By this time, my eyes were better adjusted. The passenger jet's runway lights were much closer together than the other craft, the red and green strobes on the wings were visible, and you could hear the jet engine whine change frequency as the pilot reduced the throttle. That's when I realized that the engine noise from the other craft didn't have any whine to it. The other craft sounded like a jet at 50000' but hundreds of times louder even though it was moving relatively slowly. More and more passenger jets continued to fly by (about one every five minutes - which is typical of heavy air traffic) but I had not noticed them earlier. Perhaps they were in a holding pattern until the other craft made its way through the night."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.996248,+-88.1757(10203)&iwloc=A&hl=en\"> mufon case (10203) map </A>","trends":["There have been 7 other sightings in Bartlett","There were no other sightings in Bartlett on or around April 4th 2008","This sighting has never been favorited.",""],"Date of the Event":"04/04/2008 10:00 UTC","Object Shape":"Unknown","Weather Factors":"Unknown","Date Submitted":"04/04/2008 10:00 UTC","Sighting Duration":"00:00:30","Summary":"Loud sound from low-flying craft with two white lights and two red strobes","Country":"United States","Object Flight Path":"Straight-line path","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Region":"Illinois","Latitude":"41.996248","Case Number":"10203","files":["/var/www/straped/mufon/html2text/10203.html.txt","/var/www/straped/mufon/more/10203_submitter_file1__MUFONcase10203drawing.jpg","/var/www/straped/mufon/mufon_json/10203.json","/var/www/straped/mufon/org/10203.html"],"City":"Bartlett","Tags":"City","Log Number":"US-04082008-0003"}