{"Object Features":"Undisclosed","Date of the Event":"02/24/2008 09:30 UTC","Country":"United States","Disposition":"Unknown","City":"Key West","divs":["Sighting DetailsI was sitting on a starboard deck of a cruise ship that was travelling in open sea westward, positioned south-southwest of Key West Fla. I was observing the stars in the northern skies as the sky was mainly clear with a few scattered clouds on the horizon. I became intruiged with one particular object as it was definitely spherical and appeared to be situated between the scattered cloud cover and my line of sight. It's size was consistant with that of the stars, or perhaps a bit larger. The object then began to spin in a pinwheel fashion for about 8-10 revolutions and then sped off at tremendous speed toward the northwest. It spun very rapidly and with each revolution, it's area of circumference became larger. It was akin to watching water drain down a sink but only in reverse. I was able to observe the object as it sped off for approx. 1-2 seconds only due to the rate of speed. There was no sounds or any other anomolies associated with it. I found the experience to be rather eerie, but for some reason felt comfortable with it, almost to the point of satisfaction. I am an agnostic when it comes to aerial phenomena, however this sighting was definitely a mind stimulating experience."],"Case Number":"10204","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around February 24th 2008"],"Source":"MUFON","Region":"Florida","Log Number":"US-04082008-0004","Tags":"City","Longitude":"-81.777701","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Date Submitted":"02/24/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/10204.html.txt","/var/www/straped/mufon/mufon_json/10204.json","/var/www/straped/mufon/org/10204.html"],"Weather Factors":"Light","Latitude":"24.563872","Summary":"Spinning Object Spotted at Sea","map":"<A HREF = \"http://maps.google.com/maps?q=24.563872,+-81.777701(10204)&iwloc=A&hl=en\"> mufon case (10204) map </A>"}