{"Source":"MUFON","Longitude":"-80.242856","Latitude":"27.201038","Country":"United States","divs":["Sighting DetailsSeveral weeks ago at the exact same time I witnessed what I believed to be a sattelite at this location. It was at a rest stop on I 95 where I work security. So, I decided to go out back at 2107 again last night and see if it passed ovewr again. Sure enough at exactly 2107 it appeared again. Only this time it did not appear from the horizon. It suddenly appeared directly overhead, as if decloaking. I watched it proceed South for about a minute. The one from several weeks ago moved from West to East. I gave three flashes three times with my mag light. At that time it appeared to slow almost to a stop and its light increased in intesity making it appear twice as big for about 5 seconds. Then it continued to move South and after about 55 seconds simply vanished.It was high up like a sattelite. It was a solid white light and had no strobe lights at all. I dont know if it was signaling me or not when it increased in brightness. I plan to look again each night at 2107. to see which nights it appears. There are a large amount of chemtrails being sprayed in my Area. Especially each evening right before sundown. The red and white aircraft go over and leave their typical x patterns and tic tac toe patterns. This has given me respratory problems."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.201038,+-80.242856(10201)&iwloc=A&hl=en\"> mufon case (10201) map </A>","Log Number":"US-04082008-0001","trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around April 7th 2008"],"files":["/var/www/straped/mufon/html2text/10201.html.txt","/var/www/straped/mufon/mufon_json/10201.json","/var/www/straped/mufon/org/10201.html"],"Region":"Florida","City":"Stuart","Object Shape":"Star-like","Viewing Distance":"Unknown","Object Features":"Undisclosed","Case Number":"10201","Summary":"appeared similar to a satellite in both movement and distance","Tags":"City","Object Flight Path":"Undisclosed","Sighting Duration":"00:02:00","Date Submitted":"04/07/2008 09:07 UTC","Disposition":"IFO","Date of the Event":"04/07/2008 09:07 UTC","Weather Factors":"Unknown"}