{"Log Number":"US-04092008-0004","Longitude":"-112.841457","Latitude":"34.168326","Region":"Arizona","Tags":"City","Object Shape":"Other","Source":"MUFON","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.168326,+-112.841457(10216)&iwloc=A&hl=en\"> mufon case (10216) map </A>","City":"Congress","Disposition":"Unknown","Summary":"Craft seemed to have LISTENED IN on our conversation from MILES away","Case Number":"10216","Date of the Event":"07/31/1988 12:00 UTC","trends":["There have been 5 other sightings in Congress","There were no other sightings in Congress on or around July 31st 1988"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10216.html.txt","/var/www/straped/mufon/mufon_json/10216.json","/var/www/straped/mufon/org/10216.html"],"Country":"United States","Weather Factors":"Unknown","divs":["sighting detailsmy sister-in-law and i were on our way from newport beach, ca to prescott, az for a family baby shower. around 11pm, as i was driving, i saw a small but bright white light far away that was moving strangely across the mountains\\hills... alternating between streaking along and then slowing to almost immediate halt. i said, \"do you see that off to the right?\" \"yes\" was her response. then i asked her a question that one of my brothers had asked me some time before: \"what would you do if an alien ship landed,took you onto their ship and invited you to travel with them... they assured you that you would not be harmed or abused in any manner, and that you would see wonderful things beyond your imagination; the experience of a lifetime... but!! you would be missing \"without a trace\" for an entire week, you could have no contact whatsoever with your family, who would obviouly be distraught over your \"dissapearance. you would be safely returned after the week and able to explain your absence\". all this time we were glancing at the light. her answer was, \"no way\". i said that i would possibly do it, but only with my favorite brother (the one who asked me the question in the first place). at the end of my sentence, the light came straight at us at an unimaginable speed. we thought it would slam into us, but it stopped \"on a dime\" directly to the right of us, about half a football field away, in a field of hay, or? we could see the silhouettes of farm equipment. the lights went out for about one second and then came the light show. the craft was suspended in mid-air (about 3 feet off the ground). when the white lights came back on, the sound was very like the sound of baseball field lights being turned on: \"ch-chunk!\" the lights were under the craft, about the size of very large - semi truck-sized tires and covered by a kind of metal grid. the shape was like a one-story long bell with a flat bottom - shaped like the brim of a hat. all this time we kept repeating \"holy shit; oh my god\", etc. the craft then started doing things that were just a shock, like staying hovering in one spot, first spinning like a top, sideways for 4-5 seconds and then froze for 2-3 seconds and this time spun end over end)- again the ch-chunk, but the lights turned into a light show of blue, red, white, ?? our conversation turned to \"what should we do, should we stop?\" (me) and \"no, keep going!!!\" (her) and then, \"let's just see what it does, come on!\" \"no way, it's my car, just drive, keep going!!\" so i did. we talked and freaked out all the way to prescott and when we arrived and relayed the story to my grandma, she said, oh, that must have been down there in congress; a lot of people see things down there.\" the thing is, even though i had experimented with marijuana many years before, my sister-in-law has always been the most pragmatic, straight-laced person i know. she drank hawaiian punch for her wedding toast. i'll never forget it, whether it was a military exercise or extraterrestrial."],"Date Submitted":"07/31/1988 12:00 UTC"}