{"Longitude":"-75.703274","files":["/var/www/straped/mufon/html2text/10217.html.txt","/var/www/straped/mufon/mufon_json/10217.json","/var/www/straped/mufon/org/10217.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.006496,+-75.703274(10217)&iwloc=A&hl=en\"> mufon case (10217) map </A>","Object Flight Path":"Undisclosed","Country":"United States","Date of the Event":"04/09/2008 12:30 UTC","Date Submitted":"04/09/2008 12:30 UTC","Case Number":"10217","Log Number":"US-04092008-0004","Object Features":"Undisclosed","City":"Downingtown","Region":"Pennsylvania","Source":"MUFON","Disposition":"Insufficient Data","Tags":"City","trends":["There have been 8 other sightings in Downingtown","There were no other sightings in Downingtown on or around April 9th 2008"],"Summary":"Short Bursts of a white then a red lights, then motionless like a star.","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Latitude":"40.006496","divs":["Sighting DetailsI am have been a pilot flying aircraft for 15 years so I know what aircraft look like at night. I took my dog out to the bathroom at 1230am est. I had looked into the sky and noticed a star like object. I looked again it had two intermittent white light that would go on and off around 2 min intervals, and also a red light that would sometimes flash, I do know that aircaft have a red anit-collision light but this was not a anit-collision light also there were no nav lights on the aircraft which aircrat have a red, and green one. Then the object would move into circles then and then zig-zag then stop. All the lights would stop flashing and it would look like a star. Then the whole sequence would start over and over agian. Very odd to me this was not an aircraft. I got cold chills through out my body. I tried to take video of it but my cam coders battery was dead. As for my camera I did take pictures but them came out black with no detail, as it is not a great camera."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}