{"Object Shape":"Flash, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.647857,+-120.986948(10219)&iwloc=A&hl=en\"> mufon case (10219) map </A>","Disposition":"IFO","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Tags":"City","trends":["There have been 48 other sightings in Modesto","There was one other sighting in Modesto on or around February 22nd 2006"],"files":["/var/www/straped/mufon/html2text/10219.html.txt","/var/www/straped/mufon/mufon_json/10219.json","/var/www/straped/mufon/org/10219.html"],"Log Number":"US-04092008-0006","Date Submitted":"02/22/2006 09:05 UTC","Source":"MUFON","Region":"California","Latitude":"37.647857","Case Number":"10219","Longitude":"-120.986948","City":"Modesto","divs":["Sighting DetailsFeb 22,2006 Camcorder pointed N-E, 60 degrees approx, wide zoom, Volume all the way up, and a clear night.I was in my back yard and set up where I set up the night befor, I did not see this happend not intill I watch it on my Camcorder. I had my camcorder pointed at my neighbor back yard, and I could see a light comming off the eve and gutter on the house to the North, and it was moving South. The light became brighter when it came in between the two houses, how it went to the other side of the fence I don't know it didn't go over the top of the fence. The blob of light was pointed more to the North and it stayed there for awhile, and the light reached obove the roof line,and then there was a burst of light that cover the corner of the house to the North,their was a burst of light and there was a beam of light pointed stright up, and a secound beam of light going back and fourth next to the first beam. The big blob of light is now in the middle of the back yard, then there was another big flash which looked like a Rainbow that went all the way up to the top of the screen on the camcord, it had little lines that went all the way around. It was very big compared to the two story house, and the beam of light is pointed stright up and the other one is moving back and fourth, how much I'm not sure and the beam seems bigger then before. Then the lights went out except for the blob of light, then that one went out. As I continue watching the tape there betwen the two houses you ould see a glow going off and on for about 8-10 times. And when I thought it was over you could see in the backyard a object that seemed to bounce off the house by a window and shot off to the South at a angle.It wasen't very big. And then you could see a object go over the house on the North side and dip down. I looked at the house the next day but didn't see any marks on the house.I know the two sighting was for a reason and was able to get it on tape Hi-8 both tapes. In the year of 2006 I have about 40 tapes. Some with U.F.O moving and other moving so fast you had to frezze frame the object just to see what it was, some were very good and clear."],"Object Features":"Unknown","Sighting Duration":"00:05:00","Viewing Distance":"21-100 Feet","Summary":"Lights that shot off a bright Rainbow with lines, and a blob of light, and 2 beams of lights","Date of the Event":"02/22/2006 09:05 UTC","Country":"United States"}