{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"Washington","divs":["Sighting DetailsI was walking home after having dinner at a restaurant with my wife, we were walking east, and I suddenly had the urge to look up in front of me (at about the 11 o'clock position). I just felt like looking up and I saw an oval-shaped white light (about the size of venus) flash right into my eyes for about 1 second. Then the flash stopped and the light became smaller, like the size of a regular star in the night, and moved off to my right, appearing to travel higher and higher until no longer visible. The night was clear and the stars that are out around this time of year were all visible. My wife did not see the initial flash of light but she did see the light as it receaded, getting smaller and smaller. The time was around 8:30 or 8:35 pm. This is the first time I have ever had an experience like this. It was exciting, like being acknowledged by some unknown force or intelligence. It really felt that something not of this world had just connected with me, as if saying \"We see you. Bye.\" Wow, it was really amazing! Since then, I've been looking up at the night sky hoping to see something like that again, but it hasn't happened. When I saw the flash of light, I had the distict feeling that \"aliens\" can see us all the time and can choose to make a connection whenever they want to."],"trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around April 1st 2008"],"Date of the Event":"04/01/2008 08:30 UTC","Case Number":"10214","Country":"United States","Weather Factors":"Unknown","Latitude":"48.767703","Disposition":"Insufficient Data","Summary":"A light flashed into my eyes then moved away.","Date Submitted":"04/01/2008 08:30 UTC","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=48.767703,+-122.482225(10214)&iwloc=A&hl=en\"> mufon case (10214) map </A>","Longitude":"-122.482225","City":"Bellingham","Object Features":"Undisclosed","Object Shape":"Flash, Oval","Sighting Duration":"00:00:10","Log Number":"US-04092008-0002","files":["/var/www/straped/mufon/html2text/10214.html.txt","/var/www/straped/mufon/mufon_json/10214.json","/var/www/straped/mufon/org/10214.html"]}