{"Disposition":"Hoax","divs":["Sighting DetailsOn Feb 21, 2006 I had my camcorder shooting the night sky, for the reason I have been seeing objects in the sky. I had my camcorder pointed N-E, wide zoom, volume on high,pointed at my neighbor back yard, their house is a two story. As I was watching the tape the next day I saw what looked to be the front of a cloud, intill it was moving much faster then a cloud, it came around my neighbor top of their secound story and came around towards the camcorder but would dissiapate, like it was never there. Then there came one that looked like it made a 90 degree turn right for my Camcorder and lite up the whole area by the camcorder. I could see something in the very bright light, but I just couldn't make it out, I was hoping with better equipment we could go frame by frame. the most I could see in the bright light is what looks like a bright black line. After it stop a few minutes later another wave of what all I could say what looked like a cloud, which was close togeather as it came around the house it spread out and was just gone. 1)I was in the back yard at the time but I didn't see anything, I must have been looking the othee way,I didn't even see any light off the wall of our house or on the ground. 2)When I saw it on the tape. 3)A cloud. 4)Look obove. 5)I thought wow the light came right at my camcorder and they knew I was taping them. And it was something you could't make up, was the best part. 6) It just stop"],"Region":"California","Date of the Event":"02/21/2006 12:00 UTC","Case Number":"10210","trends":["There have been 48 other sightings in Modesto","There was one other sighting in Modesto on or around February 21st 2006"],"Log Number":"US-04082008-0010","Sighting Duration":"00:04:00","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.642867,+-120.993538(10210)&iwloc=A&hl=en\"> mufon case (10210) map </A>","Summary":"Looks like a cloud, but moves faster, and has detail and very bright.","Latitude":"37.642867","Tags":"City","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Date Submitted":"02/21/2006 12:00 UTC","Longitude":"-120.993538","Country":"United States","Source":"MUFON","Object Shape":"Other","City":"Modesto","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/10210.html.txt","/var/www/straped/mufon/mufon_json/10210.json","/var/www/straped/mufon/org/10210.html"]}