{"Date Submitted":"04/05/2008 11:30 UTC","Weather Factors":"Unknown","Source":"MUFON","Latitude":"33.014567","Object Shape":"Cigar","Case Number":"10223","map":"<A HREF = \"http://maps.google.com/maps?q=33.014567,+-97.096955(10223)&iwloc=A&hl=en\"> mufon case (10223) map </A>","files":["/var/www/straped/mufon/html2text/10223.html.txt","/var/www/straped/mufon/mufon_json/10223.json","/var/www/straped/mufon/org/10223.html"],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","City":"Flower Mound","Summary":"silent, traveling away from DFW airport no wings or lights.","divs":["sighting detailsmy husband and i were outside enjoying the clear night. the stars were very bright. my husband noticed something odd in the sky and pointed it out to me. he had been watching it for about 5 seconds before i noticed it. we live near dallas\\ ft. worth airport so we see and hear the planes flying over our house daily. this was different. usually the planes are coming in traveling to the south. this object was traveling from south to north. it had no wings or tail. no lights. i almost didn't notice it because it seemed faint and only reflecting the light from the ground. also there was no sound. there were other aircraft in the area but they were a distance away as we observed this sighting. my husband and i both agreed that it had the shape of a gel cap or cigar shape. it was moving faster than any of the planes in the sky. faster than those coming in to the airport and faster than any planes flying above traveling over the airport. we have never seen anything like this. i e-mailed a local tv station, curious if we were the only ones who noticed it. i didn't get a response so we figured that no one else noticed it. like i said it seemed faint and reflecting ground light so it doesn't surprise me. any idea what we saw? the whole event lasted maybe 10 seconds before it faded away. i thought maybe it was a meteor or birds possibly a small aircraft with a malfunction in its light system. but none of that makes sense. we have been curious ever since. we would love to know if there is a logical explanation."],"trends":["There have been 4 other sightings in Flower Mound","There were no other sightings in Flower Mound on or around April 5th 2008"],"Log Number":"US-04092008-0010","Object Features":"None","Longitude":"-97.096955","Region":"Texas","Tags":"City","Disposition":"Unknown","Date of the Event":"04/05/2008 11:30 UTC","Country":"United States","Sighting Duration":"00:00:10"}