{"Object Shape":"Sphere","Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-04092008-0011","Case Number":"10224","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","trends":["There have been no other sightings in Indialantic","This sighting has never been favorited."],"City":"Indialantic","Region":"Florida","files":["/var/www/straped/mufon/html2text/10224.html.txt","/var/www/straped/mufon/mufon_json/10224.json","/var/www/straped/mufon/org/10224.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.08946,+-80.565608(10224)&iwloc=A&hl=en\"> mufon case (10224) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsWell we return to the board walk and sit on one of the benches its about 9pm or so now, and this yellow light out in the night sky turns on. No big deal, well another one pops on, still no big deal we thought. Figuring helicopters or an airplane or something of that nature. Well it looks like its moving towards the shoreline, which is ok, still thinking, cruise liner, helicopter, boat, plane something like that. Well everyone's attention is turned to it, then all of a sudden the lights just sunk into the ocean. So we're kinda curious and freaked about it and don't know what to think. Well some old guy is flipping out walking along. The thing that made me notice it is cause we were both looking out over the water. The other thing about this is that the light just flicked on, kind of like turning on a flash light but did not turn off as going into the water. Shortly after this 2 or more choppers (appear to be Night Hawks) came flying in from PFAB (Patrick Air Force Base. Satellite Beach Florida). Everyone there that witnessed this was in shock and awe, I've lived around bases all my life and by the water and have never seen anything like this before. Since then I have been carrying 2 different camera's with me when I go to the beach, although I have not witnessed anything like this again. But what strikes me odd is now I work for a local PC repair shop and I was talking to a customer just a month ago or so that works with the government (knew this cause as soon as he entered our store he hid his ID tags that he was wearing). We were talking and he leaked out that he worked for a government organization, and told me where I could go to get more weird sightings but would have to be covert about it as the Military has a real high presence in the area. Stated that you could go to the Melbourne International Airport (MLB) and expect not to be allowed to enter, or exit if you fly in, as it will be crawling in military personel armed to the teeth."],"Summary":"2 lights over Atlantic Ocean","Disposition":"Insufficient Data","Date of the Event":"10/16/2006 12:00 UTC","Latitude":"28.08946","Longitude":"-80.565608","Object Features":"Unknown","Country":"United States","Date Submitted":"10/16/2006 12:00 UTC","Object Flight Path":"Hovering then path","Tags":"City"}