{"divs":["Sighting DetailsI was on my way back home to Blackwell, Ok. after attending a Bible study in the nearby town of Tonkawa, Ok. Heading north toward Blackwell in North Central Oklahoma about 9 pm I (and a friend) saw a cluster of 10 to 15 orangish objects. They were midway between straight over head and the horizon. They were sort of \"milling around.\" They were not flying in any sort of sensibile way. The very odd thing was, it appeared that they were keeping pace with my car. I would drive and then stop. They would fly and then stop when I halted. I did this a number of times. The objects would move and stop with me. It was not an optical illusion - they in fact kept pace with my car. This, however, was not the weirdest or most unsettling aspect of this experience. On subsequent evenings, I saw the objects repeatedly. It seemed as if they were following me for next two or three days. I have thought about this occurence often over the past 33 years. I have no explanation, none. I was hopeful that maybe someone else may have had a similar experience. The experience scared me and still does."],"Summary":"multiple","Country":"United States","Region":"Oklahoma","Case Number":"10228","Latitude":"36.678368","Date of the Event":"08/31/1975 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10228.html.txt","/var/www/straped/mufon/mufon_json/10228.json","/var/www/straped/mufon/org/10228.html"],"Disposition":"Insufficient Data","City":"Tonkawa","Source":"MUFON","Tags":"City","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Date Submitted":"08/31/1975 12:00 UTC","Viewing Distance":"Unknown","trends":["There have been no other sightings in Tonkawa","This sighting has never been favorited."],"Log Number":"US-04102008-0001","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.678368,+-97.310044(10228)&iwloc=A&hl=en\"> mufon case (10228) map </A>","Longitude":"-97.310044","Object Features":"Undisclosed"}