{"City":"Marathon","map":"<A HREF = \"http://maps.google.com/maps?q=24.761936,+-80.95544(10227)&iwloc=A&hl=en\"> mufon case (10227) map </A>","Case Number":"10227","Country":"United States","divs":["sighting detailsi was staying with family just next to the dolphin research center in grassy key, fl back in march. my girlfriend and i were sitting in the hot tub staring towards the east sky. about 10pm, i saw two round gold-yellow points of light fade into view quickly, side by side and make a u-turn about 6 feet to the right and just a hair lower of the constellation, [scorpio?] they dropped into the sky further, then the two spread apart slightly at the apex of the turn, then rose back up and moved closer together while disappearing at an angle to the left and above the entry point. it only lasted for a few seconds, and i only yelled out as much as \"cool! met-e-o-rrr...\" to my girlfriend before i realized it wasn't. i have to admit that i jumped the gun a bit and thought i had my first \"ufo\" sighting but after talking with my father a few minutes later we were left wondering if it were a pair of jets making a high speed bank turn in the distance or something going on up at disney world? just wondering if there were any other reports from that night, or if these could be lasers\\light show or anything like that?"],"files":["/var/www/straped/mufon/html2text/10227.html.txt","/var/www/straped/mufon/mufon_json/10227.json","/var/www/straped/mufon/org/10227.html"],"Log Number":"US-04092008-0014","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around March 11th 2008"],"Region":"Florida","Sighting Duration":"00:00:04","Weather Factors":"None","Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Date of the Event":"03/11/2008 10:00 UTC","Date Submitted":"03/11/2008 10:00 UTC","Latitude":"24.761936","Summary":"Pair (2) formation of gold-yellow points of light","Tags":"City","Object Flight Path":"Path with directional change","Object Features":"None","Object Shape":"Sphere, Star-like","Longitude":"-80.95544"}