{"Disposition":"Unknown","Latitude":"32.228746","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.228746,+-98.199573(10226)&iwloc=A&hl=en\"> mufon case (10226) map </A>","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Object Features":"Unknown","Case Number":"10226","Log Number":"US-04092008-0013","files":["/var/www/straped/mufon/html2text/10226.html.txt","/var/www/straped/mufon/mufon_json/10226.json","/var/www/straped/mufon/org/10226.html"],"Object Shape":"Unknown","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around December 18th 2007"],"Date Submitted":"12/18/2007 11:15 UTC","divs":["sighting detailsit was the late evening. i was having trouble with my sprint mobile phone's reception\\signal in my house, so i went outside to my backporch\\backyard to get a clearer\\heavier signal. i was talking to my girlfriend. it was chilly (i had on sweats and a sweatshirt and slippers). the night wasn't particularly clear (i can't remember just how cloudy it was, but it was overcast). i was facing the back of my yard (nw). i noticed a really slow but huge object moving from my left to the right and then out of sight. it made no sound whatsoever, but i did discern some reddish lights in the pattern of an airplane's lights (so i thought). the object seemed to be larger than any airplane i had ever seen. i thought to myself that it must be a huge cargo plane or something. it was seeming to go in a straight line towards my right (the ne), so i just shrugged it off as a big military craft. i thought it was strange and i made a comment to my friend over the phone that i had seen a really big aircraft, but it was bigger than i had ever seen before. it silently flew out of my view. about a month later, i heard about the \"ufo sightings over stephenville,\" but i still didn't put my experience with that, until a while later, when i said to my friend, \"do you remember that i saw that really big object in the sky? i wonder if it was related to the ufo seen a month or so later.\" i just moved to stephenville in the summer of 2006, so i feel like i am still getting my bearings. i wasn't sure about the object i saw in the sky; i just thought it was military related. when i heard all the other reports, i began to think i had seen something special that night. i told my sister-in-law about it, and she encouraged me to report my experience to mufon. (...which i now have done)"],"City":"Stephenville","Tags":"City","Date of the Event":"12/18/2007 11:15 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Weather Factors":"Fog, Light","Longitude":"-98.199573","Summary":"saw a huge, slow-moving (so it seemed) object moving from the NW toward the NE"}