{"Weather Factors":"Unknown","Region":"Texas","Object Shape":"Unknown","Summary":"Saw object \"floating\" about 2000 ft. in the air; look like a large plastic bag to the naked eye but too large at that altitude to be something common","Log Number":"US-04092008-0009","map":"<A HREF = \"http://maps.google.com/maps?q=33.431435,+-94.041938(10222)&iwloc=A&hl=en\"> mufon case (10222) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"02/20/2008 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/10222.html.txt","/var/www/straped/mufon/more/10222_submitter_file1__100_4754.JPG","/var/www/straped/mufon/more/10222_submitter_file2__100_4756.JPG","/var/www/straped/mufon/more/10222_submitter_file3__100_4757.JPG","/var/www/straped/mufon/mufon_json/10222.json","/var/www/straped/mufon/org/10222.html"],"City":"Texarkana","Latitude":"33.431435","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around February 20th 2008","This sighting has never been favorited.",""],"Tags":"City","Disposition":"IFO","Date of the Event":"02/20/2008 12:00 UTC","Case Number":"10222","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI looked up as I was leaving my house and saw the object \"floating\" and changing shape in the air. The object appeared to be at about 2000ft. in the air. The object resembled an extremely large plastic bag to the naked eye. The object appeared to tumble and changed shape. It \"floated\" slowly over the house for ~20 minutes and slowly moved off the the northeast and dissappeared behind the horizon. There was no noise. I watched the history channel tonight and saw a very similar object that was filmed in Stephensville TX at night. This prompted me to send it in. I took the pictures with a digital camera with a tripod. The images I am sending had 12X digital zoom. I have 16 other images. I did not use the digital zoom on all of the images to try and preserve the resolution. I would like to remain anonymous due to my occupation. Feel free to give me a call."],"Longitude":"-94.041938"}