{"map":"<A HREF = \"http://maps.google.com/maps?q=34.428458,+-117.563283(10239)&iwloc=A&hl=en\"> mufon case (10239) map </A>","Object Flight Path":"Path with directional change","Country":"United States","Disposition":"Unknown","Object Features":"Unknown","divs":["sighting detailsin the winter of 2004, on january 29 at 3:51 pm, mi wife and i were driving on a dirt road near the city of phelan, ca. i was in the passenger side with the window open, as i took random pictures of the desert landscape. we were traveling south, on anderson ranch rd at low speed, since the road was kind of rough. i did not notice anything until i downloaded the images to my laptop. a total of five pictures captured a bright teardrop or cigar shaped ufo of cylindrical shape. the object appeared on the first pictured at relatively low altitude, just over the san gabriel mountains to the south west. in the next four images, the object gained significant altitude, until the last picture, which shows the object at extremely high altitude. the last picture shows the object \"flashing away\" and leaving some sort of energy trail. i did not alter these five images in any way, and i have saved them on my computer as read-only, as to prevent any accidental changes. i used a sony cybershot digital camera to take the pictures. the images are available here, along with my own low-tech analysis: http:\\\\picasaweb.google.com\\josediaz1111\\seraphim higher resolution images available upon request."],"Sighting Duration":"00:00:59","Summary":"Bright teardrop or cigar shaped UFO over California desert","Viewing Distance":"Over One Mile","Latitude":"34.428458","Date of the Event":"01/29/2004 03:51 UTC","Date Submitted":"01/29/2004 03:51 UTC","Source":"MUFON","Longitude":"-117.563283","trends":["There have been 4 other sightings in Phelan","There were no other sightings in Phelan on or around January 29th 2004"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10239.html.txt","/var/www/straped/mufon/mufon_json/10239.json","/var/www/straped/mufon/org/10239.html"],"Tags":"City","City":"Phelan","Object Shape":"Bullet, Missile, Cigar, Cylinder, Flash, Teardrop","Case Number":"10239","Log Number":"US-04102008-0012","Region":"California"}