{"Object Flight Path":"Stationary","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.321651,+-86.894128(10234)&iwloc=A&hl=en\"> mufon case (10234) map </A>","Tags":"City","Weather Factors":"None","Longitude":"-86.894128","Country":"United States","Disposition":"Unknown","Object Features":"None","Case Number":"10234","divs":["Sighting DetailsAt about 5:20 AM, I was getting in my truck to go to work. When I noticed bright lights. I was curious and continued to watch the two objects in the sky toward the southwest of my home approximately 2 miles away in the sky probably 400 feet of the ground. The objects were not moving at all. I know the stars placements well, as I am a retired soldier of 24 years in the Army. I know all my aircraft and this was not an aircraft that I had ever seen. The lights were pure, white light. No other colors were visible. I for some reason was not alarmed and sat in my truck observing the objects while running the heater in my truck because it was a clear, crisp and cold morning. After watching these objects, I wanted to run in the house and get my family up. But for some reason I did not. I was afraid that I would miss some kind of and event. I live about 20 miles from Maxwell Air Force Base that is in Montgomery and about the same from an airport. The only difference is I know aircraft configurations and this was no plane or helicopter. These objects as fast and they appeared out of nowhere. The lights went out and I never saw the ojects again. Since that morning, I have not observed anything else that could account for my sighting. If others in the area observed anything, the new media did not mention it on the news. I wondered if you network had simular sightings ina a around that date."],"City":"Undisclosed","Object Shape":"Oval","Log Number":"US-04102008-0007","Region":"Alabama","Date of the Event":"02/27/2008 05:20 UTC","Summary":"[tg] 2 Oval objects with extrememly bright lights","trends":[],"Sighting Duration":"00:25:00","files":["/var/www/straped/mufon/html2text/10234.html.txt","/var/www/straped/mufon/mufon_json/10234.json","/var/www/straped/mufon/org/10234.html"],"Date Submitted":"02/27/2008 05:20 UTC","Viewing Distance":"Over One Mile","Latitude":"32.321651"}