{"Latitude":"39.957635","Tags":"City","files":["/var/www/straped/mufon/html2text/10238.html.txt","/var/www/straped/mufon/mufon_json/10238.json","/var/www/straped/mufon/org/10238.html"],"Weather Factors":"None","divs":["Sighting DetailsThis happened on a clear January night right around midnight in 1989 years before I joined MUFON. I am now a MUFON Field Investigator #12347. An object followed my car parallel to the road I was on then stopped when I stopped & observed me for 5 minutes. I thought that it was a UFO (or still could be), but now I know about Black Helicopters and this could be what I saw, except there was no working parts that could be seen or heard, it just floated. I was driving along Knights Road in Philadelphia along with my ex-wife while we we were still dating to take her home and noticed this object following parallel to us out of my drivers side window. I rolled the window down so that I could see it clearer. I crossed over Street Rd and pulled into a deserted parking lot, got out of my car and the object stopped, turned toward me, and dipped its front end. I stared at it, and it observed me from about 50 to 60 feet from the ground. The object was black and shaped like a helicopter, but had no working parts or lights. The object started following me in Philadelphia, and stopped where I stopped in Bensalem. It was a clear winter night. After observing me it moved away quickly and disappeared in the sky. The object didn't effect us in any way and after we left the parking lot, we continued along our merry way discussing what we saw."],"Object Shape":"Other","Disposition":"Unknown","Summary":"A Black Helicopter followed my car and stopped to observe me & my ex-wife.","Date of the Event":"01/07/1989 12:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.957635,+-75.160839(10238)&iwloc=A&hl=en\"> mufon case (10238) map </A>","Region":"Pennsylvania","Date Submitted":"01/07/1989 12:10 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Case Number":"10238","City":"Philadelphia","Sighting Duration":"00:10:00","Viewing Distance":"21-100 Feet","Log Number":"US-04102008-0011","Object Features":"Other","Country":"United States","Longitude":"-75.160839","Source":"MUFON","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 7th 1989"]}