{"Longitude":"-120.156701","trends":["There have been 2 other sightings in Manson","There was one other sighting in Manson on or around April 10th 2008"],"Weather Factors":"Does Not Apply","Log Number":"US-04102008-0020","Sighting Duration":"00:02:12","Country":"United States","Object Flight Path":"Path with directional change","Summary":"White, fast, and oval shaped","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Latitude":"47.884745","Region":"Washington","Case Number":"10247","Object Features":"None","City":"Manson","Date of the Event":"04/10/2008 05:20 UTC","files":["/var/www/straped/mufon/html2text/10247.html.txt","/var/www/straped/mufon/mufon_json/10247.json","/var/www/straped/mufon/org/10247.html"],"Disposition":"Unknown","Date Submitted":"04/10/2008 05:20 UTC","Tags":"City","Object Shape":"Oval","divs":["Sighting DetailsI was at my best friends house. Me and MacKenzie(my best friend) were cleaning her bedroom. MacKenzie's bedroom window goes right onto the front deck. Her dad, Mike, was resting outside on the deck and enjoying the sunny day. He opened his eyes to look out at the lake, and he saw a white, oval shaped ufo. The ufo was flying fast over the water, a little over a few hundred feet up. It flew over the water, went over Wapato Point, and zig-zagged upward. It did this at a fast speed, in about 4 seconds. Then Mike yelled for me and MacKenzie(my best friend) and we climbed out of her bedroom window, right onto the deck. While we were getting outside, the ufo was leaving. It started heading farther away from us, way high in the sky, about as high as an airplane, but it was going at a fast speed, faster than a plane. When it was far,far,far away in the sky, it did a couple of turns and a loop. When I saw the ufo, it kind of had like heat around it, like when you look at the heat coming out of a barbeque when you are cooking, the clear blurriness. We were watching the ufo get higher into the sky for awhile, maybe 40 seconds. But, it was getting high, and was going fast! MacKenzie got the binoculars, but we could not find the ufo in the binoculars. Then finally, the ufo disappeared! When I first saw the object, it was amazing, I noticed that it was not a plane, and Mike told me what he seen it do and I knew that this object was a ufo. This was not an airplane, or bird, or anything like that. It wasnt even man-made. This was a ufo! Experiencing this was amazing to all three of us! I hope I will see another ufo soon, and get a video, or atleast a picture of it!"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.884745,+-120.156701(10247)&iwloc=A&hl=en\"> mufon case (10247) map </A>"}