{"Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/10249.html.txt","/var/www/straped/mufon/mufon_json/10249.json","/var/www/straped/mufon/org/10249.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.030282,+-118.165526(10249)&iwloc=A&hl=en\"> mufon case (10249) map </A>","Source":"MUFON","City":"East Los Angeles","Date of the Event":"04/09/2008 12:55 UTC","divs":["Sighting DetailsI had just got home. I parked my car in my driveway with the front of the vehicle facing the street. I live at the very top of a cultisac and right in the middle. Also the street is on a hill. So Im right at the top in the middle. I was smoking a cigarrette and listening to the radio, looking up at the sky like I like to do on occassion. A plane's flashing lights caught my eye and I watched it for a minute or to as it faded into the distance. It was to my right very high up and heading north. A bright light then caught my eye to my left. I looked at it and at first I thought it was either a car's headlights or a street lamp in the distance. But within a second from me initially seeing it; it began pulsating. At first I thought it had to be a plane. But when I looked up there were many planes in the sky but the're lights were flashing and had at least one that remained on at all times. This thing however was completely different. It wasn't flashing at all, no strobe effect. This thing was pulsating which was really weird. It's hard to explaing but it very gently got brighter then gradually got dimmer then would turn off completely then start up again. At first I thought it was a street lamp also because it appeared to be motionless. But as I watched it I notiched it was actually moving. It moved up and down left to right only about 5 feet at a time. Then I realized I had my flashlight in my car so I grabbed it. The flashlight is pretty bright it puts out one million lumens. And this thing was not far at all. I know this was probably stupid but, I got the flashlight pointed it at the object and blinked it in unison with the objects pulsating lights. RIght when I did this, this thing stopped in it's tracks. I took this chance to run upstairs and get my camcorder. When I got upstairs my sister was still awake and so I yelled for her to see this thing throught the window. She was stunned when she saw the way it was moving and the way it was pulsating. We watched it for about a minute and a half until it was out of sight. I was determined to get this on video so I ran outside in the front to film it but it was nowhere in sight. THis thing was hardly moving. Much slower then a person taking a stroll. Yet in the 10 seconds it took for me to get outside. It completely vanished. After this me and my sister sat down and thought of possible explanations. We couldn't come up with anything. THe weirdest part was that from it's distance I would say it was larger then a car but it wasn't making any noise whatsoever. Also it was not very high either. Only at around the height of a 4 or 5 story building! And like I said only Half a block away. But came much closer to my house. It was spherical in shape. But I couldnt tell if that was the actual object or just the shape of the light. I couldnt see a definite shape. Just this strange pulsating light which eventually made it's way almost right above my house. 10 minutes after me and my sister went to bed, we began hearing the neighborhood dogs barking very loudly I have 3 dogs and the only way I can describe it is the type of bark they do when they are startled. This whole thing was really weird and the way it pulsated combined with the way it moved and the fact it made no noise was very eeire. I hope other people saw what I saw."],"Latitude":"34.030282","Object Shape":"Sphere","trends":["There has been one other sighting in East Los Angeles","There were no other sightings in East Los Angeles on or around April 9th 2008"],"Longitude":"-118.165526","Summary":"I saw a pulsating sphere. About a half a city block away.swaying towards my general location.","Date Submitted":"04/09/2008 12:55 UTC","Sighting Duration":"00:10:00","Case Number":"10249","Disposition":"IFO","Country":"United States","Log Number":"US-04102008-0022","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed"}