{"Date Submitted":"02/06/2008 06:30 UTC","Tags":"City","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around February 6th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=35.235717,+-80.838227(10240)&iwloc=A&hl=en\"> mufon case (10240) map </A>","Latitude":"35.235717","Country":"United States","Case Number":"10240","Log Number":"US-04102008-0013","Object Shape":"Circle, Star-like, Unknown","Longitude":"-80.838227","Disposition":"IFO","Summary":"I saw a bright, hovering objects outside of my home.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10240.html.txt","/var/www/straped/mufon/mufon_json/10240.json","/var/www/straped/mufon/org/10240.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Object Features":"Unknown","Sighting Duration":"00:10:00","City":"Charlotte","Date of the Event":"02/06/2008 06:30 UTC","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Does Not Apply","divs":["Sighting DetailsWell,to start off, every weekday morning around 6 30 I stand outside my house waiting for the bus. I've always been interested in UFOs and things like that since I was young, and recently I started taking it seriously, watching shows like UFO Hunters and looking up stories and such. Anyways on Tuesday, February 5th, I was outside my house as usual, and noticed two very bright balls of light in the sky. They were pretty close to the ground. At the time I didn't think much of it, I dismissed it as an airplane or a star maybe. But on the next day, Wednesday, February 6th I saw the same balls of light at the exact same location. They were just hovering there so I knew it couldnt be an airplane or a helicopter. They also didn't make any noise. Now it couldve been a star, but in my opinion it was way too close and way too bright to be a star. I witnessed a couple of airplanes fly near the objects and then immediantly change course. So I now realized that this was something unusual and brought my cell phone out. I recorded almost a minute of footage. It is really bad quality,being taken by a cell phone, but you can still make out one of the balls of light a little bit. The second object can't be seen in the video because it is being blocked by a tree. I had to stop recording since my bus arrived and I lost sight of both objects. I saw these two objects at the same location for the next two days after that. On the last day, I attempted to keep sight of it while I was on the bus. To my amazement, it actually seemed to be gliding alongside the bus at a distance. As I got off the bus it was nearby behind a few trees. I turned to talk to my friend and when I turned back it had dissapeared. I have never seen anything like it. One thing I forgot to add is I did see these objects again, I don't remember excatly when, but they appeared to,not sure how to describe this, teleport in. As in,nothing was in the spot at first, and a second later there it was.I could just be overeacting of course, and what I saw those nights could easily be nothing more than something explainable, but for now I'm convinced that what I saw was something very unusual."]}