{"Date Submitted":"09/10/2007 04:00 UTC","Tags":"City","Log Number":"US-04112008-0002","Country":"United States","Longitude":"-111.856862","Weather Factors":"None","Source":"MUFON","Date of the Event":"09/10/2007 04:00 UTC","Object Shape":"Sphere","divs":["Sighting DetailsI was walking up stairs from our lower patio to the upper balcony with my wife when I hear my sons voice yell a long drawn out \"oh!\" followed by \"what the fuck is that!\" (I didnt know my son was out on the balcony and he didnt know we were on the stairs). My wife and I immediately rush up the stairs and onto the balcony, my son is pointing out into the sky saying \"what is that!\", \"look at that!\", I look where he is pointing and see absolutly nothing. I had a hundred different sickening thoughts at that moment about what could be going on with my son and what could be causing him to see things and then I see what he's pointing at, right in front of my face, about three hundred yards out, a flying metal ball becomes apparent as it crosses from a back drop of white cloud to grey cloud (my son says he first noticed it as it crossed from a backdrop of blue sky to white cloud). It was a highly reflective metal orb. Once I saw it cross from white to grey the shape and the detail of what it was became perfectly apparent it was a perfectly round , perfectly reflective flying metal ball. The ball seemed to move slowly and began to grow bigger for a very brief moment and then it rolled and began moving across the sky in a north east direction until it moved behind a tree and was gone. I felt surprisingly unsurprised by it. for some reason it seemed almost normal it wasnt magical and it wasnt like somthing out of a movie. Once I could see it I understood it completely. It was a sphere, it was flying and it was disguising itself by reflecting the surrounding sky I also immediately understood that there is most likely plenty of them out there all of the time"],"Summary":"a reflective metal sphere flies in our direction and then changes direction and crosses the sky in front of us","Disposition":"Unknown","Region":"Utah","Object Features":"None","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet, Over 1 Mile","Latitude":"40.57928","map":"<A HREF = \"http://maps.google.com/maps?q=40.57928,+-111.856862(10256)&iwloc=A&hl=en\"> mufon case (10256) map </A>","Case Number":"10256","City":"Sandy","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around September 10th 2007"],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/10256.html.txt","/var/www/straped/mufon/mufon_json/10256.json","/var/www/straped/mufon/org/10256.html"]}