{"map":"<A HREF = \"http://maps.google.com/maps?q=27.200158,+-80.249986(10254)&iwloc=A&hl=en\"> mufon case (10254) map </A>","Latitude":"27.200158","divs":["Sighting DetailsI submitted a report Monday night I think. I had seen a ufo . I am a security guard at a rest stop along I95 in Martin County Florida. There is an old rest stop behind the new one where I go each night to stretch my legs occasionally. For the past 3 nights I have seen these objects They have the appearance of satellites. Each night there has been one. Tonight I saw three. They come from different directions each night. Tonight I saw one from sw to ne at 2052. Then one from w to e at 2101. Then another from n to s at 2104 . These objects have no strobe lights at all, they move through the sky similar to a satellite, with no noise. But right before they dissapear they power up. They become considerably brighter and slow down. Then in each case they disapear shortly after powering up Almost as if they are engaging some sort of cloaking device. I have kept a record of dates, times and directions. Also as I have mentioned in my last email. There are alot of chemtrails being sprayed in my area. I dont know if this has anything to do with the ufos I have kept a record of dates when the chemtrails are sprayed. They come over with their red and white planes and spray in the typical x patterns and tic tac toe patterns. I am in the Florida National Guard. This past weekend was drill weekend in Ft pierce. Well, at the start of drill 0730 the sky was being filled with these chemtrails. x's everywhere. I think they know when drill weekend is. I believe we are being poisoned . I am off tomorrow and Sat. But I am back to work Sun. I have an expensive telescope I plan to take back there some night. Mabey sat.........Daniel Kime"],"Country":"United States","Object Features":"Undisclosed","Date of the Event":"04/10/2008 08:52 UTC","City":"Stuart","Longitude":"-80.249986","Date Submitted":"04/10/2008 08:52 UTC","Viewing Distance":"Unknown","Case Number":"10254","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10254.html.txt","/var/www/straped/mufon/mufon_json/10254.json","/var/www/straped/mufon/org/10254.html"],"Summary":"Nightly occurance for 4 nights","Object Shape":"Star-like","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Region":"Florida","trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around April 10th 2008"],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Log Number":"US-04112008-0001"}