{"Viewing Distance":"101-500 Feet","Object Features":"None","City":"Clover","Longitude":"-81.226465","Case Number":"10257","Tags":"City","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=35.111248,+-81.226465(10257)&iwloc=A&hl=en\"> mufon case (10257) map </A>","Country":"United States","trends":["There have been no other sightings in Clover","This sighting has never been favorited."],"Date of the Event":"04/02/2008 11:30 UTC","divs":["Sighting DetailsI was mowing a large yard and as it is so large I usually get bored and look up at passing planes and birds. The yard has an unobstructed view of the sky. It was the 11 o' clock hour, around 11:30 when I looked up to watch a couple of hawks riding on thermals. It was then I noticed up much higher, perhaps around 500 or 600 ft. a black object standing still in place. I was rattling around on the riding mower so at first I dismissed it, but when I completed another circuit around the yard and the object was still there I stopped the mower. It was black, cigar-shaped and stock still. At first I thought, what a stupid bird, it can't see prey from that height, but then I realized it was larger...from that height I'd say around 15 ft. long. What grabbed my attention was that it was no plane...there were no wings..no noise and whereas the two birds far below rocked and swayed on the slight breeze this object never moved. It was at an odd angle as well. It wasn't horizontal or vertical it was tilted at a 45* angle. I watched for a few minutes. I remember chuckling to myself that if it was some sort of craft that if they were watching me they must think what a waste of time it was for me to mindlessly go round and round on that machine.The day was partly cloudy, so the sun would peek out and then go behind hazy high clouds. I observed that even when the sun hit the object there was no shine to it, as you would expect with metal. It was so odd and then, as I looked from the ground to it's position, to try to figure out how high it was it was gone. I saw no movement, it just vanished. I would have posted this before now but I was anxious to see if someone else would post something. Odd. Odd. I only told my husband about it, and that was after thinking about it for a day.I will also go ahead and post a strange sighting I had as a little girl while I'm here."],"Weather Factors":"None","Object Flight Path":"Stationary","Latitude":"35.111248","Log Number":"US-04112008-0002","Source":"MUFON","Region":"South Carolina","Sighting Duration":"00:05:00","Summary":"Black cigar shape","files":["/var/www/straped/mufon/html2text/10257.html.txt","/var/www/straped/mufon/mufon_json/10257.json","/var/www/straped/mufon/org/10257.html"],"Disposition":"Unknown","Date Submitted":"04/02/2008 11:30 UTC"}