{"Region":"North Carolina","Date of the Event":"07/31/1977 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.973228,+-78.385837(10258)&iwloc=A&hl=en\"> mufon case (10258) map </A>","Object Flight Path":"Path then hovering","divs":["Sighting DetailsI was twelve years old and my family was on vacation at Holden Beach, North Carolina between mid July or mid August 1977. We were out on a dock crabbing around 10 at night and I was looking up at all the stars because this beach wasn't built up at all and I was astounded by all the stars...I'd never seen a sky like that. I then noticed one moving a rather quick pace. I thought it might be a meteor or a shooting star but it was white like the other stars and moving a lot slower. It wasn't falling from the sky it was moving straight across it. It was way to high to be an airplane...I have seen meteor showers and the space station pass by...this was smaller and moving at a good clip. It was then I noticed another sphere coming towards it from the opposite direction. They both slowed as they got closer to each other. I excitedly told my family what I was seeing and was ignored by everyone except my sister. I was holding a flashlight and I shined the beam up to show her where to stare...I didn't look away because I never would have found them again if I'd looked anywhere else. My eyes were getting strained from not blinking and my sister had started to doubt me when suddenly the merged spheres shot away from each other in the directions they had just come from. She gasped when she saw it. These things streaked across the sky. The space station moves across the sky like a VW bug compared to these things! They were a streak and gone. I was scared because I couldn't explain it. It also excited me, I couldn't believe what I was seeing..I've never seen anything like it in the sky since. After all thse years it's still burned on my brain...my sister sadly acts like she never saw it...she's very afraid of being ridiculed."],"files":["/var/www/straped/mufon/html2text/10258.html.txt","/var/www/straped/mufon/mufon_json/10258.json","/var/www/straped/mufon/org/10258.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Sphere","Date Submitted":"07/31/1977 12:00 UTC","Disposition":"Insufficient Data","Latitude":"33.973228","Case Number":"10258","Tags":"City","Summary":"White spheres at beach","Weather Factors":"None","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-78.385837","City":"Shallotte","trends":["There have been 2 other sightings in Shallotte","There were no other sightings in Shallotte on or around July 31st 1977"],"Log Number":"US-04112008-0003"}