{"Object Shape":"Star-like","Country":"United States","files":["/var/www/straped/mufon/html2text/10253.html.txt","/var/www/straped/mufon/mufon_json/10253.json","/var/www/straped/mufon/org/10253.html"],"Weather Factors":"None","Date Submitted":"04/07/2008 07:55 UTC","Viewing Distance":"Unknown","Case Number":"10253","Sighting Duration":"Undisclosed","Date of the Event":"04/07/2008 07:55 UTC","City":"Abilene","Tags":"City","Region":"Texas","Source":"MUFON","Log Number":"US-04102008-0026","Longitude":"-99.726244","map":"<A HREF = \"http://maps.google.com/maps?q=32.450226,+-99.726244(10253)&iwloc=A&hl=en\"> mufon case (10253) map </A>","Object Features":"None","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around April 7th 2008"],"Disposition":"Unknown","divs":["sighting detailson monday evening (04\\07\\08), around 7:55 p.m., my son, my daughter-in-law, and myself, were outside my home when we looked up to the sky, looking north to north east, and notice what we taught was a star. the sun hadn't gone down yet, so i knew that it was to early for the stars to be out. looking at the star, was like looking at a welders arc. it was about -2. in magnitude. we looked around to see if they were any others stars out, but we couldn't see any. the object never flicker like the stars do, nor did it move from it's position. what really fascinated me about the star was it brightness. i've never seen a star that bright. after about fifteen minutes, the star disappear. i looked at my star chart for that evening, and the only star that would of been in that area was arcturus,but it wouldn't be in that area until around 9:00 p.m."],"Summary":"On the 04/07/08, around 7:55 pm, my son, his wife, and my self, were outside looking North to see when the cold front was gonna come when my son notice a bright looking star northnortheast . The object was to bright to be a star, plus it was still early","Latitude":"32.450226","Object Flight Path":"Stationary"}