{"Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"04/11/2008 12:05 UTC","Region":"Arizona","City":"Phoenix","Case Number":"10273","Source":"MUFON","Country":"United States","divs":["sighting detailsi was outside on my lunch break and i have been purposely looking at the sky to see if i could observe anything out of the ordinary when a flash caught my eye. the object was almost straight overhead , just barely to the north of what would have been directly over the top of my head. i was wearing my blue-blocker-type sunglasses and i went into the shade of a tall palm tree to see if i could get a better look at the object. it seemed to be tumbling end over end and it was not moving at all other than the tumbling motion. it began to move to the s. very slowly for what would be about 2 seconds, then it stopped again. then it started to move again in the same direction and then it changed direction to the s-sw and then it continued on to the w until i could no longer see it. i looked back up into the same area that the object first appeared in and i saw 3 more of the same objects, all moving. one was heading to the n. one was heading to the s. and one just sat stationary until it too starting moving off to the s, then all 3 of them just picked up tremendous speed and took off into their above designated directions. i continued looking at this same area of the sky and all told i saw a total of 7 of these star-like craft\\ufo's and they all seemed to materialize out of the same place in the sky overhead. if i didn't have to come back in to the office to work i would have stayed outside to see if i could spot any more of these things. it was quite thrilling to see these things ! i fully intend to bring binocculars (sp?) to work next week to see if i can spot these things again. i suspect that there is some connection to the craft all appearing in this same part of the sky, but i have no clue as to what that connection may be. absolutely fascinating. p.s. -it's now 2:35pm mst and i just saw another one overhead that took off like a shot after sighting it for about a minute, to the west. what the hell is going on in phoenix today ?! thanks for listening to me - john b - phoenix, arizona"],"Summary":"Very bright star-like and about 30 thousand feet altitude I think.","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.453727,+-112.067147(10273)&iwloc=A&hl=en\"> mufon case (10273) map </A>","Longitude":"-112.067147","Viewing Distance":"Over One Mile","Latitude":"33.453727","Date of the Event":"04/11/2008 12:05 UTC","Tags":"City","Object Shape":"Star-like","Weather Factors":"Unknown","Log Number":"US-04112008-0018","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 11th 2008"],"files":["/var/www/straped/mufon/html2text/10273.html.txt","/var/www/straped/mufon/mufon_json/10273.json","/var/www/straped/mufon/org/10273.html"]}