{"City":"Port Orange","Case Number":"10275","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","Summary":"Two glowing spheres moving above and through the trees.","Disposition":"Unknown","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","divs":["sighting details on or about july 26 1992 @ approximately 4:00 pm me and my friend were fishing on the bank of spruce creek when i looked across the water to the other side which is about 1\\10 of a mile when we noticed two spheres zig zagging just above the tree line,the strange thing was we noticed the objects at the same time the only thing said was me saying to him do you see what i see? and he replied \"yes\",it got really strange after that every thing seemed really quiet and for some reason i thought to myself wouldnt it be cool if the one on the left split into two objects,and just as i thought that it happened i failed to mention the colors one was orange and one was red when the orange one split into two the third sphere was white and shot straight up into the top of a thunder storm which was developing out over the ocean and when it did,it lit up the entire cloud.we continued watching the two above the trees as they moved from left to right and right to left above and through the trees for about three or four more minutes then they shot off to the west at about a 45 degree angle they were gone within one second or less.we didnt say one word to each other while we packed up our fishing gear and went home the strange thing was we never spoke of it again its been on my mind all this time it seemed to me that there was almost some kind of telepathic thing going on between me and the objects and i think my friend experianced the same thing or maybe more because it seemed to scare him more than it did me."],"Latitude":"29.140716","Country":"United States","files":["/var/www/straped/mufon/html2text/10275.html.txt","/var/www/straped/mufon/mufon_json/10275.json","/var/www/straped/mufon/org/10275.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.140716,+-80.99284(10275)&iwloc=A&hl=en\"> mufon case (10275) map </A>","Longitude":"-80.99284","Tags":"City","trends":["There have been 4 other sightings in Port Orange","There were no other sightings in Port Orange on or around July 26th 1992"],"Weather Factors":"None","Date of the Event":"07/26/1992 04:00 UTC","Date Submitted":"07/26/1992 04:00 UTC","Object Flight Path":"Path with directional change","Log Number":"US-04112008-0020"}