{"map":"<A HREF = \"http://maps.google.com/maps?q=39.965176,+-82.989524(10280)&iwloc=A&hl=en\"> mufon case (10280) map </A>","Summary":"Two of us saw a dark black triangle hovering just above a house on a back road of our small town. It had a round light at each corner and made no noise. It started to move slowly and then was gone in a mila-second.","divs":["Sighting DetailsI have never told anybody outside of close friends and family for fear of being called a nut, but I finally decided to speak out, even though it seems there are pleanty of eye witness accounts out there. Me and a friend that I have not talked too much since our sighting were driving to his house from mine on a back road, but a highly traveled one during regular hours, when I happend to look across him out threw his open window and I saw lights hovering very close to a house, which at first I thought it was a helicopter, so we stopped to see what it was doing. I remember pulling to the side of the road and looking closely and saying \"that don't look like a chopper\" so I shut off the car too listen and we heard no sound. It was a warm summer night so we got out too get a closer look and the lights just sat there suspended in the air perfectly still. It was about as high from the house as the house was tall and about 100 feet away, looking back I could have almost ran up and threw a rock at it, but we were just kinda sunned by what we were witnesing. We could both make out it's perfect triangle shape with lights at each corner. The lights reminded me of can lights in a house ceiling, but a dim yellow color. I remember thinking those are not spot lights because they didn't shine down. We kept trying to make out the shape of the body but all I could tell is that there was a thin body too it but it was blacker than the night sky so it was hard to make it out. I could tell that it was looking at us while we were observing it, you would have too be there to understand, but it was a very erie feeling. I kept hoping a cop or anybody would stop, so we could show them what we were seeing, but no luck. After about 10 minutes it started to move very very slow, so slow that my freind couldn't even tell, but I brought it up. Then it was gone in a blink or like it just disappeared. It has changed my life so much, too litterally know for a fact, that there is more to life than what everybody else thinks. All by the way that night we couldn't sleep because we just kept talking about what we saw, but we made a pact to not tell anybody because we new they wouldn't beleive us and were young and were worried about our reputations too much. I wish we would've told somebody then."],"Object Flight Path":"Stationary,Hovering then path","Log Number":"US-04112008-0026","Date of the Event":"07/31/1998 11:30 UTC","Disposition":"Unknown","Country":"United States","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/10280.html.txt","/var/www/straped/mufon/mufon_json/10280.json","/var/www/straped/mufon/org/10280.html"],"Longitude":"-82.989524","Case Number":"10280","Tags":"City","Weather Factors":"None","Latitude":"39.965176","Date Submitted":"07/31/1998 11:30 UTC","City":"Columbus","Source":"MUFON","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Region":"Ohio","Object Features":"Other","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around July 31st 1998"]}