{"Disposition":"Unknown","divs":["Sighting Detailshello, i just came across your site from somebody and couldnt help but want to tell you that i have also seen a triangular shaped aircraft. as i dont have a camera, i drew a picture of it in photoshop. im 22 years old and pregnant and live in hoffman estates, illinois. i woke up early saturday morning, at around 4 20 AM to use the washroom. i came back to my bed and tried to fall asleep, which is so difficult nowadays, and just gazed out my bedroom window, which faces northwest. i heard a quiet sound like that of a passing airplane. then a HUGE object flying low passed from over my house, and over the house across the street. if a plane were flying this low, the sound shouldve been much louder. it appeared to be flying slightly faster than a plane also, but that couldve been bc it was flying so low. i dont believe in UFO's, so i was thinking it mightve been a military aircraft and finally fell asleep around 6 30 AM. im still not sure what it was, but i was asking some people if they have ever seen anything like it, bc i havent and i like to learn things. they should me a link to info about the UFO sightings in illinois of January 2000. the descriptions i read were so similar to what i saw that i figured i might as well tell somebody."],"Object Features":"Unknown","Case Number":"10287","trends":["There have been 7 other sightings in Hoffman Estates","There was one other sighting in Hoffman Estates on or around April 5th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.070242,+-88.11339(10287)&iwloc=A&hl=en\"> mufon case (10287) map </A>","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/10287.html.txt","/var/www/straped/mufon/more/10287_submitter_file1__wtf.jpg","/var/www/straped/mufon/mufon_json/10287.json","/var/www/straped/mufon/org/10287.html"],"City":"Hoffman Estates","Latitude":"42.070242","Viewing Distance":"101-500 Feet","Source":"MUFON","Date of the Event":"04/05/2008 04:30 UTC","Summary":"triangular with really bright white lights around outside and red light in underside center.","Region":"Illinois","Log Number":"US-04122008-0007","Country":"United States","Object Shape":"Triangle","Date Submitted":"04/05/2008 04:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-88.11339"}