{"Disposition":"Unknown","Latitude":"37.502796","map":"<A HREF = \"http://maps.google.com/maps?q=37.502796,+-97.504492(10284)&iwloc=A&hl=en\"> mufon case (10284) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/10284.html.txt","/var/www/straped/mufon/mufon_json/10284.json","/var/www/straped/mufon/org/10284.html"],"Tags":"City","Object Flight Path":"Hovering then path,Path then hovering","Longitude":"-97.504492","Date of the Event":"10/15/1966 08:30 UTC","trends":["There have been no other sightings in Clearwater","This sighting has never been favorited."],"divs":["Sighting DetailsMy brother, mother and I were traveling through Clearwater, Kansas on our way home to Wichita, Kansas in October 1966. Approximately at 8 p.m when we were approaching the railroad tracks to the left of our car, we observed a very dark oval or egg shaped object hovering above the railroad tracks. We all asked at the same time, \"What is that?\" The object started moving in the direction of our car, flying very smoothly and slowly over the top of our car. It then stopped in mid air to the right of our car, on the passenger side. A very bright beam of light lit the entire inside of our car. This object was completely silent and made no noise of any kind. My brother had completely stopped the car to observe this object. My mother also was staring at it. I reacted with extreme fear and just felt paralyzed and unable to move or say anything for what could have been a minute or two. I finally said to my brother, \"Don't just stare at it, just go\". About that time, this object turned it's beam of bright light out as it flew straight up into the air at a very fast speed and then just seemed to fold into the atmosphere, in other words disappear within one or two seconds. My mother made the comment, \"That was fast\". After we arrived home, my mother made a phone call to the Air Force Base that was located close to where we lived. They denied knowing anything about it and we never found any answers to what it might have been. My brother and mother are no longer living and after all these years, I am left wondering what this very unusual object was that we observed that night. I was 18 years old at the time. I hope to have an answer someday that explains what it was that we seen. After this incident, even today I don't like traveling on isolated roads or hightways at night."],"Source":"MUFON","Region":"Kansas","Log Number":"US-04122008-0004","Date Submitted":"10/15/1966 08:30 UTC","Summary":"Dark oval shaped object hovering over railroad tracks east of Clearwater Kansas in 1966","Case Number":"10284","Object Shape":"Egg, Oval","Viewing Distance":"101-500 Feet, Unknown","Sighting Duration":"00:05:00","City":"Clearwater"}