{"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Longitude":"-122.81638","Case Number":"10281","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/10281.html.txt","/var/www/straped/mufon/more/10281_submitter_file1__UFOimage1.jpg","/var/www/straped/mufon/mufon_json/10281.json","/var/www/straped/mufon/org/10281.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.547133,+-122.81638(10281)&iwloc=A&hl=en\"> mufon case (10281) map </A>","Region":"California","divs":["Sighting DetailsI was on a roadtrip with my friend. We stopped in Northern California to visit friends and spend two nights there. Around sunset, friend and i sat next to pool, watching stars come out. We noticed a satelite traveling in eastern part of the sky. Afew seconds later friend said- what is that? I looked almost directly overhead and saw a very large boomerang shapped ship, moving along at a fast and steady pace. It was the same color as the dusky sky, but we could tell the shape- like having a paint chip in front of the same colored wall. We could tell the shape was like a boomerang with two rows of uniform lights on the leading edges. It made a \"v\" shape. The corners of the ship were rounded, and a double scoop in the back. We watched it silently move from south (santa rosa, san francisco) and bank towards the west, to the ocean. It was absolutely silent. We were very excited. I told friend to go and draw what she saw before we talked about it anymore. Our drawings showed the same thing. We discussed what we saw with hosts the next morning, story met with incredulity. \"You saw birds\" The next night, friend and I sat at pool, same time, same place, facing south again. We saw the satelite pass by in same eastern sky, from south to north, to the right of us. We didn't see anything else. I began to talk with host about unrelated things, basically forgetting about the ship. But friend was watching the sky. Now let me say, this friend is a very reliable, accountant type, not easily given to flights of fancy. I am an artist...it is not beyond my grasp the significance of friend seeing craft first. I have seen strange things before, and am glad that friend saw this first- more credibility in my inner circle. So I was sitting with host, he to my left, friend to my right. She was sitting crossed legs facing me, quiet. SHe suddenly said \"there it is\" and then host jumped up, shocked, blocking my veiw at first. This all happened very quickly. Host jumped up and back, crying \"it's birds!\" As he moved back a bit, I could see what they were looking at. I saw a verticle row of amber and fuzzy lights, about 7. the row traveled upright- verticle- at first, but when host said \"its birds\" the thing like...freaked out and began turning end over end. I saw it turn very quickly about five time, end over end, and then it seemed to...fold in on itself is the closest I can come to describing the movements. And then it folded away at a great speed, moving out of sight, to the north. Host kept saying it was a bird- but he was obviously shaken. Friend and I were highly agitated. I was scared. Friend ran inside \"to get away from the aliens\". I swear, it was like the craft(?) reacted to our thoughts. The movements it made after host mentioned birds were strange, flapping, not birds...way to big (and the lights?) but the fact that it reacted, freaked out when we saw it. Chills I get, still. Friend said later she watched it come up to us (even though I think it was a few miles away- just big), approaching like from another direction, spying, like it knew she was watching for it in the direction we had seen it the night before. I know, I know...but better that friend said it first, less eye rolling. That night, we were all freaked out. I finally asked host \"you don't really think that was birds?\" shaken and pale, he said \"no\". I went to bed that night asking my new \"friends\" to leave me alone- we had two weeks of road trip left, and I didn't want to be freaked out again. Had no other contact that trip."],"Weather Factors":"Unknown","Date Submitted":"06/14/2007 10:00 UTC","Tags":"City","Object Shape":"Boomerang, Cylinder, Other","Log Number":"US-04122008-0001","Sighting Duration":"Undisclosed","Date of the Event":"06/14/2007 10:00 UTC","Latitude":"38.547133","Object Features":"Unknown","trends":["There has been one other sighting in Windsor","There were no other sightings in Windsor on or around June 14th 2007","This sighting has never been favorited.",""],"Source":"MUFON","Country":"United States","Summary":"BOOMERANG AND CYLINDER","City":"Windsor"}