{"Weather Factors":"None","Date of the Event":"03/12/2008 11:49 UTC","Country":"United States","Summary":"Midnight Shift Drive to work Sighting of odd Light","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.095144,+-97.496526(10285)&iwloc=A&hl=en\"> mufon case (10285) map </A>","trends":["There have been 2 other sightings in Cedar Creek","There were no other sightings in Cedar Creek on or around March 12th 2008"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"00:07:46","files":["/var/www/straped/mufon/html2text/10285.html.txt","/var/www/straped/mufon/mufon_json/10285.json","/var/www/straped/mufon/org/10285.html"],"Log Number":"US-04122008-0005","Date Submitted":"03/12/2008 11:49 UTC","divs":["Sighting DetailsI work Midnight Shift in Bastrop Texas. I live in Cedar Creek which is only about 10-15 minutes away. The highway on Cedar Creek is Highway 21 and from my house, just a few miles from the SR-71. West on 71 is the Austin Bergstom Airport. I am well aware of commercial, private and military airplanes and helicopters that follow a regulated flight through the area. There is a light beacon on the intersection of 21 and 71 for the Air traffic guidance. March 12th, 2008 on Saturday at 11:49 p.m. I simply looked up into the night sky as I always do when getting into my car to go to work at midnight. It was a beautiful night, clear sky and plenty of stars to view, which is why I look up into the night sky. However upon my curiosity, I saw a glowing star behind our house several miles away in the horizon. At first I was thinking this was a Plane with it's main front beams. I see that a lot from the direction the planes are coming from so they can land at the airport. This object was more intense than a normal aircraft beam. It seemed to have more spectrum to the light. This caught my curiosity, but I didn't think too much of it. It was fairly far away and I had to get to work. Then I pulled out of the neighborhood to Highway 21 and there was the object. How it got to that point in just a mere minute or so really intrigued me. So now it's on the other side of highway 21. I watch it closely as I'm driving East towards Bastrop very closely. The object then starts going in the same direction as if it is following me or reading my thoughts. I lose track of it for a minute and I come across the entrance to Highway 71. I see the object had moved very far on the other side of Highway 71. As I get onto 71, the object then heads East as I'm heading. At this time I realize, this is getting a little freaky. Several cars start to catch up to me from farther back. At this point it was above my car, but I couldn't see it. I looked vividly in my rear view mirrors, but there was now nothing in the night sky. It vanished. Description of the Object: No Material matter was witnessed. It was Star like and had absolutely no other forms lights. No flashing lights, no smaller wing lights. Nothing, just a Star like appearance that could reach impossible distances at speeds that I have never seen any plane achieve. I have Never seen a UFO before in my life. I have always thought it was an interesting subject, but never had any reason to fully believe it was real until I saw this star like object. I have watched UFO shows and abductions from UFO's Following families and such. This made me scared when the UFO was following me, because my wife is pregnant and due in only a few days. The thought of something coming into the house and doing experiments on my family is something I would definitely not want. I try to remain skeptical, because it's not concrete evidence, but I do remain more cautious about what is in the sky now."],"Case Number":"10285","Longitude":"-97.496526","Object Shape":"Sphere, Star-like","Region":"Texas","Disposition":"Unknown","City":"Cedar Creek","Object Flight Path":"Path with directional change","Latitude":"30.095144"}