{"Log Number":"US-04122008-0009","Weather Factors":"None","Date of the Event":"06/07/2001 09:15 UTC","Latitude":"41.647531","map":"<A HREF = \"http://maps.google.com/maps?q=41.647531,+-88.089506(10289)&iwloc=A&hl=en\"> mufon case (10289) map </A>","Viewing Distance":"Unknown","divs":["Sighting Details I was comming back from Bolingbrook to Joliet on Independence Blvd.It was between 9:00-9:30 pm. There was only one other car in the distance in front of me. It was a cloudless purple-blue sky in early June. It caught my eyes because it was the only moving thing in the sky and it was jet-black against a cloudless purple-blue sky. It had one round circular light at each of it three points. It had no wings, windows, nose or tail it just was. It was moving so fast that to the human eye it looked like it was making yellow-white laser straight streak lines in the cloudless sky. The way a photographer shoots with slow moving film to capture cars on the highway. It just wouldn't go away . It just kept making a pattern over and over again. It would come to a complete stop where both lines intercepted.It was over the Lewis University in Romeoville. It just wouldn't go away as if it just wanted to be acknowledged and photographed. It cought my attention because it just didn't make sence. What kept going through my mind was \"you're not going by the rules of standard aviation\" It is not possible to change directions on a drop of a dime and no sonic boom. For something that huge and no sound at all it is not possible. It looked like the way the mouse arrow or pointer moves on the computer screen. It could only make staight laser like lines no round lines or curves. I just kept on saying to myself \"it is not possible to change directions on a drop of a dime\". You are not going by the rules of standard aviation. It just kept making the symbol for \"cross\" or \"plane\" on a cloudless purple blue sky.It just kept repeating that symbol over and over again. The when I was near the Lewis University it shot out towards and stopped over my car and then shot out to my left towards Lockport beofore the ninth street bridge. I had slowed down because I wanted to make sure I was seeing what I was seeing and nothing else. A few years later I went through post-tramatic stress when I saw a recreation on Unsolved Mysteries on the Lifetime channel. What I did not experience,the emotions, feelings at the time came back to haunt me. I guess its like the survivors of car accidents and plane crashes.My mind blocked it out because it could not comprehend what I was seeing. I grew up very strict Catholic, but I cannot deny what was in front of my eyes. It just wouldn't go away.It just kept making the sign of a \"cross\" or \"plane\". Almost like it was saying something happened here and I was involved. It almost seemed like it waited for me to appear before it shot out towards Lockport. I went to the Lewis University 1998-2000. My world ended there for personal reasons Spring term 2000.It was not God but another form of life. Iwas not afraid of it at first because how can you be afraid of something you were never raised to fear. It has broadend my deffintition of \"family\". It did not mark the end of the world it just wanted to be acknowledged."],"Source":"MUFON","Object Shape":"Triangle","trends":["There have been 3 other sightings in Romeoville","There were no other sightings in Romeoville on or around June 7th 2001"],"Longitude":"-88.089506","City":"Romeoville","Tags":"City","Country":"United States","Summary":"It was 2001 early June on Independence Blvd. on a coudless purple-blue sk.y huge black triangular u.f.o","Case Number":"10289","Region":"Illinois","files":["/var/www/straped/mufon/html2text/10289.html.txt","/var/www/straped/mufon/mufon_json/10289.json","/var/www/straped/mufon/org/10289.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/07/2001 09:15 UTC","Object Flight Path":"Path with directional change","Disposition":"Insufficient Data"}