{"Country":"United States","Summary":"saw a star, then realized it was flashing blue and red and moving around in zig zag patterns. It went in a pattern that looked like a hand outline over some other stars. Then it stayed where I originally saw it for about 20min. mom saw it too.","Sighting Duration":"00:35:00","divs":["Sighting DetailsI was in the car with my mother, with my mother driving. We were going to her aunt's house when we saw the object. I was star staring, and there suddenly appeared a new star in the sky, in a what appeared to be a dark area with no stars. I thought that I just hadn't noticed it before, and that it was just a regular star. Then I noticed that the object was emanating a red and blue glow. Not purple, but different spots of red and blue around it were forming. The object gradually (over the course of about 15 seconds) flashed red blue and white itself. it zigzagged at first, then surprised me when it went form star to star at impossible speeds. It looked as though making a hand outline. Then it returned to the original spot for about 25 minutes. My feelings were similar to that of someone who has been reading about and looking at pictures of comets their entire life, but never seen one, and then did with a telescope, but only one other person saw it at all. That's about how I felt. I then told my mother (during the sighting) what I saw, and asked her what it was. she said that she had no idea what it was. I told her that we were near Arizona's borderline, and that arizona was a hotspot for UFOs (Roswell, Sodona, ETC, etc.). She watched it out of the corner of her eye while driving, and agreed that it was a UFO. I then tried to submit this report to MUFON on her iPhone, but her iPhone was what I call \"weirding\". It would have WiFi, then not, then the touchscreen wouldn't work, and so on and so on. We lost sight of the object when we took a turn, saw it for a few more seconds, then it just disappeared. Like out of thin air, or something. As soon as it left, her iPhone worked again, but I hate the touchscreen, so I decided to wait until we got home for me to submit this sighting. Thank you for reading this true and miserably accurate sighting report. The picture included is what the UFO was doing while moving from star to star, creating an outline."],"Object Flight Path":"Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=36.782151,+-119.414742(10291)&iwloc=A&hl=en\"> mufon case (10291) map </A>","trends":[""],"Object Features":"Unknown","Tags":"City","Date Submitted":"04/10/2008 09:30 UTC","Disposition":"IFO","Longitude":"-119.414742","Case Number":"10291","Source":"MUFON","Log Number":"US-04122008-0011","Latitude":"36.782151","Weather Factors":"None","Date of the Event":"04/10/2008 09:30 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/10291.html.txt","/var/www/straped/mufon/more/10291_submitter_file1__UFOmovement.JPG","/var/www/straped/mufon/mufon_json/10291.json","/var/www/straped/mufon/org/10291.html"],"City":"Undisclosed","Object Shape":"Circle, Sphere, Star-like","Viewing Distance":"Over 1 Mile, Unknown"}