{"Case Number":"10296","files":["/var/www/straped/mufon/html2text/10296.html.txt","/var/www/straped/mufon/more/10296_submitter_file1__ufo.jpg","/var/www/straped/mufon/mufon_json/10296.json","/var/www/straped/mufon/org/10296.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting Details I was on the 18th Floor of the Hyatt in Bellevue last night, eating my dinner and star watching. All of a sudden an object flew by in front of my building. Flying slightly higher then the buildings (low) and in front of me, it came and went quickly but i did have time to get my binoculars locked on to it and it was the strangest thing I have ever looked at. my husband observed it as well, with the naked eye and also was fascinated with it. Its lights were very bright, had lights on 4 sides and one in the middle, it was kinda oval shaped and I couldn't tell where the front of the craft was, nor the back, nor the top nor the bottom. I only saw it from one angle as it went by... and if i had to guess, to me it looked like i was seeing it from the bottom (but that would mean it was flying sideways...).. it was a decently large object, not very long- kinda fat- seemed really ..'mechanical'? like the bottom of some huge craft on Star Wars.. but it wasn't huge.. it was nothing like any kind of plane, and moved quickly by - not 'out of this world' quick, but definitely fast. sometimes i laugh when i see peoples ridiculous hand drawn pictures of sightings, but now i understand! heres mine, its the best i could do :P"],"Viewing Distance":"Unknown","Log Number":"US-04132008-0002","Disposition":"Unknown","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 10 other sightings in Bellevue","There were no other sightings in Bellevue on or around April 11th 2008","This sighting has never been favorited.",""],"Region":"Washington","Object Shape":"Disc, Oval, Unknown","Latitude":"47.612737","Date of the Event":"04/11/2008 12:00 UTC","City":"Bellevue","map":"<A HREF = \"http://maps.google.com/maps?q=47.612737,+-122.191849(10296)&iwloc=A&hl=en\"> mufon case (10296) map </A>","Date Submitted":"04/11/2008 12:00 UTC","Tags":"City","Summary":"Strange object over Seattle","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-122.191849"}