{"files":["/var/www/straped/mufon/html2text/10290.html.txt","/var/www/straped/mufon/mufon_json/10290.json","/var/www/straped/mufon/org/10290.html"],"Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around April 12th 2008"],"Date of the Event":"04/12/2008 12:00 UTC","Latitude":"36.116596","Case Number":"10290","Disposition":"Insufficient Data","City":"Las Vegas","Weather Factors":"Unknown","Object Shape":"Cylinder, Disc, Oval, Other","Summary":"This was a multiple craft sighting above Las Vegas. Incredible!","map":"<A HREF = \"http://maps.google.com/maps?q=36.116596,+-115.166846(10290)&iwloc=A&hl=en\"> mufon case (10290) map </A>","Country":"United States","divs":["sighting detailsat around 3 pm local, i was walking across the street from my friends home to mine. while crossing i looked up at the moon and looked at it in the day light. i observed a large white object on its apparent left side, and alerted my wife to look with me. she obseved it also. we both watched it slowly move across the moon. we could not identify it but it was huge. i screamed for my wife to call my brother out of the house. upon his arival moments later a second huge white object appeard off to its left. the first object came to rest on the right side of the moon an appearent 2 inches to my view. now the new secound object flew lower and appeared to be shifting shape. as we watched a flashing red light started to fly up to the second object and flew up to it and at this point out of nowhere a white light flew out of the second object and the flashing light and the white light began to fly away. all this time the first object just hung there motionless.about 5 minutes has elapsed so far. my mother had come out by this time and my father. also my son and his two cousins. we were all watching and screaming to each other about what we were seeing and as we watched several other lights were showing up and circleing the second object and everyone ignored the first. i would look at it off and on. then i saw a few lights fly up to the first object and it then began to fly back towards the second object pass it and slowly leave north west the same way it arived. as it was leaving lights would fly to and from it and to the second object. the first object left our view with a few lights trailing. now all the activity was with the second object. at some points we could see up to seven flying craft. the second one then started to depart away with the first. the whole while the large object apeared almost alive. it seemed to shape shift and to be imaterial. we spent around 20 minutes watching this display. 30 minutes later another object apeared. this time we had binoculars ready. it was a single object that apeared like a cylindar\\disk, and painted yellow. it slowly departed off to the south. we are all stuned at waht we saw. and all agree this was beyond any of our abillity to define."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"04/12/2008 12:00 UTC","Region":"Nevada","Log Number":"US-04122008-0010","Object Features":"Other","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-115.166846"}