{"Latitude":"32.840678","Weather Factors":"Windy","Longitude":"-117.258794","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.840678,+-117.258794(1029)&iwloc=A&hl=en\"> mufon case (1029) map </A>","files":["/var/www/straped/mufon/html2text/1029.html.txt","/var/www/straped/mufon/mufon_json/1029.json","/var/www/straped/mufon/org/1029.html"],"Region":"California","Case Number":"1029","Country":"United States","Object Shape":"Blimp","Disposition":"Unresolved","Date Submitted":"11/19/2000 11:45 UTC","Summary":"Strange objects in San Diego area night sky","divs":["Sighting DetailsOn Sunday, November 19, 2000, I was having trouble sleeping. It was a clearnight, so I moved aside the window blinds in my dorm room (UCSD, La Jolla) andlooked up at the clear night sky, the constellation Orion almost directlyoverhead at that time. I immediately noticed something strange3B two faintly visible red dots at very high altitude were coming from the west,going east under the constellation I had been looking at (Orions belt). Theobject on the left side moved in a straight line going east, and matched speedwith the object on the right side, which appeared to be doing maneuvers (flyingin loops while moving from west to east across the sky). After a minute or two,they both disappeared from view (extreme altitude and distance). A few minutesafter this event, a very large, dull red object (self-illuminated) flew overheadfrom the north headed south at high speed, looking somewhat blimp-like (withfurrows, bulges) while rotating on its horizontal and diagonal axes. Itmaintained altitude (between 100-500 feet up?) for some distance, then gainedaltitude very, very rapidly until it reached the level of the previous objects(and looked the same at that altitude), and disappeared from view (extremealtitude). After these events, another possibly unrelated event occurred nearthe same area of the sky (but in space?)3B I saw between 8 and 10 evenly spaced bright flashes of light. The first fewflashes were stationary, but with each succeeding flash, the point of the flashmoved in a southwestern direction. The last flash was orange and elongated,while the previous ones were all bright white. One of the flashes during thisevent was accompanied by an almost simultaneous flash in another part of the sky(a few inches away in my perspective, if i held my hand at arms length to wherei had been looking)."],"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around November 19th 2000"],"Tags":"City","Date of the Event":"11/19/2000 11:45 UTC","Source":"MUFON","Log Number":"","Viewing Distance":"101-500 Feet","City":"San Diego"}