{"Longitude":"-118.083121","Region":"California","Object Shape":"Disc","Date Submitted":"08/20/1976 07:05 UTC","City":"Artesia","Log Number":"US-04132008-0003","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Latitude":"33.865848","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.865848,+-118.083121(10297)&iwloc=A&hl=en\"> mufon case (10297) map </A>","Case Number":"10297","Summary":"saw disk sauser fly 100ft above me. took lighter out of pocket and lit it.craft houverd for ten sec. and fly off slow.","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Artesia","There were no other sightings in Artesia on or around August 20th 1976"],"files":["/var/www/straped/mufon/html2text/10297.html.txt","/var/www/straped/mufon/mufon_json/10297.json","/var/www/straped/mufon/org/10297.html"],"divs":["Sighting Detailsit was summer of 1976. i was 16 years at the time.i just came back from a walk in my naghborhood.i was locked out the house.i sat on the porch chair and waited for mom and dad. in about 10min. of sitting thereiheard what i thougt was a heliocopter.it was flying right over the house.so i stood up walked to backyard and as i got to the backyard i loked up to see a mettalic disk shape saucer.it had red green yelleow or orange lights at the bottom of the craft was turning in a clockwise motion the craft was about 100 to 150ft. above. about 30ft. in dia.it was moving from east to west very slowly.standing in my yard looking up at somthig that i seen on in search of ect.i was amazed intreged and excited.i had a lighter in my pocket i reached in pocet pulled out the lighter and lit it.the craft moved over me and stopped as to observe what i'm doing. within ten sec. the craft was moving again it went to the west moving very slowly it changed deriction to the south towards o.c county.the lights seem to fad out as the saucer shaped craft slowly left my feild of veiwing.i never seen any thing since.afterwards i had a deep understanding of what i just saw."],"Sighting Duration":"00:07:00","Date of the Event":"08/20/1976 07:05 UTC","Disposition":"Insufficient Data","Tags":"City","Country":"United States"}