{"Date of the Event":"04/11/2008 05:15 UTC","Viewing Distance":"Unknown","Case Number":"10300","Disposition":"Hoax","Weather Factors":"Unknown","Log Number":"US-04132008-0006","Object Features":"Undisclosed","divs":["sighting detailswork nights and went out for a smoke around 5 am this past friday morning. dallas area has continuous air traffic and i was watching planes come in from the northeast---one light was different and became a diamond shaped form the closer it got to richardson coming in over plano. it was off white to amber in color and quite large. at first i thought it may be the goodyear blimp since the craft began hovering near the interchange of hwy 75 and george bush freeway. that is where the pattering of the lights began to change from the diamond shape, to a flat line, to what resembled an inverted tea cup, to a upside down v, etc. there were two lights in the center of the craft that were larger than the others and there were running lights of some kind on the two horizontal points of the kite shape. these were not the normal plane lights of red and blue\\green but were twinkling white and blue and were obviously different than the other associated lights. i would estimate that the craft was 5000 feet altitude and was capable of hovering and moving and then stopping with great ease. i am 58, was sober, and served in the armed forces years ago so i have been around planes more than the average person. this was no helicopter nor tilt wing craft that i can imagine. it was obivious that whatever it was was not trying to be unseen---i kept checking the internet for some postings of other people seeing this event but have yet to see any. some other people had to have seen this. i think i got a chance to see what people were seeing in stevenville texas a few weeks back? and i am sure that what i was seeing was an actual craft of some sort and not some projection by lasers or such."],"trends":["There have been 10 other sightings in Richardson","There was one other sighting in Richardson on or around April 11th 2008"],"Summary":"kite shaped object came from plano texas over richardson and changed shapes several times in five minute period. craft hovered as would a chopper but was much too large. could not see outline of craft but only the lights which were off white to amber.","map":"<A HREF = \"http://maps.google.com/maps?q=32.956179,+-96.72771(10300)&iwloc=A&hl=en\"> mufon case (10300) map </A>","Object Flight Path":"Undisclosed","City":"Richardson","files":["/var/www/straped/mufon/html2text/10300.html.txt","/var/www/straped/mufon/mufon_json/10300.json","/var/www/straped/mufon/org/10300.html"],"Sighting Duration":"Undisclosed","Object Shape":"Blimp, Cross, Diamond, Disc, Square, Rectagular, Triangle","Source":"MUFON","Latitude":"32.956179","Date Submitted":"04/11/2008 05:15 UTC","Longitude":"-96.72771","Country":"United States","Region":"Texas","Tags":"City"}