{"Longitude":"-119.413022","Sighting Duration":"Undisclosed","trends":[],"Log Number":"US-04132008-0009","Region":"California","City":"Undisclosed","Viewing Distance":"Unknown","Disposition":"IFO","Latitude":"36.783781","Date Submitted":"12/31/1995 09:30 UTC","Object Features":"Unknown","Source":"MUFON","Country":"United States","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.783781,+-119.413022(10304)&iwloc=A&hl=en\"> mufon case (10304) map </A>","divs":["Sighting DetailsIt was New Years Eve, December 31 1995. I had just shown up to a co-workers house on Shrader in San Francisco for a party. I was there for only a few minutes and went out to the back porch to have a cigarette. I was looking west at the night sky wich was uncommonly clear for San Francisco in December. I could see allot of stars. I wasnt drunk (yet) as I just started my New Years Eve festivities nor do I use any other substance other than alcohol. So as I was enjoying my cigarette while looking up into the sky, I noticed a slow moving pin of light. I thought I was watching a sattlelite in orbit as I have seen many of those while camping. It looked simular. I watched it move North to South direction for about six to seven seconds not thinking much of it, but then to my suprise it took a sharp angle turn towards the west as it speed up quickly. It then took another sharp turn east and then another north. The three sharp turns and distance traveled were done in under 2 seconds. After the turns it then shot out into space, away from Earth at very fast speed. It kind of looked like a shooting star, but in reverse direction..going away from the planet. I have been telling people my siting for years but just now stumbled across this web site so figured I would post it. I have been looking upward ever since and was always a star gazer before, but I have never seen anything like it before or after my New Years Eve siting. I do watch those sattlelites a little closer now..see if they are going to do something interesting, but no luck."],"Tags":"City","Date of the Event":"12/31/1995 09:30 UTC","Case Number":"10304","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/10304.html.txt","/var/www/straped/mufon/mufon_json/10304.json","/var/www/straped/mufon/org/10304.html"],"Object Flight Path":"Path with directional change","Summary":"Looked like sattlelight moving in orbit, but make sharp angle turns and speed off."}