{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/10301.html.txt","/var/www/straped/mufon/mufon_json/10301.json","/var/www/straped/mufon/org/10301.html"],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Large, low, slow rectanglular object flew over my house","Sighting Duration":"00:00:10","divs":["Sighting DetailsI was walking to my house about 10:00pm and saw a large object with lights flying slow and low over my house. It was going south to north which was left to right. I knew immediately in was extraordinary so I started to run for the house to get my camera. After a few steps I decided that it would take too much time to get the camera so I ran to the side of my house hoping to focus and get as much visual detail as possible with the time left. As I turned the corner I heard what sounded like a jet engine but the sound level was very low. That did not make sense because this thing seemed to be only 500 to 1000 feet above me. The other thing that didn't make sense was that I had ran 15 yards and the object had moved only half the length of the house. I have since estimated that it must have been traveling about 25 miles per hour or even less. I stood there looking almost straight up at it. I focused on the lights. The configuration of the lights was rectangular with 3 white lights forward and 3 lights rearward with the center one flashing red. To count the forward lights I had to move my head considerably from left to right. The distance between the left most and right most light was 3 feet aal. I focused on the left forward light. It was glowing white with no hotspots. The light was square with rounded corners. It actually seemed to have a raised bubble like lens and not flat. All six lights were shaped like this. Then I tried to see passed the lights to the object itself. I tried to see the object in every imaginable shape but the configuration of the lights did not outline a shape. The night was very dark and the object black. I never did see an outline of the object nor surface features, only the rectangular lighting configuration. That was frustrating and object would soon be gone so I walked away. Turns out my neighbor across the street saw the same object."],"Latitude":"33.955452","Object Shape":"Square, Rectagular","Region":"Georgia","Object Flight Path":"Straight-line path","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around March 29th 2008"],"Case Number":"10301","map":"<A HREF = \"http://maps.google.com/maps?q=33.955452,+-84.540653(10301)&iwloc=A&hl=en\"> mufon case (10301) map </A>","Date of the Event":"03/29/2008 10:30 UTC","Date Submitted":"03/29/2008 10:30 UTC","Country":"United States","Tags":"City","Source":"MUFON","Disposition":"Unknown","Longitude":"-84.540653","Log Number":"US-04132008-0007","City":"Marietta","Object Features":"Unknown"}