{"Case Number":"10305","Summary":"It was a star near the horizon that keep coming closer. Thru 10x50 s we watched it become a huge space ship with multi color lights","Longitude":"-104.83077","Object Shape":"Blimp, Disc","Latitude":"31.039856","files":["/var/www/straped/mufon/html2text/10305.html.txt","/var/www/straped/mufon/mufon_json/10305.json","/var/www/straped/mufon/org/10305.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.039856,+-104.83077(10305)&iwloc=A&hl=en\"> mufon case (10305) map </A>","trends":["There has been one other sighting in Van Horn","There were no other sightings in Van Horn on or around September 15th 1979"],"Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Texas","divs":["Sighting DetailsOne fall evening a group of neighbors were meeting in the front yard of the ranch house in Lobo Tx 10 miles so. of Van Horn Tx when I noticed a evening star between two peaks near the so. Horizon over the old river road. I began to notice it was coming closer and larger. I went inside to get my little set of 10 x 10 and a neighbor had her 10 x 50s. By this time it was getting bigger and bigger still just a very bright light. There were children and they were frightened and it was getting very chilly and dark. Inside on the south side of the house were two very large windows. we were switching the glasses around so everyone could see.. Some couldnt find it but when I received the big glasses ..whow..I saw a sometimes flat saucer shape and other times a football shape as I suppose it turned up and down. A few minutes later it was close enough to see the real thing...It was huge with a ring of flashing green lights around the top of the saucer and flashing blue lights on the bottom or vise versa but it had red firing jettisons from top and bottom on each end and I was amazed to see across the top it appeared to be a halo. some entense bright light coming out of the top. It was very colorful and very active. There wasnt supposed to be a star between those two peaks but there it was. Why have I written this? I am 71 and know it needs to be told before I die or loose my mind. This is fact and people can go to the west usa and do their own searching but take something powerful to look through..I visited my sister in Alpine Texas and noticed a pink glow to an eradic moving star and before I could get my sister it dashed behind another star.. Look for a pink glow that moves..stars dont move. I suppose the pink cast color comes from the jettisons. Stars are very white white with a tinze of blue..People in Phoenix Aiz. do it this way. They get a blanket a dusk and the kids and pets and lay there watching all the activity in the nite sky..it is a family fun evening. Try it sometime."],"Date of the Event":"09/15/1979 08:00 UTC","Date Submitted":"09/15/1979 08:00 UTC","Weather Factors":"None","Log Number":"US-04132008-0010","Viewing Distance":"Unknown","Sighting Duration":"00:30:00","Tags":"City","Disposition":"Unknown","Country":"United States","City":"Van Horn"}