{"divs":["sighting detailsaround midnight august 12 going on to the 13th, 1978, in abingdon, maryland, usa, i was observing the annual perseid meteor shower. i am an amateur astronomer, and have studied this all my life. i love the night sky. it has always entranced me. while in the front yard looking for meteors, my mom spotted it first. it was a glowing blue disk about twice the size of the full moon, with a bubble of some sort on top. it was impossible to say how big or how far away it was, since there were no points of reference to go by. it was practically edge on and about 60 degrees altitude above the horizon in the southeastern sky. it was clearly 3-dimensional and seemed to be stationary or to hover for a minute. then it moved in a slow circular pattern before streaking off toward the northeast at an unbelievable speed. that was the last we saw of it. my original drawings have since disappeared. my memories haven't. i never forgot that night. since then, many things have revealed themselves to me, that makes me believe that my life is somehow tied into that event. it was clearly meant for me to see that ufo. there is more that i could say, but this will suffice for now. i have only recently been compelled to get my story out. my mom reported this to the nearby army base after it happened, but no one ever followed up, to my knowledge. i believe i may be responsible for that ufo appearing on that night in that place. there is more, but first read my entire previous email to get the big picture. the hoofbeats of the event that spawned my synchronicities are getting louder everyday. please see my webpage for the complete truth, stories, and poem relating to this in my life: http:\\\\www.authorsden.com\\johnrcoppolella starman4@bellsouth.net"],"Longitude":"-76.279444","Log Number":"US-04132008-0009","Viewing Distance":"Unknown","Tags":"City","Region":"Maryland","City":"Edgewood","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10303.html.txt","/var/www/straped/mufon/mufon_json/10303.json","/var/www/straped/mufon/org/10303.html"],"Date Submitted":"08/12/1978 11:59 UTC","Case Number":"10303","map":"<A HREF = \"http://maps.google.com/maps?q=39.462222,+-76.279444(10303)&iwloc=A&hl=en\"> mufon case (10303) map </A>","Summary":"Saw glowing blue disk like MUFON homepage graphic appear and hover","Object Flight Path":"Hovering then path","Object Features":"Dome, Window(s)","Disposition":"Unknown","trends":["There have been 3 other sightings in Edgewood","There were no other sightings in Edgewood on or around August 12th 1978"],"Date of the Event":"08/12/1978 11:59 UTC","Object Shape":"Disc","Country":"United States","Latitude":"39.462222","Weather Factors":"Unknown","Sighting Duration":"00:02:00"}