{"trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around April 12th 2008"],"City":"Fremont","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"10317","Date Submitted":"04/12/2008 08:25 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.55254,+-121.987272(10317)&iwloc=A&hl=en\"> mufon case (10317) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"None","Log Number":"US-04132008-0022","Summary":"large bright light that moved in a strange way, then disappeared","Date of the Event":"04/12/2008 08:25 UTC","Weather Factors":"None","Country":"United States","Latitude":"37.55254","Region":"California","files":["/var/www/straped/mufon/html2text/10317.html.txt","/var/www/straped/mufon/mufon_json/10317.json","/var/www/straped/mufon/org/10317.html"],"Longitude":"-121.987272","Object Shape":"Circle, Star-like","divs":["Sighting DetailsI was sitting on the steps of my deck in the backyard, right after twilight. I was just looking up into the eastern sky, watching planes go by, and looking at what stars I could see. It was about 8:25 pm when I saw something that looked at first like it was an airplane without the red & blue wing lights. It was a large bright light. As I paid closer attention, I realized that the brightness of the light couldn't be a plane because at the size of the light, I should have been able to HEAR a plane. I had been watching and listening to them all night, as they flew through the sky. Because of the nearby mountains, the sounds of the planes are very discernable. The bright light made no noise, and I started to think that it was just a super bright planet that I maybe hadn't noticed earlier, when I then realized that it had moved. It dipped down and then moved in a horizontal manner to the south, then it stopped and seemed to be hovering, as the light was not increasing or decreasing in size. Then it dipped again and moved horizontally again. This is about when I started to think it was maybe something really strange but I didn't know how long it would be up in the sky, and I was afraid to go grab my camera. I didn't want to take my eyes off of the bright light in the sky. The object then dipped and moved about one or two more times, and then I watched as the light started to dim and then disappear entirely into a tiny dot and then vanished, without the sense that it had flown away. It simply faded away. I ran into the house at this point and called my husband on the phone. It was 8:28 pm when I called him. The whole \"event\" only lasted a few minutes. I didn't see the object again. I've seen meteor showers, a comet and many different planes and helicopters because I live between two international airports. The thing I watched in the sky didn't behave like anything I have ever seen in the night sky."],"Disposition":"Unknown"}