{"Country":"United States","trends":["There has been one other sighting in Damascus","There were no other sightings in Damascus on or around August 31st 2007"],"divs":["Sighting DetailsWell we left the house around 9-9:30pm. I was taking a friend home driving down the road that is adjacent to my driveway. About half a mile into our drive, I saw 1 huge light and 2 smaller but still huge lights above the trees about a few yards away from eachother. And about 30 feet above the trees. I thought it might of been a plane so I slowed down and rolled down my window to see if they were planes cause we live in the flight path toward the airport in Portland. I rolled my window down and stuck my head out the window and didn't hear anything. It was totally quiet. No plane engine or helicopter propeller sounds. Plus it was way too close to the trees to be a plane and way too big. It making any motions or changing paths, it was just in the same place for a while. I thought I would drive further down the road and see if we can get closer to see what it was. We passed a couple trees in our eyesite and when we turned the corner it was gone. I drove all the way up to where they would of been and they were gone. I drove home and told my parents. I was pretty excited."],"Tags":"City","Summary":"3 huge lights above trees","Object Flight Path":"Stationary","City":"Damascus","Object Shape":"Other","Case Number":"10316","map":"<A HREF = \"http://maps.google.com/maps?q=45.394566,+-122.497312(10316)&iwloc=A&hl=en\"> mufon case (10316) map </A>","files":["/var/www/straped/mufon/html2text/10316.html.txt","/var/www/straped/mufon/mufon_json/10316.json","/var/www/straped/mufon/org/10316.html"],"Log Number":"US-04132008-0021","Latitude":"45.394566","Weather Factors":"None","Region":"Oregon","Disposition":"Insufficient Data","Date of the Event":"08/31/2007 09:24 UTC","Object Features":"None","Source":"MUFON","Viewing Distance":"101-500 Feet","Longitude":"-122.497312","Sighting Duration":"00:03:23","Date Submitted":"08/31/2007 09:24 UTC"}