{"Region":"Texas","Object Flight Path":"Undisclosed","Latitude":"30.860174","Summary":"Three round objects illuminated in yellow moving together","Longitude":"-100.60093","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=30.860174,+-100.60093(10318)&iwloc=A&hl=en\"> mufon case (10318) map </A>","Date Submitted":"12/31/2007 07:30 UTC","Source":"MUFON","Date of the Event":"12/31/2007 07:30 UTC","divs":["Sighting DetailsOn December 31st my wife,son,father,father in law, and myself were deer hunting on a secluded ranch in schleicher county Tx. That evening my wife took her first deer and we brung the animal back to camp and rounded everyone up from the evening hunt. My wife and son went into the cabin to start dinner as my dad and my father in law and I cleaned the buck. It was just after dark about 7:15 in the evening as we wrapped up with the deer. As the three of us walked from our cleaning table to the cabin my father in law said \"Look at that shooting star.\" When I looked up to the North in the sky what I saw still makes my hair stand on end. As I looked up I saw three balls of yellow light moving from East to West I would guess it was within a hundred miles and about the size of a beer bottle cap at arms length in the sky. They were moving maybe faster than a plane but not streaking fast. The objects were perfectly spaced apart and moving together slightly upward from east to west. My father and I looked at each other with shock and disbelief. The yellow balls moved across the sky for about 15 to 20 seconds and then what happened I still cannot understand or rationalize. I don't believe or disbelieve in these things but I wish I had not seen this and it still bothers me very much. As the three balls of light moved across the sky they had a light blue glow around the outside of the three and suddenly the first ball punched a hole into the sky. I know that sounds unimaginable but it is the only way I know to describe it. It was like throwing a ball into black water. When the first ball flashed out of sight the other two followed so fast they looked like a solid streak of yellow light. When the streak of light went into the \"hole in the sky\" it flashed shut and a purple blip of light shot across the sky in both directions for what I guess to be hundreds of miles. It looked like when you turn off a television and that purple line shoots across the screen. I have seen dozens of shooting stars and meteors. I have seen the shuttle come back in a couple of times. I got to see Haley's Comet when I was a kid but I have never seen anything at all like what I saw that night. I think about it a lot and as many guys that deer hunt that area that time of year I know my dad and father in law and I were not the only ones to see it. I don't know what we seen that night but I cannot imagine that it was man made."],"City":"Eldorado","trends":["There have been no other sightings in Eldorado","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/10318.html.txt","/var/www/straped/mufon/mufon_json/10318.json","/var/www/straped/mufon/org/10318.html"],"Weather Factors":"Unknown","Sighting Duration":"00:01:10","Viewing Distance":"Unknown","Object Features":"Undisclosed","Country":"United States","Tags":"City","Object Shape":"Circle","Case Number":"10318","Log Number":"US-04142008-0001"}