{"Longitude":"-78.184727","Summary":"Multicolored, circular, hovering motion","Region":"New York","Sighting Duration":"Undisclosed","divs":["Sighting Details1.) I've been staying with family for a few weeks at they're residence 2.) I smoke cigarette's on the front porch and being it's out in the country i'm always star gazing while i'm out there. This night it was extremely clear out and as soon as i went outside i noticed a very bright light out in the distance that i've never seen. 3.) Initially i thought the object was an aircraft or helicopper but it was too bright to be either. I continued to look closely at the object and noticed it seemed to be mutlicolored. It moved as though it was hovering. Moving slowly up and down and side to side. I went into the house to find out if a meteor or maybe a planet was set to be in the sky but found nothing. Two different times i noticed the horizon lit up below it. It wasn't a beam of light and it didn't appear to come from the object but both happenings i've never witnessed while i've been up here. To make sure i wasn't crazy i grabbed a few of my family members to take a look at the object. They agreed the object in the sky wasn't an aircraft and something they couldn't quite explain. After a few minutes they went back inside because they were a little creeped out by it. After 20 minutes of watching it i went back inside and watched a little tv. Within about a 45 minute time period and checking the object twice, on the third check it was gone. 4.) Multicolored (changing colors slowly, almost wave like), circular, and the movement seemed to be somewhat slow from a distance but was moving side to side and up and down but the movements were spiradic. 5.) Initially, i felt fine but after i realized it wasn't an aircraft or anything like that it made me feel a little tense. It wasn't anything i've ever seen before. 6.) When i came outside the third time it was gone"],"Disposition":"IFO","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"04/06/2008 10:15 UTC","trends":["There have been 7 other sightings in Batavia","There were no other sightings in Batavia on or around April 6th 2008"],"files":["/var/www/straped/mufon/html2text/10319.html.txt","/var/www/straped/mufon/mufon_json/10319.json","/var/www/straped/mufon/org/10319.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"43.005206","Date of the Event":"04/06/2008 10:15 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.005206,+-78.184727(10319)&iwloc=A&hl=en\"> mufon case (10319) map </A>","Log Number":"US-04142008-0002","Object Shape":"Circle","City":"Batavia","Country":"United States","Case Number":"10319"}