{"Longitude":"-92.401318","Disposition":"Unknown","Region":"Arkansas","trends":["There have been no other sightings in Shannon Hills","This sighting has never been favorited."],"Weather Factors":"None","Object Shape":"Star-like","Latitude":"34.623521","Log Number":"US-04142008-0012","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"10329","Object Features":"Unknown","divs":["Sighting DetailsSilent green light, looked like star but not traveling like star. Straight line- very fast! My husband was standing on the front porch while the dogs went potty. He witnessed a white round light traveling East to West that disappeared mid flight. Was not traveling up or down, straight line East to West. Soundless. He called me to come outside and was seemingly stunned. While he was describing it to me we noticed a green light traveling from the area where it disappeared. It traveled towards us and above us and beyond our sight (greater than 100 feet up). Same East to West path at an extremely high rate of speed and no sound whatsoever. We live in airport flight path and are used to planes- this was *not* a plane. No red or white light with it and light did not flash at all. Airplane lights flash and that is why this caught our attention. We thought maybe it was a star until we realized it was moving in a horizontal line- and way to fast. We've seen things that have made us wonder before but we could chalk it up to other things. This was not a plane, for sure. And we cannot come up with a feasible description for this object. The next day- military helicopters were flying in formation tracing the same path (but going the opposite way). I don't know if that's related or not, but I've haven't seen military aircraft out there since we had tornados in 1997. None before, none since. It was very out of the ordinary."],"Summary":"Silent green light, looked like star but not traveling like star. Straight line- very fast!","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","City":"Shannon Hills","Date of the Event":"04/12/2008 01:00 UTC","files":["/var/www/straped/mufon/html2text/10329.html.txt","/var/www/straped/mufon/mufon_json/10329.json","/var/www/straped/mufon/org/10329.html"],"Date Submitted":"04/12/2008 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.623521,+-92.401318(10329)&iwloc=A&hl=en\"> mufon case (10329) map </A>","Sighting Duration":"Undisclosed","Country":"United States"}