{"Longitude":"-122.086352","Latitude":"37.694097","Region":"California","Disposition":"IFO","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.694097,+-122.086352(10325)&iwloc=A&hl=en\"> mufon case (10325) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"02/10/2008 03:03 UTC","files":["/var/www/straped/mufon/html2text/10325.html.txt","/var/www/straped/mufon/more/10325_submitter_file1__DSC_1494.jpg","/var/www/straped/mufon/mufon_json/10325.json","/var/www/straped/mufon/org/10325.html"],"City":"Castro Valley","Object Shape":"Cylinder","trends":["There have been 5 other sightings in Castro Valley","There were no other sightings in Castro Valley on or around February 10th 2008","This sighting has never been favorited.",""],"Date of the Event":"02/10/2008 03:03 UTC","Summary":"Saw multi-colored still object in the sky","divs":["Sighting DetailsI was sitting in my kitchen, browsing the web on my laptop, and looked out the window and saw something in the sky, approx. 30 degrees above the horizon. The shape of it looked unusual to me, so I grabbed my digital camera and went outside. The object wasn't moving, didn't make any noise. I pointed my camera at it, zoomed in as much as possible and took a few shots. I watched it for a couple of minutes, and it did not move at all. When I saw it, it looked white, almost like a glowing grain of rice in the sky, a few degrees off-vertical from my viewpoint. I thought it was something relatively close-by, not a star. My perception was it was maybe 5-7 miles away. After watching it for a while, I was tired so I went back inside and went to bed. The next day I transferred the pictures to my laptop and only one of them captured the object. I was surprised to see it was actually multi-colored (it appeared white to the naked eye). As you can see in the picture, if you zoom in 100%, stars show up without motion blur. This leads me to believe the multi-colored object also has little or no motion blur. If you have some idea of what I saw, I'd appreciate your opinion. Thanks, Dan Cogswell"],"Object Features":"Undisclosed","Tags":"City","Log Number":"US-04142008-0008","Source":"MUFON","Object Flight Path":"Undisclosed","Case Number":"10325"}