{"Summary":"Thought it was a graceful flock of glowing birds undulating across the sky","Date Submitted":"04/13/2008 11:20 UTC","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around April 13th 2008"],"Country":"United States","Region":"California","Disposition":"Unknown","Source":"MUFON","City":"Los Angeles","Tags":"City","divs":["Sighting DetailsI was sitting outside in my backyard listening to Coast to Coast talking about seeing UFOs with night vision goggles and wishing that a UFO would appear in my sky as it had done another time when I was out there. I saw a few airplanes go by on their approach to Santa Monica airport, and I also saw a helicopter, but mostly I was staring at the Big Dipper and wondering if I could eventually see the little dipper, but alas there's too much light in LA for that these days. Then out of the North East I saw a flock of birds, or so I thought approaching me as I watched them get larger, I realized they were glowing ovals and not birds at all. They glowed a soft multi-color or mish mash of color, not clear white, but as they were overhead I could see that they were a formation of ovals and not birds at all. I started screaming for my son to come outside, but he didn't hear me. It passed directly overhead and made no noise at all. The whole formation sort of looked like a boomerang shape but not exactly as it was more extended on both ends so as to be in the shape of a sweatheart neckline. BUT the shape was not solid, it was made up of many glowing ovals and it undulated a bit like a snake or maybe more like a butterfly only gently moving its wings. I watched it until it disappeared into the brightness of the moon which is to the west of me right now. I held up my hand and at arm's length it was about the length of two pointer fingers when it was directly above me, or maybe a little bigger directly above me and that was the length that it was when it was angled above me."],"Case Number":"10324","Longitude":"-118.239085","Object Shape":"Boomerang, Other","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10324.html.txt","/var/www/straped/mufon/mufon_json/10324.json","/var/www/straped/mufon/org/10324.html"],"Latitude":"34.057514","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-04142008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=34.057514,+-118.239085(10324)&iwloc=A&hl=en\"> mufon case (10324) map </A>","Date of the Event":"04/13/2008 11:20 UTC"}