{"Sighting Duration":"Undisclosed","City":"Los Angeles","Summary":"Looked like an undulating flock of birds floating silently across the sky","Viewing Distance":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around April 13th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"Undisclosed","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=34.059524,+-118.234415(10327)&iwloc=A&hl=en\"> mufon case (10327) map </A>","Region":"California","Longitude":"-118.234415","Case Number":"10327","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI already reported this to the national MUFON organization, but I wanted to also report it to the Los Angeles MUFON and also I created a representation of what this looked like using PhotoShop which I will attach to the report. I didn't do that for my report to the national organization. I was sitting outside in my backyard listening to Coast to Coast talking about seeing UFOs with night vision goggles and wishing that a UFO would appear in my sky as it had done another time when I was out there. I saw a few airplanes go by on their approach to Santa Monica airport, and I also saw a helicopter, but mostly I was staring at the Big Dipper and wondering if I could eventually see the little dipper, but alas there's too much light in LA for that these days. Then out of the North East I saw a flock of birds, or so I thought approaching me. As I watched them get larger, I realized they were glowing ovals and not birds at all. They glowed a soft multi-color or mish mash of color, not clear white, but as they were overhead I could see that they were a formation of ovals and not birds at all. I started screaming for my son to come outside, but he didn't hear me. It passed directly overhead and made no noise at all. Usually a flock of birds make some squawking noise. And these were glowing ovals and not birds. The whole formation sort of looked like a boomerang shape but not exactly as it was more extended on both ends so as to be in the shape of a sweatheart neckline. BUT the shape was not solid, it was made up of many glowing ovals and it undulated a bit like a snake or maybe more like a butterfly only gently moving its wings. I watched it until it disappeared into the brightness of the moon which is to the west of me right now. I held up my hand and at arm's length it was about the length of two pointer fingers when it was directly above me, or maybe a little bigger directly above me and that was the length that it was when it was angled above me. I was so excited and when Travis (my son) finally answered my screaming he was too late because it had disappeared into the bright moonlight. I went inside and reported it to MUFON and then I made a representation of it in PhotoShop so I could send in a picture of what it seemed to look like. I needed a hazy LA sky to use as a background but couldn't find one, so you have to use your imagination. I think I may have drawn too many ovals relative to the entire length of the thing. It may have been fewer and larger ovals. The colors were non-distinct, but definitely not solid white. It was kind of a mish mash of color there, but seemed to glow more teals to gold so that's what I used here."],"Log Number":"US-04142008-0010","Tags":"City","Disposition":"Unknown","Country":"United States","Date Submitted":"04/13/2008 11:20 UTC","files":["/var/www/straped/mufon/html2text/10327.html.txt","/var/www/straped/mufon/more/10327_submitter_file1__BirdflockshapedUFOcomposite.jpg","/var/www/straped/mufon/mufon_json/10327.json","/var/www/straped/mufon/org/10327.html"],"Latitude":"34.059524","Weather Factors":"Unknown","Date of the Event":"04/13/2008 11:20 UTC"}