{"Tags":"City","Country":"United States","City":"Santa Cruz","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Date of the Event":"10/20/2007 12:00 UTC","Object Flight Path":"Hovering then path","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/10326.html.txt","/var/www/straped/mufon/mufon_json/10326.json","/var/www/straped/mufon/org/10326.html"],"Case Number":"10326","Latitude":"36.977657","Date Submitted":"10/20/2007 12:00 UTC","Summary":"UFO Sighted In Santa Cruz California.","Longitude":"-122.028996","map":"<A HREF = \"http://maps.google.com/maps?q=36.977657,+-122.028996(10326)&iwloc=A&hl=en\"> mufon case (10326) map </A>","divs":["Sighting DetailsWhile on the boardwalk in Santa Cruz, CA, I was looking to the north from the sky tram ride. I noticed a disc hovering in the air at approximately 10,000 feet above and approximately 10 to 20 miles away. It appeared as a quarter in the sky. The day was clear with no cloud cover. The white objet was very difficult see even with the clear blue background. There was no sound. I watched it for a minute to make sure I could not identify the object as a known air craft. I pointed it out to my fiance and she also saw it. We watched it for a minute hovering and then it began to move to the east. Very slowly at first and then it seemed to speed up in two intervals. First it began to move fast and then in the second interval it sped up and went out of sight. This speed transition took place in about 3 seconds. I asked her if she had seen the same thing? She said she had and we just sat there in amazement. My back ground is that I own my own buisness and I have Been flying and flying in air craft my whole life. Both of my grand fathers were pilots and I fly myself.I have also been an avid aircraft enthusiest my whole life designing and building small aircraft. I know how conventional air craft fly and this craft exhibited no know flight behavior."],"Object Features":"None","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around October 20th 2007"],"Sighting Duration":"00:02:00","Disposition":"Unknown","Source":"MUFON","Log Number":"US-04142008-0009","Region":"California"}