{"Longitude":"-74.027813","divs":["Sighting Details(Time: Mid October 1980, Place: Hoboken NJ, 1 block west of Washington Street.) Arriving back from dinner we drove around the block a few times looking for a place to park legally. Finally parked, I was unloading a few things from the trunk, when my fiance, looked up at the full moon and said, \"Isn't that odd; I've never seen stars like that next to the moon.\" We were looking at the moon high over NYC from Hoboken NJ. I looked up and next to the full moon on a clear cloudless night, which was high in the sky, there were 6 star-like dash lines. The objects appeared to be at an extemely high altitude, if not out of the earth's atmosphere. When I first looked the objects were stationary. Then they began to move, and changed their formation of 6 objects side by side to 6 objects stacked on top of each other. Then the formation rotated vertically, with the bottom object rotated to the top of the stack, top to the bottom. Then one by one from the top of the stack, they took off at a phenomenal speed heading west, but the objects flew in a mild \"S\" pattern almost like a snake path, instead of flying in a straight line. They all kept an equal distance from each other as they headed west. At the altitude they appeared at this was a faster speed than any conventional aircraft could fly at. I would say 10,000 MPH + to take a wild guess. We lost sight of the objects after they had flown west. The entire time the objects appeared at a very high altitude, most likely out of the earths atmosphere. As we watched this, a crowd of about a dozen people had gathered to watch this spectacle in the sky. It was so strange that the hair was standing up on my head. The next day we made numerous phone calls to local autorities and airports and news stations trying to find out if anyone else had witnessed this odd display in the sky the night before, and there was no positive response from anyone."],"Object Shape":"Star-like","Summary":"6 objects in formation, at high altitude next to the moon, changing formation, then flying to the west at high speed swerving back and forth in S-path","Viewing Distance":"Unknown","Log Number":"US-04142008-0011","Object Flight Path":"Undisclosed","trends":["There have been 7 other sightings in Hoboken","There were no other sightings in Hoboken on or around October 20th 1980"],"Country":"United States","Date Submitted":"10/20/1980 10:15 UTC","Latitude":"40.75369","map":"<A HREF = \"http://maps.google.com/maps?q=40.75369,+-74.027813(10328)&iwloc=A&hl=en\"> mufon case (10328) map </A>","Object Features":"Undisclosed","Disposition":"Unknown","Region":"New Jersey","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"10328","Weather Factors":"Unknown","Date of the Event":"10/20/1980 10:15 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/10328.html.txt","/var/www/straped/mufon/mufon_json/10328.json","/var/www/straped/mufon/org/10328.html"],"City":"Hoboken"}