{"Object Shape":"Disc","Object Features":"None","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/10335.html.txt","/var/www/straped/mufon/mufon_json/10335.json","/var/www/straped/mufon/org/10335.html"],"trends":["There have been 9 other sightings in Jackson","There were no other sightings in Jackson on or around January 18th 2008"],"Case Number":"10335","Disposition":"Unknown","Region":"Mississippi","Log Number":"US-04142008-0018","map":"<A HREF = \"http://maps.google.com/maps?q=32.306887,+-90.18321(10335)&iwloc=A&hl=en\"> mufon case (10335) map </A>","Sighting Duration":"Undisclosed","City":"Jackson","Weather Factors":"Unknown","Summary":"Disk shaped with blue and white lights circling it","Latitude":"32.306887","Date Submitted":"01/18/2008 05:30 UTC","divs":["Sighting DetailsI work right off of Beasely Rd and Northwest Industrial Parkway. I was the last person to leave work on that Friday and it was still somewhat light out. The street lights hadn't came on yet. I turned east onto Beasely Rd and as I got close to the entergy power plant. I noticed the object over the treetops. I noticed it because of the lights and because it wasn't moving at all. At first I thought that it might be a light on a radio tower but then I noticed that there was a tower much farther to the right and it had a single red light on it. I pass this way everyday to and from work so I immediately noticed it. It was right past the entergy power plant on Beasely road on the right hand side. As I kept going towards it I kept thinking that it couldn't possibly be what I thought it was. It scared the hell out of me because I knew that it wasn't a helicoptor or plane because there were no wings or rotors and it was circular. Also there was no sound. I kept looking at it as I was slowly driving. After about 100 hundred feet or so I pulled over so that I could get out of my car and look at it. It was right above the treetops the whole time with the lights circling it. It appeared to be at least a quarter mile in width. As I stopped my car I was still looking at it through my windshield. I opened my car door and stood up and it had disappeared in the 10 seconds or so that it took me to open door and get out. I looked around in a complete circle and saw nor heard anything. I was so nervous and scared when I got back into the car because I didn't know where it had went to or in what direction. I was so scared that night that I couldn't sleep. I stayed up all night with the lights on. For the 2 weeks following the incident I barely slept. I would finally go to sleep around 2am and then have to be up at 6am to get ready for work. I told all of my co-workers and managers about it but they all just laughed at me. I also told friends and family and no one believed me."],"Tags":"City","Longitude":"-90.18321","Date of the Event":"01/18/2008 05:30 UTC","Country":"United States","Object Flight Path":"Stationary","Source":"MUFON"}