{"files":["/var/www/straped/mufon/html2text/10330.html.txt","/var/www/straped/mufon/mufon_json/10330.json","/var/www/straped/mufon/org/10330.html"],"Disposition":"Unknown","Viewing Distance":"20 Feet or Less","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around July 4th 1965"],"Log Number":"US-04142008-0013","Case Number":"10330","Tags":"City","Date Submitted":"07/04/1965 12:00 UTC","Summary":"5mm diameter sphere with four segments emited yellow-green light from lower rear segment circled around witness 15 times at 3 feet away","Weather Factors":"Unknown","City":"Rockford","Object Shape":"Sphere","Source":"MUFON","divs":["Sighting DetailsIn 1965 in the late evening two witness's (boys ages 16 and 14) were walking east toward north main street in Rockford Illinois to the local Root Beer Barrel. The 16 year old witness interviewed, now 58 years old, glanced to the west and saw a small light blink about 50 yards away and 50 yards up. The two boys turned to look at the light which started to decend directly towards them blinking at a rate of about once every three seconds. The witness estimated the speed of the object at about 1 foot per second. The object approached to about chest level and then started circling them at the same rate of speed for about 15 revolutions. The object departed on a reverse course of it's entry but with an alternating left right zig-zag course blinking until they lost sight of it. The object was described as about 5mm in diameter, a matte black sphere with four segments. The segments were quarter spheres but were not delineated by lines or indentations. The lower rear quarter away from the direction of motion emitted a light green light about once every three seconds that lasted less than a second in duration. The object approached to within three feet, close enough to reach out and touch it. The boys were afraid of the object and decided to toss one of their 4th of July firecrackers at it. This they did tossing it near the object. The object then left on the aforementioned zig-zag course. The younger witness does not remember the incident and was not present. This older witness also gave field investigator Richard Sherertz and myself a chapter from a book that his daughter in law is writing that described a similar sized UFO that blinked and came through a closed glass window. The older witness seemed to think that this sighting twelve years later was the same object that he had seen. I can't speak to the similarity without interviewing the daughter in law but I did relate a ball lightening incident that I had reported to me and that it also had penetrated a closed glass thermopane window. I mention this to indicate that this family has had some experience with UFO sightings."],"Sighting Duration":"Undisclosed","Date of the Event":"07/04/1965 12:00 UTC","Latitude":"42.277721","map":"<A HREF = \"http://maps.google.com/maps?q=42.277721,+-89.086315(10330)&iwloc=A&hl=en\"> mufon case (10330) map </A>","Longitude":"-89.086315","Object Flight Path":"Path with directional change","Region":"Illinois","Country":"United States","Object Features":"Other"}