{"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around March 1st 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.720399,+-117.147995(10333)&iwloc=A&hl=en\"> mufon case (10333) map </A>","Object Shape":"Disc","Latitude":"32.720399","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"03/01/2007 04:30 UTC","Object Flight Path":"Undisclosed","Longitude":"-117.147995","Summary":"Large. floating,pulsating,orange disc","Log Number":"US-04142008-0016","divs":["Sighting DetailsI was in San Diego on March 1st to take care of a traffic ticket in Court. I was staying at my family's apartment in the center of the city. At approximetly 4:30 I happened to look up in the sky,as I was sitting on the second floor balcony. When I saw huge orange ball, It was west by south like the Coranado Islands. Anyway it was initially very far up in the sky but it was so big it looked close. I remember as it started to decend it was pulsing in the center and the perimeter. Like a sound speaker vibrares as sound is comming from it. It also had a cloud like aperature on the top of it in a 12 noon postion. like a mine solar flare. It took a long time for it to decend. But it never stopped pulsing like it was sending a signal or something,Eventually it came to a stop. Then started parallel movemet to the ground. for about ten minutes. then took off not real fast but faster than in had decended. I do not know how long it was there before I saw it but it lasted for 45 min. to an hour after i saw it.I called for the neighbors to come out but no one would come out and look at it. It was not in the news that night. Or on t.v. I do not know how you could miss it. The wierd thing was the pulsing, and the strange cloud of orange vapor cloud or whateever it was. Also the shear size of the object.I am sure you could see it for many miles in all directions. yet nothing on radio,tv. scanner nothhing Also as it got closer to earth the pulsing was more pronounded but it was totally silent. Also i could not tell if it was 3 dimentional or not as it did not turn. just floating. suspended,hanging there for all to see."],"Sighting Duration":"Undisclosed","City":"San Diego","Date Submitted":"03/01/2007 04:30 UTC","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/10333.html.txt","/var/www/straped/mufon/mufon_json/10333.json","/var/www/straped/mufon/org/10333.html"],"Case Number":"10333","Region":"California","Object Features":"Undisclosed"}