{"map":"<A HREF = \"http://maps.google.com/maps?q=32.812835,+-96.761013(10331)&iwloc=A&hl=en\"> mufon case (10331) map </A>","Summary":"Bright green fireball shape with yellow edges and bright tail.","Date Submitted":"03/22/2008 12:00 UTC","Country":"United States","Latitude":"32.812835","Weather Factors":"Unknown","Region":"Texas","divs":["Sighting DetailsI don't know if this was an UFO or not and just accepted it as a falling Comet or something until I saw the UFO films on TV. I was driving home late at night from my Grandchildren's home, and just as I got near my house, I looked straight down the street into the sky and saw this very bright fireball in what appeared to be a fast moving downward motion, with the streak of a fiery tail behind it. The part I later thought about was that it was larger than any tiny falling Comet I have seen in the past, way up in the atmosphere. This looked close to earth and it was a bright light green color. The color around the edges and in the tail were more of a light yellow. It was moving very fast, so I was not able to study it but a second or two. I didn't think much of it at the time except to think what a neat experience to see something like that from the heavens. Then, later, when watching a segment on the History Channel about the UFO sightings by two different men and the films they took, it came to my mind that this object looked very similar. So thought I would report it. I had to guess at the date and the time (they are approximate) because I did not think of any significance relating to it until some time later (approx. 3 weeks). Thank You, Jacqueline Schroller"],"Sighting Duration":"00:00:02","Object Features":"Undisclosed","Log Number":"US-04142008-0014","Disposition":"IFO","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around March 22nd 2008"],"Longitude":"-96.761013","City":"Dallas","Case Number":"10331","Source":"MUFON","Date of the Event":"03/22/2008 12:00 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/10331.html.txt","/var/www/straped/mufon/mufon_json/10331.json","/var/www/straped/mufon/org/10331.html"],"Tags":"City"}