{"Latitude":"45.598934","Log Number":"US-04152008-0001","Country":"United States","Sighting Duration":"00:06:00","Disposition":"Unknown","Object Shape":"Egg, Oval, Sphere","Source":"MUFON","Date of the Event":"03/25/2008 03:25 UTC","City":"The Dalles","Summary":"floresent green and pink dual color orb","Viewing Distance":"20 Feet or Less","Object Features":"Other, Unknown","Region":"Oregon","Case Number":"10343","trends":["There have been 7 other sightings in The Dalles","There was one other sighting in The Dalles on or around March 25th 2008"],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-121.174572","files":["/var/www/straped/mufon/html2text/10343.html.txt","/var/www/straped/mufon/mufon_json/10343.json","/var/www/straped/mufon/org/10343.html"],"Date Submitted":"03/25/2008 03:25 UTC","divs":["Sighting DetailsI was fishing on the columbia river down river from the Dalles at meemalusa state park. at around 5'o'clock when I noticed a light coming through the trees along the path that went through the trees, the light ball of gas emerged from the bushes glowing blue-green in color. as it got closer directly in my direction the gaseas ball became more of an orb with two defenite but seperate colors. I continued to take pictures becoming more and more excited with every picture I took! It almost seemed to take longer to digitalize on my camera as it came to rest on the ground in front of me. Aproximately 15 feet in front of me I continued to take pictures with my 8 pixel digital camera and the ball sat on the ground for about two minutes soon after it rose up and started to travel the back in the direction it came from becomeing a gaseas orb again as it got to the trees I went to try and capture the orb on the other side of the trees as it came across the river. the trip to the point of the cliff overlooking sephulcer island where victor trivett was buried on the indian burial grounds where his deceased chiefs daughter wife was buried would only have been a brief walk. but when i got there, there was no orb or gas ball but I did get some great pictures of the sunset. later I was relooking the photos I took when I realized the pictures I took of the scenery and the orb, the sun was still in the sky, but when I got to the cliff it was a sunset when I was taking pictures of the columbia. later realized that the time that I was missing was twenty minutes. I ended up taking 15 picuters with the orb in them. coming, staying, and leaving."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.598934,+-121.174572(10343)&iwloc=A&hl=en\"> mufon case (10343) map </A>"}