{"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","trends":["There have been 61 other sightings in Kokomo","There were 3 other sightings in Kokomo on or around April 14th 2008"],"Country":"United States","divs":["sighting detailsi observed a deep amber light approaching my house. it was on the east side of 31 and parallel 26. as it approached 100 west, approximately, i observed another pulsating amber light directly underneath the one and it continued gliding north, parallel 31. the deep amber light glided toward my home and hovered. i could see beautiful blues and greens and amber with a red light pulsating and it appeared to be rotating.a friend and i went to the west side of my home where high activity has been observed. i counted 4, 2 stationary at different points, and 2 were gliding south to north at low height. it appeared they were at 200 west ( dixon road ) or further west around 350 west. as i was watching 1 of them, it stopped midair and hovered low above a house, it dropped about 4 inches visually and rose slowly and continued north.it appeared like about 1\\2 to 3\\4 mile away from my position. they had the same color lights as previous craft, after a few minutes, they would return, north to south on or around 200 west, and when they approached 26, they would turn on a dime and go back north. it was my impression they were looking for something and reminded me of a hawk, scanning the ground while soaring looking for food. i have been watching high activity for quite awhile. i know they are not planes, flares or anything normal."],"files":["/var/www/straped/mufon/html2text/10348.html.txt","/var/www/straped/mufon/mufon_json/10348.json","/var/www/straped/mufon/org/10348.html"],"Log Number":"US-04152008-0006","Tags":"City","Date Submitted":"04/14/2008 12:00 UTC","Region":"Indiana","Longitude":"-86.130323","City":"Kokomo","Disposition":"Unknown","Source":"MUFON","Latitude":"40.487797","Date of the Event":"04/14/2008 12:00 UTC","Case Number":"10348","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Shape":"Oval, Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Weather Factors":"Unknown","Summary":"Amber Lights and Craft","map":"<A HREF = \"http://maps.google.com/maps?q=40.487797,+-86.130323(10348)&iwloc=A&hl=en\"> mufon case (10348) map </A>"}