{"trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around April 14th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.691481,+-86.242127(10342)&iwloc=A&hl=en\"> mufon case (10342) map </A>","Longitude":"-86.242127","Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","Case Number":"10342","files":["/var/www/straped/mufon/html2text/10342.html.txt","/var/www/straped/mufon/mufon_json/10342.json","/var/www/straped/mufon/org/10342.html"],"City":"South Bend","Object Shape":"Triangle","Log Number":"US-04142008-0025","Weather Factors":"None","divs":["Sighting DetailsDriving north on Manchester Avenue in South Bend, IN, my daughter and I saw an object with large, solid white lights flying extremely low in the neighborhood. We live in a flight path, and because the object was flying in the opposite direction of the landing path (heading south, then turning west), and was so low, I originally thought a plane was crashing. Then as it came closer to us, we could see that it wasn't a plane and we couldn't figure out what it could be. We're thinking it was triangular in shape. It had a small light in the center, and at least 3 large solid white lights on the tips. We are estimating the shape, because all we could see were the lights. It turned very slowly, westward, and increased its speed and disappeared quickly. We tried to follow it, but lost sight of it immediately. There was no sound, which was unusual due to its close proximity to us. It looked like it could brush the tops of the tall trees on the street. The whole experience lasted no more than 30 seconds. I really wanted to follow it to see what it really was. My curiosity dominated my emotions at that moment. Later, I felt vulnerable. My daughter felt intimidated - she said it gave her a bad feeling, as if there were malicious intentions."],"Sighting Duration":"Undisclosed","Summary":"Very bright white lights, flying frighteningly low and slow- I thought a plane was crashing at first.","Tags":"City","Object Flight Path":"Path with directional change","Country":"United States","Date of the Event":"04/14/2008 10:50 UTC","Latitude":"41.691481","Disposition":"Insufficient Data","Object Features":"Unknown","Source":"MUFON","Date Submitted":"04/14/2008 10:50 UTC"}