{"Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10340.html.txt","/var/www/straped/mufon/mufon_json/10340.json","/var/www/straped/mufon/org/10340.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.454436,+-99.725934(10340)&iwloc=A&hl=en\"> mufon case (10340) map </A>","City":"Abilene","Date of the Event":"07/03/1994 12:00 UTC","Tags":"City","Object Shape":"Square, Rectagular","Object Features":"Undisclosed","Weather Factors":"Unknown","Longitude":"-99.725934","Date Submitted":"07/03/1994 12:00 UTC","Region":"Texas","Sighting Duration":"Undisclosed","Log Number":"US-04142008-0023","Latitude":"32.454436","Case Number":"10340","Summary":"left work @ 5pm. 45 min. drive , arived home @7:15. On the way home we saw a huge object in the sky. It was moving about 15 mph. It was 50' off the ground and silent. Watched it go overhead . It reversed direction, and i turned to chase it. I followed it","divs":["sighting detailson or around july 3rd\\5th i was on my way home. we left my ofice at 5pm and headed home which was a 45 min. drive. on the way home i saw this huge object in the sky oner head to the west.it was about the size of a wal-mart flying about 45 to 50' over the left side of the road. i pulled up under the edge of the craft and got out of my truck to watch it go over us. my wife and 2 month old son were in the truck, but i could not pass up the chance to see what it was. it was shaped like a big triangle with the tips flatened. from side to side it was 250 to 300feet across , from front to back it was 100 feet and about 2 1\\2 to 3 stories tall. as i walked under it the under side looked flat and the edges were rounded. there was a slight breeze as it flew over. as it passed i ran back to the truck to chase it. when i got to my truck it was going the other direction. i turned the truck around and chase it for about 3 miles to the end of the road. it continued on passed some trees. as it went over the trees two jets ,one on either side escorted it toward dyess air force base, and they dissapeared over the trees. we gohome at 7:15, we should have gotten home around 6:00 pm. my wife called dyess to report it and they said they had nothing in the air at that time. i told her not to tell anyone about this because they would not believe it. after we got home we realized we could not account for at least an hour of our time. i have had trouble sleeping , i have dreams about it. and i can't stop wanting to learn more about it. i have seen shows that talk about missing time and implants and such. i have things under my skin that i don't know where they came from or what they are. they move around and sometimes they bother me and sometime i don't know that they are there. that was not the first one that i have seen . i have seen them since i was a child my brother to . please help me find out what is haunting me."],"trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around July 3rd 1994"],"Disposition":"Unknown"}