{"Object Flight Path":"Straight-line path","Latitude":"47.863657","Region":"Washington","Date Submitted":"03/19/2008 01:30 UTC","files":["/var/www/straped/mufon/html2text/10344.html.txt","/var/www/straped/mufon/more/10344_submitter_file1__NASAUFOMarch08.jpg","/var/www/straped/mufon/more/10344_submitter_file2__DSCN1387.JPG","/var/www/straped/mufon/more/10344_submitter_file3__DSCN1386.JPG","/var/www/straped/mufon/mufon_json/10344.json","/var/www/straped/mufon/org/10344.html"],"Object Features":"Window(s), Other, Unknown","Object Shape":"Cigar, Circle, Disc, Oval, Other","divs":["sighting detailsoften times, while i am reading, i will let the nasa channel run in the background, especially during sts missions. when i take a break from reading, i will rerun the footage to see if there is anything interesting. it is amazing the number of times i see \"orbs\" and multiple types of other objects. on march 19th i hit the jackpot! about 15 or 20 minutes into the 1pm-2pm window of recording, a set of lights begins to emerge from the sheer blackness of space. as the object comes into view, it seems as if it was emerging from the shadow of the station. the lights are in an area that is clearly not any part of the space station. i couldn't believe my eyes! this craft is only defined by the light from its interior. the exterior is lost in the blackness of space. it appears that it is a hatbox circle or oval on top of a \"skirt\" disc\\oval which is either dimmly lite from within or from the light reflected from the windows above. in the windows of the upper \"hatbox\" there is clearly a light inside behind moving pixels. everyone who has seen these moving pixels believe them to be \"beings\". the light in these upper windows varies in intensity, as if various lights were being turned on or off. the \"beings\" move about the cabin, at least appear to be moving, because something dark moves in front of the lights time and again. the nasa people didn't catch this for at least 10 minutes. when they became aware, they switched cameras. on a new view of the space station, you could clearly see the shadow of something big slide over the space station. i have this recorded on my dish satellite dvr. i have three other recordings of other objects. none of them are the same type of object. if you tell me how to move the recording to another media, i will send it to you for you to evaluate. heck, i'd even send you the box and let you see the original. it's the real deal... right there on the nasa channel! this one is hard to put down to the imagination. it can't be anything other than an alien ship."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-04152008-0002","Longitude":"-121.969038","Weather Factors":"Unknown","Summary":"Clearly visible image of a UFO on a NASA shuttle mission. You can detect \"people\" moving inside craft. I have a recording off object.","Date of the Event":"03/19/2008 01:30 UTC","Tags":"City","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.863657,+-121.969038(10344)&iwloc=A&hl=en\"> mufon case (10344) map </A>","Country":"United States","trends":["There have been 6 other sightings in Monroe","There were no other sightings in Monroe on or around March 19th 2008","This sighting has never been favorited.",""],"Case Number":"10344","City":"Monroe"}