{"trends":["There have been 4 other sightings in Paintsville","There were no other sightings in Paintsville on or around December 5th 1988"],"Date Submitted":"12/05/1988 12:05 UTC","Country":"United States","Object Flight Path":"Path with directional change","Source":"MUFON","Date of the Event":"12/05/1988 12:05 UTC","Summary":"Single point of bright light.","Longitude":"-82.807105","Viewing Distance":"Over One Mile","Object Shape":"Flash, Star-like","Object Features":"Undisclosed","Tags":"City","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=37.814538,+-82.807105(10341)&iwloc=A&hl=en\"> mufon case (10341) map </A>","divs":["Sighting DetailsI was 16 years old when this happened. It has took me 20 years to accept what I saw and I now feel a need to report it. It was on the night of Dec. 5, 1988 at 12:05 AM. I layed down in my bed that was situated underneath my window. I had rolled over to go to sleep and a light shown in my room bright enough that I opened my eyes to see what was going on. I knew there was nobody that could shine a light in my bedroom window because it was very high off the ground. So, I sat up and looked around and saw out my window a single point of light in the sky. It looked to be a bright planet but, it started to move at very high rate of speed across the sky in different directions. It was no airplane because it could turn on a dime and go in the opposite direction with no pause .... it just flew about the sky with ease. It never got very close and all I saw was the single point of bright light and when it was finished darting across the sky in no apparent pattern it zipped off to the north and was gone. I could see the single point of light when it zipped around. It looked like what you would see when you point a flashlight on a wall and zig zag it around. That is what it looked like to me except it was very high in the sky. My first reaction when I saw the point of light start moving in an unconventional way was to try to scream. I would open my mouth but nothing could come out. I tried and tried as I watched this object dart around in the night sky. I eventually go out a faint squeal. Then my squeals got louder and louder until I could scream very loudly and my mother came to my room in a panic wondering what was going on. By the time she came in the object had darted off in the sky. That night I covered my bedroom window and slept the rest of the night with my mom. After that I moved my bed to the other side of the room and it took me several years to even have my bed facing a window. Now, I still am weary of looking upon the night sky afraid of what I might see. Here I am 20 years later still feeling the need to report what I saw that night. I still think of it and have no idea if anyone else saw what I did. I am now on a mission to find out."],"files":["/var/www/straped/mufon/html2text/10341.html.txt","/var/www/straped/mufon/mufon_json/10341.json","/var/www/straped/mufon/org/10341.html"],"Case Number":"10341","Weather Factors":"None","Latitude":"37.814538","City":"Paintsville","Disposition":"Unknown","Log Number":"US-04142008-0024","Sighting Duration":"Undisclosed"}