{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.654179,+-91.534931(10352)&iwloc=A&hl=en\"> mufon case (10352) map </A>","Object Shape":"Fireball, Sphere, Star-like","Log Number":"US-04152008-0010","Summary":"a shiny metalic yellow like it was on fire it also sort of a strobe light flashing green and red","Longitude":"-91.534931","Source":"MUFON","Object Flight Path":"Undisclosed","divs":["Sighting Detailsfirst of all i'm 13 years old i not pranking you and i kinda wish i hadn't seen it because i almost afraid of something bad happening. okay here we go- i was at my friends house who lives right across the street. We were jumping on his trampoline and i looked up in the western sky towards our town of Salem. The first thing i thought was a U.F.O because i had thought i had seen one earlier that day. The one i had seen earlier was like a blimp, no vapor trail or anything but back to the star like one. Okay it came from across the sky and the first thing i noticed was that it had no vapor trail and it stayed at a steady pace. As it was going past us my friend and my sister felt quesy sick to our stomache. We watched slowly go towards the eastern sky. it slowed down at the treeline it slowed down and a red and green strobe light span aroud. Afterwards we felt like we didn't want to discuss it but i forced myself to talk about it and forced them to. We went and told my dad a former marine areoplane mecanic he had no idea what it was we described. my friend shawn is gay i'm doing htis to piss him off."],"Date Submitted":"04/14/2008 12:00 UTC","Region":"Missouri","Sighting Duration":"Undisclosed","Date of the Event":"04/14/2008 12:00 UTC","Latitude":"37.654179","Weather Factors":"Unknown","trends":["There have been 11 other sightings in Salem","There were no other sightings in Salem on or around April 14th 2008"],"Disposition":"Hoax","Case Number":"10352","files":["/var/www/straped/mufon/html2text/10352.html.txt","/var/www/straped/mufon/mufon_json/10352.json","/var/www/straped/mufon/org/10352.html"],"Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed","City":"Salem"}