{"Log Number":"US-04152008-0011","divs":["sighting detailsco-worker and i were out on back dock enjoying the cool temps. and sun, watching planes and the like, when co-worker noticed what at first appeared to be a small white object travelling over our location ene to wsw at a decent clip. the skies were very clear blue with very broken clouds at about 5-8k. my first impression was it was a daytime iss sighting but then it just hovered or floated above our bldg at about 5-7k for about 8 mins. it appeared to be a bright white sphere with a cylindrical protuberance that acted like a weather vane in behavior but didn't seem to be affected by wind direction per se. saw an airliner fly above it at near cruising altitude but it wasnt near enough to it to give a good indication of relative height\\size. after about 7-8 minutes over our location it began to drift away at a very slow pace then gradually, nearly exponentially quickly accelerated off out of sight to the wsw. i am half in, half out this being a released balloon possibly caught in an updraft over our position up until the point of its accelerating off like it did. now i'm not sure....we lost sight of it as it blended into the diffuse light of the far distance near our horizon. i called tys tower and they say they tracked nothing unusual in our area."],"Source":"MUFON","Date Submitted":"04/15/2008 02:22 UTC","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around April 15th 2008"],"Latitude":"35.970518","map":"<A HREF = \"http://maps.google.com/maps?q=35.970518,+-83.917329(10353)&iwloc=A&hl=en\"> mufon case (10353) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Other","Object Flight Path":"Straight-line path","Tags":"City","Region":"Tennessee","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/15/2008 02:22 UTC","Weather Factors":"Does Not Apply","Longitude":"-83.917329","City":"Knoxville","Case Number":"10353","Country":"United States","Object Shape":"Cylinder, Sphere","files":["/var/www/straped/mufon/html2text/10353.html.txt","/var/www/straped/mufon/mufon_json/10353.json","/var/www/straped/mufon/org/10353.html"],"Summary":"Unfamiliar object come from ENE to WSW, seemed to float above bldg. then left on original course."}