{"Sighting Duration":"Undisclosed","Log Number":"US-04152008-0009","Object Flight Path":"Straight-line path","Longitude":"-104.963586","Source":"MUFON","Disposition":"Unresolved","City":"Highlands Ranch","Summary":"3 boomerang flying in delta formation","Weather Factors":"None","Date Submitted":"04/14/2008 11:23 UTC","Case Number":"10351","Tags":"City","divs":["Sighting DetailsI was standing in my driveway looking at the stars in Highlands Ranch, CO facing south. I was making some observations for a class I am taking for school. I was taking a break and gazing while chatting with my dad. I looked to what I thought was a shooting star, pointing for my dad and I realized it wasn't. My second thought was \"oh no this looks like an airplane breaking up on fire\" and my heart started to sink. Then they got a little closer and it was 3 boomerang unidentified flying objects flying in a delta formation. The boomerang was that of dark orange almost brown. What I thought was fire and a shooting star where the 'wingman' sort of floating and dancing around the lead, almost playing with each other. The center craft was maintaing its heading. I saw them in the southwest sky and tracked them to the east till I could no longer see them. There was for but a second I could hardly make out the centers disc outline. It was really odd, yet I was very excited. I have a pilots license and I know what aircraft are capable of and I can identify any commercial, millitary and civilian aircraft, but the speed and the manuvering where unreal. I you were to see all three flying it looked like a wobbling duck with the center craft being the head and its wings were the 2 flanking it. I would estimate that they where less than 3 away miles, and 5,000 to 15,000 feet high and travelling 600-1000+ miles per hour and were completly silent and lasted 20 seconds. This was my first unidentified citing and I was strangly okay with it. I know for certain I will have my head turned towards the heaven much more now."],"Region":"Colorado","Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"04/14/2008 11:23 UTC","files":["/var/www/straped/mufon/html2text/10351.html.txt","/var/www/straped/mufon/mufon_json/10351.json","/var/www/straped/mufon/org/10351.html"],"trends":["There have been 9 other sightings in Highlands Ranch","There were no other sightings in Highlands Ranch on or around April 14th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.548544,+-104.963586(10351)&iwloc=A&hl=en\"> mufon case (10351) map </A>","Object Shape":"Boomerang","Latitude":"39.548544","Object Features":"None"}