{"Date Submitted":"04/01/2008 12:00 UTC","Object Flight Path":"Stationary,Other","Sighting Duration":"Undisclosed","City":"Salina","Object Shape":"Sphere","Tags":"City","Date of the Event":"04/01/2008 12:00 UTC","divs":["Sighting DetailsOn Apr 1st, I was driving through Kansas, heading west, on I-70. I drove over a small rise and came upon an area with tons (100's?) of birds of different types. Most all were on the ground, except for a few that were headed down. I was looking at the birds when I noticed light reflecting off of something, like a mirror. I was leaning forward a great deal and looking out of my front window, so I must have been looking up at about 75-80 degrees. At first, I thought I was looking at a bunch of birds flying around each other, but then noticed how much higher they were than anything else. Must have been a few thousand feet. Judging by the height, these objects must have been pretty large because they were still clearly visable. I was able to relate the height by looking at the birds. There were maybe 27 of them swarming around each other in a fixed position; not making any progress across the sky. They appeared silver and light reflected off of them often. At one point, they stopped moving haphazardly and began to form 3 separate V formations (9 spheres in each), staggered slightly in position and height. They stayed like this for a few seconds (20 or so), at which point I tried to take a picture with my camera phone. At almost the same time, each of the formations (at slightly staggered times)grew brighter, as a group, and then just disappeared. Gone from the sky completely. From my albeit limited knowledge of biology, birds don't do that. When I attempted to view my camera phone picture, it wasn't there. In addition, the face of my phone was fried. It has a permanent wierdly shaped image on it."],"Case Number":"10358","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-97.605754","Weather Factors":"Unknown","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.84493","trends":["There have been 8 other sightings in Salina","There were no other sightings in Salina on or around April 1st 2008"],"Log Number":"US-04152008-0016","files":["/var/www/straped/mufon/html2text/10358.html.txt","/var/www/straped/mufon/mufon_json/10358.json","/var/www/straped/mufon/org/10358.html"],"Summary":"Multiple Spherical Silver Objects","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.84493,+-97.605754(10358)&iwloc=A&hl=en\"> mufon case (10358) map </A>","Region":"Kansas"}