{"trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 15th 2008"],"Date Submitted":"04/15/2008 12:00 UTC","Longitude":"-112.066727","Tags":"City","divs":["Sighting DetailsFor some reason, Phoenix seems to be a hotspot for these star-like craft that have been appearing almost daily. I have been making a point of looking at the sky whenever I am outside and scanning to see if I can get a chance to someday see one of these craft at a lower altitude than what I normally do. These craft appear out of nowhere and sit stationary for a few seconds, and then they will take off at a leisurely pace across the sky until they are out of my line of sight. Today I saw a total of 3 of these craft in the space of 10 minutes, and they all appeared about 2 minutes apart from each other and all of them headed to the East towards the Superstition mountain range East of Phoenix. I didn't see any yesterday (Monday) but I have no doubt that I will probably see more of these UFO's as the week progresses. Unfortunately I don't have a camera with a telephoto lens so I can photograph the evidence, but I intend to borrow one from a friend tonight so perhaps my next report will have 'proof' that I am seeing these craft. Until then - keep your eyes on the skies if you are in Phoenix and hopefully you too will get a chance to see these amazing craft in action ! Peace - John Birmingham"],"Case Number":"10355","Summary":"I saw a total of 3 UFO's that just 'popped' into existence in the sky almost directly overhead.","Region":"Arizona","Date of the Event":"04/15/2008 12:00 UTC","Viewing Distance":"Unknown","Disposition":"Unknown","Log Number":"US-04152008-0013","Latitude":"33.457347","files":["/var/www/straped/mufon/html2text/10355.html.txt","/var/www/straped/mufon/mufon_json/10355.json","/var/www/straped/mufon/org/10355.html"],"Country":"United States","City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.457347,+-112.066727(10355)&iwloc=A&hl=en\"> mufon case (10355) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Disc, Star-like","Source":"MUFON","Object Flight Path":"Undisclosed"}