{"Viewing Distance":"21-100 Feet","Case Number":"10366","Region":"Indiana","City":"Evansville","map":"<A HREF = \"http://maps.google.com/maps?q=37.977699,+-87.56575(10366)&iwloc=A&hl=en\"> mufon case (10366) map </A>","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around July 31st 1953"],"Log Number":"US-04162008-0004","Disposition":"Unknown","Weather Factors":"Unknown","Object Shape":"Sphere","Longitude":"-87.56575","divs":["Sighting DetailsAs a child of six years old I was playing in the alley beside our home in the 400 block of third Street, Evansville, IN, in August of 1953. My mother was in the kitchen at the sink which overlooked alley where I was playing. I heard a loud humming sound overhead, There was a large silvery colored globe approx 100reet in . ft in diameter over a tree beside the alley. about fifty foot in the air, the loud humming sound was coming from it. The globe had a band of portal windows that circled around the globe. Humanoid figures were pearing out those portals watching me play. My mother seeing the craft sent for my father to get me in the house. She called the police. Numerous police cars arrived in moments. The police began firing at the globe with rifles, pistols and shotguns. That went on for about one hour. The craft never seemed to be hit are damaged. Then it finally just went straight up into the air until it disappeared. I had a large bushel basket of those shell casings that I picked up out of the alley until I threw them away as a freshman in high school."],"Date of the Event":"07/31/1953 12:00 UTC","Country":"United States","Latitude":"37.977699","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Object Features":"Window(s)","Summary":"I wittnessed a UFO being fired upon with small arms by the city police in Evansviile IN in 1953","files":["/var/www/straped/mufon/html2text/10366.html.txt","/var/www/straped/mufon/mufon_json/10366.json","/var/www/straped/mufon/org/10366.html"],"Date Submitted":"07/31/1953 12:00 UTC","Source":"MUFON","Tags":"City"}