{"Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Disc, Flash","Region":"District of Columbia","Latitude":"38.897082","Weather Factors":"Unknown","Log Number":"US-04162008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=38.897082,+-77.032276(10369)&iwloc=A&hl=en\"> mufon case (10369) map </A>","Longitude":"-77.032276","Disposition":"Unknown","City":"Washington","Viewing Distance":"Unknown","divs":["Sighting DetailsMyself and a Capitol police officer was on the West steps of the US Capitol, working, when we noticed something strange flying straight up at about 15,000 feet moving from north to south over the US Capitol Dome. The object was bright silver in color, disc shape, moving relatively slow and would stop on occasion- there was a bright white flash emitting from it about every minute or so, we couldn't tell if it was from the object or a reflection off of it. The object was flying in a rather odd pattern- it would stop for many seconds make a sharp left or right movement then start moving straight again. At times it looked like it was moving in a zig zag pattern than it would make right angle turns. Sorry, its hard to explain. We couldn't figure out what this was because the area it was flying in was restricted air space. The police officer notified his superior about the object but I don't know what they did from there. The object was literally straight up above the Capitol dome and was also seen by the tourist that noticed us looking at it. We watched the object for about twenty minutes until it was out of site toward Virginia. Sorry it took me so long to report this sighting. I happen to run into the police officer who witnessed this sighting with me, so I decided to finally report it."],"Object Flight Path":"Undisclosed","Source":"MUFON","Date of the Event":"04/22/1999 12:00 UTC","Date Submitted":"04/22/1999 12:00 UTC","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10369.html.txt","/var/www/straped/mufon/mufon_json/10369.json","/var/www/straped/mufon/org/10369.html"],"Summary":"Myself and Police officer working at US Capitol spotted","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around April 22nd 1999"],"Case Number":"10369"}