{"Disposition":"Unknown","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around April 30th 1969"],"Object Features":"Unknown","Log Number":"US-04152008-0019","Source":"MUFON","Object Shape":"Other","divs":["Sighting DetailsI was about 9 yrs old in Stephenville, Tx. and taking the trash out through the backyard. I walked about halfway to the fence when a circle of bluish light shone all around me from directly above. I would say the circle was about 8-10 feet in dia. on the ground. I looked up and all I could see was the light. It was bright but it didn't hurt my eyes. It lasted about 15- 20 seconds, not long, I didn't think anything about it. This was back in the summer of '68 or '69. I didn't tell anyone about it because they would think I was looney. Anyway, that winter, at the spot where the light shone down, the grass stayed green and needed mowing. I remember my dad getting upset because my mom made him mow that spot just about every week. That winter was the only one that I remember the grass growing throughout the winter. It was St. Augustine grass. I wasn't scared or anything, because I didn't know any better. I had my head down watching where I was walking so as not to step in dog mess. Then just suddenly, a bluish light circle lit me up. I looked up and yep, it was a blue light. It lasted about 15-20 seconds and then it just turned off. No craft, no nothing, no stucture or anything where the light was. I was looking at it when it turned off. There was nothing there that I can remember. I emptied the trash and went in the house. It was just getting the dark part of dusk. It was pretty dark outside but not quite night. I could see stars and I don't recall seeing the moon. Anyway, I told my wife about this some years ago. She says she believes me but, I think she was just saying that. We saw the Stephenville UFO show on the History channel the other day and she insisted that I tell y'all about it. She also thinks now that because of the incident, I heal faster than just about anybody I know. I would like to thank you for your time. I feel better knowing that there are some people who will listen to things like this with open minds."],"Longitude":"-98.197203","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"04/30/1969 12:00 UTC","Tags":"City","Object Flight Path":"Stationary","City":"Stephenville","files":["/var/www/straped/mufon/html2text/10361.html.txt","/var/www/straped/mufon/mufon_json/10361.json","/var/www/straped/mufon/org/10361.html"],"Case Number":"10361","Sighting Duration":"00:00:20","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.226316,+-98.197203(10361)&iwloc=A&hl=en\"> mufon case (10361) map </A>","Summary":"A circle of light shone on me and the grass didn't die that winter in the cricle","Region":"Texas","Latitude":"32.226316","Date of the Event":"04/30/1969 12:00 UTC"}