{"Disposition":"IFO","Tags":"City","Country":"United States","City":"Elizabethtown","divs":["Sighting DetailsAt about 4:50am On April 16th, I couldn't sleep because I was extremely hungry so I went downstairs to the kitchen to get some cereal. After fixing a bowl of cereal I was leaving the kitchen when I spotted an unusual glowing object in the sky out of the front door windows. Im awake in the a.m. hours every day so it takes something pretty unusual to catch my eye. The object I saw was just visible above the tree line at the end of the street. Distance wise it appeared to be above the next neighborhood over but I can't be for certain. At first I thought to myself that it must the moon, but it was such a bold yellow color and I had never seen the moon look that way before. It was a half-circle boomerang shape with the bow of it facing toward the ground which also seemed unusual to me. As far as I could tell it appeared to simply be hovering over one spot. At 4:50am we still have roughly 2 hours until daylight aswell so this left me more confused. The object also had an aura-like glow to it like the sun during the sunset hours but this was long before even sunrise. My first reaction when I noticed this object was one of skepticism. That initial reaction quickly turned into disbelief as I went back upstairs to get another look at it from higher up. I've always been a believer in UFOs, but I had never seen one myself prior to this so I tried to remain skeptical. After my second look at the object I sat down at my computer desk to file a UFO report. I first checked to see if I could find any reports of other people seeing strange things in other parts of the state recently. After about 2 minutes I looked for the object again and it was slightly lowered so that I could barely make it out through the tree tops. After that I came to the Mufon website to file my report. When I looked outside again after about another 45 seconds, the object was gone. Im not sure if it landed somewhere or left the area but the last time I saw the object it was lowering more toward the horizon. My first thought of it possibly being the moon was dispelled after it dissapeared so quickly. The moon takes a lot longer than 10 minutes to move that distance and as I said at this time of morning there is almost 2 hours until daylight left. It should probably be noted that Fort Knox is only 11 miles from my home. They do fly aircraft in and out of there, but they seldomly pass over this area and when they do its easy to hear. The object I saw made no sound and it was a very solid shape and color, not a flashing light. I have attached an extremely crude illustration of what I saw. I am not an artist."],"Object Features":"None","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-04162008-0003","Latitude":"37.712405","Object Flight Path":"Stationary","Summary":"Large bright and bold yellow half-circle in the sky that hovered in one spot before moving on.","Object Shape":"Boomerang","Date Submitted":"04/16/2008 04:50 UTC","files":["/var/www/straped/mufon/html2text/10365.html.txt","/var/www/straped/mufon/more/10365_submitter_file1__strangeobject.JPG","/var/www/straped/mufon/mufon_json/10365.json","/var/www/straped/mufon/org/10365.html"],"trends":["There have been 4 other sightings in Elizabethtown","There were no other sightings in Elizabethtown on or around April 16th 2008","This sighting has never been favorited.",""],"Case Number":"10365","Sighting Duration":"Undisclosed","Longitude":"-85.855081","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.712405,+-85.855081(10365)&iwloc=A&hl=en\"> mufon case (10365) map </A>","Date of the Event":"04/16/2008 04:50 UTC","Region":"Kentucky"}