{"map":"<A HREF = \"http://maps.google.com/maps?q=40.804821,+-73.33623(10377)&iwloc=A&hl=en\"> mufon case (10377) map </A>","Longitude":"-73.33623","Date of the Event":"04/16/2008 08:30 UTC","Object Shape":"Circle, Star-like","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/10377.html.txt","/var/www/straped/mufon/mufon_json/10377.json","/var/www/straped/mufon/org/10377.html"],"Latitude":"40.804821","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Other","Weather Factors":"Unknown","Object Features":"Unknown","City":"Dix Hills","Summary":"Saw about 5-7 bright glowing objects seperately, then grouped together.","Region":"New York","Date Submitted":"04/16/2008 08:30 UTC","Tags":"City","Log Number":"US-04172008-0002","divs":["Sighting DetailsI was working in Dix Hills, suffolk county, new york. I was in a customers back yard at 8:30 pm on 4-16-08, which I have been to before- it's on a hill with a schoolyard below. I was doing repairs on their swimming pool. I noticed in between the trees in the distance 5-7 bright lights. They were white, red, blue-green and orange. I noticed them pretty quickly because it was so dark in the yard. Looking at it quickly kind of looked like it may have been lights on a tall building- but I realized theres no buildings nearby. I watched for a few moments and the lights were on a slight angle- very bright. I continued with my work and looked again and noticed the lights were moving into a circular formation and then seperated into a straight line(resembled what I saw on t.v. about the Arizona lights). I took 2 twenty second long videos with my phone ,which shows the lights but the video at night on a cell phone camcorder doesnt really show as well as I saw with my eyes. I thought maybe it could have been planes but of all the planes in this area I have never seen that many at once in the same area and never seen planes that close group together for obvious safety reasons. After a while the lights just seemed to disappear one by one."],"Source":"MUFON","trends":["There have been no other sightings in Dix Hills","This sighting has never been favorited."],"Case Number":"10377","Viewing Distance":"501 Feet - 1 Mile, Unknown"}