{"Tags":"City","Region":"Wisconsin","Source":"MUFON","Date of the Event":"10/15/1971 05:30 UTC","Disposition":"Insufficient Data","Sighting Duration":"00:05:00","Summary":"most amazing airborne movement ever seen","Latitude":"43.807426","Object Shape":"Sphere","trends":["There have been 3 other sightings in La Crosse","There were no other sightings in La Crosse on or around October 15th 1971","This sighting has never been favorited.",""],"Country":"United States","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10376.html.txt","/var/www/straped/mufon/more/10376_submitter_file1__scan0001.jpg","/var/www/straped/mufon/mufon_json/10376.json","/var/www/straped/mufon/org/10376.html"],"Date Submitted":"10/15/1971 05:30 UTC","Longitude":"-91.235801","Log Number":"US-04172008-0001","City":"La Crosse","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.807426,+-91.235801(10376)&iwloc=A&hl=en\"> mufon case (10376) map </A>","Case Number":"10376","divs":["Sighting DetailsMy brother and I left Chuts landing located on swift creek, at about 5:15a.m. on a clear pre-dawn starlit morning for duck hunting at Klosse's Marsh. Although I don't remember what phase the moon was in, I was able to navigate the sloughs to Klosse's Marsh at full speed in my 14\" aluminum craft 40 horse powered Evinrude motor which pushed us along at 30+ mph. Not possible through narrow sloughs unless the starlit conditions are not just right and they were as i did not need my brother who was sitting in the bow to use a spotlight to shine the way. being a short ride of about 3 miles we arrived in the duck blind about 15 minutes later with no change in the black sky back ground and its bright stars. my brother left the boat to go to the blind and i was pulling it onto the small Isle we were hunting from. As he approached the blind he said look at the plane coming in to land and I glanced up to see what appeared to be a single large landing light descending as if it were a plane making an approach for landing. I, said yep your right, but he then said there isn't an airport in this area as the La Crosse airport was due north of us about 10 miles away, by this time I was walking toward him, all the time watching the bright light descending on a slope that looked like a plane preparing to land at a speed that would seem to verify that. The glide path may have been a couple minutes long as by this time we were standing together when I suggested it may be a helicopter with a search light on. seconds later the bright light stopped mid air about 5-10K feet above the Minnesota bluffs. It hovered motionless for about a minute, which confirmed it was as I suggested, a helicopter with its search light on. We then observed it slowly ascending and I said something to the effect I was right again, meaning it was a helicopter, but then half way up to the horizon it went from what one expects to an indescribable speed straight up....amazing yes, but not as amazing as the perfect right turn at the same speed. Its exit took it back towards the same direction that my brother had first seen it, but of course at a altitude I would not venture to guess at. The kicker is just prior to losing sight of this object it appeared to be throwing off sparkles of light. My conclusion and my brothers was we had just witnessed conclusive proof the earth is being visited by exterrestials or by our own kind that have developed the ability to travel back in time. My brother is sharp yet at 72 and I of sound mind have always felt the need to let someone know, hence I have decided to send this to you after listening to a UFO segment on the history channel that mentioned Mufon. Nothing to back up our story but maybe another unknown duck hunter in Klosses Marsh that early October morning, but being a combat vet of Viet Nam I knew how choppers and air craft fly.......they don't and can't do what we saw. it is as vivid to me today as any of my life's experiences, yes that includes combat. Just needed to share before time takes its toll on my brother or myself. Do what you may with this, but I believe it to be important and factual. Glenn Strittmater"],"Object Flight Path":"Undisclosed"}