{"Case Number":"10388","Tags":"City","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.301026,+-82.988015(10388)&iwloc=A&hl=en\"> mufon case (10388) map </A>","divs":["Sighting DetailsI was coming home after my long day at school. I was driving my car and it was around 1 Am. No one was on the road so i was a little scared and had my windows up and music off. Suddenly when i was trying to get home quickly, i noticed a big yellow light in the sky far away. It became very huge in no time. I thought it was the moon but then i looked around to see if the moon was anywhere else and i did see the moon in the other direction so it wasnt the moon. I would say it because double the size of sun when its setting at night. It was really bright and it wasnt a star because it was too big. I kept looking at it and got a little scared since i have an astrophobia. I was driving in the direction of that thing so i slowed down my car. I got really scared and wanted to take a picture but when i took a pic i didnt see it in my phone camera, maybe because it wasnt a good quality. I kept looking at it and all of the sudden it became really big and dissappeard so quick! i tried looking for it but didnt see it anywhere At that time i was really scared and quickly called my dad, I stopped my car and tried to catch my breath and then i drove home very scared. It was something that i have never seen before and i cant explain wat it looked like, i guess u just have to see it."],"Date of the Event":"04/16/2008 12:00 UTC","Longitude":"-82.988015","Latitude":"42.301026","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around April 16th 2008"],"City":"Windsor","Country":"Canada","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Log Number":"CA-04172008-0013","Object Shape":"Circle","Disposition":"Unresolved","Region":"Ontario","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10388.html.txt","/var/www/straped/mufon/mufon_json/10388.json","/var/www/straped/mufon/org/10388.html"],"Date Submitted":"04/16/2008 12:00 UTC","Summary":"Sharp bright yellow light twice as big as a setting sun.","Viewing Distance":"101-500 Feet","Source":"MUFON"}