{"Date of the Event":"09/01/2000 10:00 UTC","Date Submitted":"09/01/2000 10:00 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Star-like","Country":"United States","Latitude":"33.608722","Object Features":"Unknown","Region":"Arkansas","divs":["sighting detailsfamily member and i rounded corner northbound on top of levee near potlatch paper mill. i saw in the sky to the east of the mill what looked like a laser pen dancing on a wall. moved erratically over a fair distance and super fast. the first thing i said was \"could that be a model airplane flying towards us?\". i was laughed at. the laughing stopped immediately when the object shot straight up vertically from an altitude of about 100ft to maybe 1000ft in less than a second and stopped on a dime. we were probably over a mile away from the mill to the south (mississippi river to our east\\right). object was stationary for a few seconds. we killed the truck and got out. then the object came down a couple hundred feet (?) and shot east towards the river maybe a half mile, again in less that one second, and stopped. it rose a little, and came back to the west behind the mill power tower, stopped, wiggled a little and then came in front of the tower moving back towards the river. the lights of the mill are very bright, and this thing was multiple times brighter then anything around, and was constantly (but with no pattern that i can remember) changing colors. no sound, no predictable speed or pattern. we were stunned. as we continued to watch this for what seemed like ten minutes (i'm sure it was only two or three), the object went vertical a few more times (with the same speed) and finally came back down to about 200 ft and stopped. a few seconds later it shot off to the west towards mcgehee at the same altitude. one can see the lights of mcgehee easily from the top of the levee. it went out of sight over mcgehee in less than one minute (mcgehee is about 10 miles away as crow flies). i have only told this to a few people, and my family member with me that night will not speak about it, even to me. i have seen two other things in my time that i could not explain, but would have to rationalize weather balloons\\blimps and a meteorite\\satellite before i would utter \"aliens\". but until i see this thing up close and someone hands me a remote control for it, it will always remain unexplained to me. i have flown with friends who are pilots and i fully understand the science of lift and drag. there is no aircraft anywhere that can do what we saw. i have heard that others have seen lights at the mill before but have never talked about it with anyone else who may have seen something out there. i am curious if anything has been seen since."],"files":["/var/www/straped/mufon/html2text/10386.html.txt","/var/www/straped/mufon/mufon_json/10386.json","/var/www/straped/mufon/org/10386.html"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Longitude":"-91.206779","Log Number":"US-04172008-0011","City":"Arkansas City","Weather Factors":"Unknown","Summary":"BALL-SIZED SPHERE, VERY BRIGHT, VERY FAST, COLORS","Disposition":"Unknown","trends":["There have been no other sightings in Arkansas City","This sighting has never been favorited."],"Source":"MUFON","Tags":"City","Sighting Duration":"00:02:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.608722,+-91.206779(10386)&iwloc=A&hl=en\"> mufon case (10386) map </A>","Case Number":"10386"}