{"Tags":"City","Summary":"\"Ribbon\" coming off of disc","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10389.html.txt","/var/www/straped/mufon/more/10389_submitter_file1__IMGP6435.jpg","/var/www/straped/mufon/more/10389_submitter_file2__IMGP6436.jpg","/var/www/straped/mufon/more/10389_submitter_file3__IMGP6441.jpg","/var/www/straped/mufon/more/10389_submitter_file4__IMGP6431.JPG","/var/www/straped/mufon/more/10389_submitter_file5__IMGP6432.JPG","/var/www/straped/mufon/mufon_json/10389.json","/var/www/straped/mufon/org/10389.html"],"Object Shape":"Disc, Other","Object Flight Path":"Undisclosed","Region":"Ohio","Country":"United States","divs":["Sighting DetailsFor the past few years I have been seeing things in the sky over the city of Franklin. A few weeks ago I watched a multi-colored disc hover and then float across the sky at the treeline. The object made no noise. Tonight while outside I witnessed it again, however, this time I noticed that it looked different than before and was a little higher in the sky. It would move, hover, move, hover, and then the lights would get really bright. One time a beam of light came out of it as a jet was flying towards it. The jet then changed direction and headed SW instead of SSW the way it had been flying. There was also a jet to the east but it stayed on the same course. The lights that were coming off this thing were unbelievable. They were so bright when the thing was moving. I was so impressed with it that I called my dad to come outside and take a look. I think he was more excited than I was. I flipped out when I saw the photos I had taken. I have had cable for only eight days and noticed the photos looked similar to what I had seen on ufo hunters on the History channel. To make sure my camera was not acting up I took a photo of the moon and it came out normal. Please use my email address if you wish additional information. Thanks, P P.S. I have a professional grade digital camera and have worked for the local media outlets in the past."],"trends":["There have been 4 other sightings in Franklin","There were no other sightings in Franklin on or around April 17th 2008","This sighting has been favorited 1 time.",""],"Source":"MUFON","Date of the Event":"04/17/2008 10:10 UTC","Latitude":"39.558947","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.558947,+-84.304107(10389)&iwloc=A&hl=en\"> mufon case (10389) map </A>","Disposition":"Insufficient Data","Object Features":"Undisclosed","Log Number":"US-04172008-0014","Longitude":"-84.304107","Case Number":"10389","Date Submitted":"04/17/2008 10:10 UTC","City":"Franklin"}