{"Date Submitted":"04/16/2008 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.491177,+-86.123913(10380)&iwloc=A&hl=en\"> mufon case (10380) map </A>","Object Flight Path":"Undisclosed","Tags":"City","Summary":"Looked like a fireball and there was a loud explosion after","Country":"United States","Object Features":"Undisclosed","divs":["Sighting DetailsI was sitting watching tv and heard like someone jump on my roof but it sounded like they landed with some impact. Then I ran outside to see if anyone was on my roof and noone was there. I heard there was alot of Police out on our county rode 300N North of Tipton. I had a person that told me the police were looking for wreckage from a plane that might have exploded but they didnt end up finding anything. The news is trying to cover this but it still says unexplained lights and explosion. Note that reports were saying there were no planes in that area either. Something about me is that i try to debunk the incident before i start saying its a ufo. I might add that the explosion was REALLY loud!!! Someone told me they saw seven white then chaging to orange lights in the sky above tipton and howard county. They were on there way back from howard county last night and saw some lights in the sky. I have a feeling that this will be wrote off as an astronomical evnt, but it needes to be investigated more so we really no what happened."],"Log Number":"US-04172008-0005","City":"Kokomo","Latitude":"40.491177","Case Number":"10380","Object Shape":"Fireball","Weather Factors":"Unknown","Disposition":"Insufficient Data","Date of the Event":"04/16/2008 10:30 UTC","trends":["There have been 61 other sightings in Kokomo","There were 6 other sightings in Kokomo on or around April 16th 2008"],"Region":"Indiana","files":["/var/www/straped/mufon/html2text/10380.html.txt","/var/www/straped/mufon/mufon_json/10380.json","/var/www/straped/mufon/org/10380.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-86.123913"}