{"Log Number":"US-04182008-0007","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"10397","Date Submitted":"04/17/2008 11:00 UTC","Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","Summary":"two star like changing colors from red to green, moving in circular motion","Weather Factors":"None","Longitude":"-83.759577","files":["/var/www/straped/mufon/html2text/10397.html.txt","/var/www/straped/mufon/mufon_json/10397.json","/var/www/straped/mufon/org/10397.html"],"Region":"Georgia","Latitude":"34.6017","divs":["Sighting DetailsThis is the second time I have witnessed this, and the first for my husband. Last night, I had gone outside to smoke a cigarette. I looked up at the sky, as I usually do. It was a really bright night, with a bright moon. I instantly noticed the unusual star like object changing colors. This time I was kind of excited and nervous. (The first time, about a month ago, when I saw the object, it made me very nervous, it was so unusual. I just stood there amazed at the object. The first time I witnessed this, I saw only one, and watched it for about 15 minutes, and when my husband came out, it dissappeared.) This time, I went in a got my husband quickly. When he came out, he walked over to the open area by my house and spotted a second object farther to the right of the first object, changing colors and moving like the first object. These objects were lower in the sky than the airplanes that passed by and much brighter. They were flashing from red to green. They would move slowly toward us and then further away, continuously moving in a specific circular pattern. We watched these for about an hour, until midnight, when we decided to go in and go to bed. I kept telling my husband, I can't believe we are the only ones seeing this. It was so unusual. The only millitary base near here is much further to the south than where these \"lights\" were spotted."],"Tags":"City","Object Features":"Unknown","trends":["There have been 5 other sightings in Cleveland","There were no other sightings in Cleveland on or around April 17th 2008"],"City":"Cleveland","Date of the Event":"04/17/2008 11:00 UTC","Disposition":"IFO","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.6017,+-83.759577(10397)&iwloc=A&hl=en\"> mufon case (10397) map </A>","Object Shape":"Star-like"}