{"files":["/var/www/straped/mufon/html2text/10390.html.txt","/var/www/straped/mufon/mufon_json/10390.json","/var/www/straped/mufon/org/10390.html"],"Summary":"Cresent shaped craft..appeared coming out of the north and skipped across teh sky heading south","Object Shape":"Boomerang","Weather Factors":"Unknown","Region":"Massachusetts","Longitude":"-72.586911","Log Number":"US-04172008-0015","Date of the Event":"08/31/2007 12:00 UTC","Case Number":"10390","Viewing Distance":"Unknown","Date Submitted":"08/31/2007 12:00 UTC","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around August 31st 2007"],"Object Flight Path":"Undisclosed","Latitude":"42.108373","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","divs":["Sighting DetailsMe and my friend for safety sake il say his name is Don, were smoking a couple of butt's outside my house when our eyes were attracted toward the y by a sudden meteor shower. As we watched on we notice a creasent shaped object with a light on its tail (One single bright orange light, no flashers or headlights) it appeared out of the northern sky and skipped like a rock across a pond at trmendous velocity, tehn it dissappeared as quickly as it arrived. No sound and no jet contrails as far as i could see, i mean it was dark but i have see alot of things in the sky, every meteor shower i am out for it, ive seen meteors break up in the atmosphere ive even seen a russian satellite break up in the atmosphere, which us on the eastern seaboard were lucky enough to see several years ago. I also live near westover airforce base in mass, so i am used to seeing a wide arrange of military aircraft in the sky..i have ven seen the stealth fighter f117 and the b2 stealth bomber over heard when operations in iraq started. But what we saw that night was nothing like what we had seen before, the rate at witch that object was moving was staggering i say the whole event lasted only about 15 seconds and id say this thing went and i am making an educated guess, id say it coverd about 1.5-2 miles in that time frame. I am not going to make the jump of saying this came from outer space, we have some pretty groovey stuff of our own flying im sure, but whatever it was,it was not normal,and was truely wierd?"],"Country":"United States","City":"Springfield","Disposition":"Hoax","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.108373,+-72.586911(10390)&iwloc=A&hl=en\"> mufon case (10390) map </A>"}