{"Source":"MUFON","Longitude":"-77.10677","Tags":"City","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.87997,+-77.10677(10399)&iwloc=A&hl=en\"> mufon case (10399) map </A>","Date Submitted":"04/17/2008 04:30 UTC","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Arlington","There were no other sightings in Arlington on or around April 17th 2008"],"Region":"District of Columbia","Country":"United States","Object Shape":"Egg","Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Log Number":"US-04182008-0009","Case Number":"10399","files":["/var/www/straped/mufon/html2text/10399.html.txt","/var/www/straped/mufon/mufon_json/10399.json","/var/www/straped/mufon/org/10399.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/17/2008 04:30 UTC","Summary":"Very Bright white oval shaped object over DC/ Northern VA 2 days in a row","City":"Arlington","Latitude":"38.87997","divs":["Sighting DetailsDriving to work through a section of North Arlington VA I noticed an extremly bright light in the crystal clear sky. The object was odd, it had an egg shape with no visable wings, blades, markings, windows, ect. If it had a color at all I'd say it was white, but it was more of a \"glowing\" white. It was 4:23 pm Wednesday only hours after the Popes speach in DC so at first I thought it could be some kind of secret Vadican aircraft. After slowing the car and rolling down the window I poked my head out to watch the object; it had been on a direct straight path moving south from DC at a slower pace, 100-200mph. It then began to move upwards when it changed speed and climbed vertically at a rediculous pace. It was gone within 1.5 secs. I go to work at the exact same time every day and pass through that section of Arlington at the same time mon- fri, and I viewed the very same object yesterday at the same time, same movement, ect...I'm hoping to make it three in a row today, this time I'll have my camera!"]}