{"Disposition":"Insufficient Data","Longitude":"-83.915209","Sighting Duration":"Undisclosed","Date Submitted":"04/17/2008 11:58 UTC","Object Features":"Unknown","Weather Factors":"None","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"10391","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.967418","Object Shape":"Flash, Other","Summary":"two flashing lights moving together eratically in the night sky.","files":["/var/www/straped/mufon/html2text/10391.html.txt","/var/www/straped/mufon/mufon_json/10391.json","/var/www/straped/mufon/org/10391.html"],"divs":["Sighting DetailsI was taking the trash out to the curb in front of my house at 11:58 pm and as I turned to walk back in I noticed that the sky was very clear so I looked around a bit and found some constalations and a planet, I assume it was venus due to it's greenish-blue hue. I then noticed something loving high above moving NE to SW and it apeared as two lights flasing eratically. Both lights moved together and one seemed to either be located above the other or one was in front of the other. The lights had no set colors and seemed to be a blend of colors changing when they flashed. There didn't seem to be any set pattern or timing to the flashes either. It was a bit dark and I couldn't make out the body of a craft due to the glare fromt he moon and a street lamp shining behind me. The object moved in a straight line at first and I thought it a plane, then it slowed to almost a halt and it then made close to a 90 degree turn and headed south. I watched as it sped up and seemed to raise in altitude as it sped of in the distance. There is alot of helecopter trafic near my house during the day but we always hear them. I heard no noise from this object and it seemed to be quite higher than the choppers usually fly around here. During the sighting I had overwhelming feelings of intrest and facination. Once it left my sight I returned inside and felt a bit uneasy and out of place."],"Date of the Event":"04/17/2008 11:58 UTC","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around April 17th 2008"],"Log Number":"US-04182008-0001","Region":"Tennessee","City":"Knoxville","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.967418,+-83.915209(10391)&iwloc=A&hl=en\"> mufon case (10391) map </A>","Tags":"City","Source":"MUFON"}