{"Date Submitted":"04/12/2008 10:21 UTC","Longitude":"-70.836876","Weather Factors":"Unknown","Region":"Massachusetts","City":"Ipswich","Source":"MUFON","Object Flight Path":"Undisclosed","divs":["Sighting Details On April 12, 2008 at approximately 1021pm I observed the following in Ipswich, Massachusetts (US). I went to let my dog outside prior to getting ready to go to work. I observed the sky to be lightly cloudy and could observe the quarter moon shining through the thin cloud cover. I then observed a yellowish, off white colored object in the distance. Then almost immediately observed four lights. These lights were traveling in a northeast direction. As these lights came closer and virtually passed my position overhead, I could distinguish a dark outline of a left and a right wing. I was unable to determine the shape of the center of this aircraft (if any). These circular lights appeared to take up most of the width of the wing. As this craft passed me overhead, approximately two seconds later the object could not be seen anymore. This entire encounter lasted approximately 5-6 seconds. There was no wind and absolutely no sound to be heard. At first I believed this craft to be a military test craft of some type.I have been around all types of aircraft helicopters, fighter jets and bombers and this craft was not one of those. Possibly being a test craft I believed this craft to be roughly the same size as a commercial airbus plane, in wing span. This craft appeared to be approximately 5 to 6 thousand feet in the air and traveling at a high rate of speed. Incidently, approximately five minutes later I heard a rather loud jet sound coming from the south, this sound consistant with that of a fighter jet. Although I could not see any other lights, this sound lasted for approximately 1 minute."],"Log Number":"US-04182008-0002","Object Shape":"Boomerang","Latitude":"42.680493","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Flying wing, two large lights on the left and right wing (4 total)","trends":["There have been 5 other sightings in Ipswich","There were no other sightings in Ipswich on or around April 12th 2008"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10392.html.txt","/var/www/straped/mufon/mufon_json/10392.json","/var/www/straped/mufon/org/10392.html"],"Tags":"City","Case Number":"10392","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.680493,+-70.836876(10392)&iwloc=A&hl=en\"> mufon case (10392) map </A>","Date of the Event":"04/12/2008 10:21 UTC"}