{"Log Number":"US-04182008-0013","files":["/var/www/straped/mufon/html2text/10403.html.txt","/var/www/straped/mufon/mufon_json/10403.json","/var/www/straped/mufon/org/10403.html"],"City":"Kokomo","trends":["There have been 61 other sightings in Kokomo","There were 6 other sightings in Kokomo on or around April 16th 2008"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.493747,+-86.123903(10403)&iwloc=A&hl=en\"> mufon case (10403) map </A>","Sighting Duration":"00:02:00","Source":"MUFON","Date Submitted":"04/16/2008 10:30 UTC","Longitude":"-86.123903","Viewing Distance":"Unknown","Region":"Indiana","divs":["Sighting DetailsAt approximately 10:30 p.m. on the night of April 16 I was in the livingroom watching tv, and my husband had gone to bed. There was a huge boom that rattled the front window. My husband asked what the noise was, and I went to the front door to see. Off to the west there appeared a large object with lights all the way across it. It reminded me of a hair barrette with lights. It seemed to be hovering, yet the lights appeared to turn. My husband came out to stand behind me just in time to see the lights reappear from right to left until 5 lights were showing, and then it did it for a second time before it disappeared. The lights we saw with the naked eye were yellowish orange in color. If you look on www.WWKI.com, click on the article about the Boom and the bright lights, you will see pictures that someone submitted. The fourth picture down is exactly what I saw when I first looked out. This was no meteor or F-16, they don't hover. We could not take our eyes off of it, and my husband, who is a Viet Nam veteran and a retired deputy sheriff said he had never seen anything like it. We are both certain that what we saw was unidentifiable. The next morning, when I went out to get the newspaper at a little after 5 a.m., I looked off into the west in the same vicinity, and there, in front of the moon was a huge v-shaped dark cloud that reminded me of a flower vase with alot of much smaller jet trails near it."],"Tags":"City","Object Flight Path":"Other","Object Shape":"Other","Object Features":"Unknown","Country":"United States","Weather Factors":"None","Date of the Event":"04/16/2008 10:30 UTC","Latitude":"40.493747","Summary":"strange object in the sky with approx.5 rotating lights HOVERING","Case Number":"10403"}