{"Log Number":"US-04182008-0017","files":["/var/www/straped/mufon/html2text/10407.html.txt","/var/www/straped/mufon/mufon_json/10407.json","/var/www/straped/mufon/org/10407.html"],"Date of the Event":"06/22/1999 12:00 UTC","Sighting Duration":"00:30:00","Tags":"City","Object Features":"Other","Country":"United States","Viewing Distance":"Over One Mile","Date Submitted":"06/22/1999 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.744234,+-104.974973(10407)&iwloc=A&hl=en\"> mufon case (10407) map </A>","Case Number":"10407","Summary":"2 stationary silver balls aligned perfect to south in sky and boomerang(White) Darting in and out of clouds.","Object Shape":"Boomerang, Circle","Disposition":"Unknown","divs":["Sighting DetailsIt was a Sunday mid-morning in Denver and I was playing in a baseball game a the Metropolitan State College Baseball Feild. I was playing center field. The feild is located just a few streets west from Downtown Denver. I was looking toward home plate(which faces west) when I looked up to see the 2 silver balls just sitting stationary near the low white bits of clouds that where scattered that day. It was a very blue sky with pretty white puffy clouds hanging here and there. I kept looking at them in between pitches. They were perfectly alined and just stayed that way. When I looked at them at one point, there was another object that caught my eye just to the right of where they were. It was darting in and out of a small puffy cloud and was Boomerang shaped. It was as white as the cloud. The quickness was impressive to watch. I tried to get the other 2 outfielders to look at this , but the ball kept getting hit to all of us(Bad day for the pitcher). Being it turned out to be a long inning I had more time to watch. This continued for about 15 mins and then the white boomerang just took off at an incredible rate of speed towards the Northwest. Directly towards the City of Boulder. It just disappeard in the distance. The 2 silver balls started to move west (toward the mountains very slow like 2 balloons. They also got too far to see. My family has some history with abduction stories and sightings that go pretty far back. I now understand the stories I was hearing after all these years."],"Source":"MUFON","Latitude":"39.744234","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-104.974973","City":"Denver","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around June 22nd 1999"],"Region":"Colorado"}