{"Summary":"looks like a star but it changes color and is like a disc shape it stays in the same place","Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"01:00:00","Case Number":"10402","Country":"United States","files":["/var/www/straped/mufon/html2text/10402.html.txt","/var/www/straped/mufon/mufon_json/10402.json","/var/www/straped/mufon/org/10402.html"],"Date Submitted":"04/16/2008 10:30 UTC","Weather Factors":"Unknown","Longitude":"-85.596824","divs":["Sighting DetailsOn April 16 at 10:30pm we were home watching tv and there was a loud boom like an explosion we went out to check on things when in the western sky there was 2lights that looked like headlights then they disappeared and reappeared the third time they seemed to spread from side to side until there was about 6 or 7 lights they disappeared and then reappeared all in the same spot. They were a very bright white and seemed very low and close. After they disappeared we began looking all around the sky, when we noticed a bright light that looked like a star off in the distance as it caught my attention I noticed it was flashing different colors, my husband thought i was crazy. He went and got the binocculars and discovered it was changing color. It looked like it was disc shape with the lights on the bottom that were blinking. It stayed in the same place the whole hour we were watching it. The next evening April 17 at 10:30pm we decided to go out and see if it was there. Sure enough it was in the same spot again. On the morning of April 18 at 5:35am we felt the house shake and we ran outside to see if the light was still there, it was not there. There was an erie feeling in the air and a weird sound that I can't describe. I have never seen anything like it before. I was pretty shaken by all of this."],"Date of the Event":"04/16/2008 10:30 UTC","Tags":"City","trends":[],"Latitude":"40.557236","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.557236,+-85.596824(10402)&iwloc=A&hl=en\"> mufon case (10402) map </A>","Object Shape":"Disc","Log Number":"US-04182008-0012","Region":"Indiana","Object Flight Path":"Undisclosed","City":"Undisclosed"}