{"Sighting Duration":"00:00:48","Summary":"booms, and violent vibration and shacking of the land","Log Number":"US-04182008-0011","Country":"United States","files":["/var/www/straped/mufon/html2text/10401.html.txt","/var/www/straped/mufon/org/10401.html"],"Date of the Event":"04/18/2008 05:35 UTC","Case Number":"10401","Disposition":"Insufficient Data","trends":["There has been one other sighting in Danville","There were no other sightings in Danville on or around April 18th 2008","This sighting has never been favorited.",""],"divs":["Sighting Detailsthis happened at 5:30am this morning and woke me from my sleep the entire earth was shaking... i awoke to find things slaming onto the floor from night stand and dresser a day before i heard of booms, lights, and shaking taking place some miles from me and \"supposedly\" the Air Guard was training <_< >_> ...at 11:00pm... <_< >_> ...over CIVILIAN homes... anyway my first thought was not safty or earthquake but those mysterious booms and shaking... i jumped to the end of my bed as fast as my feet could carry me and low and behold what do i see go RIGHT over my home but a large white pop in the dark sky it was so bright that for a split second i had to shut my eyes! i heard no noise but after this last flash the ground stopped shaking a few seconds after... but the report from the events in the incident from nights earlier a few counties over said that fighter planes were training at 11:00pm fire tracer rounds and going sub-sonic... NOW, that said my brother in law was in the 82nd Airborne and i know enough from his 16 years of military service to know that training missions dont take place and sub-sonic speeds... jeez... why dont they just say its swamp gas so that atleast we will know they are lying and just dont care... atleast that would make themselfs look smarter... agreed? also... had these been fighters going sub-sonic over my home i would have heard the sonic boom from their planes spliting the air... also last time i checked the military had special grounds for training missions... not over civilian homes! i stayed up for about 1 hour after this... the news had breaking coverage of whatever happened and say it was a \"possible earth quake\"... this in itself raises some interesting questions... why would they not simply say \"earth quake\"... usually when the ground shakes you dont put the word \"possible\" in from of the quake part... atleast thats just what i found curious now this may very well have been an earth quake in the first place... but whatever rocked the country side only the night before not far away was at it again during this event at 5:30am... best guess is that whatever these UFO's are doing... they miss-timed their activities and might have thought this earth quake was going to take place the night everyone reported it the first time a few counties over... atleast they got their timing right this morning... but i still saw them! PLEASE! feel free to email me or contact me in anyway... i really want to talk to people that saw these things the other night!"],"Tags":"City","Object Flight Path":"Stationary","Source":"MUFON","City":"Danville","Weather Factors":"Unknown","Longitude":"-86.526388","Object Shape":"Flash, Other, Unknown","Date Submitted":"04/18/2008 05:35 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.760601,+-86.526388(10401)&iwloc=A&hl=en\"> mufon case (10401) map </A>","Region":"Indiana","Latitude":"39.760601"}