{"Summary":"5 objects circling in the N.W. sky 35-40,000 ft. altitude,","Source":"MUFON","Object Shape":"Other","Sighting Duration":"00:15:00","Viewing Distance":"Unknown","Case Number":"10411","Latitude":"39.559091","Country":"United States","City":"Undisclosed","Date Submitted":"04/18/2008 06:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.559091,+-105.780347(10411)&iwloc=A&hl=en\"> mufon case (10411) map </A>","trends":[],"Region":"Colorado","files":["/var/www/straped/mufon/html2text/10411.html.txt","/var/www/straped/mufon/mufon_json/10411.json","/var/www/straped/mufon/org/10411.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","divs":["Sighting DetailsAt 6:45pm I was looking at the north sky, cloud formations, with my new high powered binoculars. I saw what looked like five birds making tight circles. I first thought buzzards but I estimated their altitude at 35-40,000 altitude based on their size in comparison to commercial jet planes flying over Denver. When I zoomed in on them they didn't get much bigger, which tells me they were VERY high in altitude. I watched them for 15 minutes and wondered if they were remote controlled model airplanes because the wings never flapped and the circles they were flying were so tight and close together. Then these five objects formed a straight line for about thirty seconds and disappeared in the blink of an eye. They appeared to be black in color. When they formed the straight line they were stationary, something I do not believe a bird can do. I scanned the sky for another thirty minutes but never saw them again. They were not visible to the naked eye. When I was looking at the cloud formations I was surprised to see \" birds\" flying. What in the heck did I see? I was sitting at my desk working on the computer when I saw some interesting cloud formations and decided to look at them through the binoculars."],"Object Features":"Wings","Tags":"City","Longitude":"-105.780347","Object Flight Path":"Hovering then path,Other","Date of the Event":"04/18/2008 06:45 UTC","Log Number":"US-04182008-0021"}