{"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.24834,+-117.189208(10414)&iwloc=A&hl=en\"> mufon case (10414) map </A>","Latitude":"34.24834","City":"Lake Arrowhead","Weather Factors":"None, Does Not Apply","divs":["Sighting DetailsI was driving east on the rim of the world highway (18) between Lake Gregory and Lake Arrowhead and I spotted a very large glowing whit object at about my one o' clock position - which I suppose would be east southeast. I would project that the object was over 7,000 feet in altitude and when compared to surrounding jets, I would say that it was about four or five times larger. The object didn't appear to reflect sunlight, but rather it seemed to glow and it was as bright as the sun. I have seen sunlight reflect off many planes, but this object had no signs of a tail, wings, cockpit or anything else indicative of a jet. I became alarmed as well as two of my passengers in my car so I pulled off the highway and ran to get a better view. We could no longer see or track the object - this was ten to twenty seconds later. I would say that the object was in a more or less a \"tear\" shape. With the small side going forward (to the west). This thing was very, very bright and left no tail and moved relatively slowly and steadily. It didn't seem like a plane at all."],"trends":["There has been one other sighting in Lake Arrowhead","There were no other sightings in Lake Arrowhead on or around April 18th 2008"],"Log Number":"US-04192008-0003","Source":"MUFON","Region":"California","Tags":"City","Summary":"Large, Bright White UFO Spotted Over San Bernardino","Longitude":"-117.189208","Object Features":"None","Date Submitted":"04/18/2008 01:34 UTC","Date of the Event":"04/18/2008 01:34 UTC","Sighting Duration":"00:00:05","Disposition":"IFO","Case Number":"10414","Country":"United States","Object Shape":"Teardrop","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/10414.html.txt","/var/www/straped/mufon/mufon_json/10414.json","/var/www/straped/mufon/org/10414.html"]}