{"map":"<A HREF = \"http://maps.google.com/maps?q=40.763279,+-111.887217(10410)&iwloc=A&hl=en\"> mufon case (10410) map </A>","Latitude":"40.763279","Date of the Event":"04/12/2008 11:01 UTC","Region":"Utah","Disposition":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 73 other sightings in Salt Lake City","There was one other sighting in Salt Lake City on or around April 12th 2008"],"Weather Factors":"Unknown","Tags":"City","Case Number":"10410","Summary":"Looking up at a specific spot in sky when out sprang a luminous craft. It suddenly flew off silently and with incredible speed.","Viewing Distance":"Unknown","Longitude":"-111.887217","divs":["Sighting DetailsBy the U of U, looking up, a large triangular craft appeared, seemingly from out of the void of space. It had one blue light on each point of the triangle and a dim blue light that outlined the craft connecting all three points. It appeared, then slew off silently and swiftly across the sky in a Southerly direction. The next night from same local another craft appeared, this time it was around dusk. The craft entered my line of site as I was again looking upward. This one was also a triangle but not symmetrical like the other. It was an elongated triangle, very long, very high up and must have been enormous. Objects like passenger airliners at those altitudes appear very tiny. This appeared several times longer and wider than that. It was comprised of twenty or so orange points of light and moved swiftly and silently as if it were on a track. It was moving due North. I have had several sightings in my life, many were quite profound, but never had two nights in a row like this."],"Date Submitted":"04/12/2008 11:01 UTC","Country":"United States","Sighting Duration":"Undisclosed","City":"Salt Lake City","Object Shape":"Triangle","Log Number":"US-04182008-0020","Object Features":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10410.html.txt","/var/www/straped/mufon/mufon_json/10410.json","/var/www/straped/mufon/org/10410.html"]}