{"Longitude":"-88.359768","files":["/var/www/straped/mufon/html2text/10415.html.txt","/var/www/straped/mufon/mufon_json/10415.json","/var/www/straped/mufon/org/10415.html"],"Log Number":"US-04192008-0004","Object Features":"Undisclosed","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.378937,+-88.359768(10415)&iwloc=A&hl=en\"> mufon case (10415) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"04/18/2008 04:30 UTC","divs":["Sighting Detailsme and 2 of my friends was walking from fairfeild to albion illinois on friday the 18th,the time was 4:30 we would walk for 20 minutes and take a 5 minute breather, while taking a break, i look up in the sky and notice \"a bright star\" or so i thougt, moving in a very unique way, in no way any airplane or other man made flying machine could every move through the skies. this \"ship\" was moving slow in one direction, then speeding up, and then turning back the same way it came. after examining this thing for a while, i made up my mind that it was somthing out of explanation, and after panning the skies, it became clear to me that there was more than one, i counted at one time in the sky more than 5 of these blinking lights. but i kept my eye on the biggest brightest one, at one point the one i kept track of stopped, i watched for about 15 seconds and then a red dot appeard miles away from the ship and in an instant both objects dissapeard, and in seconds the ship was back, and at one point the big ship was stopped and a little ship beamed a light to the big one, and when that happend the sky lit up. i felt scared, but i was amazed at what i was seeing at the same time. we kept walking, and i might add i tried to get my friends to look at these things in the sky but when they would look they just kept saying i dont see anything and wouldnt take the time to look very long. so we were walking and an elderly man pulled over to the side of the road, i asked if i could use his phone, he said yes, and when i took the phone i said \"not to sound weird or anything but do you believe in aliens?\" and told him what i saw and made him look. he too didnt see anything becouse he didnt take the damn time to actually look at what i was pointing at. and when i said sumthin about aliens, he told me there was had been an earthquake that shook the midwest, about 10 minutes ago. the whole time me and my friends were walking we didnt feel anything shake at all, and this earthquake was a 5.4 the biggest recorded in the midwest. so while the whole midwest region was feeling the ground shake, i was experiencing the most shocking time of my life. IF ANYONE SEEN ANYTHING LIKE WHAT I SAW THAT NIGHT OF THE EARTHQUAKE PLEASE SAY SO, BECOUSE I KNOW IT WASNT JUST ME WHO SEEN THESE THINGS, THEY WERE OUT FROM 4:30 TILL THE SUN CAME UP, THERE HAD TO BEEN MORE PPL TO WITNESS THIS"],"Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Fairfield","This sighting has never been favorited."],"Source":"MUFON","Disposition":"Unknown","Region":"Illinois","Country":"United States","Tags":"City","Case Number":"10415","Viewing Distance":"Unknown","Date of the Event":"04/18/2008 04:30 UTC","City":"Fairfield","Summary":"it looked like a really bright star, with blinking lights","Latitude":"38.378937","Weather Factors":"Unknown"}