{"City":"Baltimore","Longitude":"-76.603099","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/10416.html.txt","/var/www/straped/mufon/more/10416_submitter_file1__BALTIMORe_830pm041808_highl.jpg","/var/www/straped/mufon/more/10416_submitter_file2__BALTIMORe_830pm041808_Origi.jpg","/var/www/straped/mufon/more/10416_submitter_file3__BALTIMORe_845pm041808_Origi.jpg","/var/www/straped/mufon/mufon_json/10416.json","/var/www/straped/mufon/org/10416.html"],"Region":"Maryland","Country":"United States","Object Shape":"Other, Unknown","Date of the Event":"04/18/2008 09:00 UTC","Case Number":"10416","Summary":"Objects caught on webcam in Baltimore last night","Log Number":"US-04192008-0004","Latitude":"39.297325","Date Submitted":"04/18/2008 09:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been 65 other sightings in Baltimore","There were 2 other sightings in Baltimore on or around April 18th 2008","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting DetailsI'm a web cam watcher and two objects came into view of the Baltimore MD Web cams last night. One of the Long Line looking objects is very large or long maybe 500 to 1000 ft long hard to judge distance but take a look and you will see its very large. The Objects start off coming into view from the Northeast Web cam then over the next 45 minutes move west and come into view on the Northwest web cam. The first view is on the Northwest Webcam at 8:30PM then the next shot is at 8:45pm and this shows that the object is in the camera view for over 15 minutes then move into view in the Northwest Web Cam after another 15 minutes. These are Real-time Digital Images in high quality (No time Lapse). I did some research to see if they maybe time lapse but they are not, the images are real-time photos. I've highlighted a couple of the images to make it easy to see. This is not the first time I have seen these craft over Baltimore, I have pictures of similar craft from Nov of 2007 but did not report those. There are web cams all over the US and World for that matter and its very easy to spot UFO Craft, you just have to look around but its hard to watch them all at once."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.297325,+-76.603099(10416)&iwloc=A&hl=en\"> mufon case (10416) map </A>","Object Features":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}