{"Weather Factors":"None","Region":"Oregon","divs":["Sighting DetailsAnn was asleep in her bedroom and was awakened by a flash of bright light through her bedroom window over Grants Pass Peak A few seconds later there was another bright flash of light in same place as first flash. She then saw through her bedroom window an egg shaped white light the size of a car fly towards the mountain about a mile away followed by another egg shaped white light the size of a car a few seconds later. the second egg shaped light followed the first light a bit behind and to the side of the first egg shaped light. She watched the lights go half way across her window and then she got out of bed and went down the hall through the living room and dining room and out into the backyard to continue observing them. She was surprised at how huge and bright they were. From a mile away they were the size of full sized cars. They were traveling slowly and she watched them until they flew behind Grants Pass peak. There appeared to be a bright light on the mountain where they went out of sight behind the mountain. she estimated the total distance she watched them was over two miles."],"Source":"MUFON","Summary":"Two huge egg shaped lights flew over Grants Pass Peak","Longitude":"-123.327092","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Latitude":"42.445027","Object Features":"None","Disposition":"Unknown","Tags":"City","Date of the Event":"08/04/1999 04:00 UTC","Log Number":"US-04192008-0015","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.445027,+-123.327092(10427)&iwloc=A&hl=en\"> mufon case (10427) map </A>","Case Number":"10427","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around August 4th 1999"],"Sighting Duration":"Undisclosed","Object Shape":"Egg","City":"Grants Pass","files":["/var/www/straped/mufon/html2text/10427.html.txt","/var/www/straped/mufon/mufon_json/10427.json","/var/www/straped/mufon/org/10427.html"],"Date Submitted":"08/04/1999 04:00 UTC"}