{"divs":["sighting detailsmy friend and i were driving to the wilkes-barre\\scranton airport in avoca, pa. at approximately 11:00 am. my friend was driving,i was in the passenger seat, and my 4 yr old son was in the car seat in the back seat of the car. when we were on 81 north outside of wilkes-barre, my friend told me to look in the sky outside his window and tell him what i saw- i had observed him looking at something outside his window and was wondering what he was focused on. i looked out the front windshield by ducking down a little bit and saw a black object in the sky-it looked like a pyramid that was rounded where the points are and the sides looked slightly concave. i was mesmerized by the sight and my friend was relieved that i saw it, as he thought he was going crazy. we kept on trying to explain it as something like a plane,balloon, etc since we were close to the airport, but those explanations didn't fit. it seemed to keep pace with us as we drove 55mph down the highway and i kept wondering if other people saw it, as it was a beautiful morning and the object was very clear and visible. we kept watching and driving and then it shot away extremely fast and was out of site in seconds. it appeared to follow the susquehanna river north towards the tunkhannock, pa area. we were kind of freaked out that we actually saw a ufo. i kept telling people about it, but my friend got mad and started denying it in front of others-he said he didn't want others to think we were crazy. we still talk about it with each other and it still freaks us out."],"Viewing Distance":"Unknown","Object Shape":"Triangle","Object Features":"Undisclosed","Log Number":"US-04192008-0013","Source":"MUFON","Date of the Event":"07/20/2006 12:00 UTC","Date Submitted":"07/20/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/10425.html.txt","/var/www/straped/mufon/mufon_json/10425.json","/var/www/straped/mufon/org/10425.html"],"Region":"Pennsylvania","Weather Factors":"Unknown","Longitude":"-75.876568","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around July 20th 2006"],"Tags":"City","Country":"United States","Case Number":"10425","Disposition":"Unknown","Latitude":"41.247005","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"While driving to the airport we saw a black pyramid shaped object in the sky while driving on 81 North on a beautiful clear day.","City":"Wilkes-Barre","map":"<A HREF = \"http://maps.google.com/maps?q=41.247005,+-75.876568(10425)&iwloc=A&hl=en\"> mufon case (10425) map </A>"}