{"Object Flight Path":"Path with directional change","City":"Mexico Beach","Date of the Event":"08/01/2006 04:30 UTC","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/10421.html.txt","/var/www/straped/mufon/mufon_json/10421.json","/var/www/straped/mufon/org/10421.html"],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in Mexico Beach","There were no other sightings in Mexico Beach on or around August 1st 2006"],"Object Shape":"Circle","divs":["Sighting DetailsTwo and a half years ago we were driving back to Panama City from Mexico beach at 4:30 in the afternoon. The direction was west and there were no clouds in the sky. We were on route 98 that goes through a forest preserve and past Tyndall AFB. The Gulf of Mexico was on the left and further to the right was the airbase. The road paralleled the runway. It's probably important to note the road was long straight and surrounded by the forest of pine trees. Through the trees to the right near the ground I saw something move. It was silver and big and \"floating\" towards the road in front of us. It was also rising so my first thought was weather balloon. We were a couple miles from main base itself so that seemed liked a possibility. Then the best thing happened, we came to a clearing in the woods. Now I had a good view and a perspective of its size with the pine trees behind it. At this point we're about 1000 feet away and getting closer fast. It has been rising steeply and slowly and never crossed in front of us. It was an orb that was at least 30 feet in diameter. I focused on it and saw it very clearly. It was a silver tone but not too shiny. Around it was a thin faint aura that seemed to help it blend in with the blue sky. There were no sharp edges or features on the surface. Just a perfect ball. The thing that fascinated me most was that the surface was not a solid color of silver. It was modeled with slightly darker silver and it was swirling. Maybe a little bit like molten metal would look. It very briefly stopped at least 300 feet above the trees and then quicker than a blink it shot off. It looked like it instantly reached 1000+ miles an hour. The direction was exactly straight ahead from my view and up at maybe at a 20 degree angle which paralleled the runway further ahead. I'm sure it got smaller as it shot off in the distance. But wait. Immediately after it was gone I had a second thought. If it got smaller (shrank) instantly it would have looked exactly the same. Maybe it was a portal like a door that closed around it as it slipped into another dimension. I never resolved in my mind which method it used. After seeing this I had a deep feeling of gladness. Finally, I got to see a real UFO."],"Latitude":"29.947983","Log Number":"US-04192008-0009","Sighting Duration":"00:00:10","Source":"MUFON","Country":"United States","Date Submitted":"08/01/2006 04:30 UTC","Longitude":"-85.417977","Region":"Florida","Summary":"Saw silver orb near Tyndall AFB","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.947983,+-85.417977(10421)&iwloc=A&hl=en\"> mufon case (10421) map </A>","Case Number":"10421","Weather Factors":"Unknown"}