{"Case Number":"10434","Weather Factors":"Unknown","Summary":"What appeared to ne Jet planes made an astrisk/star","files":["/var/www/straped/mufon/html2text/10434.html.txt","/var/www/straped/mufon/more/10434_submitter_file1__astrisk-star-image-4-20-08.JPG","/var/www/straped/mufon/mufon_json/10434.json","/var/www/straped/mufon/org/10434.html"],"Country":"United States","Date Submitted":"04/17/2008 04:40 UTC","Viewing Distance":"Unknown","Region":"North Carolina","Tags":"City","divs":["sighting detailsjet plains\\ufo? created the astrisk\\star image while my wife mary and i was sitting on the car port facing south toward out hometown of king, nc near winston salem, nc. there were six jets or what appeared to be military planes in our line of vision from the south side of out home. i was standing there wondering why so many in a short space in out sky. as i watched two of them that seemed close together mad an x and i noticed another starting his run toward going across the center of the x. thai's when i took off for my digital camera. it was less than 40 seconds until i was ready for the shot at what was now a six pointed star or asterisk. i took three pictures and the best one i reduces in order that it may be viewed better. the thing was that all six of the aircraft were no where in sight when i took the picture. they were gone and no contrails were present except from the six pointed star\\astrisk. there were no contrails leading from or to the contrail image that the picture demonstrates."],"Latitude":"36.280694","map":"<A HREF = \"http://maps.google.com/maps?q=36.280694,+-80.35922(10434)&iwloc=A&hl=en\"> mufon case (10434) map </A>","Source":"MUFON","trends":["There have been no other sightings in King","This sighting has been favorited 1 time."],"Object Shape":"Other","Object Flight Path":"Undisclosed","Sighting Duration":"04:40:40","Longitude":"-80.35922","City":"King","Disposition":"IFO","Date of the Event":"04/17/2008 04:40 UTC","Log Number":"US-04202008-0002","Object Features":"Undisclosed"}