{"Tags":"City","divs":["sighting details i was at mcdonalds restraunt in midland michigan at about 2 to 3 pm on saturday april 19. i got out of my car to stretch, and happened to look to the east towards saginaw. at first i saw the vapor trail, following the trail i saw the object. but usually you can faintly make out the plane that is making the trail. all that i could make out was a bright object at the end. and usually you will be able to faintly hear the jet, yet this object was silent. i carry a pair of hunting binoculars in my car, i got them out so i could get a better look at it. what i saw was an object that was very bright, and oval in shape. the first thing that i noticed that was odd about this object was its vapor trail. i estimate the object to have been about 1-1 1\\2 miles in the air. its vapor trail was wide, about twice the size of the object. the trail was cylindrical in shape and it was spiraled . at first i thought it might be a meteor, but it could not have been, because when it first appeared in the east it was on approximately a 30 degree angle going north, then shifted direction on a more 32 degrees angle. ultimately meteors dont change angles like that. it took only about a minute and a half to travel from east to west."],"Region":"Michigan","Sighting Duration":"00:01:15","Date Submitted":"04/19/2008 02:30 UTC","City":"Midland","files":["/var/www/straped/mufon/html2text/10436.html.txt","/var/www/straped/mufon/mufon_json/10436.json","/var/www/straped/mufon/org/10436.html"],"Latitude":"43.619042","Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.619042,+-84.237402(10436)&iwloc=A&hl=en\"> mufon case (10436) map </A>","Object Shape":"Bullet, Missile, Oval","Object Flight Path":"Undisclosed","Case Number":"10436","Date of the Event":"04/19/2008 02:30 UTC","trends":["There have been 10 other sightings in Midland","There were no other sightings in Midland on or around April 19th 2008"],"Object Features":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Country":"United States","Summary":"fast moving object comming from the southeast heading northwest.","Longitude":"-84.237402","Log Number":"US-04202008-0004"}