{"City":"Denver","map":"<A HREF = \"http://maps.google.com/maps?q=39.746104,+-104.982733(10430)&iwloc=A&hl=en\"> mufon case (10430) map </A>","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around April 18th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn the evening of Friday, April 18, 2008, at approximately 9:30pm, my partner and I had just finished eating dinner with a friend at his apartment and we were sitting outside on our friend's 11th floor apartment balcony, talking and enjoying the city lights. His balcony faces approximately North-West or North-North-West and is located near the intersection of I-25 and Colorado, just south of East Florida Avenue in Denver, Colorado. I was looking at the city lights and kept noticing a flash of light in my peripheral vision. There were several aircraft flying by so I assumed I was simply seeing their FAA lights. Each time I turned my attention to see which plane it might be, there wasn't anything there. I was trying to zero in on where the light was because it kept disappearing. Finally, after about 4 more flashes, I zeroed in on it's location and watched, hoping to see it again. Up until this point I had been sitting on one of the chairs on the balcony. When I finally focused on the light's location, I got up and stepped to the balcony wall and asked my friends to look at what I was seeing. At first they thought I was referring to one of the passing planes but I finally got them to see what I was pointing out. The white light was slowly flashing, not like a strobe light, but as if someone were turning on and off a car headlight. It didn't flash like an aircraft FAA light. It slowly turned on and off over the course of 1-second. And it seemed to flash once every 2-3 seconds. When the flashing light was off there was no indication of any other lights and since it was night, there was no indication of the shape, size or relative distance away from my location. The light didn't seem to move from it's original location from one flash to the next. The light seemed unusually large to be an aircraft light. We watched the light flash about 4-5 times before it simply stopped. I watched the sky for several more minutes to see if it would appear again in it's original location or if it might be seen somewhere else in our available field of vision but nothing happened. We continued to see aircraft fly by overhead but the light never re-appeared."],"Longitude":"-104.982733","files":["/var/www/straped/mufon/html2text/10430.html.txt","/var/www/straped/mufon/more/10430_submitter_file1__FlashingLightIllustration.jpg","/var/www/straped/mufon/mufon_json/10430.json","/var/www/straped/mufon/org/10430.html"],"Source":"MUFON","Country":"United States","Weather Factors":"None","Disposition":"Unknown","Date of the Event":"04/18/2008 09:30 UTC","Case Number":"10430","Latitude":"39.746104","Tags":"City","Object Flight Path":"Stationary","Object Shape":"Flash, Unknown","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"Slowly Flashing Light Over Denver, Colorado","Date Submitted":"04/18/2008 09:30 UTC","Log Number":"US-04192008-0018","Region":"Colorado"}