{"Object Features":"Undisclosed","Log Number":"US-04212008-0006","Object Flight Path":"Straight-line path,Path then hovering","Latitude":"44.986095","Summary":"My ex and I witnessed a U.F.O heading toward downtown minneapolis.","Source":"MUFON","City":"Minneapolis","Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-93.260586","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around March 12th 1997","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","divs":["sighting detailsmy ex-girfriend and i were on our way to see friends, although she insists family. i thought it was a monday night because we used to go to the quest night club salsa night mondays. i later realized that it was indeed a saturday night and she had agreed this to be true. we were crossing the 46th ave bridge in south mpls., a vehicle was being chased by the police. the squad car almost hit my car, i got very upset and yelled a few words at the police. we proceeded to turn left to access the 35w freeway, i'm sure she was trying to calm me down cause if i know me. i know i must have been pretty heated. i remember going down the entrance to 35w and the next thing i remember is being on the freeway somewhere before lake street. something caught my attention and the attention of my ex-girlfriend as well. there was this sphere\\orb above the vehicle approximately 50-60 ft. above my car heading in a northernly direction toward downtown mpls. i noticed it was very bright and looked metallic, i thought the lights from the cars on freeway and city were reflecting off of it. my ex and i both looked at each other with our mouths dropped in disbelief i said something to the fact like,\" what the ----, is that a, i don't ------- believe it\" something to that nature. we watched as it headed slowly toward the city center. we heard no sound the entire time coming from it, it took probably 5-7 seconds at a gradual ascent to reach the downtown area, once it over the buildings by the ids center it hesitated or hovered for only a second and then shot straight up toward space, like from just over the top of buildings into orbit or space ina matter of 1-2 seconds and vanished. we were both speechless,shocked,in awe all i know is i could'nt find anything to say and neither did she. when we got to our destination everyone asked why we were so late, we tried to tell them but they said we were crazy and acted like wew were trying to hide something from them. anyway no one believed us, my ex lives in florida were still good friends we never really talk about then or now. when i ask her about it some times she'll say \"is there anybody by you that can hear you\" or something like that. and i say,\"why i don't care if there is or not i don't have a problem talking about it\", but evidently she does if some one is around me. i know one thing we will always remember the night we seen a u.f.o."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.986095,+-93.260586(10448)&iwloc=A&hl=en\"> mufon case (10448) map </A>","Region":"Minnesota","Tags":"City","files":["/var/www/straped/mufon/html2text/10448.html.txt","/var/www/straped/mufon/more/10448_submitter_file1__MapImage_IDS_Center_2008_05_04.png","/var/www/straped/mufon/more/10448_submitter_file2__MapImage_IDS_Center_2008_05_04.png","/var/www/straped/mufon/more/10448_submitter_file4__Obj_Dwg_2008_05_03.jpg","/var/www/straped/mufon/more/10448_submitter_file5__OverIDS_Dwg_2008_05_03.jpg","/var/www/straped/mufon/mufon_json/10448.json","/var/www/straped/mufon/org/10448.html"],"Object Shape":"Sphere","Viewing Distance":"21-100 Feet","Case Number":"10448","Date of the Event":"03/12/1997 09:00 UTC","Date Submitted":"03/12/1997 09:00 UTC","Country":"United States"}