{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","divs":["Sighting Detailsi had just picked up my grandson from the hardin valley elementary school,and was traveling north on steele rd.when i noticed bright cylinder to my right in cloudless bright blue sky.it appeared to be stationary but i was going 3o mph so as i was slowing down i asked my 8 year old if he saw what i was seeing and he said yes. i stopped to see if my being stationary would allow me to see more detail such as wings,but object appeared to become so bright it hurt my eyes ,at which point it appeared to start moving ,accelerate and as i turned my head to the right it dissappeared. object was low in sky, about 1500 feet and about half a mile to the east. i had a grove of trees which where about 50 feet tall that the object was above and beyond which helped with depth perception.object seemed to be longer than commercial jet but not taller. all commercial jets where highly visibile ,leaving contrails.at this point i drove about 500 feet and turned left heading west and to higher elevevation where i was able to scan the sky unobstructed.as i was looking i noticed a light brown cylinder shape to the northeast,with no wings ,no aviation lights and maybe 10 miles away,close to or over oakridge. i observed a private plane southeast at longer distance,but was able to easily see wings.the sighting was so brief i had no time to get a picture .after having told a neighbor about it,he said that he was told that according to someone who is in the oakridge enginering community,they pretty much have cloaking technology about perfected.but what the heck are they cloaking .this would explain why they have already retired the 117 stealth fighter."],"Date Submitted":"04/14/2008 02:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.963398,+-83.916639(10441)&iwloc=A&hl=en\"> mufon case (10441) map </A>","Region":"Tennessee","Country":"United States","Object Features":"None","Object Flight Path":"Stationary,Straight-line path","Longitude":"-83.916639","Case Number":"10441","files":["/var/www/straped/mufon/html2text/10441.html.txt","/var/www/straped/mufon/mufon_json/10441.json","/var/www/straped/mufon/org/10441.html"],"Object Shape":"Cylinder","Weather Factors":"None","Log Number":"US-04202008-0009","City":"Knoxville","Tags":"City","Date of the Event":"04/14/2008 02:50 UTC","Sighting Duration":"Undisclosed","Latitude":"35.963398","Summary":"bright silver cylinder which got intensely bright and appeared to go from no movement tofast acceleration and disappeared.","trends":["There have been 50 other sightings in Knoxville","There was one other sighting in Knoxville on or around April 14th 2008"]}