{"Region":"North Carolina","Summary":"moved very slow from east to west along I-85 watch for 10sec. went behind trees drove very fast to see it and it was gone","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around April 19th 2008"],"Latitude":"35.235567","Date of the Event":"04/19/2008 08:35 UTC","files":["/var/www/straped/mufon/html2text/10457.html.txt","/var/www/straped/mufon/mufon_json/10457.json","/var/www/straped/mufon/org/10457.html"],"Disposition":"IFO","City":"Charlotte","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.235567,+-80.836497(10457)&iwloc=A&hl=en\"> mufon case (10457) map </A>","Source":"MUFON","Tags":"City","Longitude":"-80.836497","Case Number":"10457","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Features":"Unknown","Log Number":"US-04222008-0003","divs":["sighting detailswe saw five lights moving somewhat slow from east to west, the lights were about 40 to 50 ft. across and about 70 to 80 ft. long and one light in the middle. a storm was in the distance and it was a dark night, no outline of the body, no plane idenfitcation lights, no flashing lights, no winglights, no flashing plane taillights, wider than a c5a galaxy loadmaster. just five lights moving somewhat slow across the night sky, it must of been about 1000 to 1500 ft. up and a bout 1\\2 to 1 mile away. my wife and i were driving home on i-85 just outside of charlotte, nc. headed south and we were waching to see lighting in the distance, when we came around a turn and saw these five lights moving across the sky. we looked at it and could not figuer out just what was holding five white lights up in the sky. we looked at it for about 10 to 15 sec. and it went beyond some trees, so i speed up to get around the bend in the road and it was gone. as we talked about what we saw, we watched 3 planes come towards the airport and made comparisons to what we saw. we could see the out line of the plane, the red\\whites lights on the nose wingtips and tail of the plane. then we saw a plane way out, comming in, we could see the one light on the nose of the plane, and the flash on the wingtips. i'm a disable vet and have been around and seen lots of planes, and i know this was not a plane. i do think their are ufo's and i could not identfy what this was. i do however know that it was huuuge. i keep trying to figure out and compare it to something, but i can't, it is unknow to me. my wife allyson also was in the military and knows planes, but she too could not explane what it was that she saw. allyson is or was a sceptic."],"Weather Factors":"Unknown","Country":"United States","Date Submitted":"04/19/2008 08:35 UTC"}