{"files":["/var/www/straped/mufon/html2text/10454.html.txt","/var/www/straped/mufon/mufon_json/10454.json","/var/www/straped/mufon/org/10454.html"],"City":"Warren","Date Submitted":"09/30/1977 12:00 UTC","Object Flight Path":"Path then hovering","Source":"MUFON","trends":["There have been 14 other sightings in Warren","There were no other sightings in Warren on or around September 30th 1977"],"Viewing Distance":"20 Feet or Less","Country":"United States","Object Shape":"Disc","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-83.019327","Date of the Event":"09/30/1977 12:00 UTC","divs":["sighting detailsthis is something that has bothered me since i was a kid because i cannot find any other explanation for this other than it was a ufo. i was about 7 or 8 at the time. it was fall and star wars had just come out. i was at a friend's house and we were playing in an upstairs bedroom. i heard a whistling noise and went over to the bed to look out the window. i pulled up the shade and saw a large ufo right in front of the window. it was close enough that i could see the outline of a door and there was a red light and a green light underneath it. the angle that i saw was the bottom and the side of the ufo. it was disc shaped, like something you would see in star wars or something similar. it was a beige\\gold color and there were lines where the metal was fitted together. it was maybe 30-40 feet. i was stunned and told my friend, who came to the window and saw it too. the object hovered outside in front of the window, it was not moving or was not moving very fast when we saw it. we ran downstairs to tell his mom and uncle, but of course they did not believe us."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.497,+-83.019327(10454)&iwloc=A&hl=en\"> mufon case (10454) map </A>","Region":"Michigan","Case Number":"10454","Object Features":"Patterned Surface","Tags":"City","Log Number":"US-04212008-0012","Latitude":"42.497","Disposition":"Unknown","Summary":"Saw a disk shaped UFO that looked like a Star Wars type object"}