{"divs":["sighting detailsi was traveling east on i-10 from katy toward houston at 6:35 am. the sun was rising but no seen yet. the moment i started traveling on the freeway i saw 2 very short chemtrail (i think that is what they are called)in the east\\northeast sky, in front of me. short as in,if i held a dime at arms width up to it in the sky the chemtrails were shorter than even a dime. they were going straight down. i immediately thought that was strange. chemtrails dont usually go straight down. right below the chemtrails was an object. the object was not moving in any direction it was staying in one place. the chemtrails disappered and the object was still there. i could not make out the shape of the object or color, but it seems to be a reflective surface because the sun was rising and the object appeared to get brighter as the sun rose. or maybe it was a light getting brighter or dimmer. not sure but it seemed more like a solid object, not like a light. i watched this object while i was slowly creeping through traffic on the freeway for about 25 minutes. i was wondering if anyone else saw it. it was visible, why wouldnt anyone else see it? it was not very close however. at one point it seemed to get smaller or dimmer but then returned to its orginal size or brightness. i had to get off the freeway because of construction and when i did and got back on, i lost it in the sky. could not find it anywhere. this was about 7:00am. it was just gone. there is no way it was an airplane, helicopter, hot air baloon, or weather balloon."],"Date Submitted":"04/19/2008 06:35 UTC","Case Number":"10452","Sighting Duration":"Undisclosed","City":"Katy","Date of the Event":"04/19/2008 06:35 UTC","files":["/var/www/straped/mufon/html2text/10452.html.txt","/var/www/straped/mufon/mufon_json/10452.json","/var/www/straped/mufon/org/10452.html"],"Disposition":"Unknown","Longitude":"-95.814546","Region":"Texas","Latitude":"29.790025","Object Flight Path":"Undisclosed","Log Number":"US-04212008-0010","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.790025,+-95.814546(10452)&iwloc=A&hl=en\"> mufon case (10452) map </A>","Object Features":"Undisclosed","Country":"United States","Tags":"City","Object Shape":"Other","trends":["There have been 21 other sightings in Katy","There were no other sightings in Katy on or around April 19th 2008"],"Weather Factors":"Unknown","Summary":"Bright object hung in sky for atleast 25 minutes"}