{"Summary":"lasted app. 5 min. extremely odd appearance that differed between naked eye & binocular","Object Flight Path":"Straight-line path","Country":"United States","Longitude":"-85.131835","Date Submitted":"04/21/2008 11:03 UTC","Disposition":"Insufficient Data","Date of the Event":"04/21/2008 11:03 UTC","Case Number":"10455","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.644879,+-85.131835(10455)&iwloc=A&hl=en\"> mufon case (10455) map </A>","Object Features":"Undisclosed","Object Shape":"Other","Tags":"City","Weather Factors":"None","Viewing Distance":"Unknown","Log Number":"US-04222008-0001","Latitude":"39.644879","Source":"MUFON","City":"Connersville","divs":["Sighting Detailsa few minutes after the 11 pm news started my husband was out front with the dogs when he hollered to come out because there was something in the sky with 2 legs. I saw an object(s) in the western sky that appeared app. 10x larger than any star in the sky. It was 2 parallel lines glowing, no, shining, glimmering, a bright orange with 2 line at the center glowing a hazy orange. The 2 parallel lines were horizontal. I went & got my binoculars, and, to my surprise, the 2 lines appeared horizontal and were glowing red, white, & blue with a white halo. I looked again with the naked and it was still orange. Never had that happen before! It was traveling from the west to the north east. It traveled in silence and did pass directly overhead. It was visible app. 3 to 5 min. I lost sight of it as it went behind my home. A plane passed in the opposite dir. from west to south east, and it was normal. We've scene UFO's out here before but this seemed different. I had no idea what it and still don't. I tend to be sceptical and quite frequently believe most sightings are the government."],"Region":"Indiana","trends":["There have been 11 other sightings in Connersville","There were no other sightings in Connersville on or around April 21st 2008"],"files":["/var/www/straped/mufon/html2text/10455.html.txt","/var/www/straped/mufon/mufon_json/10455.json","/var/www/straped/mufon/org/10455.html"]}