{"Tags":"City","City":"Carlsbad","Source":"MUFON","Object Flight Path":"Path then hovering","Longitude":"-117.347784","map":"<A HREF = \"http://maps.google.com/maps?q=33.162473,+-117.347784(10450)&iwloc=A&hl=en\"> mufon case (10450) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/10450.html.txt","/var/www/straped/mufon/mufon_json/10450.json","/var/www/straped/mufon/org/10450.html"],"Log Number":"US-04212008-0008","Summary":"bright yellow disc","Case Number":"10450","Latitude":"33.162473","Country":"United States","Sighting Duration":"00:00:10","Object Shape":"Disc","trends":["There have been 14 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around January 15th 1982"],"Date Submitted":"01/15/1982 12:00 UTC","Region":"California","divs":["Sighting DetailsA friend and I were at the Army Navy Academy on the 2nd floor of a building there looking out the windows to the north which were wide open. It was a clear night. A block away from where we were and to the north are some houses. Behind these homes to the north the terrain drops down a good 300 feet or so down to a lagoon which connects to the Pacific Ocean. From where we were, it was a block or less to the west to the beach. This lagoon is what separates Carlsbad from Oceanside, Ca along the coast. As far as the date, I was in eighth grade at the time so it would have been between Sept. 1981 and June 1982. I don't remember the exact month or day so I typed in Jan. 15th, 1982 as an approximate date. It was around midnight. What I saw was a bright yellow disc shaped object move from east to west and stop in the air over where the lagoon is about 1-2 blocks away to the north. It's hard to say the exact size but I would estimate it to be 40 feet from end to end and maybe 10 feet tall in the center. The yellow color was very bright. This object made some kind of very low pitch humming sound. The sound was faint but audible. It stopped in the air I'd say a good 80 feet plus in the air and stayed there still for about 4-6 seconds. Then it dropped straight down behind the homes to the north into the lagoon area. I didn't see it again. I was kinda stunned for a second just looking that way wondering what I'd just seen when my friend and I both said to each other at the same time, \"Did you see that ?\" After discussing it, we both saw the exact same thing. I thought I'd report this in case somebody else may have seen something similar in that area around that time."],"Date of the Event":"01/15/1982 12:00 UTC","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown"}