{"Log Number":"US-04212008-0009","Date Submitted":"04/19/1998 02:20 UTC","City":"Layton","Summary":"Observed chevron shaped object making no sound and moving slowly over the wasatch mountains","trends":["There have been 5 other sightings in Layton","There were no other sightings in Layton on or around April 19th 1998","This sighting has never been favorited.",""],"Latitude":"41.060222","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"00:15:25","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.060222,+-111.971053(10451)&iwloc=A&hl=en\"> mufon case (10451) map </A>","Longitude":"-111.971053","Viewing Distance":"Over One Mile","divs":["Sighting DetailsAt the time of the incident I was on active duty in the USAF, I was Staff Sergeant working munitions control building 58 at Hill AFB. At approximately 2 AM the Airman I was working with and I went outside to have cigarettes. It was a very quiet and clear night. As we smoked our cigarettes we turned towards the Wasatch mountains and saw a very large chevron shaped object (about the size of a football field) flying very slowly over the mountain range. I remember not seeing any lights, but didn't think anything of it at the time. The only reason we could see the object was because the night sky was very bright from the moon. About ten to fifteen minutes past and the airman and I finished our smokes and went back inside to finish our work for the evening. Once inside the airman looked at me and asked if I had heard anything? Immediately I felt clammy all over almost having a panic attack. We ran back outside to see if it was still there, however it was gone. We never observed the object again. As I reflect back on my 22 years of service (retired MSgt USAF) I have observed many different kinds aircraft in my career. The object that we saw that night was without a doubt the strangest object I ever saw."],"Object Shape":"Chevron, Triangle","Tags":"City","Case Number":"10451","Object Flight Path":"Path with directional change","Country":"United States","Region":"Utah","files":["/var/www/straped/mufon/html2text/10451.html.txt","/var/www/straped/mufon/mufon_json/10451.json","/var/www/straped/mufon/org/10451.html"],"Date of the Event":"04/19/1998 02:20 UTC"}