{"Region":"California","Weather Factors":"Unknown","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.742552,+-117.031417(10458)&iwloc=A&hl=en\"> mufon case (10458) map </A>","trends":["There has been one other sighting in Lemon Grove","There were no other sightings in Lemon Grove on or around April 21st 2008"],"Case Number":"10458","Date Submitted":"04/21/2008 09:10 UTC","Object Features":"None","Longitude":"-117.031417","Date of the Event":"04/21/2008 09:10 UTC","files":["/var/www/straped/mufon/html2text/10458.html.txt","/var/www/straped/mufon/mufon_json/10458.json","/var/www/straped/mufon/org/10458.html"],"divs":["Sighting DetailsWhile returning home from an evening college course I sighted a triangle-shaped formation of lights. I was driving up Vista Drive (an east-west street that runs up a hill) in Spring Valley, CA. and while I turning into the alleyway that leads to my house I first saw the lights. All the lights were white, and these was a white strobe light underneath. I have seen many commercial aircraft, but none had as many lights as were on this vehicle, and it also lacked the tell-tale red and green running lights aircaft have on their wingtips. I stopped the car to look at this object, which quickly was moving from north to south. The lights were in columns of four apiece and they formed an open-tailed triangle, two columns on the outside, two columns inside, and the strobelight in the middle. From the size I would have to say the object was about five hundred feet in the air unless it was larger than a mid-sized commecial jet; if it was larger I couldn't guess. At no time did I hear any noise from this object; usually you can hear commerical jets even with the car (or house) windows closed and the car motor running. Also, I have rarely seen commerical jets fly from north to south in the area because they would be inside Mexican airspace within fifteen minutes. San Diego's airport is southwest of the area of the sighting, so air traffic over the area is east-west or north-south, but it runs west of the sighting area and not where this object was seen. As the object moved to the south I kept up with it driving along the alleyway, but I quickly lost it over some houses to the south (the area is highly developed.) I don't know if this was an experimental delta-winged jet, a bunch of small lights flying in formation, or a black craft with a plethora of lights; I saw no fuselage or structure supporting the lights. Whatever it was did not change shape, break apart, or shine down a beam of light; it seemed to be in a hurry to move south, and it moved straight in that direction."],"Country":"United States","Latitude":"32.742552","Disposition":"Unknown","Summary":"Witnessed triangle pattern of lights moving from north to south at night","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-04222008-0004","City":"Lemon Grove"}