{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/10466.html.txt","/var/www/straped/mufon/mufon_json/10466.json","/var/www/straped/mufon/org/10466.html"],"Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","City":"Mishawaka","Object Shape":"Boomerang, Unknown","divs":["Sighting DetailsI woke from a sound sleep and had a strange thought to look out the window which is next to my bed. I rolled over opened curtain and looked directly at it( it was as if it wanted me to see it,seeing that I have never felt that way before). In the southern sky there was a very bright light like none I have ever scene before and it looked very large. At first I thought it was maybe a plane on fire or something coming into orbit. I reached over and put my glasses on and looked again and it was still very bright. but as I was trying to figure it out it seemed to disappear than reappear and I could see several very bright lights. I am guessing it turned sideways maybe. It was slowly heading north and I was thing maybe it was a plane but it looked like no plane I have ever scene. The white lights were so intense and there were no color lights anywhere. I watched it for maybe a minute and it seemed to be flying very slow but with no sound. As it entered the tree's I decided to get up and run into the living room to get a better look at it. It took me maybe 10 sec to get there but when I did it was no where to be seen. Had it been a plane it would have surley came into view seeing that the airport is north west from me. But I just sat waiting for about 5 min and never saw it again. I could kick myself for leaving that window. I don't know if what I saw was a UFO but I do know one thing my heart raced like it never had before. Did anyone else see this? I went back to bed and dreamed of UFO's 1000's of them coming to earth in the near future. I say that for 1 reason only which is, my dreams that are so clear usually come true. And in the dream I was living in Indiana, but I am moving back to Florida this year. So from now on I will be looking to the skies until I leave."],"Summary":"Very bright light in the southern sky, than disappearing and reappearing very quickly and slowly flying north until disappearing from my sight.","Case Number":"10466","Date of the Event":"04/22/2008 05:30 UTC","Country":"United States","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.661993,+-86.158616(10466)&iwloc=A&hl=en\"> mufon case (10466) map </A>","Region":"Indiana","Log Number":"US-04222008-0012","Object Features":"Unknown","Tags":"City","trends":["There have been 11 other sightings in Mishawaka","There were no other sightings in Mishawaka on or around April 22nd 2008"],"Longitude":"-86.158616","Latitude":"41.661993","Date Submitted":"04/22/2008 05:30 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed"}