{"Case Number":"10465","Log Number":"US-04222008-0011","Country":"United States","Region":"Tennessee","Viewing Distance":"501 Feet - 1 Mile","Summary":"2 eradically flashing lights moving slowly in unison, with a beam of light inbetween them","Weather Factors":"None","City":"Oakland","Object Shape":"Other","Latitude":"35.228976","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.228976,+-89.515076(10465)&iwloc=A&hl=en\"> mufon case (10465) map </A>","Date Submitted":"04/21/2008 08:35 UTC","files":["/var/www/straped/mufon/html2text/10465.html.txt","/var/www/straped/mufon/mufon_json/10465.json","/var/www/straped/mufon/org/10465.html"],"divs":["Sighting Detailsmy girlfriend and i were walking with our daughter to the store when she pointed out what seemed to be two planes flying very slowly across the sky in formation off in the distance. the lights were pulsing at random, sporadic intervals and seemed almost to be blinking in and out of existance. the more we looked, the more we noticed how strangely random the blinking was. it was a very clear sky and we live in an area with little light pollution, so we could had normal planes and stars in the sky for a point of comparison. with further observation, there appeared a faint beam between the two points. almost as if outlining the side of a craft. my girlfriend described a third point she had seen before calling my attention to it, outlining a triangle formation. this triangle form is what caught her attention, she first thought her eyes wee playing tricks on her. our eyes were transfixed on this object with astonishment, and we tried to get closer for a better view. after about five minutes it was nowhere to be seen, although the sky was still very clear and the normal planes and stars we had first observed to compare were still present. also, i do not know if this incident is related, or just a normal astronomical occurence, but 30 seconds after the disappearance of the synchronous lights, a long trail of light resembling a shooting star crossed the sky. like i say, i don't not know if this second event was an extraterrestrial anomaly, or a shooting star, but given what we had witnessed just moments prior, we couldn't be sure."],"Longitude":"-89.515076","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Oakland","There were no other sightings in Oakland on or around April 21st 2008"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"04/21/2008 08:35 UTC","Source":"MUFON"}