{"Date Submitted":"04/11/2008 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.293945,+-111.09623(10474)&iwloc=A&hl=en\"> mufon case (10474) map </A>","Case Number":"10474","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Shape":"Sphere","Tags":"City","City":"Superior","Date of the Event":"04/11/2008 12:00 UTC","Summary":"Red Lights/Red Object. Departed mountains moved West from Superior, AZ","files":["/var/www/straped/mufon/html2text/10474.html.txt","/var/www/straped/mufon/mufon_json/10474.json","/var/www/straped/mufon/org/10474.html"],"Latitude":"33.293945","Object Features":"None","Log Number":"US-04222008-0020","Region":"Arizona","trends":["There have been no other sightings in Superior","This sighting has never been favorited."],"Source":"MUFON","divs":["sighting detailsmid morning. walking with 11 y.o. daughter on dirt trail in superior, az. looked toward the north of town and to the mountains north of town. i saw, and directed my daughters attention to, a bright red object that was moving up and west from the town. object started out at approximately 100 feet up and moved on a diagonal, up and west, for approximately 1 mile. we tracked the object visually for approximately 10 minutes. it was moving approximately 25 miles an hour. after it moved out to the west we watched it and then it disappeared. the object itself was not, or did not seem to be internally lit, but the red color was more intense, in my opinion, than could be accounted for by reflected light. it was very red, like red foil. no erratic motion was observed. it moved off to the west and then disappeared. it did not disappear as in flew too far away and we lost sight; no. it was well within sight and then it disappeared. i am writing this as i have just read on foxnews.com about similar red lights seen over phoenix, az. that news report triggered me to write to mufon regarding my sighting in superior, az earlier this month of april 2008. s\\jeff rabenda"],"Weather Factors":"Unknown","Longitude":"-111.09623"}