{"Summary":"Appeared to be a mothership passing east to west over Ottawa approx 1000 ft altitude.","files":["/var/www/straped/mufon/html2text/10476.html.txt","/var/www/straped/mufon/mufon_json/10476.json","/var/www/straped/mufon/org/10476.html"],"Case Number":"10476","Country":"Canada","Date of the Event":"02/04/1978 07:30 UTC","Latitude":"45.43002","Object Features":"Undisclosed","Region":"Ontario","Sighting Duration":"00:10:00","Longitude":"-75.694953","Log Number":"CA-04222008-0022","map":"<A HREF = \"http://maps.google.com/maps?q=45.43002,+-75.694953(10476)&iwloc=A&hl=en\"> mufon case (10476) map </A>","divs":["Sighting DetailsI was in my buddies' apt, watching the lights on the eastern horizon. I enjoyed watching airplanes coming & going by watching their landing lights & wing tip lights, when I noticed what appeared to be a cluster of landing lights in a horizontal plane. When I first saw these lights I thought I was looking at a group of helicopters flying formation. After approx 30 seconds I noticed these lights were headed in my direction. As the lights neared they began to blink randomly, & I estimated that each light was approx 50ft long by 10 ft wide in other words, each light was mounted vertically on the edge of the object, and they were much brighter than an arc welders torch. I will mention here that at this point that I could see that the object was a perfect disc shape moving straight west at approx 100 mph at approx 1000 ft altitude without wobbling & no noise in fact when I was listening every - thing became dead silent not even birds were chirping. The disc appeared to be incredibly large somewhere around 1000 to 2000 ft in diameter, which is why I thought it might have been a mother-ship. You have to remember that the sight I was seeing was so fantastic that I couldn't believe my eyes. When it neared my building it really got strange because I felt an entity on board the craft trying to communicate with me via mental telepathy. For some reason I became very frightened & jumped back which broke the link. A few seconds after this, the blinking lights started to blink in a different fashion going from right to left & reversing direction as if to say goodbye. As the leading edge of the disc neared the edge of my building's roof I watched it disappear overhead & I counted the seconds it took to pass over our building from beginning to end. It was approx 10 seconds. After the sighting I was completely bewildered because two days after the event the same object was announced on the radio indicating that it was spotted over many other cities & towns on a western track. End Note: If you want to reach me it will be more convenient to either phone or mail me. Thank you."],"Viewing Distance":"Unknown","Disposition":"Unresolved","Object Shape":"Disc","Object Flight Path":"Undisclosed","City":"Ottawa","Tags":"City","Date Submitted":"02/04/1978 07:30 UTC","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around February 4th 1978"],"Source":"MUFON","Weather Factors":"Unknown"}