{"divs":["Sighting DetailsI was bringing in the garbage can at 9:05 pm and speaking to my fiance' on the phone when I observed an irregular flight path of a red sphere. As I live close to Gateway airport, I commonly look up to watch the commercial, civilian and military aircraft (mostly on weekends). I resent implications that question my varasity! I am retired from Law Enforcemnt, served in the Army and have been professionally trained as an observer. I do NOT embellish or seek attention. I am a private person that has always prided myself in being open-minded, yet, I believe that I am very reputable and objective. My career should speak for itself! What was so unusual about this sighting is that it was silent and contrary to the flight patterns for this time of day. I estimate that it was at approx. 1500 to 2000 ft. and traveling Southward and parallel to Power Road as it was crossing Guadalupe Rd. when it came to a hover position after several accelerations and sudden slow downs. The red light was constant without any navigational lights or change in color. I continued describing the situation \"play by play\" on the phone with my fiance' whom was getting off from work in another hour. What had caught my attention was the irregular flight attitudes and then the fact that there were no navigational beacons. In amazement, I fixed on the object and then after a few minutes in the hover mode, I started to see through the object for a couple of seconds until it completely became invisible! I have watched TV programs that demonstrated the new technology of military vehicles using tiny camera's and micro imagers to take-on the appearance of the visible background like a chamelion in order to mask itself from observers. But the flight attitudes of this sphere take it into the rhelms of beyond the known limits of physics. I seriously doubt that a manmade technology is capble of what I obseved. I try to read a lot and keep apprised of advancements in scientific technologies, and I cannot believe that a human could survive the G-forces involved. Perhaps it is a unmaned vehicle, but how can a manmade sphere hover?"],"Case Number":"10475","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/10475.html.txt","/var/www/straped/mufon/mufon_json/10475.json","/var/www/straped/mufon/org/10475.html"],"Log Number":"US-04222008-0021","Date Submitted":"06/27/2007 09:05 UTC","Object Features":"Other","City":"Mesa","map":"<A HREF = \"http://maps.google.com/maps?q=33.45174,+-111.787733(10475)&iwloc=A&hl=en\"> mufon case (10475) map </A>","Tags":"City","Region":"Arizona","Latitude":"33.45174","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","Date of the Event":"06/27/2007 09:05 UTC","Object Shape":"Sphere","Longitude":"-111.787733","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around June 27th 2007"],"Summary":"Red sphere moving quickly then suddenly stop or become very slow with intermitent accelerations.","Weather Factors":"Unknown","Country":"United States"}