{"divs":["sighting detailsthis happened sometime in late november or early december 2007. my family and i were driving home at approximatley 9pm after some christmas shopping. we were a few blocks from our home, driving east. we had stopped at a stoplight about to turn right (south) when i noticed a bright light in the sky in front of us. we live north of dfw airport and are in the northern flight paths. at first i thought it was a plane and i could see other planes in the sky at that time. but the light grew extremly bright, a blue white light, and was larger than any standard plane lights. it also appeared to not be moving. the light seemed to intensify and just move slightly to the right of us (south). the light then faded out within about 2-3 seconds. as it faded out we could see yellow-orangle sparks trailing behind it. the entire episode lasted about 10-15 seconds. my thoughts about this experience are that it was a meteorite that was heading stright for us, thus the appearance of it barely moving. i decided to submit this story to mufon after reading more about the ufo sightings in stepheville and watching the episode of ufo hunters about the texas sightings that actually started in november\\december 2007 through feb 2008. even it it was just a meteortie, it was still proably a once in a liftetime event."],"Latitude":"33.023857","City":"Flower Mound","Longitude":"-97.089595","map":"<A HREF = \"http://maps.google.com/maps?q=33.023857,+-97.089595(10477)&iwloc=A&hl=en\"> mufon case (10477) map </A>","Source":"MUFON","Region":"Texas","Log Number":"US-04222008-0023","Case Number":"10477","files":["/var/www/straped/mufon/html2text/10477.html.txt","/var/www/straped/mufon/mufon_json/10477.json","/var/www/straped/mufon/org/10477.html"],"Viewing Distance":"Unknown","Tags":"City","Disposition":"IFO","Sighting Duration":"00:00:10","Country":"United States","Object Shape":"Unknown","Weather Factors":"None","Object Features":"Unknown","Date of the Event":"12/01/2007 09:00 UTC","Date Submitted":"12/01/2007 09:00 UTC","Object Flight Path":"Other","Summary":"Very bright light in Eastern sky appears to moving very slowly - some sparks","trends":["There have been 4 other sightings in Flower Mound","There were no other sightings in Flower Mound on or around December 1st 2007"]}