{"Source":"MUFON","Date of the Event":"01/01/2008 12:30 UTC","Summary":"2nd time same ufos seen from same place on the same day 2 yrs in a row","Object Features":"None","Tags":"City","Case Number":"10472","divs":["Sighting Details Previous to today I have made a report to MUFON concerning 4 UFOs' I saw on New Years Day 2007 just after midnight. The 4 amber spheres were hovering above the 10 freeway in Pomona as I raced to my girlfreinds house for the New Years party. I was sober just coming from work, I just passed Kellog Hill heading eastbound when I saw them. It was just after midnight when I noticed them. As I was passing them I stuck my head out of the window and saw one start to slowy descend. I was about to pull over when I decided nothing good could come from that, so I kept on going. I feel I should mention that I felt some anxiety as it descended. I was excited to find a video on You Tube of the same amber spheres filmed from basically the same place. I was extremely suprised to find out that the video was shot a year later than my sighting.just half an hour past midnihght. The video is a little confusing as far as where the spheres were but it was filmed in Claremont which is next to Pomona where I saw them the year before. The video on You Tube can be found by searching \"lights over San Diego\"."],"trends":["There has been one other sighting in Claremont","There were no other sightings in Claremont on or around January 1st 2008"],"Country":"United States","Weather Factors":"Unknown","Date Submitted":"01/01/2008 12:30 UTC","Longitude":"-117.710838","Object Flight Path":"Hovering then path","City":"Claremont","Latitude":"34.103996","Log Number":"US-04222008-0018","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10472.html.txt","/var/www/straped/mufon/mufon_json/10472.json","/var/www/straped/mufon/org/10472.html"],"Region":"California","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.103996,+-117.710838(10472)&iwloc=A&hl=en\"> mufon case (10472) map </A>","Object Shape":"Sphere"}