{"Object Shape":"Diamond","Latitude":"29.5294","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Friendswood","There were no other sightings in Friendswood on or around April 16th 2008"],"City":"Friendswood","Tags":"City","Date Submitted":"04/16/2008 12:00 UTC","Date of the Event":"04/16/2008 12:00 UTC","Region":"Texas","Longitude":"-95.201045","Source":"MUFON","Log Number":"US-04222008-0017","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"White diamond-shaped object. Lights oscillated red-green-blue-yellow counterclockwise at vertices. No sound. Stationary 20 minutes. Egressed below horizon slowly.","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsIt was 10 p.m., Wednesday (April 16, 2008). I had just finished watching a television program with my 12-year-old son. I got up to let our dog out for the last time that evening and decided to stay with her to make sure she went about her business quickly. I like to look at the stars and did while the dog sniffed around the backyard. As I looked up, I saw and heard what was obviously an airliner flying east to west across the southern sky. It was a clear night. We are in Houston Hobby airport's flightpath about 15 miles out. As the jet cleared my view, I noticed another prominent light in the southern sky. I couldn't judge distance or size, because it was just a diamond of light in the night sky. However, it did have colored lights at its vertices that displayed (in turn at one-second intervals counterclockwise) red-green-blue-yellow while the center remained a brilliant white. The entire image was roughly the size of an iPod's earpiece held at arm's length. I stood and watched it for a while, expecting what I thought was another aircraft to come within hearing and pass by. It didn't. After two minutes, the object was in the same position as I had first seen it. No sound or movement at all. After five minutes of the same behavior, I went inside to get my son to come out as a witness. Immediately, he said he had seen the same object in the same place in the sky two nights before. We watched it together for another 10 minutes, and it never waivered or emitted sound of any kind. By that time, we had retrieved a pair of binocculars and were taking turns viewing the object with them. Magnified by the field glasses, it was just a larger version of what we had seen with our eyes--a bright white diamond with colored lights moving in a counterclockwise circuit. We decided to call my wife who was driving home from a meeting at our church. We told her what we were watching, and she tried to locate it in the sky as she drove. Couldn't find it. At 10:20 p.m., my son noticed that the object was shrinking, as though it was moving away from us in a direct line (neither right nor left). It did this very slowly and moved toward the horizon as it did. We are surrounded by trees, and they began to obscure the object as it \"departed.\" We both climbed onto the airconditioner housings on the south side of my house to reacquire the object and did. At about 10:25 p.m., my wife arrived, and I got out a six-foot A-frame step ladder so she could see it too. She confirmed what I've told you so far. Within 5 minutes, the object had left our view on the ground, so my wife and son went up to his second floor bedroom and were able to watch it for another 3-4 minutes before it disappeared below the horizon altogether. We never saw anything like a mechanical shape, just a bright, absolutely silent diamond of light."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.5294,+-95.201045(10471)&iwloc=A&hl=en\"> mufon case (10471) map </A>","files":["/var/www/straped/mufon/html2text/10471.html.txt","/var/www/straped/mufon/mufon_json/10471.json","/var/www/straped/mufon/org/10471.html"],"Case Number":"10471","Weather Factors":"Unknown","Object Features":"Undisclosed"}