{"divs":["Sighting DetailsI was on my way to a technial advisory meeting on the evening I saw the object. I could not stop because of time constraints, however, someone came on the radio and announced they had seen a ufo. I am not sure of the date and year. It was dark so I suspect the time of the year was toward winter. I worked for Volusia County and went to various meetings between Daytona and Edgewater. When I got to the meeting an engineer also remarked on the ufo. It did not strike as one of our aircraft. I am aware of the Harriot Jet which I love. This craft was very high in the night sky so I could define its shape. I do want to send you some other information. During the eighties, I began drawing pictures of vehicles and what seems to be parts of a ship; also I began to write in symbols. I checked with two psychics 3,000 miles apart and approximately 2-3 years in time frame. They both asked me about the symbols, thinking they may have been Egyptian but they are not. I have since tried to get them interpreted. I attach some of the information."],"Log Number":"US-04222008-0019","Country":"United States","Date of the Event":"11/30/1985 12:00 UTC","Region":"Florida","Date Submitted":"11/30/1985 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 3 other sightings in Edgewater","There were no other sightings in Edgewater on or around November 30th 1985","This sighting has never been favorited.",""],"Object Features":"Unknown","Case Number":"10473","Object Shape":"Star-like, Unknown","Longitude":"-80.902276","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10473.html.txt","/var/www/straped/mufon/more/10473_submitter_file1__004.JPG","/var/www/straped/mufon/more/10473_submitter_file2__Dec13_65.JPG","/var/www/straped/mufon/mufon_json/10473.json","/var/www/straped/mufon/org/10473.html"],"Weather Factors":"Unknown","Latitude":"28.988875","Viewing Distance":"Over One Mile","Summary":"It was a craft that darted across the sky and appeared to go vertical at times.","map":"<A HREF = \"http://maps.google.com/maps?q=28.988875,+-80.902276(10473)&iwloc=A&hl=en\"> mufon case (10473) map </A>","Disposition":"Unknown","City":"Edgewater","Object Flight Path":"Stationary,Straight-line path,Path with directional change"}