{"divs":["Sighting Details My girlfriend and I were jumping on the trampoline in my backyard after a high school soccer game. We were watching the bats fly around and saw the UFO slowly floating thru the night sky. It looked huge because it was so close. Seemed just feet from our heads. I ran in and got my mom. She came out on to the deck and said \"what is that?\" It was moving on so we all jumped into the car and chased it down the road. We were out on a country road (gravel) and the UFO stop. Just sat there for a few minutes and changed directions and zoomed off. When we were chasing it in the car it seemed to go faster. I remeber mom being excited, trying to drive and watch at the same time. When it came over us at the house it seemed rectangular but out in the sky over the field it just seemed flat. I wish I had someone to tell back then. For now I am 31! We did call the news channel but they sort of laughed it off. To this day my friend, mom and I still call ita UFO. My Dad who wasto lazy to get off the couch says it was just a blimp. Thanks"],"Date Submitted":"11/30/1991 08:03 UTC","files":["/var/www/straped/mufon/html2text/10486.html.txt","/var/www/straped/mufon/mufon_json/10486.json","/var/www/straped/mufon/org/10486.html"],"City":"Boonville","Sighting Duration":"Undisclosed","Longitude":"-87.274172","Case Number":"10486","Object Shape":"Square, Rectagular","Latitude":"38.049213","Tags":"City","Region":"Indiana","Disposition":"Insufficient Data","Source":"MUFON","trends":["There have been 3 other sightings in Boonville","There were no other sightings in Boonville on or around November 30th 1991"],"Date of the Event":"11/30/1991 08:03 UTC","Log Number":"US-04232008-0009","Summary":"Rectagular shape with 4 lights at corners and one in middle","Object Features":"Patterned Surface","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Viewing Distance":"20 Feet or Less, 21-100 Feet","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.049213,+-87.274172(10486)&iwloc=A&hl=en\"> mufon case (10486) map </A>","Country":"United States"}