{"divs":["Sighting DetailsMe, my best friend and two very good friends were leaving some lights for filming in our university, we used during the day. it was about 7:40 in the night, there was a lot of people in the University, My university is placed in the central area of my city, we were standing out the car, about to enter, talking about the videoclip we were making, suddenly my best friend who was looking to the sky, told us \"look that light!\" at the very first moment I sow it, i thought it was a plane, cuz it had that very strong yellow light, but i couldnt see those little lights, blue and red airplanes have, it was pretty far, so i waited until it was closer, in order to say yes it is an UFO, but everytime it got closer and closer, i realized from far away it was an UFO, for several reasons, one was that it hasnt the lights in the wings as airplanes have, second, it was way too slow for being an airplane, third, aeroplanes doesnt fly so high here in my land, specially not in the night, fourth, it looked like a star, that night was a very star shiny night, it was like one decided to move, but it wasnt a haley, becouse it moved way too slow, from the sight of an human into the eart it moved like 30 cm in the sky in about 5-7 min.(I have no idea how many kilometers are those!)fifth, it was quite, it didnt emit any kind of sound we could hear, sixth, it couldnt be a satelite, becouse the moment it was coming closer, almost over our head, it turned the direction to the right like making a \"v\" \"u\" shape, that moment we all were absolutly sure it was an UFO and there was no doubt left. the most incredible thing was that the moment it began to continue it new direction it started to turn red, and it changed the color really fast into a dark red (like the ones sown in Phoenix the 21 april i guess)and slowly started to get invisible,it didnt left, it got invisible, it was clear, becouse it wasnt moving higher or lower, and when it dissapeared it wasnt bigger and then smaller, it was like dark red fading into a soft red that finally got invisible. Theres no way it was an helio ballon becouse we dont count with that kind of technology so easy as for wasting on some ballons. When it dissapeared I kept looking at the sky, I dont know if anybody else sow it becouse we were so focused into that, my friend tried to record it in the camera but it wasnt possible, becouse something suddenly decided not to work, that friend lost the last part,i was kinda excited i sow one again, i love to search UFOS in the sky but almost anyone believes until they see, my friends sow it too, i think we all were kinda perplex, it was the first time two of them see one so close, I got some anxius feeling but also for a second i got a bit scared, i was really happy i was with more people, after it i couldnt stop thinking about when they finally will arrive to our world, that is one chat me and my best friend usually have, we are trully believers and this isnt the first time we sow one, but the first time we sow it so early in the middle of the city with more people, i think that gives more credibility for esceptic ones, what is also very intersting is the fact that they were seen in Phoenix near to the date we sow, perhaps they were the same, it is clear they are showing theirsleves everytime more and more."],"Country":"United States","Summary":"A star started to move in one direction, then turned to the left and changed its color into red and dissapeared.","Latitude":"36.976517","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Star-like","Case Number":"10488","map":"<A HREF = \"http://maps.google.com/maps?q=36.976517,+-122.028286(10488)&iwloc=A&hl=en\"> mufon case (10488) map </A>","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around April 21st 2008"],"Date Submitted":"04/21/2008 07:40 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Does Not Apply","Region":"California","Longitude":"-122.028286","Date of the Event":"04/21/2008 07:40 UTC","Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Unresolved","Source":"MUFON","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10488.html.txt","/var/www/straped/mufon/mufon_json/10488.json","/var/www/straped/mufon/org/10488.html"],"City":"Santa Cruz","Log Number":"BO-04232008-0011"}