{"Object Features":"Unknown","Case Number":"10482","Region":"Indiana","Date of the Event":"04/16/2008 10:27 UTC","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/10482.html.txt","/var/www/straped/mufon/mufon_json/10482.json","/var/www/straped/mufon/org/10482.html"],"Viewing Distance":"Over One Mile","Log Number":"US-04232008-0005","Latitude":"40.426949","Summary":"Multiple lights in boomerang shape flicker east of West Lafayette","trends":["There have been 7 other sightings in West Lafayette","There were no other sightings in West Lafayette on or around April 16th 2008"],"Object Shape":"Boomerang, Circle","Longitude":"-86.905446","divs":["sighting detailsat 10:27pm 04\\16\\08 i was leaving a building on campus and looked east down my street before i turned, and saw 7 evenly-spaced lights stationary in a boomerang orientation in the sky east of purdue's campus. they were roughly 60 degrees off the horizon, and lower than most commercial aircraft. i noticed them because they were so bright, and i thought they were warning flares being dropped. i watched the far-right light disappear, and a new one appear on the left leg of the boomerang; then a second light follow suit. then all the lights simply disappeared. in total i saw them on for about 5-10 seconds. they were all the yellow-white color similar to a older car's headlights. no planes were seen or heard, even being by the airport. the sky was completely clear, with stars and the moon visible as well. i thought they were flares at first, but i have never seen flares go out, new ones appear, and then all go out in unison (including the most recently visible ones). if they were flares, they would have continued to burn out at a constant rate! plus they didn't dim slowly enough to be a flare or a firework burning off. the group of lights didn't move through the sky at all, so not a meteor either. i've been hearing the reports on the local news about a loud bang from meteors and military planes in the area breaking the sound barrier that night. if they were military planes with their exhaust ports facing me, then i would really like to know why they would simply turn off without changing color or shape (which would accompany planes flying away from my location at a changing rate). i have requested to remain anonymous, but i will disclose that i have a bachelors degree in forecast meteorology, a masters in cloud physics, and am working on my phd. i have a very good understanding of \"atmospheric occurrences\", as the news are claiming to be one explanation for this. yet, i have never seen meteors or other natural atmospheric occurrences look or behave like those lights did."],"Tags":"City","Date Submitted":"04/16/2008 10:27 UTC","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"West Lafayette","map":"<A HREF = \"http://maps.google.com/maps?q=40.426949,+-86.905446(10482)&iwloc=A&hl=en\"> mufon case (10482) map </A>","Object Flight Path":"Stationary"}