{"Summary":"flashing lights over the tri-state (indiana, illinois, kentucky) more than 10 of these things in the sky","Latitude":"38.490992","Weather Factors":"Unknown","divs":["sighting detailsthis is the 3rd night i have experienced these things. each night they get more in numbers and more active. last night i tried making contact with a flashlight, but i think i need a brighter light, i have a picture that my friend took off of her phone of this thing, its not very good but you can tell its not a star, or a plane, or n e thing like that. so i got a picture of the ufos over the hotspot in the tri-state, my email is vo0rheez@yahoo.com if you have any photos\\video or any other evidence from these sightings please send them to me and the objects took the form of ursa major, aka the big dipper, i watched them in there \"big dipper\" form for a long time, it was really really weird, now i really know more ppl has seen these things, come on this is the 3rd night i have seen them! they prolly been out for longer than that, im tellin you, if you live in the tri-state go outside and look at night they will more than likely be there again tonight, record it on video, and look thru ur telescopes, i want a detailed description of these things"],"Log Number":"US-04232008-0008","Viewing Distance":"Unknown","Case Number":"10485","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.490992,+-88.04965(10485)&iwloc=A&hl=en\"> mufon case (10485) map </A>","Source":"MUFON","Longitude":"-88.04965","Object Shape":"Star-like","City":"Samsville","Date Submitted":"04/22/2008 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10485.html.txt","/var/www/straped/mufon/more/10485_submitter_file1__LIGHTSINTHESKY.jpg","/var/www/straped/mufon/mufon_json/10485.json","/var/www/straped/mufon/org/10485.html"],"Region":"Illinois","Date of the Event":"04/22/2008 12:00 UTC","trends":["There has been one other sighting in Samsville","There was one other sighting in Samsville on or around April 22nd 2008","This sighting has never been favorited.",""]}