{"Object Features":"Patterned Surface","Latitude":"36.32959","Region":"North Carolina","Sighting Duration":"00:15:00","Object Shape":"Circle, Disc","City":"Henderson","Case Number":"10499","Source":"MUFON","Disposition":"Unknown","Weather Factors":"None, Does Not Apply","Summary":"it come over my house low large football statium size trees swaying gentely low hum behind object had some lights travled east towards warrenton slow moving followed it but lost it","Longitude":"-78.399164","map":"<A HREF = \"http://maps.google.com/maps?q=36.32959,+-78.399164(10499)&iwloc=A&hl=en\"> mufon case (10499) map </A>","Tags":"City","Object Flight Path":"Hovering then path","Log Number":"US-04232008-0022","files":["/var/www/straped/mufon/html2text/10499.html.txt","/var/www/straped/mufon/mufon_json/10499.json","/var/www/straped/mufon/org/10499.html"],"Country":"United States","Date Submitted":"03/21/2003 10:15 UTC","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Henderson","There were no other sightings in Henderson on or around March 21st 2003","This sighting has never been favorited.",""],"Date of the Event":"03/21/2003 10:15 UTC","divs":["Sighting DetailsMy german shepherd had pups on march 19 03. I let her out side and thats when i noticed a shadow come over the house the moon was shineing the shadow coverd my yard and my nieghbors house about 300 hunderd feet or more. The trees across the road where swaying back and forth gently the sound was a hum like. I had never heard a sound like that before it was large and scared me.It had some lights on it they where stationary.I did not know what it was but i think it was a ufo .It was black underside gray ontop circular in shape hard to really tell because i was scared i went inside told my husband about it called my brother who lives southeast of me to look out side he said it was travling towards warrenton .So i got in my car followed it but soon lost it going towards the Virgina i was on hwy 401 north travling towards Warrenton when it disapeared thats it been lookind for it to come back but no luck .Iam always carefull at night now when i go outside maybe it will come back.I never belived in UFO's but seeing is beliveing."]}