{"trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around April 9th 2008"],"Log Number":"US-04232008-0020","Summary":"a group of lights","Disposition":"IFO","Weather Factors":"None","Object Shape":"Disc, Saturn-like, Other","Object Features":"None","Date of the Event":"04/09/2008 08:00 UTC","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=25.477132,+-80.472107(10497)&iwloc=A&hl=en\"> mufon case (10497) map </A>","divs":["Sighting DetailsI was riding in a car in south Florida between 95 in Miami and the road to the Florida Keys. I saw a group of lights hovering and went right by it in the car, it was close, I kept staring expecting to see a tower, a microwave, radio tower or something this group of lights was attached to and I kept staring as I was a passenger and it was on my side of the road (we were driving from the Keys toward Miami). I did not see the metal tower that the lights were attached to. I have thought about this for 10 days and decided to write about it. I first noticed because the driver of the vehicle I was in asked me what was that light attached to? 3. I thought it was attached to a radio tower, it was not. 4. The object did not move, it was stable. I quit staring it as we drove right by it. It was close to the road, but suspended maybe 400-600 feet in the air. 5. My feelings were that it was some sort of optical illusion. 6. We drove by it, it was still there and I thought no more about it except wondered why I did not see the tower it was attached to. Did anyone else see this in South Florida? I can talk to the driver and find out more exactly what road we were on. I was a tourist and didn't have a good idea where we really were."],"Longitude":"-80.472107","Date Submitted":"04/09/2008 08:00 UTC","Country":"United States","Sighting Duration":"00:03:00","Latitude":"25.477132","files":["/var/www/straped/mufon/html2text/10497.html.txt","/var/www/straped/mufon/mufon_json/10497.json","/var/www/straped/mufon/org/10497.html"],"Source":"MUFON","Tags":"City","Region":"Florida","City":"Homestead","Object Flight Path":"Stationary","Case Number":"10497"}