{"Date of the Event":"04/23/2008 08:00 UTC","divs":["Sighting DetailsMy brother called me just a bit ago from a little league baseball game in Newtown PA to tell me he and everybody at the game stopped to watch an Orange Fireball that looked like it was crashing out of the sky. He said it first looked like something was out of control with an erratic trail but then described the trail as going straight and was very far away to the North of his location moving away from them. I asked if he could compare it to anything and he said it kind of looked like when the space shuttle crashed but it was just one object. He told me the Color was Orange and for a second the object got white like it got white-hot or something like that. He tried to take a cell phone photo but it was to far away. We are hoping someone else photos of it as it seemed that many people saw this object. I told him I thought this was very interesting as there were two reports last week of objects falling from the sky as well in Indiana and North Carolina, There has to be something to these events. If anyone else saw this please report it on MUFON."],"Latitude":"40.229275","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around April 23rd 2008"],"Longitude":"-74.936833","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.229275,+-74.936833(10493)&iwloc=A&hl=en\"> mufon case (10493) map </A>","Object Flight Path":"Path with directional change","Object Features":"Other","Weather Factors":"Unknown","City":"Newtown","Tags":"City","Date Submitted":"04/23/2008 08:00 UTC","Region":"Pennsylvania","Object Shape":"Fireball, Unknown","Log Number":"US-04232008-0016","files":["/var/www/straped/mufon/html2text/10493.html.txt","/var/www/straped/mufon/mufon_json/10493.json","/var/www/straped/mufon/org/10493.html"],"Disposition":"Unknown","Country":"United States","Source":"MUFON","Case Number":"10493","Viewing Distance":"Over One Mile","Summary":"Orange/White Object with Fire Trail seen crashing from the sky in Northeast Pa."}