{"Country":"United States","Latitude":"39.686226","Date Submitted":"08/10/1998 12:00 UTC","Source":"MUFON","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/10496.html.txt","/var/www/straped/mufon/mufon_json/10496.json","/var/www/straped/mufon/org/10496.html"],"Case Number":"10496","Viewing Distance":"Unknown","Object Shape":"Cylinder, Fireball","Disposition":"Insufficient Data","Summary":"cylinder shaped object moving west to east at a high rate of speed across the nite sky","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.686226,+-74.995168(10496)&iwloc=A&hl=en\"> mufon case (10496) map </A>","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Monroe","There were no other sightings in Monroe on or around August 10th 1998"],"divs":["Sighting DetailsI lived out in a wooded area and was sitting on the steps looking at the stars.I noticed this object moving across the night sky up in the stars at a high rate of speed.It crossed from the west to the east.It was zooming past the stars fast.At first I thought it was a plane.But it had no lights.It was just a bright silvery matalic cylinder of and object with out wings,I went and got my binoculars.It covered the whole horizon in less than 9 minutes. When I was a kid about 9 or 10.There was 6 of use playing kick the can.A sort of jail break game.When a fire ball like object flew past our back yards along a creek and disapeared.We all went back to see what it was but got scared in the woods in the dark,And ran scaring ourselves more.It was in Laurel Springs along the creek running off of the lake.None of us heard anything about it though.And where to scared to go back to see for ourselves. One other thing.I have a brother who said I am not to say anything about this.He was in the NAVY for 33 years.He said that the UFO's are not from space but are from EARTH.That they come out from under the ice packs.He was stationed in Antartica for 3 years.And in our oceans.And are more USO,s than UFO,s. I beleive there is something here with us.And the Governments of all countrys know and are giving us a bunch of malarky about what we are seeing out there.WEATHER BALLOONS MY ASS I would take a lie detector test to prove all this."],"Longitude":"-74.995168","Object Features":"Undisclosed","Date of the Event":"08/10/1998 12:00 UTC","Region":"New Jersey","Log Number":"US-04232008-0019","City":"Monroe"}