{"Region":"Missouri","Latitude":"37.973203","Object Shape":"Boomerang","Source":"MUFON","trends":[],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.973203,+-91.830003(10491)&iwloc=A&hl=en\"> mufon case (10491) map </A>","Case Number":"10491","Date of the Event":"04/20/2008 12:00 UTC","Viewing Distance":"101-500 Feet","Summary":"Black half circle moving from east to west in a boomerang type of motion.","Weather Factors":"None","Disposition":"Unknown","Longitude":"-91.830003","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/10491.html.txt","/var/www/straped/mufon/mufon_json/10491.json","/var/www/straped/mufon/org/10491.html"],"Tags":"City","City":"Undisclosed","Log Number":"US-04232008-0014","Date Submitted":"04/20/2008 12:00 UTC","divs":["Sighting DetailsA black half circle came into my view as I laid on a lounger, on my deck in my back yard. Frequently I look at the clowds and sky as I live near the airport and see planes often. At first I thought it was a bird. But it was spinning counter-clock wise. The spinning action centered at a point that would appear as if it were a complete circle with one half of it not visible. It spun about once per second. Traveling from east to west in a perfectly straight line, it was not clear at first how high it was. After it was some distance away, it's altitude and size were more apparent. It was about 400 to 500 feet high and aproximately 8-10 feet in diameter. It appeared to be traveling fairly parallel with the ground. As it got into the distance it passed through some trees and I observed the profile of it. From the side it flashed bright white, as you see when the sun hits an air liner and it creates a bright reflection of the sun. The sun was at the 1 o'clock position in the sky, and I speculate it was reflecting one half of the object. Since it flashed at the same rate as the rotation. At this angle the profile was observed and was shaped like a cigar. It was in sight for about 10 to 12 seconds and dissappeared into the distant blue sky. It happened so quickly I had no reaction of any type until it was over. I still can see it vividly in my mind."],"Country":"United States","Sighting Duration":"Undisclosed"}