{"Latitude":"42.46837","Source":"MUFON","Region":"Michigan","Date of the Event":"04/23/2008 10:12 UTC","divs":["Sighting DetailsI was star gazing with my 10\" dobsonian and my binoculars. I looked at an aircraft flying by when I saw what appeared to be a group of objects that were very dim and kind of undulating like a shred of cloud. The objects were arranged in sort of an M shape and undulating almost like a cloud. I first noticed it when it was 35 degrees elevation NW and it moved in a westerly direction about the speed of a slowish passenger jet. There was no wind and no clouds and good visibility. I have seen this object before but did not report it since I figured it must have been a very fast moving cloud since there was wind on previous days, even though the objects never moved in the direction of the wind on the ground. I saw another person report this object and it acted very similar in behavior to what I saw. I am quite certain it was not a flock of geese, since it was moving way too fast and the undulations were moving to fast for a flock of geese as well. I have seen many geese and many objects in the sky."],"Object Features":"Undisclosed","Summary":"Looked like a flock of birds but moving way too fast","Disposition":"Insufficient Data","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Eastpointe","There were no other sightings in Eastpointe on or around April 23rd 2008"],"Case Number":"10498","map":"<A HREF = \"http://maps.google.com/maps?q=42.46837,+-82.955475(10498)&iwloc=A&hl=en\"> mufon case (10498) map </A>","files":["/var/www/straped/mufon/html2text/10498.html.txt","/var/www/straped/mufon/mufon_json/10498.json","/var/www/straped/mufon/org/10498.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Object Shape":"Chevron","Date Submitted":"04/23/2008 10:12 UTC","Log Number":"US-04232008-0021","Longitude":"-82.955475","City":"Eastpointe"}