{"Viewing Distance":"Over One Mile","Summary":"Like Bishop, TX Sighting","Disposition":"Unresolved","Date of the Event":"11/30/2000 11:00 UTC","files":["/var/www/straped/mufon/html2text/1050.html.txt","/var/www/straped/mufon/mufon_json/1050.json","/var/www/straped/mufon/org/1050.html"],"Country":"United States","Object Flight Path":"Stationary,Other","Longitude":"-95.61609","trends":["There have been 5 other sightings in Claremore","There were no other sightings in Claremore on or around November 30th 2000"],"City":"Claremore","Object Features":"Undisclosed","divs":["Sighting DetailsI recently moved to Denton, TX from Claremore, OK. I was watching KDFW Fox 4News tonight (out of Dallas) and a report of the Tex Files featured the DFWchapter of MUFON and a recent (2-7-01 I think) report of an UFO from Bishop, TX(near Corpus Christi). They showed the video tape from the Bishop, TX sightingand I was stunned to find that looked exactly like an object I filmed inDecember 2000 when I still lived in Claremore, OK. I filmed the object using my8mm camera and showed the video to family and friends, all agreeing that it wasa very strange object. As the Bishop tape showed it appeared to be a star orpinprick of light but then would suddenly turn all kinds of different colors andthen do this really strange moving around erratically and would increase in size3B as it did this you can see on the tape what appears to be a disc spinningrapidly, I guess. Im not really sure how to explain it, but it looks exactlythe way the object from the Bishop, TX tape did. Over the next three nights Isaw as many as two or three similiar objects in the sky. I also noticedmilitary type jets (F-16s ?) that fly over Claremore at really low altitudesappearing to fly towards the object3B Claremore is not close to an Air Force Base and normally do not notice anymilitary craft at all. Initially, I reported the incident to the National UFOReporting Center web site but their response was the often times the atmospherecauses a twinkling effect of a planet or star. I dubiously accepted thisexplanation, but after seeing the Bishop, TX video on the news tonight I knowthat the object I filmed was the same kind of thing. I have no idea what itwas, but I know it unnerved me."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.312596,+-95.61609(1050)&iwloc=A&hl=en\"> mufon case (1050) map </A>","Date Submitted":"11/30/2000 11:00 UTC","Tags":"City","Latitude":"36.312596","Region":"Oklahoma","Case Number":"1050","Source":"MUFON","Sighting Duration":"01:59:00","Object Shape":"Undisclosed","Log Number":"","Weather Factors":"Unknown"}