{"divs":["Sighting DetailsI was standing outside a church with my family waiting for my brother to get out of a boyscout meeting. We were in the parking lot. I looked up and noticed a glowing greenish object appeared traveling from west to east. It passed directly overhead. It appeared to be rotating on its horizontal axis, and 'bouncing' at the same time, with some flaps that extended and retracted while it was bouncing. There was a central sphere, and a ring around it, with the above described arms that extended from it. I don't recall it making a sound. I estimate it was about 500 feet overhead, and traveling at about 75-100 MPH. My mother saw it too, but she blew it off, and denied any recollection of details later. I can't recall, but I think I called the Wheaton Police to report it. I was a young teenager at the time. The event has stayed with me forever, and I wonder if this type of object has been reported before, or in the same area around the same date. I am not sure at all about the dates, but put it somewhere between 1970 and 1974. It was warm out, and we were waiting for my brother to get out of his boyscout meeting. My sister was younger and has no recollection of the event. My father, an electrical engineer, knew I was upset by the incident and was sure there was a 'logical' explanation of it. It was never discussed after this. I am now a college professor with a doctoral degree and I am just as certain now that what I saw was a UFO as I was that night. I have never discussed this with anyone for fear of being perceived as crazy. The object just continued on its trajectory until I could no longer see it."],"Date Submitted":"04/15/1972 08:00 UTC","Log Number":"US-04242008-0005","files":["/var/www/straped/mufon/html2text/10508.html.txt","/var/www/straped/mufon/mufon_json/10508.json","/var/www/straped/mufon/org/10508.html"],"Object Shape":"Circle","Sighting Duration":"00:01:00","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","City":"Wheaton","Weather Factors":"None","Date of the Event":"04/15/1972 08:00 UTC","Latitude":"41.87313","Country":"United States","Object Features":"Appendage(s)","Case Number":"10508","Tags":"City","trends":["There have been 5 other sightings in Wheaton","There were no other sightings in Wheaton on or around April 15th 1972"],"Summary":"Glowing object appeared bouncing overhead at about 500 Ft. AGL","map":"<A HREF = \"http://maps.google.com/maps?q=41.87313,+-88.102873(10508)&iwloc=A&hl=en\"> mufon case (10508) map </A>","Region":"Illinois","Disposition":"Unknown","Longitude":"-88.102873","Source":"MUFON"}