{"Summary":"Maybe seven red lights boomerang shape more lights on one side than other.","Object Features":"None","Region":"California","Tags":"City","City":"Garden Grove","divs":["Sighting DetailsI was sitting in my backyard smoking a cigarette. it was probably between ten thirty P.M. and eleven thirty P.M. It might have been a little later. I enjoy watching the night sky. Looking at stars and watching planes go by. I heard a plane and looked up. That is when I noticed the lights. It was to the south of me. Moving from West to East. I think there were maybe seven lights. It was sort of boomerang shaped and there were more lights on one side than the other. The two end lights were alternately flashing as it moved. I thought it was a plane but it was bigger or closer than it appeared to be. After the plane that had made me look up in the first place flew by,the red lights were the only thing In that area, and I didn't hear any engine sound. There were no other colored lights as you would expect on a plane. No white or blue. I called my son to come out and look. It took him about two minutes to come out. I had called him several times in that time. It seemed to be moving diagonally, not straight from the center bend of the lights. It was going in a southeast direction. After the end lights flashed back and forth, all of the lights rotated from one end to the other and started back from the beginning. then all of the lights stayed solid. It then just disappeared. Just faded and was gone. There were some clouds in the sky that night so I waited to see if maybe it had flown into them and would re-appear, but it never showed up again. Unfortunately I didn't take pictures, as I don't keep my camera charged and didn't want to stop watching what I was seeing. I was very excited but nervous at the same time. I doubted myself, and thought I had to be mistaken by what I was seeing, until I saw a news report about lights over Arizona, so I decided to write in. I am wondering if anyone else in my area saw something around that time. Or if anyone can tell me what it was."],"Object Flight Path":"Path with directional change","Case Number":"10509","Latitude":"33.776335","Disposition":"Unknown","Date of the Event":"04/16/2008 11:00 UTC","Log Number":"US-04242008-0006","Weather Factors":"Unknown","Object Shape":"Boomerang","Source":"MUFON","Date Submitted":"04/16/2008 11:00 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10509.html.txt","/var/www/straped/mufon/mufon_json/10509.json","/var/www/straped/mufon/org/10509.html"],"Sighting Duration":"Undisclosed","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around April 16th 2008"],"Country":"United States","Longitude":"-117.940278","map":"<A HREF = \"http://maps.google.com/maps?q=33.776335,+-117.940278(10509)&iwloc=A&hl=en\"> mufon case (10509) map </A>"}