{"files":["/var/www/straped/mufon/html2text/10502.html.txt","/var/www/straped/mufon/mufon_json/10502.json","/var/www/straped/mufon/org/10502.html"],"Log Number":"US-04232008-0025","Object Features":"Unknown","Tags":"City","Source":"MUFON","Latitude":"35.38702","map":"<A HREF = \"http://maps.google.com/maps?q=35.38702,+-87.995307(10502)&iwloc=A&hl=en\"> mufon case (10502) map </A>","Longitude":"-87.995307","divs":["sighting detailsthe first time i witnessed the immobile star, i was with my father. we stayed up the entire night, watching the stars. we both believe in ufos, extra-terrestial or military related, due to a previous sighting in my childhood, which i will not post in this report, but perhaps in another. it was at night, between 10 pm and 12 am. we were sitting on our porch. our house is built facing direct north on a hill overlooking a depression in elevation that continues roughly 100 yrds until our land meets the road, the other side of which has trees whose tops would likely meet the elevation of our hill. this allows us a clear sight between direct north west to roughly north north east, as a tree relatively close to the house blocks further sight. as we watched the stars, we noticed several that flashed or shimmered. this is natural, and can occur for many reasons, but we took note anyways. however, we noticed a single star just above the treeline across the road. there was nothing of significance, onlt that it flashed different colors, and may shimmer in and out of sight, most likely due to the trees. the sky, of course, moves across the night, and the locations of the stars in the sky moves from sun down to sun up. as time passed, this star, however, did not move. we paid close attention to the relative positions of stars to objects we can easily associate. the sky was indeed moving as it should, yet this star, which flashed red, blue, and, as memory serves, kept an orange-ish hue, did not move in the night sky. my father and i retired early, ending our nightwatch between 1 am and 2 am. the star had still not moved by that time. the second sighting of this immobile star makes it not entirely immobile. i was with a friend, at the same location, a few weeks later, starting the nightwatch some time between 10 pm and 12 am with full intention to remain awake until dawn. we talk about the possibility of life on other planets. i notice the same flashing star in the same place, and point it out to him. we watch the night sky, but i found myself disappointed, this star did move during the course of the night. however, we both noticed it stopped near the tree that, as i previously mentioned, blocks line of sight past north north east. we used the branches to set it's rate of movement. the sky moves from north north west to north north east from downwards to upwards over the course of the night. this star followed that, but remained immobile. we watched the sky and talked for hours, paying special attention to this star. it did not move any more. we noticed as the sky lightened, from it's darkish hue to a lighter shade at a relatively fast rate. then, as the light illuminated the sky, we could see clouds above the trees that we could not without this new daylight. the star remained in the beginning stages of the light, but then, the true reason for a 'sighting'. the star, at a rate... i'm not sure, but i would estimate sextuple the rate of movement for the lingering night sky, and it moved nearly violently upwards on the night sky's trajectory. i will not say that it disappeared into the clouds, as in it was below and went through them to conceal itself, or if it disappeared behind the clouds. all i know is it was concealed due to it's upward motion towards the now illuminated clouds. i cannot remember clearly, and i will not deplete the integrity of this report by falsifying the details. it truly scared myself and my friend that this immobile star suddenly moved much quicker than any star should in the first place, but that it remained immobile for some time. i have stayed up several times until dawn with another friend since then, yet i have not been able to find this star again. the first time i noticed it, with my father, it puzzled me, but nothing else. the second time, i was afraid that something would defy nature as such as this star did. if it would serve as any help, i frequently see military aircraft moving to and fro between air bases, as my house is relatively close to the flight path. i have not recorded a picture or a video as i did not own a working camera\\video recorder at the time."],"Viewing Distance":"Unknown","Country":"United States","Weather Factors":"None","Disposition":"Unknown","trends":["There have been no other sightings in Clifton","This sighting has never been favorited."],"Case Number":"10502","Region":"Tennessee","Object Flight Path":"Stationary,Straight-line path,Other","City":"Clifton","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Summary":"Immoble Star Rests Until Dawn, Moves As Sun Rises. Two Events Included.","Date Submitted":"05/31/2007 10:00 UTC","Date of the Event":"05/31/2007 10:00 UTC"}