{"files":["/var/www/straped/mufon/html2text/10500.html.txt","/var/www/straped/mufon/mufon_json/10500.json","/var/www/straped/mufon/org/10500.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.190119,+-82.130442(10500)&iwloc=A&hl=en\"> mufon case (10500) map </A>","Source":"MUFON","Object Flight Path":"Path then hovering","Country":"United States","Region":"Florida","Log Number":"US-04232008-0023","Object Features":"Unknown","Object Shape":"Diamond","Case Number":"10500","Viewing Distance":"Over One Mile","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around February 23rd 1995"],"Longitude":"-82.130442","divs":["Sighting DetailsAround 7:30pm, in Febuary of 1995, I was walking my yorkshire terrier (Brandy)in Summerfield Florida, and she looked up and started barking, I followed her gaze and saw a distant light that I first thought was a helicopter or a plane doing some sort of recon for the cape.( It was pretty far away, and NASA was getting ready to launch the shuttle the next day.) I watched it for a couple of minutes expecting it to fade from view, but it didn't, It had stopped probably about 5-7 miles away. It just hung in the sky like a light bulb, then it flared up really bright and I opened the door and hollered to my family to come and see this, (it really kinda excited me), My mother, girlfriend at the time, her daughter all came out just in time to see it pulse even brighter, and four other lights\"broke off\", of it and went in 4 different directions, the first light dimmed a little and stayed put. I was really excited now because to the best of my knowledge, WE don't have craft capable of that type of thing. We all watched it for about another 10 minutes give or take, then the 4 other craft all at once came back in as quickly as they had gone, and \"rejoined\" the main craft. Then without even a blink it shot straight up into the sky zipped slightly due west southwest and was gone in a matter of seconds. My family and I talked about it for awhile, commenting on the way the craft came apart and then back together and then the way it left.We also discussed the ramifications of it being present one day before the launch of the shuttle. I had put it to the back of my mind until I saw a show on T.V. tonight about the governments ability to reverse enginneer E.T.s'cadillac. It got me to remembering the event and I thought you might want to hear about it. I have no pictures or sketches of it, but it was kind of diamond shaped, and manuvuered very quickly at sharp angles and made little to no noise, especislly with the speed it was travelling."],"City":"Ocala","Summary":"Walking my dog, she started barking at the sky,","Tags":"City","Date of the Event":"02/23/1995 07:30 UTC","Latitude":"29.190119","Disposition":"Insufficient Data","Weather Factors":"None","Date Submitted":"02/23/1995 07:30 UTC","Sighting Duration":"Undisclosed"}