{"Object Shape":"Diamond, Sphere, Star-like","City":"Fort Worth","Region":"Texas","Sighting Duration":"00:02:00","Source":"MUFON","Weather Factors":"None","Country":"United States","Date of the Event":"03/27/2007 09:30 UTC","Tags":"City","Case Number":"10519","Disposition":"Unknown","trends":["There have been 128 other sightings in Fort Worth","There were 3 other sightings in Fort Worth on or around March 27th 2007"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","divs":["Sighting DetailsDuring the night on March 27th, 2007,in Arlington, TX, I went outside with my friends to show them how well my new telescope worked in the night sky. About then minutes pass, and I just look around the night sky, enjoy the stars, when I see what I believed to be a bright star, at that moment. This \"star\" was brighter than anyother around it, and it just stood there, very bright and not moving an inch. I then decide to my friends that I wanted to gaze at this beautiful \"star\". I turn around with my telescope, and in my amazement, this object started moving, fast. It slowed down after coming a quarter off from west, then sped up and got brighter. The moon was nice and big during this moment. It seemed to be flying towards it. After a minute of awkward flight, of extreme stopping, to extreme speeds, it flew, as I saw it, infront of the moon. I expected it to fly accross the moon and appear on the other side. Instead it disapeared. My friends and I all pondered on what this object could have been. I ruled out a helicopter, plane, or comet. In the end, I couldn't figure out what this object was. It was a UFO. Recently my nights have been more or less awkward. I researched on time loss effects, and as I felt them. In a night, I didn't move an inch, and wake up, a mear couple of seconds, before my alarm clock went off. If any physical problems have occured, I don't know, yet some sleepless nights come off some awkward dreams."],"Viewing Distance":"Unknown","Longitude":"-97.31599","files":["/var/www/straped/mufon/html2text/10519.html.txt","/var/www/straped/mufon/mufon_json/10519.json","/var/www/straped/mufon/org/10519.html"],"Log Number":"US-04242008-0016","Summary":"Bright, Fast, Not Natural, Star and Stop Flight, What now?","Object Features":"Other","Date Submitted":"03/27/2007 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.728239,+-97.31599(10519)&iwloc=A&hl=en\"> mufon case (10519) map </A>","Latitude":"32.728239"}