{"Region":"Massachusetts","Object Features":"Unknown","Summary":"3 large white lights in a row hovering low in the sky. I was driving South on Rt. 1A. Appeared to be an aircraft of some kind, but remained in the same spot without moving at all.","Latitude":"42.141744","Case Number":"10512","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unknown","Object Flight Path":"Stationary","Log Number":"US-04242008-0009","Date Submitted":"04/22/2008 10:30 UTC","divs":["Sighting DetailsDriving South on Rt. 1A in Walpole, MA, towards the center of town at approximatley 10:30 p.m. I noticed what appeared to be some type of aircraft, or possibly lights at the top of a tower. There is no tower in that vicinity. What I saw was 3 large circular, white, bright lights in a row, about 200 ft. above the tree line. It seemed to be way to low for an aircraft. The lights appeared to be part of a rectangular craft of some type. What struck me is that it did not move. I decided to pull into a small shopping plaza parking lot, because I seemed to be getting closer to it. I did not take my eye off of it, until I turned off the main road. As soon as I took the turn into the parking lot I looked back to the spot where it was previously, and it was gone. This all took a matter of a few minutes. I emailed my friend the following morning, who was traveling in the same direction at approximatley the same time if he had seen anything while driving home, without describing anything I had seen. He replied that he had and described exactly what I had seen."],"Tags":"City","Source":"MUFON","Object Shape":"Square, Rectagular","Date of the Event":"04/22/2008 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.141744,+-71.24951(10512)&iwloc=A&hl=en\"> mufon case (10512) map </A>","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-71.24951","City":"Walpole","files":["/var/www/straped/mufon/html2text/10512.html.txt","/var/www/straped/mufon/mufon_json/10512.json","/var/www/straped/mufon/org/10512.html"],"trends":["There have been no other sightings in Walpole","This sighting has never been favorited."]}