{"Sighting Duration":"Undisclosed","Latitude":"40.59116","Summary":"Disc shaped object seen in early 1970's over Sears at Foothills Fashion Mall, by myself and children.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.59116,+-105.076553(10510)&iwloc=A&hl=en\"> mufon case (10510) map </A>","Region":"Colorado","Date Submitted":"05/20/1974 08:00 UTC","City":"Fort Collins","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"05/20/1974 08:00 UTC","Longitude":"-105.076553","Object Shape":"Disc","Disposition":"Unknown","Object Features":"Unknown","Weather Factors":"None","Case Number":"10510","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/10510.html.txt","/var/www/straped/mufon/mufon_json/10510.json","/var/www/straped/mufon/org/10510.html"],"trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around May 20th 1974"],"divs":["Sighting DetailsIn May ( day before Mother's Day) in about 1974, I drove to Foothills Mall to pick up my children who had been shopping for my Mother's Day gift at Sears. I picked them up at the north entrance of Sears. One daughter said\" look up Mom.\" I was astounded to see an enormous metalic disc shaped object sitting a couple of hundred feet over the malls north parking lot. No one else in the parking lot seemed to see it or were concerned about it. It was shortly after the mall had opened and we initially thought it was advertising gimmick for the opening of the Sears store at the mall. But it was much too large to have been a hot air balloon, or any other balloon. It started moving east...so we tried to follow since we were going that direction anyway....but it quickly disappeared after we attempted to follow it for several blocks. It was an exciting experience. I wish I could have hypnosis to take me back so I could remember more details of the object. We watched for something about it in the local news and never saw anything. Because we didn't think anyone would believe us, we have mentioned this to very few people. Another strange part of the experience was that we all seemed to have some sort of amnesia about the siting. Seemed to forget it about it for several years. None of this would make sense to most people. Whether it was a group hallucination, or what else it was...we will never know. There wasn't any loss of time involved and we were never closer than a few hundred feet. This happened about 35 years ago...so our memories of this object are all a little different. My children are in their 30's and 40's now...but we do all live here in Fort Collins. There were no cell phones in those days...so we had nothing to take a picture. Sure wish we had."],"Viewing Distance":"101-500 Feet","Log Number":"US-04242008-0007"}