{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/10518.html.txt","/var/www/straped/mufon/mufon_json/10518.json","/var/www/straped/mufon/org/10518.html"],"Object Shape":"Cigar, Cylinder, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=38.903562,+-77.030656(10518)&iwloc=A&hl=en\"> mufon case (10518) map </A>","City":"Washington","Date Submitted":"02/29/2008 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-77.030656","Tags":"City","Summary":"Unknown object in digital photo of lunar ecipse at night","Object Flight Path":"Undisclosed","Latitude":"38.903562","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around February 29th 2008"],"divs":["Sighting DetailsDuring the most recent lunar eclipse I decided to try to get digital photos of the event as it transpired. I set my Fuji camera at maximum magnafication & took some shots. Just as the moon was coming out of the shadow it looked awesome as I took this final shot. At this time I could not see anythind other than the moon in my cameras screen. Afterwards I decided to transfer the last image to my laptop to possibly use it as my wallpaper. After I did the transfer & the photo was at full screen size, I noticed a triangular looking tiny object with what looked like an aircrafts lights in the lower left side of the picture. As I blew up that area of the photo, the object began to look very odd. I then realized that it definetly was not an aircraft that I had ever seen before.I noticed that it had a sphere at one end with some very large circular ports. The sphere was attached to a long cylnder and at the tail end there were three angular swept back wings with a smaller sphere at the end of each wing, I was not able to get a nice clear image & tried to get several places to try to get a clearer image with their equipment. I contacted the Seattle Times via E-Mail to see if they might be interested in attempting to clear up the photo & possibly help identify it, with no response from them. Whenever I show this image to family & friends they think it is an other worldly object.I have not downloaded the digital image from my camera to this PC. If you are interested I could have a DVD burned & send it to you!"],"Source":"MUFON","Log Number":"US-04242008-0015","Region":"Washington","Country":"United States","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"02/29/2008 12:00 UTC","Weather Factors":"Unknown","Case Number":"10518"}