{"Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.934526,+-98.337482(10513)&iwloc=A&hl=en\"> mufon case (10513) map </A>","Date Submitted":"11/07/1978 08:00 UTC","divs":["Sighting DetailsI was stopped at a traffic light on a highway just west of Grand Island. The highway was in a rural area and it was late in the evening. I noticed that there were bright lights - maybe five of them - almost directly overhead at a height that was probably less than 100 feet. I hadn't noticed anything as I was driving north on the road before I came to the stoplight. I thought it might be a helicopter with lights attached along the landing apparatus (ski-shaped with slight curve at ends), but couldn't hear anything above the engine noise of my car (a VW bug), and I didn't see the outline of a helicopter, just the lights. Suddenly, the lights moved in unison very fast to the east (I was headed north), and then made a very sharp 90-degree turn to the north over a row of tall trees maybe a quarter mile away. The lights headed north and were quickly out of sight. I remember the date pretty well, as I had left the Chicago area early that day and was relieved that I wouldn't have to listen to any more campaign ads (it was election day). In any case, maybe someone else saw the lights. I've always thought it was pretty strange, that I didn't couldn't hear a helicopter that was directly overhead. The lights were stationary long enough for me to try to hear something over the engine noise. The subsequent speed and the 90-degree turn were surprising."],"Latitude":"40.934526","Region":"Nebraska","City":"Grand Island","trends":["There have been 9 other sightings in Grand Island","There were no other sightings in Grand Island on or around November 7th 1978"],"Log Number":"US-04242008-0010","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/10513.html.txt","/var/www/straped/mufon/mufon_json/10513.json","/var/www/straped/mufon/org/10513.html"],"Longitude":"-98.337482","Date of the Event":"11/07/1978 08:00 UTC","Disposition":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Other","Summary":"bright lights that were stationary overhead suddenly moved very fast, made 90-degree turn","Object Features":"Unknown","Case Number":"10513","Source":"MUFON","Weather Factors":"None"}