{"Region":"California","divs":["Sighting DetailsIt was just after new years countdown in Burbank, Ca. I was at my cousins home and we were celebrating in the back yard. After we rang in the new year, I noticed some people at the party (kids and adults) looking up in the sky very puzzled. I decided to take a look for myself at what was catching everyones attention. My first thought was, how cool fire crackers. That thought only lasted for about five seconds and I watched the 5 bright redish-orange stars float from very low maybe 100 feet from the ground to the sky a few hundred feet higher never burning out like a fire cracker would. The star like objects seemed to change color from a bright redish to greenish to blue and back to red again. They also seemed to be flying in formation as they rotated around each other and occasionally seemed to blink off and on. I know for certain what we saw in the sky on new years was not a fire cracker, because I have watched many fire cracker shows and no fire cracker can stay in the air for over 10 minutes with out burning out. As we all cheered the ufo's in the sky I couldn't help but feel very excited and frightened at the same time. I realized that what ever was in the sky could cause great harm if it wanted to. But it seemed as though it was trying to give us a sign more than anything else by the way it was rotating and forming different circular and triangular formations. The objects eventually seemed to disappear from the sky one by one until they were all gone. It was not clear if it was one single craft or individual crafts flying side by side. The only video we were able to catch was of one of the objects on my friends cell phone. It is not very clear, just looks like a star in the sky."],"Date of the Event":"01/01/2008 12:00 UTC","City":"Burbank","Object Flight Path":"Hovering then path","Summary":"The sighting was Minutes after new years count down. There were about 5 to 6 star-like objects.","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Disc, Fireball, Flash, Sphere, Star-like","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.182539,+-118.299636(10517)&iwloc=A&hl=en\"> mufon case (10517) map </A>","Tags":"City","Case Number":"10517","Log Number":"US-04242008-0014","Latitude":"34.182539","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10517.html.txt","/var/www/straped/mufon/mufon_json/10517.json","/var/www/straped/mufon/org/10517.html"],"Source":"MUFON","Longitude":"-118.299636","Weather Factors":"Unknown","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around January 1st 2008"],"Country":"United States","Date Submitted":"01/01/2008 12:00 UTC"}