{"Object Shape":"Circle","Summary":"Circular Light","Sighting Duration":"Undisclosed","Longitude":"-84.799938","trends":["There have been 9 other sightings in Cartersville","There were no other sightings in Cartersville on or around April 22nd 2008"],"Date of the Event":"04/22/2008 10:00 UTC","Latitude":"34.165097","Log Number":"US-04242008-0011","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/10514.html.txt","/var/www/straped/mufon/mufon_json/10514.json","/var/www/straped/mufon/org/10514.html"],"Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Disposition":"IFO","Weather Factors":"None","Date Submitted":"04/22/2008 10:00 UTC","divs":["sighting detailsi was taking my golf shoes back to my car after playing golf the evening of 4\\22\\2008 and was looking up at the stars when i noticed one star get brighter ( about 3 times its normal light ) so i thought it was just a flare or flicker and decided to watch it. the light got brighter and about 3 times larger than its original size, which i thought was strange and thought maybe it was a shooting star coming directly towards me. so i continued to watch and the light stayed motionless for about 4 seconds after getting larger and brighter, then started moving towards the west skyline at a slow pace. as the light traveled to the right it got dimmer until it was no longer visible. the light was not in our atmosphere and was definitely in space and traveled away from the earth and was not a flare, airplane, or shooting star. may have been nothing but too strange not to report.. especially with other reports of lights on 4\\21\\2008. i think preparation would be better then trying to sweep events like this under a rug. if we are not prepared for an encounter, then we are suceptible as a human race for survival."],"Case Number":"10514","Country":"United States","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=34.165097,+-84.799938(10514)&iwloc=A&hl=en\"> mufon case (10514) map </A>","Object Features":"Undisclosed","City":"Cartersville"}