{"Latitude":"33.831406","Country":"United States","Longitude":"-118.282016","Date of the Event":"04/18/2008 09:30 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:40:00","Region":"California","Object Features":"Undisclosed","divs":["Sighting DetailsComing home from buying a pack of cigaretts. Noticed large white stationary object in the night sky. At first glance I thought it was a blimp. After I parked my car, I decided to take a second look. It didn't move at all, and it definitely wasn,t a blimp or plane. I then called out to my wife and kids to come and look at the object. Approx. 1 to two minutes later we saw a small white object fall from the larger one. I then ran to get our small telescope, hoping to get a better view. When I came back, I noticed the smaller object was now stationary to the right of the larger object. I coudln't get a better view of the object with the telescope (just looked fuzzy through the lense), so I contined to watch it for about another 10 mins. My wife and kids had already gone back inside. I then went inside my home to go get my cellphone, hoping to take a picture of it. When I came out, both objects were gone. I'll tell you, I've never seen anything like that before. I was excited and slightly nervous at the same time."],"Object Flight Path":"Undisclosed","Disposition":"Unknown","Summary":"Large white oval shaped object with smaller white object(s) dropping from larger object","trends":["There have been 5 other sightings in Carson","There were no other sightings in Carson on or around April 18th 2008"],"City":"Carson","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=33.831406,+-118.282016(10528)&iwloc=A&hl=en\"> mufon case (10528) map </A>","Source":"MUFON","Date Submitted":"04/18/2008 09:30 UTC","Tags":"City","Case Number":"10528","Log Number":"US-04242008-0025","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10528.html.txt","/var/www/straped/mufon/mufon_json/10528.json","/var/www/straped/mufon/org/10528.html"]}