{"Tags":"City","Case Number":"10523","Object Shape":"Flash, Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsOn 2008-04-24, 21:55 h - 22:05 h, I was driving in my car on my way home from my Taekwondo training. When I was nearly at home, I suddenly realized some curious red flashing lights in the sky. The lights were \"pulsaring\" or flashing in red colour. The sky was quite cloudy, so the lights were disappearing some seconds and then reappeared. The lights stuck close together, like a triangle formed. I am not sure, but I think I saw a fourth red light for a few seconds. The lights were at relatively high speed. I think they were too fast for a helicopter. But it could also have been a fast plane. Their trajectory was to the west. After a minute or so the lights disappeared behind the clouds. I just heard the report of the new Phoenix Lights yesterday and I almost couldn't believe my eyes of what I saw. I was also a little bit afraid. I really can't believe that such things also happen in Germany. Unfortunately I had my cellphone in my backpack. But that was all so fast, I do not think that I would have had the chance to take some photos."],"trends":["There have been no other sightings in Witten","This sighting has never been favorited."],"Latitude":"51.443893","files":["/var/www/straped/mufon/html2text/10523.html.txt","/var/www/straped/mufon/mufon_json/10523.json","/var/www/straped/mufon/org/10523.html"],"Object Features":"Undisclosed","Date Submitted":"04/24/2008 10:05 UTC","Longitude":"7.353197","Log Number":"DE-04242008-0020","Country":"Germany","Object Flight Path":"Undisclosed","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=51.443893,+7.353197(10523)&iwloc=A&hl=en\"> mufon case (10523) map </A>","City":"Witten","Region":"Nordrhein-Westfalen","Summary":"Red light flashing, fast moving triangle of lights","Date of the Event":"04/24/2008 10:05 UTC"}