{"Object Shape":"Star-like","Log Number":"US-04242008-0026","Country":"United States","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around April 23rd 2008"],"Latitude":"32.229993","Object Flight Path":"Straight-line path","Region":"Arizona","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.229993,+-110.924639(10529)&iwloc=A&hl=en\"> mufon case (10529) map </A>","Date Submitted":"04/23/2008 08:30 UTC","Case Number":"10529","Object Features":"Unknown","Date of the Event":"04/23/2008 08:30 UTC","files":["/var/www/straped/mufon/html2text/10529.html.txt","/var/www/straped/mufon/mufon_json/10529.json","/var/www/straped/mufon/org/10529.html"],"Sighting Duration":"00:20:00","Longitude":"-110.924639","divs":["Sighting DetailsI was sitting on my patio at my apartment on the SE side of Tucson relaxing. My patio faces towards the south. Something caught my eye and I looked up to the sky to see an object that kind of looked like a satelite moving across the sky from the north to the south. I thought it seemed like a bright star. I watched it for about 10 or 15 seconds and then it just blinked out and disappeared. I watched the area for a few minutes to see if it would come back on, but it didn't. There weren't any flashing lights, or sounds. I continued to sit on my patio, and about 15 minutes later, I saw what looked like a similar star type object flying from the south towards the north, only this one was further to the west. It was going in a straight line, and getting closer. As it was getting to be closer to being over head, it blinked out like before. It just disappeared and there was no sign of it. Again there were no flashing lights, no sound, just a star-like object. I thought it was strange that if it were a plane that its lights would just turn off like that. So, I don't know what I saw, I've never seen a satelite blink out, and they don't look as bright as this object did."],"Viewing Distance":"Unknown","Tags":"City","Weather Factors":"None","City":"Tucson","Summary":"The object went throught the sky north to south and blinked out, later object flew south to north then blinked out.","Source":"MUFON"}