{"map":"<A HREF = \"http://maps.google.com/maps?q=27.196163,+-82.490375(10525)&iwloc=A&hl=en\"> mufon case (10525) map </A>","Disposition":"Insufficient Data","Summary":"driving n/b on rte 41 in osprey in my convert. corvette. clear night,full moon.","Longitude":"-82.490375","Object Flight Path":"Stationary","trends":["There has been one other sighting in Osprey","There were no other sightings in Osprey on or around May 15th 2007"],"Case Number":"10525","Log Number":"US-04242008-0022","Date of the Event":"05/15/2007 12:00 UTC","City":"Osprey","files":["/var/www/straped/mufon/html2text/10525.html.txt","/var/www/straped/mufon/mufon_json/10525.json","/var/www/straped/mufon/org/10525.html"],"Latitude":"27.196163","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Object Features":"None","Object Shape":"Disc, Flash","divs":["sighting detailsi was driving my corvette n\\b on rte 41, in osprey fl.i was coming home from the beach.i enjoy going to this beach in venice fl. called casperson beach.i enjoy looking at tha stars, and moon at this beach because there is no lights,to stop you from star gazing. on the way home i was traveling on rte 41 in osprey fl. n\\b.there were a few clouds towards the horizon. suddenly i saw a flash to the right side of the full moon, an image appeared to be silver grey i and was illuminated by the moon.it was only visable for a few seconds and left its impression in my mind. it was 2am, i was straight, no drinking, no drugs.i thought about what i saw all the way home. when i got home i drew a picture of what i saw. i thought about it for awhile, and realized what i saw was only the left side of the craft, illuminated by the full moon. when i added the other half to the picture, it looked like a pile of donuts on top of each other, may be 3. the bottom one was large, the next one on top of it was a little smaller, and the third one on top a little smaller, looked like a saucer silver grey no lights, stationary.i called nasa to tell them what i had observed, they tried to tell me it was lightning, i told them i am 60 years old and no what lightning looks like. they told me i should be one of the lucky ones who saw something like that."],"Region":"Florida","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"05/15/2007 12:00 UTC"}