{"Date of the Event":"04/17/2008 05:30 UTC","Longitude":"-76.602829","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"None","Source":"MUFON","Date Submitted":"04/17/2008 05:30 UTC","files":["/var/www/straped/mufon/html2text/10524.html.txt","/var/www/straped/mufon/more/10524_submitter_file1__Object001.jpg","/var/www/straped/mufon/mufon_json/10524.json","/var/www/straped/mufon/org/10524.html"],"divs":["Sighting DetailsLat 38.9956280 Long 76.3783260 5:30 PM Eastern Time - Sunny with no clouds. Sitting on back patio happened to glance up and noticed a matte silver colored sphere with what appeared to be a wide \"belt\" around the center of the sphere. The entire sphere had a matte silver coloration. Wings - solid black - half crescent shaped with points curving back in towards the sphere. Moving from SE to NW. This object was moving against a clear blue sky with no size reference point nearby so it would be hard for me to judge how high and what size this thing was. It moved in an arrow straight line at a pretty good pace. Not \"lightning speed\" however. At first thought it was a bird gliding on an air current with the sun reflecting but this object had no \"head\", was moving at a pretty good clip and there was no motion in what would have been a wing if this were a bird. Moved so fast that I could only observe for a few seconds. No sound. Flew behind the roof of my house - lost sight of it."],"Object Features":"Wings","Log Number":"US-04242008-0021","Sighting Duration":"Undisclosed","City":"Baltimore","Region":"Maryland","Latitude":"39.293165","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.293165,+-76.602829(10524)&iwloc=A&hl=en\"> mufon case (10524) map </A>","trends":["There have been 65 other sightings in Baltimore","There were 2 other sightings in Baltimore on or around April 17th 2008","This sighting has never been favorited.",""],"Summary":"Matte silver sphere crescent shaped black wings","Country":"United States","Case Number":"10524","Object Shape":"Sphere"}