{"Date of the Event":"04/24/2008 11:53 UTC","files":["/var/www/straped/mufon/html2text/10520.html.txt","/var/www/straped/mufon/mufon_json/10520.json","/var/www/straped/mufon/org/10520.html"],"Object Flight Path":"Hovering then path","Region":"Arizona","Disposition":"Unknown","divs":["Sighting DetailsI stepped outside briefly for a quick cigarette and was listening to a bird on top of one of the light poles in our parking lot at work near Tucson International Airport. I looked up to identify the bird and noticed a stationary round object pretty high in altitude. I pointed it out to a another employee who was outside. The object was toward the west from our building near Drexel and Tucson Blvd. It appeared to be pretty high in altitude. It was difficult to determine the actual shape of the object but it was brownish-red in color. We observed this for several minutes. For approximately 30 seconds a second object appeared to the lower right of the first. This second object was white in color and round in shape. It seemed to be emanating or reflecting light as opposed to being a white colored object but was difficult to determine due to it's altitude. The second appeared to pace the first at the same slow rate of speed and then disappeared after 30 seconds of duration. At that point neither object was visible. I wouldn't have thought anything of the incident but after reports of the reappearence of the \"Phoenix Lights\" on April 21st I thought this was interesting enough to report."],"Tags":"City","Longitude":"-110.925429","Weather Factors":"None","Object Features":"Unknown","Date Submitted":"04/24/2008 11:53 UTC","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around April 24th 2008"],"Source":"MUFON","Latitude":"32.227643","Log Number":"US-04242008-0017","City":"Tucson","map":"<A HREF = \"http://maps.google.com/maps?q=32.227643,+-110.925429(10520)&iwloc=A&hl=en\"> mufon case (10520) map </A>","Object Shape":"Circle, Disc, Sphere, Star-like","Viewing Distance":"Over One Mile","Country":"United States","Case Number":"10520","Sighting Duration":"Undisclosed","Summary":"Viewd a slow moving round shape somewhat high in altitude."}