{"Case Number":"10538","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-98.678948","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10538.html.txt","/var/www/straped/mufon/mufon_json/10538.json","/var/www/straped/mufon/org/10538.html"],"Latitude":"32.469852","Viewing Distance":"Over One Mile","trends":["There have been 4 other sightings in Ranger","There were no other sightings in Ranger on or around November 30th 2002"],"Object Features":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsOur adult son and I were driving west on I 20 between Weatherford and Ranger, TX last Tuesday, April 22, 2008 a little after 10pm. He was following me in a second vehicle. My radio was on 57 AM (KLIF). Suddenly straight above and to my right(high in the sky) a HUGE glowing beautiful green globe came straight down (like a fall)then leveled off going straight above the highway and arcing off to the left or south of the interstate in the direction of where I guess Stephenville,TX would be. The whole thing was green but the tail part seemed to shorten when it leveled off. My son called me on my cell phone to verify thet I had seen the same glowing green light. We continued our drive to Abilene, TX. The next day we had horrible storms in several areas of Texas. Thursday's 10 PM Abilene news showed footage of other sightings similar to what we'd seen, but listed the times around 3 AM. That thing was huge and very high in the sky so I know many people had to see it. The size, brightness and color made me think that this was not an ordinary meteor or asteroid but maybe something made of metal. There was no sound that we noticed associated with this sighting."],"Summary":"Huge blazing luminous green ball streaks across night sky","Region":"Texas","Object Shape":"Bullet, Missile","Date Submitted":"11/30/0002 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.469852,+-98.678948(10538)&iwloc=A&hl=en\"> mufon case (10538) map </A>","Country":"United States","City":"Ranger","Date of the Event":"11/30/2002 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-04252008-0009"}