{"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/10531.html.txt","/var/www/straped/mufon/more/10531_submitter_file1__IMG_100607.jpg","/var/www/straped/mufon/more/10531_submitter_file2__Rod.jpg","/var/www/straped/mufon/more/10531_submitter_file3__photo3.jpg","/var/www/straped/mufon/mufon_json/10531.json","/var/www/straped/mufon/org/10531.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.429814,+-104.221718(10531)&iwloc=A&hl=en\"> mufon case (10531) map </A>","Case Number":"10531","Weather Factors":"Unknown","City":"Carlsbad","Source":"MUFON","Object Shape":"Bullet, Missile, Cone, Sphere","Disposition":"Unknown","Object Features":"Undisclosed","Sighting Duration":"00:00:00","divs":["Sighting Details This photograph was taken on October 6, 2007 at 19:26:30 I was on a hill in southeast New Mexico. My reason for being on the hill...I thought it would be fun to take photos of the lights of town at night. My camera is a 6.3 mpeg Canon EOS 10D. I took a few test photos, looked at them in the camera's monitor. Everything seemed to be just great. I had the camera mounted on a tripod and I was using a shutter release. The sun had gone down but the clouds in the east still had some residual light on them, just perfect for great photos. My location was 385 miles due west of Stephenvill, Texas. I took about 6 photos and started getting the feeling that I was being watched. I ignored the feeling and kept taking photos. I took 29 pixs in all then the feeling of danger, or something I can't explain was so great that I packed everything up, put it in the back of the pick up sat down in the drivers seat and locked the doors. I was going to tell my wife about my weird feeling, but there was no need. I could tell by the look on her face that she had had the same experience. The only thing different was...she never got out of the pick-up. When I looked at the pix on the computer they were all under exposed and nearly totally black. This photo has been lightened in Adobe PS and enhanced for clarity only. The bullet- missile object on the left of the photo has been considerably enlarged (see photo 2). This is only one photo of several that I took on Oct. 06, 2007. I have returned to take more photos, I have not taken anything like this or the other photos. And everything that I have taken since has been correctly exposed. Photo 3(The orange object) has been cropped from another photo that I took on the same night of 10-06-2007."],"Region":"New Mexico","Latitude":"32.429814","Log Number":"US-04252008-0002","Longitude":"-104.221718","Viewing Distance":"Unknown","Tags":"City","Country":"United States","Date of the Event":"10/06/2007 07:26 UTC","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around October 6th 2007","This sighting has never been favorited.",""],"Summary":"I thought my camera had something wrong with it until I lightned my photographs and saw what was hidden in them","Date Submitted":"10/06/2007 07:26 UTC"}