{"City":"Trinity Center","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/10539.html.txt","/var/www/straped/mufon/more/10539_submitter_file1__MVC-001.jpg","/var/www/straped/mufon/more/10539_submitter_file2__AFG-060411-002.jpg","/var/www/straped/mufon/more/10539_submitter_file3__1246201.jpg","/var/www/straped/mufon/org/10539.html"],"Object Features":"Undisclosed","Country":"United States","Summary":"Black Military Aircraft","Tags":"City","Viewing Distance":"Unknown","trends":["There have been no other sightings in Trinity Center","This sighting has been favorited 2 times."],"Object Shape":"Triangle","divs":["Sighting DetailsI was fishing on Lake Trinity and I heard the sound of an aircraft engine. It was a very low frequency sound, but I felt it more than I could actually hear it. I only had an older Sony digital camera with me, the batteries were almost dead, I snapped 4 pictures before the camera shut off, only one came out when I read the disk. I observed the aircraft until it vanished. It flew straight and level, I was unable to guage its size since I had no reference. But a best guess, since I have seen airliners fly over a couple of times early in the morning, I would say it was as big as a medium sized airliner, probably the size of the space shuttle. I know aircraft well, this did not look like anything I have seen out at Nellis. It was very quiet, when an airliner flies over this lake, I hear it long before I can see it. This thing was already overhead when I heard it. It was flying southeast, as if it was on course to Las Vegas. One thing that was strange, just before I heard it, or felt it, I had a funny feeling that something was watching me, so I scanned the shorline thinking there was something watching me, then my exposed skin warmed up fast and only for 15 seconds as if I was hit with a microwave beam. Almost enough to make me want to jump in the water. Then I felt it and saw the exhaust trail and grabbed the camera cause it was a single contrail, larger than any airliner. The one shot that came out was at the cameras highest zoom, it is a 10X optical zoom. I was really reluctant of reporting this, the course it was on, well it flew over the most heaviest forested, least populated part of Northern California. This thing left me with such a strange feeling that I packed up and sped home asap. I was scheduled to be on the lake through the weekend. Now I don't think this thing is alien, but it is a UFO because I don't know what the hell it is."],"Date Submitted":"04/24/2008 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Region":"California","Longitude":"-122.699744","map":"<A HREF = \"http://maps.google.com/maps?q=40.983201,+-122.699744(10539)&iwloc=A&hl=en\"> mufon case (10539) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-04252008-0010","Date of the Event":"04/24/2008 12:00 UTC","Case Number":"10539","Latitude":"40.983201"}