{"Weather Factors":"Unknown","City":"Glendale","Log Number":"US-04252008-0003","Country":"United States","Date of the Event":"04/21/2008 08:00 UTC","Date Submitted":"04/21/2008 08:00 UTC","Summary":"Phoenix Lights/4 of them/on public TeeVee","Region":"Arizona","Object Features":"Undisclosed","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around April 21st 2008"],"Longitude":"-112.149821","Case Number":"10532","Disposition":"Unknown","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.69594,+-112.149821(10532)&iwloc=A&hl=en\"> mufon case (10532) map </A>","Tags":"City","divs":["sighting details hello there, i live in phoenix, i saw the lights. you were on c2c and ask for more info on the lights. if one gets a map out of phoenix, az, i will tell you the path of the lights. look for deer valley road, it is in the north of phoenix. the lights started in around the luke air force base area by the 101 west. then they moved east along the deer valley road area, about, to scottsdale and to the superstition mountains. that is about 100 miles of travel within 20 minutes, changing to complex patterns several times and one lights would disappear up and leave for several minutes; then come back and lights would change patterns again. what was the weather at that time? south 6.9 mph \\ 11.1 km\\h \\ 3.1 m\\s - see this sight for past weather at about that time. http:\\\\www.wunderground.com\\history\\airport\\kgeu\\2008\\4\\21\\dailyhistory.html?req_city=na&req_state=na&req_state name=na&mr=1 how can balloons travel east to west in hundred miles in 20 minutes, when the wind was going north to south at 7 mph with wind gust at 9 mph? weather is recorded at this time as there was a ball game at this time. you should ask me about the lights in '97 and the calls i got from dr. james coleman and mr. mitch dossett, advanced concepts review group dia, ddr&e, dod laboratories, asd\\c31, u&s commands, usda&t and joint staff & defense acquisition board commands. also dr. n. tesla and the work i did for them. thank you, randy ladnar984@aol.com"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"33.69594","Object Shape":"Circle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10532.html.txt","/var/www/straped/mufon/mufon_json/10532.json","/var/www/straped/mufon/org/10532.html"]}