{"Region":"Texas","Sighting Duration":"Undisclosed","Object Shape":"Circle","divs":["Sighting DetailsEarly one morning before sunrise in the late 60s or early 70s, my friend and I were pulling a boat toward a launch spot on Sam Rayburn reservoir in east Texas near a small town named Zavalla. He was driving and I was in the passenger seat of his El Camino. The road was long and straight and I was remarking about the incredible brightness of the star on the low horizon ahead. Soon I realized that what we were seeing was certainly not a star, but was an incredibly fast approachiong object. I immediately told my friend to stop the car. We both got out and stood beside the car as the objects passed over us at an incredible rate of speed at an estimated altitude of 1000 to 3000 feet. Certainly low enough to get a totally unobstructed view. What we saw was one large spherical glowing object with a pronounced fiery tail, plus three smaller spherical glowing objects, sans tails, that were flying in a triangular formation beside the larger spherical object. They were flying TOTALLY SILENT. My friend looked at me with this shocked look on his face and asked, \"what in the hell was that?\" I responded truthfully that I was as shocked as he was. We both agreed that due to the incredible unearthly experience that we just had, that we would not tell any of our coworkers, lest they would think perhaps we were fabricating stories. We continued to our launch sight just a mile or so down the road and encountered several other fishermen who were just as perplexed as we were with what had just transpired. The next morning as I was reading the local newspaper, the Beaumont Enterprise, lo and behold on the front page of the paper was a report of the same ufo sighting by thousands of people across the southern US. At least I hadn't been dreaming."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.162204,+-94.423552(10545)&iwloc=A&hl=en\"> mufon case (10545) map </A>","City":"Zavalla","Case Number":"10545","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"11/30/1969 12:00 UTC","Latitude":"31.162204","Longitude":"-94.423552","files":["/var/www/straped/mufon/html2text/10545.html.txt","/var/www/straped/mufon/mufon_json/10545.json","/var/www/straped/mufon/org/10545.html"],"Log Number":"US-04252008-0016","Object Features":"Unknown","trends":["There has been one other sighting in Zavalla","There were no other sightings in Zavalla on or around November 30th 1969"],"Disposition":"Unknown","Country":"United States","Date of the Event":"11/30/1969 12:00 UTC","Weather Factors":"Unknown","Summary":"low passover of 4 distinct flying objects","Object Flight Path":"Straight-line path"}