{"files":["/var/www/straped/mufon/html2text/10548.html.txt","/var/www/straped/mufon/mufon_json/10548.json","/var/www/straped/mufon/org/10548.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"United States","Case Number":"10548","Source":"MUFON","trends":["There have been no other sightings in Auburn","This sighting has never been favorited."],"City":"Auburn","divs":["Sighting DetailsI was driving on US 10 from midland, mi to bay city, mi. I leave my girl friends house at 10:30 pm and I arrive at work a little before 11pm every night Tues-Sat. This was the night of Friday April 18th 2008 between the time frame of 10:30pm and 11:00pm. I was on US-10 past Aurburn, MI but before the M-84 exit to go to my place of work in Bay City, MI. I saw out of the driver side window over an open field what I thought was a plane with is landing lights on. There is an airport close to the area. MBS International Airport (Midland, Bay City, Saginaw International Airport). I saw the craft which never got more than (best I can tell) 100-150ft off from the ground. When I first saw the craft it was turning right toward the highway with 3 very bright lights lighting the air in front of the craft it was so bright I could see the beams distinctly for a good distant in front of it. As it turned the lights became not as bright and the craft actually flew right over my car or as I was on the high was going 70 mph it would be fair to say I drove under it. The craft was not moving very fast and I was able to watch it for some time as I drove away. When I got behind it I could only see the two back lights of the craft and I could see it was very thin. I was looking for every sign I could to prove it was a plane. I am no expert but, I was looking to make out wings and a tail on the craft. I know for certain there was no tail and it was to the best of my eye sight (which i do not where any prescription contacts or glasses) a solid triangular object. I was in awe and I foolishly did not turn off my radio nor roll my window down to listen for any sound that may or may not have been coming from this craft. I was very excited just to see something like this. I was not completely convinced at what I had saw and I did not tell anyone because most would think since I have been doing so much research into the subject I just saw what I wanted too. That all changed the next night at work when a friend of mine came to see me. We were just catching up a bit when he started to tell me a story of what he tried to take a picture of with his cell phone before he could describe it I interrupted him and described what he saw for him. To his amazement I was dead on to what he was going to say. He saw what I think to be the same craft as I did the night but after. His sighting happened closer to midland, mi. He was coming over the over pass on US 10 which over laps Eastman rd in midland, mi. The best time he could give me was between 10pm and 11pm. There is also an airport in the Midland, MI. It is very small and it is not for commercial aircraft. The picture he took unfortunately showed nothing."],"Region":"Michigan","Disposition":"Insufficient Data","Longitude":"-84.069705","Object Shape":"Triangle","Tags":"City","Log Number":"US-04262008-0002","map":"<A HREF = \"http://maps.google.com/maps?q=43.603358,+-84.069705(10548)&iwloc=A&hl=en\"> mufon case (10548) map </A>","Viewing Distance":"101-500 Feet","Latitude":"43.603358","Date of the Event":"04/18/2008 10:45 UTC","Summary":"Triangular shaped craft with 3 lights on on corner with a red light in the center","Object Flight Path":"Path with directional change","Date Submitted":"04/18/2008 10:45 UTC","Sighting Duration":"Undisclosed"}