{"Longitude":"145.214861","Object Features":"Other","Disposition":"Unresolved","Date Submitted":"04/26/2008 04:30 UTC","Log Number":"AU-04262008-0003","Weather Factors":"Unknown","divs":["sighting detailsi was at a friends house last night (26, april, 2008), at about roughly 4:00am i decided to go outside in his backyard for a cigarette, my friend came out with me also. as we were having a chat we noticed a bright green flash like thunder without the noise just above some clouds (very thin cloud cover) to the north of us. we thought that was strange but quickly got over it and went back inside. about a half an hour later (4:30am) i went outside to his backyard alone for a cigarette, as im standing there just looking around i noticed what looked like a plane flying low to the ground (a bit above the tree tops) it had strangely bright white and red flashing lights which were constantly blinking at a fast rate and did not make a single sound, i didn't really get to see a shape or anything as it was dark. but it was a rather large aircraft. it came from the west (dandenong) and travelled towards the east (doveton-narre warren area) it was moving at a rather slow pace, 10 minutes must have gone past before i called my friend out to have a look, he came out then quickly ran inside to get the binoculars. he had a look and told me to quickly look as it started to pick up abit of a pace. when i looked through the binoculars i saw what appeared to be two sets of lights arranged in a triangular pattern at a bit of a distance from one another, the lights were coloured orange\\red and were flickering. i also saw a faint dark outline of the craft while looking through the binoculars, it was long and somewhat narrow with a thicker middle area. it picked up abit of speed then i lost sight of it as it moved behind some trees. i was curious of this object after seeing the intense bright flashing colours, then i was stunned and somewhat shocked after seeing it through the binoculars. my impression is that this thing was not a manmade craft, the way it moved and looked just had this otherworldly vibe to it. this happened in victoria, australia over the suburb of dandenong."],"Tags":"City","Latitude":"-37.98746","City":"Dandenong","Source":"MUFON","trends":["There have been no other sightings in Dandenong","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Object Shape":"Cigar, Flash, Triangle","Country":"Australia","Date of the Event":"04/26/2008 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-37.98746,+145.214861(10549)&iwloc=A&hl=en\"> mufon case (10549) map </A>","Region":"Victoria","Case Number":"10549","Summary":"Flashing white and red long craft with two sets of lights arranged in triangular pattern over Dandenong, VIC, Australia.","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/10549.html.txt","/var/www/straped/mufon/more/10549_submitter_file1__uf.jpg","/var/www/straped/mufon/mufon_json/10549.json","/var/www/straped/mufon/org/10549.html"],"Viewing Distance":"501 Feet - 1 Mile"}