{"trends":["There have been no other sightings in Fort Smith, AR","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path","Longitude":"-94.562443","Summary":"It was a v-shape, had a very low hum, 15 lights all together, but 5 main lights,shot off into 5 seperate peices","Sighting Duration":"Undisclosed","City":"Fort Smith, AR","Weather Factors":"None, Does Not Apply","Country":"United States","Object Features":"Unknown","Object Shape":"Boomerang, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.304694,+-94.562443(10541)&iwloc=A&hl=en\"> mufon case (10541) map </A>","Source":"MUFON","divs":["Sighting Details I was 11, and it was summer time in Pocola, Oklahoma. My friend Brittany and I were in the back of my dads truck, inside of a tent we made out of a sheet and a broom stick. We would come out every now and then when it would get too hot inside the tent. I was the first one to come out, and I turned around facing my house, and the field that was behind my house. I saw this big v-shaped object with 15 lights on it, and it was low. I was startled by it, so I couldnt yell for Brittney...I couldnt get my voice above a whisper...and I told her \"come out quick...hurry hurry...come look\" and she crawled out of the tent and saw it. We stood on the back of my dads truck watching this thing. It didnt really make much of a sound, but we could feel our chest vibrating, and barely hear a low humming. It was way to quiet to be a helicopter, and it was just hovering there. Then to top it all off, it made this weird noise...kind of a mechanical sound I guess...I dont know how to compare it. It separated, and a piece of this thing shot off in every direction...like north, south, east, west, and one went straight up. It happened so fast. One of the pieces went right over our heads, and we could hear the air rushing around it, but the object itself made absolutely no sound. When we turned around NOTHING was there....If we had blinked when all this was happening we would have missed the whole thing. We turned as fast as we could to see where this thing went, but it was too quick. The pieces that shot off had 3 lights a piece. I have never been able to explain this, and havent really talked about it to anyone other than family. Right after it happened, Brittany and I ran inside, and started yelling to my mom and dad about what we had seen. I was shaking like a leaf...we KNEW we had just seen a UFO, and that it couldnt have been anything man made. My mom called the airport, and they said they had nothing on their radar, and no other reports of this thing. They suggested that it might have been helicopters, but had no reports of any air craft is the area at the time we reported this. I've been searching websites, UFO shows, eye witness accounts, everything I can, but so far nothing. I have so many questions, and thoughts, and it would be so refreshing to know that someone somewhere saw what it was that we saw. I've been searching for 10 years now."],"Tags":"City","Region":"Oklahoma","Date of the Event":"06/01/1997 08:00 UTC","Case Number":"10541","files":["/var/www/straped/mufon/html2text/10541.html.txt","/var/www/straped/mufon/mufon_json/10541.json","/var/www/straped/mufon/org/10541.html"],"Latitude":"35.304694","Disposition":"Unknown","Log Number":"US-04252008-0012","Date Submitted":"06/01/1997 08:00 UTC","Viewing Distance":"101-500 Feet"}