{"Date Submitted":"04/20/2008 12:00 UTC","Region":"Indiana","divs":["Sighting Detailsok. im on my way home from working a 13 hour day. driving south on coldwater rd in fort wayne. as i cross the bridge that crosses i 69. i was looking at spot lights coming from pieres (a dance club) i noticed a object in the sky that i can not explian, at first i tryed to explain it to myself that it was kids letting a ballon go,and had attached something to it that made it glow orange, as i pull up to light at st joe and coldwater rd. and watched the object while i was stopped @ the red light. it moved sporatecly and did not seem to get any smaller or any less bright,. it looked like it would stop on a dime and then move fast then change directions. as the stop light turned green i tryed to keep my eyes on the object while trying not to wreck my car. i kept my eyes bouncing back up to the dark sky hoping to understand what i was seeing. i watched the object for another few moments . i looked back at the road,then looked up and it was gone???? i pulled off st joe and hoped out of my car. and looked long and hard up into the night sky hopeing to see something that would help explain what i seen, i was confused, and excited..."],"files":["/var/www/straped/mufon/html2text/10547.html.txt","/var/www/straped/mufon/mufon_json/10547.json","/var/www/straped/mufon/org/10547.html"],"Latitude":"41.088273","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"00:06:00","Object Shape":"Fireball, Sphere, Unknown","Log Number":"US-04262008-0001","Summary":"glowing ballon! hard to explain","City":"Fort Wayne","Disposition":"Unknown","Object Features":"None","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around April 20th 2008","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.088273,+-85.133081(10547)&iwloc=A&hl=en\"> mufon case (10547) map </A>","Tags":"City","Date of the Event":"04/20/2008 12:00 UTC","Weather Factors":"Does Not Apply","Country":"United States","Case Number":"10547","Longitude":"-85.133081","Source":"MUFON"}