{"Case Number":"10561","Tags":"City","Date of the Event":"04/26/2008 09:21 UTC","Object Flight Path":"Path with directional change","City":"Charleston","Date Submitted":"04/26/2008 09:21 UTC","Latitude":"32.785866","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around April 26th 2008"],"divs":["Sighting Details I was working inside of a newly purchased house. It got to be about 9 oclock and my brother was ready to head back to his home. I walked him outside and we were standing around talking before he left. It was myself(32), my brother(28), my stepson(5),and two nephews(18)(10). After about 10 minutes my step son asked, \"what is that?\" We all looked up and there it was. At first it looked like two crystal clear bright white lights but it kind of turned to the right a little and you could see it was a shiny tube shape connecting the two lights. What ever it was was totally silent, id estimate about 30' to 50' feet long, and maybe 10' wide. It flew over the house maybe 3 to 5 hundered feet high, and wasnt moving that fast. We were all watching it and after it flew past it must have speeded up or cut the lights off, because it was tottaly out of sight. We were all freakin out about it so I grabbed somepaper and myself, my brother , and my nephew all sketched a quick drawing separtly to see if they matched. We did this because we couldnt believe what we just seen. All three drawings were very close to matching. I dont know what it was but it wasn't an airplane, helicopter, baloon, or meteors. It was no question flighing and had no wings. The one thing that I will never forget is how clean the light was, I mean it was almost like a white object glowing under a black light."],"Sighting Duration":"00:00:10","Region":"South Carolina","files":["/var/www/straped/mufon/html2text/10561.html.txt","/var/www/straped/mufon/mufon_json/10561.json","/var/www/straped/mufon/org/10561.html"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04262008-0015","Object Shape":"Cigar, Cylinder","Country":"United States","Summary":"Something flew overhead with two bright lights at each end of a cigar shaped object","Source":"MUFON","Weather Factors":"None","Object Features":"Other","Longitude":"-79.922492","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.785866,+-79.922492(10561)&iwloc=A&hl=en\"> mufon case (10561) map </A>"}