{"map":"<A HREF = \"http://maps.google.com/maps?q=35.152424,+-90.04008(10560)&iwloc=A&hl=en\"> mufon case (10560) map </A>","Region":"Tennessee","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Shape":"Boomerang, Unknown","Country":"United States","Object Features":"Unknown","Summary":"three bright pulsating amber lights in formation ascending in the north to travel towards the south at approx. 200-500mph","Tags":"City","Date Submitted":"04/23/2008 11:00 UTC","Case Number":"10560","City":"Memphis","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10560.html.txt","/var/www/straped/mufon/mufon_json/10560.json","/var/www/straped/mufon/org/10560.html"],"Log Number":"US-04262008-0014","Date of the Event":"04/23/2008 11:00 UTC","Latitude":"35.152424","Longitude":"-90.04008","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unknown","Weather Factors":"None","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around April 23rd 2008"],"Source":"MUFON","divs":["sighting detailsthe evening of april 23, 2008 i was out walking my dog when suddenly appeared three star-like amber lights over the horizon facing north. each light was in some type of formation and they slowly ascended then increased speed. i watched this for over thirty minutes. the first light quickly approached the south in which i was positioned and flew directly overhead. i could make out now 1 red and 2 white blinking lights with a \"v\" shaped body and sounded like a low hum. each of the three \"crafts\\lights\" flew in the same heading totally identical in description. what was so unusual about this incident was the fact that i live in residential neighborhood, and air traffic never travels from north to south that late at night. also, they were travelling way to low to the ground to be typical commercial airliners. after that, i lost sight of them. while this was happening, i had an eerie feeling come over me like i was being threatened or something. it's like those lights were intentionally meant for me. i wasn't really afraid, i just wanted to know what the hell they were. my neighbor and i both witnessed these strange lights."]}