{"files":["/var/www/straped/mufon/html2text/10563.html.txt","/var/www/straped/mufon/mufon_json/10563.json","/var/www/straped/mufon/org/10563.html"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-04272008-0001","Source":"MUFON","trends":["There has been one other sighting in Belle Plaine","There were no other sightings in Belle Plaine on or around January 9th 2008"],"Date Submitted":"01/09/2008 12:00 UTC","Latitude":"44.616508","City":"Belle Plaine","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Region":"Minnesota","Longitude":"-93.769402","Object Shape":"Circle, Egg","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.616508,+-93.769402(10563)&iwloc=A&hl=en\"> mufon case (10563) map </A>","Weather Factors":"Unknown","Date of the Event":"01/09/2008 12:00 UTC","Tags":"City","divs":["sighting detailssetting: sunny clear day. minimal cloud coverage home: sits on hill overlooking a river valley. no obstructions, great vies. time: 3:00 - 4:00pm? date: sitting at our kitchen table were my 4 nephews. ages 14, 12, 11, 8? when one says \"hey what is that out the window?\", \"wait, its now gone\". about 5minutes later he said it again, \"hey check that out, what is that?\". we all looked out the window and in broad daylight there it was, something i or any of us have never seen. a silver (keg shaped) object hovering motionless 3\\4 up from the horizon. we all scrambled away from the table and out onto the deck. lots of confusion and questions from the kids saying, \"uncle,xxx what is that?\". we watched the object for about two minutes. i went in to grab my 12x optical zoom cam-corder and when i came out and got it ready to shoot the object just disappeared. it literaly just vanished. this object was seen by 5 people and all recollect the account and visual the same. we were all confused by what we had seen and i was in complete astonishment. i've watched the ufo type shows and always felt it possible, but after witnessing a ufo first hand, i'm no longer a skeptic. it boggles my mind to understand this and image has been burned into my mind forever."],"Summary":"Hovering Round UFO sighted near Belle Plaine, MN during day.","Case Number":"10563"}