{"divs":["Sighting DetailsI live in Cortlandt Manor, NY in a condo complex. The location is about 5 minutes from Putnam Valley by car, and I recently found out, about 10 minutes by car from the double stone chamber on Lake Oscawana Rd. In the summer of 1989, I went out to walk my dog at night. It was between 10-11PM. As I stepped outside of my door I saw this huge craft in the sky, flying low just above the treetops. It was lit up across the bottom perimeter (white lights), practically soundless..a low hum. It was too dark to make out its actual shape, accept that the lights were going around the front. I looked to my left and right, and there were 6 of my neighbors watching it too. We stood there fascinated until it passed over and was out of our sight. It must have taken about 15 minutes. After talking to my neighbors right afterwards, I don't recall anyone mentioning that they were afraid. When I went into my home, I tried the police station and the line was continuously busy. I decided to not follow-up the following day. My youngest son wasn't born at the time, and when he was 7 years old he came home from playing with my next door neighbor's son. He asked my why I never told him that I saw a UFO, because his friend's dad told his friend about it. I must add, my neighbors no longer live here and I have no idea where they are now."],"Longitude":"-74.003593","Disposition":"Unresolved","Tags":"City","Object Flight Path":"Undisclosed","City":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 30th 1988"],"Weather Factors":"Unknown","Source":"MUFON","Case Number":"10569","Date Submitted":"11/30/1988 12:00 UTC","Log Number":"US-04272008-0007","Date of the Event":"11/30/1988 12:00 UTC","Country":"United States","Object Shape":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.722113","files":["/var/www/straped/mufon/html2text/10569.html.txt","/var/www/straped/mufon/mufon_json/10569.json","/var/www/straped/mufon/org/10569.html"],"Summary":"I live in the lower Hudson Valley of NY, and in the summer of 1989, I sighted a huge UFO. I saw it with neighbors.","map":"<A HREF = \"http://maps.google.com/maps?q=40.722113,+-74.003593(10569)&iwloc=A&hl=en\"> mufon case (10569) map </A>","Object Features":"Undisclosed","Region":"New York"}