{"map":"<A HREF = \"http://maps.google.com/maps?q=40.793395,+-77.860001(10568)&iwloc=A&hl=en\"> mufon case (10568) map </A>","Object Shape":"Triangle","Tags":"City","Summary":"Several white spheres in triangle formation moving inside rain clouds","Log Number":"US-04272008-0006","Case Number":"10568","City":"State College","Longitude":"-77.860001","trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around April 26th 2008"],"Region":"Pennsylvania","Date Submitted":"04/26/2008 11:10 UTC","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"04/26/2008 11:10 UTC","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Country":"United States","Latitude":"40.793395","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Undisclosed","Weather Factors":"Lightning, Rain, Medium, Light","divs":["Sighting DetailsI went outside for a smoke right after some pretty good rain showers here in State Collete, PA. It was still raining some and I was looking at the cool cloud formations. I was looking towards the south (towards down town State College) when I saw a set of shapes, at first looked like a triangular formation of geese flying inside the clouds. I watched them fly towards the down town area and did not think too much of it since we do see geese flying around here. I did think it was strange that they were flying in the rain so I kept watching them. Again, nothing strange, maybe they do fly in the rain. They were moving pretty slow inside the clouds and in a very straight triangle shape with one of the points leading the rest of the shapes. There were about 15 shapes in the triangle, all whiter than the surrounding clouds and all moving perfectly in sync. I did not see moving wings or irregular flying as is ussually the case with birds commonly seen in this area. After about 5 minutes of watching them move closer to town, I saw something not common with birds flying in formation. The triangle stopped in mid air and spun 180 degrees and started flying exactly the same route in the opposite direction heading north. The same point of the triangle was again in the front of the formation. That's when I thought there was something very uncommon with that experience. I've never seen any birds do that, stop in mid air and rotate their formation in its center axis to head back in the opposite direction. I'm no bird expert, but that looked strange. I kept watching the objects heading north and when overhead, I did not see any wing movement or irregular flying, but the objects now looked more like part of a larger object which was of the same color as the clouds, with these whiter spheres (which is what I thought were birds) underneath. I heard no sounds of birds like is ussually the case with geese, and no airplane sounds either. I lost sight of the object(s) after several minutes of them heading north, north west towards Toftrees. I watched for objects or birds or anything for another hour after this, but did not see anything else so I went to bed."],"files":["/var/www/straped/mufon/html2text/10568.html.txt","/var/www/straped/mufon/mufon_json/10568.json","/var/www/straped/mufon/org/10568.html"]}