{"Log Number":"US-04272008-0010","Weather Factors":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsI went outside and laid down in the grass in front of my apartment. I looked up in the sky and noticed this very small object that was silver in color with a streamer hanging down that was silver as well following to the rear and port side of this jet that looked as if it had just taken off from Love Field (7 to 10 miles away) matching the jet's speed and ascent. From my perspective it looked about like a balloon but I haven't seen one move that fast or be that close to a passenger jet. The distance between the two were (guessing) 500 yards. I could tell that the object was lower than the jet slightly and not above it. It definitely looked like it was pacing the jet. I watched it pass overhead and decided to go get a pair of binoculars, but I knew it would be gone as fast as I could retreive them and it was. I peered into the sky with the binos and only saw the jet as it was miles away by then. If anyone else saw this or if it is explainable I would like to know. If I am not alone in this viewing I would be glad to throw my name in the hat. Feel free to contact me."],"Source":"MUFON","Region":"Texas","Object Flight Path":"Straight-line path","Object Shape":"Other","Object Features":"Appendage(s)","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/10572.html.txt","/var/www/straped/mufon/mufon_json/10572.json","/var/www/straped/mufon/org/10572.html"],"Date Submitted":"04/19/2008 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.810445,+-96.764093(10572)&iwloc=A&hl=en\"> mufon case (10572) map </A>","Country":"United States","Case Number":"10572","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around April 19th 2008"],"Date of the Event":"04/19/2008 05:30 UTC","Summary":"UFO followed Jet take off from Love Field","City":"Dallas","Tags":"City","Longitude":"-96.764093","Latitude":"32.810445"}