{"Log Number":"US-04272008-0008","Latitude":"47.57469","Case Number":"10570","Summary":"Standing on my front porch when I saw the object","Country":"United States","City":"Bremerton","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsIt was just getting dark out and I was on my porch having a smoke when I noticed a large red light flying below the air traffic from seattle and Seatac. As I watched it going from south to north it all of a sudden took a sharpe angle turn towards the east(Seattle)The strange thing was the size of the red light it was so much larger the the airplanes light that I see everyday, and being near the airports I see planes of all sizes(even military). I was watching UFO Hunters and the object I saw sounds exactly the same as those in Stevensville Texas that I read about the next morning.Then in Feb I saw a very simillar object that was just hovering and was a very huge bright red light that didn't move for atleast 10 minutes then all of a sudden the object moved up to the left then flashed a very bright white light then vanished.. I just been wondering if anyone else in the Seattle Bremerton area has seen the same objects I saw in january and febuary... they were so noticable I don't know how anyone out couldn't of noticed..If I can get feedback it would be great, because we're not alone and I don't fear the TRUTH! Thank You Tim"],"Date of the Event":"01/06/2008 05:30 UTC","Date Submitted":"01/06/2008 05:30 UTC","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/10570.html.txt","/var/www/straped/mufon/mufon_json/10570.json","/var/www/straped/mufon/org/10570.html"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=47.57469,+-122.6513(10570)&iwloc=A&hl=en\"> mufon case (10570) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around January 6th 2008"],"Viewing Distance":"Over One Mile","Region":"Washington","Longitude":"-122.6513","Disposition":"Unknown"}