{"Log Number":"US-04272008-0013","Weather Factors":"None","Disposition":"Unresolved","trends":["There have been no other sightings in Valhalla","This sighting has never been favorited."],"divs":["sighting detailsso i was on my way to class at wcc and i was driving south bound on the taconic state parkway. the taconic turns into the sprain parkway at one point and i was right in the area of the switch over so i'm not totally sure if i was still on the taconic or if it turned into the sprain at this point. to confirm a more exact location i lost site of the object right where the bronx river parkway connects to the taconic\\sprain south. anyway, as i was driving down the parkway i saw a bright white light come up over the tree line along side of the parkway. at first i thought it was a plane but after a minute or two it seemed as if it was hovering in one spot. the ufo proceeded to come towards the highway at a fairly slow speed until it came to a point of being directly over my car. as i slowed down and began to look up at the ufo as it was above me, i still only saw a bright white light and no details of any kind of craft. the craft continued to fly across the parkway (i believe coming from the southeast and heading northwest) and went out of site over the adjacent tree line. what i can't recall exactly is how big the object was but it was certainly bigger than a car. it was also high enough that it was above the trees but it was not much higher than the trees. i also noted at the time that there was no sound coming from the ufo like you would hear from a plane flying so closely overhead. to add a twist to my experience, as the ufo began to leave my site my cell phone began to ring and it was my now ex - girlfriend. the first thing i said to her was \"i think i just saw a ufo\" and she answered right back to me \"was it a big bright white light?\" i replied to her \"yes how did you know that?\" and she proceeded to tell me how she just saw the same thing fly over the bronx river parkway. unfortunately i was unable to pull over to take a better look because there were enough cars coming off of the bronx river ramp and it's a fairly dangerous intersection. i could also kick myself because i had my digital camera in the car with me but was so amazed by what i was seeing that it didn't occur to me."],"Source":"MUFON","Date of the Event":"02/01/2004 05:00 UTC","Sighting Duration":"00:08:00","Country":"United States","Region":"New York","Object Shape":"Circle, Oval, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=41.074819,+-73.775133(10575)&iwloc=A&hl=en\"> mufon case (10575) map </A>","Object Flight Path":"Hovering then path","Date Submitted":"02/01/2004 05:00 UTC","Longitude":"-73.775133","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Summary":"Bright White Oval Light Passes Directly Overhead of My Car on Taconic Parkway","Latitude":"41.074819","Case Number":"10575","files":["/var/www/straped/mufon/html2text/10575.html.txt","/var/www/straped/mufon/mufon_json/10575.json","/var/www/straped/mufon/org/10575.html"],"Object Features":"Unknown","City":"Valhalla","Tags":"City"}