{"Object Shape":"Star-like","Source":"MUFON","Object Features":"Undisclosed","Latitude":"40.403161","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.403161,+-105.06818(10586)&iwloc=A&hl=en\"> mufon case (10586) map </A>","Region":"Colorado","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10586.html.txt","/var/www/straped/mufon/mufon_json/10586.json","/var/www/straped/mufon/org/10586.html"],"Viewing Distance":"Unknown","Case Number":"10586","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around April 27th 2008"],"Country":"United States","Date Submitted":"04/27/2008 09:15 UTC","divs":["Sighting DetailsI went outside from the garage last night - sky was very clear - I looked up expecting to see the moon and stars as usual on a beautiful night and was shocked to see 4 star-like objects in a beautiful red-orange color just hanging there in the sky in front and above me - I could not figure out what they were - I thought they might be some strange balloons that were lit up or something - I couldn not see the outline of the abjects because it was night and they were very bright - they were just hovering for about a minute. they were spaced an exact distance apart from each other - they maintained that same spatial relationship as they started to glide across the sky coming from the northeast and going southwest in a sort of arc pattern-- one more set followed and then a single one came along - they disappeared into the sky as if someone had turned out the lights - there was no sound whatsoever and they glided rather than flew and always maintained the same space betwen them as they traveled - I ran inside and got a family member to see them because I could not believe my eyes and wanted proof that what I was seeing was real - I was very nervous viewing this because it was like nothing else I could imagine and I was almost afraid to continue looking - it felt like I was being viewed! It was mesmerizing - I did not have a camera and did not want to quit watching and go in the house to get one in case they disappeared before I got back. It is an experience I will never forget! I have not been able to find out if anyone else beside us saw the event."],"Tags":"City","Date of the Event":"04/27/2008 09:15 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Longitude":"-105.06818","City":"Loveland","Summary":"total of 6 star-like objects moving across sky - from northwest to southeast-all evenly spaced-hovered sometimes","Log Number":"US-04282008-0011"}