{"trends":["There have been 20 other sightings in Venice","There were no other sightings in Venice on or around November 15th 1998"],"Object Features":"Patterned Surface, Other","Disposition":"Unresolved","Sighting Duration":"00:05:00","Country":"United States","divs":["Sighting DetailsSubmitted by Investigator via e-mail...Witness reported seeing a silent, very low altitude erratic flying objectwhile driving on 1-75 at 3:20 a.m. south of Venice, Florida. It was firstseen at approximately 45 degrees above the horizon at a distance of about500 feet. The object had a varied surface and its basic color and shapewere muted (there was some fog), but it reflected the lights in shades ofbeige, yellow, orange and brown. It had a beam light with a yellowish aura.The object was first sighted coming from a northwesterly direction and lastobserved moving to the southwest. Its movements resembled those of afalling leaf. The witness has spent years in the Marine Corps and knowsflight dynamics so he wondered how any aircraft could move in this fashion.At one point the vehicle appeared to stall because it decelerated andstopped, then started again.The closest distance the witness was to the object was about 200 feet, whenit came down and hovered over a vehicle parked on the highway. From thisdistance it appeared larger than a camper but not as large as a truck. Atthis point the witness said his own vehicle stopped and he had to start itagain. He rolled down the window and all sounds seemed to be muted. Witnesssaid his automobile was in perfect condition and had never stalled before."],"Date of the Event":"11/15/1998 03:07 UTC","files":["/var/www/straped/mufon/html2text/1058.html.txt","/var/www/straped/mufon/mufon_json/1058.json","/var/www/straped/mufon/org/1058.html"],"City":"Venice","Date Submitted":"11/15/1998 03:07 UTC","Viewing Distance":"101-500 Feet","Weather Factors":"Fog","map":"<A HREF = \"http://maps.google.com/maps?q=27.099778,+-82.454263(1058)&iwloc=A&hl=en\"> mufon case (1058) map </A>","Latitude":"27.099778","Summary":"Silent, very low altitude, erratic flying object","Log Number":"","Tags":"City","Source":"MUFON","Object Flight Path":"Stationary,Other","Longitude":"-82.454263","Region":"Florida","Case Number":"1058","Object Shape":"Unknown"}