{"Object Shape":"Star-like","Case Number":"10581","Sighting Duration":"00:00:15","Date of the Event":"03/04/2008 08:30 UTC","Weather Factors":"None","trends":["There have been 3 other sightings in Hanalei","There were no other sightings in Hanalei on or around March 4th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=22.209632,+-159.496356(10581)&iwloc=A&hl=en\"> mufon case (10581) map </A>","Country":"United States","Latitude":"22.209632","Summary":"two lights working in conjunction","Tags":"City","Longitude":"-159.496356","Viewing Distance":"Over One Mile","Region":"Hawaii","Disposition":"Unknown","divs":["Sighting DetailsMy son and I were walking up our drive with the dogs. I'm hard pressed to put into I words what my son and I saw without being able to draw it but about six to eight weeks ago we saw two lights that described a repeated pattern and then vanished. Initially I didn't even see the lights, I'm 53 and my son is 16, they were so dim or distant. But as I looked at the part of the sky that my son directed me to it became very clear but still very dim as if you were looking at a distant star. As close as I can describe the incident it was as if one very dim light very high up and or far away would move in a semi-circular manner ahead of the other light and then the second one would catch up to it and then the first light would repeat the semi circular motion. If you were to hold your hand at arms length the circle described would have been no larger than the tip of your little finger or slightly smaller. They repeated this pattern at least a half dozen times in a very regular and exact manner. I thought how extraordinary that we were witnessing this strange event and yet it didn't seem unreasonable in the sense that there are any number of satellites and I'm sure experimental vehicles that have a terrestrial origin. And then something that really defied the norm ocurred. The first light described the semi circle that it had been making but the second light did not come up to meet it. Both lights just paused in place and then after a few seconds, maybe 5 or 6, the first light went back to the second light and joined with it and they just sort of dimmed out and vanished. I turned to my son and asked if he had seen the whole thing and he said he had and we agreed that we had witnessed something beyond our ability to explain. I've lived on the northshore of Kauai for over 25 years and I've seen and heard some very strange things but noting to match this. I'd be interested in hearing if anybody has ever reported to have seen anything like what we saw."],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Date Submitted":"03/04/2008 08:30 UTC","City":"Hanalei","files":["/var/www/straped/mufon/html2text/10581.html.txt","/var/www/straped/mufon/mufon_json/10581.json","/var/www/straped/mufon/org/10581.html"],"Source":"MUFON","Object Features":"Unknown","Log Number":"US-04282008-0006"}