{"map":"<A HREF = \"http://maps.google.com/maps?q=40.59306,+-105.079683(10596)&iwloc=A&hl=en\"> mufon case (10596) map </A>","Object Shape":"Oval","Source":"MUFON","Tags":"City","Country":"United States","Log Number":"US-04292008-0002","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","divs":["Sighting DetailsIt was about 12 30A.M. as my son whom is 19 and I were walking like we normally did after I got off work in the late evening. We would always walk from the corner of Timberline and Drake intersection headed south to Horsetooth and make a left at Fort Collins High School head east to county road 9 then north to Drake Road making a four mile walk. Towards the end of our walk there was a construction site on our left as we were headed west on Drake Road. About 6o feet in front of us we were approaching the new King Soopers built on the corner of Drake Road and Timberline. I thought I saw something on our right hand side flying by very close to the ground about 10 feet up. Suddenly there was a loud sound as if a minature sonic boom has occured and before us appearing out of the wall that protects King Soopers loading docks was a oval shaped object about 12-14 feet long by about 3 or 4 feet tall moving at about 10 miles per hour floating 3-4 feet off the ground. It was translucent but yet we could see something inside it and there was a long tail following it. I was in a state of shock as was my son. I could see the shadow it was casting on the ground as it was flying by us on the right about 30 feet away. The moon was full and bright and what alarmed me was I could see it and see throught it at the same time it was as if it were surrounded by small mirrors yet remained translucent. The tail was was about 7 feet long. My son said he could see something inside of it in a humanoid form. All I could see on the outside of the oval shape were many angular shapes that made me think of mirrors. In total silence it quickly gained speed and shot up into the sky and was gone within 30 seconds from beginning to end. We went home very quickly and for the first time I was actually scared even though I have seen UFOS up close several times in my life. I have always dreamed of them but only experienced them this close I think three other times in my life when I was conscious. That was when I was younger and know I am 49. For some strange reason this incident has really been bothering me. We no longer go on walks late at night in the summer, since that night."],"Latitude":"40.59306","Date of the Event":"Unknown","Case Number":"10596","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around"],"Longitude":"-105.079683","files":["/var/www/straped/mufon/html2text/10596.html.txt","/var/www/straped/mufon/mufon_json/10596.json","/var/www/straped/mufon/org/10596.html"],"Region":"Colorado","Summary":"walking with my son after work headed west and we saw the object 40 feet away ...","Sighting Duration":"00:00:30","Date Submitted":"04/29/2008 05:17 UTC","Disposition":"Unknown","City":"Fort Collins","Object Features":"Patterned Surface"}