{"Date of the Event":"04/29/2008 08:15 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/29/2008 08:15 UTC","Disposition":"IFO","City":"Hampton","Latitude":"42.907313","Sighting Duration":"Undisclosed","Region":"New Hampshire","Longitude":"-70.811997","Object Shape":"Star-like, Triangle","Log Number":"US-04292008-0014","Source":"MUFON","Tags":"City","Summary":"3 lights hovering over the ocean, brightened in unison","Country":"United States","Case Number":"10608","map":"<A HREF = \"http://maps.google.com/maps?q=42.907313,+-70.811997(10608)&iwloc=A&hl=en\"> mufon case (10608) map </A>","Object Flight Path":"Hovering then path","trends":["There have been 8 other sightings in Hampton","There were no other sightings in Hampton on or around April 29th 2008"],"files":["/var/www/straped/mufon/html2text/10608.html.txt","/var/www/straped/mufon/mufon_json/10608.json","/var/www/straped/mufon/org/10608.html"],"Object Features":"Undisclosed","divs":["Sighting DetailsI went for my usual evening walk. On my way home I noticed there were 3 lights about a mile off the coast. The 3 lights were a few hundred feet apart from each other and they just hovered in place maybe 400-500 feet in the air. No blinking lights or movement, so I ruled out commercial planes. The lights were yellowish, but seemed to shift reddish in unison as they brightened. They were hovering in a triangular pattern. Once I realized that they weren't moving, me and my wife stood still and watched as the lights dimmed and brightened in unison for about 20 minutes. After a while the lights got to their brightest point and suddenly disappeared. They later reappeared in the same exact formation about a mile further to the south. The brightness of the lights was far brighter than any plane I had ever seen. At one point, one of the 3 lights split into 2 bright lights for about 10 seconds or so before becoming one light again. Twenty minutes after the second triangular formation, the lights just dimmed out of sight. I had an odd eerie feeling in my gut as I knew I was seeing something that was out of the ordinary. When one light started to get bright, the other 2 also brightened. That was the creepiest part of the experience. The weather was drizzle and windy, so there weren't many other people around to witness what I was seeing."]}