{"Date of the Event":"04/16/2008 07:26 UTC","Latitude":"33.754675","Source":"MUFON","Disposition":"Hoax","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around April 16th 2008"],"Sighting Duration":"00:04:30","Region":"Georgia","Log Number":"US-04292008-0012","Summary":"Distinctive Triangle Shape and Two lights","Tags":"City","Object Shape":"Circle, Triangle","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10606.html.txt","/var/www/straped/mufon/mufon_json/10606.json","/var/www/straped/mufon/org/10606.html"],"Longitude":"-84.386882","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Country":"United States","divs":["Sighting DetailsI was camping out on the Golfcourse, when I studdered upon a rock. The rock was particularly glowing in a greenish form. I looked up while holding the rock and noticed that there was a distinctive light in the sky. While I was watching the light, the light became two lights dancing around in the sky. I have 20-20 vision, so I knew that this could not have been a government aircraft from the near bye Air Force Base. As I watched the lights from about 250 feet, I noticed that they had suddenly just disappeared. This had gone on for about 2 minutes until I saw another Huge Distinctive Triangle shaped object. The Triangle had 3 lights about the size of the first two I saw. One light was on the corner of the Triangle as the other ones were to. It was about 500 feet away from the ground, and I could tell that It was watching me. It hovered around me with no sound at all for about 2 and a half minutes. It felt like there was something missing as I watched the object. After, I could see my friends were rushing towards me, so I turned around and pointed at the object, but at about that time, the object was gone."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.754675,+-84.386882(10606)&iwloc=A&hl=en\"> mufon case (10606) map </A>","Case Number":"10606","Weather Factors":"Unknown","City":"Atlanta","Date Submitted":"04/16/2008 07:26 UTC"}