{"Latitude":"33.204466","Object Features":"None","Object Shape":"Blimp","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.204466,+-96.631182(10609)&iwloc=A&hl=en\"> mufon case (10609) map </A>","Region":"Texas","Object Flight Path":"Straight-line path","Summary":"McKinney, white oval shaped object","Date Submitted":"04/28/2008 09:09 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Windy","City":"McKinney","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around April 28th 2008"],"Longitude":"-96.631182","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/10609.html.txt","/var/www/straped/mufon/mufon_json/10609.json","/var/www/straped/mufon/org/10609.html"],"Date of the Event":"04/28/2008 09:09 UTC","Sighting Duration":"00:00:20","Log Number":"US-04292008-0015","Case Number":"10609","Disposition":"IFO","divs":["Sighting DetailsToday this morning at 9:09 am. McKinney, Texas. I was standing outside of my shop facing north watching a white Cesna 152 slowly crossing from west to east. Maybe he was going to land at the McKinney airport which was east of me. He was quite low aproximatly 1,000 to 1,500 feet, and maybe a half mile due north of me. Maybe not that far, I could clearly see the stripe down the side of the plane. I was thinking that a slow plane was better than no plane when I noticed an oval shaped object approaching at a high rate of speed. It came righ over the top of the Cesna. Maybe 500 to 1,000 over the top of the plane. I was about one third the size of the plane. The object had a fuzzy white look to it almost like a cloud shaped like a fat tic-tac. It was moving at almost a right angle to the plane, from a north north east to a south south east. I watched it for perhaps twenty seconds trying to decide if I should get my camera and chance loosing it. Wanting to have some evidence to show, I ran inside to get the camera and you guessed it when I got outside I couldn't find it again. I took some pictures of the sky anyway hopeing for something but got nothing. I was very excited seening the object that I ran upstairs to file a report, and I got todays date wrong so this is a correction of my original report."]}