{"Summary":"UFO was a Green Orb","Date Submitted":"04/29/2008 11:10 UTC","Weather Factors":"Unknown","Latitude":"39.71446","divs":["Sighting DetailsI was returning from a night of training at my gym, on the way home its late at night about 11:00-11:10 and about 1 hour drive. I was heading south on wadsworth and as soon as i passed 44th and wads cross street, A green orb flew SE over wadsworth, about 100-200 ft above my car; at first i thought it was a green fire work,because i saw lights behind it,looked as if firework exploded.But the green orb was moving too fast east to be firework in wind.The lights behind it remided me of jet or helicopter;The lights following orb were white in close V shape with a green light on one side and red on the other, i concluded a human vehicle.The light was moving faster than any jet ive ever seen fly in a suburban area, and the jet or heli was trying to keep up with it; it was moving so fast i couldnt keep up with them going 40mph in my vehicle, I tried to follow them with my eyes but lost them behind some buildings, by the time i got to a street that followed their direction both were gone from my view. I started calling my friends letting them know hwat i saw, i was freaking out,I didnt know if i should call 911 or police or what.i have never seen anything fly that low and quick in the city, everyone i called wouldnt believe what i just saw. The next morning on the way to work i was heading east on colfax toward denver and i saw two sets of 2 black goverment helicpoters flying close together over denver and more north toward lakewood. after seeing those the next morning i new something wasn't write and comfirmed that something happened the night before, so idecided to report this to MUFON, ive seen this company on history channel."],"Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere","files":["/var/www/straped/mufon/html2text/10616.html.txt","/var/www/straped/mufon/mufon_json/10616.json","/var/www/straped/mufon/org/10616.html"],"Disposition":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-105.073193","map":"<A HREF = \"http://maps.google.com/maps?q=39.71446,+-105.073193(10616)&iwloc=A&hl=en\"> mufon case (10616) map </A>","Log Number":"US-04302008-0004","Region":"Colorado","Date of the Event":"04/29/2008 11:10 UTC","Viewing Distance":"101-500 Feet","City":"Lakewood","Tags":"City","Source":"MUFON","Object Features":"Unknown","Case Number":"10616","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around April 29th 2008"],"Country":"United States"}