{"Sighting Duration":"Undisclosed","Object Shape":"Disc","Tags":"City","Date Submitted":"11/30/1996 05:00 UTC","Weather Factors":"None","Country":"United States","Source":"MUFON","trends":["There has been one other sighting in Greenville","There were no other sightings in Greenville on or around November 30th 1996"],"files":["/var/www/straped/mufon/html2text/10618.html.txt","/var/www/straped/mufon/mufon_json/10618.json","/var/www/straped/mufon/org/10618.html"],"Summary":"the disc was stationary, hovering over treetops. It had several white individual circular lights surrounding the disc. no engine could be heard. I was taking my children to school that morning. It really shook us up.","divs":["Sighting DetailsI was on my way to work one morning around approximately 5 or 6 am. I was taking my children to their grandmothers' house so she could babysit them. While travelling south on Greenville-Baker Store Rd, all of us saw an object hovering over the treetops just above the power lines. The object was round with circular white lights surronding the entire disc. I rolled down my window to possibly hear a motor or engine. I heard nothing.....no sounds at all. I continued driving to get to work. My children and I were very nervous and concerned as to what we saw.I mentioned the story to my mother and never thought anymore about it. We live near Wright Patterson Air Force Base, so I just ignored the experience. People wouldn't believe me if I told them anyway. I swear this experience is true. My kids and I have never discussed this since it happened. Julie Cromwell"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.102826,+-84.633012(10618)&iwloc=A&hl=en\"> mufon case (10618) map </A>","Case Number":"10618","Object Flight Path":"Stationary","Log Number":"US-04302008-0006","Longitude":"-84.633012","Disposition":"Insufficient Data","Latitude":"40.102826","City":"Greenville","Viewing Distance":"Unknown","Date of the Event":"11/30/1996 05:00 UTC","Object Features":"None","Region":"Ohio"}