{"Log Number":"US-04302008-0001","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-93.910926","map":"<A HREF = \"http://maps.google.com/maps?q=46.216556,+-93.910926(10612)&iwloc=A&hl=en\"> mufon case (10612) map </A>","Object Features":"Unknown","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/10612.html.txt","/var/www/straped/mufon/more/10612_submitter_file1__000_0010.JPG","/var/www/straped/mufon/more/10612_submitter_file2__000_0011.JPG","/var/www/straped/mufon/more/10612_submitter_file3__000_0012.JPG","/var/www/straped/mufon/mufon_json/10612.json","/var/www/straped/mufon/org/10612.html"],"Weather Factors":"None","Latitude":"46.216556","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date Submitted":"04/29/2008 09:08 UTC","Case Number":"10612","City":"pine center","Date of the Event":"04/29/2008 09:08 UTC","Summary":"3 Objects spread apart, 1 whitish, other 2 pale orangish and larger than whitish object,, orange objects moving around, one became larger.","Source":"MUFON","Region":"Minnesota","Object Shape":"Sphere","trends":["There has been one other sighting in pine center","There were no other sightings in pine center on or around April 29th 2008","This sighting has never been favorited.",""],"Disposition":"Unknown","divs":["Sighting DetailsI was on my home to Brainerd,MN from Mille Lacs lake area. Spotted three objects high in the sky, at around 9:08 pm This evening April 29th Two objects were orange in color, the third was a bright white color. The white colored object was almost in center of the formation, but was lower than one of the two orange objects. Pulled my vehicle over, shut it off. Grabbed a digital camera, took two pictures within a minute, saw a vehicle approaching from opposite way, flashed my headlights several times to flag the vehicle down, they didnt stop. Then I was going to take another picture, and noticed one of the orange objects looked larger now, and appeared to be moving a bit closer to me. I took another picture, and tried to take more, I realized my camera must be full,I believe there are 4 pictures total I took.I never thought to delete other pictures to make room until it wa too late, already home. I stayed at the same spot to watch these objects, one of the orange objects, the one not getting larger moved up, then down rapidly, and then moved and stayed near the white object, the larger orange object didnt seem to get any larger now, and I got very scared, and felt it was time to get out of the area altogether. I sarted my van and left. While on the way I felt sleepy, and a bit confused, I had some trouble driving, not alot, but disoriented and felt as though I couldnt pop my ears, like some kind of pressure, even as I write this now, I still feel some kind of pressure. I decided to not report this to local sherrifs dept, as I had done once with another experience. I believe they dont take things serious like this, and I dont want to come across as mentally unstable in any way. Even to fill this out again is uncomfortable, the last thing I need is to look like an attention seeking type, that Iam not.I want to note the objects were easy to see with my eyes, but they didnt show on my camera view even though I could still see them. Iam not sure if these objects would be viewable in daylight,or not. The objects were still in the sky when I left for my home.This is the second time I have seen strange objects, and in the same area as once before. I never expected to see anything like this. I immediately contacted a mufon investigator as soon as I got home, because I had a number I kept. I think it would be vital for someone to look into the area where this happened,and spend time videotaping as many hours as possible, days, or night. I just feel that it is strange. Iam 41 yrs. old and Ive never experienced things like this my whole life until recent."]}