{"map":"<A HREF = \"http://maps.google.com/maps?q=30.708889,+-101.204167(10610)&iwloc=A&hl=en\"> mufon case (10610) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Texas","Date Submitted":"04/28/2008 09:30 UTC","Latitude":"30.708889","Date of the Event":"04/28/2008 09:30 UTC","Log Number":"US-04292008-0016","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10610.html.txt","/var/www/straped/mufon/mufon_json/10610.json","/var/www/straped/mufon/org/10610.html"],"Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Ozona","There were no other sightings in Ozona on or around April 28th 2008"],"Summary":"Observed a bright light change colors and speed and disappear.","Object Shape":"Star-like","Tags":"City","City":"Ozona","Case Number":"10610","Disposition":"Unknown","Country":"United States","Object Flight Path":"Path with directional change","divs":["sighting detailson the night of 28 april at roughly 2130 hrs, while driving from el paso texas to san antonio, a friend and i noticed a star that was dramatically brighter than the others (about 5 miles ene of ozona). my friend commented that it must be venus, and that we should check the almanac later. i kept watching the light and noticed that not only was it moving, but it was changing colors as well. my friend was trying to watch the light (which appeared to have changed to a green color) and drive at the same time, and we discussed what we were looking at. eventually the light stopped moving and turned a bright bright orange-red. i think at that time i was able to detect a chevron-type shape to the light. the coler became so bright it was difficult to look at, and then it disappeared completely. the sky was absolutely beautiful and clear without a cloud in sight. whatever we had been looking at completely vanished in less than a second while we were watching it. as this was our second encounter with an unknown \"something\" in the sky on i-10 in between el paso and san antonio (the other incident being a few months back), we were both really shaken up. we have both had more than average contact during our respective different careers with aircraft of all times, including military and balloons\\airships. i have absolutely no idea what it was that we saw."],"Longitude":"-101.204167"}