{"Tags":"City","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 5th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Sighting Duration":"00:01:30","Case Number":"10613","Object Shape":"Triangle","Log Number":"US-04302008-0002","Summary":"Large Triangular UFO Crossed Over Hwy Loop 1604 Early April 5, 2008","Latitude":"29.429342","Country":"United States","divs":["sighting details1. where & what: i was traveling west on highway loop 1604 south of camp bullis military reservation. i was driving a 2006 ford econoline passenger van (pulling a trailer). my 20 year old son and two other adult friends all witnessed the event. 2. what made me notice? the craft was flying low and at first i thought a jet airliner was approaching an airport. as we got closer the lights and shape were not not like any aircraft i had ever seen. there was no sound. 3. what did i first think? the craft was flying low and at first i thought a jet airliner was approaching an airport for a night landing. 4. describe the ufo. the \"larger than a commercial airliner\" sized ufo crossed the highway moving southward. the angle that was first observed as it crossed the highway was from its side as it banked. my vehicle was within a few hundred yards of the craft as it passed slowly over the highway. there were 4,5 or 6 large white circle shaped lights within a criss-crossing lattice work. it looked like \"xoxoxoxox\". smaller red, yellow & greenish lights were set within the \"x's\". the side profile was pistol shaped on the north side (somewhat like an upside down plane in shape). the lower section also had an x weave with red, yellow and greenish lights within a lattice work. the ufo slowly banked showing a huge triangular shape. it was big. the lighting pattern became a v pattern exposing rows of 5 or 6 white lights on both exposed sides. the ufo was now on the south side of the highway banking . it moved with the hypotenuse side leading. we continued to drive. i never heard a jet sound or any loudness. it was large, spanning the highway as it passed over the highway. 5. reactions. i asked my son \"what is that?\" he said \"ufo?\". it was amazing. after the event i felt like it was a government owned ufo. i was not frightened. none of us were frightened. 6. how did we lose sight? the object moved over a tree line as we continued to drive west. i have seen a photo on-line today from an indiana 1\\31\\2008 sighting. i am confident it is the same type of ufo as we witnessed. i have attached that photo. (it prompted me to report.) i included a sketch."],"Weather Factors":"None","Object Features":"Patterned Surface, Appendage(s)","City":"San Antonio","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/10613.html.txt","/var/www/straped/mufon/more/10613_submitter_file1__Indiana2008.jpg","/var/www/straped/mufon/mufon_json/10613.json","/var/www/straped/mufon/org/10613.html"],"Longitude":"-98.490418","Region":"Texas","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=29.429342,+-98.490418(10613)&iwloc=A&hl=en\"> mufon case (10613) map </A>","Date of the Event":"04/05/2008 01:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"04/05/2008 01:30 UTC"}