{"divs":["Sighting Detailsmy friend of all my life, has randomly mentioned to me seeing a strange light over a farm area in greene NY where we live. my friend told me \"on my way home i see this just small light hovering with no sound then its just gone.\" this anomily stumps me and i have asked questiones. Another one of my friend this time a female has also in the same area of greene NY seen strange lights and told me \" it felt like when i came home something was going to be in the house and has been watching my \"every\" move.\" She also told me that one of here friemds had something follow her home one night a 3AM. a light followed the car from above behing and in front of the car. Myself i have not yet seen these lights although i am compelled to look for such, im starting to beleive or really want to know for sure the truth. some of the facts on the UFO shows i have seen are unhumanly possible and i am only writing to you in hopes for some kind of answer. To me if we are uncapable of such flight and speed why havent we been taught such. we have obviously been deemed not a threat. A good thing if we are so unadvanced. It just makes everyday a big lie. If so. that we may never be so advanced. i will look in the area of sightings where my friends have seen and i shall see for myself if the truth is out there. please get back to me."],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.350918,+-73.802903(10625)&iwloc=A&hl=en\"> mufon case (10625) map </A>","Country":"United States","Object Shape":"Circle, Sphere, Star-like","Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10625.html.txt","/var/www/straped/mufon/mufon_json/10625.json","/var/www/straped/mufon/org/10625.html"],"Case Number":"10625","Object Features":"Undisclosed","Disposition":"Unresolved","Date Submitted":"04/30/2008 12:00 UTC","Latitude":"42.350918","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Coxsackie","This sighting has never been favorited."],"City":"Coxsackie","Tags":"City","Date of the Event":"04/30/2008 12:00 UTC","Summary":"seen by friend and others, short time seen, small light, disapiered, no sound","Log Number":"US-05012008-0004","Region":"New York","Longitude":"-73.802903"}