{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.613825,+-122.486919(10622)&iwloc=A&hl=en\"> mufon case (10622) map </A>","Longitude":"-122.486919","files":["/var/www/straped/mufon/html2text/10622.html.txt","/var/www/straped/mufon/mufon_json/10622.json","/var/www/straped/mufon/org/10622.html"],"Viewing Distance":"Unknown","Source":"MUFON","Date Submitted":"06/01/1981 07:00 UTC","Object Features":"None","Disposition":"IFO","Latitude":"37.613825","Summary":"Blue light moving slowly a few feet wide and many miles long","trends":["There have been 6 other sightings in Pacifica","There were no other sightings in Pacifica on or around June 1st 1981"],"City":"Pacifica","Object Flight Path":"Undisclosed","Region":"California","Case Number":"10622","Country":"United States","Sighting Duration":"00:10:00","divs":["Sighting DetailsI don't know what the cause was but myself, my wife, brother and sister-in-law were driving down the coast just south of San Franciso and we could see a very strange light that appeared only a few feet in depth but extended north and south across the ocean as far as we could see. It appeared to be moving slowly toward the east and appeared like a blue light that was reading a bar code. We made a turn from the coast highway which runs north and south toward the east (toward our home). We drove slowly and watched the light coming closer and closer. When we started driving up our street which rises to the east we could see the light was still coming toward us. Finally it caught up with us and went right over our car at about what appeared to be 5 miles an hour. The light was very blue. It seemed unusual in that it was a heavy blue that looked intensly deep in color. We then sat and watched as it continued to move eastward until it passed over the mountain in front of us, to the east, and out of our sight. My brother went in and called the Pacifica police and asked if they had any reports of the blue light and they said yes, many. The interesting thing was that we could not see any source for the light and it extending for at least 20-25 miles north to south and was only a couple feet wide. We thought at the time that it might have been a satellite or something similar and we stood looking for some time but could never find any indication of where it came from. As a note, I think that it must have passed over the San Francisco airport as that was the direction it was moving. They might have a record of the event or even an eplanation. The date, including the year may not be exact but I could confirm more with my family if necessary. Also, I am a licensed aircraft mechanic (A & P Mechanic License wth an R & E license) and I worked for many years as an engineer for United Airlines before retiring two years ago. I also worked with many aircraft while in the US Navy but have never seen anything like this before or since."],"Tags":"City","Date of the Event":"06/01/1981 07:00 UTC","Object Shape":"Other","Log Number":"US-05012008-0001"}