{"Log Number":"US-05012008-0007","files":["/var/www/straped/mufon/html2text/10628.html.txt","/var/www/straped/mufon/mufon_json/10628.json","/var/www/straped/mufon/org/10628.html"],"Source":"MUFON","Country":"United States","Date Submitted":"04/30/1982 12:00 UTC","Region":"Colorado","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around April 30th 1982"],"Object Features":"Unknown","Disposition":"Unknown","Summary":"Hugh bright green light","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.263437,+-104.601791(10628)&iwloc=A&hl=en\"> mufon case (10628) map </A>","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsIn the spring of 1982. My husband worked as a manager for a local fast food restaurant in Pueblo Co. This event happened around 2-3AM. My husband received a call from the local police dept that the alarms were going off in the restaurant and he needed to come down to the store and check it out, however the police could not meet him there because they were swamped with alarm calls. I guess the whole south side of Pueblo was going off. My husband left and I got out of bed and went down stairs to wait for him (I was worried about him going into the restaurant without the police). I was sitting at the kitchen table in the dark with the front door open and just the screen door between me and the outside porch. Three different times during (I would say about 15 Minutes) I heard what sounded like bacon sissling and then a loud click (almost like the click you hear when you turn on and off a light switch) When I heard the click a BRIGHT GREEN light would shine into the house from all the windows and doors (It reminded me of a sort of spot light affect) I got up and walked to the front door to look out and could not see anything in front of me, but I wanted to step out onto the porch and look up... ( I also felt a strong feeling of \"You really don't want to see this\") My husband at the time was coming home and was witnessing the light from the corner of our street. When he saw me opening the front screen door, he drove up the street and jumped out of the car and pushed me into the house. We don't know what it was, but I was 3 months pregnant at the time and I worried about it my whole pregnancy. I don't know what it was and it still haunts me to this day. I know we are not the only ones in the universe. Pueblo is south of Co. Springs and NORAD. We never heard nothing about it."],"Latitude":"38.263437","Case Number":"10628","Object Flight Path":"Stationary,Hovering then path,Unknown","City":"Pueblo","Longitude":"-104.601791","Object Shape":"Unknown","Weather Factors":"Unknown","Date of the Event":"04/30/1982 12:00 UTC"}