{"map":"<A HREF = \"http://maps.google.com/maps?q=38.840391,+-77.428877(10637)&iwloc=A&hl=en\"> mufon case (10637) map </A>","Longitude":"-77.428877","divs":["Sighting DetailsI was sitting on the floor of my porch with my back against a wall and was looking up facing North West. I noticed a light flying across the sky, which is not unusual because I live only a few miles from Dulles Airport, VA. I tracked its course across the sky. I did not associate a noise with the light but since it looked to be so high up I did not expect to hear it for a while. As I said I live near the airport and spend most nice nights on the porch watching all the plain traffic so I am used to the lights and the delay before some of the noise or that some never reaches me. Also I know that although from close up the plains have lots of lights form a distance they usually just look like a single white light. Also I have seen the planes seam to hover from the effect of flying towards me and then when they turn it looks like the light suddenly started quickly in one direction. All this is to say that I can often see how some people might confuse such lights for UFOs. This white light continued slowly across the sky arcing gently so that it started heading north west and was heading west at the end of the arc. Its speed across the sky seamed appropriate for the apparent hight at which it looked to be traveling based on me only being able to make out the one white light. Suddenly however the light made a sharp angle (definitely tighter than 100degrees) turn North East(it wasn't really a turn it was just suddenly heading in another direction with no curve or arc) and much faster than at its original speed, it kept up speed as it zagged back South West, then a rapid successions of what must have been 160-170 degree changes in direction at speed about three times (Zig Zig, Literally, I did not expect that) before finishing its maneuver heading back West (in the sky it was now slightly further North of its original course West) It seamed to slow slightly at the end of the Zig-Zag but it was still moving twice as fast as when I originally spotted it. It was now heading West with the slightest curve south and continued for another inch of sky from my perspective and then disappeared. All of which took less than 10 seconds. I sat there dumbfounded for a few minutes. I have always been a believer in some other's sighting but never expected to see a fast light zig zag across the sky here in Northern Virginia. I would love to know if anyone else say it."],"Source":"MUFON","Date of the Event":"05/02/2008 10:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"05/02/2008 10:10 UTC","Object Features":"Unknown","Region":"Virginia","Latitude":"38.840391","Summary":"Single white light at high altitude went from a slow arcing flight to fast zig zag before dissapearing on a straight course","Country":"United States","trends":["There have been 5 other sightings in Centreville","There were no other sightings in Centreville on or around May 2nd 2008"],"Weather Factors":"Unknown","Tags":"City","Log Number":"US-05022008-0006","City":"Centreville","files":["/var/www/straped/mufon/html2text/10637.html.txt","/var/www/straped/mufon/mufon_json/10637.json","/var/www/straped/mufon/org/10637.html"],"Object Flight Path":"Path with directional change","Disposition":"Unknown","Case Number":"10637","Object Shape":"Unknown","Sighting Duration":"Undisclosed"}