{"Region":"Texas","Log Number":"US-05032008-0009","Object Features":"Undisclosed","Latitude":"33.203546","Date of the Event":"05/02/2008 07:20 UTC","Sighting Duration":"00:00:30","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy wife and I went to Erwin park, she was walking the dogs and I was flying an rc electric airplane. The air was almost still only a few clouds in the sky. I had the plane in the air just about five min. As my plane came around to the east I could see a white sphere traveling from north to south. It lookded to be about 5,000.ft up. At an angle from me about 40 deg. It's size was about the size of a thumb tack head. The sphere looked like it was just north of McKinney. It was traveling at a steady clip fairly quickly across the sky. I circled the rc plane to keep it east of me so I could keep a watch on the sphere. I saw my wife comming at a distace I turned and called to her to look and I lost site of the white sphere. She didn't here me telling her to look. But when she found out what I was saying she took some pictures of the sky. I'm inclosing one of the pictures of what she took with the camera. I think it is just a jet plane and it's vapor trail. She seems to think it is more, I'll let you decide."],"Tags":"City","Viewing Distance":"Unknown","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.203546,+-96.630112(10646)&iwloc=A&hl=en\"> mufon case (10646) map </A>","Disposition":"IFO","Source":"MUFON","Summary":"white sphere traveling north to south","Longitude":"-96.630112","City":"McKinney","Country":"United States","files":["/var/www/straped/mufon/html2text/10646.html.txt","/var/www/straped/mufon/more/10646_submitter_file1__100_1265.jpg","/var/www/straped/mufon/mufon_json/10646.json","/var/www/straped/mufon/org/10646.html"],"Date Submitted":"05/02/2008 07:20 UTC","Case Number":"10646","trends":["There have been 30 other sightings in McKinney","There was one other sighting in McKinney on or around May 2nd 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown"}