{"Weather Factors":"Unknown","Date of the Event":"04/23/2008 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.321104,+-85.597454(10645)&iwloc=A&hl=en\"> mufon case (10645) map </A>","divs":["Sighting DetailsMy wife and I were watching TV, the wife was laying on the couch directly infront of the television, and I on the other couch to the left. The TV is inbetween a window and a 3 season room that is all windows. Out of nowhere my wife jumps up and runs toward the window and then to the door. I asked what was going on, was it a visitor, was it some one breaking into our neighbors house, what are you looking at. She starts asking me, \"Did you see it, Did you see it?!?!?\" I told her I did not, and what was I suppose to see? She described an object that was rectangle in shape and had two lights on the outside. I said it must have been a plane or something, but she disagreed saying no it was right above our neighbors tree. The tree is probably 35-40 feet tall. We stayed outside for a while longer and saw nothing else. We came back inside continued watching more TV and she jumps up again. This time I was close behind her and we went outside. And sure enough there it was doing a U turn hovered above our neighbors house for maybe 5 seconds and then took off. I don't know what it was I don't believe it was a plane because of how low it was."],"Object Shape":"Square, Rectagular","Tags":"City","Region":"Michigan","Date Submitted":"04/23/2008 10:30 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"44.321104","Longitude":"-85.597454","Case Number":"10645","Source":"MUFON","Log Number":"US-05032008-0008","City":"Undisclosed","trends":[],"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/10645.html.txt","/var/www/straped/mufon/mufon_json/10645.json","/var/www/straped/mufon/org/10645.html"],"Object Features":"Unknown","Object Flight Path":"Path then hovering","Summary":"2 quick viewings of rectangular object above neighbors house."}