{"Date Submitted":"05/02/2008 11:01 UTC","Summary":"Fast Moving Orange Object","Object Shape":"Sphere","Date of the Event":"05/02/2008 11:01 UTC","Tags":"City","Longitude":"-88.9548","City":"Decatur","Latitude":"39.840315","Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.840315,+-88.9548(10642)&iwloc=A&hl=en\"> mufon case (10642) map </A>","Source":"MUFON","Case Number":"10642","Object Features":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Region":"Illinois","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10642.html.txt","/var/www/straped/mufon/mufon_json/10642.json","/var/www/straped/mufon/org/10642.html"],"Weather Factors":"Unknown","trends":["There have been 14 other sightings in Decatur","There were no other sightings in Decatur on or around May 2nd 2008"],"divs":["sighting detailsi was taking my dog for a walk on the evening of may 2nd. it was a breathtakingly beautiful evening. a storm system had moved through and we had a very crisp clear evening making the stars shine brightly. as i was looking up enjoying the night sky i saw a very bright and large orange-yellowish object approaching from the south at a high rate of speed. the size comparison would have been about 1\\4 of the size of the moon in the night sky. i watch airline taffic regularly as it tracks over our house and am very familiar with all types of aircraft and their lighting configurations. this was no aircraft. it went from horizon(south to north)to horizon in a matter of seconds. there was no sound and it did not lose its brightness as it tracked north as would a satelite, its brightness remained much like a brightly lit flare would look. at first i thought it was the iss until i checked its scheduled flight patterns. it was not scheduled to be in our area until 5 hours later that day. not sure what it was other than it was very unusual."],"Log Number":"US-05032008-0005"}