{"Log Number":"US-05042008-0002","Latitude":"44.7225","Summary":"Green Glowing Fast Moving Object with a small glowing trail","Region":"Vermont","map":"<A HREF = \"http://maps.google.com/maps?q=44.7225,+-73.292778(10649)&iwloc=A&hl=en\"> mufon case (10649) map </A>","Tags":"City","Case Number":"10649","files":["/var/www/straped/mufon/html2text/10649.html.txt","/var/www/straped/mufon/mufon_json/10649.json","/var/www/straped/mufon/org/10649.html"],"divs":["Sighting DetailsMy Friend and I had just finished a day and evening of fishing on Lake Champlain. We went to the local outside Snack Bar. As we were waiting for our food, I first noticed a Geen Glowing Pulsating object coming at us from the Southeast and heading acrossed our position heading Northwest. There was no sound just an intense brightness as it moved in front of us. The speed was incredible, along with the silence, and pulsating. It came in very low maybe 500 feet above us. The whole event from start to finish was maybe 2 minutes. We followed it with our eyes as it headed Northwest towards Canada. In closing I can only come to one conclusion that what we saw was a UFO. The speed, silence, and pulsating Green light, made it the only rational conclusion. One other thing it was close enough to us that when it went by it looked as it would crash because it was so low. As we lost sight of it towards Canada, I waited for some kind of crashing or explosion. None happened. I will never forget that night I was in total awe as to what my friend and I had witness. I feel very fortunate to see such a beautiful site in our night sky."],"trends":["There has been one other sighting in Grand Isle","There were no other sightings in Grand Isle on or around August 15th 1995"],"Object Features":"Unknown","City":"Grand Isle","Source":"MUFON","Object Flight Path":"Straight-line path","Longitude":"-73.292778","Date of the Event":"08/15/1995 10:20 UTC","Weather Factors":"Unknown","Object Shape":"Oval","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date Submitted":"08/15/1995 10:20 UTC","Disposition":"IFO"}