{"Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"05/04/2008 02:48 UTC","Case Number":"10648","files":["/var/www/straped/mufon/html2text/10648.html.txt","/var/www/straped/mufon/mufon_json/10648.json","/var/www/straped/mufon/org/10648.html"],"City":"cms/tg n/a","trends":["there have been 18 other sightings in cms\\tg n\\a","there were no other sightings in cms\\tg n\\a on or around"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Latitude":"31.972249","Sighting Duration":"Undisclosed","Country":"United States","Longitude":"-99.900443","Object Shape":"Undisclosed","Log Number":"US-05042008-0001","divs":["Sighting DetailsI would like the person reporting this story to report a day and time. I believe I witnessed the same object as well, but would like more info to know for sure. I had a feeling of something more as well and also photographed it because of the strange feeling about the rate of speed it was traveling at such a high altitude and also more. Please report day and approximate time so I can know if it was in fact the same object and pursue from there. Original post: My wife and I went to Erwin park, she was walking the dogs and I was flying an rc electric airplane. The air was almost still only a few clouds in the sky. I had the plane in the air just about five min. As my plane came around to the east I could see a white sphere traveling from north to south. It lookded to be about 5,000.ft up. At an angle from me about 40 deg. It's size was about the size of a thumb tack head. The sphere looked like it was just north of McKinney. It was traveling at a steady clip fairly quickly across the sky. I circled the rc plane to keep it east of me so I could keep a watch on the sphere. I saw my wife comming at a distace I turned and called to her to look and I lost site of the white sphere. She didn't here me telling her to look. But when she found out what I was saying she took some pictures of the sky. I'm inclosing one of the pictures of what she took with the camera. I think it is just a jet plane and it's vapor trail. She seems to think it is more, I'll let you decide."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.972249,+-99.900443(10648)&iwloc=A&hl=en\"> mufon case (10648) map </A>","Source":"MUFON","Disposition":"IFO","Summary":"Person reporting w/photo of object north of McKinney flying from North to South?","Date of the Event":"Unknown","Viewing Distance":"Unknown","Region":"Texas"}