{"Date of the Event":"05/03/2008 02:59 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","trends":["There have been no other sightings in Pacheco","This sighting has never been favorited."],"Country":"United States","Region":"California","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/10644.html.txt","/var/www/straped/mufon/more/10644_submitter_file1__ufodrawing1.JPG","/var/www/straped/mufon/more/10644_submitter_file2__P5150010.JPG","/var/www/straped/mufon/more/10644_submitter_file3__cologne2.jpg","/var/www/straped/mufon/more/10644_submitter_file4__cologne1.jpg","/var/www/straped/mufon/mufon_json/10644.json","/var/www/straped/mufon/org/10644.html"],"City":"Pacheco","map":"<A HREF = \"http://maps.google.com/maps?q=37.983533,+-122.075241(10644)&iwloc=A&hl=en\"> mufon case (10644) map </A>","Case Number":"10644","Weather Factors":"Windy","Tags":"City","Latitude":"37.983533","Object Shape":"Circle, Disc, Sphere, Star-like","Summary":"Multiple glowing objects at various heights and degrees hovering, zigzaging, and moving at fast rates of speed.","Sighting Duration":"06:00:00","Log Number":"US-05032008-0007","Object Features":"Unknown","Date Submitted":"05/03/2008 02:59 UTC","Longitude":"-122.075241","divs":["Sighting DetailsAt aprox. 2AM Pacific coast time I stepped out front of my residence in Pacheco, CA to have a cigarette before i was about to retire. I live near east of Martinez and west of Concord, CA about 1 to 3 miles west and about 2 to three hundred feet above Buchanan airfield with a good view of Mt. Diablo to the east. So I'm out front gazing into the clear dark sky as I do every night when smoking or not. I clearly identify the big dipper to the north as it's reaching it's zenith and various stars moving across the sky as always. Now I'm thirty one years of age and I know how stars and constellations track across our night sky. I spend no less than 10 minutes each night in poor to excellent conditions identifying stars and planets. I know that most stars visible to the naked eye tend to twinkle due to dust and various pollutants in our atmosphere. I know planets tend not to twinkle such as Mars when a few months ago was very clear and consistent nightly. I read and update myself on the latest astronomy and science as much as possible. Ok so as im smoking and gazing across the sky, I look to the east above and to the right of Mt. Diablo where I see a bright orange and white star-like object at about 40 degrees. First I think it's Venus but this object was much closer and it did not move. About three minutes of observing this object I begin to see it moving and zigzaging from east to west north to south and up and down in elevation. Now I'm a very rational thinker so I begin to eliminate all the possible reasons that this object could be behaving. After about 8 minutes now I decide to wake my sister to look. She first as I did thought it was a star or Venus but after several more minutes she too notices that the object is moving around hovering for aprox. 15-45 seconds then moving almost dancing in all directions then returning to hover and so on and so on. Now this is just the beginning as I notice more objects one of which was directly above behaving in the exact way. In all I observed 6 to 12 objects that were moving but most importantly they remained fixed in the sky compared to stars in the background that were tracking as I usually see. I witnessed two objects appear and travel due east at incredible speeds. Like I said I live very close to Buchanan airfield. I see many types of planes, Helicopters, and jets. These objects had no blinking lights, some especially the first one i saw seemed to change size. I compare it to smoke ring when blown from the mouth as it bends and changes in size. Ok so I first called 911, the dispatcher said that she would tell an on duty officer and verified my number in case they wanted to return for more info. I then called Buchanan airfield and talked to an on duty personnel who said he would take a look. No response from either. These objects were in formation, moving in directions I have never seen. In total including myself there were 4 witnesses all family and one contacted by phone who lives in Walnut Creek who also identified the first witnessed object. I took pictures and viewed through my Galileo f600x50 telescope. I have yet to look at the pics. My camera is a digital Nikon 8800 VR. I would very much like to know if anyone else saw this most incredible sighting. I'm am willing to make drawings, provide more info and anything else I can to document this sighting. This is my second ufo report and I'm quite certain that it won't be my last. Thank You, Ted Heffel (925)849-4968 (925)812-2164"],"Disposition":"Unknown"}