{"trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around May 2nd 2008","This sighting has never been favorited.",""],"Source":"MUFON","City":"San Jose","Sighting Duration":"Undisclosed","Date Submitted":"05/02/2008 05:25 UTC","files":["/var/www/straped/mufon/html2text/10653.html.txt","/var/www/straped/mufon/more/10653_submitter_file1__PassGTrackLargeGraphic.jpg","/var/www/straped/mufon/mufon_json/10653.json","/var/www/straped/mufon/org/10653.html"],"Log Number":"US-05042008-0006","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"37.343986","Tags":"City","Summary":"SINGLE BRIGHT LIGHT TRAVELS EAST ACROSS SKY.","Region":"California","Longitude":"-121.889236","Weather Factors":"Unknown","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.343986,+-121.889236(10653)&iwloc=A&hl=en\"> mufon case (10653) map </A>","Date of the Event":"05/02/2008 05:25 UTC","Country":"United States","Case Number":"10653","divs":["Sighting DetailsI WORK FOR A LARGE POLICE DEPT AND I AM UP EARLY TO GET READY FOR MY SHIFT. I WENT OUTSIDE TO GO TO MY CAR TO RETRIEVE MY COFFEE MUG. I LOOKED UP AT THE SKY TO SEE IF WAS CLEAR WITH STARS. IT WAS ABOUT 05:25 A.M.? JUST BEFORE SUNRISE. JUST BEFORE I LOOKED DOWN A LIGHT APPEARED IN THE WEST. THE LIGHT WAS AT A VERY HIGH ALTITUDE MAYBE 30,000 FEET, AND AT FIRST LOOKED LIKE NORMAL AIRCRAFT. I THEN REALIZED ITS LIGHT LOOKED ALOT BIGGER AND BRIGHTER FOR SUCH A HIGH OBJECT. THE LIGHT WAS CIRCULAR TO OVAL IN SHAPE AND WAS TRAVELING FROM WEST TO EAST ACROSS THE SKY. I WOULD ESTIMATE SPEED 700-900 MPH. I HAVE LIVED OR WORKED OFF AND ON ALL MY LIFE IN THE FLIGHT LANDING PATHS OF MAJOR AIRPORTS AND CURRENTLY WORK NEXT TO ONE. THIS LIGHT HAD NO GREEN OR RED RUNNING LIGHTS. THE LIGHT SOURCE WAS NOT MULTIPLE BRIGHT LANDING LIGHTS SEEN ON MANY LARGE AIRCRAFT. I LIVE IN A VERY QUIET REDWOOD FOREST AND THIS OBJECT MADE NO NOISE. THOUGHT POSSIBLE SATELLITE CATCHING SUNRISE BUT LIGHT DIDNT LOOK LIKE A REFLECTION AND IT DIDN'T DISSAPATE. MAYBE MILITARY FLIGHT? DON'T KNOW, THOUGHT WORTH SHARING IN CASE TIED IN WITH ANY OTHER REPORTS."]}