{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.959615,+-75.157799(10652)&iwloc=A&hl=en\"> mufon case (10652) map </A>","divs":["Sighting DetailsThis actually happened to me twice. Once when I was laying down watching the stars and another time (Ironically) when I was watching the stars and explaining to someone what I had seen the first time I saw UFO's. The First Time: I was sitting on a car and looking up in the sky for about ten minutes. I became fixated on one star that had seemed to move but I was not sure. I told my friend to watch it with me. As we looked at it. It Split into 4 seperate stars and shot into 4 differnet directions. Keeping an eye on one of them and some times each of them..They each moved in crazy directions like they were bouncing around the sky..Then they each came back together and hovered around each other for a few seconds as to communicate with one another.. then they again shot into 4 different directions and each one disapearing. Ther was no beam of light coming from them..It was not like a beam at all.. It was crazy. I was not surprised and neither was my friend just truly amazed. The second time I saw this a few years later in 1996in West Chester , Pa. Ironically when I was trying to explain to someone who was a skeptic what had happened the first time..We looked up in the heavens and I saw another strange looking star...I told my friend that it looked like the one I saw before...He was a total disbeliever..Then Strangely enough the same exact sequence of events happened again...My friend to this day is in shock about it.....I was just lucky to have experienced the same thing twice..But since then I have been looking with no luck!"],"files":["/var/www/straped/mufon/html2text/10652.html.txt","/var/www/straped/mufon/mufon_json/10652.json","/var/www/straped/mufon/org/10652.html"],"Tags":"City","Latitude":"39.959615","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 24th 1996"],"Object Flight Path":"Undisclosed","Country":"United States","Disposition":"Insufficient Data","Summary":"One Birght star split into 4 and went crazily/speraticaly in oposite directions vary fast","Date Submitted":"01/24/1996 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"Philadelphia","Case Number":"10652","Date of the Event":"01/24/1996 12:00 UTC","Weather Factors":"Unknown","Region":"Pennsylvania","Object Features":"Undisclosed","Log Number":"US-05042008-0005","Longitude":"-75.157799","Object Shape":"Star-like"}