{"Summary":"UFO filmed crossing sky followed by extremely large flash of light","divs":["sighting detailsmy husband and i were returning home around 10:00 p.m. saturday night. we live in a small city just minutes below (south of) memphis, tn. as we rounded the corner of our street, we saw a huge flash of blue light to the north of us. it appeared to come from the ground and filled an entire section of the horizon. we were stunned and actually stopped our car. this light did not appear to be \"natural\" (i.e., lightening) and we did not know what it was. later, we caught the tail-end of the 1:00 a.m. re-broadcast of the 10:00 p.m. local news by wmc-channel 5. they apparently had received many phone calls from viewers about this light and they also showed a video clip caught by a viewer by her cell phone camera. it showed what looked like a ufo crossing the sky just prior to the huge flash of light. my husband did not see the entire report, so we went to wmc's internet site and they have *nothing* on their site about this event and\\or their report. we have written to wmc, asking them to post a link about their report, as they have links to many of the news reports they have broadcast. my husband did say that in what he saw of their report, it was obvious they did not take this event very seriously but were treating it as just another weird natural phenomenon. however that may be, we would very much like to see the video again caught by the local viewer."],"Sighting Duration":"Undisclosed","Region":"Tennessee","Source":"MUFON","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Latitude":"35.155524","City":"Memphis","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/10650.html.txt","/var/www/straped/mufon/mufon_json/10650.json","/var/www/straped/mufon/org/10650.html"],"Case Number":"10650","map":"<A HREF = \"http://maps.google.com/maps?q=35.155524,+-90.03954(10650)&iwloc=A&hl=en\"> mufon case (10650) map </A>","Disposition":"Insufficient Data","Tags":"City","Object Shape":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Longitude":"-90.03954","Date of the Event":"05/03/2008 12:00 UTC","Log Number":"US-05042008-0003","Date Submitted":"05/03/2008 12:00 UTC","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around May 3rd 2008"]}