{"Summary":"11 OBJECTS IN SKY IN A SEMI CIRCLE FORMATION FLASHING IN AND OUT CLEAR DAY","City":"CaÃƒÂ±on City","Tags":"City","Object Flight Path":"Stationary,Other","Latitude":"38.445949","files":["/var/www/straped/mufon/html2text/10657.html.txt","/var/www/straped/mufon/more/10657_submitter_file1__2UFO.jpg","/var/www/straped/mufon/more/10657_submitter_file2__3UFO.jpg","/var/www/straped/mufon/more/10657_submitter_file3__UFO.jpg","/var/www/straped/mufon/mufon_json/10657.json","/var/www/straped/mufon/org/10657.html"],"Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsWE WERE HEADING TO CRIPPLE CREEK AND ON HY 50 RIGHT BE FORE THE TURN OFF TO HY 9 WE SAW SOME OBJECTS HIGH UP ABOVE THE MOUNTAIN ON THE RIGHT HAND SIDE TOWARD THE WEST WITH 2 TOWERS ON TOP. THERE WERE II LAGER OBJECTS IN A SEMI CIRCLE FORMATION FLASHING IN AND OUT OF SITE IN ABOUT 10 SECOND INTERVALS. THEY WERE NOT MOVING BUT WOULD APPEAR AND THEN DISAPPEAR. WE WATCH THEM APPEAR FOR ABOUT 30 SECS-60 SECS THEN THEY WOULD DISAPPEAR AND THEN REAPPEAR. WE WATCH THIS HAPPEN ABOUT 6 TIMES THEN THEY WERE GONE. WE WERE SO EXCITED WE MISSED OUR TURN OFF AND HAD TO COME BACK. UPON RETURNING TO HY 9 WE THEN NOTICED TWO FIGHTER JETS FLYING OVER THE 2 TOWERS WERE WE JUST WITNESSED THE UFOS 10 MINUTES EARLIER. ON THE WAY HOME THAT EVENING WE WERE ON HY 67 HEADING TO 50 WEST AND WERE WATCHING THE SKY ABOUT 830 PM AND MY HUSBANG KEPT SAYING THAT THERE WAS SOMETHING WIERD IN THE SKY IT KINDA LOOKED LIKE A PLANET BUT WAS LARGER AND BRIGHT GREEN. i TOLD HIM TO PULL OVER TO GET A BETTER LOOK WE OPEN THE DRIVER DOOR AND HE POINTED IT OUT TO ME. IT FLASHED A COUPLE TIMES THEN SHRINKED DOWN TO A PIN POINT AND WAS GONE THIS HAPPEN IN A BOUT 50 SECONDS! yES I WAS VERY HAPPY TO RETURN HOME AFTER THAT. tHEN THE FOLLWING THURSDAY MY DAUGHTER CALLED ME STATING SHE SAW A UFO IN WI SHE EMAILED ME THE PICTURES SHE TOOK ON HER PHONE. I WILL SHARE THESE WITH YOU. WHAT IS GOING ON? WHY SO MANY SIGHTINGS IN SUCH A SHORT PERIOD?"],"Log Number":"US-05042008-0010","Object Features":"None","Date Submitted":"04/13/2008 11:28 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-105.219827","Country":"United States","Case Number":"10657","trends":["There have been 6 other sightings in Cañon City","There were no other sightings in Cañon City on or around April 13th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=38.445949,+-105.219827(10657)&iwloc=A&hl=en\"> mufon case (10657) map </A>","Object Shape":"Cigar","Region":"Colorado","Date of the Event":"04/13/2008 11:28 UTC","Disposition":"Unknown"}