{"files":["/var/www/straped/mufon/html2text/10654.html.txt","/var/www/straped/mufon/more/10654_submitter_file1__williamsmay408001.jpg","/var/www/straped/mufon/more/10654_submitter_file2__williamsmay408002.jpg","/var/www/straped/mufon/mufon_json/10654.json","/var/www/straped/mufon/org/10654.html"],"Source":"MUFON","Log Number":"US-05042008-0007","Object Features":"Unknown","Longitude":"-83.757397","Object Flight Path":"Straight-line path,Path with directional change","Summary":"red to green flashing starlike object moving, object dissappearing then reappearing","Weather Factors":"None","Viewing Distance":"101-500 Feet, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.60396,+-83.757397(10654)&iwloc=A&hl=en\"> mufon case (10654) map </A>","Tags":"City","Case Number":"10654","divs":["Sighting DetailsI, went outside at 10:52 on May 3rd, 2008, and looked to the location in the sky where I had viewed two starlike objects flashing from red to green on three different nights(the previous time being on April 30th from 10:15 to 10:30(when both objects dissappeared). I had my husband, come outside to show him that there was nothing in the sky where we had viewed the objects, out of the corner of my eye, I saw a red to green flashing star-like object. The object was far to the right from where we had seen them before. We called our son, out to see this. This time we could only find one of the starlike objects. Tyler was scarred and excited. We watched this object move around, moving suddenly from left to right, right to left, moving what seemed closer to us(the colors would get brighter)and then farther away. We watched this happen until 11:00pm. and then it got really dim and dissappeared. I went in to see what time this was. I went back outside and as quick as it dissappeared it reappeared. It did this quite a few times. Scott went inside and went to bed about 11:30 and Tyler and I came back inside at 11:45, and went to bed. I tried to take photos, but when I downloaded the 3 pics, it showed nothing but blackness."],"Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","Country":"United States","City":"Cleveland","Region":"Georgia","Disposition":"IFO","Date Submitted":"05/03/2008 10:52 UTC","Date of the Event":"05/03/2008 10:52 UTC","trends":["There have been 5 other sightings in Cleveland","There were no other sightings in Cleveland on or around May 3rd 2008","This sighting has never been favorited.",""],"Latitude":"34.60396"}