{"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=38.898902,+-77.034066(10661)&iwloc=A&hl=en\"> mufon case (10661) map </A>","Country":"United States","Log Number":"US-05042008-0014","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Oval","Summary":"While taking pictures of chem-trails in my front yard I aparently photographed a ufo .","Longitude":"-77.034066","Tags":"City","Case Number":"10661","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"04/11/2008 12:00 UTC","divs":["sighting details no visual siting took place. being irritated by the chem-trails clouding up one of the few sunny days i had seen in some time. i decide i would take picture of the offensive chem-trails.i snapped a few shots standing a few feet into my front yard of the chem-trails.taking random pictures of the sky and examing them being a mild passtime of mine, i emediately took my digital camera into the house to upload the photos and check them out. the date on my camera is wrong though i dont believe these photos show a date..im not sure why but it would have been incorrect had it shown at all. i proceeded to peek threw my photos and decide on couple of them to zoom in, attempting to see the jets at the end of the newer trails. i decovered a ufo witch apears to be shadowing one of the jets making the chem-trails. i was thrilled but didn't really do much with the photo past posting it on myspace. my mother suggested just this morning 5\\4\\08 that i submit my photo to you at mufon. so here it is. i'm aware this isn't a siting description but it does atleast explain how i came about taking the photo."],"Latitude":"38.898902","City":"Washington","Date Submitted":"04/11/2008 12:00 UTC","Region":"Washington","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10661.html.txt","/var/www/straped/mufon/more/10661_submitter_file1__Chemtrails006.jpg","/var/www/straped/mufon/more/10661_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/10661_submitter_file3__Chemtrails006.jpg","/var/www/straped/mufon/mufon_json/10661.json","/var/www/straped/mufon/org/10661.html"],"trends":["There have been 82 other sightings in Washington","There was one other sighting in Washington on or around April 11th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed"}