{"City":"Mesa","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around May 5th 2008"],"Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.417064,+-111.825452(10666)&iwloc=A&hl=en\"> mufon case (10666) map </A>","Region":"Arizona","Latitude":"33.417064","Weather Factors":"Unknown","Country":"United States","Date Submitted":"05/05/2008 01:07 UTC","Log Number":"US-05052008-0004","Summary":"Brilliant Golden/Yellow Streak of Light thru Sky; Appears-Makes a Z-pattern then disappears in seconds.","Case Number":"10666","Sighting Duration":"00:00:02","Object Flight Path":"Path with directional change","Longitude":"-111.825452","files":["/var/www/straped/mufon/html2text/10666.html.txt","/var/www/straped/mufon/mufon_json/10666.json","/var/www/straped/mufon/org/10666.html"],"divs":["sighting detailsi went out to smoke a cigerette at about 1 am on the morning of may 5th. my patio faces south, and i was looking around the night sky with binoculars (for earlier tonight i had a strange sighting that continued until i arrived home at approx 11 pm, and only ended an hour or so ago *12 am*) and just took notice of all the stars i couldn't see with my naked eye. venus was at about 10 o clock in my line of sight where i began standing, and i moved to the side of the patio-putting venus at about 1 o clock in my sight. i had just put the binoculars down when a flash of light, up and to my right, caught my eye. i quickly looked up and saw a golden\\yellow ball of light shot through the night sky-it seemed to maintain direction for a good half second (leaving a trail of light behind it) before quickly slowing down, making a quick 45 degree backwards movement, and shooting back forward and disappearing. this whole sequence lasted only a few seconds, but the trailing\\illuminated light left by this movement formed a slightly angled z shape (if the top and bottom lines were longer and the \\ was minimally sized at best). best i can describe it is that it shot through the sky-appearing out of nowhere-and seemed to abruptly slow down before kicking back and shooting away as quickly as it appeared. i thought initially it to be a meteor-until it made the z kick and shot off into nothingness. i've seen a few things very recently that have deeply intruiged me, but this was unbelievable. i also saw something similar (a huge streak of light) that was enormous in comparison-but i can't form the description to make it even remotely believable. it also occured during a strange night. over the last 3 weeks or so, there have been a handful of things i planned to report but never felt urged to. tonight i got on here and immediately reported it (my first one ever!)-thats how incredible this was. thanks for your time"],"Date of the Event":"05/05/2008 01:07 UTC","Source":"MUFON","Object Features":"None","Object Shape":"Fireball"}