{"Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-05052008-0001","Object Shape":"Square, Rectagular","Longitude":"-85.827218","Weather Factors":"Unknown","City":"Goshen","Latitude":"41.584472","Date of the Event":"05/04/2008 09:30 UTC","trends":["There have been 6 other sightings in Goshen","There were no other sightings in Goshen on or around May 4th 2008","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"05/04/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.584472,+-85.827218(10663)&iwloc=A&hl=en\"> mufon case (10663) map </A>","Source":"MUFON","divs":["sighting detailssunday, may 4 of 2008, i was at my grandpa house, it was about 9:20pm, and it was pretty dark. so i left the house around that time, and i started my way back home. listening to some music on my way, very distracted, when i suddenly saw some wear object in the sky. it is not like those time you look at the sky and see a plain very high. that object i was looking at, was at a very low altitude, and it had a very moderated speed, it waesnt going fast at all. ...i was shock from the first time i saw it.... so i was looking at it while i was driving, and he was in opposite direcion, so he was getting closer to me....so i saw it very clear, very very clear.... i could not believe what my eyes were looking...!!!!! it was kind of a square\\rectangle shape, it had 4 lights...one in each corner, it didnt had much color, but a very bright normal white light. so i turn into a midas or a car repair building i think it it, and i parked there,,and saw it go, then i decided to follow it... i had my computer laptop full charge in my car, but i thought that the time my computer got completly ready, i would have lost the object... i decided to follow it,,,but then this big truck got in my way, which the driver was going very slow for some reason, and saw other cars where going slow to....... and i lost the object....i tried to look for it, remembering the direction it went to, but had no luck. i was very excited, as i have allways beleive in life outside earth. i have a google picture of where it was,.. http:\\\\img521.imageshack.us\\img521\\8503\\callefe7.jpg this is how the object looked http:\\\\www.ufopictures.info\\pictures\\triangular-03.jpg thanks,,i hope you read and this is completly real"],"Case Number":"10663","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/10663.html.txt","/var/www/straped/mufon/more/10663_submitter_file1__calle.jpg","/var/www/straped/mufon/more/10663_submitter_file3__CAlvarezJrSquare.jpg","/var/www/straped/mufon/mufon_json/10663.json","/var/www/straped/mufon/org/10663.html"],"Region":"Indiana","Country":"United States","Summary":"Saw a Square shaped UFO in Elkhart Skies","Viewing Distance":"Unknown"}