{"Date of the Event":"03/12/2008 09:00 UTC","Disposition":"Insufficient Data","Summary":"usual size, black & white, red & blue lighs underneath","divs":["Sighting Details I was at my job, working as security guard, I was sitting down when I looked up at about a 45 degree angle and somewhat to my left. It looked like there was something was wrong with the picture. There were two lights behind the tree branch in front of me. The lights were like on a police car only they were up in the sky. Noticing this I stood up and walked left away from the trees to get a better view. What I saw was at first I thought was the size of a small airplane. In retrospect, It seemed it was the the size of a stadium at least. It was rectangular the sides were wider than the rest. The middle was black and the rest was white. It looked amber because of the city lights. The running lights were under the belly but I did not see what attached them to the ship. I saw it glide west to east then make a mild turn to its right for a couple thousand yards and then head east until I lost sight of it. At first I felt I felt good that I had seen it, but after a few seconds I felt like I be put away somewhere or wisked away to to some secret location. So I talked to a contact I know and was made to feel more confident. Then I soon got on a computer to report."],"Region":"California","Case Number":"10678","files":["/var/www/straped/mufon/html2text/10678.html.txt","/var/www/straped/mufon/mufon_json/10678.json","/var/www/straped/mufon/org/10678.html"],"Latitude":"34.148208","Sighting Duration":"00:05:00","Object Flight Path":"Path with directional change","Tags":"City","Longitude":"-118.253475","Object Shape":"Square, Rectagular","Date Submitted":"03/12/2008 09:00 UTC","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.148208,+-118.253475(10678)&iwloc=A&hl=en\"> mufon case (10678) map </A>","Log Number":"US-05062008-0005","trends":["There have been 13 other sightings in Glendale","There were no other sightings in Glendale on or around March 12th 2008"],"Source":"MUFON","City":"Glendale","Viewing Distance":"Unknown"}