{"Source":"MUFON","Region":"Tennessee","Summary":"Saw a steady (non-flashing) light, moving south to north in the Eastern Sky at about 45 degrees. Less than a minute later saw a second light, identical and following the same path.","Longitude":"-87.035283","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"None","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"05/05/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.615072,+-87.035283(10676)&iwloc=A&hl=en\"> mufon case (10676) map </A>","files":["/var/www/straped/mufon/html2text/10676.html.txt","/var/www/straped/mufon/mufon_json/10676.json","/var/www/straped/mufon/org/10676.html"],"Object Shape":"Circle, Star-like","Log Number":"US-05062008-0003","Tags":"City","City":"Columbia","Latitude":"35.615072","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Columbia","There were no other sightings in Columbia on or around May 5th 2008"],"Date Submitted":"05/05/2008 09:00 UTC","Case Number":"10676","divs":["Sighting DetailsAt about 9:00 pm last night I stepped outside to smoke my pipe. (I don't smoke in the house.) I do this a couple of times every night, and usually scan the sky as I'm out, so I'm very familar with what the night sky in my area looks like. Last night as I was smoking I saw a steady, bright light moving from South to North across the Eastern Sky at about 45 degrees. It didn't flash in any way I saw. I had to step off my porch to follow it as it began to pass behind the trees in my yard. I followed it until I lost it behind the ridge line to my North. I had just returned to my porch and was processing what I had seen, trying to decide what it was, when I glanced up and saw a SECOND light, identical to the first and on the same track. I had to move off the porch again to follow this one as well, and again I followed it until I lost it over the same ridge, in the same spot, as the first. These were not like any lights I'm familar with in our sky. I'm used to seeing planes and aviation lights come and go from Nashville International Airport 40 miles to our North. These were not like any of those I have ever seen. They may have been satellites, although I have seen satellites before in our sky before and these lights I saw were several degrees brighter. And I have never seen satellites moving on a sraight South to North path before, and I have never seen two following exactly the same path so close in time and space to each other."],"Country":"United States"}