{"Date of the Event":"01/18/1985 12:00 UTC","Log Number":"GB-05072008-0003","trends":["There have been no other sightings in Dumfries","This sighting has never been favorited."],"Summary":"Sighting of unnerving group of entities followed by UFO","Tags":"City","divs":["Sighting DetailsI am hesitant to report these events but I have been unable to come up with a suitable explanation for what happened. I feel I need to tell someone and this seems to be the best way to do so. It was a cold but extemely clear January evening (I think around 8pm but I cannot be sure). I had been helping a friend move into their new home to the south of the town and had been there since 1pm. That night I decided to walk home as the sky was clear and it was just a short 1.5 mile walk down a couple of main roads and across a couple of fields. I set off around 7:30 and got most of the way home without incident. However as I hopped over the stile into the first field I noticed a strange silence, as though someone had put cotton wool in my ears. Unpeturbed I continued on my way towards a solitary tree in the distance (which I had to pass before making the right turn towards home). As I approached the tree I noticed some movement and scuffling at its base. At first I thought this must be the sheep in the field but as I got closer still I could smell a strong ammonia like odour and the movement was certainly not sheep as the sheep were moving at the opposite side of the field in a large group. As I turned back towards the tree a feeling of dread enveloped me as three strange creatures stood perfectly still in front of the tree and stared straight at me. I stood paralysed by the creatures stare, which seemed to penetrate every inch of my soul. Their eyes were large with a dull iris of white flecks. The rest of their bodies were small, about 3-4ft, I couldnt make much out in the dark but their bodies seemed atrophied in favour of those eyes. I had an intense feeling of fear and I was certain the creatures were malevolant I continued to stand, dumbfounded when one of the creatures lunged forward making an unearthly hissing sound. At this point I turned and ran, not looking back as I was so afraid I would see the creature catching up. Once I got back to the main road I heard a low humming sound which is when I looked up and saw a large v shaped object fly overhead. I cannot be sure if it was connected to the creatures but once it had disappeared I felt much better. I continued my journey home, albeit sticking to the well lit roads. I reached home at 10pm, which surprised me as the journey should have taken less than 45 minutes. To this day I am still haunted by the eyes of those entities and have never told anyone of my experiences until now. Thank you for listening."],"map":"<A HREF = \"http://maps.google.com/maps?q=55.070859,+-3.60512(10684)&iwloc=A&hl=en\"> mufon case (10684) map </A>","Case Number":"10684","Viewing Distance":"21-100 Feet","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"None","Country":"United Kingdom","Region":"Scotland","Latitude":"55.070859","City":"Dumfries","Longitude":"-3.60512","Object Shape":"Boomerang","Object Flight Path":"Straight-line path","Date Submitted":"01/18/1985 12:00 UTC","files":["/var/www/straped/mufon/html2text/10684.html.txt","/var/www/straped/mufon/mufon_json/10684.json","/var/www/straped/mufon/org/10684.html"],"Object Features":"None","Source":"MUFON"}