{"City":"Cave Creek","Viewing Distance":"Unknown","Summary":"trapezoid, red lights on corners, floating or slow moving, very muffled vaccuum sounds, vanished before our eyes","Sighting Duration":"Undisclosed","Case Number":"10685","Source":"MUFON","Latitude":"33.836042","Longitude":"-111.944054","Date of the Event":"04/21/2008 07:15 UTC","Date Submitted":"04/21/2008 07:15 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Log Number":"US-05072008-0004","trends":["There have been 5 other sightings in Cave Creek","There were no other sightings in Cave Creek on or around April 21st 2008"],"files":["/var/www/straped/mufon/html2text/10685.html.txt","/var/www/straped/mufon/mufon_json/10685.json","/var/www/straped/mufon/org/10685.html"],"Weather Factors":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsWe live in Cave Creek and were driving home westbound on Lone Mountain between 7-7:30pm on Monday evening, 21st April. We first noticed the object as soon as we turned on to Lone Mountain from Scottsdale Rd. We could see a single bright white light and red lights, and the object was descending slowly south and east. We kept thinking it was a helicopter but as we got closer and pulled over to stop and watch, we could clearly see the outline of the object which was a trapezoid, with red lights on each corner, and as it moved at an angle it appeared to be a triangle. It was either floating and silent or moving very slowly making very muffled whooshing vaccuum type sounds. We watched until it literally vanished before us. My son took a photo with his cell phone and the time stamp is 7:31pm, we had been watching it several minutes prior. It was as close to the ground as the distance of flying a kite really high. We were fascinated and in awe, felt no fear. When we arrived home we called family members to talk about what we just witnessed and were excited to see it on the news that evening. We have been in this area for some time and are intimately familiar with air traffic patterns from the local airports Deer Valley, Carefree, and Scottsdale. This was not a plane and it was not a helicopter. We are amused by the claims of balloons and flares and while we don't know what it was, we know what is was not and it was not balloons and flares. No way! How would those items create the distinct shape of a trapezoid and where's the explanation about how it traveled from the Deer Valley area east through the thousands of acres of state land peppered with gigantic above ground electrical towers. We are also a military family and have been around military bases and military aircraft for years, this is unlike anything we've ever seen. We will be watching the skies and hope to post some good pictures for you. Only humans are pretentious enough to think they are the only ones in the Universe or the only Universe for that matter. Thank you for having this forum to report and share this information!"],"Region":"Arizona","Object Shape":"Other","Country":"United States","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.836042,+-111.944054(10685)&iwloc=A&hl=en\"> mufon case (10685) map </A>"}