{"trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around May 6th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.960862,+-84.539963(10682)&iwloc=A&hl=en\"> mufon case (10682) map </A>","Latitude":"33.960862","Log Number":"US-05072008-0001","divs":["Sighting DetailsI live and was in North Atlanta (Buckhead) Ga. when this event took place. I was looking in the direction of a neighboring county, Cobb, specifically at an area where Dobbins Airforce Base is located. I had been star gazing for a couple of hours with a friend of mine named Chris. Around 4:00 a.m. or so, I turned to my right to move the telescope to a different area of my terrace. Upon turning to my right, I immediately noticed a very bright roundish object that seemed to be emitting different colors almost in a sort of loop pattern. The position of this object in relation to the horizon and area of the sky was nothing but an anomaly. I quickly grabbed my binoculars to view this object. This object was not very far above the horizon which led me to believe it was not very high in the sky. As I began to look at this thing, it began to move to the right. The object then stopped again for a second and then moved upwards at an unusual rate of speed and then became still and then moving very swiftly to the right. These movement clearly were not those of anything that I am aware of and confirmed my suspicion that I might be viewing a u.f.o. At this point, I called for my buddy Rob to come check this out. He was a few yards behind me. I asked him again to hurry up and look at this thing. At the moment Chris turned around and made visual contact with this object, it instantly vanished. The lights went out and I want to say it seemed to have vanished in an upwardly fashion but I honestly can't confirm this because of how fast it disappeared. I asked him if he saw anything and replied yes and what the hell was that. He says he saw a bright ball for a half second disappear into thin air. My next statement is probably unrelated but I feel it should be mentioned. Around an hour after this incident while standing on a different terrace, my friend and I witnessed two separate shooting stars both strangely either with the same trajectory or very close. The second \"shooting star\" appeared to have left a cloud trail where the end looked like a half circle shape. We both agreed that these meteors were unusual in how quick and bright they were. The location of this shooting stars were not near the u.f.o. sighting. Also, a few days prior to this incident, I spotted a bright round object in the sky that was emitting multi colors similar to this one. However, I presumed it was a bright star or planet but was compelled to run inside to grab a camera to take a picture. Upon returning from inside, the object was gone. I was absolutely stumped on how this planet or star could have just vanished. It was on my mind even the next day. I mention this prior sighting because I'm wondering if this object was the same or similar to the recent sighting. The position however in the sky was almost opposite from each other. Basically, a difference of around 180 degrees of difference now that I think of it. This sighting made me feel very exited and I remember while watching the craft or object an internal sense of something. I can't explain this feeling really. It was not a bad feeling however. Please let me know if you need any other information or a picture of the area where I saw this event. Also, I forgot to mention that I live on the 20th floor (very top) of a condo building and have a very large terrace which is where I was on this night. The terrace and another balcony I have are on three parts of the building giving me a very wide view of almost the entire skyline. I view the night sky looking at stars and planets about once or twice a week for the last year and this is the first sighting of a u.f.o. that I've ever seen. Please let me know if you need anything else. Regards, Scott L. P.S. - I'm 32 years of age, male, and work as a network technician mainly doing contract work. I'm not on medication and have never had any mental problems. I was very clear headed during this matter."],"Weather Factors":"None","Country":"United States","Date of the Event":"05/06/2008 04:00 UTC","Disposition":"Insufficient Data","Object Shape":"Sphere, Star-like","Tags":"City","files":["/var/www/straped/mufon/html2text/10682.html.txt","/var/www/straped/mufon/mufon_json/10682.json","/var/www/straped/mufon/org/10682.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"10682","Longitude":"-84.539963","Object Features":"Unknown","Date Submitted":"05/06/2008 04:00 UTC","Viewing Distance":"Over One Mile","Summary":"Witnessed a round like object emitting multi colors move strangely over Atlanta air force base.","Source":"MUFON","Region":"Georgia","Sighting Duration":"00:03:00","City":"Marietta"}