{"Region":"Texas","Object Features":"Unknown","divs":["sighting details it was approximately 2 in the morning and i was on cq (charge of quarters) for my company, hhc. my buddy who was also on duty with me stepped outside for a smoke break and noticed what at first appeared to helicopters doing gun runs in the distance. he alerted me to this and i came outside to watch as doing so is rather interesting. it was about 1 minute into it when we noticed that these supposed helicopters were flying way too fast and actually seemed to be \"zooming\" from left to right at incredibly fast speeds. they were lit up with what looked to be like red and white lights but at a constant glow, however dimming from time to time. the thing that freaked me out though was the fact that they were mimicking ah-64 apache attack gun runs! how a gun run works is they start from the left or the right and swoop down and launch their rockets and what not at a target on the ground. these objects were doing these same motions from right to left, at what looked to us speeds that definitely cannot be achieved by our aircraft. they would do these motions one right after the other and sometimes looked as though they were racing! once one had swooped from the right to left it would fly back from left to right at a vertical zig zag motion, which our aircraft definitely cannot do at the speeds these things were flying. they continued to do these \"gun runs\" for about 5-10 minutes and the glow of the ships seemed to pulsate. our best guess for the distance from us would be about 1-2 miles. it was a partly cloud night but the craft were well below any clouds. we both watched this event and were freaked out afterwards because we debunked all possibilities of it being any type of military aircraft. after about 10 minutes of watching these lights they simply just vanished, almost as if they were never there. my buddy and i felt uneasy at the fact that we might have just seen ufo's. i have been in the army for 4 years and have a vast knowledge of our weapons and technology and can honestly say that these lights\\ships were not anything human."],"Object Flight Path":"Straight-line path,Path with directional change,Other","Disposition":"IFO","Source":"MUFON","Summary":"Two objects chasing one another at fast speeds","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/10680.html.txt","/var/www/straped/mufon/mufon_json/10680.json","/var/www/straped/mufon/org/10680.html"],"Latitude":"31.265823","Longitude":"-97.73839","Case Number":"10680","Date Submitted":"04/27/2008 02:00 UTC","trends":["There have been 6 other sightings in Fort Hood","There were no other sightings in Fort Hood on or around April 27th 2008"],"Date of the Event":"04/27/2008 02:00 UTC","Weather Factors":"Windy","Country":"United States","City":"Fort Hood","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.265823,+-97.73839(10680)&iwloc=A&hl=en\"> mufon case (10680) map </A>","Object Shape":"Circle, Disc, Oval","Log Number":"US-05062008-0007","Sighting Duration":"00:08:00"}