{"Log Number":"IN-05082008-0007","Region":"Delhi","files":["/var/www/straped/mufon/html2text/10697.html.txt","/var/www/straped/mufon/mufon_json/10697.json","/var/www/straped/mufon/org/10697.html"],"Object Shape":"Circle, Sphere","Weather Factors":"Unknown","Object Flight Path":"Stationary","Longitude":"77.23299","Date Submitted":"07/20/1993 03:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.642938,+77.23299(10697)&iwloc=A&hl=en\"> mufon case (10697) map </A>","Disposition":"Unresolved","City":"New Delhi","Source":"MUFON","Date of the Event":"07/20/1993 03:45 UTC","Object Features":"None","trends":["There have been 4 other sightings in New Delhi","There were no other sightings in New Delhi on or around July 20th 1993"],"Latitude":"28.642938","Tags":"City","divs":["Sighting DetailsI was 13 years of age at the time of this sighting and we were residing in a 2nd storey flat in Dilshad Garden, New Delhi, India. We are a family of five, and as a teenager I was almost crazy about UFOs and other strange phenomena. At times, I would spend hours observing the night sky from our terrace with my brother or all alone but unfortunately without any optical aid. But this sighting occurred when I was not doing so. In the early hours of 20.7.1993, my brother jerked me awake from deep sleep and told about something unusual in the skies. Apparently, I realized there was a power cut which had woken up everyone in the household so early. It was exactly 3:45 a.m. I got up and saw that my parents were looking skywards from the balcony in the front of our main entrance. I got there and saw a strange light in the East North East part of the sky. It was a small round and glowing object which was golden yellow in colour and kept growing in size gradually. It was emitting a very faint green light as well. At first, it seemed to me like a plane moving in our direction and perhaps that was the reason for its continually increasing size but after observing the object for a few minutes I became quite sure that it was not the case. On careful observation, the object looked like rotating on its own axis at the same place in the sky because its glow would become slightly dull then again increase a little like a slightly unequally illuminated rotating round object would do. But I was never sure if the object was really rotating at all or just gave the appearance of such a movement. One thing I am quite sure of is that it was continually increasing in size until it was about as big as the Moon and glowed brighter than the Moon in its yellowish light. In the meantime, I also got to the terrace to have an unobstructed view of the object and to see if there were more such objects in the sky at the time. When I got to the terrace there was not much change in the view of the object. It was the same golden yellow glowing round object slowly increasing in its size. Disappointingly enough for me, no other similar objects could be observed at the time and the sky was quite clear with no clouds visible at the time. Some high-altitude aircraft also passed through the sky visible only like a faint star which we were quite accustomed to, thanks to our past night sky observation. But the object was neither affected nor moved apparently from its place. After reaching its maximum size, it started decreasing in size and finally faded away as a star in the morning sky at about 6 a.m. Another thing to be noted is that it did not move apparently but in the course of 2 hours and 15 minutes when it was visible it seemed to move along with the stars and finally faded in the eastern sky. My brothers and parents were also witness to the phenomena along with me. In the first instance, it appeared only as the brightest star in the sky and then increased in size and then decreased and eventually disappeared. The next day again I woke up at 3:45 a.m. and my parents, brothers and myself again observed the object near the same spot where it had appeared on the last night in the East North East direction and kept increasing in size and then again decreased before finally disappearing in exactly the same manner in the eastern sky at about 6 a.m. in the morning. The sky was clear on this night also. On 22nd, 23rd and 24th of July as well, we observed the same object behaving in exactly the same manner as described above in the same part of the sky. The only differece is that the object did not always reach an equal of maximum size on different days. On 24th of July, as per my notes, it did not reach as big a size as on the first night and disappeared much in the same manner. The strangest thing that took place is that slowly I lost all interest in the phenomena which might have been due to my fantastic expectations of what a UFO should do. When I look back, I still wonder how did it happen that I just returned to my normal routine completely forgetting about the phenomena. Maybe it was sheer regularity of the phenomena which made me lose all interest at the time. After 24th of July, I did not care to observe if the phenomena continued or not, and that was the end of it. But I wonder what could be the explanation of the phenomena. At that point of time, the regular appearance of the phenomena almost assured me and my family that it is just some usual phenomena, maybe a satellite, as some ill-informed people confirmed with us, but I was never really satisfied with the explanation. After going through more literature on the subject, I have never been able to identify the object as some usual astronomical, environmental or man-made object or phenomena. In \"The Hynek UFO Report\" by J. Allen Hynek, I came across his categorical statement that no astronomical or environmental phenomena is supposed to appear as an object equal the size of the Moon and it again raised my doubts about the nature of the phenomena but without any satisfactory explanation so far."],"Viewing Distance":"Unknown","Summary":"Observed a glowing round object for about 5 days at the exact time and place which increased and then decreased in size before disappearing.","Case Number":"10697","Sighting Duration":"Undisclosed","Country":"India"}