{"Date Submitted":"11/30/1977 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsI've never really discussed this story, but have always wondered what it was that happened to us that night. A car full of girls were driving home to Marfa from Alpine. It is a desolate area there with nothing between the two small towns. In between Alpine and Marfa on the highway as we were happily driving along, a huge triangluar-shaped object with white circular lights along the underneath side along the perimeter of the triangle shape hovered so incredibly close to the top of our car. It was approximately as large as a football field in general size and was absolutely without sound. That's what I can't make sense of, for the massive object to be so close over our car, hovering there, with no sound. This went on for several seconds and then shot off in a northwesterly direction in the blink of an eye, again, with no sound. It flew away so incredibly fast I don't have words to describe it. I don't know why, but we never discussed this amongst ourselves. I moved away from Marfa after that and have not been in touch with any of those girls since then. I do wonder, though, as an adult what their impressions and thoughts are of the event. We weren't terrified and there was no screaming or crying. We were just silent as it was happening. We weren't even supposed to be out that night, much less driving over to the next town, so we just never discussed it with anyone that I know of. It wasn't a \"Marfa Lights\" phenomena. I don't believe there is a Marfa Lights phenomena, and if people have seen lights, it seems to be headlights from the highway to Presidio or probably gas emissions. I lived in Marfa from the time I was six until I was 14 and never saw a thing to indicate there were any Marfa Lights. My experience with the UFO was miles before where people pull off the road to see the Marfa Lights. In addition, my experience bears no resemblance to what people report as Marfa Lights, as this was a triangluar-shaped object hovering closely above our car with white lights around it's underbelly perimeter and flew off to the northwest, while the Marfa Lights are supposedly seen to the south, as well as miles down the road from where we were outside of Alpine."],"files":["/var/www/straped/mufon/html2text/10696.html.txt","/var/www/straped/mufon/mufon_json/10696.json","/var/www/straped/mufon/org/10696.html"],"City":"Alpine","Country":"United States","Summary":"Triangle-shaped object with round lights hovered approx. 20 feet over car","Region":"Texas","Case Number":"10696","Object Features":"Other","Log Number":"US-05082008-0006","Longitude":"-103.661012","Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.358492,+-103.661012(10696)&iwloc=A&hl=en\"> mufon case (10696) map </A>","trends":["There have been 4 other sightings in Alpine","There were no other sightings in Alpine on or around November 30th 1977"],"Tags":"City","Date of the Event":"11/30/1977 12:00 UTC","Object Shape":"Circle, Triangle","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"30.358492"}