{"Source":"MUFON","Longitude":"-81.509454","Weather Factors":"None","Case Number":"10708","Log Number":"US-05092008-0004","Country":"United States","Date of the Event":"11/11/1978 10:30 UTC","Region":"Florida","Object Features":"Unknown","Viewing Distance":"20 Feet or Less","Sighting Duration":"10:30:00","Object Flight Path":"Path with directional change","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=27.672157,+-81.509454(10708)&iwloc=A&hl=en\"> mufon case (10708) map </A>","Date Submitted":"11/11/1978 10:30 UTC","Tags":"City","Latitude":"27.672157","Disposition":"Unknown","Summary":"Like clear cristal balls flying in vertical formation around 25-or 30 transparent balls","divs":["Sighting Details Exactly I was working playing music at Armory place in Miami 28 Street and 7th ave , Fl at 10:30 PM during my resting time I went outside because I was a singer in that moment and during my rest I prefer take fresh air out side the building,in that moment a I was with 8 more persons who had same expirience we saw a group of flying balls going south and then turning to East to the sea side but sudenly they form a line one behind another always following a lidear who was going at front, No sound at all and they was high around three hundred feet above our head Ufos was flying vertically like an arc following one ball at front, I figure out they was around 25 or 30 transparent ligthnig balls with something inside of each. o ooo oooo ooooo oooooo o oooooooooooooooooooooooooo o ooooo oooo ooo o ( After,) doing sig sag left and rigth turning to East side to the Atlantic ocean I remember next day the spanish Radio was giving the news that weirds lighting balls was flying over Miami I never tell this history because people do not believe in such situacions but now it's diference more people each time believe in UFOs. Excuse my english I an a cuban who are living in Miami,Fl since 1960. I knew those balls was from other dimension or another planet but not from here, that's was thougt. And believe in them, know they are there watching us."],"trends":[],"files":["/var/www/straped/mufon/html2text/10708.html.txt","/var/www/straped/mufon/mufon_json/10708.json","/var/www/straped/mufon/org/10708.html"],"City":"Undisclosed"}