{"Country":"United States","Disposition":"Unknown","Region":"Kansas","Weather Factors":"None","divs":["Sighting DetailsA friend and I were sitting in the orchard of my back yard of my house last night (May 6th), around 7:40 p.m. Only a small segment of the sky was visible where we were sitting. Suddenly, a small black object appeared above the trees from the northeast. It was, to the naked eye, about the size of a dime or nickel and couldn't have been more than 150' to 250' feet about the ground. The object had sharply defined edges and there was a faintly visible slender protrusion of some sort coming out the bottom. It was travelling in a direct line from NE to SW at approximately 35-50 mph. From my pefspective, I would guess the object was perhaps the size of a basketball (or maybe slightly large) up close. The protrusion at the bottom was around 3' in length, I imagine. There was no sound whatsoever. I thought it had the appearance of a toy balloon with a string coming out the bottom but what little wind there was cfame from the SW--the opposite direction in which the object was flying. The trajectory was level and the object didn't deviate in the slightest from its SW course. This was no toy. It disappeared from view when it passed over the trees behind us to the SW. While I assumed it was a remote controlled device of some sort, it didn't appear capable of aeordynamic flight unless it was filled with helium or something. I've been interested in UFO's all my life and belonged to NICAP in my younger days. However, I'm not sure I've ever heard of an object that quite fits the description of what my friend witnessed last nght. FYI, I have a Master of Business Degree and am a real estate appraiser for a federal agency. My friend has a Masters Degree in English and has taught English as a second language in both Japan and the United States."],"files":["/var/www/straped/mufon/html2text/10701.html.txt","/var/www/straped/mufon/mufon_json/10701.json","/var/www/straped/mufon/org/10701.html"],"Summary":"A black, circular object approximately the size of a basketball with a +/-3' protrusion of some sort coming out the bottom.","Source":"MUFON","Longitude":"-94.810498","map":"<A HREF = \"http://maps.google.com/maps?q=38.886786,+-94.810498(10701)&iwloc=A&hl=en\"> mufon case (10701) map </A>","Object Shape":"Sphere","City":"Olathe","Case Number":"10701","Tags":"City","Object Features":"None, Appendage(s)","trends":["There have been 16 other sightings in Olathe","There were no other sightings in Olathe on or around May 6th 2008"],"Object Flight Path":"Straight-line path","Date of the Event":"05/06/2008 07:40 UTC","Date Submitted":"05/06/2008 07:40 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Latitude":"38.886786","Log Number":"US-05082008-0011"}