{"files":["/var/www/straped/mufon/html2text/10702.html.txt","/var/www/straped/mufon/mufon_json/10702.json","/var/www/straped/mufon/org/10702.html"],"City":"El Paso","Log Number":"US-05082008-0012","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Longitude":"-106.482471","divs":["Sighting DetailsMy brother and I were driving from the outskirts of town by the El Paso airport in the early afternoon in June of 1979. I had some new glasses and was seeing the world around me with renewed sharpness as I was also a photographer for the school paper. The sky had a lot of cumulo nimbus clouds and I was watching for airplanes coming in to land since we were parallel to to main runway when I noticed a bright light in the clouds in front of us. Since I wasn't driving I watched it for probably 30 seconds before I decided it wasn't a fixed wing and so then thought it was a helicopter. There were no flashing lights just the steady white light. I noticed that the light did not diffuse but had extremely defined edges. Ordinarily I would have grown bored with it at this point knowing I wouldn't be able to see the approach but then it disappeared into the cloud so I watched for it to reappear. When I saw it again it was the same shape but now it was black... no reflection, no diffusion, still very sharp edges. We were close enough now that I should be able to see the rotors and tail boom but there weren't any. This really picqued my interest because I had grown up around planes and this wasn't one. Okay so it must be a balloon. That would be a no-no this close to the airport. Then I saw it start to move. Mind you up til this point the object had been stationary relative to me so had it been a fixed wing plane it would have had to be coming directly at me to appear that way. It didn't \"start\" to move it just went from being stationary to moving with out any acceleration observed. Not a helicopter and definitly not a balloon. Now that it's moving I notice that it's following the conture of the Franklin Mountains as it moves off to my right ( North ). I watch it move into a cloud and although slightly obscured I watched it change from black back to white. I watched it til I lost it on the horizon. All this took about 10-15 minutes. I've thought about this incident many times over the years and, though I can't rule out the fact that it may be man made I have never seen anything that didn't diffuse light. The further you are from it the more diffusion you get. Simply a matter of our atmosphere. That's my story... No close encounters and no mutilated animals but I'm sure that what ever it was it is still unidentified by me."],"trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around June 20th 1979"],"Case Number":"10702","Summary":"OBSERVED EGG SHAPED CRAFT OVER AIRPORT","Date of the Event":"06/20/1979 12:00 UTC","Latitude":"31.76718","Source":"MUFON","Disposition":"Unknown","Date Submitted":"06/20/1979 12:00 UTC","Object Shape":"Egg","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.76718,+-106.482471(10702)&iwloc=A&hl=en\"> mufon case (10702) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Country":"United States","Tags":"City","Region":"Texas"}