{"Viewing Distance":"20 Feet or Less","Latitude":"61.222556","Object Flight Path":"Path with directional change","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around July 15th 1970"],"Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-149.892698","City":"Anchorage","Disposition":"Insufficient Data","Case Number":"10712","Region":"Alaska","map":"<A HREF = \"http://maps.google.com/maps?q=61.222556,+-149.892698(10712)&iwloc=A&hl=en\"> mufon case (10712) map </A>","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI have two reportings, this earlier one while I was a military dependent on Elmendorf A.F.B. in Alaska. There is not a lot to this sighting, but I did have someone sitting on his bicycle right next to me who saw the exact same thing I did. I was 14 at the time, living on base. My best friend and I had an just returned to my house from bike riding. Dusk at 9:40 or so in the evening, so stars were starting to become visible and we were discussing the next days events. And being that we were in Alaska, celebrating beautiful weather and clear skies we were having. There were only scattered clouds, mostly a clear evening. As we caught our breath and cooled off outside in the yard on our bikes, something caught our eye, what we thought was \"cool, a satellite\". We first noticed it as was moving across the sky, north to south, as if it were moving towards us and would eventually pass right over us. We watched it for about 20 seconds until we were looking almost straight up at it. Then it stopped. It didn't slow down, it just stopped, completely motionless. The object remained motionless probably about 5 seconds. THEN, it made a RADICAL zig-zag manuver, what I would describe as if you were to take a pencil and write the number 4 on a piece of paper, two or three times, as fast as you could. And then darted out of sight in what I would describe as a fraction of a second. Gone, disappeared. That's when we both turned to look each other with jaws wide open and the look of disbelief as to what we had just seen. We discussed it for about 20-30 seconds. We were both lifelong Air Force dependents and have been all kind of planes all of our lives. Our discussion was; we knew this was not an airplane, they can't stop like that or zig-zag. Helicopters are certainly not that fast, but neither are planes and satelites can't stop either. We knew at that instant we had seen something, as far as we knew, not of this earth. Of course, no one believed us. This was almost 40 years ago and as far I know, there is still no aircraft of any type that can to what this thing did. My second sighting I'll file on another report, it was about 10 years later, near Seymour Johnson A.F.B. in North Carolina. *Note: I agreed to answer additional questions about this sighting, in regards to the second sighting I had, one of the questions below, telepathy. My second sighting, once I had stopped my car to observe a craft, I experienced sudden feeling of extreme dread during, as if what I were looking at something evil, something not to be seen, as if I was not suppose to see this and I became terrified, scared beyond belief, almost panicking."],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/10712.html.txt","/var/www/straped/mufon/mufon_json/10712.json","/var/www/straped/mufon/org/10712.html"],"Date of the Event":"07/15/1970 09:40 UTC","Object Features":"Unknown","Summary":"Appeared star-like","Weather Factors":"Unknown","Log Number":"US-05092008-0008","Date Submitted":"07/15/1970 09:40 UTC"}