{"Summary":"blue gray blimp-cigar shaped object.","City":"Westminster","Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.838573","files":["/var/www/straped/mufon/html2text/10714.html.txt","/var/www/straped/mufon/mufon_json/10714.json","/var/www/straped/mufon/org/10714.html"],"Weather Factors":"Unknown","Object Shape":"Blimp","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around May 15th 1980"],"Case Number":"10714","Sighting Duration":"Undisclosed","Log Number":"US-05102008-0002","Tags":"City","Object Features":"None","Longitude":"-105.033405","divs":["Sighting DetailsI was sitting in my backyard writing a letter. I glanced up for a second and then realized there was something strange flying about a half mile north of me. It was blimp shaped and was blue-gray colored. About the color of the mountains at dusk. It appeared to be about the size of a football field. I tried to get the attention of my wife, who was in the lower level vacuuming. I beat on the window ,but she couldn`t hear me. I then went to the top of my deck and i could still see the object. I had no film in my camera, but ran in to get my binoculars. When i went back out it was gone. There was no sound, only a small plane taking of from Jeffco airport. The object was moving very slowly from west to east and the top of it was about level with the airport which is across the valley north of my house. There also were no windows or and kind of seams visable. There were no neighbors outside, so i don`t think anyone else on my block saw it. I have no idea how something that large could vanish in the few seconds that it took me to go inside and go back out!"],"Source":"MUFON","Disposition":"Unknown","Country":"United States","Date of the Event":"05/15/1980 04:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.838573,+-105.033405(10714)&iwloc=A&hl=en\"> mufon case (10714) map </A>","Date Submitted":"05/15/1980 04:15 UTC","Object Flight Path":"Straight-line path"}