{"Summary":"VORTEX...VORTEX ...VORTEX!!!!!!!!","Region":"Oklahoma","Sighting Duration":"12:59:59","Longitude":"-97.091187","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","Disposition":"Insufficient Data","Latitude":"35.014712","trends":["there have been 2 other sightings in cms\\tg n\\a","there were no other sightings in cms\\tg n\\a on or around april 30th 2008"],"Weather Factors":"Windy, Lightning, Fog, Light","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Source":"MUFON","City":"cms/tg n/a","divs":["Sighting Details FIRST NOTICED DURING CAMPING TRIP OVER JULY 4,2007 HOLIDAY.I WAS WATCHING FIREWORKS IN THE DISTANCE AND SAW DIFFERENT KIND OF LIGHTS. AS I LOOKED HARDER,I SAW MORE,AND MORE.I BEGAN GOING TO THE AREA MORE AND SEEING MORE LIGHTS,SOME HOVERING,SOME TRAVELING SLOWLY,SOME @ PHENOMINAL SPEED.LIGHTS OF RED.GREEN,WHITE,AND BLUE IN DIFFERENT AND CHANGING CONFIGURATIONS. AT FIRST I JUST OBSERVED THEM,WONDERING WHY I WAS NOT HEARING ANYTHING ABOUT THEM ON THE NEWS OR IN THE PAPERS.I RECENTLY GOT A USED CAMERA AND BORROWED A CAMCORDER AND BEGAN TAKING PICTURES OF THEM.THEY APPEAR TO BE MAPPING AN EVER-EXPANDING AREA OF THE GROUND AND OR SKIES IN A GRID PATTERN.THEY SET UP IN MANY LOCATIONS IN MANY SHAPES,MOSTLY TRIANGLULAR,SEEMING TO POSSIBLY POINTING THE WAY TO SOMEONE TO SOMEWHERE.I CAN ONLY SEE THEM AT NIGHT AND I AM CONVINCED THAT THEY KNOW WHEN I AM FILMING THEM. I DO NOT KNOW WHY,BUT I AM SURE THAT MY WIFE AND I ARE ALLOWED TO SEE AND FILM THEM.THERE ARE AT LEAST A COUPLE OF DOZEN OF THEM NOW,BECOMING INCREASINGLY BOLD AND ACTIVE.WE GO OBSERVE THEM WHENEVER WE CAN AFFORD GASOLINE AND NOW HAVE ABOUT SIX HOURS OF VIDEO OF THEM.THE TAPES ARE 8MM AND I DO NOT HAVE A WAY TO PUT THEM ON THE COMPUTER. THE STILLS WE HAVE ARE DOWNLOADED BUT I DO NOT KNOW HOW CONCLUSIVE THEY ARE.WOULD LIKE TO HAVE OPINION OF REPUTABLE UFOLOGIST. POSTED 5-10-2008."],"files":["/var/www/straped/mufon/html2text/10715.html.txt","/var/www/straped/mufon/mufon_json/10715.json","/var/www/straped/mufon/org/10715.html"],"Tags":"City","Case Number":"10715","Object Shape":"Cigar, Circle, Cylinder, Diamond, Disc, Fireball, Flash, Sphere, Square, Rectagular, Star-like, Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.014712,+-97.091187(10715)&iwloc=A&hl=en\"> mufon case (10715) map </A>","Date Submitted":"04/30/2008 12:00 UTC","Log Number":"US-05102008-0003","Object Features":"Window(s), Wings, Other, Unknown","Date of the Event":"04/30/2008 12:00 UTC"}