{"files":["/var/www/straped/mufon/html2text/10720.html.txt","/var/www/straped/mufon/mufon_json/10720.json","/var/www/straped/mufon/org/10720.html"],"Region":"Vermont","Weather Factors":"Unknown","City":"Montpelier","Object Flight Path":"Other","Date of the Event":"05/11/2008 01:32 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.267029,+-72.571687(10720)&iwloc=A&hl=en\"> mufon case (10720) map </A>","Object Shape":"Star-like","Summary":"Intense bright white star-like light in sky, hovering, shifting left to right, up and down","Date Submitted":"05/11/2008 01:32 UTC","Viewing Distance":"Over One Mile","Longitude":"-72.571687","trends":["There have been 4 other sightings in Montpelier","There were no other sightings in Montpelier on or around May 11th 2008"],"Latitude":"44.267029","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsAt approximately 1:15 am, I was driving home from Waterbury Center on Rte 89 South to the Montpelier area. Around the Bolton Flats area, I noticed the light at about 1 o'clock, rather low in the sky. I have seen Military helicopters in this area before, so didnt think much of it, except that there were no colored beacons blinking. I got off the Montpelier exit, drove through town, etc. Once on my road, Towne Hill Road, approximately a half a mile from my house, I looked at my house to see if any lights were still on, if my wife was still up, and noticed the light above my house above the treeline. As I dropped into the small valley, the light seemed to shift to the left very quickly, and shift back to the right. This is when I began to focus my attention on it. As the road straightened and climbed to my drive way, the light dropped down, disappearing behind the treeline, and then popped back up again! I almost pulled into my driveway, but no way was I going to bed now. I passed my driveway for a better look. I turned right onto Gallison Hill Rd, approximately .4 miles past my house, and pulled over onto Wheeler Rd, turned off my lights, and shut the car off. I watched the light for about 5 minutes, and it seemed to hover around, but was not completely stationary. It wasnt moving steady, it was erratic and non-frequesnt. I got out, and walked several feet to a spot where I could see the light through a pair of V-shaped branches on a tree, and marked the ground with my foot. I stood still there for at least ten minutes, and watched the light shift back and forth, from branch to branch, sometimes further. It also moved up and down, but mostly left to right. It was erratic too, and if you only glanced, you might not even notice the movement, it was subtle. I then called Montpelier Police Department, and reported it. They told an officer, and I watched this for another ten minutes. I called again, and asked if the officer was coming, and was told that he did see it too, and was headed my way eventually. He did show up, and got out, and I asked if he thought it might be a helicopter. He said that he noticed it the night before in the same general area, so I started thinking it was a planet. It was a very clear night, and I did also see at least 4 shooting stars that night. Then it moved, which seemed to startle the officer, and he said \"Wow, that really is moving, huh\". We watched it for a few minutes, and he had to respond to another call. He suggested that it could be anything, a helicopter, even someone's toy. Anyway, he left, and I went home and got a digital camera. I returned to the exact same spot, and the light had moved to the right a bit more, behind the right branch. I attempted to tape it, but pretty sure its all blackness. I did check the time though, and \"narrated\" what I was seeing. I then moved to the U32 High School, approximately .3 miles further down Gallison Hill Rd for a better look. I tried again to film the light, resting the camera on my sunroof, but the lights in the parking lot made it difficult to see. I could not see any other stars in the sky, but definitely could still see the light. I walked to the football field, away from the parking lot lights, and leaned against the southeast corner of the announcer's tower to watch and film the light. I held the camera against my belt, the most stable thing I could think of around. The light was directly above a lightpole for the field, approximately a quarter's length above it. It continued to shift back and forth to the edges of the lights on the pole, extending beyond them occaisoinally. I again checked the time on my cell phone and narrated what I was seeing. I now decided that it might be a good idea to get another angle, to try and triangulate the light. I got back in my car and drove to Rte 2, and headed East. I saw a State Trooper K-9 Unit pulled over in Dudley's parking lot in East Montpelier, and asked him if he was looking at a bounching light in the sky. He laughed and said he was just waiting. He did have a clear view of the light though, and I told him about calling the Montpelier Police and pointed out the light. Im sure he watched it afterwards if he wasnt before. I continued East on Rte 2 to Twinfield Union School in Plainfield, and parked my car out back, and walked to a large Pine Tree. There was a row of five trees, I leaned against the middle tree. The light was just on the right edge of a treeline, and I had to crouch a little to see it. Again, I checked the time, and tried to film and narrate what I was seeing. As I filmed I had to keep crouching to maintain sight of the light. I got back in the car, and drove East on Rte 2 again, and turned right onto Rte 232 after passing through Marshfield. I traveled for a few miles, looking for a good spot to pull over with a good visual reference, finally stopping at a \"Hidden Drives\" sign just before Peacham Pond Rd. I walked back and forth on the side of the road, next to the sign and a large crack running across the road, until the light was behind the trunk of a large tree, and marked the ground with my foot. Again, I checked the time, tried to film, and narrated a little. So far the light hadnt done anything but shift back and forth a bit, so I was really starting to think it was merely a Planet or Star. I continued south on Rte 232, until it met Rte 302. I turned right, and pulled over after a hundred feet and spotted the light through two posts on a road sign. It was getting pretty routine at this point, so I dont think I filmed anything, but noticed that it was amost 3:30 am now. It seemed to be in the same direction every time, and didnt go far, just hovered. I was tired. I headed home, traveling west on Rte 302, and never really lost sight of the object. When I got home, it seemed to be in the exact same position as it was when I forst spotted, despite all the stars having moved a litte. It was 4am when I got home, and I went to bed. Just before I started writing this, at approximately 1am, the next day, I got in my car and drove to the U32 High School, and walked out to the football field again. It isnt quite as clear out, but I can see at least a hundred or so stars. The light IS NOT THERE! I dedided I would come back home and report this to the experts, I definitely saw something, as well as at least 2 police officers. I dont know what I saw, and I think this should be investigated. I was not under the influence of alcohol or drugs, I dont do anything like that. I did have three Rockstar Juiced energy drinks that day though. Anyway, I know exactly where I was each time, and would be more than happy to share my attempted video and pictures, as well as maybe go back to each spot and take compass headings. I have never reported a UFO before, and have always been open minded about them, and have seen quite a few documentaries on TV about UFO's. I finally saw my first UFO! PS It is late, and I am tired. I will attatch videos and pictures tomorrow!"],"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"IFO","Case Number":"10720","Log Number":"US-05122008-0001"}