{"Longitude":"-121.948707","Date Submitted":"04/29/2008 04:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"10726","Sighting Duration":"00:02:00","trends":["There have been 7 other sightings in Campbell","There were no other sightings in Campbell on or around April 29th 2008"],"Tags":"City","Region":"California","Disposition":"IFO","Viewing Distance":"101-500 Feet","Latitude":"37.291115","Log Number":"US-05122008-0007","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.291115,+-121.948707(10726)&iwloc=A&hl=en\"> mufon case (10726) map </A>","Summary":"observed a ship that had a energy field around it. 50 to 75 above trees. they saw me looking at them. they banked drop to 25 ft above trees. dead stop. i could see through field","divs":["Sighting DetailsHeard the sound of crackling and a pop. Thought it might be the trans former out back ready to blow. I went out back and took a look. It appeared to be ok. Then the line stared to crackle again driving me under the awning. What the f was that. Stepping out from under the awning, looking at the line, and in the direction I was looking saw a very low flying craft. It had a brite white light that was blinking. Their were two large lights below that,green and red, not blinking. Yet their were all these little green and red lights that were blinking. Thought it was a helo,went back in house. I sat down on the couch and said to myself, their something not right here. Well it came to me very quickly, thats no helo. Its flight path was directly over the house. Went out back, and I could see that it was about 5 houses away. No sooner did I step out from under the awning, the ship appeard to bank and change dirrection, because I felt they saw me. Ther maneuver allowed me a look at the top of the ship. I could see that the blinking white, was not blinking at all. It was running in a circular motion inside a round hump on the top of the ship. I couldnt uderstand why I was having a problem seeing what it was when it was so close. My binoculars were just inside the sliding glass door. Went and grabed them and took another look with them. I saw less, they fogged up on me and thats never happened before. Put them down, and realized they werent moving, about 3 to 4 houses away, and it size was close to 100 to 150 ft long. All of sudden my eyes picked up the energy field around it and see the ship, still very difficult to describe what it looked like. Yet I could see them they new it, so we checked each other out. I could actually see the flucktuation of the energy field, thus allowing me to see throug. I dont think think they were very happy that I could see them. Finnally they slowly moved off going into what appeared to be a cloud. It was a clear night and even though they were moving it wasnt very far. Once in the cloud, with a red flash they were gone. I thought wow thats heavy. I looked back in the dirrection where I first saw it. Thinking maybe theirs another one. Nope, but out of the corner of my eye i saw a flicker of light. I then looked back where I last saw them, and started chuckling. Once I picked up the wave the field was causing, well, they were just sitting ther. So I raised my arm, pointed my finger at them, and went bang. They mmost certainlly could see everything I was doing. This time was no fake job, out of my view in about 3 to 5 min. Now if it is alien, not much I can do about that. But if its one of ours, all I wish to say now is they were to close to me. That field was on me and I could feel it, physically. If they dont contact me and give me an explanation, apollogy, eventually I will find out who they, and I dont care who they are, no what I meen. They will find out what a 3 dimensional nitemare is when I go looking for them. No fence or secret program I can assure you will not stop me, and thats telling them just how I truelly f-ing feel. Thats an ass kicking coming. I hope they view this. Get their asses over to the house here and apoligze to me, like a real man should and not view me as if I dont excist and could care less. This will be the second time something like this has happened to me. I have already given them one. I will not give them another."],"Country":"United States","Object Shape":"Unknown","Date of the Event":"04/29/2008 04:30 UTC","Source":"MUFON","Object Features":"Dome, Window(s), Patterned Surface, Appendage(s)","files":["/var/www/straped/mufon/html2text/10726.html.txt","/var/www/straped/mufon/mufon_json/10726.json","/var/www/straped/mufon/org/10726.html"],"City":"Campbell"}