{"City":"Reno","Tags":"City","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/10721.html.txt","/var/www/straped/mufon/mufon_json/10721.json","/var/www/straped/mufon/org/10721.html"],"Disposition":"Unknown","Case Number":"10721","Object Flight Path":"Undisclosed","Date of the Event":"05/08/2008 11:10 UTC","Viewing Distance":"Unknown","Latitude":"39.534723","Region":"Nevada","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around May 8th 2008"],"Log Number":"US-05122008-0002","divs":["Sighting DetailsMy daughter was enjoying the evening on our patio late on a clear night and she called me out to see the airplanes. By the time I got out there all the planes were gone except one over by the airport so we stood there and chatted for a bit. Meanwhile watching the sky, I scanned overhead, to the left and then the right, seeing nothing in a matter of seconds, then I looked overhead again to see one of those bright spheres. It had just appeared out of nowhere as these things tend to do...Now I've seen them on a regular basis and am becoming comfortable but somewhat bored with seeing them. We decided to wave. These spheres do not have flashing lights and the ones that I have seen tend to just...glow..and then either disappear over the horizon or just \"dissolve\" in dimension shifts. Well, as soon as we waved the silly thing grew very bright, as if to acknowledge us, dimmed again, and continued on its way til it went out of sight. Traveling south to north. First time this happened and it does seem to indicate an intelligence...vaguely. Start waving at them guys...they are telepathic you know."],"Source":"MUFON","Date Submitted":"05/08/2008 11:10 UTC","Longitude":"-119.806943","Summary":"ORB SPHERE GLOW GROWS WHEN WE WAVE AT IT","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.534723,+-119.806943(10721)&iwloc=A&hl=en\"> mufon case (10721) map </A>","Country":"United States"}