{"Date Submitted":"05/12/2008 05:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.625355,+-74.133465(10728)&iwloc=A&hl=en\"> mufon case (10728) map </A>","Latitude":"42.625355","divs":["Sighting DetailsMy wife and I are school bus drivers. I was riding with her on her late run and we had two students left on the bus. It was 5:10 PM Monday May 12th. We would have driven right by and not seen this but one of the students pointed it it out. We were located at the intersection Rt 443 and Cole Hill in East Berne NY. This one student was adamant we give her a photo when we got them printed out. We stopped and luckily I had my digital camera. I took two photo's (it was hard to focus on it) and we had to move on to get the children home. Our two passengers were about 9 years old. They thought the clouds were just odd shaped but we thought they were something else (a UFO). We never mentioned what we thought it was to them. The object was in the middle of some low level cirrus type clouds and in the southern horizon above the top of a mountain range. In the short time that we observed it it did not appear to move much. As we drove away it appeared to fade or not be visible from a different angle."],"City":"Berne","Object Flight Path":"Stationary","Longitude":"-74.133465","Region":"New York","Country":"United States","Case Number":"10728","files":["/var/www/straped/mufon/html2text/10728.html.txt","/var/www/straped/mufon/more/10728_submitter_file1__dics1.jpg","/var/www/straped/mufon/more/10728_submitter_file2__dics2.jpg","/var/www/straped/mufon/more/10728_submitter_file3__dics3.jpg","/var/www/straped/mufon/mufon_json/10728.json","/var/www/straped/mufon/org/10728.html"],"trends":["There have been no other sightings in Berne","This sighting has never been favorited."],"Summary":"We spotted this while driving a Schoolbus on an after school run.","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Sighting Duration":"00:03:00","Viewing Distance":"Over One Mile","Log Number":"US-05122008-0009","Date of the Event":"05/12/2008 05:10 UTC","Object Features":"Unknown","Object Shape":"Disc"}