{"map":"<A HREF = \"http://maps.google.com/maps?q=43.026451,+-88.003352(10739)&iwloc=A&hl=en\"> mufon case (10739) map </A>","Tags":"City","Case Number":"10739","Object Shape":"Disc","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","Region":"Wisconsin","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There have been 3 other sightings in West Allis","There were no other sightings in West Allis on or around May 27th 1995"],"Weather Factors":"None","divs":["Sighting DetailsThursday May 27th 1995 Grace and I were sitting around and I wanted to go for a walk to get some bread sticks, well that was my reason for going out. It was a warm starry night. We were walking through the KK parkway off 76th and Oaklahoma ave., I had a feeling to turn around and I knew what it was right away. I turned to Grace and said Holy S**t theres a UFO, she said ya right then her eyes lit up and her mouth dropped. It jumped in a couple times to get close up and abducted us for over two hours. When we got back we communicated with the UFO for ten minutes. We know we heard the same thing because we told each other different parts of the same story. They said theres a star wars going on out there and they needed my help. They have been watching me and I was apart of them now, I was apart of their family. Theres good ones and bad ones, they were the good ones and they didn't want to hurt us. They came to me because they could trust me with this information. They said they would be back for me and I have seen them since, a couple years later. They also said they knew Grace had a baby and everything was going to be alright. The ship was huge it was four stories high with four rows of black mirrored windows, the windows were all together. There was alot of lights all over the ship and a natural light comming from the bottom. It was all grey. I'm going throug hypnosis to try and remember what happened the two hours I was abducted. The ship was silent and when it left it was just gone. We felt a morphine feeling with out the bad side affects, like our bodies were changed and never going to be the same. We finished our walk to get our breadsticks, when we walked in the man said you said you would be here in twenty minutes and that was over two hours ago. We looked at each other and our mouths dropped, we didn't realize the huge time lapse. He said what's a matter it looks like you just seen a ghost. We both started talking at the same time, we were like there was this UFO that abducted us. He was like just take the breadsticks for free, he was cool about it. That was about it for that night but I also have other stories about things I've seen with other witnesses. Thanks for reading my story and thanks for believing."],"Sighting Duration":"02:00:00","Longitude":"-88.003352","Log Number":"US-05132008-0011","Source":"MUFON","Country":"United States","Object Features":"Dome, Window(s)","City":"West Allis","Disposition":"Insufficient Data","Date of the Event":"05/27/1995 09:00 UTC","Latitude":"43.026451","Date Submitted":"05/27/1995 09:00 UTC","Summary":"My friend and I communicated with a mother ship that abducted us for over two hours.","files":["/var/www/straped/mufon/html2text/10739.html.txt","/var/www/straped/mufon/org/10739.html"]}