{"Summary":"Redish-orange boomerang, no markings or protrusions, flying in a tight circle counter clockwise just wisping the base of the clouds.","Sighting Duration":"00:30:00","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-05132008-0007","divs":["Sighting DetailsAbout 9-10AM on a clear partly cloudy weekday, clouds were bright fluffy popcorn shaped type.I walked out to the edge of my property just to check things out. I stopped at the cow fence at the property line and lit a cigarette. I then noticed a redish-orange boomerang shape flying in an odd tight circle counter clockwise not far from being directly overhead. I first tought it was some short of hangglder but there was NOTHING hanging from it, I watched this weird thing continue circling without any variance from this super tight circle for about 20 minutes. It then suddenly broke out of the circle,and it sorta just rolled out of the circular pattern and continued north paralell to I-75 very very slowly until it went out of my sight.If I had to judge its size, I would say by the clouds and what a regular cessna would look like where I observed this boomerang, that it was about twice the size of two cessnas placed from wing tip to wing tip. I never wished more for a camera, I was at a lose to guess what this thing was. I almost left this out....it made absolutly NO noise and no other aircraft in the area of my view. One more thing, either I was mistaken about the time or how long that I watched this thing, when I got back to the house it was nearly noon.Still baffled until this day........PRM"],"Longitude":"-82.131092","Region":"Florida","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around May 15th 2002","This sighting has never been favorited.",""],"Date Submitted":"05/15/2002 09:59 UTC","Object Features":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/10735.html.txt","/var/www/straped/mufon/more/10735_submitter_file1__McGurrinUFO.jpg","/var/www/straped/mufon/org/10735.html"],"Latitude":"29.194949","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=29.194949,+-82.131092(10735)&iwloc=A&hl=en\"> mufon case (10735) map </A>","Disposition":"Insufficient Data","City":"Ocala","Weather Factors":"None, Does Not Apply","Object Shape":"Boomerang","Date of the Event":"05/15/2002 09:59 UTC","Case Number":"10735","Country":"United States"}