{"Latitude":"40.462603","Summary":"bright light on from underneath and blue lights and a red obular light on the back","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Pennsylvania","Country":"United States","Date Submitted":"09/13/1978 10:40 UTC","Object Shape":"Blimp","divs":["Sighting DetailsIt was a cool night sometime in the month of September. or October when a group of people about five of us were standing in the cool air contemplating the stars; When we spoted a light very high up in the sky that kept coming on and going off. So I decided to get a fashlight and began pointing the flashligh at the object and kept turning the flashlight on and off. It was a one of those fashlights with a square battery, about half hour later we were about to head back into the building as we lived in a Mushroom farm in Fleetwood Pensylvania when all of a sudden a bright light cover the sky and headed towards us we were all in awed, and when I looked down the people with me were knealing and praying to god. I just continued to look at the object as it looked like a Goodyear blimp, but unlike the Goodyear blimp where you person could hear a slight fan noise. this object was quiet. The bright lights that we had seen before when it was high in the air were underneath the aircraft and they illuminated the whole spot were we stood. tTen it flew over us and on the back of the craft they were two blue lights they were humongous and those two lights was what made the aircraft look like a star when the aircraft had been high in the sky it also had a red light underneath the rear of the aircraft that blink on and off.the whole experience must of lasted for over three minutes and thru it all I just kept looking at the object. It was very quite. back then you had to be very careful who you spoke to about the experience as you would would be made fun of. as we didn't even know that we would be so advance in technology that we would even have a fax machine. I went to sleep that night, when I awoke the next morning the other people that had witness the sighting hadn't gone to sleep they had gotten into a car and driven away. I did tell a few people about what had caused them to leave in the middle of the night and after being teased for a while the whole incident was all but forgotten josue c Rodriguez"],"files":["/var/www/straped/mufon/html2text/10731.html.txt","/var/www/straped/mufon/mufon_json/10731.json","/var/www/straped/mufon/org/10731.html"],"Case Number":"10731","Tags":"City","Disposition":"Unknown","Longitude":"-75.809306","City":"Fleetwood","Date of the Event":"09/13/1978 10:40 UTC","trends":["There have been 4 other sightings in Fleetwood","There was one other sighting in Fleetwood on or around September 13th 1978"],"Object Features":"Unknown","Viewing Distance":"21-100 Feet","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.462603,+-75.809306(10731)&iwloc=A&hl=en\"> mufon case (10731) map </A>","Log Number":"US-05132008-0003"}