{"Longitude":"23.761055","map":"<A HREF = \"http://maps.google.com/maps?q=61.49816,+23.761055(10732)&iwloc=A&hl=en\"> mufon case (10732) map </A>","Tags":"City","Log Number":"FI-05132008-0004","Object Shape":"Disc, Star-like, Unknown","Region":"Pirkanmaa","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","trends":["There have been no other sightings in Tampere","This sighting has never been favorited."],"Latitude":"61.49816","Date Submitted":"05/12/2008 12:00 UTC","Object Features":"None","Summary":"Bright starlike object rose from behind the treeline and travelled sideways above a lake. There were smaller objects around.","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Case Number":"10732","Country":"Finland","Source":"MUFON","City":"Tampere","files":["/var/www/straped/mufon/html2text/10732.html.txt","/var/www/straped/mufon/more/10732_submitter_file1__ufo.JPG","/var/www/straped/mufon/org/10732.html"],"divs":["Sighting DetailsI was at my home when i noticed from my window what i first thought was a big bright star stationary just above the treeline. Until it began to move sideways and i saw how big and sparkling bright this thing was. It was travelling sideways along the treeline just above it, and dipped down few times, and even then i could see it shining through the trees. When it came to sight again there were few smaller objects around it. The object was unbeliveably bright and twinkling, about 5 times the size of the biggest star. I couldnt believe it when i saw it moving sideways, up and down, and even staying stationary sometimes. I grapped my cellphone and got a short crappy footage of it when it travelled between the trees. It was like a star had came down to earth and was now travelling above a lake. Just unbeliveable. I then ran out to the lake, so i could see it without the trees being infront of me. By the time i got there, there was nothing. I cant believe if no one else saw this. The sky was still blue and the stars werent visible yet. only the moon was up in the sky and bright. I have never seen anything like this before. I was literaly shaking."],"Date of the Event":"05/12/2008 12:00 UTC"}