{"Date Submitted":"05/11/2008 01:00 UTC","Longitude":"-84.06424","Date of the Event":"05/11/2008 01:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.01688,+-84.06424(10746)&iwloc=A&hl=en\"> mufon case (10746) map </A>","Latitude":"42.01688","Disposition":"IFO","Source":"MUFON","Sighting Duration":"00:03:01","Summary":"row of dim lights closely following commercial jet","divs":["Sighting DetailsJust after midnight (Saturday-Sunday) on May 10-11, 2008, myself and one other witness observed a commercial aircraft flying in a SE direction in the night sky over Lenawee County, MI. We were both passengers in a vehicle driving on Pawson Rd...myself in the front passenger seat and my friend directly behind me. There was light cloud cover and the stars and moon were visible. The jet aircraft visibly flew beneath the cloud cover, or, rather, the clouds did not obscure the visible anti-collision and wingtip lights. Another lit object, with no anti-collision lights nor wingtip lights, shadowed the aircraft as it flew to the SE. It kept pace, approximately 15-20 lengths behind, and apparently at a slightly higher elevation. Both myself and my friend watched the light clouds obscure the lights of the trailing aircraft as if it were passing through them or above. My friend had a set of binoculars and thought he could make out a double row of rectangular lights, i.e. a row on top of another, on this second object. We watched both aircraft fade into the distance and the glow of Adrian, MI's lights on the southern horizon. the sighting lasted for approximately 3 minutes. At no time did the second aircraft deviate from it's flight path...it kept completely static in relation to the first aircraft, as if it was trailing it very closely. If I were a UFO investigator, I would definitely contact the FAA about this one."],"Tags":"City","Log Number":"US-05142008-0007","Case Number":"10746","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10746.html.txt","/var/www/straped/mufon/org/10746.html"],"Country":"United States","Object Shape":"Unknown","City":"Tipton","Region":"Michigan","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Tipton","There were no other sightings in Tipton on or around May 11th 2008"]}