{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.592443,+-90.883798(10744)&iwloc=A&hl=en\"> mufon case (10744) map </A>","Log Number":"US-05142008-0005","Sighting Duration":"Undisclosed","Date Submitted":"04/30/2000 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Region":"Wisconsin","Tags":"City","files":["/var/www/straped/mufon/html2text/10744.html.txt","/var/www/straped/mufon/org/10744.html"],"Latitude":"46.592443","Longitude":"-90.883798","Case Number":"10744","Summary":"Luminous object spiraling upward from Lake Superior to high altitude.","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Ashland","There was one other sighting in Ashland on or around April 30th 2000"],"City":"Ashland","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Object Features":"Unknown","Disposition":"Unknown","divs":["sighting detailsmy wife and i come from new brighton, mn, which is a northren suburb of the twin cities (mpls\\st. paul). every few months for the past decade, we make short vacation trips up to north-central wisconsin, or to the north shore of lake superior. we enjoy the beauty of the lake and country around the area of ashland and washburn, in particular. when we travel to north-central wisconsin, we almost always stay overnight at the americinn on the east side of town, next to lake superior. on a may morning about eight years ago, i got up and went out to the north patio of the asland americinn to sip some coffee and smoke a cigarette. as i lit my cigarette, i scanned the lake for boats and ships. my attention was immediately attracted to what i at first took to be a bird spiraling up from the surface of the lake. i hadn't seen the \"bird\" start from on the water, but i noticed it at a low altitude and rising. the \"bird\" was rising slowly, flying in a tight upward spiral, counterclockwise as seen from above. after awhile, i became increasingly puzzled, since the \"gull\" wasn't deviating from the tight upward spiral, as one might expect from a bird. also, i noticed that the object was most brilliant when it passed through the west side of its upward spiral. curious, i watched the object for some minutes, as it continuously spiraled upward. eventually i lost sight of the object at an elevation of some 70 degrees, owing to eye strain and growing distance (altitude). using a simple tangent formula, and assuming a base distance of about a mile, the \"bird\" would have reached an altitude of tens of thousands of feet. this seems strange behavior for any bird."],"Date of the Event":"04/30/2000 12:00 UTC"}