{"Case Number":"10740","Source":"MUFON","Weather Factors":"None, Does Not Apply","City":"Spartanburg","Object Shape":"Triangle","Country":"United States","Disposition":"Unknown","trends":["There have been 2 other sightings in Spartanburg","There were no other sightings in Spartanburg on or around May 13th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/10740.html.txt","/var/www/straped/mufon/more/10740_submitter_file1__IMGkhkjk.jpg","/var/www/straped/mufon/org/10740.html"],"divs":["Sighting DetailsI was traveling home on us 29 aka east main st spartanburg sc with 2 of my employees.I own a commercial cleaning business this is my routine route every night. I saw a object which appeared to be an airplane at first glance .The object was moving at a slow rate of speed to a stand still position. My head was hanging out of the window gazing upward and I viewed the object for what seemed to be a couple of minutes. The object was triangular and appeared to resemble a stealth fighter. My co-worker riding in the front saw the same object that I did. I am not a firm beliver in UFO's,as a matter of fact until tonight I have never really thought they exist. But what I saw I cannot explain,it was not an airplane,jet or anything that would come close because of the pattern of flight. The object was traveling adjacent to my truck then slowed to a crawl speed and then seemed to hover. Suddenly,it went in the opposite direction at a slow then high rate of speed. Then I lost sight of it.The object appeared dark toned and had lights at each tip of its triangular shape. I felt arkward after I viewed the object thinking to myself what have I just saw and was talking to my employee about the sighting. The statements above are exactly what I viewed and are absolutely true!Whether it was an UFO I don't know, but it was a surreal experience."],"Date Submitted":"05/13/2008 11:30 UTC","Latitude":"34.949567","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=34.949567,+-81.932048(10740)&iwloc=A&hl=en\"> mufon case (10740) map </A>","Date of the Event":"05/13/2008 11:30 UTC","Longitude":"-81.932048","Summary":"It was triangle shaped, it had lights at every point,it was hovering-moving slow","Region":"South Carolina","Sighting Duration":"00:10:00","Log Number":"US-05142008-0001","Object Features":"Patterned Surface","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Tags":"City"}