{"Date Submitted":"08/26/2007 11:30 UTC","Date of the Event":"08/26/2007 11:30 UTC","Tags":"City","Region":"New Brunswick","Country":"Canada","Latitude":"46.995967","Disposition":"Unresolved","trends":["There have been no other sightings in New Denmark","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"CA-05142008-0008","Summary":"Highspeed white circle in the sky, about a mile or two away.","City":"New Denmark","files":["/var/www/straped/mufon/html2text/10747.html.txt","/var/www/straped/mufon/org/10747.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.995967,+-67.595661(10747)&iwloc=A&hl=en\"> mufon case (10747) map </A>","Case Number":"10747","divs":["Sighting DetailsMy friend and I were taking a late night walk on the back roads by her house- it was a cloudless night- and the sky was clear from light pollution. We began walking back to her house when I noticed a blip in the sky to my left- I stopped because it startled me. I asked my friend to stop and look for it- after about 3 seconds the blip in the sky reappeared- it could be covered by a nickel- and was around a mile or two away from us- this time directly in front of our vision- the blip lasted about 1 second or more- then disappeared. At first- we thought it was a plane... but it soon became clear that it was not. When the blip disappeared- we were both startled and searched the horizon ahead of us for it- about 3 seconds later- it appeared to our right- this time it was a bit smaller- presumably because it was a bit farther off- again this blip lasted only a second or so and disappread. We looked to our right for it to appear again- and sure enough it appeared twice more before moving too far away for us to see- each time getting smaller- but remaining to the right of our original position. The object moved faster than anything I have ever seen- spanning the entire horizon in a matter of 15-30 seconds. It was one of the most frightening and delightful experiences Ive had to date- I have never seen a UFO before or after this event- But I am convinced that nothing out or rural New Brunswick could move that fast."],"Object Flight Path":"Straight-line path","Object Features":"None, Unknown","Object Shape":"Circle","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-67.595661"}