{"Longitude":"-86.466943","Country":"United States","Object Shape":"Triangle","City":"Pittsboro","Summary":"Shiny/metalic object that was traking through sky in a tumbling manner.","Source":"MUFON","Latitude":"39.863933","Date Submitted":"05/13/2008 07:30 UTC","Tags":"City","Date of the Event":"05/13/2008 07:30 UTC","files":["/var/www/straped/mufon/html2text/10745.html.txt","/var/www/straped/mufon/org/10745.html"],"Log Number":"US-05142008-0006","Sighting Duration":"Undisclosed","Region":"Indiana","trends":["There have been no other sightings in Pittsboro","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.863933,+-86.466943(10745)&iwloc=A&hl=en\"> mufon case (10745) map </A>","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was playing in a park with my son. we were sliding head-first down a slide. At the bottom of the slide, we were on our backs looking at airplanes. That is when I noticed a triangular object that appeared to be tumbling through the sky...not falling but spinning or tumbling in a repetitive manner. It appeared as if there was one reflective side with the others being a more matte or non-reflective. It was hard to judge how high it was or how big it was since the evening was clear and there were no other planes or clouds in the sky near the object. Also, there was no appearance of vapor or exhaust emitting from the object. I tracked it across the horizon until I lost sight. It maintained a straight trajectory the entire time. No apparent changes in flight path. It appeared odd because the shape and motion that it was making as it was flying. I noticed it because it didn't have the vapor trail of a jet and it had an intermittent reflection as the \"shiny\" side came into the sunlight. I was very curious to know what it was or could be or if any one else noticed the object."],"Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"IFO","Case Number":"10745","Object Features":"Undisclosed"}