{"Viewing Distance":"Unknown","Case Number":"10742","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy 14 year old daughter came running into the house this evening quite disturbed by something. As I spoke calmly to her she said she'd heard a faint whirring sound at the same time she saw a partially illuminated disk moving in an arc thru the late evening sky. She later described that it was in plane view thru some thin tree branches and moved from the South West toward the North & North West. She described the whirring sound by blowing, almost whistling and slightly pulsating and she described the size as slightly smaller than a .50 cent piece held at arms length. It came into her range of view at the same moment as she heard the whirring sound and stayed in view for about five seconds before disappearing behind the nearby apartment buildings. She showed me the spot where she stood and where it came into view and where she last saw it and indicated its approximate speed with her hand. I had her draw a picture of what she saw; a partially lighted disc shaped object with lights on the glowing side on the edge in a crescent, which I hope to add to this report when I can scan it into the computer. She stated that she didn't know what it was when she first saw it, that the darker side was almost exactly as dark as the sky, and the brighter side was clearly visible with several lights. She was quite startled when she grasped the fact that it wasn't anything she'd ever seen before. She dashed back into the house the moment it went out of sight and was for a moment too startled to say anything."],"Region":"California","Longitude":"-122.695218","City":"Rohnert Park","Date of the Event":"05/13/2008 09:42 UTC","files":["/var/www/straped/mufon/html2text/10742.html.txt","/var/www/straped/mufon/org/10742.html"],"Tags":"City","Source":"MUFON","Disposition":"Unknown","Object Shape":"Disc","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.347737,+-122.695218(10742)&iwloc=A&hl=en\"> mufon case (10742) map </A>","Object Features":"Undisclosed","Log Number":"US-05142008-0003","Latitude":"38.347737","Summary":"Round partialy lit UFO glowing with lights on one side","trends":["There have been 4 other sightings in Rohnert Park","There were no other sightings in Rohnert Park on or around May 13th 2008"],"Date Submitted":"05/13/2008 09:42 UTC","Weather Factors":"Unknown"}