{"divs":["Sighting DetailsI was at home trying to get my new computer online. I had to go out to the garage and pull our car out. The cable guy had a amplifier up in the rafters that I thought needed to be plugged in. It was about 8pm. when I went and pulled the car into the driveway. I then got out and was about to walk back into the garage when to my southwest there was a strange object high in the sky. It was very bright so it caught my eye. When I looked at it, it appeared to be flashing different colors. Thats when I decieded to grab my cheap amature telescope and attempt to get a closer look. The telescope only came with a 50x and a 100x lens. I used the later of the two and was totally amazed at what I could see. The object must have been at some great distance but it appeared to have many colors either changing rapidly or rotating around very fast. I saw the colors blue, green, red, white, and purple distinctly. Then I began to look around in the sky for more strange things. That is when I noticed there were four of these things in the sky that I could see from my house. They were in the northeast, southeast, northwest, and southwest. From what I could see it seemed that they all had a little different signiture but the constant was that they all were flashing colors very rapidly. I have been seeing objects like this in the same positions in the sky for over a month or two and they always seem to be in the same position. For the longest time I thought they were flashing but now with the telescope I have confirmed that they are flashing. Now I'm full of questions."],"Object Shape":"Star-like","Summary":"Saw strange bright object in sky so I grabbed a telescope and was even more amazed when I saw it through a telescope.","map":"<A HREF = \"http://maps.google.com/maps?q=26.571384,+-81.946053(10749)&iwloc=A&hl=en\"> mufon case (10749) map </A>","Date Submitted":"05/14/2008 12:00 UTC","Longitude":"-81.946053","City":"Cape Coral","Tags":"City","Region":"Florida","Country":"United States","Case Number":"10749","Latitude":"26.571384","files":["/var/www/straped/mufon/html2text/10749.html.txt","/var/www/straped/mufon/org/10749.html"],"Weather Factors":"Windy","Object Features":"Undisclosed","Disposition":"Insufficient Data","Object Flight Path":"Stationary","Log Number":"US-05152008-0001","Viewing Distance":"Over One Mile","Date of the Event":"05/14/2008 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Cape Coral","There were no other sightings in Cape Coral on or around May 14th 2008"],"Source":"MUFON"}