{"Date of the Event":"05/03/2008 09:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10755.html.txt","/var/www/straped/mufon/more/10755_submitter_file1__zoom4noinh.jpg","/var/www/straped/mufon/more/10755_submitter_file2__firstshot.jpg","/var/www/straped/mufon/more/10755_submitter_file3__firstshot3rd.blowup.jpg","/var/www/straped/mufon/org/10755.html"],"City":"Moriarty","Date Submitted":"05/03/2008 09:00 UTC","Longitude":"-106.049189","Region":"New Mexico","Summary":"I was outside checking to see the trigo fire, when I saw a very bright star,just glimmering with color,when it moved about an 1\" I ran for the camera, and got one really nice shot for over 20 miles away,I watched it for 45min. to an hr. didn't move again.","divs":["Sighting DetailsWE live in McIntosh NM. at the top side, we have a view of everthing around us, and we could see the Trigo fire glow from the front yard. That night it was very clear and cool, tha smoke was being blown east due to high winds, it wasn't blowing bad that night,or I wouldn't have been able to steady the camera on the car.I had the camera a sony 5 meg. set on moon light,I must have shot 20 or more times, hoping one would be steady enough to see what it was. After sending some time in my computer room where I have a HP 6 color printer, I found this one shot that really blew me away! I'm sure it can be made alot clearer with a real pro, with computer programs to compress the pixals tighter for a clearer blow-up.I hope I can send you the first shot, not blown up so you can do it better, I'll try and describe it for you. It looks like it has two wing looking areas coming off left and right aiming down ward from a center section raising up in the middle, going upward. There are lots of colors,lite purple, green, blues, white, yellow, gray. I haven't shown many this photo, there jaw does drop alittle! I have to add, when I was younger at 17 I saw a large very bright ball come down in AZ.Mom and dad witnessed it to. When I saw this one ,All I could say was ,They came back. That night I wanted to stay out until it left, it was cool, and I have to drive school bus in the mornings up at 4 . This really did happen, and they this one looks, it's just down right Beautiful!! I've named it. But I'm gonna hold on to that for now. Sure hope you get goose bumps too! I send hours looking it,where are you from."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.99005,+-106.049189(10755)&iwloc=A&hl=en\"> mufon case (10755) map </A>","Disposition":"Unknown","Log Number":"US-05152008-0007","Viewing Distance":"Unknown","Case Number":"10755","Weather Factors":"Unknown","Latitude":"34.99005","Object Shape":"Other","Tags":"City","trends":["There have been 2 other sightings in Moriarty","There were no other sightings in Moriarty on or around May 3rd 2008","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Sighting Duration":"01:00:00","Country":"United States"}