{"Source":"MUFON","Disposition":"Hoax","trends":["There have been 9 other sightings in Texarkana","There was one other sighting in Texarkana on or around June 1st 1962"],"Object Shape":"Disc","Weather Factors":"Unknown","Region":"Texas","Tags":"City","Object Features":"Dome, Window(s), Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.430235,+-94.042868(10750)&iwloc=A&hl=en\"> mufon case (10750) map </A>","Case Number":"10750","divs":["Sighting DetailsI am 61 years old. I was about 15 at the time of the event. I do not want to waste your time or mine if you are not interested in this \"event\" that took place in my life many years ago. I know it would have been helpful in \"the day and times\" it happened but now it is probably too late to be able to add anything helpful. Like in 1964 the \"ship\" had several computers it used to run off of. That would have been news back then but now it is just tipical. There were approx. 6 or 7 larger than regular sized computers which were side by side across the top of a panel of switches and lights. It was a compact smallish \"ship\" which made a flight to another destination and joined some other creatures and men who look like us. There were 3 beautiful women of darker color and it was said that the main woman was named \"Oriana\".I had never heard of that name until that night all this happened. Recently I looked up the name by google in the computer and it said \"Oriana\" was some \"Love goddess of the night\" from the 12th century. I can see how this may all tie in now but back then I had no idea how her name tied into the evenings event--it is said acording to Wikipedia Dictionary that she is also known to be the reason males blame their night time emissions on her.It makes sense now but at 15 and being such an innocent young girl I would never have put all this together then. The things I know that no one else does right now are pretty special but I do not wish to be in the public eye or even have this read by anyone except professionals who may want some information about strange events which happened in 1964---they probably have much better up to date information right now than anything I remember from that time by now. Whenever I finally do tell what happened it must be private as it is a personal event.I would prefer to talk to a Dr. even a woman would be better. I will not tell this to the computer for all to read and that is final."],"Sighting Duration":"07:00:00","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Log Number":"US-05152008-0002","Viewing Distance":"20 Feet or Less, Unknown","Date Submitted":"06/01/1962 09:00 UTC","Latitude":"33.430235","Country":"United States","Summary":"Disc like object silently slowly seemingly gathering information low to ground very brightly white light with fog after landing and picking me up.","City":"Texarkana","Date of the Event":"06/01/1962 09:00 UTC","files":["/var/www/straped/mufon/html2text/10750.html.txt","/var/www/straped/mufon/org/10750.html"],"Longitude":"-94.042868"}