{"Tags":"City","Disposition":"Hoax","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.434715,+-94.044478(10767)&iwloc=A&hl=en\"> mufon case (10767) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10767.html.txt","/var/www/straped/mufon/org/10767.html"],"City":"Texarkana","Longitude":"-94.044478","Object Shape":"Disc","Region":"Texas","Sighting Duration":"09:00:00","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"33.434715","trends":["There have been 9 other sightings in Texarkana","There was one other sighting in Texarkana on or around June 1st 1962"],"Log Number":"US-05162008-0002","Date of the Event":"06/01/1962 12:00 UTC","Object Flight Path":"Undisclosed","Date Submitted":"06/01/1962 12:00 UTC","Case Number":"10767","divs":["Sighting DetailsI saw this disc and felt the object had living beings flying it as it slowly swept low hovering sort of slow moving zigzag like but not airplane like movements. I said as I looked upward not far from my house as I looked out my window-\"I see you and I know you are there looking at the earth near me\". I felt their pressence and I said something like this \"It's too bad you don't know us I think you would like our people-we have a lot of nice people hereon my planet-I think you would like us\". The next thing I know is I woke softly not suddenly and found two beings by my bed they were brown smallish about 3 or 4 feet tall. I was being escourted by my arms out of my home and as we got to the back steps out of my house I said :Oh-be carefull you might fall here and get hurt\" and as I looked down I saw we were all floating above the ground and out the door and they looked shocked that I was that awake (that was the feeling I got ) suddenly they did something and I heard this hum and it felt like electricity went through my spine from the top of my neck down my back and I went drowsy weakish but not kocked out just numbish. I was led up this plank that came from within the disk and it fogged a bit and I went inside and I was taken to a grate and they lifted off my gown and I was put into a large white gown--I asked why am I standing on this grate and what is the purplish light and I saw a man across the room who looked like us only larger and he answered the grate is to catch germs and the purple light is to sterilize me. I was alarmed and said but I want to have children someday and the white male said you will this only kills germs. I had heard they sterilized young retarded girls in institutions and the word sterilize frightened me.I had looked around and seeing the man I asked him \"Do you look like them and are you making me think you look like us or do you really look like us?\" He seemed very pleased that I had had that thought. He said \"I really look like you\". I looked at the creatures and said sort of alarmed \"They don't have a mouth how do they talk?\" He said \"You and I are talking yet we are not moving our mouths.\" I said \"How do they eat?\" He said \"Differently from us -don't worry about it\" I stoped thinking about it and stoped questionling but I noticed no mouth and tiny bump for nose no ears and huge eyes.I had noticed the many computer screnes above the panel of lights which they had turned to to start the ship up to take off after they had changed my gown and it took about 5 to 6 creatures to concentrate on the screnes as the waves met up with each other so it could go--then I heard him say would you like to lay down I said no sort of alarned because my Mother had just had a talk with me about 2 days before about never lying on a bed in a room with a man and the man asked me \"Why not?\" I said \"My Mother said never-ever lay on a bed in a room with a man I did not know\" the thought I could have a child ran through my mind but he said okay I said \"Where are you from\" He was looking out at the stars through a small window and he turned and asked \"Do you know where you are?\" We were looking out the window and I said \"No but I still want you to show me where you are from\" --thinking I might be able to remember if someone asked me. I then asked where are we going? He said \"We are going to Oriana\" I said is that where you are from he said something like close enough so I asumed it was a place but it was a woman he had wanted me to meet. I was standing there by him and I heard something and looked over at what looked like tiny little baby layete things on rollers about 5 of them. I asked \"What are the babies doing here and he said don't worry about that\" The same as before it went through my mind not to think about them but I was concerned about them a little bit as I did not understand just as I did not understand the no mouth thing on the brown little creatures. I looked down and I said what are they doing one brown had my arm and was about to inject something above my left wrist and I was about to be afraid and he said do you mind ? I siad why are you doing this and he said so you won't make them(the browns)sick--you could make them sick if you don't take this injection I said Will it hurt me? He said no---I said okay but they were working fast and it was quickly over and he said Won't you sit down I said okay----I sat down and did not notice at first that the chair started to lean backward---I noticed the thing going over my head (like head gear of somesort) I asked what is that? He said they just want to look at your brain waves it does not hurt so I said Okay---I went to sleep and then I woke up standing beside him getting ready to go out the other door---I had seen L. my next door neighbor (oh before I forget it my neighbors father was the only one who believed me about what had happened that night and he saw places in his yard and he believed me as well as grass never grew in thier yard ever again even untill this day in 2008.) This next part is hard even for me to believe but it happened--any way I saw a whole lot of creatures in a sort of outdoor open auditorium with a walk way upon which this gorgeous dark skinned woman walked and carried a basket of fruits I recognized grapes but not all the fruits and she went behined some sheer curtain like things and she began to I think eat the fruits and as I looked out I saw all these brown little creatures looking at her and it dawned on me that they thought she was GOD! I was so stunned I headed to the ship thingy and I looked up at thebig man and I said sort of surprised they think she is God! I blurted out we think God is a man! He said Yes-we know that. Not judgemental or scolding but non emotionally he said it--almost however like we have it wrong so to speak yet not quite it was alarming to me as a young girl--I think I had seen too much---I had a strange event after that or before that and it is scrambled just a bit as to the timeing on this but after I was out of the ship there was a table of many longer tables outside as if a type of gathering was taking place and they had big men like mine on my ship and they were behined the tables and I was one of a few other normal height people and we walked in front of the tables and the man behined the table said tell me what you know about these quetions (it was a math like Algebra 3 and I had not had Algebra 3 yet-I never caught on that well after I had it later in life either) but I said Well,I am sorry but I really do not know this but we have people ion our planet who do know these kinds of things and they are very smart! He grumbled a bit in demeanor and said \"Thats what they all say!\" I was shocked because up untill now I thought everyone had been real nice but I could tell I had come across some beings who were not as kindly mild mannered as the fellow on the ship which brought me here.One of the things I noticed first off the ship was and I was barefooted that the ground I was walking upon felt like Phillough Dough like puff pastry--like a form of ashes for better explaination. There was a man behined me at the tables and when I saw a Bible I said I know about that book and the same \"Ogar\" said \"Yeah-they all do\" I felt uncomfortable once again and the next thing I remembered was waking up in my bed with a man with a stern face saying Don't tell anyone about what happened to you --no one will believe you\" His face was above my bed on the wall the size of a large t.v. screen now-a-days yet see through and poof he was gone. That is all I remember basically about things that happened to me at the age of 15 in ---I thought it was June but it was right before school was out as I remembered telling L. in Gym CLass I think the next day---it was too good to keep but my Mother got mad and said I had a dream and I was crazy if I thought anyone would believe it---I was young and I just knew my Mother or Daddy would believe me and it was the shocker of my life to realize they did not believe me.Many years later my Mother and Daddy said they believed me -now-as I turned out to be the \"sort of person\" to believe about things but that hurt me so much not to be believed in the era it happened in. I have friends who believe me now but I have been very careful not to tell things to folks throughout these years--the only thing is this---I am worried about this earth my grandkids and the next generations to come -as we know so little in this day and age about these people and these creatures and the creatures are fightening because they don't seem to have any warmth vibes as do people--it is hard to explain but --they are not human and they are very very smart---but seemingly unfeeling.I think that could be a dangerous mix. I have requested that this be kept secret and not use my name--if it is not kept secret I guess I will just have to say I made this whole entire thing up. It will be judged true or false by those who read it anyway. I hope someone who can use this information will read it and perhaps they will gain from it. I have learned this-I will not openly go up to a space ship and I will ask God to protect me from abductions."],"Weather Factors":"Unknown","Summary":"Shiny brightly slowly hovering disc on cloudless night."}