{"Object Shape":"Oval","Object Features":"None","divs":["Sighting Detailswhile slowly driving in traffic due to an accident in the northbound lane, i noticed what i thought was a balloon approximately 1000 yards ahead and 200 hundreed yards off the west side of the highway approximately 100 to 150 feet in the air. i figured it was tied down becaues it was pretty stationary. it waved back and forth as a tied balloon would. but then it started to float up and down for what i would think was approximately 30 to 40 feet. it glinted as mylar would which is why it still seemed like a balloon. but when i noticed that it had broken free of it's mooring and did not go high in the air and only rose approximately 100 feet and then proceeded west in a straight line, and i say straight because i was coming perpendicular to it's original position and then past it. it did not travel with the wind. there was no strong breeze. it's positon originally was across the highway from the accident i was travelling past. the same time it started to move away was when the police opened the lanes. when i first noticed it i could have covered it at arms distance with a quarter. when it went west i was almost perpendicular with it. i was traveling approximately 10-15 mph, and in less than 15 seconds it went from the size of a quarter to a bb then it was gone. i stayed as slow as i could without hindering the traffic behind me so i could keep it in view as long as possible. i was on the phone with my wife at the time i saw it, and through the entire incident. i was in the left-most lane with no obstructions in my view of this object. i had no abnormal feelings or emotions about this. i do not wear glasses or contacts. i have 20-20, 20-15 vision."],"Date Submitted":"05/16/2008 06:19 UTC","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-05162008-0004","Weather Factors":"Unknown","Region":"Florida","Latitude":"26.529029","Sighting Duration":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=26.529029,+-80.058181(10769)&iwloc=A&hl=en\"> mufon case (10769) map </A>","Longitude":"-80.058181","City":"Boynton Beach","trends":["There have been 6 other sightings in Boynton Beach","There were no other sightings in Boynton Beach on or around May 16th 2008"],"Case Number":"10769","Tags":"City","Date of the Event":"05/16/2008 06:19 UTC","Summary":"oval shape off i-95 at the scene of an accident","files":["/var/www/straped/mufon/html2text/10769.html.txt","/var/www/straped/mufon/org/10769.html"],"Country":"United States"}