{"Log Number":"US-05162008-0011","Sighting Duration":"Undisclosed","Longitude":"-104.975213","Summary":"I was standing there looking at the sky scrapers in downtown denver at a club the Triangle when i noticed a large triangle covered the stars. It was very large 3 football fields to 3 miles with absolutly no sound. I still vonder if the man i kissed is et","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Triangle","Date Submitted":"08/31/2005 12:00 UTC","Latitude":"39.742154","map":"<A HREF = \"http://maps.google.com/maps?q=39.742154,+-104.975213(10776)&iwloc=A&hl=en\"> mufon case (10776) map </A>","files":["/var/www/straped/mufon/html2text/10776.html.txt","/var/www/straped/mufon/org/10776.html"],"Tags":"City","City":"Denver","Disposition":"Hoax","divs":["Sighting DetailsI arrived to an empty bar named the Triangle in downtown denver around 9 p.m.. I ordered a drink and wondered to the outside deck, wich also happened to be shaped in a triangle. Soon enough an older gent came outside to join me and probe me with questions to get an idea of who I was. I was telling him i liked the stars and that that particular building is my favorite. Someday I will get to the top of it. Just then we both noticed the stars began to disapear, covered by a large black triangle. We watched in shock as it slowly passed over the city. No lights, and deffinitly no sound as we anxiously waited for anything else to prove we really just seen a huge ufo. Right then the man grabbed me and we kissed, it must have been the moment. Still today I wonder if that man was an e.t. sharing and analyzing my reaction to something unbelievable and not easy at all to share with non-believers. Or else it's our government already advanced enough to play star wars. Augustine"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Case Number":"10776","Date of the Event":"08/31/2005 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around August 31st 2005"],"Region":"Colorado","Country":"United States"}