{"files":["/var/www/straped/mufon/html2text/10771.html.txt","/var/www/straped/mufon/org/10771.html"],"Weather Factors":"Unknown","Object Shape":"Cigar, Disc","City":"Charlotte Hall","Country":"United States","Latitude":"38.465432","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.465432,+-76.769807(10771)&iwloc=A&hl=en\"> mufon case (10771) map </A>","trends":["There have been 4 other sightings in Charlotte Hall","There were no other sightings in Charlotte Hall on or around May 15th 2008"],"Tags":"City","Date Submitted":"05/15/2008 08:54 UTC","Source":"MUFON","divs":["sighting detailsat approx. 8:54 p.m. - driving north on rt. 5 in mechanicsville, md, my passenger and myself viewed a silver cigar-shaped object in what was an otherwise clear sky with only one minimally dark cloud on a small portion of the vista. because it was so bright, it immediately caught our attention. intuitively, i knew it was like nothing i'd ever witnessed. it appeared above the treeline approximately 50 miles away from my position at eleven o'clock and stayed moving slowly, almost gliding towards a ten o'clock position. as i continued to drive, my passenger also saw the same object and as we watched it linger it seemed to turn away from us, towards the darker cloud and took on a disc like shape at that moment. it then tucked into the cloud and for approximately a minute or so we continued to watch expecting it to resurface, but it never came from outside the cloud. there were no other objects in the sky; no birds, planes, copters, transmitter towers; nothing that could be mistaken for the object. it maintained a sharp, unshadowed, bright silver color from the moment we saw it, in it's turn and through it's disappearance. when it turned, i watched to see if it would cast a shadow or show some shape\\markings\\propeller shape other than the bright silver outline, but it never changed other than from the cigar shape to the disc shape. my feelings during the sighting was that this was something special\\different. afterwards, i knew we had seen something quite out of the ordinary. since i was behind the wheel, i didnt get a chance to grab my camera, but the image is clear and of course it helps to have someone else who saw it. i will be recreating a visual for later reference."],"Viewing Distance":"Over One Mile","Longitude":"-76.769807","Summary":"Silver cigar-shaped object","Case Number":"10771","Date of the Event":"05/15/2008 08:54 UTC","Log Number":"US-05162008-0006","Object Flight Path":"Hovering then path","Object Features":"None","Region":"Maryland","Sighting Duration":"Undisclosed"}