{"Region":"Indiana","files":["/var/www/straped/mufon/html2text/10773.html.txt","/var/www/straped/mufon/org/10773.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.418372,+-86.873397(10773)&iwloc=A&hl=en\"> mufon case (10773) map </A>","Tags":"City","Date of the Event":"04/16/2008 10:30 UTC","Sighting Duration":"00:00:20","Country":"United States","Date Submitted":"04/16/2008 10:30 UTC","Longitude":"-86.873397","Summary":"Array of amber colored lights form circle, line, and move uniformly and then independently.","Disposition":"Unknown","Source":"MUFON","City":"Lafayette","trends":["There have been 30 other sightings in Lafayette","There was one other sighting in Lafayette on or around April 16th 2008"],"Object Features":"Unknown","Log Number":"US-05162008-0008","Object Shape":"Circle, Flash, Star-like, Other","divs":["Sighting DetailsI was standing on my balcony having a cigarette. I was facing South. Finishing my cigarette, I turned from South to East to North to enter my apartment building. However, a bright light in the Eastern sky caught my attention. At first, I suspected it to be an airplane that was approaching the Purdue Airport, traveling from East to West. The light was amber or light orange. It was bright enough that I thought this \"airplane\" was close enough and traveling at such a speed, that it would fly over me in under a minute's time. I judged the distance to be about 15 city blocks out. I waited for the \"airplane\" to fly over me but the light remained still and fixed in the same position of the sky. Then, the light disappeared for a fraction of a second. A fraction of a second later, 5-7 similar lights formed a circle in the same position of the sky as the first light. I wondered if it could be a flare or a firework but the circle of lights was stationary and did not move. It twinkled a small amount. Then, the circle of lights either disappeared again for a fraction of a second or they repositioned themselves very quickly into a straight line horizontally. This horizontal array of lights then appeared to move very slowly toward the North from my point of view. At this point, about 5 seconds has passed. Then, from this horizontal line of 5-7 amber colored lights, another separate array of lights, also in a line, about 5-7 in number, projected from the horizontal line, upward toward a vertical position. The way this second line projected itself was similar to the way a \"movie click board\" opens up. The angle the lines formed was open to the North. At this point, about 10-12 seconds has passed. There are two \"lines\" of amber lights forming an angle opening to the North, with each line consisting of 5-7 lights. This entire formation of lights then seemed to disassemble. The lines seemed to detach and then each light seemed to move independently. The way the lights then moved was such that they revolved around each other in various paths. Subjectively, it appeared that these lights were putting on a \"display\" or a \"light show\". Finally, at about 15-20 seconds from initially spotting the first light to this moment, I ran inside of my apartment to get my roommate to witness this event. However, when we returned, the lights were gone. I now believe the distance of the lights I witnessed to be much farther than 15 city blocks. The reason I believe this is because many witnesses from Kokomo, Indiana witnessed the same thing, but closer and to the West from their POV. Kokomo is approximately due East of Lafayette, so I deduce that this event took place somewhere in between Lafayette and Kokomo."],"Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"None","Case Number":"10773","Latitude":"40.418372","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change"}