{"map":"<A HREF = \"http://maps.google.com/maps?q=39.773416,+-86.155184(10772)&iwloc=A&hl=en\"> mufon case (10772) map </A>","Object Shape":"Other","Weather Factors":"None","Region":"Indiana","Object Features":"Undisclosed","Longitude":"-86.155184","Summary":"Oddly moving light in the sky approached and passed over the houses about 100yds away.","Disposition":"Unknown","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around May 7th 2008","This sighting has never been favorited.",""],"Latitude":"39.773416","Log Number":"US-05162008-0007","Date Submitted":"05/07/2008 12:30 UTC","Case Number":"10772","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"05/07/2008 12:30 UTC","Object Flight Path":"Undisclosed","City":"Indianapolis","Country":"United States","Source":"MUFON","divs":["Sighting DetailsOk sorry it took me so long to report this, had trouble getting the pic from phone to computer. The date and time are already listed so ill just begin. We were standing outside my friends house and he was showing me his little garden when he said something about a light that seemed odd. I looked up and indeed it was odd, it was in the distance moving back and forth slowly but the way it would sorta stop and turn back was just... odd, weird. there was a couple trees there across the street and it moved behind them from right to left. I told him to take a picture and asked what time it was, about 12 46 or so we remarked about it for a little bit and i said \"seriously what is that\" and Todd said \" well we're going to find out cause its coming towards us\" and it did, it just looked like a white light with rainbow pattern light refraction? like starburst light coming out all around it? anyway when it got closer i could see some sort of shape within the light like it was a primitive cloaking device or something it looked like the circular part of this pic that i will include in this report. It had what looked at first to me to be flashing red and blue lights but when i looked closer the lights moved from the rear to the front in sequence and it was more colors than just red and blue like green yellow and so on. the object was more north than west of us and moved over the neighbors houses maybe 100yds away in a south direction it was close maybe the size of a psp UMD or so or a pop can or something that size. this is the truth. Govt project maybe? i dont know. Robin Fox ps sorry i still cant get the pic and 15 sec vid my friend took that night from his phone to my computer, im not receiving any of his emails from phone. i am submitting this report without them so i dont lose it, i will amend the report when i can get the darn pics thank you. the pic included minus the tail is what the craft looked like."],"Sighting Duration":"00:30:00","files":["/var/www/straped/mufon/html2text/10772.html.txt","/var/www/straped/mufon/more/10772_submitter_file1__Drone2006AlabamaHeadline.jpg","/var/www/straped/mufon/more/10772_submitter_file3__CellPhonePicofUnknownCraft.jpg","/var/www/straped/mufon/org/10772.html"]}