{"Summary":"Rectangle-w/things on outside-silent-blimplike movement/flash-up-space","Sighting Duration":"Undisclosed","Longitude":"-117.243651","Object Shape":"Blimp, Flash, Square, Rectagular","Tags":"City","Disposition":"Unknown","Log Number":"US-05162008-0010","map":"<A HREF = \"http://maps.google.com/maps?q=33.940017,+-117.243651(10775)&iwloc=A&hl=en\"> mufon case (10775) map </A>","trends":["There have been 13 other sightings in Moreno Valley","There were no other sightings in Moreno Valley on or around March 31st 1979"],"Date of the Event":"03/31/1979 12:00 UTC","Source":"MUFON","Country":"United States","City":"Moreno Valley","Date Submitted":"03/31/1979 12:00 UTC","Latitude":"33.940017","Object Features":"Undisclosed","Region":"California","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10775.html.txt","/var/www/straped/mufon/org/10775.html"],"Object Flight Path":"Undisclosed","Case Number":"10775","divs":["Sighting DetailsMy wife and I were taking our after dinner walk, holding hands walking down Perris Valley Blvd. It is a short distance from March Airforce Base-maybe a mile or so from the flight line. As I looked at her I noticed her hair, about waist length, was standing straight out as if she had put her hand on a Tesla generater. She was pointing at my hair,shoulder length, standing straight out, too.As I looked beyond her head in the sky I saw a rectagular object appearing to be the size of a football field floating silently. It had some type of \"things\" on the outside of the craft. One looked like the coil on the back of a refridgerator. The other 4 ro 5 things on it, I can't remember what they looked like. It floated, slowly silently,turning one quarter turn and with a flash just seemed to disappear. As I was looking at it,I became aware of my stomach having butterflies and I had the distinct impression that I should \"look away\" but felt compelled to keep looking.When asking my wife about it, she would only change the subject.She would never even aknwowledge the sighting the next day or ever since. This happened so long ago,but I know what I saw and how I felt while seeing it.The thing was less than 500 ft. off the ground and made no noise but I felt as though there was something flowing through the air like invisible waves.It's hard to put into words. That experience is something that I wish had never hapened."]}