{"Country":"United States","Date of the Event":"05/16/2008 08:15 UTC","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Summary":"Witnessed Tylenol-shaped crafts floating across sky.","Latitude":"40.518326","Region":"Missouri","Case Number":"10777","Object Features":"None, Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-05172008-0001","City":"Elmo","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Elmo","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.518326,+-95.115532(10777)&iwloc=A&hl=en\"> mufon case (10777) map </A>","Date Submitted":"05/16/2008 08:15 UTC","divs":["Sighting DetailsI'm quite new to reporting things of this nature. In fact, it's my first report. I was unpacking my car tonight when I looked up and saw a white capsule-shaped object floating across the sky. (Think generic Tylenol...) The sun was shining on it, so I don't know if that caused the visual whiteness of the object or not. It had a black area in the middle of it that I could not make out. It was quite high, but I'm not sure of the altitude. There were several jet patterns streaking the sky and I know it was underneath those. It was silent and wingless. Not wanting to take my eyes off of it, I watched it as it calmly floated to the south until only a small pinpoint of light remained. I went in and grabbed my husband, took him outside and started to describe what it looked like to him. He said, \"You mean like that?\" and pointed. There was another one moving silently from the east to the west over us. I went inside and grabbed his binoculars while he watched it. I gave them to him but had to go inside to calm a crying three-year old. I watched him as he studied it. He looked at me through the window and shrugged his shoulders. He said even as it was moving away from him, he could see the thing had no wings. I suggested maybe it was a drone, and my husband replied, \"Well, drones at least have wings. I don't know what it was.\" I asked him if he got a good look at the dark area in the middle of the craft and he said that he couldn't, as it was moving away from him at that point. Because of the apparent jet activities in the area, maybe there were some other military exercises going on? The only thing I regret is not having my camera with me. Someone else HAD to have seen these things tonight. They were illuminated by the sun and one really couldn't miss them if they were looking up. If any of you know what a Sky-Tylenol with black markings would be, please let me know. I don't know much about things like this, as you can probably tell by my report. Thanks in advance!"],"files":["/var/www/straped/mufon/html2text/10777.html.txt","/var/www/straped/mufon/org/10777.html"],"Longitude":"-95.115532","Object Shape":"Blimp, Oval, Other"}