{"Object Features":"None","files":["/var/www/straped/mufon/html2text/10779.html.txt","/var/www/straped/mufon/org/10779.html"],"Date of the Event":"05/16/2008 12:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","Country":"United States","Longitude":"-114.831185","Region":"Nevada","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","Date Submitted":"05/16/2008 12:00 UTC","trends":["There have been 5 other sightings in Boulder City","There were no other sightings in Boulder City on or around May 16th 2008"],"City":"Boulder City","Source":"MUFON","Log Number":"US-05172008-0003","divs":["sighting detailsat sunset, i was sitting outside enjoying the evening and when i looked up i saw a very bright orange almost red light in the sky north of boulder city, nv. at first i thought it might be a very strange colored bright red star and thought that would be odd since i had never seen anything like it. then it started to move north slowly (maybe 2 or 3 minute duration). i think it blinked a few times before fading completely. then i noticed another traveling a lot faster from west to east but was only able to watch it for several seconds before that one dimmed and faded. i looked hard to see if this was a refection from the sun off of a couple of planes, but i could see nothing at all in the exact area after they faded. i did notice after the second light faded, further east, my eyes caught a black\\dark object in the sky with no lights on and it was cigar shaped. could have been a plane but i didn't hear any noise from it or see lights. all these objects seemed to be very high up but i am not a good judge of distance. i didn't think much of it with all the hoaxes around but it certainly was entertaining for the time being. it certainly was unidentified to me!"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.985871,+-114.831185(10779)&iwloc=A&hl=en\"> mufon case (10779) map </A>","Object Shape":"Star-like","Summary":"Very bright orange/red lights traveling over greater Las Vegas area","Case Number":"10779","Disposition":"Insufficient Data","Latitude":"35.985871"}