{"Latitude":"38.813808","Region":"Missouri","Summary":"Strong flickering lights in western sky","Log Number":"US-05172008-0005","trends":["There have been 15 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around May 16th 2008","This sighting has never been favorited.",""],"Object Features":"Unknown","divs":["sighting detailsmy husband and i noticed an extremely bright flickering object in the western sky last night. we have seen this on occasion, and assumed at the time it was a star. last night i looked out the window to see if the sky was still clear (we have been pounded by rain in the midwest lately). i noticed two flickering objects in the western sky, and i grabbed the binoculars to see if they were planes. they did not move like the planes we see over our home, which have a different light pattern, and typically move quicker, either heading to or from the airport. by the time we grabbed the binoculars, we were only observing one object. the other object had moved out of our sight. it looked fairly stationary, so that's why i didn't think it was a plane to begin with, but line of sight maybe created an illusion. i grabbed my sony 20x optical\\800x digital zoom 8mm video camera. i had to put it on a tripod to keep it steady as you will get extremely jerky movement trying to zoom in on distant objects with digital zoom. (very sensitive to the slightest camera movement.) i used the night shot plus option (infrared) on the camera to record. i taped about 40 minutes. during this time i had to readjust the camera several times as the object would move out of frame once i had a steady focus on it. i captured the video this morning an up loadable digital file. i edited out most of the jerky movements caused by me trying to refocus and reposition the object in the camera frame. (there still are some on the video and they are obvious quick up and down movements.) i do have some steady video clips of the object in frame and you can see the object moving left to right out of frame on its own. i put the clips together in one file. i guess this could be an extremely bright star but i do not know enough about celestial objects and how quickly they should move out of frame based on our planet's rotation. the object also gives off a rotation of colors. i am looking for professional opinions on whether this is a star or unidentified object. i have an electronic wmv file i can upload."],"Date Submitted":"05/16/2008 12:00 UTC","Tags":"City","Disposition":"IFO","Source":"MUFON","Longitude":"-90.691348","Weather Factors":"Unknown","Date of the Event":"05/16/2008 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10782.html.txt","/var/www/straped/mufon/org/10782.html"],"City":"O'Fallon","map":"<A HREF = \"http://maps.google.com/maps?q=38.813808,+-90.691348(10782)&iwloc=A&hl=en\"> mufon case (10782) map </A>","Object Shape":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"10782","Country":"United States"}