{"Log Number":"US-05172008-0005","Latitude":"36.995884","map":"<A HREF = \"http://maps.google.com/maps?q=36.995884,+-85.911922(10781)&iwloc=A&hl=en\"> mufon case (10781) map </A>","Date of the Event":"06/22/1970 12:00 UTC","Case Number":"10781","Date Submitted":"06/22/1970 12:00 UTC","City":"Glasgow","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Country":"United States","trends":["There have been no other sightings in Glasgow","This sighting has never been favorited."],"Summary":"Large round disc with lights flashing in a circular motion on the bottom","Object Features":"Window(s), Unknown","Region":"Kentucky","Longitude":"-85.911922","Tags":"City","Source":"MUFON","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI live on Barren River Lake, outside of Glasgow Kentucky, in South Central Ky. I guess I should start off with the fact that I'm not crazy, nor am I sociopathic. I live at the Water Plant on the lake, near the Narrowa Boat Ramp, just accrost the lake from the Dam. One night when I was 12, (and I'll never forget it because it was my birthday) my father called my mom & myself out to the fence on the lake. Hovering over the lake was a spherical craft, turning circularly, with the bottom covered with windows which projectred colored lights. Under the craft the lake was ablaze with the brightest light I've to this day ever seen and I'm 48. We watched this craft spin & the lights, and then all at once, it rose above the lake & disappeared into thin air. My parents told me thay had seen this once bebore about 20 years earlier on fall & timvbe creek. My fathe would not tell anyone about this for fear they would think him mad. My parents were killed in c car wreck a couple of years ago. So quite franksly, unlike my parents, I could give a sh^t less whether they believe me or not...I know what I saw."],"files":["/var/www/straped/mufon/html2text/10781.html.txt","/var/www/straped/mufon/org/10781.html"],"Object Shape":"Circle, Disc","Object Flight Path":"Stationary"}