{"Object Shape":"Cigar, Star-like, Triangle","Country":"United States","Date Submitted":"05/17/2008 08:20 UTC","Latitude":"39.07365","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.07365,+-108.545339(10784)&iwloc=A&hl=en\"> mufon case (10784) map </A>","Weather Factors":"Unknown","Log Number":"US-05172008-0007","City":"Grand Junction","Source":"MUFON","Summary":"Several bright objects spotted, appeared very high with one cigar shaped object also seen.","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-108.545339","divs":["Sighting DetailsA freind and I were practicing at a local golf course when I noticed the sound of a single engine plane going overhead. When I looked up I noticed a pair of lights in the sky. They appeared very high up and soon I notice a third dot of light below the one on the left. I asked my friend to look and asked him what was I looking at. He could see the two brighter objects but not the fainter dot below the one on the left (he wears glasses and I don't-not sure if thats the difference). As we were watching these things along comes another object from the left, moving at a consistant speed to our right. This thing is cigar shaped and immediately I assumed it was a plane because of its consistant speed and direction and I told my friend this but his response was that it was not making a contrail nor was there any noise. There were visible planes in the air, making both contrails and noise but this object was not. It actually crossed just below the other objects on it path and at some point we just couldn't see it anymore. We watched the smaller objects a bit longer but they keeped getting harder and harder to see until we couldn't see them anymore. We were both giddy for witnessing this and are thankful to have someone to share the event. We went back to practicing and a few minutes later my friend my friend exclaimed \"It's back\". Sure enough, there was a bright object in almost the same position as when first spotted. It appearred to change shape and position a bit and it occured to me that maybe the clubhouse would have binoculars I could borrow. My friend kept watching while I ran to the club house and sure enough they loaned me some low quality binoculars. On my way to join my friend I was looking up but saw nothing. He was still watching the object when I reached him so I gave him the binocs. Soon he passed them to me and I was able to pick up the object again. Through the binocs the object appeared at first as a pinpoint of light with two radians coming off one side making it look most like an arrow. While I was watching thru the binocs the object appeard to twist and change shape. It wasn't moving much at all and I confirmed this after retreiving an inclinometer from my car. The object was at about 45 degrees of elevation. Re-checking after I though it had move showed it to be at about 40 degrees. The thing gradually fadded away as if it were going higher and higher and then it was gone. We were at the cource for another hour and never saw anything again. Trust me, we were looking."],"trends":["There have been 24 other sightings in Grand Junction","There was one other sighting in Grand Junction on or around May 17th 2008"],"Case Number":"10784","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10784.html.txt","/var/www/straped/mufon/org/10784.html"],"Date of the Event":"05/17/2008 08:20 UTC","Region":"Colorado","Object Features":"Undisclosed","Disposition":"Unknown"}