{"Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10789.html.txt","/var/www/straped/mufon/more/10789_submitter_file1__tn.jpg","/var/www/straped/mufon/org/10789.html"],"Disposition":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsFirst and foremost, in high school, between 2003 and 2005 I used to cruise county road 509 just East of Rapid River, MI. 509 and a connecting road named 2231 was a popular road down which, many miles were riddled with party spots. One night around 130 am I returned home from a party alone, taking the corners really easy and paying close attention so as not to ditch my car of less than a year. I rounded a corner and out of the corner of my eye I saw an unidentified flying object hovering above these very large power lines. It was only three power-line posts away which was especially evident because the installers of these power lines had clear cut approximately 30+ feet on either side of the posts for miles in the otherwise wilderness of Michigan. I slammed my brakes after turning my head, doing a double take and finally looking at the object for maybe 20 seconds. I marveled at the clarity with which I could see the completely still object at such a time, after midnight. It stuck out like a sore thumb against pitch black darkness and I just sat there until the object lumbered off over the tree line coming toward me at a strange angle. I opened my car door and walked out of the car to get a better look just as the nose or forward most part at the moment reached the tree line. The craft was always parallel with the ground representing a plane, as I'm sure you all know the three defining points of a triangle are uni-planar, the object turned on a constant beam from the tip angling down a sort-of single headlight at a 30 degree angle down and just went away. Here's the part of the story I've never told though, I stood there transfixed at the tree line once I couldn't see the craft for a while, then I stood in front of my car took off my shoes, pants and boxers, threw the boxers away, put my pants back on as smelly as they were, put my shoes back on and raced home. I was not drunk. I was seventeen and I had been drinking a maximum of 48 oz the entire night several hours before my departure from the party. I was just over cautious. This is not the main story, however my last encounter was dependent on seeing this ufo. It was not a helicopter, not a single engine Cessna, fire flies, not a swarm of anything, not a flock either. I never reported it, and prefer to only report the following event. HERE'S THE GOOD STORY It was this experience alone that motivated me to return to this road after I flunked out of my freshman year at Ferris State University. I was bored in my little town while attending community college in the city where I now live. I went for many rides when the gas was cheap. My friend Ian Treder and I were killing time driving the same road 2231 when all of a sudden in the middle of another cloudy dark night there appeared just over the tree line (seemingly for sure a foot or two above the tree line) on the right side of the road a bright white light, not a beam with a red light that at a distance seemed to blink, but as we came closer I could distinguish that it was closely orbiting the bright white light on the bottom of some thing. Not something, some thing. It was big, so I screeched to a stop and ran out of my car to see more of it, Ian got out too. I don't remember turning my car off, but we were listening to Frank Zappa really loud and on or off, the volume was off, no lights on my car, just the light from the craft was all we had to see with. I didn;t even hear the sound of the ding ding ding ding with my door open, nothing, I assume I left my keys in the ignition. The object just glided right over the tree line, silent, and vanished from our sight. I had even ran 15 yards from the car to see more of it through the patchy tree line. We just got back in the car and talked a little about it. We were both weirded out. Completely sober. I'd take pictures and illustrate this for you if you'd like. The light attracted us, the object looked peculiar when we saw it. I thought \"not of earthly origins\" by this time, my second eyewitness account. The under body lights shone slightly on the under body of the craft and from that alone I could tell it was big. No dimensions come to mind."],"Region":"Michigan","Object Features":"Undisclosed","trends":["There have been no other sightings in Rapid River","This sighting has never been favorited."],"Weather Factors":"Unknown","Summary":"possible large triangle with one WHITEconstant/low freq flash and red revolving light","Date of the Event":"11/23/2006 10:35 UTC","Log Number":"US-05172008-0012","Date Submitted":"11/23/2006 10:35 UTC","City":"Rapid River","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.926909,+-86.967085(10789)&iwloc=A&hl=en\"> mufon case (10789) map </A>","Latitude":"45.926909","Longitude":"-86.967085","Case Number":"10789","Object Shape":"Flash, Triangle","Sighting Duration":"00:03:00","Tags":"City"}