{"Date of the Event":"05/31/1987 11:00 UTC","Summary":"large, dark, silent, sound absorbing","Region":"Oklahoma","Longitude":"-96.678613","files":["/var/www/straped/mufon/html2text/10783.html.txt","/var/www/straped/mufon/more/10783_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/10783.html"],"Latitude":"34.236205","Object Flight Path":"Hovering then path","Log Number":"US-05172008-0006","Tags":"City","City":"Tishomingo","Date Submitted":"05/31/1987 11:00 UTC","trends":["There have been no other sightings in Tishomingo","This sighting has never been favorited."],"divs":["Sighting Detailswhile unlocking the door to my trailer I noticed a strange silence. I looked up and to the south. just above the tree tops was an object about the size of a football field. (I was in the air force from 1979-1983 and I had never seen any thing that big flying not even a C-5A Galaxy). it was the shape of a capsule. That is when I noticed that not only was the object not making a sound; but it seemed to be absorbing the normal sounds in the surrounding area.(I heard none the normal sounds of the nigtht, traffic, crickets, t.v.s etc.) I stood in awe for a few moments, and then (a memory popped into my head from a few years before of a t.v. show where they were showing a new invention they were trying to sell to industry. that used a sound and vibration generator that sent vibrations at opposite frequencies of factory machines to lessen damaging vibrations and hearing damaging sounds and this is what it semed like the craft was doing whether as a means of camoflauge or as I feel a by-product of its propulsion system. the craft stood still then started to move East very slowly. when it had moved aprox. 200 feet it accelerated east and gained altitude at astounding speed and was gone. I saw no lights as soon as the craft was gone all of the sound returned. I knew right away that I had just seen a ufo, and that was it unlike any I had ever heard of described before. it was so huge and dark. it didn't look like a saucer. and there were no strange lights. and the skin of the object was dark and srange looking. I was so excited afterwards that I couldn't slep that night and i didn't know wheather to tell any one or not. since then I have told lots of people. ( and gotten THAT LOOK from most of them)"],"Weather Factors":"None","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=34.236205,+-96.678613(10783)&iwloc=A&hl=en\"> mufon case (10783) map </A>","Object Shape":"Blimp, Oval","Viewing Distance":"21-100 Feet","Country":"United States","Disposition":"Unknown","Case Number":"10783","Sighting Duration":"Undisclosed","Source":"MUFON"}