{"files":["/var/www/straped/mufon/html2text/10799.html.txt","/var/www/straped/mufon/org/10799.html"],"Source":"MUFON","divs":["Sighting DetailsWhile standing in my driveway facing North, I saw what I thought was a light from a flashlight.Upon further inspection there was no beam attached to the light. There were no other people in the area of the light.The light was moving up and down and back and forth not unlike a humming bird.This light in it's travels moved from about 3feet to 10feet off the ground.I went inside to wake up my husband who was sleeping on the couch so he could see it. When he came outside the light was gone.This light was about softball size and aqua in color. This is the 3rd time in 3 years we either independently or together have witnessed this kind of light.The other two times the light was sighted was in the fall about 2 years ago.Once in October,it appeared as green and almost hit our car.The second time was in November it appeared much like the most recent sighting.Seeing these things is kind of unnerving.The one that almost hit our car had us both scared to get out of the car.Manistee County is special to the Ottawa Indians and there is a decent amount of gas and oil extracted from the county. I wonder if either could be an explanation for what we've been seeing?"],"Object Features":"Other","Viewing Distance":"101-500 Feet","Summary":"The power lines are about 700 feet away in the opposite direction.","Latitude":"44.216944","Country":"United States","Log Number":"US-05182008-0009","City":"Wellston","Weather Factors":"None","Object Flight Path":"Path with directional change","Region":"Michigan","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.216944,+-85.957778(10799)&iwloc=A&hl=en\"> mufon case (10799) map </A>","Object Shape":"Sphere","trends":["There has been one other sighting in Wellston","There were no other sightings in Wellston on or around May 9th 2008"],"Disposition":"Unknown","Case Number":"10799","Longitude":"-85.957778","Date of the Event":"05/09/2008 08:00 UTC","Date Submitted":"05/09/2008 08:00 UTC"}