{"Disposition":"Unknown","Sighting Duration":"00:00:04","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-05172008-0013","trends":["There has been one other sighting in Wayne","There were no other sightings in Wayne on or around May 17th 2008"],"Object Flight Path":"Straight-line path","Object Shape":"Sphere, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.925372,+-74.276544(10790)&iwloc=A&hl=en\"> mufon case (10790) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10790.html.txt","/var/www/straped/mufon/org/10790.html"],"City":"Wayne","Date Submitted":"05/17/2008 08:55 UTC","Latitude":"40.925372","Tags":"City","divs":["sighting detailsas i was driving down rt23 southbound in wayne, nj approaching newark-pompton crossroad, a shiny object in the pale blue sky caught my attention. it was at an unknown distance\\altitude and i could not see any specific shape to it. it looked like tiny sphere moving parallel with the ground. i kept my eyes on it for no more than five seconds when it seemed to literally shrink out of site in less than a second. it was moving about the speed of an airliner which is what i thought it was at first until i watched it vanish. i did not blink. it all happened so fast that it made me very curious but i had to concentrate on traffic and the red light coming up in front of me so i quickly forgot about it. it wasn't until i began to think about it several hours later when it occurred to me that i may have just witnessed a ufo. i suppose it is possible it was a jet that caught the sunlight at just the right angle and then turned in a way that caused it to lose its reflectiveness. however, the sky was completely clear in the area, both from clouds and obstructions. and as i scanned the same area of the sky and in the direction it was heading ten seconds later while i waited at the traffic light, i did not see any airplanes at all. since it happened so fast, i have some doubt as to whether i saw anything out of the ordinary at all, or just an optical illusion created by sunlight and a reflective surface. i will never know for sure."],"Object Features":"None","Longitude":"-74.276544","Weather Factors":"None, Does Not Apply","Summary":"shiny orb/object in sky vanished within seconds","Date of the Event":"05/17/2008 08:55 UTC","Region":"New Jersey","Case Number":"10790","Country":"United States"}