{"Region":"Oregon","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/10804.html.txt","/var/www/straped/mufon/org/10804.html"],"Longitude":"-122.669057","City":"Portland","divs":["Sighting Details Time: 13:30 - 1345 hrs PST- Sighted 17 May 2008, My location, parking lot, Target, NE Glisan and 122nd, Portland Oregon. Object position, moving from SE to NW. Weather, hot, clear with a few high cirrus formations, wind slight. I was in the parking lot waiting for a friend to get done inside and sitting on the rear deck of my jeep. The area is within 10 miles of the airport(PDX) as I was watching a Horizon Dash -8 airplane gaining altitude(facing the NE) I looked up a little farther above my current line of sight turning slightly to my right and noticed at first what I thought must have been a white balloon. I retrieved my binoculars from the glove box and fixed back on the orb. It moved in a straight direction at a steady but not accelerated speed. There was no waver or drift in its movement and it was well below a cirrus cloud line as I observed it traveling beneath this formation. It was visible by naked eye and with the binoculars it became apparent that it was quite a ways up in the sky and if it were a balloon it would have to have been very big. Once it passed under the formation I lost sight of it, both by eye and binoculars. The slight wind at that time was coming from a northern direction and was barely a breeze. The object moved in a straight line without hesitating and did not fluctuate in its speed. Complete observation time: 4 minutes"],"Summary":"White Orb","Weather Factors":"None","Object Features":"None","Tags":"City","Date of the Event":"05/17/2008 01:35 UTC","Log Number":"US-05182008-0014","Country":"United States","Date Submitted":"05/17/2008 01:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.525752,+-122.669057(10804)&iwloc=A&hl=en\"> mufon case (10804) map </A>","Object Shape":"Sphere","Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Case Number":"10804","trends":["There have been 158 other sightings in Portland","There were 2 other sightings in Portland on or around May 17th 2008"],"Disposition":"Unknown","Latitude":"45.525752"}