{"map":"<A HREF = \"http://maps.google.com/maps?q=12.9275,+100.875278(10809)&iwloc=A&hl=en\"> mufon case (10809) map </A>","Object Flight Path":"Path with directional change","Latitude":"12.9275","trends":["There have been no other sightings in Pattaya","This sighting has never been favorited."],"Date Submitted":"05/17/2008 07:40 UTC","Sighting Duration":"00:12:00","Longitude":"100.875278","Summary":"On 10th floor roof Bangkok Pattaya Hosp., Pattaya. Looking south, in a clear sky, I (others) saw many star-like lights blinking on at the horizon, then continuing overhead at great altitude, First saw 3, then 2, then 3 more. Silent, not planes.","City":"Pattaya","Weather Factors":"Unknown","Region":"Chon Buri","Tags":"City","Object Features":"Unknown","Log Number":"TH-05192008-0005","Disposition":"Unresolved","Date of the Event":"05/17/2008 07:40 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10809.html.txt","/var/www/straped/mufon/org/10809.html"],"Object Shape":"Star-like, Unknown","Case Number":"10809","Viewing Distance":"Unknown","Country":"Thailand","divs":["Sighting DetailsFriends and I were attending three short plays at the hospital. During intermission we adjourned to the roof. We then noticed multiple lights blinking on just above the southern horizon. First we saw three in a row, then several more, then two, then one, then three, etc., etc. These were star-like lights and were at least at 30,000 feet. They traveled roughly in formation from their point of origin on the southern horizon to overhead. They were silent. No jets or other aircraft present. Thailand is the present site of Cobra Gold (May 17, 2008), a joint military exercise between the US and Thailand militaries (especially US Navy). The local Thai Navy Base is at Sattahip, south of Pattaya, where we stood. There was no sound. The \"craft\" reminded me of those multiple light objects filmed above Mexico City when government officials were present and cameras were tilted up to view scores of lights filling the skies. It also reminded me of the Phoenix Lights. What we saw in Pattaya were not birds. They were self-luminous. One or several lights would blink on just above the south horizon, then continue flying to great height overhead, in a basic line. First three lights would appear. Then none, then several more lights would blink on and continue their formation overhead. There was no wind. It was still on the rooftop. The lights were witnessed by at least three others besides me. I have no explanation. This continued for about 12 minutes. I am a long time MUFON member. I would guess there were at least 20-25 objects. This went on for at least 10-12-15 minutes. Because of my longtime interest in UFOs, I thought they might be UFOs. Everyone present was quite puzzled. The objects disappeared as they passed the hospital roof line overhead. They went out of sight. The craft moved silently and in a row, although there was some movement to either side of the basic formation line (east and west), as the lights progressed across the sky. The lights moved steadily and quietly. They were absolutely silent."]}