{"Tags":"City","Date Submitted":"05/11/2008 09:55 UTC","Object Features":"Unknown","Log Number":"US-05182008-0010","files":["/var/www/straped/mufon/html2text/10800.html.txt","/var/www/straped/mufon/org/10800.html"],"Case Number":"10800","City":"Charlotte","Viewing Distance":"Unknown","Sighting Duration":"00:12:30","Region":"South Carolina","Date of the Event":"05/11/2008 09:55 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.234697,+-80.836517(10800)&iwloc=A&hl=en\"> mufon case (10800) map </A>","Source":"MUFON","Latitude":"35.234697","trends":["There have been 2 other sightings in Charlotte","There were no other sightings in Charlotte on or around May 11th 2008"],"divs":["Sighting DetailsAbout 20 miles south of Charlotte, while travling north on I77 we witnessed 3 groups of 5 lights in a backward C formation hover over the highway one group above the other. The lights would get extremely bright and then fade to a continuous glow, still bright and twinkling, but not as bright as before. After about 2 minutes into the sighting the bottom group of 5 lights took off suddenly eastward or to the right of the highway. The other two groups remainded stationary above the highway. After 30 seconds, another group or possibly the same group of 5 lights reentered the space above the highway and took up the formation below the other two groups of lights. We watched the lights until the highway turned and they were lost behind the trees. Occasionally when there was a break in the trees, we would see the lights still at the same approximate elevation and still in formation. After 12 minutes we no longer saw the lights, but very high powered searchlights began to be seen reflecting on the clouds. As we passed by the site of the search lights, it appered that there were 5 or 6 located just off of I77 for some kind of grand opening event. We surmised that the suspecious lights that we saw were drawn to this location by the spot lights. These events were witnessed by my wife and I. During the first 5 minute period, I was traveling at 80mph and the lights never moved indicating to me they were very distant. When last seen off our left, they were still at the same elevation after a duration of 12 minutes."],"Summary":"Traveling North on I77 wife and I watched 3 groups of 5 lights in backwards C formation","Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Longitude":"-80.836517","Object Shape":"Star-like, Triangle"}