{"Case Number":"10801","Weather Factors":"None","Disposition":"Insufficient Data","Object Shape":"Cigar","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.778296,+-78.636754(10801)&iwloc=A&hl=en\"> mufon case (10801) map </A>","Latitude":"35.778296","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was observing a few low clouds in a sunny blue sky when the sun gleamed off an airliner on its approach to land. I watched the airliner fly over a cloud as it descended and, as the airliner cleared the edge of the cloud, a huge cylinder emerged from the cloud just below the airliner. The cigar shaped craft continued matching the airliner's speed, but directly beneath it, until the cigar craft entered the edge of another cloud. I watched the airliner continue descent flying above the second cloud and observed the cigar shape enter and disappear into the cloud. The airliner continued descent until it turned left for the final into RDU airport, but the cigar never emerged from the second cloud. The cigar craft was as long as the second cloud and barely fit within it. I was very surprised it did not emerge and continued watching to see it come out. It never did emerge and I watched until the cloud disappeared. The event occurred when I had no camera available. I paint pictures, mostly animals and comic characters, but realizing the images so burned in memory would probably fade, I painted the scene as I saw it. The photo is of that image after I painted it."],"Country":"United States","Summary":"Gigantic metallic cigar flying noiselessly beneath an airliner on landing approach","files":["/var/www/straped/mufon/html2text/10801.html.txt","/var/www/straped/mufon/more/10801_submitter_file1__PhotoCopy006.jpg","/var/www/straped/mufon/more/10801_submitter_file2__PhotoCopy002.jpg","/var/www/straped/mufon/org/10801.html"],"Date of the Event":"09/12/2002 02:15 UTC","Source":"MUFON","Region":"North Carolina","Sighting Duration":"00:01:30","Date Submitted":"09/12/2002 02:15 UTC","City":"Raleigh","Log Number":"US-05182008-0011","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around September 12th 2002","This sighting has never been favorited.",""],"Longitude":"-78.636754","Tags":"City","Object Features":"Window(s), Patterned Surface"}