{"Date of the Event":"05/16/2008 04:30 UTC","Weather Factors":"Unknown","Summary":"bright white light","Latitude":"44.881234","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Region":"Minnesota","Object Features":"Undisclosed","Date Submitted":"05/16/2008 04:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/10802.html.txt","/var/www/straped/mufon/org/10802.html"],"Object Flight Path":"Undisclosed","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.881234,+-93.203111(10802)&iwloc=A&hl=en\"> mufon case (10802) map </A>","Tags":"City","Log Number":"US-05182008-0012","City":"St Paul","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around May 16th 2008"],"Longitude":"-93.203111","divs":["Sighting Detailsa friend and I were driving westbound on the crosstown (a twin city metro highway)... we were just north of msp international. my friend was driving and I was watching two c130 military aircraft taking off from the airport (the planes take off northward and cross the highway) The first was due north of us and turning to the east. The second was crossing dirictly over the highway about a half mile in front of us. As I was watching the second plane cross the highway I noticed an intensly bright white light, far off in the distance (very small), above and behind the tale of the c130. The object was somewhere between 30-45 degrees above the horizon and straight wast. I watched the light stay steady in the sky for maybe 5-10 seconds (both c130s were now nowhere near the light). The light then instantly shot off northward and dissappeared. I sat silent... contemplating... for maybe 3 minutes. I then turned to my friend driving the car and said did you see that? He saw it too. The fact that I saw a light when I was by the airport isn't a big deal, but seeing how bright it was and how quickly it moved when it wanted to was strange..."],"Source":"MUFON","Case Number":"10802","Viewing Distance":"Unknown"}