{"Source":"MUFON","Country":"United States","Date of the Event":"05/18/2008 10:27 UTC","Region":"Texas","Date Submitted":"05/18/2008 10:27 UTC","Viewing Distance":"Unknown","Object Shape":"Circle, Star-like","Case Number":"10805","Object Flight Path":"Path with directional change,Other","files":["/var/www/straped/mufon/html2text/10805.html.txt","/var/www/straped/mufon/org/10805.html"],"Sighting Duration":"00:30:00","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around May 18th 2008"],"Summary":"flickering red green blue bulb that wiggled in the sky back and forth with no distinct pattern","City":"San Antonio","Object Features":"Other","Disposition":"Hoax","divs":["Sighting DetailsI was sitting in my hot tub in my backyard watching television. i heard my dog wimpering in the yard witch made me turn around. at about that time i saw a flicker in the nights sky. the time was around 10pm central america time. i had not yet looked at the clock to verify exact time. i initially believed it to be an aircraft simply flying in the sky. however, the object changed directions and i began to realize the flickering lights were not like those of a passager airliner. the object had been traveling slowly in one direction when i began watching and the slowed down. after coming to a hault it stayed somewhat stationary for a good amount of time. the object flickered a reddish light, alternating to a blueish and green flicker. but, what made the object seem unwordly was that it moved back and forth in no distint pattern at alternating speads. i called my mother and father outside to verify what i was seeing and to confirm i wasn't seeing things. my mother noticed strange characteristics but quickly discounted the sighting as probably a helicopter. however my father watched the object for a good amount of time and witnessed the stranged flickers coupled with unusual wiggleing in the sky. he was initially skeptical of me and the object both but slowly realized what he saw was something he had never witnessed before. i got out of my hot tub after about 25 minutes of veiwing the object to see if there were any other lights in the sky. i noticed scattered stars and one airliner that crossed paths with the light from my perspective. but as i was looking around longer i saw a orange bulb of light much larger than any star slowly floating across the sky. as the object disappeared over the tree line in my yard i looked back to the first object which was now flickering emitted flickering light away from its central body. i veiwed the back and forth wobble of the object for about 5 minutes longer when the object slowly took off in one constant direction until out of sight. i was overcome with intrique and amazement and was sure what i saw was something unwordly.i knew i must report the sighting immediatly and am now here typing this report. my parents, dispite seeing the initial flickering, wobbling object, are quick to discount the occurence dispite there witness to the strange object. i however am currently convinced i witnessed an extra terrestrial object of some sort."],"Latitude":"29.425832","Weather Factors":"Unknown","Tags":"City","Log Number":"US-05192008-0001","Longitude":"-98.492018","map":"<A HREF = \"http://maps.google.com/maps?q=29.425832,+-98.492018(10805)&iwloc=A&hl=en\"> mufon case (10805) map </A>"}