{"Case Number":"10818","Date of the Event":"02/14/2007 02:03 UTC","trends":["There have been 8 other sightings in Bastrop","There were no other sightings in Bastrop on or around February 14th 2007","This sighting has never been favorited.",""],"Date Submitted":"02/14/2007 02:03 UTC","divs":["sighting detailsmy daughter and i were on our way to austin traveling south on i-35. the reason we were on our way to austin was to pick up her boyfriend at the hospital emergency room. about 1 hour south of temple, there was a triangular shaped outline\\ object that flew quickly, silently and low over the car in which we riding, in the sky just over an overpass, over the freeway. it changed into a chevron shape and hovered over a storefront. it firghtened us and we were confused at what we were seeing. i asked my daughter to keep driving south as we were afraid to stop on the side of he freeway. the perfect circle, sphere shape in the middle of the octogan was solid white and blinking in time with my heartbeat as it hovered. the orange dougle lines looked liked neon lights. the interior was transparent and you could see the night sky through it. the only other oodd thing i notcied was that there were very large construction lights on the right side of the freeway where this sighting occured. i told my daughter get the hell out of here. i took notes of the time and place the night of the event and i made a sketch of what we saw that evening as well."],"Region":"Texas","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Longitude":"-97.31527","Log Number":"US-05192008-0014","Country":"United States","Object Flight Path":"Path with directional change","Tags":"City","Summary":"double neon orange outline in chevron shape with blinking sphere in center","Object Shape":"Chevron","map":"<A HREF = \"http://maps.google.com/maps?q=30.110495,+-97.31527(10818)&iwloc=A&hl=en\"> mufon case (10818) map </A>","Latitude":"30.110495","Object Features":"Other","Weather Factors":"None","City":"Bastrop","files":["/var/www/straped/mufon/html2text/10818.html.txt","/var/www/straped/mufon/more/10818_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/10818.html"],"Source":"MUFON","Disposition":"Unknown"}