{"Tags":"City","trends":["There have been no other sightings in Nickelsdorf","This sighting has never been favorited."],"Date of the Event":"07/10/1991 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.94164,+17.07138(10810)&iwloc=A&hl=en\"> mufon case (10810) map </A>","Object Flight Path":"Hovering then path","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/10810.html.txt","/var/www/straped/mufon/org/10810.html"],"Date Submitted":"07/10/1991 10:00 UTC","Summary":"Triangle UFO levitating above our heads, then flying into space","Log Number":"AT-05192008-0006","Region":"Burgenland","Source":"MUFON","Longitude":"17.07138","Sighting Duration":"Undisclosed","divs":["Sighting DetailsA friend, his wife and me were driving from Vienna (Austria) to Budapest (Hungary) by car on the \"B10 Budapester Bundesstrasse\" (B10 Country Road). It was a very clear, cloudless summernight. I was sitting next to my friend, who was driving the car. We didn't speak, just listening to the radio. I was in my thoughts and watched out of the side window. Suddenly I spotted a very bright light in the sky. I was thinking, it may be a warning light of a radio tower on a mountain, because it was too big and bright for being a star. Then I realized, it must be something else, because there are no mountains in this area. I asked the others, what they think, what it could be. We watched the light as we were driving toward it and discussed about possibilities of origin. After about 10 minutes driving we arrived exactly(!) under the light and we stopped the car. We exited the car and watched the light, which turned out to be three lights in the shape of an exact triangle. It looked if they were attached to a flying object on the three corners. Compared to the black background of the sky the lights were so bright that we couldn't see the object itself, which seemed to be black too. The object was levitating without any movement about 20-30 meters above our heads. It was absolutely silent. The street was empty between two small villages and there was nothing to break the silence. We didn't hear any noise coming from the object or any other source. We were talking about UFOs and tried to capture it on video, unfortunately our video camera had no charged batteries. After about 15 minutes the object raised its \"front\" (which we could clearly recognize by the lights changing their positions to eachother) and it flew toward space in a straight line very very quick without making any sound. We watched the lights as long as they disappeared between the stars. We continued our journey."],"Object Features":"None","Weather Factors":"None","Disposition":"Unresolved","City":"Nickelsdorf","Latitude":"47.94164","Case Number":"10810","Object Shape":"Triangle","Country":"Austria"}