{"divs":["Sighting DetailsMY ABDUCTION STORY, IT WAS 1985 IN LOS ANGELES. I LIVED DOWNTOWN LOS ANGELES AT THE WAYWARD HOTEL ON 6TH STREET. I CAN'T REMEMBER THE ROOM # BUT I LAID DOWN MAYBE 6 HOURS BEFORE THIS HAPPENED. I WOKE UP SOMEWHERE AROUND 7:30AM I WAS LAYING ON MY BACK AND THE SUN WAS BRIGHT TO MY EYES. I WANTED TO SIT UP ON THE BED FIRST BEFORE OPENING MY EYES. I COULD HERE THE TRAFFIC OUTSIDE. I TRIED TO SIT UP BUT COULD ONLY GET ABOUT HALF WAY UP. SO I TRIED AGAIN TO SIT UP AND JUST COULDN'T GET UP. NEXT I THOUGHT IF I WOULD MOVE MY LEGS OVER THE SIDE OF THE BED ONTO THE FLOOR I MIGHT BE ABLE TO SIT UP THAT WAY. I COULDN'T MOVE FROM THAT POINT. I KNEW I WASN'T ALONE IN THE ROOM, I FELT I WASN'T ALONE SO I TRIED TO OPEN MY EYES TO MAKE SURE BUT I COULDN'T OPEN MY EYES. THE MIDDLE OF MY EYE LIDS I COULD MOVE BUT THE BOTTOM PART WOULDN'T BUDGE. THEN I FELT A HAND ON MY RIGHT SHOULDER, THEN I STARTED LIFTING UP OFF OF THE BED.FROM A HORIZONTAL POSITION TO AN UPRIGHT POSITION. I KEPT TRYING TO OPEN MY EYES AND I'M SAYING LET ME SEE, LET ME SEE...BUT I COULDN'T OPEN MY EYES. ON THE WAY UPRIGHT I WAS KICKING SIDEWAYS AND I KNOCKED MY COFFEE CUP OFF THE NITE STAND BESIDE THE BED AND CHIPPED THE SIDE OF THE NITE STAND. I HEARD THE CUP SHATTER WHEN IT HIT THE LENOLIUM FLOOR. I TOUCHED THE BACK BOARD OF MY BED WITH MY FEET. I WASN'T GETTING ANYWHERE TRYING TO OPEN MY EYES. I DECIDED TO STOP KICKING AND GO INWARD AND MEDITATE ON JESUS TO COME TO ME AND ABOUT 30 SECONDS LATER I'M HORIZONTAL AGAIN AND MY WEIGHT COMES BACK TO ME AS I'M BACK ON THE BED AGAIN. AT THAT POINT I FELT PRETTY GOOD ABOUT THAT. I THOUGHT LETS TRY THIS ONE AGAIN I TRIED TO SIT UP THIS TIME AND WAS ABLE TO SIT UP AND I OPENED MY EYES AND THERE WAS NO ONE IN THE ROOM WITH ME AS I COULD SEE AND THE DOOR WAS LOCKED FROM THE INSIDE. I DON'T REMEMBER FEELING ANY PAIN WHILE I WAS WEIGHTLESS, BUT WHEN I CHECKED THE MIRROR I COULD SEE AN INDENTATION ON MY RIGHT TEMPLE AREA OF MY HEAD. IT LOOKED LIKE THERE WAS SOMETHING UNDER THE SKIN, OR THEY HAD TAKEN SOMETHING OUT OF THAT AREA. THE INDENTATION IN MY RIGHT TEMPLE AREA WAS LIKE A CIRCLE BUT IT WASN'T EVEN. IT WAS JAGGED. OVER THE YEARS IT CHANGED SHAPE A LITTLE FROM BEING MORE ROUND TO OBLONG. NOW IT'S BARELY NOTICABLE. BUT IT WAS QUITE NOTICABLE THEN AND UP TILL ABOUT 2001. THEN IT WAS STARTING TO FILL BACK IN. I CAN STILL SEE THE AREA BUT NOW I HAVE TO PENCIL IT IN TO SEE IT GOOD. ON JULY 2ND 2001 I MOVED TO INDIANA FROM LOS ANGELES I'VE BEEN WORKING AT ARMOUR ECKRIDGE HERE IN PERU. WHILE AT WORK AT FINISHNING TIME I WENT OUT TO START MY CAR AND GO TO TURN IN MY PAPER WORK. ACROSS THE STREET THERE IS AN OPEN FIELD AND I SAW A COUPLE OF LIGHTS TO START WITH BUT THEN THE LIGHT MOVED OVER SO I WATCHED IT FOR A WHILE. WHEN THE LIGHT GOT OVER SO FAR IT STARTED TO MOVE UPWARD AND WHEN IT GOT SO FAR UP A BUNCH OF LIGHTS LIT UP AND I COULD SEE THAT IT WAS METALLIC IN NATURE AND SOLID BLACK. THEN THE LIGHTS WENT OUT AND I DIDN'T SEE IT ANY MORE. PAUL HAMBLIN."],"Summary":"IT WAS A TRIANGLE METALIC, BLACK, W/LITES ON THE SIDE.","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-118.234245","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 15th 1985"],"City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.055434,+-118.234245(10814)&iwloc=A&hl=en\"> mufon case (10814) map </A>","Tags":"City","Log Number":"US-05192008-0010","Object Shape":"Triangle","Date Submitted":"09/15/1985 07:30 UTC","Latitude":"34.055434","files":["/var/www/straped/mufon/html2text/10814.html.txt","/var/www/straped/mufon/org/10814.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"09/15/1985 07:30 UTC","Source":"MUFON","Country":"United States","Case Number":"10814","Object Features":"Undisclosed","Disposition":"Insufficient Data","Region":"California"}