{"Case Number":"10820","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Longitude":"-72.922658","Date Submitted":"11/30/1970 12:00 UTC","files":["/var/www/straped/mufon/html2text/10820.html.txt","/var/www/straped/mufon/org/10820.html"],"Source":"MUFON","Summary":"slowly flying over homes and telephone poles-very low","map":"<A HREF = \"http://maps.google.com/maps?q=41.314173,+-72.922658(10820)&iwloc=A&hl=en\"> mufon case (10820) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 14 other sightings in New Haven","There were no other sightings in New Haven on or around November 30th 1970"],"Country":"United States","Latitude":"41.314173","City":"New Haven","Date of the Event":"11/30/1970 12:00 UTC","Object Shape":"Circle","Region":"Connecticut","Disposition":"Unknown","Log Number":"US-05192008-0016","Tags":"City","Weather Factors":"Unknown","divs":["sighting detailsthere where reports of police in our town seeing an ufo up over a ridge near my home. my cousin and a few friends decided to take a ride and check it out. we pulled over near the end of the ridge and got out of the car.suddenly a ufo slowly and so quietly came over the ridge. i remember saying to my cousin how they aren't white but a dark brown \\dark gray color. a row of square windows circled the object and from within was a bright light that encompassed the entire inside. i saw an alien standing in the window as clear as i see this monitor i am typing on. a strange thing is that after seeing the alien, my next memory is running into the car scared beyond words. the mystery is that this happened i believe in 1971 in east haven, connecticut and my friends and i never mentioned this experience until suddenly about 5 years ago, on the same day my cousin and i had a common thought as to why we never would talk about it. it was like when we thought of the event we couldn't hold on to the thought. i must of checked to see if time was lost and i believe no time was lost. this ufo flew very low and slow over homes and telephone poles. it came up from behind a small mountainous ridge and covered the length of at least three houses sitting on lots around 60' wide. i just had to tell someone this experience and i thank you."],"Object Features":"Window(s)"}