{"map":"<A HREF = \"http://maps.google.com/maps?q=36.124416,+-115.170916(10825)&iwloc=A&hl=en\"> mufon case (10825) map </A>","Region":"Nevada","Weather Factors":"Does Not Apply","Date of the Event":"11/30/1978 03:00 UTC","Country":"United States","Summary":"Small orb of light entered my bedroom, hovered over me and my sister and then shot off.","Case Number":"10825","Object Features":"Undisclosed","Date Submitted":"11/30/1978 03:00 UTC","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/10825.html.txt","/var/www/straped/mufon/org/10825.html"],"Source":"MUFON","Latitude":"36.124416","divs":["Sighting DetailsThis happened when I was approximately 14 years old and my sister was 9. I come from a large family, so my 2 little sisters and I often slept in the same bed. One night, my youngest sister and I were sleeping in the same bed. I awoke for some reason in the middle of the night and immediately noticed a baseball-sized orb of light passing through my closed window and entering my bedroom. It moved slowly across the room toward me and stopped, or hovered, just over the bed. It seemed to hover over me as if it were watching me. I was able to see that it was a 3-dimensional orb, and it looked like a ball of glass that had swirling red and orange lights - like swirling, colored liquid, that was self-illuminated. After about 20 seconds it shot off through the room and exited the opposite window. I looked over at my sister and was surprised to see that she was also awake. I said, \"Did you see that???\" And she calmly responded, \"Yes.\" I said, \"What was it?\" She said, \"It was an angel.\" I didn't understand what she meant, because that did not seem to correspond with what I had just seen. I said, \"How long have you been awake?\" She replied, \"About 5 minutes.\" And I said, \"And you saw it the whole time you were awake?\" And she said, \"Yes.\" I didn't know what else to say, and we both went back to sleep. I didn't think about it or speak about it to anyone else for over 30 years. Then in the last 6 months or so the events of that night have been coming back in my mind and bothering me. I decided to ask my sister if she remembered that night. She said she did, so I asked her again what she remembered about it. She was reluctant to talk about it, and tried to explain it away as just a reflection in our window. I know that I did not see a reflection of light in the window. What I saw was 3-dimensional. It entered our room. It hovered over my bed, apparantly observing us, and then shot off. I don't know if this is considered a UFO sighting - but I know I saw what I saw. I know I was wide awake at the time, and I know my sister saw it too, though she is reluctant to speak of it."],"City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around November 30th 1978"],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path then hovering","Log Number":"US-05192008-0021","Viewing Distance":"20 Feet or Less","Longitude":"-115.170916","Disposition":"Unknown"}