{"Latitude":"42.457874","Sighting Duration":"Undisclosed","Date Submitted":"03/26/2008 12:00 UTC","Object Shape":"Cylinder, Disc, Oval, Saturn-like, Sphere","Disposition":"Unknown","Weather Factors":"Unknown","Region":"Massachusetts","Object Flight Path":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10821.html.txt","/var/www/straped/mufon/more/10821_submitter_file1__Picture038.jpg","/var/www/straped/mufon/more/10821_submitter_file2__Picture039.jpg","/var/www/straped/mufon/more/10821_submitter_file3__Picture040.jpg","/var/www/straped/mufon/org/10821.html"],"Date of the Event":"03/26/2008 12:00 UTC","Summary":"Disk shaped object","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.457874,+-73.236832(10821)&iwloc=A&hl=en\"> mufon case (10821) map </A>","City":"Pittsfield","divs":["sighting detailsa friend of mine went with his friends on snow mobiling for the day, some time in march 2008. they had stopped for a short break when they had seen helicopters flying all around them. my friend had taken photos of the helicopters. just a week ago, my friend was showing me the photos. i enlarged one of the pictures to get a closer look at the helicopter, when i noticed, at the top of the page, was a purple\\blue disk shaped object. i do not know if the digital camera had a spot on the lens or it was just a reflection. there were several other photos showing the same object but in different areas of the pictures. i asked my friend if he or anyone else had seen the object but no one had. that's why i was wondering if it was just a spot on the lens. i don't think it was a trick. what puzzles me is that no one had seen these objects they had only seen the hellicoptors. i feel a little silly writing about this but i can't help wondering, what if? the following attached pics are just a few of many. thank you..."],"Country":"United States","Tags":"City","Case Number":"10821","Viewing Distance":"Unknown","Log Number":"US-05192008-0017","trends":["There have been 17 other sightings in Pittsfield","There were no other sightings in Pittsfield on or around March 26th 2008","This sighting has never been favorited.",""],"Longitude":"-73.236832"}