{"trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around April 1st 1981"],"Object Features":"Unknown","Longitude":"-96.693136","divs":["Sighting DetailsVery cloudy night. The neighbor across the street knocked on our door and said come look at this. Me, my dad, the neighbor, and two younger siblings stood on the porch and immediately saw what our neighbor was pointing at. We were on my parents' front porch looking West. The clouds were illuminated by a ball of light (I did not see an object). It stayed in one place for 2-3 minutes then shot a short distance and stopped. All of a sudden it disappeared, and I thought it was gone but about 30 seconds later, it appeared again just a little south of where I first saw it. I ran in and got a 35mm camera and it was in the same place when I came back out. Instantaneously, it shot across the sky, stopped, shot across the sky again, and stopped (like a zig zag). I couldn't see it move, just appear, disappear, then reappear in another location. I took 3-4 pictures. Nothing discernable except for alluminated clouds (could see outline of clouds like a there was a light behind them). We watched the news that evening, and the reporters were saying that alot of people were calling in and it was \"supposedly\" a weather balloon. No way! It hovered and shot across the sky, stopped, hovered and shot away. NOT a weather balloon... Unfortunately, I included the pictures in an english report which I never got back. Somewhere in all of the old photos are the negatives. I tried to get my report back (end of my 10th grade year), but the teacher no longer had it. I was real disappointed because to this day, it was my only proof. I'm not saying I saw a flying saucer, I'm saying it wasn't a weather balloon or a plane. This is not a lie or my imagination. I really could care less if anyone believes me. That was 27 years ago. I still live close to my parents' house and have never seen anything like that since."],"Date of the Event":"04/01/1981 09:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Heavy","Country":"United States","Disposition":"Unknown","Case Number":"10826","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"April 1981 - Plano, Texas - Not a weather balloon...","Latitude":"33.023133","Region":"Texas","Date Submitted":"04/01/1981 09:00 UTC","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=33.023133,+-96.693136(10826)&iwloc=A&hl=en\"> mufon case (10826) map </A>","files":["/var/www/straped/mufon/html2text/10826.html.txt","/var/www/straped/mufon/org/10826.html"],"Source":"MUFON","Viewing Distance":"Over One Mile","Tags":"City","Log Number":"US-05202008-0001","City":"Plano"}