{"Sighting Duration":"Undisclosed","Longitude":"-106.364826","map":"<A HREF = \"http://maps.google.com/maps?q=39.644564,+-106.364826(10839)&iwloc=A&hl=en\"> mufon case (10839) map </A>","Date Submitted":"06/15/1998 01:25 UTC","Log Number":"US-05202008-0014","divs":["Sighting DetailsI was with a group of friends going caving at \"Groaning Cave\" in the mountains about 2-3 hours west of Denver. We arrived late (11-12) at night and set up camp near the cave entrance. After camp was set up, everybody went to sleep. I couldn't sleep so I decided to do some star-gazing. After 20 minutes or so, I noticed what appeared to be a very large, bright star in the south-west. This object began to move slowly north. It then darted quite quickly, straight overhead from my point of view and then stopped totally. It remained motionless for about 45 seconds. It then moved again at incredible speed back towards the south-west. In what appeared to be a 90-degree turn in mid-flight, it darted out of sight to the north. At the time, the experience felt quite surreal. My first instinct was to wake everybody up and tell them what had happened. Yet I did not. I thought everybody would think I was crazy or something. I had the distinct impression while observing this event, that the object, knew I was watching. It seemed that as soon as I saw the object moving slowly, it then darted straight above me. After the object moved out of sight, I just sat there for about an hour; thinking I should probably set an appointment with my doctor to get a cat-scan. Time was kind of disjointed, and I remember waking up in a lawn chair, freezing my tail off at about five in the morning. I have never told anybody about this until now. Yet it remains the most puzzling and vivid event of my life. Something happened to me recently that has brought all of this back to the forefront of my life, and so I have decided to \"put it out there\" so to speak. My recent event confirms for me, something HUGE is going on, or I really need to get that cat-scan."],"Date of the Event":"06/15/1998 01:25 UTC","Object Flight Path":"Hovering then path","Object Features":"Unknown","Weather Factors":"None","Case Number":"10839","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/10839.html.txt","/var/www/straped/mufon/org/10839.html"],"Source":"MUFON","Latitude":"39.644564","Region":"Colorado","trends":["There have been 13 other sightings in Vail","There were no other sightings in Vail on or around June 15th 1998"],"Country":"United States","Viewing Distance":"Unknown","Object Shape":"Circle, Star-like","Tags":"City","City":"Vail","Summary":"Very large star like object in sky"}