{"map":"<A HREF = \"http://maps.google.com/maps?q=43.082712,+-89.3955(10833)&iwloc=A&hl=en\"> mufon case (10833) map </A>","Summary":"Two Silvery objects flying in unison and pull a 90 degrees turn","Latitude":"43.082712","Date of the Event":"07/31/2006 03:00 UTC","Region":"Wisconsin","Tags":"City","Case Number":"10833","City":"Madison","Weather Factors":"None","Date Submitted":"07/31/2006 03:00 UTC","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around July 31st 2006"],"files":["/var/www/straped/mufon/html2text/10833.html.txt","/var/www/straped/mufon/org/10833.html"],"Object Features":"Unknown","Disposition":"Insufficient Data","Country":"United States","Log Number":"US-05202008-0008","Source":"MUFON","divs":["sighting detailsunfortunately, this is not my personal sighting. my friend related it to me, but i realized it would be a good idea to log it in to mufon, so i took careful notes. he and his family was on vacation in madison, wi, on lake koshkonong. he and his dad were on the lake one day, around 3:00 pm (but just a guess), and were looking at the sky. they noticed two small, shiny (he said they were shining in the sun and couldn't tell what color they were, but most likely metal\\silvery) objects far above them, but at a slight angle, because they realized that the objects were slowly falling\\ flying downwards. he said they were moving slowly, slower than an airplane. they thought maybe they were skydivers or even space junk, until the two objects (which never flew away from eachother-they were perfectly parallel) made a smooth 90 turn and flew away at a much higher speed, he said that they were faster than an airplane. it was only about 1 minute until they lost sight of them. i found a similar report in the mufon database: object flying downwards slowly, then pulling away and flying much faster; it was in wisconsin; on a lake; even during summer. the only two differences were the time of day (the other report was at night) and the lack of the other object. my friend also said that the date may have been in 2007 rather than 2006, which would make the two reports almost identical."],"Object Shape":"Circle, Disc, Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Longitude":"-89.3955"}