{"Disposition":"Unresolved","trends":["There have been 10 other sightings in Cabo San Lucas","There were no other sightings in Cabo San Lucas on or around December 25th 1978"],"Case Number":"10837","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10837.html.txt","/var/www/straped/mufon/org/10837.html"],"City":"Cabo San Lucas","map":"<A HREF = \"http://maps.google.com/maps?q=22.896243,+-109.908257(10837)&iwloc=A&hl=en\"> mufon case (10837) map </A>","Date of the Event":"12/25/1978 09:30 UTC","Country":"Mexico","Tags":"City","Date Submitted":"12/25/1978 09:30 UTC","Object Features":"None","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Baja California Sur","divs":["Sighting DetailsCamping six miles east of Cabo San Lucas in Dec. 1978 I checked my boat at 9:30 PM. Returning to my camper I saw what I first thought must be a 747 blowing up above the northern mountain peak perhaps 2 miles to the north. I started yelling and several people joined me. What we were witnessing was a huge glow, with a whitish, brighter glow about one third of the way in from each side. The glow could not be described as solid though may have been. One of the people with me said \"It is two flying saucers.\" This is when I realized I was witnessing something special. It descended into the ocean, growing dimmer as it came down. I viewed it for a period of 45 seconds to a minute and a half. I witnessed my children being born, but this remains the most vivid thing I've ever seen. I'm a school teacher, and the next day I spoke to at least five other teachers who witnessed the same phenomenon from Cabo San Lucas. They described it as going into the water. My view was obscured by Cabo Falso. At its closest, the object was about .8 miles and its furthest about 2 miles. My feeling at the time, though I was extremely adrenalized, was that it seemed very natural. It made no noise, though hundreds of coyotes were howling at it in the distance. It felt as though all you have to do is spend a lot of time outside at night. I have since seen two other strange lights in the Baja desert at night, but both were 30-40 miles away--but in places there should have been no illumination whatsoever."],"Object Shape":"Oval","Log Number":"MX-05202008-0012","Summary":"Extremely large glow--several hundred feet in diameter--drifted from 2,000 feet into the ocean","Longitude":"-109.908257","Viewing Distance":"501 Feet - 1 Mile","Latitude":"22.896243"}