{"map":"<A HREF = \"http://maps.google.com/maps?q=33.732064,+-116.367176(10832)&iwloc=A&hl=en\"> mufon case (10832) map </A>","Longitude":"-116.367176","Object Features":"Undisclosed","Date Submitted":"04/22/2008 08:30 UTC","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/10832.html.txt","/var/www/straped/mufon/org/10832.html"],"Case Number":"10832","Viewing Distance":"Unknown","Weather Factors":"Windy, Medium","Date of the Event":"04/22/2008 08:30 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"very elongated dark red to orange glow but fire pattern to it. Same color as the St. Paul UFO","divs":["Sighting DetailsMe and a friend both sound of mind and not on anything also we aren't or should I say weren't into UFO's much before this. We saw a dark red elongated non aerodynamic shaped space or air craft appearing to be high in the sky. It flew in an intelligent pattern series of straight lines before going into a straight path that appeared to take it out of the atmosphere by diming down the glow to black it faded from being very visible with the naked eye to disappearing. Looked as if it were glowing this deep dark red to orange color very similar in hue to the video over the arizona desert or st. Paul that Mr. Mufon has shown. This was over Palm Desert. The local tv news was running a show about a ufo meeting in a nearby desert town and said someone caught something on video so we waited to see if it was what we saw and it was just a story of the UFO convention we called their news desk and they were not interested in our story also called the UFO people at this convention and they never returned our call. It was very very strange. Long rectangular with box shaped front section that hat long arms suddenly explode out from it which also had this same deep red hue. Very brightly glowing as we could see it very clearly though it appeared to be very high up in the sky. we were not able to find and get the video cam set up before it faded to black. It was quite outstanding and I thought I would contact you guys again because the hue was identical to the hue on your mufon 2007 video. I felt it looked like it was way up in the cloudless desert sky and superheated from atmospheric friction and it was moving in a straight line thus cooling as it left the outter atmosphere. but it may have not been nearly as high up in the sky as that and the fading to black may have been caused by something else. But it did have gradations of this deep dark red to orange in such a way as to be plasma like fire if you will. as if the surface of the vehicle were plasma or super heated. Sorry for the incomplete description but that's about what I have to say. There did not appear to be any aspect of the vehicle that was not glowing this color."],"Source":"MUFON","Tags":"City","Region":"California","trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around April 22nd 2008"],"Country":"United States","City":"Palm Desert","Latitude":"33.732064","Disposition":"Insufficient Data","Log Number":"US-05202008-0007"}