{"Date of the Event":"07/15/1971 12:00 UTC","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=47.254527,+-122.441731(10847)&iwloc=A&hl=en\"> mufon case (10847) map </A>","Summary":"I overheard military commander confess to my father, a minister.","Disposition":"Insufficient Data","Weather Factors":"Unknown","Source":"MUFON","City":"Tacoma","Country":"United States","Object Features":"Undisclosed","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around July 15th 1971"],"Log Number":"US-05202008-0022","Date Submitted":"07/15/1971 12:00 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsThis is not a UFO event, rather an accounting of a counseling session accidentally interrupted. The year was 1967, because I had just listened to the new Beatles: Magical Mystery Tour LP that evening for the first time. My Father was a minster named: Rev. Lawrence Veltkamp, from Grand Rapids, Michigan, Shawnee Park, Christian Reformed Church. That summer he was doing mission work near Tacoma, Wash. in a small CRC church that had lost it's pastor and could not replace him. We lived an a dairy farm called Faith Dairy, where I cut the grass and helped milk cows for the summer. One sunday a decorated military person, a male deacon of the church, (don't remember the name), invited my father, my mom and me over to dinner. I was about 14 years old and he had a son my age. After dinner his son invited me to listen to the new Beatles album, which we did. When we were done I went downstairs to get something from the kitchen. I entered the living room to hear my father in a very serious conversation with the military guy. When I entered my Father raised his hand for the man to stop, but the man did not stop talking. (There is a prohibition against having your family hear counseling sessions if you are a minister. It is supposed to be private.) But I was already in the room and the military guy was saying: \"but I saw them, and the others with me saw them also!\" My father responded with: \"Well you just couldn't have because those things don't exist. It's just impossible.\" \"No, it's not impossible because we all saw them and we talked about it afterwords. So how can I have faith in the Bible when there is no mention of this in the Bible? I mean how could God overlook something so important as space people? This has wrecked my faith. I really need to have an answer about it. \" To which my Father nervously replied again that \"Well, I'm sure you thought you saw something, but you just couldn't have seen that\" By this time my father was flagging me out of the room, I was walking slowly to the kitchen and didn't realize what I was hearing, but I could see one thing. My Father was more visibly upset than I had ever seen him. It was my Father's face that caused me to remember the event all these years. He had a look of shear panic and confusion and desperation, like I had never seen in the fourty years I knew him. On the way out the door, there, while still on their sidewalk, I asked him what that was all about? and My father just made a sharp guesture with his hand to shut up. So in the car on the way home I asked again what he had been talking about and he said \"oh nothing, just some experiences from the airforce. The problem with this explanation is that it didn't account for the shaking in my father's voice and hands as he tried to drive. Looking back on this event with what we know today. It must have been one of the earlier accounts of not just a UFO, but probably the airforce's detention of actual aliens, as we suspect from Roswell. A UFO sighting alone could not have produced the emotion that I saw in these two men. i never saw a conversation knock my father out of his orbit like that one did, either before or since that fateful night, and we never spoke of it again. i have told friends and family about this through the years, but I have never gone public due to the lack of facts and names, but it feels good to tell somebody. Maybe it will collaborate something from the Tacoma, WA. area someday, who knows. Sincerely, Loren Veltkamp"],"Case Number":"10847","Viewing Distance":"Unknown","Region":"Washington","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10847.html.txt","/var/www/straped/mufon/org/10847.html"],"Latitude":"47.254527","Tags":"City","Longitude":"-122.441731"}