{"map":"<A HREF = \"http://maps.google.com/maps?q=40.067694,+-74.403921(10842)&iwloc=A&hl=en\"> mufon case (10842) map </A>","Viewing Distance":"Unknown","Date of the Event":"04/15/2000 12:00 UTC","Case Number":"10842","Log Number":"US-05202008-0017","City":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Region":"New Jersey","Weather Factors":"Unknown","Date Submitted":"04/15/2000 12:00 UTC","Summary":"Any response/ post on web blog","Disposition":"Insufficient Data","trends":[],"divs":["Sighting DetailsObjects that seemed to be as high as a star was moving back and forth in a striaght line at fast speeds as if a star was moving from one side of the sky to another in different directions. To this day can not explain what it was an I don't even bother looking into the sky for long periods of time because I know that there is something out there. 1. I was in a park with a friend, looking up at the sky. 2. I noticed the objects when they started to move back and forth as if the stars where toys and could be placed where ever they wanted to be place 3. I thought I was looking at the stars then noticed that a couple of the bright objects were moving, they were not planes I saw those moving about, they were not even close to this planet they were far away. 4.The objects moved from one place to another usually fast motion, it was not shooting stars, I kept my eye on them and they were moving back and forth. I believe shooting stars just race across the whole sky these stayed in one area of the sky moving back and forth not dissappearing. They didn't move every minute it moved with intelligence not as a machine. 5.I was and still am shocked but not so surprised knowing that I can not prove it but knowing what I saw explains more than what ever sightings occured on earth and thought to be a hoax. Know one to my knowledge has traveled as far as these objects so they can not really explain it or give scientific explanation. I believe that what we do know is that there are other planets, universes, etc. besides earth how could someone be so selfish to believe that we are the only living beings. These objects were far and looked like stars in the sky when they were still. They moved back and forth with intelligence. I do not have any mental illnesses or believe in the tooth fairy. I believe in reality and the reality is that there is a thing called space and there are other intelligent beings out there wheter it be ants or snails. 6. I stoped watching the sky and the movements became less and less so I stoped. I tell people I know about it besides there was about ten other people there who saw it. Its just something that happened that your like wow, who could ever explain that. I know that whatever it was it was intelligent. I wish someone had a video camera to catch it on tape. Finally I fell like this true unbelievable to some story in my life can be put to use, thanks."],"Source":"MUFON","Country":"United States","Object Shape":"Star-like","Longitude":"-74.403921","Sighting Duration":"02:00:00","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/10842.html.txt","/var/www/straped/mufon/org/10842.html"],"Latitude":"40.067694"}