{"divs":["sighting detailsi was sitting on the beach with my date. it had been dark for half hour or so (after sundown). we saw 3 or 4 military type helicopters about 1\\4 mile off shore shining their lights in the water. i figured it was a training exercise of some kind. as we watched for a few minutes, i noticed a black shape that moved off-shore along the beach in front of us, no lights on the object but there was a strange effect with surrounding light. it was considerably larger than the helicopters. there was no sound i could detect, although you could hear the helicopters further in the distance. hard to tell exactly what shape it was. we both saw it and agreed it was strange with no lights or noise. seemed to travel faster than the helicopters, but may have been an illusion as it was closer. it seemed like light may have passed through it, but can't be sure. some type of distortion of light. we had a few beers at dinner, but we were not drunk or under influence of any other substance. i felt exhilaration, no fear. it passed by quickly so there was no time to be afraid. no physical evidence."],"Country":"United States","Date Submitted":"08/22/2006 12:00 UTC","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Log Number":"US-05202008-0021","Longitude":"-80.926998","files":["/var/www/straped/mufon/html2text/10846.html.txt","/var/www/straped/mufon/org/10846.html"],"Tags":"City","Case Number":"10846","Object Features":"Unknown","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around August 22nd 2006"],"Region":"Florida","Source":"MUFON","Latitude":"29.025819","Weather Factors":"Unknown","City":"New Smyrna Beach","Sighting Duration":"Undisclosed","Date of the Event":"08/22/2006 12:00 UTC","Summary":"silent dark object off the beach","map":"<A HREF = \"http://maps.google.com/maps?q=29.025819,+-80.926998(10846)&iwloc=A&hl=en\"> mufon case (10846) map </A>"}