{"Log Number":"US-05202008-0020","files":["/var/www/straped/mufon/html2text/10845.html.txt","/var/www/straped/mufon/org/10845.html"],"divs":["Sighting DetailsI was traveling from Panama City, Florida on Highway 98 toward Fort Walton Beach. When I was around the Seaside, Fl area, I noticed these two patterns in the sky. When I reached the 331 bridge about five minutes later, I noticed the pattern still in approximately the same place. I worked at the Central Control Facility at Eglin, so at first I thought it was a night mission. When I reached the Mid Bay bridge, I decided to try to get closer to the formation and went over the bridge on my way to Fort Walton instead of taking 98 all the way home. I followed it all the way to the Eglin range gate near Bluewater Elementary and when I was almost directly underneath it, I rolled down my windows hoping to confirm it was six helocopters in formation. I was stunned when I heard complete silence. I don't know what type of aircraft can appear to move so slowly and not producec any sound. I am trying to reach the person I was meeting in Panama city to confirm an exact date. I think that this was on a Friday or Saturday night. The following week I checked the missions and there were no night missions that were flown that weekend, at least not at my clearance level that I would be able to find out about. I never really mentioned this to anyone until I saw other footage of the almost identical phenomenon that I had seen. I assumed it was something with the air force base ad never really thought much else of it. I think it is important to report this for historical reference. I hope to have confirmation on the date of occurrance soon."],"Weather Factors":"Unknown","City":"Destin","Object Shape":"Triangle","Date Submitted":"05/01/2003 10:00 UTC","Sighting Duration":"Undisclosed","Summary":"two sets of 3 lights. each set in an isosceles shape silent and moving slowly","Longitude":"-86.492823","Disposition":"Unknown","Tags":"City","Date of the Event":"05/01/2003 10:00 UTC","Case Number":"10845","Region":"Florida","trends":["There have been 10 other sightings in Destin","There were no other sightings in Destin on or around May 1st 2003"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.398914,+-86.492823(10845)&iwloc=A&hl=en\"> mufon case (10845) map </A>","Object Features":"Unknown","Latitude":"30.398914","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path,Other"}