{"Case Number":"10850","Sighting Duration":"Undisclosed","Longitude":"-92.459889","Disposition":"Unknown","Tags":"City","Weather Factors":"None","Object Features":"None","City":"Cloquet","Source":"MUFON","divs":["Sighting DetailsI was traveling from Moose Lake to Cloquet on Hwy 61. I looked up from my windshield and saw a metallic object. At first I thought it was a jet liner on approach to Duluth. As I gazed at it, I thought, there is no jet liner that big and no way would one be that low, as Duluth Airport is about 20 miles away. As I watched it, it was kinda skimming the treetops at a moderate speed, when all of a sudden it just disappeared. I don't think it sped up and away as much as it just dropped down below the trees. There are several large forests of tall pines which could easily hide something of that size. I watched it for perhaps 30 seconds before it disappeared. I was close enough to not see any windows, wheels, or strobs of anykind. My father was a pilot in the army and privately. I have been around planes my entire life and also visited many air shows and aviation museums. I have never seen anything like that metallic object before. I was about 26 years of age, with 2 small children in the car and I tell you, I had goosebumps all over my body from that sighting. Would also like to note, that when I was about 12, my family and a friend of the family (a police officer) where camping down at Grand Lake in Grove, OK. It was dark, about 10 at night when we noticed a bright light off to the NW. We watched this light travel around us in a semi circle (behind us) and we all tracked it. My dad and his friend were trying to figure out what type of aircraft it might be. As it circled around and came up in front of us, it suddenly stopped, hovered for about 15 seconds, then shot straight up and out of sight. I turned around to question my dad and him and his friend were both wide eyed with mouths open. Then my Dad said, that was no aircraft, and his friend agreed. What did we see? I don't know, but I know that no airplane, helicopter or weather ballon could do what it did."],"Log Number":"US-05202008-0025","Summary":"Traveling by car, saw a metalic object in sky, thought it was a jet liner. Too low and too big","files":["/var/www/straped/mufon/html2text/10850.html.txt","/var/www/straped/mufon/org/10850.html"],"Region":"Minnesota","Latitude":"46.730657","Date of the Event":"04/30/1979 01:00 UTC","Country":"United States","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Object Shape":"Cigar","trends":["There have been 2 other sightings in Cloquet","There were no other sightings in Cloquet on or around April 30th 1979"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.730657,+-92.459889(10850)&iwloc=A&hl=en\"> mufon case (10850) map </A>","Date Submitted":"04/30/1979 01:00 UTC"}