{"Weather Factors":"None","Log Number":"US-05212008-0002","Disposition":"Unknown","Region":"New Jersey","Longitude":"-74.399901","Latitude":"40.067484","Date Submitted":"07/17/1994 01:00 UTC","City":"Newark, Plainfild, N,plai","Country":"United States","divs":["Sighting DetailsIt was a hot summer day in July when a friend came by to show me his new car, and he asked me if I wanted to go and wash it with him?... I said yes because it was a new Vet and I never drove one. After we did that we came back to my apartment and as he parked it under a tree, and as we stood there and talked about the car, a bird did its thing on it. You know what I mean... My friend then asked me for a paper towel, so I went inside and as I walked out I told my friend lets look for that bird and do the same too him. As we laughed I looked up as if I was looking for the bird, and at this time was when I spotted this weird thing in the sky. I told Juan to check this out, he didn't see it right away because remember his was cleaning his car. But then as we both stood there stunned from what we where looking at, time just flew by, and I didn't think nor did anyone mention to get a camera or recorder, i guess we where too shocked...I did call other people out it was a Saturday's. We where all shocked... But as we all stood there looking at this thing, and as it started moving East on RT 22 in North Plainfield, NJ I ran inside and ask my pissed off wife if she knew where the recording camera was??? after 2 or 3 minutes of asking and yelling there was a UFO outside she told me, I wanted to have her up ducted, but of course by that time it was too far to film and beg for her upduction. Just kidding... Everyone else kept watching this thing move away. Once it moved to the east it stood still again and some other object seemed to had meet up with it. As we kept looking, by this time you could still see the UFOs, I would say spinning, because every time we would see a bright silver glow from it. But as the other UFO flew on top I would say it was about 5 minutes it was over... They both vanished from our sights... as if they where never there. This is my true store I have no reason at all to express this to you. I do tell my friends and they seem to believe me, but you know they really don't. I do swear on what I most love My daughter that what I saw that day was not of this world... Thank you Bill Muller"],"Tags":"City","Date of the Event":"07/17/1994 01:00 UTC","Object Features":"Unknown","Object Shape":"Circle, Disc","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.067484,+-74.399901(10855)&iwloc=A&hl=en\"> mufon case (10855) map </A>","Sighting Duration":"Undisclosed","Case Number":"10855","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10855.html.txt","/var/www/straped/mufon/org/10855.html"],"Summary":"UFO OVER JERSEY!","Object Flight Path":"Path then hovering","trends":["There have been no other sightings in Newark, Plainfild, N,plai","This sighting has never been favorited."]}