{"Country":"Canada","Object Shape":"Oval","Viewing Distance":"501 Feet - 1 Mile","Summary":"Hovered over the south eastern downtown part of the city for a very long time. Very bright light, no sound.","Object Flight Path":"Stationary","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around June 16th 1978"],"City":"Montreal","Longitude":"-73.550492","divs":["Sighting DetailsThis is a very famous group siting for Montreal. The date and time is so approximate because it was so long ago. When I saw a documentary on television and it was mentioned it gave me chills because I had witnessed it too. That evening I had gone for a ride on my bicycle as I usually did through the city looking for new places. I would often do this sometimes with a friend. This night I was alone and I had chosen the eastern section of the island. I believe I started out going north and then east then south till I got to Notre Dame or Sherbrooke street to head downtown before heading home. When I was at approximately the imfamous 1976 Olympic stadium I noticed some very bright lights in the west. They were so bright that I thought that they were closer than where they actually were. I thought it was some sort of festival or event going on so I rode towards them to observe and possibly participate. However the light or lighted area seemed to come from the sky and station itself over a particular area that I could not find and I just kept riding towards what would be the center of it. As I got closer it was clear that it was coming from downtown. I found this very strange because with all the bright lights that are downtown this light was still brighter and extremely predominant. Finally I arrived on St Jacques Street and Peel. That is approximately 8 miles from where I first noticed the light or lights. It had seem to be directly over what was then called the \"Chateau Champlain\" hotel. I was puzzeled because there was no festival going on and the light seem to be coming from the sky. I drove around the area trying to find the source of light but it was in the sky and it stayed there even after I left. At the time I was so perplexed because I had no answer to what I had witnessed in that last hour. I remember riding away to go back home and kept looking back to take in what I had just witnessed. All I remember thinking was \"what was making that light?\" I knew downtown well as most of my rides would end up there. That was my only encounter with an U.F.O. I understand how it must be frustating to some people who have closer encounters and they are not believed. The experts can give me an explanation but I know what I experience and they could never convince me of anything other than what I witnessed. They would have to reproduce it before I would believe them otherwise. I'll never forget! It was exhilerating! Little did I know that there were people on the roof of the hotel that witnessed it much closer than I and were very frightened."],"Weather Factors":"Fog","Latitude":"45.51584","Date Submitted":"06/16/1978 10:15 UTC","files":["/var/www/straped/mufon/html2text/10854.html.txt","/var/www/straped/mufon/org/10854.html"],"Tags":"City","Log Number":"CA-05212008-0001","Disposition":"Unknown","Region":"Quebec","Case Number":"10854","map":"<A HREF = \"http://maps.google.com/maps?q=45.51584,+-73.550492(10854)&iwloc=A&hl=en\"> mufon case (10854) map </A>","Source":"MUFON","Sighting Duration":"01:00:00","Object Features":"Unknown","Date of the Event":"06/16/1978 10:15 UTC"}