{"Latitude":"36.393752","Object Features":"Unknown","trends":["There have been 2 other sightings in Roxboro","There were no other sightings in Roxboro on or around December 27th 1996"],"Country":"United States","Summary":"A sharp, gray, non-lit triangle","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/10856.html.txt","/var/www/straped/mufon/org/10856.html"],"Longitude":"-78.982788","Weather Factors":"Unknown","Date Submitted":"12/27/1996 09:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.393752,+-78.982788(10856)&iwloc=A&hl=en\"> mufon case (10856) map </A>","Disposition":"Insufficient Data","Log Number":"US-05212008-0003","Date of the Event":"12/27/1996 09:00 UTC","Case Number":"10856","divs":["Sighting DetailsThe image sticks in mind to this day from that night over 10 years ago. Being twenty years old now, I remember in vivid detail where I was, where I was going, who I was with and what I saw in the sky that night. While late in driving to my step-father's mothers house for What I remember to be a Christmas dinner, I was with my mother as we drove through the dark highway going toward Oxford. As we were riding I remember nagging my mother as most eight-year olds do, until we saw what appeared to be a reflection in the sky. The moon, placed at it's particular angle of night, happened to shimmer off what appeared to be a wide, triangular shape pointed by three stars. As I looked to my mother, who had been anxiously chewing a piece of gum in place of her cigarette, I noticed she was looking the same direction in the sky I was at the time. It was at that point, the reflection was clearly that of some sort of CRAFT, which then disappeared in a single glance. Together, my mother and I stopped what we were doing. I asked, \"What was that Mommy?\", and her reply was, \"I dunno son.\" I remember a slight fear, being replied by a boost of adrenaline as to the possibilities of what I saw that night. To this day, I remember the craft I saw that night. What it was, I dunno. I was eight-years-old and I know kids have an imagination... but when such a thing causes my mother to stop chewing her gum to keep quiet during my child-hood rants, it was definatly something. My mother will no longer acknowledge what we did infact see that night... but I know, and I know SHE knows... if anyone else saw it, I'm not to say. But what happened that night did happen, and I promise you it was not of this world."],"Object Shape":"Diamond, Star-like, Triangle","Sighting Duration":"Undisclosed","Region":"North Carolina","City":"Roxboro","Source":"MUFON","Viewing Distance":"Unknown"}