{"City":"Loveland-Madeira Corridor","Log Number":"US-05202008-0027","Country":"United States","Date of the Event":"02/17/2008 09:40 UTC","Object Shape":"Other","Summary":"I think i startled it.","map":"<A HREF = \"http://maps.google.com/maps?q=39.277948,+-84.255836(10852)&iwloc=A&hl=en\"> mufon case (10852) map </A>","Latitude":"39.277948","Longitude":"-84.255836","files":["/var/www/straped/mufon/html2text/10852.html.txt","/var/www/straped/mufon/org/10852.html"],"Source":"MUFON","divs":["Sighting DetailsI was bored one night and thought that I would go revisit the old countryside to see whats all been done to it and see what has changed if anything. So I went for a drive in my Celica and as I started up State Route 48, I decided to make a left turn onto Butterworth road. As i crested the hillside my car started to lose power and I was thinking that this was great, im out here in the boonies and my car decides to act up. So after saying a few choice words i pulled my car over to see what was wrong with it. As i was pulling over my car completely lost all lights and died on me. I opened my car door and popped open my hood and i heard a commotion in the field behind me. I turned around and yelled to try and frighten off any stray dogs and as i yelled there was a little more russling in the corn field and then i felt a slight breeze which turned into a strong gust of wind. It felt like when you stand in front of a powerful fan but to a much more extreme. There was hardly any noise and all of a sudden a massive dull light appeared. It wasnt blinding, it was more like looking at a lampshade when the light was turned on. Then to my amazement this (for lack of a better word) craft raised up out of the corn field and and the lights on the front of this thing reminded me of a football stadium light array but not as bright...not even close. It hovered for a second or two then slowly passed almost over top of me where i got a good look at the undercarriage of this thing. For some strange reason i wasnt scared, It felt normal almost, like it belonged there. The bottom of this craft had these Neon like tubes that glowed softly and started out as white as a sheet. Then there was a small humming sound, very faint but detectable in the outdoors where it was as quiet as a church mouse. The tubes started to change colors softly from white to yellow to orange then red. This seemed like it took a few minutes for it to do as it just hovered there. I watched in amazement at this sight thinking this has got to be my imagination but the breeze was constant and the debris from the road was moving around in a swirling pattern it seemed. i could feel my clothes being moved about as the wind rushed from this thing. The humming stopped and then it started upward slowly at first then it shot off like a dart turning completely red in coloration. It stopped and started bouncing a bit...then it shot due east and came to a complete stop. then it looked like something hit it as it dove straight down. It came to another halt. Then it made these zig-zag motions and then came to almost where it was before when it first shot off. It hung there for a few moments then took off east again and made these series of loop-de-loops and then came to a final halt before it darted off in a blink of an eye and became no longer visible. I cannot tell you how bewildered i am of this. I am open to ideas but i am normally very skeptical when it comes to some things. This has put most of my skeptical ideals out the window. I cannot explain it, I carry a camcorder and a camera around with me now at all times just in case something like this happens again. I am still dumbfounded yet i feel a sense of awe and a serious sense of underachievement as mankind. I was never scared...more like shocked at what i was witnessing. It truely was a spectacular moment in my life and i dont care if people believe me or not...but someone needs to know."],"trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around February 17th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date Submitted":"02/17/2008 09:40 UTC","Region":"Ohio","Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"20 Feet or Less, Unknown","Object Features":"Patterned Surface, Louvres","Tags":"City","Case Number":"10852","Disposition":"Unknown"}