{"Summary":"bright white light moving from southwest to northeast. No sound.","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.558374,+-85.659144(10868)&iwloc=A&hl=en\"> mufon case (10868) map </A>","Tags":"City","Object Flight Path":"Undisclosed","City":"Marion","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"United States","Date of the Event":"05/21/2008 10:45 UTC","Log Number":"US-05222008-0001","divs":["Sighting DetailsI was winding up the evening as a caregiver in a program home. I stepped outside on the patio to smoke a cigarette. It was a very clear and cool night and I enjoy looking at stars and sure, I often thought about seeing a ufo but all I ever seen were airplanes. I was looking straight west and then out of the corner of my left eye I see a very bright light at about 70 deg. coming from behind some trees toward the southwest and heading northeast toward Ft. Wayne. There were alot of planes earlier that night and I thought that was just what that was. I viewed it as a plane coming straight on with bright forward running lights. As it got closer to my position I realized there were no flashing collision lights at all. It was moving very smooth, very constant in a straight line. Then when it was at 90 deg., directly over me, it was still a big bright light. I reasoned if it had been an airplane, those lights would have diminished but had not. The brightness was even maintained as it moved away from me heading northeast. I still waited to hear the sound of a jet engine but realized everything had been dead quiet the whole time. I just stood there and watched it as it moved out of sight."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10868.html.txt","/var/www/straped/mufon/org/10868.html"],"Disposition":"Insufficient Data","trends":["There have been 7 other sightings in Marion","There were no other sightings in Marion on or around May 21st 2008"],"Longitude":"-85.659144","Case Number":"10868","Region":"Indiana","Date Submitted":"05/21/2008 10:45 UTC","Viewing Distance":"Unknown","Latitude":"40.558374"}