{"divs":["Sighting DetailsI walked outside from my house and I was going to ask my mom a question and I looked up at the sky because I like to look up at the stars. It was a bright clear night and there were alot of stars in the sky. The minute I looked up I happen to see a bright light shoot across the sky.My dad was standing by me and I yelled, \"look a shooting star.\" as I was yelling that, I saw many of them bright star-like lights move in all different directions. Some were going side by side, others were going in a group of three right next to each other,I also saw some going in a line of two right behind one another. Some were going in zig-zag form really fast. I just kept watching them as they passed through the sky.... I couldn't believe how many there were. Most of them were headed to the North coming from the South.I looked down for a minute at my dad and said, \"what is that?\" Those can't be shooting stars.There not airplanes. He said should I go get my video camera? I said, yeah. As he stepped inside, I continued to look up, I saw so many of them still going fast through the sky.I was shocked and thinking to myself what is happening in the sky.I then ran in the house and yelled look their still alot flying through the sky as my dad was getting his video camera set up.We both walked back outside and looked up and it slowed down, all we saw then were 2 star-like lights in the sky going North. We tried zooming in on them, but his camera couldn't pick up anything that far away into the sky.I continued to look up and there was nothing, but the bright stars out on this cool night.It went on for about an hour."],"Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"05/21/2008 09:30 UTC","Latitude":"42.910572","Disposition":"Unknown","Longitude":"-87.860637","Summary":"I witnessed alot of star-like objects going in zig-zag patterns going North from the South","Weather Factors":"None","Tags":"City","trends":["There have been no other sightings in South Milwaukee","This sighting has never been favorited."],"Case Number":"10877","Region":"Wisconsin","Object Shape":"Star-like","Sighting Duration":"01:00:00","Log Number":"US-05222008-0010","files":["/var/www/straped/mufon/html2text/10877.html.txt","/var/www/straped/mufon/org/10877.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.910572,+-87.860637(10877)&iwloc=A&hl=en\"> mufon case (10877) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"05/21/2008 09:30 UTC","Country":"United States","Object Features":"None","City":"South Milwaukee","Source":"MUFON"}