{"Tags":"City","Date Submitted":"05/21/2008 09:04 UTC","Latitude":"36.783891","Log Number":"US-05222008-0005","Object Features":"None","files":["/var/www/straped/mufon/html2text/10872.html.txt","/var/www/straped/mufon/org/10872.html"],"Case Number":"10872","Viewing Distance":"Unknown","Longitude":"-119.414392","City":"fairfield/TAFB","Disposition":"Hoax","Object Shape":"Flash, Star-like","divs":["Sighting DetailsIt all started about 9:04am I saw a star that looked like it was moving... I dismissed it as an optical illusion till I noticed it was actually going across the sky immediately after my initial notice my girlfriend points to the right of where I was looking and there was another object closer and brighter going across the sky. Then soon after that there was a streak of white light parallel to the ground which I thought was a shooting star my girl friend disagreed. Utterly intrigued I remained outside head pinned upwards. I live very close to Travis Air Force Base and almost instantly a get was scrambled and was circling around the circumference of the base round and round. I saw 10 object in total over this hour long period the majority of them looked as though they were heading away from where I was observing past the base. Some of the objects would just move for a bit in then seem to swirl out into nothing, just disappear. There were other planes out during the night and I can assure you these were no planes. As all this was going on I kept trying to call all of my friends to see if they had seen anything I did find one that saw the one in the first set I saw. It was a very interesting night to say the least."],"Region":"California","Date of the Event":"05/21/2008 09:04 UTC","Object Flight Path":"Straight-line path","Summary":"Bright stars moving about the sky","Sighting Duration":"01:00:00","Weather Factors":"Windy, Light","Source":"MUFON","trends":["there have been no other sightings in fairfield\\tafb","This sighting has never been favorited."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.783891,+-119.414392(10872)&iwloc=A&hl=en\"> mufon case (10872) map </A>"}