{"Disposition":"Insufficient Data","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting Details I was awaken in the early morning by a bright light that shined thru an opening thru my bed room window. That window was about 2.5' from the ceiling and 3' from the floor. Covering the window was a ply-wood that only left an opening at the very top and it was about .5' gap. The total size of the window was about 5'. Anyways, the first thought in my mind was \"who are the cops after now\"? when all of a suden a being came thru the window like a ghost. I felt fear and at the moment I was going to scream and loose it, it talked to me and said with my own voice inside my head \"Don't worry, relax everything's going to be OK\". And I felt so relaxed all of a sudden. Then She startwed to walk to me. I felt it was a female, she had long blondish hair, small opening for a nose aswell as moth and big dark eyes her skin was greish-green. I could'nt move anything but my eyes. Thats when she messaged my bad knee, which was hurting me for year and only getting worst. Finally I awoke not even thinking about what had happend . When I got up off my bed and realized my knee did not hurt anymore and until this day I'm fine. I don't know what happend only that it felt like a dream but my knee if fine. Only questions rumble thru my head, like why thru the window not thru the wall, the knee of course, and why me?"],"Tags":"City","Region":"Illinois","Longitude":"-87.620488","Date Submitted":"05/31/1998 12:00 UTC","Summary":"Realy bright light","Log Number":"US-05222008-0006","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.885824,+-87.620488(10873)&iwloc=A&hl=en\"> mufon case (10873) map </A>","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Case Number":"10873","City":"Chicago","Latitude":"41.885824","Sighting Duration":"Undisclosed","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 31st 1998"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/10873.html.txt","/var/www/straped/mufon/org/10873.html"],"Weather Factors":"Unknown","Date of the Event":"05/31/1998 12:00 UTC"}