{"Date of the Event":"05/14/2008 08:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.606044,+-118.062865(10881)&iwloc=A&hl=en\"> mufon case (10881) map </A>","trends":["There have been 2 other sightings in Lone Pine","There were no other sightings in Lone Pine on or around May 14th 2008","This sighting has never been favorited.",""],"Summary":"Two orange alt blinking lights above Inyo mts East of Lone Pine CA.","Latitude":"36.606044","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/10881.html.txt","/var/www/straped/mufon/more/10881_submitter_file1__July2007vacation034.jpg","/var/www/straped/mufon/org/10881.html"],"Object Shape":"Flash, Saturn-like, Sphere","divs":["Sighting DetailsOn May 14, 2008 at 20:40. Whitney Portal Ca. @ 8,000 ft elev. I happened to look East over the Owens Valley at just above the Inyo Mt skyline. (finger width) I noticed two stationary orange blinking lights that alternated on and off for about 1 second. They were the size of an \"o\" (at arms length) The distance between the lights was the width of an \"o\". By the time I thought this to be a strange sight and I should get the camera the lights stopped. five to eight seconds later single orange light of the same size blinked on for a second about 2 inches South of the original sighting. I watched for 5 mins and nothing after that. The lights were not moving when they were on. I looked at my watch and it was 8:40 pm. The attached photo is a view of the skyline where the lights were sighted. lights were in left of the dead tree and in the V notch in the mountain. The single light that was sighted was on the right side of the dead tree and a little higher than the original two lights. This photo was of the sunrise with cloud cover. In My sighting the sky was clear."],"Longitude":"-118.062865","Tags":"City","Region":"California","Country":"United States","City":"Lone Pine","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"US-05232008-0003","Object Flight Path":"Undisclosed","Date Submitted":"05/14/2008 08:40 UTC","Case Number":"10881","Disposition":"IFO","Sighting Duration":"Undisclosed","Source":"MUFON"}