{"files":["/var/www/straped/mufon/html2text/10888.html.txt","/var/www/straped/mufon/org/10888.html"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Latitude":"45.527372","Log Number":"US-05232008-0010","Sighting Duration":"Undisclosed","Object Features":"Dome, Patterned Surface","Country":"United States","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=45.527372,+-122.669037(10888)&iwloc=A&hl=en\"> mufon case (10888) map </A>","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"05/15/2008 01:00 UTC","City":"Portland","Date of the Event":"05/15/2008 01:00 UTC","divs":["Sighting DetailsMy brother and I were on our way home from picking up his work check on the 15th of May 2008 and I looked out of the window and saw a large passenger plane slowing down as if getting ready to land then I noticed an object behind it.I then started to really look and get a clear view,this object was about a hundred feet behind it,directly behind it.I noticed that it was an unusual shape for a plane and I realized it wasn't a plane.The top hade a pink colored dome in the middle and the botton looked dirty gray and didn't reflect the sun the way the plane did.It kept its didtance and stated behind it the entire minute that I saw it.It then went out of sight and it was behind trees and at that time we lost it.The plane appeared to be going in for a landing at the Portland airport.It appeared to be over a thousand feet from the ground.My brother turned several times to look at it but he was driving and couldn't look at it the way that I could.I would be willing to take a lie detecter test.So would my brother.Thank you for your time.Jane"],"trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around May 15th 2008"],"Region":"Oregon","Disposition":"Insufficient Data","Longitude":"-122.669037","Source":"MUFON","Summary":"We and my brother were traveling east on S.E. Halsey saw space craft to our left.It was traveling west.","Case Number":"10888"}