{"City":"Boynton Beach","Longitude":"-80.058911","Country":"United States","Summary":"We saw what initially looked like a satellite shoot off at acute angles.","Date Submitted":"10/15/1981 09:30 UTC","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Log Number":"US-05232008-0009","map":"<A HREF = \"http://maps.google.com/maps?q=26.527389,+-80.058911(10887)&iwloc=A&hl=en\"> mufon case (10887) map </A>","Sighting Duration":"00:00:10","Viewing Distance":"Unknown","trends":["There have been 6 other sightings in Boynton Beach","There were no other sightings in Boynton Beach on or around October 15th 1981","This sighting has been favorited 1 time.",""],"Object Shape":"Star-like","divs":["Sighting DetailsI was walking on Boynton Beach, Florida around 9:30PM with my girlfriend. We walked there frequently in the evenings. There was a public parking area at Boynton Beach. A few people were around. The area was well lit, but a little darker on the beach itself. We liked to walk and talk and look at the surf and sky. We were not under the influence of anything. I noticed what I thought was a satellite moving across the sky. If you have ever seen a satellite at night it glints with reflected sunlight and describes a precise orbital line across the sky. I was sure it was a man made orbital satellite. I pointed it out to my girlfriend and told her it was a satellite in orbit. As we were both looking at it, it suddenly darted off at about 3 acute angles and vanished. It initially appeared to be moving as a satellite would across the sky, to the northwest. It appeared to be that size, no brighter than the stars. Then it darted off and made about three acute turns, at an unbelievable speed, and vanished out of sight. If this object was at orbital height, like a typical man made satellite, when it darted off, it must have been travelling at many thousands of miles an hour. This speed, as it appeared to us, defied the laws of physics. We were astonished, and couldn't explain this sighting as a bug, airplane, jet or anything but a UFO. I don't think this sighting was more than 10 or 20 seconds. This happened around 1981. This is to the best of my recollection. I have never forgotten it, and my nephews and neices have suffered through the story dozens of times!"],"Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/10887.html.txt","/var/www/straped/mufon/more/10887_submitter_file1__ufo.JPG","/var/www/straped/mufon/org/10887.html"],"Object Features":"Unknown","Tags":"City","Date of the Event":"10/15/1981 09:30 UTC","Latitude":"26.527389","Case Number":"10887","Region":"Florida"}