{"Region":"California","Latitude":"35.497767","Date of the Event":"05/23/2008 01:30 UTC","Weather Factors":"Unknown","City":"Atascadero","Date Submitted":"05/23/2008 01:30 UTC","Object Shape":"Disc, Flash, Square, Rectagular","Object Flight Path":"Stationary","Sighting Duration":"00:00:40","Log Number":"US-05232008-0011","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/10889.html.txt","/var/www/straped/mufon/org/10889.html"],"Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.497767,+-120.665656(10889)&iwloc=A&hl=en\"> mufon case (10889) map </A>","divs":["sighting detailsi was driving home from work in atascadero, california traveling south on el camino real blvd when i noticed something in the sky that my mind could not comprehend. i had never seen anything like this before. it was a uniformly gray colored metallic object very high up in the sky that had seemed to materialize out of a cloud. it did not appear to be moving. as i looked at the object i tried to figure out what it was and found i could not. it was not an airplane or helicopter since it was not moving or shaped like them. it was obviously not a balloon; it was not floating and it was definitely made out of some metallic-like substance. and the object was too high in the sky for it to be attached to a telephone pole. after about 20 to 30 seconds the object emitted a bright white\\yellow light and appeared to disappear into the clouds. the light could have been sunlight reflecting off the object as it moved back into the clouds or it could have been emitted by the object itself; the object was too far away for me to be completely sure. i watched the sky for another five minutes or so to see if the object would emerge from the clouds but i did not see it again."],"Longitude":"-120.665656","Tags":"City","trends":["There have been 5 other sightings in Atascadero","There were no other sightings in Atascadero on or around May 23rd 2008","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"a metallic object appeared right outside of a cloud, hovered motionlessly for about 30 seconds, flashed a bright light, and disappeared into the cloud","Country":"United States","Case Number":"10889"}