{"map":"<A HREF = \"http://maps.google.com/maps?q=32.228553,+-110.917249(10880)&iwloc=A&hl=en\"> mufon case (10880) map </A>","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 15th 2003"],"Object Shape":"Sphere, Star-like","divs":["Sighting DetailsI am a 31 year-old white, college-educated, male. I am a professional photographer from St. Louis, Missouri. At the exact time of the sighting, I was sitting in the backyard of my cousin's home located off Cortaro Farms Rd., NW of Tucson off of highway 10 around 1 am. During this time, my cousin's husband, a white-male in his mid-forties, was seated next to me as we conversed, relaxing, and gazing at the clear night sky. As far as I am aware, we were the only people outside in the vicinity or for that matter aware of the craft that we observed for an hour. Seated on the back patio, looking up and towards the distant NW sky, I noticed a small, spherical shaped object at about 45 degrees. The object was completely stationary and didn't move as far as I could tell for the entire sighting. I noticed it because I had been enjoying looking at the open, dark desert sky for a while that evening. I was on vacation, I grew up in the Mid-West and rarely leave the city anymore, taking the time to leisurely gaze at a night sky that is unavailable where I live. I noticed the object because, after a while, i kept coming back to it over and over again while scanning the sky. The object, from my vantage point and to the naked eye, was small and spherical-shaped. It seemed like a very large, star in the night sky. It's primary characteristic was that the distant object was emitting an intense, multicolored light. The light, seemingly bursting out of the object, was consistent in it's multicolored strobe-like effect; it seemed that the orgin of the colored strobe was not a single lens, bulb, panel, or LED, but many bulbs or lenses on the sphere pulsating different colors of light simultaneously like a transparent disco ball with an internal light source. Because of the intensity and brightness of the light, the craft may have been another shape besides spherical; with the properites of light and physics, the light I observed was eminating from obvioulsy a source and source of light in darkness descibes only the shape of the source, not the shape of the object that possesses the source. There was no way to ultimately tell the shape but it seemed spherical. The presence of the stationary object in the clear, Arizona night sky started to really bother me. This was way to big to be a star I thought. Way too bright and multi-colored to be a star. It wasn't moving. It could have been mistaken for a star at a passing glance, but after a short while looking around and comparing the object to other stars, planes, and helicopters in the night sky, it stood out more and more. I grew up near a small airport and knew this wasn't air traffic simply because of the light coming from it and it's absolute stationary positioning. This was something I had never seen or heard of in my life. I pointed out the object to my cousin's husband, a native Arizonian and outdoorsman, and asked him if he could identify it. He could not. We intently stared at the light for twenty minutes. We absolutely could not explain what we were witnessing or liken it to any object or experience that we have ever had. Our awareness of the light in the sky after about twenty minutes became extremely unsettling. Similtaneously our reaction to the presence of the object was that of intense curiosity and caution. My cousin's husband rose from his lawn chair next to me, walked into his house, turned out all of the interior and exterior lights of the home and property, and came back in a few minutes carrying a telescope and tripod. We walked over to a nearby picnic table in the backyard and set up the telescope on top of it. I manned the telescope first. Once I located the object in the telescope's viewfinder and focused the lens on the pulsating light, I clearly saw the object close-up. The object's purpose, positioned in the night sky, seemed more like that of an unmanned probe than a transport craft. It just sat there in the sky bursting with different, small strobes of color. There was no way to tell the ultimate size of the object because of it's distance. The object had to be at least located 10 miles away from NW of our position. My cousin's husband and I took turns viewing the object with the telescope for another 30 minutes. We referred to it at the time of our extended sighting as a U.F.O.. During this time, I became quite alarmed from observing the object. I felt like the crushing weight of a newfound reality had been dropped on our mood and our psyches. I felt like certainly what I was witnessing delivered unsolicited implications that would directly effect myself and the entire world in the near future. Fueled by adrenaline, an agonizing reappraisal of my awareness and existence in life raged in my mind. During the event and reflecting back on it, I can only conclude my reaction was the process of an instinctive human survival technique that occurs when one is faced with situations that must be instantly digested and mentally processed. The object remained in the night sky. Dealing with his own inner turmoil, my cousin's husband went inside to bed, leaving me outside alone. I stayed outside looking at the object for another 15 minutes. I was a guest, it was getting late, I had to go to bed, the next day was an early one. Going inside to bed, leaving the U.F.O. in the sky behind me was really hard. The next evening the object was not visible. Note; This experience has stayed with me. Too many questions unanswered. What made me make this report now is that not only did I see recent footage of the exact same object a few months ago on the show UFO Hunters on television captured in Ohio near Lake Erie, but more importantly, last night my relative outside of Tucson witnessed another sighting of the same, exact craft in the night sky but this time there were 5 of the spherical, pulsating multi-colored lights in a loose circular formation."],"Disposition":"Unknown","Weather Factors":"None","Source":"MUFON","Country":"United States","Viewing Distance":"Over One Mile","Log Number":"US-05232008-0002","Latitude":"32.228553","Date of the Event":"05/15/2003 01:00 UTC","Tags":"City","Case Number":"10880","Date Submitted":"05/15/2003 01:00 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-110.917249","files":["/var/www/straped/mufon/html2text/10880.html.txt","/var/www/straped/mufon/org/10880.html"],"City":"Tucson","Region":"Arizona","Summary":"Two adult males observe a distant, stationary craft/probe object emitting intense multicolored light for an hour with a telescope outside of Tucson.","Object Flight Path":"Stationary"}