{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 10 other sightings in Greenville","There were no other sightings in Greenville on or around January 26th 2008"],"Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.860918,+-82.38631(10885)&iwloc=A&hl=en\"> mufon case (10885) map </A>","Summary":"there were two very bright lights - that to the eye looked inches apart","Object Features":"Unknown","Case Number":"10885","Longitude":"-82.38631","City":"Greenville","Sighting Duration":"Undisclosed","Region":"South Carolina","Country":"United States","Object Shape":"Other","Date Submitted":"01/26/2008 05:45 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/10885.html.txt","/var/www/straped/mufon/org/10885.html"],"Disposition":"Unknown","Tags":"City","Latitude":"34.860918","divs":["Sighting DetailsEvery morning at almost the same time I would go outside on my deck because I let the dogs outside in their penned areaas I start my coffee at around 5:45am. I would often just stand outside and look at the dark sky and the stars. Of course it usually looks pretty much the same. This one morning-I caught myself staring because there were two really bright spots of what looked like bright white light that I never noticed before. I remember thinking that it would be strange that these two 'stars' would appear in a spot and be so darn bright that I wouldnt have noticed them moving to that position over the days weeks or days. They kind of looked like a part of the Big Dipper but brighter. And I thought-that cant be because its never at that location-the dipper is way to my right and behind me-not directly in front-at least it never was yet. So if I were to give it an eyes distence it would have been four inches appox that the lights were spaced apart. o o As I watched, they moved at the same time at a steady speed, so that they were out of my field of vision in about 8 seconds. They did not strobe or flash-the light remained constant and they moved together in a straight due north direction. I was so caught up in the intensity of the moment I couldnt move. It was almost as though there was no sound at all. I looked around for any mention of anything someone might have reported in the sky and didnt see anything....I didnt want to tell too many people because I was concerned about my reputation. I know what I saw was no star-no plane-no blimp-no flare. But I dont know what is was. I am not sure of the exact date-but I moved in Feb and it was not around the holidays, so I am thinking the middle or end of January."],"Date of the Event":"01/26/2008 05:45 UTC","Log Number":"US-05232008-0007"}