{"Log Number":"US-05232008-0008","Region":"Indiana","Tags":"City","Date Submitted":"05/13/2007 11:00 UTC","Case Number":"10886","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around May 13th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.605613,+-86.101089(10886)&iwloc=A&hl=en\"> mufon case (10886) map </A>","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"Very definate that it was not from here.","Latitude":"38.605613","Longitude":"-86.101089","files":["/var/www/straped/mufon/html2text/10886.html.txt","/var/www/straped/mufon/org/10886.html"],"Object Flight Path":"Undisclosed","Country":"United States","divs":["Sighting DetailsI don't believe in all of the hype of UFO's and frankley I can't stand to hear about sightings and see horrible pictures. But, about a year ago I was outside and looked over in the field, a plane seemed to have come down from the sky very quickly, so I thought. I started to freeze up thinking that it was going to crash not far from my home. Then like nothing at all it slowed down to turtle speed and stayed above the fields for a minute and disappeared, I mean literally disappeared. If it was a plane or whatever and flew back up, then it was way too fast for the eye to see. While it was over the fields, it appeared to be oval or round in shape and it was fairly bright. Honestly I froze in shock more or less, trying very hard to convince myself that it was a plane. I tried to tell my family about it, but couldn't find the words and I didn't want to sound crazy. I am a very level headed wife and mother, so I kept this to myself all this time. I don't why I decided to let it out here, I just know that it was eating me up inside and I had to get it out."],"Viewing Distance":"101-500 Feet","City":"Salem","Disposition":"Insufficient Data","Weather Factors":"None","Object Shape":"Circle, Oval, Other","Source":"MUFON","Date of the Event":"05/13/2007 11:00 UTC"}