{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/10884.html.txt","/var/www/straped/mufon/org/10884.html"],"Log Number":"US-05232008-0006","Country":"United States","Date Submitted":"06/22/2008 12:00 UTC","Summary":"Daughter went to the window because she saw a bright light coming, there she saw a disc shaped object in sky","divs":["Sighting DetailsI was gone from the home and returned around 9:15 pm on June 22, 2008. My daughter was still up, I was going to scold her for being awake. She told me she saw something outside my window. She got alerted by a light coming in the window. She looked out and maybe 5 car lengths away about and maybe 200 feet above the ground she saw this round object, hovering, it was silver in color, with little rounded curve on top. She had drawn a picture of it. I went out, put my glasses on and looked and what I saw first were three what looked like US fighter jets going overhead. Then in the distance I could see flashing red and white lights, looked like stars but shot through the sky. Then I would see more what i think were US jets (they were triangular in shape) This went on from June 22nd, 2008 at approx. 9 pm - June 23rd, 2008 at approx. 12:15 am. I stood outside and watched this from 9:45 until midnight. There was this like fog in the sky that was like settling. I was so tired, i went to bed at that time and looked out my window before going to sleep and another jet went by. We are not near any military base. Then my daughter was dressing for school this morning. She looked out her window and told me there was a man out there with a box, holding it up writing stuff down. I went and looked, it was a yellow box (I looked on internet as to what geiger counters look like and that is what it appeared to be) He would hold it above his head, it had some kind of stick on it, he would look at it, then write it down, (it wasn't a lap top, it was just a screen where you could write into it, it didn't have keys) He went to different areas doing this. He was in a truck I have never heard of before. This morning I woke up not feeling well. Funny taste in my mouth, sore throat, really bad headache and my skin feels like it is burning."],"Object Features":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Date of the Event":"06/22/2008 12:00 UTC","City":"Greenfield","Viewing Distance":"Unknown","Longitude":"-72.591684","Case Number":"10884","Disposition":"Unknown","Object Shape":"Disc, Flash, Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=42.596916,+-72.591684(10884)&iwloc=A&hl=en\"> mufon case (10884) map </A>","Region":"Massachusetts","trends":["There have been 5 other sightings in Greenfield","There were no other sightings in Greenfield on or around June 22nd 2008"],"Source":"MUFON","Latitude":"42.596916"}