{"Region":"Illinois","City":"Hillside","Tags":"City","Summary":"multi-colored orb-shaped large bright lights w/ blue beam shining on ground","Date Submitted":"05/10/2008 02:25 UTC","Sighting Duration":"Undisclosed","Case Number":"10895","Source":"MUFON","Latitude":"41.877808","Weather Factors":"Unknown","Disposition":"Hoax","Date of the Event":"05/10/2008 02:25 UTC","files":["/var/www/straped/mufon/html2text/10895.html.txt","/var/www/straped/mufon/org/10895.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.877808,+-87.90284(10895)&iwloc=A&hl=en\"> mufon case (10895) map </A>","trends":["There have been no other sightings in Hillside","This sighting has never been favorited."],"Log Number":"US-05232008-0016","Object Flight Path":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsI was the manager on duty that weekend and I awoke to use the restroom. On my way back to bed from the bathroom I noticed bright lights shining through the split in the window curtains. I thought it might be the police with their lights on, so I opened the curtains and to my amazement it wasn't the police. It was several bright multi-colored lights in the sky in the shape of a circle just hovering oh about a few hundred feet above the ground. Then after several minutes (8 or 10 minutes) a bluish beam of light came from the center of the other lights and hit the ground about a hundred feet from my window. It was illuminating what seemed to be a dog in the parking lot. Then after about 30 seconds the beam of light just cut off. It was too dark to see if the dog had left, but when the beam of light shined on the dog it did not run away as I had expected it to. It seemed to be frozen in it's tracks. This seemed strange at first but then I remembered that a deer will freeze in it's tracks when in the headlights of a car. Then after the beam cut off the rest of the lights seemed to begin spinning clockwise and elevating slowly about another hundred feet or so, then they shot into the night sky at an alarming rate of speed. I could not even guess how fast. But faster than anything I have ever seen before. Faster than a drag racer. And at an angle of about 45% until they just vanished or went out of range of my sight. I know this sounds hard to believe, but I saw what I saw and I have never have seen anything like this before. I just wish I had my camera with me because nobody would have believed me if I told anyone, so I kept it to myself and my wife. Thank-you for this opportunity to get this off my chest. I have been wanting to tell this account to someone other than my wife, who still does not believe it."],"Longitude":"-87.90284"}