{"Object Shape":"Circle","Object Features":"None","Source":"MUFON","Date of the Event":"05/31/1999 12:00 UTC","Country":"United States","Case Number":"10893","files":["/var/www/straped/mufon/html2text/10893.html.txt","/var/www/straped/mufon/org/10893.html"],"trends":["There have been 9 other sightings in Cartersville","There were no other sightings in Cartersville on or around May 31st 1999"],"Longitude":"-84.792618","Date Submitted":"05/31/1999 12:00 UTC","Object Flight Path":"Stationary","Region":"Georgia","Tags":"City","City":"Cartersville","Disposition":"Insufficient Data","divs":["Sighting DetailsIt was the summer time. I was camping with a friend and his family at a camp site on Lake Allatoona. We had gone to bed one night. My friend and I were sleeping in a small tent with the top off so you could see through at the sky and trees above. His sisters, Mom and his mom's boyfriend were in a pop-up camper. Sometimes that night which I'm not sure exactly what time it was I woke up. As soon as I did I was looking straight up at the sky through the tent. I saw a large circular orb of light just above the tree line. It was just hovering. After looking at it i was pretty frightened. I turned to look at my friend and he was already awake and I asked him if he was seeing what I was seeing. He replied yes. I took one last look, it was still hovering then we both got out of the tent and went into the camper as fast as we could. We were both very scared. My immediate thought was that it was definitely some kind of UFO. After having many years of reflecting my friend and I still don't understand what we saw. If I had been alone I would have just forget as some strange dream or something of my own imagination but my friend saw the same and can't explain it either. I have no idea what it was that night and I can't come up with any explanation. I want to be able to think that it was of this world but my mind has not been able to convince itself yet."],"Log Number":"US-05232008-0014","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Latitude":"34.172947","Summary":"Large Light hovering above the treeline","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.172947,+-84.792618(10893)&iwloc=A&hl=en\"> mufon case (10893) map </A>"}