{"Viewing Distance":"Unknown","Log Number":"US-05242008-0002","Object Shape":"Diamond, Star-like","Date of the Event":"05/24/2008 12:00 UTC","Region":"Massachusetts","Case Number":"10897","Summary":"looked lik a small white dot, or as desribed like a diamond or star-like","Longitude":"-71.011119","Country":"United States","trends":["There have been 4 other sightings in Brockton","There were no other sightings in Brockton on or around May 24th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.089194,+-71.011119(10897)&iwloc=A&hl=en\"> mufon case (10897) map </A>","Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"05/24/2008 12:00 UTC","City":"Brockton","divs":["Sighting DetailsI sat on my step waiting for my girlfriend to get home, and about 3 hawks wereflyin. One was at a distance another with it, and the third seemded to fly right above my home. I see hawks but not often and not 3 at a time so these birds kept my attention in the sky. I watched them glide for about 15-20 minutes and then once i veered my eyes away to see where the bird above my home was going i noticed a small little dot. Along with the many planes that were flying, this clearly wasn't a plane, it was far too small, and way above the altitude most planes i see flying. It did nothing strange, just the slow drift across the sky. At first I said well that can't be anything more than a piece of cloud, but then as it drifted under the cloud it became dark, as if the clouds cast a shadow. I immediately called my friend who claimed to have seen an ufo and described what i was seeing, and then the now dark object disappeared into the clouds. I was amazed to see for myself what i always here about and couldn't take my eyes from the sky with hopes to see this again so I could show my girlfriend. I definitely need a camcorder and a telescope now!"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Latitude":"42.089194","files":["/var/www/straped/mufon/html2text/10897.html.txt","/var/www/straped/mufon/org/10897.html"],"Object Features":"Undisclosed"}