{"Longitude":"-90.605281","divs":["sighting detailswhen exiting my office in st. peters, mo, i observed a bright red glowing light approximately 2 miles south of me at 20 degrees above the horizon. i heard no sound of a piston or turbine engine and no beating of rotor blades. its apparent altitude was approximately 2,000 feet - 3,000 feet agl and appeared to be traveling 100kts - 150kts in a southwesterly direction. it was more like a large red flare, a fireball, not a red light. at first glance, i thought it might be a meteoric fireball; however, its speed was far too slow and there was no trail of light behind it. it was just a slow, low flying bright red fireball, bright like a flare, but traveling level more miles. i watched it for about 30 seconds when a very small white light seemed to drop from it approximately 3 miles away. the white object was very small in relationship to the red fireball, perhaps 1\\100 the diameter, almost a pinpoint of light. it dropped vertically and soon disappeared behind trees and buildings between me and the object. about 5 seconds after the white light dropped from the red fireball, the red object went from a large, bright red fireball to a somewhat dim, small red light and continued flying southwest until i lost sight of it. i entered my car and drove south on missouri highway 94 to attempt to reacquire the object. at highway 40\\64, i proceeded west to missouri highway dd and then proceeded south. approximately 10 miles south of my original position, i though i spotted the object approximately 20 - 25 miles southwest, but was unable to verify it was the same object before losing sight of it and giving up the chase. as a former military fighter\\reconnaissance pilot, i'm comfortable in saying this was not a fixed wing aircraft, was very unlikely a helicopter because of the relative size and brightness of the red fireball and lack of sound. after arriving at home about 20 minutes later, i tuned in to cable channels to see if any reports had made national news. interestingly, the non-local cable channels were out. i spoke to a charter communications representative who said charter had received over 250,000 reports of cable outages in the area during the past hour."],"Country":"United States","Case Number":"10904","Date Submitted":"05/24/2008 09:30 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/10904.html.txt","/var/www/straped/mufon/org/10904.html"],"Summary":"Large Red Fireball-Like Craft Releases Small White Object Over Northwest St. Louis Suburb","Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in St Peters","There were no other sightings in St Peters on or around May 24th 2008"],"Disposition":"Unknown","Object Shape":"Fireball, Sphere","Date of the Event":"05/24/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.778475,+-90.605281(10904)&iwloc=A&hl=en\"> mufon case (10904) map </A>","Weather Factors":"None, Does Not Apply","Region":"Missouri","Sighting Duration":"Undisclosed","Log Number":"US-05252008-0001","Source":"MUFON","City":"St Peters","Object Flight Path":"Straight-line path","Latitude":"38.778475"}