{"Case Number":"10900","Source":"MUFON","Disposition":"Unknown","Longitude":"-93.060174","Log Number":"US-05242008-0005","trends":["There have been 3 other sightings in Mt. Judea","There were no other sightings in Mt. Judea on or around December 29th 0002","This sighting has never been favorited.",""],"Date of the Event":"12/31/0002 12:00 UTC","Summary":"Spotted somthing when looking at pictures","Region":"Arkansas","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.921466,+-93.060174(10900)&iwloc=A&hl=en\"> mufon case (10900) map </A>","Viewing Distance":"Over One Mile","Tags":"City","Weather Factors":"None","divs":["sighting detailsrecently i was looking back at some old pictures from a recent climbing trip, i noticed two pictures that struck my eye when it cames to things in the sky. the first picture is right before sunset, my girlfriend and a buddy of mine were sitting on top of sam's throne and i was was just snapping photos and the second is lets say about five minutes after the first photo was taken, i have looked at these photos and cannot conclude what they are, mostly i am interested to see what others might think. the second photo seems to shoe a bullet\\disc thing which i thought could be a plane's trail, but none of the other photos which are taken from the same seated position show the same trail appearing. we did not see or notice anything while up on this rock outcropping and it is my guess that teh things in the pictures, especially number 2 just zipped by and i happened to catch it. the photos were taken on a sony cyber-shot dsc-p200 digital camera with 7.2 megapixels at sam's throne natural area near mt. judea, ar photo 1 - upside-down bowl looking thing photo 2 - bullet\\disc object several minutes after photo 1 photo 3 - enlarged photo 2 for more detail"],"Date Submitted":"12/31/0002 12:00 UTC","Object Features":"Unknown","City":"Mt. Judea","files":["/var/www/straped/mufon/html2text/10900.html.txt","/var/www/straped/mufon/more/10900_submitter_file1__DSC01016.JPG","/var/www/straped/mufon/more/10900_submitter_file2__DSC01030.JPG","/var/www/straped/mufon/more/10900_submitter_file3__Picture3.jpg","/var/www/straped/mufon/org/10900.html"],"Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Circle, Disc","Country":"United States","Latitude":"35.921466"}