{"Source":"MUFON","Summary":"A very bright light","City":"Ann Arbor","Longitude":"-83.737158","Disposition":"Insufficient Data","Case Number":"10908","Date of the Event":"12/23/2000 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Date Submitted":"12/23/2000 12:00 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Path then hovering","Log Number":"US-05252008-0005","Region":"Michigan","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=42.283606,+-83.737158(10908)&iwloc=A&hl=en\"> mufon case (10908) map </A>","files":["/var/www/straped/mufon/html2text/10908.html.txt","/var/www/straped/mufon/org/10908.html"],"divs":["Sighting DetailsThis happened 8 years ago. My family and I were driving to Florida. It was approximately 5-5:30am. My kids were sleeping in the backseat, my wife was awake in the front seat. I had stopped just pass an overpass to relieve myself as there was hardly any traffic that early. It was a Saturday morning. As I was standing behind the car, I noticed this very bright light in the sky. It was approximately as high as an airliner and did look like a star. However, I am very honest when I say this. As I stood there, this light flew down to about 50ft above me. It made no sound. I don't remember there being any kind of light on the ground from this. I don't know why, but I stood there looking at it. Just as quickly as it flew down above me, it shot back up and out of sight. I got back into the car and left. That's what I don't understand about myself. I drove to Cincinnati and never mentioned this to my wife until we stopped for gas. I explained to her what I saw. She didn't really believe me. I wasn't really that upset. I have never talked about it with anyone other than my wife. A year ago, I read someone had the same type of encounter. I can't say what it was. This is the only time I've ever seen a UFO."],"trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around December 23rd 2000"],"Latitude":"42.283606","Object Features":"Undisclosed"}