{"Weather Factors":"None, Does Not Apply","Tags":"City","City":"Goose Creek","divs":["Sighting DetailsI was leaving my apt for work as a security officer and saw briefly what I thought was a small airplane. It looked funny or different so I watched it and realized pretty quickly that it didn't look like a small plane at all. There were no wings, no tail section, no windows, no lettering and it seemed not really to flying but alomost suspended or floating. It just didn't move like a normal plane. Our maintenence man was working at the entrance of the complex and I pointed to the direction of the thing and said, \"hey...check it out! What the hell is that thing?\" He turned and looked in the wrong direction and as I was trying to get him to reposition and look at it, it passed in the direction of the Naval Weapons Station just behind some trees. I pulled out and got around the corner to see if I could still see it but from the inside of my car I couldn't. I called the emergency dispatcher in our area and asked her to see if the Goose Creek Rural Fire Dept had seen anything strange (They were doing some sort of training in the Food Lion parking lot right around the corner from where I saw it). I kept looking all the way across the Cooper River to see if it was still there but it was gone. The shape was cigar, the color was bright white, no lights that I could see and the other thing that strikes me as a bit strange is that it was so close to the Naval \"Weapon\" Station."],"Object Flight Path":"Straight-line path","Log Number":"US-05242008-0008","files":["/var/www/straped/mufon/html2text/10903.html.txt","/var/www/straped/mufon/org/10903.html"],"Date of the Event":"05/24/2008 08:34 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.981006,+-80.032587(10903)&iwloc=A&hl=en\"> mufon case (10903) map </A>","Summary":"it looked like a plane at first with no wings and no tail secion, no windows or lettering","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 5 other sightings in Goose Creek","There were no other sightings in Goose Creek on or around May 24th 2008"],"Object Shape":"Cigar","Date Submitted":"05/24/2008 08:34 UTC","Latitude":"32.981006","Object Features":"None","Case Number":"10903","Sighting Duration":"00:05:00","Region":"South Carolina","Country":"United States","Disposition":"Unknown","Longitude":"-80.032587"}