{"divs":["Sighting DetailsI was watching tv in my living room and i got a very strange feeling. Whenever i get a strange feeling i always go and look out a window. I went and looked out my side door when i saw what i thought was maybe an animal running across the street behing trees toward the left side of me. I live out in the country so there are always loose dogs and deer running around. I then turned my attention to the right side and there is a light pole across my driveway and power lines in a ditch beside the road. I saw this thing, its so hard to explain. At first i thought it was the web of a spider with light shining off of it. Then it got bigger and closer. It was this little oval looking thing about the size of a dinner plate. I know it sounds crazy i questioned my sanity after i saw it, i still am. It was going up about as high as the light pole and power lines and back down to the ground across the street like it would touch the ground for a second then go back up. Then it would zip to the right, then to the left, then back up and back down and so forth. It looked like it was going back and forth over the road. At times it would just hover there and not move at all then it would move quickly to the left or right. It made no sound at all. I kept coming up with logical explanations in my mind of what it could be, then it would move in a way that what i was thinking of couldnt. It was like it was reading my mind. It would never tilt in any direction, just move all around. I would have grabbed a camera but i was so terrified i didnt even think of a camera untill afterward. It had 3 points of light on the top of it, kind of like a twinkling star or when light hits metal and the light reflects off of it. It was like it knew i was there, and knew i was watching it. During the time i was watching it i would rub my eyes, wipe the window off, just to make sure i was really seeing this. I watched it for about 5 minutes just frozen in fear. Finally i started yelling for my fiance to come look who was back in my daughters bedroom playing with our kids. It took him a minute to come and when he did i had him look out the window with me and it was gone. I stayed up untill 5am constantly looking out the window but it never came back. But when i would go back to look out the window i would feel lightheaded but i didnt at all when i was watching it. I am the biggest scardy cat of pretty much everything. I was very shooken up by this. I just wish i could come up with something to explain what it was. It scares me to death thinking that something is out there."],"trends":["There have been 13 other sightings in Grove City","There were no other sightings in Grove City on or around May 24th 2008"],"Date of the Event":"05/24/2008 11:35 UTC","Object Shape":"Oval","Viewing Distance":"20 Feet or Less, 21-100 Feet","Date Submitted":"05/24/2008 11:35 UTC","files":["/var/www/straped/mufon/html2text/10915.html.txt","/var/www/straped/mufon/org/10915.html"],"Country":"United States","City":"Grove City","Latitude":"39.881452","Source":"MUFON","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.881452,+-83.092964(10915)&iwloc=A&hl=en\"> mufon case (10915) map </A>","Summary":"Very small oval like craft beside my house moving in all directions, back and forth over the street.","Tags":"City","Disposition":"Unknown","Longitude":"-83.092964","Object Features":"Unknown","Object Flight Path":"Path with directional change","Case Number":"10915","Region":"Ohio","Weather Factors":"None","Log Number":"US-05252008-0012"}