{"Date of the Event":"05/25/2008 05:38 UTC","Log Number":"US-05252008-0013","Object Shape":"Other","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around May 25th 2008"],"Object Features":"Dome","Tags":"City","Case Number":"10916","Country":"United States","Region":"New Mexico","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10916.html.txt","/var/www/straped/mufon/org/10916.html"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","City":"Albuquerque","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.086811,+-106.646597(10916)&iwloc=A&hl=en\"> mufon case (10916) map </A>","Date Submitted":"05/25/2008 05:38 UTC","Weather Factors":"Unknown","Summary":"4 Lights Observed Above Santa Fe, NM During Afternoon.","Longitude":"-106.646597","Sighting Duration":"Undisclosed","Latitude":"35.086811","Disposition":"Unknown","divs":["sighting details i was sitting in my back yard watching birds. when 2 moving objects caught my attention, moving from west to east, but i was looking north as they entered my view. at first, i thought it was some debris floating by, round, and white in color. what was odd, was that they were moving in exact distance from each other, and in the same direction. they slowed down to a stop, and i ran inside to get my binoculars that i use for looking at stars. when i came back, i could only see with my eye, one of the objects staying stationary. i looked up with my binoculars, and could see the one i saw with my eye. but now, i could see the second one, and just then, a third and fourth joined, and they all stopped. when i first saw the first one with the binoculars. i could see that there was a glowing pinkish neon light, sort of round, faded at the edges. behind, i could see there was some kind of structure, off to the left of the light. it was sort of bell shaped, with the neon ball of light, just to the right of center, so i could see the outline behind it to the left. all of them looked like this in shape. as i was looking back and forth, between them. i noticed that they \"all' had a neon pinkish ball of light. but the first one. had now changed to neon green. they were all stopped, but at different distances from each other. i was so excited, i called my boyfriend who was at work, and was only on the phone for about a minute. when i looked back up. i could see with my eye, nothing. but with the binoculars, i could see only 2 now. one with pink light, and one with a green neon light. when i adjusted my position with the binoculars, i could only see one with a pink light left. it would be visible with my eye one moment, and then with the binoculars only the next. it finally faded out. after a minute or so, i could no longer see anything. when they all were moving into view when i first saw them. they were moving slowly, then came to a stop. they never moved at any fast rate of speed, only faded out. i scanned the whole area, that was outlined by the trees, but i could no longer see anything. the whole sighting was, maybe 5 minutes or so. i have seen lights before, above santa fe during the evening. they would just come on, and go out. with no movement. almost like turning a flashlight off and on. they would just come into view as i was watching the night sky. this makes my 6th ufo experience\\sighting."]}