{"City":"Marathon","Latitude":"24.720022","Summary":"Bright light in sky, star like. Came in close, stopped for several seconds then took off at angle, high speed","Case Number":"10912","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Longitude":"-81.088771","Date of the Event":"06/30/1983 12:00 UTC","files":["/var/www/straped/mufon/html2text/10912.html.txt","/var/www/straped/mufon/org/10912.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=24.720022,+-81.088771(10912)&iwloc=A&hl=en\"> mufon case (10912) map </A>","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Date Submitted":"06/30/1983 12:00 UTC","Country":"United States","Viewing Distance":"Unknown","Log Number":"US-05252008-0009","trends":["There have been 13 other sightings in Marathon","There were no other sightings in Marathon on or around June 30th 1983"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","divs":["sighting detailsvacationing in fiesta key koa resort in the florida keys (near marathon) sometime in the 1980's. can't remember the year. sitting at waters edge in evening with mother-in-law looking out at the stars. one star started moving and came in much closer to us but still far off in the sky. i'd say it came to about 1\\2 mile to 1 mile away. it stopped and my mil and i looked at each other because we knew this was something strange because if it was an airplane it wouldn't just stop dead. i felt there was an intelligence to it. after sitting there for probably less than a minute, it took off at a north east angle in the sky at an incredible rate of speed, nothing like i had ever seen before. no aircraft or technology that i know about could maneuver like this. my mil and i again looked at each other and knew we had just seen a ufo. it almost felt as though it knew we were watching and then took off. i'm not sure if we were facing north,south, east or west though. i wouldn't have believed it if i hadn't seen it for myself. i guess why i felt i knew this was a ufo was because of the rate of acceleration and maneuvering. i never really believed in ufo's before but i've noticed more reporting and discussion about it recently and decided to register my sighting."],"Region":"Florida","Disposition":"Unknown"}