{"City":"Cary","Object Flight Path":"Straight-line path","Disposition":"IFO","Longitude":"-88.229838","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"05/24/2008 09:20 UTC","divs":["Sighting DetailsSitting around our fire pit in backyard with my two sons, 8 and 13. We had just sat down, facing north, and were looking at the Big Dipper which was almost right above us when I noticed a very bright white star-like object traveling West to East about the same speed as a 35000 ft airliner. We first thought it might have been a jet, but we see jets go over our house all of the time as we are right under a flight pattern to O'Hare which is about 30 miles southeast from us. We also see airliners flying at 35000 ft and above going cross-country all of the time. Whenever we have seen a jet, we always see the flashing lights, so this was unlike anything we have seen before. There was no contrail in the sky and no flashing lights and it looked like a large bright planet just traversing the sky in a straight line. We do see satellites go over quite often, but never West to East and nowhere near as bright as this one. It was North of us and at an angle in the sky that we would rarely be able to see a satellite (need to be almost right under those), and it was very bright. Not far behind the object was a passneger jetliner, easily identifiable, with contrail and the lights on both wings. Both moved at about the same speed. The object just disappeared over the horizon to the South and East of us, still very bright and traveling at a constant speed. We do not feel that it was a jet, but perhaps a low-orbit satellite or the space station; but we have not been able to confirm yet what man-made object, if any, would have been in this area yet."],"Date of the Event":"05/24/2008 09:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.221368,+-88.229838(10927)&iwloc=A&hl=en\"> mufon case (10927) map </A>","Log Number":"US-05262008-0006","Tags":"City","trends":["There have been 7 other sightings in Cary","There were no other sightings in Cary on or around May 24th 2008"],"Region":"Illinois","Country":"United States","files":["/var/www/straped/mufon/html2text/10927.html.txt","/var/www/straped/mufon/org/10927.html"],"Latitude":"42.221368","Object Shape":"Star-like","Case Number":"10927","Summary":"West to East steady travel, brighter than Venus or satellites, no blinking lights, white in color","Sighting Duration":"Undisclosed","Source":"MUFON"}