{"Country":"United States","Summary":"Sighting of a \"rod\"","files":["/var/www/straped/mufon/html2text/10925.html.txt","/var/www/straped/mufon/more/10925_submitter_file1__img60.jpg","/var/www/straped/mufon/org/10925.html"],"Latitude":"43.234181","trends":["There have been 11 other sightings in Muskegon","There were no other sightings in Muskegon on or around July 10th 2006","This sighting has never been favorited.",""],"Log Number":"US-05262008-0004","Viewing Distance":"20 Feet or Less","Longitude":"-86.248392","Object Shape":"Bullet, Missile, Other, Unknown","Object Flight Path":"Straight-line path","Case Number":"10925","Disposition":"Insufficient Data","Source":"MUFON","Object Features":"Wings, Other, Unknown","divs":["sighting detailsi saw, for the first time, a show on \"rods\" on the history channel tonight; i had never even heard of them before tonight. but upon seeing this show, i am very intrigued and realized that i had my own picture of one -- something i had never given much thought. but in the show, one of the most compelling arguments for their existence was the video filmed in a cave where there are rods, insects and birds all in the same shot. well, i have a photograph of a hummingbird eating at a feeder with a \"rod\" shooting across the image, taken from the deck of my grandparents' house... the hummingbird is nearly crystal clear, and the rod is... well, a rod. i did not think anything of it at first; i had not heard of \"rods\" before, and it just looked like something was coming out of the hummingbird. i do not vividly recall seeing the rod with my bare eyes, but i cannot say that i didn't with certainty, as it was nearly two years ago now. please get back to me as to whether or not this can help and also what you think. the image can be found on my web site, here: http:\\\\techssupport.org\\rod.jpg the image was taken with a canon powershot sd500 with a shutter speed of 1\\20 sec. again, i hope this can be of help."],"Weather Factors":"Unknown","Tags":"City","Date Submitted":"07/10/2006 08:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.234181,+-86.248392(10925)&iwloc=A&hl=en\"> mufon case (10925) map </A>","Sighting Duration":"Undisclosed","Region":"Michigan","City":"Muskegon","Date of the Event":"07/10/2006 08:56 UTC"}