{"Disposition":"Unresolved","Object Shape":"Undisclosed","Weather Factors":"Snow","Latitude":"40.646062","Object Features":"Other","Source":"MUFON","trends":["There have been 7 other sightings in Park City","There were no other sightings in Park City on or around December 31st 2000"],"Sighting Duration":"01:59:00","Date Submitted":"12/31/2000 05:00 UTC","Summary":"Hovering orange star appearing over Salt Lake City","map":"<A HREF = \"http://maps.google.com/maps?q=40.646062,+-111.497973(1092)&iwloc=A&hl=en\"> mufon case (1092) map </A>","City":"Park City","Date of the Event":"12/31/2000 05:00 UTC","Region":"Utah","Longitude":"-111.497973","Viewing Distance":"Over One Mile","Tags":"City","Country":"United States","Case Number":"1092","divs":["Sighting DetailsMy brother and I were in Park City, Utah in January during the Sundance FilmFestival. One night at dusk I saw what appeared to be a huge orange star comingup over the western mountains. I said look at that huge star to my brother. Hethought it must be a planet, but we are both amateur sky gazers and decided thatit wasnt a planet after all. Venus and Mars are only up during the day in thewinter and Jupiter and Saturn move from the upper sky to the western sky overthe course of the evening. The star object we saw came up from the westernhorizon and hovered for an hour just above the mountains. I thought it lookedorange but my brother thought it was blue26 white. As we looked closer, it appeared to change colors at random intervalsfrom orange to blue to white then back to orange. It also appeared to get biggerand brighter, then smaller and dimmer as we looked at it. Driving home from ParkCity to Salt Lake City, we lost sight of it behind the walls of the canyon.However, this same star keeps appearing every few nights, sometimes onconsecutive nights, at different times between dusk and 9:00 pm MST. It alwaysrises suddenly just over the western mountains3B it always hovers26 changes colors for an hour or so3B sometimes it moves steadily south along the ridge of the mountains3B my brother and I have observed it many times while airplanes fly just underit toward the airport3B it is definitely too big26 bright to be a star or planet3B since the middle of January it has appeared every other night or so and everySunday night. However, neither of us has seen it for a couple of weeks, exceptlast Sunday and we will be checking for it again tonight."],"Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/1092.html.txt","/var/www/straped/mufon/mufon_json/1092.json","/var/www/straped/mufon/org/1092.html"],"Log Number":""}