{"Source":"MUFON","Date Submitted":"05/25/2008 11:30 UTC","files":["/var/www/straped/mufon/html2text/10939.html.txt","/var/www/straped/mufon/org/10939.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.542184,+-97.354146(10939)&iwloc=A&hl=en\"> mufon case (10939) map </A>","Longitude":"-97.354146","Object Features":"Unknown","City":"Burleson","Region":"Texas","Viewing Distance":"Unknown","Summary":"A star-like object shined a spotlight down, then took off and disappeared.","Tags":"City","Log Number":"US-05272008-0009","Latitude":"32.542184","trends":["There have been 8 other sightings in Burleson","There were no other sightings in Burleson on or around May 25th 2008"],"Case Number":"10939","Date of the Event":"05/25/2008 11:30 UTC","Weather Factors":"Windy","Object Flight Path":"Path with directional change","Object Shape":"Circle, Flash, Star-like","Disposition":"Unknown","divs":["Sighting DetailsFirst of all, I have 6 witnesses to this! My fiance', age 31, my sister, age 32, her 2 son's, ages 14 and 8, and her son's friends, ages 14. No drinking or drugs involved! On Sunday, May 25th at approximately 11:30 p.m.(it could have been a bit earlier, but we were so excited about it), we were all out in the back, burning some wood, and looking at the stars. We had seen about 4 shooting stars, and about 3 satellites orbiting that night. My sister was looking towards the West(a little ways to the left of the big dipper), and she noticed what we thought was another satellite. Everyone found it and began to look at it for a second. I saw that the light was getting brighter, and I mentioned it. Everyone was saying \"Oh My Gosh, It is!\" Next thing you know, it looked as if a light came out from underneath, and shined a huge spotlight. Keep in mind, it was far enough to look as if it was a satellite, so there wasn't any rays we could see from the UFO. It shined for about 5 seconds, then as it started to dim again, the UFO shot quickly to the right, then faded away. It was NOT a military plane, because nothing we have in the military does that. And it was not a helicopter because it was WAY to high. All my life, I have told people \"You can't believe that we are the only beings in either this universe or another? They are way more advanced than we are. Whatever they are!\" My sister is a true believer too, and we were so amazed by what we saw, we both can't stop thinking about it. What worries me is that with all of the sightings that have happened this year, the government really needs to let us know what is going on, so that if something was to happen, we will be prepared."],"Country":"United States"}