{"divs":["Sighting DetailsI was sitting at a small park on the edge of Lake Jackson, looking up at the blue sky and few clouds and noticing the floaters in my aging eyesight when I saw a star. Thought that was pretty neat as I don't often see stars until nearer to dusk. I realized it was moving - almost imperceptively - but moving all the same. I was intrigued and turned on my car to see the time. 7:26 pm. I watched for another 20 minutes and watched this \"star\" move about 30 degrees to the north and east, almost straight above me. Called my husband who drove his car to my location. He saw it, said cool, and started investigating the grounds. He would check in with me every 5 minutes to see where it had moved. Intensity of the light never really changed and the movement was so slight that you wouldn't notice it moving unless you were keeping track of it. When initially seen, I was looking SSW. Over the 90 minutes it was visible, it moved over a portion of the sky that a place mat would cover if held at arms length. During the sighting a few high flying jets went over. I couldn't tell whether the light was at a higher or lower altitude than these jets but my feeling was it was in the upper atmosphere. I called my sister and brother in law who live a few miles away and they both saw the 'star' from their location but were uninterested in it moving. At about 8:50 pm it was located further west than when first seen and it just winked out - I believe due to the setting sun. Made me realize the 'star' was not giving off its own light, but was reflecting light. During the show, I also called my nephew who works for JPL in Pasadena, but couldn't reach him. He called me later and said it could be a weather balloon, a spy plane, or some rocket that shoots straight up then unloads its cargo and comes right back down. None of those sounded right to me, but who knows? I didn't have a camera or binoculars and didn't think to ask my husband to bring them. I tried taking cell phone pic but of course nothing showed up. It was a great 24th anniversary present. Curious if anyone else saw this?"],"Longitude":"-84.272733","Viewing Distance":"Unknown","Case Number":"10936","Sighting Duration":"Undisclosed","Region":"Florida","Country":"United States","Weather Factors":"Unknown","Source":"MUFON","Latitude":"30.446226","Summary":"Star against blue sky moving around for 90 minutes","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/10936.html.txt","/var/www/straped/mufon/org/10936.html"],"Object Shape":"Unknown","Tags":"City","Date Submitted":"05/26/2008 07:26 UTC","trends":["There have been 26 other sightings in Tallahassee","There was one other sighting in Tallahassee on or around May 26th 2008"],"City":"Tallahassee","Date of the Event":"05/26/2008 07:26 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=30.446226,+-84.272733(10936)&iwloc=A&hl=en\"> mufon case (10936) map </A>","Log Number":"US-05272008-0006","Object Features":"Undisclosed"}