{"Country":"United States","City":"South Boston","Object Features":"None","Log Number":"US-05272008-0012","Date of the Event":"05/13/2008 11:00 UTC","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Longitude":"-78.899199","Date Submitted":"05/13/2008 11:00 UTC","Latitude":"36.705689","Object Shape":"Cigar","Tags":"City","Weather Factors":"Windy","Summary":"The witness spotted a silver cigar shaped craft while driving on a rural highway","Case Number":"10942","map":"<A HREF = \"http://maps.google.com/maps?q=36.705689,+-78.899199(10942)&iwloc=A&hl=en\"> mufon case (10942) map </A>","files":["/var/www/straped/mufon/html2text/10942.html.txt","/var/www/straped/mufon/org/10942.html"],"Region":"Virginia","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMay 13, 2008 11 am South Boston, VA The witness was driving south on route 360 east on her way to work, a few miles north of South Boston. As she approached the area adjacent to Tuck Airport which is about 4 miles off of 360 she noticed the object and wondered why a plane was so low over the highway. She then looked closer and saw an object that looked like a pontoon off of a pontoon boat above the highway the medium strip. She said it was about the height of the water tower in town which is about 80 feet at most and a very shiny-silver color, she said it was the size of a small commercial jet with out the wings. She said it appeared to be watching traffic, and as she was looking to see if it had wings or a tail she said she ran off the pavement and hit the gravel. She noted there was little traffic on the highway and looked to see if anyone else was looking up to see it but it seemed as if no one was. She said in all she observed it for about 30 seconds and after about 10 seconds it began to raise up (she thinks it may have seen her van serve) to the south west then it just disappeared. She said she was very excited by the sighting and could not believe something that big could disappear that fast. She also told me about a sighting that she and her daughter had about 6 weeks prior near her home which is about 15 miles to the north west of this sight. This involved seeing triangular light objects in the sky (three lights each) that were chasing each other and making turns that an airplane cannot. She said at times there were up to 4 of them and she said it was like they were playing tag. Of interest I filed a report from this same area (Clover VA) back in 2001 where I interviewed one of three police officers that chased a brightly lit triangle from Clover back to the Clover power plant."],"trends":["There have been 2 other sightings in South Boston","There were no other sightings in South Boston on or around May 13th 2008"]}