{"Source":"MUFON","Date of the Event":"06/25/1996 10:30 UTC","City":"Issaquah","Case Number":"10943","divs":["Sighting Details My girlfriend and I were lying on our backs in the grass behind her sisters apt. complex one summer night in Issaquah Washington, when two object caught both our eyes. Two objects, darting to and fro almost as if they were playing with each other, danced around and shot out rainbow colored lights in the sky. The rainbow colored lights shot out like a fountain or a dissipating cone, and the objects were bright like stars that played around in the clouds as we watched curiously and with interest for about an hour. An interesting point, that really made me wonder, was how they became fixed in the sky whenever a plane would fly anywhere near, like they were hiding. We both felt very comfortable with all this, as if they had an air of childishness and innocence radiating through the whole experience, also they were far enough away that we didn't feel threatened. It was neat. Just really neat! We actually got up to go inside for a second; to get drinks or whatever(we didn't have a camera) and when we came back out they were gone."],"Country":"United States","Disposition":"Insufficient Data","Latitude":"47.532911","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Issaquah","There were no other sightings in Issaquah on or around June 25th 1996"],"files":["/var/www/straped/mufon/html2text/10943.html.txt","/var/www/straped/mufon/org/10943.html"],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=47.532911,+-122.030399(10943)&iwloc=A&hl=en\"> mufon case (10943) map </A>","Region":"Washington","Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Date Submitted":"06/25/1996 10:30 UTC","Log Number":"US-05272008-0013","Summary":"2 objects fixed when planes near; spuradic and darting swiftly shooting colors when no planes near.","Longitude":"-122.030399","Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City"}