{"files":["/var/www/straped/mufon/html2text/10948.html.txt","/var/www/straped/mufon/org/10948.html"],"Case Number":"10948","Longitude":"-117.146525","Object Flight Path":"Stationary,Straight-line path","Log Number":"US-05282008-0005","Weather Factors":"None","Disposition":"Unknown","trends":["There have been 13 other sightings in Temecula","There were no other sightings in Temecula on or around May 26th 2008"],"Summary":"Spinning disc changing colors red/white/blue","Tags":"City","Country":"United States","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.499319,+-117.146525(10948)&iwloc=A&hl=en\"> mufon case (10948) map </A>","divs":["Sighting DetailsLast night at 8:50 p.m. I took my nine year old upstairs to get her ready for bed. It was stuffy upstairs, so while she brushed her teeth, I went to the loft to open a window. Our house faces east, and we live on a high elevation so our view is of a large part of the Temecula Valley. I can see all the way to Mt. Palomar. I stopped to look at the view and noticed an unusual glittering light. I waited for it to turn, fly away or make a movement that would show it to be maybe border patrol, or a small airplane going to the French Valley airport close by. It simply stayed in one stop for 5 minutes. It had a clear spinning motion, and wobbled a tiny bit. The spinning was easy to see, mostly white lights moving from left to right. Then they became blue, or red, and white with no pattern or timing to them, just randomly, as though it meant something. I had to tuck my daughter in quickly and ran back to the window. I was sure this was not a helicopter at this point, and could not be a plane. I stood and watched it for another 5 minutes, knowing if I ran to get a camera I would loose it. I did however, grab a telescope to get a closer look and ran downstairs and out the front door. The house across the street blocked my view, so I ran to the garage and out to the driveway, to the same blocked view. I was determined to watch this thing, so I ran back up to the loft and it was still there. I watched it for about 2 minutes. It seemed to move slightly to the right, then I saw a bright white flash, and it disappeared and it took off so fast at a 45 degree angle into the western sky that the only thing I saw to show where it went was the golden yellow straight line moving up into the sky. The streak of yellow light did not linger, it vanished immediatly. I was speechless. The experience was surreal. I heard nothing. I just simple gazed at it as though I knew it was just stopping by, and there was no need to get excited. I didn't say a word for atleast an hour, and then told my husband secretly as to not scare my children. I felt deeply sad, as though I wished I had not seen it. I felt a bit intruded upon, like they could have come by and stayed unseen. They really should not reveal themselves, as it only worries people. I am a very talkitive person, and did not feel like myself the whole time. I think they may have been hovering over the power plant on Route 79 South in Temecula for power."],"Viewing Distance":"Over One Mile","Object Shape":"Disc","Date of the Event":"05/26/2008 08:50 UTC","Latitude":"33.499319","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","City":"Temecula","Date Submitted":"05/26/2008 08:50 UTC"}