{"Sighting Duration":"00:00:45","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=43.223635,+-123.338238(10952)&iwloc=A&hl=en\"> mufon case (10952) map </A>","Object Features":"None","trends":["There have been 8 other sightings in Roseburg","There were no other sightings in Roseburg on or around May 23rd 2008"],"Summary":"I saw a bright light in the northern sky approach a commercial jet, then turn 180 degrees and move away.","Date Submitted":"05/23/2008 09:50 UTC","Case Number":"10952","divs":["Sighting DetailsI was standing in my driveway, preparing to leave for work. I always watch the sky, checking on cloud cover, watching jets and satellites. There was a commercial carrier on a southbound flight path, very small in appearance so I'd put it's altitude at 30+ thousand feet, to high to have flown out of PDX so probably either SeaTac or Vancouver. A bright blue white light, brighter and larger than a satellite, came in on a west southwest heading from an easterly direction. It was round in shape, and came in much faster than any satellite I've observed. At first I thought that it might be something experimental. It was brighter, so presumeably, lower in altitude. But, when it's trajectory put it to within maybe 3 nautical miles of the commercial jets trajectory, it suddenly executed a 180 degree turn, returning along it's original flight path, which would place it on track towards Mountain Home AFB. I trotted out to the end of my driveway, to better observe the phenomenon. It continued on it's flight path and eventually disappeared oveer the horizon. While it's initial approach spead was incredible, it's return speed was in the mach 1 area. The shape and intensity of the light never altered, so I dismissed it as an exhaust or rocket nozzle. The turn was so sudden that I can't imagine any material or airframe design that would have held together. I could hear the commercial carrier, yet heard nothing from the other phenomenon. After the phenomenon disappeared, I went to work."],"City":"Roseburg","Region":"Oregon","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Date of the Event":"05/23/2008 09:50 UTC","Disposition":"Unknown","Log Number":"US-05292008-0001","Latitude":"43.223635","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10952.html.txt","/var/www/straped/mufon/org/10952.html"],"Weather Factors":"None","Tags":"City","Longitude":"-123.338238"}