{"Date Submitted":"05/27/2008 08:20 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/10964.html.txt","/var/www/straped/mufon/org/10964.html"],"Object Shape":"Disc","Date of the Event":"05/27/2008 08:20 UTC","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around May 27th 2008"],"Tags":"City","Disposition":"Insufficient Data","Log Number":"US-05302008-0009","Weather Factors":"Unknown","Region":"New York","Longitude":"-74.001643","Case Number":"10964","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"Dome","Country":"United States","City":"New York","Latitude":"40.723193","map":"<A HREF = \"http://maps.google.com/maps?q=40.723193,+-74.001643(10964)&iwloc=A&hl=en\"> mufon case (10964) map </A>","Source":"MUFON","divs":["Sighting DetailsIt was dusk but not dark, still blue sky, suddenly I saw out my left livingroom window a saucer shaped silver metal object just sitting there in the blue sky-it stayed there and I kept watching for it to leave or do something else then just staying put. After l0 minutes he dove at a 45 degree angle, stopped and just sat there for another l0 minutes. I kept hoping he would fly closer so I could get more description etc. Then he just disappeared like you flipped a lightswitch. I had my binoculars by then and scanned the sky but nothing in any direction. I kept on the couch in the same position looking out my window because I have a wireview so if he showed up again inside the utility poles view I could tell if he were closer etc. Sure enough he suddenly came into view again like you switched on the light bang! He had come closer & appeared to be a larger scale inside the lines that hang outside the pole outside my home;and he had moved from the last point to a center position. This time he sayed another l0 minutes and again as before just disappeared from sight.(There were no clouds in the sky - he was just gone.) I kept watching until it got really dark but he never reappeared again. I knew it was a flying saucer as I have seen them before in NJ,TX,NY and in CA on a number of occasions; and we do not have planes or UFO crafts on Earth capable of flying that fast doing sharpe turns and angles. I was not surprised to see the craft here; the impression I felt was that the pilot was angry as his invisibility controls were going on and off and he kept getting visible - I had the feeling he wanted to just go home and not draw attention to himself there and apparently he needed to stay put until he had clearance to do so. He kept changing altitude and position and was well under radar levels. I felt he was headed for Lake Erie since it was obvious he tried to stay in that general area. I last viewed him being stationary just hovering in place whereupon he switched off and became invisible again. After that I noted the time of day and went back to watching tv in my livingroom."],"Summary":"extremely bright silver shiny metal saucer shaped disc hovering suddenly in the sky flying in sigzag fashion bleeping visible then off, then visible then off again trying to stay in a limited space while over Lake Erie area."}