{"Summary":"Flying overhead","Country":"United States","Tags":"City","Object Features":"Unknown","Sighting Duration":"00:01:00","Date Submitted":"05/29/2008 09:15 UTC","Viewing Distance":"Over One Mile","Case Number":"10960","Longitude":"-104.975823","City":"Denver","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 29th 2008"],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/10960.html.txt","/var/www/straped/mufon/org/10960.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.744154,+-104.975823(10960)&iwloc=A&hl=en\"> mufon case (10960) map </A>","Latitude":"39.744154","Date of the Event":"05/29/2008 09:15 UTC","divs":["sighting detailsi was sitting at my desk which is right by a window that faces west, in denver, colorado. something in the sky caught my eye because the sun reflected off of it. when i looked up, i initially thought it was a plane, but then i thought, \"why would a plane be so low\". at second glance, it didn't have any wings like a plane would. it was moving south bound, slowly across the sky. after about 10 seconds, it crossed over the top of the building i was in. i got up from my desk and ran to the other side of the building, opened the blinds and saw it again. this time it was going east. i passed a co-worker on my way to the other side of the building. she asked me what i was doing and i told her that i saw a ufo. she came to the window and saw the same object as me. the shape was like a cylinder\\cigar laying on it's side. then, the tip\\front of it was like a cone. it continued south east for a short period of time, then it climbed and continued to climb, then it shot off, out of site. the both of us saw it. i couldn't believe what i was seeing. it definately wasn't a plane. i was very surprised to see something like this. it was great."],"Region":"Colorado","Log Number":"US-05302008-0005","Disposition":"Unknown","Object Shape":"Bullet, Missile, Cigar, Cone, Cylinder","Weather Factors":"Does Not Apply"}