{"divs":["Sighting DetailsAs I was driving home on Route 444, coming from shopping in Fairborn, Ohio I saw a row of extremely bright lights on the left over what I remembered as a vacant field. The lights were so bright I thought someone had erected stadium type lighting. The huge lights did not blink, change color, or move. As I passed the field I stuck my head out of the window and tried to see what was holding up the lights. I could not see anything except extreme darkness. I decided to come back the next day to see what had been constructed in the previously vacant field. A few minutes later I was driving up the cross street to my home in Enon. There was a craft of some sort coming slowing up my street, about 50 feet in the air. It was not a helicopter. It was not the same lights I saw over the field. It looked to be flat on the underside and did not have any obvious wings. It was about 20 feet across. That was about all I could tell because there was no moon out. I was so scared I stopped my car and turned off the lights so it would not see me. Even though my window was open I heard no sound at all. I watched this craft pass in front of me as it crossed the street and continued over a field to my left. I waited until I was sure it was gone and raced home. The next day I went back to the vacant field to see what was holding up the bright lights. There was nothing there. It was still a vacant field. In retrospect I wonder if whatever the lights were on was blocking out all the light. Maybe I was actually looking up at the underside of a UFO."],"Viewing Distance":"101-500 Feet","Longitude":"-83.936876","Date Submitted":"12/02/1998 12:00 UTC","Source":"MUFON","City":"Enon","Weather Factors":"None","trends":["There has been one other sighting in Enon","There were no other sightings in Enon on or around December 2nd 1998"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.878115,+-83.936876(10969)&iwloc=A&hl=en\"> mufon case (10969) map </A>","Region":"Ohio","Object Shape":"Other","Object Features":"Unknown","Disposition":"Unknown","Country":"United States","Tags":"City","Date of the Event":"12/02/1998 12:00 UTC","Object Flight Path":"Stationary,Straight-line path","Summary":"Huge, extremely bright lights over a field and a low flying silent craft.","files":["/var/www/straped/mufon/html2text/10969.html.txt","/var/www/straped/mufon/org/10969.html"],"Log Number":"US-05302008-0014","Case Number":"10969","Latitude":"39.878115","Sighting Duration":"Undisclosed"}