{"Source":"MUFON","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path,Path with directional change","divs":["sighting detailslet me start out by saying i am a true non-believer in ufo's, but this night i experienced something i never thought i would. i live by the beach and as i was laying in bed awake that night around 12:45 am i heard a few helicopters circling around above, and didn't think anything of it, until i heard them circling for a few minutes. i peered through my shades and looked out in the sky to see if i could see them. i saw something, and rubbed my eyes for 3 minutes wondering what the hell it was. i was looking for any defining features of a helicopter and found none. plus what i saw flying around in blue and red lights was way too far away and moving around way too quickly, so much so that i honestly thought it was a shooting star for a second. after 3 minutes i thought i was going crazy so i got up and put a jacket on, and at the same time my neighbor was pounding on my door to go get a video camera. i put a new tape in my camera and sat outside video taping for 10 minutes. it was no helicopter, and the binoculars my other neighbor had showed nothing hanging from it. it was shooting up and down and around for like 30 minutes, circular shape - i would hate to say saucer shape, but that's honestly what it looked like. bright blue lights going all around it and one red light. it was probably the craziest thing i've ever seen but i promise you it was real my neighbor just helped me get the footage onto a youtube video - here it is: http:\\\\www.youtube.com\\watch?v=nxeatsu9ndi&feature=related"],"Summary":"UFO sighting in Hermosa Beach, CA April 22nd around 12:45 am","trends":["There have been 2 other sightings in Hermosa Beach","There were no other sightings in Hermosa Beach on or around April 22nd 2008"],"Country":"United States","Object Features":"Unknown","City":"Hermosa Beach","Longitude":"-118.399519","Tags":"City","Case Number":"10962","Disposition":"IFO","Date Submitted":"04/22/2008 12:45 UTC","Sighting Duration":"Undisclosed","Region":"California","Object Shape":"Disc","Latitude":"33.862237","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.862237,+-118.399519(10962)&iwloc=A&hl=en\"> mufon case (10962) map </A>","Date of the Event":"04/22/2008 12:45 UTC","Log Number":"US-05302008-0007","files":["/var/www/straped/mufon/html2text/10962.html.txt","/var/www/straped/mufon/org/10962.html"]}