{"Date Submitted":"05/31/2008 11:07 UTC","Source":"MUFON","Country":"United States","Date of the Event":"Unknown","trends":["There have been 3 other sightings in Bay City","There were no other sightings in Bay City on or around"],"Disposition":"Unknown","divs":["Sighting DetailsI was out side my apartment complex smoking a cigarette,I was looking at the stars,Then out of nowhere a blue tear drop looking,almost like comit,only because it was moving so fast.Suddenly it stoped so smoothly,then it appeared to be a sphere, about nickle size in the sky.It had stoped directly over a field, right in front of the apartment about 30 yards away.I felt very confused,and frightened.The object stayed on for 7 or 8 seconds,Then it looked like it disappeared. Next about 3 or 4 seconds after it turned off. Some object came straight down from where it was, and made a thud, I only seen it for a split second.It was dark,But right where the object went down at was a light post behind it about 15 to 20 yards so i seen it for just a split second right before it hit.It was skiny and long what ever hit the ground.I went back to the apartment right after i seen that.I didn't want to talk about it to my wife or anyone for a while.I Thought aliens and ufo's were fake made up. I thought it was very childesh.It doesn't say anything in the bible about that sort of creations.I wish i never seen that, It hurts me,and my beliefes.It's very depressing and at the same time eye opening.It made me feel like a helpless child.PLEASE SOMEONE EXPLAIN"],"City":"Bay City","map":"<A HREF = \"http://maps.google.com/maps?q=28.982756,+-95.969402(10974)&iwloc=A&hl=en\"> mufon case (10974) map </A>","Weather Factors":"Unknown","Latitude":"28.982756","Object Shape":"Fireball, Oval, Teardrop","Summary":"Blue oval looked like comit but when it stoped it was a sphere","Region":"Texas","Case Number":"10974","files":["/var/www/straped/mufon/html2text/10974.html.txt","/var/www/straped/mufon/org/10974.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Log Number":"US-05312008-0005","Object Features":"Undisclosed","Longitude":"-95.969402","Tags":"City","Viewing Distance":"101-500 Feet"}