{"Summary":"Cylinder metalic object crossing the bay","Date Submitted":"07/31/2006 02:00 UTC","Object Shape":"Cylinder","Disposition":"Unresolved","City":"St John","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/10970.html.txt","/var/www/straped/mufon/org/10970.html"],"trends":["There have been 12 other sightings in St John","There were no other sightings in St John on or around July 31st 2006"],"Sighting Duration":"00:05:00","Region":"New Brunswick","Object Features":"Undisclosed","divs":["Sighting DetailsI was driving home from shopping with my aunt and wife. My aunt was driving and i was in the front passenger seat just looking around. We were driving over a causeway in which i could see the general direction of my home. I happen to look over and saw a cylinder metalic object which looked as though it was right over my house. I pointed to it and told my wife to look. She at first thought it was a balloon. It was a very clear day and I could tell it was not a balloon. It was completely vertical and is was moving slowly south east from my house across the bay. I had asked my aunt to drive a bit faster because I wanted to get home and grab my video camera. After a long red light, we finally got home. I looked up and could still see the object but it was farther away than before. I ran up the house, grabbed my video camera and ran back down stairs. I was disappointed that my camera had an auto focus and as I tried to find the object in my viewfinder, the power lines running from the pole to the houses kept making the camera focus in and out. I never did get the object on film. This object as far as I could tell had no markings, windows or lights. It looked fairly plain and I did not hear any noise from it. I really do believe that it was some type of UFO but unless you see one for yourself, it was hard to believe. I remember that as the object got farther from me, it was still moving slow but it was rising at the same time. I am convinced that it was not a balloon as my wife thought because there was a breeze that day and the object was not rolling in the wind."],"Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.281015,+-66.057248(10970)&iwloc=A&hl=en\"> mufon case (10970) map </A>","Object Flight Path":"Undisclosed","Tags":"City","Country":"Canada","Latitude":"45.281015","Longitude":"-66.057248","Date of the Event":"07/31/2006 02:00 UTC","Case Number":"10970","Log Number":"CA-05312008-0001"}