{"Disposition":"IFO","divs":["Sighting DetailsI am seeing two types of unidentifiables daily over my home in the San Fernando Valley. Almost every morning since I first noticed them a month ago, I have seen white, seemingly amorphous white things which \"pop\" in and out of sight, like interdimensionals, I guess. They come singularly, or in groups of three, so far. When in threes, they circle like birds, around one another, but do not flap anything. They seem just to float when they move. They seem to appear when propeller driven airplanes cross over or near my house. Jets do not stir them. I call them angels, but I have no idea how to describe their shapes to you. Very white, white though. Mighty odd and interesting. The second type I see daily is seen only at night, though they might be cruising the valley unseen by day as well, I do not know. Every night, though, I will see them solo or in pairs. They are small in appearance, smaller than any plane, they cruise at about 5,000 feet, they cruise at about 10 mph, quite slowly and constantly, and they strobe white and red, mostly red, quite rapidly. They are definitley not balloons or planes. I can hear even high flying jets and planes when they pass over or nearby, even if only faintly, because it is pretty quiet here, but these things make no sound at all even when right overhead. They always move north to south or south to north, except for one exception. About two months ago, I saw these things for the first time. One cruised over my home going east to west at night, same description. The next day, in the morning around 10:00 a.m., I saw what I thought must be the same thing I had seen the night before moving west to east. It was silver and floated silently. It was smallish, but too big to be a party balloon. I decided it was not a balloon when it turned against the breeze and began a steady course due north, right after it passed over my home. Finally, three days ago, I saw three of the white things I spoke of above. They appeared out of nowhere, in the wake of a prop plane I watched pass overhead. A few minutes later, another plane approached and the white things popped back out of existence as the plane came close to them. I watched them just dissapear! Then, in the wake of the second plane, a cylindrical thing popped into existence. It was smallish, large enough to hold a couple of men I guess. It was horizontal when it appeared, then it tipped upright and stayed that way. It was redish on the bottom two-thirds, and silver metallic on top. It stayed in one spot for 15 minutes or so, but flew up slowly and finally out of sight when another prop plane approached it. I have seen the night light things the most, and for the longest. I jest that they are mapping the valley in preparation for an invasion. They actually could be making a grid of the valley, the way they fly over it north to south or south to north in seeming sections. I wonder what is next. I doubt anyone can explain, but maybe someone else has seen these types of things. Anyway, they are interesting to observe. Soemday, perhaps I will get a photo or video of them to share. It will be difficult though, given their small sizes. Thanks for the forum."],"Country":"United States","Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","trends":["There have been 3 other sightings in West Hills","There were no other sightings in West Hills on or around May 30th 2008"],"files":["/var/www/straped/mufon/html2text/10972.html.txt","/var/www/straped/mufon/org/10972.html"],"Object Shape":"Unknown","Summary":"Ongoing, Daily. White Amorphous; Red bottom, silver top vertical tube; small silent red/white strobing lights cruising Valley 5000' north to south, vice versa, nightly.","Region":"California","Weather Factors":"Unknown","Date of the Event":"05/30/2008 12:00 UTC","Log Number":"US-05312008-0003","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.200502,+-118.638981(10972)&iwloc=A&hl=en\"> mufon case (10972) map </A>","Date Submitted":"05/30/2008 12:00 UTC","City":"West Hills","Case Number":"10972","Longitude":"-118.638981","Source":"MUFON","Latitude":"34.200502","Viewing Distance":"20 Feet or Less"}