{"Viewing Distance":"Unknown","Country":"United States","Object Shape":"Cylinder, Other","Object Features":"Appendage(s)","Summary":"Noticed a chemtrail and saw very high a possible satellite","Longitude":"-110.918759","Date Submitted":"05/30/2008 06:27 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-05312008-0008","Case Number":"10977","Date of the Event":"05/30/2008 06:27 UTC","files":["/var/www/straped/mufon/html2text/10977.html.txt","/var/www/straped/mufon/org/10977.html"],"Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 30th 2008"],"City":"Tucson","divs":["sighting detailsin yard at house cross streets in tucson az. ne of u of a about 5 miles. ft lowell\\dodge i noticed a metallic object not moving at first glance extremely high. smaller and higher than any commercial aircraft because it seemed very high. it's hard enough to see very high aircraft sometimes but this appeared even much higher in a clear sky.after noticing the chemtrail moving either by wind or earth rotation, the object was making a ssw to nnw path with no trail. it did not deviate path but very slowly after perhaps 45 minutes it became invisible to my naked eye. at closest point to me when first noticed i used small 8 power binos and instablity made it hard to really notice shape. i concluded it must be a space station or satellite as it was stainless steel color and cigar shaped standing on end with a appendage like an outside tank half as large as ufo. i concluded it must be satellite or space station. my only doubt was that i would be able to see a manmade object in orbit that high during daylight. i ve seen the shuttle blaze thru eastern phoenix some 6 years ago on a re entry so that moved pretty fast in comparison. as mentioned, the object was very stationary and seemed the earths rotation was the reason of increasing distance. what do you think? huh? jay"],"Latitude":"32.223273","Tags":"City","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.223273,+-110.918759(10977)&iwloc=A&hl=en\"> mufon case (10977) map </A>","Object Flight Path":"Stationary,Straight-line path"}