{"Object Shape":"Disc","Object Flight Path":"Undisclosed","Summary":"Saw a bright light in the distance. Stopped the car and a large craft was hovering above us.","Country":"Canada","trends":["There have been 16 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 30th 1979"],"Viewing Distance":"Unknown","Longitude":"-79.084368","Source":"MUFON","files":["/var/www/straped/mufon/html2text/10975.html.txt","/var/www/straped/mufon/org/10975.html"],"Date of the Event":"11/30/1979 02:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.097069,+-79.084368(10975)&iwloc=A&hl=en\"> mufon case (10975) map </A>","Latitude":"43.097069","Tags":"City","Log Number":"CA-05312008-0006","Weather Factors":"Unknown","Case Number":"10975","Object Features":"Undisclosed","divs":["Sighting DetailsWe were driving home from an evening of cards with friends. It was a clear night and the stars were out. I noticed a bright light in the distance while we were waiting at a red light. It did not appear to be a star. When we crossed the intersection the light disappeared (and I don't know why we stopped the car)but a large disc like craft was hovering above us approximately 100 feet up. We observed it through the dash window (I know this sounds surreal) but it was huge. We were looking at the bottom of it. My husband (not a believer at the time) was amazed as was I. I remember protrusions around it and lots of lights and in my mind it was grey in colour. Being still dark out, I don't know why I say grey, I suppose it was just dark in colour because of the darkness of the night. I knew enough to check the time, 2:10 am, rolled down my passender window to listen for a sound and everything was silent. I don't even think there were any other vehicles anywhere. It was just us and this amazing craft just sitting there motionless. Probably about a minute later, it started to glide very slowly in the direction we just came from. We turned around and started to follow it (which only lasted a few seconds) because all of a sudden it took off at an incredible speed and was out of sight. There was not a loss of time (unless they stopped our clock) We didn't contact the local radio station (which now I wish we had) but more or less just kept it to ourselves because who would believe us. Hopefully you (the reader) will believe me as you have an interest in this as well. Since that drive home many years ago, we have become avid believers. We are now in our 60's and it's time for the government to not keep secrets from us any longer. All of us from every walk of life who have witnessed a sighting, know what we saw was the real thing and not what they are trying to say what it it could have been. A true story..............Sue"],"City":"Niagara Falls","Region":"Ontario","Date Submitted":"11/30/1979 02:10 UTC","Sighting Duration":"Undisclosed","Disposition":"Unresolved"}