{"Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.214534,+-90.196484(10988)&iwloc=A&hl=en\"> mufon case (10988) map </A>","Case Number":"10988","Summary":"Bright blue round light---moving very fast---and silent.","Log Number":"US-06012008-0002","Disposition":"Unknown","Tags":"City","City":"Marion","Date of the Event":"05/26/2008 02:00 UTC","Region":"Arkansas","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/10988.html.txt","/var/www/straped/mufon/org/10988.html"],"Object Flight Path":"Straight-line path","divs":["sighting detailsok it was about 2 am central time here in marion,ar.i was siting out back near my pond just relaxing,i was looking straight across the pond when something flashed real bright in the sky and caught my attention.after the flash i looked up and saw a bright blue light,like a circle of light.it was at a fairly low alttitude( i think )and it was moving very fast!from when i saw it to the far west up in the sky ,to when it was out of my sight heading straight east, it only took it about 3 seconds to fly across my whole field of vision! i mean this thing must have been doing like 10k mph! also it made no sound! thats the weird part. i figure at the low alt it was flying,and that speed, if it was a jet it would have broke the sound barrier and been very loud.also im not sure if it was blinking and if was just going through the clouds(it was pretty cloudy that night),but it basicly lit up 3 times befor going out of my line of sight. i think maybe it just looked like it was blinking and it was going through some clouds.but i could see the super bright glow of this thing on the nearby clouds, anyway i dont think it was a plane\\helicopter\\or anything i could explain.remeber very fast....no noise! it kinda freaked me out.i have been looking out back everyday to see if i can see it agin.if anyone who reads this saw anything weird around my area at any time.please post something on here and let me know, i want to keep trak of sightings of u.f.o's in my area from now on, thanks.any questions you can e mail me also."],"Object Shape":"Circle","Source":"MUFON","Sighting Duration":"00:00:04","Weather Factors":"None","Longitude":"-90.196484","Date Submitted":"05/26/2008 02:00 UTC","Latitude":"35.214534","trends":["There have been 2 other sightings in Marion","There were no other sightings in Marion on or around May 26th 2008"]}