{"Object Features":"Undisclosed","Country":"United States","Date Submitted":"05/27/2008 05:07 UTC","Tags":"City","Region":"Florida","Summary":"Reflecting star like image in blue sky reflecting like a star","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.150036,+-81.79346(10984)&iwloc=A&hl=en\"> mufon case (10984) map </A>","Date of the Event":"05/27/2008 05:07 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Latitude":"26.150036","files":["/var/www/straped/mufon/html2text/10984.html.txt","/var/www/straped/mufon/org/10984.html"],"Case Number":"10984","City":"Naples","Log Number":"US-05312008-0015","divs":["Sighting DetailsIt was Tuesday 5-27-08 in Naples Florida. It was my day off and I was sitting on my patio looking at the sunny blue sky when I saw a star flashing light very high in the sky. I could not make out a shape it was flashing light like a mirror. I thought I was seeing things, I took video and my camera picked up nothing. The clouds rolled in over that spot I saw it for about 2 minutes and then the clouds rolled in. There has been what looks like a satelittes every night but they show up in different areas of the night sky and flash different colors. the colors kind of band around the spot and flash as well. I wonder if these things are related? I have been seeing strange things in the sky and never saw these things before. I lived on the east coast of Florida for 20 years and have lived here for 3 years and have seen more weird lights and such here than I have seen in all my 42 years I have lived. It really is I believe a hot spot for this kind of thing. But then Mufon probably already knows that? HUH? LOL Thanks for hearing this story it is hard to get people to understand what I am seeing lately is strange and not airplanes!"],"Object Shape":"Star-like","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around May 27th 2008"],"Disposition":"IFO","Object Flight Path":"Undisclosed","Longitude":"-81.79346","Sighting Duration":"Undisclosed"}