{"files":["/var/www/straped/mufon/html2text/10980.html.txt","/var/www/straped/mufon/org/10980.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.161861,+-121.611621(10980)&iwloc=A&hl=en\"> mufon case (10980) map </A>","Object Flight Path":"Path with directional change","City":"Isleton","Object Shape":"Star-like","Date Submitted":"07/20/1977 12:00 UTC","Summary":"Fishing on the bank of the the San Joaquin river facing my friend and I noticed 2 lights zipping through the sky at right angles, then they joined to gether as one, and took off very fast.","Region":"California","Source":"MUFON","Weather Factors":"None","trends":["There has been one other sighting in Isleton","There were no other sightings in Isleton on or around July 20th 1977"],"Case Number":"10980","Sighting Duration":"00:00:10","Latitude":"38.161861","Date of the Event":"07/20/1977 12:00 UTC","Object Features":"None","Disposition":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-121.611621","Log Number":"US-05312008-0011","Country":"United States","Tags":"City","divs":["sighting detailsduring the mid summer of about 1977, a friend and i were fishing on the bank of the san joaquin river, approximately 1\\4 mile west of \"korths's pirate lair\" marina on twtichell island levee rd road. it had to be either a friday or saturday night, as we went there each weekend when we were teens. we were facing the shipping channel, south to south\\west. it was around 10-11 pm, and we both noticed two very bright white lights, zipping through the sky, turning at right angles but not stopping. almost as if bouncing like in the old video game \"pong\". i couldn't determine any shape, they just appeared as a bright white light - like a very bright star. i have no way to determine their distance from us, but would guess they were near the altitude commercial aircraft fly at (30,000'). they made several darts across the sky, then slower they headed towards each other, and became one. maybe a second or two later the single light just took off, accellerating extremely fast fading away. that happened very quickly. it frightened me actually. they entire thing lasted maybe 5-10 seconds. we both just sat there for several minutes, not saying a word before i asked him \"did you see that?\" he said, yeah. we never talked about it, and it was only maybe 5-years ago when i told my brother & his wife. while watching some type of ufo tv show about 5 years ago (~2005), i saw the same looking lights captured on video performing that same pattern (can't recall if they joined together at the end though)."]}