{"Disposition":"IFO","Country":"United States","Source":"MUFON","divs":["Sighting DetailsOver the past four years or so, I have probably seen this thing four times. If I wake up in the middle of the night, maybe around 4:00 - 4:30 am to go to the bathroom, my eye catches an enormous bright, white light over the building across from mine. I live at 293 Turnpike Road (Rt. 9) in westborought, MA. I am on the 8th floor and looking out my bedroom window, facing probably northeast (east on Rt. 9) and over the building across from mine (#295 Turnpike Road) I have seen this light. The first time I saw it it was hovering just over the roof of the building, probably a full apratment and one-half long. It was in the winter and I wondered if it was the glow from a heater on the building or something. I watched it for maybe 10 minutes to see if it would move, and it did not. It did not seem to come closer or move side to side. It was odd and I wanted to watch it more but raced to the bathroom. when I quickly returned to see if it was still there, it had disappeared. Being so odd, from time to time if I wake up to use the bathroom (usually around the same time) I look out to see if it is there. I have seen it maybe two or three times more, but not directly over the building as if it were going to land on it, but higher in the sky, maybe as high as a helicopter might fly but still directly over the building in front of my apartment building. Each time I stand or sit and watch it to see if it will move and it does not. It is very odd. Each and every time I run to the bathroom and return to continue watching it, but it is gone. The last time I saw it was probably May 23, 2008. If I should ever see it again I am going pay more attention to the time of night, and length, etc. It is hard to believe that ther is no one in my large building who has not seen this too. I have not told anyone about it because they will laugh it off or think I am crazy; but it certainly is curious to me. On the other side of the building is a large parking lot with a McDonald's and a Wal-Mart. Neither are open at that time. And beyond the Wal-Mart is a good size grassy hill. I cannot see the parking lot nor the Wal-Mart and McDonald's from my 8th floor, but I can see the top of the large hill beyond them. Sometimes there are flickerings of bright light in the bush there at that time of night also. During the day I have looked with bonoculars and I think there is a small road on the hill and maybe a couple of street lights, but I am not sure who goes up and down that road at 4:00 am. Those small flickering lights are not the same as this giant light suspended in the sky. I know this is not a real interesting UFO story as some people have, but I am sure interested in what this thing is that disappears when I leave the room as if it waits for me to do so. I am a middle-aged woman and I worked sixteen years as a teacher. I have been a psychotherapist for twenty additional years. I have three Master's degrees, a CAGS, and I am working on my doctorate. I tell you this because I am a professinal person who knows reality from fantasy."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.269522,+-71.616129(10981)&iwloc=A&hl=en\"> mufon case (10981) map </A>","Object Shape":"Oval","Object Flight Path":"Stationary","trends":["There has been one other sighting in Westborough","There were no other sightings in Westborough on or around May 23rd 2008"],"Region":"Massachusetts","Log Number":"US-05312008-0012","City":"Westborough","Weather Factors":"None","Summary":"Extremely large, oval, very bright white light remains in one position until I leave the room for 30 sec. and then it disappears.","Sighting Duration":"Undisclosed","Latitude":"42.269522","Object Features":"None","Longitude":"-71.616129","Date Submitted":"05/23/2008 04:15 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Date of the Event":"05/23/2008 04:15 UTC","Case Number":"10981","files":["/var/www/straped/mufon/html2text/10981.html.txt","/var/www/straped/mufon/org/10981.html"]}