{"Date of the Event":"03/20/2004 08:00 UTC","City":"Fort Stewart","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Probable UFO sighting over or near FT Stewart, GA","Log Number":"US-06012008-0006","Weather Factors":"None","Latitude":"31.838266","map":"<A HREF = \"http://maps.google.com/maps?q=31.838266,+-81.620666(10992)&iwloc=A&hl=en\"> mufon case (10992) map </A>","divs":["Sighting DetailsSometime late during the month of March, 2004, at approximately 2000hrs, I observed what appeared to be a bright object falling at about a 45 degree angle towards the ground at a high rate of speed. I estimate that I was approximately 20-30 miles away. I was at the barracks where I had been quartered, talking to my family on the cell phone, when I saw a bright object falling from the sky. The object appeared to have two explosions during it's decent, though I could not hear them. It was not chaff from an aircraft, nor was it artillery fire, aerial gunnery fire, nor fireworks from the on-post fair which was about a quarter of a mile in front of my barracks. The explosions came from the object, and were bright enough to be seen in the night, with a high-visibility light source in front of the object (the fair), and a clear star-field behind the object. The location of where I saw the object was not near the FT Stewart impact area, and there were no artillery units conducting night fire exercises that night. I did not hear any artillery or aerial gunnery fire that night. After the second explosion, the object disappeared. I initially thought that the object might have just been a falling star or asteroid, except that it did not have the usual characteristics of a falling star. It did not appear to have a trail of burning debris from it as it entered the atmosphere, streaking across the sky. It did not \"burn-out\" quickly, I watched it for about 30 seconds as it fell. I did not hear it impact the ground. There were no reports of a crash that happened locally in the news the next day. There are three airports in the surrounding area - Wright Army Airfield, Hunter Army Airfield, and Savannah Intl. Airport."],"trends":["There have been 3 other sightings in Fort Stewart","There were no other sightings in Fort Stewart on or around March 20th 2004"],"Source":"MUFON","Date Submitted":"03/20/2004 08:00 UTC","Case Number":"10992","Object Flight Path":"Other","Region":"Georgia","files":["/var/www/straped/mufon/html2text/10992.html.txt","/var/www/straped/mufon/org/10992.html"],"Object Shape":"Unknown","Longitude":"-81.620666","Disposition":"IFO","Country":"United States","Object Features":"Unknown","Viewing Distance":"Over One Mile"}