{"Summary":"Night, 7 red lights separted equidistant in arc moving slowly south to north and back again.","Viewing Distance":"Over 1 Mile, Unknown","Object Features":"None, Other, Unknown","Object Flight Path":"Straight-line path","City":"Torrance","Source":"MUFON","Case Number":"10993","Region":"California","Country":"United States","Date Submitted":"08/31/2007 12:00 UTC","divs":["Sighting DetailsHonestly, not sure as to whether these might have been military fighter jets - but the circumstances surrounding this sighting seemed abnormal. On a Sunday night, I was outside walking my dog at an airport in southern CA up and down long hangar rows. No moon, clear pitch black sky with many stars to be seen. I'm always searching the skies for aeroplanes, so on this temperate, calm and quiet night I was looking up to see quite high in the sky - probably out of B class airspace - a GENTLE ARC of what looked like about 0.5 - 1.0 miles in diameter of 7 single RED lights - not flickering - all equidistant apart travelling VERY SLOWLY NORTH at what seemed could have been a complete north-south WEST COAST surveyance. Trailing behind these, I found only ONE red light at what looked like about 1 - 1.5 miles behind. I strained my eyes to try to view the attached aircraft from which each red light shone, but I could not see anything. The slow, slow speed was interesting. There was no sound, no hum or anything, plus it was really quiet at the airport. I know fighters have ROTATING or STROBE-LIKE single red lights on their belly as well as make some noise no matter how high, but these small red lights did not flash or rotate. But as it moved, I did notice one or two of the lights on the outer edges phase out and then come in again. I could tell it was very high indeed. I could easily view from edge to edge. It moved on up the coast until it disappeared. Feelings wise: I didn't want to remove my eyes from the sky, as I thought it was really rather odd, unusual and highly interesting to me - as it was for my boyfriend. I went to the supermarket on the way home, and after coming out, I searched the skies again, and I did see them travelling in the (exact) opposite direction from which they originally came. Slowly, and equidistant apart, very wide and also very silent. Also with the trailing red light. They too, disappeared over the hills of Palos Verdes on their way toward San Diego (I suppose). After getting home, I did tune in 600 and 640 AM hoping some others may have seen the same thing. Nothing. I also searched the web that evening - still nothing. The next day I thought about it, I'd told a couple of people, but shortly thereafter, I'd forgotten it. They seemed like they might have been some kind of military surveyancy that covered the west coast on this night. However after doing some research on my own, the sighting seemed to match those of many others - but at different times and different places, and I just thought I'd throw in my twopence. I'd really like to know if there is just anybody out there who visualized the same thing at around the same time I did."],"Tags":"City","Disposition":"IFO","Latitude":"33.841389","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Torrance","There were no other sightings in Torrance on or around August 31st 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.841389,+-118.331679(10993)&iwloc=A&hl=en\"> mufon case (10993) map </A>","Longitude":"-118.331679","Weather Factors":"None, Does Not Apply","Object Shape":"Boomerang, Other","Date of the Event":"08/31/2007 12:00 UTC","Log Number":"US-06012008-0007","files":["/var/www/straped/mufon/html2text/10993.html.txt","/var/www/straped/mufon/org/10993.html"]}