{"Region":"Bayern","Latitude":"49.714147","Longitude":"11.905874","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.714147,+11.905874(1100)&iwloc=A&hl=en\"> mufon case (1100) map </A>","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/1100.html.txt","/var/www/straped/mufon/mufon_json/1100.json","/var/www/straped/mufon/org/1100.html"],"Viewing Distance":"Unknown","Case Number":"1100","Tags":"City","Summary":"Unkown source of redlight with a brightness equal","trends":["There have been no other sightings in Grafenwöhr","This sighting has never been favorited."],"Date of the Event":"02/28/1990 02:00 UTC","Log Number":"","City":"GrafenwÃƒÂ¶hr","divs":["Sighting DetailsI would like to know if what I saw eleven years ago was a UFO or a naturaloccuring phenomenon. I was stationed in Germany in 1990. One night whileguarding an ammo holding area in an isolated area, I saw a bright red light thatwas as bright as the sun. I was sitting in a small wooden guard shack thatresembled an outhouse but with windows. The window to my left was boarded upwith plywood3B I could not see the source of the light because of the board. It was two orso in the morning and it was quiet with no activity. The area where the ammowas stored at had no lights. The only source of light I had was a flashlight. The ammo holding area was located in a tactical training area3B the use of white light outdoors was prohibited. It was quiet and I cantrecall if the skies were clear or not. There was no moon and it was dark. Suddenly the whole area in front of me lit up like it was noon. It was as ifsome one had turned on a light in a room. I could clearly see everything aroundme. It was just like daylight but the light was red. There was no sound and itonly lasted a second. The source seemed to come from the sky and to my left3B I could not see the source because of the plywood. I dont know what couldcreate a light with the same intensity as the sun and not make a noise. Aminute of two later a pair of military Humvee sped pass by on a road that wasnear my guard shack. The vehicles had flashing lights on top. Nothing happenedafter that. The next morning I asked around. No one knew anything about itwhile others did not say anything. I would like to know if what it was that Isaw that night3B whether it was a ufo or not. I was 21 at the time of the incident."],"Sighting Duration":"00:00:59","Date Submitted":"02/28/1990 02:00 UTC","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Country":"Germany","Object Features":"Undisclosed"}