{"Tags":"City","Longitude":"-122.458036","files":["/var/www/straped/mufon/html2text/11002.html.txt","/var/www/straped/mufon/org/11002.html"],"Summary":"Dimly lit triangle with multiple chevron lights","City":"Sonoma","Sighting Duration":"00:00:30","Date Submitted":"04/26/2008 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.291859,+-122.458036(11002)&iwloc=A&hl=en\"> mufon case (11002) map </A>","Weather Factors":"None","Object Shape":"Triangle","Latitude":"38.291859","trends":["There have been 4 other sightings in Sonoma","There were no other sightings in Sonoma on or around April 26th 2008"],"Country":"United States","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["sighting detailsas i was stargazing & smoking (sorry!)on a clear cool evening,an object appeared above me that came from the east. it was a definate triangle shape w\\dim,pale orange chevron shaped lights (about 9-12?) within the triangle. it was very pale.i could tell there was a black underlay in a triangle shape. this was a thing that did not want to be seen. it was above me for a good 15-18 seconds (hard to say-i was stunned) after i first spotted it. as i was trying to wrap my head around what i was seeing-going thru all the options-a flock of geese-yet there was no sunlight to reflect off thier wings, and they were stationary-hovering. i dont think geese can do that! a stealth bomber-no. a kite? no! i have no concept of how high up it was could have been 100 feet or 10k-no idea! i dont know what the scale\\size of it was. it happened too quick! when i grasped the idea that it was an actual ufo-i gasped & took in breath, there seemed to be a moment of recognition between me & the craft (?...i can't explain the feeling) the craft then made a very quiet brief hum, like vvv and took off at incredible speed to the west. it was gone in the blink of an eye. this is my first sighting of any ufo. i am very excited!"],"Case Number":"11002","Date of the Event":"04/26/2008 09:45 UTC","Object Features":"Other","Log Number":"US-06022008-0002","Region":"California","Viewing Distance":"Unknown"}