{"Object Shape":"Fireball, Flash, Sphere, Star-like","Latitude":"27.777726","Region":"Florida","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.777726,+-82.63249(11014)&iwloc=A&hl=en\"> mufon case (11014) map </A>","Date of the Event":"05/15/2008 11:50 UTC","Longitude":"-82.63249","Disposition":"Insufficient Data","Summary":"walked out of college late at night looked up and saw a huge bright star that instantly shot off!","Case Number":"11014","divs":["Sighting DetailsI went to college on may 15 2008, i have night classes and they last from 6 to 11:30pm. After Computer class my friend went to talk to the teacher about about a computer problem at home at home, and myself being skilled with computer went up to join the conversation, to see if i could help. Well one thing lead to another and we got into a detailed conversation \"the 3 of us\" about topics like \"the government, ETs, Anti-gravity, and the North American Trade Union\" not typical topics discussed at school, but it was after hours everyone left to go home, my teacher was basically just listening to our thoughts, ideas, and theory's. Well i decided to call it a night and head home, my teacher and friend remain inside school to keep talking, i walked out the door to the courtyard witch connects to the parking lot witch only had about 4 cars in it, it was about 11:50pm \"i stayed after school about 20 min. inside\" as i crossed the courtyard to the parking lot i was about 10 yards from my truck, i constantly look at the night sky when im outside, something my father got me doing, being interested in UFO, i fittled with my keys and then i looked up because i saw a faint light above me, as soon as i looked up my eyes focused on a huge star like light about my head \"i could of put my hand up and the star like light would of perfectly fit in my, hand size wise\" if could take a guess, it was about 130-150 feet above me, hovering \"silently\". What i found really surprising and a second time experience for me, this star-like object when i looked up at i instantaneously accelerated to a speed that to me, was impossible. This encounter had a duration of around 7 seconds from seeing the light above to almost missing it take off by blinking. It seems, as soon as i focused on it, i took off. After this i had no missing time."],"City":"St Petersburg","Object Features":"Undisclosed","Date Submitted":"05/15/2008 11:50 UTC","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/11014.html.txt","/var/www/straped/mufon/org/11014.html"],"Tags":"City","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around May 15th 2008"],"Log Number":"US-06022008-0014","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet"}