{"Object Shape":"Cross","Log Number":"US-06032008-0009","Date Submitted":"06/01/2008 07:00 UTC","City":"Washington","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.905012,+-77.033116(11024)&iwloc=A&hl=en\"> mufon case (11024) map </A>","files":["/var/www/straped/mufon/html2text/11024.html.txt","/var/www/straped/mufon/org/11024.html"],"trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around June 1st 2008"],"Summary":"Was running on the track when a neighbor and I saw a dark maltese-cross like flying object overhead","Viewing Distance":"101-500 Feet","Region":"District of Columbia","Sighting Duration":"Undisclosed","Longitude":"-77.033116","Disposition":"Unknown","Case Number":"11024","Tags":"City","Latitude":"38.905012","divs":["Sighting DetailsIt was a VERY cool and windy day, and it was predicted that the district of columbia would have severe rain and thunderstorms over the next 24 hours. The sky was dark and we were rushing to finish our laps on the track before it started to rain. When I was on my 4th lap, my attention was immediately drawn upwards to a dark object that was gliding gracefully in a circular pattern in the sky ahead of me. Initially I thought it was a large bird, but when I actually took a good look at it, I realized that it was shaped like a maltese cross. My running partner also stopped and looked up to see what I was staring at, and exclaimed, \"wow, what's that?!?\" It only glided in the circular pattern for a few seconds, and then crossed overhead in a smooth arc-like pattern towards the direction from which we came. As we watched it take it's path, it seemed to tumble in place a few times. The path of the oject was absolutely smooth and precise though. It was not erratic despite the fact that there were heavy, choppy winds, and that we had been running against resistance the whole time we were on the track. It also did not change it's height in the sky. All it did was gain horizontal distance. I could not tell if there was any sound coming from it beacause it was so windy outside. We were in awe, intrigued, but frightened at the same time. I have never seen a craft like that in my life. It kept gliding peacefully behind us until we could no longer see it."],"Weather Factors":"Windy, Heavy","Date of the Event":"06/01/2008 07:00 UTC","Object Features":"Unknown","Object Flight Path":"Hovering then path","Country":"United States"}