{"Object Flight Path":"Unknown","Weather Factors":"Unknown","Date of the Event":"04/11/2008 10:45 UTC","City":"Keene","Latitude":"42.934882","divs":["sighting detailsi was driving home down shaw hill road (rindge))from the top of cathedral rd when i saw through the dark, a car parked at the bottom of the hill with only one headlight on. although it was parked on the opposite side i slowed down because it was at the lowest point in the road and i couldn't judge exactly where it was until the parking lights went on, they were bright lozenge shaped red lights in front of the car.as i passed the suv i noticed a person standing in the road in front of the car,i am not sure if there were two, and he suddenly lit up so that i could see him\\her in a head-to-toe rain gear outfit. the head was covered with a very distinct rain hat so that the face was too dark to make out. i also noticed a flashlight that was just a glowing half dome on a stick like a microphone. i noticed but didn't think anything of it then, there was no beam of light coming from it. the rain suit had reflective stripes running lengthwise sparekley so that i rationalized that the sudden light i saw was the reflection from these stripes once the parking lights came on and i saw the \"flashlights\". as i passed the suv i glanced to see the people inside and saw what looked to be two ordinary people. a man in his mid 50's was in the driver seat, staring straight ahead with no facial expression but i couldn't make out the passanger. what struck me as odd was there being another person standing behind the vehicle dressed exactly the same as the one in front. i figured since they weren't police [there were no other vehicles] they must be trying to help the car that had only one headlight. it had been raining earlier so the wacky rain gear didn't seem so odd after all. that is until i looked back in the rear view mirror and saw the one standing in back, move out into the road and start looking for something on the ground. again i noticed that i saw no beam from the flashlight, but i could make out that it was dressed in a silver jumpsuit with reflective bands and a helmet hat. as i pulled away i couldn't help wonder why these two people would still be wearing rain hats when it wasn't raining and where did they come from? maybe they were taking a walk and came upon the car, but identical head to toe silver jumpsuits in rindge?and those beam less flashlights were interesting."],"Region":"New Hampshire","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Country":"United States","files":["/var/www/straped/mufon/html2text/11021.html.txt","/var/www/straped/mufon/org/11021.html"],"Longitude":"-72.273591","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.934882,+-72.273591(11021)&iwloc=A&hl=en\"> mufon case (11021) map </A>","Case Number":"11021","Log Number":"US-06032008-0006","Summary":"saw two individuals, car parked on road panel with HAZMATappearing raingear,with verticle reflective stirpes with microphone shape flashlight with no beam","Date Submitted":"04/11/2008 10:45 UTC","trends":["There have been 3 other sightings in Keene","There were no other sightings in Keene on or around April 11th 2008","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Object Shape":"Undisclosed","Tags":"City"}