{"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.130685,+-107.242847(11028)&iwloc=A&hl=en\"> mufon case (11028) map </A>","Object Shape":"Teardrop","Latitude":"33.130685","Log Number":"US-06032008-0013","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Windy, Light","Case Number":"11028","Date Submitted":"05/31/2008 08:15 UTC","Longitude":"-107.242847","City":"Truth or Consequences","Viewing Distance":"Over One Mile","Object Features":"None","Source":"MUFON","trends":["There have been 3 other sightings in Truth or Consequences","There was one other sighting in Truth or Consequences on or around May 31st 2008","This sighting has never been favorited.",""],"Summary":"Bright Stationary object in New Mexico Sky","Object Flight Path":"Stationary","Region":"New Mexico","Country":"United States","Date of the Event":"05/31/2008 08:15 UTC","divs":["sighting detailsmy family and i were camping at elephant butte reservoir on may 31, 2008; we had enjoyed a day of boating on the lake and had come in for dinner and an evening around the camp fire. there were five of us and we had just finished eating and we were all just hanging around camp, it was approximately 8:15 p.m., not quite dark yet, when my husband said \"what the heck is that\" and we all looked and in the northern sky was a very bright light. no stars were out yet and it was just too bright to be a star. my husband grabbed the binoculars and he could clearly see three lights, two on top and one on the bottom, in the shape of a triangle or upside-down teardrop. the object never moved, it stayed stationary for approximately 15 - 20 minutes. we took a lot of pictures; we lost sight of it after the sun went down. none of us could believe what we were seeing. all of us looked through the binoculars and could see the three lights and it seemed to be changing color from a whiter light to a very reddish\\orange light."],"files":["/var/www/straped/mufon/html2text/11028.html.txt","/var/www/straped/mufon/more/11028_submitter_file1__Picture175.jpg","/var/www/straped/mufon/more/11028_submitter_file2__Picture178.jpg","/var/www/straped/mufon/more/11028_submitter_file3__Picture198.jpg","/var/www/straped/mufon/org/11028.html"]}