{"Object Features":"Appendage(s)","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.638315,+-70.931605(11029)&iwloc=A&hl=en\"> mufon case (11029) map </A>","Date Submitted":"06/03/2008 01:30 UTC","Longitude":"-70.931605","Object Flight Path":"Hovering then path","Date of the Event":"06/03/2008 01:30 UTC","files":["/var/www/straped/mufon/html2text/11029.html.txt","/var/www/straped/mufon/org/11029.html"],"Summary":"Saucer sighting in Dartmouth, MA","trends":["There have been 7 other sightings in New Bedford","There were no other sightings in New Bedford on or around June 3rd 2008"],"Region":"Massachusetts","Log Number":"US-06032008-0014","Latitude":"41.638315","Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Disc","divs":["Sighting DetailsWe live in Dartmouth on the beginning of a street that starts at route six. We heard a commotion outside and I sent my boyfriend to investigate oddly our dog who always jumps at a chance to go outside night or day especially if my boyfriend heads outside was fearful to head out. Upon investigation it became apparent that the disturbance was just a couple of rowdy neighborhood kids but as my boyfriend looked to the sky he saw two what appeared to be flying saucers hovering in the distant sky. Which he called me to come witness. Unlike stars they both were clearly saucer-shape with what looked like tentacles of light coming from the bottoms of the crafts. Think jelly-fish. Both changed colors and moved back and forth on paths not any comet, helicopter or plane ever could maneuver . We got our video camera and from our bedroom window got about 15 minutes of footage of one of the crafts before our battery died in our camera. Convenient I know but who keeps their battery fully charged in case of \"video emergencies\" The second craft was eclipsed by the trees in our back yard so we unable to get a clear view. I've never seen anything like this before. I'm not big into UFOs but I don't ignore the possibility of life on other planets. I heard a couple of people at work talking about them so we're not the only ones to bare witness to them. I was just wondering if anyone else saw these things? I will upload the video when I get the proper software installed."],"City":"New Bedford","Weather Factors":"Unknown","Case Number":"11029","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"IFO"}