{"Object Flight Path":"Straight-line path","Log Number":"US-06032008-0008","Weather Factors":"None","Source":"MUFON","Tags":"City","City":"Port St Joe","Sighting Duration":"Undisclosed","Region":"Florida","trends":["There have been 6 other sightings in Port St Joe","There were no other sightings in Port St Joe on or around May 31st 1977"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.814722,+-85.297222(11023)&iwloc=A&hl=en\"> mufon case (11023) map </A>","Object Features":"Patterned Surface","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/11023.html.txt","/var/www/straped/mufon/org/11023.html"],"Date Submitted":"05/31/1977 01:00 UTC","Date of the Event":"05/31/1977 01:00 UTC","Object Shape":"Cigar","Viewing Distance":"101-500 Feet","Latitude":"29.814722","Summary":"two cigar shapes side by side w/common bridge connecting objects","divs":["Sighting DetailsLeaving Port St Joe early morning hours driving toward either Panama City or Pensacola with windows down in car. Could see the beach through pines trees along coast and noticed three conical shaped lights of white, green and yellow shining down onto beach in a rotating pattern from above. Slowed car to 30 MPH to see where the lights were coming from and about 100-150 feet over beach saw large cigar shaped object that looked like it had a hammered black hull. Drove along side it for about 30 minutes listening for sounds which there were none coming from object just shining lights around onto beach. Noticed at an angle slightly ahead of object that there were two cigar shapes and had two common \"bridges\" connecting them. As far as I can remember we drove on away as it slowed just know we were at our destination without having discussed it much other than it was strangely large and quiet. Next day newspaper had article about hundreds sighting ufo near Ocala but we never looked to see where Ocala was on map just figured we had seen something we werent sure about. I can draw it from memory but have no way to get it on to my computer at this time."],"Longitude":"-85.297222","Case Number":"11023","Country":"United States"}