{"Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"05/22/2008 09:32 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsTime of Incident: 9:35 pm, Thu May 22 22:31:18 EDT 2008 Location: south Nashua, NH. I was observing the night sky - looking for various constellations and planets. Sky Coverage: Mostly clear (light occasional clouds could be seen) Airport traffic: Visible from KMHT (Manchester NH), KASH (Nashua NH) and KBOS N and W release patterns (Boston MA). Constellations: Big Dipper overhead Planets: Jupiter (in E or SE) Object location: path looked like an arc that passed directly overhead from the W or SW through the Big Dipper to the E or NE until out of view. Naked eye: The object was bright white and shape was hard to discern. Binoculars (7x35) : The object was bright white and shape was hard to discern. Object description: Circular or nearly circular. Size was pea size. It looked similar to a meteor but the object was larger, brighter and had no debris tail. Height in sky: 5K to 10K feet (or higher). Both size and height are guesses - it was very hard to discern these attributes at night. It looked like it was lower than the departure traffic for KMHT and KBOS. Airplanes (primarily jets with red, green and white strobe running lights) created a contrail, this object did not (none was visible). Noise was heard with the various jets in the air, this object had no noise associated with it. Did anyone else notice the object? Was it space junk reentering earth's orbit? Or something else?"],"files":["/var/www/straped/mufon/html2text/11037.html.txt","/var/www/straped/mufon/org/11037.html"],"Sighting Duration":"00:05:00","Tags":"City","Disposition":"IFO","Date Submitted":"05/22/2008 09:32 UTC","Summary":"Over Nashua NH, white object traversed night sky SW to NE","Region":"New Hampshire","trends":["There have been 7 other sightings in Nashua","There were no other sightings in Nashua on or around May 22nd 2008"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-06042008-0004","City":"Nashua","Longitude":"-71.463066","Latitude":"42.768036","Case Number":"11037","map":"<A HREF = \"http://maps.google.com/maps?q=42.768036,+-71.463066(11037)&iwloc=A&hl=en\"> mufon case (11037) map </A>","Object Shape":"Oval"}