{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/11038.html.txt","/var/www/straped/mufon/org/11038.html"],"City":"Titusville","Country":"United States","Disposition":"Insufficient Data","Tags":"City","Case Number":"11038","Object Features":"None","Date Submitted":"05/31/2008 05:05 UTC","Summary":"The UFO was a straight white line in the clear daytime sky ,approx. the size of a quarter held at arm's length","Source":"MUFON","Longitude":"-80.798624","Sighting Duration":"00:02:00","Latitude":"28.617879","Region":"Florida","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy wife and I stopped on the side of state highway 46 approximately 20 miles from Titusville along side a treeless wide open vista looking in the direction of Titusville along with five or six other vehicles with people waiting to view the most recent shuttle launch. 30 seconds or so before the launch ( we were listening to the count down on our car radio) my wife said \"what is that?\" and pointed to a large object, white in color hanging motionless in the clear sky approximately 20 degrees from where the shuttle would rise into the sky. She instantly knew it was absolutely something not normal and it was not moving at all. It stood out like a sore thumb, so to speak. It was about the size of a quarter on edge held at arm's length and about the thickness of a 747 when viewed from 3 miles or so. I estimate it was about 20 miles from our location and must have been huge if viewed up close. After viewing it for 30 seconds or so the shuttle launched and our attention was diverted to the shuttle. We watched the shuttle go up until it was no longer visible approx. 1-2 minutes. When I looked for the UFO after the shuttle was no longer visible the UFO was gone.. zip. For it to vanish in that short of time it would have to have traveled extremely fast or cloaked as it did not come our way. I have believed in UFO's for a long time but my wife has been skeptical but she knows she saw something that was not conventional and should not have been there. I absolutely know many other people must have seen this object and that is why I am posting this to see if other people might write in to provide other witnesses."],"Log Number":"US-06052008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=28.617879,+-80.798624(11038)&iwloc=A&hl=en\"> mufon case (11038) map </A>","Object Flight Path":"Stationary","Date of the Event":"05/31/2008 05:05 UTC","Object Shape":"Cigar, Disc","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around May 31st 2008"]}