{"Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"11036","Date Submitted":"06/03/2008 10:40 UTC","files":["/var/www/straped/mufon/html2text/11036.html.txt","/var/www/straped/mufon/org/11036.html"],"Country":"United States","trends":["There have been 10 other sightings in Ashland","There were no other sightings in Ashland on or around June 3rd 2008"],"Source":"MUFON","Disposition":"Insufficient Data","Longitude":"-122.699877","Weather Factors":"None","Latitude":"42.198476","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.198476,+-122.699877(11036)&iwloc=A&hl=en\"> mufon case (11036) map </A>","Region":"Oregon","Summary":"Bright white light with tent of green and red was going up and down and in circular motion disappeared then reappeared.","Object Shape":"Flash, Star-like, Unknown","Date of the Event":"06/03/2008 10:40 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","City":"Ashland","divs":["Sighting DetailsMy husband and I were outside on the back porch (from Ashland, Oregon it was south, southwest.) when he point out to me what a strange star. It was almost like a pulsar. I noticed that sitting in the exact same spot of about 5 min. that if that was a star it sure was moving fast?! Then I said it was a plane my husband said that the navigation lights were not flashing at about that time it went up. It started to move in circles the looked as though it was going up a tunnel then disappeared. We were saying what in the world was that when just at that moment it reappeared and started to look like it was making a zigzag motion then again up and down. We sat and watched for sometime and called neighbors to go out and look. I was so excited that I woke up my sleeping child inside. It was extraordinary! Sorry to say that the clouds came over and we were not able to see it again."],"Log Number":"US-06042008-0003"}