{"Sighting Duration":"Undisclosed","Summary":"looked like a bright white light that didnt move, like a really bright star. looked like a lightbulb","Latitude":"29.375036","City":"Del Rio","Source":"MUFON","Tags":"City","Date Submitted":"06/05/2008 01:30 UTC","Date of the Event":"06/05/2008 01:30 UTC","Longitude":"-100.889767","Log Number":"US-06052008-0003","map":"<A HREF = \"http://maps.google.com/maps?q=29.375036,+-100.889767(11040)&iwloc=A&hl=en\"> mufon case (11040) map </A>","Case Number":"11040","Object Shape":"Circle, Star-like","Disposition":"Unknown","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around June 5th 2008"],"Weather Factors":"Windy, Medium","Region":"Texas","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was at my mothers house in del rio texas, around 1:20-1:30am i got a call from my gf and went outside to smoke a cigarette. i walked outside and could see sumthing really bright from the corner of my eye. it looked like a really bright, white in color, star. it sort of had the shape of a light bulb..and sumtimes looked as if it was 2 lights really close to eachother. i tried to record it on my phone but it wasnt able to catch a good video of it, so i took pictures of it on my cell phone. i took pictures of the normal stars and you couldnt see them on my phone but when i took pictures of the bright light, you could see it on my phone. it looks like a bright white dot. i went inside to tell my brother what he thought of it and he came out with his digital camera and took a couple of pictures as well. then we went inside for about 20-30 minutes untill i went back outside to smoke another cigarette and noticed it was no longer in the sky. i kind of had a shockin sensation when i noticed that it was no longer there. i have about 8 pictures i took on my phone. i was lookin towards the direction of eagle pass tx., wich is south of del rio tx, and the location i was was on top of a hill with not many city lights so i doubt that could be an answer to the light in the sky but thought that it might be a sattelite."],"Object Features":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/11040.html.txt","/var/www/straped/mufon/org/11040.html"],"Country":"United States"}