{"Weather Factors":"None, Does Not Apply","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.05368,+-85.30105(11048)&iwloc=A&hl=en\"> mufon case (11048) map </A>","Object Shape":"Boomerang","Longitude":"-85.30105","Summary":"driving down road and saw a very slow moving boomerang shaped craft pass closely overhead.","Log Number":"US-06052008-0011","City":"Chattanooga","Country":"United States","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around April 18th 2008"],"Date Submitted":"04/18/2008 11:21 UTC","Tags":"City","Case Number":"11048","Object Features":"Wings","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"35.05368","files":["/var/www/straped/mufon/html2text/11048.html.txt","/var/www/straped/mufon/org/11048.html"],"divs":["Sighting DetailsI am a security officer in chattanooga, tennessee and a couple of months ago I was on post at chattanooga boiler and tank inc. In the 11:00 hour one night I was conducting a mobile patrol in my car, when I looked up and saw a collection of lights about 2 football fields away from me. I thought it was a helicopter but there were no small blinking lights like terrestrial air vehicles are supposed to have. It started moving toward me and I got a feeling that this vehicle was very weird. I got out of my car and I noticed that it was a winged vehicle not a helicopter at all. It was moving very slowly at approximately 50 feet from the ground with absolutely no sound at all. It passed directly overhead and I could see it very well. It was the size of a fighter jet, with a boomerang shape and no back tail, with 5 white lights underneath. I looked for any exaust ports and saw none. I was close enough to it to see that it was metallic, and could not have been a glider. It was also moving very slowly which is just weird. I lost track of it when it went over some trees and buildings. This happened at east main st. and polk st. just outside downtown chattanooga, tennessee in the 11:00 hour at around April 18, 2008. So there has to be more witnesses."],"Date of the Event":"04/18/2008 11:21 UTC","Viewing Distance":"21-100 Feet","Sighting Duration":"00:03:16","Region":"Tennessee"}