{"Weather Factors":"None","divs":["Sighting Details At 9:45pm on the evening of April 10, 1997, I and two 'sensei's (blackbelt teachers) stepped from the Kiatsuho (rear) entrance of the Oregon Ki Society dojo. The dojo is located in the area where Hwy 217 (Tigard) and the I-5 (Lake Oswego) come together, directly across the freeway from the Mormon temple. It was dark - this was before all the tall fir trees had been cut - and the sky was clear. We had somehow gone 'way over our 9pm quitting time for doing acupressure & meditation. While BH locked the door, I went to the truck to get binoculars and said to SA & B, \"Let's look at the comet!\" But immediately all three of us heard a deep, throbbing hum (like standing under high power lines) and we looked up to find that the stars were no longer there. Instead an immense black 'something' hovered very low over us, the building and the parking lot. It was difficult at that moment to tell how very large this thing was although by estimating it was only about 30 feet off the ground (at tree top height), best guess is -- 60 to 100' wide. Black - pitch black - without a single reflection off its surface and there were street lights on, lights from the temple across the freeway --- it was as if it was sucking up the light. Then the nose end of the giant thing gently 'tipped' upward and a red light became visible in the middle of it, along with a terribly bright white light on each point of the triangle. These lights did not shine 'out' but rather glowed from within. I stood in awe and asked the 2 men, \"What is it?\" BH muttered, \"A helicopter,\" and ran to his vehicle and quickly drove away. SA whispered, \"Must be a helicopter, has to be a helicopter.\" I said, \"But there's no sound!\" S mumbled something else and dove into his car and drove away leaving me standing there. Slowly this giant thing turned so the point was headed south and began to move away, still without a sound except the low hum. I jumped into my truck and quickly drove up onto the I-5 freeway and paced it going south, not 60 feet off the ground! Why no one else saw it is astounding to me, but no one seemed to 'see' it. Perhaps because it was so black and the lights on it were no longer visible. At the Tualatin turn-off it seemed to hover over the Fred Meyer parking lot and I turned off hoping to catch it again and as I decided to go under the I-5 it slowly seemed to move eastward, again, pacing me -- or me, it. Until the Johnson Rd turn-off when I stopped to get out and look at it again with binoculars. Suddenly the giant thing which was now quite high in the sky (1000 feet maybe) just rose in the air, the lights became visible again and it picked up amazing speed westward and BLINK! vanished over the horizon. I emailed Davenport in Seattle and told him what we'd seen and he emailed me back with a photo of the Belgian triangle. I told him that was exactly what this was. BH refused to say anything about seeing it. Absolutely refused and it took months before SA admitted to me that he'd seen something odd. ****Although S did eventually help me with an interesting after-effect. For almost 6 weeks afterward I seemed to be 'electrifiecd' - I'd walk into the office at school and the printing machine would 'explode' and throw out papers, phones malfunctioned and at home I blew away several files on my computer. S & I were working on my WREMS workbook and he got so he wouldn't let me come into his office because I upset all his electrical gear. He finally went to a Wiccan friend who advised him to have me wash myself in salt water and some other things. I did so and within a week, the freaky electrical charges went away. ***** Another note --- before we came out of the dojo that night, all three of us were doing acupressure & meditation. We usually finished class around 9pm and I do not know why we went on, in deep meditation, until 9:45. Although the men wouldn't talk about it, I can say that I was experiencing some powerful visualizations - mostly of the time I spent in Arizona during the 60's - and strong 'Ki' energy like never before. How long that giant thing had been hovering over us before we came out is anyone's guess but obviously, it had affected all of us for some time prior to our exiting the building."],"trends":["There have been 11 other sightings in Tigard","There were no other sightings in Tigard on or around April 10th 1997"],"Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-06052008-0012","Disposition":"Unknown","Date of the Event":"04/10/1997 09:45 UTC","Region":"Oregon","files":["/var/www/straped/mufon/html2text/11049.html.txt","/var/www/straped/mufon/org/11049.html"],"Country":"United States","Date Submitted":"04/10/1997 09:45 UTC","Case Number":"11049","Summary":"A giant black triangle hovered over dojo for 15 minutes, I & 2 witnesses watched it from below","Object Features":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Latitude":"45.431229","City":"Tigard","Object Shape":"Triangle","Longitude":"-122.771486","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.431229,+-122.771486(11049)&iwloc=A&hl=en\"> mufon case (11049) map </A>"}