{"Disposition":"Hoax","Date of the Event":"04/26/2008 08:40 UTC","Region":"Texas","Sighting Duration":"00:10:00","Case Number":"11044","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Features":"Dome","City":"Denton","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around April 26th 2008"],"Source":"MUFON","Tags":"City","Longitude":"-97.131688","Weather Factors":"None","Summary":"Cylindar object hoverd low overhead in my daughters back yard and quickly disssapeared,","Log Number":"US-06052008-0007","divs":["Sighting DetailsI was on my daughters back patio in Denton, Texas at approximately 8:4o pm when I saw an object slowly moving at a height of approximately 9 foot off the ground. My first impression was that it was a toy. Then the craft drifted to it's right and zi was able to see the entire craft. It was a cylindar shaped object. The nose was whitem and it was large and shaped like a globe. There appeared to be fire comming out of the back of the craft. Then I thought it looked to be of a silver color. It was moving very slowly across the yard. It went over the fence onto a gtreed lot. I then saw at approximately 7 feet high 4 distinct white lights shining through the tree branches. I watched for several seconds and got scared and moved back. I then looked again & did not see any lights. Then I saw a dot with what appeared to be 4 lines around it again at slightly below tree top level. Then it dissapeared. I walked back into the house and quicklyt came back out and the dot and lines in the sky were completely gone. I then looked at my watch and it was 8:50pm. I was a little scared throughout the entire time. I also felt that whatever it was SAW (or looked) at me and I felt like we both saw each other."],"Latitude":"33.221671","Date Submitted":"04/26/2008 08:40 UTC","Country":"United States","Object Shape":"Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=33.221671,+-97.131688(11044)&iwloc=A&hl=en\"> mufon case (11044) map </A>","files":["/var/www/straped/mufon/html2text/11044.html.txt","/var/www/straped/mufon/org/11044.html"]}