{"Viewing Distance":"Over One Mile","Longitude":"-106.304052","Country":"United States","trends":["There have been 6 other sightings in Los Alamos","There were no other sightings in Los Alamos on or around June 5th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.89633,+-106.304052(11052)&iwloc=A&hl=en\"> mufon case (11052) map </A>","files":["/var/www/straped/mufon/html2text/11052.html.txt","/var/www/straped/mufon/org/11052.html"],"Summary":"Horizontal, smooth silver cigar shaped object moving very slowly","Sighting Duration":"Undisclosed","Latitude":"35.89633","Log Number":"US-06052008-0015","Weather Factors":"Windy","Source":"MUFON","Date Submitted":"06/05/2008 12:00 UTC","City":"Los Alamos","Region":"New Mexico","Object Shape":"Cigar","Object Flight Path":"Straight-line path","Disposition":"Unknown","Date of the Event":"06/05/2008 12:00 UTC","divs":["Sighting DetailsI had just pulled out of my driveway and was about 50 feet down the road when a silver flash caught my eye. I was especially curious because the airspace above Los Alamos is restricted airspace. As I drew my attention to the object, the hair on the back of my neck stood up, and I immediately pulled the car over. I got out of my car and studied the object. The object was silver and cigar shaped, it was directly north from my perspective at the roadside. The object was silver, it was very smooth and rod or cigar shaped with rounded ends. The object was horizontally oriented and was moving laterally very slowly. I have seen blimps and weather balloons and they always have a basket or equipment hanging from them, this object did not have a basket or equipment hanging from it. The object was much lower than airplanes fly; I could estimate it at maybe 1-3 thousand feet high. The object remained in view for about 4 minutes as it moved slowly towards a large cumulus cloud and became obstructed from view when it entered the cloud. I stayed and watched for about 5 minutes afterwards and I did not see the object again. Unfortunately, I did not have a camera or my cell phone with me and thusly I was unable to photograph the object. The object looked very much like many other silver cigar shaped UFO pictures I see on the internet. There were no other witnesses in the immediate vicinity. I felt very surprised and exhilarated by the experience, having never seen a UFO in the daytime. I am fascinated with UFOs and I am inspired by the prospect of extraterrestrial contact. I hope that disclosure occurs soon. Oppono Astos."],"Object Features":"Undisclosed","Tags":"City","Case Number":"11052"}