{"Sighting Duration":"Undisclosed","City":"La Mesa","Disposition":"IFO","Latitude":"32.769699","Country":"United States","Object Features":"Undisclosed","Date of the Event":"06/04/2008 01:30 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"None","Region":"California","Log Number":"US-06052008-0017","map":"<A HREF = \"http://maps.google.com/maps?q=32.769699,+-117.015904(11054)&iwloc=A&hl=en\"> mufon case (11054) map </A>","Object Shape":"Oval","Object Flight Path":"Path with directional change","Case Number":"11054","Longitude":"-117.015904","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around June 4th 2008"],"Date Submitted":"06/04/2008 01:30 UTC","Source":"MUFON","Tags":"City","divs":["Sighting DetailsAbout 1:30 AM on June 4, I was awakened by a loud noise, which I thought was a truck or plane, somewhere close to my house. The noise faded off, so I thought it had passed, but then I heard it coming again. I just listened, trying to identify it the second time, and the noise faded out again. The noise was a loud rumble or hum, very deep, like you could sense vibrations. When I heard it the third time, I looked out the window above my bed. I saw an aircraft approaching, it seemed very low, definitely too low to be a plane. So I thought it was a search helicopter at first, it seemed about the right size and was traveling at about the right speed. My immediate reaction was \"Why the hell is that flying so low?\" (maybe 50 feet overhead) and it didn't have any search light. It was dark so I couldn't see the exact shape or color, but as it passed (right overhead) I could clearly see red and blue lights, maybe 10 to 15, in an oval shape on the underside of the aircraft. They were flashing on and off in sequence around the oval. I watched it fly over my house and the sound faded again, but grew louder and I saw it coming towards the house again. My impression was that it was circling and coming back from the left (clockwise) until it passed directly overhead, but I couldn't see it after it passed over until it would approach again. I watched it pass over at least two, maybe three, times. The last time it didn't circle all the way around and approach directly as it did before. It continued flying away from the house until I couldn't see or hear it anymore."],"Summary":"Object with blue and red lights made about 5 passes over my house then flew off, very loud humming noise","files":["/var/www/straped/mufon/html2text/11054.html.txt","/var/www/straped/mufon/org/11054.html"]}