{"Case Number":"11056","Latitude":"40.06012","City":"Newark","Source":"MUFON","Object Features":"None","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/11056.html.txt","/var/www/straped/mufon/org/11056.html"],"Viewing Distance":"20 Feet or Less","Date of the Event":"08/31/1967 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.06012,+-82.391824(11056)&iwloc=A&hl=en\"> mufon case (11056) map </A>","Region":"Ohio","Longitude":"-82.391824","Log Number":"US-06062008-0001","Object Flight Path":"Stationary","Disposition":"Insufficient Data","Object Shape":"Disc","Sighting Duration":"Undisclosed","Summary":"Disc with chasing blue lights hovered over back of car.","divs":["Sighting DetailsMy family (mother, father, 2 brothers and 1 sister --all younger than I) were traveling home after a visit to my aunt's home. We lived in Glenford, Oh - a small village of 200 in the midst of a lot of farm land. My aunt lived in Newark - about 23 miles from our home. I'm sure that it was a weekend night as school had already started and my mother would never have let us stay up as late as 11:00 on a school night. We always took back roads home as they made the trip a little shorter but they were always deserted that late at night. I was 10 years old at the time. I had dozed off and the feeling of the car coming to stop woke me up. I expected to find that we were in our driveway but we were stopped in the middle of the road about 3 miles from our house. The front driver's side door was open, my father was standing outside the car looking up at something. My mother and my brother (age 8) were both yelling at my dad to get back in the car. My brother was extremely agitated - on the verge of tears. Curious about what Dad was looking at, I got up on my knees and turned to look out the rear driver's side window. The first thing I noticed was the strange blue light that bathed my father--it had a different quality than any light I had previously seen. Dad was standing perfectly still, with his mouth slightly agape staring slightly upwards toward the rear of our car. When I turned in that direction I saw that he was looking at a large disc shaped object. It was 30-40 feet in diameter, made of some sort of seamless brushed metallic substance. Around the edge of the craft were blue lights and every 6-7 lights were part of a chasing sequence. It was directly behind our car probably 15 feet from the ground. It made absolutely no sound whatsoever. I remember that I didn't feel any fear while watching the craft -- only a sense of awe. After a minute or so, I looked back at my dad who was still standing transfixed and then back at the craft. And that's the last thing I remember. The really strange thing about this was that for the next 10 years we never spoke of this experience with each other -- something we always did after any of the other sightings we had over the years. In fact I didn't even remember it until 10 years later. I was in the Air Force. I had developed an interest in UFos and some friends and I were sitting outside on a picnic table discussing things that we had seen. Suddenly, I began telling them about this encounter--it was like a floodgate opening. I was so shocked and confused--at first I thought maybe I was just remembering some dream I had had. In a state of near panic, I ran back to my room in the dormitory and called my mother to ask her if this event really happened. Both she and my dad confirmed that it did and that the details were exactly as I remembered although they remember the trip home. When I asked why we we had never spoken of it, neither of them could answer. My brother (the one who was so panic-stricken that night) still doesn't remember any of it."],"trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around August 31st 1967"],"Date Submitted":"08/31/1967 12:00 UTC","Tags":"City"}