{"Object Flight Path":"Straight-line path,Path then hovering","Object Shape":"Disc, Sphere","Log Number":"US-06052008-0014","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"California","Date Submitted":"07/10/1998 12:00 UTC","trends":["There have been 25 other sightings in Stockton","There was one other sighting in Stockton on or around July 10th 1998"],"City":"Stockton","map":"<A HREF = \"http://maps.google.com/maps?q=37.960692,+-121.28354(11051)&iwloc=A&hl=en\"> mufon case (11051) map </A>","Country":"United States","Case Number":"11051","Object Features":"Unknown","Weather Factors":"None","Longitude":"-121.28354","Summary":"An object followed us to our home","files":["/var/www/straped/mufon/html2text/11051.html.txt","/var/www/straped/mufon/org/11051.html"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Latitude":"37.960692","Date of the Event":"07/10/1998 12:00 UTC","divs":["sighting detailsin the summer my family decided to spend the day in modesto, ca. we were there all day so it was dark by the time we got on the freeway to go back to our home in stockton, ca. we looked back at t he sky and saw that something was following us. it was a bit. bright light about maybe 100-200 feet away. we didn't know what it was. i looked back again and saw that it was still following us, and we wonder what it was? it followed us all the way home. when we got there, and we got out of the car and went into the house, my father drove on down the street to see if this thing would follow him, but it didn't. after a little while i went into the back yard and there was this object hovering over our yard. it was sort of a dull silver or lead color and it seemed that the top part rotated. there was several bright white lights around the center of it, that sometimes brightened and then dimmed, and i think it made a funny sound that i can't really describe..more of an impression of a noise than really hearing it, but i know that i just froze when i heard it\\ i'm not sure i remember if the dog acted strange, or not,but maybe whining like there was a sort of filmy mist in the air, but maybe not exactly around the object. it almost seemed to be transparent at times."]}