{"files":["/var/www/straped/mufon/html2text/11062.html.txt","/var/www/straped/mufon/org/11062.html"],"Date Submitted":"06/05/2008 10:15 UTC","Disposition":"IFO","Object Shape":"Flash, Triangle","Latitude":"33.844843","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.844843,+-117.907914(11062)&iwloc=A&hl=en\"> mufon case (11062) map </A>","Object Features":"Unknown","Log Number":"US-06062008-0006","Region":"California","City":"Anaheim","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 5th 2008"],"Weather Factors":"Unknown","Tags":"City","Case Number":"11062","Date of the Event":"06/05/2008 10:15 UTC","Source":"MUFON","Longitude":"-117.907914","divs":["Sighting Details I was driving to work at approximately 10:15 PM on June 5, 2008, south bound on Van Buren Street towards La Palma in Anaheim, when all of a sudden, two flashing bluish triangular shaped objects caught my attention to the east of my vehicle, appearing to be just above the treetops. I could only see them for a few seconds, as they were traveling to the north, and I was headed south, but they almost appeared to be \"flip-flopping\" across the sky, or were flashing in such a way that they appeared to be flip-flopping. It was strange enough that I exclaimed , \"What the %#@$^ is that???\" to myself in the car. I did not pull over, as I was not in a good area, but was trying to see them in the rear view mirror. I could not see them any longer. It was all so fast I don't know whether I was seeing UFO's, or some kind of visual effect, but there are only basic streetlights in the area, and several run-down houses below the area where I saw these lights. When I thought about what this could have possibly been, I couldn't think of anything that would move so fast, or so erratically, and I have no idea what it was."],"Object Flight Path":"Straight-line path","Summary":"blue lights triangular shaped objects \"flip-flopping\" above the trees"}