{"Country":"United States","files":["/var/www/straped/mufon/html2text/11065.html.txt","/var/www/straped/mufon/org/11065.html"],"City":"Colorado Springs","Date of the Event":"06/06/2008 10:00 UTC","Case Number":"11065","Tags":"City","Sighting Duration":"00:10:00","Log Number":"US-06072008-0002","divs":["Sighting DetailsWhile sitting in our hot tub, my wife noticed what appeared to be three stars in a perfect line in northwest sky just to the right of the moon. As she watched she noticed that one of the \"stars\" started moving toward the southeast sky. At first we thought it was an airplane or helicopter, however my wife realized that the light was not blinking like an airplane or helicopter do in the night sky and I observed it moving erratically side to side as it moved forward. The object was a very bright, white light that was constant (not blinking like an airplane or helicopter as mentioned previously) and as it moved into the southeast sky it suddenly disappeared. We were quite curious about what the object could have been as it moved way too far and way too slow to be a shooting star, at least in comparison to the past experience we've had seeing shooting stars. Additionally, the side to side movements while moving forward and the sudden disappearance with no \"flame out\" or obvious explosion were quite unusual in comparison to other objects we've seen in the sky on other nights. It was pretty exciting to talk about the possibilities of everything from meteor to space junk to maybe an aircraft from another planet."],"Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=38.836072,+-104.817313(11065)&iwloc=A&hl=en\"> mufon case (11065) map </A>","Object Features":"Unknown","Weather Factors":"Unknown","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around June 6th 2008"],"Object Flight Path":"Path with directional change","Disposition":"IFO","Viewing Distance":"Unknown","Longitude":"-104.817313","Source":"MUFON","Date Submitted":"06/06/2008 10:00 UTC","Object Shape":"Fireball, Sphere, Star-like","Latitude":"38.836072","Summary":"Bright light moving from NW to SE and then disappearing"}