{"divs":["Sighting DetailsIt was a typical summer afternoon in Illinois and me and my brother were watching a typical afternoon cubs game. We were in my dad's office watching the game and the rest of my family were in my parent's bedroom watching tv as well. Well, as me and my brother were watching the baseball game, I noticed that the colors on the tv were gradually fading. Perhaps in a 10 second span the colors had faded and the tv was in black and white. Right after that, the signal started to get weak and the image became grainy. About 10 seconds later, the image on the tv had completely been gone and there was no image or signal. At the time, we had our tv conected to a roof antena so I thought that the antena on the roof may have moved and perhaps I needed to get to the roof to move it and get the signal again. So we opened the curtain and opened the window so that my brother could yell and tell me when the signal had returned. I went outside and took with me the ladder to get to the roof. As I went up the ladder, I thought to my self if perhaps a plane may be passing by since many times when planes pass by the tv signal fluctuates and the tv image also fluctuates. I thought it strange though that there was no plane noise. So finally when I got to the roof, I was about to walk on the roof when I looked at the sky and saw on the horizon, looking south, an orange glowing circular object fly at around the same hight of the clouds as it was approaching me and then flying over my head. It was completely silent about the size of a cloud perhaps the size of two houses. I was speechless as I saw it pass over my head and head north. Just as it passed over my head, possibly a second or two later, I could hear the tv signal back to normal and my brother told me that the signal was back to normal. I went back down scared and shocked and told my brother what I had seen. He believed me because he said that he also saw something through the window for a moment and saw that the signal returned almost instantly. When we went to tell the rest of the family what had happened, they at first thought that we were playing with the roof antena because they too had lost the tv signal and then it had returned. Anyway, this is my experience and I will never forget it for the rest of my life because this object was no plane or ballon or anything I had ever seen before. It glowed orange like a ufo sphere even though I could not make out any detail of the object. It was completely silent and the day was typical summer sunny day with some clouds here and there. Partly cloudy I would say but mostly sunny. If anyone has had a similar experience I would like to hear from you as well. Thank you for reading my experience"],"trends":["There has been one other sighting in Zion","There were no other sightings in Zion on or around July 12th 1982"],"Summary":"I saw an orange glowing object fly over my head without making any noice during the day","Tags":"City","Latitude":"42.446132","Sighting Duration":"00:06:00","City":"Zion","Date Submitted":"07/12/1982 03:22 UTC","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-06072008-0004","map":"<A HREF = \"http://maps.google.com/maps?q=42.446132,+-87.83285(11067)&iwloc=A&hl=en\"> mufon case (11067) map </A>","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11067.html.txt","/var/www/straped/mufon/org/11067.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/12/1982 03:22 UTC","Longitude":"-87.83285","Object Features":"None","Object Flight Path":"Straight-line path","Object Shape":"Circle, Disc","Region":"Illinois","Country":"United States","Case Number":"11067"}