{"Object Shape":"Triangle, Other","Country":"United States","Date of the Event":"04/22/2008 10:00 UTC","Weather Factors":"Unknown","Tags":"City","Date Submitted":"04/22/2008 10:00 UTC","files":["/var/www/straped/mufon/html2text/11066.html.txt","/var/www/straped/mufon/org/11066.html"],"Case Number":"11066","divs":["Sighting Detailsapprox 10 pm a friend and I were outside looking up at the sky when something flew over us only 15 feet above us at incredible speed, faster than I have ever seen anything move. We almost didnt believe it, it went so fast. As we are discussing it, just a few minutes later coming from the direction the first object went we see approx 9 softly glowing lights flying very low coming directly towards us overhead. We both kept exclaiming 'oh my god what is that?' we couldnt quite understand what we were seeing. At first it looked like a flock of birds, but every glowing light was completely still and flew in a strange precision. These lights were approaching us directly overhead at approx 100 feet above us. Now something happened that I cannot explain or understand, but as these lights flew over us they suddenly turned into a TRIANGLE V shaped craft that seemed to have a very faint glow. We were in total shock, but amazingly neither of us felt any fear, but a strange calm. This craft flew in absolute and total silence, it just glided so other-wordly its impossible to describe. as it went overhead and north of us, it seemed to raise in altitude and head towards the ocean, the light it emited was a very soft green-white, kind of like glow-in-the dark toys. If we werent laying on blankets looking up when it went overhead we never would have seen or heard it. I had my binoculars with me and was able to look at it closely, and what I saw in my binoculars didnt match what I saw without them. Its hard to explain, but I saw very strange geometric shapes through the binoculars that only looked like soft glowing lights without them. I've attached a very rudimentary diagram of what these lights kind of looked like and how they formed the V. Its not a complete picture of what the entire thing looked like, but only the view of the lights through binoculars. The craft looked like a solid object all of the sudden where before it looked like 9 separate objects. We watched is it disappeared into the distance, we were both in awe and I guess shock."],"Source":"MUFON","Object Flight Path":"Path with directional change","Viewing Distance":"21-100 Feet","Region":"California","Disposition":"Unknown","City":"Santa Monica","Longitude":"-118.485291","map":"<A HREF = \"http://maps.google.com/maps?q=34.025804,+-118.485291(11066)&iwloc=A&hl=en\"> mufon case (11066) map </A>","Latitude":"34.025804","trends":["There have been 20 other sightings in Santa Monica","There were no other sightings in Santa Monica on or around April 22nd 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Summary":"Large TRIANGLE ufo in Santa Monica CA flying in absolute silence","Log Number":"US-06072008-0003","Object Features":"Other"}