{"Viewing Distance":"Unknown","Summary":"I was sitting at a stop sign on I-25 going North-Intersection at Mississippi. A large white oval cloud like phenomenon came in from the South flying Northwest toward Boulder, zoomed through the sky moving.","files":["/var/www/straped/mufon/html2text/11075.html.txt","/var/www/straped/mufon/org/11075.html"],"Date Submitted":"05/31/1956 12:00 UTC","Country":"United States","City":"Denver","Disposition":"Unknown","Case Number":"11075","Latitude":"39.740934","map":"<A HREF = \"http://maps.google.com/maps?q=39.740934,+-104.976373(11075)&iwloc=A&hl=en\"> mufon case (11075) map </A>","Log Number":"US-06072008-0012","Region":"Colorado","Date of the Event":"05/31/1956 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 31st 1956"],"Longitude":"-104.976373","Object Features":"Unknown","divs":["Sighting DetailsI was sitting in my car on a warm summer night in the summer maybe June 1955 or 1956. I was facing North on Santa Fe Drive, and stopped at a stop sign atthe Mississippi intersection. For some reason I looked up, and a huge egg shaped like cloud thing on my left side, zoomed through the sky, climbing as it went. It came in from the South and went Northwest toward Boulder. It was completely silent. It was in view long enough that I tried to get the attention of the car stopped next to me, to tell them to look. It was big, maybe 500 feet wide, white and going so fast it was like it was an enlongated sphere and I would estimate it was up there 1000 feet or more when it passed my line of visionand then it climbed going very fast(in traversed the entire front range in seconds), very high, and then disappeared in the distance. Within seconds of the phenomenon passing through the airspace along the front range, (I was still sitting at the light)two fast jets came in from the same direction the disc had come, appearing to be in pursuit. I thought it was a UFO. I had no particular reaction to the sighting. I didn't feel threatened by it. I was delighted that I had observed this strange phenomenon. I did think about the fact that it appeared the disc was chased by the military, but felt it was extraterrestial not something from the Russians. No pictures available."],"Object Shape":"Egg, Oval, Sphere","Tags":"City"}