{"Date Submitted":"01/01/2008 01:00 UTC","Weather Factors":"Unknown","Region":"California","Log Number":"US-06072008-0013","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"11076","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Other","trends":["There have been 5 other sightings in Carson","There were no other sightings in Carson on or around January 1st 2008"],"Latitude":"33.835256","divs":["Sighting DetailsI was on the Porch on Jan. 1 2008 and I was on the phone and I noticed a Black looking thing in the sky it looked and I know this might sound strange but it looked just like the Moon Lunar Lander and it was just in one spot staying there. And I thought what is that? So I walked to the and of my lawn and there was a telephone pole and I seen it from the other side of the pole (It still didn't move I did) so I thought and said to the person on the phone \"DAMN that's a UFO I got to get my camera\" and I Ran to the house and got my Camera out (20 Feet away) so in less than 10 seconds I was out there but it was gone and it was a clear day and it was just gone. I don't care how fast something can go I should have been able to see where it was going but it just Vanished. I wished I got my camera as soon as I seen it or I stayed outside to see how it took off, dissapeared and what ever happened. I was watching one of those UFO show about a month later and on one of the video clips I seen the SAME thing I seen and I got up and said \"THAT'S IT, THAT's THE SAME THING I SEEN!\" Nicholas PS Please feel free to contact me."],"Disposition":"IFO","City":"Carson","Summary":"It looked just like the Moon Lander but it was Black","map":"<A HREF = \"http://maps.google.com/maps?q=33.835256,+-118.276316(11076)&iwloc=A&hl=en\"> mufon case (11076) map </A>","Object Flight Path":"Stationary,Other","Longitude":"-118.276316","files":["/var/www/straped/mufon/html2text/11076.html.txt","/var/www/straped/mufon/org/11076.html"],"Date of the Event":"01/01/2008 01:00 UTC"}