{"files":["/var/www/straped/mufon/html2text/11077.html.txt","/var/www/straped/mufon/org/11077.html"],"Latitude":"39.953595","Weather Factors":"None","Date of the Event":"06/30/1967 09:00 UTC","Object Flight Path":"Hovering then path","Object Shape":"Flash, Star-like","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around June 30th 1967"],"City":"Philadelphia","Source":"MUFON","divs":["Sighting DetailsMy mom was very strick re being home on time. I had a 9:30pm curfew. I was about a little over a mile from home, and being a fast walker I knew I could cover the distance and be home on time, if not a little early. Taking into account that it was dark, the area was a suburban neighborhood type, heavily populated I was comfortable with the walk. Because it was a beautiful star filled sky and I knew the route well I was just walking and viewing the surroundings as I walked. In looking all around as I walked I noticed, or maybe a better discription would be that a bright light(brighter then the rest of the stars) caught my attention. I looked at it once but kept on walking, then looked at it again when I realized that it had moved very quickly a good distance, up then down. We live close to Philadelphia International Airport, so we were on their flight path depending on the wind direction. So I was aware of the fact that occasionally you could see a very high flying airplane. But this was way beyond the capabilities of an aircraft, especially at the distance it was and the zig-zag pattern it took. Up then down, up, down, up, down, then just zip. It just darted to the right and disappeared, not like it went arount the earth kind of disappeared kind of like maybe it just went further out into the atmosphere out of the visability of my eyes. Sort of like when you see a 'shooting star' the way in enters the atmosphere then exits, similar to that.I looked around to see if anybody was out or sitting on their front steps and saw the same thing I just saw. I felt absolutely almost giddy with the 'I can't believe what I just saw' feeling and the 'nobody will believe this one'. I know what I just saw in the sky. I know what it wasn't. DIDN'T KNOW WHAT IT WAS, but was just dumbstruck with what I just saw. I shared it with my friend when I got home and got teased about it. But if she saw it move the way it did she would have been upset. So, that is my UFO story. I was too young to know who to call to ask if anybody else saw it or reported it. This was back in the mid-sixties. It was a big deal to have a phone on the second floor, let alone have access to 'who do I call to report a UFO' or to ask about it. But I sware everything I just typed is true and accurate. Sincerely, SK Goldberg"],"Log Number":"US-06072008-0013","Region":"Pennsylvania","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Date Submitted":"06/30/1967 09:00 UTC","Object Features":"Unknown","Tags":"City","Summary":"Clear night sky, bright light that moved in zig-zag fashion fashion waaay high in the sky.","Longitude":"-75.159789","map":"<A HREF = \"http://maps.google.com/maps?q=39.953595,+-75.159789(11077)&iwloc=A&hl=en\"> mufon case (11077) map </A>","Case Number":"11077","Sighting Duration":"00:03:00","Country":"United States"}