{"Object Flight Path":"Hovering then path","Object Shape":"Disc, Oval, Sphere","Disposition":"Unknown","Case Number":"11073","files":["/var/www/straped/mufon/html2text/11073.html.txt","/var/www/straped/mufon/org/11073.html"],"City":"Greenwood Village","Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-104.950814","Date of the Event":"11/30/1973 12:00 UTC","Date Submitted":"11/30/1973 12:00 UTC","Log Number":"US-06072008-0010","divs":["sighting detailsi had been out on a small deck off the master bedroom which was on the top floor of our tri-level house in greenwood village, that was set on a high slope in orchard hills. i had been sweeping gravel off the upper deck that had blown down from the roof.i had stepped just inside the sliding doors, and looked back outside at the view which faced south and west. you could see the entire south\\west range of the mountains and the open space from the house to i-25 from there at that time, as the denver tech was not yet developed. it is in the afternoon, broad daylight, i was home alone, no witnesses. there was nothing but a beautiful day out there, and then suddenly, a ship just appeared, right in front of me. it was out in front and a little to the right of me maybe 500 feet, and i would estimate approximately 150 -200 feet from the ground. i am stunned, standing there holding my broom. it was huge,(width estimate -300-400 feet wide or more; depth 50-75 feet in height) grey,metallic, and completely still. it may have been there for 30 secs or more, and then it vanished just as quickly and in the same manner as it appeared. it didn't fly off -it just disappeared. it was real and solid appearing. after that, my opinion concerning the origins of ufos changed, to thinking that perhaps they were not from outer space, but were from another dimension, perhaps time travelers, or that they had a cloaking device and therefore could be hovering over us all the time, without being noticed. i had no camera and we didn't have cell phones then, and it was all over so quickly that there would not have been time to get any picture anyway. there was no organization to report it to. the only people i have told about it have been my children and my sister. i didn't tell my children until they were grown. this occurred in about 1974. i don't recall the exact time."],"Sighting Duration":"Undisclosed","Summary":"Large metallic grey disc stationary manifested before my eyes directly in front of me low in the sky, maybe 500 feet in front of me.","trends":["There have been 2 other sightings in Greenwood Village","There were no other sightings in Greenwood Village on or around November 30th 1973"],"Weather Factors":"None","Country":"United States","Latitude":"39.61721","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.61721,+-104.950814(11073)&iwloc=A&hl=en\"> mufon case (11073) map </A>","Object Features":"None","Region":"Colorado"}