{"Latitude":"32.695261","divs":["Sighting DetailsAbout a month and a half after the Wacco Texas Compound incident is when this took place. My uncle lived in a trailer park just off the side of a Marine Fighter base. We would walk down a dirt road to the end of the AOA area to watch the planes. We especially enjoyed watching them do touch and goes after dark. This was because the f-16's had bright green lights on their tail fins. On the last night we were in Yuma, we stood on a dirt hill at the end of the base's runway. It was around 9pm when the last of the fighters took off. This time when they disappeared over the horizon, they never returned. After about 30 minutes of no aircraft activity on the base, we got bored and left. On the way back to the trailer park I just happened to look up to admire the stars. When I looked up, I could only see darkness. At first I wondered if some clouds had rolled in without us noticing them. So I began to look out past the dark spot to see how far the cloud cover reached. It was at that moment that I noticed there were star visible all around the dark spot in the sky. Confused I began to study the dark spot. It was then that I noticed that the object had a long striaght leading edge. I could tell, because the stars above were disappearing under these leading edges at an equal rate of speed. Then out of the corner of my eye I noticed a flash. I looked toward the tiny flash and it went off again. It reminded me of an airplane becon. Next I followed the leading edge of the wing forward until I noticed a tiny white light at the nose. The light was constantly on, just very hard to detect with the naked eye. It looked like all the other stars in the sky. I then followed the leading edge of the wing down the opposite side of the craft. At a great distance away, I spotted another tiny green strobe light. Standing back I looked from one strobe light to the other. Then I followed those lights up to the tiny light in the nose area of the craft. The vehicle was huge. I estimated about a football feilds length from wing tip to wing tip. Perhaps half a football feilds length from the back of the craft to the tiny nose light. I couldn't believe how large the craft was! The craft moved at a very low rate of speed. It almost seemed to have a hover capability. I stopped walking to listen to see if the object made any noise. I heard a very quite blowing sound. It reminded me of a fighter plan idleing on the taxi-way. The exception was that it was barely audible. We watch the craft float slowly over the edge of Yuma and then disappear into the darkness. The whole event took about 3 minutes time. I always assumed that this was a military aircraft. I could clearly see the Marine Fighter Base's airtraffic control tower from where I was at the time. I figured if I could see the tower, then the tower could see the object. Since there was no activity on the base at the time, I figured they knew about it. A military fighter base wouldn't let such a large object float past the end of their runway and do nothing. Then last year I was listening to the Art Bell show on Coast to Coast Am. On that show a guest called in from Arizonia. The guest exactly discribed the same craft that I had seen. This brought up the whole discussion of the famous \"Arizonia Lights.\" After hearing several stories about this large triangle type craft I decided to contact you. Is this a military craft being secretly tested at night? What is your take on this incident? Ps. I am an airshow fan and love all sorts of military aircraft. I've seen alot of planes in action, but nothing I've ever seen or heard came close to this craft and it capabilities..."],"Region":"Arizona","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Shape":"Triangle","City":"Yuma","map":"<A HREF = \"http://maps.google.com/maps?q=32.695261,+-114.626672(11071)&iwloc=A&hl=en\"> mufon case (11071) map </A>","files":["/var/www/straped/mufon/html2text/11071.html.txt","/var/www/straped/mufon/org/11071.html"],"Date Submitted":"11/30/1992 12:00 UTC","Object Features":"Wings","Source":"MUFON","Case Number":"11071","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around November 30th 1992"],"Summary":"Triangle Shaped craft-football field sized wing to wing...","Longitude":"-114.626672","Country":"United States","Log Number":"US-06072008-0008","Object Flight Path":"Straight-line path","Date of the Event":"11/30/1992 12:00 UTC","Viewing Distance":"20 Feet or Less","Weather Factors":"None","Tags":"City"}