{"Object Flight Path":"Straight-line path","Date of the Event":"08/31/2003 09:20 UTC","Object Features":"None, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.391922,+-111.970408(11080)&iwloc=A&hl=en\"> mufon case (11080) map </A>","Region":"Arizona","files":["/var/www/straped/mufon/html2text/11080.html.txt","/var/www/straped/mufon/org/11080.html"],"trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around August 31st 2003"],"Log Number":"US-06072008-0016","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"None","Source":"MUFON","Case Number":"11080","City":"Tempe","divs":["Sighting DetailsI may have the exact date on a calendar and wish I knew about this reporting system, tho I wasn't on-line back then. I know it was late summer and time of night I'm exact about! I was floating in my swimming pool when a brightness made me think I was seeing a huge shooting star, for it illuminated the night for a brief moment. Then, it stopped. Stopped! What first appeared to me to be two white triangles very close to one another, but with a space between them, then moved faster than anything on this earth is possible to a position at the same altitude as before (3-? miles up) and covered one-fourth of the sky and stopped again. At this altitude the size of the UFO is about one-fourth the size of a full moon. The color of white was similar to the moon also! It paused again for just about two seconds, and then ascended to the size of a star. It then traversed southernly and looked like a satellite until I lost sight behind a cloud. The entire event lasted only 10 seconds or so, and being Saturday night at 9:20 I expected people to report this! I called a TV station and the Air Force to see if they had any reports or knew how I could report my sighting! I looked in phone directory and only found a place to leave a recorded message which wasn't to my liking. I found you after watching a UFO show on the History channel. Oh yeah, the next day I drew the size of the object on paper and realized it probably was one object, not two, for it showed as a diamond object that was longer than it was high...........like a disc. It would have to be pretty darn big, but I cannot determine the true altitude tho it was higher than the wispy clouds that spotted the sky that night. I knew immediately that I was viewing something special. Some anxiety followed as some friends totally accepted and some laughed about what I must've been smoking!! I'm really looking for confirmation, that maybe, someone else has made a similar report. Thanks."],"Disposition":"Unknown","Object Shape":"Diamond, Triangle","Sighting Duration":"00:00:10","Longitude":"-111.970408","Summary":"Entered atmosphere and stopped.....moved at same altitude in a flash to stop again...then moved straight up until star size.","Latitude":"33.391922","Date Submitted":"08/31/2003 09:20 UTC"}