{"Object Flight Path":"Unknown","Object Features":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/11082.html.txt","/var/www/straped/mufon/more/11082_submitter_file1__SkywayUFO.jpg","/var/www/straped/mufon/more/11082_submitter_file2__SkywayDistance.jpg","/var/www/straped/mufon/org/11082.html"],"divs":["sighting detailswe took our dog to emerson point, a park w\\ trails and an outlook at the east end of palmetto, fl on tampa bay at the mouth of the manatee river. it was probably around 10 am or so. my husband loves taking scenic photos and snapped some shots from the top of the newly constructed overlook tower. from the top of the tower you can see many waters including tampa bay, terra ceia bay and the gulf of mexico. it offers great views of the sunshine skyway bridge and eggmont key. on that day we didn't notice anything. it would be accurate to say that our focus was on the bridge itsself, not the surrounding sky, so we never observed the objects while we were there. sometime later, when the photos were uploaded onto our computer and viewed, we noticed what looks like 2 round spheres in the sky to the left of the bridge. we have no guess as to what they are. there were a number of photos taken during our outing, but this is the only photo with the appearance of orbs. the photos were taken with a konica minolta maxxum 5d digital camera with a quantaray mx af zoom lens. (1:4~5:6 f=70~210mm) i am including said picture as well as another taken from the same location of the same area, just not zoomed in as far as the photo in question."],"Tags":"City","Region":"Florida","Case Number":"11082","Sighting Duration":"Undisclosed","Date of the Event":"09/11/2006 12:00 UTC","Object Shape":"Sphere","Latitude":"27.521427","City":"Palmetto","Source":"MUFON","Longitude":"-82.572319","trends":["There has been one other sighting in Palmetto","There were no other sightings in Palmetto on or around September 11th 2006","This sighting has never been favorited.",""],"Weather Factors":"None","Log Number":"US-06072008-0018","Viewing Distance":"Over One Mile","Disposition":"IFO","Summary":"Photo of 2 spheres over Tampa Bay/Sunshine Skyway Bridge","Date Submitted":"09/11/2006 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.521427,+-82.572319(11082)&iwloc=A&hl=en\"> mufon case (11082) map </A>"}