{"Date Submitted":"03/15/2008 10:30 UTC","Tags":"City","City":"York","Latitude":"39.964548","Log Number":"US-06072008-0024","Case Number":"11087","Summary":"Silent, no lights, moving black triangular form blocking out background stars.","Sighting Duration":"Undisclosed","Country":"United States","Region":"Pennsylvania","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11087.html.txt","/var/www/straped/mufon/org/11087.html"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI recently viewed the movie \"Phoenix Lights\" and was reminded of something I had personally viewed a few months ago. The description of the \"triangular light formation\" as portrayed above Phoenix sounds almost identical to what I viewed in the sky above my residence in East York, PA. The night was crystal clear. At night on our back patio, I often gaze skyward in admiration of the cosmos. On this particular evening I remeber being struck my the sheer \"silence\" that made this instance seem different than others. The absence of aircraft engine noise, whether by Doppler or more directly audible line, was most telling. What initially caught my eye was what appeared to be the \"blotting out\" of background starlight in a distinctly triangular and slowly moving shape in the direction of due east. I had the impression that whatever it was that I saw was virtually, immediately, and closely overhead, not some \"far off\", \"vague\", or \"remote\" optical illusion or imagined bit of \"wishful thinking\". Again, I made a mental notation of \"double-checking\" what I was viewing in real time by waiting and listening for a delayed, audible engine noise as is normally heard moments after an aircraft passes overhead. The shape was moving so slowly that common sense told me that there was no visible traditional means of propulsion. Initially, I saw no point in reporting what I saw since I knew it would be out of eyesight within a matter of minutes, based on the perceived speed of the shape's movement and my angle of viewing. This \"black triangular formation\" was somewhat \"picture framed\" between a pair of trees, giving me a sense of scale and scope. I finally lost sight of the moving shape as it passed out of my field of view beyond the easternmost of the two trees. The event described in \"Phoenix Lights\" is literally identical to what I viewed WITHOUT the \"yellow orbs\"...the triangular \"blocking out\" of the existent starlight in a \"silhouette\" fashion resembles witness perception as conveyed in \"Phoenix Lights\", simply AFTER the Phoenix \"yellow orbs\" switched off. My viewing was approximately 10 years after the dated Phoenix event."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.964548,+-76.723215(11087)&iwloc=A&hl=en\"> mufon case (11087) map </A>","Viewing Distance":"101-500 Feet","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around March 15th 2008"],"Object Features":"None","Date of the Event":"03/15/2008 10:30 UTC","Weather Factors":"None","Source":"MUFON","Object Shape":"Triangle","Longitude":"-76.723215"}