{"Tags":"City","Latitude":"34.029259","Sighting Duration":"00:01:15","City":"Electra","Weather Factors":"None","Region":"Texas","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"11099","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.029259,+-98.918958(11099)&iwloc=A&hl=en\"> mufon case (11099) map </A>","Log Number":"US-06092008-0001","Date Submitted":"06/08/2008 10:15 UTC","divs":["Sighting DetailsEvery night I take my dog outside and give him a cookie when \"he goes to bed.\" Every night for the past several years, I have looked up to the sky, wondering if anything were looking back at me. Tonight I was walking on the patio, under the patio \"roof.\" I came over to the fence and instantly looked up to the sky. I noticed this BRIGHT blue-white light south east of the house. I thought to myself that it was possibly the star Sirius, but dismissed that thought quickly because Sirius is not in the south east right now. I kept my eyes GLUED on the light. It was heading east south east - in the direction of Wichita Falls. I then noticed that the light began to fade. I instantly went over several things in my mind. Was it an airplane? NO. There were no strobing lights, and it was one solid light. Was it a satalite? No. Satalites are nowhere near that bright, and do not move that slowly. Was it a planet? No. The only planet that bright is Venus, and it is not visible this time of day, this time of year. After watching it for about a minute, the light faded away and there were no signs of anything ever being there. I stood in disbelief for several minutes, but I never saw it again. I did however see two airplanes. They seemed to be comercial aircraft. However, there is an Air Force bace in the area. Nevertheless, they did not look similar to what I saw."],"Object Features":"Unknown","trends":["There have been 2 other sightings in Electra","There were no other sightings in Electra on or around June 8th 2008"],"files":["/var/www/straped/mufon/html2text/11099.html.txt","/var/www/straped/mufon/org/11099.html"],"Longitude":"-98.918958","Object Shape":"Star-like","Source":"MUFON","Date of the Event":"06/08/2008 10:15 UTC","Summary":"UFO North Central Texas","Disposition":"IFO"}