{"Disposition":"Hoax","Source":"MUFON","Case Number":"11094","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Parachute","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Details Please note I will be putting some sample pictures in the mail today along with my nerative report of the event, that is dated April 28 2008. Just to for worn you, I havent seen any type of documentation as of yet to come close to compair of what I hold in my mind, as well as the photos and video I have to back it all up. I have been pulling my hair out trying to find a site like this, as I have spoke with a number of news people to hopfully share this rare event with, but of course it is to hard to comprehend, to those who refuse to understand, I have shown family and freinds, all with the same end result, they all were picking up their chins off the floor, just after the first couple pictures I showed. So to all who belive, be ready for some shocking material in the near future. I of course will be expecting to hear from someone from this organization to hopefully get some sort of answers or confirmation of this sighting. PS sorry I didn't post any on your site, I am funny that way when it comes to these darn internet sites, I know how some think these days, it will be copied if they know it pays."],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering,Other","Tags":"City","Country":"United States","Object Shape":"Cigar, Circle, Fireball, Saturn-like, Sphere, Star-like, Unknown","Latitude":"39.451922","Log Number":"US-06082008-0006","Longitude":"-108.052853","Summary":"A dancing light with lots of video and photo back up!!","Region":"Colorado","Date of the Event":"04/28/2008 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.451922,+-108.052853(11094)&iwloc=A&hl=en\"> mufon case (11094) map </A>","City":"Parachute","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11094.html.txt","/var/www/straped/mufon/org/11094.html"],"Date Submitted":"04/28/2008 02:15 UTC"}