{"Country":"United States","Tags":"City","Viewing Distance":"101-500 Feet","Object Shape":"Square, Rectagular","Date Submitted":"06/30/2007 12:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11097.html.txt","/var/www/straped/mufon/org/11097.html"],"Sighting Duration":"Undisclosed","Summary":"Slow-moving, object, low in the sky","Region":"Pennsylvania","Case Number":"11097","trends":["There have been no other sightings in North Charleroi","This sighting has never been favorited."],"Latitude":"40.151183","Weather Factors":"None","City":"North Charleroi","Longitude":"-79.907548","map":"<A HREF = \"http://maps.google.com/maps?q=40.151183,+-79.907548(11097)&iwloc=A&hl=en\"> mufon case (11097) map </A>","Date of the Event":"06/30/2007 12:30 UTC","Disposition":"Unknown","Object Features":"None","Log Number":"US-06082008-0009","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was driving home from work between 12:30am and 1 am. It was summertime and I had the windows down as I was dropping a co-worker off. We had the radio off and were just talking. We crossed the Monesson-Charlerio bridge and I spotted an object in the sky flying over the river. It was slow moving and very low in the sky. I turned to my co-worker and asked, \" what the hell is that?\" He looked at the object and said he had no idea. The object had no lights on it, and was rectangle-shaped. It was no more than 250 feet off the ground. It made no sound as it crawled its way over the river. We remarked it looked like a large coal barge in the sky being pulled by a small object we couldn't see in great detail. My co-worker said, \"It probably a small plane tugging a large plane with engine problems.\" But, I replied, \"that was phyically impossible\" The barge was massive and the small object (\"tug boat\") was quite small. We watched as this duo of objects flew, completely inaudibly, over us and continued over the river. I never had the feeling it was an \"alien craft\". Perhaps, military. But, once again there were no lights, sounds, or markings on the craft. My co-worker then remarked, \"I'll just read about whatever it was in the paper tomorrow.\" I stated, \"it won't be in the paper, tomorrow.\" And it wasn't. Unfortunately, I have no pictures, but I am told that that bridge and the hill around it is known to be a hotspot for sightings."]}