{"map":"<A HREF = \"http://maps.google.com/maps?q=32.941236,+-97.134178(11091)&iwloc=A&hl=en\"> mufon case (11091) map </A>","trends":["There have been 4 other sightings in Southlake","There were no other sightings in Southlake on or around June 7th 2008"],"Weather Factors":"None","divs":["Sighting DetailsI was walking the dog a couple blocks from home and when she stopped to listen to the bullfrogs in a nearby pond, I turned my eyes toward the stars as I often do. I immediately noticed two bright stars about 5-degrees apart in the plane of the ecliptic near the zenith of the sky about 15 degrees Southwest from the star Arcturus. I thought, \"wow, they look like planets. I'll have to check which planets are in proximity tonight in the paper when I get home.\" I gaze up at the stars and planets regularly when I'm out at night, and these two appeared equally bright, maybe magnitude 1 and they didn't strike me as familiar -- but they could have been Saturn and Jupiter I thought. The problem is... as I looked at them, in about 15 seconds, they both just faded away. My kneejerk reaction was that some high stratus clouds had obscured them, but I quickly realized tonight was completely clear. There were no clouds in the sky. And the two objects didn't come back. I was stunned. I squinted at the location... thinking I could see the two stars faintly now, but they were gone. They just faded out. I am a collegiate astrophysics graduate, although I never pursued the discipline afterwards. I don't engage in amateur astronomy and don't have a telescope. But I do look at the sky when I'm outside at night. I've never filed any report before and I've never seen something I couldn't instantly explain. I've seen many satellites, I've seen many meteorites, I recognize the individual planets, usually, and of course, I know all the ways that airplanes can manifest themselves in the sky (we live close to DFW) so I assure you this wasn't any of those. These two stars didn't move or trace any movement. They were there and caught my attention instantly because of their brightness, proximity and the uniqueness of their positioning in the sky -- and then in about 15 seconds they just faded away. I stood there dumbfounded. I looked around the sky, and it's a big sky out here, just to be certain something hadn't 'sneaked by' -- because I couldn't fathom how they could have faded away like that. That's it. I guess I'm filing this in the event that anyone else saw something, because I'd love to know what I saw."],"Date Submitted":"06/07/2008 10:50 UTC","Object Shape":"Star-like","Country":"United States","Tags":"City","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-97.134178","Case Number":"11091","Sighting Duration":"00:00:15","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"Two star/planet-like objects faded from view in night sky -- clear night, no movement, not satellites or plane","files":["/var/www/straped/mufon/html2text/11091.html.txt","/var/www/straped/mufon/org/11091.html"],"Log Number":"US-06082008-0003","Region":"Texas","Date of the Event":"06/07/2008 10:50 UTC","Latitude":"32.941236","City":"Southlake","Disposition":"IFO"}