{"Weather Factors":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11093.html.txt","/var/www/straped/mufon/more/11093_submitter_file1__MN_Sighting5-17-08.jpg","/var/www/straped/mufon/org/11093.html"],"Country":"United States","Source":"MUFON","Date of the Event":"05/17/2008 08:30 UTC","Object Features":"Undisclosed","Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=46.02313,+-92.929956(11093)&iwloc=A&hl=en\"> mufon case (11093) map </A>","City":"Hinckley","Object Shape":"Circle, Star-like, Other","trends":["There have been 3 other sightings in Hinckley","There were no other sightings in Hinckley on or around May 17th 2008","This sighting has never been favorited.",""],"Latitude":"46.02313","Log Number":"US-06082008-0005","Case Number":"11093","Sighting Duration":"Undisclosed","Date Submitted":"05/17/2008 08:30 UTC","divs":["Sighting DetailsMyself and three friends were driving back southbound on Highway 35W in Minnesota after a brief golf outing near Ely, MN. We were approximately 10 or 15 miles north of the town of Hinkley at the time when I spotted three pairs of circular, hollow lights about 20 degrees off the horizon to the south, southwest. Due to thier peculiarity, I watched them for about a minute or so before pointing them out to my buddies. The lights appeared approximately dime-sized at arms length and appeared to be hollow, or what I would describe as glowing rings. Each of the three objects consisted of two of these \"rings\", hovering horizontal to the ground with the middle object slightly above the other two. Our later estimations of the objects' distance ranged from 5 to 15 miles. The four of us observed the object for approximately 1 to 2 minutes before we noticed the far right one veer off slightly in the south eastern direction. We passed under a bridge overpass and one of the objects immediately disappeared in the split-second that our view was obstructed, leaving two objects remaining (two pair of lights). The two remaining objects appeared to be flying directly away from us in the same direction we were heading (south). As they did this, each pair of lights converged to a red dot (from paired white rings), then disappeared in the course of about 5 seconds. It should be noted that we did not have to focus, squint or strain to see the initial rings, they were clearly visible and obvious to us all. Definately not commerical jets or any kind of known miliary formation flight (no blinking lights, very large, independent movement). It was absolutely the strangest thing I have ever seen. The remaining hour+ ride home was spent scanning the skies trying to located them again and confirming with each other on what we had just saw. Truly bizarre....."],"Region":"Minnesota","Tags":"City","Summary":"Three pairs of hollow circles; Morphed to red dots at different intervals, then flew off","Longitude":"-92.929956"}