{"Log Number":"US-06082008-0010","Date of the Event":"06/08/2008 10:00 UTC","divs":["Sighting DetailsMy wife and I were jogging down a street in my neighborhood. We were returning home, heading approximately NNW. I was watching the sky because I'm an amateur astronomer and I'm always looking up. I noticed a bright star-like object just west (about 3 moon diameters) of the bucket of the big dipper. The magnitude was brighter than Saturn, about like Jupiter normally is. There were no strobe lights, no red navigation lights, just bright white light. It looked just like Jupiter but I was pretty sure it was moving so I stopped running to be positive. At this time, I brought it to my wife's attention. She thought it was a plane. I pointed out that it didn't have any other lights but white and there was no sound. For the light to be that bright, we would have heard the plane. She disregarded it, not sharing my interest nor appreciating the unusual nature of the event. I did not. I watched it steadily as it moved in an approximate SSE direction towards the zenith. I have seen satellites before so I know what they look like. This was much, much brighter. I'm not sure how to convey the speed. It traversed approximately 40 degrees of sky in about 20 seconds. But here is where it gets interesting. As it's getting overhead, and off to the west, it starts fading and the color changes to more of a yellow orange. In the period of about 5 seconds, it disappears. The clouds were dark and scattered tonight. I thought that it may have simply passed over cloud so I watched on the trajectory. I could clearly see stars of much lower magnitude in its path, about 5-10 degrees from where it faded away. I deduced that if it were hidden by clouds, I would be able to see it when it reached this area since I could see other stars. It never appeared. I waited much longer than needed at the speed it was going. My feeling is, when the color changed, it was going away from me, up and away, not along an orbit. I kept glancing back on the way home but never saw it again. I did see 2 commercial aircraft pass on different paths. I pointed out the clear distinctions from what we'd seen and the airplanes to my wife. The nav lights and strobe were clearly visible. We also heard the engines on both planes. And all the lights combined were much dimmer than the object I saw."],"Object Features":"None","Case Number":"11098","Source":"MUFON","Latitude":"29.788535","Date Submitted":"06/08/2008 10:00 UTC","Disposition":"Unknown","Sighting Duration":"00:00:30","Weather Factors":"None","Region":"Texas","Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Straight-line path","City":"Katy","map":"<A HREF = \"http://maps.google.com/maps?q=29.788535,+-95.823106(11098)&iwloc=A&hl=en\"> mufon case (11098) map </A>","Tags":"City","Summary":"Observed a bright \"star like\" object cross sky and fade away at zenith","Longitude":"-95.823106","Object Shape":"Star-like","trends":["There have been 21 other sightings in Katy","There were no other sightings in Katy on or around June 8th 2008"],"files":["/var/www/straped/mufon/html2text/11098.html.txt","/var/www/straped/mufon/org/11098.html"]}