{"Object Flight Path":"Stationary","Object Shape":"Square, Rectagular","Country":"United States","Longitude":"-82.396884","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.05918,+-82.396884(11092)&iwloc=A&hl=en\"> mufon case (11092) map </A>","Case Number":"11092","Source":"MUFON","Summary":"Large rectangular craft hovering over high school","Latitude":"40.05918","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around November 15th 1970","This sighting has never been favorited.",""],"Region":"Ohio","files":["/var/www/straped/mufon/html2text/11092.html.txt","/var/www/straped/mufon/org/11092.html"],"Date Submitted":"11/15/1970 08:00 UTC","Log Number":"US-06082008-0004","Object Features":"Unknown","divs":["Sighting DetailsMy mother needed a few things from the store and although we only lived a block from the local market, she didn't like for me to walk there by myself in the dark. So she drove me in the car. When we got to the store, we were able to see up the hill to where our high school and junior high were located. Hovering over the high school, and easily as long as the building, was a large brightly lit craft. From our vantage point it appeared to be rectangular in shape. It was completely lit. On either end, about a sixth of the total length, it was red. The center section was white. The red lights were kind of dimming and then re-brightening at regular intervals. It was about a quarter mile from the store to the school. We watched it for a few minutes and then went inside the building. When we came out 5 minutes later, it was still there. I begged my mom to take me up the hill so I could get a better look at it but she had left the other kids at home and didn't want to be gone too long. So we went home. For some reason, UFOs seemed to have a fascination with that school or maybe it was the hill it stood on. In the fall of 1973, a white cigar shaped UFO was spotted hovering over it every night for almost a month. Unfortunately, I didn't get to see that one as we had moved away by then but frinds told us about it and said that it had been in the local newspaper."],"Weather Factors":"Snow, Light","Date of the Event":"11/15/1970 08:00 UTC","Disposition":"Unknown","City":"Newark","Tags":"City","Sighting Duration":"00:00:00"}