{"Tags":"City","Summary":"Implant","Source":"MUFON","Log Number":"US-06092008-0007","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","City":"Lakeport","Object Shape":"Undisclosed","Case Number":"11105","Region":"California","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Latitude":"39.042951","files":["/var/www/straped/mufon/html2text/11105.html.txt","/var/www/straped/mufon/org/11105.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.042951,+-122.915829(11105)&iwloc=A&hl=en\"> mufon case (11105) map </A>","divs":["Sighting DetailsI've had an object in my left outer calf, approximately 6 \" below the knee that I have been aware of since childhood. Recently I have conduct some tests & discovered that the object is approximately 1\" long, about the diameter of a BB and pocketed between 2 muscles. Further, I have discovered that it is metalic (detected with metal detector), magnetic (magnets stick to my leg along the entire length of the object) and it also affects the needle of a compass. I can manipulate the object nearly to the surface enough to see the size & shape and as soon as I release it it returns back into its pocketed area. It is now throbbing like an ice-cream headache and it seems to be emitting electrical shocks down my leg to my ankle. I am going to remove this thing from my leg immediately, one way or another. I have prepared myself with a scalpel kit & a magnet but am worried about the nerves that might be attached. I have no monetary means to go to a doctor so I'm taking this upon myself to see that this thing comes out. I have vague recollections of being nearly 4 years old and being levitated out of my bedroom window on the second floor of our home. When I was 17 (fall of 1976 - also in Lake County) a friend and I observed a silent UFO (shaped somewhat like a lemon with white, red & green lights that appeared to look like normal landing lights on a very unnormal craft) that hovered for 15 seconds & sped away at unimaginably speed, in an instant. In the fall of 1980 I was living in Furnace Creek Ranch in Death Valley, CA. There, I observed a round glowing orb, bright red & silently traveling down a mountain. My point is: I have seen unexplained events that don't fit the norm and I believe that there may be a connection with this unknown metalic object in my leg. Further, while contemplating where this thing could possibly have come from let me advise that I was quarantined to a state tuberculosis sanitarium for 7 weeks at the age of 5 years old. I did not have the disease & they kept me another week after they had promised my release. While institutionalized, I was subjected to many different kinds of tests. I'm not sure if this implanted object has any connection to that experience but it would be interesting to research to see what became of the other children that were in this state sanitarium in Anderson, CA. The object in my leg has made me conscious of it's presence in a very painful way. I am feeling great distress and paranoia and recently saw a program where Dr. Lier removes implanted objects & studies them. I think I would be a great candidate for your studies & am prepared to have this object removed immediately. I will travel to any location necessary to have this proceedure performed. Please contact me at your earliest convenience, by either phone message or e-mail. Please know that I am being truthful & honest in my report. I need immediate help. I'm really freaking out & it is pounding right now."],"Object Features":"Undisclosed","Date of the Event":"11/30/1962 12:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-122.915829","Date Submitted":"11/30/1962 12:00 UTC","trends":["There have been 4 other sightings in Lakeport","There were no other sightings in Lakeport on or around November 30th 1962"]}