{"Date of the Event":"06/07/2008 09:15 UTC","Object Shape":"Sphere, Star-like, Other","files":["/var/www/straped/mufon/html2text/11109.html.txt","/var/www/straped/mufon/org/11109.html"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.749267,+-119.769126(11109)&iwloc=A&hl=en\"> mufon case (11109) map </A>","Log Number":"US-06092008-0011","Longitude":"-119.769126","Disposition":"Insufficient Data","Source":"MUFON","Date Submitted":"06/07/2008 09:15 UTC","Summary":"Very bright large light moving from west to east, and 2 very bright star like lights dancing in the sky.","Sighting Duration":"Undisclosed","Latitude":"36.749267","Object Flight Path":"Straight-line path,Path then hovering,Other","Object Features":"None","Case Number":"11109","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around June 7th 2008"],"Country":"United States","City":"Fresno","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting Details About 9:10 PM PDT, I left my house to walk my dog. We first went north to the next block( about 150 yrds), at this point I first noticed the bright light in the distance to the west, low on the horizon. It was approaching at a medium pace, about right for an aircraft coming into Fresno Yosemite International Airport. That's what I thought it was at first, and didnt think anything of it. A couple of minutes after we turned east on the next street it passed a little to the north of me. It was big and bright enough to draw my attention again and it was a bright white \"orb\". It was large and somewhat radiant. It was a lot like looking into a high power single headlight, but it was not like looking into a headlight at the same time. As it passed there was no noise, and it passed below a couple other aircraft overhead. And after it passed it didnt change in quality all, not like a plane with its landing lights on. It passed to the east and after it went a few miles a small prop driven plane approached from the south at about 2000'. When they were about a couple of miles apart the light \"went out\". I could hear the prop driven plane faintly, when the light went out it was low enough in the sky to put it close to or below the Sierra Nevada Mtns, 50 miles to the east. I tried to take a video or picture from my camera phone, but it got nothing. I kept my eyes on the sky just in case. A couple of minutes later as we turned south on the next street, I noticed a pair of very bright \"star like\" lights, about 15 degrees south of east and about 30-35 degrees up from the horizon. It was when they moved that I really turned to watch them. After they side slpped in unison to the left a little, they started to orbit around each other as the moved to the north after a few seconds(30 ish) they went from orbiting each other to doing a sort of figure eight for a few loops. Then they stopped dead in the sky and one sped off up and to the south west, while the other semed to receed into the east in about the same direction as the earlier large white light. The sky was clear no clouds but a little hazy(smog) and the moon was already low in the west and was a slim cresent. The sky was pretty busy at the time with a couple of law enforcement helicopters making the rounds of the city and a few airliners passing overhead. They gave me a sort of gage to gage altitude with. The first light appeared to be 5-10,000' and the second pair seemed to be very high, above the cruising altitude of civilian airliners."],"Weather Factors":"Unknown"}