{"Sighting Duration":"00:00:35","trends":["There have been 6 other sightings in Shawnee","There were no other sightings in Shawnee on or around June 7th 2008"],"Disposition":"Unknown","Case Number":"11101","Source":"MUFON","Region":"Kansas","Log Number":"US-06092008-0003","Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Circle","divs":["sighting detailsa friend and i were at an outdoor festival in shawnee, ks (kansas city suburb). as i looked up into the sky, i (and many others) noticed an extremely bright light (circular\\orb) going from tne northwest to the southeast direction. there was no sound at all. this was not a helicopter nor an airplane as the movement of the object was completely straight. the light never changed colors, did not blink or change direction and was completely silent. this was way too low for a satellite or a shooting star. it did not behave like a normal aircraft either. the light was intense and never changed its brightness. usually when an aircraft approaches or moves away, the light will dim, but this was not the case. the light stayed as bright as when we first saw it. this lasted for about 35 seconds and then completely disappeared. i was reluctant to post anything about it, but when i saw these other postings in colorado, texas and illinois, i knew that what we saw was the same thing that was seen in several areas of the country that same evening. if anyone in this area has seen this, please feel free to contact me by email at kfielder39095@everestkc.net."],"City":"Shawnee","Date Submitted":"06/07/2008 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/11101.html.txt","/var/www/straped/mufon/org/11101.html"],"Object Flight Path":"Undisclosed","Latitude":"39.031778","Longitude":"-94.708806","Summary":"Bright Light, NW to SE direction. no sound. Fades away to black","Date of the Event":"06/07/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.031778,+-94.708806(11101)&iwloc=A&hl=en\"> mufon case (11101) map </A>","Viewing Distance":"Unknown","Country":"United States"}