{"Sighting Duration":"Undisclosed","Case Number":"11104","map":"<A HREF = \"http://maps.google.com/maps?q=36.089917,+-93.739413(11104)&iwloc=A&hl=en\"> mufon case (11104) map </A>","Disposition":"Unknown","Object Flight Path":"Straight-line path","Region":"Arkansas","divs":["Sighting DetailsMy daughter's best friend was leaving and was outside telling them good bye. As they left, my daughter asked me to look in the sky above my house. At first, I said it was an airplane, but I noticed no blinking lights. It was very bright. It reminded me of Venus except Venus doesn't move. It was too bright to be a satelite. I told my kids to look because that is no plane. That is a UFO. We were looking toward the East. It moved from left to right. As it moved, it seem to vibrate or shimmy up and down. I am 37 and love to watch the night sky, and I have never seen anything like that. Then it began to fade into an orangish- red color, and it disappeared before our eyes. This was a cloudless night, so I know it didn't go behind a cloud. Later, we went outside and gazed at the sky. I saw many airplanes. They all had those red blinking lights and they seem to move much faster than what I saw. The lights from the airplanes were no that bright. It made no sound. Something that bright would have made a sound if it was a conventional airplane or helicopter. I don't know what it was, so I conclude that it was an unidentified flying object."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11104.html.txt","/var/www/straped/mufon/org/11104.html"],"Latitude":"36.089917","Country":"United States","Date of the Event":"06/07/2008 12:00 UTC","Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-93.739413","Date Submitted":"06/07/2008 12:00 UTC","Log Number":"US-06092008-0006","Object Shape":"Circle","trends":["There has been one other sighting in Huntsville","There were no other sightings in Huntsville on or around June 7th 2008"],"City":"Huntsville","Tags":"City","Weather Factors":"None","Summary":"I looked over my house and saw what looked like a bright star. It was moving across the sky."}