{"Object Shape":"Star-like","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"06/09/2008 08:15 UTC","divs":["sighting detailsthis field investigator was at the home of (anonymous) conducting an investigation on intial sighting of 2005\\29\\11. we got to the subject's house in coolidge, az at 7:18 p.m. we talked about her sightings for about an hour and ten minutes. as we concluded our visit, myself, paul dickey and the subject of our investigation went outside. paul happened to look up and saw a huge bright light over the residence. at first we thought the object might be an aircraft, but it was very low and did not have any blinking lights whatsoever. the object was very large and was about 500 to 1000 ft over the house. it was traveling nw to se, moving slowly. after it had traveled about a mile or two the light went out. no flashing lights were observed. the object was silent. after the bright light went out a residual, very dim light could be observed. this dim light was a bit yellowish in color and took on a round disk-like shape. then the light completely faded out and disappeared from view. the whole event lasted approximately three minutes. i tried to get a picture of the object, but my camera would not work. i had just put new batteries in it recently, so i was surprised that it did not work. we were all very surprised and elated by this sighting."],"Longitude":"-111.514574","files":["/var/www/straped/mufon/html2text/11118.html.txt","/var/www/straped/mufon/org/11118.html"],"Tags":"City","Source":"MUFON","trends":["There have been 4 other sightings in Coolidge","There were 2 other sightings in Coolidge on or around June 9th 2008"],"Date Submitted":"06/09/2008 08:15 UTC","Case Number":"11118","Disposition":"Unknown","Latitude":"32.987579","Country":"United States","Summary":"Huge light over house","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.987579,+-111.514574(11118)&iwloc=A&hl=en\"> mufon case (11118) map </A>","Log Number":"US-06102008-0008","Object Flight Path":"Path with directional change","Object Features":"Unknown","City":"Coolidge","Weather Factors":"None"}