{"Country":"United States","Log Number":"US-06102008-0005","Disposition":"Insufficient Data","Region":"Ohio","Date Submitted":"06/15/1993 11:15 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.607272,+-83.46882(11115)&iwloc=A&hl=en\"> mufon case (11115) map </A>","Weather Factors":"None","Object Features":"Other","Object Shape":"Cone, Square, Rectagular, Triangle","divs":["Sighting Details My girlfriend at the time and myself were returning from Cedar Point on a June night. We were in my new 1992 Ford pick up truck. I was driving and she was in the passenger side, bench seat, single cab truck. I turned off of State Route 2 onto State Route 579 for the last 15-20 mins. of our one hour ride home. Driving east on 579, I noticed what seemed to be a large 'jelly-fish'-pink colored form in the sky. It was above the tree line to my left. I use the word 'form' to describe it because it did not seem to be solid, firm, or structured in a sense. Its bottom was distinct but the sides and top seem to be wavering. I asked my girlfriend if she could see it. Her response was 'yes'. As my truck approached it I slowed down to about 5 mph. I also rolled my window down and told my girlfriend to mark the time. (I remember hearing that people who witness strange things sometimes lose time) Upon rolling my window down I smelled what I recognize as a skunk odor. (I hold no stock in this being fumes from exhaust) I did, however, take notice to see that there was no wind. The object was close enough to the tops of trees that if it was mechanical it's exhaust should be moving the leaves. They were completely still. There also was no sound. I turned all of my lights off and stuck my head out of the window to get the best possible view. At this point, my girlfriend is freaking out and telling me to just go. She was scared. I was still more curious than anything. We were just about parallel to the object. It was roughly 50 ft off the road side and 20 ft above the tree tops. Its size was about 30-40 ft in length. Maybe 10-15 ft tall. Again, the object seemed to be 'alive'. As we came alongside of this it began to solidify. It also began to ascend. By now I am going about 2 mph and my girlfriend is crying. She is yelling at me to turn the lights back on and drive away. I got a view of its underside. The most intriguing thing to me is its underside. I can plainly see three perfect circles on its bottom. One is red, the other is yellow, and the last is blue. And I mean geometrically perfect. The spacing between them is also perfect. They are equally spaced from each other. There are no heat lines (you know, those blurry lines above heat) The next thing I witnessed has had me puzzled since. In fact, I have pondered going public because of all the sighting stories I have heard, none match our encounter. I can see that the object has 'morphed' into a triangular shape. It now seems to be solid; metallic. The whole thing has changed it molecular structure!!! The now triangular, gray object just takes off. I mean at a speed that is greater that what I can describe. It seems as though it was not bound by our physics. It almost seemed as though it manipulated the immediate surrounding atmospheric restraints and just left. I basically watched it leave our planet. As I a pieced my girlfriend, turned my lights back on, and began to resume the speed limit I noticed it was now no more different in sight than a star! The ascend took no more than 3-5 seconds! When I got home, I called two local television stations to ask if they had any weather balloons out that way. Their response was \"No\". My girlfriend and I have since broke up and she has found religion. When I asked her how she justifies what we saw as being unexplainable, her response was; 'I don't know'. Her and I do have two children together, so we do still talk. She has not acknowledged it since. I have told our children and they believe me as I have never had a reason to make anything like this up."],"Date of the Event":"06/15/1993 11:15 UTC","Case Number":"11115","Latitude":"41.607272","Summary":"Drove up on, along side, and past an unidentified flying object.","Sighting Duration":"00:02:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11115.html.txt","/var/www/straped/mufon/org/11115.html"],"trends":["There have been no other sightings in Northwood","This sighting has never been favorited."],"Longitude":"-83.46882","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Northwood"}