{"Summary":"Cigar shaped craft flat gray color with a dark band midway without wings flying at high altitude maybe towing another craft or part of the same craft could be seen clear a day no lights, vapor or sound","Latitude":"42.119444","Country":"United States","Case Number":"11119","Region":"Massachusetts","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.119444,+-71.325556(11119)&iwloc=A&hl=en\"> mufon case (11119) map </A>","Tags":"City","Weather Factors":"Unknown","Date of the Event":"06/09/2008 11:00 UTC","City":"Norfolk","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Norfolk","This sighting has never been favorited."],"divs":["Sighting DetailsI was with my dog in back yard watering my flowers and hear a long protracted engine sound and I looked up and around and saw nothing flying. I went on to water and just quickly glimpsed up and saw what looked like a passenger aircraft without windows with a black band about halfway down if it was just one craft. If it was pulling another craft about the same size it would have had the band at end of craft. after the band was a break in the line but seemed to still be attached a cigar shaped craft without wings that didn't have a black band. The craft was very high but I could see clearly that there was a change in the line of the craft after the black band. Could it be a shuttle that the wings were not easily seen ? absolutly no wings at all. could see that clearly. It was traveling from northeast toward Southwest I had hoped the teenagers next door who came out a few minutes later may have seen something. They didn't. How can I investigate what this could be. I have made a scketch of the aircraft. It had to be huge! It was far away and was so clear. My first thought was it was a HUGE PASSENGER PLANE without windows flying that high and I can see it this clearly someone else must have seen it, it was travling slow enough at that distance that it should have been in my view for at least 30 more seconds I looked down to see where my phone was and looked up and was gone in 2 seconds or less. I can still see it in my minds eye and would love to see it again. I am not crazy. I know what I saw but don't know what it is."],"Object Shape":"Cigar","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/11119.html.txt","/var/www/straped/mufon/more/11119_submitter_file1__UFOScketch015.jpg","/var/www/straped/mufon/more/11119_submitter_file2__scan0004.jpg","/var/www/straped/mufon/org/11119.html"],"Longitude":"-71.325556","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Undisclosed","Log Number":"US-06102008-0009","Date Submitted":"06/09/2008 11:00 UTC"}