{"Region":"Pennsylvania","City":"Altoona","Source":"MUFON","Object Features":"Other","trends":["There have been 20 other sightings in Altoona","There were no other sightings in Altoona on or around June 7th 2008","This sighting has never been favorited.",""],"Summary":"Spotted a very bright light , it disappeared and reappeared into vortex expelling balls, then a morphing/cloaking thing,it disappered then reappeared as a light ball travelled east","files":["/var/www/straped/mufon/html2text/11116.html.txt","/var/www/straped/mufon/org/11116.html"],"Country":"United States","Date of the Event":"06/07/2008 07:00 UTC","divs":["sighting detailsjune 7, 2008. i was outside with my children. we were on the upper deck of my house, noticing the crecent moon. suddenly a very bright light caught my and my sons eye at the same time, the night before at about the same time we saw the same bright light and it disappeared before i could get my camera. however this evening i ran in the house and grabbed my camera. returning outside the light was gone and my son insisted it was still in the sky and was pointing. i began video tapping and gave him the camera to tape it because i couldn't see it. we both noticed what appeared to be smoke,it was a grey color, travelling across the sky. it appeared to be flying. we taped on and off. the 'smoke' looked like it had 2 dark spots with a more transparent middle. it moved across the sky and stopped, it turned and looked like a triangle shape on a diagonal.. or like a slash\\line.. it appeared to be a vortex on an angle. it was spinning with faint lights or bits flying off. my son described them as sparkles. it did this for a long time and started reforming into a wider triangular\\diamond square shape and looked was larger. it was constantly changing shape and looked like it was fading in and out of the sky..like cloaking parts of it would blend in and reappear but some portion of it remained visible the entire time. eventually it faded completely. about 5 minutes later we spotted a ball of very bright light in the same area i taped it travelling above my house, across our city and over the mountain. i wasn't scared, just very curious and struck with wonder. when i first saw it i thought it was a ufo, since we had seen the same light ball in the same place the prior evening.i have attached a video with all the video clips from the evening. i replaced the audio in this upload, if you need the original audio, i can email the original video with audio intact."],"Longitude":"-78.393736","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Case Number":"11116","Viewing Distance":"101-500 Feet","Disposition":"IFO","Object Shape":"Boomerang, Cigar, Chevron, Circle, Diamond, Square, Rectagular, Star-like, Triangle, Other","Log Number":"US-06102008-0006","Weather Factors":"None","Date Submitted":"06/07/2008 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.522231,+-78.393736(11116)&iwloc=A&hl=en\"> mufon case (11116) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"40.522231"}