{"divs":["Sighting DetailsHello. Event was that of hundreds of halo discs from west to east over 30+ mins in the Reisterstown, Maryland. My recollection was mid 1970's (maybe 1975??). My father, brother, close family friend were there. They were recently talking about it, and I had no recollection or memory of ever thinking about it. However after some thought, I began to remember that evening and looking up into the early evening sky and WAS then able to recall this event. Over the above mentioned area, it was a early evening, sunny sky and recall watching these discs for atleast 30 minutes. 100's of them - some in clusters, others individually. It went on so long, I recall them saying we got board and began playing frisbee and with the dog again as these discs continued to come from the southwest to the northeast. Any others reporting this in the Reisterstown, Maryland from that period?? There were 100's of these disc's clearly visible to the naked eye - guessing others saw it. I would love to get in touch with anyone who saw this too. Andrew mdequipco@aol.com"],"Summary":"Hundreds of halo discs from west to east over 30+ mins - Reisterstown, Maryland","Case Number":"11122","files":["/var/www/straped/mufon/html2text/11122.html.txt","/var/www/straped/mufon/org/11122.html"],"Date Submitted":"11/30/1974 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","trends":["There has been one other sighting in Reisterstown","There were no other sightings in Reisterstown on or around November 30th 1974"],"City":"Reisterstown","Date of the Event":"11/30/1974 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","Latitude":"39.469549","Object Shape":"Undisclosed","Log Number":"US-06102008-0012","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.469549,+-76.829421(11122)&iwloc=A&hl=en\"> mufon case (11122) map </A>","Longitude":"-76.829421","Disposition":"Unknown","Region":"Maryland"}