{"Tags":"City","Source":"MUFON","Object Shape":"Star-like","Disposition":"Unknown","Longitude":"-95.348564","Weather Factors":"Unknown","Case Number":"11136","Country":"United States","Summary":"Bright star moving around all over the place - at times looked like two it jetted around so quick. Changed from bright to dim over and over (pulsating or light revolving).","Object Flight Path":"Undisclosed","Log Number":"US-06122008-0004","Latitude":"32.204044","City":"Flint","Date of the Event":"06/12/2008 12:30 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.204044,+-95.348564(11136)&iwloc=A&hl=en\"> mufon case (11136) map </A>","Region":"Texas","files":["/var/www/straped/mufon/html2text/11136.html.txt","/var/www/straped/mufon/org/11136.html"],"divs":["Sighting DetailsI was watching TV because I couldn't sleep and we live on the lake and have big windows facing the lake. I usually see nothing in the sky because we have a number of trees in the yard. But tonight I couldn't help but notice this bright star looking light. It caught my attention because I had never noticed it before. I got up and went to the window and looked closer and could swear it was getting bigger as if it were coming my direction and it was pulsating. I went outside for a better look, but the trees were blocking my view. I decided to just go back to my show and take a gander every once in a while to see if I could tell for sure it was moving. I could. So, to be sure my eyes were not playing tricks on me, I laid my head against the back of the sofa in a crack and placed one hand over one eye and used a point of reference (shingles). My eyes were not playing tricks on me, after a while that was very apparent. It is still out there but now it has moved up down and left shining through 3 separate windows and once I knew for sure it was not my eyes playing tricks I haven't moved until I got up to report this. I noticed it at 11:40 am and got up to report this at 12:45 am."],"Date Submitted":"06/12/2008 12:30 UTC","Sighting Duration":"01:00:00","trends":["There has been one other sighting in Flint","There were no other sightings in Flint on or around June 12th 2008"],"Object Features":"Undisclosed"}