{"Latitude":"29.765593","Object Flight Path":"Undisclosed","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around June 11th 2008"],"Tags":"City","Log Number":"US-06122008-0005","Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAt about 10:45pm on June 11, 2008, I looked out of the window and saw what appeared to be a blinking star. I was right in the middle of Houston looking east. The light didn't look hazy as if it were blinking because of clouds passing by, it continued to look bright. I also noticed it seemed to be changing color. I asked my brother and my girlfriend to come out to see it, and everybody, including me, thought it could have possibly been the lights on an airplane. But as time went by, maybe 5 min or so later, the lights were in the same approximate point in the sky and also didn't seem to be any closer. Also, it didn't look to be clear red and green, it looked like a mixture of colors, constantly changing. We got some very cheap binoculars. I looked at it again, and this time we could see a little better. I couldn't see what the light was, but I could definitely see that it was moving very fast. It didn't seem to be traveling anywhere, it looked like it was doing all kinds of crazy patterns in the air, never leaving the same area. And it definitely wasn't just red and green, it was changing colors like crazy, every color imaginable. We all saw it for at least 20 min, I can only say that long because I was leaving, but it was still in the same place in the sky when I left, so I really don't know if or when it went away. I can't see the sky in that direction from my apartment."],"Date of the Event":"06/11/2008 10:45 UTC","Weather Factors":"Unknown","Country":"United States","Object Shape":"Star-like","Summary":"Distant light(s) dancing around weird patterns, changing color","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11137.html.txt","/var/www/straped/mufon/org/11137.html"],"Region":"Texas","Case Number":"11137","map":"<A HREF = \"http://maps.google.com/maps?q=29.765593,+-95.36074(11137)&iwloc=A&hl=en\"> mufon case (11137) map </A>","Longitude":"-95.36074","Date Submitted":"06/11/2008 10:45 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Houston"}