{"divs":["Sighting Detailswas camping with friends at a campground. We were sitting at the campfire and I was relating to my friends about the UFO's I had witnessed in the past. Soon after that the object was sighted by myself and my friends. Object was bright white light in an oval shape moving rapidly, low on the horizon. Made no noise. was first event of the night. I saw another UFO early Monday morning. I was lying in my tent alone. The top of my tent is screened in so I could look at the sky why lying in bed. I could hear a few other campers talking softly to one another. All of a sudden I heard a strange noise. It was a rattling type noise, but wasn't a jet, or a proppeller. I knew what it was before I could see it. I knew it wasn't normal. I listened to hear if the other campers could hear or see it. No one made any mention of it. They probably dismissed it as an airplane or helicopter. Most campers were asleep at that point. I estimate that this was happening between 4 and 5 in the morning. The craft finally flew over me. I could see its lights through the leaves of the trees. It flew very slowly over my location. The lights were in a cross formation. Even though I could not see the actual craft I knew the lights were all connected to the same thing. The lights were large and colored. I can't say for certain the exact colors. I have never seen an aircraft that large, with the same light configuration, flying that low and slow to the ground, and making that rattling noise. The strangest thing is that I knew I would see them that night. I'm not sure how, but I frequently experience such things. I'm glad I wasn't the only one that saw the first UFO. Many of my friends get uneasy when I talk about such things."],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Insufficient Data","Date Submitted":"05/25/2008 10:30 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/11135.html.txt","/var/www/straped/mufon/org/11135.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.210946,+-86.243794(11135)&iwloc=A&hl=en\"> mufon case (11135) map </A>","Case Number":"11135","Summary":"was camping w/ friends","Region":"Indiana","Longitude":"-86.243794","Sighting Duration":"Undisclosed","Date of the Event":"05/25/2008 10:30 UTC","Latitude":"39.210946","Source":"MUFON","Log Number":"US-06122008-0003","Tags":"City","City":"Nashville","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Object Shape":"Oval","trends":["There have been 2 other sightings in Nashville","There were no other sightings in Nashville on or around May 25th 2008"],"Country":"United States"}