{"Object Shape":"Disc","Date of the Event":"06/14/1967 10:10 UTC","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsI've been wanting to share this experience for a very long time but have been reluctant to do so until I came across this forum. In 1967 my father, mother, baby sister; and me were returning from visiting an uncle in the Soundview section of the Bronx. As we walked east on the westbound side of Bruckner Blvd. and approached the intersection of Beach Ave. and Bruckner Blvd. we saw people looking out and up from the apartment building on the west side of Beach Ave. They were pointing up. My family and I looked up and saw a disc shaped object glimmering gold and silver in color spanning approximately 90 feet in width across the blvd. The object was approximately 80feet high in the air and the top half of the object was spinning slowly in a clockwise direction while the bottom half appeared to be ratcheting in the opposite direction. The center of the object was surrounded by a series of large round lights that rotated clockwise while changing from red to green to blue to white. I stood almost directly underneath the object and looking up I marveled at the magnificent colors and under-structure of this object. The underneath was a maze of complex piping and components that I have to be honest I could not even begin to describe in a manner that would make any sense. The object was completely silent. After watching this object for approximately ten minutes or so my father seemed to suddenly get spooked and called to me to move away from the object and we continued to walk towards our home. I looked back, my perspective now from north to south on Beach Ave., and saw that there were large arched shaped (what appeared to be) ports or windows on the very top of the object. As we walked further away I felt a strange sense of attraction coming from the object almost as if it were somehow ever so slightly pulling me back. Needless to say that experience more than 40 years ago left me hoping, to no avail, that I would see it once again."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.717803,+-74.004753(11147)&iwloc=A&hl=en\"> mufon case (11147) map </A>","City":"New York","Log Number":"US-06132008-0003","Region":"New York","Object Features":"Undisclosed","Disposition":"Unresolved","Latitude":"40.717803","Date Submitted":"06/14/1967 10:10 UTC","files":["/var/www/straped/mufon/html2text/11147.html.txt","/var/www/straped/mufon/org/11147.html"],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 14th 1967"],"Tags":"City","Sighting Duration":"00:12:15","Country":"United States","Summary":"Disc hovering over Bruckner Boulevard in NYC","Longitude":"-74.004753","Weather Factors":"Unknown","Case Number":"11147","Object Flight Path":"Undisclosed"}