{"Source":"MUFON","Region":"Texas","Object Shape":"Sphere","Weather Factors":"Unknown","divs":["Sighting DetailsI felt a prompting within myself to open the front door and take a look at the night and sky. At first, I wasn't going to because I'd done that just before I'd eaten, about 20 min. before. It's not unusual for me to go out and look at the sky, moon, stars, etc before bed. But the prompting was there. I opened the door without turning on porch light, so I could see more. I stepped the maybe 7' from my door to the yard. I realized a brilliant (like a diamond bright) small ball of light was headed right to me from my right side. I had been obscured by a thick privet bush until I stepped past it to yard from patio. The light hesitated, with a slight dip downward, right in front of me,(as if \"it\" saw me)! I felt life from it, not machine, by the way... ...my face upturned in awe..it was only a couple of feet from me and about 2' above my head...then it zoomed upwards a few feet higher and streaked toward the large tree to my left...I walked further out to see if I could see it still moving somewhere, but I couldn't. I ask out loud, God, what was that? Maybe there really are fairies, after all? People, I'm 59, not prone to hysteria, and have never experienced anything like this before. There is no creature could look and move like that...unless it was some kind of angel hurrying on a mission! hehehe I was not afraid. Has anyone else ever experienced tiny balls of brilliant light that sparkled like diamonds? It moved so smoothly and no sound at all. I felt I experienced a great mystery. I also sensed that I wasn't \"supposed\" to have seen this. I live on an extremely dark farm market road way out in the country where there are no city lights to interfere with sky-viewing. Another thing I noticed was that before this happened and I went outside, the neighbor's outside dog was barking, but whining as she kinda barked. Weird. When I went out, my dog came also, and he looked up also and saw it, but he seemed worried and confused."],"Country":"United States","Viewing Distance":"20 Feet or Less","Sighting Duration":"00:00:06","City":"Sulphur Springs","Summary":"one brilliant light streaked right in front of me from E, 2' above my head level and dipped, then continued to streak a bit higher toward W where a tree is, in total silence","Case Number":"11146","Object Flight Path":"Other","Longitude":"-95.600007","files":["/var/www/straped/mufon/html2text/11146.html.txt","/var/www/straped/mufon/org/11146.html"],"trends":["There have been 3 other sightings in Sulphur Springs","There were no other sightings in Sulphur Springs on or around June 12th 2008"],"Date Submitted":"06/12/2008 10:30 UTC","Date of the Event":"06/12/2008 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.147968,+-95.600007(11146)&iwloc=A&hl=en\"> mufon case (11146) map </A>","Latitude":"33.147968","Tags":"City","Disposition":"Hoax","Object Features":"None","Log Number":"US-06132008-0002"}