{"Longitude":"-86.130833","files":["/var/www/straped/mufon/html2text/11145.html.txt","/var/www/straped/mufon/org/11145.html"],"Weather Factors":"Unknown","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around January 31st 2004","This sighting has never been favorited.",""],"City":"Kokomo","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Tags":"City","Object Features":"Undisclosed","Date of the Event":"01/31/2004 12:00 UTC","Region":"Indiana","Summary":"Flying Triangle over Kokomo","Source":"MUFON","Case Number":"11145","map":"<A HREF = \"http://maps.google.com/maps?q=40.494337,+-86.130833(11145)&iwloc=A&hl=en\"> mufon case (11145) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Latitude":"40.494337","Date Submitted":"01/31/2004 12:00 UTC","divs":["Sighting DetailsI can't remember the date exactly, I just know that it was in the beginning of 2004. I remember that because I was living with my grandmother at the time. I was home with her and I was finishing my business in the bathroom when I heard her yell for me. I ran to her screened in porch panicked because I thought she had fallen or something. When I got to the porch she was standing at the front door looking up. Puzzled I walked over to her and she pointed into the sky and asked, \"whats that?\" I looked up and to my amazement I saw a triangle shape craft with the tips squared off. There were lights on each tip and in the middle was a glowing light. The colors from this light were amazing. In fact they were hypnotic because the colors were almost irredescent except that it wasn't. It is hard to describe. They were distinct colors and yet they weren't. The craft flew over her house on the north side of kokomo. I couldn't believe no one else was outside seeing this. The sun was setting for the day since it was still winter but it was bright enough so that i could see that the craft was a dark grey color. Almost like the color of gun metal. The craft also emitted a hum. Like an electrical hum. It sounded like high voltage power lines except a little louder. I finally answered her and said,\" Granny thats a UFO\". She said, \"thats what I thought it was.\" We have talked about it several times since then. We have told our family and they of course roll their eyes at us. I'd love to know if someone else saw this thing in the winter of 2004 over Kokomo. I'm going to upload a picture I found from another UFO sight because it is exactly what I saw, except without the lights. The shape of the craft is exactly like the one we say though."],"Country":"United States","Object Shape":"Triangle","Log Number":"US-06132008-0001"}