{"Object Features":"Unknown","Latitude":"39.102646","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 7th 2008","This sighting has never been favorited.",""],"Disposition":"IFO","Source":"MUFON","divs":["sighting detailsmy husband, our roommate and i were at a concert at the starlight theatre, an outdoor venue in kansas city. the show had been going for awhile and dusk was approaching. it was a mostly clear night, with some sparse clouds that would pass over occasionally. during one of the songs, i glanced up (as i am always trying to watch the sky) and noticed a bright white light that resembled the shape or appearance of a star, but was most definitely within our atmosphere. i nudged my roommate so he would look up and see it. my husband was away from his seat at the time. we watched it pass over us, beginning at my right and moving to my left. (i am unfamiliar with which direction we faced, so i cannot provide that information.) as it moved it varied in size\\brightness, at some points being about the size of venus as it appears from earth and getting as bright as approximately three times that size. we both watched carefully to look for a shape or to see if it was a reflection of the setting sun on a plane or some other \"normal\" object. that did not appear to be the case. there were no blinking or colored lights on the object. since it had been awhile since i last saw an unidentified object, i was fairly excited to watch it and determine its origin. later during the concert, all three of us saw another object of the same description pass over in the same manner, although i believe it moved the opposite way, i.e. left to right. in one of the cases, i watched the object disappear behind some clouds perhaps 40 degrees above the horizon and it did not reappear. in the other case, i witnessed the light dim in brightness, and when it was about 30 degrees above the horizon, it simply went out altogether and did not light back up. i cannot recall which ending went with which sighting and i do not want to guess and provide possibly incorrect information. also, during the second sighting, my roommate pointed out the object to the people in the row behind us and they too watched it go by. we didn't converse with them but they didn't disagree when our roommate said \"that's not a plane!\""],"Log Number":"US-06132008-0006","Date of the Event":"06/07/2008 09:00 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Country":"United States","City":"Kansas City","Weather Factors":"Unknown","Date Submitted":"06/07/2008 09:00 UTC","Case Number":"11150","files":["/var/www/straped/mufon/html2text/11150.html.txt","/var/www/straped/mufon/more/11150_submitter_file1__IMG.jpg","/var/www/straped/mufon/org/11150.html"],"Sighting Duration":"Undisclosed","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=39.102646,+-94.571657(11150)&iwloc=A&hl=en\"> mufon case (11150) map </A>","Object Shape":"Star-like","Summary":"Star-like objects crossed sky, varying in brightness","Longitude":"-94.571657","Tags":"City"}