{"trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 31st 2008"],"Log Number":"US-06132008-0008","map":"<A HREF = \"http://maps.google.com/maps?q=41.880594,+-87.621698(11152)&iwloc=A&hl=en\"> mufon case (11152) map </A>","Object Flight Path":"Undisclosed","City":"Chicago","Object Shape":"Sphere","Viewing Distance":"Unknown","Disposition":"IFO","Case Number":"11152","Region":"Illinois","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11152.html.txt","/var/www/straped/mufon/org/11152.html"],"Date of the Event":"05/31/2008 08:50 UTC","Tags":"City","Summary":"bright orange ball off light that imploded into itself and disappeared","Date Submitted":"05/31/2008 08:50 UTC","Sighting Duration":"Undisclosed","Latitude":"41.880594","divs":["Sighting DetailsI had gotten up from the couch and as I stood up I saw a large commercial jet in the sky in my window right above my head. I live on the 7th floor and it was very low and if it were any lower I could have probably hitched a ride. As I looked up and saw this, this plane was coming in heading West towards Ohare. This is a normal everyday occurrance living just miles from the airport. My attention then went to a bright orange ball of light hovering in the sky in front of me about 2 blocks away facing West. I thought at first \"Where did that planet come from\"? Thinking I had not noticed this before. As I watched the light it did not move but the commercial airliner was getting closer to this object, yet a bit overhead. Then I realised that all the planes that usually I see in the West are further back in the sky. Then I went to get my camera. As I lifted the camera and could even get it up to my eyes this ball of light started to sparkle like a firecracker and it lit up and turned into a tansparent orange square which then turned into a pin of light and just disappeared into nothing. When the object turned into the transparent square of orange light I could see through it. When the object went into itself, the square going into a pin of light, it looked like water going down a drain so fast like a vortex. Still In disbeleive I continued to watch for a plane,ISS, bird, anything that could explain this. I could find nothing. There was no noise and skies were fairly clear. It happened just before dark so the sky was a turquoise blue."],"Source":"MUFON","Country":"United States","Object Features":"Undisclosed","Longitude":"-87.621698"}