{"Date of the Event":"11/01/1973 12:00 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=40.05985,+-82.396784(11168)&iwloc=A&hl=en\"> mufon case (11168) map </A>","Source":"MUFON","Case Number":"11168","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Longitude":"-82.396784","Object Shape":"Unknown","Sighting Duration":"00:02:00","Object Flight Path":"Stationary","Object Features":"Appendage(s), Unknown","files":["/var/www/straped/mufon/html2text/11168.html.txt","/var/www/straped/mufon/org/11168.html"],"divs":["Sighting DetailsIn early November 1973 my family was moving back to Ohio. We had moved to NC the previous June and things hadn't worked out the way my family had hoped so we were moving back. I was in a hurry to get back to my friends, so I went to live with my aunt for 2 weeks. One night my cousin and I were going to take some laundry to the laundromat about 5 miles away. To get there we had to go up the hill past the high school. Most of Ohio is fairly flat land but where we lived had some fairly high hills due to the glaciers having ended there in the last Ice Age. When we crested the hill and started down the other side we noticed that it had suddenly become very dark -- much darker than normal. We looked up and noticed that something had blacked out the sky. It seemed to be very low -- much lower than cloud cover would have been. We drove on down the road a few hundred yards and suddenly it lightened up and we could see stars in the sky. For some reason we both became very frightened. We drove on to the laudromat, but when we got there we couldn't bring ourselves to get out of the car. We decided to just go home. Why we would have wanted to pass through that area again I don't know. When we got closer to the dark area we could see that there was definitely something there. It was huge and dark but we could not make out the shape. But there was something different about it this time. Underneath the craft there was what appeared to be a long projection of sorts with a light on the end of it and it was moving around like it was looking for something. We must have been afraid that maybe it was us they were looking for as we became even more frightened. I hit the gas and flew on up the hill out from under the thing. I've seen many other UFOs, both before and after this event, but this was the only time that I ever felt fear."],"Summary":"Really Huge UFO","Date Submitted":"11/01/1973 12:00 UTC","Country":"United States","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around November 1st 1973","This sighting has never been favorited.",""],"Log Number":"US-06142008-0015","City":"Newark","Weather Factors":"Unknown","Tags":"City","Latitude":"40.05985"}