{"Case Number":"11167","Latitude":"40.811732","Weather Factors":"None","Disposition":"Unknown","Tags":"City","Summary":"Elongated silent 60 to 80 foot object moves across sky.","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around June 14th 2008","This sighting has never been favorited.",""],"Date of the Event":"06/14/2008 08:27 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Lincoln","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/11167.html.txt","/var/www/straped/mufon/more/11167_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/11167.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.811732,+-96.678069(11167)&iwloc=A&hl=en\"> mufon case (11167) map </A>","Region":"Nebraska","Object Shape":"Cigar, Cylinder","Sighting Duration":"Undisclosed","Log Number":"US-06142008-0014","Source":"MUFON","Object Features":"None","divs":["Sighting DetailsI was outside with my son and he told me \"Look up there dad!\" and I did. I was facing east as the object came from a north eastern direction of travel. There was an elongated object (quite big) moving silently across the sky at the height of the clouds which are pretty low out here in Nebraska. It had no wings and was heading in a south east direction right above Lincoln. It went through or behind a patch of clouds and I didn't see it for a brief time and especially at the speed it was going I judged that it must have paused for a moment when behind or in the clouds. Then I seen it again continuing along it's original course of travel. It must have been about sixty to eighty feet long and possibly thirty to forty feet wide. It was well proportioned and even in it's length and depth but more in length. There was no contrail or chemtrail behind it. It must have been traveling about 80 to 100 mph. Mostly blue sky with some perfectly white clouds. 81 degrees outside with 9 mph winds coming from the south and visibility at 10.0 miles. Just two days ago we had two brief tornadoes hit Lincoln with one above my apartment complex and landing few blocks away. The other one at 27th and O streets."],"Longitude":"-96.678069","Date Submitted":"06/14/2008 08:27 UTC","Country":"United States"}