{"Viewing Distance":"21-100 Feet, 101-500 Feet","Latitude":"39.2075","Weather Factors":"None","Source":"MUFON","divs":["Sighting Details It started in late Apil and ended in June . May being the highlight of my sightings. I wittnessed three flying saucer's at first then up to fifteen do air combat manuvers in the sky's over my home at Beale Junction above Beale Air Force Base with two fighter jets from the AirBase. Im seventeen years old. I'm helping my mother in her Restaurant and Service Station. It was in the afternoon, there was a few people at the counter eating. There suddenly was a loud jet noise coming right at us. Every one ran out side just in time to see two jet aircraft T33's from Beale turn up into a steep climb headed right for three silver in color flying saucers. The flying saucers were in a tight group milling around each other. The jets got up close to them and they took off with lightning speed, one went north with a jet right close behind it. The other jet chased one off to the west. The other one went straight up out of sight. This was the beginning of many a late night events. In May of 1959 Beale Air Force Base was turned into a Bombing and Gunnery Range. For the last Year and a half I have been writting my story about these amazing events. A new MUFON Field Investigator ( Tim Doran ) has been working with me on on my sightings for the last year now, I have given him much detail and drawings on my case. I have even supplied him with a Notorized Wittnessed Document. It hase been ready to send to the State Director for over a month now. My story is true in every detail. Sincerly, John B. Mullican"],"City":"Smartvillle","Longitude":"-121.2975","map":"<A HREF = \"http://maps.google.com/maps?q=39.2075,+-121.2975(11166)&iwloc=A&hl=en\"> mufon case (11166) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Tags":"City","Region":"California","Disposition":"Unknown","trends":["There have been no other sightings in Smartvillle","This sighting has never been favorited."],"Object Shape":"Disc, Oval","Case Number":"11166","Date Submitted":"04/30/1959 10:00 UTC","files":["/var/www/straped/mufon/html2text/11166.html.txt","/var/www/straped/mufon/more/11166_submitter_file3__T-33leftbank.jpg","/var/www/straped/mufon/more/11166_submitter_file4__F-86Sabre.jpg","/var/www/straped/mufon/org/11166.html"],"Sighting Duration":"00:03:00","Date of the Event":"04/30/1959 10:00 UTC","Summary":"Three flying saucers and two fighter jets manuevering over my home.","Log Number":"US-06142008-0013","Object Features":"Dome, Window(s)","Country":"United States"}