{"Date of the Event":"10/01/1996 05:00 UTC","Source":"MUFON","City":"Pigeon","Date Submitted":"10/01/1996 05:00 UTC","Longitude":"-81.208448","files":["/var/www/straped/mufon/html2text/11165.html.txt","/var/www/straped/mufon/org/11165.html"],"Summary":"metallic disk shaped with red and pale yellowish white lights blinking around the outer edge","Sighting Duration":"00:02:00","Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","divs":["Sighting DetailsI was deer hunting with my father which at the time I was about 12 years old but very much in to military aircraft and flight in general so i was very framilar with all of the know aircraft at the time. It was just about an hour before dusk when my father had sat me down in a spot to watch over a hill for deer and in this spot I had a good view of the west sky through an opening in the trees and it was fall so there wasnt any leaves on the trees. After he sat me down he walked up the hill from me about 50 yards to watch a field in the opposite direction. We had were there for maybe 30 minutes when I had started to get bored and took a look at the sky. The first thing I saw were these two craft moving north and they appeared to be about one of theyre own length apart. After about 15 seconds of moving they stopped briefly and the lead craft turned at a 45 degree angle and ascended in two the clouds. Then the second craft moved into the lead crafts place and did the same thing. I will not say how far away or big these craft were because I didnt have a point of reference but I did have a clear view of them and was certain of shape and characturistics the displayed which did not seem to be normal. Right after they disapeared I became scared and ran up the hill to get my father who didnt witness any of this and we left."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.536764,+-81.208448(11165)&iwloc=A&hl=en\"> mufon case (11165) map </A>","Log Number":"US-06142008-0012","Case Number":"11165","Weather Factors":"None","Object Shape":"Disc","Latitude":"38.536764","Tags":"City","Viewing Distance":"Unknown","trends":["There has been one other sighting in Pigeon","There was one other sighting in Pigeon on or around October 1st 1996","This sighting has never been favorited.",""],"Region":"West Virginia","Disposition":"Unknown","Object Features":"None"}