{"Disposition":"IFO","Date of the Event":"06/14/2008 08:42 UTC","Case Number":"11170","map":"<A HREF = \"http://maps.google.com/maps?q=33.853982,+-117.743566(11170)&iwloc=A&hl=en\"> mufon case (11170) map </A>","Tags":"City","Longitude":"-117.743566","Object Features":"Undisclosed","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/11170.html.txt","/var/www/straped/mufon/org/11170.html"],"Source":"MUFON","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around June 14th 2008"],"divs":["sighting detailswhile driving eastbound on the 91 freeway just past the 242 sb exits an abnormally bright flashing light appeared nearly directly west of our position. we drove with our moonroof open and the sun had set fully. there were tiny stratus clouds behind offering an orange to black contrast to the sunset sky behind the object. the location of it's sudden appearance seemed to quite far over the north anaheim\\fullerton area in the distance. it came easterly towards the bumper to bumper 91 freeway at a fast clip. possibly as fast as 100mph. it was much swifter than a helicopter, and at the initial distance one could easily have assumed it was one. the flashing light was abnormally bright, much like the landing floods on a jetliner. as it came closer, we had the opportunity to see it through the moonroof and it was an oblong 70-100 feet across and traveled in a sideways motion with one corner, where the absurdly bright white flashing light was and at the tail was an array of red and other colored lights. due to the rich sunset hues, i couldn't make out if the other less bright lights were green, blue or simply both. this sighting was very exciting simply because the entire 91 corridor was filled with families bumper to bumper enjoying the brilliant sunset all at the same time. very exciting. there should be many more reports on this coming soon."],"Latitude":"33.853982","City":"Anaheim","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Square, Rectagular","Country":"United States","Date Submitted":"06/14/2008 08:42 UTC","Region":"California","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"E/B Bright Flashing White Light above ENTIRE 91Corridor OBLONG w/red light array","Log Number":"US-06152008-0001"}