{"Weather Factors":"None","Date Submitted":"06/15/2008 12:00 UTC","Object Features":"Unknown","Country":"United Kingdom","Date of the Event":"06/15/2008 12:00 UTC","Tags":"City","trends":["There have been no other sightings in Seascale","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11175.html.txt","/var/www/straped/mufon/more/11175_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/11175.html"],"Object Flight Path":"Hovering then path,Path then hovering","Longitude":"-3.481608","City":"Seascale","Log Number":"GB-06152008-0006","Latitude":"54.396774","Case Number":"11175","map":"<A HREF = \"http://maps.google.com/maps?q=54.396774,+-3.481608(11175)&iwloc=A&hl=en\"> mufon case (11175) map </A>","Disposition":"Unresolved","Object Shape":"Star-like","Viewing Distance":"Unknown","divs":["Sighting DetailsI'd gone out into the garden to smoke a cigarette and as I sat down I saw the moon behind my neighbour's house, illuminating some clouds. I got up and walked to the side gate to get a better view. Looking through the gate I noticed a light out of the corner of my eye, so I turned my head to look at it. It was a bright, ruby-red light that was hovering in the air, some distance away towards the south. I wondered what it could be when it began slowly moving to the right, still at the same altitude. After a second or two of movement, it stopped and began hovering again. A few seconds later it moved to the left, back to roughly where it originally was. It stopped again and hovered once more. My heart rate had increased by this time and I felt excited and slightly worried. It didn't move anymore after that, but stayed perfectly still. It seemed to gently fade for a moment, then return to it's full brightness, as though a cloud was moving in front of it. It did this a couple of times. From what I could see of the sky, it was a very clear night but there was a scattering of low-lying clouds. After a minute of waiting to see if it would go anywhere or do something else, I rushed inside and upstairs to get my camera. I came back down again approximately 1 minute later and hurried outside to where I was standing before. The light was still there in the same position, only this time it was noticeably fainter. I attempted to film it but my camera couldn't pick it up as it was getting fainter all the time. It steadily got fainter and fainter until it disappeared entirely. From the time of first seeing it to it's disappearance, roughly 5 minutes had elapsed. How long it was there before I saw it I don't know - I don't think it just suddenly appeared as I was looking at the moon. From the time of coming outside with my camera to the time of it's disappearance, roughly 1 minute elapsed, with it steadily growing fainter and not \"pulsing\" as described earlier. I waited around for a while but it didn't return. Throughout this whole episode, several dogs were barking in the village, however my cats didn't seem perturbed at all. Shortly (minutes) after it disappeared, the dogs stopped barking. I had initially wondered if it could have been a flare, as it was in the direction of an artillery range a few miles away, but during the whole episode there was no deviation in height, and no flickering, smoke-trails or \"auras\" usually associated with flares. Picture attached was taken the following afternoon from where I viewed the UFO."],"Region":"England","Summary":"hovering red light, moving left and right then fading away"}