{"files":["/var/www/straped/mufon/html2text/11178.html.txt","/var/www/straped/mufon/more/11178_submitter_file2__01-Untitled_to_Xvid_clip0_85bA.jpg","/var/www/straped/mufon/more/11178_submitter_file3__01-Untitled_to_Xvid_clip0_85e.jpg","/var/www/straped/mufon/org/11178.html"],"Country":"United States","Region":"South Carolina","Latitude":"32.783486","Log Number":"US-06152008-0009","City":"Charleston","Object Flight Path":"Straight-line path","Summary":"Object going really fast","Date of the Event":"06/09/2008 08:30 UTC","Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=32.783486,+-79.929122(11178)&iwloc=A&hl=en\"> mufon case (11178) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Case Number":"11178","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around June 9th 2008","This sighting has never been favorited.",""],"Weather Factors":"None","Object Features":"Unknown","Date Submitted":"06/09/2008 08:30 UTC","divs":["Sighting DetailsI was sitting in my car at MMTC, a local college here, facing south. I had just purchased a video camera and was trying it out. I was filming towards the East. I only recorded about 2 min. of video. It was a clear sky. No wind at all. I didn't notice the object while I was filming. When I got home I downloaded the video and previewed it on Windows Media Player. At around time stamp 1:42 I noticed an object, at the left bottom part of the film, right above the tree line, fly by really fast. Slowed it down and noticed it was a large object. Even in slow motion it traveled really fast on the video.I then tried to capture frame shots of it, still had a hard time because of the speed of the object, but I managed to get a couple. I enhanced them the best I could but... Below are the pics and video of the object. I don't know if it was a \"UFO\", but it traveled very fast and I know of no craft that we have that does that. Please view and let me know what you think. Thanks. \"Keeping My Eyes To The Sky\""],"Longitude":"-79.929122","Object Shape":"Disc","Tags":"City","Disposition":"Insufficient Data"}