{"City":"Montclair","Disposition":"IFO","divs":["Sighting DetailsSo it all started while standing in the Montclair Plaza Mall parking lot. It was pretty late and we were hanging out talking. I was standing, facing East and a friend I was talking to was facing West. Halfway through a sentence he yells \"SH--! LOOK!\" and points to the Western sky behind me. I whip around to see a reddish orange fireball around the size of a full moon sailing across the sky in a 4 o'clock direction, and disappear behind the JC Penney building. I really can't tell how far away this was, but it made no sound. It had the appearance of a meteorite coming down, but the only thing that makes me question it is the sheer magnitude of it. Later on the same morning, I had a meeting at work, and come to find out, one of my coworkers had also seen it from Pomona (7-8 miles West of Montclair) and said it was far off in the Western sky and gave a perfect description of it to me before I had told him any of the details about it first. The hairs on my neck rose right about then... Please feel free to drop me a line if you have seen this event or have any information. My email is daniel_remillard@yahoo.com"],"Log Number":"US-06152008-0010","Country":"United States","Source":"MUFON","Sighting Duration":"00:00:10","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Fireball","Case Number":"11179","Longitude":"-117.697278","Object Flight Path":"Straight-line path","Date of the Event":"06/15/2008 12:30 UTC","Summary":"Mystery Fireball Over So. Cal","Object Features":"Undisclosed","Tags":"City","Region":"California","trends":["There have been 2 other sightings in Montclair","There were no other sightings in Montclair on or around June 15th 2008"],"Date Submitted":"06/15/2008 12:30 UTC","Latitude":"34.087232","map":"<A HREF = \"http://maps.google.com/maps?q=34.087232,+-117.697278(11179)&iwloc=A&hl=en\"> mufon case (11179) map </A>","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/11179.html.txt","/var/www/straped/mufon/org/11179.html"]}