{"Object Flight Path":"Straight-line path","Region":"Karnataka","Object Features":"Unknown","Summary":"Around 40 -50 lights objects moving in a combined way.","Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"IN-06162008-0006","trends":["There have been 5 other sightings in Bengaluru","There were no other sightings in Bengaluru on or around June 3rd 2008"],"Country":"India","map":"<A HREF = \"http://maps.google.com/maps?q=12.980989,+77.601103(11188)&iwloc=A&hl=en\"> mufon case (11188) map </A>","Sighting Duration":"Undisclosed","Latitude":"12.980989","Tags":"City","files":["/var/www/straped/mufon/html2text/11188.html.txt","/var/www/straped/mufon/org/11188.html"],"Date of the Event":"06/03/2008 09:15 UTC","Case Number":"11188","Longitude":"77.601103","City":"Bengaluru","divs":["sighting detailsi was on the roof of my house and making a call to my home. when i just given a glance to the sky, suddenly some unusual things are moving together and only a 'chain ' of lights (around 40) moving very fast in a floating manner. the light is like handing some what 3 u shapes in a slight slanting position. the size of the light chain is too long from the first sight itself i felt that something unusual. a plane cannot be that much size and there was no sound and can not be that kind of shape and it was too fast. i stopped calling my parents and tried to take photos using my mobile but it came out blank and noting is clear. the same time i called my friend, but before he reaches because of the city light on the sky make it not clear because it was moving to the direction where the city light is too falling to the sky. immediately i put this in my blog http:\\\\meninweb.blogspot.com\\2008\\06\\ufo-again-in-bangalore.html pretty sure, i am one of the lucky one to see an unusual object, is it a ufo ?? i feel so. still when i close my eyes, its comes into my mind.!!"],"Object Shape":"Boomerang, Flash, Oval, Saturn-like, Other","Date Submitted":"06/03/2008 09:15 UTC","Disposition":"Unresolved"}