{"Summary":"Silent, non-marked, dark grey/black blimp like vehicle moving north east over East River in a straight line then orienting east ascending to cloud altitude and into cloud in double the time","Weather Factors":"Unknown","divs":["Sighting DetailsI live in a luxury hi-rise apartment in Midtown, next to the Empire State Building. At around 4:40AM I got up while my roommate was about to sleep and went to the rooftop for a cigarette. At around 4:45 or so, I noticed a dark blimp or oval shaped vehicle, which I first thought was a blimp but then realized there was no cabin, no indication of rudders or fans, no markings or logos and absolutely no lights. It appeared to move without wobbling or without any influence of the wind direction, but rather in a stable path over or near the East River from about the Union Square East area (14th Street) to the 34th Street area, disappearing from my field of view on the east side of the Empire State Building, then reappearing on the north side. This is where it changed course and turned east and quickly ascended until it reached the cloud level and disappeared. It was my intent to record this event with my cameraphone which I had in hand but I was too stunned to even remember to switch it on. I tried recording the event after it oriented itself easterly, but realized then it was too late for my cameraphone to record it with any quality. I tried sleeping it off and thought I was going insane for a minute but then realized that I had just simply seen an aircraft that didn't conform to the normal standards of flying objects in the NYC area (i.e., lights, engine noise, tags or markings identifying the craft, etc.) I checked for reports of any sightings or anything out of the ordinary anonymously. I would contact the NYPD or airports to inquire about any other reports, but I'm afraid reporting it to authorities in this city would cause ridicule and alarm. Please let me know if you are in NYC area and saw a blimp like object in the early hours of June 14, 2008."],"Sighting Duration":"02:30:00","City":"Long Island City/Astoria","Source":"MUFON","Object Shape":"Blimp, Cigar, Oval","Object Flight Path":"Undisclosed","Case Number":"11189","Latitude":"40.789142","map":"<A HREF = \"http://maps.google.com/maps?q=40.789142,+-73.13496(11189)&iwloc=A&hl=en\"> mufon case (11189) map </A>","Tags":"City","Object Features":"Undisclosed","Date of the Event":"06/14/2008 04:45 UTC","Country":"United States","trends":["there have been no other sightings in long island city\\astoria","This sighting has never been favorited."],"Viewing Distance":"Unknown","Region":"New York","Date Submitted":"06/14/2008 04:45 UTC","Longitude":"-73.13496","Disposition":"Insufficient Data","Log Number":"US-06162008-0007","files":["/var/www/straped/mufon/html2text/11189.html.txt","/var/www/straped/mufon/org/11189.html"]}