{"files":["/var/www/straped/mufon/html2text/11185.html.txt","/var/www/straped/mufon/org/11185.html"],"Region":"Texas","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around June 14th 2008"],"Date Submitted":"06/14/2008 12:40 UTC","Object Flight Path":"Straight-line path,Other","Log Number":"US-06162008-0003","Disposition":"Unknown","Country":"United States","Source":"MUFON","Longitude":"-95.36054","Tags":"City","Case Number":"11185","Date of the Event":"06/14/2008 12:40 UTC","Object Features":"None","Latitude":"29.765453","divs":["Sighting DetailsI was outside near my pool working on my tan. Naturally I occasionally looked up at the sky and it just so happens that I noticed a unusual object, solid black in color, that appeared to be \"wobbling\" as it moved. The object was slighly oval and because of its apparent altitude and black color not much detail was visible even though it was broad daylight (12:40 in the afternoon). Its flight path was a straight line, in a south-easterly direction, but it seemed to sway, ever so slightly, from side to side. I watched for a about a minute or two as is crossed the entire sky, starting from directly overhead, and then watched as it dissappeared in some distant clouds. There was no audible sound that I am aware of. My first thought was... \"Hmm... That was weird. I wonder what that was? A UFO??\" I kind of laughed to myself and not giving it much more thought I continued to lay there in the sun, still working on my tan, but keeping an eye on the distant clounds just in case the object returned to view. And that's when things really got weird. About 1 minute after the object dissappeared into the distant clouds, 5 identical objects (perhaps one of them was the original?? this I am not certain) emerged from the same clouds and began circling around. All of them fit the same description: solid black and slightly oval. From my vantage point, they were moving in \"tight\" circles and appeared to be moving upwards, almost in a spiral pattern. They were not all circling the same direction either. Atleast 1 of them was circling the opposite direction of the rest. At this point I jumped to my feet and called to my nephew, who was swimming, to look at what I was seeing. He stopped swimming and watched with me, for approximately 2 or 3 minutes, as these black objects continued circling around each other, all in close proximity to the same original clouds. Finally, all but one of the objects dissappeared back into the clounds and the last object made one final circle and then proceeded in a straight line heading east, with the same \"wobbly\" motion as the first. The interesting thing is that the last object, that was heading east, actually turned at an angle that caused it to reflect sunlight for a brief moment so I know it had to be a metallic aircraft of some sort (or atleast something capable of reflecting sunlight). As far as what it actually was... I have no idea!! At the time, I remember thinking \"wow... I am witnessing some UFOs\" so I actually looked at my cell phone (which I had nearby) and made a mental note of the time. Ive also been thinking about it for a couple days now and it was intriguing enough that I wished I had a video camera... So I went and bought one, just in case Im lucky enough to see a similar event again!"],"Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.765453,+-95.36054(11185)&iwloc=A&hl=en\"> mufon case (11185) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Oval","City":"Houston","Summary":"5 UFOs SEEN CIRCLING ABOUT AND THEN DISSAPPEAR INTO CLOUDS"}