{"Case Number":"11186","divs":["Sighting DetailsMy father brings me his SD card from his scout camera that he posts around his property to see what kind of animals he can capture. Within a three day pariod it took over 700 pictures which is not unusual. About 50% are night shots which tend to capture racoons, foxes, coy-dogs, and deer. Days shots are of turkeys, crows, squirrels, etc. As I was scanning through the pictures I noticed a series of three pictures that had some strange lights we couldn't explain. Keep in mind this camera is set up at the end of a field where there is no electric and headlights wouldn't reach. The camera is set to take three shots when it picks up motion. You will notice a racoon in each shot which most likely set off the detector. If the light in each shot was in the same position and same location, I would would suggest it was something on the lens, or a reflection of something, even though all that is down there is trees. But the light moves in each of the three shots as if it is getting closer to the camera and has a unusual pattern of blurry sphere-like lights. Of the 700 shots the camera took in three days, these were the only night shots that had these lights. The lights in the last of the three shots seem transparent as you can see the tree through them. I attached the three photos with the lights and one day shot to show what the area looks like. The camera was not moved or touched during three days. I don't want to say it's a UFO, but no one here has explained what the lights are."],"Tags":"City","Date of the Event":"06/05/2008 10:26 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-06162008-0004","City":"Stamford","Object Features":"Undisclosed","trends":["There has been one other sighting in Stamford","There was one other sighting in Stamford on or around June 5th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=42.77,+-73.08(11186)&iwloc=A&hl=en\"> mufon case (11186) map </A>","Region":"Vermont","Source":"MUFON","Longitude":"-73.08","Disposition":"Unresolved","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/11186.html.txt","/var/www/straped/mufon/more/11186_submitter_file1__ICAM0061series.jpg","/var/www/straped/mufon/org/11186.html"],"Date Submitted":"06/05/2008 10:26 UTC","Summary":"Horizontal sphere lights move closer to scout camera.","Latitude":"42.77","Object Shape":"Unknown","Country":"United States"}