{"files":["/var/www/straped/mufon/html2text/11187.html.txt","/var/www/straped/mufon/org/11187.html"],"Object Features":"Window(s)","Country":"United States","divs":["Sighting DetailsI was returning from Indianapolis travelling norhtwest after picking up my Mother and Nephew from the airport. Riding along with me were another nephew and a niece. As we were travelling, I noticed a big bright strobe light off the southwest side of Inerstate 74. I(44)jokingly remarked to the kids in the back seat, \"Look it's a UFO\". Well the next thing I know my Mother (76) is saying look, look, look! And coming from my left and passing about 50 feet above and in front of us was a disc about 20-30 feet in diameter with rectangular windows(portholes?). It continued on it's banking path and proceeded to fly in a southwesterly direction along the interstate. The kids, ages 10-13 all saw it and were a little scared and in awe!!! Had I been alone I would have stopped but since I had the kids with me I kept going. Then about five minutes later, again on the southwesterly side of I-74, we saw a reddish glow coming from a field, the kids say they saw something on the ground but since I was driving I did not see it and again I couldn't stop to investigate because of the kids. I have travelled that road countless times at night and I have never seen any of the lights I have mentioned here, not to mention the craft. All in all it was a pretty exciting night for all involved. It's all the kids can talk about and I am glad that they had the oppurtunity (myself as well) to witness such an event. I have attached a drawing I created using Autocad Inventor and converted to a PDF file of what we saw."],"Date Submitted":"01/14/2008 01:30 UTC","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.552496,+-85.598154(11187)&iwloc=A&hl=en\"> mufon case (11187) map </A>","Longitude":"-85.598154","Object Flight Path":"Path with directional change","Latitude":"40.552496","Weather Factors":"Fog","Source":"MUFON","Summary":"Driving NW on I-74 saw a light to my left, said light then flew over in front of me and off to the right rear.","Disposition":"Unknown","Region":"Indiana","Log Number":"US-06162008-0005","Case Number":"11187","Date of the Event":"01/14/2008 01:30 UTC","Tags":"City","Viewing Distance":"21-100 Feet","Object Shape":"Disc","Sighting Duration":"Undisclosed","trends":[""]}