{"trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around June 15th 2008"],"divs":["sighting detailshey i live in north carolina,outside charlotte, and today i saw my first ufo....i was wondering if anyone had seen this event or heard anything about it? all my life i have always wanted to see something like this and today was the day. i was on my way back from picking up some chineese and about to make a keft into a harris tetter shopping center when i noticed other people ahead of me in the turning lane pointing up at the sky and when i looked up i saw...i can't belive what i saw... it was about 6:30p.m. and there wasn't a cloud any where near this giant wobling highly reflective disc....with what looked like a lighter dot in the middle of it. myself and a few other people pulled over in the parking lot and all got out of our cars and were speachless. the only point of size reference that we had was a cessna that looked to be about 3 miles to the left in the sky away from it, and the object was pretty hughe in comparison to it and traveling very arratic and fast. it started wobbling end to end (right to left) and then went horizontal in the sky but on a vertical angle and then start to move away very quickly in a diagnoal line upwards and it either sped up so fast we couldnt see it any more or just went invisible almost and disapeard. i stood there for another half an hour and didn't see anything else go by other than that cessna and like a putz i am standing there trying to call my fiancee at home(literally 2 mins. from were i was) and forgot that i had a razor camera phone until i got home and called my friend in new york to tell him and he said,\"if you had a camera phone(8mega pixel w\\zoom) why didn't you try and take a picture rather than call anyone?\" and i couldn't belive i had been so excited that i totally forgot. i just wanted to call home and get my fiancee to confirm what i was seeing...that and ,\"oh my god!!!\", was all that was running through my head. well thats my story and iam sticking to it and damn proud of it"],"Object Features":"Dome","Log Number":"US-06162008-0001","Weather Factors":"None","Country":"United States","Region":"North Carolina","Tags":"City","Latitude":"35.233387","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Other","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/15/2008 06:18 UTC","Object Shape":"Circle, Disc, Oval","Summary":"I was driving home from getting dinner and was about to turn into parking lot of super market near my home when I noticed people looking up a something in sky....a highly reflective silvery disc","Longitude":"-80.834757","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=35.233387,+-80.834757(11183)&iwloc=A&hl=en\"> mufon case (11183) map </A>","Date of the Event":"06/15/2008 06:18 UTC","files":["/var/www/straped/mufon/html2text/11183.html.txt","/var/www/straped/mufon/org/11183.html"],"City":"Charlotte","Case Number":"11183"}