{"Object Shape":"Triangle","Case Number":"11182","Weather Factors":"Unknown","Date Submitted":"06/15/2008 11:00 UTC","divs":["sighting detailswent outside to walk the dogs for the last time, and noticed a bright light in the southern sky (toward macdill afb) it is a cloudy night, so there were no stars present. at first it appeared to be a star, but as we looked at it more closely, we could see a clear separation point making it two distinct lights. they are still there as i type this. 11:27 p.m. they are described by my daughter as orange\\white in color. they appear to be completely motionless other than a slight \"fading\" action, or pulsating. okay, 11:31 p.m. and they are now gone! i got out the seldom used video camera, and of course the battery is dead, so we tried with a camera phone, but i don't think we got anything. as far as the shape, it was two triangles right next to each other. the one on the left was standing on it's point, while the one on the right was sitting on it's base. when i say triangle, i mean pyramid shaped. my first reaction was \"that's an airplane\" as we are right under the flight path for tia, but that was soon discarded as it didn't move a bit. now, as i tried to reason with myself, i thought maybe it is going away from me, or coming towards me, but it stayed at the same altitude, didn't get any brighter, dimmer, or smaller or bigger. it stayed exactly the same for as long as i could see it. about a half an hour. as far as losing sight of it, i was typing this report and looked up to check on it and it was just plain gone. i am curious if anyone else reports this! if i wasn't sure of what i saw, i sure as hell wouldn't take the time to type this up. help!"],"trends":["There has been one other sighting in Tampa Bay","There were no other sightings in Tampa Bay on or around June 15th 2008"],"Log Number":"US-06152008-0012","Region":"Florida","City":"Tampa Bay","Object Features":"Undisclosed","Latitude":"28.274347","Object Flight Path":"Undisclosed","Date of the Event":"06/15/2008 11:00 UTC","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Longitude":"-82.388578","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/11182.html.txt","/var/www/straped/mufon/org/11182.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.274347,+-82.388578(11182)&iwloc=A&hl=en\"> mufon case (11182) map </A>","Sighting Duration":"01:00:00","Summary":"Two triangle shaped lights, one upside down, one right side up, next to each other, motionless.","Tags":"City"}