{"Tags":"City","Weather Factors":"Unknown","trends":["There has been one other sighting in Stamford","There was one other sighting in Stamford on or around June 5th 2008","This sighting has never been favorited.",""],"Latitude":"42.77796","Date Submitted":"06/05/2008 12:00 UTC","Date of the Event":"06/05/2008 12:00 UTC","Case Number":"11195","Object Shape":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.77796,+-73.07637(11195)&iwloc=A&hl=en\"> mufon case (11195) map </A>","Longitude":"-73.07637","Country":"United States","Viewing Distance":"Unknown","Summary":"Better pictures from scout camera - southern vermont","Object Features":"Undisclosed","City":"Stamford","Region":"Vermont","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI am submitting higher resolution images of the strange blurry light that appeared on my fathers scout camera. I merged the previous images together side by side and reduced their size which did lower their original resolution. I was only allowed to uplaod three images, and I wanted to show all three night shots plus the day photo. I apologize as it did effect the resolution and made the images more pixelated. The camera's resolution was not set on high res, but the quality of these attached images is better. Someone questioned if these were altered. They were not. My father doesn't have a computer and brings me the sd disk to clean off all the images that are uninteresting. Of the 700 images that were captured in three days, most are of crows, squirrels and leaves moving. Once in a while we get a nice buck, wolf, or some other large mammal. That's been the purpose of this camera. It was never the intention to capture unexplanable lights. I will admit I am a professional graphic artist and do know how to use photoshop very well. I even teach it at the local college. But that was not the case with these. I did take the images and played with filters, brightness, etc, to see if I could get anything else to appear, but other than circular glows in a horizontal blurry motion, I got nothing. These attached pictures are just as they came off the sd card from the scout camer. I submitted them to this sight not to say we captured a UFO, but to get some possible explanations of what it could be other than a ghost or spaceship from beyond. If this wasn't on my father's camera I would be making the same suggestions that it's not real and was altered. I am skeptical of spirits and ufos, and have never seen one personally to convince me otherwise. But there are many stories that can't be explained and I doubt they are all liars. I have tried to come up with what this light could be. I showed it to other photographer friends and no one has come up with a reasonable explanation. Someone suggested a bug, but it stays too horizontal in all three shots. I first thought a drop of water on the lens, but it changes size and locations. The third shot is the strangest as you can see a tree in the distance in the middle of the lights. That tree is fifty yards away from the camera. Why is that portion of the image lighter? Each shot was aprox, 10-15 seconds apart. There were no shots directly before or after these for another hour. As I explained previously, the raccoon in the shot most likely set off the camera, not the light source. The motion sensor only picks up a 25 ft range. The raccoon came and went as fast as the light, otherwise the animal would have kept setting the camera off taking more shots. The previous night there were over fifty pictures of that critter - but no lights. My best explanition is the camera digitally did something I can't explain. While I thank those who do come up with some thoughts of what this could be, I know for a fact these pictures were not digitally altered."],"Log Number":"US-06162008-0013","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11195.html.txt","/var/www/straped/mufon/more/11195_submitter_file1__ICAM0061.JPG","/var/www/straped/mufon/more/11195_submitter_file2__ICAM0062.JPG","/var/www/straped/mufon/more/11195_submitter_file3__ICAM0063.JPG","/var/www/straped/mufon/more/11195_submitter_file5__simg_t_os4050689141d1b5a307d4cec83ac5c29fff82671jpg.jpg","/var/www/straped/mufon/org/11195.html"],"Disposition":"Unknown"}