{"City":"Malibu","Longitude":"-118.804839","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Disc","Summary":"Multi colored UFO came down malibu coastline at night, Hovered, went into the ocean, i could see UFO lights under water, came out into a hover, shot off fast towards catilina island","Date of the Event":"11/30/1969 09:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-06162008-0009","divs":["sighting detailsin the early 1970's in the hills of pacific palisades, ca. on anoka drive. i was watching tv in jim lecron family room, the family room has a large glass window that gives you a view of the malibu coast line-west to santa monica-south, it is common to see lots of airplanes taking off from lax and santa monica airport and helicopters flying up and down the malibu coast with their red & green nav. lights and flashing strobe, so we all knew what airplanes & helicopters look like at night, that evening jim's mother noticed unusual very bright colorful lights coming down the malibu coastline towards us, there was a telescope that sat by the large family room window and a pair of binoculars. all of us took turns trading off between the telescope and binoculars, what i saw was a multi colored (white, blue, red, yellow, green) constant bright lights randomly flickering around the sides of a thick disc shape, i tried focusing on the inner portion non lighted top area, but only saw black, it was night time and dark out, the sun was completely set with no clouds, fog or moon light, this object came down the malibu coastline towards pacific palisades and hovered about 200 feet in the air about 500-800 yards from the shore of topanga beach, malibu\\charthouse restraunt, from our view, we were looking down on the ufo at an angle, it hovered there silently for a few of minutes, then abruptly went into the water, even with the naked eye you could see the greenish illuminating glow from the craft being under the water, it stayed there under the water for a few minutes not moving at all, when i looked at it through the telescope i could see the pattern of waves going over the lighted sea water, at that moment his mom freaked out screaming and started calling the police and air force in a panic. i watched the craft come out of the water and hover, in a hover as i was watching it through the telescope, the craft elongated to about 2 times its length, i couldn't tell if it turned a quarter turn and it was always longer and we were looking at it from the front, or if it actually changed its whole length & size wich it appeared to do, the same bright multi colored lights were still coming from the sides, as i told jim he grabbed the telescope from me, i was looking at the ufo with my naked eye for about 20 seconds after it elongated when it, in a split second, shot off at incredible speed from a stand still, it just streaked south towards catalina island. i tried to rationalize it and thought i might have been some kind of secret military craft but it was not, it came in slow, it hovered, went under the water and then shot away very very fast, since then i have flown helicopters and fixed wing aircraft and to this day there isn't anything that could even remotely function or look like that, i know what we experianced was probibly the most incredible thing i will ever see in my lifetime and i remember it vividly. if anyone else has experienced this event i have seen in that same time period or if there are any pictures or reports, please contact me! sincerely, robert snyder"],"Weather Factors":"None, Unknown","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.008028,+-118.804839(11191)&iwloc=A&hl=en\"> mufon case (11191) map </A>","Case Number":"11191","Object Features":"Other","Date Submitted":"11/30/1969 09:00 UTC","files":["/var/www/straped/mufon/html2text/11191.html.txt","/var/www/straped/mufon/org/11191.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"California","Latitude":"34.008028","trends":["There have been 20 other sightings in Malibu","There were no other sightings in Malibu on or around November 30th 1969"],"Source":"MUFON"}