{"files":["/var/www/straped/mufon/html2text/1119.html.txt","/var/www/straped/mufon/mufon_json/1119.json","/var/www/straped/mufon/org/1119.html"],"Object Flight Path":"Stationary,Other","divs":["Sighting DetailsFirst let me state that this investigation is just starting, but I thoughtsomeone may be interested in what is known now. ( I will be out of town for thenext week) John love emailed me about this sighting, it was reported on anotherweb-site by someone who overheard parts of conversations about this but did nothave all of the facts right. I talked to people that live in clover, one aboutone mile from the site and no one had heard about it, this was two weeks afterthe event. I then called the halifax county shreiffs office and talked to thesheriff. He was very forth coming in telling me what his deputies had seen andatleast one of them was in the room with him. On march 8 at about 8pm? two orthree were on an unrelated call in the area of the power plant, the third mayhave joined the group a few minutes later. (It was reported that the powerplant had called in the first web-site report) They saw a triangle or pyraimidshaped object above the clover power plant at about the height of the smokestack (500 feet), it was lit up on all three corners, and made no sound theycould hear above the hum of the power plant. They said it \"banked\" around thearea of the plant. They were later joined by a fourth officier from thesheriffs office and an animal control warden. They attempted to take picturesbut none turned out. They also said that when the flash of the camera went off,the lights on the craft went off. The other site also talked about the deputiesbeing traumatized, the sheriff laughed when I told him that and said they were alittle moved by the event. At this time it appears that personnel inside thepower plant were not aware of the event at the time it was taking place. I alsotalked to a woman I work with and she said that her two cousins live in thatarea and saw the craft on that night, they told her that it was a diamond shapeand \"all lit up.\""],"map":"<A HREF = \"http://maps.google.com/maps?q=36.831989,+-78.733766(1119)&iwloc=A&hl=en\"> mufon case (1119) map </A>","Viewing Distance":"501 Feet - 1 Mile","Case Number":"1119","Log Number":"","Date Submitted":"03/08/2001 08:00 UTC","City":"clover","Weather Factors":"Unknown","Country":"United States","trends":["There has been one other sighting in clover","There was one other sighting in clover on or around March 8th 2001"],"Date of the Event":"03/08/2001 08:00 UTC","Latitude":"36.831989","Sighting Duration":"00:30:00","Tags":"City","Summary":"triangle sighting","Region":"Virginia","Disposition":"Unresolved","Source":"MUFON","Object Features":"Undisclosed","Object Shape":"Triangle","Longitude":"-78.733766"}