{"Weather Factors":"Unknown","Object Shape":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Saugatuck","This sighting has never been favorited."],"Summary":"Zig-Zag Yellow-Blueish Object in Allegan Michigan USA","Source":"MUFON","divs":["Sighting Detailsme and my dad were coming home from muskegon michigan back in 1991 in the late summer time season, and when we were driving back home to benton harbor michigan usa, we saw a yellowish-blueish zig-zag object coming from the southwest direction at an anormous speed (in allegan county) near sagutuck, it was about 500 to 1000 feet up in the night sky, and it was gone and over us in our ford van in less than 5 to 10 seconds flat. then me and my dad at that time had to pull into the next near by rest area on highway US 31. we were pretty shaken about what we saw, so me and my dad got out at the rest area to walk around until we got a hold of our selfs and until we both were ready to head back onto the high way back home. my dad told my mom about it all, and we still, me and my dad remember the whole entire incedent till this day. my dad was in the Veitnam War back in the 60's era, he drove tanks, jets, and hue's. he said that he still can not identify what that object could have possibly been, the object we saw did not come close to anything that was even near man flown, by either really anything to match with or even think upon that any government would use, especialy in the area where we saw the object. is there really any such object with such a high speed, and the fact that it zig-zaged at such an outgoing angel thru the sky at night. ? we sure do Not know what the object could have been. there were no lights on the highway complete pitch dark, and No other cars on the highway at that time 1:00am \" not for many upon many miles at the most least \"."],"Date of the Event":"07/31/1991 12:00 UTC","Latitude":"42.655025","Tags":"City","Disposition":"Hoax","Date Submitted":"07/31/1991 12:00 UTC","Longitude":"-86.201982","Country":"United States","Sighting Duration":"00:01:00","Region":"Michigan","City":"Saugatuck","Object Features":"Undisclosed","Viewing Distance":"Unknown","Case Number":"11206","map":"<A HREF = \"http://maps.google.com/maps?q=42.655025,+-86.201982(11206)&iwloc=A&hl=en\"> mufon case (11206) map </A>","files":["/var/www/straped/mufon/html2text/11206.html.txt","/var/www/straped/mufon/org/11206.html"],"Log Number":"US-06172008-0005"}