{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.514115","files":["/var/www/straped/mufon/html2text/11213.html.txt","/var/www/straped/mufon/org/11213.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.514115,+-112.032994(11213)&iwloc=A&hl=en\"> mufon case (11213) map </A>","divs":["Sighting DetailsWhile taking our dog out this morning just before 8:00 a.m. I noticed a bright reflection from something high in the sky moving slowing from South to North coming just over Step Mountain. Since planes sometimes fly this route on their way to the Salt Lake City airport, I watched the object thinking it was a plane. The object, however, zigzagged twice forming a sort of \"W\" in the sky. At that point I knew it wasn't an airplane, but thought it might be a helicopter since Camp Williams is just slightly to the south of us. When the object next executed a lazy arc flying toward the West, I knew it wasn't a helicopter. At all times, what I was seeing was the reflection of the object from the rising sun - that is, the sun coming from the East, the object slightly to the West of me, it must have created the perfect angle of reflection for me to see it. The object then remained stationary for about four minutes, then it flew slightly South and seemed to recede becoming smaller and dimmer. It looked like a small, bright star at that point. During the four minutes, I ran and got my husband to observe the object, but by the time he came outside, the object was quite dim, and unless you knew exactly where to look, it was hard to see. I kept watching until I could no longer see the tiny, bright \"star\". Given its motion, the object was not an airplane, not a helicopter, and not, as my husband wondered, a satellite. I feel quite privileged to have seen this."],"Region":"Utah","Object Shape":"Unknown","trends":["There has been one other sighting in Herriman","There were no other sightings in Herriman on or around June 18th 2008"],"Disposition":"Unknown","Case Number":"11213","Date Submitted":"06/18/2008 08:00 UTC","Log Number":"US-06182008-0006","Tags":"City","Weather Factors":"None","City":"Herriman","Longitude":"-112.032994","Object Features":"Unknown","Date of the Event":"06/18/2008 08:00 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States","Summary":"Zigzag motion, arc-shaped trajectory, receding into space all over Herriman, UT!"}