{"City":"North Las Vegas","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","Log Number":"US-06182008-0004","Date Submitted":"06/15/2008 07:30 UTC","Date of the Event":"06/15/2008 07:30 UTC","Latitude":"36.202559","map":"<A HREF = \"http://maps.google.com/maps?q=36.202559,+-115.109071(11211)&iwloc=A&hl=en\"> mufon case (11211) map </A>","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around June 15th 2008"],"Region":"Nevada","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsOn may 25 2008 at approximately 19:45hrs while conducting a routine surveillence of the ( northwest sky )I was in my back yard standing on a 15foot latter so that i could see better and video tape any strange activity, and while my video cam was rolling a very large disk appeared on my monitor I was able to video tape some very interesting footage but only for about 1minute my cam stoped picking up its image but I continued to observe its behaviour it changed shapes then it hovered for about 3minutes before totally just disapearing.... there was no dought it was a UFO I have been observing disks and star like ufos for many yrs and its like anything else you just get good at identifying objects when you have been doing it long enough. On june 15 2008 at approximately 1930hrs my wife and I and our next door neighbor a retired school teacher like to go for walks on our block where we live this night however would be different as the three of us were walking I had a feeling like we were all being watch so I looked up at a very clear and blue sunset to see a very bright star like object hovering only about 2,500 feet in the northern sky I stated look! and my wife and our friend looked up and there it was, it was so amazing! I ran to get my cam but when I returned it was gone but I have our friends eye wittness account and she was a skeptic before this happened.. she stated it changed from a star to a disk and at a snap of the finger it was gone.... it left us all feeling very shayken and very tense it took us all night to calm down... these events continue today I have tryed to make contact with the disclosure project people but no reply yet... the activity around this area is just off the hook I dont have all the equipment to record and document all this activity... I feel that some kinda of contact was trying to be made from the star like ufo to \"me\" because its happening all the time and I dont know what to do at this point? I have made contact with our local chanel 8 news people but I need a finished product to show them...so for now I just have MUFON. Hope to hear from you guys soon... thank you for your time and consideration regarding this case. Jon"],"files":["/var/www/straped/mufon/html2text/11211.html.txt","/var/www/straped/mufon/org/11211.html"],"Longitude":"-115.109071","Viewing Distance":"501 Feet - 1 Mile","Summary":"very dark disk moving very fast then stoping then changing shape then vanished.","Case Number":"11211","Object Shape":"Disc, Star-like","Country":"United States"}