{"Tags":"City","Object Shape":"Fireball, Star-like","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"11214","Source":"MUFON","Region":"Indiana","Country":"United States","Log Number":"US-06182008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=38.134808,+-87.93069(11214)&iwloc=A&hl=en\"> mufon case (11214) map </A>","trends":["There have been 4 other sightings in New Harmony","There were no other sightings in New Harmony on or around November 9th 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11214.html.txt","/var/www/straped/mufon/org/11214.html"],"Latitude":"38.134808","Date of the Event":"11/09/2007 06:00 UTC","Date Submitted":"11/09/2007 06:00 UTC","Disposition":"Unknown","Summary":"Amber colored balls of light, object visible on cam moving between orbs and lighting them.","divs":["sighting details i was coming home from work on il-14, when i looked north above grayville, il and saw two or three of the amber orbs. first one appeared, then one came below and to the left of it. possibly another, it's been six months ago since then. i continued to watch the sky until i got home. when i arrived i got out my camera and tripod. i believe it was about twenty minutes before i saw anything else. the description is exactly the same as my reports from 9\\11\\07 and 9\\12\\07 in indiana, they are the only two on that date if you wish to look them up. the difference in this sighting is that i could see small dots of light splitting off from the orbs as they lit up, and continuing on in the sky to repeat this again. the orbs lasted only seconds on this occasion, and there were about eight in all; most were caught on tape. the following has been recoded to wmv9, thus losing some quality; however the important aspects can still be seen. any questions should be sent to myeyeshaveseen@hotmail.com"],"Sighting Duration":"00:10:00","City":"New Harmony","Longitude":"-87.93069"}