{"Object Shape":"Triangle","Country":"United States","Case Number":"1121","Log Number":"","Disposition":"Unresolved","City":"clover","Viewing Distance":"21-100 Feet","divs":["Sighting Details4-4-01MUFONClover SightingTriangleThis is a follow up to the posting I did yesterday, I finally got to talk to oneof thewitnesses that were on the scene. This was a female deputy that first saw thecraft out ofthe passengers window of the police vehicle. It was about 8:30 PM and they(there weretwo other officers , one in her car and one in another car behind them) werereturningfrom a call. An elderly couple had complained about someone parking by theirMagnoliatree. They found nothing there and the ground was muddy(no tire tracks), aftertalkingwith her she feels that it is possible the couple saw the lights from what theysaw a fewminutes later. On their way back she saw bright lights coming towards themover thetrees, this would have been from the east from the direction of the power plant.The lightswere moving very slowly, and at this time the officer in the car behind themradioed, doyou guys see that or some thing to that effect. It came right up to the roadwhere theywere at tree top level, at about this time they stopped in the road. The craftalso stoppedthere for a moment. She said it was hard to make out the shape because thelights were sobright, but said it was a dark triangle shape with a light in each cornerpointing ahead of it. She had a hard time determining its size because the lights were so bright butfelt it was atleast as big as a small house. It then banked and did a slow turn and wentback the wayit had came towards the power plant. They said it made no sound and they hadcut theircars off. Next they had to get on another road to follow it and lost sight of it severaltimes. Theywent to the power plant up a back road and spotted it . It was now much higherin the sky(the smoke stack is 500 feet and it was much higher than that) and moving awayfromthem, back the way they had just come from. It had now taken on the appearanceof abright starand seemed to disappear then reappear in different areas of thesky. At thistime the female deputy got out her department issue 35mm camera and startedsnappingpictures. She said her flash was on and that every time she snapped a picturethe thingwould shut its lights off, then turn them back on. At this time it was only abright light inthe sky and that is what she felt her pictures would look like if they turn out;(as of todaythey have not been developed) she did say she would give us some if they turnout. Itcontinued to move away until it just disappeared. The whole event lasted aboutone hourfrom when they first saw the lights to when it was gone. At the power plantthey werejoined by a fourth deputy and an animal control warden. They also talked topeople at thepower plant and they saw and heard nothing. The deputy I talked to said she sawthesame light in the sky the next evening, (its bright star like form) but nothingsince then. Istill hope to talk to at least one of the other deputies. The deputy I talked totoday said shewould draw some pictures of what she saw. I will update as I gain moreinformation.Tom Ginther VA MUFON"],"Sighting Duration":"01:00:00","Latitude":"36.841689","Source":"MUFON","Date of the Event":"03/08/2001 08:30 UTC","Summary":"triangle sighting","Longitude":"-78.724106","Date Submitted":"03/08/2001 08:30 UTC","files":["/var/www/straped/mufon/html2text/1121.html.txt","/var/www/straped/mufon/mufon_json/1121.json","/var/www/straped/mufon/org/1121.html"],"Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.841689,+-78.724106(1121)&iwloc=A&hl=en\"> mufon case (1121) map </A>","trends":["There has been one other sighting in clover","There was one other sighting in clover on or around March 8th 2001"],"Object Features":"Undisclosed","Object Flight Path":"Unknown","Region":"Virginia"}