{"Weather Factors":"Unknown","Summary":"The UFO was rotating.","divs":["Sighting DetailsIt was sometime during eleven o' clock pm and i was in my room trying to fall asleep thinking about the roswell crash. While my eyes wander around I see this bright disc like object in the sky it was about half a mile away and it was kind of rotating counter clock wise and has yellow and red lights around it. But it was to far away for me to see anything else. But in the beginning i did not notice it to be a ufo so I thought it was a wishing star but i was 10 so I made a wish and I layed back down onto my bed and kept staring at it and after a little while I closed my eyes for less than 5 seconds and I looked outside the window again to see what it was doing because I believe in the paranormal and the most mysterious of mysteries and I start to see it rotating and floating from left to right very slowly but it pretty much stayed in the exact spot of when I made my wish. But being 10 years old I think it was just a plane which I highly doubt. So I lay back down again and then this sort of sensational feeling rose threw my body and i wondered if it had anything to do with the rotating object, so I look out the window one last time and I see it moving upward then differently then most UFO \"blast offs\" to lighting speed, but it starts to disappear from the right side and moves down to the point were it stops to disappear and there is a giant green flash and then it accelerates to lighting speeds into the sky. I ran outside amazed by this occurance and now im a 13 year old trying to become an expert on UFO's and im trying to research them and I have even tried to get abducted by the Nordic alien species. Because they are the good aliens instead of the greys that wish to perform a bunch of surgeries on you and make you drink harmful acids. But I also wish i could get an implant from an alien to see what it does to my body and if i can i would take it out after a year and see what it looks like and maybe try some experiments on it at aUFO research center. So if anybody wants me to take risky jobs to track down aliens then im free for any job."],"Case Number":"11229","Log Number":"US-06192008-0006","Object Shape":"Disc","Longitude":"-88.134793","Country":"United States","Date Submitted":"06/20/2006 12:00 UTC","Sighting Duration":"00:02:21","Object Features":"Dome, Patterned Surface","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"41.912529","trends":["There have been 4 other sightings in Carol Stream","There were no other sightings in Carol Stream on or around June 20th 2006"],"City":"Carol Stream","files":["/var/www/straped/mufon/html2text/11229.html.txt","/var/www/straped/mufon/org/11229.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.912529,+-88.134793(11229)&iwloc=A&hl=en\"> mufon case (11229) map </A>","Date of the Event":"06/20/2006 12:00 UTC","Disposition":"Hoax","Object Flight Path":"Stationary,Other","Region":"Illinois"}