{"divs":["sighting detailsthere were 4 of us on a weekend astronomy\\ufo watch in the groom lake area , parked at the white mailbox, on et highway (375), 20 miles from the lilaleinn in rachel. we set up \"camp\" at the famed \"black mailbox\"(now white). of steve medlen, erected our telescope for summer sky observation and kept eyes out for anything else that may have business in the area. at 11:20 pm, we swung the scope around to face north to observe a binary star. my friend then said, \"what do we have here?\" i looked in the direction,and immediately saw a pulsating red light which appeared to be spherical in shape. since this is a strict \"no fly\" zone(for most aircraft anyway), it had my complete attention. it remained stationary for about a minute,changed color to a white pulsation, then dove at an approximate angle downward of 30 degrees.we lost sight of it for a moment, when my friend flashed it with a red laser pointer. almost immediately it reappeared and changed to the red pulsation, perhaps in response to the laser greeting. when in the new position, it changed to a white pulsation, then back to red. about 45 seconds later, it zigged up to a higher position, sat there for about 15 seconds more , then took off at a 40 degree angle up and away! (phenomenal acceleration!) i am a mufon member, #12495, presently studying the field investigation manual. my friend had a ce3 while in the air force in europe at a \"nuke\" base. i have had a very close encounter before, which i will not discuss here. it was quite exciting, as this was my first sighting! thanks for the mufon forum."],"Date Submitted":"06/14/2008 11:20 UTC","Object Features":"Undisclosed","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.649152,+-115.738355(11221)&iwloc=A&hl=en\"> mufon case (11221) map </A>","Summary":"SIGHTING OF PULSATING SPHERE ABOVE MOUNTAIN RIDGE AT THE WHITE MAILBOX, HWY. 375, 20 MILES OUT OF RACHEL, NV. IT USED THE CLASSIC \"ZIG-ZAG' MANEUVER, AND CHANGED COLORS FROM RED TO WHITE.","Region":"Nevada","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"11221","Weather Factors":"Unknown","Log Number":"US-06182008-0014","Viewing Distance":"Unknown","Longitude":"-115.738355","Disposition":"Insufficient Data","City":"RACHEL","Latitude":"37.649152","files":["/var/www/straped/mufon/html2text/11221.html.txt","/var/www/straped/mufon/org/11221.html"],"trends":["There have been 9 other sightings in RACHEL","There was one other sighting in RACHEL on or around June 14th 2008"],"Object Shape":"Sphere","Date of the Event":"06/14/2008 11:20 UTC"}