{"Longitude":"-97.333345","map":"<A HREF = \"http://maps.google.com/maps?q=37.699106,+-97.333345(11222)&iwloc=A&hl=en\"> mufon case (11222) map </A>","Summary":"Many ufo's over Wichita, Kansas","Region":"Kansas","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"37.699106","Log Number":"US-06182008-0015","Object Flight Path":"Undisclosed","Date of the Event":"06/17/2008 01:20 UTC","Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Date Submitted":"06/17/2008 01:20 UTC","trends":["There have been 39 other sightings in Wichita","There was one other sighting in Wichita on or around June 17th 2008","This sighting has never been favorited.",""],"Case Number":"11222","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Cone, Diamond, Disc, Oval, Sphere, Other","files":["/var/www/straped/mufon/html2text/11222.html.txt","/var/www/straped/mufon/org/11222.html"],"City":"Wichita","divs":["Sighting DetailsI was sitting a a train crossing on 21st street N. and I looked up at the sky and say a bunch of bright glowing glights that were radiating blue and red pulsed. I pulled over and me and my 2 passengrs got out of the van a started counting the objects and stopped at 42. It was as if there was a web of them over Wichita. We watched them pulse red and blue out of the white lights and move around slowly. We decided after about 5 minutes of lying on the van pointing to drive the last 3 blocks home. When we got there we looked up and there were so many clouds that you could not see anything but an occasional one peaking out from the clouds. I started back home down 21st toward Hillside and I could see in front of me at the tree line one of the objects traveling at about 40 at about a quarter mile in front of me on my left. I turned on Hillside and went home to get my camera. I returned to the WSU parking lot and started to take pictures of the bright moving lights. I was only able to take 3 pictures and the new batteries in my camera were dead. I tried 3 other sets and they were dead to. But I still managed in those 3 pictures to get something clearly in 2. I was looking at a very bright pulsing light but in the pictures they appear as a grey ball. But when you zoom in it is a top looking lighted object with something coming out of the top. I went out the next night and captured at least 20 or more ufo's that are all different when you zoom in and they all photographed as a grey ball or they came out looking like a ghost orb. All you need to do is zoom in as far as you can on the grey balls or invert the colors to see all the invisible orbs to the eye that are there also. I am going back out tonight. Notice that there are no stars in the sky."],"Object Features":"Undisclosed"}