{"Case Number":"11226","City":"Fishers","Summary":"Hovering Triangular Formation with White Strobe Lighting with hues of Blue and Red","Source":"MUFON","Sighting Duration":"00:15:00","Country":"United States","Object Shape":"Triangle","Tags":"City","Date of the Event":"06/18/2008 10:05 UTC","Disposition":"Unknown","Object Features":"Unknown","Object Flight Path":"Hovering then path","Latitude":"39.963853","Region":"Indiana","Date Submitted":"06/18/2008 10:05 UTC","Weather Factors":"None","Log Number":"US-06192008-0003","files":["/var/www/straped/mufon/html2text/11226.html.txt","/var/www/straped/mufon/more/11226_submitter_file4__P7120001.JPG","/var/www/straped/mufon/more/11226_submitter_file5__P7120002.JPG","/var/www/straped/mufon/org/11226.html"],"divs":["Sighting DetailsOn Wednesday June 18, 2008, I was watching TV at my place located at the Deerbrook Apartments in Fishers. I had my blinds open to my large windows to let the breeze in since it was a cool night. At about a little bit after 10 pm, I noticed a set of lights pass very slowly across the left window (in my living room) in the distance. Now at the time, I did not think much of it because I figured it was a small aircraft (like a Cessna) landing at the Indianapolis Municipal Airport which is a half mile north of my residence on Allisonville Rd. But then I saw another set of lights passing very slowly across my right window at about what appeared to be the same altitude as the set of lights from the left window. This seemed odd to me 2 aircraft flying so close to each other (I work for the Airlines). So I looked out the right window and I saw 3 strobing objects in the sky in a Triangular Formation. I thought I was seeing things. I went outside with my binoculars to make a better observation from my porch. When I went outside, I got a good view of the following (with and without binoculars): 1. 3 objects in a perfect Triangular Formation \"hovering\" about 1000 feet off the ground. 2. The distances between each set of strobing white lights (with hints of blue and red) was somewhere in the neighborhood of 300 to 400 feet. 3. I was using a point of reference (a neighbor's chimney) and the objects appeared to hover there for about 10 minutes and then they began to very very slowly drift off in a northernly direction. 4. The strobing lights were moving left to right from my vantage point (they could have been moving in a circular fashion but I could not observe that) 5. MOST IMPORTANTLY: I DID NOT HEAR ANY SOUND!!!!! (I know what a helicopter and an airplane sound like). I did not hear anything eminate from these objects. Now the objects began to move away and eventually I lost sight of them from my porch. I went back inside stunned by what I observed. This was clearly not a helicopter or aircraft. Unfortunately, I did not have a camera to take a snapshot of what I had seen. Please Note: There could have been an object or structure within the perimeter of the strobed lights. If there was, I could not see it because it blended in with the night sky."],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.963853,+-86.007113(11226)&iwloc=A&hl=en\"> mufon case (11226) map </A>","trends":["There have been 9 other sightings in Fishers","There were no other sightings in Fishers on or around June 18th 2008","This sighting has never been favorited.",""],"Longitude":"-86.007113"}