{"divs":["Sighting DetailsI was a little kid, only about 6 years old. I was abducted in the middle of the night. The thing about it was I was not really scared by the incident. I had never heard of UFOs or aliens, as described in today's pop culture. I was a very curious kid and willing cooperated with my abductors. I referred to my abductors as \"ant people.\" Because the beings looked like \"big ants\" to me. I told my parents and they just laughed. I never felt that I was harmed in any way and grew up, as a very happy normal guy. The ant people did what can best be explained as a medical examination on me. They did not talk to me but, they did smile. I was not a bit scare. The only uncomfortable thing about the experience was I made to sit in a fetal position, at one point, without moving, it was very uncomfortable to me. The beings were as tall as I was (as a kid). I was never into the UFO thing but, one day when I was around 18 years old - I was hanging out at my friends house and he had a paperback about UFOs and in the book there was a drawings of aliens - AND I SAW THE ANT PEOPLE. The drawings looked exactly as I remembered. I was pretty freaky. I never told anyone about this before. Other than my parents when I was kid. It really happened! Today, I am 39 years old, an Ivy League educated lawyer. I am a pretty serious guy but, I believe! I believe in aliens! Take Care."],"Case Number":"11228","Viewing Distance":"Unknown","Latitude":"40.581872","Summary":"abduction","Disposition":"Unresolved","Date of the Event":"11/30/1974 12:00 UTC","Object Flight Path":"Undisclosed","Date Submitted":"11/30/1974 12:00 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 30th 1974"],"Tags":"City","City":"New York","files":["/var/www/straped/mufon/html2text/11228.html.txt","/var/www/straped/mufon/org/11228.html"],"Object Shape":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.581872,+-74.141261(11228)&iwloc=A&hl=en\"> mufon case (11228) map </A>","Log Number":"US-06192008-0005","Weather Factors":"Unknown","Longitude":"-74.141261","Region":"New York","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed"}