{"Object Features":"None","Log Number":"US-06192008-0008","map":"<A HREF = \"http://maps.google.com/maps?q=47.601156,+-122.163676(11231)&iwloc=A&hl=en\"> mufon case (11231) map </A>","files":["/var/www/straped/mufon/html2text/11231.html.txt","/var/www/straped/mufon/org/11231.html"],"Disposition":"Unknown","Sighting Duration":"00:05:00","Object Shape":"Sphere, Triangle","Source":"MUFON","Summary":"UFO's over west end of East Channel Bridge","City":"Bellevue/Mercer Island","divs":["sighting detailswe live on a hill above factoria and i was looking out our window as i worked out on my stairmaster and saw a large triangular shaped yellow\\orange object hovering over the west end of the east channel bridge. i thought it was a huge kite but, as i watched, it rose straight up then moved at about a 30 degree angle to the n.w. after it came 40 or 50 spherical silver\\gray objects which appeared to just cascade up into the sky behind it. among the silver balls were two larger spheres which were smaller in size than the triangle but larger than the other balls. these were dark red in color. these spheres stayed more stationary while slowly rising into the air and heading nw. this morning, i tried to compare their size to the semi trucks which i can see on the bridge. the large triangle would have been at least 5 semi trucks wide and the smaller balls about 2 semis in width and the red balls about 2 and 1\\2 semis in width. i kind of hope these were balloons but their size was so large. if these are from another planet, they are not very concerned about showing themselves. i felt neither frightened nor compelled to run for my camera, just kind of stunned. they just rose out of site above the windows edge and i didn't even go outside to watch how they went away. this is very unlike me. i called my husband who also watched them and now does not want to talk about it. he will just say \"we saw some ufo's\". i am a college educated rn and my husband was editor of the chicago tribune and an editor for the detroit free press for over 20 yrs. did anyone else see this or know what it was?"],"Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Date of the Event":"06/18/2008 07:00 UTC","Case Number":"11231","Date Submitted":"06/18/2008 07:00 UTC","Longitude":"-122.163676","Object Flight Path":"Hovering then path","Region":"Washington","trends":["there have been no other sightings in bellevue\\mercer island","This sighting has never been favorited."],"Latitude":"47.601156","Tags":"City"}