{"Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn Long Beach, on top of Signal Hill, June 19, 2008 at around 10:30 pm I was watching what I thought to be a satellite move across the sky from the West to the East. It was about 80 degrees off the horizon, and about the brightness of -2. Suddenly it came to a halt. Then it started to move forward slowly, but was zig-zagging from left to right and back to left again. Then another bright object that had been stationary, we thought was a star, jetted away from the zig-zagging object moving toward the West, and came to a halt. The other bright object that had been doing the zig-zagging then moved out on a straight course eastward bound. Then, the bright object that had before been stationary kept moving in the sky, in a small circle, then moving in a short distance to toward the North and then back a short distance to South, then make another circle, then halt, and then repeat the pattern. This went on until I grew tired and left. Before leaving, I spotted another bright object, similar also to what a bright satellite would look like, flying from the West toward the East. As this passed very near to the object making circles and other moves, that object moved off fast toward the South as to give the Eastern bound object a lot of room."],"Object Flight Path":"Path with directional change,Path then hovering","Object Features":"Unknown","Latitude":"33.810197","Summary":"Bright UFO's in low earth orbit can be seen doing various moves in the dark sky","Region":"California","Weather Factors":"Fog","Source":"MUFON","Date Submitted":"06/19/2008 12:00 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/11237.html.txt","/var/www/straped/mufon/org/11237.html"],"Longitude":"-118.150186","Log Number":"US-06202008-0003","City":"Long Beach","Object Shape":"Star-like, Unknown","Case Number":"11237","Date of the Event":"06/19/2008 12:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.810197,+-118.150186(11237)&iwloc=A&hl=en\"> mufon case (11237) map </A>","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around June 19th 2008"],"Country":"United States"}