{"Tags":"City","Region":"Pennsylvania","Date of the Event":"06/19/2008 03:30 UTC","Summary":"RED pulsing classic shaped UFO w/white lights","Longitude":"-79.697545","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11235.html.txt","/var/www/straped/mufon/more/11235_submitter_file1__IMG_2123.JPG","/var/www/straped/mufon/org/11235.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.428402,+-79.697545(11235)&iwloc=A&hl=en\"> mufon case (11235) map </A>","Date Submitted":"06/19/2008 03:30 UTC","Latitude":"40.428402","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around June 19th 2008","This sighting has never been favorited.",""],"Object Features":"Dome","Object Flight Path":"Path then hovering","Disposition":"Unknown","City":"Murrysville","Case Number":"11235","Log Number":"US-06202008-0001","Country":"United States","Weather Factors":"None","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy 12-year-old daughter was up talking on phone to friend looking out her bedroom window (facing south) at the moon when a red-glowing pulsing craft came into view instantly (in the blink of an eye) to the right out bedroom window over a wooded valley in front of our house. It had a row of white lights along lower edge that raced one at a time to the right, then traveled back again, repeating. The whole craft glowed red that got brighter then dimmer. It moved slowly just above the tree line until it was directly in front of her window where it hovered silently (moving slightly, not stationary) for several more seconds. It did this light show several times before moving off quickly to the east. Her boyfriend on the phone told her as she described it that it must be a UFO because planes etc., don't do that. He then looked out his own window (about 5 miles away)in our direction and said he saw 7 red dots all traveling in a group, got scared and ducked. NOTE: We've joked that our row of solar LED garden lights (PHOTO ATTACHED) that randomly pulse colors of green, red, blue that are lining our garden wall in a half circle about 25-30 feet in length might signal a UFO-- like they might think one of theirs is in distress... Perhaps it works! We're considering setting up a motion camera to catch one on film... Within the last couple of years we've also seen nighttime neon green flash-type anomalies on two separate occasions-both lit up the sky bright green & one looked like it should have crashed, but there was no sound & no reports on the police scanner."],"Object Shape":"Saturn-like","Sighting Duration":"Undisclosed"}