{"Object Features":"None, Unknown","Log Number":"US-06202008-0010","Date of the Event":"05/31/2008 08:30 UTC","Date Submitted":"05/31/2008 08:30 UTC","Source":"MUFON","trends":["There have been 3 other sightings in Los Lunas","There were no other sightings in Los Lunas on or around May 31st 2008","This sighting has never been favorited.",""],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11245.html.txt","/var/www/straped/mufon/more/11245_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/11245_submitter_file2__ufo3.jpg","/var/www/straped/mufon/org/11245.html"],"Longitude":"-106.73123","Case Number":"11245","Country":"United States","divs":["Sighting DetailsI am a truck driver from Dallas. I had finished making a delivery at the Walmart distribution center in Los Lunas,NM. I parked my truck in a dirt lot behind a Walmart store. I was sitting in the drivers seat completing my log book when I saw thw object in front and above me. I was looking west.It was about 8 pm mountain daylight time and the sun was setting , almost below the horizon. The sky was still very light and free of clouds.It was very bright , like a full moon , but there were no other stars in the sky that were visible because it was still too light out. The object was round like a sphere or circle and it was stationary.I watched it for almost two hours. It appeared to be slowly gaining altitude as the sun went down and eventually got so high all I could see was a faded glow. By this time stars were vivible everywhere. I called my brother on my cell phone and told him what I was looking at and he told me that I was looking at a weather balloon. I thought about that and came to the conclusion that a weather balloon would float with the jet stream and or the trade winds , yet this object was stationary.I watched it for so long that I noticed that visible stars had changed position as the earth rotated , but yet this object was stationary.I really don't know what it was. I have an extensive backround in aviation and I am positive it was not a man made aircraft.I was a aviation electricians mate in the Navy back in the eighties and a avionics technician working on commercial jets. I have about seventeen years experience with aircraft before I started driving a truck. I have pictures taken with a Q9 Motorola cell phone and three video clips taken with the same phone."],"Object Shape":"Circle, Disc, Sphere","Summary":"Very bright and stationary","Object Flight Path":"Stationary","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Region":"New Mexico","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.812686,+-106.73123(11245)&iwloc=A&hl=en\"> mufon case (11245) map </A>","City":"Los Lunas","Latitude":"34.812686"}