{"Longitude":"-111.882987","files":["/var/www/straped/mufon/html2text/11242.html.txt","/var/www/straped/mufon/org/11242.html"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Utah","Object Features":"Unknown","Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"11242","Date of the Event":"06/20/2008 12:00 UTC","City":"Salt Lake City","Latitude":"40.763809","Tags":"City","Log Number":"US-06202008-0007","Source":"MUFON","Country":"United States","Summary":"object in sky that disappeared. Way high in sky. looked silver sphere like. thought it was a plane. Not moving fast if at all.","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around June 20th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.763809,+-111.882987(11242)&iwloc=A&hl=en\"> mufon case (11242) map </A>","Date Submitted":"06/20/2008 12:00 UTC","divs":["Sighting Details I was practicing my guitar in a park. I looked up at a small propeller airplane. I saw another object above it that looked way higher in the sky. I thought it was just an airplane so high up that I could not make out its shape. It looked round, silvery and spherical. I thought that was just because it was so high that I could not make it out. It also appeared not to be moving very much if at all, but again I thought that was because it was so incredibly high in the sky. I continued to look at it wondering if it was moving. It then just seemed to vanish. It was kind of small in the sky, but it definitely went out of view. I kept looking at the sky where it was and could see nothing. There were no clouds at all in that part of the sky. Not even close to that part of the sky. I was wondering if there were any other sightings over Salt Lake that day. I don't know if I even believe in UFO's or not. But I just thought it strange that it could just go out of sight like that. I did not think a lot about it, just that it was odd. I wondered if my eyes were just playing tricks on me, or if it just went higher and out of view. I was definitely looking at it when it went out of view, and could not see it again."],"Object Flight Path":"Hovering then path","Object Shape":"Sphere"}