{"Source":"MUFON","Viewing Distance":"20 Feet or Less","City":"Chicago","Region":"Illinois","Disposition":"Unknown","Date Submitted":"08/01/1978 12:00 UTC","Latitude":"41.880944","Object Shape":"Cigar","Case Number":"11259","Object Flight Path":"Path with directional change","Tags":"City","Object Features":"Other","Sighting Duration":"Undisclosed","Date of the Event":"08/01/1978 12:00 UTC","divs":["sighting detailsmy parents use to frequent this particular thrift store on the southside of chicago. i remember this night like it was yesterday. my mom, dad and my sisters went in the store. my two brothers and i stayed outside and played a game of chase in the lot across the street. i was the youngest of the two. probably around 7 or 8 yrs old. now, had it not been for my two brothers to colaborate this story i would have wrote it off as a dream. every now and then i confirm it with them. it seems that my parents weren't in the store very long which seems strange. nevertheless, the then long john silver restaurant was full of dinners. the parking lot was parallel to an alley wich was perpendicular to another alley forming a t-intersection. we were interupted by a bright combination of lights which started at the end of the perpendicular alley. it was flying like right at the top of the houses which are no more than two stories. it was dead silent, cigar shaped with lights on the outer perimiter all the way around. it seemed to have had every color in the spectrum. it slowly aproached us at the t-intersection. it turned side ways right above the parallel alley and in front of us. i remember a long second and then it vanished before my vary eyes. i've never seen anything move that fast then or since. we looked at one another knowing what we all had experinced something unreal. it seems imediatlly after that my parents exited the store. we looked at one another knowing what we all had experinced. no one believes me when i tell my story. after that i remember having weird dreams of climbing invisible stairs into the stary heavens and of being abducted by aliens. my dreams are very vague now. when we moved to north carolina i would get the so called \"stick\". like i'm being held down and when i would open my eyes there would be this huge unearthly head beside me where my brother's should be. all those things have ceased. that's not to say that they are related to the incident. however, watching the program about metalic objects in the bodies of those who have witnessed sightings, caused me to remember an object in my right lower leg like right on top, slightly to the side of my shin. it seems to move freely or slip away from my finger when i put pressure on it but for years has stayed in the same place. i always wondered if i had, at some point in time, fell and injured myself allowing this to enter my leg, but there is no visible scar. i remember being up at night investigating my leg and playing with it only to get irritated. just tonite 06\\21\\08 i attempted to relocate it in my leg since i've not felt it in a while only to discover that it's still there playing the same tricks. it's kind of sore when i press down on it now, maybe i'll get a magnet to check it out. i have a sister who swears that she remembers being on a ufo being probed and stuff. that, of course, was when we lived in garland, north carolina a very rural area. i would be willing to go under hipnoces to get some closer. i don't believe, i know they exist. i don't beleve my parents beleived us. even though i can still hear my dad say, \"you think this is all god got?\" sincerely lovie hunter 36 years old"],"Weather Factors":"Unknown","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around August 1st 1978"],"files":["/var/www/straped/mufon/html2text/11259.html.txt","/var/www/straped/mufon/org/11259.html"],"Longitude":"-87.627068","Summary":"UFO aproached me and two brothers stopped in front and above us citand the vanished in the heart of the city Kedzie and 64th in the lot of Long John Silver now a Burger King","Country":"United States","Log Number":"US-06212008-0012","map":"<A HREF = \"http://maps.google.com/maps?q=41.880944,+-87.627068(11259)&iwloc=A&hl=en\"> mufon case (11259) map </A>"}