{"divs":["sighting detailsabout 11:45a, on my way home from coming from my bank, while driving down univ. ave. @ 30th st. and boundary st., i was prompted mentally to look up to the sky. (it was a very clear and warm day.) to my amazement, i saw a large, onyx-color, trianglular ufo in the southeastern sky (just over the cities of san diego\\national city\\chula vista and the 32nd st. naval base. the object was vertically stationery throughout viewing, with occasional twisting motions (left-to-right) of the object. the object's triangular shape had rounded edges, with a luminescent inner layer, and a see-through \"sky\" core. it was really high in the sky, and i made sure i knew it wasn't a helicopter, plane, hot-air balloon. there were no propellers, wings, flames, basket... nothing. just a blackish, triangular, almost diamond-shaped object. i immediately pulled over to the curb and put my emergency flashers on. i began to take two pixs on my cell phone camera while still in my car. however, i could not see the object, so i had to snap the shots in the general direction of where i was seeing this object. it took me about 10 minutes. it was hard to see at times because of the glare of sunlight. preparing to take the next two pixs, i took my glasses off (which are translucent glasses--changes to uv tint when outdoors) so i could see the object more clearly. to my surprise, i could not see the object at all, only the clear-blue sky. when i put my tinted glasses back on, i saw it clearly visible. what i found was that it was not visible with the naked eyes, only visible when wearing my tinted uv glasses. immediately, i got the sense it knew i was watching it and taking the pixs, and suddently the object vanished--not flew away! i was excited by the event and it stayed on my mind aftwards for about 2 hours. i then went home and decided to draw what it was. i struggled with it, because i noticed it appeared to shape-shift. from diamond-like to triangular to twisting and turning. ironically, the naval base was near its vicinity. the fact that there were no jets dispatched, led me to believe it had cloaked itself--if i couldn't see it with my naked eyes, only when i had my tinted glasses on, i imagine it wasn't making itself obvious to anything else. however, this object was of significant size. wow, what an experience!!"],"Case Number":"11251","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/11251.html.txt","/var/www/straped/mufon/more/11251_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/11251_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/11251_submitter_file3__UFO3.jpg","/var/www/straped/mufon/org/11251.html"],"Country":"United States","Latitude":"32.680408","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Triangle","City":"National City","map":"<A HREF = \"http://maps.google.com/maps?q=32.680408,+-117.095377(11251)&iwloc=A&hl=en\"> mufon case (11251) map </A>","Log Number":"US-06212008-0004","Source":"MUFON","Longitude":"-117.095377","Object Features":"Other","trends":["There have been 2 other sightings in National City","There were no other sightings in National City on or around June 20th 2008","This sighting has never been favorited.",""],"Disposition":"IFO","Date Submitted":"06/20/2008 11:45 UTC","Date of the Event":"06/20/2008 11:45 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Summary":"I saw a large, onyx-color, trianglular UFO in the southeastern sky (just over the National City/Chula Vista/North Island Naval Base areas.","Region":"California"}