{"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsJune 16 at 9:30 pm. I was looking out of the window from the second floor of my house.I was looking down at the pond when something caught my attention from the corner of my eye.It was a very large brilliant light.This light was moving slow then stopped .Three other lights appeared behind it out of nowhere they looked like they were in a line formation.The lights would then disappear and reappear scattered but close together.They would move all directions up down left and right, then hover but, not all together. They had no formation at this time.I then saw another light appear way up in the sky above the others,it then slowly moved down to the others.This maybe lasted a couple min.I then thought to get my video camera.I ran inside my house got my camcorder then started videotaping. I only got 20 seconds of video ,then they all vanished into thin air but I caught 3 on film just blinking out.Before I started videotaping i counted 5 of these things together .I dont know if you would call these things starlike or spheres.At times they looked like both. They seemed to be hovering and moving over a farm field area from what it looked like. My friend witnessed these too, he lives a half mile away from me.I don't know what these things are and I don't know whats going on around here in this greenwood area.This is the fifth strange sighting I have had since 2005."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.617358,+-86.105513(11255)&iwloc=A&hl=en\"> mufon case (11255) map </A>","Latitude":"39.617358","City":"Greenwood","Sighting Duration":"Undisclosed","Summary":"five bright lights vanishing and reappearing moving different directions","Tags":"City","Case Number":"11255","Country":"United States","Region":"Indiana","Object Features":"Other","Object Shape":"Circle, Sphere, Star-like","Date of the Event":"06/16/2008 09:35 UTC","Disposition":"IFO","trends":["There have been 17 other sightings in Greenwood","There was one other sighting in Greenwood on or around June 16th 2008","This sighting has never been favorited.",""],"Longitude":"-86.105513","Date Submitted":"06/16/2008 09:35 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-06212008-0008","files":["/var/www/straped/mufon/html2text/11255.html.txt","/var/www/straped/mufon/org/11255.html"]}