{"Tags":"City","Disposition":"Unknown","Summary":"Pictures taken with wildlife camera. Rural area","Sighting Duration":"00:36:00","Date Submitted":"06/20/2008 04:34 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Latitude":"32.895126","trends":["There have been 3 other sightings in Azle","There were no other sightings in Azle on or around June 20th 2008","This sighting has never been favorited.",""],"Weather Factors":"None","Source":"MUFON","Object Shape":"Cylinder","divs":["Sighting DetailsThe pictures were taken in sequence by a wildlife cameral on June 19, 2008. This camera takes pictures daily and we have several files of wildlife pictures using this camera with no previous anomalies. There were 33 pictures taken June 19-June 20, 2008. The event pictures began with image 18,June 20, 2008 at 4:29 a.m., where a deer is looking back toward the tree line where the object was photographed. Picture 19 shows the image of the cylindrical object at about a 45 degree angle. This object was stationary and did not appear to be moving. Unfortunately, I tried to enhance the object by zooming in, and ended up cropping the picture so the deer was not visible. However the cylider is very clear in this picture. Image 20 was taken at 4:46 a.m. with the deer and the object is clearly visible in the background, still at about a 45 degree angle on the tree line and it had not moved. Image 21 still has the object in the same place, however I tried to zoom in and cut out the deer. Image 22, taken at 5:05 a.m. shows the deer, but the object has moved and is in a horizontal position. There is also a white light to the right of it, however that may be a drop of water on the lense of the camera. Image 23, taken at 5:46 a.m. shows just the deer. The cylindrical object is gone. I am including images 24,25,& 26 because they show the background and the tree line. This camera is stationary and is never moved. I am only able to submit images 19,20, & 22."],"City":"Azle","Log Number":"US-06222008-0010","Case Number":"11269","Country":"United States","Longitude":"-97.545856","files":["/var/www/straped/mufon/html2text/11269.html.txt","/var/www/straped/mufon/more/11269_submitter_file1__deercam6-20020.JPG","/var/www/straped/mufon/more/11269_submitter_file2__deercam6-20019.JPG","/var/www/straped/mufon/more/11269_submitter_file3__deercam6-20022.JPG","/var/www/straped/mufon/org/11269.html"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=32.895126,+-97.545856(11269)&iwloc=A&hl=en\"> mufon case (11269) map </A>","Object Features":"Other","Date of the Event":"06/20/2008 04:34 UTC"}