{"divs":["Sighting DetailsMy husband, son and I were driving westbound on rte.30 in Indiana. I saw a black object. My husband thought it might be a kite. I said no. It was moving around coming toward us. My son in the back seat on my side saw it too. It had just rained and when I first saw it, it was darker than the cloud. When it got above us I looked straight up and it appeared to have wing action.My 16 yr. old son asked what is it. I said I didn't know. When I first saw it in the distance it looked like there were two of them and the one just vanished. After a few minutes of watching it, it just vanished as if it went straight up,but fast. It was all black and in the shape of a human. No lights. No sound. It wasn't going in a ling. It was more moving fluently. It was dusk. Just before it turned dark. Light enough that somebody else had to see it. All you had to do is just look out your window. I just wonder if anyone else saw it. You couldn't miss it. I have no idea what it was. I'm 46 and I've never seen anything like it. I believe in God and Ive always believed that he as well as demons are invisible.I've never believed in Ufos but I don't know what we saw.It almost looked like it was wearing a cape. It was just flowing.When I looked straight up out the window I saw something that appeared to be wing action. It wasn't close enough to describe it fully. It was close enough that a lot more people should have seen it. My husband was driving and couldn't see it except at the start. My son and I watched until it vanished."],"Object Features":"Wings, Other","trends":["There have been 9 other sightings in Schererville","There were no other sightings in Schererville on or around June 20th 2008"],"Date of the Event":"06/20/2008 08:20 UTC","Latitude":"41.483185","files":["/var/www/straped/mufon/html2text/11262.html.txt","/var/www/straped/mufon/org/11262.html"],"Region":"Indiana","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.483185,+-87.4487(11262)&iwloc=A&hl=en\"> mufon case (11262) map </A>","City":"Schererville","Summary":"Looked lide the shape of a human but was flying. When I looked out the car window it appeared to have wing movement. It was all black","Date Submitted":"06/20/2008 08:20 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Longitude":"-87.4487","Case Number":"11262","Log Number":"US-06222008-0003","Sighting Duration":"Undisclosed","Object Shape":"Other","Disposition":"Unknown","Source":"MUFON","Country":"United States","Weather Factors":"Unknown"}