{"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-06222008-0001","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around April 1st 1974","This sighting has never been favorited.",""],"Latitude":"40.06325","Case Number":"11260","map":"<A HREF = \"http://maps.google.com/maps?q=40.06325,+-82.392434(11260)&iwloc=A&hl=en\"> mufon case (11260) map </A>","Object Shape":"Star-like","Summary":"Large Star-like UFO that turned into Orange Football Shape","Object Flight Path":"Hovering then path","Region":"Ohio","Weather Factors":"None","City":"Newark","Date of the Event":"04/01/1974 10:00 UTC","Date Submitted":"04/01/1974 10:00 UTC","Sighting Duration":"Undisclosed","Longitude":"-82.392434","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11260.html.txt","/var/www/straped/mufon/org/11260.html"],"Object Features":"Unknown","Source":"MUFON","Country":"United States","divs":["Sighting DetailsBack in the 70's when the weather would turn nice in the spring, a friend of mine who lived in the neighborhood and I would spend alot of time just walking around and talking about our lives in general. On one such night we were doing just that when we turned a corner and noticed what we at first thought was a large star hovering over the hill across the street from where we lived. After watching it for a few minutes we realized that it was no star -- it was too large and too close. As soon as we realized this fact the object suddenly changed into a football shaped orange light and began to move to what was our right until it was out of sight. Two weeks later we were out walking again and, turning the same corner, there it was again. And again it turned into an orange football ahaped light and slowly moved away to the right. A few weeks later I walked into chemistry class to find that another class had joined us in the room and we weren't going to be discussing chemistry that day. Evidently, three of the teachers in our school had been involved in a pretty spectacular UFO sighting one morning while driving to work on Rt. 16. They had reported the experience to MUFON and had asked the field investigator to come to our school and talk to us. Near the end of his talk he mentioned that he had been out in our neighborhood recently looking to verify a report he was working on -- a bright star-like object that turned into an orange football shaped light!! I told him that I had seen it also but that he was too late in the evening--it was already gone by that time. Then another boy in the class spoke up and said that he had also seen it -- he lived on the other side of the hill where we had seen it."],"Tags":"City"}