{"Country":"United States","Longitude":"-121.940637","Viewing Distance":"Over One Mile","Date of the Event":"06/30/1972 12:00 UTC","Region":"Oregon","Disposition":"Unknown","Case Number":"11273","Date Submitted":"06/30/1972 12:00 UTC","City":"Bonneville Dam","Object Flight Path":"Hovering then path","Object Features":"None","Tags":"City","Log Number":"US-06232008-0002","trends":["There have been no other sightings in Bonneville Dam","This sighting has never been favorited."],"Latitude":"45.644284","map":"<A HREF = \"http://maps.google.com/maps?q=45.644284,+-121.940637(11273)&iwloc=A&hl=en\"> mufon case (11273) map </A>","Summary":"Rotating ring of lights flew over mountain top","divs":["Sighting DetailsAt the time I lived at Bonneville dam on the Oregon side and was sleeping out side in the summer heat. It was late, perhaps 1 AM and I was looking at the stars and then noticed a illuminated ring that appeared over the mountain on the oregon side of river. The craft was completely silent as it floated about the tree tops about 1.5 miles away. The ring then started to pulsate and slow down until there where several lights that where rotating slowly in one direction and then spin in the opposite direction. I watched for about a minute as the craft floated about, staying in the general area that it first appeared. Next I heard the sound of a helicopter approaching. The craft then moved and disappeared behind the mountain top and the sound of the helicopter faded. I was young at the time and very frightened. I tried to wake the other kids that where outside however everyone was asleep and did not see it in time. looking back on this experience many years latter I think it is possible that the craft could have been a helicopter with strobe lights on the tips of the rotor blades, however I do not know how it could have remained silent."],"Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11273.html.txt","/var/www/straped/mufon/org/11273.html"],"Object Shape":"Circle","Weather Factors":"Unknown"}