{"Summary":"30 to 40 feet tall about 20 feet wide. silver and it change to red very shiny.","Date of the Event":"06/19/2008 05:45 UTC","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/11272.html.txt","/var/www/straped/mufon/org/11272.html"],"City":"Camas","Region":"Washington","Longitude":"-122.399536","Date Submitted":"06/19/2008 05:45 UTC","divs":["Sighting DetailsI was working at camas meadows golf course and a co worker name toled me to take the garbage out so i did. I was looking around cuz i didn't really like my job and i was tring to \"gather my self\" and there iit was. I saw some thing about 40 ft in tall and 20 ft wide about 300 yards away and about 100 ft in the air.. it was about 40 ft above the trees after looking at it for a couple of min. It changed color from very shiny silver to a red still very shiny. I ask my self what could it be it wasn't a plane, it's didn't look like a ballon I mean to say there was no basket on it. I didn't know what it was and I had no I dea what it could be. it was floating it just kinda drifted away to to the right of me. I was shocked i had never seen anything like it I mean balloons upside down rain drops this looked more like a coke can than any thing and it was way to low to be a ballon. I was very surprized. but the wind was blowing in to where I was standing. I whent in after four or six mins. of looking at it because I didn't want to get in truble and i still don't know what it is. I didn't have a photo cuz i was at work and I never carry my camera to work but never again."],"Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Camas","There were no other sightings in Camas on or around June 19th 2008"],"Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Windy, Light","Case Number":"11272","map":"<A HREF = \"http://maps.google.com/maps?q=45.587063,+-122.399536(11272)&iwloc=A&hl=en\"> mufon case (11272) map </A>","Latitude":"45.587063","Object Shape":"Cylinder, Other","Log Number":"US-06232008-0001"}