{"City":"Nashville","Sighting Duration":"00:00:30","Case Number":"11283","files":["/var/www/straped/mufon/html2text/11283.html.txt","/var/www/straped/mufon/org/11283.html"],"Source":"MUFON","Disposition":"Unknown","Weather Factors":"None","Latitude":"36.17211","Log Number":"US-06232008-0012","Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Teardrop","Date of the Event":"11/30/1967 12:00 UTC","divs":["Sighting Details In either 1967 or 68, my father, neighbor, and I were going to play golf at Henry Horton State Park. We were on 31E, heading into Madison Tn., when a glowing silverish red object, tree top high, crossed the highway in front of us. It looked as if it had just entered the earths atmosphere. The glow looked similar to a Nasa module that is red hot on the fringe of the craft but shiny silver in the center during re-entry. The craft definitely had a fuselage because of the glowing blue flame that was emitted from the rear and clearly visible compared to the glowing area in the front. The shape was similar to a light bulb but more teardropped in the front. It was actually similar to staring at a light bulb on its side. You could see the parameters of the outside but the glow restricted the sharp outside edge of the craft, except in the rear. It was approx. 30 ft long and 8 ft high. The craft crossed the highway parallel to the ground from south to north and disappeared over the trees to the north. It made no noise, but the bunson burner like blue flame flickered from the rear of the craft at the same pace as the approx. 30 mph speed it was traveling. It was viewed by us to be an UFO from the very beginning. I am a retired aerospace tooling liaison engineer and I worked 5 years, at Nasa, on the US Space station. I know what we witnessed was real. After we returned home, on the nightly news, Metro Police had chased one and there was some sixty sightings in Georgia."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.17211,+-86.779983(11283)&iwloc=A&hl=en\"> mufon case (11283) map </A>","Object Features":"Other","Date Submitted":"11/30/1967 12:00 UTC","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around November 30th 1967"],"Summary":"approx. 100 ft off the ground, it crossed the highway approx. 300 ft in front of us.","Longitude":"-86.779983","Tags":"City","Viewing Distance":"101-500 Feet","Region":"Tennessee"}