{"Case Number":"11296","Date of the Event":"11/30/2007 12:00 UTC","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Star gazeing with new camera.","Object Shape":"Other","Date Submitted":"11/30/2007 12:00 UTC","Longitude":"-118.237485","divs":["Sighting Details I was looking out the window in my kitchen early one A.M. when a particularly bright star caught my eye. It was e.s.e. in the sky above the tree tops in my back yard. I had recently bought a digital camera and unencumbered by the price of film I used it regularly. I got the camera and began to video tape the star, mostly to check out the capabilities of my new toy. Then I snapped a few stills, zooming in and out etc. It wasn't until several months later, when my memory was full( my camera mem.) that I started clearing out all the images that I'd saved. When I got to the star photos, which by the way I'd totally forgotten, I decided to see just how close I could zoom in. I played back the video, freezing it on the images that were not blurred by my movements and began to zoom in. I was shocked to find what was there. The shape alone was peculiar. Then I looked a little deeper, I saw something enshrouded by the glow. Inside of it. I sent these images earlier this year to You guys but never heard back from any one.I would sure like any input you might have. I'm a 40 year old totally sane male. I never gave much thought to Aliens beyond thinking that the universe was much to vast to be home to only Earth. Look froward to any response. John Birmingham"],"Log Number":"US-06252008-0002","Object Flight Path":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around November 30th 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Region":"California","files":["/var/www/straped/mufon/html2text/11296.html.txt","/var/www/straped/mufon/more/11296_submitter_file1__DSC08690.JPG","/var/www/straped/mufon/org/11296.html"],"City":"Los Angeles","Disposition":"IFO","Viewing Distance":"Unknown","Latitude":"34.057294","map":"<A HREF = \"http://maps.google.com/maps?q=34.057294,+-118.237485(11296)&iwloc=A&hl=en\"> mufon case (11296) map </A>","Tags":"City"}