{"Object Shape":"Bullet, Missile, Cigar, Flash, Star-like","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/11298.html.txt","/var/www/straped/mufon/org/11298.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Minnesota","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.215215,+-93.600548(11298)&iwloc=A&hl=en\"> mufon case (11298) map </A>","Case Number":"11298","Disposition":"Insufficient Data","Date Submitted":"04/10/2005 11:45 UTC","Object Features":"None","Weather Factors":"Unknown","Date of the Event":"04/10/2005 11:45 UTC","trends":["There have been no other sightings in St. Michael","This sighting has never been favorited."],"Latitude":"45.215215","Log Number":"US-06252008-0004","Summary":"Bright slow moving Venus like object. Midday. Clear blue sky. Silent, About 10-15 thousand feet up","Object Flight Path":"Path with directional change","divs":["sighting detailsabout 11:40 am, on a clear blue sky beautifull day, i and 2-3 three other people noticed a bright star\\venus like object moving slowly(30-50mph) due north to due south. very brightly reflecting the sun, or ceating it's own light. if i squinted, i was barely able to make out a silver cigar like body, very hard to see with the glare. altitude was about 10 thousand feet. i've never seen anything like it. i have an aviation background, so i'm familiar with aircraft. i was in the military for 10 years, as a flight operation specialist( atc). eventually(20 min) it got about 5 miles away, and was still brightly visable lower on the horizon. as i watched, it made some sudden turns, and sped away at a rate that i can barely explain. almost like going to warp drive. that is a crude referance, but that is the closest i can come to describing it. i have 20\\20 or better vision, and i don't require glasses. i thought it may have been a drone aircraft at first, but why was it where it was, and the performance that it had when it left, was beyone what i know that unmanned drones can do. i is literally the first time that i saw something in the clear blue sky, that i could not identify. i also had 3 other witnesses. i believe one other was as intrigued as myself. the other 2 thought it may have been a helicopter. but it was too high and just did not fit was a copter sounds like or looks like. i have a helocopter aviation background, and i very familiar with them."],"Longitude":"-93.600548","City":"St. Michael"}