{"Weather Factors":"Unknown","Region":"New Jersey","trends":["There have been 2 other sightings in Wildwood","There were no other sightings in Wildwood on or around July 4th 1980"],"Summary":"Hovering blimp shape with multi-colored lights around edges","Disposition":"Insufficient Data","Case Number":"11292","Viewing Distance":"Unknown","City":"Wildwood","Latitude":"38.99178","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-06242008-0007","divs":["Sighting DetailsI was in Wildwood Nj over the Fourth of July weekend 1980 OR 1981 - I think the sighting was in 1981. I was waiting for everyone to get ready to go out, I was on the front porch of a rented house, looked up the street and saw this gigantic blimp shaped object hovering just over the electric lines. It was around dusk, not night-time. The object had multi-colored lights outlining it, I can't remember if they were on all the time, or blinking. It was partially obscured by buildings, and was between our house and the beach, about a block and a half from the beach. I swear I watched this thing for a good 20 minutes, no one else saw it. It just sat there in the sky. I had no feelings of \"Oh wow,I have to tell someone about this!\", and in hindsight, I'm surprised I had no reaction to seeing this thing.And NO, it was not a blimp, or a plane, or planes, it was unidentified. I went back inside at some point - the weird thing is, I forgot all about this event until years later, maybe 10 years later. Totally forgot it. Makes it even more bizarre. Now I've done a little research and I believe that it is the same UFO referred to as the Hudson Valley UfO. I've seen a photo of that one that is pretty identical to the object I saw."],"Date of the Event":"07/04/1980 12:00 UTC","Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/11292.html.txt","/var/www/straped/mufon/org/11292.html"],"Date Submitted":"07/04/1980 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.99178,+-74.814889(11292)&iwloc=A&hl=en\"> mufon case (11292) map </A>","Country":"United States","Object Shape":"Blimp","Longitude":"-74.814889","Object Flight Path":"Undisclosed"}