{"Object Shape":"Cigar","trends":["There have been no other sightings in Sredneuralsk","This sighting has never been favorited."],"Latitude":"56.998603","Source":"MUFON","Region":"Sverdlovskaya oblast","divs":["Sighting DetailsI and my girlfriend were sitting at an improvised beach on the shore of Sredneuralsk water reserve basin. We were not under effect of any alcohol or drugs. We only had mango juice and mineral water with us to drink. It was evening but the sun still shined hot. On the sky there were 2 layers of clouds, both rather sparse. There were several low placed, typical pillow style, dense clouds, and way higher above these, at about the height jet planes fly, there were the feathery thin, fine, semi-transparent clouds. Ironically, it was my habit of drinking *all* the fruit juice from the box that made me discover the UFO in the first place. I raised my eyes to the zenith while putting the juice box to my mouth. At first I noticed some tiny flies going chaotically about 30 to 80 cm above our heads. And then, looking through the gathering of flies, I noticed the UFO. It was a very small, wing-shaped (German WW2 era FW-190 fighter wing shape comes to mind as a close match) body that reflected solar light as if it was made of metal. At first split second I mistook it for a gleam of reflected light produced by my glasses, but it moved independently from the movements of my head. My next thought was that it's a small, sunlit spider borne by wind on a piece of its web (the wind close the ground was directed that way, roughly in the direction of the sun). But I looked harder, and the sharp lines of the UFO, perceived distance to it and its determined behavior made it clear to me that it was not any living creature I could compare it against. The UFO was traveling unnaturally fast for a plane, much less a helicopter. It produced no audible sounds. It changed its course slightly and abruptly, making a zigzag shaped trajectory (whereas man-made airplanes change course in a curve, and helicopters have to slow down before changing course at a geometrically precise angle; this UFO just went a different course without warning). I tried to show the UFO to my girlfriend (unlike me, she has perfect vision), but it was just too small and too fast moving. In less than 10 seconds I could no longer see it because it went under the high, thin cloud that was lit by the sun, making the UFO invisible on its background. My girlfriend was extremely interested in the UFO, so she began purposely staring in that region of the sky. In about 3 or 5 minutes, she noticed it again, because it came back and stopped, hovering up there at a height of several kilometers (we both coincided on such height estimate; the UFO was located in between the two layers of clouds). Within 15 or 20 seconds she explained to me where to look at to see the UFO, and I too was now able to see it. The UFO hovered in place. It looked like a cigar made of metal, orientated horizontally. It was making turns about the vertical axis, as if sniffing for something or looking around. The sun was to the right of it and slightly higher. When it turned to us its right side, we could see it reflect the sunlight. When it turned left side, we could see it as a dark shape, as if the object was opaque. When it turned away from us, we could not see it, as if it was thin in cross section. After about a minute of hovering, the UFO took off abruptly and flew away, disappearing over the background of clouds just like it did before. Our feelings were nothing beyond the expected. We are not UFO seekers, meaning that we don't take active interest in paranormal phenomena. Because of not being accustomed to seeing this stuff, we were thoroughly interested and happy from the fact that we finally saw a real UFO. We did not perceive our feelings or anything to be externally, explicitly manipulated by the UFO presence. All the other people on the beach were too busy with themselves (in their usual routine of drinking and cursing) to notice anything so sublime. Besides, they are the kind of people that seldom look at the sky at all."],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=56.998603,+60.483258(11297)&iwloc=A&hl=en\"> mufon case (11297) map </A>","Country":"Russian Federation","Object Features":"None","Weather Factors":"Windy, Light","Viewing Distance":"Over One Mile","Date of the Event":"06/22/2008 08:30 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"hard, opaque, metallic shining, fast moving and stationary, zigzag flight, no perceptible accelerations, distant, hard to discover by eye","Tags":"City","City":"Sredneuralsk","Log Number":"RU-06252008-0003","files":["/var/www/straped/mufon/html2text/11297.html.txt","/var/www/straped/mufon/org/11297.html"],"Longitude":"60.483258","Case Number":"11297","Date Submitted":"06/22/2008 08:30 UTC","Sighting Duration":"00:10:00"}