{"City":"Leavenworth","Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.596233,+-120.661476(11290)&iwloc=A&hl=en\"> mufon case (11290) map </A>","Object Features":"None","Latitude":"47.596233","Country":"United States","Region":"Washington","Date Submitted":"06/21/2008 10:30 UTC","Weather Factors":"None","Object Shape":"Chevron, Sphere, Star-like","Tags":"City","Summary":"Small light at \"tip\", possible lights coming off sides indicating chevron; small lights released from it.","Object Flight Path":"Stationary,Path with directional change,Path then hovering,Other","Date of the Event":"06/21/2008 10:30 UTC","Log Number":"US-06242008-0005","files":["/var/www/straped/mufon/html2text/11290.html.txt","/var/www/straped/mufon/org/11290.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Longitude":"-120.661476","divs":["Sighting DetailsMy fiance, close friend and I were walking down Skiview lane in Leaveworth, WA about 10PM when we noticed a light in the South similar in size to a star (it remained this sze throughout the sighting) moving erraticly and slightly flashing different colors. I believe it at first to be a planet with the clouds moving in front of it (there was partial cloud cover). But the movements were nothing like I could identify so we tried to decide if it could be a plane or helicopter. But it was moving in circles and in horizontal dips that were smooth, fast and like nothing I've ever seen. In addition to the movement it had lights that seemed to sit at the sides of the star like point of light, but did not flash and were about a quarter of the saze of the main light. The main light went through gradual patterns of blue, white and green. It seemed to move toward the mountains and the west slowly while continuing it's movements. My friend and I then noticed, much like you are able to see the dark side of the moon at night, that the object was chevron shaped. My fiance did not see this, but he wears contacts so it may have obstructed his ability to see it. As I noticed the shape I realized we could only make it out because the object was closer. I got fairly upset and wanted to go back to the house. It seemed to move off again. We went to the house, a three minute walk, and sat on the lawn. The object had moved further off west and continued its movements. We could see it was moving for sure now because we had the trees at my parents house as a reference point. My friend and I then noticed these lines of very very faint circles of light, in lines of maybe five coming off of the object and moving away. it also emmited these lights one at a time from the top and sides of the point of light at the seeming tip of the object. But not at the same time as the lines of light. My fiance stayed to watch the object while my friend and I got some binoculars. Through the binoculars my friend and I could see that the chevron seemed to be made up of very dim beams of light coming off the tip. They were greensih colored and were like isoceles triangles, thicker at the tip and diminishing as they ran away from the main light. It was similar to how northern lights look. My fiance did not see this, but he was having a hard time focusing the binoculars. About this time we decided to go inside as we were cold and nervous and had been witnessing the event for over an hour. I don't know what to think of the event, I do not really believe that aliens are coming here... It's very hard to describe the movements of this object, this is what convinced me it was not normal. These movements I can hardly describe, and have fairly rattled my views on the subject of UFOs."],"trends":["There have been 3 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around June 21st 2008"],"Case Number":"11290","Sighting Duration":"01:00:00"}