{"Case Number":"11302","Longitude":"-104.78075","Object Shape":"Blimp, Unknown","Date of the Event":"06/20/2008 02:20 UTC","Country":"United States","trends":["There have been 4 other sightings in Commerce City","There were no other sightings in Commerce City on or around June 20th 2008"],"Sighting Duration":"00:01:15","Viewing Distance":"101-500 Feet","Latitude":"39.887222","Tags":"City","Log Number":"US-06252008-0008","Source":"MUFON","divs":["sighting detailswhile going to work at dia, i was driving on 96th ave. and had just passed the entrance to the rocky mtn. arsenal. i saw a vehicle that i thought was a small plane that was going to land on the road. it was traveling west and i was going east. it came over the hill in front of me and i slowed down thinking it was landing, it passed over a car about 7\\4 mile ahead of me. i came to a stop and it began to move over the fields to my left(north). it was about 200ft. up and just off the roadway. i turned off my radio and rolled down my window. there was no sound. it was moving very slowly (2 mph). after 5-10 seconds a truck passed the intersection for the arsenal. i put my car in first and went on to work. when i got to the pena on-ramp i looked back and it was still over the same area. description- a large white globe type light near the front of the vehivle, but on the left side. this light illuminated the area to about 10ft. all around it. i could see the left side and it looked metallic and gray in color. there were 2 more light on this side of the vehicle(both red). about 30ft. to the right side(my left) there was another smaller white light. i couldn't see a wing on the left side(my right). it was maybe 25ft. from nose to tail and maybe 30ft. from the red light on the left side to the smaller white light on the right. the red lights were blinking. i've worked around all types of airplanes for 15 years. this was not any plane i have ever seen, and i don't think it was a helicopter because it made no noise. while driving and thinking about it i came to the realization that i did not have any idea what i had just seen. this probably could have been seen from c tower at dia. certainly could have been on their radar."],"Weather Factors":"None","Summary":"A vehicle 200ft. up, going slow, no sound, 4 lights","Object Features":"None","files":["/var/www/straped/mufon/html2text/11302.html.txt","/var/www/straped/mufon/org/11302.html"],"Object Flight Path":"Straight-line path","Disposition":"Unknown","Region":"Colorado","Date Submitted":"06/20/2008 02:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.887222,+-104.78075(11302)&iwloc=A&hl=en\"> mufon case (11302) map </A>","City":"Commerce City"}