{"Object Shape":"Triangle","Summary":"I was on a flight back from Europe and saw a strange light out the plane's window.","Log Number":"US-06262008-0004","map":"<A HREF = \"http://maps.google.com/maps?q=42.116056,+-70.671975(11311)&iwloc=A&hl=en\"> mufon case (11311) map </A>","Sighting Duration":"00:20:00","Source":"MUFON","City":"Marshfield","trends":["There have been 3 other sightings in Marshfield","There were no other sightings in Marshfield on or around June 19th 2008"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11311.html.txt","/var/www/straped/mufon/org/11311.html"],"Longitude":"-70.671975","Tags":"City","Object Flight Path":"Stationary","divs":["Sighting DetailsI was on a Swiss Air Flight from Zurich to Boston. It was around 6-6:15 pm (EST),Thursday June 19th, 2008. The plane was over the Atlantic about 45 minutes or so from crossing Newfoundland (I know that because I was watching the map monitor in the front of the plane's cabin which displayed where the plane was). Above I say Massachusetts and the U.S. because I had to put something in order to send this (and of course it was neither). It was, as stated above, over the Atlantic. Off to the left, ahead of the plane and considerably below was a very bright white light. At first I wondered what it might be, and when I realized that we were nowhere near land my curiosity picked up. It seemed too big for a ship (considering the plane's altitude) and there was too much light for a ship to display (especially given that there was still a fair amount of daylight out there). It did'nt seem to be moving, and eventually we passed it, and looking out the window and this time behind the plane I could still see it. It still shone with that very bright white light, and the shape seemed a little clearer (kind of like a pyramid except that the tip was not centered but significantly to the right). I assumed it wasn't moving, so I figured it wasn't a ufo or something (I have never before seen one, and it certainly wasn't another plane.) I wondered if it wasn't a big iceberg catching the sun's rays. A couple of days later I saw the story, with pictures, about the sightings in England. The shape of the ufo in one of the photos was exactly like I had seen, and the light was also white! Then I began to think about what I saw and it occurred to me that it was highly unlikely that it was an iceberg catching the light of the fading sun. To be specific, the light was the same (white and intense) when I looked at it ahead of the plane (to the West) and when I looked at it behind the plane (to the East). The sun was starting to set in the East, so how could it so brightly illuminate it as I observed it both to the West (ahead of the plane) and to the East (behind the plane). That didn't seem to make any sense. Also (though I don't know for sure), it might have been moving. It didn't seem so to me, but the plane was probably flying at about 500 mph, and an object moving -- but at a much slower speed (say 50 or 100 mph?) -- wouldn't necessarily appear to be moving. In any event, a very curious sighting (especially given all the events and photos happening just a few days later over England). Unfortunately, I didn't have a camera, so I didn't take any pictures."],"Date Submitted":"06/19/2008 06:10 UTC","Date of the Event":"06/19/2008 06:10 UTC","Case Number":"11311","Country":"United States","Disposition":"IFO","Viewing Distance":"Over One Mile","Latitude":"42.116056","Object Features":"Unknown","Region":"Massachusetts"}