{"Source":"MUFON","Date Submitted":"06/23/2008 02:30 UTC","divs":["Sighting DetailsI went for a motorcycle ride headed towards Hot Sulpher Springs near Winterpark, CO. To avoid the rain I took a county road 55 or Cottonwood pass. I noticed a dead cow and decided to investigate. What I found seems to be a classical mutilation case with anus cored, utters clipped, jaw portion removed and looks like it was cauterized. I should mention that the farmer thought that the cow had been dead no more than 48 hours or less, she didn't know how the 2 triangle marks could have been made in front of the utter. She also thought that the cow was pregnant and was puzzled that the animal had not been scavenged much. I took some pics, left the site, then came back and took more pics when the sheriff showed up to make a report. After I was leaving about 8pm went by the animal again. I was looking at the sky as it was raining in the direction I was heading. Then I saw a shooting star, very bright, very close and with an explosion at the end... Very strange night."],"Latitude":"40.093657","trends":["There have been 4 other sightings in Granby","There were no other sightings in Granby on or around June 23rd 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.093657,+-105.9377(11313)&iwloc=A&hl=en\"> mufon case (11313) map </A>","Region":"Colorado","Viewing Distance":"20 Feet or Less","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/11313.html.txt","/var/www/straped/mufon/more/11313_submitter_file3__landing.traces.jpg","/var/www/straped/mufon/org/11313.html"],"Longitude":"-105.9377","City":"Granby","Object Flight Path":"Undisclosed","Disposition":"Unknown","Country":"United States","Summary":"witness on motorcycle ride through mountains sees dead cow in mountain grazing land, stops to investigate","Weather Factors":"Unknown","Case Number":"11313","Date of the Event":"06/23/2008 02:30 UTC","Tags":"City","Object Shape":"Undisclosed","Log Number":"US-06262008-0006","Sighting Duration":"Undisclosed"}