{"Disposition":"Insufficient Data","Object Shape":"Circle","Summary":"This was the first of many I have seen here in Ore. It was a red circle that move sidwways up and downIt would turn to asmallblack dot then would come back to the red dot. My Mother was driving and my older brother was in the back seat watching it too.","Case Number":"11326","Region":"Oregon","City":"Medford","Longitude":"-122.870225","Source":"MUFON","Log Number":"US-06272008-0006","divs":["Sighting DetailsIt was a small red spot moving south from where we were. It would change to a smaller black dot. It would zig zag up and down side to side we knew it was not a plane from the airport by the way it moved. I was about 6 but remember it like it was yesterday.We was driving home from my gradmothers, She lived on Gibbon road,we were on our way home and had just turned on to Upton road when we seen it.This took Place in Central point Ore. I was a little scared for I was so young at the time. This was just the first of many I have seen through my life here in Ore. I seen one while was in high school. 6 of us went out to the river at gold rey dam, 3 of us seen it and 3 did not. It was the biggest one I have seen to date. It had a u shaped top with a flat bottem it was so big it looked like a large building in the sky, it looked 40 storys high. Like a big buiding in the city the front had some light on and some off, it also had 2 flood light in the front and1 in the back shining on the ground moving all around like it was looking for something on the ground. We have 2 large rock formations here in the rogue valley called table rock. one is lager then the other. This craft came right over the top of the big one and was as big as the top of table rock, I wasent scared more excited. I had one track me to the end of the road( Canes Creek)On to old stage. it was 10:30 and there was no help in sight. I leaned forward and it was right over my car mybe 25 feet up I was scared it joined 2 other and they all went over the mountin. I had one come off the trees right in front of my car my daughter was with me this time I also seen one shift change from a large disk to a small black triangle. call for more info, its just to hard to explane on the computer. I have also made drawings. I dont know if they took me on to there ships they could have. I dont remember it if they did. I know they are there,there is no way to explan other then I have seen many UFO,S. Thank you Leanna"],"files":["/var/www/straped/mufon/html2text/11326.html.txt","/var/www/straped/mufon/org/11326.html"],"Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Date Submitted":"08/15/1965 08:10 UTC","Tags":"City","Sighting Duration":"00:02:27","Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.334835,+-122.870225(11326)&iwloc=A&hl=en\"> mufon case (11326) map </A>","Country":"United States","Latitude":"42.334835","Date of the Event":"08/15/1965 08:10 UTC","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around August 15th 1965"]}