{"City":"Clearwater","Country":"United States","Object Features":"None, Unknown","Region":"Florida","Source":"MUFON","Object Shape":"Disc, Triangle","Date of the Event":"06/01/2008 09:30 UTC","Summary":"MULTIPLE UFO SIGHTING IN 1 DAY! FLOATING TRIANGLES AND A ROTATING DISC","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=27.970493,+-82.798293(11325)&iwloc=A&hl=en\"> mufon case (11325) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Latitude":"27.970493","files":["/var/www/straped/mufon/html2text/11325.html.txt","/var/www/straped/mufon/org/11325.html"],"Case Number":"11325","Sighting Duration":"03:00:00","Longitude":"-82.798293","Date Submitted":"06/01/2008 09:30 UTC","Weather Factors":"None","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around June 1st 2008"],"divs":["sighting detailsi have seen many ufos in the past year and i had just posted my accounts here on mufon a couple of days ago (5\\30\\08). not even a week later (monday june 01, 2008), i witnessed the most alien craft in 1 day. 9:30 driving with my buddy lucas to go pick someone up. i see a floating light descending from the sky ahead to the north as i have seen ufos do before. i was a little wary but continued driving. 9:40 as we were arriving to justin's house, i look to the north again and see 6-7 flashing and glowing light descending from the sky like earlier. they move behind the trees as we arrived at justin's house. we leave with justin heading west towards the gulf of mexico. 9:45 we turn north onto a street that runs along side clearwater beach we are now headed to brandy's house to pick up max, brandy, and john. now we can see the objects clearly. they were floating triangles. they had descended onto north clearwater and were now dispersing in all directions. the closest one was about 0.5 miles due east flying at 500-800 ft silently. it was an easily discernible triangle shape and it was wobbling as it floated. each tip was illuminated with intensely bright yellow lights and a red light in the middle. each light was flashing at separate intervals. the flash would create an intense glow around each corner. the middle red light would also become brilliantly bright. there were 2 other exact triangles in our immediate vicinity. we arrive at brandy's house. 9:50 max, brandy, and john tell us they can see the triangles at brandy's house. now collectively there is me, lucas, justin, max, brandy, and john. there is not enough room in lucas's truck so i had to sit in the trunk (which i kinda wanted to do anyway so i could see the sky). we proceed south towards largo. as we drove i could see the triangles every few minutes dipping around. as i am staring at one of the triangles hovering the car stops because we thought there was a big triangle approaching from the north. it actually turned out to be a 757 flying low. we laughed at the irony, but as we laughed i noticed that the triangle i had been staring at disappeared as the 757 arrived. 10:00 we continue south and arrive at a duncan donuts in largo. a few minutes after we arrive we spy a ufo headed east to west with a triangle formation of light on a bigger scale. it was about 150 long and was enormous. it was bigger than the 757 and made no sound as it floated slowly. we could see how thin the triangle was and were becoming frantic. 10:30 we head back north towards dunedin to john's house. halfway up there are twin white lights headed towards us from the north. the craft was enormous and the tip was pointed south. the strange thing was is that it was floating east slowly without turning. as we drove directly under it we can see a complex light pattern with up to 10 lights. i can see the design of the craft and it looks similar to an sr-71 blackbird, or the the ship that the x-men used in the movies. it was silent and stopped. the tip suddenly turned east and it rapidly accelerated towards tampa. we then arrive at john's house. 11:30 all of us had been chilling for awhile at john's house outside and i was still pretty excited about all the crazy things i saw so i looked towards the northern sky to see if anything was there. immediately i see a classic dark grey disc hovering and rotating about 100 ft directly above dunedin high school, the school i graduated from. i pointed it out to my friends and then it started moving. it flitted down and to the right really fast, and then quickly back up to the top right a little bit. it kept flitting around in the same general vicinty and every once in a while a faint blue light would turn on and spin around with the disc. from just seeing a few minutes of this event we are all wiggin out so we run out into the street to meet up with the ufo. as we approach the saucer it's movements become more erractic and then it zooms off out of view in an instant. we returned to john's house and didn't see anything else the rest of the night. some conclusions that i can draw from these sightings is that there's alot of crazy shit flying around here right now and i've noticed that ufo sightings have exploded around the world in the past few months. what i can concur is that either the governments around the world have invented and distributed super technology and have not released it to the public, or aliens are starting to make contact and have given the technology to the us government. it just freaks me out that i don't know if what's flying around is human or alien beings. i don't know how a human would be able to fly the disc i saw because it accelerated away so fast that the g forces would probably crush our heart. i'm guessing that the triangles are human aicraft because they just love chilling around macdill airforce base, but i'm sure that some of the rainbow and orange spheres, discs, and star like ufos i've seen are celestial beings. i hope they make contact soon because i want to have a space ship of my own and escape this planet with my friends and family!"],"Disposition":"Unknown","Log Number":"US-06272008-0006"}