{"City":"Tyler","Country":"United States","Tags":"City","Latitude":"32.35406","Date of the Event":"06/26/2008 09:15 UTC","Object Shape":"Saturn-like","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around June 26th 2008"],"Case Number":"11323","Region":"Texas","Summary":"was above the trees. It was hovering and then shot off.","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"06/26/2008 09:15 UTC","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=32.35406,+-95.294672(11323)&iwloc=A&hl=en\"> mufon case (11323) map </A>","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/11323.html.txt","/var/www/straped/mufon/org/11323.html"],"divs":["Sighting DetailsIt was around 8:45pm when i took my kids outside to go swimming. I wasn't really in the mood but my kids were getting upset so my sister sid shed go sit outside with me so that they could swim. So we were sitting around the pool watching the kiddos and just talking about her upcoming wedding. I would look at her and then the kids. Well when i was watching my kids i turned to talk to my sister and for some unknown reason i looked up to the side of me. There above one of the trees was a UFO hovering. It was orange on the bottom and blue on top. I know it sounds strange but it just looked like one of the ones always portrayed in movies. I didn't feel scared or anything but i kept staring at it for another 2 seconds which is really weird because i am your typical scardey cat. I do not like hearing or thinking of anything that could be defined an super natural. I had a feeling that it saw me watching so it finally took off and darted behind some trees and i lost sight of it. It actually made no sounds and was silent. I just told my sister \"i just saw a UFO\". She was like \"your kidding\" and asked me questions over and over. I wish she had seen it and not me because that type of stuff really interest her. I wish i had said something right when i saw it so she would have seen it to but i guess i was just confused as to what was happening. After seeing it maybe 5 minutes later there were about 3 planes flying low in the area. There is an airport near but at this time never are they that close or so many in such a short time period."],"Longitude":"-95.294672","Log Number":"US-06272008-0004","Weather Factors":"None"}