{"Log Number":"US-06292008-0001","Case Number":"11338","divs":["Sighting Details I am starting to get creeped out. I go months without looking up in the sky at night and then as soon as I do - strange happenings. Last night really took the cake. I went outside to look at the stars at about 3am. The first objects I noticed were aircrafts. The first one looked to be perhaps a commercial airliner.. the next one looked like it was some sort of jet but this one was leaving a trail off the back of it. Then I saw 2 airplanes come into view shortly later (10min) one after the other, they were going generally in th same direction but were in different areas of the sky. These planes, had two amber lights on the front and that was it. Every now and then a white flash would go off, but the only steady lights on these things were the two round big amber lights that made them look like a flying automobile. I then noticed an incredible white light as bright as the moon coming from the sky. I focused my binoculars on it but i could not tell what it was. i must have watched it for 30 minutes, which in that time, I saw more of my amber front light friends as well as a single white light, not as bright as the moon by any means, travel - steadily but not incredibly fast across the sky. - that happened twice. One thing I noticed was how quiet these aircraft were and if i hadnt of visibly seen them I would not have heard them. At some point after being outside roughly 15-20minutes all the neighborhood Birds and Bats and wildlife were going nuts. i mean nuts. I mean when I walked outside it was completely silent and then all of a sudden everyone was worked up.. the strange thing was for the amount of sounds around me I didnt see any birds or anything - until 1 bird swooped right in front of me on the porch, squaking away. my husband thinks i am a nut, but he was freaked out about the wildlife too."],"Date Submitted":"06/27/2008 03:30 UTC","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around June 27th 2008"],"City":"Washington","Longitude":"-77.032246","Summary":"Tons of activity last night in Pacific Northwest","Object Flight Path":"Undisclosed","Source":"MUFON","Date of the Event":"06/27/2008 03:30 UTC","Tags":"City","Weather Factors":"Unknown","Latitude":"38.904542","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere, Star-like, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.904542,+-77.032246(11338)&iwloc=A&hl=en\"> mufon case (11338) map </A>","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/11338.html.txt","/var/www/straped/mufon/org/11338.html"],"Viewing Distance":"Unknown","Region":"Washington"}