{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=52.92633,+-1.466639(11336)&iwloc=A&hl=en\"> mufon case (11336) map </A>","Tags":"City","Object Features":"Unknown","Source":"MUFON","Summary":"Very fast intense light streaking low across sky","Object Shape":"Unknown","Date Submitted":"06/28/2008 11:25 UTC","divs":["sighting detailsmy wife and myself were sitting out in the garden, when a very intense blue\\white light drew our attention to the sky, so intense was the light it illuminated the clouds from inside. the object seemed to pulse then shot off across the sky in a westerly direction at an incredibly high speed with a comet-like tail behind it (a bit like motion blur). the object made absolutely no noise. the weather was low level patchy clouds. at first glance we assumed it was a shooting star but since it was so low and travelled across the sky and it also managed to illuminate the clouds it passed through we decided that it could not be a shooting star. our location is heanor, derbyshire, england and it passed over us heading towards ripley and alfreton. the whole sighting only lasted a few seconds but it certainly unnerved both of us. to begin with we were surprised but this quickly turned to mild shock and trying to make some understanding of what we had actually seen. the object passed by across the sky in a westerly direction out of our field of vision. we seemed to not actually move to begin with, mostly through shock and then the wow factor. the speed at which it moved at was incredible, many times faster than the jets that sometimes fly over us. we live not too far from east midlands airport, the east midlands police helicopter landing site and we have a few local raf bases in the next county, so we are quite used to seeing and hearing various types of air craft flying above us, however, on this occasion it was something out of the ordinary."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"GB-06282008-0008","Latitude":"52.92633","Disposition":"Unresolved","Date of the Event":"06/28/2008 11:25 UTC","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/11336.html.txt","/var/www/straped/mufon/org/11336.html"],"Weather Factors":"Unknown","Longitude":"-1.466639","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Derby","There were no other sightings in Derby on or around June 28th 2008"],"Region":"England","City":"Derby","Case Number":"11336"}