{"Longitude":"-122.428586","trends":["There have been no other sightings in Half Moon Bay","This sighting has never been favorited."],"Object Features":"Undisclosed","Disposition":"IFO","Object Shape":"Other","Sighting Duration":"12:59:59","Tags":"City","files":["/var/www/straped/mufon/html2text/11332.html.txt","/var/www/straped/mufon/more/11332_submitter_file1__IMG_0287.JPG","/var/www/straped/mufon/more/11332_submitter_file2__IMG_0323.JPG","/var/www/straped/mufon/org/11332.html"],"Weather Factors":"Does Not Apply","Date Submitted":"06/07/2008 12:00 UTC","Region":"California","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.463552,+-122.428586(11332)&iwloc=A&hl=en\"> mufon case (11332) map </A>","Summary":"Energy orbs continuously entering my home and my head!","Latitude":"37.463552","City":"Half Moon Bay","divs":["Sighting DetailsI submitted a UFO report to Mufon in February, 2008 and was contacted by a Mufon Field Investigator three days later. The Field Investigator interviewed me for approximately 4+ hours on a Saturday afternoon, approximately 2 days after he contacted me to set up an interview day and time. I reported seeing stars all around my home and the city I live in which would move side to side, up and down. These star-like objects were always closer than most of the stars we are able to see with city street lights on during the evening. I have never heard from this investigator again, so I'm sure he must have decided I was not a credible witness and there was no one else to back up what I was seeing. I am at my wits end now because now I have light white to light blue energy orbs floating through the ceiling, walls, windows and doors of my home constantly. They are everywhere, including my closets! They blink tiny lights also, mostly in green, blue, white and red. I also seem to have a new gift (if that's what you would call it)! I can see stranger things in the sky during the day and night, such as windows opening that looks like there are silhouettes of people moving about, like in another dimension, everything being white in color against a blue sky during the day. I AM NOT CRAZY!! I now have someone (my brother) who lives about 6 blocks down the street from me (same street) who can also see orbs on the mirrors in his house! He says he just ignores them....well, I've tried that but they will not leave me alone! I actually have to go outside and run my fingers through my hair several times a day and evening and when I do that, all these energy orbs start floating away. Two weeks ago I developed a sore throat and cough which took about a week to overcome.....antihistamines did not work! I thought I was having an extreme allergy attack, even though I haven't had any problems for years and have lived in the same location for 18 years. I guess I should also mention that I listed my property with a real estate agent on June 10th. A couple of days ago, I became so congested in my head and nose as did my boyfriend. I decided to try a differnet antihistabmine and after taking it for the second time in 24 hours which was well within the doseage limits, I became extrenely dizzy, and upon standing up, I could barely walk! This is insane! I'm still having a problem with my balance from time-to-time and since then have delveoped a problem with my right eye, which seems like something is floating in the shape of an oval. I will be seeing my eye doctor this coming Wednesday. Yesterday, my real estate agent introduced me to an agent of a prospecctive buyer and he told me his wife has been plagued with the same thing as me for the past two weeks (however, I did not mention the orbs in my house or the UFOs, not stars dancing anymore, but UFO's, roaming all over the skies). Two messages have been left on a patio table since May 31st, that were done similar to a crop circle. I will include the pics I took with my digital camera. There is something very strange and now very scary to me that's going on in my area, and a further investigation needs to be done, possibly by someone who may have a special gift of seeing things differently, or possibly someone who has \"remote viewing\" capabilities. I really want and need to sell my property and don't want any attention drawn to my property that could affect it getting sold, and that's why I now just reporting this to you. I have nothing to gain and everything to lose by telling anyone about my dilemma, because my property is all I really own of meaningful value and it's my only means of survival for a retirement (unless the ET's or whomever is behind this engery orb attacks take care of me first). If someone could contact me to discuss the matter further, I would welcome the call! You just can't imagine how much I regret ever allowing myself to become interested in looking up in the sky (especially at night) and taking pictures with a digital camera in case I could capture a UFO or some other strange phenomenon. I guess I'm paying for it now!"],"Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"US-06282008-0004","Date of the Event":"06/07/2008 12:00 UTC","Country":"United States","Case Number":"11332"}