{"Viewing Distance":"Unknown","Date of the Event":"05/13/2008 12:00 UTC","Summary":"My first sighting of an unidentifiable flying object","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/11346.html.txt","/var/www/straped/mufon/org/11346.html"],"Disposition":"IFO","Tags":"City","Country":"United States","City":"Washington","Region":"Maine","Latitude":"44.273558","Case Number":"11346","Object Features":"Undisclosed","Date Submitted":"05/13/2008 12:00 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsAfter we put the kids to bed, we generally will go outside for a smoke. The evening in question was no different. Our land is in a wooded section of town covering a good deal of sky. However, we can still identify jets, single, double engined planes, and an occasional satelite despite the small sphere of vision. As well, we can see Polaris in our northen sky, and other important night time sky markers on our property. So this report doesn't come from a novice. We observe the day and evening sky with regularity. And there have been many times we've stood out there under the night time sky disappointed to have explained away a possible unidentified flying object. The object was star like in appearance. It caught my attention as it creeped up in the western sky, travelling in an easterly direction. It moved with the approximate speed of a satelite, but the light of the object would have fit better on a low flying jet, (or even a small plane for that matter, minus the blinking lights) on its approach to land. My first impression was that it was indeed a satelite, but it was simply moving too fast, and just too bright. It moved deliberatly with no sound. There is a jet highway that travels east to west over our house. On a moon lit night, you might see its trail, but otherwise just the faint blinking lights. And the sound will take at least six to ten seconds til its heard, rumbling like thunder in the distance. It lumbered over our heads, and we watched it cross over the road heading towards Rockland. This object was very hard to focus on. It was like it was simutaneously close and far away. My feelings were that we might be possibly witnessing something significant. I remember feeling indignant, but not fearful. We've both tried to dismiss this happening, but have no template in normal, everyday life to match this sighting with. The only other item of significance to this event, is that the next day we rushed our eldest son to the hospital on our physician's dire concern that what we'd thought was mononucleosis, was in fact some sort of cancer. Which it was in fact acute lymphoblastic luekemea. As to what this object was, we've no idea. But it certainly marks a day in our lives which we just as soon wish never happened. sincerly, judson todd stanley www.jtsarts.blogspot.com www.thecommanmanvideoclips.blogspot.com"],"trends":["There have been no other sightings in Washington","This sighting has never been favorited."],"Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.273558,+-69.367658(11346)&iwloc=A&hl=en\"> mufon case (11346) map </A>","Sighting Duration":"Undisclosed","Longitude":"-69.367658","Log Number":"US-06292008-0009"}