{"Region":"Texas","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around May 1st 1992"],"Case Number":"11348","Latitude":"30.276633","Disposition":"Unknown","Log Number":"US-06292008-0011","Object Flight Path":"Stationary","City":"Austin","Object Shape":"Disc, Oval","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11348.html.txt","/var/www/straped/mufon/org/11348.html"],"Viewing Distance":"101-500 Feet","Summary":"Dark grey saucer shaped with red bands of light silently hovering above trees","Tags":"City","divs":["sighting detailsi don't remember exactly when it happened, i remember i was about 10 or 11 years old so it would have been 1991 or 1992. it was late at night and my mom sent me to the neighbor's becasue she was helping her with a paper for school (we lived in family student housing and my mom went to ut austin). i stepped outside and looked up and saw a very large oval\\saucer shaped dark metallic object floating motionless and silently above a golf course that was across the street from our apts. all i remember is seeing the object, registering what it looked like and then without any apparent reason (later this seemed really weird) i kept on going as though it were nothing noteworthy and did not look at it again. i remember being at my neighbor's door knocking seconds later (they were just a few dozen feet away across a lawn)and only then, turning back to where i saw the craft, and nothing was there. i didn't say anything to anyone until a little later, when i started to think about how it couldn't have been anything i know - i.e. blimp, airplane, helicopter, balloon, etc. and i told my mom. i don't think she has ever believed me though, i was an imaginative kid, but i know what i saw, and the way i behaved doesn't sit well with me either. i would think a normal reaction would be to open the door, (i was right outside the door when i saw it) and call my mom out to see it with me, i would also think that i would have looked at it a long time - gawking - i mean it was weird! but i didnt, i only remember going about my business - without any thoughts really....not until later did i actually \"think\" about what i saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.276633,+-97.733911(11348)&iwloc=A&hl=en\"> mufon case (11348) map </A>","Date of the Event":"05/01/1992 11:00 UTC","Weather Factors":"None","Object Features":"Other","Longitude":"-97.733911","Date Submitted":"05/01/1992 11:00 UTC","Sighting Duration":"Undisclosed","Country":"United States"}