{"Sighting Duration":"00:10:00","Case Number":"11344","files":["/var/www/straped/mufon/html2text/11344.html.txt","/var/www/straped/mufon/org/11344.html"],"Date Submitted":"06/28/2008 05:30 UTC","Source":"MUFON","Latitude":"40.87187","trends":["There has been one other sighting in Coram","There were no other sightings in Coram on or around June 28th 2008"],"Longitude":"-72.995495","Region":"New York","divs":["Sighting DetailsWhile attending a graduation party in the backyard of my friends home, I was informed by a person sitting next to me to look up at the strange object. I thought it was a UFO. The object first rose up out of a wooded area then it hovered over the area at an altitude of about 3,000 feet. It began to swing back and forth for about 30 sec. then it leveled out and then acceralated very fast in almost a blink of an eye upwards then disappeared out of sight. The object was about 12 feet in diameter and was a dark metalliac charcoal colored tire inner tube shape it had a clear dome on top, on the center bottom it had a continuous red strobe light. I felt very suprised while seeing the object but somewhat reassured that there was about 35 other people with me who were also viewing the object. The object when it shot away at increadble speed headed North toward the Long Island Sound. A person at the party attempted to photograph the object but the perfectly good working camera would not function. A new set of batteries was placed into the camera thinking that the new batteries already in the camera were defective however the camera refused to function. Oncer the UFO departed the area the camera worked fine."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.87187,+-72.995495(11344)&iwloc=A&hl=en\"> mufon case (11344) map </A>","Weather Factors":"None","Date of the Event":"06/28/2008 05:30 UTC","Country":"United States","Object Flight Path":"Hovering then path","City":"Coram","Object Shape":"Circle","Log Number":"US-06292008-0007","Viewing Distance":"101-500 Feet","Summary":"Shaped like an inner tube with a clear dome on top flashing red light on bottom center","Object Features":"Dome","Tags":"City","Disposition":"Hoax"}