{"Object Features":"Unknown","Weather Factors":"Lightning, Light","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Path with directional change,Path then hovering","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around June 29th 2008"],"Latitude":"32.35669","Tags":"City","files":["/var/www/straped/mufon/html2text/11350.html.txt","/var/www/straped/mufon/org/11350.html"],"Country":"United States","Disposition":"Unknown","Viewing Distance":"21-100 Feet","Summary":"Across Lake Palestine - in small bay, 4 Ufo's - one star-ish in sky seeming to communicate w/ 3 others that seem to spotlight lower on the ground. The ones close to ground seem to change color. All would dim when a boat went out to investigate.","Date Submitted":"06/29/2008 10:00 UTC","Source":"MUFON","City":"Tyler","Longitude":"-95.292682","Date of the Event":"06/29/2008 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.35669,+-95.292682(11350)&iwloc=A&hl=en\"> mufon case (11350) map </A>","divs":["sighting detailsfirst, this happens alot but these particular days saturday and sunday night i was able to see more activity and make out that these aren't just reflection lights or lake lamps, etc. the lights come as soon as darkness falls, but don't seem to start moving around until later around 10 or so. i've seen the same thing repeatedly, i've already reported what i saw earlier in the month. basically, a bright light will be hiding (not too well) in trees in property across the street and then dimmer spheres dance around in the spotlight the brighter light provides. at first i thought they were animals, but i can't clearly make that out - what i can clearly make out are dim spheres that seem as though they are looking for something - they go in and out of focus, so i think they could be changing shape, but i can clarify the spheres for periods of time. then lights that change color fly across the lake - i hesitated to report b\\c it could be jetski lights or whatnot, but sunday night i saw clearly - these are just spheres of light and i was able to see the reflection in the water and they were so bright - no jetski for sure. i don't think i'm the only one noticing - we just moved here so i don't want to go ask the neighbors about the \"ufo's\" ,but i noticed a boat came out several times turning off it's lights and checking things out and then last night i saw the sphere go towards my neighbors boat house and then disappear...next thing i know the neighbor is out w\\ a flashlight looking for something around his boathouse. also, way up in the sky - like a star - it seems this one dances around from place to place and blinks and dims seeming to communicate with the other lights. the ones lower to the ground don't always stay together - they will split up and the star up in the sky will jump from place to place."],"Region":"Texas","Case Number":"11350","Object Shape":"Sphere, Star-like","Log Number":"US-06302008-0001"}