{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/11359.html.txt","/var/www/straped/mufon/org/11359.html"],"Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.706981,+-97.085595(11359)&iwloc=A&hl=en\"> mufon case (11359) map </A>","Object Features":"Unknown","Latitude":"36.706981","Object Shape":"Star-like","divs":["Sighting DetailsI am a 65 year old male, retired Naval Flight Officer (USN) & retired police officer. When I was about 10 or 11 years old, my brother and I were out with star charts, locating stars, constellations, planets etc. I noticed one \"star\" was moving. It appeared very like a star in size and brightness. Just a dot of light. I would have guessed it was 3 or 4 miles distant but with no background reference or true idea of its actual size it would be impossible to say for sure. It was moving fairly slowly against the background of stars about 30 degrees above the horizon. The actual speed would, of course, be a function of it's actual distance from me. I then noticed it was changing directions almost instantaneously. It would fly for a few seconds or a minute then take a new direction with no noticeable curve, just assume a new direction. It ended up milling around in a few degrees of sky. I remember seeing it fly in what appeared to be triangles (up & R - down & L - horizontally back to the start). I also remember numerous right angle turns, left, right, up & down and also yo-yo moves up and down. True, every thing it did would not have been impossible for a helicopter. But helicopters show both navigation lights and flashing lights. In the 1950,s a helicopter flying aerobatics at night over Oklahoma without proper lighting would be less believable than a UFO. Helicopters were practically experimental back then. I remember thinking how strange it was and trying to figure out what it could be. I do not remember now how it ended. It may have \"flown off\" or just turned off it's light. I can't remember that at all. I mentioned this to my older brother recently and he does not remember it. I found that odd because I was duly impressed and have wondered about it for over 50 years. I would like to know how common this type sighting is. (star like, flying sharp angles). Also, for the record, I have seen Navy attack aircraft making dive bombing runs over Lake George bomb range at night. If you are positioned so that they fly overhead, dive going away from you them climb going away, from that perspective it makes it appear to be a straight down straight up yo-yo. It looks weird. But it's easy to explain. From the side the flight path would be a U, not a yo-yo. The object in Oklahoma did all this at all angles. It was not simply perspective. I am positive of that."],"Weather Factors":"None","City":"Ponca City","Sighting Duration":"Undisclosed","Longitude":"-97.085595","Country":"United States","Case Number":"11359","Region":"Oklahoma","trends":["There have been 4 other sightings in Ponca City","There were no other sightings in Ponca City on or around April 30th 1954"],"Date Submitted":"04/30/1954 09:00 UTC","Object Flight Path":"Path with directional change","Summary":"distant, single white light flying odd angles. (instant 90degree turns, etc.).","Tags":"City","Date of the Event":"04/30/1954 09:00 UTC","Log Number":"US-06302008-0011"}