{"Viewing Distance":"Over One Mile","Date Submitted":"11/17/2007 03:30 UTC","Country":"United Kingdom","Tags":"City","Weather Factors":"None","Source":"MUFON","Sighting Duration":"01:00:00","Case Number":"11357","Date of the Event":"11/17/2007 03:30 UTC","trends":["There have been no other sightings in Chorley","This sighting has never been favorited."],"Object Features":"Unknown","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=53.653511,+-2.632596(11357)&iwloc=A&hl=en\"> mufon case (11357) map </A>","Longitude":"-2.632596","divs":["Sighting DetailsMe and my friend were sleeping just outside my house on my trampoline one night and it was roughly 3.30am and we were just lead on the trampoline looking up at the sky as it was a perfectly clear night. I noticed a bright light that seemed brighter than the other lights and i thought it must just be a planet or something but i still thought it looked really quite close compared to lights around it. I pointed it out to my friend and he acknoledged that it looked weird. I just lead there on my back watching that one light for at least an hour, until suddenly it just accelerated at great speed. It went at least a few thousand mph but the weird thing was it went from stationary to an amazing speed instantly! after a few seconds of movment it just halted intantly then after about a second after stopping the light went out and it was just blackness in that area. I quickly asked my mate if he saw it but he was asleep. (I had my ipod on loudly and was definatly awake, i did not dream this.) I thought about what it could of been but i couldnt think of any possible solution that didn't result in it being of extraterrestrial nature of some kind."],"files":["/var/www/straped/mufon/html2text/11357.html.txt","/var/www/straped/mufon/org/11357.html"],"Summary":"bright light accelerated fast after being stationary!","Disposition":"Unresolved","Log Number":"GB-06302008-0009","Latitude":"53.653511","Object Flight Path":"Hovering then path","Region":"England","City":"Chorley"}