{"Latitude":"42.361531","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.361531,+-71.053253(11352)&iwloc=A&hl=en\"> mufon case (11352) map </A>","Log Number":"US-06302008-0003","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11352.html.txt","/var/www/straped/mufon/org/11352.html"],"Date Submitted":"03/31/1975 09:00 UTC","Region":"Massachusetts","Summary":"In or around the fall of 1975 in front of the Boston Science","Sighting Duration":"Undisclosed","Date of the Event":"03/31/1975 09:00 UTC","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsIn or around the fall of 1975 in front of the Boston Science Museum, Natalie Jacobson and her camera man were there filming a huge silver disc that had come up out of the Boston Harbor behind the Museum. I was there with three other friends and there were nearly 200 other people gathered around as well, not to mention all of the emergency vehicles. Why am I having such a hard time finding anything a,t all about the sighting. The vessel hovered above the electrical poles for close to fifteen minutes or even better. It took off in a super speed \"z\" type pattern when it left, going in the direction of Reading. Men in suits approached Natalie and her camera man who were not more than ten feet from my right shoulder, they took out the beta tape and kept it. I have been trying to contact Natalie in the hopes that she has something to say about the incident. ; I contacted OmonoSuns years ago, and they said the incident did happen, but that was all they had to say. Someone please contact me I would like to know if there is anyone else will to chat about the incident. raisedonraciio57@yahQo.com (*****It was later determined that this case occurred in the spring of 1975 ad not the fall as noted here*****)"],"Source":"MUFON","Object Flight Path":"Hovering then path","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around March 31st 1975"],"Object Shape":"Disc","Country":"United States","Case Number":"11352","City":"Boston","Disposition":"Unknown","Longitude":"-71.053253","Tags":"City"}