{"files":["/var/www/straped/mufon/html2text/11355.html.txt","/var/www/straped/mufon/more/11355_submitter_file1__2008-06-26_ghost-in-the-sky.jpg","/var/www/straped/mufon/more/11355_submitter_file2__2008-06-26_UFO_CementCityCemetary.jpg","/var/www/straped/mufon/org/11355.html"],"Country":"United States","Case Number":"11355","Tags":"City","Object Features":"Undisclosed","Summary":"photographed possible UFO while shooting digital images in pre-Civil War cemetery","map":"<A HREF = \"http://maps.google.com/maps?q=42.070042,+-84.330504(11355)&iwloc=A&hl=en\"> mufon case (11355) map </A>","Object Flight Path":"Undisclosed","City":"Cement City","Date of the Event":"06/26/2005 08:26 UTC","Disposition":"IFO","Latitude":"42.070042","Source":"MUFON","Log Number":"US-06302008-0007","Region":"Michigan","Object Shape":"Cigar","Longitude":"-84.330504","trends":["There have been no other sightings in Cement City","This sighting has never been favorited."],"Weather Factors":"Unknown","divs":["Sighting DetailsI didn't see the possible UFO until reviewing the hundreds of digital photographs taken over the course of one hour in a southern Jackson County, MI cemetery. I shoot with a Sony Cybershot DSC-H5, which is sensitive to the near-IR, and have been doing so for the past few months with a Lansing-area ghost hunting group (with some success). I visited a local cemetery for the first time to do some 'ghost fishing', i.e. go into a cemetery and shoot hundreds of digital photos in rapid succession to see if I capture anything anomolous. I began around 8:00pm EST on 26 June 2008 and finished up shooting around 9:00pm EST. I didn't feel, see or experience anything unusual. The only strange thing I photographed in the 500+ photos was possibly a UFO and not a ghostly apparition, mist or bright orb...the typical graveyard paranormal fare. When I initially looked at the image, I thought that perhaps I photographed the hat of a ghost materializing...but the closer I looked at it and the more detail that Photoshop pulled out of the source image, the more it appeared to possibly be a UFO. I've attached a cropped photo with magnified detail...a full, unaltered, un-processed image can be sent if you so desire. JW 30 June 2008"],"Sighting Duration":"00:00:01","Date Submitted":"06/26/2005 08:26 UTC","Viewing Distance":"Unknown"}