{"City":"Hillsboro","Viewing Distance":"Over One Mile","Object Features":"None","Longitude":"-122.983236","Summary":"as we were traveling east on hwy 26 a silver cigar shape object appeared above the hwy","Country":"United States","Log Number":"US-06302008-0008","files":["/var/www/straped/mufon/html2text/11356.html.txt","/var/www/straped/mufon/org/11356.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.526343,+-122.983236(11356)&iwloc=A&hl=en\"> mufon case (11356) map </A>","Tags":"City","Date of the Event":"06/28/2008 03:15 UTC","trends":["There have been 8 other sightings in Hillsboro","There were no other sightings in Hillsboro on or around June 28th 2008"],"Sighting Duration":"00:00:07","divs":["Sighting Details It was a clear day as my husband and I were traveling east on hwy 26 coming back from the northern oregon coast. There were nothing but hay fields on either side of the highway and not too much traffic. Up ahead I saw a fairly large silver object in the sky seeming to hover over the freeway. At first I thought it must be an aircraft that was reflecting the bright sun. It looked cigar shaped and I didn't take my eyes off of it because it seemed stange. As I watched, it became smaller and smaller and I thought that what ever it was it must be turning and fully expected to see that it was a plane but instead it simply disappeared. I searched and searched the sky for a number of minutes afterwards but saw nothing that could of been it. Although I was trying to discribe it to my husband as he was driving, it all happened so fast that he didn't get to see it. I wondered if it was a refection off of the dash board but could not find anything that could have made it and could not re-create it. I felt that the shape was like seeing the edge of a silver saucer partially revealled some how as if it had a \"cloking\" device, or had the capability to travel through different dimensions. The whole event only lasted 5 to 7 seconds."],"Object Flight Path":"Stationary","Latitude":"45.526343","Case Number":"11356","Object Shape":"Cigar, Oval","Region":"Oregon","Disposition":"Unknown","Date Submitted":"06/28/2008 03:15 UTC","Source":"MUFON","Weather Factors":"None"}