{"Viewing Distance":"501 Feet - 1 Mile","Region":"Virginia","Sighting Duration":"Undisclosed","City":"Undisclosed","Date of the Event":"06/29/2008 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.439523,+-78.651804(11354)&iwloc=A&hl=en\"> mufon case (11354) map </A>","Country":"United States","trends":[],"Tags":"City","Date Submitted":"06/29/2008 05:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"11354","divs":["Sighting DetailsAs I was waiting for a student to arrive at my home, I was standing outside admiring the white puffy clouds and deep blue sky behind. A comfortable temperature and beautiful day prompted me to wait outside. As I shifted my attention from the clouds to the blue sky I suddenly noticed a round silvery object travelling across the sky from south to north at a very high altitude. My first thought was that it might be a satalite however I believe the object to have been inside earth atmospere. I have over my home witnessed high flying planes( that look like planes even at high altitude), metiorites, the space station and the space shuttle passing over before dawn and on other occations and places have witnessed satalites move across the sky. The object seen yesterday had no wings or contrail and appeared to be round and silver. Size of the object would be difficult to speculate though it appeared much larger in diameter than a satalite. The entire sighting lasted about 30 seconds before it was obscured by a cloud. The object was not able to be spotted beyond this time. This was the 5th event or sighting I've has in my life. The previous 4 were not reported due to just plain old fear."],"Disposition":"Insufficient Data","Object Shape":"Sphere","Summary":"round object travelling approx. S. to N. above my home lasting 30 seconds before disappearing behind cloud.","Log Number":"US-06302008-0006","files":["/var/www/straped/mufon/html2text/11354.html.txt","/var/www/straped/mufon/org/11354.html"],"Object Features":"None","Latitude":"37.439523","Longitude":"-78.651804"}