{"Latitude":"38.03758","Date Submitted":"07/01/2006 01:00 UTC","Object Shape":"Unknown","Sighting Duration":"00:15:00","City":"Taylorsville","Viewing Distance":"Unknown","Log Number":"US-07012008-0005","Object Flight Path":"Undisclosed","Summary":"2 bright white lights, COMPLETELY SILENT, 80 meters above ground, travels slow or it can hover in one spot.","Country":"United States","Weather Factors":"Unknown","Region":"Kentucky","Longitude":"-85.337453","files":["/var/www/straped/mufon/html2text/11367.html.txt","/var/www/straped/mufon/org/11367.html"],"trends":["There have been 2 other sightings in Taylorsville","There was one other sighting in Taylorsville on or around July 1st 2006"],"divs":["Sighting DetailsMe and my girlfriend both worked the same shifts at Chatercom in Louisville KY and we would commute together to and from work. After work (around 12:00am) we would often visit a construction site (subdivision in progress just some black-topped coldisacks but no houses) off of the Taylorsville lake damn road. We went here to be alone together for a while before we went home (lived with her mom so this was our alone time ;) around 1 am we both noticed what looked like car headlights in the sky ahead of us. we soon noticed 3 pair of the lights flying in a strait line. They seemed really low 80 meters (just a little above the tree tops) and the lights were way more intense than anything I've ever seen on any aircraft. this would not be that unusual if there was some sort of sound but there was \"NO SOUND AT ALL\" and the lights would hover in one spot for minutes before moving. they all came from the same direction in total there was about 15 of them came in packs of 3 to 5 . They all seemed to come from the direction of the lake and end up going toward Louisville. They would all travel strait until they reached one point just about directly above us where they would separate travel in different directions then they would meet back up to begin traveling in a strait line again toward Louisville. The best way to describe it was a SILENT helicopter with two very large super bright spot lights mounted on the bottom. I could not see the shape of the craft because the lights were so bright. I must say the weirdness came from the craft feeling like it was 80 meters above me hovering and there was NO SOUND AT ALL all you can here is crickets and the occasional car in the distance. The crafts seemed to move a constant slow paced speed other than when they were completely hovering still. You can hear everything thing in this area because everything echos anyone that lives in this area will tell you the same (you can hear a car coming 10 minutes before it gets close to you.) But I could not hear the slightest sound from this craft. My dad which lives in the backwoods (Grays run road) about 5 minutes from this sighting said he has seen these crafts on more than one occasion hovering above the trees."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.03758,+-85.337453(11367)&iwloc=A&hl=en\"> mufon case (11367) map </A>","Date of the Event":"07/01/2006 01:00 UTC","Object Features":"Undisclosed","Source":"MUFON","Tags":"City","Case Number":"11367"}