{"Weather Factors":"None","Tags":"City","divs":["sighting detailsi am a retired naval flight officer and retired police officer, 65 years old. i was a lieutenant and the navigator-communicator on a navy patrol plane back in the 70's. we were on a mission headed s. out of iceland and were located a couple of hundred miles w. of uk. we were flying at 300 ft. altitude and about 280 knots. the first thing i noticed was a metal sphere floating on the water. round as a beach ball and about 20 ft. in diameter. i just happened to spot it while looking out the window. we were still a long way from our assigned search area. i called it on ics and dropped an on top (electronic position marker). we were emcon (unable to turn on radar, radio or any electronic emissions for security purposes}. flight circled back and we looked for it a couple of passes but it was getting dark and we had an assigned search to do so took up our original southerly heading. this sphere may have had nothing to do with the ufo sighting that followed. i observed no connection between the two but mentioned it because they happened so close together. it could have been some odd buoy adrift. a few minutes later someone called on the ics that there was a bright light on our starboard side. i looked out and sure enough there was a bright (glaring) day-glo green light i would guess 1\\2 mile off our starboard wing. the light was so bright i could not see the craft that it was on, just the light. looked like nothing i ever saw before. it was at our altitude and keeping pace with us exactly. could not make a radar sweep without letting the russkies know we were coming but i sure wanted to. the whole crew watched it. i watched it as much as i could but had my navigation and logs to keep up. every time i looked out it was just out there, bright, greenish and staying in one place relative to the airplane. i guess about 20 to 25 minutes later i heard the pilots in the flight station on ics say \"there it goes, there it goes\" then state that it was speeding off in front of the aircraft. i stood up and went forward (2 steps) to the flight station but it was already over the horizon. i remember they were amazed at it's acceleration & speed. i had logged the sightings on the official flight logs and turned it in at debrief. i remember some of the officers on the crew did not want me to but i had seen it, logged it and was not going to alter logs to look less controversial. i figured i would let the wing debriefing officer figure it out or hide it if he wanted to. i was never ask about it again by the navy and no official mention of it was ever made of it to my knowledge after i turned in my logs. there were ten or twelve witnesses aboard but it would be hard to locate them. i was nav-com on one crew and tacco (tactical officer) on another and i don't remember which crew was which. i could look in my old cruise book and find out but those guys are scattered all over the world now. all of them were my friends."],"trends":["There has been one other sighting in Royal Tunbridge Wells","There were no other sightings in Royal Tunbridge Wells on or around May 31st 1975"],"Region":"","Log Number":"IS-06302008-0013","Sighting Duration":"Undisclosed","Date Submitted":"05/31/1975 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.135659,+0.265814(11361)&iwloc=A&hl=en\"> mufon case (11361) map </A>","Object Shape":"Other","Object Flight Path":"Straight-line path","City":"Royal Tunbridge Wells","files":["/var/www/straped/mufon/html2text/11361.html.txt","/var/www/straped/mufon/org/11361.html"],"Case Number":"11361","Summary":"Bright day-glo green light flew alongside our aircraft over the mid-atlantic ocean.","Country":"United Kingdom","Source":"MUFON","Object Features":"Unknown","Longitude":"0.265814","Disposition":"Unresolved","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/31/1975 08:00 UTC","Latitude":"51.135659"}