{"Latitude":"52.44204","divs":["Sighting DetailsI was only 4 years old and living on my grandfathers farm in Zaandam, North Holland in the Netherlands. It was around 9 pm - late for me - and it was a rare sultry October evening in North Holland. My parents were gone that night and OPA slipped into his klompjes and we meandered outside wondering why it was so humid & warm and why the little lake and the tiny canals around our farm were not frozen solid - like yesterday? Deftly he swung me over on his strong shoulders - both my legs dangling - when he pointed to the sky and we saw a cigar-shaped hull with 6-8 colored lights, in a row, on both ends. Grandma was called and said it was not a blimp in that it was too skinny and had nothing dangling beneath it. So said grandma. The year was 1952 - and Opa and Oma thought Hitler was back. From the middle there were several bright lights shining down on a few of our Holstein cows but the beam of each light did not go all the way down to the grass. It hovered. I remember thinking it was strange in that it was still dark under and around the cows. Only the back of the cows were lit up brightly. We watched this giant move slowly across our farm and then to the next farm. Suddenly it sped straight up, going neither left nor right, until it became a dot - smaller and smaller. The whole sighting (in my 4 year old mind and as it was told to my grandmother) lasted only 30 minutes or so. I was preparing my stallion to go to school the next day when I noticed that the lake & canals were frozen again. My grandfather died @ 84 a few months later even though he was in perfect health. I always wondered whether this new UFO paradigm could not occupy the same mind as the old paradigm he was so used to - and he succumbed to the discord. My grandmother died 5 month later from a broken heart. My parents sold the farm and we moved into the big city Amsterdam. I started Montessori school the same year. Too many funerals for me. I became enlightened instead. Suddenly I was able to learn at a much faster rate than before the UFO experience and I excelled in everything I wanted to do. Within just a few years I spoke 5 languages and I was considered a child prodigy. No one knew why. I did. I got my Ph.D. at the early age of 19 and never stopped studying. I became a drugless doctor and holistically healed thousands - without resorting to surgery. I'm about ready for retirement now - but I'll never forgot that time we saw that big spaceship hanging in the sky while I tightly hugged my grandfathers trembling bald head. Sin Cere Dr. AVB - Ph.D. MD"],"City":"Zaandam","Case Number":"11370","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"09/30/1952 12:00 UTC","Tags":"City","Object Features":"Unknown","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/11370.html.txt","/var/www/straped/mufon/org/11370.html"],"Viewing Distance":"101-500 Feet","Summary":"Light didn't hit the ground","Region":"Noord-Holland","trends":["There have been no other sightings in Zaandam","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=52.44204,+4.829199(11370)&iwloc=A&hl=en\"> mufon case (11370) map </A>","Country":"The Netherlands","Disposition":"Unresolved","Source":"MUFON","Date of the Event":"09/30/1952 12:00 UTC","Weather Factors":"Unknown","Log Number":"NL-07012008-0007","Longitude":"4.829199"}