{"Disposition":"Insufficient Data","Log Number":"US-07022008-0004","Tags":"City","Source":"MUFON","trends":["There have been 6 other sightings in Fox Lake","There were no other sightings in Fox Lake on or around June 20th 2008","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Latitude":"42.396687","Summary":"I did not know I captured an image until I downloaded those pic's.","Country":"United States","Weather Factors":"Unknown","City":"Fox Lake","Case Number":"11377","Longitude":"-88.183696","divs":["Sighting DetailsI am an amature storm chaser (Tornado's) when I took these pics. I captured the object on the very first photo and without realizing that there was something in the air. I sent the pic to a friend to analyze and he says he cannot tell what it is. He says it's not a fly, bee, bird, or any other man made object but did note that whatever it is, it is definately taking on the sun's rays on the correct side of the sun, (Whatever that means). I believe I was at Route 83 moving west on Route 173. But I am not exactly clear on that. Like I said before, I did not know what I had until I downloaded these pic's to my computer and the first initial thought from my lovely wife was \"OMG! That looks like a disc or flying saucer\". As you can see, I took 2 more pictures after the first one without realizing I had captured \"something\" at the first shot. Also, I did not want to report it but at the urging of my Wife and Friends I'm doing it now. Please let me know what you think this is. Thank You, Ralph Nickel"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"Illinois","Date of the Event":"06/20/2008 12:00 UTC","Object Shape":"Disc","Sighting Duration":"00:00:01","files":["/var/www/straped/mufon/html2text/11377.html.txt","/var/www/straped/mufon/more/11377_submitter_file1__PA210001.JPG","/var/www/straped/mufon/more/11377_submitter_file2__PA210002.JPG","/var/www/straped/mufon/more/11377_submitter_file3__PA210003.JPG","/var/www/straped/mufon/org/11377.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.396687,+-88.183696(11377)&iwloc=A&hl=en\"> mufon case (11377) map </A>","Date Submitted":"06/20/2008 12:00 UTC"}