{"Object Flight Path":"Undisclosed","divs":["Sighting DetailsI'm sitting out in the backyard in the desert. Very clear nighttime sky. An object that was reddish white moved into my view in a north north east direction and kept a straight line into the distance. It did not meet with the horizon, and the vanishing point was higher up in the sky. The strange thing about it was it didn't have any flashing lights on it like a plane or helicopter would. It made no sound. The light seemed very high up, and larger than an aircraft, and the vanishing point was also higher than any normal aircraft. I watched it vanish into the distance but much higher up from the horizon. Weird. Only other thing I can compare it with would be the coloration of a blood red moon.. Bright, and the color was dullish red. I wanted to report it simply for the fact that the vanishing point makes no sense to me. It faded much higher up in the sky than normal aircraft would. And if anyone else saw anything tonight too. No trail like a shooting star would make and about one quarter the speed of a shooting star. It slowed progressively, and got smaller and smaller until it disappeared, and faded very high above the horizon compared with normal aircraft when they would pass over this area. I have never seen anything like it before."],"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Country":"United States","Date Submitted":"07/02/2008 12:00 UTC","Log Number":"US-07022008-0002","Longitude":"-112.070637","Region":"Arizona","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11375.html.txt","/var/www/straped/mufon/org/11375.html"],"City":"Phoenix","Summary":"Bright Reddish White Light","map":"<A HREF = \"http://maps.google.com/maps?q=33.455217,+-112.070637(11375)&iwloc=A&hl=en\"> mufon case (11375) map </A>","Case Number":"11375","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around July 2nd 2008"],"Object Shape":"Star-like, Unknown","Tags":"City","Latitude":"33.455217","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"07/02/2008 12:00 UTC"}