{"Summary":"This happened June 24, 2008 in Steuben County, Indiana...","Country":"United States","Region":"Indiana","Date of the Event":"06/24/2008 10:15 UTC","divs":["Sighting DetailsThis happened June 24, 2008 between 10:15 and 10:30 pm in Steuben County, Indiana. My sister and I were headed home from our mom's house, going north on CR 225 W near Pleasant Lake, Indiana. About halfway up in the northern sky, right ahead of us, I noticed a bright amber-colored oval-shaped light. At first I thought it was a bright star or planet, but as we drove, it got bigger and we got closer to it. I knew then it was not a star or planet. As we approached the corner of 225 W and 500S, near the Boy Scout Camp, the light turned red suddenly. Then just as suddenly it went out like someone turning out a light bulb. It never re-appeared. It didn't go behind a cloud. It just went out and disappeared. I've looked for it every night since and had no luck. It was the very definition of a UFO - an unidentified flying object. I felt eerie, and knew I had seen something totally out of the ordinary. You want to see one your whole life, then when you do, it's scary! Another thing is this - I too have heard the jet noises and loud booms that have plagued other Hoosiers this spring and summer. One of the booms woke me out of a sound sleep a few weeks ago. I've heard the jet noise while out with my dogs at night - it's like ten jets flying low all at once, then complete silence and nothing to be seen. Not sure if all of this is related or not."],"Longitude":"-85.016076","trends":["There have been no other sightings in Pleasant Lake","This sighting has never been favorited."],"Object Flight Path":"Stationary","Date Submitted":"06/24/2008 10:15 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.575328,+-85.016076(11371)&iwloc=A&hl=en\"> mufon case (11371) map </A>","Latitude":"41.575328","Tags":"City","Disposition":"Unknown","Object Features":"None","City":"Pleasant Lake","files":["/var/www/straped/mufon/html2text/11371.html.txt","/var/www/straped/mufon/org/11371.html"],"Case Number":"11371","Sighting Duration":"00:15:00","Log Number":"US-07012008-0010","Object Shape":"Oval","Weather Factors":"None","Viewing Distance":"Unknown"}