{"Date of the Event":"06/27/2008 02:00 UTC","Weather Factors":"Unknown","Sighting Duration":"03:00:00","Tags":"City","Case Number":"11389","Viewing Distance":"Unknown","Log Number":"CA-07022008-0016","files":["/var/www/straped/mufon/html2text/11389.html.txt","/var/www/straped/mufon/more/11389_submitter_file1__0628080150.jpg","/var/www/straped/mufon/org/11389.html"],"Region":"Quebec","Object Features":"Undisclosed","Object Shape":"Circle","Summary":"It kept moving around very quickly went far away and came back very quick...","Latitude":"45.42381","Object Flight Path":"Undisclosed","Country":"Canada","City":"Ottawa","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.42381,+-75.690593(11389)&iwloc=A&hl=en\"> mufon case (11389) map </A>","Date Submitted":"06/27/2008 02:00 UTC","Longitude":"-75.690593","trends":["There have been no other sightings in Ottawa","This sighting has never been favorited."],"Disposition":"Unresolved","divs":["Sighting DetailsFriday night at around 10:00pm we saw an orange ball that looked like a flare but of course couldn't be since it was travelling in the sky at a very high altitude and then vanished. The light came from the North and travelled to the South. This happened 4 other times until about 12:30am. We thought it was strange but what are the odds of actually seeing a UFO. But later at around 2:00am I was outside on the side of the house smoking a cigarette when I saw it...It was up in the sky a very bright light was surrounding the round \"ship\" I noticed that one of the street light was off. I had my cell phone and when I went to take a picture it bolted out of here in a matter of seconds. I also noticed that when it left the street light turned back on. Few seconds later it came back and again the street light turned off again. I finally got a chance to take the picture with my camera phone. During those three hours the light would often move around very very quickly. At one point, we saw an airplane coming closer and closer and it looked like the \"ship\" did a 360 turn very fast to be face to face to the airplane and then left again. At around5:00am it just went higher and higher until we couldn't see it anymore. Sunday 2008-06-29 we saw it again at around the same time until about 5:30am...This time I was armed with a digital camera and actually filmed it but the pictures and film aren't the best...It's very strange because when I clicked I could clearly see what I was photographing but once I was ready to view it it wasn't very clear.On the 27th I was with my daughter and two nephews and on the 29th I was alone. I couldn't believe it!!! We couldn't believe it!!! i have many pictures and film."]}