{"Viewing Distance":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsWas out in back yard at 1:30 a.m. letting puppy out. Very, very dark out back, but noted flashes of bright white lights (thought they were shooting stars) that kept appearing high up behind the trees. As I was out back for a few minutes, it was not easy to miss these lights, as they were very bright, and it is very, very dark here at night. Could only see the lights but nothing else as there are very large trees scattered throughtout the neighbors yards. I wasn't scared, but rather curious; and I thought it was very odd at that hour of the morning to see these bright lights behind the trees. I was a bit freaked out, and went back in and went to bed. Did tell my 13-year old son, and husband, and mentioned it to my neighbor the other day because I have not been out in the middle of the night since, as I was completely spooked. Did not even give it a second thought again until today, when it was broadcast on the 5:30 p.m. news. Again, don't know what the lights were from, did not note any object and for sure will not be letting the dog out during those early AM hours again."],"City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around June 25th 2008"],"Object Flight Path":"Stationary","Date of the Event":"06/25/2008 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"None","Longitude":"-75.155949","Object Shape":"Flash","Log Number":"US-07022008-0011","Summary":"bright lights appeared in early am hours above trees; thought they were shooting stars","Country":"United States","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/11384.html.txt","/var/www/straped/mufon/org/11384.html"],"Case Number":"11384","Date Submitted":"06/25/2008 12:00 UTC","Latitude":"39.954065","Tags":"City","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.954065,+-75.155949(11384)&iwloc=A&hl=en\"> mufon case (11384) map </A>"}