{"Weather Factors":"None","Object Flight Path":"Stationary","divs":["Sighting DetailsI was sitting at a bus stop after work one evening at 7:12PM. I was taking digital photos with my new camera, an Olympus FE-310. The sky was overcast with thick grey clouds. The first photo I took was of the clouds, which shows nothing unusual. For the second photo, taken mere seconds after the first, I zoomed in a little and I noticed something was now in the sky. I thought maybe it could be either a blimp, though they do not move fast enough to just appear in the second photo; or an insect flew into frame and the black speck is just that, although in the photo, the speck feels very far away in the distant sky. I wish my camera imprinted the time and date down to the second, rather than just minute, to truly show how little time lapsed between both photos. I can, and would like to, submit both high-resolution untampered photos (3264x2448) for your review. maybe its just a blimp, maybe its more. Didn't think much at the time, except how strange it was that a 'blimp' could move so fast. Within less than a minute this shape appeared and disappeared. If I knew how to check for possibly aircraft over that location at the specific time on my own, I would look into it being a blimp. I photograph the sky all the time, and have gotten birds, planes, and blimps that I could identify easily with zoom functions. This I cannot. I have attached said photos, NOTE that the timestamp on them (in the file properties) states it as 7:12 AM, though it is actually PM, my camera was new and set 12 hours behind accidentally. Hope it may be of interest."],"Region":"Massachusetts","Date Submitted":"05/19/2008 07:12 UTC","Longitude":"-71.182832","Tags":"City","Sighting Duration":"00:01:00","Object Shape":"Blimp, Egg, Oval","Country":"United States","Object Features":"None","Date of the Event":"05/19/2008 07:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.37093,+-71.182832(11388)&iwloc=A&hl=en\"> mufon case (11388) map </A>","Latitude":"42.37093","Viewing Distance":"501 Feet - 1 Mile","City":"Watertown","Case Number":"11388","Disposition":"IFO","Summary":"Blimp-like object apears and disappears within less than 1 minute","files":["/var/www/straped/mufon/html2text/11388.html.txt","/var/www/straped/mufon/more/11388_submitter_file1__P5190145.JPG","/var/www/straped/mufon/more/11388_submitter_file2__P5190146.JPG","/var/www/straped/mufon/org/11388.html"],"trends":["There has been one other sighting in Watertown","There were no other sightings in Watertown on or around May 19th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Log Number":"US-07022008-0015"}