{"Log Number":"US-07022008-0010","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.956495,+-75.158279(11383)&iwloc=A&hl=en\"> mufon case (11383) map </A>","Latitude":"39.956495","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 20th 2008","This sighting has never been favorited.",""],"Summary":"WAS AWAKEN BY MY DOG HEARD NOICE,WENT OUT SIDE WITH HIM SAW THIS OBJECT IN THE SKYHUVERING","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11383.html.txt","/var/www/straped/mufon/more/11383_submitter_file1__003ufosighten.JPG","/var/www/straped/mufon/org/11383.html"],"Date Submitted":"04/20/2008 03:00 UTC","Case Number":"11383","City":"Philadelphia","Object Flight Path":"Path with directional change","Date of the Event":"04/20/2008 03:00 UTC","Weather Factors":"None, Does Not Apply","Object Shape":"Cone, Cylinder, Disc","Region":"Pennsylvania","divs":["Sighting DetailsIT WAS APRIL 20,2008 I WAS A SLEEP IN MY FALLS TOWNSHIP APARTMENT AND I WAS WOKEN BY NOICE. SOUNDS LIKE SCREEN RIPPING,I THOUGHT SOMEONE WAS RIPPING SOMEONES SCREEN.IT WOKE MY YORKIE ALSO HE WAS GROWLING, SO WE GOT UP, OPEN SLIDING DOORS OUT BACK.MY EYES WERE DROWN TO LOOK AT THE SKY, WHILE THE DOG WENT TO THE BATHROOM.I SAW THIS OBJECT HUFFERING AROUND THE SKY. IT FRIGHEEN ME I SHUT THE DOOR LEFT THE DOG OUT SIDE I THOUGHT I WOULD BE SUCKED UP THATS HOW BELIVEABLE THIS THING WAS. I WASNT REALLY A BELIEVER, I WOKE MY HUSBAND AFTER STANDING WATCHING THIS THING OVER THE YARD , FOR OVER A HALF AND HOUR .DOING A DANCE IN THE SKY. THE WAY IT SHUFFELED AROUND NO STRAIGHT LINE GOING OR COMNING. IT WAS LIKE SOMEONE HAD A DUST CLOTH WIPING A TABLE TOP THATS THE BEST WAY TO DISCRIBE HOW IT MOVED AROUND THE SKY,THERE WHERE LIGHTS COMING DOWN, LIKE A CONE SHAPE AND I ALSO SAW VERY LARGE DISC SHAPE LIGHTS ON THE BOTTOM OF THIS OBJECT AND IT WAS A VERY CLEAR NIGHT I LOOKED AT THE STARS AND KNOW NO WAY NO HOW WAS IT A STAR. AND IT MADE NO NOISE, NO MOTOR SOUNDS NO ,HELICOPTER, NO IT WASNT A PLANE, MY FATHER AND MOTHER BOTH WORKED IN AVIATION, MOTHER BOEING. V-22, MY FATHER CHIEF SUPERVIOSR OF TWA AIRLINES FOR 40 YEARS I GROW UP IN THE AIRLINE BUSINESS,I WOKE MY HUSBAND WHICH I NEVER DO. I SAID YOU KNOW I DONT BELIEVE IN UFO,BUT HON, I THINK THERE IS ONE OUT BACK. HE GOT UP AND WATCHED A LITTLE BIT AND HE SAID ITS NOTHING HE EVER SAW BEFORE, I ASKED MY NEIGBHOR WHO IS IN THE WILLOW GROVE AIR BASE THE NEXT DAY, ASK HIM IF THEY ARE DOING ANY TESTING .HE SAID 'NO WAY'' AND I PROMISED MY NEIGBHOR AND DAUGHTER IF IT HAPPENS AGAIN I WOULD CALL THEM AND IT DID TWICE SINCE THEN MAY,AND THAT HAPPEN AT 3.00AM AND ON JUNE 12 AT 1.30 AM MY DAUGHTER SAVED MY CALL ON HER CELL PHONE MESSAGE.SHE AND HER HUSBAND ALSO SAW IT THAT LAST TIME AND ALSO TOOK A PHOTO. I JUST READ A STORY TODAY IN THE PAPER AND CALLED JAMES MC GINNIS.AND FORWARD THE PICTURE I HAVE ,ITS WIRED, IT TURN OUT SO DIFFERNT ON THE FILM THEN WHAT I WAS SEEING. I WILL SEND IT TO YOU. MY NEIGHOR CAME OUT THE SECONG TIME IT HAPPEN I WOKE HER UP I PROMISED HER I WOULD, IT WASNT MOVING FOR HER,BUT SHE SAW IT. ITS USALLY IN ONE OR TWO PLACES,IN THE YARD.WHEN IT LEAVES, IT KIND OF SHUFFLES RIGHT SIDE WAYS INTO A CLOUD."],"Disposition":"Unknown","Longitude":"-75.158279","Tags":"City","Source":"MUFON","Object Features":"Unknown"}