{"map":"<A HREF = \"http://maps.google.com/maps?q=31.969819,+-99.895783(11382)&iwloc=A&hl=en\"> mufon case (11382) map </A>","Date Submitted":"06/28/2008 12:00 UTC","trends":["there have been 18 other sightings in cms\\tg n\\a","there were no other sightings in cms\\tg n\\a on or around june 28th 2008"],"Object Features":"Undisclosed","divs":["Sighting DetailsThe clouds, the clouds, they hide behind *within* the clouds. Does anyone remember what the sky used to look like? Lying on the roof at 5am on saturday morning, sober, sound of mind and gazing peacefully at stars splayed accross unusually clear skies. The city is sleeping as soundly as it ever does, everyone passed out after celebrating the end of another busy week. Venus (pretty sure) in the south, a little west. In come the whispy weirdo clouds, you may know the ones I refer to. Suddenly I feel a little strange. I havent used psychedelics in years, but the tears of joy reminded me of the deepest shades of mushroom blue. Between the clouds moving in from the southwest, I see the stars are moving toward the clouds. As they should be. An optical illusion of course, the stars arent really moving. But they are. Slowly. Not all of them. Dozens and dozens of them. Am I hallucinating? Trying to figure it out. They look and move like sattelites... Here comes the sun, obscures the stars and leaves me wondering if I dreamed the whole thing. To the south, venus, still blazing in the pinkish pre dawn glow. A single light, the intensity of venus, just west of venus herself. Coming toward me, an airplane no doubt. By now the clouds have taken on more substance, cumulus like and fluffy. Light moves slowly to the west, behind the biggest of the clouds. Emerges 15 seconds later, almost above my head. Twice the intensity of venus now, and obviously not a jet. Just a very blight light. Floating between the clouds, same speed, same direction. The following days... strange geometric shapes just barely disguised starngeness in the clouds. Triangles, cubes, and the like. What the hell is going on?"],"Viewing Distance":"Unknown","City":"cms/tg n/a","Object Flight Path":"Undisclosed","Summary":"The clouds.","Country":"United States","Date of the Event":"06/28/2008 12:00 UTC","Log Number":"US-07022008-0009","Sighting Duration":"Undisclosed","Latitude":"31.969819","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11382.html.txt","/var/www/straped/mufon/org/11382.html"],"Object Shape":"Undisclosed","Longitude":"-99.895783","Weather Factors":"Unknown","Tags":"City","Disposition":"Hoax","Case Number":"11382","Region":"Texas"}