{"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Object Shape":"Boomerang","Log Number":"US-07022008-0012","Weather Factors":"None","Date of the Event":"06/25/2008 01:00 UTC","Latitude":"40.16346","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=40.16346,+-74.824755(11385)&iwloc=A&hl=en\"> mufon case (11385) map </A>","files":["/var/www/straped/mufon/html2text/11385.html.txt","/var/www/straped/mufon/org/11385.html"],"Date Submitted":"06/25/2008 01:00 UTC","City":"Levittown","divs":["Sighting DetailsOn June 25th Between 1-130am i was on my front porch when i noticed a strange sound. sounded very similier to a passenger jet but not as low in tone and at a higher pitch. As i heard the sound i took a peak up in the sky and saw a boomerang shaped object fairly low to the ground roughly 1000ft off ground. it had white lights from the points of the boomerang spaced evenly to the middle of the boomerang and had a football shaped body with mirrored lights on both sides of the body with the back light being red the middle white and the last being green. It moved at a fairly slow pace. if you put your arm up at a 45 degree angle and move your arm right to left slowly for 1 second then from fingertip to fingertip it would have been 6 inches the boomerang shaped object moved. thats just a rough idea of how fast it was going. i watched it for a good 5 minutes and went inside just blowing it off as a airforce jet or some kind of jet till i saw the news paper article in the bucks county courier times and saw others had the same sighting. i just wanted to report it just to maybe help in identifying the object in your future investigation. feel free to contact me with any further questions Mufon may have in this matter"],"trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around June 25th 2008"],"Object Flight Path":"Straight-line path","Longitude":"-74.824755","Summary":"Witnessed Boomerang shape object","Case Number":"11385","Disposition":"Unknown","Region":"Pennsylvania"}