{"Date Submitted":"06/14/2008 12:00 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11386.html.txt","/var/www/straped/mufon/org/11386.html"],"Latitude":"41.881594","divs":["Sighting DetailsMy neighbor (girlfriend) and i were sitting in Indian Boundary park in Chicago (around Lunt and Western) on city's north side. I've lived here 30 years, seen countless planes pass overhead going toward or coming from O'hare airport perhaps 10 miles to the west. Ive seen birds, ballons, kites, etc. Anyway, we were facing north, sitting on a bench, sun sort of behind us about 10 or 10:30 in the morning. Had a clear view of the sky as the park is open all around. Planes went by under a very bright, glaring cloud cover, appeared small so clouds were pretty high up. It was so bright and hazy I put my sunglasses on over my distance glasses as i often do. Suddenly a white disc , brighter than the clouds and bright enough to be seen clearly came as it were from off to our 'left' (west) moving steadily east with a slight wavy motion but on a constant course. Moved faster than planes at that altitude had earlier. It seemed to be immersed inside the haze not on the cloud surface, like an object just inside the lower, hazy part of the clopud cover. About fifteen seconds in our view it came overhead, slowed, then all at once went vertically straight up inside the cloud cover, calculating the size of clouds by comparison to your average airliner I'd say it shot up hundreds of feet in a second or two, made a loop and came back down to about the same level, then moved steadily off toward the east. Whole thing took about 30- 40 seconds. It began to move behind tree branches blocking our view so I jumped up and stood to watch it. As it moved east inside the cloud cover it kept its shape and did not seem to grow smaller as it hadnt traveled that far, and eventually vanished in the haze. No way is was an aircraft headlight. Weird thing was that as it was moving away still bright enough to be seen even inside the brilliant cloudy haze I could make out what must have been huge v-shaped 'wings\" inside the circle of light. It reminded me of one of those v-shaped electric guitars you see. Just two wings, though I couldnt make out the point at which they jopined. They were clearly solid objects imbeded inside the circle of light, almost well concealed, but I could make it cout for about 8-10 seconds. i had on good quality sunglasses. My friend (age 55) was quite stunned, looking at me and asking what was that? over and over, though she had no sunglasses on and didnt see the wings. I was rather stunned too. I ran a number of ideas through my mind but was and still am certain the object being brighter than the sunny clouds had to be really powerfully illuminated ( more of a matte finish glow, not like a street lamp) and was self guided. I've waited until now to think about reporting it. I searched for similar sightings on the Web. Found only a few regarding circles of light in mexico. But this was during the day. An airline at that distance would have been smaller than the circle of light and wouldnt have done a huge loop. All I can say is that those wings were cloaked as it were inside the light as if it were a camoflage or something, they remained positioned inside the circle as it moved off and vanished in the haze more or less off to our 'right' i.e.it did not travel as far as the horizon."],"Log Number":"US-07022008-0013","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.881594,+-87.621098(11386)&iwloc=A&hl=en\"> mufon case (11386) map </A>","Summary":"bright circle-shaped light imbedded in bright, sunny cloud cover but brighter than clouds; giant v-shaped wings hidden inside","City":"Chicago","Object Flight Path":"Path with directional change","trends":["There have been 221 other sightings in Chicago","There were 3 other sightings in Chicago on or around June 14th 2008"],"Object Shape":"Circle","Longitude":"-87.621098","Region":"Illinois","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"11386","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Disposition":"Unknown","Date of the Event":"06/14/2008 12:00 UTC"}