{"Tags":"City","Disposition":"Unknown","Object Shape":"Cigar, Flash","divs":["Sighting DetailsI was taking the garbage to the road when I happened to check out the night sky. There is very little light interference where I live so you can see all of the stars on a clear night. Something caught my attention out of the corner of my eye. In the north east part of the sky, very high above the horizon, there was this oblong object moving to the south, very slowly. At first I thought it might of been a helicopter, but there were no navigation lights blinking. It was coming closer to my posistion when it seemed to stop and just hover. Then from the east I heard the definite sound of a jet. Pensacola Naval air station is close by and they fly jets over our area on a regular basis. With the oncoming jet I figured the object was just part of an excercise. But when the jet got directly over me I galnced at the object and it was no longer there. So I watched the jet, it seemed to be doing high speed manuveurs. After about five minutes, the jet headed south at a high rate of speed. Then almost directly above me, high in the sky, the object flickered for a few seconds then was fully visible. It began moving towards the south. As it passed to where I could see the back of the object I could definitely some kind of bluish exhaust exiting from the rear. It began moving faster, than with a bright flash of blue light, it zipped towards the south in the blink of an eye and was gone. I waited a little while longer and neither the object or the jet returned. I was really excited about what I witnessed. Maybe it was a new plane they are testing at the air base. Or maybe it was something else. Either way I've been looking skyward since. I hope this can help in your research. Thank you for your time! I have ten minutes of video footage but the file is too big to transfer to my computer. Although it only shows static, I didn't know if you may have a test you can run to find what caused the interference."],"Region":"Alabama","Object Features":"Unknown","trends":["There have been no other sightings in Robertsdale","This sighting has never been favorited."],"Case Number":"11395","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date of the Event":"06/28/2008 10:25 UTC","Latitude":"30.553805","Summary":"Hovering bright cigar shaped object. Visual blue exhaust, no noise.","Date Submitted":"06/28/2008 10:25 UTC","City":"Robertsdale","Weather Factors":"None","Log Number":"US-07032008-0003","files":["/var/www/straped/mufon/html2text/11395.html.txt","/var/www/straped/mufon/org/11395.html"],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-87.711932","map":"<A HREF = \"http://maps.google.com/maps?q=30.553805,+-87.711932(11395)&iwloc=A&hl=en\"> mufon case (11395) map </A>","Source":"MUFON"}