{"Disposition":"Unknown","Object Shape":"Star-like","Tags":"City","Weather Factors":"Unknown","Summary":"Star-like object/objects south of Phoenix, Arizona","Log Number":"US-07032008-0002","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","divs":["Sighting Details I went outside (22:30-22:45, 1 July 08) to have a smoke and looked up to the sky, as I always do. I quickly noticed what I thought was a shooting star and said to my friend, while pointing at it, \"look a shooting star\". (the object was approximately 25-35 deg. above the horizon traveling from east to west, about the brightness of a medium star, it did not twinkle and had no trail, kind of like a sattelite but moved much faster, no blinking lights or aviation lighting, we were in east central phoenix looking south-southwest, it was a clear night) My friend aknowledged also seeing it and as we both were looking it the object made a \"sideways U-turn\" completely reversing direction, now traveling from west to east, then we lost it. We both looked at eachother in amazement saying \"did you just see that?\" Yes infact we both did. We turned off all outdoor lights and in 2-3 min. saw it come back, now from the east going back west, and lower on the horizon 15-20 deg. We stood there not beliving our eyes and watched this starlike object fly all over the sky, staying 5-25 deg. off the horizon moving in every direction possible,using 80-90deg. laterally and being able to vary its speed and direction at will. It could change direction with out slowing down. We watched it do this for about 30 min. then lost it. We called out my friends room mate to have him take a look and in about 5 min. the object reappeared. I don't think he belived what we were telling him until he saw it for himself. Sure enough though he did see it.(one of the guys there described it like a bee flying, I would agree except it never appeard to hover, it was always in motion but very much like the flight path of an insect a gnat maybe) As all three of us are wacthing a second one appears. They were not flying in any type of formation but it was evident that they were quite aware of eachother. Darting adround in the sky sometimes paralelle to one another, somtimes opposite directions, sometimes trailing eachother, sometimes doing their own thing. There was no rhyme nor reason to their movments. Their movement would go in a straight line then change direction, then speed change, then zig-zag, then speed again, then straight line again ect., not keeping any patterns or staying concistant however it was all done very smoothly and what seemed to be very percise manuvering. We watched the two do this for about 45 nim. then the thrird one appeared. Same in every way as the first two. All three were visible in the sky for about another 25-30 min., then it dropped down to two. Our last sighting was at 01:15, 2 July 08. During this whole period of time we were never out of veiw of at least one and if you lost it could find it again or multiple ones in less than 1 or 2 min. We would see them for minutes at a time and multiple times over 10 min. straight. I saw this object do things that are not possible to do and have no explination for what I(we) saw. For the record I have never in 30yrs of looking up at the sky ever seen anything even close to this. I am a profesional instructor pilot(for a major airline) with over 2000 hrs of flight time (over 400 night). I know what aicraft, sattelites, flares, flares on chutes, and most anything you can think of that flies looks like and how they move through the sky. This was none of those. These objects manuvered like nothing I've ever seen. While watching we started timing it between 2 points compared to aircraft were saw transitioning the area in the same direction(the aircraft were on jet routes, those start at 19,000 ft. msl and usually top out around 30,000 ft. msl) the aircraft would take about 20 sec and the things we saw could do it in 3 or 4 sec. They could also go slow. We saw one pace an aircraft(passenger jet) for several sec the star object was in front by a few miles then all of the sudden accelerated away, quadrupling its distance in 1-2 sec., then \"pulled up\" making that \"U-turn\", then went right over the airplane, pushed down \"U- turn\" and now right behind the aircraft. It only did the once but also did many other weird and crazy manuvers sometimes looking as though the two star objects would collide with eachother then not at the very last sec. OK... so now can someone tell me what the hell we saw??"],"City":"Phoenix","Case Number":"11394","Latitude":"33.338974","Object Features":"None","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around July 1st 2008"],"Object Flight Path":"Path with directional change,Other","files":["/var/www/straped/mufon/html2text/11394.html.txt","/var/www/straped/mufon/org/11394.html"],"Region":"Arizona","Date Submitted":"07/01/2008 10:40 UTC","Longitude":"-112.092401","Date of the Event":"07/01/2008 10:40 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.338974,+-112.092401(11394)&iwloc=A&hl=en\"> mufon case (11394) map </A>","Sighting Duration":"Undisclosed"}