{"Longitude":"-75.64963","Latitude":"40.245374","Country":"United States","Object Shape":"Cylinder","Tags":"City","Source":"MUFON","Case Number":"11391","Region":"Pennsylvania","Date of the Event":"06/30/2007 12:00 UTC","Date Submitted":"06/30/2007 12:00 UTC","Viewing Distance":"101-500 Feet","Object Features":"Wings","divs":["sighting detailsi was driving from the king of prussia area last june going to reading on route 422. june 2007. it was late june i believe june 30th. i was driving around 12:30am from montgomery county to my home in berks county. as i was driving towards the limerick area on 422 i saw a strange light towards the right of the highway, where the limerick powerplant is. it was dark out, but i always look at limerick powerplant because of it's size and i moved to berk county a year before and still am not used to seeing this giant powerplant near the highway. at first i thought it was a plane fyling low, seeing i am told there is a airport right near there. but what struck me as unusal was the object was very low and flying about the height of powerlines and flying beside and lower then the height of the powerplant. the closer i got to the object as i drove on 422 and got closer. ( the area of 422 curves around and gets closer to the powerplant area) the more i realized it wasnt a plane but a ufo. it wasnt flying fast or high. as high as those high powerlines over highways. it was fyling along side the powerlines very close. the whole experience lasted about 2 minutes from me first seeing it until i got closer to it , until it passed over me and over 422 and i continued to drive on 422. it looked like a drone craft or something. at first when i saw it these thoughts came into my head. the first thing i thought was it looked like something out of star wars. it was low enough that i could clearly see it and know it was nothing of this world, or at least nothing that any civilians have seen. the other things i thought about were: why is this thing flying along side the powerlines. the ufo made no noise whatsoever. i passed the area where the powerlines and overpass are on the highway of 422 headed west the same exact time the ufo flew over 422 going across. it was only as high as powerlines and made no noise whatsoever. it silently glided through the air. it was round and had several lights in the center. like 3 infront. and had these weird side wings. it looked like only one wing on the side. to the left side of the circle center. it would actually be the right side of the ufo but coming towards me headed over route 422 it was on the left side of the craft. i dont know anything really about ufo's so my descriptions are out of sci-fi movies. the first thing that came into my mind when i saw it and realized it wasnt a plane when i was close enough was it was a ufo and looked like something out of star wars. then the words i've heard before drone, just came to mind. small, one wing, round with lights, slowly gliding rather low, with no sound. i told family and friends, and everyone believed me. i was freaked out when i was driving afterwards, and immediatley called various family members on my cell as soon as i passed it on the highway. that's how unnerved i was. when i got home i hardly slept at all and was very freaked as i know it was no plane. i have wanted to report this story for a while but didnt know where to report it or what sites are out there. this was just about a year ago. about 3-4 months ago i saw a news story on aol of a ufo and a picture of it a guy had caught on film in broad daylight over a light post\\powerline and it was featured on aol. as soon as i saw it online i realized it looked very simular to what i saw at night here in pa last june. then i heard on the news people seeing ufo's in pa the past couple of days and found this site. i still wonder if anyone else drving on 422 last year in late june saw this same ufo as there were a few other cars driving west bound while i was."],"Summary":"I was driving on 422 passing Limerick area around 12:30am in June 2007 and saw a UFO moving very slowly towards the highway from the right, level with powerlines and parrell to Limerick powerplant. It was low enough that I saw it very clear","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.245374,+-75.64963(11391)&iwloc=A&hl=en\"> mufon case (11391) map </A>","Object Flight Path":"Straight-line path","Disposition":"Unknown","Log Number":"US-07022008-0018","files":["/var/www/straped/mufon/html2text/11391.html.txt","/var/www/straped/mufon/org/11391.html"],"trends":["There have been 3 other sightings in Pottstown","There were no other sightings in Pottstown on or around June 30th 2007"],"City":"Pottstown"}