{"Log Number":"US-07032008-0001","Weather Factors":"Unknown","Region":"Pennsylvania","Tags":"City","Source":"MUFON","Latitude":"39.962235","files":["/var/www/straped/mufon/html2text/11393.html.txt","/var/www/straped/mufon/org/11393.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.962235,+-75.159599(11393)&iwloc=A&hl=en\"> mufon case (11393) map </A>","Longitude":"-75.159599","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around July 2nd 2008"],"Country":"United States","Summary":"Driving south on I 95 From Bucks county to Philadelphia, I thought i saw a star falling but realized it was moving horizontally. Red orange light like a fire moving in the sky.","Sighting Duration":"00:03:30","Viewing Distance":"Unknown","Date of the Event":"07/02/2008 09:50 UTC","City":"Philadelphia","Disposition":"Insufficient Data","Object Shape":"Star-like","Case Number":"11393","Object Features":"Undisclosed","divs":["sighting detailsi was driving home from work at 9:50 on thurs july 02. traveling south on i 95 from bucks county to philly. i noticed what seemed to be the ussual air traffic in the area.(two large airports are close by). high above the normal traffic i saw a redish orange light fall from very high. i thought to myself, cool i don't often get to see a shooting star. as i watched this object at some point it started to travel horizontally and was no longer falling. looking at the road and back up at the sky the object moved pretty fast changeing direction once. the object appearered to be over nj on the other side of the delaware river. and just that fast while i was starring at it the object dissapereared. it was like turning off a light switch and i could not see it anymore it was gone. i felt like i had just witnesed something extrodinary, about 30 seconds later the object reappereared on the pa side of the river. the red\\orange object hovered around for about another minute, then the light went out again. i believe that the object never left , it just turned out its lights. i am a little confused about what i saw, i felt that the object did not want to be detected and that has left me feeling a little nervous. if anyone saw something like this in our area, please respond here."],"Date Submitted":"07/02/2008 09:50 UTC","Object Flight Path":"Path with directional change"}