{"trends":["There have been 2 other sightings in Augusta","There were no other sightings in Augusta on or around June 30th 1992"],"City":"Augusta","Object Shape":"Cigar","Weather Factors":"Unknown","Case Number":"11392","divs":["Sighting Detailsit was late summer late one night i was watching tv in our sun room with the windows open. i saw a streak of light, i say streak but it was a solid straight line very white, in the sky. i thought it was a jet contrail in the moon light, it was full in the east at about 60ish degrees, but as it slowly \"drifted\" it became bighter, not disipating like a contrail does. so i got up and went outside to get a better look probably smoke too. i notice after a few secs it was comming from an aircraft heading between me and the moon. it was hazy out, a low thin cloud, so i could see the shadow of it as it was kinda back lit but still in the fog. i yelled for my mom, yes i had a roommate at my mid 20's so what! she was scared something happened to me so she came running! i was yelling come here look as she got there it was in full view. i shut up so we could listen and .... nothing. she was looking at a huge at least 2000ft possibly much larger, im good with distance and my depth perception is exceptional i just want you to know it was at least 2000ft, anyway cigar shaped thing with a briliant beam of light comming out the front. with the moon full and the light fog you could plainly seeit. we ran to the front and watched it go by. i called our local airport and asked had she seen anything. it came from that general direction and they are only 10miles away as the crow flies. so they didn't have anyflights or anything and checked with the ft. gordon army base about 30 miles further. so not 15 min after we hang up we talked about 15 min about it a damn transport army plane with all it lights on flying low as hell came right over my house. at the time there was never any air trafic over our side of the river. well i think they did it to quell any questions with a \"yes\" we were doin shit\". we, my mom and me, also saw 15 plus years earlier a saucer 100ish ft dia. over the town with colored lights going around it. swear to whom ever!"],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11392.html.txt","/var/www/straped/mufon/org/11392.html"],"Latitude":"33.480366","map":"<A HREF = \"http://maps.google.com/maps?q=33.480366,+-82.00137(11392)&iwloc=A&hl=en\"> mufon case (11392) map </A>","Log Number":"US-07032008-0001","Country":"United States","Object Flight Path":"Undisclosed","Tags":"City","Source":"MUFON","Date Submitted":"06/30/1992 12:00 UTC","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Longitude":"-82.00137","Region":"South Carolina","Object Features":"Undisclosed","Summary":"½ mile or bigger cigar shaped moving quietly with bight light \"beam\"","Date of the Event":"06/30/1992 12:00 UTC"}