{"Summary":"I did'nt even know it was there till I took a close up look at the photo","Object Flight Path":"Unknown","Tags":"City","Latitude":"42.245684","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/11396.html.txt","/var/www/straped/mufon/more/11396_submitter_file1__EPSN2491.JPG","/var/www/straped/mufon/more/11396_submitter_file2__EPSN2492.JPG","/var/www/straped/mufon/more/11396_submitter_file3__EPSN2493.JPG","/var/www/straped/mufon/org/11396.html"],"City":"Talent","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.245684,+-122.788646(11396)&iwloc=A&hl=en\"> mufon case (11396) map </A>","Log Number":"US-07032008-0004","divs":["Sighting DetailsI saw that the sun looked really strange through the smoke of the California fires so I grabbed my camera to take some pics to send to my Brother via the web. I took about 8 shots before calling it good because Im not that good of a photographer and I wanted to pick the best of the bunch to send. After downloading them to my Computer I went in to preview them in more of a closeup format. The first pic had nothing but the red sun and the sky and trees.The second pic which I took about 2 sec's after the first had a tube like thing hovering close to the sun. The third pic once again had nothing but the sky and setting sun and again it was taken about 2 sec's after the previous one. So within a few seconds it came and went. I am not one to make up stories,nor do I go out of my way to bother people uselessly but I remembered your commercial and thought you might be interested in at least taking a look at it and maybe letting me know what you think. Sincerely. Dale H Herring. P.S. I was at home when this occured.I am sending the first three pics in the order that I took them. Look very closely at the 2nd one close to the sun."],"Date of the Event":"06/30/2008 07:32 UTC","Object Features":"None","Longitude":"-122.788646","Weather Factors":"Does Not Apply","trends":["There has been one other sighting in Talent","There were no other sightings in Talent on or around June 30th 2008","This sighting has never been favorited.",""],"Region":"Oregon","Object Shape":"Cigar","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"11396","Date Submitted":"06/30/2008 07:32 UTC"}