{"files":["/var/www/straped/mufon/html2text/11402.html.txt","/var/www/straped/mufon/org/11402.html"],"Viewing Distance":"Over One Mile","Weather Factors":"None","Source":"MUFON","Case Number":"11402","Object Shape":"Egg, Oval, Sphere, Teardrop","Sighting Duration":"Undisclosed","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.231335,+-74.929713(11402)&iwloc=A&hl=en\"> mufon case (11402) map </A>","Country":"United States","Latitude":"40.231335","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Hovering then path","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around June 1st 2008"],"Object Features":"Undisclosed","Log Number":"US-07032008-0010","Date of the Event":"06/01/2008 07:30 UTC","divs":["Sighting DetailsFirst I would like to say that I am a college educated Police Officer. I am also an avid military aircraft enthusiast. I work in the lower area of Bucks County Pa. I do not have the specific date and time of the event, but I know it was in late May of this year. I will have to check my Police report for exact time and date. Our department received a few calls in regard to the object in the sky. The event took place around dusk. There was still a good amount of light in the sky and the object could be easily seen. The object appeared due east of Newtown Pa. I would say that it appeared to be hovering over the area of I-95 and Rt 332, If I had to guess, but the distance could have been further or closer because I couldn't really determine the size of the object as it was like nothing I had ever seen in the sky. The object appeared to be shaped like a comma, but sideways. The curved, fat end of the comma appeared to be larger than a regular comma shape. The object appeared to turn in place and this shifted the shape of the object. The object would rise suddenly higher and move slightly side to side, similar to a helicopter, but the movement was faster than a traditional helicopter.. The object did not have any audible noise coming from it. My first impression was that this was something I had never seen before. It appeared to shutter while moving, almost vibrating, which I thought was strange because I could see this action from quite a distance. After several minutes the object began to descend slightly and drop below the tree line only to re-emerge about a minute later. I attempted to drive toward the object following an eastbound route and noticed that the object began to descend very quickly toward a tree line in the distance and disappeared. There were no helicopters in the area covering any news events. As an aircraft enthusiast I have seen many helicopters in flight. This was no helicopter. It also did act like any jet or prop aircraft I have ever seen. I work in area where military bases are nearby. I have seen and can name just about every aircraft. This was like nothing I have seen from any military craft. I am reporting this to your agency because I have heard that other Bucks County communities nearby have experienced Unidentified objects in the sky. I have never seen anything like what I saw before or since."],"Date Submitted":"06/01/2008 07:30 UTC","Longitude":"-74.929713","Tags":"City","Summary":"Appeared to be black and shaped like a comma, only sideways","City":"Newtown"}