{"divs":["Sighting DetailsI was working the night shift at Good Samaritan Nursing Home located on E 6th St., Alliance, Ne. I began taking my break at 3AM, outside in the inner courtyard - it was the third week of June, the middle of a heat wave, and despite the fact it just finished raining, I was sweating profusely, so I was drinking iced tea. I was sitting on a bench, facing north, and the rain clouds had just broken and were moving westward - leaving the eastern half of the night sky clear. My break was almost over and as I stood up, I stretched, looking upwards and that's when I noticed a \"V\" formation of 6 amber \"oval-shaped\" lights coming out of the clouds - they were traveling from west to east. I was immediately overcome with a mixture of strong feelings - \"wonder\", \"awe\", and a feeling that I was seeing something more amazing than I had ever seen before. At first I had an impulse to run inside and bring out another witness, but I quickly rejected that idea because what I was seeing was so amazing, I didn't want to take my eyes away and \"miss\" any part of it - plus I was afraid that it would all be over by the time I returned. So I continued to observe, when suddenly, 3 of the \"lights\" (2 on one side and 1 on the other side - the last ones of the trailing \"V\" arms) all switched positions with each other in a \"blink of an eye\". I liken it to the way \"checkers\" jump position - if you understand what I'm saying. After that I knew that type of lateral move was impossible by anything I knew about. After that the \"formation\" continued heading eastward briefly, but then angled upwards, and away from Earth, then they all accelerated at a speed I couldn't even guess, and were gone in a flash. I stood there, completely dumbfounded, and I remember thinking that so far there had been no noise of any kind - I thought if I stood there and waited a while longer, that I should be able to hear any type of engine noise \"following\" the flight - if they had been traveling faster than the speed of sound. I waited for at least a couple minutes - but no sound was ever heard. Afterwards I ran inside and tried to report what I saw to the Charge Nurse, but she thought I was just trying to play some kind of joke - unfortunately, I had a reputation for practical jokes and keeping our shift laughing and in good spirits. Afterwards, I talked quietly with another co-worker - a rancher's wife who had lived in the Nebraska panhandle all her life. She seemed to believe me, but she advised me to keep my observation to myself - IF I wanted to be taken seriously. She went on to say that she had witnessed many \"strange things\" in her lifetime - as had many of her friends and family out in that part of the country - but they held on to a tradition of just not discussing such things publicly. So I then went back and recanted my story to the Charge Nurse - however, over the years, I have told this story to members of my family and trusted friends. That part of the country is very deserted - the night sky is beautiful, the Milky Way is visible. I was amazed that when I checked out the Mufon \"weather maps\" that entire part of the country - the area where I would have guessed the highest amount of sightings - actually has the lowest, almost non-existant."],"Longitude":"-102.872145","Viewing Distance":"Unknown","Log Number":"US-07032008-0009","Date Submitted":"06/22/1988 03:25 UTC","Object Flight Path":"Path with directional change","Weather Factors":"Does Not Apply","Region":"Nebraska","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/11401.html.txt","/var/www/straped/mufon/org/11401.html"],"Latitude":"42.101634","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.101634,+-102.872145(11401)&iwloc=A&hl=en\"> mufon case (11401) map </A>","Tags":"City","Disposition":"Unknown","City":"Alliance","Date of the Event":"06/22/1988 03:25 UTC","Case Number":"11401","Country":"United States","Object Features":"None","Summary":"A \"V\" formation of 6 oval-shaped \"lights\" came out of the clouds.","trends":["There have been no other sightings in Alliance","This sighting has never been favorited."],"Object Shape":"Oval"}