{"Object Features":"Patterned Surface","divs":["Sighting Details I was on my way home on I35 south on my way home to Olathe, Kansas and in the air I saw this bright star to my left. It followed me, if I would stop it stopped if I drove it would follow me. So after about a half hour I got out of my car and saw a green triangle with white lights around it. Then it would change into this green cylinder with triangles on both ends that were green with lights around it.Then it would go into a white ball like a star. It continued the same pattern over and over again. So I decided to see if it would follow me home and it did, so I took many pictures of it. You see on Jan. 10th. 2008 my son and I lost 1 and a half hours of time. So I have gone under hypnosis 4 times and we have found that we were abducted. We ended up on a different highway and in a different town. I thought both events were cool. I wasn't afraid at all. So it makes everyone think that I have been abducted before. I didn't lose the object I went inside. It was getting late and I felt exhausted. I don't have the photos off the camera yet that happen s tonight."],"Date Submitted":"06/30/2008 10:30 UTC","Source":"MUFON","Latitude":"39.07265","Tags":"City","Longitude":"-94.557973","Case Number":"11405","map":"<A HREF = \"http://maps.google.com/maps?q=39.07265,+-94.557973(11405)&iwloc=A&hl=en\"> mufon case (11405) map </A>","trends":["There have been no other sightings in kansas city, mo","This sighting has never been favorited."],"Log Number":"US-07032008-0013","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11405.html.txt","/var/www/straped/mufon/org/11405.html"],"Sighting Duration":"04:00:00","Date of the Event":"06/30/2008 10:30 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Summary":"on highwasy and followed me home.","Region":"Kansas","City":"kansas city, mo","Object Shape":"Cylinder, Star-like, Triangle"}