{"Weather Factors":"Unknown","Longitude":"-77.053309","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/11406.html.txt","/var/www/straped/mufon/org/11406.html"],"Log Number":"US-07032008-0014","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"07/03/2008 12:00 UTC","Date of the Event":"07/03/2008 12:00 UTC","Summary":"Bright star like oject moving in the sky with flashing lights.","map":"<A HREF = \"http://maps.google.com/maps?q=39.364211,+-77.053309(11406)&iwloc=A&hl=en\"> mufon case (11406) map </A>","Disposition":"IFO","divs":["Sighting DetailsMy friend and I watched the craft for about two hours, from 3:00 to 5:00 AM. The object stayed in the same place in the sky for many hours, moving left and right very slowly, back and forth. We watched as the lights flashed on and off, appearing either white, blue, or red. The rate at which the light flashed changed many times, and I got the feeling that it was meant to attract attention. My friend and I both felt very peculiar after watching this craft for a few minutes. I felt as if something was putting pressure on my brain, I am convinced it was reading my thoughts. A very odd feeling took over my entire body leaving me feeling weak and drained, and shaking from head to toe. My friend felt the same way as I when I asked him about the experience. We stopped watching the craft and the feelings that we felt went away almost instantaneously. After a few minutes of viewing the craft again we felt the same weak, quivering tightness in our bodies and felt as though something was reading, or reaching into our minds once again. I have never felt any sensation remotely similar to what I felt that morning. My friend has apparently seen it many times before these past few weeks, though never witnessed it moving before. We lost sight of the object at sunrise."],"Country":"United States","Object Features":"Other","Region":"Maryland","trends":["There have been 2 other sightings in woodbine","There was one other sighting in woodbine on or around July 3rd 2008"],"Tags":"City","Sighting Duration":"Undisclosed","Case Number":"11406","Latitude":"39.364211","City":"woodbine","Source":"MUFON"}