{"Source":"MUFON","Disposition":"Insufficient Data","Object Shape":"Sphere","Object Flight Path":"Stationary,Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.442815,+-79.989016(11418)&iwloc=A&hl=en\"> mufon case (11418) map </A>","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 4th 1960"],"Country":"United States","Case Number":"11418","Longitude":"-79.989016","files":["/var/www/straped/mufon/html2text/11418.html.txt","/var/www/straped/mufon/org/11418.html"],"Log Number":"US-07042008-0006","Tags":"City","Date Submitted":"08/04/1960 12:00 UTC","Sighting Duration":"00:07:00","Date of the Event":"08/04/1960 12:00 UTC","Viewing Distance":"21-100 Feet","Latitude":"40.442815","Summary":"The sighting occurred around 9:30p.m. in early August circa 1960 in Pittsburgh, Pa.","Weather Factors":"None","City":"Pittsburgh","Object Features":"None","Region":"Pennsylvania","divs":["Sighting DetailsI was 9 years old at the time of this sighting. I was playing a child's game with about 15-20 other kids in the presence of about 10 adults(all women and mothers). Suddenly, one of the kids standing behind me shrieks out, WOW. \"Look at that!\" I turned to look at him as he was frozen pointing towards the west. (Note: I've since been able to calculate certain details like direction from memory.) I looked in the direction he was pointing and saw what I initially thought was a full moon in the night sky partially obscured by the corner of the apartment building. There was no movement at this time and as such I returned to look at the boy(Richard) who alerted us as if to say O.K. it's a full moon partially obscured by a building. (At this time it felt like everyone there was moving in unison) Richard at this time re-asserts his position still pointing toward the object and saying \"No, look at that ball, look at that thing.\" I looked again at the white sphere and as all of us were looking directly at it, the object slowly moved behind the building and out of sight. (This took about 2 seconds max) At this point I estimate the sphere to have been no more than 5 ft. in diameter. Everyone there instinctively took off for the corner of the building looking behind it to see where it went. I've been asked before while recounting this sighting to others why I ran toward this object instead of away from it(in fear). There was nothing at this point to fear as nothing traumatic had occurred. If anything this object had just interacted with us by moving out of sight as though it had been seen. We also looked over a hillside and saw nothing. This search process may have taken about 4-5 minutes. Afterwards, all in attendance mulled around processing what it was we had seen. The adults there were asking Richard what he'd seen since he was the first to notice it. Everyone was excited and talking about the \"flying saucer\" we'd just seen even though it was spheroid in shape. I heard Richard say that the object came from behind the building the same way it moved behind it and he stared at it briefly making sure he was seeing this thing before he alerted everyone else to look at it. During this time, some of the other kids started throwing rocks over the hillside I guess in an effort to \"protect\" the neighborhood from this thing that again had demonstrated no hostile action whatsoever. If anything it was simply observing us. Shortly after these kids started throwing stones over the hillside(Maybe 30 seconds in duration), this object rose rapidly from the hillside at what looked like a 45 degree angle at an incredible speed making no noise or sound zig-zagging from: south to north, north to south, south to north, and finally north to south and off into infinity. It left a trail as a meteor would that dissapated within seconds only this thing was moving up in the sky. Everyone who was there simply stood there momentarily, stunned in wondrous silence knowing we'd just witnessed and interacted with something that definitely came under the category of UFO. This has remained one of the most powerful and clear memories of my life to date and has stimulated an interest in Ufology. I also know the existence of some form of extraterrestrial life is real."]}