{"divs":["Sighting DetailsMe and my family were on a camping trip in Vermont, I've been going there since I was a kid, and my dad was getting dressed behind his tent and he said Sean \"look up in the sky\" so I looked up and saw something with a lit up whitish cloud or fog around it and from where we were it looked like it was moving slowly around but in just about every direction. I grabbed the binoculars and watched it and I thought I seen a smaller craft come out of it and go across the sky but it might have been a sattelite my dad said. We watched it for about thirty minutes until it slowly went away too far to where we couldn't see it anymore. My dad believed that there was life elsewhere but he never thought that they actually came here until that night. My dads a pretty smart and rational guy and he said there was just no other explanation for it besides a UFO. I've always been really interested in that kind of stuff so I was real happy to have been there to see it. When I look at the picture on my computer and zoom in it looks crazy, you can see the main part then two others running perfectly paralell with it. I think it is all part of the same craft but I'm not sure. I would like someone elses input E-Mailed to me if you could. Thanks"],"Disposition":"IFO","Longitude":"-73.300224","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","Object Shape":"Other","Log Number":"US-07032008-0019","City":"Alburgh","Source":"MUFON","Object Features":"Unknown","Viewing Distance":"Over One Mile","Case Number":"11410","Date Submitted":"04/05/2003 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.975054,+-73.300224(11410)&iwloc=A&hl=en\"> mufon case (11410) map </A>","files":["/var/www/straped/mufon/html2text/11410.html.txt","/var/www/straped/mufon/more/11410_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/11410.html"],"Summary":"It had a whitish lit up cloud around it with the naked eye but in the picture the cloud is not there","trends":["There have been no other sightings in Alburgh","This sighting has never been favorited."],"Latitude":"44.975054","Country":"United States","Date of the Event":"04/05/2003 10:00 UTC","Region":"Vermont","Sighting Duration":"Undisclosed"}