{"Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.70617,+-84.219385(11412)&iwloc=A&hl=en\"> mufon case (11412) map </A>","Tags":"City","Latitude":"39.70617","Summary":"I saw several of these metallic orbs trailing the two previous jets that past by, I filmed this one going very fast.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/11412.html.txt","/var/www/straped/mufon/org/11412.html"],"Date Submitted":"05/02/2008 02:45 UTC","Date of the Event":"05/02/2008 02:45 UTC","Case Number":"11412","Object Features":"None","Weather Factors":"None","Region":"Ohio","trends":["There have been no other sightings in Moraine","This sighting has never been favorited."],"divs":["Sighting DetailsWhile spreading mulch in my yard, I saw a \"cargo\" jet banking and looked up to watch it as it passed directly over my house at a pretty low altitude as I assume it was heading to Wright Pat. I noticed 3-8 small, round, matallic orbs trailing behind the aircraft \"zipping\" around, behind, above, and below as the jet passed overhead. As I stood there not really knowing what I just wittnesed, trying to replay it in my head, and remember what the objects looked like, I shook my head and kinda smiled because I knew my wife would say I'm crazy. Within 5 minutes I heard another jet coming close, so again I look up to see a \"bomber\" style jet pass over in the same \"approach\", and again I saw 3 metallic orbs trailing the bomber, zipping around, disappearing, reappearing. They were following pretty close and at one point it looked as if one if not 2 of the orbs almost attached to the bomber. After the bomber flew by I took my cell phone out and set it to record and waited. That is when the fighter jet, (F-16, 15, 18, not sure) went by, I filmed as long as my phone would let me and didnt even realize that I had caught the UFO \"on film\" until later that night, because as you can see, this one was moving at a pretty good little clip. If you slow it down, just before it passes under the wing, you can see it \"peeking\" from behind the cloud, and after it passes under the wing, it can be seen again in the upper left of the screen near another cloud. Whatever \"they, it\" were or was, could travel at insane speeds. When the jet was out of sight, so were the sphere shaped things. I was amazed and excited, along with a little confusion as I have no idea what I witnessed. I just know we are not alone in the universe. I am not a fanatic, but I have always said that it is an insult to God to think that we are the only inhabitants in the entire universe. I would like to know if you guys can clean up the video a bit or have it analyzed to see what you can find."],"Sighting Duration":"00:01:00","City":"Moraine","Disposition":"Unknown","Country":"United States","Log Number":"US-07032008-0021","Longitude":"-84.219385","Object Shape":"Cylinder, Sphere"}