{"Sighting Duration":"00:07:00","Region":"California","Viewing Distance":"Unknown","Object Shape":"Boomerang","Case Number":"11413","Longitude":"-122.268317","Summary":"directly overhead very high. silver boomerang moving slowly in a random meandering fashion until it disapeared. Vee shaped with the apex of the V away from the direction of travel.","Object Flight Path":"Hovering then path","Log Number":"US-07042008-0001","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11413.html.txt","/var/www/straped/mufon/org/11413.html"],"Latitude":"37.881113","Date Submitted":"06/07/2008 09:00 UTC","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=37.881113,+-122.268317(11413)&iwloc=A&hl=en\"> mufon case (11413) map </A>","Weather Factors":"None","divs":["Sighting Details Saturday mornings my girlfriend and I walk our Airedale (Harry) along the East Bay shore of San Francisco Bay. This particular morning I was alone,as my friend had sprained her ankle and could not make the walk. The area is a fairly deserted strip of landfill on the Berkeley shoreline surrounded on three sides by water and we walk the several hundred yards out and back. Approximately half way through the walk I was looking west across the bay and I saw what I first took to be an airplane. It was very high and moving very slowly NE or ENE toward my position. What caught my attention was that i could see no fuselage or tail.I watched carefully for the fuselage as it seemed very strange that it should not have a body. It was silver color,It could be described as a flying wing,but it was flying backwards. As I watched it came nearly vertical over me still very high and then turned and moved back to the southwest. I had it in view for about 5 to 7 minutes.I moved in a slow meandering way. before I turned back to the northward leg of my walk. As I walked I turned to watch until I lost it a few minutes later,seeming to blend into the sky. I kept hoping someone else would come by and get to see it too. The one time I was alone out there,and the one time something happens."],"City":"Berkeley","trends":["There have been 7 other sightings in Berkeley","There were no other sightings in Berkeley on or around June 7th 2008"],"Country":"United States","Disposition":"Unknown","Date of the Event":"06/07/2008 09:00 UTC"}