{"Weather Factors":"None","Country":"Australia","Object Flight Path":"Stationary,Straight-line path","Object Shape":"Disc, Flash","City":"Melbourne","Case Number":"11422","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-37.811087,+144.9656(11422)&iwloc=A&hl=en\"> mufon case (11422) map </A>","Source":"MUFON","Latitude":"-37.811087","Object Features":"Dome","Summary":"Out evening hunting, looked up saw disc the size of moon glide silently over me, about 500 feet,going on and off like light, approx 10 sec.","Disposition":"Unresolved","Date of the Event":"08/25/2006 11:15 UTC","divs":["Sighting Detailsi've been interested in the unknown since i was a kid,and have often had family descusions on the subject of,are we alone? Anyway we have a country property in victoria,region called pyrenees in australia.which we frequently go to regulary.the nights are most of the time very clear,through the year.i always go rabbiting and mostly at night.the time was approx 11.00-12.00 pm, i felt a bit tyred and decided to head back with my bunnies, the mood was good.After putting everything away and thought about settling in for the night,i looked up to view a brilliant night sky,the evening was crisp.with my maglite torche in hand i held it above my head and switched it on and off four times,alot like a ship would using code.we'll to my amazement & shock i got a rather surprise when i saw a light flash back at me,but alot more intensly,like a powerful camera flash four times.about twice the size of a bright star,and motionless.so i did it again,thinking i'm seeing things,and again it flashed four times brightly and clearly,only this time it was in a different position than before.but across to my right,it could'nt travel that quick? i thought someone was playing a joke. About 2 weeks past and my dad and i where out on the paddock,checking on our olive trees.time was approx 1pm afternoon,we noticed four men dressed in black wearing vests,they looked militery like.they jogged across the field and up the other side of valley.i did'nt go over to them because we were busy with our duties,they seemed to avoid contact,and did'nt wave. when we got back to house,time was around 5pm in afternon. i keeped an i on them with binoculiars,it was getting dark ,i told dad ,there still here.whats going on? after dinner approx 8pm evening,they were like in a row with there torches,alot like the phenioux lights,but on the ground.i could see through binnoculiars what they were doing.whats going on,is this a stage,who are these people and why.approx 9pm evening they began to leave,but i could see them hopping over fences in the twilight,funny."],"Date Submitted":"08/25/2006 11:15 UTC","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around August 25th 2006"],"Log Number":"AU-07042008-0010","Sighting Duration":"Undisclosed","Region":"Victoria","Viewing Distance":"Unknown","Longitude":"144.9656","files":["/var/www/straped/mufon/html2text/11422.html.txt","/var/www/straped/mufon/org/11422.html"]}