{"Object Shape":"Square, Rectagular","Longitude":"-73.87592","Country":"United States","trends":["There have been 12 other sightings in New York","There was one other sighting in New York on or around June 30th 1988"],"Log Number":"US-07042008-0012","map":"<A HREF = \"http://maps.google.com/maps?q=40.702553,+-73.87592(11424)&iwloc=A&hl=en\"> mufon case (11424) map </A>","Region":"New Jersey","divs":["Sighting DetailsI believe it was the summer of 1988. We lived in Ewing Twp NJ, Glendale section, which is in the flight path of Mercer Co. Airport. I was again sitting on my porch at apprx. 1-130am when i saw a VERYlarge mass, very slowly appearing over the roof of the house across the street from my house. I first just saw a small white light and a small red light both non blinking on the object, which was enormous. It ver slowly crossed the street towards my house at aq very very low speed. Due to the extended roof over my porch, I had to now step down into my flower garden to view the object. I swear it was just about hovering over my house, no more than 50-60ft. I am now directly underneath the object which seemed square,maybe oblong, with different levels. All the levels had white lights(non blinking). It looked like a city, or factory at night. Due to the darkness and its enormous size, I really could not tell the dimensions. It made a very strong rumbling noise, but yet it was not real loud. It slowly went to my back yard and then sped up and went out of sight. My wife was in the bathroom at the time and yelled out the window WHAT WAS THAT. It shook the whole house, you could feel the vibrations in and out of the house. I ran into the house told her what I saw and called the Mercer Co Airport.(4miles away). I asked if they saw anything on their radar. They said they turn their radar off at midnight and Phila. Airport takes over. I thought that was strange. I called the Trentonian newspaper, and told a reporter what I saw. He laughed and said he did not receive any other reports and then hung up. The only reason I am reporting this now is because I live in Bensalem Pa. and lately there have been several reports on UFOs very recently. Ewing Twp. is apprx. 20-25 miles from Bensalem Pa. I am hoping now maybe someone will believe me. I would take a polygraph test on everything that I have stated. I might add that I was a law enforcement officer in Mercer Co. until 1980. This is my 2nd report dated 7-4-08"],"City":"New York","Disposition":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Summary":"enormous, rectangular,oblong 1 white light (non blinking) 1 red (non blinking) on top or side of object. different levels in the bottom, each level 1 white light","Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","Latitude":"40.702553","files":["/var/www/straped/mufon/html2text/11424.html.txt","/var/www/straped/mufon/org/11424.html"],"Date Submitted":"06/30/1988 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"06/30/1988 12:00 UTC","Case Number":"11424"}