{"Source":"MUFON","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Tags":"City","Object Features":"Wings","Date of the Event":"07/02/2008 12:00 UTC","Summary":"Me and my mom noticed weird hovering lights above the Oxford Valley Mall.","Latitude":"40.232695","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around July 2nd 2008"],"Case Number":"11426","divs":["Sighting DetailsMe and my mom were just getting done shopping at the Oxford Valley Mall. It was a rather warm night, but the sky was clear of clouds and other obstructions. As we got in the car, I looked up to the sky at random and noticed 8 hovering lights. At first they just seemed like lights reflecting off the ground, or maybe even fireworks because of the upcoming holiday. Not very big UFO believers, me and my mom just kind of shook the suspicion off. However, we still had to head into the direction of the lights to get back home. After about 15 minutes past and the lights didn't seem to fade or move away, we played with the idea of 'aliens.' We've seen the movies, especially Signs, which was filmed in Bucks County. And I've always been a fan of the hit tv series The X Files. It seemed a little odd to me that 8 random lights would just be sitting in the sky. We didn't want to seem a little crazy to the idea of UFOs in Bucks County. I don't know anyone who supports the theory and I didn't want people to think I was off the wall, so me and my mom toyed with the notion of it, and then let it go. Two days later, the story was in the paper. We weren't the only 2 people in the world to see weird hovering lights. MUFON investigators are now coming to investigate the possiblities of what it may or may not have been. I guess we weren't crazy after all..."],"Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"07/02/2008 12:00 UTC","Object Shape":"Boomerang","map":"<A HREF = \"http://maps.google.com/maps?q=40.232695,+-74.934593(11426)&iwloc=A&hl=en\"> mufon case (11426) map </A>","Region":"Pennsylvania","Country":"United States","Longitude":"-74.934593","Log Number":"US-07042008-0014","files":["/var/www/straped/mufon/html2text/11426.html.txt","/var/www/straped/mufon/org/11426.html"],"City":"Newtown"}