{"Source":"MUFON","Tags":"City","City":"Anaheim","Region":"California","divs":["Sighting DetailsOne night, around 4am, I had a sudden feeling to go to the beach. So I got in my car, barely any gas, I headed out onto the freeway. When I hit the 57 South, I saw four strange red lights waving over the mountain top. Then, what looked like stars falling from the sky, turned out to be space ships. The freeway was unusually crowded... all headed towards the beach. The space ships had spotlights, colored rays guiding the cars. I allowed them to guide me after feeling confused and losing sense of direction. They lead me telepathically around strange areas of town. Then I went to a small hilltop area where the trees were beautiful. The fog was thick over this nature park sanctuary. It was now 6am, after being asked for a $3.00 entrance fee, I ignored the clerk and drove in without being told anything. I parked next to a pond. Then I played my guitar and started to sing. The ufo's seemed to have mental telepathy and told me, \"Here's a gift for your voice. \" I felt a butterfly in my throat as a bird flew above me. Then it was like an invisible rain, raining over my head, it seemed to be saying, \"The rain forest is over you. Please help the earth.\" As I drove away, the sun was pure gold, no blue. The rays were refined, beautiful. I ran out of gas and a tow truck appeared instantly. The tow truck guy put gas into the gas tank and the engine caught on fire. We had to tow it to the nearest off ramp, where another car of Mexican immigrants were fixing their car as well. After talking to each other, we learned that we had had a similar ufo experience."],"Latitude":"33.845003","Object Shape":"Egg, Fireball, Star-like","Sighting Duration":"Undisclosed","Date Submitted":"07/09/1996 04:30 UTC","Date of the Event":"07/09/1996 04:30 UTC","Longitude":"-117.906274","Summary":"4 Star Like UFOS","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11420.html.txt","/var/www/straped/mufon/org/11420.html"],"Object Flight Path":"Path then hovering","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.845003,+-117.906274(11420)&iwloc=A&hl=en\"> mufon case (11420) map </A>","Country":"United States","Viewing Distance":"21-100 Feet","Case Number":"11420","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around July 9th 1996"],"Log Number":"US-07042008-0008","Disposition":"IFO"}