{"Region":"Pennsylvania","Object Shape":"Egg, Fireball","trends":["There have been 5 other sightings in Grove City","There were no other sightings in Grove City on or around July 4th 2008"],"Date Submitted":"07/04/2008 09:35 UTC","Longitude":"-80.08867","map":"<A HREF = \"http://maps.google.com/maps?q=41.157838,+-80.08867(11427)&iwloc=A&hl=en\"> mufon case (11427) map </A>","Log Number":"US-07042008-0015","Sighting Duration":"00:02:00","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/11427.html.txt","/var/www/straped/mufon/org/11427.html"],"Object Features":"Unknown","Country":"United States","Latitude":"41.157838","Weather Factors":"Unknown","divs":["sighting detailsmy wife and i were pulling into an unoccupied parking lot to view our local firework display. just as we were getting set to exit the vehicle, we saw a red\\orange egg shaped object climbing quickly in the distance. my first reaction was that the firework show was beginning early. we both said at the same time \"what is that?\", because it became brighter as it climbed and did not explode. we both jumped out of our suv and began questioning what we were seeing further. the object then slowed as it continued on an arcing path upward. the object began to slowly change colors in a very slow pulsating manner. it started as a red\\orange, then a yellow, and eventually a bright white. my wife attempted to capture the image on her cell phone but was unable to do so. it continued to climb higher and higher. it eventually disappeared into the thick cloud cover. the event lasted approximately 2 - 3 minutes. at first, the object climbed quickly with a slight trail. it was very bright and fairly large. the initial brightness was astounding. as it slowed and began to change color, it became less bright. i looked for aircraft lights but there weren't any present. it was just one ball of light. we heard no sound from the object. neither my wife or myself could come up with an explanation for what we witnessed. it was definitely not an airplane or helicopter. it was a flying object like nothing we have ever seen."],"Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Case Number":"11427","Tags":"City","City":"Grove City","Date of the Event":"07/04/2008 09:35 UTC","Summary":"Rose quickly appearing like a fireball. Climbed at a slight angle and slowly changed colors eventually disappearing high into the clouds.","Source":"MUFON"}