{"divs":["Sighting DetailsAround 10pm, while watching some local fireowrks, my family, which consisted of nieces and nephews, saw a round, red, globe like object that at first appeared to be hanigng in the sky. After a short while it appeared to be moving very slowly in a northerly direction. Its location was towards the west in the opposite direction to where the fireworks were. After approximately 4 minutes it slowly disappeared, taking around ten seconds. Aprroxomately five minutes later two more globes appeared at the end of the street in the northern part of the sky. Their description is the same as the first object, a red, glowing globe. They were again moving very slowly in a southwest direction more or less towards us and were separated from each other by several miles. There is an open field at the end of the road and then a small shopping plaza. The first red light began to disappear after approximately 3 minutes and then vanished. The second red light, which was the furthest remained in view, moving slowly, for another ten minutes and then it too just vanished. We saw no further lights that same evening."],"Country":"United States","Date of the Event":"07/04/2008 10:04 UTC","files":["/var/www/straped/mufon/html2text/11436.html.txt","/var/www/straped/mufon/org/11436.html"],"Log Number":"US-07052008-0009","Source":"MUFON","Case Number":"11436","Latitude":"41.325913","Weather Factors":"Unknown","Region":"Pennsylvania","Longitude":"-75.78936","Object Flight Path":"Straight-line path","Disposition":"Unknown","Date Submitted":"07/04/2008 10:04 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"None","Summary":"Saw round globe like object moving very slowly and then disappearing....","map":"<A HREF = \"http://maps.google.com/maps?q=41.325913,+-75.78936(11436)&iwloc=A&hl=en\"> mufon case (11436) map </A>","trends":["There have been 2 other sightings in Pittston","There were no other sightings in Pittston on or around July 4th 2008"],"City":"Pittston","Object Shape":"Sphere","Viewing Distance":"Unknown"}