{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/11430.html.txt","/var/www/straped/mufon/more/11430_submitter_file1__IMG_0115.JPG","/var/www/straped/mufon/org/11430.html"],"Object Flight Path":"Hovering then path","trends":["There have been no other sightings in Elmhurst","This sighting has never been favorited."],"Region":"Illinois","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friend and I were walking at night from his house to get a shake from a fast food restaurant in our Chicago suburb of Elmhurst. After walking about 10 minutes, we suddenly stopped in our tracks, having seen 6 lights in the southern sky, about 45 degrees altitude. Their movement was constant but slow individually in their relative unit and even slower as a single unit across the sky. The formations changed from what appeared to be a sloppy V shape to a polygon of a sort. They seemed to be headed toward the north, but they never crossed the zenith from our apparent view. They were visible for about 40-50 seconds, glowing subtly from orange to red, then dimmed out one-by-one within 10 seconds. There was a second appearance 10 minutes later when we were in the parking lot. I stopped to take a photo with my iphone, though the quality is very poor. There are some false artifacts in the photo from the parking lot lights, but if you look above the second small parking lot to the right, you can see 3-4 lights above it. Please inform me of similar sightings. Thanks"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.899474,+-87.940342(11430)&iwloc=A&hl=en\"> mufon case (11430) map </A>","Longitude":"-87.940342","Disposition":"IFO","Date of the Event":"07/04/2008 09:35 UTC","City":"Elmhurst","Object Features":"Unknown","Object Shape":"Boomerang, Circle, Oval, Star-like, Triangle","Viewing Distance":"Unknown","Date Submitted":"07/04/2008 09:35 UTC","Tags":"City","Latitude":"41.899474","Log Number":"US-07052008-0003","Summary":"Night of fourth of july, there were 6 glowing lights in the southern sky, 45 degrees above horizon. They moved slowly and changed shape. Lasted about 40 seconds.","Source":"MUFON","Case Number":"11430","Country":"United States"}