{"Object Shape":"Circle, Disc, Star-like","Viewing Distance":"Unknown","Date of the Event":"07/04/2008 12:00 UTC","Summary":"one pulsating star-like disc joined by 3 discs with running outer edge lites on only; followed by l0 others who were watching the fireworks display at the falls and local area fireworks near vicinity of south Buffalo","Log Number":"US-07052008-0005","Country":"United States","divs":["Sighting DetailsI thought I would lay in my bed and watch the local fireworks show out the bedroom window (SW direction) which is facing Lake Erie - the show was going on a while but I began my watching at l0:30 pm - there in the sky was a pulsating disc star-like object first just sitting there watching the fireworks I assume-suddenly the star zig zag fashion changed its location and came closer -I noticed it was pulsating then and had green lites - it kept changing location towards me then towards the falls to see their fireworks - it never became invisible which surprised me. After a few hrs. it was joined by 3 discs who were running only their outside edge running lights around their crafts, solid lites on not pulsating, not shiny. They flew up nearby the shiny pulsating craft and then shut off their running lights and sat there; funny part of that was that their lights went off like a dimmer switch and some did not fade from view completely so their were still visible in the sky; and some did go completely invisible. After watching for a few more minutes the 3, now 4 total were suddenly joined from the sky below in the area of Lake Erie by l0 similiar craft which jolted me fully awake at this point and I thought to myself well now that was interesting to say the least and kind of proves that there may be a base close by! The others were straight in their flight path got into their respective positions and just sat there not moving after that zip across the sky. The larger shiny ship apparently called the others to join him as once he had company he stayed in one location and no longer zipped back and fourth as he was previously doing; guess he was in charge of chosing the best location to see both shows perfectly judging from his attempts at going over the falls and then back to my location. I watched until 3 pm waiting for someone to move closer or do something else or be joined by more craft. Nobody moved and I fell asleep holding my bedroom window curtain, then falling into bed. I thought to myself how nice, they like fireworks too, then when all the others came I was more then amused and remember saying out loud Holy God to myself! I was amazed at how many there were not the fact that they were there and I was angry that they were too far away to see up close. I especially wanted to see the large shiny one up close like the others but he stayed far out and let the others have the best location and views since he watched quite a spell by himself before calling others to come see. I had the feeling he wanted them to get there and sit invisible and not call attention to themselves. I got the impression that they want to not have to change their base and move away from here. I have never seen so many crafts in one spot, at one time before - that was unnerving and I felt fear followed by a protection for them - I was not sure if I should report this information or not - maybe we ought to just let them live there in peace period and not disturb them. PS a plane on final into Buffalo came past my house just before the fleet of ships came out and I remember thinking they had waited for him to begin his descent before they came into sight so it is obvious they want to remain hidden etc. etc. etc."],"Date Submitted":"07/04/2008 12:00 UTC","Object Features":"Undisclosed","Latitude":"42.890717","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-78.874219","map":"<A HREF = \"http://maps.google.com/maps?q=42.890717,+-78.874219(11432)&iwloc=A&hl=en\"> mufon case (11432) map </A>","files":["/var/www/straped/mufon/html2text/11432.html.txt","/var/www/straped/mufon/org/11432.html"],"Region":"New York","Case Number":"11432","Object Flight Path":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There was one other sighting in Buffalo on or around July 4th 2008"],"Source":"MUFON"}