{"Log Number":"US-07052008-0006","Region":"Wisconsin","files":["/var/www/straped/mufon/html2text/11433.html.txt","/var/www/straped/mufon/org/11433.html"],"Latitude":"43.079292","Case Number":"11433","map":"<A HREF = \"http://maps.google.com/maps?q=43.079292,+-89.39999(11433)&iwloc=A&hl=en\"> mufon case (11433) map </A>","Date of the Event":"10/31/2000 12:00 UTC","Viewing Distance":"Over One Mile","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around October 31st 2000"],"Country":"United States","Object Flight Path":"Stationary","Date Submitted":"10/31/2000 12:00 UTC","City":"Madison","Disposition":"Insufficient Data","Object Shape":"Diamond","Sighting Duration":"Undisclosed","Longitude":"-89.39999","Summary":"Halloween Hoax or UFO?","Tags":"City","Object Features":"Other","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsIn the late afternoon on or about Halloween in the year 2000, I was puzzled to see some lights blinking outside the window, and I stepped outside on my front porch in west Madison and was amazed to see to the southwest three large grey colored kite-shaped objects in the sky in a straight line facing east. They were at least as large as water skiing kites and were at least a mile away and about quarter-mile apart. They had one or more lights on them (I think they were white), and the lights were flashing in synchonized patterns. For example, first the left-most one would blink, then the middle one, then the right-most. The lights flashed in various patterns. They were not moving, and they were there for quite a while, maybe an hour. I watched it for awhile, off and on until it got dark. At one point I checked again and they were gone. My wife at the time told me that she had heard of these things from someone at work who said this was an annual Halloween prank someone pulled. However, at a later date, I asked a long-time Madison resident if she had ever heard of this annual stunt, and she said no. I have never seen these objects again, and now I have to wonder whether they were a Halloween hoax or a UFO. Has any one else seen these things?"]}