{"map":"<A HREF = \"http://maps.google.com/maps?q=40.585822,+-74.142721(11438)&iwloc=A&hl=en\"> mufon case (11438) map </A>","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 4th 2008"],"Date Submitted":"07/04/2008 11:10 UTC","Weather Factors":"Unknown","Summary":"DARK TO BRIGHT GOLDEN ORANGE WITH HALO pulsating","Tags":"City","Region":"New York","files":["/var/www/straped/mufon/html2text/11438.html.txt","/var/www/straped/mufon/org/11438.html"],"Log Number":"US-07052008-0011","Object Flight Path":"Straight-line path","Longitude":"-74.142721","Source":"MUFON","Object Shape":"Circle, Fireball, Sphere, Other","Viewing Distance":"Unknown","divs":["sighting detailsit was the forth of july i live in the city my block is like a war zone on the forth of july 8in motors going off every five minutes these where not fire works. i came home from wendys at about 11 pm looked up in the sky over my house and saw this glowing sphere it had a halo around it . this object was high in the sky i watched it for minutes before getting my family to come out and see it. just to see what they thought :). they watched it for 5 min also. their was no smoke trail from this object it kept going in a straight line with no sound until it became to far for us to see. then about an hr later my wife was looking out the dining room window and saw 2 of the exact objects float over the house and in the same path as the first one. i watched these also for lets say a min went out side and they where floationg over my house again i called my 2 boys to come out and look at these objects. as i was looking at the objects i was saying their going out like a flare or a paruchet. i rly dont think it was a flare or a parachute but u nvr know again i live in a well populated city i have neabors no less then 50 feet from my house also let me state this again their was not smoke trail and they pluseadted 1. i was getting out of my car with wendys. 2. i always look at the sky plus it the 4\\7\\08. 3. a flare or parachute 4. pluseated no noise had a halo ive nvr seen anything like it. 5. my first reation was what is that 6. all i can say is it looked like something that was at full power then went to 1\\2 power then back to full power then glowed real faint then i lost sight of it we tried to to get vedio but the cam corder was out of batteis"],"City":"New York","Date of the Event":"07/04/2008 11:10 UTC","Object Features":"None","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"11438","Latitude":"40.585822","Disposition":"Unresolved"}