{"trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around February 29th 2008"],"Weather Factors":"Unknown","City":"Evansville","divs":["Sighting DetailsI was out back on my poorch smoking before bed and i was looking at the sky when i saw a square light red ufo fly from east to west at a very fast clip. It was not very bright and did not seem to be thick (from top to bottom but its hard to say how high it was. It was about the size of your thumb nail if you were looking up at it. I was just sure it was not a plain or any thing i have ever seen. There was not any noise. It hade a realy smooth flow to the movement.I just said to my self you have got to be kidding me. It just left as fast as it came smooth,silent and fast. The strange part of this story is that i told my wife about it and we went on vacation out west and we crossed into new mexico on or about june 19 th and it was dark out my wife in the passenger seat and i was driving when the same object flew half way over the sky and then shot strait up it did all this even much faster then the first time i had seen it in indiana with no noise this the first or second time. I did not say anything and my wife said what the hell was that. I was so happy she saw it so i was no longer the crazy one. I just don't understand how i was so lucky to see it 2 times."],"Date of the Event":"02/29/2008 11:35 UTC","Source":"MUFON","Summary":"It flew strait but realy fast till out off sight.","Latitude":"37.980459","Longitude":"-87.56793","Case Number":"11443","Country":"United States","Region":"Indiana","Log Number":"US-07062008-0003","Tags":"City","files":["/var/www/straped/mufon/html2text/11443.html.txt","/var/www/straped/mufon/org/11443.html"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.980459,+-87.56793(11443)&iwloc=A&hl=en\"> mufon case (11443) map </A>","Object Shape":"Square, Rectagular","Object Features":"None","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"02/29/2008 11:35 UTC"}