{"Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsAt about 11:00 pm, myself and 7 friends, were at a friends house in Lake Stevens, WA. We were lighting fireworks off in the street for the kids when I noticed two orange lights traveling about the speed of a small plane in a due north direction. As I watched it, I noticed a couple of oddities. They were very orange in color, and had no blinking lights. Both lights were at the same speed and maintained the same distance to one aother for the duration of the sighting. Also, the light was steady, no pulsating, no fuzzieness associated with watching a burning light such as a firework or jet engine. And they never changed course. The brightness of these object was about 4 times that of the North Star on a clear night. These observations ruled out conventional aircraft. With all the fireworks going off in this area, I could not determine if there was any sound. Although I can say that I was not able to make out any airplane or helicoptor sounds between explosions of fireworks in the neighborhood. I pointed out the lights to everyone outside at the time and everyone agreed that it was odd because it definatley was not a plane. We stopped the fireworks and watched for about 4 minutes as the lights slowly disappeared in the north sky as they became too distant to see. No one seemed scared or even disturbed by the sighting so once they were out of sight, we continued with the fireworks. I searched HeavensAbove.com for anything that would come close to what we witnessed and did not find anything that was traveling in that direction at that time, and at that point in the sky."],"Summary":"Glowing Orange Ball","map":"<A HREF = \"http://maps.google.com/maps?q=38.900782,+-77.030936(11440)&iwloc=A&hl=en\"> mufon case (11440) map </A>","Weather Factors":"Unknown","Case Number":"11440","Region":"Washington","trends":["There have been 82 other sightings in Washington","There was one other sighting in Washington on or around July 4th 2008"],"Disposition":"Unknown","Object Flight Path":"Straight-line path","Latitude":"38.900782","Object Shape":"Sphere","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11440.html.txt","/var/www/straped/mufon/org/11440.html"],"Date Submitted":"07/04/2008 12:00 UTC","Log Number":"US-07052008-0013","Source":"MUFON","Object Features":"None","Country":"United States","Longitude":"-77.030936","City":"Washington","Date of the Event":"07/04/2008 12:00 UTC"}