{"map":"<A HREF = \"http://maps.google.com/maps?q=43.177531,+-85.252799(11454)&iwloc=A&hl=en\"> mufon case (11454) map </A>","Sighting Duration":"00:00:30","Log Number":"US-07062008-0014","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11454.html.txt","/var/www/straped/mufon/more/11454_submitter_file1__IMG_2562.JPG","/var/www/straped/mufon/more/11454_submitter_file2__IMG_2562A.jpg","/var/www/straped/mufon/more/11454_submitter_file3__IMG_2563.JPG","/var/www/straped/mufon/org/11454.html"],"Date Submitted":"07/02/2008 03:01 UTC","Source":"MUFON","City":"Greenville","Region":"Michigan","Object Shape":"Triangle","Date of the Event":"07/02/2008 03:01 UTC","Disposition":"IFO","Object Flight Path":"Undisclosed","Summary":"Object appeared in phot I took of the storm front about to hit the Greenville area.","Longitude":"-85.252799","Viewing Distance":"Unknown","Country":"United States","Object Features":"Undisclosed","Tags":"City","divs":["Sighting DetailsOn July 2, 2008 at 3:00PM after being informed of severe thunderstorms about to enter the southwest area of Greenville Michigan, I stepped outside with my Canon EOS 40D digital camera to catch some images of storm clouds and possibly some rotation from the approaching storm. I took several digital images of the storm clouds before being forced inside by the heavy rain and wind gusts from the storm. My only intensions were to capture digital images of the storm and nothing else. After the storm left the area, I took the CompactFlash card from my camera and inserted the card into my card reader in my computer. I downloaded the digital image files into Adobe Photoshop CS3 Bridge. I took the CompactFlash card out of the card reader and put the card back into my Canon EOS 40D camera and reformatted the CompactFlash card for storage of new digital images. On the afternoon of July 5, 2008, I started to review the digital images from the storm from the afternoon of July 2, 2008. As I started to enlarge each digital image file, I noticed an odd object that appeared on the right side of the trees across from the condos near my apartment. I enlarge the object trying to see if I could make out what the object was. I sat at my computer and stared at my LCD display in total disbelief. Then I started to check other digital images taken about the same time and I found another object near the storm clouds in another file. I enlarged that one and found an object that appears to be coming out from one of the storm clouds. I had no intentions of trying to capture digital images of strange objects in the sky as my original intent was only to try to capture interesting cloud formations to send into one of our local television stations in our area. These photos are 100% original and we not altered in any way except for cropping and enlarging the images to try and determine what they actually were. I know this object is not a conventional aircraft anyone around this area has observed before. I have my own impression as what this object appears to be but as of now, I will not divulge my thoughts to anyone until further study has been completed."],"Case Number":"11454","trends":["There have been 2 other sightings in Greenville","There were no other sightings in Greenville on or around July 2nd 2008","This sighting has never been favorited.",""],"Latitude":"43.177531"}