{"Longitude":"-85.366645","Sighting Duration":"00:00:07","Date of the Event":"07/04/2008 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.525883,+-85.366645(11459)&iwloc=A&hl=en\"> mufon case (11459) map </A>","Date Submitted":"07/04/2008 10:30 UTC","Tags":"City","Object Shape":"Circle","Country":"United States","Object Flight Path":"Path with directional change","City":"Wolcottville","Summary":"Red object seen crossing sky by multiple people","divs":["Sighting DetailsWe were at a family gathering on Westler Lake (North East Indiana, South of LaGrange) enjoying the evening a shooting fireworks with the kids. It was approx. 10:30 p.m. The sky was crystal clear. I turned and looked up towards the eastern sky and saw two red lights moving very fast going north to south in a horizontal direction. These red lights shifted their direction sharply upward and faded out of sight. It looked as if they were chasing each other. This all happened in a matter of seconds. I asked out loud, \"did any one see that?\" My daughter and her boyfriend both saw the lights. I thought to myself, WOW! What was that? I've never seen anything like that before. I described what I saw. My wife commented that she tried to get my attention shortly before because she had seen the same strange lights. I didn't hear her as usual (Ha). However, she stated that she saw four red objects. They too moved in a group and shot out of sight. Folks could say that it was a roman candle or some sort of firework. But the precision of the movement, the change in direction, and depth of field of both objects makes me believe different. Very cool experience. I do not know what I saw but I know that it was not fireworks. My wife feels the same. I have been left with the image running through my mind. Very curious."],"files":["/var/www/straped/mufon/html2text/11459.html.txt","/var/www/straped/mufon/org/11459.html"],"Source":"MUFON","Latitude":"41.525883","Case Number":"11459","Weather Factors":"None","Disposition":"Unknown","Region":"Indiana","trends":["There have been no other sightings in Wolcottville","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Object Features":"None","Log Number":"US-07062008-0019"}