{"map":"<A HREF = \"http://maps.google.com/maps?q=31.972449,+-99.899403(11458)&iwloc=A&hl=en\"> mufon case (11458) map </A>","Summary":"Object with red vapor trail against dusk blue sky.","Source":"MUFON","Sighting Duration":"00:06:00","Country":"United States","files":["/var/www/straped/mufon/html2text/11458.html.txt","/var/www/straped/mufon/org/11458.html"],"Case Number":"11458","Viewing Distance":"Unknown","Latitude":"31.972449","Disposition":"Unknown","Date Submitted":"11/30/0002 08:56 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-99.899403","divs":["Sighting DetailsI was traveling westbound on HWY 71 in Austin, Tx at approximately 7:50pm on the way home from dinner. I spotted a reddish object, top to bottom in length more so than side to side, in the distance that was alone in the horizon apart from any other stars, moon, or sun -- on the lefthand side (SW from HWY 71). It appeared to be larger than the planet Mars when viewable but as mentioned, longer from top to bottom. It was very discernable from any trees or building objects and was viewable unobstructed for the full duration of 5-7 minutes (along with the next object) . After spotting the object, I then noticed what apparantly was a plane following the same direction with a short vapor trail that was obviously a reddish coloration very distinct from the typical white. It was easily in contrast of the bluish near dusk sky. It continued in the same direction of the initial object (for aproximately 3-5 min.) and eventually became smaller to the point that it became the same size as the initial object. As mentioned, it was intially spotted to be similar to your typical plane with a vapor trail, only distinctly reddish in color and shorter in length. The trail maintained existance until the object eventually became the same size as the initial object and then disappeared. This was far and beyond any interpretation of a plane with its vapor trail or any other way of the sun reflecting off the coloration of a white vapor trail. It was extremely distinct and short in length almost to the point of a large flame projecting from the object as opposed to vapor trail."],"City":"Undisclosed","Tags":"City","Date of the Event":"11/30/2002 12:00 UTC","Region":"Texas","Object Shape":"Bullet, Missile","Log Number":"US-07062008-0018","trends":[]}