{"Date of the Event":"07/06/2008 12:05 UTC","Object Features":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"California","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11450.html.txt","/var/www/straped/mufon/more/11450_submitter_file1__IMG_0315.jpg","/var/www/straped/mufon/more/11450_submitter_file2__IMG_0316.jpg","/var/www/straped/mufon/org/11450.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.752267,+-119.767896(11450)&iwloc=A&hl=en\"> mufon case (11450) map </A>","Country":"United States","Summary":"Lights flying near the 5 Freeway","Tags":"City","divs":["Sighting DetailsMy wife and I were driving home, north on the 5 freeway. She woke me up to switch drivers and I looked northeast, saw some bright lights just above the horizon and jokingly said, \"Look, it's a UFO\". She continued driving for about 5-10 minutes, looking for a place to pull off so we could switch. As we got closer to where the lights were that I had commented about just minutes earlier, we saw the lights moving around about 100 - 200 yards off the freeway and about 100 yards off the ground. She said, 'What is that!?', and I replied, 'I don't know'. She slowed down a bit, we kept watching this thing moving around in the air, and I took two photos with my iPhone. Eventually, we passed it, but decided we should turn around and go look at it again. We exited, went over the overpass, and got back on the 5 south. Again, we saw the lights moving around off in the distance, and got off the freeway at exit 379. We crossed the overpass again, headed towards the onramp to the 5 north and pulled off. I was scrambling around trying to find our camera, my wife was calling a friend of hers, and i eventually found a little flip cam video camera with which I began filming the object. Unfortunately, the camera was just about full, so I only got about 23 seconds of footage. Then, I started looking for our still camera again, but wasn't able to find it, so we just kept watching this thing. I got out of the car to use the restroom, and kept watching it. I looked down for a second, and when I looked back up, the object was gone. I would describe this thing as triangular in shape, with bright, crystal clear, slightly bluish lights underneath, at each apex of the triangle. It was moving very smoothly. I can't say that it was doing horizontal figure 8's, but that's pretty close. It moved almost like a kite gliding through the air, making sharp, turns. It had 5 or 6 lights on one 'end' of it, because we could see that row every once in a while. When it banked on a turn, we could see the three on the bottom of it. It did not have any blinking lights on it, and all of the lights were the same bluish white color. It was moving, stopping, turning and banking, and did not make a sound. The impression I have of this thing is that whatever was driving it had a mastery of physics and aeronautics that I have never seen before. We have never seen anything move like that and we can't stop thinking about it."],"Latitude":"36.752267","Longitude":"-119.767896","Log Number":"US-07062008-0010","Object Shape":"Triangle","Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","Case Number":"11450","Disposition":"IFO","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around July 6th 2008","This sighting has never been favorited.",""],"City":"Fresno","Date Submitted":"07/06/2008 12:05 UTC"}