{"Viewing Distance":"Unknown","Region":"New York","divs":["Sighting DetailsThis picture was taken over my beachfront on the Great Sacandaga Lake, in NY. Within minutes of sending it to Brian Vike, he had received one almost the exact same from the UK- also over water. Then, I found another EXACTLY the same from Istanbul Turkey (just google UFO-Istanbul-Turkey on YOUTUBE to find it-it starts with a view of Istanbul from the ocean and appears at about 26 seconds). My picture was taken with a Nikkon D200, the one on YOUTUBE was on video, so I don't think it's a camera defect. Also, the thing was not visible when the shot was taken, but strangely, here's the really strange part. I was contacted earlier that week by a gentlemen who said he saw an article I authored in UFO Magazine about a 1981 sighting I'd had outside Albany- of three orange-pinkish orbs or circles the size of the full moon, which rose from the horizon and made right angle turns and other weird maneuvers before heading- in a blink of an eye- out into space. (I've had others) Anyway, the guy sought me out because he said he had been seeing UFOs in Albany NY, one he said was manta shaped, but turned up as a cloud when he took a photo. I was suspect of his sightings for several reasons, but to make a long story short, he also has a camp here on the lake and called me the day before this particular photo was taken- to tell me that he was also seeing and taking UFO shots here on the lake and was \"vectoring in\" the craft. I was ready to write him off mainly because he said an ET was watching him from the balcony across the street from his apartment, and because he also told me that the ETs were \"aware of me\"... then, the next day, shooting pictures on my beach, this turns up. Huh. Needless to say, I no longer throw out the baby with the bath water. I was amazed and am still, a year later, a little spooked. Thanks, Brett Allen-former PYX106 disc jockey with a number one show on the number one Albany NY radio station."],"Latitude":"43.225627","trends":["There have been 2 other sightings in Northville","There were no other sightings in Northville on or around August 12th 2007","This sighting has never been favorited.",""],"Summary":"showed up in a picture of sky.","Object Shape":"Square, Rectagular","Case Number":"11451","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"None","Tags":"City","Date of the Event":"08/12/2007 12:00 UTC","Object Flight Path":"Unknown","City":"Northville","Object Features":"Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.225627,+-74.172077(11451)&iwloc=A&hl=en\"> mufon case (11451) map </A>","Longitude":"-74.172077","Log Number":"US-07062008-0011","files":["/var/www/straped/mufon/html2text/11451.html.txt","/var/www/straped/mufon/more/11451_submitter_file1__OurUFO.JPG","/var/www/straped/mufon/more/11451_submitter_file2__IstanbulUFO.jpg","/var/www/straped/mufon/org/11451.html"],"Date Submitted":"08/12/2007 12:00 UTC","Source":"MUFON"}