{"Source":"MUFON","Summary":"Large white fireball in the sky northwest of Denver, it left a white smoke trail that we tried to follow","divs":["Sighting DetailsWe were returning home and were approaching the light at 29th Ave and Speer Blvd. I was the passenger, and I saw a large white fireball with red or orange around the edge streaking downward from the sky at a very fast rate of speed. The large, center white light of it was very bright. I pointed it out to my husband, and he only saw the white smoke trail that it left behind. The smoke trail remained in the sky for about 10 minutes. We tried to follow it to see if something had crashed. I estimate that if something did crash, it landed around north Westminster or somewhere north of that. The light was fading, night was quickly setting in, and the smoke trail was dispersing. Despite losing track of the smoke trail because of the dark, we kept going. We drove north and west as far as Superior, but we were unable to find any evidence of something that had crashed. I seriously felt like it was low enough to the ground, large enough, and such a tremendous fireball that it would have made impact somewhere. My husband was disappointed to not see the fireball, but he definitely tracked the smoke trail in the sky with me. I hope someone else saw it. Please let me know if this was a meteor or something else."],"City":"Denver","Disposition":"IFO","Region":"Colorado","Longitude":"-104.977993","Country":"United States","files":["/var/www/straped/mufon/html2text/11462.html.txt","/var/www/straped/mufon/org/11462.html"],"Object Shape":"Fireball","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"11462","Date Submitted":"07/06/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.743174,+-104.977993(11462)&iwloc=A&hl=en\"> mufon case (11462) map </A>","Weather Factors":"None, Does Not Apply","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around July 6th 2008"],"Log Number":"US-07072008-0003","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"07/06/2008 09:00 UTC","Latitude":"39.743174","Object Flight Path":"Straight-line path","Object Features":"None"}