{"Region":"Colorado","Date Submitted":"07/04/2008 09:40 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Tags":"City","Object Shape":"Egg, Oval","City":"Northglenn","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-07072008-0008","Case Number":"11467","map":"<A HREF = \"http://maps.google.com/maps?q=39.896182,+-104.981147(11467)&iwloc=A&hl=en\"> mufon case (11467) map </A>","Object Features":"Unknown","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was watching the Westminster fireworks display with my wife on 104th and Church Ranch. I looked to my right (East) and saw an orange oval shaped light moved in a downward angle. It stopped and just sat there. I originally thought it to be a plane coming out of DIA and that the angle was just an optical illusion. But then it stopped and just sat in place. I tried to judge the distance and I put it over about 104th and Federal or maybe 104th and Washington. I sat there watching it and it faded out for a moment and then came back in the same location. A second light (identical to the first) swooped in from the right hand side very quickly and stopped instantly, directly next to the first light in a vertical line. At this point, I had my wife start looking for the video mode on our camera. Directly following, a third light appeared coming in the same manner as the second (same approach pattern, same direction, same speed. It stopped suddenly next to the other two lights and the three lights formed a vertical line. After about a minute of them sitting in a line. The first light moved in a circular pattern over the second light and the third light moved in between the two lights. It would be similar as the first and third light were chasing each other or 'playing tag' as the second light sat motionless. By this time, I had just gotten the second camera out of the car and started trying to take a video. The battery was dead on the camera so it shut off on me as the first and third light moved off in the direction the lights had originally come from. I managed to get the camera to work for a few seconds and caught the third light as it was leaving. Unfortunately, when reviewing the video, it simply looks like an orange light in the distance just turned off. Now, I can't really say what the objects were but I can tell you what it wasn't. Currently, there are no aircraft that can move like that, to my knowledge. They moved very quickly, in tight patterns, and stopped instantly. I can tell you it wasn't distant fireworks, because they cant stay in the air and form perfect vertical lines. I can tell you it wasn't a spotlight of any kind because the lights were orange in color and very bright (indicating they were powered units) unlike a spotlight which just reflects off of cloud cover and can only be seen brightly on a cloudy night. Anyway, I am hoping that out of the thousands of people outside watching fireworks in that area on July 4th, that someone caught it on video and just hasn't come forward with it yet."],"Source":"MUFON","Date of the Event":"07/04/2008 09:40 UTC","Summary":"three orange ovals","files":["/var/www/straped/mufon/html2text/11467.html.txt","/var/www/straped/mufon/org/11467.html"],"Longitude":"-104.981147","trends":["There have been 4 other sightings in Northglenn","There were no other sightings in Northglenn on or around July 4th 2008"],"Latitude":"39.896182","Disposition":"Unknown","Weather Factors":"Unknown"}