{"Date of the Event":"06/30/2008 07:15 UTC","divs":["Sighting DetailsI was in Sedona visiting my brother and his fiancee. it's really hot there, so they wait until late evening to go out. We were driving to a place called red rock crossing, and I was taking photos of the mountain landscapes out the window along our drive. I had my camera set to \"sports\", so it can capture images while moving wihtout blurring them. The next day, i uploaded my photos to my computer and was looking at them, to weed out the good shots and delet the crappy ones. Anyway, in one shot, I noticed a werid diamond shaped cloud, and a weird rectangle to the left with what looked like a rectangle shadow above it and to the right. I went into photoshop and brought up the contrast to try and see the weird shapes more clearly, and cropped them. I emailed them to some about 5 people, one who is an astronomer, and nobody knew what it was. Nobody knew. But, the last night of my trip, my brother had a party. I showed the photo to some locals and one guy told me to turn the photo sideways (landscape to the right) and zoom in to the diamond, becuase he said some \"ships\" fly sideways. sure enough, it looks like a saucer!!!!!!!!! Alos, I noticed more rectangles in the shot to the right. The upper right sectoion and another one really low to the horizon on the right. There are some shadows of dots, but that might just be birds or something. Anyway, the diamond shape is clearly not a cloud. The craziest thing is I never even saw them when I took the photo. Of course, the window was down so I had ind in my eyes, and I wasn't lookng for weid objects when I took the photo. Aftter the party night, i couldn't sleep wel and woke up from 2 \"nighmares\" becuase i was scared f aliens. I thought i saw people walking in the room i was staying in, but they were dreams. Sometimes I think I see people or weird see throguh things in my room when I am in that weird in between realm between sleep and wakefulness. I have always been interested in ufo stuff, and had some dreams years and years ago. but honestly, I haven't thought abotu it in years, and I wasn't thinking about ufos or aliens on this trip...until I saw the weid phtoo. i can hardly believe I took that shot! So, pleae investigate the photos or yourself and let me know what you find out. I can email you the original phtoo wihotuu the contrast and cropping. But I am at my friends house in atlanta and my computer won't get online, so i had to send the email versions I emailed he form my trip."],"City":"Sedona","Case Number":"11468","Latitude":"34.87608","Object Flight Path":"Unknown","Country":"United States","Log Number":"US-07072008-0009","Longitude":"-111.75795","files":["/var/www/straped/mufon/html2text/11468.html.txt","/var/www/straped/mufon/more/11468_submitter_file1__Weirdobjectsinsky2081A5.jpg","/var/www/straped/mufon/more/11468_submitter_file2__Weirddiamondcloud2081A7.jpg","/var/www/straped/mufon/more/11468_submitter_file3__Weirdrectangleand2081A8.jpg","/var/www/straped/mufon/more/11468_submitter_file4__P6285013.JPG","/var/www/straped/mufon/more/11468_submitter_file5__sedonaufowithRayemailversion.jpg","/var/www/straped/mufon/org/11468.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.87608,+-111.75795(11468)&iwloc=A&hl=en\"> mufon case (11468) map </A>","Summary":"Ii saw these in a photo I took, but not until the day after when I was uploading them to my computer","Source":"MUFON","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around June 30th 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Shape":"Cigar, Diamond","Date Submitted":"06/30/2008 07:15 UTC","Tags":"City","Object Features":"None","Region":"Arizona","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"Unknown"}