{"Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"07/05/2008 11:00 UTC","Log Number":"US-07072008-0011","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Country":"United States","Longitude":"-80.540347","Summary":"Two spherical amber globe-like lights were seen moving from North to souteast very slowly and then suddenly vanished.","trends":["There have been no other sightings in East Palestine","This sighting has never been favorited."],"Weather Factors":"None","Region":"Ohio","Tags":"City","Date of the Event":"07/05/2008 11:00 UTC","City":"East Palestine","Object Features":"None","files":["/var/www/straped/mufon/html2text/11470.html.txt","/var/www/straped/mufon/org/11470.html"],"Latitude":"40.833951","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.833951,+-80.540347(11470)&iwloc=A&hl=en\"> mufon case (11470) map </A>","Case Number":"11470","Disposition":"Insufficient Data","divs":["Sighting DetailsI did not witness this event but was on the phone with the person who did as it happened. At 11 pm EDT, my friend Tom B. called me and requested that I go out side with the phone and look up in the sky to the east. He said he was viewing two big amber or orange globe-like lights moving slowly across the sky toward the southeast. I did as he requested but my view was blocked by trees. As I attempted to get a better look, Tom informed me over the phone that they had just vanished \"into thin air.\" He said he had stepped out of his front door just before eleven and saw the lights above the apartments across from his. Tom said they were large, dime sized globes, amber or orange in color about 1000 feet apart and low in the sky. They were making no sound and moving very slowly. He then called me and watched as they moved to the southeast sky and vanished without warning. He said they were round and globe-like and definitely not like anything he had ever seen before. Later, we learned that another person living several blocks away had seen them as well. It should be noted here that Tom also lives further down the street from me, about 200 yards away toward the east. While telling this story to my friend Rick D. this morning, he informed me that he and his mother had seen apparently the same or similar globe lights on the evening of June 19 at about 9:30 pm and these lights were directly over their heads in the back yard. They were exactly the same in description and completely silent. They were stationary and then moved slowly to the north and then suddenly changed color to a glowing white and zoomed off at intense speed to the north and out of sight. This occurred on a street to the north of mine in East Palestine. Another person know to my friend sighted the same lights that night of June 19 north of town by the water tower. All witnesses said they were taken by surprise and all said that these \"globes\" were impossible to confuse with any craft they were familiar with. They also said that these objects were more like some kind of lights and not like anything resembling crafts. Rick and his mother, who observed them directly overhead said they looked like transparent amber globes but intensely bright. All the witnesses I have spoken to are willing to tell their stories and reveal their indentities to any investigtors."]}