{"Case Number":"11472","Latitude":"36.412808","map":"<A HREF = \"http://maps.google.com/maps?q=36.412808,+-105.563966(11472)&iwloc=A&hl=en\"> mufon case (11472) map </A>","files":["/var/www/straped/mufon/html2text/11472.html.txt","/var/www/straped/mufon/org/11472.html"],"Tags":"City","City":"Taos","Source":"MUFON","Longitude":"-105.563966","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy experience was and continues to be lifechanging beyond prior belief. I had recently made some Startling discoveries regarding the Human Dillemma of this planet- I had also came to the solid conclusion that the extra terrestrial presence is very much a reality. In late March, I was driving home from Arroyo Seco [mountain village on highway 150] to my home in Des Montes. The topic of extraterrestrials came up during our ride, and almost simultaneously my co-worker pointed to a flashing Orb hovering over the Taos metropolitan area. This did not come as a surprise, but it sure was exciting. We spotted several of these lights surrounding the Taos County airport on the Mesa, and proceeded to drive there. When we arrived to the Airport, as if it were all just a mirage, they \"turned off\", nowhere to be seen. To our dissapointment, we left. Along our way home, we decided to stop at the Rio Grande gorge bridge. After sitting in the car for several minutes we saw a similiar orb \"turn on\", and moved in ways that defied \"common logic\". From this orb emerged three, it literally split into three. A strong energy seemed to surround us, enveloping our physical body in waves of essence. Symbols began appearing in my mind, I then understood that these lights were not only extra terrestrial, they are extra dimensional. Going home amazed, I felt a sense that I would see \"them\" again. Sure enough, I have had countless ET experiences since this time, if anything I say the presence is increasing in visibility and connection to myself, and those around me. I don't know too much about my new friends in the skies, but I do know that they are there because I can simply feel their presence. They leave my younger brothers gifts, as well as myself and my girlfriend. Countless witnesses to this local phenomenon are gradually evolving telepathically, emotionally, and mentally. Many are getting in touch with the Star Brothers themselves, many are channeling extra terrestrial viewpoints and perspectives. This includes the Pleiadians, Andromedans, Sirans, and other benevolent ET Civilizations. I am willing to assist anyone who desires to educate themselves with the true knowledge of the Universe. Our Higher Self is our greatest teacher! CT- New Mexico"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Region":"New Mexico","Object Features":"Undisclosed","Country":"United States","Date of the Event":"03/28/2008 09:20 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Summary":"Progressive Contact Starting March 28th - NM","Object Shape":"Diamond, Egg, Fireball, Flash, Triangle","trends":["There have been 4 other sightings in Taos","There were no other sightings in Taos on or around March 28th 2008"],"Weather Factors":"Unknown","Date Submitted":"03/28/2008 09:20 UTC","Log Number":"US-07072008-0013","Disposition":"Insufficient Data"}