{"Tags":"City","Date of the Event":"07/05/2008 09:30 UTC","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Summary":"Black triangle object, orange spheres dropping red pulsating objects, 3 different formations all meeting","Region":"Michigan","Latitude":"41.799217","Source":"MUFON","Object Features":"None","divs":["Sighting DetailsThis happened over a small lake in the middle of Amish farm country. This description is very odd, unbeliveable and mind boggling. Here is what happened. While staying at a cottage for a small family gathering we hopped on the family pontoon boat. It was around the 4pm hour. This lake is very small and is surrounded by small cottages and a farm. As we spun around for our second around the lake I saw what looked like a blackish grey triangle shaped fighter jet come banking out of the tree line from the west. Because I thought I was seeing things, I nudged the person sitting next to me and pointed to the object now flying towards the North. What they said was \"I hope its not Iraqi\". What was so odd besides a black fighter triangle jet basically coming out of the trees in front of us in the middle of nowhere, was that there was no noise from the plane or object. There was no markings, lights, windows. It happened just like that and it was gone. Also, what was interesting is that it came out of the tree line on a tilted angle so I was looking at it as a whole object. It was not shiny, it was dull and flew at a very high speed. Later on that evening around 9:30 pm, I decided to go sit on the now docked on the pier pontoon boat and take pictues of the moon in the west. I was out there for awhile taking pictures while the rest of the family was on the shore. My cameras were not taking good pictures because it was getting dark so I brought them inside the house. I decided to go sit back on the boat and enjoy the millions of stars that were now in the sky. As I sat facing North I turned my attention to the East sky because I noticed what looked like a huge white light blinking on and off as well as smaller orange starlike lights blinking on and off and moving around. At first I thought it may be a plane and or fireworks. But it wasnt, this blinking white light then blinked on and moved towards the smaller orange lights that kept moving into several foramtions. Triangles, squares. In the binculors these lights looked like they were 4 dots that formed a square. While this was happening, then some of these orange lights started moving to the North tree line away from the formation. As these orange lights made there way to the tree line other orange lights appeared from the tree line as though they were meeting. Then all of a sudden these orange lights dropped what was an object atleast 3 times its size from itself. These objects were glowing red and had 3 parts to them. The glowing red pulsating objects were dropped into the trees. As they dropped inside the tree they got smaller and turned white. They just hovered there. Another one of these pulsating lights just hovered over the tree line. I was going crazy in awe, alittle scared and trying to watch two seperate sightings at once!! Thats when my friend came to see me on the boat. I pointed to this pulsating red object over the tree line and it started moving to the other formation still going on in the East. My friend saw this and got scared and left. This was so crazy!!!! Just as this red pulsating light went into the other foramtion all the lights in that formation just went crazy and started moving around and made more formations. Then from behind me I see what I thought were 3 helicopters flying in a straight line towards this formation in the East. These objects were red, orange and yellow and made no noise. I thought this is it and really got scared!!!!!! The first one of these objects stopped dead just before it reached this light formation in the East. The other 2 objects that were following all melted into this first object and then it proceeded to join the formation in the East. It started fading into a smaller orange light. This foramtion slowly faded almost one by one light until it was gone. The other lights in the North were still there and also in the trees as it seemed like they were watching. Please note that this was a family gathering and there were many children there and were kept unaware. At least 2 other adults witnessed something and we kept it under wraps because we did not want to scare them. This was the most incredible, amazing and scary experience ever!!!"],"Log Number":"US-07082008-0006","City":"Sturgis","Weather Factors":"None","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Object Shape":"Circle, Oval, Sphere, Star-like, Triangle","Longitude":"-85.419148","trends":["There have been 4 other sightings in Sturgis","There were no other sightings in Sturgis on or around July 5th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.799217,+-85.419148(11479)&iwloc=A&hl=en\"> mufon case (11479) map </A>","Date Submitted":"07/05/2008 09:30 UTC","Case Number":"11479","files":["/var/www/straped/mufon/html2text/11479.html.txt","/var/www/straped/mufon/more/11479_submitter_file1__pix64.jpg","/var/www/straped/mufon/org/11479.html"]}