{"Sighting Duration":"00:01:12","Case Number":"11476","Object Flight Path":"Other","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"TOKYO","Date Submitted":"06/12/2008 04:30 UTC","Latitude":"35.697688","Disposition":"Unresolved","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/11476.html.txt","/var/www/straped/mufon/more/11476_submitter_file1__DSC05694.JPG","/var/www/straped/mufon/more/11476_submitter_file2__DSC05694_2.JPG","/var/www/straped/mufon/org/11476.html"],"trends":["There have been 7 other sightings in TOKYO","There were no other sightings in TOKYO on or around June 12th 2008","This sighting has been favorited 2 times.",""],"Source":"MUFON","divs":["Sighting Details I was in line waiting to enter the Nippon Budokan to view a title boxing match. While I was in the line I decided to take out my 6.0 mega pixel digital sony camera that was locked on to my belt and take a picture of the front of the building to keep as a souvener. I took the picture. I then took a quick look at the picture in my camera. A few seconds later I took a second look because I had seen something else on the top right coner of the picture. Suddenly a strange feeling just jolted up my body. Like when the hairs of your back just shoot right up. The feeling was very unpleasent . My body told me to look up so then I did. That was when I saw the silver disk like shape. The hovering disk was emitting some sort of eerie black shade underneath it I don't know what it was. My eyes just went wide open, I began to sweat . The flying object was just hovering in mid air at a great distance from the floor for a couple of seconds. I quickly turned to tap the gentleman that was next to me to look. When I looked back, the flying disk was gone. No sign whatsoever of it. I later started thinking that maybe it was a result of the years in boxing that made me see things. But now I now that it was no Imagination because I have a picture of it."],"Summary":"SILVER SAUCER LIKE SHAPE","Date of the Event":"06/12/2008 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.697688,+139.694756(11476)&iwloc=A&hl=en\"> mufon case (11476) map </A>","Log Number":"JP-07082008-0003","Object Features":"Other","Longitude":"139.694756","Region":"Tokyo","Country":"Japan"}