{"Sighting Duration":"00:06:00","City":"Undisclosed","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/11478.html.txt","/var/www/straped/mufon/org/11478.html"],"Date of the Event":"06/13/2008 10:45 UTC","Longitude":"-85.601124","Source":"MUFON","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.323764,+-85.601124(11478)&iwloc=A&hl=en\"> mufon case (11478) map </A>","Object Features":"None","Weather Factors":"Unknown","Country":"United States","Summary":"I saw a large triangular craft during a thunderstorm.","trends":[],"divs":["Sighting DetailsI saw one during a thunderstorm, June 13 or 14 2008 about 00:45. It flew directly overhead at about 200 to 300 feet altitude. It was triangular with a bright white light at each corner, black or dark grey in color. In the center there appeared to be a circular opening with a dim reddish orange glow inside. This circular opening was surrounded by small white lights. In the center of the back edge there was a rectangular red light that didn't blink. The back edge of the craft was perfectly straight from side to side. This craft was at least 100 feet wide. Form a distance of a mile it looked like the top of a huge a cell phone tower with bright white lights at each corner. The lights were perpendicular, like cell phone antenna. It hovered about 200 to 300 feet above ground. As we passed it by, We noticed it was huge, way too big to be a cell phone tower, and something we had never seen before. I drove less than two miles. Dropped off my passenger at Johns Bar, and turned around. On the way back it flew directly overhead. This event was witnessed on M-15 between Bay City and Munger Michigan near Russel Rd. the night of the thunderstorm during the weekend of June 13th."],"Date Submitted":"06/13/2008 10:45 UTC","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Tags":"City","Log Number":"US-07082008-0005","Latitude":"44.323764","Case Number":"11478","Disposition":"Insufficient Data"}