{"Date of the Event":"07/08/2008 04:10 UTC","Date Submitted":"07/08/2008 04:10 UTC","files":["/var/www/straped/mufon/html2text/11477.html.txt","/var/www/straped/mufon/more/11477_submitter_file1__IMG.jpg","/var/www/straped/mufon/org/11477.html"],"Sighting Duration":"Undisclosed","Summary":"i was out with my dog he woke me up again,saw the light in the sky three bright ones","Viewing Distance":"21-100 Feet","Disposition":"Unknown","trends":["There have been 29 other sightings in Levittown","There was one other sighting in Levittown on or around July 8th 2008","This sighting has never been favorited.",""],"Weather Factors":"None","Longitude":"-74.826715","Log Number":"US-07082008-0004","City":"Levittown","Object Shape":"Cylinder, Disc, Triangle","divs":["sighting detailsi was out in the yard with my dog it was 4.10am on july 8,2008 and i looked up in the sky and saw four lights this time, three that looked like two eyes and a nose bright head lights and a little father away but it was part of the object a pink color light at the front of the object. and i saw like a blue fog out which i will call the back of the object, it looked like it was shinning lights around i watched for over 40min just moved slowly through the sky not leaving it space to much. i thought i saw silver flakes falling down into the tree tops and after a while the flakes went back up to the object. i thought it was lighten bugs or fireflys. but it went back up.near the craft. it was still up there when i went to bed, i tried to take pictures again they look to black .it made no noice,moes quickly small areas,i get a little nervous being out there to long.this is the forth time i have seen ufos in the levittown area since april\\it was very overcast so i couldn't get a good look at the sides of the object,every once in a while a quick glimpse. color sides"],"Tags":"City","Latitude":"40.16387","Country":"United States","Region":"Pennsylvania","Object Flight Path":"Undisclosed","Case Number":"11477","map":"<A HREF = \"http://maps.google.com/maps?q=40.16387,+-74.826715(11477)&iwloc=A&hl=en\"> mufon case (11477) map </A>","Source":"MUFON","Object Features":"None"}