{"Source":"MUFON","Date Submitted":"07/08/2008 01:00 UTC","Viewing Distance":"Over One Mile","Object Features":"Unknown","Date of the Event":"07/08/2008 01:00 UTC","files":["/var/www/straped/mufon/html2text/11484.html.txt","/var/www/straped/mufon/org/11484.html"],"Sighting Duration":"Undisclosed","Disposition":"IFO","City":"Sebago","divs":["Sighting DetailsI was up later than usual and went out on my porch overlooking Sebago Lake to smoke a ciggarette. I noticed what looked like an extremely bright star, but then realized it couldn't have been a star as I had never, ever seen one this bright. I grabbed my binoculars and got a closer look - it was hard to see cuz it was night time but I could see the object was like 2 white orbs on top of each other, and it was hovering stationary over the lake! There was no noise. All of a sudden, a red orb appears directly below the white orb and starts flying around at incredible speed. I watched for several seconds in disbelief and then ran upstairs to grab my camera, which has a crappy video mode also. I was able to capture about 15 seconds (the limit on my camera) of the red orb (the white one wasn't easily visible against the backdrop of the stars). I could tell the two objects were miles away, but the red orb moved across the lake in a split second - it must have been moving at thousands of miles per hour. Soon afterwards the red orb appeared to go above the white, stationary orb and then disappeared from view. I was shocked. The video attached is very low quality and only the red orb is visible moving around. I have no idea whether this was a camera defect but it was NOT a firefly - that was what I thought originally until it was obviously acting under intelligent control and interacting with the white orb."],"trends":["There have been 2 other sightings in Sebago","There were no other sightings in Sebago on or around July 8th 2008","This sighting has never been favorited.",""],"Summary":"Two bright objects over Sebago Lake - obviously not aircraft","Object Shape":"Circle, Sphere, Star-like","Log Number":"US-07082008-0011","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.88728,+-70.677518(11484)&iwloc=A&hl=en\"> mufon case (11484) map </A>","Longitude":"-70.677518","Country":"United States","Region":"Maine","Weather Factors":"None","Latitude":"43.88728","Object Flight Path":"Stationary,Path with directional change","Case Number":"11484"}