{"City":"Undisclosed","Summary":"SEE BELOW","Disposition":"Unknown","Source":"MUFON","divs":["Sighting DetailsI woke up at approximately 4:20 AM on June 3rd, 2008. As I laid there looking out the window next to my bed (a large casement window 5'x5' & faces due north & gives me a panoramic view of the sky beyond the tree line at the back of our property) I saw a small gray cloud off in the distance. The rest of the sky was clear, no other clouds, & you could still see the stars. As I stared out at the sky I noticed the small cloud was moving closer in my direction at a very slow speed. The closer it got the more it didn't look like a cloud & began to take a definite shape, that of an elongated hexagon, dark gray in color just a shade darker then the backdrop of the sky. I could not say how high it was because there was nothing in the foreground to compare it to. Also, this object was very large, which made it very hard to tell its size or how high it was. If I had to guess, I would say if it was at an altitude of about 600 ft, its size was well over 100 ft. wide & long, with two of the sides slightly longer. If it was at an altitude of about 1000 ft., this thing was immense. As I got out of bed & went to the window (which was open) I noticed there was no sound coming from it, although it was only about 400 to 500 ft. from the back of my property, but because of its altitude I could still only see the bottom. At that point it began to make a right hand turn toward the west & continued doing almost a 180 degree turn. However it did not turn on a flat plane, but dipped slightly as it turned. I have never seen anything turn like that. The only way I could describe it was a very fluid sliding turn. As it turned, I could see that above the bottom there was a single rectangular light panel or window on each of its sides, I am assuming all sides, but I only saw three as it turned. These windows or panels were very dimly lit, just a shade lighter then the backdrop of the sky & I could not make out any framework or detail above. After the turn it went back at about a 15 degree angle from the direction it came & went a short distance, made another right turn, & came back along the same line it originally came on toward the south. It must have been gaining altitude because it started to look smaller. From the time it was over my back yard until it made its final turn, was less then a minute or so, but seemed like eternity. All I could think was \"I can't be seeing this\" or \"its not really happening\"! As it approached & was just about to cross over our house, it got distorted like looking across a hot asphalt road or something giving off a lot of heat like a grill, & then it was gone! By the time I got out my front door on the other side of the house, there was nothing but clear sky, stars, & not a cloud in sight. Running to the front door woke my wife up (she sleeps in another bedroom because I snore) I said to her, \"you won't believe what I just saw\"! AND SHE DIDN'T!. P.S. The following day, June 4, 2008, I called our local newspaper the Intelligencer, to see if anyone called about seeing anything strange in the sky the night before. They said they hadn't received any, but put a reporter on the phone (Freda R. Savana, who covers my area). She wanted to know why I asked, did I see something I wanted to talk about? I told her basically what I wrote above, but did not give her my name. I told her I might call back in a few weeks to see if anyone else called to report something similar to what I saw. I decided to file this report with MUFON, when I saw an article in the paper & newscast on channel 3, about people reporting seeing strange crafts in Bucks County, PA. I am including my name & contact numbers, but want to be assured my identity will be kept strictly confidential at this time. The only people that know of this incident are my immediate family, & I would like to keep it that way. Thank you. The photos below are not real done on computer."],"Country":"United States","Log Number":"US-07082008-0013","Weather Factors":"None","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.206882,+-77.192825(11486)&iwloc=A&hl=en\"> mufon case (11486) map </A>","files":["/var/www/straped/mufon/html2text/11486.html.txt","/var/www/straped/mufon/more/11486_submitter_file1__2008-07-06019.jpg","/var/www/straped/mufon/more/11486_submitter_file2__2008-07-06020.jpg","/var/www/straped/mufon/more/11486_submitter_file3__2008-07-06022.jpg","/var/www/straped/mufon/org/11486.html"],"Object Shape":"Other","Latitude":"41.206882","Date Submitted":"06/03/2008 04:20 UTC","trends":[""],"Tags":"City","Region":"Pennsylvania","Sighting Duration":"00:05:00","Longitude":"-77.192825","Date of the Event":"06/03/2008 04:20 UTC","Case Number":"11486","Object Features":"Window(s)","Object Flight Path":"Path with directional change"}