{"City":"Lansdale","Region":"Pennsylvania","Log Number":"US-07082008-0008","Case Number":"11481","Object Shape":"Disc, Fireball, Saturn-like","Object Flight Path":"Hovering then path","Country":"United States","files":["/var/www/straped/mufon/html2text/11481.html.txt","/var/www/straped/mufon/org/11481.html"],"Weather Factors":"Unknown","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"40.244005","Date of the Event":"01/22/1996 05:30 UTC","Date Submitted":"01/22/1996 05:30 UTC","Object Features":"Unknown","trends":["There have been 12 other sightings in Lansdale","There was one other sighting in Lansdale on or around January 22nd 1996"],"Summary":"I saw a hovering object with yellow & orange blinking lights in my backyard","map":"<A HREF = \"http://maps.google.com/maps?q=40.244005,+-75.282336(11481)&iwloc=A&hl=en\"> mufon case (11481) map </A>","Viewing Distance":"21-100 Feet","Longitude":"-75.282336","divs":["Sighting DetailsEvery night after I use the bathrooom, I always look out my back window into my backyard. At approx 5:00AM-- what I saw was so amazing I woke up my children - (then 14 & 11) andcalled my next door neighbors. About 30 feet beyond my window there are many trees-in a wooded area--I saw a hovering disc shaped object with orange & yellow blinking lights. It seemed to be scanning the ground. There were also yellow blinking lights going back & forth in about a 10 yard stretch from my neighbors property to mine. This entire episode lasted about an hour until daybreak -then either it disappeared or was not visible. I called my local police to see if anyone else reported this siting-they said no. But 2 officers came over to my house & looked around but saw nothing--The next day my neighbor & I walked into the woods where I had seen the siting & again there was no indication of anything being there where I saw it. I was constantly being teased for what I saw --like I made it up --but to this day I still have a very vivid memory of that startling experience. And I do believe it was something that cannot be explained.. I feel very fortunate to have witnessed such an extradinary site. It gives me the chills when I recall the episode."],"Source":"MUFON"}