{"divs":["Sighting DetailsI wish i could say that I had a witness to what I am about to explain happened last year in the sky right above my house, but unfortunatley I was alone that night when it happened. I had been timing satalites going over my house and know about the time to come out and watch them on a nightly basis. They pass so gently across the sky and are absolutley spactacular to watch as they gracefully move across the sky. As the third one passed directly above our house that night, I noticed a star like object with a bright shade of blue that I had never seen before move quickly into a holding position as the satalite gracefully moved across the sky. I could not beleive what I was seeing and wished there was someone around to show this to at the time.... It stayed in the same spot for about 15 minutes and in a blink of an eye, it screamed across the sky at a blinding speed taking a perfectly streight path out of sight? At that point, I knew immediatly that I had just witnessed a U.F.O. for the first time in my life! An emotion flooded over me of extreame inferiority. In the Marine Corps I had witnessed many different missles being fired and they move in slow motion compared to the speed of this craft. I will never doubt anyones stories about U.F.O.'s ever again! I only bring this experience to this site because others that have witnessed something like this would not make fun of it or me ... I now watch the sky on clear nights in hopes of seeing something this amazing again real soon! Respectfully, Richard M."],"Disposition":"Unknown","Case Number":"11488","Latitude":"42.279241","City":"Rockford","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Region":"Illinois","Object Shape":"Star-like","Date of the Event":"10/25/2007 12:00 UTC","Object Flight Path":"Stationary,Straight-line path","Longitude":"-89.086175","Country":"United States","Summary":"Satallite Gazing","Object Features":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/11488.html.txt","/var/www/straped/mufon/org/11488.html"],"Log Number":"US-07082008-0015","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around October 25th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.279241,+-89.086175(11488)&iwloc=A&hl=en\"> mufon case (11488) map </A>","Date Submitted":"10/25/2007 12:00 UTC"}