{"Source":"MUFON","Longitude":"-79.615305","map":"<A HREF = \"http://maps.google.com/maps?q=35.640139,+-79.615305(11485)&iwloc=A&hl=en\"> mufon case (11485) map </A>","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Other","Viewing Distance":"501 Feet - 1 Mile","Case Number":"11485","Region":"North Carolina","City":"Coleridge","Sighting Duration":"00:07:00","Object Features":"Unknown","divs":["Sighting DetailsOn Sunday July, 6th 2008, My 2 friends and I were on our way back home yesterday after an outing. It was about 5:15 pm and we were turning right onto Old Coleridge Rd off of Manor Rock RD., when we witnessed what looked like an enormous solid black V hovering in the shallow valley area, over the back side of the ridge I live on. Sitting in the back seat was XXXX, she is a Federal Agent and she had a clear view of the object at hand. I was sitting in the passenger seat and took the pictures through the vehicle since I still had my camera around my neck from taking pictures earlier in the afternoon. XXX was driving and didn't see anything but the road ahead! I've included the two photos that I took, once I realized we were seeing something unusual. I could see the objects as they began dispersing very quickly in different directions. XXXX was straining to see the larger object, to closer identify it before loosing sight because of the tree line. As we were rounding the bend in the road, I witnessed an object shooting away to the South at incredible speed, as we turned back into viewing range the large object was gone, but several smaller objects in various shapes and sizes appeared and disappeared as they dispersed in different directions. There was one bird in the air at the time. XXXX could not conclusivly identify the large object. I believe that the valley behind my property is a \"hot spot\" for some reason. This is my first hardcore visual sighting of the object(s) that seem to be attracted to our area."],"Date Submitted":"07/06/2008 05:15 UTC","Country":"United States","Weather Factors":"None","Disposition":"Insufficient Data","Latitude":"35.640139","files":["/var/www/straped/mufon/html2text/11485.html.txt","/var/www/straped/mufon/more/11485_submitter_file1__7608field2.JPG","/var/www/straped/mufon/more/11485_submitter_file2__Field76081.JPG","/var/www/straped/mufon/org/11485.html"],"Log Number":"US-07082008-0012","Date of the Event":"07/06/2008 05:15 UTC","trends":["There have been no other sightings in Coleridge","This sighting has never been favorited."],"Object Shape":"Blimp, Bullet, Missile, Sphere, Triangle","Summary":"Witnessed very large triangle shape that dispersed into several individual crafts"}