{"Latitude":"32.733699","Country":"United States","Region":"Texas","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Fort Worth","Summary":"ball of light below a plane, hovered low, turning red, zig zag maneuvers","Log Number":"US-07092008-0007","Date of the Event":"09/14/2003 08:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.733699,+-97.31248(11499)&iwloc=A&hl=en\"> mufon case (11499) map </A>","Case Number":"11499","Object Shape":"Oval, Sphere","Viewing Distance":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11499.html.txt","/var/www/straped/mufon/org/11499.html"],"divs":["Sighting DetailsI lived in west Fort Worth and went out onto my 2nd floor balcony. A plane to my east caught my attention. It was flying North to South, presumably out of DFW airport. Suddenly I saw a ball of light which appeared to be slightly behind and below the plane shoot forward extremely fast and get ahead of the plane. It turned red at the end and disappeared. My first thought was that it must have been a meteor. Then I saw the light moving above the plane toward the back (It probably was a good distance away from the plane). I lost sight of it again. I began to scan the sky and saw a red glowing object just hovering through the upper branches of some trees that were about 50 feet away to the southeast. This was much lower than when I had seen the ball of light. The object appeared darker, more solid, in the center with a see-through red glow. It was more oval as I recall. It suddenly shot straight up, wobbled near the top of the flight, then stopped and hovered. When it shot up it was a ball of light with no hint of red. At some point it went rapidly north, stopped and hovered. Then with no visible turn went rapidly south. A couple of time it went staight up and down making zig-zag moves on the way. It made several maneuvers and I got the impression of it being defensive moves. It eventually took off to the northwest, going faster than a plane but nothing to compare with it's previous movement. I lost track of it as there were some thin clouds in that area. I knew of nothing to consider it but a UFO. The DFW Naval Air Reserve Base was about 10 miles to the northwest of me but this was certainly not like anything I had ever seen and I have lived in this area most of my life."],"trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around September 14th 2003"],"Sighting Duration":"00:03:00","Tags":"City","Longitude":"-97.31248","Weather Factors":"None","Date Submitted":"09/14/2003 08:16 UTC"}