{"files":["/var/www/straped/mufon/html2text/11492.html.txt","/var/www/straped/mufon/org/11492.html"],"Viewing Distance":"21-100 Feet","Summary":"The object was nearly invisible but had blue lights that gave it away as it \"floated\" over our 4th of July celebration.","Log Number":"US-07092008-0002","Object Shape":"Other","Disposition":"Unknown","Latitude":"39.558221","Tags":"City","divs":["Sighting DetailsOn the July 4th, 2008, my daughter and her neighbors had a huge block party with a BBQ, a band and lots of fireworks. About 9:30 P.M.,I was sitting in a chair on the front lawn of a neighbor and was watching all the people dancing in the street to the music. At the same time, some of the folks were setting off the fireworks. It was quite a celebration. The air was filled with smoke from the fireworks and I was looking up in the sky at beautiful firework that had just been shot off, when something weird caught my eye. In the sky maybe a little higher than the roofs of the 2 story houses I saw an area of the sky that had what appeared to have a \"ripple\" in it. It looked kind of like when one sees the wavy hot air on on a highway in the summer. In this ripple was something that had pale blue lights. The lights did not blink and the lights appeared to sort of outline the object. All of this was very dim and it was difficult to make out exactly what it looked like. I had a sense that it was shaped sort of like a figure eight. The object was completely silent and moving slowly. I watched it pass over all the people dancing in the street. It appeared to be slightly tilted inward. There was a lot of smoke in the air so that added to the poor visibility. I was just mesmerized by this thing and did not want to take my eyes off of it in case I could not find it again. The party was very noisey and I knew that if I yelled at anyone to look, they probably would not hear me. This whole episode lasted maybe 10 seconds at the most. The rippled air and the object just disappeared as it came out of the smoke. I had the feeling that if I had been up on the top of the roof, I could have touched the object. I also felt that the smoke in the air had something to do with the fact I was able to see this thing. I probably would not have noticed it if it hadn't been for the pale blue lights that I saw. Funny thing was, I was not the slightest bit afraid or shocked."],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Other","Date Submitted":"07/04/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.558221,+-105.774007(11492)&iwloc=A&hl=en\"> mufon case (11492) map </A>","Date of the Event":"07/04/2008 09:30 UTC","Country":"United States","Longitude":"-105.774007","trends":[],"City":"Undisclosed","Source":"MUFON","Region":"Colorado","Sighting Duration":"00:00:10","Case Number":"11492","Object Features":"Unknown"}