{"Source":"MUFON","Longitude":"-116.313066","Tags":"City","Object Features":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Watching what I thought was a satellite, I was astonished to see it accelerate instantaneously and fly away, zig-zagging.","trends":["There have been 6 other sightings in Joshua Tree","There were no other sightings in Joshua Tree on or around July 15th 1979"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.134728,+-116.313066(11498)&iwloc=A&hl=en\"> mufon case (11498) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"07/15/1979 12:00 UTC","Latitude":"34.134728","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11498.html.txt","/var/www/straped/mufon/org/11498.html"],"Object Shape":"Star-like","divs":["Sighting DetailsFriends and I were at the site of an abandoned well, north, perhaps 4-5 miles, off HWY 62, between Joshua Tree and Yucca Valley (a mile or less east of Yucca Mesa Road), far away from surrounding lights. I don't recall any moon out that night. I said July 15, but that's a guess. Somewhere in July or August, has to be about right, because it was still VERY hot, probably 95 degree F., that late at night, and the wind was hot, and characteristically out of the south for that time of year. I was scanning the sky, when I thought I spotted a satelite, moving from south to north, nearly directly over us, perhaps 80 degrees up from the eastern horizon. I had seen satellites in the night sky previously, and this was about as bright as those--though the ones I had seen previously had not been in polar orbit. The others I'd seen moved from west to east--and moved at about the same speed in comparison to background stars. As a child, when satellites were relatively new, I had learned to look for them at a summer camp. A counselor had pointed one out to us, and it was not hard to see. But it would have been hard to notice, without his use of a flashlight to illuminate the sky immediately surrounding it. He pointed out that to be sure about it, you had to track its movement against the background stars. He said they could be spotted by someone who was patient and took the time to slowly scan the sky, stopping to focus on small patches, looking for movement among stationary objects. I had spotted a couple of others over the many years intervening between that night in my childhood and this one. I had also used the technique described to identify many obviously terrestrial aircraft, at a great distance over the many intervening years, far before friends ever spotted them. The technique was automatic by then. I was about to point out the \"satellite\" to the entire group, having spent a minute or more verifying what I was seeing, when a friend, R, asked me what I was looking at. After he failed to spot it with me meerely pointing at it, I pointed it out to him--using a very bright, focused beam flashlight--and he also began tracking the progress of the light. From the ground, it appeared slow, steady, traveling in a straight line, with a brightness slightly less than an \"average\" star, easily visible to the naked eye--though its motion against the background was not at all easy to see without use of the technique of gazing steadily at a small patch of sky, and looking for motion within that small area. Like the others I'd seen previously, it was clearly there, clearly moving, slowly, in a straight line, against the background of the surrounding stars; but it would have been easy to miss, unless you just happened to look at or near it, and you were accustomed to viewing small patches of the night sky with particular attention to motion-detection. R said he'd never have spotted it without my use of the \"flashlight-pointer.\" A minute or so after R began watching it, a few other friends heard us talking about it, and I tried pointing it out with my outstretched arm, and finger, as I had done previously with R, but to no avail. So I quickly hit the spot with my flashlight again, for the second or two that it took to turn on the light and get it directly on the spot, leaving it there long enough to make it clear the target was in the middle of where the light had steadied. I knew that the presence of that light would degrade night vision, so I kept exposure to that light as minimal as possible. R and I had both acquired the target, and the light was not enough to make us lose it. But the others never had a chance to acquire it. As soon as the light was off, the little spot of light, still moving slowly, changed direction slightly. Before I had any chance to even think about that, it made what can only be called an instaneous acceleration, and simultaneoulsy began zig-zagging, appearing to increase its altitude as it made very sharp, pointed, zig-zags and its brightness dimished with the apparent increase in altitude, until it was no longer visible. R and I turned to each other, mouths both agape. We discussed what we saw, and what we both saw was what I just described. Our skins were crawling, because we knew what we had just seen was no damned satellite. Satellites don't change direction, even slowly like that one did, at first. Even while still moving slowly, that first change of direction was perhaps along the lines of 20 degrees right, relative to previous trajectory. They also don't accelerate instantaneously, and they certainly don't then start to zig-zag. I tracked the object through perhaps 20-25 degrees of arc in the sky--using, as a rule of thumb, the horizontal width of a fully extended fist against the sky is 10 degrees. R saw it for pehaps 60-70% of that travel. The time from its first change of direction to its disappearance was 1-1.5 seconds. From the time it started to zig-zag, to its disappearance was about a second, if not slightly less. The first, slow, change of direction didn't last long, maybe half a second before the first, severe change of direction occurred along with the instanteneous acceleration. The next change was around 135 degrees right, farther still--which meant it reversed direction, and flew for a very short time in south-easterly direction, then it zigged and zagged, growing ever dimmer, until its disappearance. There were perhaps 7-8 zigs and zags during this very short period, each around 90 degrees. I've often tried to describe verbally what I saw, never with much satisfaction. So, I take the time to write it here, as precisely as I can. It was like watching a pool ball bounce between opposing, but also converging banks on a pool table, speeding up as it went, not slowing down, and becoming smaller as it went. Of course, it wasn't becoming smaller, but dimmer, instead. If one believes, as I do, that what I was watching was maintaining a steady size and brightness, but was only becoming dimmer due to increasing distance, the the apparent \"convergence of the banks on the pool table\" was an illusion similar to seeing railroad tracks converge in the distance. My thoughts are that the zig-zag course was tightly maintained, in terms of the real distance traveled over each leg of any particular zig or zag. Of course, I have no way of verifying that. As that light zig-zagged out of sight, it appeared circumscribed within an angle of about 30 degrees. Not 30 degrees of sky, but as if the banks on the table were spreading out from a point at about 30 degrees of angle. From the first, severe zig, to the side of the next zag was, maybe 2.5-3 degree of arc on the background sky--growing ever smaller with each succeeding course change. The size of the patch of sky would be around that of your thumbnail, or slightly smaller, extended at arms length against the night sky As I said, none of the others got a chance to see it. About 7 or 8 years later I learned that R, who I hadn't seen in during the preceding 4-5 years, was deceased. He had signed up for a 6 year stint in the armed services; and, tragically he had taken his own life while on duty. So there is no surviving witness to this event, save myself, and one or two others who heard us talk about it, but didn't see it themselves. In fact, 2 of the other 3 or 4 people who were present are also deceased--those two of more natural causes. I know what I saw is not something explainable as some damned experimental aircraft of ours or anyone's on this planet. Not unless someone has the ability to take an object with volume and convert it into an object without mass or structure that would be torn apart by the forces of inertia that would have been generated in those severe and pointed changes in course. Any living things inside such a craft would splattered like bugs on a windshield. It was also no natural phenomenon. Do I make a big deal about it? No. Only after I know someone very well, and if HE or SHE brings up issues about UFO's will I venture to mention this one instance. Do I think this event had anything to do with R's death? I couldn't say for sure, but I doubt it. Talking with mutual friends and acquaintances, it appears R had issues I'd have never known about involving an absolutely horrendous childhood. Childhood friends of his told me about them after his death when I was so mortified to hear of his suicide. I suppose I should mention one other instance. It was about 1974, I was about half way between Joshua Tree and Twentynine Palms, in the same general area, exept I was north of HWY 62 this time, about .6 mile--I was at our family's weekend retreat--so I know exactly how far that is off the highway. It was mid-to-late spring. A friend (J--who I haven't seen virtually since that time, though I'm sure a few times after that day) and I were outside. The sky was clear and blue. It was, pehaps 3:30 in the afternoon. We were looking around with 7 power binoculars. I think I was using his, which were 7X35 wide-angles, and he was using mine, which were 7X50 regular view, though I couldn't swear to that. We were spootting aircraft, mostly, and tracking them across the sky, also birds, and also land-based objects at great distance. I was looking north-westerly when I spotted something in the glasses that I couldn't identify. I've never had any idea what it might have been. It appeared to be something in the sky that was just slightly brighter (slightly whiter) than the surrounding sky. It's shape was \"fuzzy.\" It had no distinct edges, though it's overall size and shape remained constant. It was eliptical, perhaps twice as long as wide. It was easy to track, moving downwards at about 30 degrees of angle, from west to east across the sky. I tracked it probably across 60-75 degrees of arc through the sky. I had been watching it for about 1.25-1.5 minutes, all the while trying to imagine what it might be, and trying to focus the glasses very slowly, for a better view, but fuzzy was the best it got. I had made overall adjustments of focus that suggested it was getting slowly closer. Then, it changed directions, making what I'd call about a 115 degree shift in flight path, to the right. I was still tracking one way, when it went the other, which meant it went quickly down, backtracking slightly on itself, and out of my view. That shift astonished me. I couldn't say if it changed speed. I lost it too fast to know. I tracked one way, and it zigged the other, instaneously, like on a dime. Considering the small angle of view, wide-field or not, it was lost too quickly to say anything about a change in speed. I couldn't think of anything that would be able to make such a turn, except maybe some sort of raptor, but this was no bird. I was not able to spot it again. (And, writing this now, one thought from \"science fiction\" occurs to me. What if it was something like the \"switch-blade\" jet in the \"I SPY\" movie with Eddie Murphy and Owen Wilson? Something with an almost perfect invisibility cloak? Something like a technological chameleon, or some of the sea creatures that change their appearance to mimic their surrounding areas? A clear, blue sky wouldn't be too tough to immulate. Just a thought) I thought maybe I'd been seeing a relection of the sun off one or both of the lenses--which was no viable explanation. The sun was west of us when I started tracking it, also to the west, but the sun was always somewhat behind my head, in the southern sky, and as I tracked this object over to the eastern part of the sky, that such a reflection could have stayed constantly there producing and anchanging apparition, if such a reflection had ever been there at all, became totally implausible. I don't recall what I was viewing or might have been seeking to view when I first noticed it. After a few moments, thought the desire was great, I knew trying to point it out to J would have been futile--it was in such a small patch of sky, and moving, and so hard to distinguish even with the best focus possible. I knew if I tried pointing to it, I'd have to take my eyes and glasses off it, and that would be that. It was NOT something anyone could have spotted with the naked eye. I had the impression it was within a mile or less, but that's more due to the quickness of it's movement across that much apparent sky, and to the focus used on the glasses than it is to having any sense of scale about the object. It was against nothing but sky, and nothing else ever came into those few degrees of view to provide any scale. Until the object changed directions abruptly, I was still trying to keep it steady in the field of view and feeling great curiosity about what it was. After the change of direction, it dawned on me, that \"technically\" anyway, I'd just seen a UFO. I thought about the sun, or other sources of reflection, but was unable to explain anything other than I had been watching something real that turned abruptly, and I then lost it. I told J about it, but I made little of it to anyone else. If what I at first saw as a \"satellite\" is a 7.5 on my \"richter\" scale of amazing things, this \"slightly whiter patch of sky\" thing is, maybe a 3.0 to me. I only mention it because it involved an instantaneous, sharp, angular change in course, of which I'm certain, and it occurred in the same general area, though more than 5 years previously. I've heard Joshua Tree, Giant Rock, and that whole Morongo Basin are supposed UFO hotspots. I've been going out there since the early 1950's. I've always been facinated by the night sky. Other than someone who's lived out there for many years, I probably have more time watching that sky than any casual visitors to the area you'll ever find. And I have those two incidents to tell about. The first incident made me wonder just what the heck I'd been seeing, and made me wonder if, perhaps, I'd seen something otherwordly. But, I didn't take it too seriously. The second incident left me with little doubt of it. Unless we have technology so secret that we've never used it (and it would be foolish and pointless to go to the massive expense of developing unused technology that advanced), the technology needed to produce that satellite incident was advanced WAY beyond anything we had then or have now. Nothing but wildly advanced and intelligently applied technology could have produced that satellite incident, at least, not so, in my opinion. The movements were far too precise and controlled to have occurred naturally or by any sort of chance. Perhaps R and I, a few hundreds of years ago, could have grunted to each other about \"the gods,\" maybe even built a shrine or something. Not today, or even 30 years ago. Well, that's it, for what it's worth. Just thought I should share it with people who have more time than I do to attempt investigating this stuff. Hope it helps. Good luck. You'll need, and I hope you have, it."],"Case Number":"11498","Date Submitted":"07/15/1979 12:00 UTC","Disposition":"IFO","City":"Joshua Tree","Log Number":"US-07092008-0006","Region":"California"}