{"Log Number":"AU-07092008-0001","Source":"MUFON","Case Number":"11491","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"-27.470933","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around July 4th 2008"],"Date Submitted":"07/04/2008 06:30 UTC","Tags":"City","Country":"Australia","divs":["Sighting DetailsDriving home at night with my son (17 years old), with some rain falling and a couple of flashes of lightning in the distance. On the Pacific Highway with cars a fair way away from me at the front. Then a large glowing red orb went in front of the car just above the height of tall trees. It was maybe the size of a car. It was about 50 metres away from the car. It went extremely quickly across the highway from right to left and disappeared behind the tree line to my left. I think they were large pine trees. I said to my son, \"Did you see that?\" He had just caught a glimpse of it as he had not been focussing on the road as I was. He also saw a red reflection in the window but assumed it was just a light. A very short time later we both experienced being totally immersed in white light. It was an individual experience and I had no notion of my son being with me. It was as if only my consciousness was in the light. Like you might imagine an out of body experience. There was nothing but intense white light that did not hurt your eyes but nothing else, no car, no steering wheel, no body even. It was a pleasant feeling. It seemed to only last a split second and I said as everything returned to normal, \"Did you see that?\" \"It felt like I was out of time and space, in another dimension.\" My son said he could not feel his body while in the light and felt that none of his senses (smell, touch etc) were present. He also said to me that while in the light there was no sense of time passing. He said it was as if it could have been one second or a thousand years. Yet straight after it we both felt it had only been a split second. We both said to each other that it was the weirdest experience we had ever had and were looking for an explanation. The radio had been playing in the car when this happened but we both could not hear anything while in the white light. When the white light left the radio was back on as if it had never stopped but my son said that it sounded odd as if the song had changed. We continued to drive and convinced ourselves that the car had been struck by lightning even though there had been no sound and the lightning was far away in the distance. We got within 15 minutes drive of our house, in the town of Murwillumbah (population 7000) and as we turned a corner with sugar cane growing on either side of the road, both noticed a very low bright star hovering over the township. It was very low as I thought it could have been a light plane as it was about the height of a crop duster. Since it wasn't moving and was very bright we pulled over to the side of the road to look at it and try and work out what it was. We then realised it was actually moving horizontally at an extremely slow speed so it looked like it was stationary. It was the brightest object in the sky. We tried to convince ourselves that it was some sort of odd plane but then it rose vertically and partially disappeared behind low cloud. It just sat there for at least 5 minutes. Suddenly it zoomed off at great speed over the top of the car and we lost sight of it. We then returned home expecting to go in and for it to be around 7 pm since we had left on an hour and a half journey at about 5.30. I was totally amazed and confused to see that the time was 7.45. We had stopped for 5 minutes to get petrol at the start of the trip and had stopped at the side of the road for about 5 minutes to look at the star object. We are both at a loss to explain how we lost all this time, as well as the two objects we saw and the white light."],"Viewing Distance":"21-100 Feet","Disposition":"Unresolved","City":"Brisbane","Object Shape":"Sphere, Star-like","Longitude":"153.031602","Summary":"Saw red orb UFO, star UFO, pure white light and lost about 30 minutes of time.","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11491.html.txt","/var/www/straped/mufon/org/11491.html"],"Region":"Queensland","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-27.470933,+153.031602(11491)&iwloc=A&hl=en\"> mufon case (11491) map </A>","Date of the Event":"07/04/2008 06:30 UTC"}