{"divs":["Sighting Details This incident happened several years ago but I'm just now getting a computer to tell my story to someone. Approx. 32 years ago. Let's start out by getting the georaphy of the area. The city of Metropolis has a plant on the west side of town and this plant takes u235 and converts it to u238 for nuclear weapons. This \"yellowcake\" is then taken to plant just across the river to a plant that refines it even more to make \"only God knows what\".But you get my drift it's a very sensitive area. Myself and two friends were heading west on Grand Chain Rd. one clear, sunny, Sunday afternoon. We had just went over the Cache River Bridge and was coming on a rise and curve in the road. Grand chain Rd. sorta follows the Ohio River betweem Joppa.Ill. and Grand Chain. You can't see the Ohio but just a few places along that road. As we were going up this grade ( I have been down this road hundreds of times so I knew this was a spot that you could overlook the Ohio). As I was looking across the fields to the river something caught my eye up in the air. It was on the Illinois side of the river (not good with judging heights) about 1000 ft. Well, what I saw was not a disk or light it was what appeared to be a plane. It didn't look simular to a plane, it was a plane! But I knew the instint I saw it somthing was not right. The window were not transparent. The windows looked like it had some kind of silver tinting on all the windows. And it was not moving. It was just setting there. I was in the back seat behind a male friend and a female friend was in the pasenger seat. I didn't say anything I just kept looking at it. All the sudden a huge Green fireball came out of this plane, streaked to the ground and exploded three times, without making a sound.The one fireball exploded three times. This is just the strangest part of the whole thing. After the explosions were over (never saying nothing)as I was turning my head back to the front of the car, my two friends heads were turning around at the same time. It's kinda like we were all placed in the car and woke up at the same time, or thats the feeling I got later. I'll never forget that. This all took place in a matter of 1 min. We kept going down the road and never said anthing to each other at all, to this day (7-8-08) we have never discused it. The female died of cancer about 5 years ago and we never said a word about it to each other. The male friend moved away, haven't saw him in years. It's funny, I can tell other people about it and I have told other people about it, but after a few rolled eyes, I thought it best to just keep it to myself. I mentioned those two nucler plant for a reason. The plant on the Ky. side of the Ohio was within sight of where we saw the plane. If you don't believe me I don't care. But I swear this on my only son's eyes. There are probably thing that I didn't write that I'll wish I would have put in here. I moved to Houston Texas and was away for several years and when I came back I was going down that road and the State of Illinois had bought that property and put a resturant on the exact same spot the Green fireball landed on. That's another reason I haven't said anything over the years. It may be some kind of Government thing. I wish I could craw you some pictures and e-mail them to you, but I'm not that good with computers yet. Hell, it took me twoo hours to type this."],"Region":"Illinois","Object Flight Path":"Stationary","Date of the Event":"07/01/1976 02:00 UTC","Summary":"Unidentified object near nuclear facility","Object Shape":"Fireball","Object Features":"Window(s), Wings","Date Submitted":"07/01/1976 02:00 UTC","Case Number":"11493","files":["/var/www/straped/mufon/html2text/11493.html.txt","/var/www/straped/mufon/org/11493.html"],"Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been no other sightings in New Grand Chain","This sighting has never been favorited."],"City":"New Grand Chain","Source":"MUFON","Latitude":"37.251667","Disposition":"Insufficient Data","Log Number":"US-07092008-0003","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.251667,+-89.023333(11493)&iwloc=A&hl=en\"> mufon case (11493) map </A>","Weather Factors":"Unknown","Longitude":"-89.023333","Country":"United States"}