{"Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"04/15/2005 12:00 UTC","Country":"United States","Disposition":"IFO","Case Number":"11495","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/11495.html.txt","/var/www/straped/mufon/org/11495.html"],"Region":"Alaska","trends":["There has been one other sighting in Haines","There were no other sightings in Haines on or around April 15th 2005","This sighting has never been favorited.",""],"Log Number":"US-07092008-0005","map":"<A HREF = \"http://maps.google.com/maps?q=59.235833,+-135.445(11495)&iwloc=A&hl=en\"> mufon case (11495) map </A>","City":"Haines","divs":["Sighting Details I was on a road trip in southeast Alaska, and was going on a tour of the chilcoot pass, with my older brother. We took pictures of each other, with our backs to the Water and mountains, at seperate times and locations (about an hour or so in between); from about mid-afternoon to the evening, when the sun was setting. I hadn't noticed the bright sphere-like object, and my brother didn't tell me that he had seen it (if he had). My brother was the one who took most of the pictures at the time, so I haden't realized That there was a UFO until I reveiwed the photos a couple of years after. The pictures showed the bright star like object in the top right portion of the photograph; the object was too bright to be a star and too dull to be the sun. I wondered if it was a planet, but then I noticed in the last set of pictures the bright sphere fliying around like it was a mosqueto. I thought it was verry strange, and it took me a while to guess what it was until I came to the conclusion it's most likely to be a UFO. I wish I had acces to the photos but they are my brother's, and I don't have acces to them, instead, I have attached some sketches done on microsoft paint."],"Object Shape":"Sphere","Longitude":"-135.445","Latitude":"59.235833","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"04/15/2005 12:00 UTC","Summary":"Bright sphere floating 1000 feet above the water."}