{"City":"Nampa","Sighting Duration":"Undisclosed","Date Submitted":"07/03/2008 05:12 UTC","Case Number":"11500","Object Shape":"Star-like","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-116.561202","Country":"United States","Log Number":"US-07092008-0008","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11500.html.txt","/var/www/straped/mufon/org/11500.html"],"Date of the Event":"07/03/2008 05:12 UTC","Latitude":"43.549427","Viewing Distance":"21-100 Feet","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was working Security on the morning of July 03, 2008. At 05:10 I noticed that bright star thats in the sky every morning (not sure if thats a planet or star). When I got out of the Security Van at 05:12 I noticed that there were now two bright stars in the sky. I thought at first it was a airplane, the site I work at is close to a airport and planes fly over all night and morning. But there were no flashing lights on this object- no running lights, collision lights or strobe lights at all. I stood there and watched the object- It had a steady bright light and was moving very slow across the sky with no noise coming from it at all. It wasnt a plane, so a satellite came to mind. But it wasnt high enough to be a satellite. I stood and watched the object for about 15 minutes until it went out of range and I couldnt see it anymore. The strange thing was that at 05:12 in the morning there is usually traffic planes in the air, but this morning there wasnt any planes until the object was gone. Now Im not sure what the object was. A real alien UFO or something else. But to me, sense I couldnt identify it, it really in all sense of the word was a UFO."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.549427,+-116.561202(11500)&iwloc=A&hl=en\"> mufon case (11500) map </A>","trends":["There have been 15 other sightings in Nampa","There were no other sightings in Nampa on or around July 3rd 2008"],"Region":"Idaho","Summary":"Bright Silent Star Like Object.","Tags":"City"}