{"Date of the Event":"07/11/2008 12:40 UTC","Source":"MUFON","Log Number":"US-07112008-0003","Object Shape":"Triangle","Weather Factors":"None","Summary":"Large Triangle craft, white lights on all 3 corners, 1 red light and 1 white light on each side if the craft. No Noise.","Date Submitted":"07/11/2008 12:40 UTC","Longitude":"-85.855101","divs":["Sighting DetailsI was in my kitchen cooking with 3 friends at 12:30 am on the 11th of July,2008, when I had an urge to step out on my porch. as soon as I stepped out and looked up I saw what I thought was a low flying airplane. as the craft came closer I noticed that it made no sounds at all. none. I realized also that the craft was flying way too low for faa regs. Then I noticed that the craft was shaped in a triangle or arrowhead. It was flying very fast and very smooth motion, straight line. i ran inside and alerted the other 3 who ran outside just in time to see that it was a triangle craft, that it made no sound, that it was flying very fast and very low, and that it was flying away from our home towards Ft. Knox Military base. I tried to get out my cell phone camera for pictures but I was way too slow. Large Triangle craft, white lights on all 3 corners, 1 red light and 1 white light on each side if the craft. No Noise. All 4 witnesses described the incident in the same manner, exactly."],"trends":["There have been 4 other sightings in Elizabethtown","There were no other sightings in Elizabethtown on or around July 11th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.711185,+-85.855101(11519)&iwloc=A&hl=en\"> mufon case (11519) map </A>","files":["/var/www/straped/mufon/html2text/11519.html.txt","/var/www/straped/mufon/org/11519.html"],"Disposition":"Unknown","City":"Elizabethtown","Object Features":"None, Other","Country":"United States","Case Number":"11519","Tags":"City","Region":"Kentucky","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path,Other","Viewing Distance":"101-500 Feet","Latitude":"37.711185"}