{"City":"Lee Vining","Country":"United States","Date Submitted":"09/09/2004 04:34 UTC","Sighting Duration":"Undisclosed","Weather Factors":"None","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Log Number":"US-07102008-0012","Object Features":"None","Latitude":"37.959062","Region":"California","Object Shape":"Egg, Oval, Other","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.959062,+-119.113423(11512)&iwloc=A&hl=en\"> mufon case (11512) map </A>","files":["/var/www/straped/mufon/html2text/11512.html.txt","/var/www/straped/mufon/more/11512_submitter_file1__100_0725.JPG","/var/www/straped/mufon/more/11512_submitter_file2__100_0727.JPG","/var/www/straped/mufon/more/11512_submitter_file3__100_0730.JPG","/var/www/straped/mufon/org/11512.html"],"Date of the Event":"09/09/2004 04:34 UTC","Disposition":"IFO","trends":["There have been 4 other sightings in Lee Vining","There were no other sightings in Lee Vining on or around September 9th 2004","This sighting has never been favorited.",""],"Longitude":"-119.113423","divs":["Sighting DetailsWe were in Yosemite National Park, Tuoleme Meadows area on top of Lembert Dome. the family was taking in the scenery and I was taking pictures of them. Once I uploaded the pictures to my desktop computer, we noticed the object (?) in the sky. The day was crystal clear, blue sky, with no clouds and we were at about 9800 feet above sea level. When I first saw the pictures and the spot, I thought it was a spot on the lense or light refraction off the top of Lembert Dome. It couldn't be a spot on the lense since I took a few pictures in between the three that had the object and there was nothing on those. I still think it could be light refraction off my camera lens but there is purple shadowing on the forest trees below us (in pictures #2 and #3) and there seems to be some density to the image. It also looks like it is beaming down on the people in the photos. No one saw or heard anything and my family thinks I'm silly to think it is anything but light refraction. I just thought I'd ask (after all these years) and see what you guys think. I am sending you the original photos, untouched. If you need any other information please feel free to contact me. Thanks for taking the time to review the photos for I know you are very busy. Best regards, p.s. I hope I am sending these to the correct place. I figured the local MUFON chapter would be a good place to start."],"Summary":"We did not see the object but it showed up in photos taken at the time.","Source":"MUFON","Case Number":"11512"}