{"Source":"MUFON","Log Number":"US-07102008-0015","divs":["Sighting DetailsFive UFOs sighted, one cigar shaped and four flattened Christmas ornament shaped, thicker than movie saucer shape anyway. We live near Moody and are both military brats, now middle age. Have seen a lot of planes and these were not planes. Noticed the cigar shaped one first and did not see others until I got out binoculars to look in that area, as they had some cloud cover. With binoculars i could see the metal and steam-like haze around them. Excellent \"camo\"; we were impressed. One was huge. Could not believe it was real but metal could be seen with haze cover with binoculars. Without blended well with clouds. Had to have known to look. If I had not been very used to seeing planes, I would never have noticed the cigar shaped object. I attempted pictures also but they did not turn out well. I do not expect anyone to believe us, as beach folk were walking and did not appear to notice that we could see. Most eyes were on several groups of porpoises swimming northward close to the beach, one group after another that went on for about an hour before, during, and after the sighting."],"Longitude":"-81.014583","map":"<A HREF = \"http://maps.google.com/maps?q=29.219815,+-81.014583(11515)&iwloc=A&hl=en\"> mufon case (11515) map </A>","Summary":"Five UFOs One Cigar, Four Disk","Viewing Distance":"Over One Mile","trends":["There have been 13 other sightings in Daytona Beach","There was one other sighting in Daytona Beach on or around June 24th 2008","This sighting has never been favorited.",""],"Region":"Florida","files":["/var/www/straped/mufon/html2text/11515.html.txt","/var/www/straped/mufon/more/11515_submitter_file1__HebertUFO.jpg","/var/www/straped/mufon/org/11515.html"],"Object Shape":"Cigar, Disc","Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"06/24/2008 06:20 UTC","Weather Factors":"None","City":"Daytona Beach","Country":"United States","Date of the Event":"06/24/2008 06:20 UTC","Tags":"City","Latitude":"29.219815","Case Number":"11515","Object Flight Path":"Hovering then path","Disposition":"Unknown"}