{"City":"Jeffersonville","trends":["There have been 2 other sightings in Jeffersonville","There were no other sightings in Jeffersonville on or around June 7th 1997"],"divs":["Sighting Details I was working third shift at a machine shop in the Jeffersonville Industrial Park. I was outside having a cigarette watching the UPS planes waiting in line to land at Louisville International Airport. I noticed a very bright red light to the northwest, the intensity was comparable to aircraft landing lights. The object was estimated as dime size at arm's length. This object exhibited a strange non-ballistic motion which was apparently tied in with the intensity of the light, in that the light would pulse from bright to dim and as it did so the object would move and stop. It would brighten and move forward, then it would dim and stop, then brighten and move backwards, then dim and stop. I watched this for what seemed like a few minutes when I noticed all the UPS jets had been waved off and were moving away. So I ran back inside the shop and got the nearest person's attention, if only to verify that this was as strange as I believed it to be. Upon arrival back outside I found the object had moved very little and was still to the northwest approximately 2-3 miles distant. All the jets had left the area at this time and I noticed there was no noise associated with this object. The first words out of the secondary witness were \"holy s**t\". We watched this thing move across the sky in a very erratic fashion and it seemed to drift in our direction. It finally reached a point almost directly over the building and showed no structure other than the red light itself. This thing was emitting no noise whatsoever! After watching this for at least 5 minutes we heard the sound of jet engines approaching from the east. Suddenly a military fighter jet came into view heading directly at the red light. Three seconds before they merged the red light dropped an unlit secondary sphere which was only visible by the reflection from the main object's light. The red light blinked off and was gone just as the jet passed it's location. The secondary object could not be sighted. The jet did a wing dip as if he was trying to re-aquire the target, he then made a right turn and departed the area heading east. After a few minutes more the UPS planes were back in line and the whole encounter was over. There should be radar tapes of this encounter somewhere, and at least a few of the UPS pilots had to have seen this as well as the fighter pilot."],"Longitude":"-85.737185","Source":"MUFON","Date Submitted":"06/07/1997 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.27757,+-85.737185(11517)&iwloc=A&hl=en\"> mufon case (11517) map </A>","Region":"Indiana","Country":"United States","Disposition":"IFO","Tags":"City","Latitude":"38.27757","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/11517.html.txt","/var/www/straped/mufon/org/11517.html"],"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Summary":"Deep ruby red colored orb with detachable secondary sphere.","Log Number":"US-07112008-0001","Case Number":"11517","Weather Factors":"None","Date of the Event":"06/07/1997 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile"}