{"map":"<A HREF = \"http://maps.google.com/maps?q=53.41463,+-2.981356(11513)&iwloc=A&hl=en\"> mufon case (11513) map </A>","Weather Factors":"Unknown","Longitude":"-2.981356","Case Number":"11513","Tags":"City","Date Submitted":"06/16/2008 02:33 UTC","Log Number":"GB-07102008-0013","Source":"MUFON","Disposition":"Unresolved","City":"Liverpool","Viewing Distance":"Over One Mile","Country":"United Kingdom","divs":["Sighting DetailsThe first time I saw it i was letting the dog out in the front garden, I looked west in the sky and saw a white orb moving slowly easterly in the sky. It was just there in the sky, at first I thought it was a plane until I saw it rappidly change direction moving north west but staying at the same speed. At this point I knew it couldnt be a plane or helicopter so I called my friend who was with me downstairs at the time to see. Then we both whitnessed the object suddenly changed colour to red then change to green and shot directly up northwards at incredible speed and faded out, the object made no sound nor did it leave any trail. This was the first time we saw the object. The second time we saw it was about 15 minutes later and it was about another 2-3 miles north away from original sighting. This time it was white again and just hovering still. It lookded smaller. My friend commented that it was a star until it suddenly turned green and shot of at speed from standtill in a straight line to the east, I ran through house to back garden to see it dissapear out of veiw behind houses. Again, the object made no sound nor did it leave any trail aND both times it just suddenly turned from white red green, white green before zooming off - we were both quite shocked by this as it did not appear to be our technology. I did manage to take a picture of it the second time but it just looks like a star in the sky, this was before it moved off, green at incredible speed. I also managed to get a short video clip of it the second time but you can not see it on the video as it too dark. I estimate it easily covered 20 miles of sky from standstill in about 7 seconds before going out view. I will attach the picture of the object (the 2nd time we saw it and this is an actual picture of the object 'PIC 1') and a photo of the location we 1st saw it in (I took this picture a bit later and I have added the orbs to give a better description of what we saw. 'PIC 2')"],"Date of the Event":"06/16/2008 02:33 UTC","Region":"England","Object Shape":"Sphere","Summary":"object was initally white, then red for a brief moment, then the 2 times it zoomed off it was green","files":["/var/www/straped/mufon/html2text/11513.html.txt","/var/www/straped/mufon/more/11513_submitter_file1__PIC1.JPG","/var/www/straped/mufon/more/11513_submitter_file2__PIC2.jpg","/var/www/straped/mufon/org/11513.html"],"Latitude":"53.41463","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around June 16th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"Unknown"}