{"Log Number":"US-07122008-0008","files":["/var/www/straped/mufon/html2text/11529.html.txt","/var/www/straped/mufon/org/11529.html"],"Disposition":"Unknown","Tags":"City","Date of the Event":"04/18/2008 09:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.481974,+-82.635139(11529)&iwloc=A&hl=en\"> mufon case (11529) map </A>","Source":"MUFON","Latitude":"38.481974","Longitude":"-82.635139","Object Features":"None","trends":["There have been 17 other sightings in Ashland","There were no other sightings in Ashland on or around April 18th 2008"],"Weather Factors":"Unknown","divs":["Sighting DetailsAround 9:00 p.m., EST, I was stargazing from my deck and noticed a couple of very brilliantly twinkling \"stars\" and as I watched, they began to move first slightly and then almost playfully, back and forth and in circles. I called to my neighbor who was on her deck and she walked over and also sighted the objects speculating it might be a satellite. I told her I didn't think so, not two separate objects literally dancing around in the atmosphere. She left and I continued to watch and within minutes there was suddenly at least six objects moving about in no particular pattern, like children playing circle tag! I knew it couldn't be aircraft flying in such a frivolous manner, it was far too high for helicopters which also could not make such maneuvers so there was therefore only one explanation--et's. I had no particular \"feelings\" while watching--I wouldn't expect anything that playful would be likely to be dangerous. I wondered while I watched if they were seeing me far more clearly and just putting on a litle show for me! I didn't lose sight but simply went inside and left them to their play time. This is not the first \"sighting\" in my area by far. My son says he saw four objects high in the sky at a nearby lake a week ago. A group of us in my old neighborhood watched one for a long time, again high in the sky, back in the 70's and I have heard of many other unexplained ufo's in this area. I read an aricle a few years ago by Gary Stearman, Prophecy In The News co-host that I found to be very interesting from a Christian point of view. You might want to reference it at www.prophecyinthenews, I think it's .org. I imagine you also know the story of Ezekiel in the Bible who was taken up into the heavens in a fiery chariot described as a wheel within a wheel."],"City":"Ashland","Sighting Duration":"Undisclosed","Summary":"star-like, twinkling brilliantly, moving about erratically in seemingly a small area.","Region":"Kentucky","Object Flight Path":"Other","Country":"United States","Date Submitted":"04/18/2008 09:00 UTC","Case Number":"11529","Object Shape":"Star-like"}