{"Object Shape":"Fireball, Star-like","Log Number":"US-07122008-0005","Tags":"City","Viewing Distance":"Unknown","divs":["sighting detailsi'm typing this as i search for what an iridium flare can unexpectedly look like...here's what i saw: according to heavensabove.com, at 10:36:16, on 7\\11, there was a predicted iridium flare located at 11 degrees altitude, on the azimuth at 250 degrees wsw, at a -2 intensity\\magnitude, due to occur about 86 km e of mesa, az. ok, just made sure that zero misidentified i.flares are even similar to what i just saw. interesting...anyways-i was on the computer on my patio when i had a strange feeling i'd forgotten something, and i looked at the clock and realized it was 10:37, and remembered the flare prediction for 10:36. so i jumped up and found my bearings direction-wise, and looked right around where i'd assume the wsw to be. the altitude was rather low-only listed at 11 degrees, so i tried to look almost straight ahead (i'm on the 2nd floor of my building), with the moon nearly directly overhead of where i tried to focus. there are street lamps in the distance, barely higher than the roofs of the buildings i was overlooking, and-almost as soon as i had began to focus on this spot (that i believed to be 250 deg wsw, low 11 deg alt) i noticed orangish looking \"things\" kinda circling the orange street light. it really looked like the way large bugs do that you see circling clumsily around a large, parking lot-type light at nightime. i had my binoculars and quickly looked at the street light and noticed not only 1, but 3 or 4 orange lit objects sharply circling this light (or so it appeared) at an amazing speed. i mean like hows you see atoms(protons?) circling a nucleus in an animated example--kind of an eliptical pattern(right word? an oval orbit moreso than a circular one), super sharp\\quick at the turns yet more prolonged motion from end to end(of the turn)--it was incredible. quickly gathering that this was no flare i yelled for my roommate to come out. i put the binoculars down for a sec and glanced to see if he was coming, then looked up and saw them with my naked eye for a second, and put the binoculars back to my face. these things were going around in all different directions, as in orbiting\\circling from, say, top left of the light to bottom right and back-top right to bottom left-etc, yet they were all going the same unbelievable speed and the same motions. i yelled back much louder for my roommate to come, and looked over again to see if he was comin, and when i looked back-they were gone. unbelievable."],"Object Features":"Undisclosed","Date Submitted":"07/11/2008 10:37 UTC","Region":"Arizona","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around July 11th 2008"],"Weather Factors":"Unknown","Longitude":"-111.826662","map":"<A HREF = \"http://maps.google.com/maps?q=33.420214,+-111.826662(11526)&iwloc=A&hl=en\"> mufon case (11526) map </A>","Source":"MUFON","Latitude":"33.420214","Date of the Event":"07/11/2008 10:37 UTC","files":["/var/www/straped/mufon/html2text/11526.html.txt","/var/www/straped/mufon/org/11526.html"],"Case Number":"11526","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Unknown","City":"Mesa","Country":"United States","Summary":"Waiting for Iridium Flare as predicted by HAbove.com..."}