{"Source":"MUFON","Region":"Texas","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Tags":"City","divs":["Sighting DetailsI was outside my house smoking a cigarette, and I decided to move a lawn chair out into the yard so I could look at the sky. It was the perfect summer night. All I could hear were crickets, and the skies were clear. I was looking about 40 degrees up to the east, and that's when I saw it appear. It was such a shock to me that I can't tell if it rapidly decelerated to a speed at which it was visible (Who knows?) or if it just \"turned on its lights\". I literally jumped in my seat! We've all seen meteors, they reach a point at which the friction and pressure of the atmosphere builds up heat which produces incandescent light that we see for usually no more than a fraction of a second. If this was a meteor, then I'm Santa Claus. It was already moving when it appeared (like a meteor), but its brightness didn't fade (the lights did pulsate, however), there was no rapid descent, and I was able to follow it to the horizon. Fireballs have been visible over several states before they either impact the ground (or someone's unfortunate car), but this object wasn't as bright as Jupiter, it left no trail, and nothing was seen breaking off of it. I could be one of the lucky few who have witnessed an earth-grazing fireball, but I doubt it. Here's why: the object had red and white lights, but not lights as you'd expect to see on an aircraft. They weren't points of light; rather there was a center that was brighter than the periphery around it. That's the best I can explain it. The center part wasn't even that bright, but the smooth glow of the light around it really set it apart from anything I'd ever seen. This object definitely had some size to it. Let's assume this was something entering the atmosphere. From my point of view, the apparent size of the object was no smaller than a commercial airliner at cruising altitude, possibly larger. I'm no expert on which altitudes objects start to glow at as they enter the atmosphere, but it has to be more than 40,000 feet, making this thing at least as big as an aircraft. There are lots of variables involved, but that seems logical to me. This thing had to have been seen on radar. It was going northward, possibly NNW. There was no sound whatsoever. If this was an aircraft, it would have to AT LEAST be going mach 1 at roughly 10,000 feet. That's as slow and as low as this thing could have been going. The higher up this thing actually was, the faster it was actually going. I should have been able to hear something if this was an aircraft. B-2's and F-117's are pretty quiet, but they're also subsonic. I don't know of any pilot who'd put his butt on his line just to fly at supersonic speeds over the continental US. That's a pretty big no-no. Please call or email me if you have any questions, or if I'm flat-out wrong about something. Thanks for looking into it for me."],"Disposition":"Unknown","Latitude":"32.153216","Date of the Event":"07/12/2008 01:45 UTC","Longitude":"-94.79938","map":"<A HREF = \"http://maps.google.com/maps?q=32.153216,+-94.79938(11528)&iwloc=A&hl=en\"> mufon case (11528) map </A>","Weather Factors":"Unknown","Log Number":"US-07122008-0007","Viewing Distance":"Unknown","Country":"United States","Case Number":"11528","Date Submitted":"07/12/2008 01:45 UTC","Sighting Duration":"Undisclosed","Summary":"UFO with glowing red and white lights appears at one point in sky and streaks to horizon","City":"Henderson","Object Features":"Unknown","trends":["There has been one other sighting in Henderson","There were no other sightings in Henderson on or around July 12th 2008"],"files":["/var/www/straped/mufon/html2text/11528.html.txt","/var/www/straped/mufon/org/11528.html"]}