{"Case Number":"11534","Summary":"was going west & turned & came toward MGregor on 317 made no sound size of a football field had windows like an airlpane then turned after coming over me & went west towards","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-97.404829","City":"McGregor","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Log Number":"US-07122008-0013","map":"<A HREF = \"http://maps.google.com/maps?q=31.447106,+-97.404829(11534)&iwloc=A&hl=en\"> mufon case (11534) map </A>","trends":["There have been 4 other sightings in McGregor","There was one other sighting in McGregor on or around June 26th 1994"],"Object Shape":"Triangle","Date Submitted":"06/26/1994 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsI had just taken the trash out at 10:00 p.m. on June 26,1994.I turned around to go in when I saw to airplanes back to back which was odd. The 1st airplane going west turned & went south, The second object turned & came up in my direction.It glided very slowly & no noise the size of a football field. Had windows across like an airplane. I could light on th inside very bright lights It moved over the highway and was triangle in shape & had 3 huge lights underneath about 500 feet it was very low . Then it turned & headed west again. It took aout 30 minutes because it was 10:30 when I came in. I just stood their frozen not scared just in awe of the size. Then In August 1994 2 monyhs later I had my blinds off my windows Was watching TV & felt the need to rise up & look out my window, Their were 2 green glowing lights hovering for 15 minutes. This time I was scared because my dogs were sleeping & if someone had been outside they would have barked. I didn't go outside but I cut my TV off & watched a small green ball of light hover in a shed next to our patio. My husband was asleep & still doesn't believe.I didn't have any film in my camera but it didn't matter I couldn't leave for fear of missing something. Maybe it was government but I can't explain the hovering lights in front of my window at 12:00 P.M"],"Date of the Event":"06/26/1994 12:00 UTC","Latitude":"31.447106","Region":"Texas","files":["/var/www/straped/mufon/html2text/11534.html.txt","/var/www/straped/mufon/org/11534.html"]}