{"Source":"MUFON","divs":["Sighting Details 1. Where were you and what were you doing at the time? \"In the back yard celebrating the 4th of July with the kids and their friends.\" 2. What made you first notice the object? \"One of the kids yelled at us to look at the Orb\" 3. What did you think the object was when you first noticed it? \"An Orb\" 4. Describe the object and its actions and motions. \"An orage sphere flew low and seemed as though they were right over the tree tops. It looked like it was about 4 ot 5 feet in diameter but we are not really sure how low it actually was. I flew over us heading Northwest at about 25 maybe 35 miles an hour, but once it passed over our house it turned and went either North or Northeast. It looked like there was a ring around the glowing mass kind of like it had a clear outer shell to it. There were around 10 people with us that night (including my 12 year old) and all of them saw it and verified to me that this was absolutely no type of fireworks and it made no sound at all.\" 5. Describe your feelings, reactions and actions, during and after sighting the object. \"Amazed\" 6. How did you lose sight of the object? \"Lost sight as it kept going\""],"Summary":"Orange Sphere","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around July 4th 2008"],"Disposition":"Unknown","Latitude":"40.809472","Viewing Distance":"21-100 Feet","Date Submitted":"07/04/2008 12:00 UTC","Weather Factors":"Does Not Apply","Object Flight Path":"Straight-line path,Path then hovering","Region":"Nebraska","Longitude":"-96.675779","Case Number":"11532","Object Shape":"Sphere","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11532.html.txt","/var/www/straped/mufon/org/11532.html"],"Sighting Duration":"00:15:00","Country":"United States","City":"Lincoln","Log Number":"US-07122008-0011","Tags":"City","Date of the Event":"07/04/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.809472,+-96.675779(11532)&iwloc=A&hl=en\"> mufon case (11532) map </A>"}