{"Longitude":"-117.155065","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Sighting Duration":"00:00:05","Object Flight Path":"Straight-line path","Date of the Event":"10/27/2007 07:48 UTC","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 27th 2007"],"Date Submitted":"10/27/2007 07:48 UTC","Source":"MUFON","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/11533.html.txt","/var/www/straped/mufon/org/11533.html"],"Tags":"City","City":"San Diego","map":"<A HREF = \"http://maps.google.com/maps?q=32.717729,+-117.155065(11533)&iwloc=A&hl=en\"> mufon case (11533) map </A>","Disposition":"Unknown","Latitude":"32.717729","Case Number":"11533","Country":"United States","Summary":"V-Formation of 4 large lights (without center of V) flying over Miramar Naval Base and Montgomery Airfield below top cloud cover with no noice","Object Features":"Unknown","divs":["sighting detailson october 27, 2007 i was outside on the back patio smoking a cigar at victors coctail lounge. i was sober. i was near the corner of convoy and armour streets in san diego, california. i observed 4 large white lights fly almost directly over me. i immediately went home and filed a report, within 2 hours, to the national ufo reporting agency. it has been posted and i have copied and pasted the report below. after a few months, i think january 2008, i joined mufon. i thought i should also post this sighting with mufon. also, i watched larry king live last night and they talked about the stephenville, texas sighting with multiple radar contacts. my sighting last october should also have multiple radar hits since the craft, or crafts, passed over miramar and montgomery air fields. in reading my old report below, i see where i could make it more clear. the v-shaped lights were above the lowest level of clouds (rain clouds); but below the highest level of clouds (wispy clouds). this is not very high. the lights were 4 times larger than the largest star. if these were military craft lights, there would have been a loud roar, there was no noice. also, when i saw this formation of lights, i immediately knew it was unique and i did not think these were military or civilian crafts. ---------------------- occurred : 10\\27\\2007 19:48 (entered as : 10\\27\\07 19:48) reported: 10\\27\\2007 9:53:35 pm 21:53 posted: 11\\28\\2007 location: san diego, ca shape: light duration:5 seconds 4 white lights in a v-shape flying above the clouds across the sky in about 5 seconds. this evening, saturday, october 27, 2007 at 7:48 pacific time, i saw 4 lights, shaped in a tight v-shape (2 on each side), fly across the sky from north to south almost directly over me; but passing slightly east of my location. i was in a dark area near the corner of convoy and armour streets in san diego, california. this area is directly under the flight path of montgomery field and a few miles south of miramar marine air station. i have lived around the miramar marine air station for 20 years in several locations. i have seen just about every possible plane and plane formation flying over me in this area and i have never seen anything like this. each light was about the 3 or 4 times the size of a normal star (so they were very obvious). a plane close enough to have a light that large would be very loud; but there was no sound. the distance between each light was about the same as each light (making it seem like all 4 lights were linked) but i could not see anything in-between the lights. this was a tight formation. this v-shape of lights traveled from north to south across two-thirds of the sky in about 5 seconds (5 seconds is not a quick glance---i watched it clearly). tonight, at 7:48 pm, there was about 10 to 20 percent of wispy cloud cover and these lights were above the clouds; but i do not know how high above the clouds. i could see the lights through the clouds as they passed over the clouds. the quality of the lights needs mentioning. the lights were solid and bright; but not a bright light like a star or blinking plane light. these lights were different, maybe softer. these lights did not blink. i guess the best description of these lights would be a slightly dim, off-white. i say they were a v-shape; but the open end would be wider than a typical v."],"Region":"California","Log Number":"US-07122008-0012"}