{"Case Number":"11536","map":"<A HREF = \"http://maps.google.com/maps?q=33.206696,+-96.638212(11536)&iwloc=A&hl=en\"> mufon case (11536) map </A>","Tags":"City","Object Shape":"Star-like","Source":"MUFON","Log Number":"US-07122008-0015","Date Submitted":"01/05/2008 03:30 UTC","Date of the Event":"01/05/2008 03:30 UTC","City":"McKinney","Longitude":"-96.638212","files":["/var/www/straped/mufon/html2text/11536.html.txt","/var/www/straped/mufon/org/11536.html"],"trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around January 5th 2008"],"Region":"Texas","Summary":"Object Hoovering, not a star, not a plane with lights coming & going all around","Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Latitude":"33.206696","Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Weather Factors":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI awoke late night, early morning. I had been hearing strange sounds outside like construction work being done and couldn't understand why it is so loud outside this late at night. I also heard dripping water sounds near my bedroom window and couldn't determine where this was coming from. I slept for awhile but awoke and started looking out my windows 3-4AM. I didn't see anything except a strange large light hoovering out of my east windows at a distance, over Farmersville maybe. Smaller lights were coming and going and I got tired of watching, nothing was happening. I wanted to take a picture but couldn't locate my camera and it is a hassle getting the batteries in it(Digital) esp that time of night. I really wished I had taken a picture as I have seen a LOT of sightings over the years and want proof for non-believers. Next night same thing and I got bored watching the lights and wished them away. Not sure about the next night if they were there but still hearing the sounds, getting really annoyed with this as it was disturbing my sleep. The next day I am hearing stories about the lights over Stephenville and wondered if the two were somehow connected? Also, Pentecost sunday last year a hooded figure was spotted in my window at 5:30 AM and hoovered away when it discovered that I was watching it as I lay in bed totally awake. (Something woke me and I rolled over and as I lay there trying to focus and determine why I am totally awake at 5:30AM I see this) Also, it did not turn as you would see shoulders turn and depart but hoovered off to the west like a ghost or something else. This may be discounted as they discovered a hooded man had broke in on a woman in the Weatherford area and fought her as she lay in bed and took off when she fought him off. At the time I freaked out and wanted to call the police but my family said no, they didn't hear or see anything."]}