{"Tags":"City","Source":"MUFON","Date Submitted":"12/31/0002 12:00 UTC","Viewing Distance":"Unknown","Region":"Colorado","Latitude":"40.174987","map":"<A HREF = \"http://maps.google.com/maps?q=40.174987,+-105.092818(11547)&iwloc=A&hl=en\"> mufon case (11547) map </A>","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around December 29th 0002"],"Log Number":"US-07132008-0008","Object Shape":"Disc","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"11547","divs":["Sighting DetailsI worked for the FAA from 1966-1981. When I first started with the agency I worked with a retired B-47 pilot by the name of Harvey Williams. We were working a midwatch shift and we had preplotted military missions on plexi-glass overlays on top of a map of Denver center all night. We got done about 5:30 AM and we were sitting around shooting the breeze. I was a lot younger than Harv and out of the blue I asked Harv if he had ever seen anything when he was flying. He paused for a moment and replied that he had. I told him \"bullshit Harv you never have\". He answered dead serious that he had and he would bring evidence of what he seen on the next midwatch. He brought color slides of disc shaped objects port holes and all in color, no mistake what those objects were, very clear and detailed. I lost track of Harv about 1967 or 1968. Since he was to old to become an air traffic controller I believe he went to a flight service station. I regret not getting copies of his slides, they are priceless. Maybe your network can locate him, he would be about 85 years of age if he is still alive."],"City":"Longmont","Longitude":"-105.092818","files":["/var/www/straped/mufon/html2text/11547.html.txt","/var/www/straped/mufon/org/11547.html"],"Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"12/31/0002 12:00 UTC","Disposition":"Insufficient Data","Summary":"Slide of Disc"}