{"Country":"United States","Disposition":"Unknown","Longitude":"-99.894443","Log Number":"US-07132008-0009","Case Number":"11548","Object Features":"Undisclosed","divs":["Sighting DetailsI really don't know what to make of this. Huge translucent tentacles? Spirals, pefect squares, circles, equalateral triangles and crosses. The lower layer moves around slowly, back and forth and all around, beneath the upper layer. I would say the lady in Phoenix was desribing identical phenomenon. I believe \"hovering around in midair\" is a good description. Add to that description: pulsing, undulating, breathing. They are wonderful artists. Enjoy! (remember: don't freak out over it in public like I used to. Most people are totaly blind to this for some reason. They'll only think your a nutter) Today was the first day I've noticed it over Austin since the 4th. If you focus your eyes just right, you can get a feel for the breadth of these things. They cover the entire sky. Here are some examples of things I saw today. Ive been scouring the internet looking for images of what I saw today. Check out the cross! I saw one just like it today. Imagine those tentacles squirming around all day long. And no, I'm not on drugs, RX or otherwise."],"City":"Undisclosed","Object Shape":"Boomerang, Circle, Cross, Disc, Sphere, Square, Rectagular, Triangle, Other, Unknown","Region":"Texas","Summary":"Weird clouds over Austin. Some sort of lifeform or craft","map":"<A HREF = \"http://maps.google.com/maps?q=31.977519,+-99.894443(11548)&iwloc=A&hl=en\"> mufon case (11548) map </A>","trends":[""],"Date of the Event":"07/13/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/11548.html.txt","/var/www/straped/mufon/more/11548_submitter_file1__806259403_61fa622bdc.jpg","/var/www/straped/mufon/more/11548_submitter_file2__1794918129_55427af1c1.jpg","/var/www/straped/mufon/more/11548_submitter_file3__madrid1205079nx.jpg","/var/www/straped/mufon/org/11548.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"07/13/2008 12:00 UTC","Tags":"City","Latitude":"31.977519"}