{"Sighting Duration":"Undisclosed","Log Number":"US-07132008-0005","map":"<A HREF = \"http://maps.google.com/maps?q=41.347785,+-86.307358(11544)&iwloc=A&hl=en\"> mufon case (11544) map </A>","files":["/var/www/straped/mufon/html2text/11544.html.txt","/var/www/straped/mufon/org/11544.html"],"Date of the Event":"11/30/1955 12:00 UTC","Summary":"No sound, hovering, rows of framed lights or lighted windows","Object Flight Path":"Undisclosed","Latitude":"41.347785","City":"Plymouth","divs":["Sighting DetailsEscorting sister-in-law and brother down front porch steps brother looked up and said \"what the hell is that thing\". Hovering about 20 ft. away over a large tree was a Large object with multiple framed lights or framed windows with bright yellowish lights shining thru' them. It reminded me of seeing a train's windows at night but of course the object's windows were much larger and in rows. The middle row of windows longer as object was wider in the middle. As I recall cigar shape comes to mind altho' somewhere it's possible the back was flat. It hovered over the tree, my brother went back in the house to get my husband, and by that time it had moved slowly above another tree about 40 ft. away. It stayed there momentarily, long enough for my husband to get a glimpse of it, and then accelerated very fast, became one orange-red colored light, and disappeared into the stars a long, long way off in a swooping motion. This happened sometime around 1956. I am sorry I did not do a sketch of the thing and when I asked my brother for one he sent some ungodly drawing. Actually, he has refused to talk about it as I soon learned that was best when I mentioned to someone what I saw and was asked if I saw the object outside of the Moose Lodge. I called the Police Dept. to ask if anyone had reported seeing anything and the response was negative. I still vaguely see the thing and am still in amazement and hope to find out(altho' may be reunning out of time as will be 76 next week) what the object was or if anyone has seen an object like I saw. All Pictures or descriptions I have seen of UFO's do not remind me of what I saw. I still wish to remain anonymous but wonder what in the world was that ovject with no sound and so much speed. Please let me know if you have heard of anything as I have described. Thank you very much."],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Region":"Indiana","Date Submitted":"11/30/1955 12:00 UTC","Disposition":"Unknown","Object Shape":"Cigar, Oval, Other","Tags":"City","Longitude":"-86.307358","trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around November 30th 1955"],"Weather Factors":"Unknown","Case Number":"11544","Country":"United States"}