{"Viewing Distance":"20 Feet or Less","Object Features":"Undisclosed","Country":"United States","Case Number":"11549","map":"<A HREF = \"http://maps.google.com/maps?q=41.766634,+-72.738515(11549)&iwloc=A&hl=en\"> mufon case (11549) map </A>","Sighting Duration":"Undisclosed","Longitude":"-72.738515","Date of the Event":"08/31/1979 12:00 UTC","Latitude":"41.766634","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/11549.html.txt","/var/www/straped/mufon/org/11549.html"],"Date Submitted":"08/31/1979 12:00 UTC","City":"West Hartford","Weather Factors":"Unknown","Object Shape":"Circle, Disc","trends":["There have been 4 other sightings in West Hartford","There were no other sightings in West Hartford on or around August 31st 1979"],"Region":"Connecticut","Summary":"hovering large disc shaped with 3 tiers,silent ,","Source":"MUFON","divs":["Sighting Detailsas my friends and I were walking out of a local mall, something made me turn around and look up. I then alerted my 4 friends to look up. We were in awe. Right above us was, what appeared to be a UFO. It was silent and hovering over our heads. We continued to watch while the object silently and slowly exited the area. As we got into the car to leave we were all in shock. WE continued on the highway looking upward in the sky. We noted all kinds of activity in the sky by this time it was dark. We had all seen airplanes in the sky before but this seemed to be diferent. Lights were moving with great speed from one point to another. To this day 30 years later the experience stays with me, I am convinced that what we saw that day was indeed a UFO. During a conversation with my fiancee's brother in law he had mentioned that around that year he was coming home from work one morning when he had seen a u.f.o. just over the tree tops, stop his vehicle and looked directly up,stood there for a few moments,and then watched the object move quietly away just over the tree tops. This took place over rt 44 in Ashford,Ct. And this object he said was huge, and silent."],"Log Number":"US-07132008-0010","Object Flight Path":"Hovering then path"}