{"divs":["Sighting DetailsThe craft was first spotted at arout 1:15PM from the three shells beach as me and a friend were sitting eating lunch. My friend pointed out that there was somthing flying over the estury. It appeared to be hovering over the refinery in Kent. It appeared to have a slightly larger diameter than the tanks we could see across the estury. It firstly appeared to be a long cigar shaped object but as it moved out from infront of the clouds, we could see that it had a pearl shaped top. It was shadowed underneath and had light reflecting off of the top. It was moving very slowly so we decided that it could not be a plane. The object was about 2000 feet above the ground, judging by the cloud base which was 3000 feet. The object drifted westwards towards London and appeared to be getting closer rapidly before drifting further away, this pattern began just before the craft reached the other side of Canvey and continued until we lost sight of it after it had passed Canvey. Just before we lost sight of the object, it appeared to be about half way between the clouds and the horizon. My friend claimed to see a flash just before it went out of sight but I did not see this flash as I had already lost sight of the object. The included image is a drawing of what I saw"],"trends":["There have been no other sightings in Southend-on-Sea","This sighting has never been favorited."],"City":"Southend-on-Sea","Longitude":"0.707712","Country":"United Kingdom","Viewing Distance":"Over One Mile","Object Features":"Dome","Case Number":"11555","Source":"MUFON","Tags":"City","Latitude":"51.545927","Disposition":"Unresolved","Date of the Event":"07/13/2008 01:15 UTC","Date Submitted":"07/13/2008 01:15 UTC","Region":"England","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/11555.html.txt","/var/www/straped/mufon/org/11555.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.545927,+0.707712(11555)&iwloc=A&hl=en\"> mufon case (11555) map </A>","Summary":"UFO spotted over Kent slowly moving towards London","Log Number":"GB-07142008-0004","Object Shape":"Disc","Sighting Duration":"01:00:00"}