{"Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"08/20/2005 11:45 UTC","divs":["Sighting Details(This account is in the witness words as I am a MUFON investigator who filed the short form report) On Sat August 20, 2005 at 11:45 PM I was outside working in my back garage workshop. I heard a loud whining noise that sounded directly over the top of the garage where I was working. I walked outside holding a 3 million candlepower lamp light. When I walked outside and looked up to the right side of my garage directly overhead approximately 10 feet or so I saw a triangular shaped craft. I was so dumbfounded I didn't turn my flashlight on to take a look at it and it was so close to me if I had my pole from the barn I could have reached it. The craft was approximately 12 feet by 12 feet by 12 feet for all three sides. It had 3 red lights-one in each corner of the triangle and a white light in the center approximately 12 inches in diameter. The white light was not very bright. More of a clearance light.(Witness words as he has flight time in small aircraft experience and a military background. I could not make out the sides, color or top of the craft in terms of shape and size. I do remember the craft which was stationery over my head rotated and maneuvered across my neighbors property flying over the top of their tool shed. The craft was able to maneuver over short trees in the back yard and around bigger trees. The craft maneuvered from the back yard to my neighbors backdoor. It came within three to four feet of the ground at times. When it got to my next door neighbors back door the craft maneuvered to the top of the roof of their house, went over the top of the roof out toward the street and then went up the street and out of sight. The sighting lasted about 15 minutes."],"Country":"United States","Weather Factors":"Unknown","Summary":"A triangular shaped craft sighting at very close distance exhibiting flight maneuvers in tight spaces.","Case Number":"11557","files":["/var/www/straped/mufon/html2text/11557.html.txt","/var/www/straped/mufon/org/11557.html"],"Source":"MUFON","trends":["There have been 2 other sightings in Wilson","There was one other sighting in Wilson on or around August 20th 2005"],"Object Shape":"Triangle","Object Features":"None","City":"Wilson","Viewing Distance":"20 Feet or Less","Date Submitted":"08/20/2005 11:45 UTC","Disposition":"Unknown","Region":"New York","Latitude":"43.309778","map":"<A HREF = \"http://maps.google.com/maps?q=43.309778,+-78.82615(11557)&iwloc=A&hl=en\"> mufon case (11557) map </A>","Log Number":"US-07142008-0006","Object Flight Path":"Stationary,Hovering then path,Other","Longitude":"-78.82615"}