{"files":["/var/www/straped/mufon/html2text/11551.html.txt","/var/www/straped/mufon/org/11551.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.688661,+-86.242957(11551)&iwloc=A&hl=en\"> mufon case (11551) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Region":"Indiana","Disposition":"Unknown","Date of the Event":"07/10/2008 08:30 UTC","Case Number":"11551","divs":["Sighting DetailsI am a truck driver and was pulling out of South Bend Indiana with a load. I was watching light bugs in the trees and bushes on both sides of the highway. It was dark, but the half moon was out and bright in the sky. On the west side of the freeway, beneath the moon, I saw stars in the dark sky. My attention was caught by a dark mass in the sky that seemed to be backlite. I looked bact to the object several times until i finally noticed the there seemed to be lights under the bottom half of the object. The lights were very bright, and the object was moving very slowly. I slowed down trying to maintain eye contact. I finally pulled my truck to the shoulder and got out of my Tractor. The object was still moving slow enough to be mistaken for a balloon and that was what I thought I would see. The object was rotating. The lights on the bottom were now facing me and were clearly in an oval pattern around the outer edge of the object. I tried to take pictures with my camera but it wouldnt focas. It was maybe 1.5 miles to my west. Maybe 50 to 60 yards in length. And floated across the sky while appearing to corkscrew through the air. It seemed to stop. And then right itself. The lights on the bottom of the object brighted, and suddenly the object \"rocketed\" forward. It moved away very quickly, but I still saw the light for a good 60 to 75 seconds. There was no sound. When I finally lost sight of it in the night i Jumped back into my Truck and headed to my destination. I was excited by what I saw and sent text messages to a friend and a nephew. By the time I got to Benton Harbor Michigan I was on my C.B. trying to see if anyone may have seen anything. One driver told me that he saw fighter plans in the night sky but I wasnt sure if he was telling me the truth."],"Source":"MUFON","Latitude":"41.688661","Object Features":"Unknown","Longitude":"-86.242957","Summary":"Black silent oval shaped object spotted. Watched from shoulder of freeway. Watched object fly off.","Viewing Distance":"Over One Mile","Date Submitted":"07/10/2008 08:30 UTC","City":"South Bend","Log Number":"US-07142008-0001","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Object Shape":"Oval","Tags":"City","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around July 10th 2008"]}