{"Date Submitted":"06/30/1969 12:00 UTC","Region":"Ohio","Weather Factors":"Unknown","Viewing Distance":"Unknown","Disposition":"Unknown","Log Number":"US-07142008-0007","Country":"United States","Case Number":"11558","map":"<A HREF = \"http://maps.google.com/maps?q=40.234493,+-84.409394(11558)&iwloc=A&hl=en\"> mufon case (11558) map </A>","files":["/var/www/straped/mufon/html2text/11558.html.txt","/var/www/straped/mufon/org/11558.html"],"Summary":"bright light ~mag 0 moving errantically in sky for about 10 minutes-no noise-on blinking lights-solid white light","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Russia","This sighting has never been favorited."],"Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Undisclosed","divs":["Sighting DetailsI am lifelong resident of Russia OH and am currently 52 years old. I am a 28 year employee of the USPS and Postmaster for 18 years in Russia OH. I have been on village council for 12 years. I am also a private pilot. One summer night when I was either 14 or 15 myself and 4 or 5 other boys were sleeping under the stars at a friends house in the country. We were all laying on our backs looking at the stars during the early evening. One of us spotted a light in the sky almost at the zenith that was moving. At was about the brightness of a very bright star. Not as bright as Venus but maybe as bright as Deneb. We all saw it and all watched it moved around an area of sky about the area of maybe 5 degrees square. It would move fast then slow and make both acute and obtuse angles. It went straight but made turns very abrupt. There was no sound that it made. It appeared to be very high in the sky. There were no nav lights or beacons. At times it appeared to move as fast as a satellite observed at dusk but not usually that fast. My friend were we were staying went to get his small telescope to try to look at it but by the time he came back out we could not locate it again. If you could give me a possible explanation of what we saw that night I would appreciate it. I have wondered what we saw that night for about 40 years now and never forgot. Thank you.."],"Date of the Event":"06/30/1969 12:00 UTC","Longitude":"-84.409394","Tags":"City","Latitude":"40.234493","City":"Russia","Object Shape":"Star-like"}