{"Case Number":"11554","Longitude":"-114.974051","Viewing Distance":"Unknown","Latitude":"36.046725","Region":"Nevada","Date Submitted":"07/14/2008 03:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.046725,+-114.974051(11554)&iwloc=A&hl=en\"> mufon case (11554) map </A>","files":["/var/www/straped/mufon/html2text/11554.html.txt","/var/www/straped/mufon/org/11554.html"],"Log Number":"US-07142008-0003","Object Features":"Undisclosed","Object Shape":"Star-like","Date of the Event":"07/14/2008 03:02 UTC","Source":"MUFON","City":"Henderson","Tags":"City","Sighting Duration":"00:02:00","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around July 14th 2008"],"Object Flight Path":"Undisclosed","Summary":"Two tiny star-like objects spotted directly above my house and they flew westward.","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsActually, the first occurrence happened on the morning of the 13th @ approximently 2:45am. For some unknown reason I didn't feel tired, so I went outside to see if I could spot the black widow spider that had been making webs from the rosemary bushes to the sidewalk in front of my house. I saw no spider. Then I began to look at the stars. As I was taking in their beauty, I noticed one star-like object traveling northward. When I spotted the object it was straight above. I knew it was moving, because it passed the other stars. I assumed it to be a satellite. It made no sound and stayed on the same trajectory. On this monday morning, I got up to take a wiz, and then just thought, 'I wonder if I could spot that sattelite again'. At approximately 3:00am, much to my surprise, I spotted two star-like objects. They passed the same stars that I had seen yesterday. That's how I knew they were moving. At first they flew parallel, about four fingers apart. Then they began to converge. As they were converging, a very recognizable commercial jet flew underneath them. The jet was heading east and made the usual noise. The star-like objects flew silently and northward. They then flew closer to each other, two fingers apart. Then they disappeared into a cloud. I watched on the other side of the cloud to see if they would reappear, but the distance must have been too great. I could not see them anymore. I came in and checked the time on the micro wave oven and made a note for me. Then I thought maybe I should share these experiences."],"Disposition":"Insufficient Data"}