{"Weather Factors":"Unknown","Object Shape":"Circle","City":"Austin","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.271083,+-97.741711(11556)&iwloc=A&hl=en\"> mufon case (11556) map </A>","Sighting Duration":"00:05:00","Object Features":"Undisclosed","divs":["Sighting Details I was looking out the bathroom window which faces to the north.The lights were off ,and, I was toweling off after showering.I was looking through the screen and did not have my glasses on,which are required for driving.With my glasses off, I can see fairly well,but, peoplke and objects are a bit fuzzy.....I had been looking at the trees and sky for short time and noticed a circle of beautiful white and blue lights moving from my left to my right.I was amazed at what I saw! It slowly(?) moved above the trees.I could not see it any longer,after say,5 minutes.There was no sounds or another object carrying this circle of lights.I felt a sense of calm and peace,plus,amazement at what I had seen! At first I thought it might be a blimp carrying the circle of lights.I caledd 311 in Austin and got excited telling the operator what I had seen.She told me she had seen,evidently, the same object a few miles from where I live!We discussed the object, its movemment,time,etc. She gave me the number for the national UFO reporting hotline in Washington.I called that number,left a message."],"Object Flight Path":"Undisclosed","Source":"MUFON","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 11th 2008"],"Date of the Event":"07/11/2008 09:20 UTC","Summary":"A circular object mving slowly across north Austin,with beautiful white and blue lights ,in dots and dashes. No sounds or transporting vehicle .","Log Number":"US-07142008-0005","Country":"United States","Region":"Texas","Longitude":"-97.741711","Case Number":"11556","Tags":"City","Latitude":"30.271083","files":["/var/www/straped/mufon/html2text/11556.html.txt","/var/www/straped/mufon/org/11556.html"],"Date Submitted":"07/11/2008 09:20 UTC","Viewing Distance":"Unknown"}