{"Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.724488,+-81.245657(1156)&iwloc=A&hl=en\"> mufon case (1156) map </A>","Disposition":"Unresolved","Log Number":"","Date of the Event":"03/31/1951 03:00 UTC","Object Flight Path":"Unknown","Weather Factors":"Unknown","City":"Painesville","Region":"Ohio","Summary":"i saw a large, and lovely disk right above my ho","files":["/var/www/straped/mufon/html2text/1156.html.txt","/var/www/straped/mufon/mufon_json/1156.json","/var/www/straped/mufon/org/1156.html"],"Case Number":"1156","trends":["There have been 6 other sightings in Painesville","There were no other sightings in Painesville on or around March 31st 1951"],"Latitude":"41.724488","Tags":"City","Sighting Duration":"00:00:59","divs":["sighting details1\\ iwas looking out at stars as often did at niteas small child when i woke up in middle of nite to use bathroom.2\\ it came rightover the house..between ours and nieghbors...right over treetops. no sound.3\\.ithought was loveliest thing i ever saw.was bigger than the house.4\\ i watched itas it banked and went up towards other side of house and out of my view. i laymy face on the glass to see it as long as i could.i loved fact it was so quiet3b i then went back to sleep...kids arent frightened...at least i wasnt.5\\ itwas silvery, metalic colored. disc shaped, with lights around the edge...iremember them as blue and green, about 18 to 24 inches apart. they did notblink. when it banked i saw a dome on top that seemed to be frosted glass, icould see dim light within.the thing i remember the most, (and have never foundduplicated in reports i have seen\\read) was out what appeared to be theback...it could have been backing up for all i know...were redstreaks\\beams\\rods(???).they were bright red and when it banked they went withit without any drag that i can remember. they came out a certain distance andend of them corraliated with edge of disk...they did not appear to beflames...more like light rods.8\\it simply went out of my viewing range ,. p.s.please note...some of above answers in survey above relate to things yearslater than this incident...i am just not sure that they are not related."],"Object Features":"Dome, Other","Object Shape":"Disc","Country":"United States","Longitude":"-81.245657","Date Submitted":"03/31/1951 03:00 UTC","Source":"MUFON"}