{"files":["/var/www/straped/mufon/html2text/11563.html.txt","/var/www/straped/mufon/org/11563.html"],"City":"Sheffield","Region":"Pennsylvania","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Sheffield","There were no other sightings in Sheffield on or around January 8th 2008"],"Case Number":"11563","Viewing Distance":"Unknown","Longitude":"-79.033275","Log Number":"US-07142008-0012","divs":["Sighting DetailsIt was snowing very continuously that night but the sky had that slight lit up look. My husband took our puppy out for a walk while I stayed home. He proceeded to go north up the street and follow the main road through town( our town is dark except for porch lights and corner street lights). He noticed when he stopped for the puppy that a series of five yellow silent objects moving across the northwestern part of town in silence. He watched them move -then move so fast out of sight that he said it was in a second. What was unusual after that was about two minutes after the sighting there was an extremely loud roar following after them. He could see nothing but he proceeded home to me. Upon arrival at home I greeted him with the fact that our windows and doors in our house had shook so bad for a minute that I would have thought it was a tornado sitting on our house!! I went outside and saw nothing. It was not thunder. It was not sonic boom. It seemed more like something unseen was following what he had just seen and I had only heard. The next day several people in our town were all talking about what had happened that night. I hope this did not only happen to our town. Thank you."],"Object Features":"Undisclosed","Sighting Duration":"00:05:00","Object Shape":"Undisclosed","Date Submitted":"01/08/2008 10:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.7106,+-79.033275(11563)&iwloc=A&hl=en\"> mufon case (11563) map </A>","Country":"United States","Disposition":"Insufficient Data","Latitude":"41.7106","Date of the Event":"01/08/2008 10:45 UTC","Summary":"five yellow equal objects in formation silent.","Weather Factors":"Unknown","Source":"MUFON"}