{"Weather Factors":"None","Log Number":"US-07142008-0011","City":"Snellville","Longitude":"-84.019911","Country":"United States","divs":["Sighting Details I was on my back balcony at our lake house taking a break from my freelance artwork. I was gazing at the night sky full of stars and had been looking at the sky for a few minutes. I turned towards the house, looking up over the roof, when my eyes locked on to the sphere. It was a very bright yellow-white color and had very clean, crisp edges. It made no sound and was streaking in a straight line. Had I blinked, I don't think that I would have noticed it. I can only relate the experience to when your eyes catch a glimpse of a lightning bolt- my eyes were looking in the right place at the right time. Only this sphere was moving at what seemed a slower speed than lightning but still at an incredible rate of speed. I couldn't see any trail or exhaust wake behind the sphere. It traveled a straight path, west to east, over my roof top and I lost sight of it when it passed over the trees on the other side of the horizon. Our house is up high on a hill so I gestimate that the distance covered by the sphere in the two to three seconds viewed had to be 10 to 20 miles, more or less. There were no clouds in the sky at the time of the sighting. I think the sphere was thousands of feet above my head, but since I don't know the actual size of the object that altitude is questionable. The sky was so clear that night and the clarity of the sphere was optimum. I was excited to see it because I knew that what I was seeing wasn't a commercial jet, civilian plane or meteor. I thought to myself, if it was military, then I congratulate the armed forces on building such a speedy and quiet craft that possibly doesn't pollute the environment like our stock aircraft do."],"Tags":"City","Source":"MUFON","Object Shape":"Sphere","Summary":"Very bright yellow-white sphere, very crisp, clean edges, no sound- moving at incredible speed in straight line.","map":"<A HREF = \"http://maps.google.com/maps?q=33.857328,+-84.019911(11562)&iwloc=A&hl=en\"> mufon case (11562) map </A>","Case Number":"11562","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Date of the Event":"01/15/2004 01:00 UTC","Region":"Georgia","Latitude":"33.857328","trends":["There have been 2 other sightings in Snellville","There were no other sightings in Snellville on or around January 15th 2004"],"Disposition":"Unknown","Date Submitted":"01/15/2004 01:00 UTC","Sighting Duration":"00:00:03","files":["/var/www/straped/mufon/html2text/11562.html.txt","/var/www/straped/mufon/org/11562.html"],"Object Features":"None"}