{"Country":"United States","Tags":"City","Weather Factors":"Unknown","City":"Redondo Beach","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.851922,+-118.385858(11564)&iwloc=A&hl=en\"> mufon case (11564) map </A>","Latitude":"33.851922","Source":"MUFON","Date Submitted":"02/29/1968 12:00 UTC","Object Shape":"Circle, Sphere","Log Number":"US-07142008-0013","Date of the Event":"02/29/1968 12:00 UTC","trends":["There have been 10 other sightings in Redondo Beach","There were no other sightings in Redondo Beach on or around February 29th 1968"],"Case Number":"11564","Sighting Duration":"Undisclosed","Summary":"very bright light, looked like Venus, but wasn't","Longitude":"-118.385858","Viewing Distance":"Unknown","Object Features":"Unknown","Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/11564.html.txt","/var/www/straped/mufon/org/11564.html"],"divs":["Sighting DetailsIt was the night of the Grammy awards; that's how I know the exact date. My room mate and I were un loading the car and she noticed the bright light in the sky. I at first thought it was just Venus. But she pointed out it was in the wrong part of the sky. My next thought was it was a helicopter, with the large spotlight on. You couldn't hear any sound from it but I thought that was because it was too far away. A few minutes later a small airplane flew towards the light and circled underneath it, in large circling loops. What really caught my attention was that you could hear the airplane clearly. There were cloud layers and the light & plane were below cloud level. I also new a pilot would not be circling under a helicopter..and I now new if i could hear the airplane, I for sure would have heard the chopper. I went upstairs and called the airport at LAX & told them I was watching a large light in the sky, with a small plane circling underneath. The man I was talking to said they were tracking it on radar and did not know what it was. I got really excited and said something like, \"wow, it is really an UFO?\". He answered something about no, it wasn't a UFO, they just didn't know what it was. I hurried back down stairs (we were watching this out in front of our apartment house) I guess we watched for about15 minutes..the light didn't move, the small plane continued circling under the light..(not up close to the object, but still under it) Here comes the good part.. The object was in the north west part of the sky. I looked over towards the east and a military jet was flying towards the direction of the light. I remember we said , \"This is going to be interesting.\" The jet was flying at the normal jet speed, as far as i could tell. It got about half way towards the light (half way from where we first saw it) The large light just turned off and a small light was there, like a small star would look in the night sky. As soon as it blinked off & became star sized, it just shot off, towards the pacific ocean. There was no sound at all.I've never seen anything move like that. Way faster than a shooting star, way, way faster than that jet was moving. Once it was gone, I went back upstairs and called LAX again.. This time whoever I talked to denied they were tracking anything. \"I have no idea what you are talking about\" was the basic message I got. I looked in the paper the next day but didn't see anything. I have no idea why it would stay in the sky that way..I'm guessing we watched it for about 20 minutes in all. We were living in the Redondo Beach area, not close to the beach, maybe a 10 minute drive to the actual beach. I don't remember the exact time, but it seems to me it was just starting to get dark. probably after sunset. Is there anyway you guys can check LAX's information , like in the freedom of information act? Would they tell the truth about tracking it on radar? Or has too much time gone by? thanks, just wanted to share my story..i've told many friends about it but i've never shared it in written form."],"Region":"California"}