{"Disposition":"Insufficient Data","Tags":"City","Weather Factors":"None","Case Number":"11561","map":"<A HREF = \"http://maps.google.com/maps?q=47.219414,+-123.096527(11561)&iwloc=A&hl=en\"> mufon case (11561) map </A>","Source":"MUFON","Longitude":"-123.096527","Region":"Washington","divs":["Sighting DetailsThird time we've seen these bright flashing blips. In 1997 my husband and I observed 3 bright flashing blips in the west at sunset, so the sky was very bright, but the flashes were sporadic and in 3 separate places close together in the sky. 2nd time we noticed the flashes was in early May. My daughter and I watched a single sporadic flashing light under the Big Dipper. Last night was the 3rd time - again under the Big Dipper. It flashed a very bright light, white in color. a few second later it flashed twice. My husband is a pilot. We are very familiar with both fixed wing and helicopter \"behaviors\" and light patterns. These \"flashes\" are never associated with seeing any further flight pattern in any direction. When we have seen these flashes we tend to stand staring into the sky for a long time afterward, waiting to see if any flight pattern emerges. An individual can stare into the sky and catch any peripheral movement, such as a helicopter or fixed wing continuing on in some direction. We are aware also of aircraft turning or changing direction APPEARING like flashes as they turn, however...these flashes we are reporting never have any such aircraft. They are simply very, very bright white flashes in the sky followed by nothing, no matter how long you stare. We have found it interesting that the flashes have always been approximately in same area of the western sky, although from different perspectives. The first was from Olympia WA (25 mi from our current home), the second two incidents were seen from our back deck in Shelton, WA. We also have McChord Air Force base and Ft Lewis within 50 miles from us. We are very accustomed to seeing military aircraft as well. I had one other UFO experience as an adult and two as a child. The first experience is very awkward to talk about but perhaps someone else has experienced something similar so I will recount it: In 1965 I slept in a dormer bedroom with windows facing West. The head of my bed was against this Western wall to the left side of the window (facing the window from inside). I woke to a sense of extreme panic. At an angle through the dormer wall were two red lines of light the circumference of a pencil or one of those laser lights. They entered the wall about at the 5' mark on the wall above my head and laid at an angle from there to the foot of my bed, as though I had two red lines of light the width of my bed. I couldn't move anything but I could see the light-lines. Inside of myself, I knew there was something outside the house shining the lines of light through my wall and I instinctively knew it was the red lines that were making me paralyzed. I was extremely terrified for a moment, but next thing I knew it was morning so I knew I had fallen back asleep. I have had no residual effects from that experience. When I was ten in 1966, I was on a road trip around the USA with my family. We were going through the deserts of Utah when we all observed two large cigar shaped objects with a 'string' of 7 smaller objects between them. It was way in the distance and seemed very high. We watched them in the sky for approximately 45 minutes as we traveled. The 3rd time was when I and my two children were at Mount Rainier camping in 1986. After dark we walked to the large river that runs from the Nisqually glacier to lay on a blanket and watch the stars for meteors. We all watched as a blinking object moved in the eastern sky toward Mt Rainier at a rate of speed that would not be uncommon for an aircraft, but as it approached closer to the silhouette of the Mt., it suddenly just shot off like a shooting star. It shot off on the same trajectory line as it was flying and blinking which angled up into the sky. When it shot off, it truly was fast as a falling star. Like a blur of light. We all remember it clearly. I have never thought of reporting any of these experiences, but I figure if you are compiling reports, perhaps what I myself, or us as a family have experienced may match what someone else has reported as well, so for the reason, I thought it would be good to share these events. Thank you for listening. I feel a bit goofy knowing I am sharing with these with someone."],"Latitude":"47.219414","trends":["There have been 6 other sightings in Shelton","There was one other sighting in Shelton on or around July 13th 2008"],"Sighting Duration":"Undisclosed","Object Features":"None","Log Number":"US-07142008-0010","Object Shape":"Flash","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","Date of the Event":"07/13/2008 10:30 UTC","City":"Shelton","Country":"United States","Summary":"Bright Blips","files":["/var/www/straped/mufon/html2text/11561.html.txt","/var/www/straped/mufon/org/11561.html"],"Date Submitted":"07/13/2008 10:30 UTC"}