{"trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around July 15th 2008"],"Longitude":"-75.160839","Viewing Distance":"Over One Mile","Source":"MUFON","Region":"Pennsylvania","Log Number":"US-07152008-0004","Object Features":"None","Object Flight Path":"Other","Summary":"A blinking moving light far up in the night sky that RETURNS","files":["/var/www/straped/mufon/html2text/11572.html.txt","/var/www/straped/mufon/org/11572.html"],"Object Shape":"Unknown","divs":["Sighting DetailsI was at home in my apartment building reading when I went outside for a cigarette. I have a pretty good view of the night sky from the front door. I was sitting on the curb smoking and watching the sky (I am aware of the increased UFO activity in my area). I saw what at a glance would seem to be a bright star, or possibly Venus. But the light kept flickering, and then it moved. It did not dart around the sky; but you could observe it sort of rocking back and forth slightly. I crouched down behind a railing, since the wood of the railing blocked out the nearby street lights, giving me a slightly better look. The harder I focused on it, then looked away, then looked closely again, I could easily swear it was not a star, plane, helicopter, meteor, or anything else I can think of. It was far enough away that shape is very hard to say; but it did seem to have a vague cigar-shape, and the flickering I first noticed was easily (on really looking at it and focusing) identified as flickering lights. As for color, the best I could make out was yellow and red. The object moved very slowly; I watched it for about ten minutes, still not really moving other than the slight zigging back and forth, then went inside for a few minutes to call a friend. Watching it continuously it did not appear to change its position in the sky, but after being gone and coming back, it had clearly moved further across the sky. After another fifteen or so minutes watching, it vanished very slowly. It didn't streak off into space; just very, very slowly faded into the distance. I kept my eyes on it as long as possible, then lost it; it became too faint, or moved too far away. Or both. The part that should interest you is not only have I just had this experience now, right before I wrote this, but this was actually the third time. July 12th, 1am, same experience. Ditto for July 14th. Same time, same duration, same everything. So it seems logical to assume it will be back tomorrow night or the night after. I would be more than happy to send you more information as I observe it, but I also know you have people in the area. I would give anything for binoculars or a telescope to get a better look at this thing if it returns again, since it has now faithfully appeared three times in four nights (might have been four-for-four; I wasn't around the 13th) at the same time and in the same area of sky. But it is way up there, and I wish it would come closer. I'm sure you do, too. Thanks for listening."],"City":"Philadelphia","Date of the Event":"07/15/2008 12:00 UTC","Date Submitted":"07/15/2008 12:00 UTC","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=39.954165,+-75.160839(11572)&iwloc=A&hl=en\"> mufon case (11572) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"11572","Latitude":"39.954165","Country":"United States","Weather Factors":"Unknown"}