{"Tags":"City","Summary":"The sun was going down and something silver caught my eye.","Viewing Distance":"Unknown","divs":["Sighting Details I was driving through the Mobil home park where I live heading to the store.The Sun was just going down and some thing silver caught my eye.I looked up and saw something really strange.At first I thought it was a hot air balloon,but it wasn't. this was at least 20 times bigger then a hot air balloon.It was really big.It was way up in the clouds at about 2 o clock,1200 oclock being stright up. I pulled over and stopped to watch it.The top of it was Silver,and the middle was BLack and slowly faded to a Red on the bottom.It moved very fast and this will sound weird but it looked like a giant top.I could not get over how big it was.I live behind a small Airport,and use to live behind March air force base,and know what different types of air planes look like.This was no airplane,or no Blimp.It is the biggest thing I have ever seen in the air. The next day the air force put out a news report that a circus lost a big balloon that was Pink and was a pig that was 2 stories high.This was no pig,and if it was,it must have been set up with jet engines to move as fast as it was going.I watched it for about 3 minutes until it went out of sight. The balloon thing the Airforce put out sounds nice except this was flying opposite of the wind.I don't believe anything they say anyway. I wish I would have had a camera with me but unfortunately I didn't. Well I'll keep watching and hope it comes by again. Paul<><"],"Date Submitted":"06/15/2008 07:25 UTC","Object Flight Path":"Straight-line path","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/11585.html.txt","/var/www/straped/mufon/org/11585.html"],"Latitude":"33.75649","Log Number":"US-07152008-0017","trends":["There have been 11 other sightings in Hemet","There was one other sighting in Hemet on or around June 15th 2008"],"Sighting Duration":"Undisclosed","Case Number":"11585","City":"Hemet","Weather Factors":"Unknown","Date of the Event":"06/15/2008 07:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.75649,+-116.966908(11585)&iwloc=A&hl=en\"> mufon case (11585) map </A>","Object Features":"Other","Source":"MUFON","Object Shape":"Other","Longitude":"-116.966908","Country":"United States","Region":"California"}