{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"2 Star-like objects in broad daylight","files":["/var/www/straped/mufon/html2text/11583.html.txt","/var/www/straped/mufon/org/11583.html"],"Latitude":"40.7676","Object Shape":"Star-like","divs":["sighting detailson a bicycle riding i looked up in a park in northern nj when hearing a jet. looking up, i noticed a commercial aircraft pass over and then stopped riding once noticing a star-like object sitting stationary near where the plane had just passed. this was 5pm in the evening in mid-july. it was either very small or very far and whitish\\metal in color, basically a fat glowing dot just sitting there like a star or a satellite in broad daylight and blue sky. it must have been mostly white but was definitely shiny with a small tight halo, exactly like a star at nighttime. after sitting still for less then a minute it moved to the left and across the sky at roughly 300mph. it started to move left in a straight line at a constant speed and altitude (across the sky from left to right). after a few seconds of movement, i noticed an identical type of object moving over and past the original one in a diagonal direction (southwest to northeasst), at a higher altitude. no. 2 seemed to be moving faster, and seemed higher up then the originally noticed one. i tried to follow both at the same time looking back and forth from one to the other quickly. i lost the faster 2nd one in less then 10 seconds and then watched the original one move away very far until i couldn't see it any longer. a lady passed on a bike while it was about to move too far into the diatance for me to see. i looked at her and looked back at the object noticing it again before losing it in the diatance. i do not wear glasses and have 20\\15 vision. was this a military or police surveillance uav? it was not a bird or a helicopter. i was kind of not suprised when watching this but kept saying that \"this doesn't look normal\" to myself during the whole time, prob 2-3 minutes in total. i did think to reach for my cell phone at one point in the begining to take a pic but did not have it with me. it would have been very difficult to capture the object(s) clearly with the poor resolution. it was very cool none the less."],"Object Flight Path":"Hovering then path","Log Number":"US-07152008-0015","Tags":"City","Source":"MUFON","trends":["There have been 12 other sightings in New York","There were no other sightings in New York on or around July 13th 2008"],"Viewing Distance":"Over One Mile","Longitude":"-73.957968","Region":"New Jersey","Case Number":"11583","map":"<A HREF = \"http://maps.google.com/maps?q=40.7676,+-73.957968(11583)&iwloc=A&hl=en\"> mufon case (11583) map </A>","Object Features":"None","Country":"United States","City":"New York","Date Submitted":"07/13/2008 12:00 UTC","Date of the Event":"07/13/2008 12:00 UTC","Disposition":"Unknown"}