{"Region":"Alabama","Object Shape":"Cone, Disc, Oval","Disposition":"Unknown","Longitude":"-87.691799","City":"Gulf Shores","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11580.html.txt","/var/www/straped/mufon/org/11580.html"],"Tags":"City","divs":["sighting detailsaway from home, awoke from sleep and began to stare at a clear bright northern night sky looking over the gulf of mexico from the window of a beach house on stilts-a tiny star like object possibly satellite or plane appeared to be making an orbit-it stopped and began to go back and forth-up and down-no pattern-awoke person sleeping with me-as we watched it drop in the sky it changed to a huge saucer like object directly in front of the window-couldnt determined size-300 ft might be close-football field in length-hard to tell-we both were able to describe what we saw to reinforce our sighting-pleading to let us board-four windows on the underside facing us-2\\3 of bottom a round bright light that appeared to be the power source-it moved slowly up in the sky-we ran outside and got under the object pleading to let us board-it made another ascension into the sky and from stand-still it zoomed with no sound to the southeast and eventually out of sight. we were very excited and telling the experience always comes with a letdown due to disbelief. we have no missing time but alot of facts came to mind that i had never considered-strange things about how we evolved and how we connect to them-they were from orion-pelates-siris connected-i do not have recall what they might have looked like-why would we think these things without boarding-we never talked about missing time because it didnt seem to matter the strangest thing about this for us is the fact that they knew i was watching the sky-made the fact know from a distance and come close for observation. the person that had this encounter with me is dead but it was a habit to call each other just to go over the facts again and consider how fortunate we were for the experience."],"Case Number":"11580","Date of the Event":"07/31/1977 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.247486,+-87.691799(11580)&iwloc=A&hl=en\"> mufon case (11580) map </A>","trends":["There have been 6 other sightings in Gulf Shores","There were no other sightings in Gulf Shores on or around July 31st 1977"],"Object Features":"Window(s)","Viewing Distance":"101-500 Feet","Date Submitted":"07/31/1977 12:00 UTC","Summary":"silver grey green-windows on underside-circular bottom brightly lit.","Object Flight Path":"Path then hovering","Log Number":"US-07152008-0012","Sighting Duration":"Undisclosed","Latitude":"30.247486","Weather Factors":"None"}