{"Case Number":"11592","Sighting Duration":"Undisclosed","Region":"Oregon","Disposition":"Insufficient Data","Source":"MUFON","Date Submitted":"07/15/2008 07:20 UTC","Latitude":"45.531082","Longitude":"-122.669337","Log Number":"US-07162008-0006","map":"<A HREF = \"http://maps.google.com/maps?q=45.531082,+-122.669337(11592)&iwloc=A&hl=en\"> mufon case (11592) map </A>","Object Features":"Undisclosed","Date of the Event":"07/15/2008 07:20 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 15th 2008"],"Country":"United States","City":"Portland","Object Shape":"Triangle","Tags":"City","files":["/var/www/straped/mufon/html2text/11592.html.txt","/var/www/straped/mufon/org/11592.html"],"Summary":"Dark shadow on whispy white clouds - object/shadow moving very fast","divs":["sighting detailsi was sitting\\reclining in patio chair admiring the evening sky - sky had very high but whispy clouds against still blue background - beautiful evening. watched many high flying birds with glinting feathers reflecting the soon to be setting sun. also saw and heard numerous jet aircraft ascending up from portland airport flying across my field of vision. while admiring the sky i suddenly saw for several seconds a dark gray \"shadow\" move across the clouds - direction east\\northeast - the shadow only visible in my sight for a few seconds. i heard no plane or helicoptor noise which struck me as very strange and confused me. at first i thought it was a very large plane flying above the clouds but it moved too fast compared to the other planes i'd seen. it had no sound. it was not from a bird either - much too big and above the clouds, not against the clouds. the dark shadow looked like it was from an object on the other side of the clouds - out in the atmosphere. it also was much larger than any of the planes and birds i'd just seen against the sky last night. by big, i mean it was very much larger than any of the other things that i had seen in the sky - maybe an inch and a half across - as opposed to the airplanes that looked like they were only about a half inch and that appeared to be much closer to me. i continued to sit and watch for a while longer to see if it reappeared but after another 10 minutes or so i went in side and reported it to my boyfriend. anyway, that's what i saw. dark shadow. no noise, very high up, very big."],"Weather Factors":"Unknown"}