{"Latitude":"40.590027","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/11590.html.txt","/var/www/straped/mufon/org/11590.html"],"trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around July 15th 2008"],"City":"Allentown","map":"<A HREF = \"http://maps.google.com/maps?q=40.590027,+-75.508434(11590)&iwloc=A&hl=en\"> mufon case (11590) map </A>","Date Submitted":"07/15/2008 10:30 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"07/15/2008 10:30 UTC","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Longitude":"-75.508434","Weather Factors":"Unknown","Country":"United States","Log Number":"US-07162008-0004","Object Features":"Unknown","Disposition":"IFO","Case Number":"11590","divs":["Sighting DetailsI admit that I'm intersted in UFOS.It was a nice night outside of Allentown, Pa., last night, I stepped outside at 10:30 to look at the sky.Observed a large, what I thought could be a star, but it appeared to be blinking different colors. It was way off in the WSW sky. I watched it for 5 minutes, went inside and got binoculars. With the binocs, I could CLEARLY see this object was blinking red, green, white, maybe blue lights, but I could make out any distinct shape.I watched it for a good 5 more minutes and it hadn't moved a bit. I could see planes moving, but this was just sitting there. Stuck my head inside the door and asked my family if they wanted to see something weird in the sky, so my partner and son came out and both saw it. Son says, \"Hey, there's another one.\" He's right, there was a smaller one out to the right of the big one, but a fair distance away. Taking a closer look at the night sky, I counted and verified with binoculars 6 small blinking objects, and one large one. They were spread out in an upside down check mark pattern, with the big one being at the base of the check, only one on the lower left side, and the remaining smaller 5 on the right side. None of the objects were moving at all. We could see planes flying and they were obvious. We didn't hear anything. While it seemed like the objects were in our sky, it is possible the were in space. My partner thinks they may have been satellites. I don't think so.My family went in and I stayed out for a few minutes more, untill 11 pm, watching. I went back out at 3:30 am and the big one was gone, and there were maybe 4 smaller ones still visible but in different places.Not moving, just hovering. That was the most remarkable thing,the hovering and blinking, it's like wow, what could it be? All of us can verify the objects were clearly blinking multi-color.I made sure this morning that they weren't any kinds of cell phone towers or anything like that.My family likes to kid me about stuff like this, but that gave them something to think about. It was strange, and ultimatly a little creepy. I'll go back out tonight and look."],"Summary":"Series of clusters of blinking lights spread over Allentown WSW sky","Tags":"City"}