{"Viewing Distance":"Unknown","divs":["Sighting DetailsAfter hearing the short news clip on TX the other night regarding the Stephenville lights heading toward Crawford, I felt I had to write. I live on a small ranch in Indian Gap, TX about 40 miles south of Stephenville, TX. On 10-6-07 around 9:00 P.M. my two grown sons and I were outside unloading a truck. We noticed on the horizon to the west in a small cloud bank there were 2 orange lights about the size & color of a lighted cigarette moving in & out of the cloud bank. Behind these lights were numberous small flashing white lights covering a large area across the horizon. These lights flashed like a sparkler randomly with no set pattern & there were too many to count. The 2 larger orange lights moved back & forth across the cloud bank at a high rate of spee then stopped, set for a few seconds, then went out. A few seconds later they would appear in another area, moved back & forth, then stop, go on & off & the move again. The whole time the little white lights kept flashing. We watched their show for about 10 minutes & then they just went away. We had a big laugh about the incident & wondered what the lights were. They every next night about the same time they showed up again in the same area. I went to my truck to get something, looked up & there they were. I hollered to my sons who were in the house. They came out & we watched again this time in disbelief. But this time the show only lasted about 5 minutes. We couldn't believe what we had seen & that we had seen it two nights in a row. I believe these 2 sightings were about 2 months or more before the ones in Stephenville in January. After the Stephenville sightings I would go outside 2 or 3 times a night & look at the sky but did not see anything until January 30, 2008. I heard the dogs barking went outsiede but did not see anything. As I started back to the house I looked up & to my surprise there in the south the lights had returned the same as before. This time I watchedn them for 45 minutes. I called the Sheriff's Dept. in Hamilton county to see if anyone else was sening them. the dispatcher told me no. As I watched & talked to her, one light separated into 2 lights; then went out; then appeared again. Then one light separated into 2 lights ; then into 4 lights. After I hung up I saw a small airplane flying low & slow coming from northeast to southwest. It flew right through the area I was sending the orange lights. Then from the west came 3 helicopters flying real low & real slow; low enough that the ground shook. The orange lights & white sparkling lights disapeared & I haven't seen them since. I look all the time. I don't know that it was that we saw but I know what it wasn't. The same night, January 30th, there were 4 more people from Goldthwaite about 30 miles south of me that saw almos the same thing I saw. Only 2 helicopters investigated those lights. These lights definitely were not headed for Crawford!"],"Latitude":"31.709366","files":["/var/www/straped/mufon/html2text/11591.html.txt","/var/www/straped/mufon/org/11591.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.709366,+-98.114593(11591)&iwloc=A&hl=en\"> mufon case (11591) map </A>","Object Features":"None","Longitude":"-98.114593","Date Submitted":"10/06/2007 09:00 UTC","Sighting Duration":"00:10:00","Date of the Event":"10/06/2007 09:00 UTC","Object Shape":"Oval, Star-like","Region":"Texas","Summary":"Flashing lights, round, no sound","Weather Factors":"None","Country":"United States","Log Number":"US-07162008-0005","trends":["There have been 8 other sightings in Hamilton","There were no other sightings in Hamilton on or around October 6th 2007"],"Source":"MUFON","Disposition":"Unknown","Tags":"City","City":"Hamilton","Object Flight Path":"Path then hovering","Case Number":"11591"}