{"map":"<A HREF = \"http://maps.google.com/maps?q=46.14439,+-60.192084(11608)&iwloc=A&hl=en\"> mufon case (11608) map </A>","Region":"Nova Scotia","Tags":"City","Date of the Event":"08/26/2004 03:30 UTC","City":"Sydney","Latitude":"46.14439","Object Features":"Undisclosed","divs":["Sighting DetailsIt was approx.3:30 am,Aug.26,2004 my 19 yr old son was outside having a smoke.He was sitting on the step with his back against the door when he noticed a thick fog coming down from the neighbors yard.Thats all he remembers until he woke up in the fetal position under a tree in our yard.It was 5:30am when he woke and the buttons were torn from his shirt and the pocket was riped off.The heel of his sock had a hole and a ring he had on his left hand was on his right hand.He had a mole on his ring finger that was half cut off.When he woke his father at 5:30 his father said there was a gel like substance on his face and not knowing what had happened he told him to wipe it off.They then woke me up to say something had happened and after hearing the story I asked if he had any marks.I almost died when he lifted his shirt,he was branded with two marks,one looked like a pac man with a tongue coming out ,this was on his left side and the other side had three dots in a triangle. That evening around 2:30 a.m.before this happened my son and husband were watching a bright light in the sky with what looked like smaller lights flying back and forth from it. That a.m.after seeing the marks I took pictures and a video,most of the pictures came out but the video had a very strange swishing sound,you can see it but you can't make out the talking. Our son pasted away in April,2005 and we are now ready to tell his story as this seemed to bother him a lot."],"Viewing Distance":"Unknown","Summary":"My son was abducted Aug.26/04","Object Flight Path":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/11608.html.txt","/var/www/straped/mufon/org/11608.html"],"Sighting Duration":"Undisclosed","Date Submitted":"08/26/2004 03:30 UTC","Object Shape":"Unknown","Weather Factors":"Unknown","trends":["There have been 11 other sightings in Sydney","There were no other sightings in Sydney on or around August 26th 2004"],"Log Number":"CA-07172008-0008","Case Number":"11608","Source":"MUFON","Country":"Canada","Longitude":"-60.192084"}