{"Region":"Arizona","divs":["Sighting DetailsI first saw the UFO in Glendale, Arizona the best I can recall in about the month of November because I was baking a pumpkin pie prior to going to pick up my daughters girlfriend to spend the night. I took the pie out of the overn and my daughter and I went to go pick up her girlfriend. I was in a hurry because I also had to pick up my husband at the airport at 7pm ish. We traveled north to Cactus ave and then turned right on Cactus heading east. We picked up her girlfriend as was returning home. At the intersection of Cactus and 51st ave, the girls were talking as teenagers normally do and I was the first to notice a huge triagular UFO above us approximately 300 feet into the air. My mouth dropped and I recall saying to the girls \"Oh my God\" \"OH my God\" look at this, look at this. We were out into the intersection of 51st and Cactus and we just didn't move the car at all, just staring at the object. It was huge, I mean the biggest thing I have ever seen flying in my life. I could only compare it to larger than the length of a football field or bigger. It was completely silent and it was blinking multi-colored light around the outer frame of the object. The lights were blinking in it seemed like a musical pattern, while the craft just hoovered over the same exact spot not moving at all. I looked around at the other cars to see if they were looking at what I was looking at and they did not seem to be seeing the same event. When the light turned and I had to get out of the intersection I turned and the craft began to move golng south, at this time the lights were not blinking in the pattern anymore. I could tell when the craft moved that at that time is when I could see that the craft was actually a huge trianular shape. It seemed as though as the craft turned the appearance of the craft would change. As the UFO moved south I followed it ofcourse in sure amazement and it I believe let me stay up in speed with it, not going very fast is what I mean. When we got to the intersection of 51st ave and Northern we had to stop for the stop light, and I again looked around at the other drivers and at this timed I saw the car next to me pointing up into the sky acknowleging the UFO that we were seeing, to my relief because this car was validating what the girls and I were seeing in the sky. It is at this point that while sitting at the stop light that the UFO shot straight up into the sky in a blink of a eye. Of course all I can say is that I was so freaked out, I drove home to drop the girls off and I remember telling the girls that I wanted to call the t.v station and tell them what I saw or call the military but for some reason I never did it. After droping the girls off at home I had to pretty quickly leave to pick my husband up at the airport and I remember just freaking out going to Sky Harbor Airport to pick him up. I kept looking up in the sky to see if I could see the UFO again, but there was nothing. I recall telling my husband about it and how shook up I was. We returned home and I only recall talking about it once or twice again. I asked my daughter to draw a picture of what she saw and I would draw one of what I saw and we wouldn't let each other see it until we were dcne drawing. Theyh both were drawn exactly the same. I do not know where those pictures are today. This is the same UFO that was decribed being seen in January of 2008 in Texas."],"City":"Phoenix","Object Features":"Patterned Surface, Other","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"33.452277","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Triangle","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 31st 1990"],"Source":"MUFON","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/11602.html.txt","/var/www/straped/mufon/org/11602.html"],"Date Submitted":"10/31/1990 06:30 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.452277,+-112.067567(11602)&iwloc=A&hl=en\"> mufon case (11602) map </A>","Country":"United States","Summary":"UFO encounter in Glendale Arizona in 1990","Longitude":"-112.067567","Date of the Event":"10/31/1990 06:30 UTC","Case Number":"11602","Log Number":"US-07172008-0002","Tags":"City"}