{"Source":"MUFON","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI was sky watching and was looking up and a bright light was coming from behind me (coming from west moving east) very fast, but very low - lower than a plane would fly over. It was pretty cloudy and it was below the cloud line because it was clear as could be. No cloud obstruction at all. It was shaped like a V, the point of the V moving at the front, looked very fireballish, but it was pure bright light and there was no tail like you would see if something was on fire - it was illuminated and glowing, but not burning... all bright white. It flew over my head and then angled to go south east from here. I tried to get a better view with my binoculars, but it still looked exactly the same, not a defined crisp outline - because it was so bright and still looked like a V shape glowing pure white. I was so amazed and was thinking wow, that was the best, and then I walked to the middle of the yard to see if there was anything else out there and I thought I heard a train in the distance and then OMG a VERY low flying helicopter came out of nowhere right over my yard - actually right over my head - and headed in the exact same direction. It was flying faster than I knew a helicopter could fly. I know the helicopter saw me - how couldn't he as he went over me. I thought to myself, that helicopter isn't going to catch that thing - and why did they send a helicopter to chase it? Because it was so low and a helicopter would bring less attention or because nothing else was around to go after it? Doesn't matter, I was sure he wasn't going to catch up to it anyway. It was miraculous and amazing and an experience I'll never forget. And it made no noise at all. Completely silent. If something like this was flying over during the daytime, no one would see it because it was so bright white. The totally silent thing was neat, but the totally noisy fast helicopter was shocking. I think that if anyone saw this thing they would probably think a meteor was crashing to earth, but like I said, there was no tail on this thing and the glow was almost fluorescent in how it was illuminated. Looking over the left at the questions.... It was so smooth in its flight and I was so impressed with its appearance. I actually after seeing the helicopter felt a little angry at the helicopter for chasing it. What the heck, it was beautiful to see. I came in the house to tell my son about it and asked him if he heard the helicopter in the yard and of course not, with the air conditioning on, no one can hear anything outside. I looked around to the neighbors to see if they came out because the helicopter was so loud someone had to think something was going to crash into their house... but no, not a soul. It's so humid and hot everyone has their air conditioning on."],"trends":["There have been 9 other sightings in Schererville","There were no other sightings in Schererville on or around July 18th 2008"],"Region":"Indiana","Log Number":"US-07182008-0008","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Case Number":"11618","Summary":"v-shaped bright white light came over yard followed a minute or so later by helicopter","Object Shape":"Boomerang, Chevron, Fireball, Triangle","files":["/var/www/straped/mufon/html2text/11618.html.txt","/var/www/straped/mufon/org/11618.html"],"Country":"United States","Object Features":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.488435,+-87.44656(11618)&iwloc=A&hl=en\"> mufon case (11618) map </A>","Viewing Distance":"Unknown","Latitude":"41.488435","Date of the Event":"07/18/2008 04:20 UTC","Date Submitted":"07/18/2008 04:20 UTC","Longitude":"-87.44656","City":"Schererville"}