{"Object Flight Path":"Undisclosed","Object Shape":"Circle","Sighting Duration":"Undisclosed","Log Number":"US-07182008-0007","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/11617.html.txt","/var/www/straped/mufon/more/11617_submitter_file1__EarthCircles4.JPG","/var/www/straped/mufon/more/11617_submitter_file2__EarthCircles3.JPG","/var/www/straped/mufon/more/11617_submitter_file3__EarthCircles2.JPG","/var/www/straped/mufon/org/11617.html"],"trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around July 12th 2008","This sighting has never been favorited.",""],"Region":"New Mexico","Latitude":"35.092211","map":"<A HREF = \"http://maps.google.com/maps?q=35.092211,+-106.643467(11617)&iwloc=A&hl=en\"> mufon case (11617) map </A>","Case Number":"11617","Summary":"5 perfect round circles with circles inside each circle","divs":["Sighting DetailsMy husband found these circle Monday, July14th and called to see if I knew anything about them. He was going into the horse arena to spread with our manure spreader when he noticed them. I was home all weekend and did not hear anything out in the arena. The only thing that I can think back about that was unusual was that sometime late in the night on Saturday, I woke up to find my lab pup up on the love seat in our bedroom looking out at the arena. Once I spoke to him, he just gave me a strange look and laid back down. When there is someone or something on or near the property, he and my other dogs bark quite loudly. He did not even growl!!! The circles are approximately 20 ft. in diameter and approximately in the gound about 1-2 inches. There are absolutely no tracks leading up to the arena from anywhere on or hear our property. If you would like pictures, I can send you an e-mail and also there is a video that a local tv station did on Tuesday the 15th. If you go on KOAT.TV and type in the search engine \"crop circles in east mountains\" it will pull up the page with the segment that they did along with the aerial view of the arena. You will see tire tracks in the arena, which was made by us with our manure spreader, but no other tracks can be found."],"Country":"United States","Date of the Event":"07/12/2008 12:00 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Longitude":"-106.643467","Source":"MUFON","Date Submitted":"07/12/2008 12:00 UTC","Object Features":"Undisclosed","City":"Albuquerque"}