{"Tags":"City","Log Number":"CA-07182008-0006","Weather Factors":"None","divs":["Sighting DetailsIt was early spring I think in 1987 and it was a clear warm day. I was walking between a hotel and the 401 in Brockville Ontario, I had a feeling I was not alone so I looked up and was surprised to see an object at an altitude of about 2000 to 3000 ft. It changet shape from a circle to a star which may be an optical illusion because it was bright, glowing, colour chageing object and as it changed colour it may have appeared to change shape to a star. Ir changed colour from red to blue to white and then greenI layed down on the ground to watch this strange object and I am not sure how much time elapsed but it would cjange colour and brightness but it was not moving but it was hovering.I found myself strangly calm about the whole thing which was unusual due to my negative reactions to UFO shows, I ussually get anxious and fearful but in this insident I was calm I think I even fell asleep that is why I am not sure how much time lapsed I put the encounter at about 60 mins but am not really sure. The next thing that happened was 2 F15 eagles flew up and started climbing towards the object. At that point the object moved off at speeds that were far faster than that of the F15\"s trying to approach it. I have told few people but I was not the only witness. I pointed the object out to at least 4 other people at that time but they were in to much of a rush to watch the object, they would just comment how strange it looked"],"Object Flight Path":"Stationary","Case Number":"11616","files":["/var/www/straped/mufon/html2text/11616.html.txt","/var/www/straped/mufon/org/11616.html"],"Latitude":"44.604694","Date Submitted":"04/30/1987 01:30 UTC","Viewing Distance":"Unknown","Date of the Event":"04/30/1987 01:30 UTC","Object Shape":"Circle, Fireball, Star-like, Other","Region":"Ontario","Disposition":"Unresolved","Sighting Duration":"01:00:00","trends":["There have been 6 other sightings in Brockville","There were no other sightings in Brockville on or around April 30th 1987"],"Country":"Canada","City":"Brockville","Longitude":"-75.688282","Source":"MUFON","Summary":"It was a bright glowing colour and shape chaging object.","map":"<A HREF = \"http://maps.google.com/maps?q=44.604694,+-75.688282(11616)&iwloc=A&hl=en\"> mufon case (11616) map </A>","Object Features":"None"}