{"Object Shape":"Disc","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-82.362717","divs":["Sighting DetailsI was with a co-worker. We were working at the Ford Motor Lorain Assembly Plant. The line had gone down and they had sent us home early. We usually worked until 4:30 AM. This was around midnight. There wasn't much open late in those days and we couldn't sleep or watch TV when we got home so we decided to drive around in the country and kill a couple of hours. My friend, Terry Malich saw it first. He had just returned from Vietnam, where he had been an artillery spotter. We were driving on a backroad when he saw something from his side of the windshield I couldn't see due to the curvature of the windshield's upper corner on his side. He told me at first he thought it was the North Star but it appeared to jitter in his peripheral vision when he wasn't looking directly at it, and that got his attention. Then he saw it make an extremely high speed descent. At this point he said \"What's he doing here?\", as he knew the only aircraft that could descend that fasi was a Huey CobraJet, and he was wondering why a Huey was doing combat manuevers in a civilian airspace. As he was watching it descend, the object did a series of intense zig-zags that Terry said would have torn the wings off any traditional airborne fighter. At this point he began shouting and got very animated. I still couldn't see what he was talking about. We were approaching an S-curve lined with trees on either side and he began yelling at me to get through the trees so I could see it too. When we got through the S-curve I looked over at Terry. He didn't have to tell me what to look at. Past his face, about a quarter mile from the road, a large disc was hovering about 3-6 feet from the lines on some high tension towers. We got out of my car and stood there looking at it for a moment and I said,\"Let's go check it out.\" It must have been Spring, as the line of high tension towers were located in a farmer's field and the ground was roughly turned. It was most likely a moonlit night, as visibility, overall, was quite good. We walked across the field towards the object. I kept expecting it to turn into swamp gas, or a weather balloon, or other such nonsense the authorities expect people to believe. It didn't.... As we got closer I realized I was seeing something not of this world. Something we simply don't have the technology to create. It was a large disc, approximately 100-150 feet in diameter and at least 20 feet tall hovering dead silently by the high tension wires. It was remarkably, absolutely stable, as if on invisible columns. I had the impression it was refueling from the power lines in some way. It was a smooth, seamless, perfect disc with a row of segmented white lights around it's circumference. The segments were around the size of a cement block. The lights were white and stayed on all the time but they were flaring sequentially around the craft. The flare was brilliant, like an airport runway strobe. Occasionally a light would flare a blue-green or red-orange, but there was no discernable pattern to this. We got very close to the craft. As we approached it,I recall thinking,\" I could pick up one of these dirt clods from the ground and hit the side of it.\" That's when the gravity of the situation struck me. We were in the middle of nowhere, in the middle of the night, very close to a real UFO. And for the first time I felt someone was looking at us. I turned to Terry and said,\" I can't handle this.\" and he said, \"I can't either.\" and we turned around and walked back to the car. We sat on the fender of the car for 10 minutes or so and discussed what we were seeing. Eventually, the craft began to move. The acceleration was very slow, approximately 4 mph. What was striking was the grace of the motion when it began to move. I have never, to this day, seen a machine operate that smoothly. We watched it track the line of high tension towers (which went for miles in a swath cut through the woods and fields, until it was just a small flickering white light in the distance. We finally left and drove for most of the rest of the night talking about what we'd seen. I wanted to report it to the police, but Terry, having been freshly discharged from the Army, had a very low opinion of authority and said it would cause us countless problems, so we finally just went home."],"Summary":"large disc, 100-150 foot diameter, of burnished aluminum color, seamless with row of white lights aroung circumference that flared sequentially","Case Number":"11611","trends":["There have been 2 other sightings in Vermilion","There were no other sightings in Vermilion on or around April 30th 1973"],"files":["/var/www/straped/mufon/html2text/11611.html.txt","/var/www/straped/mufon/org/11611.html"],"Latitude":"41.427189","Date Submitted":"04/30/1973 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.427189,+-82.362717(11611)&iwloc=A&hl=en\"> mufon case (11611) map </A>","Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","Log Number":"US-07182008-0001","Disposition":"Unknown","Weather Factors":"None","Region":"Ohio","Date of the Event":"04/30/1973 12:00 UTC","City":"Vermilion","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON"}