{"map":"<A HREF = \"http://maps.google.com/maps?q=52.948136,+-73.547306(11614)&iwloc=A&hl=en\"> mufon case (11614) map </A>","Object Flight Path":"Undisclosed","Region":"Quebec","Date Submitted":"07/16/2008 05:02 UTC","Tags":"City","Weather Factors":"Unknown","Case Number":"11614","Latitude":"52.948136","divs":["Sighting Details The Early morning of july16 , i woke up at 4h50am planing doing a day fishing trip^with my friend. Like each day i go put my dog outside and check for the newspaper. but something caught my attention just over my neighbour house. its a red white glow star like, direction west,south-west. The size of the object is 25cen coin. its the only light on sky its a cloudy sunset morning so i could see any star in sky but i see that light away. i go inside take my cam put in on night vision mode and film it for about 3-4min. then i switch on normal mode to see difference between mode, suddendly the light fade, could see nothing. i run on my backyard with a large view north, north east. after 20-30sec off scanning the sky my ufo show back from a cloud become very bright only white this time.start moving up on the other cloud for hiding with a strange pattern a helicopter or plane cant do. i see nothing after that. with my job am doing about flying each year on chopper like Astar, md530 its not what i saw. if Someone around have seeing the same object please report it. its same to be all on north east cost."],"trends":["There have been no other sightings in 50km nord east , Maniwak","This sighting has never been favorited."],"Viewing Distance":"Unknown","Longitude":"-73.547306","City":"50km nord east , Maniwak","Object Features":"Undisclosed","Log Number":"CA-07182008-0004","Source":"MUFON","Summary":"Star-like ufo show up early before sunrise","Country":"Canada","Date of the Event":"07/16/2008 05:02 UTC","Disposition":"Unresolved","Object Shape":"Flash, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/11614.html.txt","/var/www/straped/mufon/org/11614.html"],"Sighting Duration":"Undisclosed"}