{"Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Object Shape":"Diamond","Source":"MUFON","Summary":"UFO flying high towards 413","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"11626","City":"Philadelphia","Latitude":"39.953485","Date of the Event":"07/16/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.953485,+-75.160479(11626)&iwloc=A&hl=en\"> mufon case (11626) map </A>","Object Features":"None","Log Number":"US-07192008-0004","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/11626.html.txt","/var/www/straped/mufon/org/11626.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","divs":["Sighting DetailsDriving down 413, I spotted a craft that seemed unusual. It was up in the sky coming from the left. I noticed that it had white lights in the front and it was flying towards me. As it got closer, I rolled down my window and noticed that it made no noise and as i watched it fly past me i could see the outline of the remainder of the craft behind the lights. And underneath the craft i could see a series of small red and white lights blinking. I tried to pull off to the side of the road to take a picture. However, by the time i did do that, the craft had flown over the trees and out of sight. I did however draw a sketch of what I saw. This was not the first time I had seen this craft in the same exact place. Four years prior, my daughter and I saw it around the same exact time at night on the same street. Except that time it was alot lower to the ground. While driving on the street, it looked as if we were driving towards stadium lights. They were very big and bright. We didn't hear any sound and it was hovering but moving very slowly. We pulled off the road to Buckingham Elementary School to investigate, but my daughter got kind of scared and convinced me to drive away. The other night I told my daughter that I had spotted the craft again in the same spot. And this actually triggered her to remember she had seen the same thing on the same night. However, she saw it on Burnt House Hill Road. She said when she was driving she noticed something flying slowly in the sky and described it looking almost like a submarine. It was dark out yet she could see the whole shape or the craft and noticed lights on it as well. She only stopped for a second to look at it because she was on the phone so she disregarded it. However, she said to the person on the phone \"What is that in the sky?\" She then asked her friend if he remembered her saying that that night, and he did."],"Date Submitted":"07/16/2008 09:30 UTC","Longitude":"-75.160479","trends":["There have been 216 other sightings in Philadelphia","There were 3 other sightings in Philadelphia on or around July 16th 2008"]}