{"Log Number":"US-07192008-0002","trends":["There have been 2 other sightings in Crestline","There were no other sightings in Crestline on or around May 3rd 2008"],"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"11624","Object Features":"Dome, Appendage(s), Other, Unknown","divs":["sighting detailsmy son and i were playing basketball in my parking large area. i have a great view of the sky amongst the many pine and oak trees in the mountains where i live. i often see ufo's at night but the particular one was in daylight and it is the first one i videotaped. my son spotted it first and directed my attention to it. he had seen several ufo's as well as my family. he asked what it was. it was studied it for a moment and new it was a ufo. it looked like two 1\\2 balls ontop each other with a very bright light dividing it. it was about 2:00 high and only about 6,000 to 8,000 feet above my house. it would have been a total of around 13,000 feet from sea level. i live about 5,500 feet in the san bernardino mountains. itseemed to float underneath a cloudlayer going west to east. i estimated, it to be aproximately 30 to 50 feet in circumference. at least it look that way at first until it started changing shape. then it flattend out some. i ran into the house to get my binoculars and video camera. i told my son to keep his eyes on it at all times while i did this. i was in the house for about a minute then ran out and looked to see it in my binoculars first. at that point the ufo traveled a good distance to the left and it was much smaller to the naked eye. i was dissapointed that i didn't have my camera sooner. in the binoculars it looked much different from when i first saw it. at first my son thought it was a giant hot air balloon because it has a dark middle and a dark bottom. i saw it the same way but it was perfectly round and had no bucket at the bottom whatsoever. it was a perfectly shaped sphere. the metal glowed from either itself or the reflection off the sun. because it was a little cloudy, i believe it glowed on its own accord. at times it looked like two ufo's, one on top of the other. i zoomed in on it with my video camera and began to tape it. i had trouble finding it again but then it came out of the clouds and i filmed it for about 6 seconds before it dissappeared into the cloud layer. it was deffinately was a silvery metalic on parts and the other parts looked like bright energy surges which exibited some unatural shapes. at one time it looked like a typical disk ufo with a domed top and domed bottom, then back to it's unusual shapes. when playing the tape in a frame by frame mode many details can be made out. it was amazing to say the least. i showed the tape to several people and they agree it was a ufo. i called bill ryan of ufo magazine and left several messages with him but he has not gotten back with me. this tape is as good as many other videos, perhaps better because it has target points of referrence. it also show clearly, it is not a balloon, plane , helicopter or anythang conventional. it made not sound and just seem to glide throught the sky.i have not been able to transfer the video to computer yet. i will attach a drawing of what it looked like when i first saw it. peter you have my # and left a message on my business phone. i have more other exciting stories to share with you if you like. one is a first hand account of a visit with two extraterestial beings that can be proven. my brother witnessed first hand the ufo's over the capital building while on vacation in new jersey in 1952. he had also seen severl others while in the army. my father has seen several and my mom has seen a ufo above our house in pennsylvania where i grew up. she said it looked like a chandlelair. my daughter at 3 years of age saw a blue disc shaped ufo fly right over our car. she said if she were 10 feet higher she could have touched it. she told me about it when it happened. i ran out but couldn't see anything. at 3 years old she said she could tell me in words what it was but that it was a large blue light coming down the street. later as an adult she was able to tell me exactly what she saw and this case is awesome because it had to do with warping the whole area around it as it came down the street. much more to these stories and others that will blow the average persons minds. i was fortunate enoungh to have had several encounters and then being aboard one with great conscience detail. i have also talked stanton friedman and preston dennett about some of them. they wanted my story but i was hesitant to give it because of possibly writing a book about it. don't know if that will work out without some professional help. dennett offered to help but i haven't pursued it yet. i saw your 2 hour show several times and was impressed to write to you. please call back if you would like more details or would like to view the video. it would be well worth the time."],"Weather Factors":"None","Object Shape":"Cylinder, Disc, Oval, Saturn-like, Sphere, Other, Unknown","Date of the Event":"05/03/2008 06:55 UTC","Latitude":"34.246921","Longitude":"-117.282219","Summary":"First spotted with my 14 year old son over our house. It started out spherical then morphed into different shapes. Very clear but looked like a combination of several other sightings. Very bright in some areas but metalic in others. No colored lights .","Region":"California","City":"Crestline","Viewing Distance":"Over One Mile","Date Submitted":"05/03/2008 06:55 UTC","Country":"United States","Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/11624.html.txt","/var/www/straped/mufon/org/11624.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.246921,+-117.282219(11624)&iwloc=A&hl=en\"> mufon case (11624) map </A>","Tags":"City"}