{"Disposition":"IFO","Case Number":"11623","City":"Undisclosed","Date Submitted":"06/22/2008 12:00 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.977999,+-99.900813(11623)&iwloc=A&hl=en\"> mufon case (11623) map </A>","files":["/var/www/straped/mufon/html2text/11623.html.txt","/var/www/straped/mufon/more/11623_submitter_file1__KZO_Flight_Germany_01.jpg","/var/www/straped/mufon/org/11623.html"],"Region":"Texas","Weather Factors":"Unknown","divs":["sighting detailson sun. june 22, 08 while at the beach in port aransas tx. i was setting in my car - as my 2 teens were playing in the sand. i was reading, and looked up > at one of the frequent times of glancing at the children, and saw coming from right to left - in a straight line down the coastline - going right over the childrens head\"s, a flying object - it moved slowly, and in a direct straight line - it made no noise. it was not a kite - or a remote controlled airplane, or craft\\glider. this was something quite different. this object looked exactly like the flying nuns hat off the old t.v. show \"the flying nun - from the 60's. type in the search bar...flying nun, and there you will see the shape of this object, (her hat). it was as an airplane like - but smaller, and as i watched it glyde past my childrens head and hover down the coastline, i honked to get the childrens attention, but they were some distance away, and with the waves crashing - they were unable to hear me, i got out of the car, and very rapidly began walking torward them, the object sped up, then... - it quickly vanished. all this happened within a minute or 2 at the most. this is a true story - no added details - or descriptions. i did not notice anyone looking up at this, as there were not many there, it was around 6:30 pm. i am very interested to find out what this may have been."],"Object Flight Path":"Path then hovering","Log Number":"US-07192008-0001","Latitude":"31.977999","Date of the Event":"06/22/2008 12:00 UTC","Longitude":"-99.900813","Tags":"City","trends":[""],"Source":"MUFON","Summary":"THIS LOOKED EXACTLY LIKE THE FLYING NUNS HAT - THE TV SHOW FROM THE 60'S","Sighting Duration":"00:02:00","Viewing Distance":"Unknown","Object Shape":"Other","Country":"United States"}