{"files":["/var/www/straped/mufon/html2text/11625.html.txt","/var/www/straped/mufon/org/11625.html"],"Object Shape":"Triangle","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around May 21st 1998"],"Summary":"ufo sighting between santa rosa and calistoga on mark west springs rd.","Disposition":"Hoax","Tags":"City","Source":"MUFON","Case Number":"11625","Region":"California","Date of the Event":"05/21/1998 09:30 UTC","Longitude":"-122.709971","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsmay 1996 on mark west springs rd I was driving in my car when an odd looking red glowing light low above a yellow globe of pulsating light. A black triangle was cut out of the dark sky .Ring of lights on the ship were different colors such as lavender, lime green, metalic beige, silvery grey and specrum of colors which defy description. Small flashes and sparking zig zag lights of reddish purple, black light hue and something resembling a camera flashed an eerie welding type light.It turn an inky black and then white neon like ring appeared on the bottom. then it blinked of within 2 seconds a theta shaped symbol blinked on. The ships size was 100 feet long. I could see a rectangular shape with rows of soft subdued lights barely visible to the naked eye. Another ship appeared at 4:00 which was searching thru the trees lighting up a small area with sparkle dust and some of those purple and red black light cameras were sputtering off and on. when I intially saw this I thought a bug had spattered on my car window. when I crested the hill into Calistoga I lost sight of it. I was angry that such infomation is obviously known and kept from the public by the powers that control our world."],"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Other","Log Number":"US-07192008-0003","Latitude":"38.447217","map":"<A HREF = \"http://maps.google.com/maps?q=38.447217,+-122.709971(11625)&iwloc=A&hl=en\"> mufon case (11625) map </A>","Object Flight Path":"Path with directional change","City":"Santa Rosa","Weather Factors":"Unknown","Date Submitted":"05/21/1998 09:30 UTC"}