{"map":"<A HREF = \"http://maps.google.com/maps?q=42.590914,+-73.701786(11627)&iwloc=A&hl=en\"> mufon case (11627) map </A>","trends":["There have been no other sightings in East Greenbush","This sighting has never been favorited."],"Region":"New York","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None","Disposition":"Unresolved","Object Features":"None","Date Submitted":"06/24/2008 10:15 UTC","Source":"MUFON","Summary":"2 events - meteorish but not quite","Country":"United States","Object Flight Path":"Path with directional change","Case Number":"11627","Log Number":"US-07192008-0005","Latitude":"42.590914","Longitude":"-73.701786","divs":["Sighting Details1st - driving west on route 151 approaching Elliot Rd. at the horizon moving south to north was a very bright, too fast to be a plane, light. Approximately 500 to 1000 ft up. Looked to be close enough to be crossing Luther rd itself, but may've been a trick of perspective and was actually farther away. If that is the case then the object obviously had to be moving even faster than it appeared. One witness. 2nd - Approximately between midnight and 1 a.m. Behind Quigley's restaurant in East Greenbush NY on routes 9 and 20 (after only having one beer). Again, object moving South to North directly overhead. Meteor or comet style of movement without a tail. Very bright, white and green with a \"burning\" type of look to it as if it was something that burned green as it entered the atmosphere. (Copper? Magnesium?) Arcing type of movement--it WAS however moving away from us--it was a very large ball. As it neared the end of it's path it gave the impression of turning, then disappeared. I'd venture an altitude of less than 2000 ft. with a duration of 2-4 seconds. Two witnesses, we were talking behind the bar when I caught the movement out of the corner of my eye as the object came into view above the roof of the building. I turned quickly to follow it's path, exclaiming \"What the hell is that?!\" Other witness stood there, mouth agape, reacted once it disappeared. I Know the Bootid meteor shower was scheduled for two days later, but green is a color I was not accustomed to seeing. that and the altitude of these events seemed incongruous to a shower."],"Viewing Distance":"Unknown","Date of the Event":"06/24/2008 10:15 UTC","files":["/var/www/straped/mufon/html2text/11627.html.txt","/var/www/straped/mufon/org/11627.html"],"Object Shape":"Sphere, Other","City":"East Greenbush"}