{"Object Flight Path":"Stationary,Path with directional change","trends":["There has been one other sighting in Chapleau","There were no other sightings in Chapleau on or around August 22nd 2007"],"Date of the Event":"08/22/2007 11:00 UTC","files":["/var/www/straped/mufon/html2text/11631.html.txt","/var/www/straped/mufon/org/11631.html"],"Country":"Canada","Source":"MUFON","Disposition":"Unresolved","Tags":"City","City":"Chapleau","Object Shape":"Circle","Region":"Ontario","Summary":"I was hitting the lights across the lake with my pen laser for about an hour, then they came to our camp.","Log Number":"CA-07192008-0009","map":"<A HREF = \"http://maps.google.com/maps?q=47.844487,+-83.404365(11631)&iwloc=A&hl=en\"> mufon case (11631) map </A>","Object Features":"None","Date Submitted":"08/22/2007 11:00 UTC","Latitude":"47.844487","Longitude":"-83.404365","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsFrom the beginning...we went camping in deep northern ontario. At dusk, I took out the camera and tried to get some pics of the fire and perhaps some strange shapes in the fire. Took a few pics and some around the camp site, then put the camera away. About an hour later, I saw some strange lights across the lake. The lights were strange because there is nothing on the other side of the lake and all the boats were in. The lights were just above the tree line on the other side of the lake. I watched them dance around for awhile, then took out the laser pen and they seem to be responding to it. I would get an occasional flash of green light back at me like a laser. There was no sound. I was playing with the lights for about an hour and then went to bed. I quickly fell asleep and my wife says shortly thereafter, the tent was lit up with lights. Indeed the entire camp site was lit up. The next morning I asked the park warden, what was on the other side of the lake. He said nothing and nobody was on the other side of the lake. There is no developement, roads, or towers on the other side of the lake. I asked if anyone was hiking around the lake. He said absolutely not. The trail that goes around the lake takes about a week to ten days to travel and anyone attempting to take this trail, MUST report to the park warden before attempting it. Nobody would dare attempt this trail without letting other folks know where they are. After we arrived home, I downloaded the vacation pictures on the computer and to my surprise, I actually got a picture of the lights. I was totally amazed since I never tried to actually get the picture, i just got luckey. We have reserved our same spot on the same day, (aug.22) in the hopes of seeing the strange lights again. This next time we are bringing, not only the camera, but the telescope, and binoculars, and tape recorder. If you can advise me what else would be good to take, i would greatly appriciate it. You are also invited to join us if you like. Bring your own tent. :) P.S. contact me if you would like to view the pic i got from last year."],"Case Number":"11631","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile"}