{"Source":"MUFON","City":"Redford","files":["/var/www/straped/mufon/html2text/11633.html.txt","/var/www/straped/mufon/more/11633_submitter_file1__CIMG9796.JPG","/var/www/straped/mufon/org/11633.html"],"Log Number":"US-07192008-0011","Case Number":"11633","Latitude":"42.38337","map":"<A HREF = \"http://maps.google.com/maps?q=42.38337,+-83.296597(11633)&iwloc=A&hl=en\"> mufon case (11633) map </A>","Summary":"Stationary Starlike Object Moves Across Sky Then Dims Out","Date Submitted":"07/14/2008 11:14 UTC","Sighting Duration":"00:07:00","Longitude":"-83.296597","Weather Factors":"None","Date of the Event":"07/14/2008 11:14 UTC","Country":"United States","divs":["Sighting DetailsOn July 14th 2008 around 11:45p.m. my girlfriend and I were outside in my backyard on my deck smoking a cigarette and just basically looking at the stars in the night sky. We were facing west when a star in the southern part of the sky caught my attention, it appeared to me to be moving all of sudden. I asked my girlfriend if she could see it moving and she agreed that it was. I first thought it may be a satellite, the star like object began moving north, at this point from my viewpoint it was like 3 or 4 houses down from my backyard. I then told my girlfriend to keep an eye on it as I was going to run and get the camera. When I returned outside the object was now directly over my house, I snapped about 7 pictures using a Casio Exilim 7.2 Mega Pixel camera hoping to catch the object. I also took a short movie after pictures hoping to catch this on film. At that point the star like object either disappeared, or went like back up into space, because as soon as I began to take the pictures the star like object dimmed out, basically like someone just unscrewed a light bulb is the best way I can describe it. We then both noticed that there were random flashes in the sky, one to west, one to the north and then one the south, around the same part of the sky above that we had just witnessed this star like object just fizzle out. Then searching the sky in hopes of seeing the object again, I witnessed a shooting star. 3 anomalies in time span of about 7 minutes. We then went through the pictures and the movie and discovered that we did catch something on one of the pictures but none of the rest or the movie. I have no idea what it is. In the picture, the star like object is middle left. A normal star is seen in the picture on the lower right."],"Object Features":"None","Viewing Distance":"Unknown","Tags":"City","trends":["There have been 2 other sightings in Redford","There were no other sightings in Redford on or around July 14th 2008","This sighting has never been favorited.",""],"Object Shape":"Circle, Flash, Star-like","Region":"Michigan","Disposition":"Unknown","Object Flight Path":"Stationary,Straight-line path"}