{"map":"<A HREF = \"http://maps.google.com/maps?q=40.560036,+-85.601004(11643)&iwloc=A&hl=en\"> mufon case (11643) map </A>","Date Submitted":"07/31/1968 12:00 UTC","Object Shape":"Cylinder, Fireball, Star-like","Date of the Event":"07/31/1968 12:00 UTC","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/11643.html.txt","/var/www/straped/mufon/org/11643.html"],"Longitude":"-85.601004","trends":[],"divs":["Sighting DetailsI am belatedly (for sure) reporting this, but I am doing so now because a) it was the most remarkable thing that I have seen in my lifetime of 67 years, b) I haven't been able to locate any other references to it having been seen by others, and c) it has continued to perplex me for years. My wife and I were outside our home at dusk (not dark) in Thorntown, Indiana in August of, I believe 1968, when we saw an orange, glowing object in the distance northeast of us (toward Kokomo). As we watched, the object started zigzagging across the sky at extremely rapid speeds. It was obvious that the object was at a considerable distance from us, and the rapid changes in direction and the speed of transit were incredibly and incomprehensibly fast. We watched for several minutes as the object got closer to us, and, remarkably, went almost directly overhead at a low altitude as might be expected of a light plane. As the object moved over us, its color shifted from orange to a yellowish-orange and the appearance changed from a glowing object to a noticeably larger circle which could best be described as \"looking into a jet engine exhaust\" at relatively close range. Up to that point the object had been noiseless, but some seconds after it had passed overhead, a sound comparable to that of a jet engine was heard. The object subsequently disappeared rather quickly into the distance. At no point was there any object definition. Although I would trust that the description above would reveal this, any speculation that this was some sort of light phenomenon would be completely inconsistent with what was seen. As I recall, there was either no, or minimal, mention of this in the newspapers at the time. I recall reporting this to either Bunker Hill AFB or Blue Book (it's been a while), but no-one ever followed up with me. I'm a scientist and would expect there to be a logical explanation of this phenomenon (if not \"perfectly\" logical). I have described this phenomenon to a few people who appear to accept it as objective fact, but, at the same time, it's obvious that it is difficult to appreciate the remarkable nature of this incident unless you were there. I've looked for similar reports, but I haven't really found any."],"Tags":"City","Viewing Distance":"101-500 Feet, Over 1 Mile","Summary":"Orange, glowing, darting object at a distance flew overhead, changed appearance, and souned like jet thereafter.","Source":"MUFON","Case Number":"11643","Disposition":"Unknown","Log Number":"US-07202008-0005","Latitude":"40.560036","Region":"Indiana","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown"}