{"Longitude":"-87.813948","Disposition":"Insufficient Data","divs":["sighting detailsi was practicing karate on my patio. i stopped for a minute or two. i typically see a lot of commercial air traffic from o'hare. but, this time i look in the south sky and see what appears to be a star moving south to north at the speed of a jet. it was very, very high. it was about 60 degrees south when i first saw it and i watch it till it was directly above me, which is when i lost sight of it. i continued watching for it to reappear just north of where i lost sight of it. but after about two\\three minutes of scanning the sky, it was nowhere to be seen. then i started working out again. after about five minutes, i looked up at that last spot again and there it was, again traveling directly north, till it very slightly turned west. it was way to high to expect to hear any sound. i'm very surprised that i didn't find it again far north in the sky. instead, i found it to reappear just north of where i initially lost sight of it. do satellites stop? do high flying military planes, turn off their lights, circle for several minutes and then turn their lights on again and resume course? this would be a likely explanation. i do not think the light looked like an airplane light. it looked like a star."],"Object Shape":"Star-like","Log Number":"US-07202008-0008","Weather Factors":"Unknown","Summary":"traveled south to north, disappeared and was visible several minutes later from last visible spot","trends":["There have been 2 other sightings in River Forest","There were no other sightings in River Forest on or around July 19th 2008"],"Object Features":"Unknown","Tags":"City","Date Submitted":"07/19/2008 09:30 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","Date of the Event":"07/19/2008 09:30 UTC","Case Number":"11646","map":"<A HREF = \"http://maps.google.com/maps?q=41.897809,+-87.813948(11646)&iwloc=A&hl=en\"> mufon case (11646) map </A>","Latitude":"41.897809","Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Illinois","files":["/var/www/straped/mufon/html2text/11646.html.txt","/var/www/straped/mufon/org/11646.html"],"City":"River Forest"}