{"trends":["There has been one other sighting in Linesville","There were no other sightings in Linesville on or around November 30th 1973"],"Tags":"City","Date Submitted":"11/30/1973 12:00 UTC","files":["/var/www/straped/mufon/html2text/11641.html.txt","/var/www/straped/mufon/org/11641.html"],"Sighting Duration":"Undisclosed","City":"Linesville","Case Number":"11641","Latitude":"41.656166","Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=41.656166,+-80.423956(11641)&iwloc=A&hl=en\"> mufon case (11641) map </A>","divs":["Sighting Details We were on a country road selling a microwave oven to a customer when Dan asked me to go out to the car and fetch his briefcase. When I exited the house a car was stopped on the road with a female occupant stareing in my direction. I walked up to her car and she was looking through me like I wasn't there. I turned and about 200 yards was a disc metallic object hovering just above the tree line. I leaned against her car and was observing it for about 7-10 minutes. Dan cracked the door, and hollerred for his demo case. I took it in and when we were done he said, what was I doing and I told him I was watching a flying saucer. He laughed, he thought I was flirting with that woman. Later Ed and I were in the same area, and we found an airstrip on a country road surrounded by razor wire and even a tower. I realy feel it is kept there. I couldn't even find the strip on google earth. So I know in Crawford county Pa there is an installation that dosen't exist, which should be looked into. Someone spent one hell of alot of money if it is private. Why the razor wire? I heared somewhere in southern Pa was ufo deal. I know what I saw, and I was stone sober, and it was a clear day. JH"],"Longitude":"-80.423956","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07202008-0003","Summary":"clear visibilty/ other witness/ hovered/ silent.","Disposition":"Insufficient Data","Object Shape":"Disc","Region":"Pennsylvania","Country":"United States","Date of the Event":"11/30/1973 12:00 UTC"}