{"Case Number":"11640","Sighting Duration":"00:35:29","Tags":"City","Object Shape":"Circle","Log Number":"US-07202008-0002","Object Features":"None","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/11640.html.txt","/var/www/straped/mufon/org/11640.html"],"Region":"Arizona","Latitude":"34.545144","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband was walking up the driveway after opening the gate for our room-mate to come onto our property after work. He always looks up at the sky at night and these \"lights\" caught his eye. He called me outside at 11:26 PM to point out to me that there were 3 differt objects in the sky. They were going in circles, up, down, zig-zagging, in close, out far, left to right all at an incredible speed. We could also see lights fading in and out. Bright white, green, red, yellow and blue. We talked about it being an airplane, helicopter or weather ballon but knew that there was NO WAY that anything man-made could travel like these were. We watched it until our room-mate got home about 18 minutes later and pointed it out to her to see if she could see them too, she saw them immediately. We watched for another 11 minutes or so and they started to fade as if they were travelling away from us again at a high rate of speed. Then, they were gone. We felt excited, scared and knew that nobody would believe us. We even talked about being abducted and loosing time. Nothing could have changed direction as fast as these objects did. We have had other sightings in our area but none as long as this lasted. We have giant power lines just east of our home that run from Phoenix to Las Vegas with Hoover Dam in the middle. There is an incredible amount of electricity in these lines. Enough so you can hear the electricity travelling through them. People have said that the UFOs come so they can drain power from these lines. It is not the first time we have seen this and it probably won't be the last. We don't have a video camera so there are no pictures."],"Source":"MUFON","City":"Prescott","Date Submitted":"07/19/2008 11:26 UTC","trends":["There have been 25 other sightings in Prescott","There was one other sighting in Prescott on or around July 19th 2008"],"Longitude":"-112.464712","Summary":"Saw 3 objects going in all different directions at a high rate of speed. Distinct patterns.","Country":"United States","Date of the Event":"07/19/2008 11:26 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.545144,+-112.464712(11640)&iwloc=A&hl=en\"> mufon case (11640) map </A>"}