{"Object Features":"None","divs":["sighting detailsi was driving north bound on hoover rd in or around sterling heights warren area north of 12 mile when i saw an object moving west to east that was rectangular and greyish looked like it was wider at one point than another. i could see wisps of clouds moving by the object but i did not see anything in front of this object. the object looked at least 80 fot long perhaps over 150ft long. my daughter was in the car as well but saw the object at a more oblique angle and only for an instant. the object appeared to be moving about 100mph perhaps more, but it was hard to tell. the object was about 3\\4 the size of a crayon held at arms length, a little bit fatter though, and more angular and no sharp point. it was early afternoon and there were lots of people driving about. someone else had to see this better than we. my first thought was that this was a plane pulling an aerial banner, that was greyish, and the pilot thought he would be sneaky and fly his plane just inside the cloud cover, towing the banner behind him hanging under the clouds, so that it looked like the banner was floating in mid-air. i checked out aerial advertising companies and many had a clause of bad weather, or bad flight days, and how they would not fly a banner on those days and waste the advertising dollars. it looked like the ufo had a three dimensional quality to it though, like it wasnt a banner. on the otherhand, the object was slightly tilted up. planes that tow banners are above and of course in front of the object, so if the plane was in the clouds the banner might look like it was moving under its own power. i did not see any cables and since i was in my car i could not tell if it made any noise. if this was an aerial banner and i was the advertiser, i would be upset that my banner was flown quite low and pretty much in the clouds. maybe some crack mufon investigator could find out whether this was an aerial banner or not, because if it wasnt being towed by an airplane, we have nothing in civilian or military aircraft that look ever remotely like this object. it looked the size a flying grey duplex apartment building. this one might be easy to solve or perplexing if no aerial banners were flown on that day. it would take some phone calls to figure out what this was, and i would feel wierd about calling a company asking them for info they might not want to divulge, especially to some civilian who thought he saw a ufo. if anyone else saw this on the day and hour in question, report what you saw!"],"Log Number":"US-07202008-0006","Case Number":"11644","files":["/var/www/straped/mufon/html2text/11644.html.txt","/var/www/straped/mufon/org/11644.html"],"trends":["There have been 13 other sightings in Sterling Heights","There were no other sightings in Sterling Heights on or around July 19th 2008"],"Tags":"City","Longitude":"-83.030203","Source":"MUFON","Date Submitted":"07/19/2008 12:42 UTC","Date of the Event":"07/19/2008 12:42 UTC","City":"Sterling Heights","Viewing Distance":"Over One Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.580312,+-83.030203(11644)&iwloc=A&hl=en\"> mufon case (11644) map </A>","Object Shape":"Square, Rectagular","Region":"Michigan","Summary":"UFO or aerial banner on a cloudy overcast day?","Object Flight Path":"Straight-line path","Weather Factors":"None","Disposition":"Unknown","Sighting Duration":"00:00:10","Latitude":"42.580312"}