{"Country":"United Kingdom","Object Shape":"Sphere, Star-like","Object Features":"Undisclosed","Date Submitted":"07/19/2008 11:15 UTC","Longitude":"-2.698444","Log Number":"GB-07202008-0012","Weather Factors":"Unknown","Sighting Duration":"01:00:00","Object Flight Path":"Undisclosed","City":"Avonmouth","Date of the Event":"07/19/2008 11:15 UTC","Latitude":"51.503457","Tags":"City","divs":["sighting details1 sometimes 2 red glowing and pulsating objects near bristol\\avonmouth. visible from south wales, these objects were just red pulsating glowing sphere looking. seemed to move across and up in roughly 5-10 minute loops, seemed to also move further away as each reached greater altitude. occasional cloud cover and strong moon in backdrop has made videoing poor quality, and sadly i didn't think of getting any camera pics, but very eery to watch. only sort of explanation i could think of was some helicopters but they surely don't just glow red - all over and definitely not with the luminesence that these constantly had! circling formation was made by both, but one object was mainly observed. distance of circling probably several miles. distance away - a guess would be anywhere from perhaps 10miles south east of caldicot area. circling motion was smooth, not any rapid movements or spurts and in a east to west motion and climbing up and slightly away from me before vanishing, reappearing again from the east - obscurred by nearby rooftop of a house."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/11650.html.txt","/var/www/straped/mufon/org/11650.html"],"Source":"MUFON","Case Number":"11650","Viewing Distance":"Unknown","trends":["There have been no other sightings in Avonmouth","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.503457,+-2.698444(11650)&iwloc=A&hl=en\"> mufon case (11650) map </A>","Summary":"1 sometimes 2 red glowing and pulsating objects Near Bristol/avonmouth area for up to 1hour","Region":"England"}