{"Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Latitude":"36.784811","Country":"United States","Longitude":"-119.410922","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.784811,+-119.410922(11656)&iwloc=A&hl=en\"> mufon case (11656) map </A>","Date Submitted":"07/18/2008 12:00 UTC","Date of the Event":"07/18/2008 12:00 UTC","trends":[],"Summary":"occuring nightly and many, many moving, dashing stars","Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsJust east of downtown, moving stars are a given. I can also see silvery images during the day. They appear connected to Mt. Wilson as when it is lit up there is heavy activity and conversely no activity when Wilson looks dormant. Also red and blue swaths of light flash eerily in the sky. There are over 50 everynight. I can't believe no one else is seeing this. I had a friend watch with me and confirmed that I wasn't seeing things. The first time, about a month ago, I made a serious attempt to stay focused on these star like objects a helicopter flew right over me not more than 75 feet off the ground. I ran in the house and the copter circled the house and shone its spotlight in my windows, then left. When commercial airlines fly over, the lights flash 100 % of the time and seem to lead the aircraft across the San Gabriel mountains. I feel this activity is not unidentified; I think it is US Military and the problem with this is that the military and our representatives in government has not informed the public. Due to this sentivity I will not provide ANY information about me or specific local. If you go outside and see a mass of stars, know that in itself is unusial for LA. Once you've seen a star disappear or flash like a shooting star, keep scanning the sky as there are many of them in the air."],"Disposition":"IFO","Source":"MUFON","Object Shape":"Fireball, Star-like","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/11656.html.txt","/var/www/straped/mufon/org/11656.html"],"City":"Undisclosed","Case Number":"11656","Log Number":"US-07212008-0001"}