{"trends":["There has been one other sighting in Port Hardy","There were no other sightings in Port Hardy on or around"],"Case Number":"11651","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"beam of light...","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=50.728661,+-127.483319(11651)&iwloc=A&hl=en\"> mufon case (11651) map </A>","files":["/var/www/straped/mufon/html2text/11651.html.txt","/var/www/straped/mufon/org/11651.html"],"City":"Port Hardy","Object Shape":"Fireball, Flash, Other","Longitude":"-127.483319","Tags":"City","Viewing Distance":"Unknown","Latitude":"50.728661","Date Submitted":"07/20/2008 06:20 UTC","divs":["Sighting Details I was hitch hiking and I looked to my south above the airport and seen this massive slow motion beam of light coming down.It's like putting a flashlight downward.Quite big.Suddenly is stopped.Strobbing lites and all floating sideways behind the trees.I stood there watching until it was behind some trees and couldn't see it again.This sort of beam of light just stopped and just started to float sideways. I am a native american and we are a easy target for being make fun of. Like being ridicule.I was a blacksheep of the family and who would believe me anyways? I started to have this thing you call lucid dreams.Like flying.I was in complete control by these flying dreams.I didn't know what they were and how I kept this to myself for who would listen to me anyways?This went on for several weeks this dreams of flying.Then my dreams came in. I dreamt I was running towards the fench in slow motion.There's this little drawf or little man sitting on a small boulder with the hands wrapped around his knees.He wsa aq little critter I say.He was behind some four feet stinging nettles.This little critter seen me and with a flash he just got up and ran real fast.I tried to chase him and I placed my hands inside the stinging nettles without and stinging at all.Finally I came to the fench which is about 8feet tall.Couple inches apart.There's a beam of light glowing from the inside the fench.It was was strobbing and blinking. That's when I woke up. I never told anyone about this until now you guys.I believe I've being abducted and implanted,not sure.I am not sure, because when I froze in my sleep paralyses I couldn't move.But there's this beam of light that glowed as they treated me like a baby with my feet in front of my face.That's the beam they gave me. This happened to me when I was around 11 years old maybe younger.I just didn't know what to do with this and didn't know what to say.So there you are.That's me and I am an artist and I now draw aliens creatures skeletals bones how they look like.very egg like skeletal and protected by this massive protective skin.Solid skin.They can not breath within our atmoshere for thier noses are not made that way.They need to keep polluting our atmosphere to survive.They are underground beings and very blinded by the light like snakes.They are not to be trusted for they are ruining our future.They tell me they are coming back to try and straighten out for they are not suppose to be here within us.They have broken the rules of the galaxly chambers laws.They come back to try and save for what they've taught us to learn to ruin our atomsphere.Now it's to late to turn back the clock.2012 will be the waring sign for them to create the Anti Christ to save the world and guide your future in a wrong direction.The savior will be advising us to prepare for that coming to pass.He will guide us from them to do implant against us.The beast 666 will be stopped......... p.s.can you sent me this story to me?? Cat Thunder www.google.com [sky-lite-stencils] Native Art"],"Disposition":"Unresolved","Source":"MUFON","Log Number":"CA-07202008-0013","Date of the Event":"Unknown","Region":"British Columbia"}