{"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.801125,+-71.21923(11665)&iwloc=A&hl=en\"> mufon case (11665) map </A>","Case Number":"11665","Date of the Event":"07/06/2008 12:00 UTC","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-07212008-0010","Source":"MUFON","Object Features":"Undisclosed","Latitude":"42.801125","trends":["There have been 6 other sightings in Salem","There were no other sightings in Salem on or around July 6th 2008"],"Disposition":"Unknown","Summary":"Silver ball bearing, several miles in the sky","Object Shape":"Circle","Date Submitted":"07/06/2008 12:00 UTC","Region":"New Hampshire","divs":["Sighting DetailsI was laying on a lawn chair in the backyard in Windham NH. It was a beautiful day, the sky was a deep blue and the clouds were few and far between. I was staring up in the sky specifically looking for any odd craft like objects which I have done many times before. I could see typical airplanes fly by periodically. All of a sudden my eyes caught the object, it was like a small silver ball bearing, it wasnt moving. It was very high in the sky, further than any of the planes that I saw. It must of been several miles up. It didnt move at all. I looked around to see if there were any stars out but it was the middle of tha day, there were no stars. I could see regular airplanes and they were moving, this object was not. Maybe it was a satelite? Anyway, i watched it for about 10 minutes. Some clouds came by and covered the object, when the clouds disappeared it was gone. I layed there and look for it for another 15 to 20 minutes. It was gone. Then after about 20 minutes it reappeared just a little further south east. It stayed in the sky for several minutes and then was covered by clouds, I didnt see it again."],"files":["/var/www/straped/mufon/html2text/11665.html.txt","/var/www/straped/mufon/org/11665.html"],"Sighting Duration":"Undisclosed","City":"Salem","Longitude":"-71.21923"}