{"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.628393,+-84.159382(1167)&iwloc=A&hl=en\"> mufon case (1167) map </A>","City":"Centerville","files":["/var/www/straped/mufon/html2text/1167.html.txt","/var/www/straped/mufon/mufon_json/1167.json","/var/www/straped/mufon/org/1167.html"],"Tags":"City","Longitude":"-84.159382","divs":["sighting detailslegacy report entered by mufon of oh. on sat, 10\\21\\78, at 3 p.m., a 40-year-old man -- who had a private pilotslicense -- was working in his front yard in a suburban subdivision incenterville, oh when he noticed some vapor trails across the sky. it was a clearfall day with one high layer of cirrus clouds estimated at 40,000 ft. out of thecorner of his eye he saw a tiny ball, shiny like chrome, coming from the n atabout 35,000 ft. \"then the object turned a flew above and on the other side ofthe vapor trail.... as it flew along east, it turned color to a flat white. thenit stopped and turned gray and all this time i was yelling for my wife to bringme the binoculars.\"he did not locate the object through the binoculars, but re-established visualcontact. when the object stopped, \"it turned more of a flat gray color. ithovered there for...a minute....then it just took off right straight up and itwent right through this high layer of cirrus clouds...and then it was gone.\"when asked if the vapor trails looked fresh, the witness stated that as a pilothe could tell the difference between fresh and old vapor trails. \"the vaportrails werent new...they were getting puffy. they were up there real high aboutthe size of a dc-9 or a lear jet. on my sighting a helicopter cant do what isaw and a seather balloon cant do what i saw and an airplane cant do it.\" thewitness stated there was no vapor trail from the object and no sound from it."],"Sighting Duration":"00:05:00","Log Number":"","trends":["There have been 5 other sightings in Centerville","There were no other sightings in Centerville on or around October 21st 1978"],"Disposition":"Unresolved","Country":"United States","Date of the Event":"10/21/1978 03:00 UTC","Source":"MUFON","Object Shape":"Sphere","Object Features":"Undisclosed","Region":"Ohio","Summary":"Pilot saw sphere change color/direction, hover, as","Weather Factors":"Unknown","Date Submitted":"10/21/1978 03:00 UTC","Viewing Distance":"Over One Mile","Case Number":"1167","Latitude":"39.628393"}