{"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=45.497012,+-122.79898(11679)&iwloc=A&hl=en\"> mufon case (11679) map </A>","Region":"Oregon","Case Number":"11679","Date Submitted":"07/22/2008 10:15 UTC","Weather Factors":"Does Not Apply","Object Shape":"Cigar","Tags":"City","Object Features":"Other","Source":"MUFON","Summary":"cigar shaped craft with blue light in front and white light in back, traveling below cloud cover.","Latitude":"45.497012","files":["/var/www/straped/mufon/html2text/11679.html.txt","/var/www/straped/mufon/org/11679.html"],"Sighting Duration":"00:00:07","Viewing Distance":"101-500 Feet","Country":"United States","trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around July 22nd 2008"],"divs":["Sighting Details As I sat on my deck of my apartment building, talking to my sister on the phone,I saw a large cigar shaped craft with points on front and back,with no wings, no tail speeding across the sky heading s.e. It had a blue light on the front and a white light on the back and the body seemed to be whitish or silver. it made a funny motor like noise. I am certain it was not a helicopter, it was easy to see and it definetly looked like a cigar with points. and flying way faster than a helicopter. I live in a vally almost at sea level and the cloud cover is always very high up the object was below the clouds and would mesure an inch or inch and one half in the sky so it must have been very large, possibly 50 to 100 ft. long. this is somthing like I've never seen. I told my sister about it as I was seeing it. It totally stopped our conversation as I described what was happening. The object flew off out of my eye sight within 5 or 6 seconds, then she told me that she could report it for me on her computer. I was on the phone telling her this report as she typed it into your web sight."],"Date of the Event":"07/22/2008 10:15 UTC","Log Number":"US-07232008-0005","City":"Beaverton","Object Flight Path":"Straight-line path","Longitude":"-122.79898"}