{"Weather Factors":"Windy, Lightning, Light","divs":["Sighting Details The night of july 22nd at 9:50pm my son and I were getting out of our vehicle and on our way to do some Flounder \"gigging\". Out over the Gulf of Mexico a storm was releasing a display of lightning, and that is what initally caught my attention. Not giving it much thought I proceeded to take our lantern and gig from the vehicle. Walking tward the water we set off and as we looked forward another light in the sky caught our attention. My six year old automatically recognized what we were looking at as not being something \"normal\" and said \"Daddy, is THAT a UFO!?\" For about 15 or 20 seconds we watched what looked to me like 5 glowing red balls of light trailing each other in a close formation traveling in a northward direction which was in the direction we were in as we were facing to the south walking to the water from the beach. Then as quick as they appeared, they vanished. To my suprise, neither one of us were scared. Felt sort of an \"enlightning\" feeling."],"Disposition":"Unknown","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=30.315286,+-89.324602(11677)&iwloc=A&hl=en\"> mufon case (11677) map </A>","Source":"MUFON","Date of the Event":"07/22/2008 09:50 UTC","Tags":"City","City":"Bay St Louis","Object Flight Path":"Straight-line path","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-89.324602","files":["/var/www/straped/mufon/html2text/11677.html.txt","/var/www/straped/mufon/org/11677.html"],"Latitude":"30.315286","Date Submitted":"07/22/2008 09:50 UTC","Sighting Duration":"00:00:20","Country":"United States","Object Shape":"Fireball, Flash","Case Number":"11677","Log Number":"US-07232008-0003","Summary":"looking into the night sky, I saw a series of lights that appeared to be in a line,and in a close formation","trends":["There have been 2 other sightings in Bay St Louis","There were no other sightings in Bay St Louis on or around July 22nd 2008"]}