{"Source":"MUFON","Case Number":"11675","files":["/var/www/straped/mufon/html2text/11675.html.txt","/var/www/straped/mufon/org/11675.html"],"Disposition":"Unknown","Longitude":"-85.377478","map":"<A HREF = \"http://maps.google.com/maps?q=38.745113,+-85.377478(11675)&iwloc=A&hl=en\"> mufon case (11675) map </A>","Sighting Duration":"Undisclosed","Tags":"City","City":"Madison","trends":["There have been 4 other sightings in Madison","There were no other sightings in Madison on or around November 30th 1969","This sighting has never been favorited.",""],"Date Submitted":"11/30/1969 12:00 UTC","Date of the Event":"11/30/1969 12:00 UTC","Log Number":"US-07232008-0001","Latitude":"38.745113","Summary":"LARGE domed circular windowed object","Region":"Indiana","Object Features":"Window(s)","Country":"United States","divs":["Sighting DetailsI have never in all these years, reported this. A friend and I were sleeping on lawn chairs in her backyard, in a subdivision. It was a thing we did in this small Indian town. We were \"camping out.\" I was 14 or 15. (1968. We were tired and 'called it a night.\" I said, \"Good night\" to my friend. As I rolled to one side to get ready for sleep, I could see the street light over the street. I saw something I couldn't comprehend then, nor can I now. There was a huge circular \"ship\" over the street hovering. I couldn't speak, yet I found myself saying aloud \"Oh. God\"! It hovered there. I don't know how long. It was as large as a house, maybe larger. It was circular and had rectangular windows, where I felt that someone was watching me. I swear to God, I saw \"them\". I don't know how long it was there, but the next thing I heard my friend say was, \"It's alright, They're gone.\" I have NEVER EVER reported this. I don't want anyone to think I'm \"nuts.\" I don't want to embarrass my family, and I am an educator, so I must be careful to not say anything that would damage my reputation. I have a letter to Mr. Budd Hopkins, in the event of my death, however I don't really know how to reach him. At this time, I was a naive child, and had never thought of UFOs, nor would I have believed in such a thing. I had necer been exposed to ANY infor When I went home, down the street to my house. after the sun came up, I told my mom kinda' what had hapened, and she said, \"I believe you.\" \"I was listening to the radio, and UFOs were reported over Muncie, Indiana last night, she said. Why did this happen to me? It changed me. I no longer see this life as it was. I have had many dreams realting to this event. I don't know what to do. I thought about seeking a hynotherapist, yet when this subject came up, I was too scared to \"go there.\" It has taken me all these years to \"voice\" this. I guess it's time. Sincerely, T. Brewer"],"Object Shape":"Circle, Disc","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","Weather Factors":"None, Windy"}