{"files":["/var/www/straped/mufon/html2text/11670.html.txt","/var/www/straped/mufon/org/11670.html"],"Date of the Event":"07/18/2008 09:52 UTC","Object Flight Path":"Straight-line path","divs":["sighting detailson friday 7\\18 i walked outside and seen a solid white\\gold color light going west to east and it looked like a star. it did not look like any normal plane and my house is under the greater pitt landing route and there are several fly over routes over my house and it did not resemble normal high altitude planes. i ran in the house and my wife and i watched the light disappear from our back deck. this all took about a minute for it to go horizon to horizon. this passed over the house at 9:52 pm and shortly there after i watched an arriving flight fly over my house which would have been i guess flight 5732 or 1794. it was about twice the size and brightness of saturn. my impression was it was flying in the 30000 foot range based on the fly over plane routes over my house are about 35000 feet this was only my impression of it's height. i have seen the spacelab and military planes pass over the house and it did not resemble any of these. i also have seen a fireball and many shooting stars and it did not resemble these. it had a straight smooth flight path with no normal lighting a plane would have. a plane flying a fly over route over my house takes about 4 or 5 minutes once spotted on the horizon to go out of site on the other horizon. you can usually hear the planes faintly this object made no sound."],"Sighting Duration":"Undisclosed","Longitude":"-79.989576","trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around July 18th 2008"],"Latitude":"40.443825","Case Number":"11670","Disposition":"Unknown","Region":"Pennsylvania","Weather Factors":"Unknown","Object Features":"None","Summary":"White/Gold star like object passed over my house going from west horizon to east horizon in less than a minute.","Log Number":"US-07222008-0003","Country":"United States","Source":"MUFON","Viewing Distance":"Over One Mile","City":"Pittsburgh","Tags":"City","Date Submitted":"07/18/2008 09:52 UTC","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.443825,+-79.989576(11670)&iwloc=A&hl=en\"> mufon case (11670) map </A>"}