{"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Features":"None","Region":"Colorado","City":"Monte Vista","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11673.html.txt","/var/www/straped/mufon/org/11673.html"],"Summary":"lare disc with yellow,orange and white lights roating around it","Case Number":"11673","trends":["There have been no other sightings in Monte Vista","This sighting has been favorited 1 time."],"Longitude":"-106.148084","divs":["Sighting Detailslength 40 t0 60 ft around with yellow ,orange,white lights flashing around the ship!!!!! well since april 15 and now !we have seen35 light ships AND 2 close range hovering disc's right near our house and im trying to get pic's now!! possable abduction!! over the last three years !! cronic pain in ears docter doesnt know some recalection of and now im seeing crafts! my 8 yr old son has witnessed a fly bye!!!! with me on our porch!! for real please send someone this is real and were gonna prove it wow ya got this see for your self i guarantee you will see light ships!!!!! on july 14 at 3:30 am i wake up cause i got to go pee and it's summer my bedroom window is open with my fan going!! and im drawn to look out!! when i do above the trees in my yard about 1 or 2 blocks over and it had to be at least!130 feet of the ground just hovering!! with yellow ,orange,white lights that appeard to be going around the out side of this craft that is !! im guessing!! 40 to 60 ft around! so i rubb my eyes to make sure it's there and it is !1 si i look for about 2 mins and then i pee!! when i come back and look it's still!there so my digi cam needed batteries so i couldnt take a pic so i watched for about5 more mins!! and it never moved... please contact me this is real were normal people and i can guarantee you will leave alamosa colorado with video of light ship's we see em' every night and you will too this is not a hoax."],"Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"07/14/2008 03:30 UTC","Sighting Duration":"Undisclosed","Log Number":"US-07222008-0006","Latitude":"37.57917","Date Submitted":"07/14/2008 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.57917,+-106.148084(11673)&iwloc=A&hl=en\"> mufon case (11673) map </A>","Object Shape":"Disc","Source":"MUFON"}