{"map":"<A HREF = \"http://maps.google.com/maps?q=46.736223,+-94.68139(11678)&iwloc=A&hl=en\"> mufon case (11678) map </A>","City":"Undisclosed","Longitude":"-94.68139","Object Shape":"Diamond","Date Submitted":"04/07/2008 08:40 UTC","Object Features":"Unknown","Region":"Minnesota","Country":"United States","Disposition":"IFO","Date of the Event":"04/07/2008 08:40 UTC","divs":["Sighting DetailsWhile filling water jugs at a spring across the road (SW) from my house, I looked up to pass the time wathing the sky. Frequent F-16 activity has kept me interested in sky-watching, as well as unexplainable satellite-like lights which move contrary to common satelites. Looking to the Northern skyline, I immediately saw a light which was partially obscured by a low cieling which was developed at around 2.5-3 thousand feet. The light source proved to be 4 white lights in a tight group appearing in an elongated diamond formation which I estimate to have been .5 to .75 miles distant. I estimate the object to have been between 50 and 75 feet from the front light to the rear light. Viewed from directly below, I postulate that the light pattern might have appeared square. I am of the opinion that the lights were connected to one object, although I could not discern an object- only the lights and their direction, speed and relative configuration. The lights moved slowly (under 50mph) covering only a few degrees of sky before dissapearing in the low cieling. Only five minutes later, as I finished filling the last of three 6-gallon water jugs, the sky cleared from the East (the lights' direction of travel) and nothing was to be seen. However, note that at their low altitude and my angle of view, they would have travelled beyond my sight by this time. Again, the night was silent. There were not yet even leaves to rustle in the trees, and the light breeze did not produce a whisper in the needles of the red pines above my head; wind speed at ground level was ~5mph and aloft appeared ~20-25mph. The object, while I observed it, appeared to maintain a constant, straight and level trajectory against the wind. Although the lights performed no extreme or even conventional maneuvers, it clearly was not a conventional aircraft and was clearly beyond the capabilities of any aircraft of which I am familiar. I felt no fear nor did I feel as if the object or its occupants were aware of me. I do feel as if it were definitly not natural phenomena and, further, that it was a powered craft under intelligent guidance. I am a former enlisted (e-4 sergeant) USAF security policeman (1983-1989) and have seen every type of aircraft in day, night and all-weather operations and have never observed an object before which so obviously defied all conventional. Did any other observers report anything similar in my area during this time? I am curious to know if anything more could be added. (Shape, color, size, sound of object; clues as to its origin, powerplant, etc.) Respectfully submitted, Mike O'C"],"trends":[],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"4 wht lts slnt mvng agnst wnd wst 2 est 3kft","Sighting Duration":"00:01:00","Log Number":"US-07232008-0004","Latitude":"46.736223","Tags":"City","files":["/var/www/straped/mufon/html2text/11678.html.txt","/var/www/straped/mufon/org/11678.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"11678","Source":"MUFON"}