{"Summary":"white ball of light","Weather Factors":"Lightning, Light","Date of the Event":"06/06/2008 12:00 UTC","trends":["There has been one other sighting in Kincardine","There were no other sightings in Kincardine on or around June 6th 2008"],"files":["/var/www/straped/mufon/html2text/11688.html.txt","/var/www/straped/mufon/org/11688.html"],"Case Number":"11688","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Log Number":"CA-07232008-0014","map":"<A HREF = \"http://maps.google.com/maps?q=44.174892,+-81.636154(11688)&iwloc=A&hl=en\"> mufon case (11688) map </A>","divs":["Sighting DetailsThere was a powerful storm cloud to the east with bright pink, peach and yellow flashings of lightning. I'd actually watched it from the store parking lot for a few minutes earlier. Anyways, when I got out of my car to look at it (the storm clouds) when this ball of light (like a passing star, solid but with an aura to it), flew directly overhead- from west to east. I thought it was a plane at first but it was one white round light and fairly low (maybe 250-500 feet) and it flew in a direct straight line into the storm clouds where it was concealed by the clouds. No beacons, no streaks or con trails, no sound... no deviation in flight path- some things you'd expect from a low flying aircraft. I was feeling good, watching the storm clouds (nature's beauty and such) but it felt, surreal after. At first I wondered if I had just seen the light ball, but then I thought if it were my imagination it would have been a lot more exciting :) I have never witnessed anything exactly like this before. The storm clouds- maybe one or two forked lightning flashes after a couple minutes, but otherwise far calmer than before (though I don't think the light and storm activity were related)."],"Region":"Ontario","Country":"Canada","Source":"MUFON","City":"Kincardine","Tags":"City","Date Submitted":"06/06/2008 12:00 UTC","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Longitude":"-81.636154","Viewing Distance":"Unknown","Latitude":"44.174892"}