{"divs":["Sighting DetailsI was driving home about 12:00 Noon. I made a right hand turn (east) onto Marilyn Parkway from Kitty Hawk (north). I had just finished turning when I looked to the north over Marilyn Redd Park and some apartments higher on a hill. I could not believe my eyes. It was a domed shaped object flat on the bottom. It did not move (wobble) or make a noise. It was hovering adjacent to the Mesquite Airport in the east direction. I pulled my car over to the side of the road and watched the thing for about two minutes. It then departed in the northerly direction and took between one and two minutes to completely disappear. I did not have my camera with me (although I do now carry a throwaway 35 mm in my car). Later, I returned to the area and took a photo of the exact scene as I saw it. I have superimposed a UFO in the position that it was then located. This photo now represents exactly what I saw on that date (June 17 or 18, 2008). According to a local map, the craft was approximately 2460 feet from my location. From my perspective it was about the size of a quarter. It was the most incredible thing that I have ever seen. Previous to this sighting I never really gave UFOs much thought. I didn't necessarily believe in them or disbelieve them. I had no opinion but i certainly do now. Most of the people that I have related this story to think that I'M crazy . . .who knows, maybe I am but I know what I saw is what I saw. I have been totally unable to find another person in this town of 20,000 people who also witnessed it."],"City":"Las Vegas or St. George","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/11689.html.txt","/var/www/straped/mufon/more/11689_submitter_file1__UFOSightJune2008005.jpg","/var/www/straped/mufon/org/11689.html"],"Region":"Nevada","Country":"United States","Latitude":"38.80833","Case Number":"11689","Object Features":"Dome","Date Submitted":"06/17/2008 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Las Vegas or St. George","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"06/17/2008 12:00 UTC","Log Number":"US-07232008-0015","Longitude":"-116.412729","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=38.80833,+-116.412729(11689)&iwloc=A&hl=en\"> mufon case (11689) map </A>","Source":"MUFON","Disposition":"Insufficient Data","Summary":"Light colored craft hovered for 2 minutes. Made no noise.","Tags":"City"}