{"divs":["Sighting DetailsI wasn't present at the beginning of this, but soon my friend came over at around 01:00 telling me to get outside, where I witnessed a strange light. It would start at one end just under the square of the big dipper, blinking white. Then it would begin moving in a straight line towards the constellation Draco while maintaining a red appearance. It would then start blinking white again before moving back the other way, still in a straight line, while having a blue-green appearance. The light continued this pattern (pause, blink, move) for around 45 minuets before taking off towards the city of Killeen, simply vanishing at one point before reappearing to blink while seeming to hover before disappearing all together. There was another star like light, hovering over the housing area that seemed to strobe through a series of color while not moving. This light stayed like this for the duration of the event, before traveling away from post to simply disappear from sight. It moved in a straight line, contrary to the movement of the night sky, and even the airplane that passed directly over it at one point. There were a quite a few other lights exhibiting the same behaviors as the ones listed above (primarily the star like one), and it was rather overwhelming. My friend told me she'd been sitting out there since around 23:30 watching this display before coming and getting me. We were fortunate to get a few video clips of the phenomena, unfortunately we've not had a chance to get them off our cameras as of yet. Living where we do, we've all gotten pretty well acquainted with the aircraft that frequents the area (some via personal experience due to occupation), and we agree that none of them move like what we saw tonight. Rotor and fixed wing craft alike. We called it a night when the brightest star like 'blip' disappeared from view at around 02:00-02:30."],"Disposition":"IFO","trends":["There have been 6 other sightings in Fort Hood","There were 2 other sightings in Fort Hood on or around July 22nd 2008"],"files":["/var/www/straped/mufon/html2text/11681.html.txt","/var/www/straped/mufon/org/11681.html"],"Date Submitted":"07/22/2008 11:30 UTC","Date of the Event":"07/22/2008 11:30 UTC","Log Number":"US-07232008-0007","Summary":"Blinking strange colors and moving oddly, strange lights moved across the sky.","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Fort Hood","Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=31.13,+-97.78(11681)&iwloc=A&hl=en\"> mufon case (11681) map </A>","Longitude":"-97.78","Tags":"City","Latitude":"31.13","Sighting Duration":"02:14:04","Object Features":"Unknown","Object Shape":"Flash, Star-like, Triangle, Other","Case Number":"11681","Source":"MUFON"}