{"Sighting Duration":"00:05:00","trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around July 9th 2008","This sighting has never been favorited.",""],"Date Submitted":"07/09/2008 06:00 UTC","Country":"United States","Latitude":"42.37759","Case Number":"11685","Object Shape":"Cigar","Tags":"City","Summary":"Cigar Shaped \"metalic\" object.","files":["/var/www/straped/mufon/html2text/11685.html.txt","/var/www/straped/mufon/more/11685_submitter_file1__foto.JPG","/var/www/straped/mufon/more/11685_submitter_file2__tileprint.php.jpg","/var/www/straped/mufon/org/11685.html"],"Source":"MUFON","City":"Livonia","divs":["Sighting DetailsI was driving home from dinner on Sunday I believe (there is chance it was Saturday I can find out for sure if you think this report is really important)on Ann Arbor Trail in Michigan on the stretch next to Hines park near Farmington road. I first noticed what I thought was a plane when I was on Ann Arbor trail driving towards Farmington rd and I quickly noticed that I couldn't see any wings or a tail and it was close enough that if it was a plane I should have been able to see them. I still thought it could have been a plane and it was just an optical illusion however because it was about the size of 747. Eventually however I noticed it was going really slow so I thought maybe it was a blimp or something. I then drove behind some trees and I expected it to be gone by the time I got past them but it was going so slow it was still in sight when I arrived near the stop light of Ann Arbor Trail and Hines rd and past the trees. I got a better look at it then and still didn't notice any wings or a tail just a long cigar shaped vehicle and I was assuming it \"must\" be a blimp but then it speed up much to fast to be a blimp and fairly quickly went out of sight. It was odd enough to be extreamly interesting and I was seriously considering pulling to the side of road and looking at it but with the traffic I decided against it. I then went home and told my mother about it and she said she just heard someone on the radio talking about a UFO sighting the day before in the general area so it peaked my interest. Now I notice however that there have been a large rash of cigar shaped UFO sighting here in Michigan about a week after this. It was big enough news to talk about it on the local news channels and the Detroit radio program Drew and Mike. I'm sure your probably already aware of this however. Apparently the other sightings had been at night when it was dark however. They said it was a cigar shaped craft with orange and red lights. When I heard about all these people having sightings of a similar shaped craft and the police being called out to investigate and such I thought I should make a report. If you want more info just ask but I have to get back to work I'm on lunch break now! Sorry if this is sloppy and hard to read I'm in hurry."],"Object Features":"Undisclosed","Region":"Michigan","Object Flight Path":"Undisclosed","Date of the Event":"07/09/2008 06:00 UTC","Viewing Distance":"Unknown","Longitude":"-83.34761","map":"<A HREF = \"http://maps.google.com/maps?q=42.37759,+-83.34761(11685)&iwloc=A&hl=en\"> mufon case (11685) map </A>","Log Number":"US-07232008-0011","Disposition":"Unknown","Weather Factors":"Unknown"}