{"Date Submitted":"07/31/1966 07:45 UTC","Case Number":"1168","Source":"MUFON","Region":"Ohio","Object Features":"Undisclosed","Longitude":"-84.285098","Weather Factors":"Unknown","divs":["sighting detailslegacy case entered by mufon of oh. a young mother was driving with her two sons and grandmother on cranes run roadwhere it dead-ends into sr25 in rural southern montgomery co., oh nearmiamisburg in aug. or sept. of 1966 at 7:30 or 8:00 p.m. they stopped at a stopsign and looked across the field where the un was going down (w) and saw asaucer-shaped object in fron of the sun, approximately 1\\2 mi. away. the objectwas bright, shiny and looked like it might be touching down on the ground orvery close to the ground. it was about the size of a truck.\"we heard a humming sound, quite distinct.... i couldnt tell a distinct colorbecause the sun was behint it, but it shimmered a lot and wavered. no wind wasblowing the ground, dirt, or grass. it had a clockwise right-to-left spin.\"the four occupants of the car watched it about 10 minutes. other traffic pulledover (3 or 4 cars) and their occupants also saw the object. soon the objectbegan to ascend.\"it tilted back and took off slow....i lost sight of it in the distance. theobject was pretty looking but it still gave me goose bumps.\""],"City":"Miamisburg","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Summary":"Humming, spinning saucer near ground in rural OH","Country":"United States","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=39.648176,+-84.285098(1168)&iwloc=A&hl=en\"> mufon case (1168) map </A>","Latitude":"39.648176","Tags":"City","Date of the Event":"07/31/1966 07:45 UTC","files":["/var/www/straped/mufon/html2text/1168.html.txt","/var/www/straped/mufon/mufon_json/1168.json","/var/www/straped/mufon/org/1168.html"],"Object Shape":"Unknown","Log Number":"","trends":["There have been 7 other sightings in Miamisburg","There were no other sightings in Miamisburg on or around July 31st 1966"],"Viewing Distance":"501 Feet - 1 Mile"}