{"Object Features":"Unknown","Date of the Event":"07/21/2008 10:15 UTC","Region":"Texas","Case Number":"11695","trends":["There have been 6 other sightings in Fort Hood","There was one other sighting in Fort Hood on or around July 21st 2008"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-97.73997","Country":"United States","Tags":"City","Disposition":"IFO","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.268043,+-97.73997(11695)&iwloc=A&hl=en\"> mufon case (11695) map </A>","files":["/var/www/straped/mufon/html2text/11695.html.txt","/var/www/straped/mufon/org/11695.html"],"divs":["sighting detailson 21 july 2008 before going to bed i went out back of my house to have a smoke and i sat in the rocking chair on my back patio to smoke. the chair was facing out to the left of my house and i noticed a bright flashing light moving at a medium speed in a strait line. the night was realy clear and you can see all the stars, at first i was sure it was just a plane but there was nothing else going on so i continued to watch it. and to my suprize as it was going in a strait line it then stoped and started moving back and forth along the same line while strobing bright bright white then it stalled out stopped strobing and changed color into bright red. then it just vannashed, i was so shocked at what i saw i knocked on my bedroom window from the out side and called my wife outside to explain what i saw. i was pointing up in the sky explaining it to her and then it apeared again but this time was green\\blue. it moved back and forth and then up and down and even diaganal. it continued changing color and dissapearing and reapearing for about 40 min then it just vanished. my wife just told me to calm down and not to get all worked up. she convinced me to let it go and to come back inside. but it consumed me the following day and when i went outside the next night at the same time it apeared agian on the 23rd of july but this time for not as long. i have served 7 years in the military and i have been living here in killeen for the last 4 years right outside the post and i have seen many types of military aircraft such as black hawk helicopters, shanooks and even jets flying low and fast but never have i ever seen anything like this, not even in iraq. i must add that i do have a video camera and i did go get it to try to film but the batery was dead so i tried to use my cell camera and it didnt come out good and you cant make anything out. i talked to people the next day about it but no one that i know was up or outside at that time so they did not see it. i felt copelled to share and it is my hope that someone out there saw the same thing or if not can explain what i did see."],"Latitude":"31.268043","Date Submitted":"07/21/2008 10:15 UTC","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-07242008-0002","Object Shape":"Sphere, Star-like","Source":"MUFON","City":"Fort Hood","Summary":"Bright white light Flashing and moving back and forth then stoping and changed color to solid red then blue/green then storbe white again dissapearing inbetween.","Weather Factors":"Does Not Apply"}