{"trends":["There have been 19 other sightings in Greeley","There were no other sightings in Greeley on or around July 22nd 2008"],"Object Flight Path":"Undisclosed","Region":"Colorado","Weather Factors":"Unknown","Date Submitted":"07/22/2008 09:30 UTC","Log Number":"US-07232008-0019","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.428924,+-104.706822(11693)&iwloc=A&hl=en\"> mufon case (11693) map </A>","Summary":"Object with flashing lights and abnormal flight pattern","City":"Greeley","Date of the Event":"07/22/2008 09:30 UTC","Tags":"City","Latitude":"40.428924","Case Number":"11693","Object Shape":"Flash, Other","Longitude":"-104.706822","files":["/var/www/straped/mufon/html2text/11693.html.txt","/var/www/straped/mufon/org/11693.html"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","divs":["Sighting Detailsi was driving home from my girlfriends house in longmont, taking highway 66 east to CR 13 south to firestone. Going east on 66, it was late already, so the sky was dark. The only lights around were occasional streetlights and oncoming headlights. My windshield had smudges on it so the light reflecting off it was slightly different the the light coming through the clean parts of the glass, so i was getting used to it looking weird. As soon as it got to the darkest part of the highway, i kept seeing this sparkle-like light. out of the corner of my eye it was like blue red and white-is lights flashing for a split second then nothing. i tought it wasw a plane or something at first so i ignored it. then it kept happening at different spots in the sky. so i thought it was my eyes. i couldnt trust my windshield anymore so i pulled over on the side of the road and got out to get a better look see. sure enough, i wasnt hallucinating. it was almost like a firecracker as in almost like sparkling but different colors. at one point it stopped flashing and changed to a constant white light. faint at first, it got brighter and brighter for about 5 seconds then disappeared. it did that 2 or 3 times before changing back to the sparkles and flew off until i couldnt see it over houses anymore. i know what airplanes and helicopters look like at night. their lights have a constant pattern and the flight path is in a constant straight path or turning slowly and easily. but this had random light flashes and a very zig zag-like, almost violent flight path with no real direction. i also know what planets and stars look like at night and this was a starless night with airplanes in the air to compare this thing to. the only other lights in the sky was the moon and a couple red and blue stationary bright lights around the object i saw. i eventually got home and couldnt see anything anymore. i told everyone immediately and got laughed at because i was alone. but i swear im not making this up. i even looked it up that night and even today( the following day) and nothing."],"Sighting Duration":"Undisclosed"}