{"Latitude":"28.371198","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11696.html.txt","/var/www/straped/mufon/org/11696.html"],"Tags":"City","City":"Hudson","Source":"MUFON","Disposition":"Unknown","Date of the Event":"07/05/2008 08:30 UTC","Sighting Duration":"Undisclosed","Date Submitted":"07/05/2008 08:30 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI hesitated to write but i know what my daughter and I saw the day after the fourth of july. My very mature 11 year old and i went outside on the 5th to see the area fireworks going off again .We noticed a really bright star to the north and we were admiring it for a few minutes when it suddenly began to move. My daughter and I quickly looked at each other to question its movement. It came completely over top of us as slow as could be AND MADE ABSOLUTELY NO SOUND. We started asking each other if we saw airplane lights on anything resembling a plane...IT WAS NOTHING LIKE A PLANE with NO BLINKING LIGHTS OR SOUND. We noticed 4 red lights(kinda in a square formation)underneath. After it passed over our house, it took off to the east very quickly and it was low enough to see a red-like fire glow in the back center. It vanished. Not even 5 seconds later,it RE-APPEARED in the north instantly...we were both in shock and wondering how the heck did it just take off to the east and re-appear in the north even CLOSER TO US again. It stayed in place maybe 30 seconds and then took off once again to the north never to be seen again. I ran in to get the video camera hoping it would come back but was quite disappointed. What i did notice when planes flew over that clear night,it was easy to see the planes(no matter how high in the sky) and heard the sounds as well. What my daughter and i saw that evening was something that \"hyper-spaced\" away and was very distinctive. I'm prepared with a camera outside now all the time hoping to get in on vid."],"Longitude":"-82.692154","Country":"United States","Log Number":"US-07242008-0003","Viewing Distance":"Unknown","Case Number":"11696","Summary":"Bright star-like object moving slowly and then taking off and reappearing","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.371198,+-82.692154(11696)&iwloc=A&hl=en\"> mufon case (11696) map </A>","Object Shape":"Star-like","trends":["There have been 7 other sightings in Hudson","There were no other sightings in Hudson on or around July 5th 2008"],"Region":"Florida"}