{"Object Features":"None","City":"Glen Dale","Object Shape":"Sphere, Other","Case Number":"11694","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Country":"United States","trends":["There has been one other sighting in Glen Dale","There were no other sightings in Glen Dale on or around July 23rd 2008"],"Sighting Duration":"00:06:00","files":["/var/www/straped/mufon/html2text/11694.html.txt","/var/www/straped/mufon/org/11694.html"],"Longitude":"-80.755","divs":["Sighting Details I don't know who i owe the honor to but, this is my second sighting in than a week. The UFO was half sphere and half straight up and down I. My dog and I sat on the porch like the last time and we sat their maybe a couple of minutes when I looked to the west to a power plant across the river from us. When I noticed a light come on from the object it first looked like and Mumerical # 1 than it sat in the sky for about a minute and a half. It to me seemed it had a problem with it's propulsion sytem it went a distance and slow again the lights on the front were flckering like power. It came to across our house when the object veered about 35 degrees and proceed slowly like it had a problem with front lights they kept fade out comeing on flickering and finally they must have turned them off. My neighbor downstairs I awoke her to see the episode she remarked their is no sound. Could not make out shape. Distance of object i'll be guessing 5,000 feet and it was clear night we could see stars and other aircraft fying over us."],"Disposition":"Unknown","Date of the Event":"07/23/2008 11:10 UTC","Weather Factors":"None","Latitude":"39.948611","Date Submitted":"07/23/2008 11:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"West Virginia","Summary":"Look up in sky to the west of me and there it was sitting in air.","Log Number":"US-07242008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=39.948611,+-80.755(11694)&iwloc=A&hl=en\"> mufon case (11694) map </A>"}