{"Summary":"3 Cigar-Shaped Objects with Red and Green Lights","Latitude":"39.941322","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","Region":"Illinois","Country":"United States","Tags":"City","Weather Factors":"Unknown","City":"Quincy","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.941322,+-91.401923(11691)&iwloc=A&hl=en\"> mufon case (11691) map </A>","Longitude":"-91.401923","Case Number":"11691","trends":["There have been 7 other sightings in Quincy","There was one other sighting in Quincy on or around July 22nd 2008"],"Disposition":"Unknown","Source":"MUFON","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/11691.html.txt","/var/www/straped/mufon/org/11691.html"],"Date of the Event":"07/22/2008 09:35 UTC","Date Submitted":"07/22/2008 09:35 UTC","Log Number":"US-07232008-0017","divs":["Sighting DetailsI work at a Hotel which overlooks the Mississippi River, in downtown Quincy, IL, 200 miles North of St. Louis, MO., and was on duty the night this sighting occurred. Around 9:35pm CST, I went outside to take a break and smoke a cigarette. I was looking west towards the Mississippi River. As I looked up at the night sky, I noticed the Big Dipper to my Northwest. To the left, or directly West, I noticed a large bright star, and a smaller star (or so I thought) to the North. As I watched the smaller star, I realized that it was drifting north of the bright star ever so slowly. It continued moving slowly and then turned east towards me. As it got closer and within my view, I could see that it was elongated and displaying white lights on its corners, and red, white, and green pulsating lights on its bottom. It continued east and moved into the sky and out of my view. I then went to the front of the Hotel, which is east, to see if I could see where it had gone; however, when I got to the front of the building, it had disappeared. I then went back to the back of the building, where I was before, and sure enough, there it was right where I had first seen it; near the large bright star. As I quickly swept the sky with my eyes, I, unbelievable enough, saw two more star-like lights, for a total of three; and they too were displaying the same exact light patterns: red, white, and green; however, they maintained their positions to the left and to the right (Southwest and Northwest) of the first object. Furthermore, they were much smaller in size relative to the first and their altitude was much lower in the sky; almost parallel to the treetops. The original one I saw stayed near the large bright star and hovered there for a few seconds, and then it slowly danced around to the left and the right, while the other two hovered in place. Then the first object slowly moved North and then East towards me, and then Southwest in one full motion. (This was the best view that I had seen thus far. I would describe it as a very large, long, cigar shaped object, approximately several hundred meters in length, with white lights on each end and a glowing green and red center). Of the other two, the one to the right continued North, and the one two the left continued south. All three departed in a sequenced, organized pattern of flight and melted into the black of night. In conclusion, I don't know what they were, but they certainly did not exhibit conventional flight maneuvers. As a student pilot myself, I did not recognize any traditional movements. They could choose to hover, or turn 180 without incident. Additionally, they made no sound whatsoever! To quote the great movie Contact, \"Whatever it is...it ain't local\"!"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering"}