{"Object Shape":"Sphere","Object Flight Path":"Path with directional change,Other","Viewing Distance":"101-500 Feet","Case Number":"11706","Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.495797,+-86.131173(11706)&iwloc=A&hl=en\"> mufon case (11706) map </A>","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around April 23rd 2005"],"Summary":"2 orange lit spheres chasing each other followed by blackness then an arc of 6 orange lit spheres then nothing.","Disposition":"Unknown","Log Number":"US-07242008-0013","Latitude":"40.495797","Date of the Event":"04/23/2005 10:30 UTC","Tags":"City","Region":"Indiana","Date Submitted":"04/23/2005 10:30 UTC","divs":["Sighting DetailsI was driving into Kokomo to get a bite to eat with my then girlfriend. It was Approximatly 10;30 at night and it was a Saturday. We were traveling west on 300 S. about 3 miles from the intersection of state road 19 and 300 s. I stopped to view two sphere shaped lights sitting completely still in the night sky. They were about a 500 feet in the sky well above the trees and powerlines. I sat and watched in amazement with my girlfriend for a period of maybe 45 seconds these lights setting still all the while saying, \"do you see this to her.\" She did. It was like the lights noticed us there and began to play. By \"play\" I mean they chased one another around in a circle for over a minute. It was not scary because it was like watching a dog chase it's tail, but I can't help feeling they were doing it for our entertainment. Then the spheres stopped and the sky went black again , but only for a moment. They reappeared in an arc formation turning on one at a time till there was 5 and when all 5 were lit they vanished in the same order they came on. The later events happened very quickly and was similar to the movement of a rock skipping across a pond. After all this happened we called each of our parents and told them and questioned if they had heard from the T.V. of any sightings or strange things happening. We were told by her Mom to call the Sheriffs department. Which we did to report it and to find out any information if there was any, which there was no other reports. I live 30 minutes from Grissom Airbase and see Planes, jets and heliocopters often at night as well as in the day. This was no aircraft known to me based on the way it moved and the fact that it seemed to notice and interact with us. Though I am not on speaking terms with the girl in the car that night I know from statements made by her Mom to mine that she is still puzzled by what it was we saw that night. I have looked for similar videos and pictures to what I experienced on the internet and have yet to find any."],"City":"Kokomo","Longitude":"-86.131173","Source":"MUFON","Weather Factors":"None","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/11706.html.txt","/var/www/straped/mufon/org/11706.html"]}