{"map":"<A HREF = \"http://maps.google.com/maps?q=31.382576,+-89.104767(11701)&iwloc=A&hl=en\"> mufon case (11701) map </A>","Viewing Distance":"Over One Mile","Case Number":"11701","Log Number":"US-07242008-0008","Date of the Event":"07/23/2008 09:30 UTC","Sighting Duration":"01:30:00","divs":["Sighting DetailsI have been observing an object at 9:30 P.M. last night that I would describe being similar to a very bright star for almost three months on a regular basis nightly. I went out to look at the night sky and looked up at the stars when I saw a very bright object to my South South East direction from my home. It really stood out from the stars because of the intense brightness. I watched the object slowly move in unpredictable patterns. It was hard to judge the distance and altitude being at night. I went back into the house to get my bincoulars. When I looked through them I could just make out a red colored ring pulsating and moving in a circular motion. When I pulled the binoculars down and looked at it with my eyes; it suddenly dimmed itself slowly and disappeared. I went back into my house wondering what in the world I just witnessed. I went back out maybe 45 mins. later and observed it back in it's original spot I had seen it earlier. It made no sound at all and definately wasn't an airplane, helicopter, weather ballon, or any swamp gas! I have served 23 yrs. in Army National Guard so far and have never seen any equipment with this technology to do the things this object did in the sky. I thought about calling the local authorities here and seeing if any other reports possibly came in from any area residents; but changed my mind."],"Tags":"City","Object Features":"Unknown","Region":"Mississippi","Longitude":"-89.104767","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11701.html.txt","/var/www/straped/mufon/org/11701.html"],"Date Submitted":"07/23/2008 09:30 UTC","Latitude":"31.382576","Country":"United States","Object Shape":"Star-like","City":"Runnelstown","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Summary":"Very Bright Starlike UFO","Source":"MUFON","trends":["There has been one other sighting in Runnelstown","There were no other sightings in Runnelstown on or around July 23rd 2008"]}