{"map":"<A HREF = \"http://maps.google.com/maps?q=44.318484,+-85.601154(11703)&iwloc=A&hl=en\"> mufon case (11703) map </A>","Sighting Duration":"Undisclosed","trends":[],"files":["/var/www/straped/mufon/html2text/11703.html.txt","/var/www/straped/mufon/org/11703.html"],"Viewing Distance":"Unknown","Date of the Event":"07/09/2005 12:00 UTC","Country":"United States","Date Submitted":"07/09/2005 12:00 UTC","Object Flight Path":"Other","Object Features":"Unknown","Object Shape":"Other","Log Number":"US-07242008-0010","Source":"MUFON","City":"Undisclosed","Disposition":"IFO","Longitude":"-85.601154","Summary":"I need to contact someone over this and not sure who or what else to do.","Region":"Michigan","divs":["Sighting Details july 9th 2005. i \"dreampt\" that i was in a dark room with very little lighting. everything was smooth. i couldnt \"see\" anyone but i kept hearing this voice \"talking\" to me. In front of me was a giant monitor. i was told to look at the screen and then heard these words in my ear...\"these two worlds are life giving worlds like your own.\" The monitor then became this giant 3dimensional planet. i \"orbited this planet and was able to see what it looked like, what features it had, (mountains, lakes, etc). After on full orbit i was \"taken\" to the \"other\" planet and the same thing happened. I asked where i was in relation to these two different stars and was told \"i was in the pegasus star system.\" That was all i remember about the dream. Now before you guys think im wasting your time,i was at work a few days later and remembering this dream drew on paper the star map that i saw showing me these two planets. That was as far as it went until about a week later. I was watching a show about mars on Nova (t.v.) about a week or so later and it reminded me of this \"dream.\" i went online to research pegasus star system (until then i knew absolutely nothing about it). The very first web site i went to up popped a map of THE GREAT SQAURE OF PEGASUS\"...which exactly matched the map i drew from my dream just a few days earlier. My parent can vouch for all of this. I assure you i look for NO publicity, NO fame, NO NOTHING...except for someone to hear what i am saying and possibly give me some explaination of what any of this means. i dont want to waste anyone's time over this so if its no big deal fine...but if i could something to understand this...i dont know. thanks in advance. tom duchene macomb mi."],"Weather Factors":"Unknown","Tags":"City","Case Number":"11703","Latitude":"44.318484"}