{"City":"Marthasville","Date of the Event":"11/30/1960 12:00 UTC","divs":["Sighting DetailsIn my grandfather's house (with old, ripply glass in the windows,) I was sitting next to a window watching TV. A moving light outside the west facing window caught my eye. It very nearly resembled the full moon. It was about 15 to 20 degrees west of zenith, moving from south to north (left to right) about one degree per second. I went to the north door and into the dark backyard about 30 seconds later but saw nothing unusual. Other people were in the room but were not near a west facing window; thus no other witnesses. I discussed it with the others and tried to convince them that I saw it. I was excited by the experience but did not feel fear nor any other negative reaction. I was wide awake at the time and can still remember the event. (But, I can't remember the year. I feel that it was October or November but that's only a gut feeling. I was about 15 or 16 years old: thus it was before I started drinking or trying any recreational '60's drugs. Around 1993 I had a terrifying nightmare that involved being in that town at night and looking up at a full moon about 30 degrees east of the zenith. When I awoke and recalled the dream I could not recall anything unusual about the moon's appearance nor any frightful occurances. (I have chronic depression and occasional anxiety, for which I've taken meds since, coincidentally, 1993. Other than that, I've never hallucinated nor have I suffered from any other psychological symptoms.)"],"Summary":"Light resembling full moon passed South to North past window facing west.","Object Features":"None","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.628384,+-91.057645(11711)&iwloc=A&hl=en\"> mufon case (11711) map </A>","Case Number":"11711","Longitude":"-91.057645","Viewing Distance":"Unknown","Region":"Missouri","Sighting Duration":"Undisclosed","Disposition":"Hoax","trends":["There have been no other sightings in Marthasville","This sighting has never been favorited."],"Log Number":"US-07242008-0018","Tags":"City","Object Shape":"Disc, Sphere","Latitude":"38.628384","Date Submitted":"11/30/1960 12:00 UTC","Object Flight Path":"Straight-line path","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/11711.html.txt","/var/www/straped/mufon/org/11711.html"]}