{"map":"<A HREF = \"http://maps.google.com/maps?q=40.868989,+-72.517589(11718)&iwloc=A&hl=en\"> mufon case (11718) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11718.html.txt","/var/www/straped/mufon/org/11718.html"],"Country":"United States","divs":["Sighting DetailsAt about 11:30PM I saw something unexplained in the southern sky. I watched it as it humg motionless about 35% or so above the horizon. An Unidentified Motionless Object. It was, by far, the brightes object in the sky and like nothing I had ever seen before. I had no idea. I figured...Mufon, so I googled it, found James Bouck the State Director in Schenectady, NY and called him. I told him to look in the southern sky and that if it was still there in 10 minutes I'd call him back. So I went back outside and, sure enough, it was still there. I called him back. He wasn't able to see it, but we go to talking and he suggested that I fill out this form. After our conversation I went outside, but the object had moved somewhat toward the southwest. I wondered if maybe this wasn't something identifiable like the space station or something. In any event, it looked like the planet Venus in the morning, except three or four of them fused one atop the other as a single object and hanging motionless in the night sky about 35 or so degrees above the horizon. The brightest thing, by far, in the sky. I'm not certain I would call it cylindrical, mnore like a \"rod\" of light that seemed to have thin, crooked \"arms\" of light attatched to it. I kept looking at stars to reassure myself that this was something entirely different. I am out near every night looking up at the stars, a skywatcher for at least the past 50 years and I've never seen anything like that. Tonight is a clear sky with the Milky Way faintly visible and this thing was unprecedented. So much so that I am filling out this report. Over the course of the past hour as the Earth has rotated, the object's apparent position has changed toward the southwest by at least the width of a full moon. So, there may well be a mundane explanation for this thing that happens to be in tonight's sky. But I don't know what it is."],"Date of the Event":"07/27/2008 11:30 UTC","Object Shape":"Cylinder, Other","Viewing Distance":"Over One Mile","Date Submitted":"07/27/2008 11:30 UTC","Object Features":"Unknown","trends":["There have been 3 other sightings in Hampton Bays","There were no other sightings in Hampton Bays on or around July 27th 2008"],"Case Number":"11718","City":"Hampton Bays","Log Number":"US-07252008-0001","Longitude":"-72.517589","Source":"MUFON","Latitude":"40.868989","Summary":"Stationary bright object","Region":"New York","Disposition":"Unresolved","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary"}