{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.052812,+-86.002006(11712)&iwloc=A&hl=en\"> mufon case (11712) map </A>","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around July 23rd 2008"],"City":"Noblesville","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11712.html.txt","/var/www/straped/mufon/org/11712.html"],"Disposition":"Insufficient Data","Log Number":"US-07242008-0019","Region":"Indiana","Case Number":"11712","Object Flight Path":"Stationary","Latitude":"40.052812","Country":"United States","Date Submitted":"07/23/2008 10:20 UTC","Date of the Event":"07/23/2008 10:20 UTC","Object Features":"Unknown","Object Shape":"Star-like","divs":["Sighting DetailsWhile visiting family in Indiana, we were traveling northbound on Howe Rd in Hamilton County aprox. one-half mile south of Indiana SR 238 at aprox. 1015 - 1030 on the evening of July 23 2008. Just off to the west of our vehicle we observed two bright orange lights that just \"poped\" on at the same time one on top of the other seperated by a distance of 10 to 15 feet. These two lights stayed on for 3 to 5 seconds then went off. The objest remained stationary with no movement at all during illumination. When they went off I could not see any type of navigation or anti-collision lighting just darkness. When the first set of lights went off, aprox. 1000 to 2000 feet to the west two more orange bright lights came on. These two were the same discription as the first two. They stayed on for aprox. 3-5 seconds and went off. Again, no navigation or anti-collision light were observed after the lights went off just darkness. I work and live in Florida around Air Force bases I am used to seeing all types of aircraft and aircraft flares. These were not flares, and the brightness was brighter than any aircraft landing light I have ever observed."],"Longitude":"-86.002006","Summary":"Two Bright orange lights one on top of the other, brighter than any star or aircraft landing light","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}