{"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07242008-0020","Sighting Duration":"00:05:00","Source":"MUFON","trends":["There have been 185 other sightings in Denver","There were 2 other sightings in Denver on or around July 5th 2008"],"Date Submitted":"07/05/2008 09:05 UTC","Object Shape":"Circle","City":"Denver","Region":"Colorado","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"None","files":["/var/www/straped/mufon/html2text/11713.html.txt","/var/www/straped/mufon/org/11713.html"],"Disposition":"Unknown","Country":"United States","Case Number":"11713","map":"<A HREF = \"http://maps.google.com/maps?q=39.742234,+-104.983483(11713)&iwloc=A&hl=en\"> mufon case (11713) map </A>","Longitude":"-104.983483","Weather Factors":"None","Latitude":"39.742234","divs":["Sighting DetailsI was on Southwest flight 371 coming from Indiana for a landing at DIA. About 20 minutes from landing, the seatbelt sigh was on, I looked out the window(I had a window seat on the Port side-last row) and saw a circular shadow traveling with the aircraft at the same rate of speed. I have seen shadows from aircraft before and this was like the others in color and density. It appeared to be about 100-200 yeards from the airacraft. After observing it for about 5 minutes the Port wing of the plane wend up about 40 degrees and the 737 made a sharp turn to the starbord and then into an E-W runway for a landing. As the wing went up and the plane banked to the right I observed the shadow to continue on a straight line that we would have taken if we had not banked. It continued on at the same rate of speed as before. At that time of day, the sun was in the East about 35 degrees off the horizon. Therefore any shadow from our plane would have been in front to the 737 and not visible from the cabin. Whatever made this shadow would have to be above us and to the rear at our rate of speed(225 kts?). I know of no aircraft or aboral creature that makes a circular shadow. What ever it was, was airborne. I saw no other objects on the ground and there were no roads or trails along the flight path. When I first saw the object, my first reaction was it was flight 371. But it did not have the shadow of an aircraft. The shadow never varied in flight path or speed during the whole time I observed it."],"Date of the Event":"07/05/2008 09:05 UTC","Summary":"A round shadow 45 degrees off port side of 737 going on the ground."}