{"City":"Between Ottawa and Earlvi","divs":["Sighting DetailsI got a SkyQuest Dossonian XT-6 telescope for my birthday so my cousin and I took it out to the middle of the country to do some night star and planet viewing. It was approximately 9:00pm when we left Ottawa. We started going North on Rt.23 and turned left onto to Rt.52 towards Mendota from Ottawa. We found a gravel farm road (think it was either 15 or 16) and turned North towards Earlville. Halfway between Ottawa and Earlville there is an area that is great for viewing the night sky because it is very dark (no town lights). We stopped the truck, got out, set up the telescope and started looking around for stars and planets to view. We looked at the moon for awhile on a high resolution lens. Then we looked at Jupiter for awhile. We found Saturn and looked at that for awhile as well. About 45 mins later we changed lenses. We went from the high powered lens to the low powered lens to see the difference between the two when looking at the Moon, Jupiter and Saturn. I started looking at Saturn which was W of where we were when my cousin noticed a large group of weird white lights falling in the sky. (I confirmed later the next day that these lights were in fact our local Sky Dive Chicago divers group performing a night jump called the \"UFO jump\". The divers had worn white flares on their outfits. There were two series of jumps that night, both with the white flares.) When I turned to look at the lights a different, stationary set of dirty orange colored lights, much higher in the sky than the falling white lights, caught my eye. Jupiter was SE of where we were standing and it was positioned about 50 degrees above of the horizon. Just underneath (about 10 degrees below Jupiter) and to the left of Jupiter there were 2 dirty orange colored glowing orb-like lights. (See lights1.jpg) They were situated one above the other with a bit of room in between. They didn't move, they just seemed to hover. I pointed them out to my cousin who agreed that what I was seeing couldn't be the same as the falling lights. I spun my telescope around to see if I could see what they were, lined up my site to the top \"orb\" then looked through the eye piece. What I saw was a bright red light where the \"orb\" was, spaced evenly behind the red light yet a little to the side on top and bottom were two much smaller white lights. Then spaced evenly behind the white lights in alignment with them were two more white lights (one on top one on bottom). In straight alignment with the red light but behind the two white lights was another small white light. (see lights2.jpg) I saw this for approximately just a few seconds and it disappeared from my scope sight. I looked back up into the air and both lights were completely gone. At that point my cousin pointed directly left of where the lights were just at and we saw one single dirty orange orb. It hovered in one spot for approximately 5-10 seconds then started to move to the left. It stopped and looked like it was hovering and rocking back and forth from side to side. Then it slowly moved back to the right..back to where we just saw it moments ago. It sat there for about 5 seconds. Then it began to flicker white, red, blue, all different colors. Then it turned extremely bright red, started to move to the right again slowly..picked up speed and took off south towards Ottawa. It disappeared from view within a matter of 2 or 3 seconds. After seeing that we were watching the sky looking for the orb to come back into view. About 10-15 minutes later we were looking east, about 20 degrees above the horizon and saw what appeared to be the orb again. It appeared to be moving South, only this time it would move then stop, move then stop, move then stop. It did this for about 2 minutes then just disappeared. There were no color changes this time and we did not see it move away from us when it disappeared, it just simply blinked out of existence. We kept watching the sky for about an hour or so after this and never saw it again. We saw the normal air traffic of jets and some planes here and there but didn't see the weird dirty orange orbs again."],"Disposition":"Unknown","Summary":"Two sightings of similar orb(s) with & w/o a telescope in same night.","Weather Factors":"None","Longitude":"-89.393928","Log Number":"US-07252008-0005","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","Date Submitted":"07/05/2008 10:30 UTC","Object Shape":"Circle, Diamond, Other, Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","trends":["There have been no other sightings in Between Ottawa and Earlvi","This sighting has never been favorited."],"Country":"United States","Latitude":"40.639955","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.639955,+-89.393928(11722)&iwloc=A&hl=en\"> mufon case (11722) map </A>","Viewing Distance":"Over One Mile","Date of the Event":"07/05/2008 10:30 UTC","Region":"Illinois","Case Number":"11722","files":["/var/www/straped/mufon/html2text/11722.html.txt","/var/www/straped/mufon/more/11722_submitter_file1__lights1.jpg","/var/www/straped/mufon/more/11722_submitter_file2__lights2.jpg","/var/www/straped/mufon/org/11722.html"]}