{"Log Number":"US-07252008-0003","Object Shape":"Oval","Case Number":"11720","Longitude":"-80.040358","Summary":"DROPPED ABOVE SMALL HELOCOPTER LEVELED OUT AND ASCENDED EAST","trends":["There have been 2 other sightings in Philippi","There were no other sightings in Philippi on or around July 25th 2008"],"Latitude":"39.15232","City":"Philippi","Object Flight Path":"Path with directional change","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.15232,+-80.040358(11720)&iwloc=A&hl=en\"> mufon case (11720) map </A>","Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Region":"West Virginia","Disposition":"Unknown","Viewing Distance":"Unknown","Date Submitted":"07/25/2008 03:21 UTC","Object Features":"None","files":["/var/www/straped/mufon/html2text/11720.html.txt","/var/www/straped/mufon/org/11720.html"],"Date of the Event":"07/25/2008 03:21 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMY WIFE AND I WERE OUT ON OUR REAR DECK SITTING, HAVING COFFEE AND FROM THE NORTH A SMALL HELOCOPTER WAS HEARD. I TURNED TO VISUALLY LOCATE THE CHOPPER'S SOUND IN THE VERY CLEAR SKY. AS I IDENTIFIED THE CRAFT AS A SMALL CHOPPER HEADING DIRECTLY SOUTH, I NOTICED A PILL SIZED(ABOUT A THIRD THE SIZE OF YOUR OUT-STRETCHED THUMBNAIL) CLOUD COLORED OBJECT. I OBSERVED THE OBJECT QUICKLY DESCEND EITHER ABOVE OR BEHIND THE CHOPPER. [I WISH I COULD BE MORE SPECIFIC OF THE OBJECT'S ALTITUDE, BUT HAVING NO IDEA OF THE UFO'S SIZE, THIS WAS PUZZLING. THE CHOPPER WAS ABOUT 2000 FEET ABOVE US.] THE OBJECT LEVELED OUT HEADING DIRECTLY EAST, AWAY FROM THE CHOPPER. I TRIED TO POINT OUT THE OBJECT TO MY WIFE BUT SHE NEVER CAUGHT SIGHT OF THE SMALL OJECT, I SUSPECT OF THE SIZE. IT MAINTAINED ATTITUDE AND AFTER 1 MINUTES OF LINEAR FLIGHT SEEMED TO ASCEND, IN AN EYEBLINK, OUT OF SIGHT. THE CHOPPER WAS WELL OUT OF SIGHT BY NOW, BUT STILL HEARD. WENT TO THE KITCHEN CLOCK TO CHECK TIME--3:21P.M.. I WAS HALLUCINATING OR SAW A ATMOSPHERIC PHENOMENON OR A SMALL CLOUD GONE WILD OR YOUR GUESS IS AS GOOD AS MINE. WOW!!!!!!!!!! MAYBE THE COFFEE."]}