{"Case Number":"11721","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was driving to work this evening on the I-190 heading north into Buffalo, NY. As I passed the Hamburg Street exit (Exit 5), I noticed a peculiar light arrangement to my right approximately 1.5~2 miles away. The lights were in a vertical alignment, like what you would see if a commercial jet banked 90-degrees. At the very top was a pulsating white light (not flashing). Below that were two blue lights. Much further below (50 to 100 feet) the blue lights was a single red light. As I followed it moving away, it seemed to be a shape like a vertical cigar. It caught my attention and I tried to keep it in view. I but it disappeared behind some taller buildings in the city to the North. I then drove around another mile to the Church Street exit (Exit 7). While exiting the thruway, I saw the same light pattern over my left shoulder. This time, it was much larger and the light pattern was now 30-degrees from horizontal. The craft was heading southeast towards Lake Erie and was travelling without making any detectable noise. If it were a commercial jet, it would definitely have been very audible at the low altitude it appeared to be flying. The exit I was on is off of an elevated section of the thruway so I quickly descended to a point where my view of the craft was blocked by the thruway. I raced to get to a location where I would have a clear view over Lake Erie. I reached an opening about 20-seconds later, but to my dismay, the craft could not be found. In the close up view (2nd sighting), the red light was bright and not flashing. The blue lights now appeared to be more of a blue glow like from some type of propulsion system. I would compare it to the blue lights on the rear of the starship destroyer in the movie Star Wars. The white light was now on the far right side of the craft."],"Summary":"Strange low altitude cigar/rectangle shaped UFO","Date of the Event":"07/23/2008 10:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.889687,+-78.874819(11721)&iwloc=A&hl=en\"> mufon case (11721) map </A>","Source":"MUFON","City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around July 23rd 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Shape":"Cigar, Square, Rectagular","Latitude":"42.889687","Longitude":"-78.874819","Sighting Duration":"Undisclosed","Log Number":"US-07252008-0004","Viewing Distance":"Unknown","Date Submitted":"07/23/2008 10:55 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/11721.html.txt","/var/www/straped/mufon/more/11721_submitter_file1__sideview.JPG","/var/www/straped/mufon/org/11721.html"],"Tags":"City","Disposition":"Insufficient Data","Region":"New York"}