{"Object Features":"None","Tags":"City","Object Shape":"Cylinder","Log Number":"US-07252008-0007","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11724.html.txt","/var/www/straped/mufon/org/11724.html"],"Date of the Event":"07/20/1975 11:58 UTC","City":"Undisclosed","Latitude":"38.604386","Sighting Duration":"12:30:59","Disposition":"Unknown","Longitude":"-80.446083","Country":"United States","divs":["Sighting Details it was told to me by some of my extended family of a sighting that happened somewhere in the late 70 to early 80 period in roane county west virginia. this man told me that himself and 4 other guys were working in the oilfields here and they were out on a right of way. the men were taking lunch, they were all sitting there eating and out around the hill coming towards them they spotted a cyllindical shaped metallic silver object. he told me that it passed over them at approx 50 to 80 feet off the deck and noticed a slight humming noise as it passed over. he said it then continued followng the r.o.w. out around the hill, the men jumped off the truck and chased it on foot but here the terrain is pretty toughand they couldnt keep up. they said it was at a constant speed about 20 to 30 mph, it never slowed down, nor wavered on its course and eventually went out of sight and they never saw it again. I fully believe this as i have never really known him to lie and have known him most of my adult life.i am 44 Scott Carper 253 spice ridge rd Newton,wva 25266 304 565 7031 In have a couple other sightings if u r interested. I am also interested in doing some field research for mufon in wv if they have a chapter here because there r stories here that you would probaly be interested in. I have followed the ufo phenemenon all my life and i believe they are out there. Thank you."],"Case Number":"11724","Object Flight Path":"Straight-line path","Date Submitted":"07/20/1975 11:58 UTC","Viewing Distance":"21-100 Feet","Summary":"ufo sighting","map":"<A HREF = \"http://maps.google.com/maps?q=38.604386,+-80.446083(11724)&iwloc=A&hl=en\"> mufon case (11724) map </A>","trends":[],"Region":"West Virginia","Weather Factors":"None"}