{"Region":"Indiana","Date of the Event":"07/24/2008 10:20 UTC","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Flash, Oval, Sphere, Other","Log Number":"US-07252008-0021","trends":["There have been 126 other sightings in Indianapolis","There was one other sighting in Indianapolis on or around July 24th 2008"],"Object Flight Path":"Stationary,Straight-line path","Disposition":"Unknown","Summary":"Bright Red lights turning on and off then sperating over Marion County","Longitude":"-86.153724","files":["/var/www/straped/mufon/html2text/11738.html.txt","/var/www/straped/mufon/org/11738.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.772916,+-86.153724(11738)&iwloc=A&hl=en\"> mufon case (11738) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Object Features":"Unknown","Date Submitted":"07/24/2008 10:20 UTC","divs":["Sighting DetailsI was outside in my front yard looking North, when I saw what looked like an aiplane landing lights, but it was odd because the jets do not usually approch from that direction. The light was a circle, with a red and white cast to it. I did not pay much attention to it untill I noticed that it flickerd off then on again brighter. Then few seconds later a scecond one appeared as the first one flicker off. They were right beside one another. Then one, two and three spehers appeared in a diaganle formation from left to right, the first appeared flickering on, then off, then the second one flickerd on the off, and so on. I really can't explain the way they turned on and off, but to say they flickerd. Then later on they would appear indivually turning on and off. Then I got my bonoculers, to look and the spears appeard very small and red in color and almost diamond shape. One light would sperate into two and then a third one would appear sperate from the other two, that just had sperated. After that I stayed outside for approx 1 hour after I saw the last one and they never appeared again. I got a compass to see what direction I was looking and it was right on North then I log the time. Just has a side note, I saw these lights last year at the approx time, date and location in the sky. If someone would like to contact me I can give a better explanation"],"Tags":"City","Weather Factors":"None","Case Number":"11738","City":"Indianapolis","Latitude":"39.772916"}