{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.65907,+-96.901187(11735)&iwloc=A&hl=en\"> mufon case (11735) map </A>","Date of the Event":"07/31/1974 12:00 UTC","Object Flight Path":"Stationary","Log Number":"US-07252008-0018","divs":["Sighting DetailsLate Aug or early Sept 1974 my friend and I saw a very big UFO hover over Mountain Creek Lake in Dallas. We were close to it, until we left. Then Mountain Creek Lake quite hilly and wooded with winding roads and had very private areas, yet it had and elec power plant on or next to the lake, where swimming is prohibited. We were riding around the hilly wooded roads as teenagers did then and a car drove fast and crazily past us leaving. It was so nerve racking on that narrow hilly road that it caused me to pull right into where obviously they had pulled out which was the power plant parking lot. It was empty and I cannot forget it had amber parking lot lights. It was obviously a nice clear evening or I would not have been out driving at almost 17 yrs old. Immediately we saw it. You couldn't miss it if you tried. Do not always look up to the skies for UFO's. I'm telling you it was just there above the lake water. That lake water was at least on one side of the plant, and there this UFO 3 ft above the water between the parking lot where we were and the plant. It was approx 3 ft above the water hovering, if there was a sound it was a low hum only, but it was running because we saw lights. Those strobing or pulsating on this huge craft are mostly what scared us about it. We couldn't understand how something so big could be so still and so close to the water, without plunging below. Never in our lives had we seen anything like this. We stayed concerned as to what could be looking at us behind those lights. Were there windows behind the lights? I think the lights were around the bottom, but I'd have to be hypnotized to know for sure now, and there could have been port hole windows behind those lights. Imagine a house size dull color steel cake cover. That was how it's body looked and the craft had no visible window, no door, no emblems, letters or number markings from our view. That alarmed me. I wondered out loud how they got in and out of it. I think it was through the bottom which we could not see because it was so close to the water. It could be described as a saucer because it was round, but it had great heigth, at least 2 stories high. I remember the plant had a 2nd or 3rd floor big window, and I wondered does anybody in there see it too? It looked like maybe the staff had gone home but left some lights on inside the plant. I saw no one looking out that window. For a couple of teenagers that had never even discussed UFO's we figured out that it most definitely was a UFO and quickly, and somehow we both just knew it was fueling from the energy currants under the water and able to do this without under. It could have been communicated through a telepathic message, but that's what we both thought it was doing. Nothing about it's appearance was scary other than what was behind those strobing lights that eerie evening in the vacant amber lit parking lot. This was just a matter of minutes and we got so frightened we left and fast too and I suspect it was for the same reason the that car before us did. This is absolutely a true story. This is 2008 and I'm 50."],"Date Submitted":"07/31/1974 12:00 UTC","files":["/var/www/straped/mufon/html2text/11735.html.txt","/var/www/straped/mufon/org/11735.html"],"Sighting Duration":"Undisclosed","Disposition":"Hoax","trends":["There have been 2 other sightings in Duncanville","There were no other sightings in Duncanville on or around July 31st 1974"],"City":"Duncanville","Longitude":"-96.901187","Source":"MUFON","Latitude":"32.65907","Object Shape":"Circle","Tags":"City","Summary":"1974 Mountain Creek Lake - Close view of a UFO hovering 3 ft above water fueling up on energy currants","Weather Factors":"None","Case Number":"11735","Region":"Texas","Object Features":"Dome","Viewing Distance":"21-100 Feet, 101-500 Feet"}