{"trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 30th 1982"],"files":["/var/www/straped/mufon/html2text/11748.html.txt","/var/www/straped/mufon/org/11748.html"],"Region":"Florida","Case Number":"11748","divs":["Sighting DetailsMy nephew and I were on our way home from a youth meeting at church on a wednesday evening during summertime about 7pm. We were driving north on Bumby Ave. just past Grant St. when I looked out the passenger window to the east (for no reason) and above the small orange groove (now a subdivision) I show an object hovering just above the trees. I slowed down and calmly asked my nephew of 11 years to look out his passenger window and describe what he saw. He immediately turned back to me with a scared look on his face (jaw dropped). I said please look again and tell me what you see so I can make sure I am not seeing things. He described the same object I saw. We only saw a side view of the object. The body was cigar shaped and appeared metallic, there was a clear see through bubble on top center, there were lights along the midsection of the main cigar shaped body and there was no noise coming from it. I knew this was not a helicopter or airplane. It was in a location where jets normally use (glide path) to land at Orlando International Airport. The object was not moving in anyway. Just stayed hovering above the trees. I never stopped the car. When I got to the next intersection Bumby St and Kaley, I made a quick U-turn to go back and get a better look. My nephew kept asking me to just keeping heading home but I said I must see what this thing was. But it was gone and no evidence it was ever there. I was never scared, more curious than anything. Strangely there were no other cars or people around. I honestly do not remember the drive home. At the time I lived with my parents at Meridale St. and Illinois Ave. Orlando, Fl. 32803. From where the sighting was to home should have only taken 15-20 minutes but we did not get home until approximately 9pm. As soon as my mother saw us she knew we were upset by something. We told my mother what happened. I think my mother believed us because of how unnerved we were. I have not told many people about this for fear they will think I was some crazy person. To this day my nephew refuses to speak about it. Unfortunately I have no other evidence that this ever happened besides my nephew."],"Summary":"Nephew and I saw unknown cigar shaped object above orange grove.","Longitude":"-81.377056","Viewing Distance":"21-100 Feet","Object Features":"Dome","Latitude":"28.547416","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Weather Factors":"None","Object Shape":"Cigar","Country":"United States","Date of the Event":"04/30/1982 12:00 UTC","Tags":"City","Log Number":"US-07262008-0006","Date Submitted":"04/30/1982 12:00 UTC","City":"Orlando","map":"<A HREF = \"http://maps.google.com/maps?q=28.547416,+-81.377056(11748)&iwloc=A&hl=en\"> mufon case (11748) map </A>"}