{"Date of the Event":"07/03/2008 08:30 UTC","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-07252008-0025","Date Submitted":"07/03/2008 08:30 UTC","Object Features":"Unknown","Region":"California","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.722579,+-117.154575(11742)&iwloc=A&hl=en\"> mufon case (11742) map </A>","Object Shape":"Star-like","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Weather Factors":"Unknown","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around July 3rd 2008"],"Disposition":"Insufficient Data","Summary":"large fleet of ufo's making manuvers","Longitude":"-117.154575","Latitude":"32.722579","City":"San Diego","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI wish to be anonymous, but I thought it important to report this incident. On July 3rd 2008, I and my daughter (an adult) were returning home. The sky was very clear and stary, and my daughter just happened to look up while I was unlocking the front door. She remarked \"ma, is it my imagination, or is that star moving?\" I looked up to where she was looking and sure enough it was moving. This could not have been any plane, because it was obviously near or in the outer atmosphere due to the extreme height of the object. It appeared to look like the rest of the stars. The object moved in a straight line and \"parked next to what I think was Venus since it was a very bright star (sorry, but I'm not an astrologer) and the object seemed to fade in and out then it suddenly took off in another direction with such a speed it was unbeleivable. At that time the object disapeared, but about seven more suddnenly appeared and were moving around each other and then split apart into different directions, also traveling at unbeleivable speeds. Then, about ten more objects joined the first objects and they alternated \"flying\" around and moving in various directions (including at sudden right angles) for about two hours. We sat on the porch and watched this activity until they all suddenly shot off in a cluster toward an Eastern direction and disappeared. While we were watching these objects manuver, they too were fading in and out at times. I wish to add that the rates of speed were so fantastic, and I know this because, it it a great deal of distance from one point to another in the sky, and it took the objects a fraction of a second to cover these distances. I want to stress that these absolutely were NOT planes, as we live in flight paths for both commercial and military aircraft, and both kinds were flying over, and despite how high the planes were they were no where near the distance that the objects were, nor do they act in anyway the same; and they Definately were NOT stars."],"files":["/var/www/straped/mufon/html2text/11742.html.txt","/var/www/straped/mufon/org/11742.html"],"Case Number":"11742"}