{"Date of the Event":"07/16/1988 09:10 UTC","trends":["There has been one other sighting in Mogadore","There were no other sightings in Mogadore on or around July 16th 1988"],"files":["/var/www/straped/mufon/html2text/11743.html.txt","/var/www/straped/mufon/org/11743.html"],"Region":"Ohio","Sighting Duration":"Undisclosed","Log Number":"US-07262008-0001","Longitude":"-81.390318","Viewing Distance":"21-100 Feet","Source":"MUFON","Disposition":"Insufficient Data","City":"Mogadore","Latitude":"41.054705","Summary":"Object just appeared out of no where it was circular a red light in the middle and white lights around it","Object Features":"Unknown","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=41.054705,+-81.390318(11743)&iwloc=A&hl=en\"> mufon case (11743) map </A>","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"11743","Date Submitted":"07/16/1988 09:10 UTC","Country":"United States","divs":["Sighting Detailsthis event took place many years ago i was probably 10yrs old or so I had been visting my grandma with my mother and sister in mogadore Ohio. That night I was siting on a picnic table with my sister and a few of my cousins we where all facing the same direction toward a line of pine trees that was about 25ft away i remember looking down the line at all of there faces when something caught my attention i turned toward the trees and right on top of the tree i saw the object i looked at in long enough to see it was coming right toward us at a very slow speed i only saw half of the object it was circlular there was a red light in the center there where also white lights brighter than the red one that seemed to be moving around the bottom of the craft and it was completely silent i just got up and started running toward the house i dont know if i screamed or what but everyone sitting there with me just followed me into the house the younger kids at that point were crying i was trying to explain to the 4 or 5 adults that where in the house that we had just seen a ufo of course did not belive but not one of them ran out to try to see it they where scarred of course they where saying it could have been a plane, the goodyear blimp, the only problem with that is that we whould have heard either of those from a good distance away and would have not been so startled. This object was right on top of the trees and was totally silent. I have not been able to forget this incident i have contacted the younger of the cousins but they do not remeber. but i have yet to talk to one that was the same age i was at the time So i do not know if she remembers. I just wanted to share my experience maybe someone saw the same thing i did on that night."],"Weather Factors":"None, Does Not Apply"}