{"Region":"Michigan","Longitude":"-84.572308","Case Number":"11754","map":"<A HREF = \"http://maps.google.com/maps?q=46.404123,+-84.572308(11754)&iwloc=A&hl=en\"> mufon case (11754) map </A>","Object Shape":"Disc","Date of the Event":"10/15/1975 12:00 UTC","City":"Brimley","divs":["Sighting Details I recieved a call to go to Alert Status. I was active Air Force as a Weapons Tech. I was trained in Nuclear and Stategic Muntions and delivery. I was trained in TAC but was Transfered to SAC after my return from SEA(South East Asia). I was called to Alert Status, which means I must leave my domicile (in Brilmey) and proceed to my duty station at Kinchloe AFB. I took the back roads to achieve better time. This short cut took me through farmland, in the middle of no subdivisions or close homes. As I proceeded down this road I came across a saucer shaped object in the farm field. It hovered below tree top level. 30 feet or so off the ground. I stopped my vehicle and watched the Craft. It made no noise and was silver metallic. It was no aircraft that I was trained to recognize. I stopped my vehicle and got partically out the car. I had one foot in and one foot out the vehicle. I watched the craft. It was dark as you could be imagined at 3-4 am in the morning in the northeran latitudes. I flashed my vehicle lights off then on. The craft turned a cowling light that shone to the ground, on then off. I repeated the same process, the hovering craft did the same. I waited several minutes. Then looking off to my right I notice two more craft just past a tree line perpendicular to me lifting off the ground beyond the tree line. There where three craft total. As the other two craft climbed to tree top level I realized that I could stay no longer as I would be AWOL if not there with in the time limit of Alert status. Very few people know of this."],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"46.404123","Summary":"Active Air Force called to Alert Status","trends":["There has been one other sighting in Brimley","There was one other sighting in Brimley on or around October 15th 1975"],"files":["/var/www/straped/mufon/html2text/11754.html.txt","/var/www/straped/mufon/org/11754.html"],"Country":"United States","Object Features":"Undisclosed","Disposition":"Unknown","Log Number":"US-07262008-0012","Date Submitted":"10/15/1975 12:00 UTC","Tags":"City","Source":"MUFON"}