{"trends":["There have been no other sightings in Salemburg","This sighting has never been favorited."],"Sighting Duration":"00:00:15","Disposition":"Unknown","Region":"North Carolina","City":"Salemburg","Latitude":"35.015447","Tags":"City","Viewing Distance":"101-500 Feet","Date Submitted":"07/23/2008 10:10 UTC","Log Number":"US-07262008-0008","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.015447,+-78.503062(11750)&iwloc=A&hl=en\"> mufon case (11750) map </A>","Country":"United States","Summary":"Craft flew silently over house.","Source":"MUFON","Longitude":"-78.503062","divs":["Sighting DetailsI had just arrived home from my father's house, who only lives the next block up. I pulled into the yard and parked the car. My son climbed across the seat and sat into my lap. As I opened the car door I happened to glance up and noticed something flying over the house. It was very low and seemed to be very wide. I could distinctly see two white lights, one on each end, running horizontal and directly in the middle was a red flashing light. The white lights were constant and the red light blinked slowly. I watched it as it seemed to glide over the house and past the tree line. It was heading in a Northwest direction. There was no sound, no noise at all. There was complete silence. It's movement made me uneasy as well. It didn't seem to be in a hurry, it just seemed to glide so easily through the air. I have grown up in and around the local military bases all my life. I have never been more than 30 miles from Ft. Bragg, Pope Air Force Base and Simmons Airfield. I am used to and very familiar with the aircraft that flies in and out of this area. This was not like any I had seen or heard before, or should I say didn't hear. I couldn't make out the body of the craft due to a street light in my yard putting off so much light. My heart just stopped, I felt very anxious. I rushed my son into the house and then ran back out the door and into the street. I could not see it. I went back into the house and got my son to bed. I tried to go to sleep myself but found myself feeling so uneasy. I almost felt violated."],"Object Features":"Unknown","Case Number":"11750","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/11750.html.txt","/var/www/straped/mufon/more/11750_submitter_file1__salemburghufo(3).jpg","/var/www/straped/mufon/org/11750.html"],"Date of the Event":"07/23/2008 10:10 UTC","Weather Factors":"None"}