{"Latitude":"44.500769","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Shape":"Triangle","Longitude":"-80.216905","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Other","Country":"Canada","trends":["There have been no other sightings in Collingwood","This sighting has never been favorited."],"Region":"Ontario","divs":["Sighting DetailsDriving up a quiet road on the edge of a huge hill and looked up to see this strange triangular object in the sky, The sky was blue and clear in the late afternoon. we stopped in a driveway I hopped out of the vehicle and got to stare up at it for at least 2 minutes before it slowly started to move away it was completely stationary until I got out and stared at it. we tried to follow it then it started to move quicker then just dissapeared in the blink of an eye. this was one of my best experiences of my life, what a sense of hope you get from being right there looking at something of such a high degree of technology. I knew exactly what it was when I saw it I am very intelligent and understand many things. we are not the only life form in the universe this was very convincing experience. I felt very happy and relieved that I could see such an event before my time on this earth was gone. I wish I could have had a camera but I remember it like it was yesterday."],"Sighting Duration":"Undisclosed","Case Number":"11759","Tags":"City","Date Submitted":"10/11/1995 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.500769,+-80.216905(11759)&iwloc=A&hl=en\"> mufon case (11759) map </A>","Log Number":"CA-07262008-0017","Source":"MUFON","Summary":"Black, Triangular, lights on outer edges of the craft, silent, slowly rotating,","City":"Collingwood","Date of the Event":"10/11/1995 04:30 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11759.html.txt","/var/www/straped/mufon/org/11759.html"]}