{"Viewing Distance":"Unknown","Case Number":"11755","Region":"Texas","files":["/var/www/straped/mufon/html2text/11755.html.txt","/var/www/straped/mufon/org/11755.html"],"Country":"United States","Object Flight Path":"Undisclosed","Tags":"City","City":"Undisclosed","Object Features":"Undisclosed","trends":[],"Date Submitted":"07/13/2008 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.975499,+-99.900263(11755)&iwloc=A&hl=en\"> mufon case (11755) map </A>","Summary":"Huge translucent tentacled creatures in the sky above Austin (go outside: 3:30-5:30 am!)","Latitude":"31.975499","Disposition":"Unknown","Sighting Duration":"12:18:18","Source":"MUFON","divs":["Sighting DetailsI know it sounds insane, and yet I'm never been prone to delusions of this nature. I mean, we all have our hang-ups and personality flaws, but come on,tentacles? I would be totally content to accept that I could just be going a little off my rocker, if it weren't for one thing: I've been meeting other people who see them, as well as corresponding with a photographer who calls his youtube channel \"Disguise of Texas\". He also sees the tentacles, and they are visible at times in his time lapsed videos on youtube. Usually, they move through the sky at a dead crawl, undulating so slowly that their movement can easily be ignored by the unobservant. The tentacles can be seen like a smooth, dark shadow within the clouds. If you watch this smooth, dark shadow I'll never forget the moment I realized the startling truth. I was lying happily on the grass in the shade of an old oak tree at the Barton Springs pool one afternoon, not a care in the world (which, by the way, is how I spend most of my time these days). Although the temperature had rissen above 100 degrees that day, I had been swimming in the 70 degree water on and off all day and so was not at all affected by the sweltering heat. As I lie observing the strange cloud formations in the upper atmosphere, which has been a habit of mine since I first began to notice them a little over a year ago (for all I know, they could have been there for quite a while longer), it suddenly became clear to me that the slender, smooth tubes that I could see running through the cloud bank I was looking at were actually tentacles, connected to something resembling a triangular body.... More on this later. Can you see the repeated shapes in these sunset photos that I found on line? The huge triangular heads and the eyes? I see these all the time at sunset. The tentacles arent too visible in these pictures."],"Date of the Event":"07/13/2008 12:00 UTC","Log Number":"US-07262008-0013","Object Shape":"Unknown","Longitude":"-99.900263"}