{"Latitude":"31.450463","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07262008-0018","Longitude":"-83.508497","divs":["sighting detailsmy three sisters, mother, step-father and myself (12 years of age) were pulling out of the driveway on the way to church when i noticed a silver disc zipping overhead. i alerted everyone that 'there's a ufo overhead'. we stopped the car and everyone got out of the car to observe. there was a scattering of clouds overhead that had to be around 1-1\\2 to 2 miles high and the craft was flying just underneath. it had to be close to one mile high and was travelling from about 30 degrees off the horizon to the around 30 degrees above the opposite horizon in about one second. it would then make a return shot to the other horizon without losing any momentum. it wasn't re-tracing its path but just going extreme distances at extreme speed back and forth. we watched it for around eight minutes until it was decided that we just had to get going and continue on to church. it was sort of a dull silver color and if it was closer it could have been a shinier silver but from our vantage point it was sort of a lead color. also, it wasn't close enough to discern any markings, apertures or other details, just the atypical disc shape. additionally, we didn't notice any noise or exhaust."],"Country":"United States","City":"Tifton","Summary":"Silver disc about 1 mile high flying very fast","Case Number":"11760","map":"<A HREF = \"http://maps.google.com/maps?q=31.450463,+-83.508497(11760)&iwloc=A&hl=en\"> mufon case (11760) map </A>","Object Features":"None","Region":"Georgia","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Tifton","There was one other sighting in Tifton on or around July 10th 1967"],"Source":"MUFON","Tags":"City","Object Shape":"Disc","Weather Factors":"Unknown","Date Submitted":"07/10/1967 12:00 UTC","Disposition":"Hoax","Date of the Event":"07/10/1967 12:00 UTC","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/11760.html.txt","/var/www/straped/mufon/org/11760.html"]}