{"Date of the Event":"07/27/2008 12:20 UTC","divs":["Sighting DetailsI was driving home from Melbourne to Orlando (up I-95) at 12:21 AM when I noticed a bright light low to the north. At first I just assumed it was a plane, with its' landing lights on, heading into either Patrick AFB or Merrit Island airport. As I have been a practicing amateur astronomer for 50 years (and still remain very active at a high level of observing programs and technology...in fact, I have the second- largest privately owned telescope in the state),I knew immediately that this apparition was NOT astronomical in nature. For one thing, it was too low and either stationary or barely moving. I could see the first deck of low clouds BEHIND the object. Again, this could still have been a slow-moving airplane flying directly towards me so that I would not notice any apparent motion. But it just wasn't getting anywhere! Now I'm thinking it's a helicopter, hovering above I-95...maybe a Medevac unit. By bow it is EXTREMELY BRIGHT (estimate magnitude -4)and I realize it is not ONE light source, but TWO...apparently connected by a truss or some sort of shaft or construct. The two main lights are yellowish-white and are so intense that they are causing retinal flaring. Halfway between the two brightest lights is a much fainter one that is blinking red very rapidly. As it still shows no apparent motion I speed up to over 90mph to try and get to it before it an go away. As I get closer, the angle begins to go vertical so I know I about to get UNDER it. One last (head out the window) look tells me it is directly overhead, so I jam the brakes, stop the car and jump out ready to either ID it visually or by sound. I should add that I am also a pilot and my love-affair with aviation goes back as far as my love for astronomy. I mean no arrogance when I say that I can readily identify ANYTHING that flies (at least that we've been told about). My wife and I both are avid \"plane-spotters\" (she worked with the airlines for many years). When e live in California in the 80's, we'd take \"expeditions\" up near Edwards AFB just to see if anything \"new\" was in the air. We saw both the F-117 Stealth Fighter and the B-2 Stealth Bomber several years before they were announced to the public. We certainly did not experience any sense of the unknown at that time as we new perfectly well they were the long anticipated stealth planes. I'm fairly certain I also observed the \"Aurora: hypersonic craft in a nighttime pass over the Antelope Valley. That was all fun. This is not! Back to the chase: I shut off the car, opened the door, jumped out, and the object was GONE! IT HAD BEEN DIRECTLY OVER ME LESS THAN 5 SECONDS EARLIER! I futiley searched the sky for just normal aircraft navigation lights, thinking in HAD been a pland and the high intesity lights had been shut off. Nothing. Then it hit me - THERE WAS ALSO NO SOUND. Had there been a plane (especially a helicopter)that was now flying off I would have clearly heard it. JUST 5 SECONDS FROM \"NOW YOU SEE IT\" TO \"NOW YOU DON'T\". In the aforementioned 50 years of serious astronomy I have seen Comets, Meteors, space junk re-entry into the atmosphere, I know the 100 brightest stars BY THEIR PROPER NAMES and I can tell you almost without thinking where every planet visible to the naked eye IS! I can also identify any airplane known to man BY SIGHT and somejust by hearing their sound (yes even jet engines sound differently and the wind rushing through the various orifices and around the wings and fuselage also makes a sound all its' own) This is the VERY FIRST TIME (out of thousands of hours spent 'under the stars')that I have seen something that I cannot explain. I make no claim that this was an \"alien craft\". Unfortunately the term UFO has become synonymous with \"Flying Saucer\", but what I saw was TRULY just an Unidentified Flying Object. I plotted where I was (and it was) on GOOGLE Earth. When I was directly under it, I was 13 miles from the Kennedy launch complex to the NE and 13 miles to Patrick AFB to the SE. It's almost 7AM...I've been up all night puzzling over this. If there is any correalation with additional reports you may receive, I would appreciate hearing from you."],"trends":["There have been 5 other sightings in Cocoa","There were no other sightings in Cocoa on or around July 27th 2008"],"Object Features":"Other","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-80.741998","Latitude":"28.386116","Summary":"Imagine a majorette's flaming baton. At each end is a tremendously bright light and in between the lights, along the long axis of the baton itself is a fainter, blinking, red light . The object was ~1500' above I-95 and was NOT MOVING.","Object Flight Path":"Stationary","Disposition":"Insufficient Data","City":"Cocoa","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=28.386116,+-80.741998(11768)&iwloc=A&hl=en\"> mufon case (11768) map </A>","Region":"Florida","files":["/var/www/straped/mufon/html2text/11768.html.txt","/var/www/straped/mufon/org/11768.html"],"Tags":"City","Country":"United States","Log Number":"US-07272008-0003","Date Submitted":"07/27/2008 12:20 UTC","Source":"MUFON","Case Number":"11768"}