{"files":["/var/www/straped/mufon/html2text/11763.html.txt","/var/www/straped/mufon/org/11763.html"],"Tags":"City","Summary":"Dissection of possible embryonic entity","divs":["Sighting DetailsWhile looking for my boomerang in some tall grass I found what I initially believed to be an egg. It was about the size of a chicken's egg but was sort of squishy. It was mostly white with a light grey mottled color and had a small, shriveled umbilical about one inch long. I took it to the house and set up a cement block and brought out my dissecting kit. With a scalpal I cut into it to reveal a skin about one mm thick or a little less revealing what looked like fish flesh. You could see an extremely fine tracery of capillaries and it exuded a small amount of a somewhat sticky and clear fluid. Cutting through that revealed a central 'core' of a brilliant orange, three fingered arrangement that clasped a blue sphere. The orange and blue portions were crennelated much as brain matter it and also showed a very fine tracery of capillaried. My mom called me into the house for lunch and upon returning to the front yard I discovered about 10 or 12 cats eating everything but the 'core'! Very disappointed (as I knew my neighbors were both biologists at the local University) I decided to plant the core in a small pot of soil and put it inside the house. About seven days later I realized that that move did not make any sense and took the pot outside and with a spoon carefully scraped the soil out. There was nothing to be found, not even a wet spot. I've been wanting to re-create this object with the appropriately colored clays for years and can do so, just haven't done so yet."],"Region":"Georgia","Disposition":"Hoax","Case Number":"11763","map":"<A HREF = \"http://maps.google.com/maps?q=31.455363,+-83.502157(11763)&iwloc=A&hl=en\"> mufon case (11763) map </A>","trends":["There have been 4 other sightings in Tifton","There were no other sightings in Tifton on or around August 10th 1967"],"Latitude":"31.455363","Object Shape":"Undisclosed","Log Number":"US-07262008-0021","Date of the Event":"08/10/1967 11:30 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown","City":"Tifton","Date Submitted":"08/10/1967 11:30 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-83.502157"}