{"Latitude":"29.956926","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=29.956926,+-90.068632(11766)&iwloc=A&hl=en\"> mufon case (11766) map </A>","divs":["Sighting DetailsNew Orleans July 26, 2008, around 7:40 pm. About a half hour before sunset, with sprinkles of rain, and thunder showers in the area. I went outside in the back garden to look at the sky, which was unusually bright. The low angle of the sun reflecting off the clouds was coloring everything with bright pinkish light. Looking at the clouds above my house to the northeast, I saw a black circle or sphere moving across the sky from east to west. I could see the circular shape very clearly but could not see any depth to say for sure if it was a sphere. It passed almost directly overhead, and I remember it was more like looking up into the blackness of the lens of a camera rather than at a spherical object. It was solid and not billowy like a balloon. My impression was of a surveillance device rather than a vehicle. I could not judge its size or elevation without any reference point, although it was below the clouds. It followed a curving path rather than a straight path, as if it were compensating for flying into the wind. It passed quickly out of view in just a few seconds. Shortly after I lost sight of it a couple of birds flew along a similar path, giving me the impression it was about the same height and scale as the birds. If I had to estimate it I'd say it was more on the scale of a beach ball and in the 200 foot elevation and not a blimp-sized object at thousands of feet. Right after that some menacing dark clouds moved in very quickly from the north and it started raining."],"Date Submitted":"07/26/2008 07:40 UTC","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/11766.html.txt","/var/www/straped/mufon/org/11766.html"],"Log Number":"US-07272008-0001","Source":"MUFON","Country":"United States","Longitude":"-90.068632","Region":"Louisiana","Case Number":"11766","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around July 26th 2008"],"Object Features":"None","Summary":"black dot traveling below clouds","City":"New Orleans","Date of the Event":"07/26/2008 07:40 UTC","Sighting Duration":"00:00:15","Object Flight Path":"Path with directional change","Weather Factors":"Windy, Rain, Light"}