{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/11764.html.txt","/var/www/straped/mufon/more/11764_submitter_file1__P7090085.JPG","/var/www/straped/mufon/more/11764_submitter_file2__P7090086.JPG","/var/www/straped/mufon/org/11764.html"],"Object Features":"Undisclosed","Country":"United States","Weather Factors":"Unknown","City":"Ann Arbor","Date of the Event":"07/26/2008 08:45 UTC","Summary":"Bright Oval Shaped Light in the sky.","Object Flight Path":"Undisclosed","Log Number":"US-07262008-0022","Date Submitted":"07/26/2008 08:45 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.284636,+-83.733248(11764)&iwloc=A&hl=en\"> mufon case (11764) map </A>","Longitude":"-83.733248","Latitude":"42.284636","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around July 26th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Case Number":"11764","Object Shape":"Oval","Disposition":"IFO","Region":"Michigan","divs":["Sighting DetailsI was at home playing Frisbee with my youngest son (12) and we hear a loud jet in the air, it was louder than usual and I caught a glimpse of it and it appeared to be a jet and it was low in the horizon. We did not see much of it but I was assuming it was a military jet because they will buzz through now and then. Maybe every once in a blue moon, but there is an airport about 30 minutes away. 10 minutes later, my wife was driving back from her family reunion in Dearborn and she called me on the phone as my son and I were walking back in the house. She was trying to explain to me that she is looking at three intense spots in the sky that is multi-colored lights. Almost like a transparent smudge but it's appears to be long oval spots. She told me I should go on top of the house and see if I can see it. I did just that and could not see past the large trees. So, my wife came home and drove me towards the main road so I can see what she was talking about. Right then, we only says this faint yellowish, read, light greenish light. I managed to take a picture of it. This elongated oval light seem to just hover in the misty clouds. Just one, not three. The light just eventually seemed to dematerialized or should I say it look like it slowly winked out. I have two pictures of it I managed to take before it did wink out, the Sun was to the right of this picture, but the sun is not in the picture. This was looking WNW from US23 and Exit 41. Not sure if this was a UFO or some type of light anomaly we've never seem before. Never the less, it was strange. No sudden movements from what I saw. I don't have a fancy camera, it's just a Olympus FE-100. I'm not the expert, so here are the pictures."],"Tags":"City"}