{"Viewing Distance":"Unknown","Disposition":"Unresolved","Object Shape":"Sphere","Region":"England","files":["/var/www/straped/mufon/html2text/11769.html.txt","/var/www/straped/mufon/org/11769.html"],"Log Number":"GB-07272008-0004","Latitude":"51.512559","Weather Factors":"None","Object Flight Path":"Undisclosed","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around July 24th 2008"],"Sighting Duration":"00:05:00","Longitude":"-0.118935","City":"London","Case Number":"11769","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.512559,+-0.118935(11769)&iwloc=A&hl=en\"> mufon case (11769) map </A>","Date of the Event":"07/24/2008 12:30 UTC","divs":["sighting detailsmyself and my wife were on our balcony smoking late at night which was clear of clouds. although there is high light pollution in our area we could still manage to see a couple of faint stars in the night sky. there where also several planes flashing away on their normal flight path to heathrow airport which runs around in a circle. i noticed a brighter than usual star which i had not noticed before and pointed it out to my wife. i exclaimed that it was strange to see such brightness considering the light polution around us and pointed out that it could not have been a plane or helicopter due to the lack of flashing etc. as we watched the star, it began to move from it's static position away from us which must have been at speed considering it's height. once this happened i turned to my wife and explained that what we were watching was an honest to goodness ufo and due to it's flight path was definately not usual or normal. the ufo\\star moved away from the sky above straight over trellic tower which is a local landmark in west london. i am sure that other residents must have seen it also. unfortunately i did not have any equipment to hand with which to photograph or film the event. regards"],"Tags":"City","Source":"MUFON","Summary":"starlike Orb in the sky","Date Submitted":"07/24/2008 12:30 UTC","Country":"United Kingdom"}