{"Date of the Event":"08/10/2005 10:30 UTC","Weather Factors":"Unknown","Latitude":"43.496735","Source":"MUFON","City":"Warrensburg","Viewing Distance":"21-100 Feet","Longitude":"-73.776231","divs":["Sighting DetailsOn the night of august 10 2005, A few friends and Myself were relaxing on the front porch of my home when this bizzare incident happened. In this area of Upstate NY there are alot of low mountains and valleys, its a low populated area so there is not alot of light polution. it was a clear night. we were sitting there on the porch when suddenly my friend said look up there! what is that?? i looked up and could not beleive my eyes it was a Large spacecraft flying slowly at about 10 MPH and about 50 Feet above us it was flying through the valley and not above the mountains (possibly to avoid Radar)? there was absolutely no sound what so ever, it was so silent you could even hear the ambeint sounds of the woods behind us crickets and whatnot. but i felt other than fear exitement, a strange electrifying sensation throughout my body, my friends also felt the same. The size of the craft was Astronomical! I know the exact width of the valley and the hight of the 2 mountains im a geologist by trade. valley width 450 meters mountain hight A 118M Mountain B 172 Meters . the crafts tips must of came within 10 meters of touching the 2 mountains! so it was about 420 Meters wide. you must think im crazy by now. it was atleast 3x longer than its width. The craft itself was a different color than the night sky a Deep almost royal purple there was sets of slow pulsing orange lights on the back possibly propultion engines or something of that manner there were windows on the side of the craft or veiwports were i could see the inside of the craft very clearly there were Humanoid forms in the windows standing there gazing out i presume looking at us. we were all very frightened after the incident my freinds decided to leave but i couldnot sleep was too frightend by the whole experience and spent the night sitting on the porch with my 12 gauge shotgun loaded and ready just incase. Despite my effort to stay awake and after a hard days work i fell asleep on the porch, now you would imagine that i would wake up there on the porch in the morning right? simple logic yes? fall asleep in one place and wake up there a few hours you dont need to be A rocket scientist to understand that concept. WRONG! i \"woke up\" A couple of days later August the 12th 930AM according to my watch. in the forrest not dressed in my own clothes a few miles away luckilly for me i was able to find a road and flag down the State police. Unfortunatly for me they pressumed i was an insane homeless man and brought me in for phyciatric evaluation but there tests proved that i was sane. They didnt beleive my story im fearfull of contacting the government or telling anyone else. this has left me tramaticly scarred for the rest of my life. i now live and will most likely die in NYC i feel more comfertable there surrounded by millions of people. and will never go into the countryside again."],"Country":"United States","Object Features":"Window(s), Wings","map":"<A HREF = \"http://maps.google.com/maps?q=43.496735,+-73.776231(11779)&iwloc=A&hl=en\"> mufon case (11779) map </A>","Region":"New York","Log Number":"US-07272008-0014","Case Number":"11779","trends":["There have been 3 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around August 10th 2005"],"files":["/var/www/straped/mufon/html2text/11779.html.txt","/var/www/straped/mufon/org/11779.html"],"Object Flight Path":"Hovering then path,Path then hovering","Object Shape":"Chevron, Triangle","Sighting Duration":"Undisclosed","Summary":"UFO slow Flight/Hovering through the mountains","Tags":"City","Disposition":"Unknown","Date Submitted":"08/10/2005 10:30 UTC"}