{"Viewing Distance":"Unknown","Date Submitted":"07/27/2008 02:27 UTC","Sighting Duration":"Undisclosed","Object Features":"None","trends":["There have been 2 other sightings in Rochelle","There were no other sightings in Rochelle on or around July 27th 2008"],"Object Flight Path":"Straight-line path","Region":"Illinois","Log Number":"US-07272008-0009","Summary":"I was watching a Turkey Vultcure with my bino's and seen the oblect in the back ground","Case Number":"11774","Country":"United States","Object Shape":"Cigar","Disposition":"IFO","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.931138,+-89.058777(11774)&iwloc=A&hl=en\"> mufon case (11774) map </A>","files":["/var/www/straped/mufon/html2text/11774.html.txt","/var/www/straped/mufon/org/11774.html"],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"07/27/2008 02:27 UTC","divs":["Sighting DetailsI was watching a Turkey Vultcure with my bino's and seen an object in the background, Then I focused in on the object for about 9-10 seconnds and watched it disapeer behined a cloud I watched the cloud for about four minutes and it did not re-apper. This all acoured while I sat on my back patio witch faces East. The object moved faster then the airplanes in the area at the time there was one plane very high moving due West to the north of me and another plane moving north above me. the object in question was at about 120 degrees and about 60-65 degrees above the horizion.It looked bright white and lumanesent. and moved from the north to the south when it went behine the cloud, I looked for it to come but it never did, the cloud was not very wide or tall but was conected to a larger cloud I tried to project its path but it never appeared so it must have stopped in the cloud or turned within the cloud. this is something I would not expect a weather baloon or an airplane to do. I could see three sides of the cloud formation with my bino's.By the way I was using Bushnell 10x50 with a feild of 5.5'"],"City":"Rochelle","Longitude":"-89.058777","Latitude":"41.931138"}