{"files":["/var/www/straped/mufon/html2text/11771.html.txt","/var/www/straped/mufon/org/11771.html"],"Date of the Event":"07/25/2008 11:40 UTC","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Tags":"City","trends":["There has been one other sighting in Vega Baja","There were no other sightings in Vega Baja on or around July 25th 2008"],"Disposition":"Unresolved","Region":"","Weather Factors":"Medium","City":"Vega Baja","Object Flight Path":"Unknown","Summary":"a light bright circuling the sky the GONE!!! like in 3 seconds !!!!!!!!!","Log Number":"PR-07272008-0006","Country":"Puerto Rico","map":"<A HREF = \"http://maps.google.com/maps?q=18.444391,+-66.38767(11771)&iwloc=A&hl=en\"> mufon case (11771) map </A>","Date Submitted":"07/25/2008 11:40 UTC","Object Features":"Unknown","Longitude":"-66.38767","Source":"MUFON","Latitude":"18.444391","Case Number":"11771","Sighting Duration":"11:40:00","divs":["Sighting Detailsfriday 25 of 2008 i was outside because a strange lightning broke down the transformator in the sector that is around my house i was playing ds light outside in front of my house then when was 10:00 pm i got into my house again because my dog dalila was scratching the door so i can let her out because she is scare to the dark, but i stayed inside of my house then around 11:57 or 58 i felt like a presence like someone watching me outside my window so i got out to check but nothing! ,i always like to se the sky and stars so i looked up to the sky ,there was like a light bright like yelloish,red and blue it was changing colors so i got impresed so i had my celphone with me so i took the exact time , i was going to record it but is that i couldnt move because of the impresion , the lights started to get a little away so i moved to the center of the street to get a better view , then the lights stated to flow in circules and form diferent patterns i knew that wasnt a common star , the light started to move vertical then dissapears and i was like WHAT!!! where it go! and i looked all over the sky but nothing ,then like in 4 seconds a star that passes like a shooting star super fast but 4 me it wasnt i think it was the ufo that dissapeard seconds ago.after the sighing of that strange lights i run to my parents to say to them mom dad i was outside and something was moving very fast in the sky but they dint believed me they told me that was probbably a jet but i know that wasnt a jet it was moving to fast and dissappeard like in 2 seconds a jet dosent dissapears and it dosent goes too fast! and yeah! im 13 years old but the things is that if you stare at the stars on the night you can totally see them moving so that so not stars the ufos can totally camoflage through the stars so be careful sometimes they are not stars! i say this because last year i was in my houses pool and i always see like around 9:45 stars moving but you have to take time to look at them because the really small ones are the ones that moves i've been experiencing this thing since i was a little girl when i had 6 years old on october 31, I KNOW WE ARE NOT ALONE IN THE UNIVERSE!"]}