{"Date Submitted":"11/30/1969 12:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Sphere, Other","Case Number":"11772","Country":"Australia","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/11772.html.txt","/var/www/straped/mufon/org/11772.html"],"Summary":"Enclosed and lifted a foot or two then reality shifted presumably in time.","Source":"MUFON","Tags":"City","Latitude":"-31.950954","trends":["There have been 15 other sightings in Perth","There were no other sightings in Perth on or around November 30th 1969"],"Disposition":"Unresolved","Region":"Western Australia","Object Features":"Unknown","Weather Factors":"None","Date of the Event":"11/30/1969 12:00 UTC","divs":["Sighting DetailsThis happened when I was nine or ten and for reasons that well I thought I had been rejected by God so I kept quiet. First I knew I was being lifted only a foot or so then as I fell back within my room it closed in like a bubble but the last thing of the bubble I saw was normally quarter of a mile away. Next day slight differences some walls in school different and the wall with gas cylinders gone and curriculum very slightly different. So what I do know is that I heard one sentence like I was an object \"this one well pleases me\" I remember that because the words were in that order. By the time I was teenage I figured it had to do with time and two years ago first looked at science and found we aren't even going in that direction. OK it sounds daft but I have put together an idea that if instead of particles the initial fireball of inflation from the big bang was whirlpools due to localized cool in swirling energy a whirlpool would form. To cut a long story short it goes back to the Einstein idea of wormholes. In order to work the proton formed and the wormhole stretches from the formation in the fireball and reconnects in a six dimension hourglass shape making a connection in time from the beginning of the start of the universe to a reconnection at the end of the dark epoch. So all of time is connected beginning to end and back and that is how structures are formed in time although the tyranny of distance still applies. 1. Check points yes it was dark in my room but I was most certainly awake and sort of separate to the actual lift although I rose upwards and the collapse of the bubble of one reality to this about eight to ten seconds from hearing voice.2. Hard not to notice. 3. Forgive a nine year old I answered are you sure you got the right one? Then it was gone. 4. Not visible just a lifting and the voice then the bubble but I figure the changes were caused by something further back in time because the buildings and curriculum seemed to have been around and not new. 5. Surprise, relief and I didn't move but I could if I wanted to but I didn't go looking for it. Since then other sightings but just distant high altitude so I can't be sure may have been a meteor flash and one time a cloud of ball lightening. Now I am pretty sure about the connection in time forming from the beginning of the universe and reconnecting in the dark epoch. Matter experienced at a node or dimension right angle is still matter so it all works the same way gravity and the forces but the connections in real space are there. The shape is like connecting two Klein bottles together each can be the single side of either a circle or torus and in the case of a torus connect gives an hourglass connecting atomic symmetry. I hope this helps."],"Longitude":"115.866659","Log Number":"AU-07272008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=-31.950954,+115.866659(11772)&iwloc=A&hl=en\"> mufon case (11772) map </A>","City":"Perth","Sighting Duration":"Undisclosed"}