{"trends":["There have been 11 other sightings in Sheffield","There were no other sightings in Sheffield on or around July 27th 2008"],"Object Shape":"Boomerang","Date Submitted":"07/27/2008 08:38 UTC","Viewing Distance":"Unknown","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/11776.html.txt","/var/www/straped/mufon/org/11776.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=53.384829,+-1.462165(11776)&iwloc=A&hl=en\"> mufon case (11776) map </A>","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Case Number":"11776","Date of the Event":"07/27/2008 08:38 UTC","Log Number":"GB-07272008-0011","divs":["Sighting DetailsI WAS SAT OUTSIDE MY HOME WITH MY HUSBAND AND BROTHER IN LAW AND I HAD MY BABY SON ON MY KNEE AND WE WERE LOOKING FOR \"DICKIE BIRDS\" WHEN WE NOTICED THIS STRANGE OBJECT IN THE SKY. AT FIRST WE THOUGHT IT MAY BE PARACHUTERS, BUT THE OBJECTS WERE NOT DECENDING AT ALL. THE OBJECTS WERE ARROW OR BOOMERANG SHAPED AND WERE BLACK IN COLOUR.THE OBJECTS WERE TRAVELING VERY SLOWLY HORIZONTALLY, BUT KEPT MAKING QUICK MOVEMENTS,AS IF BREAKING FORMATION, AND WOULD RISE VERTICALLY QUITE QUICKLY. THERE WERE ABOUT THREE TO FOUR IN TOTAL. IT SEAMPT LIKE THEY WERE SPIRILING UPWARDS AT TIMES. AFTER A COUPLE OF MINUETS OF OBSERVING THEM MY HUSBAND WENT IN SEARCH OF THE BINOCULARS. NO SOONER HAD HE GOT IN THE HOUSE THAT THERE THEN APPEARED WHAT I CAN ONLY DESCRIBE AS A BRIGHT ORB. THIS ORB TRAVELLED TOWARDS THE OBJECTS IN A STRAIGHT LINE THEN WENT IN AN ARCH OVER THE OBJECTS AND CONTINUED ON ITS HORIZONTAL COURSE THEN DISSAPEARED. BY THIS TIME MY HUSBAND HAD RETURNED WITH THE BINOCULARS AND TRIED TO FOCUS ON THE OBJECTS. BUT AS THE BINOCULARS ARE NOT VERY POWERFUL THE OBJECTS WERE TOO FAR AWAY FOR THEM TO FOCUS PROPERLY. HOWEVER MY HUSBAND DESCRIBED WHAT HE SAW AS THREE DARK ARROW HEAD SHAPED OBJECTS. WE WATCHED THE OBJECTS FLY SLOWLY AWAY UNTILL THEY DISSAPEARED FROM SIGHT. NONE OF US COULD SAY WHAT THESE OBJECTS WERE EVEN THOUGH WE OBSERVED THEM FOR ABOUT 8 MINS.WE ALL AGREED WE HAD NOT SEEN ANYTHING LIKE IT BEFORE.IT WAS DEFINATELY A VERY STRANGE EXPERIENCE."],"Latitude":"53.384829","Tags":"City","Longitude":"-1.462165","Region":"England","Summary":"OBJECTS FLEW AT LOW LEVEL VERY SLOWLY IN ARROW FORMATION, THERE WAS NO TRAIL BEHIND AND THEY ROSE AND FELL QUICKLY","Sighting Duration":"Undisclosed","City":"Sheffield","Object Flight Path":"Undisclosed"}