{"Sighting Duration":"00:00:10","City":"Fort Lauderdale","Weather Factors":"Lightning","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.123938,+-80.135479(11788)&iwloc=A&hl=en\"> mufon case (11788) map </A>","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Tags":"City","Date Submitted":"07/27/2008 02:05 UTC","Longitude":"-80.135479","files":["/var/www/straped/mufon/html2text/11788.html.txt","/var/www/straped/mufon/org/11788.html"],"Summary":"Cone shaped, greenish-yellow, light beam","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around July 27th 2008"],"Object Features":"Other","Log Number":"US-07282008-0008","Latitude":"26.123938","Case Number":"11788","Object Flight Path":"Other","divs":["sighting detailswe were driving back from cruising down a1a to south beach. we decided to return home on i-95 northbound to deerfield beach. as we admired the light show of the lightning reflectons behind each individual cloud, i noticed, though, that the clouds were no longer individually placed against the sky. they had now converged over a certain area. none of the lightning was touching down to earth. a coned\\cylindrical shaped, greenish-yellow light beam was projected down from the converged clouds onto an area of ft. lauderdale. the beam was rather wide. we were about 4-5 miles away, i would guess. this beam was too wide to be from a helicopter, it came from way too high and was not copter quality light. it was not transluscent. i am very familiar with those search lights which come out yellowish white or white. there was no copter during or after the phenomenon. this beam just shone down and did not search around. it lasted about 2-3 seconds. we all were stunned. i said, \"ughhhhh, hmmm, that was not a search light, now, was it?\" all answered, \"no!\" my friend in the front seat cautious and in disbelief asked, \"soooo, what exactly was it.\" i answered, \"welll, could be one of two things..... a ufo or black budget electro-magnetic experiments with the weather? not sure exactly what a beam would be doing coming from that but my guess was a shot in the dark. i have already seen ufos as reported by the government in peru while i was there. now i can say i have seen the beam. i hope never to see them together!!!!! peace be with us all"],"Date of the Event":"07/27/2008 02:05 UTC","Country":"United States","Object Shape":"Cone","Region":"Florida"}