{"City":"Waverly","Tags":"City","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Waverly","This sighting has never been favorited."],"Latitude":"36.083949","Disposition":"Unknown","Date of the Event":"08/20/2007 08:30 UTC","Object Features":"Unknown","Case Number":"11781","divs":["Sighting DetailsLate aug. of 2007 my wife, my son, and myself were fishing on the Duck river bank facing east right about dusk. It was not quit dark out yet and cloudy when we saw a very bright orange burst of light shoot straight across the horizon low in the sky directly infront of us, but a long ways off. (kind of like the sun but not as intense) It disappeared within 2 seconds. We were still looking up at the sky and about 3 seconds after seeing the fireball an object that was grey or almost the exact same color of the evening sky shot by us at an extreme rate of speed. The object was 10' infront of us and about 20-30' up. We were fishing at a place on the river were the river makes about a 90 degree bend. The object seemed to be following the river at a speed so fast that we could not even make out a shape only a color. It was well below the top of the trees, there was no sound and no wind what so ever from the object. Do to the rate it was travling it makes guessing the size very hard. Best guess about as long as a VW bug but not as tall. If we had not been looking upwards anyway we would had never known it passed over. There were no lights on it that I could see and do to the rate of speed and a river bank full of trees it was gone in one second. There wasn't any time for reaction it was over quickly. None of us felt scared just amazed."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.083949,+-87.794747(11781)&iwloc=A&hl=en\"> mufon case (11781) map </A>","Log Number":"US-07282008-0001","Source":"MUFON","Weather Factors":"None","Object Shape":"Fireball, Other","Longitude":"-87.794747","Summary":"Fire ball in the sky long ways off then small object less than 40' away 200+miles an hour","Viewing Distance":"21-100 Feet","Sighting Duration":"00:00:30","Region":"Tennessee","Date Submitted":"08/20/2007 08:30 UTC","files":["/var/www/straped/mufon/html2text/11781.html.txt","/var/www/straped/mufon/org/11781.html"],"Country":"United States"}