{"map":"<A HREF = \"http://maps.google.com/maps?q=34.272967,+-118.776262(11787)&iwloc=A&hl=en\"> mufon case (11787) map </A>","Country":"United States","divs":["sighting detailsi was getting ready to go to work at the telephone company. i was sitting watching the nightly news and felt a humming sound\\sensation. i went to the back yard and witnessed a huge rectagular craft hovering over the house. it was very, very large (football size?) and very, very quiet. just that humming sensation and slow gliding motion. there were \"windows\" on the side, lights that were fairly dim, no flashing. i watched it glide over for several minutes. when it was approximately over several streets away it just took off and was out of sight in seconds. no noise, no flashing lights, nothing. of course to this day my family thinks i am nuts, or they pat me on the head and say, yes, yes, we know. but............i saw something!!!!!!!!!!!!!! oh yes, the underside appeared to have ridges or indentations. when i got to work i mentioned what had happened to one of my co-workers. she said her husband said he thought he had seen a \"ufo\" at the same time when he was taking out the trash. there were reports several days later that some simi valley police had tried to chase a \"ufo\" but it was too fast and disappeared. that was the last time it was ever mentioned publicly."],"files":["/var/www/straped/mufon/html2text/11787.html.txt","/var/www/straped/mufon/org/11787.html"],"Viewing Distance":"Unknown","Longitude":"-118.776262","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","City":"Simi Valley","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around November 30th 1983"],"Source":"MUFON","Latitude":"34.272967","Log Number":"US-07282008-0007","Object Features":"Window(s), Patterned Surface","Summary":"object hovered over house then zipped away fast","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"11787","Tags":"City","Date of the Event":"11/30/1983 12:00 UTC","Object Flight Path":"Hovering then path","Region":"California","Date Submitted":"11/30/1983 12:00 UTC"}