{"Sighting Duration":"Undisclosed","Weather Factors":"None","Latitude":"40.763844","divs":["Sighting DetailsAt approximately 10:30pm on April 15th, my husband and I heard a loud boom that sent us flying off of the couch. It shook the house and sounded like something had exploded. I immediately went outside but could hear no sirens only the faint sound a plane's engine. Having experienced many sonic booms I was shaken by this boom. It was definitley different. When I went to work the following morning (Wednesday),in Kokomo, no one had heard anything the previous night. I went back home that evening and did not hear anything on Wednesday night. However, upon returning to work on Thrursday, everyone one in Kokomo was talking about the boom on Wednesday evening! I was very intrigued by this. When I returned home from work that night there was definitey increased plane activity in the sky. These were jets, F-16's not the everyday plane you hear crossing the sky. As it got dark, I was talking on the phone to my mother who lives in Kokomo. I was shocked when she began to become very excited about orange lights she was seeing in the sky. I immediately went outside and looked to the southwest sky. Through the trees I saw a single orange sphere. It was larger than a star and was not constantly lit. I had been looking through a large open area of the tree and this orange light slowly came on, achieved it brightness and then dimmed again. I only saw one light, it was stationary and unlike anything I had ever seen. My mother saw 10-12 of the same type of lights that I saw. I felt then and still feel that I saw something unexplained. I wondered if there could be a connection between the booms heard in Logansport and in Kokomo and was very curious about the increase in plane activity that night."],"Object Flight Path":"Stationary","Source":"MUFON","City":"Logansport","Viewing Distance":"Over One Mile","Region":"Indiana","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around April 15th 2008"],"Longitude":"-86.355266","Summary":"Boom heard in Logansport the night before Kokomo boom.","Country":"United States","Date of the Event":"04/15/2008 10:30 UTC","Case Number":"11796","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.763844,+-86.355266(11796)&iwloc=A&hl=en\"> mufon case (11796) map </A>","files":["/var/www/straped/mufon/html2text/11796.html.txt","/var/www/straped/mufon/org/11796.html"],"Date Submitted":"04/15/2008 10:30 UTC","Tags":"City","Object Shape":"Sphere, Other","Log Number":"US-07282008-0016","Disposition":"Unknown"}