{"Country":"United States","Region":"Illinois","trends":[],"Longitude":"-89.392158","Case Number":"11792","Date Submitted":"07/28/2008 12:00 UTC","divs":["Sighting DetailsAt 11:45 a.m. Monday, July 28, 2008 - My 10 year-old son came to tell me he saw a \"very metallic\" silver-colored UFO. He saw it for about 5 seconds, and it disappeared. He observed the object moving northeast, (we are about 5 miles northeast of O'Hare) in a wavelike rhythm, small wave, big wave, small, big, big, big. By his description, it could have gone from O'Hare towards Lake Michigan somewhere around the Wisconsin border in this time. We sent outside and looked in the area he saw it disappear. (Totally clear sky today) Within 2 minutes, we both saw the same object my son described, rectangular, with rounded edges. That is called a cylinder as we looked it up. It was not shiny, it was paler, gray, and but became paler, blending in an opague fashion against the clear sky as it was moving due north for about 5 seconds and we watched it disappear from our view. The color contrasr was interesting as in the short distance it went, it first was pale gray and hard to describe, wither changing color or dematerializing type effect. (going up?) It was traveling northeast from the northern point of O'Hare Airport. He observed the object for approximately 5 seconds, moving in a wavelike rhythm, small wave, big wave, small, big, big, big. We are 5 miles from O'Hare. I do not know how to interperet size. We all know what an airplane looks at 35,000 feet against clear skies, as you cannot see 3d. This was way up there, as far as we could see. If you put your hand up, to measure with a thumb and forefinger, it's a good 2.5 inches. By this measure it had to be a huge object. How far can we see in a blue sky x 2.5 inches. Very intriguing.."],"Date of the Event":"07/28/2008 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Cylinder","Object Features":"Undisclosed","Summary":"cylinder shaped UFO, seen twice, Edison Park, Chicago near O'Hare Airport","map":"<A HREF = \"http://maps.google.com/maps?q=40.636835,+-89.392158(11792)&iwloc=A&hl=en\"> mufon case (11792) map </A>","files":["/var/www/straped/mufon/html2text/11792.html.txt","/var/www/straped/mufon/org/11792.html"],"Tags":"City","Weather Factors":"Unknown","Log Number":"US-07282008-0012","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"40.636835","City":"Undisclosed","Disposition":"Unknown"}