{"Source":"MUFON","Date Submitted":"07/28/2008 09:45 UTC","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=42.588324,+-95.967516(11798)&iwloc=A&hl=en\"> mufon case (11798) map </A>","Weather Factors":"None","Date of the Event":"07/28/2008 09:45 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Case Number":"11798","Country":"United States","divs":["Sighting DetailsI was out in front of my house putting things in my car getting ready to go to work. I looked up at the sky, between the house and the church, to see if it was cloudy or clear. It was cloudy. Saw the two flashes of light going in a west north west direction. First thought was a firefly but I don't think they fly that high and that fast or in a very straight line. Next thought was an aircraft but the distance and speed between the flashes appeared too fast and too far apart for any airplane that may be in the area. (No more fighter jets at the Air Guard base in Sioux City.) Also, there was no noise associated with the flashes of light. Finally, I thought maybe a shooting star. Do shooting stars flash multiple times? Not sure. Do shooting stars appear under cloud cover? Probably. I did see a shooting star earlier in the week, but it was a clear night and the shooting star was a nice bright streak that fragmented at the end. What I saw last night was two flashes that appeared quickly in a straight line. I lost sight of whatever it was as it went over my house. I know this doesn't seem like much of a sighting, but it did get me thinking. What was the air traffic like in the area at that time? Why wasn't there any noise? How fast was it going? Was it truly a UFO or something mundane? I would like to know if anyone else saw this as well."],"files":["/var/www/straped/mufon/html2text/11798.html.txt","/var/www/straped/mufon/more/11798_submitter_file1__003.JPG","/var/www/straped/mufon/org/11798.html"],"Disposition":"Insufficient Data","Tags":"City","City":"Kingsley","Sighting Duration":"Undisclosed","Latitude":"42.588324","trends":["There have been no other sightings in Kingsley","This sighting has been favorited 1 time."],"Summary":"Two rapid flashes in a row in a straight line going WNW.","Log Number":"US-07292008-0002","Object Shape":"Flash, Star-like","Longitude":"-95.967516","Object Features":"Unknown"}