{"Object Shape":"Cigar, Triangle","Case Number":"11800","Region":"New York","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less, 21-100 Feet","Latitude":"42.656279","Source":"MUFON","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/11800.html.txt","/var/www/straped/mufon/org/11800.html"],"City":"Albany","Sighting Duration":"Undisclosed","Log Number":"US-07292008-0004","map":"<A HREF = \"http://maps.google.com/maps?q=42.656279,+-73.753202(11800)&iwloc=A&hl=en\"> mufon case (11800) map </A>","Object Features":"Patterned Surface","divs":["Sighting DetailsAT APPROX. 6:00 SAT. AFTERNOON, i NOTICED AN UNUSUAL JET-ENGINE SOUND FROM ALBANY AIRPORT.I THOUGHT THAT A COMMERCIAL PLANE MIGHT BE TAKING OFF IN A DIFFERENT DIRECTION BECAUSE OF THE STORM. AT 6:30, AS THE SOUND CONTINUED, I LOOKED OUT MY SOUTH FACING BATHROOM WINDOW, AND SAW 2 F-15 EAGLES FLYING IN FORMATION DIRECTLY OVER MY HOUSE. THEY MADE TWO PASSES, AND AFTER THEY FLEW BY THE SECOND TIME, I HAPPENED TO SEE AT THE TOP OF THE CLOUD, THE CIGAR SHAPED OBJECT. IT WAS THE SAME COLOR AS THE CLOUD TOP- AN IVORY WHITE COLOR,AND WAS DEVOID OF ANY WINGS OR TAIL CONTROL SURFACES. I COULDN'T SEE ANY PORTHOLES, BUT IT CLEARLY WAS NOT A COMMERCIAL AIRLIINER. IT WAS MOVING DUE SOUTH, AND I LOST SIGHT OF IT AS IT WENT BACK INTO THE CLOUDS. I CALLED SEVERAL TV NEWS STATIONS, AND CHANNEL 10 SAID THAT THEY HAD RECEIVED NUMEROUS CALLS ABOUT THE FIGHTERS, BUT I WAS THE ONLY ONE WHO SAW THE OBJECT. CHANNEL 10 WAS ALSO TOLD THE THE JETS WERE CONDUCTING \"TRAINING EXCERCISES\". I ASKED THE PERSON IF HE REALLY THOUGHT THAT THE AIR FORCE WOULD BE CONDUCTING TRAINING EXCERCISES IN COMMERCIAL AIRSPACE LIKE THAT. THE OBVIOUS ANSWER IS NO- THE USAF WAS SCRAMBLED UP THERE!! ALSO, I GUESS IT JUST A MATTER OF TIME UNTIL I SAW THE \"MOTHER SHIP\", AS THERE HAVE BEEN NUMEROUS PERSONAL SIGHTINGS OF VARIOUS OBJECTS IN THE LATHAM AREA. WILTON MAKES LATHAM LOOK LIKE O'HARE BY COMPARISON!!"],"Longitude":"-73.753202","Summary":"CIGAR-SHAPED OBJECT AT TOP OF STORM CLOUD","Date of the Event":"07/26/2008 06:30 UTC","Country":"United States","trends":["There have been 19 other sightings in Albany","There were no other sightings in Albany on or around July 26th 2008"],"Disposition":"Unresolved","Date Submitted":"07/26/2008 06:30 UTC","Tags":"City"}