{"Region":"England","trends":["There has been one other sighting in Cromer","There were no other sightings in Cromer on or around July 28th 2008"],"divs":["sighting details10:15 p.m. dark sky ,hazy no stars .walking dog on top of low cliffs in westerly direction.dog looked up and i saw almost circular red\\orange object with dotted lights extending in a fan shape above circle.approaching land from north at small aircraft speed.no sound.looked about 1,000 up but that is a guess.extended arm and made a fist. sighted object which appeared to fill space between two knuckles. approaching land it slowed and turned due west ,fan lights went out and it accelerated at fighter jet speed or more .approx angle of ascent 30 degrees from horizontal.faded to pin point and disappeared. wind was from east ,only force 2 to 3. i saw 4 people ahead of me and hurried to catch up.they saw exactly the same phenomenon as myself but spotted it earlier than me when \"it was coming directly at us at very high speed.it slowed as it approached land\" they had thought, as i had it was a hot air baloon illuminated by the \"burner\".but it flew at 90 degrees to the light wind and ascended at a speed which would shred a baloon. i live on heathrow and gatwick flightpaths with a military base nearby so am familiar with aircraft and helicopters in all weather conditions. was it a weather baloon or dirigible? no - too fast. an unmanned drone .possible but why illuminate a military craft? a laser light show.that was all that happened.usually they go on for very much longer. lastly \"ball lightning \". i have read of this but have no experience. later at 3:45 a.m. a small storm of lightning and thunder occurred but lasted only half an hour or so. i reported the occurrence to a local paper but they had no other reports. as an interested amateur astronomer i was very interested.no meteor or other such phenomenon would perform in the observed manner.the perseids are not prolific until later in the month. any similar reports.? i came home and talked to some friends who told me they had seen a very similar thing in northern france two weeks ago but it was much nearer and appeared to fill the width of a narrow lane they were walking down.one described my \"fan\" shape as like the shape of a shell petrol logo."],"Case Number":"11805","Weather Factors":"Unknown","Longitude":"1.301866","files":["/var/www/straped/mufon/html2text/11805.html.txt","/var/www/straped/mufon/org/11805.html"],"Source":"MUFON","City":"Cromer","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=52.931448,+1.301866(11805)&iwloc=A&hl=en\"> mufon case (11805) map </A>","Tags":"City","Date Submitted":"07/28/2008 10:15 UTC","Latitude":"52.931448","Log Number":"GB-07292008-0009","Sighting Duration":"00:11:00","Country":"United Kingdom","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Summary":"Object approached coast from seaward (North) Circular Orange/Red with fan shaped smaller lights above main circle..No sound.At landfall turned sharp West , ascended at considerable speed.","Date of the Event":"07/28/2008 10:15 UTC","Object Features":"Appendage(s)"}