{"Date Submitted":"11/30/1976 01:00 UTC","Longitude":"-81.776511","Object Shape":"Blimp, Bullet, Missile, Cigar, Cylinder","Weather Factors":"None","Country":"United States","City":"Key West","Object Flight Path":"Stationary","Latitude":"24.560002","Log Number":"US-07292008-0007","Sighting Duration":"00:03:00","Summary":"metallic object seen hovering partly over residence and Gulf of Mexico, no sound","Tags":"City","Source":"MUFON","Case Number":"11803","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around November 30th 1976","This sighting has never been favorited.",""],"divs":["sighting detailsthis happened a very long time ago. i know it happened sometime in the early seventies, up to 1977, i really don't remember which year. i was travelling with my then husband in a pick-up truck ging south to key west. he was driving, i was the passenger. it was daylight, a clear day, about 1 pm. as we were coming off one of the numerous bridge spans in the keys, to my right, above a residence on a key, on the gulf side, bordering the gulf, half on top of the house and half on top of the water, i could not help but notice a huge metallic object hanging there in the sky, very close to the house and water, just hovering, probably 3\\4 of it enshrouded in clouds. the part i could see below the cloud cover looked like the bottom part of a missile, or the tail of a blimp, but it was upright. this is the only part i could see. it was huge. stationary. i rolled down my window to get a better look. there was absolutely no sound to it,and i was close enough that i should have been able to hear something of that size if it was generating any noise. lots of people were pulled over on the side of the road looking up at it, pointing, but my husband was terrified, and despite my begging, he would not pull over and just floored it away from there. i was so excited, something i'd never seen before, i thought it was a ufo. i looked back as we were driving away, and it just vanished. i remember checking all the papers on the rest of our trip, but never could find any report about it. i never reported it. but all i know is that the rest of the trip i only looked toward the skies. in recent years, i've checked on the computer to see if i could find a reporting of this, but i've had no luck."],"Region":"Florida","Object Features":"Appendage(s)","Date of the Event":"11/30/1976 01:00 UTC","files":["/var/www/straped/mufon/html2text/11803.html.txt","/var/www/straped/mufon/more/11803_submitter_file1__GemmaKoblentz039.jpg","/var/www/straped/mufon/org/11803.html"],"Disposition":"Unknown","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=24.560002,+-81.776511(11803)&iwloc=A&hl=en\"> mufon case (11803) map </A>"}