{"map":"<A HREF = \"http://maps.google.com/maps?q=44.059879,+-123.078574(11802)&iwloc=A&hl=en\"> mufon case (11802) map </A>","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Undisclosed","Date Submitted":"07/28/2008 11:00 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/11802.html.txt","/var/www/straped/mufon/org/11802.html"],"trends":["There have been 68 other sightings in Eugene","There were no other sightings in Eugene on or around July 28th 2008"],"Country":"United States","Longitude":"-123.078574","divs":["Sighting DetailsFirst I want to say that I am open minded but don't believe whole heartedly in ufos or the paranormal. Both sightings were very close to each other. The first one I was resting out very late at night, close to an old school I knew from childhood. I lay my head up against a mound of dirt and grass, the playground to my right. Looking up at the sky littered with stars I saw an object that was moving. This object was small and moving in many different directions as if it were a living being. It changed shape, became elongated wove in and out of clouds. This could have easily been something explainable i suppose...a meteor or comet entering the earths protective layer...or maybe just my eyes playing tricks, but they usually don't. The next sighting I saw while I was sitting outside of my house. There I sat in a white lawn chair, looking up at the sky I saw an object move and stop move and stop, also lights beneath and to the sides and bottom of the object were noticable but strangely so. What I'm trying to say is that there were very faint things like blurbs of light going on beside the object. Were these sightings not from this earth? I don't know, I find it unlikely though that human beings having been on this earth for such a long time that now all of a sudden we're starting to provoke a greater frequency of sightings. Or perhaps it's something the government is doing...yes i believe that is more likely. Sorry no photos digital cameras are too expensive :("],"Case Number":"11802","Log Number":"US-07292008-0006","Source":"MUFON","Latitude":"44.059879","Date of the Event":"07/28/2008 11:00 UTC","Summary":"Two ufo sightings over Eugene, Oregon","Disposition":"Insufficient Data","Weather Factors":"Unknown","Region":"Oregon","Sighting Duration":"00:20:00","Tags":"City","City":"Eugene"}