{"City":"Allen","Tags":"City","Object Flight Path":"Path then hovering","Object Features":"Patterned Surface","Date Submitted":"07/29/2008 02:07 UTC","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Region":"Texas","Country":"United States","Viewing Distance":"Over One Mile","Summary":"Saw an object with rows of red lights and a row of white lights in a \"V\" shape on belly","Disposition":"Unknown","Longitude":"-96.67055","Latitude":"33.103174","Log Number":"US-07292008-0005","files":["/var/www/straped/mufon/html2text/11801.html.txt","/var/www/straped/mufon/org/11801.html"],"Source":"MUFON","divs":["Sighting DetailsI was on my back porch late Monday evening, and early into Tuesday, when I noticed something moving across the sky that appeared unusual. I noticed planes and are easily identified, but this one stuck out. The colors were spectacular, so I continued to watch it. There was a row or strobing red lights that were very definitively ball shaped on both sides. The belly had a row of white lights that was in the shape of a \"V\" pattern. The exact shape was hard to describe, because the the strobe was very distracting. When I first noticed it, I thought that it might be a satellite, then it stopped moving, went backwards, then continued at an incredible rate of speed. It did this several times. It startled me, and it did not know how to react. I was a little scared to be honest. I have never seen anything like this. I had stood up to go back into the house when I noticed it had stopped again. Then it took off faster than anything I have ever seen, and disappeared out of sight behind trees."],"trends":["There have been 5 other sightings in Allen","There were no other sightings in Allen on or around July 29th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.103174,+-96.67055(11801)&iwloc=A&hl=en\"> mufon case (11801) map </A>","Object Shape":"Flash, Square, Rectagular, Other, Unknown","Case Number":"11801","Date of the Event":"07/29/2008 02:07 UTC"}