{"Disposition":"IFO","Date of the Event":"07/29/2008 11:15 UTC","Object Shape":"Flash, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=45.664682,+-97.049805(11815)&iwloc=A&hl=en\"> mufon case (11815) map </A>","Summary":"looking up I saw awhite spherelike lit up object way up with a blinding flashing white light","divs":["Sighting Detailslooking up I noticed a lighted sphere-like object that flashed a blinding white light only, every 3 seconds silently streaming across the sky, after a long hot day I wanted to cool off outside my home, the stars were out bright. I was standing outside my back door looking up to the east direction the lit up object was cruising south to north. I noticed it because the stars were so bright and none were moving only this one and fast. I thought the object was a satellite but then it flashed this bright light that looked amazingly bright for any plane I have ever seen. I watched this thing for 10 seconds then it just disappeared from my view and usually I notice you can track a plane all the way across the sky,there was something about it that was so different,from your ordinary object that you would see in the sky. I am 37 and sky watch alot since I live in a very small town not much lights here on reservation land. I was speechless as I ran in the house to tell my husband and sister, shaky andin disbelief of what just transpired outside my home in the air."],"Viewing Distance":"Over One Mile","Case Number":"11815","Source":"MUFON","Weather Factors":"None","City":"Sisseton","files":["/var/www/straped/mufon/html2text/11815.html.txt","/var/www/straped/mufon/org/11815.html"],"Tags":"City","Log Number":"US-07302008-0002","Sighting Duration":"00:00:10","Object Flight Path":"Straight-line path","Longitude":"-97.049805","Region":"South Dakota","Date Submitted":"07/29/2008 11:15 UTC","Country":"United States","trends":["There have been 2 other sightings in Sisseton","There were no other sightings in Sisseton on or around July 29th 2008"],"Object Features":"Undisclosed","Latitude":"45.664682"}