{"divs":["Sighting DetailsWhile out getting my mail tonight I looked up to see some sort of object floating by overhead up in the sky. It is a very clear night with no clouds, little to no wind, and no moon. I thought it was a blimp or advertising balloon but then it started rotating on an axis and those things don't do that, nor did I see any navigation lights on this object. Plus its rate of movement was more on the order of a small plane or helicopter rather than blimp. The object was very dim in the sky but I could make out some sort of pattern of very dim lights or somesuch on its surface. I've seen advertising banners like this so I still think it might be that since the pattern on the object looked very much like what you would see on a Goodyear blimp (which I've seen numerous times at night), but the object was much longer, more like a towed banner. Time was 9:40PM, location Fair Oaks & Highway 101, direction the object was moving at a steady rate S-SE (the general direction of the wind), speed unknown but being so dim it left my visibility in about 1 minute when it moved near our complex's tennis court lights. Apparent size was about the width of 2 or 3 fingers overhead (unfortunately I didn't have the presence of mind to do this while viewing the object). Altitude unknown but not low. No noise."],"Log Number":"US-07302008-0004","Region":"California","Longitude":"-122.03392","map":"<A HREF = \"http://maps.google.com/maps?q=37.37763,+-122.03392(11817)&iwloc=A&hl=en\"> mufon case (11817) map </A>","Weather Factors":"None","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Sunnyvale","There were no other sightings in Sunnyvale on or around July 29th 2008","This sighting has never been favorited.",""],"Object Shape":"Square, Rectagular","Country":"United States","Sighting Duration":"00:01:00","Case Number":"11817","Date of the Event":"07/29/2008 09:40 UTC","Tags":"City","Viewing Distance":"Unknown","Summary":"dim object with some sort of light pattern sighted moving overhead at night","City":"Sunnyvale","Date Submitted":"07/29/2008 09:40 UTC","files":["/var/www/straped/mufon/html2text/11817.html.txt","/var/www/straped/mufon/more/11817_submitter_file1__ufo.png","/var/www/straped/mufon/org/11817.html"],"Latitude":"37.37763","Object Features":"Patterned Surface","Source":"MUFON","Disposition":"Hoax"}