{"Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Object Shape":"Disc","Case Number":"11814","Date of the Event":"10/31/1979 08:45 UTC","Latitude":"38.897322","Longitude":"-77.029186","divs":["sighting detailsi was walking in the town of olympia wa going to a birthday party with my friend\\roommate and expecting to arrive at about 9 pm. we noticed a saucer shaped craft, bluish in color with a dome top, hovering over a tree nearby (difficult to judge distance). it was slightly tilted to the right. i do not remember what caused us to notice it. i think i pointed it out to him. we watched it for what seemed like 15 to 30 seconds. we watched the lights of the craft (there were three in an upsidedown triangle shape) change positions with each other a few times. it then slowly moved upwards and to my right and then it shot off at a 2:00 direction and disappeared. it was completely silent. i said to my friend. \"what was that?\" and he said, \"i don't know.\" on some level i was certain it was a ufo but it was as if i didn't really care. this is strange to me. we never spoke of it after that night. we went to a party and i soon realized it was a party in full swing. i was very confused because i expected to be one of the first guests but instead there were many people there, food and drink already consumed, and people saying to us \"oh you made it\" ect. i looked at a clock and noticed it was between about 11 pm (somewhere between 11 and 11:20 pm). i mentioned to my friend\\roommate \"do you know it's 11:00?\" and he said in a surprised manner, \"yeah, i know.\" we had \"lost\" about two hours. i subsequently became very psychically intuned and believe that they gave me a certain cosmic type consciousness. i have not seen them sense that time."],"Object Features":"Dome","City":"Washington","Log Number":"US-07302008-0001","Source":"MUFON","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around October 31st 1979"],"files":["/var/www/straped/mufon/html2text/11814.html.txt","/var/www/straped/mufon/org/11814.html"],"Summary":"I saw a small craft hovering by a tree with no sound. It had three lights in the shape of an upsidedown triangle. the lights changed position. We watched for about 30 seconds then it moved slowly to the right, shot off at a 2:00 direction, and vanished","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.897322,+-77.029186(11814)&iwloc=A&hl=en\"> mufon case (11814) map </A>","Object Flight Path":"Hovering then path","Region":"Washington","Tags":"City","Disposition":"Unknown","Date Submitted":"10/31/1979 08:45 UTC"}