{"trends":["There have been 16 other sightings in York","There were no other sightings in York on or around July 25th 2008","This sighting has never been favorited.",""],"Object Shape":"Boomerang, Disc, Sphere","Case Number":"11811","Summary":"Changing shape in the south from 4 lights to less, something shot out of cluster of 4 - turned on edge looked like saucer - lights mostly in a V formation","Source":"MUFON","files":["/var/www/straped/mufon/html2text/11811.html.txt","/var/www/straped/mufon/more/11811_submitter_file1__DSC00037(1).JPG","/var/www/straped/mufon/org/11811.html"],"Viewing Distance":"Unknown","Longitude":"-76.722485","Date Submitted":"07/25/2008 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.969508,+-76.722485(11811)&iwloc=A&hl=en\"> mufon case (11811) map </A>","Latitude":"39.969508","divs":["Sighting DetailsFriday 25th from 10:00 PM observed to the 26th about 12:30 AM. Loooking toward the south noticed very bright light - brighter than Sirius would have been - no where near canis major, not a planet - not on the plane for planets. stationary with slow movements - no movement with sky just a little to the west. I am a amateur astronomer and have scads of telescopes - Nexstar, Ultima 11-inchers SCT's but just couldn't get it all set up in time so observed with a pair of Meade binoculars. Noticed something out of place in sky immediately as i look up every night. Four lights changing to three sometimes two, sometimes one. Sometimes in V shape (have photos of V shape of lights) Turned on edge and looked like a saucer with lights on edge (see photograph if it uploads to you) - very strange markings (bumps) on sides of disc and lights on edge. Something shot out of grouping of four and I caught in on film (see photo if I was sucessful in uploading to you). Object thrown out looked like a sphere not brightly lit. Also something smaller or further away?? to the west and a shooting, very fast object just below Polaris stopped abruptly to the North - 3 objects total but one in south more significant than the others. Wife and son saw all of this as well - got them out in the yard. Have been trying to debunk - no shuttle, no ISS in my area during these sightings according to my research - have at least 40 photos most not very good. Used a Sony Cyber Shot with a 10X zoom - tried different settings. What did I think? - thought it was cool, very sleepy the next day! Was not scared just fixated as it continued to change shape and could be seen to do so with the naked eye. working on sketches."],"Object Features":"Undisclosed","Date of the Event":"07/25/2008 10:00 UTC","Sighting Duration":"01:50:00","City":"York","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-07292008-0015","Disposition":"Unknown","Region":"Pennsylvania","Country":"United States","Tags":"City"}