{"Log Number":"US-07302008-0003","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11816.html.txt","/var/www/straped/mufon/org/11816.html"],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 27th 2008"],"Summary":"Small high speed white daylight sphere","City":"Los Angeles","Object Flight Path":"Straight-line path","Latitude":"34.058124","Country":"United States","Object Features":"None","Region":"California","Case Number":"11816","Viewing Distance":"101-500 Feet","Longitude":"-118.242035","Date of the Event":"07/27/2008 05:20 UTC","Object Shape":"Sphere","Source":"MUFON","Disposition":"Unknown","Date Submitted":"07/27/2008 05:20 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.058124,+-118.242035(11816)&iwloc=A&hl=en\"> mufon case (11816) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFlying from San Jose to LAX on Sunday July 27, 2008 I had a forward window seat (3A) on the port (left) side of the American Eagle aircraft and as we were descending in a southerly direction my attention was caught by a high speed white object below the horizon, flying past in the opposite (ie. northerly) direction at our level (maybe 5-7,000 ft). Visibility was clear and it was only minutes before sunset. We were over land and flying fairly level. I first assumed the object must be very distant as I could not make out the shape, then immediately realized that its shape was spherical and that it was close, only a few hundred yards away. Estimate object size at 6-8 feet in diameter, off-white reflective color, no illumination visible. Had it in sight for 5-6 seconds until it went behind the wing of my aircraft. It maintained a constant speed and constant altitude and left no contrail. As I lost sight of the sphere it seemed a little orange which was probably a reflection of the setting sun. Just minutes later we banked to the right for our final landing approach into LAX, landing to the North. It was NOT a balloon. It did not rise and its high speed means it was powered, not stationary. I fly a lot and have often watched traffic flying past in the opposite direction so am familiar with apparent closing speeds. Interested if any other reports were made in the Los Angeles area around this time. Warren P Aston MUFON member."]}