{"City":"Fairless Hills","Date of the Event":"07/28/2008 11:59 UTC","Case Number":"11812","Date Submitted":"07/28/2008 11:59 UTC","Disposition":"Insufficient Data","Source":"MUFON","Latitude":"40.186724","map":"<A HREF = \"http://maps.google.com/maps?q=40.186724,+-74.847434(11812)&iwloc=A&hl=en\"> mufon case (11812) map </A>","Log Number":"US-07292008-0016","Object Flight Path":"Stationary","Tags":"City","Summary":"Two sets of 2 different lighted hoovering objects in sky at night","Sighting Duration":"Undisclosed","trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around July 28th 2008"],"Longitude":"-74.847434","Country":"United States","Object Features":"Other, Unknown","Object Shape":"Disc, Triangle","Weather Factors":"Medium","divs":["Sighting DetailsFor the past 4 weeks, beginning July 2 (when I first noticed) and every night (except 2 or 3 nights of lightning and thunder) one disc shaped approximately in same spot give or take 20 feet either way, hoovering to my left (looking out my window) just above trees I can see it is disc shape with white round lights all around, and at the same time to my right more higher in sky a more triangle shaped with red, green & white lights just hoovering in sky, no noise. Every night only after 9:30 PM EST and I check most nightly at 10PM, 11PM, 1AM and I got up at 3AM and still there, just hoovering. ONLY at night after 9:30PM do I first see them. One night a couple of days ago, the sky seemed to have more plane and helicopter traffic it looked like either a small plane or helicopter was getting closer to get a look at it and suddenly the plane veered off to the right, my guess that they saw what I've been seeing. Then the triangle shaped one disappeared, or turned off the lights, then when the planes went away about 30 minutes later the red, green & white lights came back on and it was in the same spot. Some nights there are 3, same one on the left, disc shape white circle lights all around, then one little one farther center, then the triangle shaped one on the right. (Triangle formation). 5 to 6 hours (or more) every night. Just hoovering. Even on nights with no stars, there they are. When the stars are out, there they are. A family member who lives 5-6 miles away also can see 2 objects in the sky one on left and one on right. On one night their dog was barking and whinning at the window, when they looked out the window they saw the objects in the sky. (I saw them, my other family members were called to look and they saw what I saw). I don't ever recall seeing these when I looked out the window at night before July 2008. About 2 or 3 days ago, was the only time I seen them in a different spot in the night sky. (I looked out the window on another side of my house). Like they are just waiting or just watching. I tried to take a digital picture it showed up on camera but when I looked at the picture on my computer there wasn't nothing there, but night sky. I called a family member to see it on the camera too. After seeing it there for just about 1 month, I still don't know what to think. One with just white lights, and one with red, green & white lights. No one seems too concerned about this, people wrote to the local newspaper but that's about it. I didn't think Levittown, PA had anything that interesting to be watching. If they want people to see them why can't they be seen in the day time. They don't seem to be hiding at night. Don't know if I would want them to come any closer anyway. Today is July 29th,2008. Getting close to 9:00PM. Almost time to look."],"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/11812.html.txt","/var/www/straped/mufon/org/11812.html"],"Viewing Distance":"101-500 Feet"}