{"Date Submitted":"07/25/2008 10:00 UTC","City":"Allentown","Latitude":"40.61143","Date of the Event":"07/25/2008 10:00 UTC","Sighting Duration":"Undisclosed","Case Number":"11822","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.61143,+-75.482483(11822)&iwloc=A&hl=en\"> mufon case (11822) map </A>","Region":"Pennsylvania","Disposition":"IFO","Country":"United States","Longitude":"-75.482483","Tags":"City","Object Shape":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around July 25th 2008"],"Log Number":"US-07302008-0009","Source":"MUFON","divs":["sighting detailsi have seen an event in the same patch of sky and filed a report earlier this month. almost every night since then,from 9:30 to about 11 pm, i've been outside to check i haven't seen the 6 or 7 seta of lights in my initial report, but i have seen a set of 1 or 2. there seems to be one in the place almost nightly where the largest one from my first report was. unable to make out shape, but is a multi-colored (red, green, blue, white) blinking object, hovering in the distance of the ssw allentown sky. if i use my imagination, i think it's over the limerick nuclear facility, which has the airport next to it. none of my research indicates that either one of those facilities has any multi-colored blinking lights anywhere, all are standard red-white.have looked at info on satellites too, nope, it's not a satellite. am using a binocular and a weak cheap telescope to verify.have had family members outside to witness also. am filing this report because of similar sightings in pa being reported. clearly (thankfully!) i am not the only one seeing it.i am stumped, i have no clue what it\\they are."],"Summary":"blinking colored lights visible in SSW sky from allentown pa re-occuring","files":["/var/www/straped/mufon/html2text/11822.html.txt","/var/www/straped/mufon/org/11822.html"],"Object Features":"Undisclosed"}