{"Disposition":"Unresolved","Region":"England","Weather Factors":"None","Latitude":"51.75706","Source":"MUFON","Tags":"City","Longitude":"-0.326902","divs":["sighting detailsi had stepped out of my back door into my garden to have a cigerette before i went to bed, and immediately noticed a low pitched undulating sound... quite audible but not loud. this did not sound like a plane\\helicopter\\ or a car of any sort. i couldn't work out which direction it was coming from. i started to look around the sky for a couple of minutes but couldn't see anything, the sound disappeared, approximately 30 seconds after it disappeared it started again. now i could still not see anything that was making this noise. i was facing the back tree in my garden when at a 2 oclock angle from my tree a light shot by quite high up in the sky about 2 inches and disappear, the sound stopped. now usually when i see a light pass by in the sky at that speed i think shooting star. but this was way too big i would say roughly the size of a one pence piece if held arm-stretch away towards the sky. the fact that the sound disappeared shortly afterwards is also a little bit too coincidental in my books. i came back outside a couple of times for a few minutes after 2am to see if the sound would come back but it didn't. however i did notice that a star sized object was moving in the sky at a rapid speed, and shortly thereafter another star sized object was moving almost on the same path in the opposite direction. whether these were planes at high altitude i don't know but they were moving pretty fast. unfortunately i have no hard evidence, but that is what i saw. details of the night: high visibility\\no clouds\\warm\\very light wind."],"Log Number":"GB-07302008-0011","Summary":"A Strange undulating low frequency sound + light","Object Features":"Unknown","Object Shape":"Unknown","Case Number":"11824","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.75706,+-0.326902(11824)&iwloc=A&hl=en\"> mufon case (11824) map </A>","Object Flight Path":"Straight-line path","Country":"United Kingdom","Date of the Event":"07/29/2008 01:50 UTC","Viewing Distance":"Unknown","Date Submitted":"07/29/2008 01:50 UTC","trends":["There have been 2 other sightings in St Albans","There were no other sightings in St Albans on or around July 29th 2008"],"City":"St Albans","files":["/var/www/straped/mufon/html2text/11824.html.txt","/var/www/straped/mufon/org/11824.html"]}