{"Country":"United States","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.607437,+-98.386909(11827)&iwloc=A&hl=en\"> mufon case (11827) map </A>","City":"Lawton","Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Oklahoma","Longitude":"-98.386909","Object Features":"None","Date Submitted":"02/28/1999 12:00 UTC","Date of the Event":"02/28/1999 12:00 UTC","Latitude":"34.607437","Summary":"Object flying low, then hovering to a stop, then shooting up 90 deg. and gone","Tags":"City","Case Number":"11827","Log Number":"US-07302008-0014","divs":["sighting detailsdriving in sw oklahoma, very clear morning - no clouds, and i looked out my driver's window and saw an object flying relatively low in the sky. it appeared completely flat, no tail, no wings and possibly a silver color. as i was driving i continued to watch it; it stayed ahead of me at somewhat an even speed, but faster than i was driving. i would also add it was approximately 1\\2 mile to 1 mile in distance from me, but with no obstructions - sw oklahoma is very flat, so i could see it very plainly. i actually pulled over to the shoulder to continue to watch the object, and then saw it just stop (hovered), right in the sky, for approximately 4-5 seconds, and then shot up in a 90 degree angle, so fast it was gone. this was not crop duster, no helicopter, and i did ask a relative who is an air force retiree, still an active pilot, if he knew of anything that could just stop and \"hover\", and then fly straight up so fast, then be gone. to his knowledge he knew of nothing. my feelings and reactions were only of awe and surprise. i've never seen anything just stop mid-air, shoot up, and then disappear. i was also interested in the shape - no tail, no wings, etc. though this happened several years ago, i still wonder about it; have meant to report it several times, and still wonder what it might have been."],"Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 7 other sightings in Lawton","There were no other sightings in Lawton on or around February 28th 1999"],"files":["/var/www/straped/mufon/html2text/11827.html.txt","/var/www/straped/mufon/org/11827.html"]}