{"Case Number":"11833","Source":"MUFON","divs":["Sighting DetailsI had just gotten up. I raised the blinds in the dining room which overlooks our back property. On the grass, exactly outside the window was a bright, eliptical beam of light. It was about 6-7 feet across and about 6-7 feet away from the house. I stared at it awhile. I tried to make sense of what I was seeing. I looked objectively, trying to take in as many details as possible. The light was a cool brilliance, like you would get from a bright full moon, not a warm bright light like so many man made lights. The weirdest thing was that this beam of light was completely even all the way across the eliptical shape. There was no bright center that faded out at the edges like you would see if you shined a flashlight straight down from above. There was also no \"shake.\" The beam was perfectly still. There was no associated sound like you would hear if a police search light were being used - no helicopter noises or anything. It also struck me that if it were something like that, the beam would be much larger. The light on my grass was crisp; precise. I took note of the conditions. It had been raining on and off all night and it was still drizzling. There were no stars. I leaned to the windowsill and looked up to see if I could discover the source of the beam. There was nothing UP as far as I could see from the inside. It occurred to me that perhaps a bright full moon had broken through the clouds out front and was somehow shing down in the back at a strange angle. I went into the living room, raised the blinds and looked out but it was dark and no moon was showing. I went back into the dining room again, and the beam was gone. As far as any feelings or reactions, I did not feel any strong emotion one way or another. It was just, weird."],"files":["/var/www/straped/mufon/html2text/11833.html.txt","/var/www/straped/mufon/org/11833.html"],"Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Object Features":"Undisclosed","Log Number":"US-07302008-0020","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around July 13th 2008"],"Object Shape":"Oval, Other","Longitude":"-76.721175","Region":"Pennsylvania","City":"York","Date Submitted":"07/13/2008 05:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.964138,+-76.721175(11833)&iwloc=A&hl=en\"> mufon case (11833) map </A>","Summary":"Bright eliptical light beam on grass","Weather Factors":"Rain, Light","Tags":"City","Date of the Event":"07/13/2008 05:00 UTC","Latitude":"39.964138","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Stationary"}