{"Case Number":"11835","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Waterford","There were no other sightings in Waterford on or around March 9th 2008"],"Log Number":"US-07312008-0002","Object Flight Path":"Hovering then path","Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/11835.html.txt","/var/www/straped/mufon/org/11835.html"],"Weather Factors":"Unknown","Date Submitted":"03/09/2008 10:14 UTC","Object Features":"Window(s), Patterned Surface, Other","Longitude":"-83.406613","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Region":"Michigan","Date of the Event":"03/09/2008 10:14 UTC","Source":"MUFON","Summary":"UFO With Strobes and pale green lights sighted hovering next to cell tower","City":"Waterford","Latitude":"42.690744","divs":["Sighting DetailsTraveling south on I-75 past exit 102, spotted white strobes flashing 2 times a second with 1 second pause between flashes, by a red flashing light on top of a cell tower, located adjacent to Grange Hall Road exit 101 on North bound I-75. As I passed by the object, I noticed there were 2 white strobe lights widely spaced, flashing, and hanging stationary to, and at the same altitude as, a red flashing light at the top of a cell tower. Having passed this way 2 nights before, I tried to spot another tower they may have put up over the weekend, and could spot nothing. I conitnued watching the object out of my side and rear view mirrors traveling for about half a mile, when I saw it turn and straddle the freeway completely, which would be 8 lanes plus the median. I could then see it very clearly as I rounded the right turn on the freeway, as being thin in section and very wide. It had 2 white strobes flashing at each end, 4 large pale greenish white lights, 2 to a side, located half way between the center and the ends, and 2 large red lights in the center and very close to each other. The red and green lights were not on as I approched or passed this object, and did not turn on until I had completely passed it. Earlier in the night, traveling south on I-75 past an airport near flint, which is on the south side of I-75, I spotted an identical UFO. This was maybe 20 to 30 min. before the above sighting. It too had been hovering next to a cell towers top light on the opposite side of the freeway, and as I spotted it, it turned and crossed over the freeway directly over my car about 100 to 200 feet off the ground. I had a VERY detailed look at this one, and it started off with the strobes, spotted me?, and then switched on the pale greenish white lights, and then the red lights. It then switched off the red lights as it passed over my car. One of the red lights was solid, the other had a grid like pattern on it suggesting square panels?. The red lights were maybe 10 to 12 feet in diameter, the greenish (turquois) lights we maybe 7 to 8 feet in diameter each, and the white strobes of unknown size on each tip? I would estimate size at 150 to 200 feet in diameter, shaped between a boomerang and an arrow head. Color was flat black or sky colored. Clear moonless night with few stars. Temp was low 40's? No percipitation, clear visibility from 20 miles or more. VERY LOW traffic flow. This is my second sighting traveling on I-75. First was in October 2007, 2 sighted, 1 while landing. Multiple whitnesses who didnt seen to notice these craft hovering 10 feet off the ground, right off the freeway from them, and right next to the freeway in a farmers field. This sighting caused a multi-car accident on north bound I-75, south of Beaver Road. Call if you want sketches or more deatils. Sightings recorded on calender and maps right after sightings occured. Sighting spots confirmed on subsequent trips on I-75."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.690744,+-83.406613(11835)&iwloc=A&hl=en\"> mufon case (11835) map </A>","Tags":"City","Object Shape":"Boomerang, Chevron"}