{"City":"Mansfield","Sighting Duration":"00:00:10","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Log Number":"US-07312008-0005","Object Flight Path":"Path with directional change","Date of the Event":"07/28/2008 11:15 UTC","Source":"MUFON","divs":["Sighting Details My son and I were fishing at charles Mill. We were facing West and the fish were not biting and I was checking out the stars as usual. It was very clear and I noticed a \"flashing\" light just above the horizon and I told my son to look at it and by the time he looked up it was almost above us. It was flying East it turned immediately and flew south for about 2 seconds then turned North East then finally South again. It went behind the tree line and was no longer visible. The entire \"event\" took about 10 seconds. I have never seen anything move that fast across the sky! About an hour later we were on the other side of the fishing area facing North and there above the tree line I noticed another light. At first I thought it was a really bright star or satellite. I asked my son to look at it and he said it was moving really slow. we watched it for about 10 or 15 minutes and suddenly it just picked up amazing speed and was gone in less than a minute. Again I lost track of the object because of the trees. Seeing 2 in one night was amazing! I was thrilled. I hadn't seen anything \"unusual\" in the sky since about 1973-1974."],"Object Shape":"Unknown","Country":"United States","Disposition":"IFO","Region":"Ohio","Summary":"2 very fast moving objects over Charles Mill Lake","Object Features":"Unknown","Date Submitted":"07/28/2008 11:15 UTC","files":["/var/www/straped/mufon/html2text/11838.html.txt","/var/www/straped/mufon/org/11838.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.75949,+-82.505837(11838)&iwloc=A&hl=en\"> mufon case (11838) map </A>","Tags":"City","Latitude":"40.75949","trends":["There have been 14 other sightings in Mansfield","There were no other sightings in Mansfield on or around July 28th 2008"],"Longitude":"-82.505837","Case Number":"11838"}