{"Tags":"City","Region":"California","Summary":"Silver/Gray cigar shaped UFO","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/11839.html.txt","/var/www/straped/mufon/org/11839.html"],"Date of the Event":"07/28/2008 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.785931,+-119.410712(11839)&iwloc=A&hl=en\"> mufon case (11839) map </A>","Object Shape":"Cigar","trends":[],"Longitude":"-119.410712","Latitude":"36.785931","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Case Number":"11839","divs":["Sighting DetailsOn July 28th around 11:00AM PDT me and my wife were turning right on to Reed Ave towards West Sacramento after leaving the New IKEA store located at 700 Ikea Court. As soon as we made the right hand turn on to Reed Ave I looked up to my left and noticed what I thought to be an Airplane departing from SAC International airport. But the odd thing was that it had no tail fin or wings of any kind. I turned to my wife and asked her to check it out. I then turned back and watched it fly towards the east. It started out slow moving then zipped faster and then vanished before my eyes. I scanned the sky to the east looking for it but it was as if it had just vanished. The one thing that was so strange about it is that it was going slow and then sorta zipped as it sped up and then poof it was gone. I know zipped is an odd word but it is the only one I can think of to tell what it was acting like when it sped up. Both my wife and myself agree that this was not an aircraft. We debated on if it was a advertisement being pulled by a plane but we both looked forward of it and did not see any plane pulling it. It just vanished. When we saw it it was above the tops of the buildings and it looked to be in my best guess around 150-300 feet in size. I dont recall hearing anything at the time."],"Country":"United States","Disposition":"Unknown","Date Submitted":"07/28/2008 12:00 UTC","Log Number":"US-07312008-0006"}