{"Source":"MUFON","City":"Green River","Date of the Event":"07/29/2008 10:30 UTC","Log Number":"US-07312008-0013","divs":["Sighting DetailsThree witnesses observed a collection of lights, grouped together, possibly affixed to a solid object of unknown shape, traveling from a generally easterly to westerly direction. The formation of lights was in the general shape of a kite, with four or five lights clustered together at what would be considered the front of the object, followed by a string of approximately five lights. Witnesses indicate that the object was lower than a commercial airliner, and perhaps 2 or three times larger. It was traveling at an exceptionally fast speed, traversing the entire sky from east to west in less than 10 seconds. One witness described the object as being a \"projection\" because the formation did not change as its position changed. In addition, the lights remained in the same position with repsct to each other. The collection of lights also appeared to be moving \"sideways\" such that what could be considered the \"tail\" of the object did not follow directly behind the front of the object."],"Object Shape":"Unknown","Object Features":"None","Summary":"Three witnesses observe collection of lights grouped together traveling from East to West","Viewing Distance":"Over One Mile","Longitude":"-109.466246","Tags":"City","Weather Factors":"None","Latitude":"41.528576","Date Submitted":"07/29/2008 10:30 UTC","trends":["There have been 3 other sightings in Green River","There were no other sightings in Green River on or around July 29th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.528576,+-109.466246(11846)&iwloc=A&hl=en\"> mufon case (11846) map </A>","files":["/var/www/straped/mufon/html2text/11846.html.txt","/var/www/straped/mufon/org/11846.html"],"Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Region":"Wyoming","Object Flight Path":"Straight-line path","Case Number":"11846"}