{"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"40.310106","Region":"Pennsylvania","divs":["Sighting DetailsThis is my second sighting in less then two months. The same type craft or whatever it was. This sighting happened at about 4:05 am. Sunday, July 27th. Bucks county was having a severe heat lightning storm, from about 2:30 am. to 5:00 am. Not much thunder but a lot of cloud to cloud lightning, & also a high cloud cover with some stars visible. My dog woke me up about 4:05am whining (she is afraid of storms) I looked out my window & saw the same type craft I saw on June 3rd. It was off in the distance, & I only saw it because a lightning strike lit up the sky. This time I woke up my wife & we both went outside. By this time it was almost overhead. It was below the cloud cover, but higher then my previous sighting. I was trying to tell my wife where to look,but she couldn't pick it out & was evidently looking in the wrong part of the sky. It was still dark & the object was just a shade darker then the sky (except when lightning struck) & the craft lit up like a Christmas tree, but only for a millisecond or like a camera flash. In that short time, I could see that this thing was not solid (or one object) The light from the lightning which was in the clouds above the craft, shown through gaps or spaces that were not part of the craft, revealing 6 separate traingular bodies joined together forming one moving object. As I said the lightning lit up the object & I saw the height or thickness. The sides were gray in color with protrusions & indentations along its sides. The windows were definitely windows & not light panels, as I was not sure of in my first sighting. The lightning illuminated the interior & came out the windows. There may have been spirals or ariels protruding above but I am not sure. From my observation & from what I saw that night I have a few theories. #1: These various shaped objects that many people have seen, are similar triangular crafts docked together forming these shapes. (See my illustrations or attached drawings) Also, they probably dock together & travel as one unit to save fuel, similar to car pooling. #2: The craft that I saw that was lit up by lightning flashes was not what I was expecting it to look like. Previously, all I saw was a dark gray object & mainly only the bottom, except when it turned. I would expect a craft that could fly at around l5 to 20 mph. & also obtain speeds in excess of anything our country has, would have to be very aerodynamic, smooth, sleek, etc. This was not. It was very clunky, box or hexigon protrusions, deep recesses of various shapes. Antenna like things sticking out. What I saw when the lightning lit it up, would in my opinion, have a hard time doing 60 mph. on a road, let alone fly. My theory is, it must be incased in some kind of vacuum or force field that isolates it from the atmosphere & gravity. This would explain the way the object I first saw, made a very fluid turn like it was encased in fluid. I have never been interested in UFO's. I have taken tales of sightings with a grain of salt, but after my experience on June 3rd, 2008 I have a different outlook. I still can't say for sure whatever I saw was manmade or extraterrestrial. If these crafts are extraterrestrial & our government knows this, why don't they admit it? If they are not ours, they could be hostile & they are in our air space!If this was a terrorist threat our government would let us know so we could prepare. Shouldn't we be informed beause this could be far worse? (THE ATTACHMENTS ARE COMPUTER GENERATED)"],"Date of the Event":"07/27/2008 04:05 UTC","City":"Doylestown","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Tags":"City","Weather Factors":"Lightning, Heavy, Light","Date Submitted":"07/27/2008 04:05 UTC","Country":"United States","Longitude":"-75.129894","Object Flight Path":"Straight-line path","Log Number":"US-07312008-0012","Object Features":"Window(s), Patterned Surface, Appendage(s), Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.310106,+-75.129894(11845)&iwloc=A&hl=en\"> mufon case (11845) map </A>","Case Number":"11845","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around July 27th 2008","This sighting has never been favorited.",""],"Summary":"This is my second sighting (the first submitted 2008-07-08) Event 2008-06-03, Bucks County, PA.","files":["/var/www/straped/mufon/html2text/11845.html.txt","/var/www/straped/mufon/more/11845_submitter_file1__2008-07-27003.jpg","/var/www/straped/mufon/more/11845_submitter_file2__2008-07-27005.png","/var/www/straped/mufon/more/11845_submitter_file3__othershapes.png","/var/www/straped/mufon/org/11845.html"]}