{"Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsI have had a previous UFO sighting with my sister while in New York State July, 11, 2007. I have been having what I thought were \"spiritual\" contact or communication, both \"physical\" experience and telepathic since April, 1996. I have been watching what looked like \"pulsating stars\" out here in Missouri since just before going to New York (where I also saw these \"pulsating stars.\"...and then we had the encounter with a ship practically landing in our yard.) On January 19,2008, here in Missouri, I woke at 4 am in the morning...saw one of the \"stars\" actually start slowly moving in a downward movement....then take off in southerly direction....move out real far...then come in quite close and hover for about 15 minutes. It looked like a sort of clear sparkly crystal round ship. A Missouri State Police car and another vehicle pulled into the parking lot and watched it also. Now the latest thing that has happened is on the evening of July 1, 2008 (Wednesday) I went out to close the windows of my car at just about 10 pm. Out of the corner of my eye I saw a flash of light above my apartment, just above the living room where I had been sitting. At first I thought it was one of those seach light or advertising lights. It was four evenly spaced whispy shear white floating things that circled around and around in a counter clockwise direction about 4-6 times...then meet in the center to form a round solid ball of light....then it looked like they would bounce off each other and go back to the four whispy evenly spaced \"lights\"....then do it again and again. Then I moved about 40 feet into the parking lotarea. Where ever I moved,....it followed right over me......continually doing the same thing....four whispy lights...round and round in the counter clockwise direction...go to the center..make a ball of light....bounce back apart into the four \"energies\" again. I called my sister in New York on my cell....we were together in her car when we had the \"close encounter\" with the UFO (real physical ship)....she told me to \"get in the house!!!\" I said, \"No,\" I think it's ok. I moved toward a building about 500 feet....it continued to hover over me, doing exactly the same thing. Then I started up a hill to the highway level, and I was still on the phone...there I reached up....the whole thing got close but smaller...and one of the three whispy lights separated from the others...came almost 1 foot from my outreached hand...and I remember telling my sister on the phone....\"It's so beautiful.\" But it was not how it physically \"looked.\" It was the feeling I got from it. It felt so peaceful and loving. It was something very good. Then I walked the oposite direction another 1500 feet and sat on the curb, still talking to my sister on the cell for about 20 minutes, with this still above my head, going around and around, meeting in the center to make the ball of light, then separating into the four \"lights\" again. It was amazing!!! Then I walked back down the hill and around to my apartment parking lot again, actually got out a folding chair and sat, still on the phone talking to my sister in New York, with this wonderful \"whatever\" circling over my head for about another 20 minutes or so. Then suddenly it moved out further in the sky above and in fron to me. It suddenly formed into four smaller solid \"ball\" shape evenly spaced \"dots\" like on a dice. I got scared at that moment....this was different!!...suddenly had the thought I was going to get \"beamed up\" or something!! But instead, just like someone turned off a light switch....it turned off!!! Just vanished!! I really don't know if this has anything to do with what happened that night, but it was the next evening after I \"said\" to one of those \"pulsating stars\" I have been watching that hangs low in the horizon out here...\"I know who you are, and I am ready to meet you.\" This is absolutely true, I don't totally understand what is happening here, but I have been having some sort of \"contact\" for quite some time now, but I think this is the first time that I may have initiated it. I have been afraid to do anything like this in the past. And this \"entity\" had some sort of intelligence. It moved in and out from me, moved with me, hovering for almost two hours, from about 10 pm until just about midnight. One of the \"whispy, circling lights\" separated from the other four and came down closer to almost touching my hand, and I felt a \"good, loving\" energy from it which made me feel \"peaceful, happy, very uplifted\" for days afterwads. And I want to have it come back again. Just as I read of another person who had an experience with something that shown a beam on his face reported here, I too have the feeling that I want to see \"them\" again. I go outside in the evening, looking for \"something\" again, hoping for it to return, though I do feel a little afraid that I will see it again. I do think if I can get back to not feeling any fear again that I will have contact again. And what I had believed was a totally \"spiritual\" experience previously, I am now becoming quite convinced through my own recent \"encounters,\" extensive research and learning of others \"experiences\" and people from the government and scientific communities finally coming out and talking about what has been and is really going on....that the spiritual and extraterrestrial activities we are now experiencing are very much related. And I believe that by us all honestly sharing what we are experiencing we will finally come to know the truth. I knew I was not alone in what I have been experiencing. It is both totally confusing and exciting at the same time."],"Latitude":"36.703846","Longitude":"-93.359462","Summary":"CONTACT WITH INTELLIGENT \"LIGHT\" ENERGY OR \"ORB\" ???","Object Shape":"Other","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Branson West","There were no other sightings in Branson West on or around July 1st 2008"],"City":"Branson West","Region":"Missouri","Object Flight Path":"Other","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/11856.html.txt","/var/www/straped/mufon/org/11856.html"],"Tags":"City","Source":"MUFON","Date Submitted":"07/01/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.703846,+-93.359462(11856)&iwloc=A&hl=en\"> mufon case (11856) map </A>","Log Number":"US-08012008-0006","Viewing Distance":"20 Feet or Less","Date of the Event":"07/01/2008 12:00 UTC","Country":"United States","Case Number":"11856"}