{"Weather Factors":"Unknown","Case Number":"1185","Sighting Duration":"00:10:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.954674,+-83.265344(1185)&iwloc=A&hl=en\"> mufon case (1185) map </A>","City":"West Jefferson","Source":"MUFON","Date Submitted":"10/23/1982 09:30 UTC","Tags":"City","Region":"Ohio","Longitude":"-83.265344","Log Number":"","divs":["Sighting Details(Narrated by Betty Powell) Bryan Powell and David Ooten saw a large, brightlight as they went onto Route 70 off of 142. They at first thought it to be ahelicopter in the distance. As they pulled over on the berm of Rte. 70 W, rightpast Taylor Blair Road, ther object was directly overhead, hovering over thefield about 60 or 70 feet up in the air. They just stared at it. It seemed tojust stand motionless. It made no sound at all. The 3 or 4 lights on both sidesunderneath the craft were green and red and stayed lit up. They did not pulsateon or off. The large, bright light under the front of the craft shined on theground below it. The boys stood under it for about 10 minutes. It started tomove away very slowly and made no sound at all. This over with, Bryan and Davidjumped in th car and went to a service station on Rte 29 to call me. He wascrying and screaming, trying to tell me to run out and see if I could see it.Ihad a house full of people, and we all went.....(trails off on page). (Nextpage)...the \"ship\". It was close to the moon and appeared to be about 2 or 3miles high. It was huge. We could see the white light in front and the side redlights. No green. When Bryan got home he was a nervous wreck. He said if helived to be a hundred he never wanted to go thru anything else like it. He saidit made a 707 airplane look like a Tonka toy. It came from the west and headedtoward London OH. Wright Patterson Air Force Base is in Dayton OH (west). LondonPrison Farm is in London OH and has a large power plant. Both of these placesare large sources of energy. --Signed, (Bryan K. Powell)"],"Object Shape":"Other","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/1185.html.txt","/var/www/straped/mufon/mufon_json/1185.json","/var/www/straped/mufon/org/1185.html"],"Object Flight Path":"Stationary","Latitude":"39.954674","Summary":"Strange Encounter with Helicopter-shaped UFO","Date of the Event":"10/23/1982 09:30 UTC","Object Features":"Undisclosed","trends":["There has been one other sighting in West Jefferson","There were no other sightings in West Jefferson on or around October 23rd 1982"],"Viewing Distance":"21-100 Feet"}