{"City":"Casa Grande","Case Number":"11853","Object Shape":"Other","Log Number":"US-08012008-0003","map":"<A HREF = \"http://maps.google.com/maps?q=32.888592,+-111.756332(11853)&iwloc=A&hl=en\"> mufon case (11853) map </A>","Region":"Arizona","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around"],"Date of the Event":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"None, Wings","files":["/var/www/straped/mufon/html2text/11853.html.txt","/var/www/straped/mufon/org/11853.html"],"Country":"United States","Longitude":"-111.756332","Date Submitted":"08/01/2008 12:55 UTC","divs":["Sighting DetailsNorthbound on I10 between phoenix and tucson, in the middle of the desert, driving about 75 mph in a truck. Noticed a flicker of movement, a second or two after the object I see turns quickly but smoothly verticly. It's a slightly curved wing shape with 3 white lights on it, one in the middle and one on each end. There is an overpass ahead, it is flying low, maybe twice the hight of the overpass, and is completely sideways, like a fighter jet turns. Once it passed over I10, it leveled out again and flew low to the ground, no more than 20 feet off the ground to my right in a field. I don't see the lights I saw earlier, and see no other lights on the object. I see a wing profile, and a dim shape of a fusalage, but it was dark so I couldn't see very well. It passes out of my vision in less than 5 seconds flying away at my 4 o-clock. The truck I was in makes a lot of noise, and I didn't hear anything other than the truck. The objects movements were smooth, yet very quick. During the event I thought it was a small plane, like a crop duster, but after the event that didn't make sense. It flew very low, and if a gust if wind hit it right it would have hit the ground, so I don't think a pilot would risk it, especially in the dark at night. These fields have powerline poles in them, so cropdusters don't run at night. I'm not sure if the fields were cultivated or just desert, as it was dark. Another thought was a border patrol plane, but again why so low and why no other lights? If a militar plane why over a major highway and with no lights other than the 3 on the wing? The more I thought about it the less it made sense."],"Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"32.888592","Summary":"Wing shaped object with 3 lights on top low to ground","Weather Factors":"None"}