{"Country":"United States","Disposition":"Unknown","City":"Grayland","divs":["Sighting DetailsI was watching the sunset over Grayland Beach in Wa - when my family was there camping. I noticed a bright object appear in the sky in the distance out over the ocean. The object seemed to float there for about a minute and then started moving closer and changing directions. The object then started making extreme manuevers. It would loop around change directions, spiral, then come to a stop, and then repeated similar moves again. i grabbed my camera as quick as i could and snapped what turned out to be four pictures of this object in motion before it disapperaed off into the distance in an instant. It was awesome to me because i new what i had just witnessed and it was real. the object as i saw it was a cingular craft - in the pics you can see the light trail that was left behind as it made this movements. This event happened in Oct 2005. After hearing the interview with Edward Mitchell in July 2008 and hearing him disclose UFO's. it reminded me of the pics i had taken so i went and found all the images that i had saved from the trip and thought i would let everyone get a look. i will upload 3 of the images which is allowed on the report form and submit the fourth upon request. regards"],"Date Submitted":"10/15/2005 05:29 UTC","Region":"Washington","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Case Number":"11850","Log Number":"US-07312008-0017","Object Flight Path":"Undisclosed","Object Shape":"Circle, Oval, Sphere","trends":["There have been no other sightings in Grayland","This sighting has never been favorited."],"Longitude":"-124.09576","Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"10/15/2005 05:29 UTC","Summary":"Bright Object , Circular , Making Extreme Manuevers","files":["/var/www/straped/mufon/html2text/11850.html.txt","/var/www/straped/mufon/more/11850_submitter_file1__P9170116.JPG","/var/www/straped/mufon/more/11850_submitter_file2__P9170117.JPG","/var/www/straped/mufon/more/11850_submitter_file3__P9170118.JPG","/var/www/straped/mufon/more/11850_submitter_file4__P9170115.JPG","/var/www/straped/mufon/org/11850.html"],"Latitude":"46.8098","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.8098,+-124.09576(11850)&iwloc=A&hl=en\"> mufon case (11850) map </A>"}