{"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/11858.html.txt","/var/www/straped/mufon/org/11858.html"],"City":"Burgettstown","Object Shape":"Star-like, Triangle","Disposition":"Unknown","Summary":"Three star-like objects traveling in a perfect triangle.","Log Number":"US-08012008-0007","Country":"United States","Tags":"City","trends":["There has been one other sighting in Burgettstown","There were no other sightings in Burgettstown on or around May 30th 2008"],"divs":["Sighting DetailsMy fiancee and I were camping out at Raccoon State Park in Burgettstown, PA on May 30 and 31. On May 30th, while sitting outside by a campfire, I was observing the stars as it had recently rained and cleared up rather quickly. While some clouds were still present, it was a really crisp night and the stars were really bright. While I was fixed on a certain point in the sky, I noticed that one object was moving rather slowly. At first I thought it may have been a plane as we were somewhat close to the Pittsburgh airport. But after further examining the star-like object, I noticed that no lights were blinking. It was just moving slowly across the sky. I then noticed that there were two other star-like object identical to this one moving at the same speed and direction. The objects formed a perfect triangle and all I could see were the points, moving together. The objects appeared to be rather high in the sky, where you would expect to see air traffic. But the objects were moving at the same speed and formed a perfect triangle. The triangle was rather large. Probably as large as the dipper part of the big dipper. While my fiancee was able to see the object moving, she was unable to see it as well because of her eyesight. I was able to see the objects for approximately 10 minutes. It appears that the object were moving toward Burgettstown in a south southeast direction."],"Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-80.392842","Latitude":"40.382013","Object Features":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"05/30/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.382013,+-80.392842(11858)&iwloc=A&hl=en\"> mufon case (11858) map </A>","Weather Factors":"None","Date of the Event":"05/30/2008 09:00 UTC","Case Number":"11858","Viewing Distance":"Over One Mile"}