{"Date of the Event":"07/13/2008 10:01 UTC","Log Number":"US-08012008-0015","divs":["Sighting DetailsI WAS ON MY BALCONY WITH A FRIEND OF MINE WHEN WHEN WE NOTICED A PLANE THAT WAS DEPARTING OHARE AIRPORT IN CHICAGO WITH TWO CIRCULAR ORANGE LIGHTS CHASING IT FROM BEHIND. I POINTED IT OUT TO MY FRIEND AND HE CLAIMED IT WAS FIREWORKS, BUT FIREWORKS CANNOT REACH THAT HIGH AND CHASE PLANES. THE LIGHTS WERE MAKING THE PLANE LOOK SMALL, AND THE COLOR OF THESE LIGHTS LOOKED LIKE A SUNSET. THEY WERE NOT BLINKING, AND THEY WERE OFF ANGLE ONE FROM ANOTHER. IN A SLANT POSITION. AS THE PLANE MAINTAINED IT EASTERLY COURSE, THE LIGHTS DIMMED OUT AND CHANGED DIRECTIONS TO THE SOUTH. I PRAYED FOR IT TO COME BACK SO I COULD RECORDED IT, I WENT AND GOT MY DIGITAL CAMERA AND WAITED FOR IT TO RETURN. ABOUT 20 MINUTES LATER WHAT APPEARED TO BE ANOTHER UFO APPEARED IN THE SKY ALMOST DIRECTLY ABOVE MY POSITION. THIS ONE SEEMED ALOT SMALLER AND MORE DISTANT THEN THE FIRST. THE LIGHTS WERE BLINKING IN A PATTERN I HAVE NEVER SEEN BEFORE ON ANY PLANE. IT APPEARED TO HAVE NO NOTICEABLE WINGS AND WAS MOVING VERY SLOW AND SILENT. I RECORDED 1 MINUTE AND 16 SECONDS OF THIS UFO. I WOULD SHARE IT WITH THE WORLD BUT I AM EMBARRASSED OF THE WAY I WAS TALKING WHILE RECORDING THE PHENOMENON. I WAS TO EXCITED AND GOT CARRIED AWAY WITH MY LANGUAGE. EVER SINCE THESE TWO SITINGS, EVERYTIME I STEP OUTSIDE MY HOUSE ON THE BALCONY OR THROUGH MY FRONT DOOR. I AM ALWAYS LOOKING FOR IT AND HOPING IT RETURNS FOR ME. I BELIEVE SO MUCH THAT IT WAS A UFO THAT I PURCHASED A CAMCORDER EQUIPPED WITH NIGHTVISION AND 25 TIMES OPTICAL ZOOM SO I CAN GET A REAL GOOD CLOSE UP OF THE OBJECT NEXT TIME IT COMES. IF IT EVER COMES BACK. I REALLY HOPE IT DOES. I AM A TRUE BELIEVER NOW THAT I HAVE SEEN IT WITH MY OWN EYES, I ALWAYS BELIEVED THEY EXISTED, BUT NOW...I SEEN IT WITH MY OWN EYES. I TRULY HOPE IT COMES BACK. IF ANYONE AT THIS CONTACT CENTER WANTS TO SEE THIS FOOTAGE THAT I HAVE PLEASE CONTACT ME DIRECTLY. I LEFT MY INFORMATION AVAILABLE. THANK YOU IN ADVANCE."],"Country":"United States","files":["/var/www/straped/mufon/html2text/11865.html.txt","/var/www/straped/mufon/org/11865.html"],"trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around July 13th 2008"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.885424,+-87.625558(11865)&iwloc=A&hl=en\"> mufon case (11865) map </A>","Summary":"UFO BLINKING IN FLIGHT PATH OF PLANES","Date Submitted":"07/13/2008 10:01 UTC","Disposition":"Insufficient Data","Region":"Illinois","Tags":"City","Source":"MUFON","City":"Chicago","Object Features":"None","Object Flight Path":"Hovering then path","Object Shape":"Cone, Egg","Viewing Distance":"Over One Mile","Latitude":"41.885424","Longitude":"-87.625558","Case Number":"11865","Weather Factors":"Unknown"}