{"Weather Factors":"Unknown","Region":"Oregon","divs":["Sighting DetailsI was coming home on the west side of Bend and noticed very bright red and green (side by side) flashing lights. I thought it was a twinkling star at first but noticed that the red and green lights were very bright. I could not make out the shape because it was over the cascade mountain range. I had noticed it right below the big dipper. The one thing that caught my attention was that I noticed the object was heading away in a Northwest direction, but the lights were pointed in my directions. I do not think that airplane lights are lit backwards?????? 1 minute after the object faded, a plane was heading west around the same area and the lights were completely recognizable for being a plane, but the object red and green lights were nothing I had ever seen before. If I was to guess the distance of the object from my position, the closest I would have to say was around 50 miles in a northwest direction, because I am actually guestamating the distance from were I live in Bend to the cascade mountain range were the object was flying to. One of the volcanoes that are in that directions is Mount Jefferson."],"Log Number":"US-08012008-0014","City":"Bend","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/11864.html.txt","/var/www/straped/mufon/org/11864.html"],"Latitude":"44.060573","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"07/29/2008 11:43 UTC","Disposition":"Insufficient Data","Summary":"Red and Green flashing object......could not see shape was too far...","Date Submitted":"07/29/2008 11:43 UTC","Object Flight Path":"Hovering then path","Case Number":"11864","map":"<A HREF = \"http://maps.google.com/maps?q=44.060573,+-121.30891(11864)&iwloc=A&hl=en\"> mufon case (11864) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around July 29th 2008"],"Longitude":"-121.30891","Country":"United States","Object Features":"Unknown","Tags":"City"}