{"Region":"Ohio","Summary":"Glowing orb flew out of woods","Tags":"City","Disposition":"Insufficient Data","Object Features":"Undisclosed","divs":["Sighting DetailsI was standing at my kitchen sink, looking out the window at the woods less than 25 feet away. The yard sloped sharply so I was almost level with the tree tops. As I was looking, a glowing, reddish orange globe floated out from the trees. It was about the size of one of those giant beach balls. It came toward me slowly and evenly. It then made a turn and went back into the trees. I could see it going through the woods, it did not touch any of the tree branches. It then rose above the trees and flew off over the hill in the distance. Funny how you can see something like this and your brain does not compute what it is seeing. I stood there for several minutes in wonder. Then continued washing my dishes! I told my husband when he got home and the next day looked in the paper to see if anyone else had spotted it. No news. Two nights later, after dark, my husband and I were making a run to the store. We were taking a back road that passed fields and woods. From out of the woods the orb appeared again. It followed the woods at the edge of a field for about a mile. We followed it for as long as we could before it flew back into the woods. This sighting has haunted us ever since. I hesitate to add this bit of information....When I was 6 I was living in an orphanage in Davenport Iowa. This would have been in 1953. We slept in dormitories. My cot was next to the fire escape. I awoke one night to see 3 little grays standing next to my bed, looking at me. I was frozen with terror and closed my eyes tight so as not to see anything. There had been stories of monsters visiting the dorms, but never a description of what they looked like, It would take many years for me to discover what they were. I was in a book store, and from across the room, I spotted picture of my little gray men. It was the cover of the book, Communion."],"Latitude":"39.106018","Longitude":"-84.50752","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"08/01/2008 10:40 UTC","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around"],"Country":"United States","Log Number":"US-08012008-0009","Object Shape":"Sphere","Source":"MUFON","Date of the Event":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.106018,+-84.50752(11860)&iwloc=A&hl=en\"> mufon case (11860) map </A>","files":["/var/www/straped/mufon/html2text/11860.html.txt","/var/www/straped/mufon/org/11860.html"],"Object Flight Path":"Undisclosed","City":"Cincinnati","Case Number":"11860"}