{"Object Shape":"Fireball","Date of the Event":"08/01/2008 09:35 UTC","City":"Cardiff","Weather Factors":"Unknown","Source":"MUFON","Summary":"fireball","Region":"Wales","Disposition":"Unresolved","Log Number":"GB-08012008-0017","files":["/var/www/straped/mufon/html2text/11867.html.txt","/var/www/straped/mufon/org/11867.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"51.487091","Date Submitted":"08/01/2008 09:35 UTC","divs":["Sighting DetailsWe saw what we first thought was a hot air balloon on fire in the skies just east of RAF St Athan and Cardiff Wales Int Airport over Wenvoe, as we watched it it looked like something on fire and was fairly motionless,our initial thought was that it was a hot air balloon flaring up or on fire. The object then started moving at a fairly fast pace (like an aeroplanes speed) from West to east over Cardiff. As we watched it we discussed what it could be. It wasn't a balloon as it was moving to fast, and was traveling along a horizontal plane. We thought it couldn't be a plane or something on fire as it it wasn't losing any height . We watched the object for about 5 minutes as it disappeared into cloud to the east. All the time it flared bright orange, like it was on fire, and kept a constant speed(about that of a commercial airliner)and trajectory until it disappeared into cloud cover. We discussed what we had seen during the evening and checked on the internet when we returned home to see if any planes had been reported crashed. On googling \"fireball Cardiff\" we were astounded to find reports of the South Wales Police reporting a similar incidence a month earlier. This matter was reported to South Wales Police in August 2nd 2008"],"Case Number":"11867","Longitude":"-3.16912","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Cardiff","There were no other sightings in Cardiff on or around August 1st 2008"],"Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.487091,+-3.16912(11867)&iwloc=A&hl=en\"> mufon case (11867) map </A>","Country":"United Kingdom"}