{"Longitude":"-113.485562","map":"<A HREF = \"http://maps.google.com/maps?q=53.544674,+-113.485562(11863)&iwloc=A&hl=en\"> mufon case (11863) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"07/02/2008 12:00 UTC","Object Features":"Undisclosed","City":"Edmonton","divs":["Sighting DetailsThis was the first UFO I have seen. It was late at night, around 10:30 PM and I went into by backyard and looked up at the stars. I immediately noticed the big dipper and two stars to the left of it. Later, I looked in my star map and found that the star in question should not have been there. As I noticed there were two bright stars on my left, above a tree behind my house, the one on the right started to move (as indicated in the .bmp I provided). It moved to the right, up, then down, and started to fade away as if it were moving away from earth. I squinted and could see the light moving upward and getting fainter until it was gone. I looked at the star-map and found that the star beside it (which it looked identical to) was a star, while the object in question should not have been there. I have seen many planes in the sky at night as well as helicopters and none of them moved like this. I have also seen satellites and they are faint and move in a straight line. This moved in a zig-zag like pattern, started bright as if it were one of the brightest stars in the sky, and then as it moved it faded away as if it were moving away from me."],"trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around July 2nd 2008","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Log Number":"CA-08012008-0013","Country":"Canada","Tags":"City","Case Number":"11863","Latitude":"53.544674","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/11863.html.txt","/var/www/straped/mufon/org/11863.html"],"Disposition":"Unresolved","Date of the Event":"07/02/2008 12:00 UTC","Weather Factors":"Medium","Summary":"Star moving and disappearing upwards","Region":"Alberta"}