{"Object Flight Path":"Stationary,Unknown","files":["/var/www/straped/mufon/html2text/11862.html.txt","/var/www/straped/mufon/org/11862.html"],"Date of the Event":"07/31/2008 09:45 UTC","Longitude":"-98.675038","divs":["Sighting DetailsI had just gone out around 9:45 PM to turn the water off and as I was walking back to the front of the house I noticed a star-like object with a venus like brightness accompanied by two lights on either side that were the typical dimmer star type of appearance. It was a calm night with some hazy cover. We live about 15 miles from town on a large ranch so the sky is pretty visible. The object caught my eye because it looked like a star but not something I had seen before. It was a little bigger and brighter than most starts and with the two star-like lights on the sides made it seem even more odd. I observed the object for a few minutes and noticed several flashing lights in the distance (helicopters) which were about 5-6 in number. As I watched the object for 3-5 mins at best it very rapidly became smaller and seemed to move up in the sky just a tad. Best I can describe the change in size is ( O to . )in about 3 seconds and after I thought it disappeared it started to have a hazy glow that started small around the object till it seemed to settle as if the brightness of the object caused the glow. At first I thought clouds may have gone past and just covered the object but there was no wind and only a high cloudy haze (fog like) that didn't appear to be moving. It seemed the object just increase altitude into the upper atmosphere or dimmed the lights so to speak. Once it got to that point it just stayed at that same appearance as I watched. Once the object first grew dim I heard the sound of a jet and spotted the lights of the jet moving west to east. The jet streaked by within a minute and passed by the general area of the object. After the first jet a second one came by a few minutes later along the same type of path. The object stayed the same as the last description for several more minutes and it was hard to tell if there was much movement of not. The other lights in the sky (helicopters, etc.) stayed in the general southern portion of the sky just west of the objects area. After about 30 mins I headed back inside. Not sure what or if it was anything other than explainable conditions, etc. The military, etc. fly over the ranch pretty reguraly as part of their routine so that wasn't too typically out of character. The only thing was the location they stayed in and the amount of aircraft was out of the norm. I have sat under the night sky and watched \"stars\" move about, etc. but this was a different experience altogether. No other stars that were visible in the area changed much or at all the entire time I watched the southern sky so the clouds couldn't have had that type of affect on just one star. I would have continued to watch but after about twenty minutes of nothing else happening I moved on. Needless to say I will be checking out the skies tonight camera in hand. I tried to take a pic of the \"star\" in its dim state but couldn't get much, there is no doubt that if I had the camera before it got smaller that there would be something to evaluate. I attached a crude drawing to try to give a visual of the event."],"Country":"United States","Date Submitted":"07/31/2008 09:45 UTC","Log Number":"US-08012008-0012","Tags":"City","Case Number":"11862","Latitude":"30.759345","trends":["There has been one other sighting in Llano","There were no other sightings in Llano on or around July 31st 2008","This sighting has never been favorited.",""],"Object Shape":"Star-like","Summary":"Star-like object movement accompanied by several aircraft","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.759345,+-98.675038(11862)&iwloc=A&hl=en\"> mufon case (11862) map </A>","Source":"MUFON","Region":"Texas","Disposition":"IFO","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","City":"Llano","Weather Factors":"None, Unknown"}