{"City":"cms/tg n/a","Log Number":"US-08012008-0016","Summary":"A very bright white light with great lumonosity that bobbled but stayed in same location for over one hour.","Latitude":"31.973209","Weather Factors":"None","Disposition":"Hoax","Tags":"City","Region":"Texas","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/11866.html.txt","/var/www/straped/mufon/org/11866.html"],"Source":"MUFON","trends":["there have been 18 other sightings in cms\\tg n\\a","there was one other sighting in cms\\tg n\\a on or around may 10th 2008"],"Case Number":"11866","Viewing Distance":"Over One Mile","Date of the Event":"05/10/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.973209,+-99.896513(11866)&iwloc=A&hl=en\"> mufon case (11866) map </A>","Date Submitted":"05/10/2008 12:00 UTC","Longitude":"-99.896513","divs":["Sighting DetailsApril 11th 2008. About 10:00PM to after 11:00PM. Location was within 250 miles from south to west of Stephenville, Texas. This light would sometimes dim down somewhat and then become very bright. Attempted to \"signal\" this light with an 18 v flashlight and it seemed to get brighter in response. It made my son nervous and he asked me to stop. Took two photographs with standard lens and what was surprising is that it photographed out GREEN instead of white and changed it's shape drastically. Photos were 15 seconds apart. It appeared to be about 3 to 5 miles away, but very difficult to determine distance. It was low over the hills and I am sure it was not picked up on radar as no planes intercepted it. The first photo showed a green ball shaped object. However, the second photo showed it to be flat. As this was extrodinary, it was nothing compared to the second sighting one month later on about the same date, May 10th 2008. This light was in same location the second time. I used a 4 power zoom lens. What I saw made me fall out of my chair. This object seemed to be a combination of a \"thing\" and a machine. Some sort of exploratory craft. However, the position of it's head was 180 deg. away from me but the second photo showed that it had moved much closer towards me and was \"looking? at me. This second photo was shot about 10 seconds later. When I look at these photos it makes my skin crawl. I tried to drive up to where I thought it might be, but turned around and came back with some sense of dread. I showed these last two photos to three engineers in my professsion behind closed doors in their conference room and they were at a complete loss to explain it. They asked that I not release them on the web and to further investigate on my own with a video showing the changes. I am very reluctant to show them to anyone at this time as it may be posssible that I will go up there on August 11th or so and maybe get better photos. I son't want this area to be overrun with a bunch of UFO nuts. Although I don't see how they could be better except for video. I may release them later, but am not sure at this time. I do not want any recognition or any thing else for them. I just want to know what it is. I discussed this sighting with a law enforcement officer and he informed me that that was a very desolate area. I am not using my real name. Just call me Bart."],"Country":"United States"}