{"City":"Fort Myers","Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/11878.html.txt","/var/www/straped/mufon/org/11878.html"],"Disposition":"IFO","Country":"United States","Tags":"City","Source":"MUFON","Summary":"Silver disk, or oval shaped object flying steadily across skyin a south dir","Region":"Florida","Object Shape":"Cigar, Disc, Oval","Object Features":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"08/02/2008 08:23 UTC","Latitude":"26.643758","divs":["Sighting DetailsSpotted a silver glint in the western sky, appeared to be a disk like object, perhaps more oval traveling very consistently at a slow pace, maybe about as fast as a slow traveling plane. It didn't appear to be extremely high, but it was a good distance away. Approx size is comparable to the size of a small sunflower seed. I thought maybe it could be a plane, but couldn't see any wings span off it during its travel across the sky. (usually the sun will glint off of them at some point, or the angle will change so they are visible)At one point the sun reflected off it very brightly, for about 3 or so seconds. It traveled in a north to south direction. We also have an airport in that that area(SW Regional), which is why i am kinda hesitant to say its a UFO. Only reason i am reporting this, is due to the fact i couldn't detect any wing span at any point across the sky. I do not jump to the UFO conclusion easily. I believe they are out there, but i also believe that they are often mistaken and are generally our own planes and the like. The sky was a typical Florida sky, clear, blue and bright. I am 37 yrs old single parent of two with a college degree in medical admin. My view was not blocked during the travel across the sky except for a moment by a light pole. I turned away once it had gotten far off in the distance and couldn't see more than a spec. Pointed it out to my son, who also didnt see the wings. no odd behavior or feelings."],"Log Number":"US-08022008-0007","Longitude":"-81.869478","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.643758,+-81.869478(11878)&iwloc=A&hl=en\"> mufon case (11878) map </A>","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around August 2nd 2008"],"Case Number":"11878","Date of the Event":"08/02/2008 08:23 UTC","Object Flight Path":"Straight-line path"}