{"Object Flight Path":"Straight-line path","Source":"MUFON","Region":"Kandahar","files":["/var/www/straped/mufon/html2text/11877.html.txt","/var/www/straped/mufon/more/11877_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/11877.html"],"Object Features":"Dome","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Date Submitted":"04/04/2008 12:00 UTC","trends":["There has been one other sighting in Kandahar","There were no other sightings in Kandahar on or around April 4th 2008","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Latitude":"31.616944","divs":["sighting detailsi work for the u.s. government in kandahar, afghanistan. i have been here for the last two years (nato air base). prior to working here in afghanistan i worked at the air logistics center in oklahoma city for 10 years. i have an extensive background in military\\civil aviation and have seen just about every imaginable military aircraft fly in and out of this nato base. in april of this year i took some photos of a project area located adjacent to the nato base. when i returned and viewed the photos i noticed an object in the upper left part of the scene. when i took the photo there were no aircraft flying in the area, and i did not see the object at the time the photo was taken. like most photos of unidentified objects, this one is quite blurry. however, when you zoom in on the object it is clear that it is disc shaped. i have never seen an aircraft like this before. i examined the other photos i took just seconds after the one with the object and nothing was there. what ever the object, it must have been moving at a high rate of speed. i had to reduce the size of the photo for attachment. for full size photo, please provide a contact e-mail."],"Country":"Afghanistan","Case Number":"11877","Longitude":"65.716944","Object Shape":"Disc","Summary":"Object captured when taking photo at project site.","Date of the Event":"04/04/2008 12:00 UTC","Disposition":"Unresolved","City":"Kandahar","Log Number":"AF-08022008-0006","map":"<A HREF = \"http://maps.google.com/maps?q=31.616944,+65.716944(11877)&iwloc=A&hl=en\"> mufon case (11877) map </A>"}