{"files":["/var/www/straped/mufon/html2text/11874.html.txt","/var/www/straped/mufon/org/11874.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.65113,+-73.94835(11874)&iwloc=A&hl=en\"> mufon case (11874) map </A>","Longitude":"-73.94835","Object Shape":"Sphere","Object Features":"Undisclosed","City":"New York","Tags":"City","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-08022008-0003","Date of the Event":"08/01/2008 10:30 UTC","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 1st 2008"],"Case Number":"11874","Source":"MUFON","Summary":"Bright lights In the night sky that looked like stars but MOVED! in strange ways!","Weather Factors":"Unknown","divs":["sighting detailson the night of 8\\1\\08. my sister, nephew, mother and i where walking the dog at brooklyn prospect park at around 10:00 pm. i pointed out that i had been watching the sky for about two years with my little $100.00 telescope and i had never seen so many triangle constellations. every where we looked in the sky we saw stars. to me this was very strange because i have a very hard time even finding stars in the light polluted sky of new york city. then my mother said \" i think the stars are moving\" every one laughed out loud and thought she was crazy! ... but then my sister said \" dude...i think that one just moved\"! we all stopped walking and started to look at the one star both my mother and sister saw move. we could not believe what we were seeing! lots of \"stars\" moving in very strange ways. it seemed to be as if they were on a tether and were being moved by the wind, \"but how could this be, they are stars\" my mother said. we left the park at 12:20 am. the lights were still there when we left. this is the first time i have ever seen something like this. did any one else report seeing these \"stars\" moving in nyc."],"Date Submitted":"08/01/2008 10:30 UTC","Country":"United States","Disposition":"Unresolved","Latitude":"40.65113","Sighting Duration":"Undisclosed","Region":"New York"}