{"Weather Factors":"Unknown","divs":["Sighting DetailsI was in my car driving north on LaCholla road in Tucson about 9:55 p.m. on Tuesday, July 29, 2008 and as I was approaching Magee road I observed two very bright orbs in the Northwest sky that were moving very slowly. The lights stayed the same distance apart from each other. One light appeared to be red and the other one a pale green but they were not blinking like airplanes or helicopters do. I first thought they were stars but they were too large and had a definite color to them and I thought it was strange the way they were aligned to each other. I thought I possibly saw a third light but it appeared too faint. The two orbs stood out very distinctly in the sky. I was very curious and wanted to oberve them longer but since I was drving it was necessary to keep my eyes on the road. I thought about pulling off to the side of the road but that made me feel slightly anxious. I looked back a few times and could still see them but couldn't see them any longer as I approached my house.I went back at the same time on the next two nights thinking I might be able to see the same thing but saw nothing unusual. My experience reminded me of the report from Oregon on July 29, 2008 but I didn't see a time of that person's sighting."],"Latitude":"32.227243","Country":"United States","Object Shape":"Star-like, Other","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"07/29/2008 09:55 UTC","Sighting Duration":"00:03:00","files":["/var/www/straped/mufon/html2text/11875.html.txt","/var/www/straped/mufon/org/11875.html"],"Disposition":"Unknown","Case Number":"11875","Longitude":"-110.919089","map":"<A HREF = \"http://maps.google.com/maps?q=32.227243,+-110.919089(11875)&iwloc=A&hl=en\"> mufon case (11875) map </A>","Object Features":"Undisclosed","Summary":"I saw two very bright orbs in the northwest sky, one appeared a pale red and the other one above it had a green cast","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around July 29th 2008"],"Log Number":"US-08022008-0004","Tags":"City","City":"Tucson","Region":"Arizona","Date Submitted":"07/29/2008 09:55 UTC","Source":"MUFON"}