{"Latitude":"31.76663","Case Number":"11883","Tags":"City","files":["/var/www/straped/mufon/html2text/11883.html.txt","/var/www/straped/mufon/org/11883.html"],"Log Number":"US-08022008-0012","City":"El Paso","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Viewing Distance":"Unknown","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around June 24th 1974"],"divs":["sighting detailsin the summer of 1974 while a friend and i were outside my house in my front yard on fort bliss, we noticed a green\\blue oval that was way above the mountians. it was comeing from the direction of white sands nm, i know this because i had gone with my father to white sands missle range many times as he was an e7 sargent in the army \"aircraft mechanic and teacher\". the object was flying very eratic, not in direction but speed, from extremly fast to almst a stand still. i was 13 years old a the time and had been on army bases all my life and going to the airplane hangers and seeing just about everything that flew at that time i knew it was not a plane or helicopter. up to the point of seeing the object that night my past experiance with being around aircraft was pretty extensive, i saw the first concord sst being tested for cold weather in fairbanks alaska , my father was stationed at fort waynewrite at the time to going out to white sands nm watching what ever he was working on, i whitnesd drone planes towed by an airplane being shot down with some type of lasser light emited from a large flate panel that looked like a solar panel mouted on an apc. i saw the green\\blue object a least 4 times after the first time and then something very odd happened a few weeks \"aprox\" latter, i heard my father talking to a man in his company \"fellow inlisted man\" on our carport about having to pull guard duty at a hanger on base, he didn't sound mad but he did sound reluctant about the duty. i was listining to them because my father was his boss and my bedroom window faced the carport. my father was a very abusive father and had a very bad temper so naturaly when i saw him talking to that man i got scared. fort bliss had seemed to be more uptight or uneasy over the next few weeks for some reason, the guards at the gates looked and checked everyone just a little harder, i know this not only from comeing and going from the bass but i live a half block from the north gate and used to watch the guards. i asked my dad much to my insecurity about what was going on around the base and much to my surprise he told me there was something being guarded in a hanger on base that no one was aloud to talk about, he did say it was on what i knew at the time as a tank hauler truck. he never taled about it again, we got transfered 3 mounths latter, the last month he put me on restriction for something did and i could not go anywhere until we moved. he was in the army 21 years, his last mos was in our home town, tampa fl. , he worked out on mcdill airforce base. i am now 47 years old and my health is not good due to carbon monoxide poisoning,i as my father wasa mechanic. i wanted to tell my story just incase i'm not around much longer. i would like to add that during my adult life i have always been fasinated with military aircraft, theoligy, how everything and anything works, i have studied for years and years about aircraft and if i dont know about something i find out. i consider myself a knowledgeble , logical and enquiering person. my grandfather was a babtist preacher so my knowledge of religion is deep and yet i still have this want and passtion about the univerce and the strong feeling that we can't be all there is. something did happen in 1974 on fort bliss, i just don't know what. i have watched every show, documentary on ufo's , i am even a mufon member and yet i never told anyone about fort bliss and what i saw and heard but in hindsite my fathers stint in the army and his scary , eratic abusive behavior just don't add up. my father was in viet nam in hue during the tet offensive, he was working alongside the cia with the ov-1 mohawk testing the flear radar, to what extent i dont know. i apologias for my miss spelling and jumping around, its just for so any years i have tried to connect the dot's. sincerely, robert e lane"],"Sighting Duration":"Undisclosed","Object Features":"None","Weather Factors":"Unknown","Longitude":"-106.480041","Source":"MUFON","Object Shape":"Oval","Summary":"my friend and I saw a green - Blue oblong oval over Fort Bliss- El Paso area","Date Submitted":"06/24/1974 12:00 UTC","Date of the Event":"06/24/1974 12:00 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.76663,+-106.480041(11883)&iwloc=A&hl=en\"> mufon case (11883) map </A>","Region":"Texas","Country":"United States"}