{"City":"Harrison","Viewing Distance":"101-500 Feet","Weather Factors":"None","Object Shape":"Sphere, Star-like, Triangle","Sighting Duration":"Undisclosed","Log Number":"US-08022008-0014","Summary":"First seen in eastern sky going west, later seen in western sky going east.","Region":"Arkansas","Latitude":"36.229794","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.229794,+-93.107676(11885)&iwloc=A&hl=en\"> mufon case (11885) map </A>","Longitude":"-93.107676","trends":["There have been 2 other sightings in Harrison","There were no other sightings in Harrison on or around August 16th 1982"],"Country":"United States","divs":["sighting detailstraveling north on cottonwood road after sunset with my friend his mother and aunt, we noticed a \"star\" in the eastern sky. it caught our attention because of it's singularity, color, size, and apparent motion. at first we all thought planet mars because of the dull orange\\red color, but the size was larger and it seemed to be rising from the horizon. we slowed and pulled over to watch. as it approached slowly at a high altitude two other white lights became visible on either side of the orb. then we thought aircraft, but there was no blinking lights. as it passed over, a third white light was visible to the front of the dim glowing sphere and the two other lights more to the rear all three in a triangle shape. we had no explanation and continued to our destination. later that evening while driving south on 397 we noticed another similar light it the western sky. once again we pulled over but this time we got out of the vehicle. it appeared the same way but at a much lower altitude. there was no moon and the sky was clear. as the object passed over, slower than a fixed wing aircraft, it blacked out the stars behind it and made a sound unfamiliar to any of us. we expected to see a reflection of city lights on it as it went east over harrison, but there was none. the tree line obscured it and it was gone."],"Tags":"City","Object Features":"None","Date Submitted":"08/16/1982 09:00 UTC","Source":"MUFON","Date of the Event":"08/16/1982 09:00 UTC","Case Number":"11885","files":["/var/www/straped/mufon/html2text/11885.html.txt","/var/www/straped/mufon/org/11885.html"],"Disposition":"Unknown"}