{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11886.html.txt","/var/www/straped/mufon/org/11886.html"],"Date Submitted":"08/01/2008 09:25 UTC","Viewing Distance":"101-500 Feet","Source":"MUFON","divs":["sighting detailswe were approaching the bridge from the kingston area to rhinebeck to go home after shopping in kingston and noticed all of the lights at the airport next to the bridge were on and flashing. then we noticed a bright light in the sky above the bridge. first we thought it was an incoming plane until we realized it was not moving but just hovering at the top of the bridge. at this point we assumed it was a helicopter. we found out soon it was not. as we approached the object we listened for noise but there was none. we noticed that it was also glowing red, blue and yellow as well as the bright white light. when we arrived underneath the object my husband and son looked directly above us at it. it was round and slowly rotating as well as hovering in one spot with no noise. as we passed we looked behind to see it shoot very very quickly about 1\\2 mile south and then dead stop. it was so fast my son said it left a color trail from the lights. i then saw it take off again very very fast again towards the south directly down the hudson river and out of our sight. we were on a bridge and unable to stop or we would have stopped and investigated further. by the time we got to the other side of the bridge and able to turn around it was gone. this is something i never thought in a million years we would ever see. we know what we saw and it was not anything we can explain."],"City":"Kingston","Case Number":"11886","Object Shape":"Circle","Summary":"was seen hovering and rotating above center of Kingston Rhinecliff bridge at 9:25 pm","Longitude":"-73.988281","trends":["There have been 13 other sightings in Kingston","There was one other sighting in Kingston on or around August 1st 2008"],"Weather Factors":"None","Region":"New York","Country":"United States","Disposition":"Unknown","Date of the Event":"08/01/2008 09:25 UTC","Log Number":"US-08022008-0015","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.929517,+-73.988281(11886)&iwloc=A&hl=en\"> mufon case (11886) map </A>","Latitude":"41.929517","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Object Features":"None"}