{"Weather Factors":"Unknown","Log Number":"US-08022008-0017","Object Flight Path":"Straight-line path","Longitude":"-92.171557","divs":["Sighting DetailsI went out on my back porch on August 1st 2008 at 11:45PM , moonless night, clear skies the stars were very clear. For about 10 minutes I was looking in these general area's while facing West; Big Dipper, Orion's Belt then I was looking a very bright band of the Milky Way right above me. This is when I observed the 4 objects moving from East to West in a tight formation, they seemed to be moving at very high speed although I couldn't begin to estimate their size or altitude. My first thoughts were military jets, after the first couple seconds I realized they weren't jets at all. The objects were crescent shaped with a 3rd point in the middle of the crescent, all 3 point trailing(like a waning moon)as they headed West. The total time the objects were observed was no more than 5 seconds. There was a silver grey glow around them, there was a odd humming sound as they past overhead. I lost sight of the objects as they past behind behind a large tree West of my position I was quite emotional directly after the sighting, I got my head around what I had just seen, I stood on the porch for another 5 minutes looking for more, I then went inside to tell my wife what had happened."],"Sighting Duration":"Undisclosed","City":"Plainview","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.164966,+-92.171557(11888)&iwloc=A&hl=en\"> mufon case (11888) map </A>","Source":"MUFON","Case Number":"11888","Disposition":"Unknown","Object Features":"Other","Country":"United States","files":["/var/www/straped/mufon/html2text/11888.html.txt","/var/www/straped/mufon/more/11888_submitter_file1__4ships.JPG","/var/www/straped/mufon/org/11888.html"],"Latitude":"44.164966","Date Submitted":"08/01/2008 11:55 UTC","trends":["There have been no other sightings in Plainview","This sighting has never been favorited."],"Summary":"4 objects- Modified Crescent Shape -East to West- High Speed only Discrenable sound was a Hum","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"08/01/2008 11:55 UTC","Object Shape":"Boomerang"}