{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.32375,+-83.169594(11881)&iwloc=A&hl=en\"> mufon case (11881) map </A>","files":["/var/www/straped/mufon/html2text/11881.html.txt","/var/www/straped/mufon/more/11881_submitter_file1__HaileyScambaticase.jpg","/var/www/straped/mufon/org/11881.html"],"Object Shape":"Oval, Sphere","Disposition":"IFO","Longitude":"-83.169594","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path then hovering,Other","divs":["sighting detailsmy niece was looking at her address on goggle map, street view and looked in the sky and said there was a flying saucer over her house-north west location. address is not hers , just a reference address date,time & duration is today's info, photo is not dated. goggle map-street view: 24222 new york dearborn mi- north west sky location http:\\\\maps.google.com\\maps?ie=utf-8&hl=en&tab=wl there is a airport & fight path in the area, it is a sunny, bright day with a lot of glare & shinning in the photos that day. what makes it strange is: the shape of the object when you look from different streets (notre dame st-nw - different distance) (boston st.-west & smaller)) still staying in the same general direction. shape stays the same. when you search for it again a few more streets away (time) it is gone. i believe if it was was something on the liens, it would show up in different locations directions. there is probably a simple cause of this effect, i do not know what to tell her and just in case there is not a simple answer, it could be worth looking into. please keep me updated, thank you"],"Case Number":"11881","Summary":"Goggle Map-Street View: 24222 New York Dearborn MI- North West Sky Location","Region":"Michigan","Date of the Event":"08/02/2008 12:00 UTC","Date Submitted":"08/02/2008 12:00 UTC","trends":["There have been 7 other sightings in Dearborn","There were no other sightings in Dearborn on or around August 2nd 2008","This sighting has never been favorited.",""],"Latitude":"42.32375","Log Number":"US-08022008-0010","City":"Dearborn","Country":"United States","Weather Factors":"Unknown"}