{"Disposition":"Unresolved","Case Number":"11895","Latitude":"52.526358","Weather Factors":"Unknown","Tags":"City","Object Features":"Undisclosed","Log Number":"DE-08032008-0007","Date of the Event":"08/02/2008 12:00 UTC","Date Submitted":"08/02/2008 12:00 UTC","City":"Berlin","Longitude":"13.40823","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Berlin","There were no other sightings in Berlin on or around August 2nd 2008"],"Country":"Germany","Viewing Distance":"Unknown","Summary":"15 ufos looks like stars but really shiny mooving","map":"<A HREF = \"http://maps.google.com/maps?q=52.526358,+13.40823(11895)&iwloc=A&hl=en\"> mufon case (11895) map </A>","Object Shape":"Star-like","Region":"Berlin","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt happens yesterday 02.08.08, at 22:00h German time. I was at home in Belin preparing my selve for going to work. It was really hot and all the windows in my apartament were open. So i go to close the window in my room and i saw like 6 or 7 mooving stars - it was beautifull. I have the feeling that they had the formation of the Big Bear, Cart wheel stars - my english is bad. After that i saw another 6 and than another 3. They hide behind the bildings. I saw them on the top of Alexander Plats Tower they were mooving nord east. I was really exsited and made a publication in one web site. Then i lieve my home going to work but i saw another one on the top of Kreuizberg - oposite direction. I go back home write for the other one in the same web site and than go to work. The whole night i was asking people for what i have seen but nobody else was seeng them. So now i am trying to find another witneses and to share info wiht them. I was feeling bad becouse i dindt have any foto camera or foto aparat. I was near to screem to one woman in the city block in front of my own but i decided that its too bold and didnt make it. When i saw them for the first time i was thinking that they are airplains but they were not for sure! They were not baloons or china feners - flying lights. They were mooving to slow for airplanes and some of them in the circle. They were in almost red color like the star of planet Mars but many time stronger and more shiny. They get hide behind the bildings in my neigbour in 20 mins."],"files":["/var/www/straped/mufon/html2text/11895.html.txt","/var/www/straped/mufon/org/11895.html"],"Source":"MUFON"}