{"Latitude":"40.745187","Case Number":"11894","Weather Factors":"Unknown","Log Number":"US-08032008-0006","files":["/var/www/straped/mufon/html2text/11894.html.txt","/var/www/straped/mufon/org/11894.html"],"Tags":"City","Object Shape":"Blimp, Cigar, Oval","Sighting Duration":"Undisclosed","Date of the Event":"06/30/2008 01:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.745187,+-74.162707(11894)&iwloc=A&hl=en\"> mufon case (11894) map </A>","Summary":"Hovered at 45 degrees for fifteen or more minutes, near Newark Air Port","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","divs":["Sighting DetailsOn the way to Newark airport in limo, the last day of june, 1:20 P.M., was looking at sky since I always keep a lookout on the turnpike (famous sighting at Carteret in 2001 , may be repeated, I thought) saw object one half size of thumbnail at arm's length, dark gray, tortoise shell shaped, 45 degrees from horizon, no movement. I thought it might be plane (near airport), but no wings visible and I watched to see if it was advancing or retreating (changing in size) or if it would catch the sun (shiny like plane) or turn to reveal wings. It remained gray, same size, no wings. I was on turnpike, thus kept losing object as the car turned, but reacquired it each time. It was still there when I unloaded my luggage at airport, and was seen by limo driver as well. I did not see it disappear, but saw driver still watching it as I went into airport. No tether (clear line to horizon visible), at about 45 degrees. Not shiny like aircraft departing and arriving at airport. No wings. Saw from several different angles as car's position kept changing. Size did not vary. Not an airplane, nor a balloon (no movement on breezy day)...could possibly have been a blimp, but no writing or movement. I only lost sight when I entered the terminal to catch plane. I was intrigued, but not afraid...I am convinced that any visitors we are having are not belligerent, or we would have known by now."],"Longitude":"-74.162707","City":"Newark","Country":"United States","Source":"MUFON","Disposition":"Insufficient Data","Region":"New Jersey","trends":["There have been 27 other sightings in Newark","There were no other sightings in Newark on or around June 30th 2008"],"Date Submitted":"06/30/2008 01:20 UTC","Object Features":"None"}