{"Country":"Portugal","Tags":"City","trends":["There have been no other sightings in Angra Do Heroismo","This sighting has been favorited 1 time."],"Object Features":"None","divs":["Sighting Details At about 9h45PM, one of my cats was laying near the window that faces west, i got up from the coutch and with the ideia of playing with the cat, as i got near the windows, a bright orange light caught my attention. It was over the ocean and it was very bright and big. At first i thought it looked like a meteor fireball, but unlike these, it wasn't moving. Since i'm an amateur astronomeur and a aviation ethusiast i knew that the object was something else, i called my wife who also saw the object. I stood there a few seconds looking at it, then grabed the binocolous and run outside the house, as i got out the light wasen't there anymore, and apparently nothing was in it last known position, i called for my wife asking if she still had visual contact and she told me that in a few seconds that she looked away the object disapeared. Then, from the object's previous location a small and bright white light came on, and it was moving, i looked at it for several minutes until it came near enough for an identification. The white light i saw was actually the landing lights of an aircraft, but even as it crossed the sky and it got near me it's light and size wasn't comparable to the orange sphere. My guess, that aircraft and some interaction with the object and only a few seconds after the object went away it was able to turn it's lights. Notice that although aircraft usually pass by the path of yesterday's aircraft, i never saw one turn it's lights before, and for a few seconds, it had no lights on. As for my fellings during the event, as soon as excluded that the orange sphere was something natural or man made, i just wish it got near so i could shoot it with my shotgun."],"Disposition":"Unresolved","City":"Angra Do Heroismo","files":["/var/www/straped/mufon/html2text/11892.html.txt","/var/www/straped/mufon/org/11892.html"],"Object Flight Path":"Straight-line path","Summary":"Interaction with aircraft","Date Submitted":"08/02/2008 09:45 UTC","Date of the Event":"08/02/2008 09:45 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.658565,+-27.215859(11892)&iwloc=A&hl=en\"> mufon case (11892) map </A>","Case Number":"11892","Source":"MUFON","Longitude":"-27.215859","Weather Factors":"Unknown","Log Number":"PT-08032008-0004","Region":"Azores","Latitude":"38.658565","Sighting Duration":"Undisclosed","Object Shape":"Sphere"}