{"Log Number":"US-08032008-0009","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around July 5th 2008"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.737935,+-84.546905(11897)&iwloc=A&hl=en\"> mufon case (11897) map </A>","City":"Lansing","Date Submitted":"07/05/2008 12:00 UTC","Latitude":"42.737935","Tags":"City","files":["/var/www/straped/mufon/html2text/11897.html.txt","/var/www/straped/mufon/org/11897.html"],"Country":"United States","Case Number":"11897","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Longitude":"-84.546905","Object Shape":"Fireball, Oval","divs":["sighting detailsjuly 5, before sundown, (about 9pm) it was still a clear blue sky. i invited my neighbor to my house, we were sitting outside in chairs, talking, then i notice a very bright red\\ orange light, \"solid\"?, not blinking ( was strange) west of us at about 10 o`clock going east at a speed of a (my first thought was) helicopter or plane, i do not know the distance, but from our place it, (light) was about the size of the round end of a q tip, \"very bright red\\orange\" and asked neighbor if he knew what it was, we tried to hear, but no sound of plane, and could see nothing attached to it. so we tried to follow it, as it then went behind a tree. we waited and it went past the tree, and it just stopped for a few seconds, and it changed directions,it went north, and \"up\" at about 2 o`clock at a very high rate of speed, within a 3-4 seconds it got smaller to a pin head, then gone. i have never seen anything like it, it was not a balloon, firework, helicopter, or plane. a day or so later \"history channel\" had something on ufo`s and some people reported about what we saw. then i got on the internet, \"ufo site\" and some other reports were like what we saw. there are photo`s on internet about the same as we saw. i am 71 years old and have never gotten into ufo sightings. now they have my attention. i wrote to cufos, they gave me your e-mail address. could you explain this? please e-mail me your thoughts on this. regards, john border john1525@comcast.net"],"Date of the Event":"07/05/2008 12:00 UTC","Region":"Michigan","Sighting Duration":"09:00:00","Summary":"a very bright red/orange light, round","Viewing Distance":"Unknown","Weather Factors":"Unknown"}