{"Country":"United States","Date of the Event":"08/03/2008 11:33 UTC","Disposition":"Unknown","City":"Fort Worth","map":"<A HREF = \"http://maps.google.com/maps?q=32.727489,+-97.31433(11893)&iwloc=A&hl=en\"> mufon case (11893) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-08032008-0005","Longitude":"-97.31433","Tags":"City","Date Submitted":"08/03/2008 11:33 UTC","Source":"MUFON","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 3rd 2008"],"divs":["Sighting DetailsToday, on Sunday, August 3, 2008 at 11:30 am, my son was driving my car and I was the passenger on our way to dropping him off at work. I was admiring how blue and clear the sky was, thinking about how hot the weather would be today and if I could see any clouds in the sky anywhere. There were only high thin clouds in the very far south of the sky. I saw an object that I at first thought may be a small singular flat cloud in the southwest, but as I stared at it, I then thought it was a commercial aircraft as it looked silvery metalic with the sun slightly reflecting off the top of it, but it was at a great distance and height in the sky. I saw the object straight out the front windshield of the car. We were facing southwest and were about to approach the turn in to the parking lot. I spoke outloud, \"what is that thing?\". My son inquired as to where I was looking as we were approaching the parking lot entrance. He looked where I was pointing and saw it briefly and said he thought it was an airplane, but he only got to look for about 5 or 6 seconds. As we were making the right turn, I said \"but it isn't moving\" and crouched down in the car to see up and out the left windows. He tried to look at it with me out the left side window, and he said he could still see it as we drove very slow into the parking lot. But I instructed him to pull in to a parking spot out in the open because there were many people around and he is just learning to drive. I then looked away to instruct him where to park so that we would have a clear view of that area of sky away from trees. We parked and quickly stepped out of the car, searching the same area of sky, but the object was gone. I looked and instructed my son to look, in the surrounding area of the sky as if it were a jet and had traveled in the several seconds that we were parking the car. After approximately 30 seconds of searching in the sky and finding nothing, my son walked in to work and I got in to my car and looked at the clock to see it was 11:34am. Heading back home, I pulled in to a school parking lot on a small hill a few blocks away from where I left my son. I sat and looked around the southern and western skies for about 5 minutes. I couldn't find anything in the south or west, not even any commercial aircraft. As I type this, I now find it odd that I didn't see any commercial aircraft either. I have been trying to run through my mind what other possiblities it could be, but nothing else makes sense. I sincerely feel that is was not an aircraft such as a commercial passenger jet that we frequently see as we are approximately 10 miles from DFW Airport. This object was stationary. I truely believe there would have been obvious movement across the sky, and how close it would have to be for even the largest commercial jet airplane to be that length. Besides, the length to thickness ratio was not proportionate to any of the commercial aircraft that I have seen. This was cigar shaped from our angle, or possibly some other flat shape and we were just viewing along its edge. The lack of clarity of the metalic surface, even though it did appear like the silver skin of a commercial jet, makes me believe it was very far away, making it very, very large in size. I thought about the possiblity that it was a reflection of some sort inside the car onto the inside windshield, however, I continued to see the object in the same spot in the sky as we were turning. I do have a great interest in UFO phenonenom. I have only had one other sighting experience about 5 years ago, but I have never submitted any kind of report before. This particular experience left such a feeling that I know I saw something that didn't make sense. I felt I had to report this, and hope that others saw what I did and will report it as well. Thank you"],"Object Flight Path":"Stationary","Case Number":"11893","Latitude":"32.727489","Summary":"White cigar shaped, silvery metalic, sun reflective topside; stationary. Very high in the sky.","Weather Factors":"None","Region":"Texas","Object Shape":"Cigar","Object Features":"None","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/11893.html.txt","/var/www/straped/mufon/org/11893.html"]}