{"Weather Factors":"Unknown","Latitude":"39.955015","map":"<A HREF = \"http://maps.google.com/maps?q=39.955015,+-75.160959(11907)&iwloc=A&hl=en\"> mufon case (11907) map </A>","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around August 3rd 2008"],"Country":"United States","Object Shape":"Sphere","Log Number":"US-08042008-0007","City":"Philadelphia","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"a silent sphere of white light","Longitude":"-75.160959","files":["/var/www/straped/mufon/html2text/11907.html.txt","/var/www/straped/mufon/org/11907.html"],"Date Submitted":"08/03/2008 12:00 UTC","Tags":"City","Region":"Pennsylvania","Viewing Distance":"Unknown","Disposition":"Unresolved","Date of the Event":"08/03/2008 12:00 UTC","Case Number":"11907","divs":["Sighting DetailsI was sitting on my balcony looking at the night sky when i picked up an electronic type sound in my right ear, the sound came back a couple of minutes later. I turned in the direction where i believed the sound emanated from and saw the object coming from the West to the East. I live near the airport and no planes come from that direction, that's what grabbed my attention too. I observed the object through a pair of Astronomer binoculars but i still couldn't clearly identify it. It was just a ball of light travelling slowly and silently. no blinking lights of any kind. As it got closer to me it just faded out and disappeared. Visbility was perfect, no clouds at the time. i've heard strange electronic type sounds recently but this is the first time that i could actually link the sound with a UFO sighting. And the sounds come in pairs of 2. what blew me away is the fact that it announced its arrival and the direction it was coming from with the sound i picked up with my right ear. For some reason UFO activity in the Philadelphia area has been intensifying in the past year. others are picking up on it also. something is definitely going on."],"Sighting Duration":"Undisclosed","Source":"MUFON"}