{"Disposition":"Unknown","City":"Charlevoix","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"08/01/2008 09:40 UTC","Longitude":"-85.2584","Summary":"bright white light","Sighting Duration":"00:02:00","Case Number":"11913","Region":"Michigan","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.318063,+-85.2584(11913)&iwloc=A&hl=en\"> mufon case (11913) map </A>","Date Submitted":"08/01/2008 09:40 UTC","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsto the person who wrote the aug 3rd michigan sighting: where were you when you saw the light? what town? i had the same thing happen in charlevoix, mi on friday aug 1st at 9:40pm. my 10 year old son noticed the extreemly bright, non-flashing white light at the same time i did. my son said, \"dad, what's that?\" i replied, \"i don't know.\" i ran into the cabin & grabbed the binoculars & by the time i came out of the cabin & got a \"fix\" on the location, the bright white light turned a red and came to a stop. a stop right in the middle of orion's belt. we watched it for over an hour but it never moved, changed color or did anything from the point it stopped. we were on lake charlevoix between horton's bay & oyster bay facing south. the object moved from west to east & then out..out towards the center star of orions belt. time was 9:40. again, we (my son & i) observed the super bright non-flashing white light for roughly 10 seconds. i ran into the cabin to grab binoculars(that took only 10 seconds because my son & i timed it the following day). when i came out of the cabin it was still bright white & then stoped exactly at the center star of orions belt & changed to red & moved out\\away from us. at 9:40pm in northern michigan it is still light out side. the size & elevation are hard to estimate. if were a plan or helicopter, we would have heard the noise due to the size of the light."],"Object Shape":"Circle","Object Features":"Unknown","Latitude":"45.318063","Log Number":"US-08042008-0013","trends":["There have been 5 other sightings in Charlevoix","There were no other sightings in Charlevoix on or around August 1st 2008"],"files":["/var/www/straped/mufon/html2text/11913.html.txt","/var/www/straped/mufon/org/11913.html"]}