{"Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"None","City":"Winchester","Date of the Event":"08/10/1962 12:00 UTC","Object Shape":"Cylinder","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/11918.html.txt","/var/www/straped/mufon/org/11918.html"],"Latitude":"37.990079","Country":"United States","Region":"Kentucky","Date Submitted":"08/10/1962 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-84.17965","divs":["Sighting DetailsWhile loading tobacco onto a wagon to take to the barn, I was on the ground, my brother-in-law was on the tractor and my father was on the wagon. I handed a stick of tobacco up to my father to load onto the wagon, he walked over to the edge to receive the tobacco and I noticed what I thought were heat waves coming off his right shoulder; which was to my left because he was facing me. But as he moved away from me the waves were still there. Then I noticed it was something coming down at about a 60 degree angle. I couldn't really tell what it was and it wasn't really moving that fast as far as I could tell. It actually looked like it was pushing the atmosphere away from it on each side but it could have been heat. It leveled out and came straight toward the tobacco field and went across in front of us to a point and then was coming back in the exact same path, it didn't even stop and turn, just came back at the same speed, nothing can do that. That's when I yelled, \"What's that\"? My father and brother-in-law couldn't see it. My brother-in-law saw a big plane on the horizon, making a landing approach to Blue Grass Field in Lexington, KY. But this was much closer and faster. To try to keep track of it, you would have had a move your arm across the sky very fast. The plane looked like it was stopped in comparison. If you had not seen what I thought were heat waves on my father's shoulder, and kept track, you would never have seen it because it was almost invisible. You could either almost see through it, or it was reflecting the blue sky and white clouds off it's surface, because it was not defined, it almost looked projected, if that makes any sense. It was cylinder in shape, turned vertical, and what I think were two lines of blue windows. It was spinning so fast that there seemed to be blue smears from the windows and silver smears from the craft itself. I did not point to it until it was going back the way it had come, I was trying to figure out what it was, but when I did point, I felt something sinister looking back at me from those windows. It followed that exact path, turned up at the exact spot where it leveled out coming down, and shot up at 60 degree angle so fast that it almost looked as if it disappeared. All of this took about ten seconds in broad daylight. My father said it was probably something from the military. I was just entering high school and had never heard the term UFO or anything like it. But after school and the US Navy, and with more education, I relized what I had seen. I'm not very good and concise with words so this is long. I finally told a few close friends, but this is the first time I've ever written it down in detail."],"Log Number":"US-08042008-0018","Case Number":"11918","Object Features":"Window(s)","Disposition":"Unknown","trends":["There have been 2 other sightings in Winchester","There were no other sightings in Winchester on or around August 10th 1962"],"Summary":"While harvesting tobacco with my father and brother-in-law, saw vertical cyclinder come down and across and back up.","map":"<A HREF = \"http://maps.google.com/maps?q=37.990079,+-84.17965(11918)&iwloc=A&hl=en\"> mufon case (11918) map </A>"}