{"Log Number":"US-08042008-0020","Object Features":"None","Date of the Event":"07/04/2008 11:30 UTC","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"07/04/2008 11:30 UTC","Object Shape":"Sphere","Case Number":"11920","Disposition":"Unknown","Object Flight Path":"Other","Region":"Wyoming","trends":["There have been no other sightings in Tensleep","This sighting has never been favorited."],"divs":["Sighting DetailsI was on vacation in Wyoming. My sister's house is small and usually full to the brim with people, so I always camp outside in her yard--usually in a tent. This year my tent blew down during a rain squall and was demolished, so I set up my cot and sleeping bag in the back of my pick-up in my camper top, and pulled the truck out further away from the house than usual, about fifty yards, to get out of a mosquito infested area. I had taken a little drive in order to call my husband that night, up the highway where there was cell phone coverage, and then returned to my spot at about 10:30 P.M. The ranch house is a mile off of the highway, and the only neighbor is Grandpa's house, another eighth of a mile west from my sister's place and not visible from where I was parked. The kids were in town at the street dance, my mom and sis and brother-in-law in the house; I sat and smoked a couple of cigarettes and watched as the lights went down in the house which meant everyone had gone to bed. I then got into my sleeping bag and was trying to get to sleep, when a mosquito came calling, and wouldn't leave me alone. I probably layed there for a half hour trying to ignore this bug, and intermittently slapping at it before I finally got up out of the cot, grabbed a shirt and started slinging it all around the inside of the camper to rid myself of the irritation. After a bit of that, I stopped and listened to see if I could hear the mosquito buzzing any more, facing the house (west) on my knees, when a bright light caught my attention, from the right side (north). I turned to look and saw a pea or dime-sized glowing sparkly sphere of light above the trees toward the hills to the south. For three seconds it moved to the right (easterly) and downwards, went behind some tree branches, then appeared again for another three seconds or so, continuing downwards and then disappeared behind more tree branches. It's flight was jagged, or cork-screwing slightly, not completely smoothe and it was not going fast, but just drifting along somewhat erratically. It's outline was not distinct, but the glow was circular in form, and the sparkly appearance might be better described as an internal fire exuding streaks or sparks of light. When I first saw it I thought for a second that it could have been the kids' headlights up on the hill coming home from the dance, but it was way too early for them to be coming home (they didn't come in until the wee hours), and this light was going the wrong direction (they would have been traveling westwardly) and it was no headlight! I sat and waited for the thing to come back or appear again, but to no avail. I didn't even think at the time that I could have driven up there to see more; I think I decided that it was long gone and there was no point in searching it out. After fifteen minutes or so of watching for it to come back, I got back in bed and fell fast asleep. Weather conditions were extremely hazy and smokey from the California wildfires this summer, but stars were out that night, and so was the moon (full or almost full, I think). We had had a small amount of rain earlier in the evening (the squall that blew down my tent) but the weather had cleared and I did not observe any clouds in the part of the sky that I could see. The only other thing that might be pertinent is that there is a power line that runs partway along the \"driveway\" to the house along the top of the hills to the north. The hills there are sagebrush prairie with no trees, but neither the power lines or the hills were visible from my vantage point which was down in the trees near the house. I've been spending my summers there for the last seven years, and we have seen some strange things while out star-gazing, but this was the closest (as in, nearest) encounter I have had with any of these strange sightings."],"Country":"United States","City":"Tensleep","files":["/var/www/straped/mufon/html2text/11920.html.txt","/var/www/straped/mufon/org/11920.html"],"Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Summary":"A sparkly sphere floated downward behind trees","Latitude":"44.170133","Longitude":"-107.220963","map":"<A HREF = \"http://maps.google.com/maps?q=44.170133,+-107.220963(11920)&iwloc=A&hl=en\"> mufon case (11920) map </A>"}