{"Source":"MUFON","Object Flight Path":"Path with directional change","Country":"United States","City":"Sherwood","Date Submitted":"08/03/2008 10:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.358867,+-122.832438(11928)&iwloc=A&hl=en\"> mufon case (11928) map </A>","divs":["Sighting Details It was between 10 and 11 pm sunday night aug 3rd. Every night I go out for at least a couple of minutes to look up at the sky. I had been looking around for a couple of minutes and I saw a very bright object moving across the sky. It was heading east coming from some where towards the coast range. It was different color than a satellite, much larger and not moving like one. I called my wife and oldest son to come and look and we all continued to watch it moved eastward across the sky. Suddenly it changed direction as if it were heading directly away from earth, took off at a very rapid speed then completly vanished into thin air. I have been watching the night sky for many years and have seen many things, I can tell the difference between planes, satellites, stars and planets. To me there is no question what I saw last night (space ship,) I am just not sure what exactly was flying it. I am convinced that what I saw was nothing that any country claims to have as far as aviation or aircraft, I just wish I knew what it was that was flying that thing. I will continue to go out in my back yard every night in this little town of Sherwood Oregon in hope of getting some answers. I have had a feeling for some time that something big is about to happen that is going to shock the world and after last night I am more convinced of this."],"Date of the Event":"08/03/2008 10:45 UTC","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/11928.html.txt","/var/www/straped/mufon/org/11928.html"],"Latitude":"45.358867","Viewing Distance":"Unknown","Weather Factors":"None","Object Shape":"Circle","Object Features":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-08042008-0028","trends":["There have been 4 other sightings in Sherwood","There were no other sightings in Sherwood on or around August 3rd 2008"],"Case Number":"11928","Tags":"City","Longitude":"-122.832438","Summary":"It moved slowly across the sky , it started to speed up and changed direction and disappeared.","Region":"Oregon"}