{"Latitude":"41.65225","Object Shape":"Sphere","Object Flight Path":"Path with directional change","City":"Oregon","files":["/var/www/straped/mufon/html2text/11923.html.txt","/var/www/straped/mufon/org/11923.html"],"Case Number":"11923","Date of the Event":"07/04/2008 10:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.65225,+-83.482307(11923)&iwloc=A&hl=en\"> mufon case (11923) map </A>","Date Submitted":"07/04/2008 10:25 UTC","Source":"MUFON","Country":"United States","Disposition":"Unknown","trends":["There has been one other sighting in Oregon","There were no other sightings in Oregon on or around July 4th 2008"],"divs":["Sighting DetailsI was standing in my back yard watching the end of the Toledo Ohio 4th of July fireworks. from one spot in my back yard i could see them. i heard a large bang from a fireworks shell go off to my rear. i turned around and watched the firework dissipating .then i saw this light that was moving from east to west .this light was different than any i have ever seen. I see lifeflight,promedaca helcopters,fighter jets from the local air Nat guard ,local passenger jets from Toledo express airport and we get a lot of air traffic out of Detroit mi. the light was orange in color.as the light came closer i could make it out as a sphere. i was facing directly east .this sphere moved slowly from east to west. the sphere moved with no noise that i could could tell but there was fireworks going off all around me at the time .I was alone at the time and there was no one within sight. I was looking eastward at the time. the sphere moved in a(one o'clock ) position over my right shoulder .i follord the sphere to the south then to the west.i can not tell how large it was but after the sphere was gone i took some change out of my pocket and started to hold coins up at arms length. the closest coin was a dime,but the sphere was a little smaller.if you were looking south the sphere moved west till it got to the (2 o'clock)position then with no curve turned to the south west about 45 degrees and kept on going . i lost the sphere when it went past trees across the street from my house . after the siteing i went inside my house and tried to wright down what i saw . after that i took my compass and made sure of my directions .i live on a corner and the street in fron of my house runs east to west i did not feel scared or nervous when i saw the sphere. i knew that the light was different than i have ever seen so i watched it go by ."],"Weather Factors":"Unknown","Summary":"orange sphere flying east to west","Sighting Duration":"Undisclosed","Region":"Ohio","Object Features":"None","Viewing Distance":"Unknown","Tags":"City","Longitude":"-83.482307","Log Number":"US-08042008-0023"}