{"Object Flight Path":"Straight-line path","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around September 15th 2004"],"Disposition":"Unknown","Date Submitted":"09/15/2004 07:30 UTC","Case Number":"11936","Log Number":"US-08052008-0008","Sighting Duration":"00:00:10","Weather Factors":"Does Not Apply","Latitude":"34.110627","Region":"Georgia","divs":["Sighting Detailsme, my (now ex)wife and stepson were eating at IHOP on Hwy 92 near 5-75 in Woodstock, GA. When we finished, the three of us started walking out to the car. My stepson noticed something overhead and asked me if I knew what it was. Both me and my then wife looked up and saw a black triangle with three lights (one on each corner) moving silently through some clouds approximately 250-300 feet above us. It was moving rather slowly, and it didn't make any noise. I initially believed it to be some sort of drone, or experimental craft since we live so close to Dobbins AFB. I assumed it was monitoring traffic, and decided not to pay any more attention to it and we left. I remember it moving almost too slow for it to stay aloft. If a plane was moving that slow it would have crashed. I thought it may have been an electrical powered glider of some sort. My wife was insistent that what we had seen was a UFO. I agreed since I didn't know what it was, and it was something I had never seen before or heard about. I still don't know if what I saw was a man made experimental craft and would appreciate any information regarding it."],"Summary":"Black Triangle","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Woodstock","files":["/var/www/straped/mufon/html2text/11936.html.txt","/var/www/straped/mufon/org/11936.html"],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.110627,+-84.513435(11936)&iwloc=A&hl=en\"> mufon case (11936) map </A>","Tags":"City","Object Shape":"Triangle","Date of the Event":"09/15/2004 07:30 UTC","Country":"United States","Longitude":"-84.513435"}