{"Object Shape":"Disc","Object Features":"Other","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around August 4th 2008"],"Date Submitted":"08/04/2008 03:30 UTC","Disposition":"IFO","Log Number":"US-08052008-0009","Region":"California","files":["/var/www/straped/mufon/html2text/11937.html.txt","/var/www/straped/mufon/org/11937.html"],"Viewing Distance":"Over One Mile","Latitude":"36.980597","Sighting Duration":"00:00:10","Weather Factors":"None","City":"Santa Cruz","Case Number":"11937","map":"<A HREF = \"http://maps.google.com/maps?q=36.980597,+-122.024036(11937)&iwloc=A&hl=en\"> mufon case (11937) map </A>","Tags":"City","Summary":"At around 3:30pm viewed an object that I could not ID to the East, moving North to South at a high rate of speed","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"08/04/2008 03:30 UTC","Longitude":"-122.024036","Country":"United States","divs":["sighting detailsat around 3:30pm, while sitting on the outside deck of the ideal restuarant in santa cruz, having just finished lunch with my girlfried, i was looking to the east, when an object coming from the north, moving to the south, at what i thought was a very high rate of speed, caught my eye. i beleive that this object caught my attention due to is speed and also a shape that did not look familer to me. at the time when i first noticed this object the sun was directly behind me on my back and i was looking east tword capitola. my very rough estimate is that this object flew over close to capitola at an altitude of approximatly 5,000-10,000 feet. after watching this object for about 5 seconds, i asked my girlfriend, who at the time was facing me, with her back to the object, to turn around and look. at the time i asked my girlfriend to look, i would estimate that this object was already 1\\2 to 3\\4 across monterey bay. in the 3-5 seconds that it took for me to ask my girlfriend and for her to turn to look, the object was almost out of visual site (my girlfriend did not see the object) at the time i felt that due to the objects speed i shoud have heard some sound, possbile a jet engine sound or even a sonic boom, i heard no sound at all. this also caught my attention even though this happenend very fast. after thinking about what i just saw, i did a very rough calculation: the distance from capitola to monterey across the bay is approximatly 30 miles, i estimated that the object i saw covered this distance in about 10 seconds. this estimate of the objects speed and lack of sound is one of the reason i decided to file a report. i have always been interested in aircraft, have been to many airshows, have seen military aircraft flying at high speed (never supersonic), but my perception of this object was that it was moving at a supersonic speed. also my feeling was that this object moved in a very striaght line, i mean like taking a ruler and drawing a line across a piece of paper striaght the shape of this object fit the somewhat traditional saucer shape; kind of skinny at the ends and fat in the middle, with the exception of the trailing edge. the trailing edge had what i can only discribe as similar to a vertical stabilizer on a traditional aircraft, but i do not believe that this was a traditional aircraft. also this object did not seem to me to have a diffinitive outline, although definatly visable, i could not discern any clear lines of an airframe that i would expect to see from my observations of aircraft that i am familiar with. i would say that the outline was almost fuzzy in appearance. i did not see any lights on this object, though this did not strike my as unusual givin the time of day and the angle of the sun. what did strike as possible unusual is that i did not see any reflection of the sun off of the object; maybe just not the right angle? the weather at this time was clear and close to unlimited visibility. air temperature was around 75 degrees, no clouds. earlier in the day there had been a marine layer of fog over the bay that burned off around 12:00. at the time that i saw this object there was fog or a marine layer well to the west, over the pacific ocean, but not over monterey bay. when i first noticed this object i had a strong feeling that this was not any aircraft that i was familier with by shape, i think that is what got my curiosity. as far as i know there were no other witnesses. thank you for taking this report, mark"]}