{"Date Submitted":"07/31/0001 11:30 UTC","Region":"Texas","divs":["Sighting DetailsI was on my way to work in the town of Poth, Texas. I was just on the edge of Fall City, Texas, observing a motorcyclist about 75 yards in front me. He had just passed over the San Antonio River bridge and began descending down the small decline there when an object no longer than the width of Hwy. 181 streaked from the left side of my view to right, just above tree-top level. It passed directly over the cyclist. Visually, it was in a position that I do not think possible to see for the person on the motorcycle. The speed I was driving at the spot was 45 mph. If I was not looking at the cyclist, I would have never known it was there. It was dead silent and moved so fast that I couldn't register details except for the following: 1.) It was slender and had a thin profile. 2.) It was dull grey metal in color 3.) I could hear no sound and the cyclist showed no indication that he heard anything above him. 4.) There was structure to it because I could faintly make out it possessed other angles and differences in shading. 5.) The bottom portion of the object seemed to have a slight curvature to it, like a lense resting on a surface. This curvature was more of an impression rather a very clear visual. 6.) The front portion seemed thinner than the rest, perhaps a bit more like a jet. 7.) The size was smaller than a F-16 but longer than a car. I sometimes see training aircraft in the area, along with crop-dusting planes. This looked nothing like those and this was completely silent. I have been to air-shows all my life and if this was a plane or jet, I should have heard or felt something at the distance I was engaged in. I could not track this into Eastern sky because of the trees blocking the view and also how close to tree-top this object was. When I got to work I sketched some lines on paper without looking at the paper, to attempt to draw the impression of the object. I took that sketch and filtered it in Photoshop. I enclosed both."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.271213,+-97.733561(11933)&iwloc=A&hl=en\"> mufon case (11933) map </A>","Summary":"High Speed Dull Metal sleek object silently speeds over Hwy 181 by Fall City, Texas","Longitude":"-97.733561","Viewing Distance":"101-500 Feet","Case Number":"11933","City":"Austin","Object Features":"Patterned Surface","Log Number":"US-08052008-0005","Object Shape":"Diamond, Unknown","files":["/var/www/straped/mufon/html2text/11933.html.txt","/var/www/straped/mufon/more/11933_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/11933_submitter_file2__UFO.jpg","/var/www/straped/mufon/org/11933.html"],"Weather Factors":"None","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 29th 0001","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:01","Source":"MUFON","Latitude":"30.271213","Country":"United States","Date of the Event":"07/31/0001 11:30 UTC"}