{"Date Submitted":"07/31/2008 11:30 UTC","Sighting Duration":"Undisclosed","Case Number":"11939","map":"<A HREF = \"http://maps.google.com/maps?q=36.008286,+-119.9618(11939)&iwloc=A&hl=en\"> mufon case (11939) map </A>","Object Shape":"Other","Log Number":"US-08052008-0011","City":"Kettleman City","trends":["There have been no other sightings in Kettleman City","This sighting has never been favorited."],"Summary":"Bright Lights off Hwy 41 in California","Tags":"City","Latitude":"36.008286","Date of the Event":"07/31/2008 11:30 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11939.html.txt","/var/www/straped/mufon/org/11939.html"],"Disposition":"IFO","divs":["Sighting DetailsWe (my husband driving, me in passenger seat, daughter & her friend in back seat) south on Hwy 41 in California on the night of July 31, 2008. It was about 11:30pm at night. We were driving in an agricultural farming area so other than the lights of other vehicles on the highway it was sort of dark off to the sides of the highway. As I was watching straight ahead, I noticed what I thought was a low-flying airplane coming opposite to us and over the highway and other cars on the opposite side of the highway. I couldn't help but notice it as it was a row of very strong bright lights and I had to squint. It seemed to be about 5 lights in a row across. There was no space between each light the way there is on an oncoming airplane. It started to bank to its right which made me think there must be a small airport nearby and the aircraft was going to land. I thought it was a late-night cropduster. I asked my husband if he saw the lights and if he thought there was a small airport nearby. He was disinterested and said probably. In the next minutes or so I continued to watch this bright row of lights. The \"aircraft\" did not land but instead seemed to come up from its banking sideways and seem to appear to turn in such a way that the row of lights became a small orangish glow. I assumed it was similar to looking at the wing of an airplane from the side. But as I continued to watch this little orange light which sort of pulsated, it dawned on me that aircraft usually have green or red tail and wing lights. This didn't look like any aircraft I have seen before. So I asked the kids (13 years old) in the back of the car if they saw it. They looked and saw it and watched as this aircraft banked left and right in s-shapes all across a huge agricultural field area. Both kids thought it looked odd. My daughter commented that it looked like it was pulsating to her. My husband (who was driving fast at 80mph) wasn't paying too much attention until I urged him to pull over on a side road. We sat for maybe about 10 minutes and watched this aircraft doing its strange banking turns and fading out from bright lights to an orange glow then disappear all together. That was pretty strange to all of us. We lost track of it when it literally disappeared on one of its turns. One of the kids even rolled down the back car window so we could hear if there was an airplane engine noise because I thought at first it might be a late-night cropduster. But there was no noise other than the occasional car passing on the highway. No other airplanes were flying overhead. As we sat silently watching this aerobatic air show my husband finally took interest when he pointed out that it seemed to be \"hiding\" behind a row of tall cypress-type trees near the only house nearby which was almost directly across from us on the other side of the highway. It then went from nothing to an orange glow (about the size of a light on a lightpole I would guess) to this huge bright row of lights. Then it would do its s-turns and disappear. We waited a few minutes more for it to return but then could only see it far in the distance going away from us. We had to press on. Unfortunately the battery in our digital camera was already dead so we couldn't catch it on tape. Later as I talked to everyone about it I asked what they saw. My daughter thought that in the dark she could make out faintly that it seemed to be the shape of a guitar-pick...pointy on the top and round on the bottom. Her friend agreed. The bright row of lights were at least 5 but seemed to point in an angle horizontally. My husband offered no explanation other than he agreed it had very bright lights brighter than an oncoming airplane and it was odd that it disappeared in the dark night sky and then would reappear elsewhere over the agricultural field. I couldn't tell its overall shape but I can say that when comparing the row of lights to a car on the highway it would have to be at least 3 car lengths across in size or maybe the size of a DC-3. It certainly was bigger than a cessna. I was also amazed at how low it could maneuver in such smooth 30 degree turns...I would guess that it was flying about the height of 1-2 stories...only later maybe up to 3-stories. This based in comparison to the buildings in the distance and the one house nearby. As we continued on I did note the signs on the highway to remember where we were. There was one small street named Quail Ave to the right of us (or going west). I'd say we were about 5-10 miles outside of Kettleman City. We were somewhere between the city of Lemoore and Kettleman City. (I recall seeing a sign on the left side of the road which pointed east to Tulare and Corcoran) and then maybe 5 minutes or so later saw the approaching bright lights. I might also add that when I first saw the lights they were flying almost parallel to the highway and cars on the opposite side of the highway were under it. No one else pulled over as far as we could tell."],"Weather Factors":"None","Source":"MUFON","Object Flight Path":"Other","Country":"United States","Region":"California","Viewing Distance":"101-500 Feet","Longitude":"-119.9618"}