{"City":"Vienna","Sighting Duration":"Undisclosed","Longitude":"-77.26526","Log Number":"US-08052008-0003","Summary":"large glowing orange sphere \"dancing\" above tall tree-line","Weather Factors":"None","Date of the Event":"08/03/2008 10:10 UTC","divs":["Sighting DetailsI stepped outside to smoke a cigarette before getting ready for bed, and looked up into the sky to \"wish upon a star\"- which is my nightly routine. I saw my first star, made my wish, and continued looking around in the sky above me [I don't have much visibility when it comes to seeing stars in the sky in any other direction other than UP, due to very tall oak trees in the neighborhood- unless I'm standing at the end of the driveway]. So, I walked towards the street to get a better view of the north star, which seemed especially bright. I stood there for about 1 minute, turned around to look down the other end of the street for a few seconds, and turned back. THAT IS WHEN out of the corner of my eye I noticed a very large glowing orange sphere southwest of the north star! I was able to focus in on it, but only with my eyes because I was afraid if I ran inside to grab a camera, that it would leave as quickly as it came. It was stationary for about 5 seconds or so, and then seemed to \"dance\" or bobble in the air, up and down, for about 10 seconds before making about a 45 degree northwestern - western departure trail down the street. [I say this because I lost visibility due to the tall oak trees in the neighborhood, and wasn't able to run fast enough to follow exactly how it left and where it left to]. It was silent the entire time! I ran inside to tell my parter to come outside and help me look around for it, but it was too late. I feel so lucky to have seen what I did, but at the same time it almost seems too surreal. But I know what I saw... I hope someone else out there saw it too! And was able to snap a picture or videotape it. There were airplanes in the air, both before and after the UFO sighting, however they were VERY high in the sky and appeared to be moving slowly in a straight path, blinking red and white lights- which was NOTHING like the UFO that I witnessed! It was NOT an airplane and it was NOT a helicopter!"],"Latitude":"38.901222","Disposition":"Hoax","Tags":"City","Source":"MUFON","Country":"United States","Date Submitted":"08/03/2008 10:10 UTC","Region":"Virginia","Viewing Distance":"101-500 Feet","Object Shape":"Sphere, Star-like","Object Flight Path":"Stationary,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/11931.html.txt","/var/www/straped/mufon/org/11931.html"],"Object Features":"Unknown","Case Number":"11931","map":"<A HREF = \"http://maps.google.com/maps?q=38.901222,+-77.26526(11931)&iwloc=A&hl=en\"> mufon case (11931) map </A>","trends":["There have been 5 other sightings in Vienna","There were no other sightings in Vienna on or around August 3rd 2008"]}