{"Latitude":"30.704037","Longitude":"-88.040054","Summary":"Fast moving triangle shaped object flashed lights in a pattern","Country":"United States","files":["/var/www/straped/mufon/html2text/11944.html.txt","/var/www/straped/mufon/org/11944.html"],"Case Number":"11944","Weather Factors":"None","Object Features":"Unknown","Region":"Alabama","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Date Submitted":"08/05/2008 04:20 UTC","divs":["Sighting DetailsLast night at about 3:50 I woke and couldn't get back to sleep. I walked around the house and got a snack. Then just to have something to do I looked out the window of my room. I looked around the sky (as I usually do) and saw what looked like a star.......at first. I looked at it for a minute and saw that it was moving. I thought it was an airplane so I kept watching it. Then the object got closer where it's shape was clearer. Then it moved VERY fast around in a very random manner. I kept watching in amazing and curiousity. It was triangular shaped and had a bright light in the center with 3 lights on the side (one on each corner). The side lights started flashing in a pattern. It kept this up for a minute until small lights were heading to and from the object. The next thing it did was move in a side to side motion very fast. Then it stopped. All the lights shown bright. Then a row of light appeared off one of the corners. After this it made more flashing patterns with a seperate set of lights. All of the lights were bright and appeared a good distance from each other. Then moving around slowely and shown a semi-circle row of lights. These light didn't appear to be connected to it at all. Then it continued the flashing pattern for a about 20 seconds before flying away. It was pretty far up and away but I could see it CLEARLY. It flew away so fast that if I were to blink I would have missed it."],"Object Flight Path":"Stationary,Path with directional change,Path then hovering","Date of the Event":"08/05/2008 04:20 UTC","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","City":"Mobile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.704037,+-88.040054(11944)&iwloc=A&hl=en\"> mufon case (11944) map </A>","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around August 5th 2008"],"Log Number":"US-08052008-0016","Disposition":"Unknown"}