{"City":"UNKNOWN - maybe Cincinnat","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/11947.html.txt","/var/www/straped/mufon/org/11947.html"],"Weather Factors":"Unknown","Case Number":"11947","Source":"MUFON","Summary":"Disappearing and reappearing objects seen out airplane window","Latitude":"40.419467","trends":["There have been no other sightings in UNKNOWN - maybe Cincinnat","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.419467,+-82.898323(11947)&iwloc=A&hl=en\"> mufon case (11947) map </A>","Object Flight Path":"Stationary,Straight-line path,Unknown","Longitude":"-82.898323","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date Submitted":"08/02/2008 06:15 UTC","Log Number":"US-08062008-0003","Country":"United States","Sighting Duration":"00:15:00","Date of the Event":"08/02/2008 06:15 UTC","Disposition":"Insufficient Data","Region":"Ohio","Object Shape":"Oval, Unknown","divs":["Sighting DetailsI've always believed, but I'd never definitively seen a UFO until Saturday. I was on a passenger jet on a flight from Detroit to Cincinnati in the early evening this past Saturday and somewhere over Ohio I looked out the window into the western sky. It was a beautiful day with some clouds. We'd been at our cruising altitude about 10 minutes when I saw what I initially thought was a plane far away, even though it just looked like a white or silvery oval. It was higher than we were and was climbing at about a 45 degree angle which I thought was kind of strange. I watched it for about 5 seconds, and then it disappeared! Completely! At first I just thought I lost sight of it, which can happen with far away objects in the sky, but it was nowhere. So then I started REALLY paying attention to the sky out the window. After a few minutes I saw another (or the same) object, but in a different part of the sky. It appeared out of nowhere. It didn't seem to be climbing and seemed more or less stationary (although that might've just meant it was traveling at a similar speed to us). I saw it flash, which at the time I assumed was metal reflecting in sunlight. And then it also disappeared. This happened 4 more times! There were a total of 6 times on that flight that I saw an object appear out of nowhere, flash, and disappear. I initially thought the flashing was reflecting sunlight, but I now think it must've been related to whatever was making the object(s) disappear. I don't know what it is that I saw, but if it wasn't an alien craft, then our military has totally been lying and withholding about the level of their technology. I've never heard of anything being able to disappear and reappear like that; let alone while cruising at 20,000 feet or so. Unbelievable."]}