{"Longitude":"-73.95988","Country":"United States","Case Number":"11948","Date Submitted":"08/02/2008 10:40 UTC","Viewing Distance":"101-500 Feet","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.785244,+-73.95988(11948)&iwloc=A&hl=en\"> mufon case (11948) map </A>","Source":"MUFON","Log Number":"US-08062008-0004","Summary":"Unlit oval object witnessed. Exact trajectory as sighting in March 08'","divs":["sighting detailssince the first sighting in my life which took place in march of this year, i understandably spend a little time on most clear nights gazing at the sky. on this particular night (august 2nd 2008) i was standing on my porch about to go in for the night when i observed an oval shaped object \\ craft heading from north to south. it had no lights, but due to its almost white, or opaque color it was totally discernible against the back drop of the clear night sky. at first i thought it might be a bird, but i have never seen a bird that size, that fast, that high moving as fast as it was, and in a perfectly straight line. the object seemed to be roughly 500 ft high (hard to tell exactly). it was oval shaped but moving from the wide side of the oval. it was of course totally silent. it was about the size of a thumbnail with your arm fully extended. it was quick enough to traverse the distance in the sky between my neighbors and my house in just a few seconds. i ran down to the street to see if i could visually re acquire it, but it was gone. i live near jfk and laguardia airports and am familiar with all sorts of aircraft both domestic and military. this was clearly none of those. as it passed over our homes many dogs in the general area began barking. maybe they could actually hear it. shortly after the object was gone the barking ceased. after about 5 minutes of continued observation i went inside. we are currently watching my mother in laws small dog. she was found (the dog that is) cowering in the corner. it took several minutes to get her calmed and to stop shaking. i have never seen her (the dog) act like this. perhaps worth mentioning is that this object had the exact same trajectory as the craft i witnessed back in march 08'. i am 45 and until that first sighting of my life in march i was somewhat of a open minded skeptic. that has changed. at least the \"skeptic\" part. probably much more open minded as well."],"Object Shape":"Oval","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/11948.html.txt","/var/www/straped/mufon/org/11948.html"],"Latitude":"40.785244","Disposition":"Unresolved","Region":"New York","Sighting Duration":"00:00:04","Date of the Event":"08/02/2008 10:40 UTC","Tags":"City","Object Features":"None","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 2nd 2008"],"City":"New York"}