{"Object Flight Path":"Path with directional change","Summary":"The object was metallic, opaque, white in color, made no noise, move very slow.","divs":["Sighting DetailsI was sitting on the back steps the afternoon of May 16, 2001. I was looking at the sky, enjoying the afternoon. The back of my house faces West and the front faces East. I saw an object approaching from the West travelling very slowly towards the East. I watched it and at fisrt thought it could be a jet. Jets fly over my house all time on approach to Memphis International. As it got closer I could tell this was no airplane. I could see that it had a round shape to it. I then tought it might be a balloon of some kind. It continued to get closer and I new it was very strange indeed. I knocked on the back door without taking my eyes off of the object it and asked my wife to get my cam corder. Looking through the cam corder I could see it was a real UFO. I made the video before it turned and slowly went out of sight. My wife and my son both saw the object. The sky was clear, and it was still very much daylight. We were on Daylight savings time then. The object turned South and eventually we lost it in the sky. While taping the object, a jet on approach to Memphis International, passed behind the object giving me good perception of the closeness of the object, believed to be about a mile from my point of observation."],"Region":"Tennessee","Latitude":"35.152974","map":"<A HREF = \"http://maps.google.com/maps?q=35.152974,+-90.04685(11942)&iwloc=A&hl=en\"> mufon case (11942) map </A>","Log Number":"US-08052008-0014","Source":"MUFON","Disposition":"Unknown","City":"Memphis","Object Shape":"Oval, Sphere, Square, Rectagular","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"05/16/2001 06:30 UTC","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around May 16th 2001","This sighting has never been favorited.",""],"Date of the Event":"05/16/2001 06:30 UTC","Case Number":"11942","files":["/var/www/straped/mufon/html2text/11942.html.txt","/var/www/straped/mufon/org/11942.html"],"Country":"United States","Object Features":"Unknown","Longitude":"-90.04685"}