{"divs":["Sighting DetailsI was taking pictures of my baby brother on my HP digital camera when we looked up in the sky. I was pointing out cloud formations to him when we saw a disc shaped object that appeared in the sky. The object did some strange manuvers and hovered for a few seconds then it shot into the sky and out of sight. The photo I have of it is CRYSTAL CLEAR and shows a disc that looks like some kind of metal on the outside with a smaller metal inner circle that is connected to the outer ring on two sides. The sun was out and visibility was clear. I downloaded the photos on my brother's computer and saved them to discs. These photos are not fuzzy images they clearly show some kind of disc shaped craft that was able to travel at high speeds and change course radically. There was no sound coming from the object. When I realized what I was looking at, I became extremely excited. I showed the pictures (not yet downloaded) to my father, aunt, step-mother and older brother who all agreed that it was like no aircraft they had ever seen. I watched the disc for approximately four minutes and then it accelerated straight up into the sky at a tremendous rate of speed and disappeared. I want to show my photos to a MUFON representative before I publish them on the internet."],"Longitude":"-74.1422","Disposition":"Unresolved","Case Number":"11949","Summary":"I was taking pictures of my baby brother when we looked up in the sky and spotted a round shaped object.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.532535,+-74.1422(11949)&iwloc=A&hl=en\"> mufon case (11949) map </A>","Tags":"City","Object Features":"Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/11949.html.txt","/var/www/straped/mufon/org/11949.html"],"Region":"New York","Source":"MUFON","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","Date Submitted":"08/06/2008 11:15 UTC","Date of the Event":"08/06/2008 11:15 UTC","Sighting Duration":"00:04:00","Object Shape":"Disc","Latitude":"40.532535","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 6th 2008"],"Log Number":"US-08062008-0005"}