{"Date of the Event":"08/02/2008 02:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Cylinder, Oval, Sphere, Unknown","Case Number":"11959","Date Submitted":"08/02/2008 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.162891,+-123.648124(11959)&iwloc=A&hl=en\"> mufon case (11959) map </A>","files":["/var/www/straped/mufon/html2text/11959.html.txt","/var/www/straped/mufon/org/11959.html"],"Longitude":"-123.648124","City":"Cave Junction","Latitude":"42.162891","Weather Factors":"None","Disposition":"Unknown","divs":["Sighting DetailsWe were out in the woods on a new moon with no artificial light contamination, camping. We were on our backs in a small 2 person 3 season tent. I looked up and saw a small dull glowing pinkish object about the size of a large grain of rice at arms length. My partner saw it and it was slowly traveling across a part of the sky. Straight up and a wee bit to the south. Then it was joined by 4 or 5 other little glowing objects, some bluish, some greenish to my perception. They seemed to behave like dolphins do when swimming in a pod. At one point a small bright white speck blazed a straight line across the sky in the same area. It was probably a satellite as we have seen many of those on dark nights. One of the glowing little objects took off after it weaving back and forth. It was hard to determine how far away or how large they were. They seemed to be oval in shape, maybe! They would disappear occasionally as I think there was a few puffs of clouds or mist that night. They then would reappear as if coming out behind this vapor. So I know they were higher then the clouds."],"Object Flight Path":"Path with directional change","Tags":"City","Country":"United States","Region":"Oregon","Viewing Distance":"Unknown","Log Number":"US-08072008-0001","Source":"MUFON","trends":["There have been 2 other sightings in Cave Junction","There were no other sightings in Cave Junction on or around August 2nd 2008"],"Summary":"a swarm of glowing objects swimming together or playing?","Object Features":"Unknown"}