{"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/11961.html.txt","/var/www/straped/mufon/org/11961.html"],"Date Submitted":"06/20/2008 02:30 UTC","City":"Sandwich","Log Number":"US-08072008-0003","Case Number":"11961","Country":"United States","Source":"MUFON","Disposition":"IFO","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","divs":["sighting detailsi was outside in my front yard, i don't know how to explain this but i was sitting on my couch and felt compelled to go outside and look at the sky. after a few minutes of looking up, all of a sudden appeared a blue spherical energy form, it would move around in circles, disappear and instantaneously appear elsewhere and repeat the same motion, for about a minute and a half until just vanishing. my feeling was amazement. later on that night i lost time i think 20-30 minutes, i mean i was wide awake and then i was foggy but awake elsewhere no in between. i have no recollection of what happened in this lapse.. i should note there was another individual in the neighborhood whom also saw this(this individual wishes to remain anonymous). i was telepathically\\empathically communicated with. i would also like to note that within seconds of this object disappearing there were helicopters, though being that i am less than .25 miles away from otis air force base this may have been coincidence(i don't think so though) i hope this information helps some, peace be with you"],"Sighting Duration":"00:01:30","trends":["There have been 2 other sightings in Sandwich","There were no other sightings in Sandwich on or around June 20th 2008"],"Tags":"City","Object Shape":"Fireball, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=41.691774,+-70.499472(11961)&iwloc=A&hl=en\"> mufon case (11961) map </A>","Longitude":"-70.499472","Date of the Event":"06/20/2008 02:30 UTC","Weather Factors":"Unknown","Region":"Massachusetts","Latitude":"41.691774","Summary":"Blue Energetic Ball, Disappears/Reappears"}