{"Weather Factors":"Unknown","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=42.408211,+-82.18171(11968)&iwloc=A&hl=en\"> mufon case (11968) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-82.18171","Case Number":"11968","Disposition":"Unresolved","Date Submitted":"08/05/2008 08:35 UTC","trends":["There have been 2 other sightings in Chatham","There were no other sightings in Chatham on or around August 5th 2008"],"Log Number":"CA-08072008-0010","Source":"MUFON","City":"Chatham","Summary":"Viewed a sphere shaped object high in western sky through telescope","Viewing Distance":"Unknown","Object Features":"Undisclosed","Tags":"City","Date of the Event":"08/05/2008 08:35 UTC","files":["/var/www/straped/mufon/html2text/11968.html.txt","/var/www/straped/mufon/org/11968.html"],"Country":"Canada","Latitude":"42.408211","Region":"Ontario","divs":["Sighting DetailsI was sitting on my back deck which faces West when a glint of sunlight high in the sky cuaght my eye. It was to early in the evening to be a first star so I setup my telescope to have a look. I could easily resolve the object to a perfect sphere which looked like a whitish glass ball. The object appeared to be well above the odd high whispy clouds. As far as its apparent size goes it would appear two or three times the size of Jupiter viewed with the same lens. At fisrt I had to move telescope often to keep it centered in eyepiece than it stopped moving completely. I tried a few different eye pieces but a 25 mm lens gave the clearest view. What happened next is difficult to describe to say the least.An explosion or some massive release of energy occured. Something resembling a fireworks exploding, chasing a whitish halo outwards for a great distance. The original sphere shape was no longer clear, but an object began to move south west again, becoming two objects.Shortly,trees blocked my view.As far as the way I feel about this sighting is that nothing seams surprising but always amazing."]}