{"Date of the Event":"02/11/2008 03:05 UTC","Country":"United States","Case Number":"11963","Sighting Duration":"Undisclosed","Longitude":"-118.302286","Summary":"Formation of 5 spheres above Burbank","Weather Factors":"None","Viewing Distance":"Over One Mile","Object Features":"None","Disposition":"IFO","Date Submitted":"02/11/2008 03:05 UTC","Object Flight Path":"Straight-line path","Region":"California","Latitude":"34.190739","City":"Burbank","Log Number":"US-08072008-0005","Source":"MUFON","trends":["There have been 39 other sightings in Burbank","There were no other sightings in Burbank on or around February 11th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI first noticed them in my car when turning onto Olive Blvd from Barham, where you can see all the way down Olive to the mountain. They were clear as day, five SPHERES moving in formation, much too slowly to be planes. It almost seemed like they were moving too slow to even be able to fly. They were way too small to be blimps and shiny metallic. I would estimate they were about 2.5 miles away or less, and following the path of the 5 freeway. I also thought it was odd, because they appeared \"locked\" in formation with absolutely zero individual movement. I immediately went for my camera, because they just didn't seem to belong. As I was fumbling to grab my camera, I lost track of them once getting into the turning lane onto Hollywood Way, as they were blocked by the tall buildings. I was surprised to see them again when getting to Hollywood Way and Riverside Drive, where I finally got this picture. There are only four in this picture, because the 2nd from the right is blocked by the tree. I was getting honked at by people behind me and everyone walking on the street was looking to see what I was trying to get a picture of. I couldn't tell if they could see from their vantage points. I pulled over at the 76 Station at Hollywood Way and Alameda to get better pictures out of my car, but I could no longer locate them anywhere in the sky. It was very frustrating not being able to find them anywhere in the sky, especially after just getting a picture of them less than a minute before."],"files":["/var/www/straped/mufon/html2text/11963.html.txt","/var/www/straped/mufon/more/11963_submitter_file1__2008-02-11_sighting.jpg","/var/www/straped/mufon/org/11963.html"],"Object Shape":"Sphere","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.190739,+-118.302286(11963)&iwloc=A&hl=en\"> mufon case (11963) map </A>"}