{"Longitude":"-74.802385","Tags":"City","Case Number":"11972","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Hammonton","There were no other sightings in Hammonton on or around August 7th 2008"],"Disposition":"Insufficient Data","Country":"United States","Log Number":"US-08072008-0014","Latitude":"39.636506","City":"Hammonton","Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=39.636506,+-74.802385(11972)&iwloc=A&hl=en\"> mufon case (11972) map </A>","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Summary":"It was a ghostlike blob of light. It was circular.","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Circle","Date Submitted":"08/07/2008 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11972.html.txt","/var/www/straped/mufon/org/11972.html"],"divs":["Sighting DetailsWe saw a light in the sky at approximatly 10:40PM, I was coming home from work on my bike while my brother was coming down the same street, we stop and talk and he looks up, he said to me Did you see that? I looked up and I saw this wierd light making geometric shapes at maybe a 45 degree angle from where we were standing. We road back towards ShopRite ( Where I work) and went into the woods right behind the store to a small apparment complex, we looked up and it was still there, making the same patterns almost like it was mapping the area. We decide to go home but on our way out I see a car of a friend and tell him about the experience, he follows us and sees the same thing. Eventually an airplane crossed it's path and the light seemed to hide, a flash of bright blue light was seen and after the plane passed, the light came back making the same shapes in the sky. We were confused , a little frightened and very shocked. We eventually agreed to finally go home, looking back as we left. As we got home we looked in the direction and it was gone."],"Date of the Event":"08/07/2008 12:00 UTC"}