{"Tags":"City","Viewing Distance":"21-100 Feet","Log Number":"US-08072008-0015","Case Number":"11973","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=41.246878,+-86.242391(11973)&iwloc=A&hl=en\"> mufon case (11973) map </A>","files":["/var/www/straped/mufon/html2text/11973.html.txt","/var/www/straped/mufon/more/11973_submitter_file1__PICTURE2.jpg","/var/www/straped/mufon/more/11973_submitter_file2__000_0151.JPG","/var/www/straped/mufon/more/11973_submitter_file3__100_0791.JPG","/var/www/straped/mufon/more/11973_submitter_file4__000_0144.JPG","/var/www/straped/mufon/more/11973_submitter_file5__000_0148.JPG","/var/www/straped/mufon/org/11973.html"],"Summary":"Disk over nearby pond","City":"Argos","trends":["There have been 3 other sightings in Argos","There were no other sightings in Argos on or around August 4th 2008","This sighting has never been favorited.",""],"Longitude":"-86.242391","Object Shape":"Disc","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Indiana","Disposition":"Unknown","Date of the Event":"08/04/2008 01:30 UTC","Date Submitted":"08/04/2008 01:30 UTC","divs":["Sighting DetailsWitness was awaken early at 1:30 AM by pet dog barking at something out the window. Witness look out window and saw a disk about 80 feet away hovering over a close by pond. See graphic and photos attached. The object was approximately 30 feet above an artificial pond approximately 80 feet from the witness. The pond is 230 by 55 feet. There are several fruit and small maple trees between the witness home and pond. The disk was observed through and above the trees as shown in the graphic. The disk was approximately 30 feet in diameter and 15 thick. The sighting lasted approximately 5 minutes until the object just disappeared. This sighting occurred between thunder storms on this evening. A storm has pass through a couple of hours previous and the sky was broken clouds with between cloud lighting occurring. There was no wind during the sighting event. The lighting flashes in the sky lit up the disk when they occurred. Red rectangular lights on the bottom portion of the craft rotated from right to left and reflected off the pond surface. The bottom of craft appeared to be a metallic blue with a shimmer to it. Water in the pond below the craft appeared to ripple. The dome on the craft was unlit."],"Object Flight Path":"Stationary","Weather Factors":"None","Country":"United States","Latitude":"41.246878"}