{"trends":["There have been 24 other sightings in Greensboro","There were no other sightings in Greensboro on or around June 11th 2008"],"Viewing Distance":"Unknown","Object Shape":"Cylinder, Star-like","Object Flight Path":"Stationary","Longitude":"-79.789785","Sighting Duration":"Undisclosed","Latitude":"36.077445","Date Submitted":"06/11/2008 06:45 UTC","Country":"United States","Log Number":"US-08082008-0005","Object Features":"Unknown","Disposition":"Insufficient Data","divs":["Sighting Details Driving 220 south at roughly 6:45 am , I was approaching my U turn lane when I happened to notice a VERY bright light resembling a star high above the location of my wife's place of employment. This place is to the left of me while driving south. Sure it was early in the AM, and the sun was low, but the morning was completely and beautifully lit and the sky was a gorgeous blue. Way to late to SEE any stars. I said aloud \"What the hell\"? My wife ask \"What\"? I didn't respond because I was shocked and confused,and my wife was busy rummaging through the contents of the glove box anyway, so I just kept looking. Like a star, it was stationary,and struck me odd. However shocked, I was driving , so I was forced to shift my sight back to the road as to enter the lane and complete the turn, because we were headed there anyway. This would give me a safe and closer look at whatever it was. I was able to make my turn to the opposite lanes and quickly enter the entrance lane to the property, I got a quick look, and the bright light relatively quickly had completely dimmed to reveal a long white wingless object resembling a baseball bat, with a flat dark surface in the front where you would think the pilots view ports, or windows would be.I can't say how high it was,(really up there) but I could clearly make out it's shape and smooth details. It was simply hovering, motionless. As we entered the property, I brought my attention to stopping the car as to get a better look, and when I looked back up in all of that blue space above us, it was simply gone! The entire thing happened so fast, I would not have been able to snap a photograph , or get video footage even if I had a camera of any type at the time. I did not see the craft leave at a high rate of speed, it was simply a case of \"now you see it, now you don't\". Confused, I continued to scan the sky all around and it simply wasn't there. I told my wife, and she grinned at me as though for a split second that she thought perhaps I was just pulling her chain, but she instantly knew by my shock that I wasn't kidding."],"Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=36.077445,+-79.789785(11979)&iwloc=A&hl=en\"> mufon case (11979) map </A>","Tags":"City","City":"Greensboro","Weather Factors":"Unknown","Case Number":"11979","Date of the Event":"06/11/2008 06:45 UTC","files":["/var/www/straped/mufon/html2text/11979.html.txt","/var/www/straped/mufon/org/11979.html"],"Source":"MUFON","Summary":"extremely bright glow, quickly dimming to reveal white cylindrical object."}