{"Date Submitted":"08/06/2008 11:10 UTC","Summary":"2 very bright lights seen hovering in the distance. Instanlty lights change and shapes take off accross the sky","Case Number":"11971","Date of the Event":"08/06/2008 11:10 UTC","Sighting Duration":"Undisclosed","City":"Doylestown","Longitude":"-75.124634","Log Number":"US-08072008-0013","files":["/var/www/straped/mufon/html2text/11971.html.txt","/var/www/straped/mufon/org/11971.html"],"Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Latitude":"40.314206","Object Flight Path":"Hovering then path","Source":"MUFON","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around August 6th 2008"],"Object Features":"Unknown","Disposition":"Insufficient Data","divs":["Sighting DetailsMy daughter woke up crying around 11pm. I brought her ot the kitchen for a drink and I looked out my kitchen window. Window faces north - looking towards the doylestown area. I see a very bright light hovering in the distance. I watch it slowly climb and pause to hover once. Then in an instant its like the aircraft \"turns\" and i see multi colored flashing lights and the craft appears much further away than before. It the travels accross the sky out of view - traveling south west. As I think what this was and rememebr seeing it around the 16th of July around 1 am. he light strikes me as way too bright. If it ws a landing light i thought it shoudl get closer or farher from me - not hover. Then i see another bright light same as the first and this one climbs and hoovers slower than the first. This one appeared to the right of where the first one had been. It spent a few minutes climbing and hoovering until it \"instantly turns\" it seem, the lights change instantly and the aircraft departs quickly in the same path as the first. I know this bright light was way too large and bright to be a landing light. It did not search for anything and I could not see the aircraft. It appears to be somewhere in the doylestown or bedminster area. After a fewminutes I did start to feel paniced as I realized I have not seen aircraft act liek this before. I also felt that light was too bright to be a landing light. The light never appeared to get closer until it \"changed appearances\" into the flashing lights and took off."],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.314206,+-75.124634(11971)&iwloc=A&hl=en\"> mufon case (11971) map </A>"}