{"Date of the Event":"04/30/2008 12:00 UTC","Longitude":"-74.170597","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/11984.html.txt","/var/www/straped/mufon/more/11984_submitter_file1__NewUFO.JPG","/var/www/straped/mufon/more/11984_submitter_file2__OurUFO.JPG","/var/www/straped/mufon/more/11984_submitter_file3__1stemp.jpeg","/var/www/straped/mufon/org/11984.html"],"Log Number":"US-08082008-0010","trends":["There have been 2 other sightings in Northville","There were no other sightings in Northville on or around April 30th 2008","This sighting has never been favorited.",""],"Tags":"City","Disposition":"Unresolved","Case Number":"11984","Latitude":"43.227457","Object Features":"Appendage(s)","Summary":"UFO again Photographed over Great Sacandaga Lake NY","Date Submitted":"04/30/2008 12:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Square, Rectagular","City":"Northville","Weather Factors":"None","Region":"New York","Source":"MUFON","divs":["Sighting DetailsSeeing several chemtrails appear in the sky over the lake, I had a weird feeling and decided to snap a picture of the sky. Although not visible when the shot was taken, the same rectangular object I shot last summer again appeared in the photo along with some odd light manifestations. The dark rectangle is visible hanging under the \"lightning bolt\" and hole that also was not visible when the shot was taken. As a control I used a different camera from the shot taken last year. I also used a camera that I know picks up infra-red (a simple test you can perform by pointing your TV remote at the camera and snapping a picture when a button is depressed. If you see the light coming from the remote, it has no filter for infra-red, as many cheaper digitals don't). I have again included a shot from Turkey taken last year over Istanbul where the same UFO is visible. In this shot the clouds infringe into the shape so it is obviously not a camera artifact. This plus another shot that Brian Vike supplied me, demonstrates that this same UFO has now been caught in four shots-2 from NY here on the lake, one in the UK and one from Istanbul Turkey which I have attached-all over water. The Turkey photo still was taken from a video posted on YouTube . Interestingly, in the Forbidden City of China-a city built to mimic the \"palace\" of the gods- a statue shows the Emporer wearing a hat with the exact same shape. Coincidence? Thanks Brett Allen"],"Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.227457,+-74.170597(11984)&iwloc=A&hl=en\"> mufon case (11984) map </A>"}