{"Latitude":"39.754504","Source":"MUFON","Region":"Pennsylvania","trends":["There have been 2 other sightings in Littlestown","There was one other sighting in Littlestown on or around August 3rd 2008"],"Disposition":"Insufficient Data","City":"Littlestown","Date Submitted":"08/03/2008 09:05 UTC","Viewing Distance":"Unknown","Longitude":"-77.085938","files":["/var/www/straped/mufon/html2text/11983.html.txt","/var/www/straped/mufon/org/11983.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.754504,+-77.085938(11983)&iwloc=A&hl=en\"> mufon case (11983) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Country":"United States","Object Flight Path":"Undisclosed","Summary":"2 white circles appeared side by side then disappeared. 5 mins later 1 appeared and disappeared","divs":["Sighting DetailsOn Sunday night, Aug 3 at 9pm, I was sitting on my front porch talking with my brother. I told him I just saw 2 white circles to the right of our tree. They were side by side and bright white but not like the moon with illumination. The circles were perfectly outlined. Not much space between the two. Almost as soon as I saw them they just disappeared. They did not move. They were just gone. While still on the phone with Tim, I told him not 5 mins later there's another one. The exact same size as the first 2. As soon as I saw it, it was gone exactly like the first 2. I couldn't help but notice because they were bright white but not like shining lights or the moon. They did not appear luminous, just white but perfectly shaped circles. I wasn't scared but obviously wanted to know what they might be. If I had thought someone would have believed me, I would have called 911. I am just now reporting what I saw because I got the newspaper and saw where Mr. Dietz saw something too. So I am telling what I saw only because someone else saw something that could have been the same thing. I would love to have been able to take a picture but they did not stay but an instant."],"Case Number":"11983","Sighting Duration":"Undisclosed","Log Number":"US-08082008-0009","Object Shape":"Circle, Sphere","Date of the Event":"08/03/2008 09:05 UTC"}