{"Longitude":"-115.108331","Date of the Event":"07/19/2008 04:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.201159,+-115.108331(11992)&iwloc=A&hl=en\"> mufon case (11992) map </A>","files":["/var/www/straped/mufon/html2text/11992.html.txt","/var/www/straped/mufon/org/11992.html"],"Region":"Nevada","Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Date Submitted":"07/19/2008 04:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on my way home from work,It was approximately four o'clock, and I had stopped off at the neighborhood Best Buy here in Las Vegas to buy my girlfriend a birthday gift. On the way I had noticed that there had been a alot of military aircraft traffic in the sky that day. I always watch aircraft if I can they facsinate me. Anyway I get out of my truck and hear a couple fighters go by, like normal block the sun with my hand and locate the aircraft, and in doing so I see what looks like a normal commercial jet at altitude in the distance. I watch the jet for about ten seconds when I notice what I thought was maybe pollished aluminum aircraft that gave off a very brite reflection of the sun. For some reason I kept watching it. After what I would say about maybe thirty seconds goes by I reallize that it's not a plain, it hasn't moved. Shortly after that I see four, five, six, seven, and I want to say at most eight of these brite objects in what I would call a cluster. I studied them in different reguards and noticed that unlike military craft there was no formation at all, and it was broad daylight and they were brite as stars at night at what seemed very high altitude. Four or five of the craft stayed in one spot while two of them circle half way around the cluster. At this time in the 110 degree heat I leaned against my truck realized what I was looking at and lit up a cigarette and watched. During this time I had asked a couple of people,\"Hey can you see those airplanes up there?\" as I pointed them out. This is when three different people at three different times proved to me what I already know. People are so very stupid. I started to ask myself how do people live to the age that they do. These sheep don't even see what they're looking at. It was like a violin is just a piece of wood, and anything that is in the sky is a airplane!!! I was mad and disgusted with humanity. I've seen alot more than most in my lifetime by far, and I know that as they slowly escaped my sight I realized that I had seen something that I don't believe in unless I see it if you know what I mean. I want to know what saw. I know I've never seen anything like them,but for some reason I know that I will see them again. I lost sight of them as they headed north toward Nellis Test Range. I think it would be cool as hell to think that we would have that kind of technology but really I think that would be a dream or fantasy..."],"Source":"MUFON","Case Number":"11992","Log Number":"US-08082008-0019","Tags":"City","Object Features":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"Over One Mile","Latitude":"36.201159","City":"North Las Vegas","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around July 19th 2008"],"Summary":"Saw a cluster of between six and eight objects for about two cigarettes length in time. Never seen anything remotely like it.","Object Shape":"Star-like"}