{"Case Number":"12009","City":"Sacramento","Source":"MUFON","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/12009.html.txt","/var/www/straped/mufon/more/12009_submitter_file1__isaakufo1.jpg","/var/www/straped/mufon/more/12009_submitter_file2__isaakufo2.jpg","/var/www/straped/mufon/org/12009.html"],"Country":"United States","Sighting Duration":"01:00:00","divs":["Sighting DetailsI was at a 4 day boy scout activity just outside sacramento california. Over 4600 troops were at this event. I do not know if others saw what I saw, however this is what my friend and I saw... I was attending a outdoor activity that started at 7pm. My friend and I decided to sit on top of a hill looking down on the event . a stage was lit but the light did not hurt my abilty to see the numourous stars and moon. I was looking at the night sky with a friend of mine and I saw a exteamly bright star like object. It was around 11pm and there were alot of stars out on this clear summer nite sky this evening. but for some reason this one thing that looked like a star seemed to stand out among the others. As I was looking just left of the moon(southward), another object similar like the first one appeared instantly! to give you an idea diagonal apart were the objects one oclock postion and eight oclock postion about 1 foot apart. example... O (moon) * (first object) *(second object) The first one bolted towards the second one in a 45 degrees east ward downward angle, faster than anything I have ever seen! The instant the first object came in contact with the second object they started spinning close and then the spinning grew more apart. The spinning was in a motion of diagonal, 1 o'clock and 8o'clock position. The spinning lasted about one minute. Then instantly both of them launched seperate ways. One went back to the original postion back up and the other launched way left from where the spinning took place. It went way eastward and started blinking , it was about at the horizon level. The blinking got brigher , brighter then the moon. Then the one by the moon shot to the one that was blinking to the east. The one that was blinking then disappeared when the one from the moons location got to it. When the second object disappeared the first object went back up to the same spot that it was originally at a very very fast speed. time was less than a second for the first object to go the the second object that was flashing. and the same when it returned to the original place. distance from the first object that was aprox. 40 degrees above horizon , to the second object was several miles. There was nothing else like this that can do what I saw. I have been to airshows and have never seen any plane that can get that kind of speed so rapidly and appear just like that. when the objects were spinning I was amazed in what I was seeing. I was wondering if this was a true UFO siting. This took place for about an hour and then the activity that I was attending ended and so every one was leaving then I left for my campsite. The object never moved after it went back between two stars and so I left thinking about what I just experienced."],"Disposition":"Unknown","Object Features":"None","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.589492,+-121.48583(12009)&iwloc=A&hl=en\"> mufon case (12009) map </A>","Date Submitted":"08/06/2008 11:00 UTC","Object Shape":"Oval, Star-like","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Summary":"extreamly bright star like shape moving fast with another going in circles","Longitude":"-121.48583","Viewing Distance":"Unknown","Date of the Event":"08/06/2008 11:00 UTC","Log Number":"US-08102008-0004","trends":["There have been 83 other sightings in Sacramento","There was one other sighting in Sacramento on or around August 6th 2008","This sighting has never been favorited.",""],"Latitude":"38.589492"}