{"Sighting Duration":"01:00:00","divs":["Sighting DetailsFriends and I were skywatching between 9:30 pm and 11 pm on Friday, 08.08.08 in our backyard. The yard is mostly wooded with an opening roughly corresponding to the size of our leach field behind the house. This was our 'open skywatching' spot. As we were looking at the sky and all the stars, we noticed how our eyes played tricks. Stars we were watching seemed to twinkle and move erratically in one area. There were two children with us as well, and they just got the biggest kick out of the optical illusion. However, after about 30 mins or so, we noticed one 'star' very high up that was really moving fast. It came across our viewing field from the south in the direction of Port St. Joe and in a continuous line crossed our viewing area toward Wewahitchka, to our north. The sighting of this first moving star-like object was at approximately 10 pm and lasted approximately 6 seconds.. The second moving star-like object moved across the sky a little further west than the first one, heading in a southerly direction toward Port St. Joe from the Wewahitchka area. It was very bright, and was zipping along very fast in a continuous line. This sighting occurred at approximately 10:16 pm. We were able to keep this object in our sight for about 7 - 8 seconds. The third moving star-like object came into our view from the west, or the Panama City area and headed due east toward Apalachicola. This object was exactly like the first two in that it moved in a continuous line, very rapidly, our sighting lasting only about 5 or 6 seconds. This sighting happened at approximately 10:30 pm. The fourth moving star-like object approached from the south and followed a similar path as the first object, almost exactly above us, heading north. At this time, clouds were beginning to form, so we watched the object duck behind the clouds and come back out from behind as it whizzed northbound. This sighting occurred at approximately 10:40 pm. Again, this object followed a continuous path and appeared to be moving at a very hight rate of speed; perhaps we kept it in our vision for 6 or 7 seconds."],"Tags":"City","Country":"United States","Weather Factors":"None, Does Not Apply","Log Number":"US-08092008-0010","trends":["There have been 6 other sightings in Port St Joe","There were no other sightings in Port St Joe on or around August 8th 2008"],"Case Number":"12004","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/12004.html.txt","/var/www/straped/mufon/org/12004.html"],"Date of the Event":"08/08/2008 10:03 UTC","Latitude":"29.822892","map":"<A HREF = \"http://maps.google.com/maps?q=29.822892,+-85.294582(12004)&iwloc=A&hl=en\"> mufon case (12004) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"08/08/2008 10:03 UTC","City":"Port St Joe","Longitude":"-85.294582","Object Features":"Unknown","Summary":"Watched four starlike objects fly across the sky over 1 hr period","Disposition":"Unknown","Source":"MUFON","Region":"Florida","Viewing Distance":"Over One Mile"}