{"Object Features":"Dome","Summary":"Yellow/Orange StarLike Red Domed with 3 to 5 Spires shooting out from bottom","Disposition":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12012.html.txt","/var/www/straped/mufon/org/12012.html"],"divs":["Sighting Details( Sinking Spring, Pennsylvania)I was Sleeping when this Bird woke me by Chirping something Crazy (Exremely Unusual i thought a cat or something was attacking it's nest the tree is located about 30 feet from my window)so naturally i got up & screamed at it hoping it would go away when i noticed 2 Star-Like Objects to the Left of my Window out in the distance at about 11 o'clock high to the South East. The Objects (Left one Bigger than the Right one) were just hovering Flickering & motionless except the bottom's of both objects were moving & flickering with Spires shooting out this is when i got my binoculars & it was a sight to see! I immediately woke up my Wife (A Skeptic)and showed her these Objects with my Binoculars plus i took 2 Picture with my Cel Phone and you know what? They didn't show on screen Something else came up on Picture It looks like a Cigar Shaped Object (or is it the Horizon not sure) once i download these 2 Pics i will include them & you be the Judge. We returned to sleep & talked about it that morning!!! (This is the 5th sighting i have had of UFO's dating back to my first sighting in Lajas, Puerto Rico 1979)"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around May 25th 2008","This sighting has never been favorited.",""],"Region":"Pennsylvania","Latitude":"40.337128","Log Number":"US-08102008-0007","Object Shape":"Fireball, Star-like","Date Submitted":"05/25/2008 02:10 UTC","Object Flight Path":"Stationary","Tags":"City","Case Number":"12012","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.337128,+-75.919145(12012)&iwloc=A&hl=en\"> mufon case (12012) map </A>","Date of the Event":"05/25/2008 02:10 UTC","Longitude":"-75.919145","City":"Reading"}