{"Longitude":"-121.522857","Case Number":"12014","map":"<A HREF = \"http://maps.google.com/maps?q=46.006363,+-121.522857(12014)&iwloc=A&hl=en\"> mufon case (12014) map </A>","Date of the Event":"07/04/2008 11:20 UTC","files":["/var/www/straped/mufon/html2text/12014.html.txt","/var/www/straped/mufon/more/12014_submitter_file1__scan0001.jpg","/var/www/straped/mufon/org/12014.html"],"Log Number":"US-08102008-0009","trends":["There have been 3 other sightings in Trout Lake","There were no other sightings in Trout Lake on or around July 4th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Tags":"City","Object Shape":"Oval","Sighting Duration":"Undisclosed","Latitude":"46.006363","Country":"United States","Object Features":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","City":"Trout Lake","Region":"Washington","Weather Factors":"None","divs":["Sighting DetailsAttending the 2008 ECETI Conference with a crowd of people 'sky watching' and looking for ships in the sky. A number of star-like object zipped across the sky at different times; however, one of them 'powered up' their lights to show itself to the crowd below. The lights came on for maybe 3 seconds or so, which made the object seem to show itself to be a huge oval-shaped ship of some type that was zooming across the sky in a northerly direction. There were numerous such sightings at night during the three day conference and three that powered up their lights to show themselves to the crowd. Understand that a few folks in the crowd had green laser pens, and were flashing a pattern to the shipsas they coursed across the sky. Out of all the ships that zipped across the sky, only about three powered up their lights. I am a MUFON Field Investigator, Floridia Division, who has attended two conferences at James Gilliland's Ranch in Trout Lake, WA (2007 and 2008). This was the first time I saw objects respond to people on the ground by turning on their lights to show themselves."],"Disposition":"Unknown","Date Submitted":"07/04/2008 11:20 UTC","Summary":"Star-like object zipped across sky and powered up its lights to beam us"}