{"Latitude":"36.982897","Tags":"City","Case Number":"12019","Date Submitted":"05/31/2001 12:00 UTC","City":"Santa Cruz","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.982897,+-122.021286(12019)&iwloc=A&hl=en\"> mufon case (12019) map </A>","Sighting Duration":"00:20:00","Object Shape":"Cylinder, Disc","Summary":"Viewed metalic disc with lights hovering in one spot above Santa Cruz mountains.","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Stationary","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around May 31st 2001","This sighting has never been favorited.",""],"Region":"California","Disposition":"Unknown","divs":["Sighting DetailsDuring the month of June in 2001 on a sunny, Saturday afternoon the California sky was perfect, all blue with no clouding at all. I was visiting my sister in the town of Santa Cruz for a few months. I was sitting in my bedroom in a chair with short legs. I was gazing out the large picture window which was facing north. The only object that I could see through the window besides blue sky was the top third of the telephone poll and the wires in front of the house. After sitting and soaking up the Saturday sun for several minutes my eyes locked on to a very tiny flicker of light in the sky. With the naked eyes all I could see was the sun light reflecting of this tiny dot. After looking at it for several minutes I came to the conclusion that it must be a plane. But, this small reflection did not move but stayed stationary in one spot. That made me curious so I went to the window and focused my better then perfect eye sight on the spot where I could see the reflecting. Once my eyes were locked on it and my mind was clear and in the moment I was able to see a shape. It was NOT any type of plane. I could see that the light was just the sun bouncing off an object. I then used the pole as a reference point to find the object because my eyes kept tearing up due to looking at the bright blue sky. After about five minutes I ran into the living room and grabbed my sisters binoculars. When I returned to the window the object was still in the same spot. I now determined that the object had to be at least 20,000 to 40,000 feet in the air. I was looking north by north east from the west side of Santa Cruz. Once I got the object in my sight through the binoculars I focused in on it. Instantly, I knew what I was seeing. It was a UFO! It was a metallic disc with no windows. But, it had different colored lights around the edge that were in groups of three. The disc hovered in one spot while spinning at a rate that was easy to see. The lights spun around as the disc stayed in one spot reflecting the sun. Every few seconds I could see the disc wobble as a result of air turbulence. I tried to determine how big the disc was and how far up and away it was. To me, the disc seemed to be hovering directly over the Silicon Valley region about 20,000 to 40,000 feet. The disc must have been at least the size of the infield of a baseball diamond. I estimate that I watched the disc for about 20 minutes before my eyes could no longer focus. I rested for a few minutes and tried to find any neighbors that would look but no one was around. When I went back to watch again I could no longer find it."],"files":["/var/www/straped/mufon/html2text/12019.html.txt","/var/www/straped/mufon/org/12019.html"],"Date of the Event":"05/31/2001 12:00 UTC","Weather Factors":"Unknown","Log Number":"US-08112008-0001","Country":"United States","Longitude":"-122.021286"}