{"Log Number":"US-08102008-0008","map":"<A HREF = \"http://maps.google.com/maps?q=29.820122,+-85.290992(12013)&iwloc=A&hl=en\"> mufon case (12013) map </A>","Longitude":"-85.290992","files":["/var/www/straped/mufon/html2text/12013.html.txt","/var/www/straped/mufon/org/12013.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Stationary,Other","Weather Factors":"None","City":"Port St Joe","Date Submitted":"10/10/2006 12:00 UTC","Region":"Florida","Case Number":"12013","Disposition":"Unknown","trends":["There have been 6 other sightings in Port St Joe","There were no other sightings in Port St Joe on or around October 10th 2006","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Date of the Event":"10/10/2006 12:00 UTC","Object Shape":"Diamond, Sphere","Source":"MUFON","Latitude":"29.820122","divs":["Sighting DetailsWitness Pamela Lawrence reported an unusual sighting above her home in Port St. Joe to F.I. Barbara Delozier, in which witness has approximately 19 minutes of video footage. Pam reported that she cannot sleep at night, so oftentimes, she is up late into the early morning doing things around the house. One night in mid-October, 2006, she was taking out the trash and a brightly lit object moving in the sky caught her eye. She went inside to get her video camera to tape it. She described the object as diamond shaped, by placing her index fingers and thumbs together to form a diamond with her hands to show the shape she saw in the sky. However, on the video, the object appeared round. Pam said the object had red and blue lights revolving in the middle of it, but that sometimes, they revolved so quickly that the lights looked green. The object appeared to come in close to her then move back. It basically stayed in the same position, sort of hovered in the sky above her house, she said. Pam kept video taping it until it disappeared. She was very excited about seeing this object and believes that it was a UFO, or alien visitor ship. She has shown it to some friends, but hadn't known about MUFON to report it. It is with her permission that I add the report today. Pam does not remember any missing time, but said that she did try to wake her husband up to come and see it; she is the only witness -- Pam and her video camera."],"Summary":"Witness videotaped Brightly Lit Unidentified Object In Sky","Tags":"City","Country":"United States"}