{"Country":"United States","Date Submitted":"08/07/2008 09:10 UTC","Viewing Distance":"21-100 Feet","Weather Factors":"None","Disposition":"Unknown","Region":"Iowa","Date of the Event":"08/07/2008 09:10 UTC","Object Shape":"Cylinder, Sphere, Triangle, Other","Tags":"City","divs":["Sighting DetailsI was outside on the balony at around 9pm with my partner and i pointed to something pretty bright and huge in the sky, it had many different lights, didn't think anything of i until it started moving toward us and hovering- it was not a disk, the shapes changed. at one point it looked like it had huge lit up wings. The whole night was very intense. I believe it was aware of me- I took about an hours worth of pictures and video. It looked like there were militay planes kinda surrounding it, not getting very close. from the thing, other things were descending from the main thing. It is too much for me to write, I am very confsed and have not been feeling well since the experience. I called the cops at one point of the night, to no avail. this experience was so huge that I was sure it was going to plastered all over the local and national news, but it wasn't. I went in about 215am, while i was sitting outside some extremely dark shadows (the bckest of the black) where surrounding me and I could not take it anymore. I have not felt right since. There were points that it looked like a HUGE lit up dragionflyin the sky, and at other times two bright eyes following my movements snakelike. It was crazy. I wish I can go from beggining to end for you but am a bit traumitized. I could probably speak it better than write it. The being had dark tentacles (noshit). It was more like it was alive, not shiplike. My vision went blurred until the next afternoon. I thought it was beautiful and that is what kept me out there. It was also terrifying, like something from a crazy scifi movie, but real. It hovered but ould also have very lifelike movements. It followed my movements for a while. It would play around on my camera screen. it was nuts."],"Source":"MUFON","Summary":"started out as real bright (i thought star) until it started moving and changing shape, at one pointit looked like it had tentacles, it shapeshifted alot","Latitude":"42.500558","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"12015","files":["/var/www/straped/mufon/html2text/12015.html.txt","/var/www/straped/mufon/more/12015_submitter_file1__blowfish.JPG","/var/www/straped/mufon/org/12015.html"],"trends":["There have been 8 other sightings in Dubuque","There were no other sightings in Dubuque on or around August 7th 2008","This sighting has never been favorited.",""],"Object Features":"Appendage(s), Wings, Other","City":"Dubuque","Sighting Duration":"05:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=42.500558,+-90.664572(12015)&iwloc=A&hl=en\"> mufon case (12015) map </A>","Longitude":"-90.664572","Log Number":"US-08102008-0010"}