{"Object Flight Path":"Straight-line path","City":"Warren","Sighting Duration":"00:01:00","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/12018.html.txt","/var/www/straped/mufon/more/12018_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/12018.html"],"divs":["Sighting DetailsThere were 3 separate events this evening. The spacing was about 5-10 minutes between each event. In each case, the object looked the same. It was a triangle shaped fire that faced \"the wrong way\" compared to how a triangle of fire might shoot from a jet fighter. As the objects approached it looked to have similar speed to an airplane in the sky, yet there was no sound as it went overhead. It seemed that maybe it was a satellite falling from the sky but the shape of the fire seemed opposite of how it should be with a tail to it's direction of heading. In each of the three cases, the objects traveled the same flight path and looked alike as well when overhead. We were at a party this evening and 15-20 people saw these objects and all wondered what the objects were. The objects moved in a straight line about the speed of airplanes so it seemed maybe these were high altitude pieces of space junk falling out of the sky. But why the weird shape of the fire? The objects went from one end of the sky to another until out of sight. It seemed they were not changing in intensity or shape as they went by. I'm just interested to know what these three objects were. I do not think for 1 second they are alien spacecraft but possibly pieces of falling satellites or other things that were in orbit. The strange part to me is the shape of the fire."],"Date Submitted":"08/09/2008 10:00 UTC","Longitude":"-83.026817","Source":"MUFON","Latitude":"42.50242","Country":"United States","trends":["There have been 14 other sightings in Warren","There were no other sightings in Warren on or around August 9th 2008","This sighting has never been favorited.",""],"Weather Factors":"None","Log Number":"US-08102008-0013","Summary":"Triangular shaped fireball opposite what a plane w/ afterburner might have","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.50242,+-83.026817(12018)&iwloc=A&hl=en\"> mufon case (12018) map </A>","Region":"Michigan","Disposition":"Insufficient Data","Date of the Event":"08/09/2008 10:00 UTC","Object Shape":"Fireball, Triangle","Case Number":"12018","Tags":"City"}