{"trends":["There have been 5 other sightings in Weston","There was one other sighting in Weston on or around August 11th 2008"],"Object Features":"Unknown","Viewing Distance":"Unknown","Tags":"City","Region":"Florida","Object Shape":"Oval","City":"Weston","Summary":"It was like quicker than lighting and a blink of an eye","Date Submitted":"08/11/2008 09:00 UTC","Object Flight Path":"Unknown","Source":"MUFON","Log Number":"US-08112008-0002","map":"<A HREF = \"http://maps.google.com/maps?q=26.108705,+-80.393105(12020)&iwloc=A&hl=en\"> mufon case (12020) map </A>","files":["/var/www/straped/mufon/html2text/12020.html.txt","/var/www/straped/mufon/org/12020.html"],"Country":"United States","Longitude":"-80.393105","Date of the Event":"08/11/2008 09:00 UTC","divs":["Sighting DetailsOk, I going outside to take the garbage out and I always look up into the sky to see if I see anything odd and I have always believed in UFO and there is some life form out there that the United States and other country don't want to expose to the people. So anyways I was looking into the sky and see the object that looked and saw something just odd. And usually it's a plane but this definetly wasn't. It wasn't like it as 10 feet above me it was prettey up in the sky that I would see what it was. So it looked like a oval shaped airplane that I saw for less than a second. I knew from that point it was no plane or u.s aircraft or jet. That thing must have been going 10 times the speed of light it made this little noise that maybe a couple people would of heard. I was so happy to have seen that happen because like I said every night I look into the sky and something is out there and I've never seen a ufo before, and I said if I tell my family they'll think I'm crazy like they say every time. And when I filled the duration of the event that I say it put 0, 0, 2 because it that fast, but in those two seconds I was able to see the ovaled shaped thing in the air."],"Sighting Duration":"00:00:02","Disposition":"Insufficient Data","Case Number":"12020","Latitude":"26.108705","Weather Factors":"Unknown"}