{"Object Flight Path":"Path then hovering","Disposition":"Insufficient Data","divs":["Sighting Detailsi was out with my girlfriend getting away for a bit. we stopped off onto a dark road to park her car. when we stopped we shut off the car and opened the sun roof and began to look at the stars. after a bit we saw a few shooting stars after about the 7 or 8th i saw just above the pine trees maybe a few more feet above them a very big disk the back end gloved blue and the front had a strange color i would say at 1 point looked closet to purple . it moved slow at first and seemed to had shut off its lights but still moved above me as a dark mass over head it then moved over to the next set of trees and had gotten a real bright red and it just vanished right as it turned purple again. now as i saw at first i said to my girlfriend lyzz hey lyzz look at that, but she didn't reply i don't know why she had just seen a shooting star seconds before that and now she was just lost in her own little word i guess i can put it seconds after it was gone she finely stopped staring out into the sky and said \"what was that you were saying something about the energy in the sky?\" i said nothing about the energy until after i had begun to notice a lot of it every were almost like heat waves coming out of the trees and going toward were this ship was just at. so i said nothing else of it to her. but i had decided for some reason to close my eyes and just say hello, right away i got in a almost loving way a and happy way and energetic way \" and to you a good day\" after that i had just received a lot of information i didn't really posses until after getting home and thinking back to it. this voice had carried a image to me as well it would sound crazy but it looked just like light a being made of pure light but almost looked like a human at the same time. it told me over all because i had opened my mind to things such as its self I was free to speak with it and lyzz couldn't she was just lost in the moment. this is the biggest thing that's happened to me in a whole week of strange sitings that only me and my friends had seen of other strange ships like that but seeing them for seconds and then gone in a flash. This time it stayed put long enough for me to really take a good look at it. I had Ben getting into channeling of things from other worlds and that's why i had begun to notice the other things around me such as them the being had said to me, they are here all the time watching over us and they are not to be feared. Its because so many pepole fear and don't truly understand them, they don't have such open contact with us the voice had told me but within the next 9 years things will have changed a lot . Its up to us on how fast things will change on terms of open contact with others. An that is all i have learned and experienced from that one encounter."],"Latitude":"42.767838","Log Number":"US-08112008-0007","Source":"MUFON","Case Number":"12025","Longitude":"-78.613359","Region":"New York","Sighting Duration":"00:00:30","City":"East Aurora","map":"<A HREF = \"http://maps.google.com/maps?q=42.767838,+-78.613359(12025)&iwloc=A&hl=en\"> mufon case (12025) map </A>","Date Submitted":"07/25/2008 02:13 UTC","trends":["There have been 2 other sightings in East Aurora","There were no other sightings in East Aurora on or around July 25th 2008"],"Weather Factors":"None","Tags":"City","Date of the Event":"07/25/2008 02:13 UTC","files":["/var/www/straped/mufon/html2text/12025.html.txt","/var/www/straped/mufon/org/12025.html"],"Summary":"big cicle with a birhgt blue on one half the other bark black but had a dim purple light near hte rim","Object Shape":"Circle, Disc","Country":"United States","Viewing Distance":"Unknown","Object Features":"None"}