{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"12022","Latitude":"48.865874","Summary":"yellow unidentified light hovering at the close vicinity of an airport, then zooming out fast","City":"Paris","files":["/var/www/straped/mufon/html2text/12022.html.txt","/var/www/straped/mufon/org/12022.html"],"divs":["Sighting DetailsFirst of all, my apologies for writing so much text, but I need to tell all the events and the details as I remember them. This happened sometime between 1993 and 1995 in autumn, I can't remember precisely the date. At this time I was working on a small airport named Le Bourget in the suburbs of Paris. It is the small airport reserved for business, diplomatical, and other non-conventional flights (humanitarian, personalities, weapon deals, whatever needs discretion). It was approximately 7h30 PM and I was about to leave the office to go back home. My office had a row of large windows through which I could watch one of the runways (the auxiliary, rarely used one) approximately 150 meters away and behind it, the military zone, another 150 meters away. Strangely, I was just thinking about UFOs at this very moment , then watching through the window I noticed a strange and very bright light hovering about 20 meters above the military zone. My first thought was a helicopter, but then I realized that helicopters fly very rarely at night in that area and at that altitude, I had actually never noticed one doing that. Then I noticed that the parkings and hangars at the military zone were all shut off, completely black ,and noone could be seen outside (this particular military installation was almost never used at night). This was very odd. If an helicopter had taken off from this area, there should be at least lighting on the parking area. There was also no reason for the helicopter to hover in the same place as it did for several dozen minutes. I kept watching it for approx. half an hour. Unfortunately I was working alone and I didn't have the idea to call the airport controller to have any confirmation on the aircraft. But I had never seen an helicopter hover or even take off in this area, especially in total darkness, and why so long? There was also no other light than this very bright yellow spot that seemd to be pointed in my direction. No flashing red lights as helicopter seem to carry often('warnings' as we called them). No sound either (I think I would have heard an helicopter 300 meters away) I tried to look at it with binoculars but I could see nothing more than the light (the area was very dark around it) almost as if there was nothing else, just the light. Then after several long minutes, I noticed the light was vibrating very strongly and losing intensity and I understood that it was probably zooming away from me at a very high speed. I estimated a very high speed because of the strength of the oscillations, I can't explain precisely why but the way it was vibrating made me think it was moving very fast through the air. I would say at least 150-200 kms per hour (or much more as it was very difficult to acertain anything in that darkness). What is strange is that the light just seemed to zoom out, without any previous manoeuver (an helicopter would probably have needed some sort of rotation before moving away). And the direction seemed to be exactly in the axis of my observation, as if it was running away from me. In one minute it had completely disappeared that way. No other trajectory than a zoom away from me. If I had to compare it to a \"conventional\" aircraft it could only be an helicopter. Definitely not an aeroplane or any other aerodynamic vehicle (so that rules out winged drones). Definitely not a blimp as i can't imagine a blimp flying so low and then zooming out so fast. All the events also took place at very low altitude, in a very urbanized area with all the inherent hazards (such as electrical lines and buildings) that make me think it was not a normal behaviour for an helicopter, especially in such a darkness. I know that sometimes, when aircrafts are in the final approach pattern, the landing lights, if observed directly in the axis of movement, can looks as if they are just hovering in place and not moving. But I am familiar with this illusion and it was definitely not the case here. First there is no approach pattern in the direction I was watching, secondly it never lasts for so long, and third it never happens in outbound direction (as it happened in the last part of my observation). I don't want to speculate on the nature of my observation, but it was definitely not something ordinary, all I can say is that it seemed to be \"spying\" or monitoring something. I didn't have any particular feelings related to this observation, except curosity. Unfortunately, there is nothing more to say, I understand this might be something normal and not out of this world, but on the other hand it could help other researchers in their study of UFO behaviours."],"Sighting Duration":"Undisclosed","Log Number":"FR-08112008-0004","Source":"MUFON","Date of the Event":"10/10/1993 07:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Country":"France","Region":"Île-de-France","trends":["There have been 11 other sightings in Paris","There were no other sightings in Paris on or around October 10th 1993"],"Tags":"City","Longitude":"2.362072","Date Submitted":"10/10/1993 07:30 UTC","Disposition":"Unresolved","Object Features":"None, Unknown","Object Shape":"Flash, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.865874,+2.362072(12022)&iwloc=A&hl=en\"> mufon case (12022) map </A>"}