{"files":["/var/www/straped/mufon/html2text/1202.html.txt","/var/www/straped/mufon/mufon_json/1202.json","/var/www/straped/mufon/org/1202.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.363012,+-93.654136(1202)&iwloc=A&hl=en\"> mufon case (1202) map </A>","Object Features":"Undisclosed","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Case Number":"1202","trends":["There have been no other sightings in Wealthwood","This sighting has never been favorited."],"Region":"Minnesota","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Summary":"Glowing orange ball maneuvered in sky, came close.","divs":["Sighting Details Witness No. 1 said he was at his cabin on the north shore of Mille Lacs Lake. He was watching satellites ( I believe he said he started watching late on thenight of the 4th), when what he at first thought was a satellite stopped, thenzipped across the sky. This made him believe it was a UFO, and he becameexcited. He said there was one additional witness to the July 5 sighting, theman from the neighboring cabin, whom he went to get when he saw the object, buthe couldnt give me the mans name during this interview. I believe he didntremember the name. As they were watching the object together, it went out ofsight, then what he assumed was the same object appeared at closer range througha gap in the row of trees that ran between the two cabins. He said the objectwas 100 to 150 feet away from them, was a perfect sphere approx. 5 feet indiameter, glowing orange. He estimated that it was about 20 feet off the groundand moving at between 25 to 50 mph. He felt that it passed between the row oftrees and the neighbors cabin. They ran to the gap in the trees, but theobject was by then out of sight. His neighbor was, he said, frightened by thesighting. Witness No. 1 said he watched for UFOs a total of three and a halfhours that night.Witness No. 2 did not have a good memory of the event. He was originally unsurehow close the object came. He later said the object might have been as close asbetween the two cabins. He estimated the height of his cabin as 15 feet,therefor it is not possible to be sure of the distance of the object at closestapproach."],"Latitude":"46.363012","City":"Wealthwood","Source":"MUFON","Longitude":"-93.654136","Log Number":"","Date of the Event":"07/05/1999 01:30 UTC","Tags":"City","Date Submitted":"07/05/1999 01:30 UTC","Sighting Duration":"01:59:00","Country":"United States","Weather Factors":"Unknown"}