{"Weather Factors":"None","Viewing Distance":"Unknown","City":"Gold Coast","Object Shape":"Star-like","Object Flight Path":"Stationary","Summary":"Star like object in sky but has colour & form when zoomed in.","trends":["There have been 2 other sightings in Gold Coast","There were no other sightings in Gold Coast on or around August 1st 2008","This sighting has never been favorited.",""],"Region":"Queensland","Disposition":"Unresolved","Date Submitted":"08/01/2008 11:30 UTC","Latitude":"-28.041014","Source":"MUFON","divs":["sighting detailsquick explanation. i had just purchased a new telescopic camera lens (a canon ef 70-300mm is usm with image stabilizer) and decided to go outside in the front yard and play with it, take a few photos of the dog, plants etc, then noticed the clouds had really beautiful rainbow shimmers to them, so started taking photos of the clouds. i noticed when sighting through the viewfinder, a bright dot to one side of the cloud. i intially thought it was a plane, extremely high up, but then noticed that it wasn't moving, the clouds were, and the clouds actually passed behind the object. i had also thought it maybe a star\\planet until the cloud moved behind it. i watched it for about 15-20mins and it did not move. it did not get smaller or larger, which it would have if it was moving away or toward me, and i wasn't having to track it with the camera. i called my son out to have a look but you couldn't see it with the naked eye, and then i couldn't find it again through the viewfinder. anyway, i downloaded to the computer, and when you 'zoom in' on the object it is definitely not a plane shape, and even though very close up it pixelates, you can see it is greyish and has form. you can also make out a kind of heat shimmer or energy shimmer around the object, though this could be due to having to zoom in so close. i would really appreciate your opinion on what it could be, as i have shown my son, who has a bachelor of science, majoring in maths and physics (and very 'logical'), and he is totally stumped, and i have spent the last few days trying to work out what logical explanation there could be for this object, but have not found a one."],"Date of the Event":"08/01/2008 11:30 UTC","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/12024.html.txt","/var/www/straped/mufon/more/12024_submitter_file1__Infront.jpg","/var/www/straped/mufon/more/12024_submitter_file2__ufo4.jpg","/var/www/straped/mufon/more/12024_submitter_file3__IMG_383611.jpg","/var/www/straped/mufon/org/12024.html"],"Longitude":"153.297505","Log Number":"AU-08112008-0006","Sighting Duration":"Undisclosed","Case Number":"12024","map":"<A HREF = \"http://maps.google.com/maps?q=-28.041014,+153.297505(12024)&iwloc=A&hl=en\"> mufon case (12024) map </A>","Country":"Australia"}