{"Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsOn 8-11-08 at around 1am I stepped out on my back deck to observe the metorite shower, when I observed a bright star like object in the north east sky. It was bright like a star, but was pulsating diffrent colors a very bright red white green and white and orange very rapid..It moved at funny angles and seemed to hover in a a general area, it didnt move like convetional aircraft....I tried to take pictures with my digital camera, I then went and got my tripod and placed my digital camera, on camera record mode and shot some digiatal video of it..I also observed it through my binoculars, and could see the pulsating lights pretty clear ..It stayed in the same general area for about a hour and a half, I then noticed the lights became a little dimmer and it seemed to have changed coarse and moving away to the north, I packed up my camera and jumped in my vehicle and drove north a few miles , and observed the object shoot off at a hight rate of speed at weird angles and out of sight time was a little after 230 am ish.. the object spent most of its time in the north east sky between m-91 and m-66 north off of west carson road(m-57} about a mile east of the city of greenville michigan in moncalm co."],"trends":["There have been 2 other sightings in Greenville","There were no other sightings in Greenville on or around August 11th 2008"],"Object Features":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.179931,+-85.249139(12027)&iwloc=A&hl=en\"> mufon case (12027) map </A>","Date of the Event":"08/11/2008 02:20 UTC","Longitude":"-85.249139","Country":"United States","Latitude":"43.179931","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"08/11/2008 02:20 UTC","Object Shape":"Star-like","Tags":"City","Case Number":"12027","Region":"Michigan","files":["/var/www/straped/mufon/html2text/12027.html.txt","/var/www/straped/mufon/org/12027.html"],"City":"Greenville","Viewing Distance":"Over One Mile","Log Number":"US-08112008-0009","Sighting Duration":"Undisclosed","Summary":"north east sky observed a bright star shaped object that was pulsing diffrent colors adn moving around in the sky at weird angles...bright greens reds and white, oranges."}