{"Date Submitted":"08/11/2008 01:30 UTC","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/12033.html.txt","/var/www/straped/mufon/org/12033.html"],"Object Features":"Unknown","Tags":"City","Weather Factors":"Does Not Apply","Log Number":"US-08112008-0015","Region":"Nevada","City":"Las Vegas","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/11/2008 01:30 UTC","Object Shape":"Circle, Disc, Sphere","Source":"MUFON","Latitude":"36.116156","Longitude":"-115.170206","Case Number":"12033","divs":["Sighting DetailsEarlier today my Mother and I were driving down Tropicana, towards Dean Martin Dr. when I noticed something flying towards the New York New York casino. I first thought it was a helicopter, but kept my eye on it anyway. It suddenly stopped flying and just remained hovering, after it hovered for about a minute I mentioned to my Mother it was there. I asked her what she thought it was, because at the point I no longer thought it was a helicopter. She wasn't able to see it at first, we spent a good few minutes with me trying to help her see where it was. She finally noticed it and by that point it was significantly lighter than I first noticed (it was black at first) we continued watching it and it got continually lighter until it just disappeared. Almost immediately after it disappeared, two military helicopters flew into the area where it had been hovering. While watching it I didn't feel much except curiosity and excitement, I think the only reason I noticed it in the first place is because I generally keep and eye to the sky and it was within my line of sight. I wasn't able to get any pictures or video, as I was driving and I didn't have my Mother do it because from where we were, it wouldn't have shown up on the camera."],"trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 11th 2008"],"Summary":"Ufo near New York New York casino...","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=36.116156,+-115.170206(12033)&iwloc=A&hl=en\"> mufon case (12033) map </A>"}