{"map":"<A HREF = \"http://maps.google.com/maps?q=34.374043,+-80.0734(12039)&iwloc=A&hl=en\"> mufon case (12039) map </A>","trends":["There have been 2 other sightings in Hartsville","There were no other sightings in Hartsville on or around August 3rd 2008"],"Longitude":"-80.0734","Date Submitted":"08/03/2008 11:30 UTC","Source":"MUFON","Tags":"City","Region":"South Carolina","Summary":"Bright star-like object flashing alternating red and white","divs":["Sighting DetailsAt about 11:30 pm my boyfriend and I walked outside to have a cigarette. He looked up at the sky (something he's made a habit of since he had spotted an unidentified object in the sky about a month before only no one was there to see it with him) and noticed what looked like a star that was glowing brighter than all of the others that was flashing white and then red and called my attention to it. He mentioned that it looked exactly like the light in the sky that he had seen previously as we continued to look on in amazement. He sent me inside to look up the number for Mufon on the website and after finding it I returned with my cell phone for him to call. He waited through the automated messages and then ended up haning up after he couldn't get anyone on the line. After a few minutes of staring we realized that the object was slowly moving by using the power lines as reference points. When we first began watching the object looked as though it was centered between two power cables that were close to the house--that was our only way of measuring movement as the object was pretty far off--after a while we noticed it moving slowly to the right and then left all the while still blinking white and then red. Around that time I asked my boyfriend to grab my camera from inside of the house so that we could try to get pictures. When I tried my camera I couldn't capture an images because the object was so far off that all I really got a picture of was the complete blackness of the sky so after a few useless shots I abandoned the camera and continued to look on with my boyfriend. As we were staring up at the sky a guy came walking down the road presumably on his way to a friend's house and my boyfriend stopped him and asked him to look up in the sky at the object. The stranger (found out his name was Steven)looked for a moment and confirmed that he saw it too and stood around for a minute or two looking up at the sky with us before he was on his way again. After that my boyfriend returned to his original position beside me on the porch and we began to notice that the object had began to move up and away (it had become obscured by the topmost powercable that we used as our reference point). It had moved unlike an airplane in that it sort of hovered and seemed to move in an almost zig-zag pattern in the sky and also unlike a helicopter since it wasn't moving all that fast and that there was no sound. It was then that I looked at my cell phone again and noticed that it was 12:30 which was surprising given that we didn't think we had been outside nearly that long. While we continued wathing the object my boyfriend commented that it looked as though the object had started out over the local nuclear power plant which is a no-fly zone. We watched for a little longer and then decided to try and follow this thing in the sky. We got into the car at about 1:06 am and drove around the neighborhood with both of us sticking our heads out of the windows at random and searching the sky. We spotted it one last time as we drove around but that was it, it looked like it had gone out too far for us to easily see. Over the course of the next few days my boyfriend noticed a lot of military planes and air crafts flying over and near the same area we'd spotted our ufo. Also we recived a call back from one of the Mufon directors asking us about what we had seen. We were directed to the Director of Investigations for our area and we reported what we'd seen to her as well. She asked us to find out if Sirius was in view (after looking up some information on it I noticed that the Sirius star could look very much like what we saw only without the movement) so I emailed my old astronomy professor and found out that Sirius was in view that day however it was only in view at about 6:30 am on Aug. 3 very briefly. So it was Sirius but was definately something that we have no explanation for and a night we aren't likely to forget."],"Viewing Distance":"Over One Mile","Log Number":"US-08122008-0004","Latitude":"34.374043","Case Number":"12039","files":["/var/www/straped/mufon/html2text/12039.html.txt","/var/www/straped/mufon/org/12039.html"],"Sighting Duration":"01:30:00","Date of the Event":"08/03/2008 11:30 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Disposition":"Unknown","Country":"United States","Weather Factors":"None","City":"Hartsville","Object Features":"None","Object Shape":"Circle, Flash, Star-like"}