{"files":["/var/www/straped/mufon/html2text/12031.html.txt","/var/www/straped/mufon/org/12031.html"],"Object Shape":"Other","Date of the Event":"07/24/2007 12:00 UTC","Object Features":"Unknown","Region":"Florida","Longitude":"-81.774444","City":"Howey-in-the-Hills","Date Submitted":"07/24/2007 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"Son pointed out 60 Ft. long object with white lights 100 ft. from the ground, 3 white lights suspended with no sound.","Case Number":"12031","trends":["There have been no other sightings in Howey-in-the-Hills","This sighting has never been favorited."],"Country":"United States","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Log Number":"US-08112008-0013","Disposition":"Unknown","divs":["Sighting DetailsMy name is John Cole. I am 38 years old and reside in Howey in the Hills, Florida. My two sons and myself had a close sighting last year on July 24th at about 10:30pm. I was working on my well pump with my sons and my oldest saw something and acted like he wanted to run but hesitated until I saw what he did. I looked aorund from a tree that was blocking my view and realized I was looking at an object at least 60 foot long almost a marquie diamond shape with three white lights. It was just sitting there suspended over my property line no more than 100 feet from the ground. I stood amazed trying to make out a familiar shape but realized there was no sound. I looked at the time. It must have stayed suspended for three minutes before slowly moving towards the orange groves. I had a roll of orange electrical tape in my hand when I saw this object and when I turned to get the kids in the car, the tape was gone and looked at the time and realized that we lost ten minutes. We persued this object about three minutes and tried to beat it to the highway to get a closer look, and with incredible speed it moved in to another town twenty minutes away effortlessly. Since this has happened I am convinced that there is higher intelligence than man. I've never seen anything like this during my tour of duty in the armed forces. I spoke with my neighbor who flys for the sherriffs dept. and he said he didn't fly around our properties that night but was in the air. Since this I've kept an eye opened at night when I'm outside, on the phone or just watching I see a few falling stars and very distant lights that move appears to be stars at first then can move half across the horizon, stop, then change course in a 90 degree angle, it's amazing to watch. The most I've seen in a three hour period has been about eight. If any reports or investigators fron my area have been made I would appreciate knowing. Thank you so much."],"Object Flight Path":"Stationary","Latitude":"28.716111","map":"<A HREF = \"http://maps.google.com/maps?q=28.716111,+-81.774444(12031)&iwloc=A&hl=en\"> mufon case (12031) map </A>","Source":"MUFON"}