{"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Tags":"City","Summary":"spherical object changing colors red green yellow","Object Flight Path":"Hovering then path","Case Number":"12040","Latitude":"45.278856","map":"<A HREF = \"http://maps.google.com/maps?q=45.278856,+-92.985218(12040)&iwloc=A&hl=en\"> mufon case (12040) map </A>","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Forest Lake","There were no other sightings in Forest Lake on or around August 31st 1979"],"Object Features":"Patterned Surface","Region":"Minnesota","divs":["Sighting DetailsI came upon the article on the internet about the 1979 sightings. I was coming back from a contract job in Stacy Minnesota. It was the fall of 1979 and I was with a friend of mine. We were southbound on Interstate 35 and just approaching Forest Lake. I observed several cars pulled to the shoulder of the freeway which is not common. I observed several of the occupants of those vehicles pointing toward the sky (North and eastward). My friend and I pulled in behind the other vehicles and off the roadway. We heard many people questioning what it was they were looking at. What I saw will be engraved in my memory forever. I looked up and observed a round sphere changing color. The sphere was approximately 400 feet in the air and made absolutely no sound. I watched it for several minutes trying to explain to my mind what I was seeing. Helicopters make noise, aircraft can't maneuver like this. it made several very quick maneuvers which I would describe as moving from one location to 20 miles in another direction and then back again. It did this several times and then shot straight out into space leaving all who were standing there wondering what had taken place. I got into my vehicle and drove away more stunned than ever. I have no reason to make this up and it appears that the town of Forest Lake was a hot bed of activity for several weeks after that. Car loads of people who attended local church meetings described what they had observed. The local papers did stories on the UFO sightings but now those sightings and articles cannot be located in the archival records. These sightings took place when I was about 19 years old. I saw what I saw that night and to me it is undisputed. We are not alone. I have seen many strange things working nights and graveyard shifts but I have never been so awe struck as I was that night. WHERE ARE THE RECORDS ???"],"files":["/var/www/straped/mufon/html2text/12040.html.txt","/var/www/straped/mufon/org/12040.html"],"Date of the Event":"08/31/1979 10:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-92.985218","Date Submitted":"08/31/1979 10:00 UTC","Log Number":"US-08122008-0005","City":"Forest Lake","Disposition":"Unknown","Country":"United States","Source":"MUFON"}