{"Object Shape":"Cross, Triangle, Unknown","Log Number":"US-08122008-0007","Object Features":"Other","Region":"Indiana","Longitude":"-87.496831","Tags":"City","City":"Hammond","Viewing Distance":"101-500 Feet","Source":"MUFON","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.585989,+-87.496831(12042)&iwloc=A&hl=en\"> mufon case (12042) map </A>","divs":["Sighting Detailsi was out by a friends house and happen to notice this undiscribable object in the sky. i then called my wife who has a camera phone and it also has a camcorder on it and i picked her up and we went back to investigate it. we both agree it was not tethered to anything, we asked some construction people if they had a device out that they were using and they said know and looked and could not discribe it, other people would look and pay no mind to it. it had to be about 200 to 300 feet up at times and lower much lower at other times. it would move up and down and side to side but never really go to far. it had things plapping on it and was black in color. we thought ok maybe someone lost a balloon but i would think that a baloon would fly away not just stay basically in one area. we did report this to a person at 219-845-1292. this was the number that we were given to call from you all. i also asked a cop about it and he said oh you are just seeing things. i would think though if i were just seeing things i could not have cought it on my wife's camcorder phone! some of the footage is attached if you want some more please feel free to contact us thank you. John"],"files":["/var/www/straped/mufon/html2text/12042.html.txt","/var/www/straped/mufon/org/12042.html"],"Date Submitted":"08/12/2008 09:30 UTC","Weather Factors":"Unknown","Country":"United States","Case Number":"12042","Sighting Duration":"Undisclosed","Date of the Event":"08/12/2008 09:30 UTC","Summary":"ufo over 149th st.","trends":["There have been 8 other sightings in Hammond","There were no other sightings in Hammond on or around August 12th 2008","This sighting has never been favorited.",""],"Latitude":"41.585989","Object Flight Path":"Stationary"}