{"divs":["Sighting DetailsI saw two large bright glowing lights flying either in the clouds or just above the clouds. Kind of off white color, maybe slightly yellowish. Shape of both lights was mostly circular, but slightly oval. They flew in an absolutely straight line, very fast for their size, no sound, and maintained an exact distance from each other. I couldn't tell if it was two aircraft or one aircraft with two lights, but in either case, it had to be absolutely HUGE. Each light was about the size of a dime if I put my arm out straight and held a dime in my fingers. They came from the south and were heading in a north or slightly northwest direction. Took less than 10 seconds for them to streak across the sky and out of sight. The date is approximate but definitely during the week of November 6. I remember the time exactly because I was sitting in my car drinking coffee, parked just outside the flightline at Davis-Monthan AFB waiting for my shift to start. I was participating in an exercise and normally wasn't there that early. When I saw the lights go by, I froze, didn't want to blink or even breath. The lights flew either right above the runway or were slightly outside the perimeter of the base, but they were going in the same direction as the runway. I had been in the Air Force for over 11 years at that point, worked the flightline day and night, seen all kinds of aircraft come and go and I NEVER saw anything like this. After the lights went by, I looked around the parking lot to see if anyone else saw it, but no one was around. That in itself was odd. There should have been several people in the parking lot by that time. When lunchtime came, I went back to my unit to report it to the SOC desk. I asked them to call the tower or base ops to see if they saw it or got any similar reports. The guy at the SOC desk just laughed and made a joke of it, like \"ha ha, Sgt E saw a UFO, what were you drinking, what were you smoking, can I have some of that too?\" I kind of expected that since he was an assclown so I let him joke around for a minute and then I asked him, ok can we get serious now? Just call the tower and ask them if they saw it. Next he just ignored me so I pressed him a little harder. Then one of the ADOs came out of his office and told me to just drop it, asked me if I have somewhere I need to be and told me to get going. I've never seen anything like it since but if I ever do, I'll certainly never report through Air Force channels since no one wants to hear about it anyway. There's simply no one who takes such reports. Report it through your chain of command and they won't give a crap. Report it to any other Air Force agency and it will never make it past the nearest shredder or trash can. The \"that's not my job\" philosophy definitely applies here. Since I just found this site and a couple others like it, I figured I'd check to see if anyone else ever saw what I saw, but I don't see any that match this particular sighting. So for what it's worth, here's my one and only sighting. If I see any more, I'll let you know."],"Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around November 6th 2002"],"Object Flight Path":"Straight-line path","City":"Tucson","Case Number":"12043","Date Submitted":"11/06/2002 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.224153,+-110.922069(12043)&iwloc=A&hl=en\"> mufon case (12043) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"32.224153","Summary":"two large bright lights flying in the clouds in Tucson","Tags":"City","Region":"Arizona","Object Shape":"Circle, Oval","files":["/var/www/straped/mufon/html2text/12043.html.txt","/var/www/straped/mufon/org/12043.html"],"Log Number":"US-08122008-0008","Weather Factors":"Unknown","Longitude":"-110.922069","Date of the Event":"11/06/2002 05:50 UTC","Country":"United States"}