{"Latitude":"31.137136","Country":"United States","Longitude":"-83.423494","Date Submitted":"08/12/2008 10:30 UTC","files":["/var/www/straped/mufon/html2text/12054.html.txt","/var/www/straped/mufon/org/12054.html"],"Object Features":"Unknown","Date of the Event":"08/12/2008 10:30 UTC","trends":["There have been 2 other sightings in Adel","There were no other sightings in Adel on or around August 12th 2008"],"Log Number":"US-08132008-0011","Weather Factors":"None","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=31.137136,+-83.423494(12054)&iwloc=A&hl=en\"> mufon case (12054) map </A>","divs":["Sighting DetailsMy friends Buddy, Bullard, Buddy's mom, and I were leaving their apartment complex to go to the store to get cigarettes. As we started driving...Arlene (Buddy's mom) noticed it first, but Bullard and I pointed it out, seeing as how we didn't know what it was we were looking at. It was dark, so we couldn't see the \"object,\" but we saw the lights on it illuminate in a circular motion. Some of them faded, but lit back up. After all the lights on the \"object\" were fully illuminated, it flew off the right at a very fast speed, and the lights were just a blur as it vanished. Several seconds later, as Buddy, Bullard, and I were sticking our heads out of the window, the \"object\" reappeared, but this time, in a different spot. I couldn't see it clearly, but i could still see at least half of the lights. This time, it didn't stay lit too long...and once again, it vanished. After the sighting, Bullard and I noticed several (about 5 or 6) planes flying in the direction of the \"object.\" As we got back to the apartment complex, there were several neighbors sitting on the steps; they asked us if we have seen \"anything\" in the sky. We simply replied with a yes, and they were happy, telling us that, \"They were glad they weren't crazy.\" We live near a Air Force base, and are used to seeing many different kind of planes and jets during the day and night, and this is like nothing we have ever seen before. When i told my mom about it the next day about the \"sighting,\" she told me that during the same time period, she noticed and heard several jets and planes taking off from the base heading towards Adel. All of us were astonished at what we saw...and during it, we couldn't believe what we saw...but knew that it was real. After seeing it...we all stayed outside and watched the sky; hoping to see it again. We have notified the local paper."],"Object Flight Path":"Hovering then path","Summary":"Circle illuminated object","City":"Adel","Tags":"City","Source":"MUFON","Case Number":"12054","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Circle, Fireball","Region":"Georgia"}