{"Date Submitted":"08/12/2008 10:32 UTC","trends":["There have been no other sightings in Paradise","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.009823,+-76.128565(12050)&iwloc=A&hl=en\"> mufon case (12050) map </A>","Log Number":"US-08132008-0007","files":["/var/www/straped/mufon/html2text/12050.html.txt","/var/www/straped/mufon/org/12050.html"],"City":"Paradise","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Date of the Event":"08/12/2008 10:32 UTC","Sighting Duration":"00:10:03","Viewing Distance":"Unknown","Summary":"slowly flew like a plane, then rocketed off into the sky","Longitude":"-76.128565","Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Latitude":"40.009823","Object Shape":"Flash, Star-like","Disposition":"Insufficient Data","divs":["Sighting Detailswell, it began on monday night, the 11th of august. I didn't see this insidence, but my 9 yr old daughter was on the couch because she said she was too scared to sleep in her room. she said before she fell asleep, ( around 10 ish) she thought she saw a UFO in a field near our house....now i disregarded her because i hadn't heard anything on the news, or see anything myself, besides, she was only 9. sometimes nine yr olds say funny things to get out of sleeping by their self in their own bed. then came tuesday--it was about 10:30 approx. i was smoking my bedtime cigarette out on the porch of my apartment. i watched the stars for a few minutes and then focused my eyes on a \"plane\"...their were particulary alot of planes in the nighttime sky. this one was kind of blinking like a police car, although i'm not sure i saw blue...i saw red and white for sure....the plane just flew by, nice and serene like, then WHAM! it flew almost like ( dare i say it) hyperspeed. NO joke! then it was gone...i watched the other \"planes\", in awe, but no other plane showed such character...that's my story, i wish i had a way of confirming it because my daughter and i are pretty freaked. thanks!"],"Region":"Pennsylvania","Case Number":"12050"}