{"Viewing Distance":"Over One Mile","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=26.131538,+-80.137449(12057)&iwloc=A&hl=en\"> mufon case (12057) map </A>","Summary":"Black Rotating Triangle with Black Object Leading","Longitude":"-80.137449","Object Flight Path":"Other","Date of the Event":"08/13/2008 08:20 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Log Number":"US-08132008-0014","Object Features":"None","City":"Fort Lauderdale","divs":["sighting detailsthis hazy august evening a friend of mine and i were walking the dog and my friend looked up at the moon and said,\"what is that object by the moon?\" i looked up to the moon in the eastern dusk sky and we both identified a black triangular object traveling northeast, about an inch below, at arm's lenght, beneath the moon. there was another unidentifiable black object about 45 degrees in front and above the triangle, traveling in the same northeast direction. the triangular object was rotating clockwise while travelling forward. the animation of the july 28th sighting in jacksonville, fl, which is on skyscan, is exactly what the larger, triangular object looked like. the objects were moving slowly and not at any type of speed for ascending or descending aircraft normally found in the area. there were no sounds. there were no planes in the sky leaving ft lauderdale int'l airport, nor could it have been a plane in the distance going to\\from miami international, because these objects were within naked eyesight and before the haze diminished visibility. wondering if anyone else saw and if mufon or skyscan wants to contact, please feel free to do so. this is our second ft lauderdale sighting of different objects in the sky sine novemeber 2007."],"Latitude":"26.131538","Case Number":"12057","Sighting Duration":"Undisclosed","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around August 13th 2008"],"files":["/var/www/straped/mufon/html2text/12057.html.txt","/var/www/straped/mufon/org/12057.html"],"Date Submitted":"08/13/2008 08:20 UTC","Object Shape":"Triangle","Tags":"City"}