{"divs":["Sighting Details While watching TV on a very clear, very normal night in rural Missouri a light appeared in my feild of vision. My front door was open so I could clearly see 1 brilliant round amber light hovering silently no more than 20 feet from my house. My entire yard was lit up by the glow from the object. I mean this thing was BRILLIANT! I was stunned but I wanted to know what it was. By the time I slipped my sandals on and looked again, it had moved (silently!) WAY up in the sky. Now all I could see was 9 more identical lights moving in a triangal formation. The most shocking thing was the distance it moved (3-5 miles) in such little time (3 seconds) with no sound what so ever! Back to the triangle formation. The object was made of 10 of these round amber lights, 5 down each side. The unknown object cicled in complete silence for at least 15 minutes before I totally lost site of it. When I saw pictures of the Phoenix lights some time later, I remember thinking \"That's what I saw!!\". Was it the same object(s)? Nobody will ever know. All I know is this really happened and I will never forget it for as long as I live."],"Summary":"1 round amber light ,4 to 5 feet in diameter, hovering in my back yard.","Object Features":"None","Date of the Event":"08/15/1995 09:45 UTC","Object Flight Path":"Hovering then path","Latitude":"38.704461","Tags":"City","Log Number":"US-08132008-0013","trends":["There have been 3 other sightings in Sedalia","There were no other sightings in Sedalia on or around August 15th 1995"],"Case Number":"12056","Date Submitted":"08/15/1995 09:45 UTC","City":"Sedalia","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.704461,+-93.228261(12056)&iwloc=A&hl=en\"> mufon case (12056) map </A>","Region":"Missouri","Source":"MUFON","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Object Shape":"Circle, Triangle","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-93.228261","files":["/var/www/straped/mufon/html2text/12056.html.txt","/var/www/straped/mufon/org/12056.html"]}