{"Summary":"numerouse star like objects circleing and flashing all from same sector","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-113.481932","Date of the Event":"Unknown","Date Submitted":"08/13/2008 10:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.548384,+-113.481932(12058)&iwloc=A&hl=en\"> mufon case (12058) map </A>","City":"Edmonton","Case Number":"12058","Region":"Alberta","Country":"Canada","Object Features":"Unknown","trends":["There have been 70 other sightings in Edmonton","There was one other sighting in Edmonton on or around"],"Log Number":"CA-08132008-0015","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Latitude":"53.548384","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/12058.html.txt","/var/www/straped/mufon/org/12058.html"],"Disposition":"Unresolved","Source":"MUFON","divs":["Sighting Detailswhile smoking outside watching for meteors my son and law and i observed two star like (sattelite looking) objects circle aruond in the sky,one object made a complte circle around the star arcturus(i'm sure it did not circle the actual star but made that motion around the star,a short time later about 10 mins. another object appeared and travelled accross the sky at approximately the same area that the other two objects where when we noticed them without notice this object increased in size and brightness(brighter and larger than jupitor appears in the sky)and trversed the sky at a quickining pace and then fadded out of view behind a cloud,one more object appeared a short while latter and traversed the same sector of ski befor it to dimed and fadded out of sight. my summery: the objects were not sattelites,i checked the international space station web sight and the ISS. was not in view or overhead at that time.i'm sure that many people in edmonton and area saw what we did as the ski was cloudy except where the objects appeared and there was of course the leonid meteor showers that evening so lots of people were looking at the same clear sky where this took place."],"Tags":"City","Object Shape":"Flash, Star-like"}