{"files":["/var/www/straped/mufon/html2text/12059.html.txt","/var/www/straped/mufon/org/12059.html"],"Region":"Colorado","Longitude":"-105.871539","Date Submitted":"08/09/2008 12:00 UTC","Case Number":"12059","Log Number":"US-08132008-0016","Latitude":"37.748758","Tags":"City","Disposition":"IFO","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsI was attending the annual UFO Olympics Conference at the UFO Watchtower sponsored by MUFON this last weekend near Hooper, CO. Camping in my parked car facing east towards the Sand Dunes, I was awake between about 4:30 AM and 5:00 AM on 3 separate nights in succession. Studying the stars and constellations rising in the early morning hours just before dawn I happened to see out of the corner of my eye (facing south) through the open window of my car - a bright orange star-like object I initially took to be the planet Mars, only somewhat brighter. After a few minutes a curious thing happened - This stationary object I thought was Planet Mars started to gradually fade out and disappear! This took about 20 seconds to go from full brightness to a full disappearence. That in itself was not too unusual, as it could have been some object at a high altitude that was reflecting early morning sunlight (before sunrise). I dismissed that sighting as an unexplained anomaly but not too remarkable. But what grabbed my attention was the fact that the same sighting occured the very next night at about the same time (bright Mars-like object) that disappeared gradually. (a repeat of the night before). Watching for it again on the third night, this time (again in a clear sky) it did not appear at all- so I was left wondering and have concluded it was a sighting of an unexplained event. Not very dramatic as UFO's go in general, but still very curious because the two successive sightings did not fit any known object I could relate it to. It may have been reflected sunlight off of a metallic skin craft at very high altitude that had the ability to disappear (in place) without moving, since any craft moving out of the sun's rays would be easily detected. It was definitely not covered by clouds, an earth satellite, an irridium flare, a meteor, a helicopter or any known craft that I can think of. If anyone knows more about what this could have been, please respond. Thank You"],"trends":["There have been 2 other sightings in Hooper","There were no other sightings in Hooper on or around August 9th 2008"],"Object Shape":"Star-like","Viewing Distance":"Unknown","Date of the Event":"08/09/2008 12:00 UTC","City":"Hooper","map":"<A HREF = \"http://maps.google.com/maps?q=37.748758,+-105.871539(12059)&iwloc=A&hl=en\"> mufon case (12059) map </A>","Country":"United States","Object Flight Path":"Stationary","Summary":"Appeared like planet Mars but faded out of sight in a clear sky - 2 Separate nights in succession."}