{"Source":"MUFON","City":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Date of the Event":"08/14/2008 12:00 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.318354,+-85.595284(12066)&iwloc=A&hl=en\"> mufon case (12066) map </A>","divs":["Sighting Details While watching Discovery Channel's presentation concerning foreign objects embedded in subcutaneous areas of the bodies of people claiming alien abduction I noticed something that caused me question. In particular, I'm referring to the sample \"device\" taken from the ankle of a woman in California. Initially perplexed by the three layer makeup of this iron laden object the analysis was finally determined to be a rather small piece of knife steel. I'm sure a knifemaker would love to see a bit of his work testify so well as the characteristics shown by that electron microscope image. However, I doubt that the change from soft steel to hard steel would be that pronounced, but I don't portend any metalurgical degree. Furthermore, I personally don't buy into the idea of alien implants regarless of how much fun it is to watch that stuff. However, I do know a semi-conductor when I see one. The structure of LSIC (Large Scale Integrated Circuit) or single transistor device appears exactly as in that EM Image in as much as both are \"grown\" from the atomic level. I would suggest that the good \"foot doctor\" who has been collecting these artifacts from \"abductees\" not lose hope; he may yet be on to something!"],"Longitude":"-85.595284","Country":"United States","Disposition":"Insufficient Data","Summary":"none","Sighting Duration":"Undisclosed","Log Number":"US-08142008-0007","Viewing Distance":"Unknown","Date Submitted":"08/14/2008 12:00 UTC","Region":"Michigan","Weather Factors":"Unknown","Object Shape":"Undisclosed","trends":[],"files":["/var/www/straped/mufon/html2text/12066.html.txt","/var/www/straped/mufon/org/12066.html"],"Case Number":"12066","Latitude":"44.318354"}