{"Disposition":"Unresolved","Latitude":"48.864174","Sighting Duration":"Undisclosed","City":"Paris","Date Submitted":"08/11/2008 05:15 UTC","Log Number":"FR-08142008-0003","Region":"Île-de-France","Object Flight Path":"Undisclosed","Object Shape":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"08/11/2008 05:15 UTC","Country":"France","Viewing Distance":"Unknown","Case Number":"12062","divs":["Sighting Details(soory for my bas english) hello, I walked on the banks of the Seine River in the late afternoon with my camera. I stop and take a photo of Austerlitz bridge near the Gare de Lyon, I look at the photo that I took, and I noticed an object on the screen. I note his eyes to heaven and sees a kind of device a large, I can not gauge the distance. The time frame for that I take another photo, the object had disappeared. This was neither an airplane or a helicopter or a bird or a balloon. I had time to see that the lower part of the apparatus tournais on itself, regardless of the upper part, which was fixed. I have never seen such a thing, I do not believe in UFOs. A friend who I showed the photo has helped me do research on the internet and I recognized the same purpose that I had seen on an English site, I believe, observed in the USA. They called it \"a drone,\" a kind of surveillance aircraft, but I've never seen a Paris or elsewhere. I can swear that it was amazing, and most incredible is that nobody else has seen the object at the same time as me. The same friend told me not to disseminate the original photo, I have not fully understood, but I would join the photo in small, for the moment ... I'm still excited about what I saw, and I can tell you that I lift his eyes to heaven every day since Monday."],"Longitude":"2.357962","Tags":"City","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=48.864174,+2.357962(12062)&iwloc=A&hl=en\"> mufon case (12062) map </A>","Summary":"UFO PARIS","files":["/var/www/straped/mufon/html2text/12062.html.txt","/var/www/straped/mufon/more/12062_submitter_file1__paris110808.jpg","/var/www/straped/mufon/org/12062.html"],"trends":["There have been 11 other sightings in Paris","There were no other sightings in Paris on or around August 11th 2008","This sighting has never been favorited.",""]}