{"Tags":"City","Object Features":"Unknown","Object Shape":"Circle","Viewing Distance":"Unknown","divs":["Sighting DetailsI haven't been able to sleep for the previos week or so. I have been waking up at 2:00 a.m. and this night I decided to go out and watch the meteor showers. I was staring at the sky and I saw this thing that didn't look like a star or anything I have seen in the sky. I was sitting on my front porch and it was off to the east right out in the open. I see planes go by all the time and this was nothing I've seen before. I kept looking at it and it was pulsing with red and green lights. It moved up and down and sideways but stayed in the same general area. I watched it for a couple hours and it just disapeared in the sky like a flash. I felt almost felt like it knew I was watching it. It was kind of like a tingling feeling. I went out again the next night (Aug. 11th) It was there again doing the same thing. I went out again (Aug. 12th) and it wasn't there. I couldn't stop thinking about what it could be so I kept going back out each night looking for it again. When I first saw it I was curious as to what it was. When it started moving around and pulsing with lights I became frightened. When it took off and disapeared It kind of felt like I was in a dream."],"Latitude":"43.291972","Date of the Event":"08/10/2008 12:00 UTC","trends":["There have been 2 other sightings in Sand Lake","There were no other sightings in Sand Lake on or around August 10th 2008"],"Region":"Michigan","Country":"United States","Date Submitted":"08/10/2008 12:00 UTC","City":"Sand Lake","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"12065","Source":"MUFON","Disposition":"Insufficient Data","Log Number":"US-08142008-0006","Longitude":"-85.517814","map":"<A HREF = \"http://maps.google.com/maps?q=43.291972,+-85.517814(12065)&iwloc=A&hl=en\"> mufon case (12065) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12065.html.txt","/var/www/straped/mufon/org/12065.html"],"Weather Factors":"Unknown","Summary":"It was not a star or a comet. It was large and pulsing with green and red lights."}