{"map":"<A HREF = \"http://maps.google.com/maps?q=33.813807,+-118.152936(12071)&iwloc=A&hl=en\"> mufon case (12071) map </A>","Source":"MUFON","Object Shape":"Unknown","Object Features":"Undisclosed","Region":"California","Log Number":"US-08142008-0012","divs":["Sighting DetailsI was a radioman on the Coral Sea. I was being trained for air traffic control, next logical step for a radioman. It was a Sunday afternoon, which is a good time to train someone because it's slow. At about 2 in the afternoon I saw something on the radar screen about a hundred miles off the coast heading in our direction. I didn't think anything of it. It happens several times a week. Usually it's some civilian who doesn't know where he is. I get on the radio. \"Unidentified aircraft, you are entering a restricted airspace. Please identify and correct course.\" I didn't get a response, which is strange because people usually respond right away when the military calls them. It started making some strange moves that I'd never seen an aircraft make before. It looked like when Bugs Bunny gets hold of the controls of the spaceship. The most interesting move was a sudden stop with a 140 degree turn. My first thought was something was wrong with the equipment: temperature inversion, electrical storm, glitch. Anything can happen to these things. I go through all the checks and everything checks out clear. I try hailing it again and it still doesn't respond. Still trying to be reasonable I thought maybe we had a hot dog pilot doing some things I didn't know about. I'm just a boy from Montana. I call over the chief warrant officer. \"Sir, do we have smothing that does this?\" He looked at the screen and said, \"That's a glitch sailor. Forget about it. That tape will be turned over for further study.\" I said, \"If it's just a glitch then why are you studying it?\" He just glared at me and said, \"Did you ask me a question sailor?\" \"Uh, how do I list this?\" \"Bogie. Period.\" \"Yes sir.\" I had a four hour debriefing on something that officially doesn't exist. \"An unidentified object is exactly that, unidentified. You got that?\" \"Yes sir. Can I go now?\" \"No. Sit.\" \"Yes sir.\" The funny thing is when they said, \"You didn't see it but what did it do?\" Which story did they want me to follow? I had read stories about men in black and threats. I asked them if I could tell anyone about it. Their response was even a little bit scarier than a threat. They said I could tell anyone I want. My story is easy because there is nothing to deny. I asked them what they meant by that. The closest they came to a threat was they said, \"It shouldn't get back to us but if it does, here is our side of the story. It was your first day being trained on some equipment you were unfamiliar with. You something on the screen you didn't recognize. You made a note of it, we looked into it, we had a meeting, you were reassigned to your primary task.\" They don't deny anything. They don't even disagree with anything I say. That's my story."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","City":"Long Beach","Date of the Event":"08/15/1982 12:00 UTC","Latitude":"33.813807","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/12071.html.txt","/var/www/straped/mufon/org/12071.html"],"trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around August 15th 1982"],"Date Submitted":"08/15/1982 12:00 UTC","Summary":"radar image, acting strangely","Country":"United States","Longitude":"-118.152936","Case Number":"12071"}