{"map":"<A HREF = \"http://maps.google.com/maps?q=45.524682,+-122.671887(12073)&iwloc=A&hl=en\"> mufon case (12073) map </A>","Longitude":"-122.671887","Region":"Oregon","Latitude":"45.524682","Source":"MUFON","Summary":"Motionless \"Barrel shaped Object\" hovering, no sound","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["sighting detailsit was a very clear morning, no clouds in the sky. i was getting ready to go to work. i was about to get into my car and happened to look up in the sky toward the southeast. i observed an object about 30-35 degrees above the horizon. the object was motionless and no sound was heard. the object resembled a 55 gallon drum just hanging there.it was about the size of a pencil eraser held at arms length. what struck me about the object, besides it was not moving and there was no noise was the clarity and vividness of color. while the upper portion was dark the lower was a tannish color, but the color was extremely vivid. i watched the object for about 2 to 3 minutes, it did not move. i rushed into my house to alert my wife and get a camera. when i returned outside the object was gone. the image still is vivid in my mind. i am submitting to see if any one else has seen something similar. what reminded me to report this, i was reviewing your files and one incident that occured in new york on 5\\22\\2007, felt like being watched, the one photo reminded me of what i saw, similar shape. a floating 55 gal drum."],"files":["/var/www/straped/mufon/html2text/12073.html.txt","/var/www/straped/mufon/org/12073.html"],"Case Number":"12073","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around May 16th 2003"],"Country":"United States","Weather Factors":"Light","Disposition":"Unknown","Tags":"City","Object Shape":"Cylinder","City":"Portland","Log Number":"US-08142008-0014","Date of the Event":"05/16/2003 07:30 UTC","Object Flight Path":"Stationary","Date Submitted":"05/16/2003 07:30 UTC"}