{"Summary":"Three Light tan colored objects moveing fast and low from west to east.","Object Features":"None","Date of the Event":"08/11/2008 09:45 UTC","Weather Factors":"None, Does Not Apply","Disposition":"Insufficient Data","Country":"United States","Longitude":"-119.745889","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.539011,+-119.745889(12074)&iwloc=A&hl=en\"> mufon case (12074) map </A>","City":"Sparks","Date Submitted":"08/11/2008 09:45 UTC","Latitude":"39.539011","Source":"MUFON","Region":"Nevada","Tags":"City","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","trends":["There have been 23 other sightings in Sparks","There was one other sighting in Sparks on or around August 11th 2008"],"Log Number":"US-08152008-0001","Sighting Duration":"00:00:06","divs":["Sighting DetailsOn the night of August 11th, 2008 Myself and a neighbor were checking out some really neat looking shooting stars, it was that we witnessed two things that looked much like an ordinary star moving along pretty fast, at first I thought they were just perhaps satellites until the one suddenly stopped for a few seconds then started moving in a slightly different direction then it slowed up a bit for maybe two seconds before heading south and disappearing. This was very exciting to watch, about a minute later a second light appeared and was lower in altitude or so it seemed, it came from the south and was heading north was also clipping along pretty fast, just before it was out of sight it made a quick turn to the left. Both of these lights had no strobes or colored aircraft marker lamps. Well needless to say at this point we were very excited indeed. So now we are really looking.... then plain as day a perfectly round flat looking object flew directly overhead quickly, followed by two more of the same looking objects. They were low enough to clearly see that they were not birds or even an owl. They appeared to be a light tan color with no lights and made no sound, the strangest thing of all was the in which they were moving, its a little hard to explain but it almost seemed animated, and yet had a obvious destination in mind. My neighbor and myself are still laughing about how we just about jumped into each others lap. All I could think to myself was WOW, the sky sure is busy tonight!"],"Case Number":"12074","files":["/var/www/straped/mufon/html2text/12074.html.txt","/var/www/straped/mufon/org/12074.html"]}