{"Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.311348","City":"San Jose","Case Number":"12072","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=40.311348,+-89.597703(12072)&iwloc=A&hl=en\"> mufon case (12072) map </A>","divs":["Sighting DetailsMy backyard looks out over a corn field, but a few weeks ago we had some strong winds and some of the corn was knocked down. But a few here and there still stand. I saw what I thought was a plane. North about 12 miles above a hill line that is on Towerline Rd. going to Pekin after the river. I had my camera with me and my binoculars. Through my binoculars I could see a white sphere with green and blue lights, strobing. Coming closer I thought ok a plane but I'll watch it anyway which would be good so I can pick out planes over ufo's. I had come off the back steps and into the yard and I could still see it right above the corn and I was dodging random stalks to keep it in view and I lost it. I took my binoculars down and there it was a whole lot closer to my back yard and higher. It had covered seven miles in a split second. No sound I made sure of that. I looked at it and grabbed my camera , as I brought my camera up it disappeared. Gone. Clouds to the south , clear to the North. Now this is not the first time this has happened this summer. But each one seems to know I'm there and sort of performs for me."],"Date of the Event":"08/11/2008 09:26 UTC","Object Features":"Unknown","Date Submitted":"08/11/2008 09:26 UTC","Disposition":"Unknown","trends":["There have been 4 other sightings in San Jose","There were no other sightings in San Jose on or around August 11th 2008"],"Weather Factors":"None","Object Flight Path":"Other","Object Shape":"Circle, Star-like","Longitude":"-89.597703","Tags":"City","Summary":"bright strobing thought it was a plane but covered about 7 miles and ascended in the blink of an eye","files":["/var/www/straped/mufon/html2text/12072.html.txt","/var/www/straped/mufon/org/12072.html"],"Log Number":"US-08142008-0013"}