{"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Weather Factors":"Unknown","Date of the Event":"01/16/1958 12:00 UTC","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsIt was a round transparent ball with rainbow stripes and a star in the center. It had thin lines on the surface that looked like cheeze clough. The outline of the object was clear and distenct, not blured like the photos. The ring was snug against the ball and looked like solid bronze. The ring was very flat and smooth. There were very large dark areas on the ssurface of the ball that changed size as it moved. I was a 5 year old boy sitting in my back yard playing with my toy cars and facing North. The groung started to sparcle and make a fant beeping sound. Then I felt something very hot on my back. It felt like a hot 3 inch pipe was right behind me, I turned to see what it was and I saw the object in the sky. It did not seem to be moving so I went back to playing with my cars. I looked again a little later and it was higher in the sky. It slowly went under then over the Sun and came back down near where it came up. It passed down behind a telephone pole about 10 feet from me and it extended beyound bouth sides of the pole at once. I did not think much of the object because it was moving so slowly. PS. Los Angeles is off Catilena Island."],"Object Shape":"Saturn-like, Star-like","Region":"California","City":"Los Angeles","Tags":"City","Longitude":"-118.405588","Case Number":"12075","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around January 16th 1958"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/12075.html.txt","/var/www/straped/mufon/org/12075.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.284709,+-118.405588(12075)&iwloc=A&hl=en\"> mufon case (12075) map </A>","Log Number":"US-08152008-0002","Latitude":"34.284709","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Same as Almirante Saldanha sighting","Date Submitted":"01/16/1958 12:00 UTC"}