{"Object Flight Path":"Path with directional change","Weather Factors":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/12085.html.txt","/var/www/straped/mufon/org/12085.html"],"Case Number":"12085","Date of the Event":"08/12/2008 04:45 UTC","Summary":"Fast mobile flying star like object","City":"Azle","Sighting Duration":"00:20:00","Log Number":"US-08152008-0012","divs":["Sighting DetailsArrived at Cresson, Texas Oil Field Yard at 4:45am. I was waiting for a pump truck due to my job description in the oil business. I decided to drop the tailgate portion of my truck and relax in the bed of the truck and look at the stars while waiting for the other pump trucks to arrive. There was no visible light in the area to due the place being in the middle of the country, so the sky was clear and you could see numerous stars in the sky along with typical constellations. As I observed the night sky for a duration of approximately 2 minutes, when all of a sudden one star in particular, started to move westward at a slow rate. After a minute and 30 seconds passed, the object began to move in the zig-zag like movement in the same direction, and came to a stop after 2 minutes. The object was stationary for about 5 minutes, then it started moving in a straight line in a westward direction. After the initial movement again, is proceeded to make a 180 degree turn in the opposite direction in a semi circular like fashion and proceeded to continue in a east direction for 2 in a half minutes, almost to where it initially was to begin with. At this time, the pump trucks had arrived and my star gazing was interrupted, as I had to continue on with my work day. I wanted to write this to inquire about any other sightings of this event. I also covered up one eye to view it with the opposite in order to dispel any forms of an optical illusion."],"Object Shape":"Star-like","trends":["There have been 3 other sightings in Azle","There were no other sightings in Azle on or around August 12th 2008"],"Viewing Distance":"Over One Mile","Source":"MUFON","Longitude":"-97.544676","map":"<A HREF = \"http://maps.google.com/maps?q=32.904206,+-97.544676(12085)&iwloc=A&hl=en\"> mufon case (12085) map </A>","Disposition":"Unknown","Latitude":"32.904206","Object Features":"Unknown","Region":"Texas","Tags":"City","Date Submitted":"08/12/2008 04:45 UTC"}