{"City":"Perrysburg","Date Submitted":"08/15/2008 02:05 UTC","Sighting Duration":"00:05:00","Case Number":"12080","Log Number":"US-08152008-0007","Summary":"Strange red and white shaped object in Northwest Ohio","Date of the Event":"08/15/2008 02:05 UTC","Latitude":"41.566686","trends":["There have been 3 other sightings in Perrysburg","There were no other sightings in Perrysburg on or around August 15th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/12080.html.txt","/var/www/straped/mufon/org/12080.html"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Blimp, Star-like","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-83.619887","map":"<A HREF = \"http://maps.google.com/maps?q=41.566686,+-83.619887(12080)&iwloc=A&hl=en\"> mufon case (12080) map </A>","divs":["Sighting DetailsIt was at approximately 2 am Eastern Time on August 15, 2008 as I was driving home from work. I had just left the town of Perrysburg heading east on Rte. 795 when I happened to glance up at the sky, as it was a full moon out and a storm had just passed. I was checking to see if there were any more dark clouds when all of a sudden, off in the direction of the northeast, I saw what I originally thought was a cluster of three stars, placed close together in a straight line. This had piqued my curiosity because I had never seen anything like that before. I continued to drive, periodically glancing up at the sky and noticing that the object did not move. It remained in my field of vision for about 6 miles until I turned off the highway onto an exit ramp. I continued to look at the object through the rearview mirror as I was now heading south down a country road. As I pulled into the subdivision that I lived in, I happened to look back to the northeast- but instead of the three star-like objects, there appeared a large object, shaped almost like a blimp, with five or six white lights making the outline of the object and three red lights in the center of the white ones. I followed the object as it moved east to west at what I would guess to say would be about 50 miles per hour had it been traveling on the ground. I lost sight of the object as it passed over the nearby train yard on the other side of the road, as my view of the sky to the west is obscured by the trains and a grove of trees nearby."],"Object Features":"Unknown","Region":"Ohio"}