{"Country":"Germany","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Object Shape":"Egg, Saturn-like, Sphere","Weather Factors":"Unknown","Viewing Distance":"Unknown","Tags":"City","Log Number":"DE-08152008-0008","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Darmstadt","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/12081.html.txt","/var/www/straped/mufon/more/12081_submitter_file2__CIMG5517.JPG","/var/www/straped/mufon/more/12081_submitter_file3__CIMG5520.JPG","/var/www/straped/mufon/org/12081.html"],"Case Number":"12081","Object Features":"Dome","Longitude":"8.651762","Summary":"Two UFOs slowly flying on the sky.","divs":["Sighting DetailsTwo Japanese friends and me were walking along the sidewalk of Landgrafgeorgstrasse, near Jugendstilbad. One of the Japanese friend sighted something in the sky that looks like an UFO. I said it could be an aeroplane, but she said aeroplane does not travel so slow. We noticed a flying object flying steadily and gently from west to east across the sky. It has a large mild orange light at the rear end, covering the whole rear-bottom part of the body. About ten seconds later we sighted there are actually two of them, seemingly identical, one followed another. Their separating distance is about 20 of themselves. They travelled in the same fashion. We were surprised. I felt very comfortable and peaceful with the calm way they are moving. I took a couple of pictures and a video with my digital camera. Because it was too dark and I was zooming in to capture them, and because they were already moving away from us while I am taking, the picture may not be in very good quality. While we had sighted the UFO, I also asked two persons standing at the entrance of a bar if it is a UFO. They seemed not to believe so. Also, there was a man walking behind us and he also took some pictures of them. We lose sight of the objects when they travelled away from us and disappear behind the clouds in the sky, just like an aeroplane. I would like to know if they really are UFOs. If not, I am interested to know what they are actually."],"Date of the Event":"07/20/2008 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.877648,+8.651762(12081)&iwloc=A&hl=en\"> mufon case (12081) map </A>","City":"Darmstadt","Date Submitted":"07/20/2008 02:23 UTC","Region":"Hessen","Latitude":"49.877648"}