{"Sighting Duration":"Undisclosed","Date Submitted":"08/14/2008 04:00 UTC","Source":"MUFON","City":"North East from Redondo","Log Number":"US-08162008-0001","Date of the Event":"08/14/2008 04:00 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/12088.html.txt","/var/www/straped/mufon/org/12088.html"],"divs":["Sighting Details Truly dont know what I saw. I was walking my dog in what we call the 'green belt' down by the power lines. There is a small bike path there. As we were walking, too ladies and a small dog were walking the other way and talking to each other in spanish. I thought they were looking at me and Tyler my pup, but they were looking at the sky. I walked past them, smiled and crossed the street. I looked back at them and then and looked up to see what they were staring at. Thats when I saw it. Two discs that seemed to hover and at the same time, \"flip\" slowy end over end. Scale would have been the size of a small car in my opinion, slightly larger possibly. They seemed to just hover and move horizontal to each other in oposite directions. One seemed to leave rather quickly. I basicly looked at my dog, looked back up and one was just gone. The other one seemed to move slowly up and away, moving northeast until it was gone about 10 seconds. I took note that there were clouds but not anywhere near these things. They were absolutley not planes, balloons, blimps, helicopters or anything else I've ever seen... and not sure where to report something like this. All I can say is that they were clearly round. Clearly there. Clearly hovering... and clearly nothing I have ever seen in my life. Any ideas?? -Dave"],"Object Flight Path":"Hovering then path","Object Shape":"Circle","Case Number":"12088","Region":"California","Latitude":"36.783841","Longitude":"-119.414512","Summary":"two 'fliping' silver/white discs. Hovering for 15 mins and then gone...","trends":["There have been no other sightings in North East from Redondo","This sighting has never been favorited."],"Weather Factors":"None","Object Features":"None","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.783841,+-119.414512(12088)&iwloc=A&hl=en\"> mufon case (12088) map </A>","Tags":"City"}