{"Country":"United States","trends":["There have been 14 other sightings in New Haven","There were no other sightings in New Haven on or around November 30th 1984"],"divs":["Sighting DetailsI lived in New Haven, Connecticut on Prospect street at the time. I was just about to get into the shower when there was a terrible banging on the door. I was told to get outside quickly. I rushed outside and a family friend who had left our home shortly before, saw this in the sky while driving home & rushed back to our home. He thrust his finger into the air \"LOOK!\" There just above the 20ft tall pines, in the sky was an object about the size of a football field. It was massive and so low to the ground, if I were in the tree, I am sure I could have touched it! It seemed to glide over us, slowly. All the way around the perimeter of the object, there were multicolored lights, these lights were not bright to look at, I mean they seemed to have a haze over them, so that even though the UFO was so close, it did not hurt your eyes to look directly at them. It was the most amazing thing I have ever seen in my life. It made a deep but not terribly loud hummmmmmmm. I have never heard that sound before or again, it was captivating. I could hear neighbors yelling in the streets, it was clear that many were witnessing this. After it had passed, I ran into the house to the second floor and looked out the window but could no longer see it, far in the distance I could see white lights, several but could not distinguish what they were. I have told my story only to family. I was just 14 at the time. Every time I hear about a UFO sighting (there was a recent event in CT witnessed by dozens)I am not skeptical, I KNOW they exist."],"Weather Factors":"Unknown","Date Submitted":"11/30/1984 12:00 UTC","Date of the Event":"11/30/1984 12:00 UTC","Log Number":"US-08152008-0010","Case Number":"12083","Tags":"City","City":"New Haven","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unknown","Object Features":"Undisclosed","Region":"Connecticut","Longitude":"-72.924548","map":"<A HREF = \"http://maps.google.com/maps?q=41.309563,+-72.924548(12083)&iwloc=A&hl=en\"> mufon case (12083) map </A>","Summary":"Sighting in New Haven","Object Shape":"Circle, Disc","Object Flight Path":"Undisclosed","Latitude":"41.309563","files":["/var/www/straped/mufon/html2text/12083.html.txt","/var/www/straped/mufon/org/12083.html"]}