{"Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12099.html.txt","/var/www/straped/mufon/org/12099.html"],"trends":["There have been 7 other sightings in Fortville","There were no other sightings in Fortville on or around August 16th 2008"],"Date Submitted":"08/16/2008 05:04 UTC","Country":"United States","Case Number":"12099","Date of the Event":"08/16/2008 05:04 UTC","Object Shape":"Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=39.936452,+-85.843125(12099)&iwloc=A&hl=en\"> mufon case (12099) map </A>","Source":"MUFON","Weather Factors":"None","Region":"Indiana","Log Number":"US-08162008-0012","Latitude":"39.936452","Longitude":"-85.843125","Viewing Distance":"Unknown","Disposition":"IFO","Object Flight Path":"Undisclosed","Sighting Duration":"00:01:30","divs":["Sighting DetailsIndiana; Hamilton County, Southeast. 5:04 pm local time. I was outside relaxing and watching birds and planes with my binoculars. Magnification 16x. A large wide body jet with 4 engines on the wing and a back swept rear tail passed overhead. I was watching it move overhead with my binoculars. After this jet passed from north to south I noticed another jet passing from west to east across the prior jets path. I started watching it with my binoculars. As this second jet moved, I noticed a dark spot directly above it that was hovering. Thinking it was another plane I watched to determine its direction. As I watched I could see a bright center on the object which was not moving laterally in the sky but appeared to be getting larger or descending toward me. As the image became larger I could see the sun reflecting off of its silvery side. It was cylindrical shaped. On the bottom of the cylinder was a very bright aqua-blue to blue \"spot-type\" light. Because the cylinder was getting large enough to film, I quickly went into the house to get my video camera (as the object was getting larger and apparently heading toward me). It took no more than 60 secs to get the camera and return outside. Unfortunately, the object was gone. I looked all arround and no object was visible. I felt like it was reading my mind and became camera shy? Wow, go figure. I really wish I could have gotten a video of it. I'll keep watchin........"],"Summary":"Descending Silver Cylinder with Aqua-Blue spot light on bottom","City":"Fortville"}