{"Object Flight Path":"Stationary,Hovering then path","Object Shape":"Triangle","Summary":"I suddenly became aware of a very large object hovering overhead that made an electrical humming sound","Region":"California","files":["/var/www/straped/mufon/html2text/12101.html.txt","/var/www/straped/mufon/org/12101.html"],"Viewing Distance":"101-500 Feet","Tags":"City","divs":["Sighting DetailsWhile attending a Calvin Simmons concert at the Concord Pavilion in August of 1982, (we were seated on the grass), I felt an urge to look up, and when I did, I saw a very large triangular object hovering motionless immediately overhead. There were no lights on the object, it was gray in color, the bottom surface appeared to cover a maze of pipes or something, and it made a ocellateing sound, something similar to an electric motor. I immediately thought of something that was other worldly. It was not a plane or helicopter, it was the largest thing I have ever seen in the sky, other than moons or planets. It scared me and when I spoke of it to the lady I was with, She said with a calmness that upsets me now when I think of it, \"don't get excited.\" Those words chilled me, and I sat back down and looked up again immediately, and the object just flew away without making another sound, and It was gone in an instant. What is even more disturbing, is the fact that my lady friend and I never spoke of the incident, not to this day. In fact we hardly spoke at all that night, not during the concert, or the long ride home to San Francisco. I forgot about what happened for years. When I remembered and mentioned it to friends, I was generally laughed at, so I stopped talking about it. For some time after that concert, I would awaken with bruses on my arms, and I would have strange recurring dreams of being half awake, with someone in my bedroom (by this time I was separated from my lady friend). I never saw or spoke with anyone or anything, and no one spoke to me that I can recall, yet when I would wake up, I had the distinct feeling that someone or something had been in my home, and I had no explanation for the bruises on my arms. The bruises were shaped like someone with very strong fingers had been holding my arms very tightly. It has been several years since I have found any bruises on my body, but I have had the feeling that someone or something has been in my bedroom while I was sleeping during the past two years."],"Sighting Duration":"Undisclosed","Case Number":"12101","Date of the Event":"08/19/1982 12:00 UTC","Weather Factors":"Unknown","Log Number":"US-08162008-0014","Object Features":"Patterned Surface","Latitude":"37.984558","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.984558,+-122.025903(12101)&iwloc=A&hl=en\"> mufon case (12101) map </A>","trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around August 19th 1982"],"City":"Concord","Source":"MUFON","Date Submitted":"08/19/1982 12:00 UTC","Country":"United States","Longitude":"-122.025903"}