{"files":["/var/www/straped/mufon/html2text/12105.html.txt","/var/www/straped/mufon/more/12105_submitter_file1__Cimg2300_Crop.jpg","/var/www/straped/mufon/more/12105_submitter_file2__Cimg2304_Crop.jpg","/var/www/straped/mufon/more/12105_submitter_file3__Cimg2305_Crop.jpg","/var/www/straped/mufon/more/12105_submitter_file4__Form8Humphries.jpg","/var/www/straped/mufon/org/12105.html"],"Longitude":"-82.395364","Case Number":"12105","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around August 17th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"08/17/2008 12:30 UTC","Tags":"City","Source":"MUFON","divs":["Sighting DetailsAt 12:30am on Sunday morning my husband and I were ready to go to bed. He was laying downstairs on the couch and I went ahead upstairs to let our 2 dogs out. There was what seemed to be a full moon, although it may have acutally been the full moon the night before. Either way, it was very bright out. It was a clear and cool morning in Licking County (Newark, OH) and I was looking, as I usually do when I let the dogs out before bed, out into the night sky. I usually scan the sky and star gaze while waiting for the dogs to return. Because of the clear and cool weather I stood with the door open. Our property has an unobstructed view of the sky except for a row of pine trees on the east that separates us and our neighbors. Through the opening in the trees I notice a bright light. It was so bright it caught my eye and I looked towards it. At first, I thought it was a plane and took a double take to see which way it was headed, yet it didn't move. I thought it looked to bright to be a star, and it was then I stepped out to investigate further. Upon stepping onto the back patio, I moved to where the pine tree line was no longer interfering in the line of sight. At this point a bright flash came off the object and I could see very clearly red, white and blue lights rotating on what seemed to be a disc like object. Unable to believe what I was seeing, I ran back in and shouted down to my husband to come up. I told him to look up in the sky and tell me what he saw. About 20 minutes had elapsed at this point and the object was spinning and flashing, but it didn't move until my husband appeared. At this point, approximately 1 am, the object began quickly zig zagging back and forth in the sky and it would then stop briefly and hover. My husband when inside to get a camera and a telephoto lense to see if we could see it closer. During the 3 minutes or so while he was away, there were three streaks of light. Two streaks of light seemed to \"drip\" off the object. There was about ten seconds between each drip. They fell straight down and then about 5 seconds after the second drip straight down, another shot off the right side of the object. I shouted for my husband to hurry back. He came running out and held the telephoto lense up on the camera for us to look through--but he couldn't get the full charged camera to work. The lenns did make the shape of the object and the colors even clearer. I was stunned at what I was seeing. I am definately a skeptic. I've always believed there is something perhaps we can't explain and thought there may very well be someplace in the vastness of this universe or another that something may exist. But never EVER in my wildest dreams did I think I'd bare witness to it! My husband on the other hand was thrilled, as he is quite a believer in UFOs. I honestly was sure when I originally called him up that he was going to tell me it was a plane or have some other logical explaination because I just couldn't believe what I was seeing was real. We both quickly realized there was no other explaination. He tried to take photos of the object while I continued to watch it. Until approximately 1:30am, this object stayed relatively stationary apart from the odd zig zag pattern. Then about 1:40 am there was a point of light travelling out from behind our neighbors to the North's tree line--approximately 1000 feet from where we were standing. It moved upwards and sideways to the Northeast towards the first object we'd seen. It took approximately 30-40 minutes to reach the first object. The second object we dicovered up looking through the lens was also flashing red white and blue. Once it got within what seemed like a fingers width (from where we were orientated) there was a bright flash and they were both gone. I watched stunned and shocked at what I'd just seen and how long it lasted. With being a skeptic, I wasn't sure if what I'd just seen was a normal sighting or something quite extraordinary since it lasted so long. Either way, for me personally, it was extraordinary, because I would have never thought such a thing would happen to me. I definately didn't feel scared. I was more curious and like I said, shocked, to believe this was actually what I thought it was."],"Region":"Ohio","Object Shape":"Disc, Flash","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"Strangeness in the Northern Sky","Latitude":"40.06537","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.06537,+-82.395364(12105)&iwloc=A&hl=en\"> mufon case (12105) map </A>","Log Number":"US-08172008-0002","Disposition":"Unknown","City":"Newark","Date Submitted":"08/17/2008 12:30 UTC","Object Features":"Unknown"}