{"Object Shape":"Unknown","Case Number":"12107","Viewing Distance":"Unknown","Latitude":"51.543764","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/12107.html.txt","/var/www/straped/mufon/org/12107.html"],"Log Number":"GB-08172008-0004","Tags":"City","Object Flight Path":"Undisclosed","Date of the Event":"08/17/2008 11:15 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.543764,+-1.769514(12107)&iwloc=A&hl=en\"> mufon case (12107) map </A>","Summary":"M4 Wiltshire: Large white UFO flying in undulating manner which disappeared suddenly without trace.","Country":"United Kingdom","Sighting Duration":"Undisclosed","Region":"","City":"Swindon, Wiltshire UK","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was driving westwards along the M4 motorway approaching the Membury Services just west of Swindon, Wiltshire, UK. This is edge of UK crop circle country. As the motorway dipped down I saw directly in my line of sight in the sky ahead a large white object. The object was flying as if it was flapping, or undulating, a bit like a Manta ray might swim underwater, and was following a slightly erratic path, not direct. It did not have flapping wings, rather the object itself seemed to be undulating. It was a long way away (a mile maybe) but was quite clearly visible so must have been very large, about the size of a passenger plane. It was travelling horizontally at about the same speed as a plane from south to north ie from left to right across the motorway. I remember thinking that I must keep my eyes on the object because I felt it was just going to disappear, and I wanted to be actually looking at the object at the time that it disappeared. I watched it for about 10 seconds before it did vanish very suddenly, leaving no trace behind or any indication of where it had gone. There was a thick bank of high level cloud, but the object was flying below this, and there were no individual clouds beneath the bank for it to fly behind. It just vanished. The most significant thing about this UFO sighting for me was the manner of flight, ie the undulating motion, together with its sudden disappearance."],"Date Submitted":"08/17/2008 11:15 UTC","trends":["There have been no other sightings in Swindon, Wiltshire UK","This sighting has never been favorited."],"Longitude":"-1.769514"}