{"Latitude":"-21.094072","trends":["There have been no other sightings in Boa Esperança","This sighting has never been favorited."],"Weather Factors":"Unknown","Summary":"I saw the UFO and I shot it.","Log Number":"BR-08162008-0013","Longitude":"-45.574572","City":"Boa EsperanÃƒÂ§a","files":["/var/www/straped/mufon/html2text/12100.html.txt","/var/www/straped/mufon/more/12100_submitter_file1__UFO1.jpg","/var/www/straped/mufon/more/12100_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/12100.html"],"Country":"Brazil","map":"<A HREF = \"http://maps.google.com/maps?q=-21.094072,+-45.574572(12100)&iwloc=A&hl=en\"> mufon case (12100) map </A>","Tags":"City","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Date Submitted":"05/25/2008 05:58 UTC","Sighting Duration":"00:00:34","Object Features":"Undisclosed","Case Number":"12100","Region":"Minas Gerais","divs":["sighting detailsi'm the president of brazilian ufology center in brazil. the picture and the footage was made by luis braga who sent it to me. i also interviewed him. he told me this fact. i'm an amator photographer. i was waking up early and it was still dark because i would like to take the picture of the borning sun. i was with my camera with me. when i was leaving my house i just saw a strange object andi started to shoot it. i made three pictures and than i turned my camera to video to try to do a footage. those are the pictures i have and the footage. the object speed was realy fast. more than 1.500km\\h. the object trajectory was not a line. it was almost a line, but it did some turns. the object wasn't to high. it n the same position like a plane in the sky. my sight had 34 seconds. 12 seconsds is my footage, and the rest of the time i used to make the pictures. please, see attached the film and the footage. i really would like to know if i shot an ufo. can you help me. in the footage all you can here is my breathing and the chicks i have in my back yard. now i'm asking mufon opinion in this case. can you help us in brazil. our website is http:\\\\www.cubbrasil.net say hi to my friend mr. james carrion. all the best, milton frank brazilian ufology center president"],"Disposition":"Unresolved","Date of the Event":"05/25/2008 05:58 UTC","Source":"MUFON"}