{"Disposition":"Insufficient Data","Object Shape":"Circle, Disc, Sphere","Sighting Duration":"Undisclosed","Tags":"City","Country":"Canada","City":"Sarnia","Source":"MUFON","divs":["Sighting DetailsSitting in Sun Porch, facing SSW having a cigarette with the common law partner. We both noticed a bright orange to yellow light moving slowly in NNE direction. A bright orange yellow lighted spherical flying object no more than 1200 feet above ground when first observed, and absolutely no sound whatsoever, that made an abrupt change in direction to turn to the ESE and speeded up in a rapid climb until faded out of sight. Observed by both of us and the next door neighbour. This is second sighting, the first being Ausgust 3, 2008 at 10:16PM. At the time of this first sighting, I had a distinct feeling and impression that I would see it again. This second sighting was not as exciting as the first because of my expectation. Difference this time is that at least 3 people observed this object. After object turned to ESE, there was a fairly rapid rate of climb to over 7500 feet above ground and faded quickly into the distance above a tree. Line of sight and height of tree used to estimate height above ground when object faded from view."],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Date Submitted":"08/16/2008 09:40 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"12103","Region":"Ontario","Latitude":"42.99237","Log Number":"CA-08162008-0016","Date of the Event":"08/16/2008 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.99237,+-82.35224(12103)&iwloc=A&hl=en\"> mufon case (12103) map </A>","Object Features":"Other","Longitude":"-82.35224","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around August 16th 2008"],"files":["/var/www/straped/mufon/html2text/12103.html.txt","/var/www/straped/mufon/org/12103.html"],"Summary":"Bright yellow-orange at first, then white orange circular disc/oval shape with south-southwest to north-northeast trajectory with abrupt right turn to ESE to disappearance,"}