{"Date Submitted":"07/15/2008 09:30 UTC","trends":["There have been 2 other sightings in Tbilisi","There were no other sightings in Tbilisi on or around July 15th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/12115.html.txt","/var/www/straped/mufon/more/12115_submitter_file1__IR08Range720080715-Objectinskybackgroundandsubsequentphotos.JPG","/var/www/straped/mufon/more/12115_submitter_file2__IR08Range720080715-Objectinskybackgroundandsubsequentphotos(2).JPG","/var/www/straped/mufon/org/12115.html"],"Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=41.712591,+44.799628(12115)&iwloc=A&hl=en\"> mufon case (12115) map </A>","Tags":"City","Latitude":"41.712591","Log Number":"GE-08182008-0005","Weather Factors":"Unknown","Date of the Event":"07/15/2008 09:30 UTC","Region":"Tbilisi","City":"Tbilisi","Object Shape":"Cigar, Unknown","Disposition":"Unresolved","Summary":"There was no \"event\"","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsFor the record, I wasn't even \"UFO hunting\". I'm not even sure of the photo I have... It was hot, very hot that morning and colleagues of mine were conducting a training exercise for some US Army National Guard, US Marines, and Republic of Georgia Military forces at a range nearby to Vasiani Airbase, Republic of Georgia. I was in fact focused on the training at hand and was using my camera as a training aid to point out potential strengths and weaknesses of any particular units maneuver techniques. This all goes very well and I end up with roughly 200 photos or so over the course of a week and a half. (Yes, this was just prior to the little spat between Georgia and Russia - we were complete with training only 3 days prior to the whole fanfare...) These photos fly home with me to Germany where I am stationed and I think little of them, planning to discard the photos that didn't turn out so well and toss the rest in a folder on a hardrive for historical records. While reviewing the photos, I come across one in particular with what appears to be a blemish on the lens (it may yet turn out to be that, but read on...) Thinking that the lens must have had a dirt smudge or something on it, I scan through to the next few photos in that set and find nothing out of the ordinary. So I go back to this blemished photo and begin to analyze what I am seeing. The picture was taken from a Canon PowerShot SD1000, 7.1 Mpix. at maximum resolution (I have a 2GB storage card, so who cares how big the photos are...I like the detail). This allowed me to zoom in and at least try to see if any more detail could be revealed. Of course, I was disappointed to see nothing but a gray cigar shaped blob with a samll roundish bulb above and below its shape. Zooming out from the photo, you will se that the foreground is clear and in focus but this object is still fuzzy. I swear to myself that it must have been a bug or something crossing the FOV, but wouldn't it be a little clearer in focus? Or maybe it is in the background but moving so fast that it is out of focus? I'm not sure. I will rule out low and slow aircraft because the area you see in the picture is a \"Live fire range\" (shooting range) and forthe Army, firing live ammo is not allowed when the potential to harm is evident. So this area has been given a green light be the powers that be for us to conduct training with live ammunition. this means...you guessed it...nothing downrange (that we know of). Anyway, you have a look at it, disseminate it, spread it around. A few questions come to mind when I look at this: If it is far enough away to be blurry, just how big is it? If it isn't far away, why then is it blurry? It looks close, but there is no shadow cast. I've lived in a desert for nearly 7 years and I understand how distances can be deceptive - but if this thing is maybe 5-10 miles (my somewhat educated guess) it has to be huge and moving very swiftly (and silently) for no one to take any particular notice. I try to be a skeptic about photos, but as I took this one myself, I have trouble believing what I am seeing. Let better minds than mine come up with an explanation. I want to think \"spacecraft\", but the little voice is saying \"bird\"... Included are photos of area taken seconds apart (all three are part of the set) Thanks Glen Currier SFC US Army"],"Object Flight Path":"Undisclosed","Country":"Georgia","Case Number":"12115","Viewing Distance":"Unknown","Longitude":"44.799628"}