{"Tags":"City","Summary":"Shape of a plane but no wings just a bright light that went brighter for two min then went back to reg light.headed north no noise. Big no extra lights.when it got brighter it went star like","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=36.754257,+-119.763106(12116)&iwloc=A&hl=en\"> mufon case (12116) map </A>","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"00:04:00","Latitude":"36.754257","Date of the Event":"08/18/2008 09:45 UTC","Object Flight Path":"Path then hovering","Object Shape":"Other","Country":"United States","Date Submitted":"08/18/2008 09:45 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12116.html.txt","/var/www/straped/mufon/org/12116.html"],"Longitude":"-119.763106","City":"Fresno","Case Number":"12116","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around August 18th 2008"],"Object Features":"None","divs":["Sighting DetailsI was on the computer and had a feeling to go outside,which I look for things every night I asked my husband to come ouy with me which he does but this time I told him he didn't have to but like a good husband he came out.We went out to the back yard I looked up didn't see anything so I went out further and then a plane went by and we heard that, then this bright light the size of a plane but no wings went over closer than the plane no noise then as we were looking it just got so bright like when a star shines it just went bigger with the bright light and was so bright then it went back to just a bright light no extra colors was long it headed north and then it disapeared as it went north.It was faster than a plane not like a jet nor a helicopter cause we see these all the time cause we live close to the airport.I thought at first it was a plane but no colored lights my husband told me that all this time he thought I was crazy going out to look up but now he believes we saw a ufo. We have seen the spacestation, this was closer much closer. What made us think it was a ufo was because when it went brighter it stopped and just stayed there for a few seconds maybe a minute.We are just so shocked and thrilled at the same time.I was hoping that it would come back so stayed outside for awhile then went in and went to bed.I hope other people saw it. It was strange it happened at 9:45pm August 18 2008.Please check this out as my husband said I should report it to the police but I was kinda stupid saying I would wait for someone else to report it first."],"Weather Factors":"None","Log Number":"US-08182008-0006"}