{"Source":"MUFON","Object Features":"Unknown","Date of the Event":"08/17/2008 09:40 UTC","trends":["There have been no other sightings in Knoxville","This sighting has never been favorited."],"Tags":"City","Viewing Distance":"Unknown","Latitude":"40.908372","Region":"Illinois","Disposition":"IFO","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/12110.html.txt","/var/www/straped/mufon/org/12110.html"],"divs":["Sighting DetailsI was taking the dog out for her last bathroom run in the back yard. When I turned to the south to go back in I noticed the light over roof of the house. I am familiar with the night sky in my area and this was a new light in the sky. Even with my vision, I could notice it was flashing red, green, white. I took the dog back in and got my binoculars and continued to view the object. I went in the house and had my wife come to look at it. She saw it as well. After she left I continued to observe it for another 20 minutes. Intermittent cloud cover moved in and obscured the stars, but the object was still visible. It was apparently below cloud level. After watching for another 15-20 mins. the light suddely vanished. I waited until a break in the clouds and located the surrounding stars, but the flashing light was gone. The light was approximately 25-30 degrees above the south horizon. It was below and west of the bright planet approximately 40 degrees above the south horizon. The flashing light was not as bight as the planet or the full moom, but bright enough to stand out and be seen by me. There are no towers with flashing lights in that part of the sky."],"Weather Factors":"Unknown","Log Number":"US-08172008-0007","Longitude":"-90.284848","City":"Knoxville","Case Number":"12110","Sighting Duration":"Undisclosed","Date Submitted":"08/17/2008 09:40 UTC","Country":"United States","Summary":"Stationary, bright light flashing red, green, white","map":"<A HREF = \"http://maps.google.com/maps?q=40.908372,+-90.284848(12110)&iwloc=A&hl=en\"> mufon case (12110) map </A>","Object Flight Path":"Stationary"}