{"Case Number":"12112","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around August 10th 2008","This sighting has never been favorited.",""],"Log Number":"US-08182008-0002","Object Features":"Undisclosed","Object Shape":"Circle","Date Submitted":"08/10/2008 07:30 UTC","files":["/var/www/straped/mufon/html2text/12112.html.txt","/var/www/straped/mufon/more/12112_submitter_file1__IMG_0961.JPG","/var/www/straped/mufon/more/12112_submitter_file2__IMG_0958.JPG","/var/www/straped/mufon/more/12112_submitter_file3__IMG_0946.JPG","/var/www/straped/mufon/org/12112.html"],"Longitude":"-89.39973","Summary":"Completely stationary & silent metallic ring located above tree-line in Madison neighborhood park.","divs":["sighting detailsspotted an aerial stationary ring around 7:30-7:35pm driving via madison belt-line (route 12) heading north between old sauk rd. & greenway blvd. exits. the object piqued our curiosity enough to track it down. we drove through the nearby neighborhoods to locate a \"source\" on the ground and came upon a small neighborhood park (wexford park, madison, wi) where we parked almost directly beneath the object. we parked past the turn-around on the corner of n. westfield rd. & sawmill road facing north\\northwest. the object was metallic in color, totally stationary and silent. it's metallic surface was darker in color and kind of shiny with the setting sun reflecting off on some parts. we looked around the general area where there were a few kids on bikes that rode by and seemed to not notice anything out of the ordinary. we thought it had to be some kind of kite or balloon but could not see any strings. after taking several photographs and with the lack of any attention we decided to leave. we hadn't thought much of the sighting since until recently after sharing photographs with family. this evening we were then directed to view a similar object from sweden via a youtube video (http:\\\\www.youtube.com\\watch?v=khyrgnp_uvk) which exhibits the exact same stationary behavior (the vehicle and video camera move but the object remains completely stationary), no visible source above, below or to the sides of the object. we have a total of 19 photos of the object. the photographs show some slight angle differences which is due to moving the vehicle or to shifting inside of the passenger seat of the vehicle. we're now kicking ourselves after seeing the sweden video since we left the object and didn't return to take video or use a better camera to document (we used the iphone built-in camera)."],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","City":"Madison","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=43.076442,+-89.39973(12112)&iwloc=A&hl=en\"> mufon case (12112) map </A>","Country":"United States","Latitude":"43.076442","Tags":"City","Region":"Wisconsin","Date of the Event":"08/10/2008 07:30 UTC","Source":"MUFON"}