{"City":"Bellefonte","Date Submitted":"08/15/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/12117.html.txt","/var/www/straped/mufon/org/12117.html"],"Summary":"Two big clouds, one smaller than other.The lights some times came out bommerang colors and just shot out","Object Shape":"Boomerang, Other, Unknown","Log Number":"US-08182008-0007","Region":"Pennsylvania","Object Features":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"12117","Weather Factors":"Unknown","divs":["Sighting DetailsI had just came from seeing my fiance's at super break (between 8pm-9pm on Friday 15th of August 2008) on the bypass 220 coming from State College, PA to Bellefonte. Going on 220 is where I saw it. Well the sky was clear and it was starting to get dark but you could still see all of the sky. There was two clouds where one was bigger than the other on top of this lime plant close to Pleasant Gap. I really did not think nothing about it. I thought maybe it was lightening but I noticed it did not move. On top of it not moving, it also started to shoot colorful lights from it like a boomerang shape. so I do not know the shape of it because it was hiding behind the 2 clouds but it went back and forth from the shaping of the lights coming out of the clouds. I did not know what happened to the lights because I was traveling in a main highway. I was at least on the highway for at least 5 minutes. These light in the clouds would show for 20 seconds and then vanish then reapear a minute later. I lost sight of it when I got off the bellefonte 2nd exit. I thought it was crazy because it was right in clear view of the highway and I could not be the only one seeing this."],"Date of the Event":"08/15/2008 12:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.919144,+-77.772675(12117)&iwloc=A&hl=en\"> mufon case (12117) map </A>","Longitude":"-77.772675","Latitude":"40.919144","Object Flight Path":"Stationary","trends":["There have been 3 other sightings in Bellefonte","There were no other sightings in Bellefonte on or around August 15th 2008"],"Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON"}