{"divs":["sighting detailsat approximately 11:00 p.m. on the night of august 16th, 2008 my live-in girlfriend and myself stepped on the back patio to smoke. i was looking at the stars and a very strange looking one got my attention. i pointed at it and asked my girlfriend to tell me if there was anything strange about it she could see. we both agreed that it was flashing green, red, blue and yellow. we took a few pictures but can't see much because of the shakiness of our hands. after about ten minutes of watching i walked to my brothers house to borrow a pair of binoculars. he agreed that the star did seem peculiar and that it indeed seemed to flash different colors. on the walk back to my girlfriends house i noticed that not only in the western sky but also in the south there was another of the same flashing stars. with the same colors. once i returned (gone aprox. 5 minutes) we decided to sit on a hill next to our apartment building and watch for a while. after aprox 10 minutes of nothing special happening. 2 jets flying too close to be civilian (in my opinion) flew east to west. 10 minutes after that a medium sized triangular (solid) object with 2 red lights on the back 2 corners (flashing) and a green flashing light in front flew east to southwest. along with the previous lights mentioned. i looked through the binoculars and could see that the interior of the craft was illuminated with a yellow light and that on top was a pole with a very very bright blueish\\white flashing strobe. the object flew at a moderate pace and made absolutely no noise whatsoever. the triangle was in sight appoximately 1 1\\2 - 2 minutes until we lost sight of it as it flew over the treeline. 5 minutes later as we were about to call it a night (one of the flashing starlike objects had disapeared over the treeline, however there was the original remaining) we both seen a bright yellowish flash that was about the size of an aspirin. as i told my g\\f to take a picture it quickly dimmed and became very very small. almost a pin-point sized yellow light and began floating to the right (east\\north?) after this a couple minutes later another jet just like the previous 2 flew east to west leaving a visible contrail. 5 minutes later we went inside and i recorded everything i had seen in writing. that is all that i have to tell about it at the moment. i dont believe i have left anything out but if something important does come to mind i will contact you. i have no problems giving you a statement or anything that you may need. i want to know the truth of whats going on with these crafts! thank you for giving me a place to tell my story. sincerely, kevin"],"Source":"MUFON","Tags":"City","Case Number":"12113","Object Flight Path":"Stationary,Straight-line path","Weather Factors":"Unknown","Log Number":"US-08182008-0003","Latitude":"39.721988","Sighting Duration":"Undisclosed","City":"Beech Grove","Date of the Event":"08/16/2008 11:28 UTC","Longitude":"-86.089985","Date Submitted":"08/16/2008 11:28 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/12113.html.txt","/var/www/straped/mufon/org/12113.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Summary":"2 Flashing Star like objects in western and south/western skies. Black Triangle with lights westward flightpath","Disposition":"Insufficient Data","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=39.721988,+-86.089985(12113)&iwloc=A&hl=en\"> mufon case (12113) map </A>","Object Shape":"Flash, Star-like, Triangle","trends":["There have been 2 other sightings in Beech Grove","There were no other sightings in Beech Grove on or around August 16th 2008"],"Object Features":"Appendage(s)"}