{"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Source":"MUFON","Tags":"City","Date of the Event":"08/08/2008 07:04 UTC","Weather Factors":"Lightning, Light","Object Features":"Unknown","Sighting Duration":"00:01:30","Summary":"Dark Bellshaped Object- Scoutship","Region":"Arizona","Object Flight Path":"Stationary","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12129.html.txt","/var/www/straped/mufon/more/12129_submitter_file3__DSCN1221.JPG","/var/www/straped/mufon/org/12129.html"],"City":"Needles","Longitude":"-114.608692","map":"<A HREF = \"http://maps.google.com/maps?q=34.85389,+-114.608692(12129)&iwloc=A&hl=en\"> mufon case (12129) map </A>","trends":["There have been 2 other sightings in Needles","There were no other sightings in Needles on or around August 8th 2008","This sighting has never been favorited.",""],"Case Number":"12129","Object Shape":"Disc, Oval, Other","Log Number":"US-08192008-0005","Latitude":"34.85389","divs":["sighting detailsi was outside taking pictures of the skies, there was a storm coming,i wanted to take pictures of the awesome cloud formations and the lightening off in the distance. then i saw something in the sky..it was shiny but dark in color and it seemed to be just hovering there in the sky, not moving. it was there and then gone in a blink of my eye. it was like it was there and then became invisable or shot off so fast the normal eye could not judge it. it was about a 1 min and half at the most. then like it was never there it was gone. i didn't think much of it at first. then when i downloaded the pictures, i found one picture with what looks like a scoutship or lightship in the photo. i am including the original photo and then two enlarged photos..1 at 400% and 1 at 200%. this is all they are enlarged! none are touched up in anyway. i do not know how to touch up even if i wanted to. i have researched ufos alot and i do feel in my heart that this is a picture of a lightship\\scoutship. make your own judgement,but make sure you go with what you feel and know in your heart! october 14,2008 there will be a very large ship in the southern hempisphere. so be sure to look up in the skies!"],"Date Submitted":"08/08/2008 07:04 UTC"}