{"trends":["There have been 4 other sightings in San Jose","There were no other sightings in San Jose on or around August 18th 2008"],"Disposition":"Unknown","Date of the Event":"08/18/2008 11:14 UTC","Longitude":"-89.601153","Log Number":"US-08192008-0008","divs":["Sighting DetailsGoing to bed. Went to shut west bedroom window. In flies a plane stood and watched it move from North. Then it stopped. The neighbors have two large trees in the west part of there yard but a large gap between them. It started to go from one tree to the other. Then it would stop in the middle and just strobe. Went and got my binoculars. Large white light with strobing blue and green lights. I saw this thing a few nights ago and reported it. Had been out in the yard earlier checking the skies and saw nothing. Watched it's little dance in the sky for about 15 minutes when I was so tired I had to go to bed. I put the binoculars on the chair so I would Know it was not a dream. They were there in the morning. This thing the other night when I reported it. Went from around the Mackinaw River to the fields behind my house. (Which for some reason have been quite active this year.) In a blink of an eye.Seven or so miles. Very Impressive!. Why me I wonder. And by it's activities lately is it trying to signal me. Something to ponder on. I'll look again tonight but days go by and it will take a break and then here we go again. Thanks for having somewhere to go with this. Marcia Dover"],"Summary":"recurring white light with flashing blue and green lights making different manuvers in the west sky","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Latitude":"40.308998","Region":"Illinois","files":["/var/www/straped/mufon/html2text/12132.html.txt","/var/www/straped/mufon/org/12132.html"],"Date Submitted":"08/18/2008 11:14 UTC","City":"San Jose","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Case Number":"12132","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.308998,+-89.601153(12132)&iwloc=A&hl=en\"> mufon case (12132) map </A>","Object Shape":"Circle"}