{"Longitude":"-89.813036","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date of the Event":"08/18/2008 12:00 UTC","Country":"United States","Latitude":"44.436908","Date Submitted":"08/18/2008 12:00 UTC","Disposition":"Insufficient Data","Summary":"Lights over corn field.","files":["/var/www/straped/mufon/html2text/12134.html.txt","/var/www/straped/mufon/org/12134.html"],"Log Number":"US-08192008-0010","Sighting Duration":"Undisclosed","Case Number":"12134","map":"<A HREF = \"http://maps.google.com/maps?q=44.436908,+-89.813036(12134)&iwloc=A&hl=en\"> mufon case (12134) map </A>","Weather Factors":"Unknown","Tags":"City","Region":"Wisconsin","divs":["Sighting DetailsI was driving on my way to work down county road ww coming from kellner.It was around 9pm.I was talking on the phone and I looked up and saw a huge object hovering about tree level down the road.It had bright orangish yellow lights.As I got closer I could make out a saucer shape in the dark.I told the person I was talking to about this as I was driving toward it.I just couldnt believe what I was seeing.I was shocked.There was one van coming the other way other than that I saw nobody out that way.I wanted to get the vans attention and see if they could see it too.This object was hovering about tree level over a corn field at the intersection of county road ww and ff.I could make out perfect shapes of the lights.As I started to get even closer the lights kind of blurred and it took off.I could see the lights getting smaller until it was gone.I called and told my dad what I saw.He turned on his 2 police scanners to see if someone called it in.He called me back and said that they would scan and stop and all he would get is static.The funny thing is a few weeks back I looked at the same intersection on my way to work and saw those same lights in a distance.I didnt have any idea what it was.I looked again and it was gone so I just kind of wrote that one off.Last night though it was too big and too close to have any doubt.Drove by there on my way home in the morning and saw nothing but corn and irrigation sprinkler.Wierd."],"City":"Plover/Kellner","trends":["there have been no other sightings in plover\\kellner","This sighting has never been favorited."],"Viewing Distance":"21-100 Feet, 101-500 Feet","Object Shape":"Other","Object Features":"Unknown","Source":"MUFON"}