{"City":"Newark","Log Number":"US-08192008-0014","Summary":"Group of Cigar Shaped Craft Emerging From Woods","files":["/var/www/straped/mufon/html2text/12138.html.txt","/var/www/straped/mufon/more/12138_submitter_file1__vnunn1.jpg","/var/www/straped/mufon/org/12138.html"],"divs":["Sighting DetailsI had met a friend who knew of my interest in UFOs -- she was an old neighbor of mine who had also witnessed a craft I had seen 3 years earlier. She had since moved with her family into a new house on the other side of the small town we lived in. She told me about a strange event that was happening every evening at her house and asked if I would be interested in coming over to see for myself. A few days later, I arrived at her home just before dusk as she had told me this event usually occured as it was beginning to get dark. The house had a large yard which was surrounded by woods -- there were no neighbors for quite some distance -- typical in those days for rural Ohio. We went outside as it started to get dark -- watching the woods to the right of the house. It was not quite dark (you could still see the outlines of the trees against the sky) when through the woods came a procession of white cigar shaped craft. There were 3 of them -- one behind the other. Each was 50-70 feet long and had red, white and blue lights. They were completely silent and had no wings or fins. The angle at which they emerged would suggest that they were coming from a position on or underground. We watched as they slowly flew over the field across from her house and disappeared into the distance."],"Object Shape":"Cigar","Case Number":"12138","Object Flight Path":"Straight-line path","Date of the Event":"10/15/1977 07:00 UTC","Weather Factors":"None","Region":"Ohio","Tags":"City","Date Submitted":"10/15/1977 07:00 UTC","Longitude":"-82.397044","Latitude":"40.06323","Disposition":"Unknown","Country":"United States","trends":["There have been 16 other sightings in Newark","There were no other sightings in Newark on or around October 15th 1977","This sighting has been favorited 1 time.",""],"Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.06323,+-82.397044(12138)&iwloc=A&hl=en\"> mufon case (12138) map </A>","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed"}