{"map":"<A HREF = \"http://maps.google.com/maps?q=39.820892,+-84.019379(12131)&iwloc=A&hl=en\"> mufon case (12131) map </A>","trends":["There has been one other sighting in Fairborn","There were no other sightings in Fairborn on or around July 15th 1991"],"Source":"MUFON","City":"Fairborn","Latitude":"39.820892","Log Number":"US-08192008-0007","Date Submitted":"07/15/1991 10:00 UTC","Weather Factors":"None","Object Flight Path":"Hovering then path","Date of the Event":"07/15/1991 10:00 UTC","Object Shape":"Disc","Viewing Distance":"101-500 Feet","Country":"United States","files":["/var/www/straped/mufon/html2text/12131.html.txt","/var/www/straped/mufon/org/12131.html"],"Longitude":"-84.019379","Region":"Ohio","divs":["Sighting DetailsThis event made me a believer in this phenomenon called UFO's. I am a military brat. Back in 1991 my family and I were staying in the Temporary living Quarters while we found a house at Wright Patterson Air Force Base. One particular night my Father and I wanted to go outside and look for meteors, a known meteor storm was going to be visible for our area, so we decided ot go outside. It was about 10 p.m. at night. My mother threw her back out so she stayed inside. We went outside and next to the recreation building right next to a tree. There was a disc shaped object hovering right about the big oak tree. The briallance of colors and changing of colors was amazing, I couldn't believe my eyes. My father who is a high ranking officer stood their with me. I was like Dad, Dad lets go inside and tell mom. The whole time I couldn't keep my eyes off of it. In my opinion I really feel the lights were trying to communicate with me, or that is how it seems. And then to this day, would make me believe I witnessed a stationary object acelerate from 0 to it looked like a blur in an arc motion to space. This was amazing. As a 10 year old air force brat, I have scene many aircraft that was classified at the time, for instance stationed in California we saw Sr-71's all the time. Many times I did see different aircraft. This technology is nothing close to anything I have scene since. My mother remembers me running inside and telling her all about it. My father still works for black project programs, so I brought it up to him again with my wife. My wife is sick of hearing the story, so I am like lets ask my father about what I saw again. I asked him again, and he said, Not kidding,\" What we saw was a blimp\", impossible. It makes me upset that my father can say that, knowning we saw a disc object, silent and take off over Mach +.... A blimp. I am a believer, I really do not care if anyone else believes me. I know the truth, and since have read and looked at everything with a different eye."],"Object Features":"Dome","Summary":"A brilliant disc, with red, blue, green yellow lights rotating and changing colors siting about 50 yards away at a heights about 100 feet..","Sighting Duration":"Undisclosed","Disposition":"Unknown","Tags":"City","Case Number":"12131"}