{"Tags":"City","Disposition":"Insufficient Data","Source":"MUFON","Weather Factors":"Unknown","Region":"Wisconsin","Summary":"Was abducted by an alien and no I am not crazy!","Latitude":"44.887191","City":"Rothschild","Date Submitted":"09/09/1995 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.887191,+-89.620122(12140)&iwloc=A&hl=en\"> mufon case (12140) map </A>","trends":["There have been no other sightings in Rothschild","This sighting has never been favorited."],"divs":["Sighting DetailsI was at home and asleep in my room on my couch. I noticed the alien comning out of my closet and I dont remember what caused me to notice it. When I first noticed it I thought it was my sister playing or I was dreaming because I was awake and there was like a mist or smoke around it. It looked like a man or woman in a full body infectious diseases suit with a mask over the face with a long tube like a vaccum hose where the nose would be. It had a small light somewhere on it but I dont recall where. It was doing something to my right knee and then I triued to scream for my mom and I couldn't move or scream. I was so scared!! I just laid there and when it fionally stopped and it was gone and I dont know when or how it was gone -I think it just went back into the closet.Once it was gone I got up and ran into my moms room and woke her up and I cried and begged her to let me sleep with her and she asked whjy so I told her. We called a friend of hers who has been abducted before and she said that I was abducted. This was the first time I was abducted there have been more and I get bits and peices of them as I go as far as memory. I have never heard of you guys before and so I have never put anything on here before now. My mom said if I did that you could interveiw me and help me remember and help me with the emotional stress this has caused me. Please let me know what to do. I am sorry if this is the wrong place for this but I didnt know where else to put it. Thank you for you help. Annonymous"],"Country":"United States","Log Number":"US-08192008-0016","Object Features":"Appendage(s)","Case Number":"12140","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Longitude":"-89.620122","Object Shape":"Other","Date of the Event":"09/09/1995 12:00 UTC","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/12140.html.txt","/var/www/straped/mufon/org/12140.html"]}