{"Source":"MUFON","Longitude":"-75.488673","Log Number":"US-08202008-0007","Object Flight Path":"Undisclosed","Region":"Pennsylvania","Summary":"Unusual trail of smoke to the Northwest which upon closer investigation with powerful binoculars revealed unexplainable object at the center.This was followed by erratic movements or possibly even a second object.","Case Number":"12147","files":["/var/www/straped/mufon/html2text/12147.html.txt","/var/www/straped/mufon/org/12147.html"],"Object Shape":"Teardrop","Date Submitted":"08/19/2008 12:00 UTC","Latitude":"40.61006","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around August 19th 2008"],"divs":["Sighting DetailsMy wife and I own a home in Lower Macungie Township; an end unit townhouse. Our back patio deck receives the light of the setting sun. Our living room couch is situated against a long wall and the evening light frequently causes us to lower the blinds a bit to prevent being totally unable to see out. The time was approximately 7:20pm. I happened to glance over and noticed something odd in the sky, falling between the high tension wires of a pole out on the back road, in the direction of Northwest. It appeared to be an elongated trail of smoke. I wear glasses. At the distance I calculated the phenomenon to be I did not wish to trust merely to my eye sight alone. My wife became alerted to my agitated demeanor and she secured our binoculars (wide angle 7 X,35, a very good pair)whereupon we both went out onto the deck. The glaring sunset caused no difficulty as the object was below the line of setting and I was able to see it clearly without the sun light glaring into the lenses themselves. What I then saw was tear shaped, with a tail of white smoke that stretched out behind it. Now I must reiterate the distance was great enough that even if I had (hypothetically) leapt into my car and driven as fast as I possibly could have to where I estimated this was happening I would have never reached the spot before the incident was over. Nevertheless the binoculars revealed, what appeared to me to be, a spot of flames at the center of the tear drop. The object was in steady descent(we could easily gauge it's travel by the distance between the tension wires), with jerking movments to either side. There was a fleeting instant wherein I thought I saw mass within the flaming center- however I would be reluctant to testify to that. The tail of smoke disappeared rapidly as this object descended and finally dipped below the line of trees closest to my home. I should mention that there is farm land across the road and the sighting descended below the tree break line between the fields. I was very excited. I wanted to call someone, but didn't know who. At this juncture it was approximately 7:30. I paced the living room, glancing outside frequently, when suddenly there appeared to be either another object- same description- or an entirely new one. This second appearance seemed to be lower than when I observed the first and I initially thought that it might be the same object and that it had somehow risen up again in a calculated U flight pattern. This notion seemed rather absurd, so I filed it away and kept watching. Once again the object was into a descent. Then, it simply disappeared, vanished. I mean the tail of smoke, the object itself and all visible traces of it's having been there, completely gone in the blink of an eye (I loathe cliches but there it is nonetheless)as I watched it occur. At this juncture the time was very nearly 8pm. The setting sun made any further observation impossible, however I would go on record as stating that the object and the sunset were initially far enough distant from one another on the horizon that there was no possibility of the two becoming one and the same and so all merely my imagination (of which I freely admit I have ample). I am relatively sure that I saw flames. I am almost positive that I saw something within the entire tear dropped smoke. I am 52 years old, highly intelligent and a veteran of both the Marines and Army. I am not prone to hysteria. I have lived here for 9 years and in the Lehigh Valley for 19. We see planes out here constantly as we are within the flight patterns of LVI airport. This was no plane, unless it were on fire. At one point during the second appearance there also appeared to be a plane moving fast towards the phenomenon, coming from the West. I am certain it was a plane despite the distance because of its shape in my lenses. That too simply vanished. I am more than willing to concede the debatable distance from occurence to my deck, however that was dramatically lessened by the binoculars. The occurence was visible with the naked eye (the plane wasn't), which is what first alerted me to it. However we both saw something unexplainable without further factual input (which I would greatly appreciate to be forthcoming). Although we had a very decent digital camera handy, all attempts to zoom in and take photos were thwarted by the sun set glare. We even thought it might be space junk coming down, or even a small meteor, that is until we saw what we believed to be the second object (or the same one rising up and falling all over again). I would dearly appreciate some reconciliation of these sightings at your leisure. I am home all day and relatively easy to get hold of. Sincerely, Christopher A. Lay Deborah L. Lay"],"Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.61006,+-75.488673(12147)&iwloc=A&hl=en\"> mufon case (12147) map </A>","Date of the Event":"08/19/2008 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Features":"Undisclosed","Viewing Distance":"Unknown","City":"Allentown"}