{"Region":"Victoria","Date of the Event":"10/12/2002 07:13 UTC","Tags":"City","Object Shape":"Other","Latitude":"-37.808377","Weather Factors":"Unknown","Source":"MUFON","Case Number":"12141","divs":["Sighting DetailsI was in a back room of my house at dusk when I went to the window to draw the curtains, looked up and saw an object hovering, (approximately 40-50 metres) above and behind the house. There were children playing outside in the lane and I heard their voices but they were called inside. Immediately I could see this was no normal earthly type of aircraft and that it was an unidentifiable aerial object. It was stationery and silent. It was orange with fire, but it was not on fire as the fire was within it. The shape was asymmetrical appearing roughly like the side of a van with its side open. I could see movement, possibly figures of about human height, behind the flames. Towards the 'back', low down there was a row of deep red lights which moved forward and back repetitively. I was very excited. I considered going outside but decided not to. After some minutes the object began to move forward (south) for a very short distance then did a right turn, (west). When it turned I was looking at the back and could no longer see the flames. There were coloured lights on the back and I watched it travel slowly across the undulating country. As it travelled I rang my brother, still watching it, to advise him that it was going towards the town where he lived, 25kms distant. A wide band of dense cloud had come up from the western horizon and the object went behind this cloud disappearing from view. I made diagrams and a painting of the object. Cannot yet discuss the other possible witnesses who were children."],"map":"<A HREF = \"http://maps.google.com/maps?q=-37.808377,+144.96588(12141)&iwloc=A&hl=en\"> mufon case (12141) map </A>","City":"Melbourne","Viewing Distance":"101-500 Feet","Country":"Australia","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"Other","Summary":"Close encounter with unidentifiable flying phenomenon.","Log Number":"AU-08202008-0001","files":["/var/www/straped/mufon/html2text/12141.html.txt","/var/www/straped/mufon/org/12141.html"],"Sighting Duration":"Undisclosed","trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around October 12th 2002"],"Disposition":"Unresolved","Longitude":"144.96588","Date Submitted":"10/12/2002 07:13 UTC"}