{"Object Shape":"Unknown","Object Features":"Unknown","Tags":"City","Latitude":"39.788941","Object Flight Path":"Hovering then path","Disposition":"Unknown","Region":"Illinois","Source":"MUFON","Longitude":"-89.645938","Log Number":"US-08212008-0006","Date of the Event":"08/19/2008 11:15 UTC","files":["/var/www/straped/mufon/html2text/12159.html.txt","/var/www/straped/mufon/org/12159.html"],"trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around August 19th 2008"],"Case Number":"12159","City":"Springfield","Weather Factors":"Unknown","Date Submitted":"08/19/2008 11:15 UTC","Viewing Distance":"Over One Mile","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.788941,+-89.645938(12159)&iwloc=A&hl=en\"> mufon case (12159) map </A>","Summary":"color changing light","divs":["Sighting DetailsShortly after 11pm I went to the kitchen to get a drink from fridge. Peered out the window adjacent to the fridge looking in a westerly direction when I noticed what appeared to be a distant star. I live just outside of town and have five acres but it gets very dark out here. I regularly look at the stars and look for shooting stars, constellations, or just the beauty of the night sky. I am constantly watching for coons getting in my garbage and for deer which tend to come up in the yard. Anyway, as I looked out the window I noticed this \"star\". It seemed to be lower than the rest. After a short second I realized that it was changing colors. I stared for a few moments then decided I would just step outside and take a look. I went to my patio and watched this for several minutes. It didn't appear to be moving just hanging there in the sky. I was in my underwear (lol) so I decided to go back inside. After only a minute or two my curiosity got the better of me so I put on my pjs and went back out. There it was still hanging there changing obviously from bright red to teal to gold to green just all these different colors. To make sure I wasn't crazy I proceeded to stare at all the other stars I could see to make sure they didn't have the same appearance. They did NOT. After several more minutes I looked around to see if there was anything else odd in the sky and couldn't see anything. But I noticed the light had moved slightly because I had to move to a different spot on the patio to keep it in view. I was looking over the top of a tree line adjacent to my property and had to view through a gap in the tree tops. Since it didn't seem to be going away I decided to try to get my video camera and catch a glimpse on it before something happened. The batteries weren't charged. I was afraid to stop looking for fear I would miss something that would dispell or prove my suspicions that this thing was out of the ordinary. So I hurried up and went back out. I thought I missed it but once I moved to the top of my deck in the front yard I regained sight of the light. I watched it get dim and then bright again but not much else seemed to happen(colors were still changing). I lit a smoke and had time to finish it probably lasted five minutes or so and the light was still there. Then it seemed to get brighter like maybe it was coming closer towards my direction. I watched so hard I don't think I could blink. All of the sudden, the light just seem to fizzle out and dissappear. I am aware of the airport that is nearbye. I have lived here the majority of my life. When I was little I wanted to be a fighter pilot. I know what airplanes look like. I know about the red and green strobes at either end of the wingspan and the white light they also carry. This wasn't a plane. It didn't circle or cut across the sky. I observe jets and such all the time in the night sky. I am confident this was out of the ordinary. Although it was only about twice the size of any star in the sky the colors were unreal. They weren't blinking or changing like one off one on. The light almost seem to swirl or blend or whatever. Don't really know what to compare it to. I was so excited I wanted to wake my wife but didn't want to piss her off. I wish I had camcorded the whole thing. I almost took a picture but I didn't think it would look like anything unless you could see the changing of the colors. Just want to know if anyone else In the Springfield IL area spotted the strange light."]}