{"Weather Factors":"Unknown","Longitude":"-75.199862","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.29543,+-75.199862(12150)&iwloc=A&hl=en\"> mufon case (12150) map </A>","files":["/var/www/straped/mufon/html2text/12150.html.txt","/var/www/straped/mufon/org/12150.html"],"Object Features":"Undisclosed","Latitude":"40.29543","Object Shape":"Flash, Star-like","Date Submitted":"08/19/2008 11:30 UTC","Object Flight Path":"Undisclosed","Date of the Event":"08/19/2008 11:30 UTC","divs":["Sighting DetailsI was watching tv in my living room, and went out onto the patio in my back yard to get a signal on my cell phone. I noticed sky was very clear and the moon was quite bright, and I sat down and watched the sky while I checked my voice mail on my phone. When I got up to go inside, something caught my eye in the northwest sky. I thought it was a star at first, then I thought maybe it was mars, but then I realized it was something else, because it was rapidly changing color, and getting more and less bright. I stood there watching it for a couple minutes trying to figure out what it was. It was definitly not an airplane, because it stayed in the same spot, and didn't have the beacon lights, plus I could see several planes in the sky as well, all with beacon lights to compare, and they looked nothing like the object, and they weren't nearly as bright, nor did the remain stationary in the sky. I thought maybe it was a radio tower, but I'd never seen a radio tower there before, and radio tower lights are all red, and not that bright. Then the object began to drop, very gradually, and then remained stationary again, so I knew that it wasn't radio tower. Then I went inside and got my parents, they came out and saw it as well. My father, who is a very knowledgeable man, had no clue as to what it was, and we all agreed it was not a plane, or helicopter, because there were aircraft in the sky to compare it to and it looked nothing like them. We tried, but the object would not show up on a digital camera, and I couldn't find binoculars to get a closer look. About twenty minutes after I first saw it, it dropped below the tree line. However, I could still see it flashing through the trees, until it dropped out of view behind a house. Afterwards, we were all just confused, and I sat for a while just trying to think of a logical explaination as to what it was, but I still can't come up with one."],"Disposition":"IFO","Region":"Pennsylvania","Country":"United States","Summary":"I went out onto my patio at around 11:30PM and saw bright star like ufo in the northwest sky","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Chalfont","There were no other sightings in Chalfont on or around August 19th 2008"],"City":"Chalfont","Case Number":"12150","Tags":"City","Log Number":"US-08202008-0010"}