{"Longitude":"-92.435437","Object Features":"Unknown","Source":"MUFON","Region":"Louisiana","Weather Factors":"Unknown","Summary":"two piercing bright white lights that were flashing about 50 feet from the ground with smaller red flashing lights.","Viewing Distance":"21-100 Feet","Case Number":"12153","divs":["Sighting DetailsMy sister and I were driving back from Arkansas late yesterday evening, passing through Harrisonburg, Louisiana at 11:45 p.m. We were a few minutes past Harrisonburg heading south towards Manifest when we saw two bright white lights flashing to the left of the highway. There were two bright white lights, one above the other which appeared to be hovering approximately 50 feet above the ground. We discussed briefly that it must be a radio tower, however we have never seen a radio tower in this area and one with lights so bright. I continued to drive south, towards the lights for several minutes and when we were parallel to the lights we felt a gush of wind around the car that we not only felt in the car but could hear. I focused on the road and hit the acelerator and my sister, the passenger, said she had seen smaller red flashing lights near the bottom flashing light when we were closer to the object. I was going about 80 mph and we could still see the lights for another 5 to 6 miles. When we safely arrived at our grandmother's house, I called the sheriff's department to ask if there had been any other reports or if there was military testing in the area. I was told that they didn't know anything about it. We were both frightened at the intensity of the lights and the gush of wind this object created. Obvisiously we were too frightened to stop and photograph the event and were trying to get as far away as quickly as possible."],"trends":["There have been 5 other sightings in Alexandria","There were no other sightings in Alexandria on or around August 19th 2008"],"Country":"United States","Date Submitted":"08/19/2008 11:45 UTC","Log Number":"US-08202008-0013","Tags":"City","Latitude":"31.320484","Sighting Duration":"Undisclosed","Object Shape":"Flash, Other, Unknown","Disposition":"Insufficient Data","Date of the Event":"08/19/2008 11:45 UTC","Object Flight Path":"Stationary","City":"Alexandria","files":["/var/www/straped/mufon/html2text/12153.html.txt","/var/www/straped/mufon/org/12153.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.320484,+-92.435437(12153)&iwloc=A&hl=en\"> mufon case (12153) map </A>"}