{"Summary":"small circular white objects in night sky","Sighting Duration":"Undisclosed","Log Number":"US-08202008-0011","divs":["Sighting Detailsi have a rooftop deck that looks over the city. on the nights of august 16 and 17 between 10:00 and 10 :30, i saw on three separate occasions, 2 small white objects fly from out of the west and head out east towards lake michigan. my wife was present too.We observed them both times for over a minute, probably two minutes in duration. they came from out west between midway and ohare airport and travelled east. we first thought they were satellites, but they were too low, probably 200-300 feet above my four story condo. they were silent, they definitely were not birds or balloons, because they moved against the wind and traveled out and up towards the east. they we reminded me of the unmanned reconnaissance vehicles, not out of this world ufo's. i saw them twice on the 16, and once on the 17th. they always traveled in pairs, then slowly spread apart as they headed out towards the lake. this occurred on the weekend of the recent airshow, but there was no airshow going on at this time of night. the show ended at 4pm. my wife thought they looked circular with a squarish top, kind of like a graduation cap. i only saw circular shapes. there was no sound, no light, no jet stream or exhaust. at first, they looked like small balloons, but they were traveling against a lake breeze. they looked no larger than 4-5 ft in diameter from my viewpoint, but they could have been larger. the sky was lit up due to the city lights and because of a bright signpost from across my stree at our local menards. i cant help but think that this could be related to the airshows that went on between the 14th and 17th, but this sighting occurred almost 6 hours after the show was over. Were my wife and i the only one to see this? we were out on our deck grilling out late at night. we were looking out west, watching stars and planes flying overhead. these objects were much lower than any planes that fly over our homes. we were not drinking any alcohol. we lost sight of objects as it flew out of view over lake michigan, which is twenty blocks east. as i said, i doubt they were true ufo's, they seemed more like reconnaissance drones. are these common in chicago? i have never in my life witnessed anything close to a ufo, this could qualify because i could not identify it with any known aircraft that i have seen. it would be interesting to see if anybody else has seen these objects."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.92,+-87.65(12151)&iwloc=A&hl=en\"> mufon case (12151) map </A>","Date of the Event":"08/16/2008 10:30 UTC","Case Number":"12151","Latitude":"41.92","Disposition":"Insufficient Data","Country":"United States","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around August 16th 2008"],"Viewing Distance":"Unknown","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/12151.html.txt","/var/www/straped/mufon/org/12151.html"],"Region":"Illinois","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","City":"Chicago","Date Submitted":"08/16/2008 10:30 UTC","Longitude":"-87.65"}