{"trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around July 30th 2008"],"Region":"Indiana","files":["/var/www/straped/mufon/html2text/12169.html.txt","/var/www/straped/mufon/org/12169.html"],"Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Dome, Appendage(s)","Object Shape":"Boomerang, Oval, Triangle, Unknown","Summary":"UFO Followed our vehicle on Highway 31","Disposition":"Unknown","Date of the Event":"07/30/2008 09:30 UTC","Source":"MUFON","Weather Factors":"None","Longitude":"-86.065761","divs":["Sighting DetailsMy daughter in law (Jessica) and myself were going to the truck stop on Highway 31 in Peru, IN. As soon as we left the house we saw what appeared to be a plane but brighter above Eel River Road. As we started to turn right onto 600, off of Eel River Road, we noticed the the light was not moving. Jessica was driving and I was in the back seat with my grandson. She slowed the vehicle down in order to get a better look at the object that was just above tree-line. The object then came closer to our vehicle (around 700 feet from us). Jessica stopped the vhicle and as she did the object also stopped. We were very excited and decided to go back home to get my son so that he could video tape it. As we turned the vehicle around and started back on Eel River Rd., the object changed from a bright light to a triangular shaped object with two moving things attached to the back. These things looked like the part on the back of an oil rig and moved in similiar fashion. As we drove toward our home the ojbect moved off with us and stayed just above tree-line but followed us back to our house. As we turned onto our road the object sped up faster than I have ever seen any plane go (there was no noise or other planes around during this) and disappeared behind my neighbor's home. We ran in and told my son and his friend about what we witnessed. They got the video camera and went outside. My grandson was teething and needed tylenol so Jessica and I got back into the vehicle and once again headed to the truck stop. We decided to go down Eel River Rd and turn towards 31 on Mexico Rd. As we approached 31, we again saw the same object hovering on our left right beside 31. I told Jessica to flash the vehicle lights. As she did, the object appeared to responded and moved slightly as if to say (oh, there they are!) Neither Jessica or I remember going across the first two lanes of 31 but the next thing we knew we were in the intersection and there were cars coming at us from all directions. We were almost hit in the front and in the back of our vehicle. We turne left on 31 and continued to the truck stop. The object was still hovering in the field beside 31 and as we proceeded in 31 it continued to stay with us. If Jessica slowed the vehicle the object got brighter and also slowed down. During the time it was following beside us, it changed shapes many times. At one point it became an oval shaped object and moved up in the sky a bit and we were able to see under it. Directly in the center, underneath the object, it was very bright and looked like electrical currents or small lighting bolts. The ojbect stayed with us until we got to the traffic light to turn left at the truck stop. As we stopped at the light, the object slowed down and moved in front of us about 700 or 800 feet away and then another light appeared next to it. When our light turned green and we turned into the truck stop both objects disappeared. During the sighting we were not afraid. We felt as though whatever this thing was, it was trying to communicate with us in some way. We also felt confused and disoriented even on the trip home."],"Case Number":"12169","Tags":"City","Latitude":"40.760023","City":"Peru","map":"<A HREF = \"http://maps.google.com/maps?q=40.760023,+-86.065761(12169)&iwloc=A&hl=en\"> mufon case (12169) map </A>","Country":"United States","Log Number":"US-08222008-0004","Sighting Duration":"01:00:00","Date Submitted":"07/30/2008 09:30 UTC"}