{"Weather Factors":"Does Not Apply","Object Features":"Undisclosed","Log Number":"US-08212008-0008","Summary":"Very Active day and evening over CASS county","Latitude":"40.560416","map":"<A HREF = \"http://maps.google.com/maps?q=40.560416,+-85.592604(12161)&iwloc=A&hl=en\"> mufon case (12161) map </A>","Country":"United States","Sighting Duration":"Undisclosed","City":"Undisclosed","Tags":"City","trends":[],"Longitude":"-85.592604","Viewing Distance":"101-500 Feet","Region":"Indiana","Case Number":"12161","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/12161.html.txt","/var/www/straped/mufon/org/12161.html"],"Disposition":"Insufficient Data","divs":["sighting detailsaug 20th 2008 to start this report off , i must say it consists of the entire evening of sightings. starting at about 5 pm and lasting until around 10 pm when i had to go to work. me a friend and my kids where sitting outside just talking, then we hear a jet , so we start looking for it, but we seen nothing of the sorts instead we saw a small whitish colored sphere and it went up into the clouds. shortly after what seemed to b f 16's started flying through, again hearing the jet sounds. not to long after we went on about what we were doing, outdoors still. my 14 yr old daughter saw a huge helicopter, she yelled at to look, but she describes it as being huge, and flying fast. but we didnt even hear it, if it was that close i thought we should have heard it. she described it as being drk in color brown\\ black . i thought it was odd. and that was just the beginning of our night of sightings. the rest of the evening fighter jets kept making rounds. in pairs of 2 and 3.. after the activity started up again, i went in and got my video recorder, and started recording every craft. that came close.. one craft i recorded close to 10 pm was a very large triangle shaped craft, i believe it to be a possible stealth craft of some sorts as it was very low flying. and make absolutely no sound.. i have a very good video of this. it had first 2 lights on each side and 1 flashing and one strobe , as it got directly over head of us the flashing light became solid so that it appeared triangular. and the strobe continued.. it was a very very active night here. wow i will have my camera from now on every where i go! i swear"],"Date Submitted":"08/20/2008 12:00 UTC","Source":"MUFON","Date of the Event":"08/20/2008 12:00 UTC","Object Shape":"Circle"}