{"trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around August 2nd 1990"],"Object Shape":"Triangle","Weather Factors":"None","Log Number":"US-08212008-0009","City":"San Jose","Country":"United States","Object Features":"Appendage(s)","Source":"MUFON","Region":"California","Viewing Distance":"101-500 Feet","Summary":"3 Black Triangles with white lights","Case Number":"12162","Disposition":"Unknown","divs":["Sighting DetailsWhen I saw these, I had no idea what they were, but I didn't think they were alien because the lights seemed earthly. But other than that, they seemed very alien. 3 Black Triangles with white lights flew very low, so low that I remember seeing a black brushed metal texture on the underside of the craft, as well as some slight faceting (it wasn't all smooth). They were about as large in the sky as an airplane coming in for a landing at an airport, but there was no airport. Imagine the diameter of a frisbee just a few feet above over your head. There was a slight hum, like the sound of an airplane if it had its engines off or something. It was much more quiet than I thought possible. At the time, I didn't know about the F-117 Nighthawk. However, as the craft were leaving I could see engines of some sort on the back and they were glowing bright white (but no beads, just a glow). But, my research on the F-117 tells me that the engines would not be visible! Since it is stealth, the engines are ducted. And, the F-117 is not a perfect triangle from the bottom, although it looks that way as it approaches you. These were triangular. Also, the F-117 is designed for speed, not slow flying over populated areas. And, as if that weren't enough, as it was leaving I remember seeing two vertical tail fins, around the engines - the F-117s are slanted from the middle. So, it looked more like what an \"Aurora\" is supposed to. But they fly fast! Why would three F-117's fly over the upper west side of Santa Cruz at 5am, under radar, and at extremely slow speeds? This was around the time of the Gulf War, but I don't know why they would be scrambled in California either. I am still looking for answers..."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.341446,+-121.891356(12162)&iwloc=A&hl=en\"> mufon case (12162) map </A>","Date of the Event":"08/02/1990 05:00 UTC","Sighting Duration":"00:01:00","Longitude":"-121.891356","Tags":"City","Latitude":"37.341446","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/12162.html.txt","/var/www/straped/mufon/org/12162.html"],"Date Submitted":"08/02/1990 05:00 UTC"}