{"City":"West Memphis","Latitude":"35.14648","Date Submitted":"04/25/2008 01:30 UTC","Country":"United States","Source":"MUFON","Case Number":"12163","Tags":"City","files":["/var/www/straped/mufon/html2text/12163.html.txt","/var/www/straped/mufon/more/12163_submitter_file1__apr25object.JPG","/var/www/straped/mufon/org/12163.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.14648,+-90.184539(12163)&iwloc=A&hl=en\"> mufon case (12163) map </A>","Object Flight Path":"Stationary","Object Shape":"Sphere","Longitude":"-90.184539","Log Number":"US-08212008-0010","trends":["There have been no other sightings in West Memphis","This sighting has never been favorited."],"Region":"Arkansas","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Summary":"Sphere sighted from airline","Object Features":"None","divs":["Sighting DetailsI was sitting in seat 1A on a flight from Wichitia, KS to Memphis, TN. The plane was a Canadair Regional Jet, entering the landing pattern in Memphis airspace. We were west of the Mississippi River, in the general area of West Memphis, Arkansas. I noticed a bright light from ahead of the plane at about the 11 oclock position. I could not tell what it was, but it looked as if it was reflecting the sunlight from a highly polished surface. It did not seem to be moving, but I did not see it for any length of time. I keep my digital camera with me when I fly because some of the best things I have seen were from the window of an airliner. I tried to zoom in on the object, but could not find it in my screen, so I backed out the zoom fully and took the picture. The plane then banked left to it's final approach to Memphis from the south, and I lost sight of it. When I got home, I checked the pic on my computer and it is there, but the reflection is very diminished. From the picture, it looks like the object is on the Arkansas side of the river, across from Tunica, MS. I know the area somewhat, and am not familiar with any building which would have this appearance, since the object appears to be below the horizon in the picture. If you zoom into the picture, look on the right side, about halfway down. Unfortunately, the weather did not allow for the horizon to be distinguishable, so I can not tell an accurate size or distance."],"Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"04/25/2008 01:30 UTC"}