{"Object Shape":"Sphere, Unknown","Source":"MUFON","Latitude":"41.717466","files":["/var/www/straped/mufon/html2text/12173.html.txt","/var/www/straped/mufon/org/12173.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.717466,+-87.755228(12173)&iwloc=A&hl=en\"> mufon case (12173) map </A>","Country":"United States","Tags":"City","Region":"Illinois","Case Number":"12173","Date Submitted":"08/20/2008 07:10 UTC","Date of the Event":"08/20/2008 07:10 UTC","Longitude":"-87.755228","Log Number":"US-08222008-0008","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"Shiny white sphere returns and low flying object slinky like with lit triangles on ends","City":"Oak Lawn","trends":["There have been 13 other sightings in Oak Lawn","There was one other sighting in Oak Lawn on or around August 20th 2008"],"Disposition":"Insufficient Data","divs":["sighting detailsa white shiny sphere was in the northwestsky at 7:10pm. midway traffic was flying underneath it. the object just hovered in the same spot and it would go on and off in the same spot. then it went on and stayed on and just disappeared in front of us. there was no structure, faa lights, movement, windows, noise. this was like what was seen last week except it was unpright in a standing position. then around 8:30pm i saw a large lit up object coming through the trees in between the houses in the yardline coming from the east and heading west. this is not a typical flight pattern here. this object was very low and in the trees. then all of a sudden i saw the object bank around the tree and head back out to the east. it made no noise and it was all lit up and looked white\\red\\gold. moments after that it was odd because a huge commerical jet liner flew right over the house very, very low like 600 feet. it shook the house. not usual flight pattern either, planes were flying out over the home. then around 9:20pm i was out on the back patio and saw again this very bright light coming from the house yard tree line. coming from the east low into the trees. it was dark out now and the light was very bright coming from the trees. i heard no noise and came out from the outside patio with my camera and looked up and there was this very bright light almost looked trianglur flying overhead low about 300\\400 feet. the object then as it flew over me seemed to transform into a long thread, almost like a snake or a slinky with nothing in the middle. this body looked red with on each end of it was green\\gold triangular lights as it went over the tree it looked like it was diving down into the ground with the rest of the back of this object following it. the movements was very slinky like. there was no noise, no faa lights,windows, markings, nothing. it was a very odd experience and object."],"Object Features":"Undisclosed"}