{"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around August 6th 2008","This sighting has never been favorited.",""],"Longitude":"-122.673117","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Date Submitted":"08/06/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/12175.html.txt","/var/www/straped/mufon/org/12175.html"],"Summary":"something seems to be hovering over downtown and then takes off over the city","map":"<A HREF = \"http://maps.google.com/maps?q=45.530682,+-122.673117(12175)&iwloc=A&hl=en\"> mufon case (12175) map </A>","Case Number":"12175","Latitude":"45.530682","Viewing Distance":"Unknown","Country":"United States","Disposition":"Hoax","Object Features":"Undisclosed","City":"Portland","Weather Factors":"Unknown","divs":["sighting detailsmy friend was visiting me in portland a few weeks ago from germany and he was taking some video of downtown portland while sightseeing in the aerial tram. about a week later he was watching the footage after uploading it on his computer and he noticed something hovering over the city like a helicopter but then take off at a speed and angle that we don't think could possibly be a helicopter or plane. we have no idea what it was or even if perhaps it was a reflection or something but it sure looks like something that was flying over the city. anyway i've never done anything like this but figured i would look around online and now i'm interested in seeing what an expert might think. the incident happened on august 6th at around noon and like i said he was in the portland aerial tram looking down over downtown. as for witnesses there were others in the tram but no one saw anything or had any reaction at the time. if you listen to the video you can kind of hear a kid reacting to something but who knows if it is related. it was a cloudy day as well. we posted the video to youtube to see if anyone else saw anything that day so the link is below so you can see the footage. i will attach the video to this as well. curious what your thoughts are! http:\\\\www.youtube.com\\watch?v=adjogvtd2um thanks"],"Date of the Event":"08/06/2008 12:00 UTC","Log Number":"US-08222008-0010","Object Shape":"Undisclosed","Region":"Oregon"}