{"Object Shape":"Disc, Other","Longitude":"-95.36107","Region":"Texas","Disposition":"Unknown","Summary":"I saw an object late at night, zooming very fast across my window four times.","Date of the Event":"Unknown","Latitude":"29.769313","divs":["Sighting DetailsIt was a very hot, dark, summer night. Back then, there were not a lot of people who lived around us and my bedroom window looked into a pasture. At the time there were two horses, if I remember correctly, and one very mean bull. (That one I do remember well. He used to chase me whenever I went into his \"yard.\") My best friend was spending the night and my younger sister was asleep on her bed. It was very late and there was no moon out that night. I was used to seeing helicopters and jets flying around day and night. I grew up within a triangle...Bush intercontental airport, Hobby Airport and Ellington AirField. There was constant movement around me, however, I could tell the difference between the jets, commercial jets and helicopters. I couldn't tell you the difference in all the different types, but I knew what they were. Anyway, my best friend and I were talking about going out the window that night. We loved to play in the field at night, it was wonderful to us kids. Anyway, my window was maybe 6-8 feet off the ground and we were debating the window or the back door. (The more dangerous the better.) Anyway, we were looking out the window talking it over, and this strange light flashed by the window. It was the size of a small plane, but it was super fast. It was gone in a blink of an eye. It was low to the ground and completely quiet. It moved from the southeast to the northwest and was only about 100 feet from my window. I know this cause it was just on the other side of the tree line in front of my window. We stopped talking and just looked around the window trying to see it. We were shocked. Then we started laughing and talking about watching too much TV with my parents. We were giggling and still staring out the window, not a minute had passed, the object came back a little slower but still very fast and extremely quiet. This time moving from the northwest to the southeast. The exact position as before just reversed. I was beginning to think that it was the new stealth bomber that the government was keeping so quiet about that I had a perfect model of it sitting on my dresser. My sister was my little pony and I was tomcat and stealth planes. We quit talking, laughing and breathing. My palms started to sweat and my heart started pounding and a strange thought entered my head, \"They know we saw them and are looking for us. That's why they slowed down.\" When it came back from the southeast, it was very slow. It was shaped like a frizbee and there were lights everywhere. It was so bright it was almost blinding. This time it took nearly a minute to pass by the window. There was still absolutely no sound. I knew at that moment that it wasn't the stealth or any other secret military airplane. The last time it came back, it came back slowly and stopped in front of my window for maybe twenty to thirty seconds. It turned slowly in the same position but it turned. Like a top that was spinning slowly. I knew my best friend was scared just like I was and we very slowly slid to the lowest part of the window, trying very hard not to make any sudden movements. We watched, neither of us were breathing, our hearts were so scared, they quit beating, it seemed. When it finally left, it just dissapeared. We didn't see it go south or north. It was like it just disappeared into thin air. We held our breaths and watched for another ten to fifteen minutes but it didn't return. Finally, we decided it was time to go to bed. Neither of us wanted to play in the dark that night or for the rest of that summer. We told our parents the next day what we had seen but they laughed and thought we were just imagining things. We both came down with the flu. High fevers, chills, our parents thought we had been playing outside and they figured we caught a summertime cold, but neither of us were ever sick until Christmas, and that was the only time we were sick at the same time and so quick. That was the really weird part. I have only told a few people about that night and I know only two every believed me. The next summer, before my best friend moved, we thought we saw it again, just a blur going through the trees, and the next morning we had a very weird surprise. But after that episode, she moved and I spent alot of time outside waiting for it to come back. I was ready to talk. But I never saw it again. I don't know what it was exactly, but I know that we did NOT imagine it and what we saw was real. I remember that night like it was yesterday. I remember the things we did and talked about. We both had abusive parents and living next door, we formed a very strong bond, but we didn't talk about things that weren't real or we couldn't prove. Unfortunately, I didn't have a camera and I wouldn't have thought to use it at the time. Now I wish I had. I am not sure if I should give out her name, I am not even sure she is alive anymore. If I find her, I will tell her about this."],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around"],"City":"Houston","Weather Factors":"None","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Source":"MUFON","Log Number":"US-08232008-0004","map":"<A HREF = \"http://maps.google.com/maps?q=29.769313,+-95.36107(12181)&iwloc=A&hl=en\"> mufon case (12181) map </A>","Viewing Distance":"21-100 Feet","Date Submitted":"08/23/2008 02:53 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/12181.html.txt","/var/www/straped/mufon/org/12181.html"],"Object Features":"None","Case Number":"12181","Sighting Duration":"Undisclosed"}