{"Case Number":"12199","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around August 24th 2008"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.00195,+-81.033814(12199)&iwloc=A&hl=en\"> mufon case (12199) map </A>","Longitude":"-81.033814","Country":"United States","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12199.html.txt","/var/www/straped/mufon/org/12199.html"],"Summary":"2 crescent shaped black objects traveling north to south","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Other","divs":["Sighting DetailsI was sitting outside on the patio with my girlfriend, the weather was nice with sunny skies and a few whispy clouds. I often watch the skies when i'm outside, hopeful to see something out of the ordinary. I just happened to lean back in my chair and look up. High in the sky at my 1 o'clock position there was what appeared to be a black crescent shaped object, heading south. At first I didn't think anything of it, i initially assumed it was a large hawk riding and gliding on high air thermals. I continued to watch it out of curiosity. I noticed that the movement was at a steady pace and there was no flapping of wings if it was a bird. I would estimate the height of the object to be about 30K, the same altitude as a lot of the jetliners that fly over. I listened for any noise from the object but didn't hear anything. I tried to get my girlfriend's attention and point out the object. Just then a low flying cessna type aircraft came flying over and diverted my attention. When i looked again i couldn't see it anymore. I told her what i saw but was unable to locate it again. As she scanned the sky she saw the same type object at our 10 o'clock position, traveling the same direction and at the same height. We watched this one closely. It was crescent shaped and black, traveling straight and level with no noise. We both agreed it was not a typical airplane. I was in the Air Force for 10 years, i have seen many different types of aircraft. This object had no nose or tail section, it kind of reminded me of a flying wing, except the curve of the crescent was slight. 15 minutes later, two jetliners flew over at the same height and we could distinctly hear the faint roar of the engines."],"Log Number":"US-08242008-0009","Date of the Event":"08/24/2008 05:30 UTC","Disposition":"Insufficient Data","City":"Columbia","Region":"South Carolina","Latitude":"34.00195","Source":"MUFON","Date Submitted":"08/24/2008 05:30 UTC","Tags":"City"}