{"Tags":"City","Case Number":"12190","map":"<A HREF = \"http://maps.google.com/maps?q=37.53119,+-84.661888(12190)&iwloc=A&hl=en\"> mufon case (12190) map </A>","Source":"MUFON","Disposition":"IFO","Longitude":"-84.661888","Date of the Event":"08/10/2008 01:30 UTC","Object Flight Path":"Path with directional change","Country":"United States","City":"Stanford","Sighting Duration":"00:10:00","trends":["There have been 2 other sightings in Stanford","There were no other sightings in Stanford on or around August 10th 2008"],"files":["/var/www/straped/mufon/html2text/12190.html.txt","/var/www/straped/mufon/org/12190.html"],"Log Number":"US-08232008-0013","Latitude":"37.53119","Weather Factors":"None, Does Not Apply","Summary":"It was a star like object, circle, alternated between red and white light","divs":["Sighting DetailsI went outside to just take a look around. My dog was barking. She was facing the field across from my house. I looked around and then noticed the ufo. It was \"dancing\". I moved left right up down in circles, in a looping J shaps. The lights kept flashing from red to white. It looked like a large star, slightly larger than any star in the sky, larger than Jupitor appears. I was feeling quite happy watching this thing \"dance\" i the sky. At one point it seemed the object wss beginning to move closer to me. I became a bit frightened. It then retreated to its former distance. I watched it for five minutes. It was located low on the horizon, just above the tree tops behind the field. I then went in the house to see if my daughter was still awake so she could enjoy the sight. She was already in bed. I went back outside and looked to the Southeast, the direction where I observed it. It was gone. Then I looked around the night sky and saw it or another similar object higher in the sky in the western sky. It was farther away, or perhaps was a smaller object.I watched it for approximately 5 minutes and then returned to my studio to paint. A bit later I went outside to look for it again but it was gone."],"Date Submitted":"08/10/2008 01:30 UTC","Region":"Kentucky","Viewing Distance":"Unknown","Object Shape":"Circle","Object Features":"None"}