{"Log Number":"US-08242008-0013","Object Shape":"Circle, Disc","files":["/var/www/straped/mufon/html2text/12203.html.txt","/var/www/straped/mufon/org/12203.html"],"Latitude":"33.857772","Region":"California","Object Flight Path":"Hovering then path,Path with directional change","trends":["There have been 10 other sightings in Redondo Beach","There were no other sightings in Redondo Beach on or around August 22nd 2008"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.857772,+-118.382788(12203)&iwloc=A&hl=en\"> mufon case (12203) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Fog","Object Features":"Unknown","Date Submitted":"08/22/2008 11:50 UTC","Tags":"City","Summary":"Disc-shaped with bright lights around the edges. Stayed visible for 20+ minutes & floated around in the same area of the sky the whole time.","Disposition":"IFO","Longitude":"-118.382788","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting DetailsI was sitting outside on my deck in Hermosa Beach and something in the sky caught my eye. I was sitting in a chair facing west and this object was south - over the town of Redondo Beach, which is the next town over from me and starts a few blocks away from me. It was circular shaped like a frisbee and had the brightest white lights around the outer edge and it also had a few red lights as well. It was hovering over the same area in the sky (for as long as I saw it, which was about 20-25 minutes). There was a marine layer or fog, and it was flying directly below that. It was much lower than any commercial airline flies. Even though multiple times, it went up a little higher and part of it was lost in the fog, I was still always able to see at least the other part of it that was not in the fog - part of it, if not all of it, was visible during the 20-25 minutes that i was watching it. Most of the time, I could see the bottom of this object (the circular shape) but at times it would manuever and turn on its side and twirl around. It stayed in one spot for a while, moved to the side, moved up, moved down, moved closer to me and then away from me, at times it appeared to be floating in one spot (not moving), and it also zig-zaged over to the side, twirl around and dart back towards the other side. It was the most unbelievable thing I have EVER seen in my life. A total rush!! After staring at it in amazement for a few minutes, it took me a few minutes to realize what it was. It was the last thing I would ever imagine I would see. It hit me like a ton of bricks that this was not something normal, and once I realized that, I thought \"oh my goodness, I need to film this because I am the only one out here that sees this\". I kept staring at it thinking it would disappear, but it didn't, and it stayed in the same spot. I was afraid to take my eyes off it and have it disappear, but after many minutes of it staying in the same area of the sky, I decided to chance running inside to document this moment. So, I ran inside my house to grab a camera (which only took less than a minute) and when I came back outside, it was still in the same spot. I filmed it with my camera and after a short time, the memory card filled up. I had to run inside again to grab a spare memory card and when I came back outside, it was still there in the same spot. I called my roommate who was out with friends. I was able to get ahold of her while I was filming and told her to go outside. She was down the street from me and was able to see it as well, but from an angle that was not as good as mine. I called my other friend and he told me to point a flash light up into the sky to attempt to get their attention. He also told me to call the local police station to report it. I ran inside to grab the flashlight. The batteries in my flashlight were almost dead, so the light on my flashlight was yellowish and not bright at all. At the same time I turned on my flashlight and pointed it up into the sky, with my other hand, I called the Hermosa Beach police department's non-urgent phone number (my local police station) to report this sighting and right then, the ufo disappeared. The woman on the phone told me she had already received another call minutes before from someone else in my area reporting the sighting. It was the craziest experience - I will NEVER forget this experience and will always have that image in my mind. The best part is that is stayed in the sky for longer than I could have ever imagined. Unfortunately the camera zoom was not good at all. The image appeared small, as a white dot via my camera video but by my eyes, it was so much larger. I extended my arm as far as I could up above me head to try to get the best video, but because the zoom wasn't good, I was watching it through my eyes because it was so much better, bigger, I could see sooo much more detail, and I could watch it move around in greater detail. Its unfortunate that those images I saw didn't come through on my camera. Although if you can zoom, you might see more and be able to view what I was able to see."],"Date of the Event":"08/22/2008 11:50 UTC","Case Number":"12203","City":"Redondo Beach"}