{"Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Country":"United States","Region":"California","Disposition":"IFO","Case Number":"12200","divs":["sighting detailsi was sitting in the backyard with my young (2yrs) daughter and i looked up because i live near an airport and i always look up, and noticed a very high object that was bright and kind of shined. it was a very clear day. it sat there for possibly 25 minutes, maybe longer. i needed to tend to my daughter so i couldn't watch forever. i took several photos and video. this thing was way too high to be a plane. i am located in oakland ca, near the airport and across the bay from san francisco airport. i see planes all day long and this wasn't a plane. it sat in one spot for a long time and then moved slowly to the south. again, way too high for plane and it sure wasn't a satellite. its not a balloon... too high, too large, and stayed still for a long period of time. and i have never seen a balloon that was this bright and big. from what i understand weather balloons would have something off the end\\bottom. this thing was solid and round. this is the third time i have seen this object and the second time i have taken multiple photos. i took 12 photos this time."],"Date of the Event":"08/24/2008 04:45 UTC","Log Number":"US-08242008-0010","Tags":"City","Latitude":"37.808094","map":"<A HREF = \"http://maps.google.com/maps?q=37.808094,+-122.265114(12200)&iwloc=A&hl=en\"> mufon case (12200) map </A>","Object Shape":"Circle, Oval, Sphere, Star-like","Viewing Distance":"Over One Mile","trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around August 24th 2008","This sighting has never been favorited.",""],"Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/12200.html.txt","/var/www/straped/mufon/more/12200_submitter_file1__ufo015.JPG","/var/www/straped/mufon/more/12200_submitter_file2__ufo017.JPG","/var/www/straped/mufon/more/12200_submitter_file3__ufo019.JPG","/var/www/straped/mufon/org/12200.html"],"City":"Oakland","Source":"MUFON","Date Submitted":"08/24/2008 04:45 UTC","Sighting Duration":"Undisclosed","Summary":"bright circle in clear sky moving slowly","Longitude":"-122.265114"}