{"Object Features":"Undisclosed","Source":"MUFON","Object Shape":"Egg","Date of the Event":"04/03/2008 12:00 UTC","Tags":"City","trends":["There have been 3 other sightings in Exeter","There were no other sightings in Exeter on or around April 3rd 2008","This sighting has never been favorited.",""],"Log Number":"GB-08252008-0004","divs":["Sighting DetailsIt was a very clear evening,no clouds,or wind at all. Visibility about 20 miles. My window faces south ,south east. No aircraft were visible or heard,as i remarked to family how peacefull the evening was. The moon was up and clear and i decided to take a couple of shots on my digital camera from my upstairs window. The camera is a minolta dimage g400 with 4 megapixal,and optical zoom. Nothing untoward was visible in the sky. On downloading the photos to my pc , i noticed a violet and red coloured object at near top of picture. In windows i zoomed in on the object to see it has three lights which appear to be inside it,the object being allmost see through, there also seems to be several structures within but the zoom loses its clarity to such an extent that these can only be seen as blurs. The object on inspection appears red on top,red underneath,violet in the middle with slight yellow toward the underneath rear. The object appears to be surrounded by a plasma or gaseous bubble which trails behind it. i transferred a copy of the photograph to windows paint,where i inverted the colours. This image on zooming in shows the object has a peculiar trail intimating its decent and high speed. I deduced the \"high speed\"as the object was not visible in the three other photos,and was not visible in real time as i looked toward the sky. I also have noted on the previous and post photographs that there are no stars visible in that area. The object also shows the three internal lights as black dots which i would assume confirms there presence. My neighbours house becomes visible in this format. copy the photograph to windows picture viewer and zoom in ,also then look at it in inverted colour mode."],"Case Number":"12208","Object Flight Path":"Undisclosed","Date Submitted":"04/03/2008 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","Region":"England","Summary":"photographing nice moon item showed later on inspection","City":"Exeter","Longitude":"-3.530639","files":["/var/www/straped/mufon/html2text/12208.html.txt","/var/www/straped/mufon/more/12208_submitter_file1__PICT1574.JPG","/var/www/straped/mufon/more/12208_submitter_file2__1574inverted.JPG","/var/www/straped/mufon/org/12208.html"],"Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=50.726682,+-3.530639(12208)&iwloc=A&hl=en\"> mufon case (12208) map </A>","Latitude":"50.726682","Country":"United Kingdom"}