{"Latitude":"39.800946","Date of the Event":"08/22/2008 09:22 UTC","Date Submitted":"08/22/2008 09:22 UTC","Tags":"City","Object Flight Path":"Undisclosed","Object Shape":"Oval, Sphere, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.800946,+-75.347412(12212)&iwloc=A&hl=en\"> mufon case (12212) map </A>","Log Number":"US-08252008-0008","Object Features":"Undisclosed","Country":"United States","divs":["Sighting DetailsAt 9:22 am on Friday August 22nd, while at work in Bridgeport NJ. a co-worker noticed an object in the sky that at times was very bright and at times very dim as if it was rotating, but staying stationary. Then as we continued watching this object it would disappear but reappear in a diffrent location, performing the same actions over and over. At this time I went to get my camera from the car and managed to snap a few pictures. The object was very high in the sky and was visible for at least 10 minutes or so. After the object disappeared, we went inside knowing what we had seen was not from here, and not explainable. We blew up the photos the best we could, changing color to make out a shape, finally we found a shape as well as a second object we did not noticed until we blew up the photo. The main object's shape seemed to be mostly round with bubble like pertrusions on the sides and top, but the bottom had a very dark spot almost like a hole in the bottom of the craft. Below and to the right in the photo near the date in the corner was a second craft and again after blowing it up and changing the color of the background we noticed the shape of this craft was triangular in shape with a dark spot on the top, like a hole. Its almost like they were in sinc with each other. I would like if anyone could professionally blow these up with better equipment to help see the objects more clearly. I still have the photos on the memory stick in the camera I took them with. After reflecting on what occured, I do beleive without a doubt that we had witnessed a UFO. I have always been a believer and would love to have these photos professionally examined and enlarged, to make others be able to see what we saw. Thanks C.W."],"Longitude":"-75.347412","Disposition":"IFO","City":"Logan","Source":"MUFON","Summary":"Noticed a very bright object in the sky, kept disappearing and reappearing in a diffrent location","Case Number":"12212","files":["/var/www/straped/mufon/html2text/12212.html.txt","/var/www/straped/mufon/more/12212_submitter_file1__DSC00166.JPG","/var/www/straped/mufon/org/12212.html"],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Logan","This sighting has never been favorited."],"Viewing Distance":"Unknown","Region":"New Jersey","Weather Factors":"Unknown"}