{"Object Flight Path":"Path with directional change","Source":"MUFON","Country":"United States","Longitude":"-75.189344","Date of the Event":"08/23/2008 01:30 UTC","City":"Wyndmoor","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12218.html.txt","/var/www/straped/mufon/org/12218.html"],"Log Number":"US-08262008-0004","Sighting Duration":"00:35:00","Disposition":"Unknown","Case Number":"12218","Latitude":"40.081222","Summary":"Saw a plane with contrail moving across sky below it a bright strobing light","Date Submitted":"08/23/2008 01:30 UTC","trends":["There has been one other sighting in Wyndmoor","There were no other sightings in Wyndmoor on or around August 23rd 2008"],"Region":"Pennsylvania","Object Shape":"Bullet, Missile, Triangle","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsSaturday afternoon August 23rd at approx 130PM I heard noises on my roof so I went out front thinking there were squirrels up there. There were not but while I stood on the sidewalk, I saw a plane flying fairly high up with a contrail streaming out behind it, roughly NE to SW. But what really attracted my attention was a super bright strobing light just below the plane. At first I thought it had come off the plane and was falling. It did move below the aircraft getting lower in the sky but it was not falling. I observed this for over a minute before the light went behind a tree. The plane passed behind the tree much higher up and as it came out the other side, there was another of these bright strobing lights below the plane. I had completely lost sight of the 1st one but was able to follow the second one. The plane continued on course but the 2nd strobing light moved in a westerly direction and appeared to be gaining altitude. At this point I was not sure of what I was seeing. Around this time the mailman was delivering to my house. As he walked out to where I was standing, I asked him to tell me if he could see what I was looking out. He did and asked me if I knew what it was. I told him it was the second one light that had appeared below a plane, the first one I lost sight of behind the trees. I told him what I have written above. We stood there watching if for a good 10 minutes and observed it changing direction now moving SW. While the mailman tracked the object I went into the house and got a pair of binoculars. I rejoined the mailman and observed the object through them. It was very high and very small triangular in shape but very narrow almost like a spear tip. Silver to shiny white and strobing light that had no particular pattern. As I looked at it thru the binoculars a another plane passed thru my field of vision below the strobing light. The mailman reluctantly left to continue his rounds after a few more minutes and I remained watching this object for over 30 minutes. I went in to answer the phone after that and when I returned I could no longer locate it in the sky. With the naked eye the object was never larger then the head of a pin at arms length but it was much brighter then the brightest star on a summer's night in the country. It did not move as fast as a passenger aircraft at altitude from my vantage point but changed direction at least twice during my observation. From time to time I tried to locate the first one of these that I had observed but had no luck. Towards the end of my sighting, the light was not as bright as it was at the beginning while strobing erratically the entire time. I attribute this to the fact the object was climbing and moving further away from me"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.081222,+-75.189344(12218)&iwloc=A&hl=en\"> mufon case (12218) map </A>","Viewing Distance":"Unknown"}