{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"02/12/2008 12:00 UTC","Country":"United States","Viewing Distance":"Unknown","Case Number":"12216","divs":["sighting detailsi was on my way to work on the mass pike. i always get to exit 9 (eastbound) between the 72 and 75 mile marker, right around 4:00 am, varying 5 minutes either way. from a several miles away i noticed a big, bright star but i remember thinking it can't be a star, it looks like a plane headlight during landing. it was bright white without much glow around it. as i got closer, it never moved from that exact spot. i slowed down to see this light up close. i didn't see any aircraft at that point, only the light. all of a sudden the light disappeared and i was under this aircraft. i looked up at it (in awe) and was almost at a complete stop (just an idle). i could see the outline of it as i drove under. it was triangular, with the top point of the triangle facing south. it was illuminated with an amber, reddish orange glow. the metal was a beautiful silver, a slight brushed appearance to it, but the glow\\lighting was even across the bottom of this. the bottom was extremely flat, i seem to recall that there were pieces of metal making up this massive bottom area, not just one big sheet, but i didn't see any bolts or connectors. i looked to see where the light was coming from and i couldn't see any (obvious)lights around the bottom of it that would make this glow. it never moved, fluttered, anything. it was perfectly still, no sound at all (i rolled down my window). it was very low, not more than the height of a cell phone tower\\not much above the tree line. i let my car proceed on just the idle and then i wasn't under it anymore. i looked in my rearview mirror and my side mirrors and didn't see it once i passed it. my first thought was that it was a ufo. the metal underneath it was beautiful, perfect, a beautiful light silver color, the lighting was mesmerizing, there were no wheels, no discoloration, nicks, lumps, etc. i certainly was never scared. i told a coworker once i got to work that i had seen a ufo."],"Log Number":"US-08262008-0002","Tags":"City","Latitude":"42.136634","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Object Shape":"Triangle","Date Submitted":"02/12/2008 12:00 UTC","trends":["There have been 2 other sightings in Charlton","There were no other sightings in Charlton on or around February 12th 2008"],"files":["/var/www/straped/mufon/html2text/12216.html.txt","/var/www/straped/mufon/org/12216.html"],"City":"Charlton","Region":"Massachusetts","map":"<A HREF = \"http://maps.google.com/maps?q=42.136634,+-71.961357(12216)&iwloc=A&hl=en\"> mufon case (12216) map </A>","Summary":"Saw bright white light from ~2 mi away, never moved, very low, light disappeared and I realized I was under it.","Object Flight Path":"Undisclosed","Longitude":"-71.961357"}