{"Longitude":"-119.412432","Viewing Distance":"Over One Mile","Summary":"Object blinking by crescent moon in daytime.","Region":"California","Object Shape":"Circle, Flash, Star-like","Latitude":"36.783311","Date Submitted":"08/24/2008 09:45 UTC","Weather Factors":"None","trends":[],"Date of the Event":"08/24/2008 09:45 UTC","files":["/var/www/straped/mufon/html2text/12210.html.txt","/var/www/straped/mufon/org/12210.html"],"Object Features":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=36.783311,+-119.412432(12210)&iwloc=A&hl=en\"> mufon case (12210) map </A>","Country":"United States","Case Number":"12210","Source":"MUFON","Log Number":"US-08252008-0006","divs":["Sighting DetailsAs my fiance' and I were sitting outside yesterday, I looked up and noticed the moon was out and right as I was looking at it, a small star-like object was moving right under the visible part of the moon (which from my view was the top half). I didn't know what it was, my fiance' thought it was a satellite, but i did not think they could move like that. It looked like it was coming in a North to South direction and right when it got to one side of the moon, it looked like it blinked on and off a few times and then disappeared. Then about 2 minutes later it was up near the top left side of the moon, then blinked on and off again. By the next time it had appeared, it had dropped way down below the moon, but still on the left hand side, then it blinked on and off a few more times, then it was gone again. About five minutes later it reappeared and was north in the sky again (to the right hand side of the moon)the way it came from. It was still blinking from time to time. The other strange thing was that a few military planes were flying in a formation overhead, but they weren't flying too fast, so maybe it was just a coincidence? A few nights ago I saw some strange blinking at night. I would like to know if anyone else has been seeing this? It was very cool, I wish it would have been closer so I could have seen it better. It was exciting to see it disappear and then reappear pretty far away."],"City":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City"}