{"Case Number":"12211","Date Submitted":"08/31/1976 12:00 UTC","Longitude":"-71.687731","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Lincoln","This sighting has never been favorited."],"Object Features":"Undisclosed","Source":"MUFON","Region":"New Hampshire","Date of the Event":"08/31/1976 12:00 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","City":"Lincoln","Latitude":"44.05782","divs":["Sighting DetailsIT WAS MY JUNIOR YEAR OF HIGHSCHOOL & I WAS TRAINING FOR THE UPCOMING SOCCER SEASON AND WAS DOING ALOT OF RUNNING IN THE EARLY TO MID-EVENING WHEN THE SUN WAS DOWN AND IT WOULD BE COOLER. I WAS RUNNING BETWEEN 5 - 10 MILES DAILY. AS A SERIOUS ATHLETE ( I WON THE PRESIDENTS PHYSICAL FITNESS AWARD ALL 4 YEARS OF HIGHSCHOOL ) I WAS ALWAYS COMPLETELY FREE OF DRUGS AND ALCOHOL , AND WAS LUCID AT ALL TIMES. AS I WAS RUNNING NORTH ON ROUTE 3 AND NEARLY AT THE INTERSECTION WHERE RT.3 AND RT. 112 JOINED... DIRECTLY ACROSS THE STREET FROM WHAT USED TO BE THE OLD MOUNTAUP MOTEL AND CABINS. I LOOKED OVER MY RIGHT SHOULDER IN THE DIRECTION OF THE OLD IGA FOODLINER & THE EAST BRANCH OF THE PEMIGEWASSET RIVER AS I SAW A CIGAR SHAPED CRAFT THAT WAS GLOWING FIERY RED AND WAS ASCENDING NEARLY STRAIGHT UP , BUT NOT QUITE. BUT IT WAS ASCENDING VERY SLOWLY , SILENTLY AND AT A VERY SHARP ANGLE. I STOPPED DEAD IN MY TRACKS AND BEGAN STARING AT THE OBJECT ABSOLUTELY STUNNED & SCARED WHILE ALSO OVERCOME BY CURIOSITY HAVING NEVER SEEN ANYTHING LIKE THIS BEFORE. I STARED AT THE OBJECT AS IT WAS SILENTLY ASCENDING FOR ABOUT 20 - 30 SECONDS. THE ODDEST PART OF THE EXPERIENCE WAS THAT I WAS OVERWHELMED BY THE FEELING THAT NOT ONLY COULD I SEE THE CRAFT , BUT THAT IT ALSO COULD SEE ME & KNEW I WAS WATCHING ! IT WAS QUITE EERIE. I NOTICED THAT IN THE LINE THE OBJECT WAS TRAVELING THAT SOON MY VIEW WAS GOING TO BE BLOCKED BY A BIG MAPLE TREE THAT WAS ACROSS THE STREET FROM WHERE I WAS STANDING. THE TREE WAS QUITE LARGE & WAS IN FULL BLOOM WITH ALL IT LEAVES AS FALL WAS APPROACHING. SURE ENOUGH THE CRAFT DISAPPREARED FROM MY VIEW WHEN IT CROSSED BEHIND THE MAPLE TREE AND INDEED MY VIEW WAS COMPLETELY OBSCURED. I GAUGED WHERE THE CRAFT WOULD REAPPEAR AND FOCUDED MY ATTENTION TO THAT AREA OF THE SKY & TO MY ASTONISHMENT IT NEVER REAPPEARED. IT JUST VANISHED ! I JUST STOOD THERE IN UNBELIEF. I KNEW WHAT I SAW WAS REAL & NOT SOME FIGMENT OF MY IMAGINATION. BUT I ALSO KNEW THAT THIS CRAFT COULD NOT POSSIBLY BE OF THIS EARTH. AT LEAST NOT TO MY KNOWLEDGE. I WANT TO REPEAT THAT THE EERIEST PART OF THIS EXPERIENCE WAS THAT I FELT LIKE NOT ONLY COULD I SEE THEM , BUT THEY COULD ALSO SEE ME. I BASICALLY SPRINTED THE LAST MILE OF THE RUN TO MY HOME VERY , VERY SCARED. ONCE HOME I DELIBERATED ON WHAT I HAD SEEN BUT DIDN'T TELL ANYONE FOR FEAR OF BEING RIDICULED. IN THE LAST 30 SOME ODD YEARS I HAVE ONLY SHARED THIS STORY WITH ONLY A HANDFUL OF PEOPLE. I'M CONVINCED NOW THAT UFO's ARE REAL & THAT THIS IS INDEED WHAT I SAW. I'M PREPARED NOW TO TAKE MY STAND WITH OTHERS WHO'VE HAD SIMILAR EXPIERENCES AND SHARE WITH OTHERS WHAT I BELIEVE TO BE A REAL PHENOMENON."],"files":["/var/www/straped/mufon/html2text/12211.html.txt","/var/www/straped/mufon/org/12211.html"],"Tags":"City","Disposition":"Unknown","Log Number":"US-08252008-0007","Summary":"CIGAR SHAPED. GLOWING FIERY RED","map":"<A HREF = \"http://maps.google.com/maps?q=44.05782,+-71.687731(12211)&iwloc=A&hl=en\"> mufon case (12211) map </A>","Viewing Distance":"Unknown","Object Shape":"Cigar"}