{"Date Submitted":"08/10/2008 08:30 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unresolved","divs":["sighting detailsi was leaving a fast food restaurant and had just entered my car when i noticed a bright, white star about 40 degrees above the western horizon. it was just above a bank of clouds that were clearing after a front had come through. the sun was nearly set so the sky was fairly bright. my first impression was that it looked like a brighter version of venus and possibly was a jet. i started my car and turned it so i could have a comfortable look. the object remained stationary and did not vary in brightness for more than half a minute. i then noticed another star-like object about 5 degrees to the left (south) of the other object. it was fainter, but still easily seen. it suddenly began to get brighter. there was some movement (north-south) of perhaps 1\\2 degree of the scond object, however both objects were nearly stationary for 3-4 minutes. i was curious if thay were reflecting light, but could not be sure. there was no twinkling. the first object suddenly began to fade as did the second object. both disappeared from view and then bightened again. as i did not have any optical aid i decided to go the couple of miles home and grab my binoculars. after returning home i noticed a jet, but not the unusual objects i saw. my main reaction was of couriosity as to what i was seeing and feel fortunate to have witnessed this. i have been a skywatcher since 1966 and an amateur astronomer since 1971 and feel i know the sky well."],"Summary":"The UFOs appeared as two pulsating, white, star-like objects that showed little motion.","Case Number":"12228","Latitude":"37.549915","files":["/var/www/straped/mufon/html2text/12228.html.txt","/var/www/straped/mufon/org/12228.html"],"trends":["There have been 39 other sightings in Richmond","There were no other sightings in Richmond on or around August 10th 2008"],"Region":"Virginia","Object Flight Path":"Stationary","Longitude":"-77.433068","Log Number":"US-08262008-0014","City":"Richmond","Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"08/10/2008 08:30 UTC","Object Shape":"Star-like","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.549915,+-77.433068(12228)&iwloc=A&hl=en\"> mufon case (12228) map </A>","Country":"United States"}