{"Object Features":"Undisclosed","divs":["Sighting Details Ken26 I drove upto Topanga Canyon 20:45, on a Thursday night in June of 2000. Ihave been having some sort of feeling or urge to go there that night andasked if he wanted to go so that I would not be alone. We stopped at the top ofthe mountain, there is a newly renovated park their which closes at 9pm (21:00),but there were other cars parked, people standing out side. We were in my 99jeep wrangler, I had the top down and I usually carried a pair of binocularswith me. It was a very clear26 beautiful nite, no high winds, or clouds. Topanga is part of the Santa Monicamountains, south of Edwards Air Base. Ken was the first to see the object. Hestated Hey, look, that star is moving!.. I looked up and didnt see it at first,until he pointed it out, just above us. It was amazing, it had an orange color-glowing, it was smooth moving, and just there. Its path moved across the sky atleast for 30-45 seconds..26 then just disappeared into a faded descent up. Its kind of hard to explainbut we both saw it leave, yet, both or views of how it left26 the color change was different, except we did both agree that the colorchange was like a silverish liquid type of form. And how it left was straight upwith a smooth silver or vapor trail up that dissappeared just as quickly as ithad appeared. Thats when we noticed just behind us over the hill top of theplatform where we were, there was another object, just over the trees,displaying lights"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","City":"Topanga Canyon","trends":["There have been no other sightings in Topanga Canyon","This sighting has never been favorited."],"Latitude":"34.13075","files":["/var/www/straped/mufon/html2text/1222.html.txt","/var/www/straped/mufon/org/1222.html"],"Date of the Event":"05/31/2000 09:05 UTC","Sighting Duration":"00:00:59","Object Flight Path":"Straight-line path","Source":"MUFON","Summary":"Smooth Glowing Orange egg/oval shaped object movin","Date Submitted":"05/31/2000 09:05 UTC","Object Shape":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.13075,+-118.594387(1222)&iwloc=A&hl=en\"> mufon case (1222) map </A>","Case Number":"1222","Country":"United States","Log Number":"","Disposition":"Unresolved","Longitude":"-118.594387"}