{"Longitude":"-104.977153","Latitude":"39.743044","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"12224","Object Features":"Dome, Patterned Surface, Appendage(s), Other, Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/12224.html.txt","/var/www/straped/mufon/more/12224_submitter_file1__MagicalSnap-2008.08.1503.40-006.png","/var/www/straped/mufon/more/12224_submitter_file2__MagicalSnap-2008.08.1504.02-049.png","/var/www/straped/mufon/more/12224_submitter_file3__MagicalSnap-2008.08.1504.08-064.png","/var/www/straped/mufon/org/12224.html"],"Object Shape":"Disc, Egg, Saturn-like, Sphere, Star-like, Unknown","Object Flight Path":"Unknown","Region":"Colorado","Date Submitted":"08/15/2008 03:45 UTC","Weather Factors":"Unknown","Summary":"These photos were taken from the Microsoft Worldwide Telescope Site.","Disposition":"IFO","Log Number":"US-08262008-0010","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around August 15th 2008","This sighting has never been favorited.",""],"Tags":"City","Date of the Event":"08/15/2008 03:45 UTC","divs":["Sighting DetailsI often use the WWT to cruise the stars and get an idea of locations of certain Hubble Space Telescope pictures that I find interesting. However, the night of the 15th was quite different. You can turn the sky in the WWT. I had moved my position to the far back of my field of view. I was moving in to view a Nebula I had seen many times on Hubble Telescope. However, I saw two blue dots, which should not have been there. Upon zooming in on these objects, they were unlike any celestial body I have ever seen. I have been trying my best to get an explanation of them. I zoomed in on great detail to see energy waves being pulled back down into them by gravity. They are like layers of glass, on top of each other. Circular, and immense in size. They have markings and what appears like energy fields around one of them. However, the other one looks darker, no energy firlds around it, and the center looks as though it had been quite damaged. Almost like the 'energetic ship' is coming to help (you can make your own conclusion). There are either markings or levels. It is obvious the objects are not natural by any means. I have 100 photos of the two objects, I will post as many as I can. If anyone has idea what this is or could be, please contact me."],"City":"Denver","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.743044,+-104.977153(12224)&iwloc=A&hl=en\"> mufon case (12224) map </A>"}