{"Log Number":"US-08272008-0004","trends":[],"files":["/var/www/straped/mufon/html2text/12233.html.txt","/var/www/straped/mufon/org/12233.html"],"Object Features":"None","Tags":"City","Longitude":"-99.898633","divs":["sighting detailsat approximately 12:50am cst, i had been in my backyard (a two-acre lot in a small rural subdivision) for about an hour and was facing north-northwest stargazing with binoculars. i've done this almost every night this month and have seen some remarkable star-like flashes and very bright meteoric-type activity on several occasions, so that's more or less what i expected to see, if anything. i was sitting down, binoculars in my lap, when i noticed a low-flying, well-lit craft flying north to south emerge from behind the small grove of winged elms on the north side of my property. it had approximately six orange lights arranged in a loose horizontal cluster, a blue & white rotating beacon on top and an identical rotating beacon on the bottom. the beacons were not vertically aligned, but i can't remember whether the top or the bottom beacon was on the leading edge, mostly because i quickly found myself rather excited due to the lack of noise, which is pretty much unprecedented considering its close proximity. still, with that many lights on it - especially the rotating beacons (despite being blue & white instead of the usual flashing red) and because it was on a steady course & pace, i continued to assume it was a plane. even though i was facing the area from which the craft emerged, it took me by surprise for two reasons: (1.) the trajectory of the craft was in no way - at least not to my knowledge - a typical flight path, and; (2.) despite its low altitude in relation to the tree line, i did not hear it. at first, i thought it was a passenger airliner because of the lights & beacons, and i kept expecting to hear engine noise. i have two ac units, but i do not believe either was cycled on during the sighting. there is a fairly busy railroad nearby, but i do not believe there was a train running at that time. after about five seconds of not hearing anything, i became fairly excited and looked through the binoculars, but i couldn't make out any structure or windows despite (or possibly because of) the bright lights. i stood up and watched it continue on a straight trajectory for about 15 seconds longer - probably five of that fifteen seconds through the binoculars - changing my position to keep a clear view for as long as possible before it disappeared over the tall post oak forest directly behind my house. i walked up to my back porch (my house is on an east\\west slope) to see if i could see the craft emerge to the south, but i didn't see it again. i was so mesmerized by the craft, and so preoccupied with trying to figure out what it was, it never entered my mind to use the small digital camera in my pocket. obviously, i wish i'd have thought to do so. while i cannot explain why i wouldn't have heard it, i'm certainly willing to concede the craft may have been an airplane headed for denton municipal airport or dfw airport, but considering its low altitude and what i perceived to be its large size, the lack of noise and highly irregular flight path prompted me to report it. it was not a helicopter. ambient noise is pretty low out here, and i can't recall a time when i've ever seen any aircraft that low & near, yet been unable to easily associate it with the sound of an engine or engines."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","City":"Undisclosed","Case Number":"12233","Latitude":"31.973199","Region":"Texas","Country":"United States","Object Shape":"Other","Disposition":"Unknown","Date Submitted":"08/27/2008 12:50 UTC","Summary":"Craft w/orange lights & 2 blue beacons flying NE to SW direction. Close. Low. SILENT.","Date of the Event":"08/27/2008 12:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.973199,+-99.898633(12233)&iwloc=A&hl=en\"> mufon case (12233) map </A>","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}