{"Weather Factors":"Unknown","Log Number":"","Longitude":"-85.037385","Date of the Event":"08/19/1973 08:00 UTC","files":["/var/www/straped/mufon/html2text/1223.html.txt","/var/www/straped/mufon/org/1223.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.6274,+-85.037385(1223)&iwloc=A&hl=en\"> mufon case (1223) map </A>","divs":["Sighting DetailsWas reading the newspaper and heard the dogs barking on the beach. Curiousabout the barking I went out to check. The dogs were barking at this light andsince there is a little reflected light from an outside light I could see thehair standing up on their backs. They seemed more excited than frightened. Myfirst thought was that a ship was anchored in the bay. This idea was quicklyeliminated because of the size of the light. The bay was very rough but thelight remained stationary. It appeared to be about 10 feet in diameter at thatdistance, and fifty to one hundred feet above the water, and there was a strongreflection from the water. There was no indication of what the light could be. Have seen many ships, helicopters, etc., but nothing similar to this. Wouldhesitate to call the object a UFO but also could not say it wasnt. There wasno sound from the light but the rough water would or could have hidden it. Watched the light for five or ten minutes then scurried to the house forbinoculars. Just as I adjusted the binoculars the light disappeared as thoughsomeone had turned a switch. After the light had disappeared the dogs continuedto growl and act a little excited but followed me when called. I estimated thedistance at five miles but it could be off a mile. Quite familiar withdistances because of experience as a pilot and as a member of the Coast GuardAux. Since I live on Whitefish Bay and fish, and patrol it my judgement isfairly good but not infallible."],"Object Shape":"Unknown","Sighting Duration":"00:10:00","Case Number":"1223","Disposition":"Unresolved","Date Submitted":"08/19/1973 08:00 UTC","Latitude":"46.6274","Region":"Michigan","City":"Paradise","Viewing Distance":"Over One Mile","Country":"United States","Object Features":"Undisclosed","Summary":"Whitefish Bay-Lake Superior - Bright White Light","Object Flight Path":"Stationary","Tags":"City","trends":["There have been 2 other sightings in Paradise","There were no other sightings in Paradise on or around August 19th 1973"],"Source":"MUFON"}