{"Date Submitted":"10/26/1996 02:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","Disposition":"Hoax","Date of the Event":"10/26/1996 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.445171,+-73.054046(12231)&iwloc=A&hl=en\"> mufon case (12231) map </A>","Region":"Connecticut","Case Number":"12231","Latitude":"41.445171","Object Shape":"Circle","trends":["There have been 2 other sightings in Beacon Falls","There were no other sightings in Beacon Falls on or around October 26th 1996","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/12231.html.txt","/var/www/straped/mufon/more/12231_submitter_file1__SUNP0186.JPG","/var/www/straped/mufon/more/12231_submitter_file2__SUNP0190.JPG","/var/www/straped/mufon/more/12231_submitter_file3__RonniPics222.jpg","/var/www/straped/mufon/org/12231.html"],"Weather Factors":"None","Tags":"City","Longitude":"-73.054046","City":"Beacon Falls","Source":"MUFON","Country":"United States","Object Features":"Undisclosed","Log Number":"US-08272008-0002","divs":["Sighting DetailsHi, how are you? When I was 36 I was going to my sons basketball game in the early afternoon at his elementary school which is a street away from where we lived. I crossed the street and was on the street which is between where we used to live and the school. Something made me stop and look up. In the southern sky I saw a big orb shapped UFO with smaller ones surrounding it, I can't remember if they were scattered around or circular around the bigger one, they were just sitting there watching me. I stood there looking at it. I then just walked away. When I got into the game I looked at the scoreboard and I did not get there until after the second period when I should have been early. This happened in Beacon Falss CT 06403 While I was writing this I am listening to John Joseph Corbett Jr and the John Corbett Band's Witchita and a evil alien came on my CD player and told me to stop it. It is 1:50 in the morning. The evil ones also go on my MP3 player. When they do my good fine Alien Fathers tell the evil aliens off and they stop. I have pictures of things, I do not know if they have anything to do with Aliens but I do know it has to do with Indian. I am enclosing a few that I already showed people. I am writing a book called I am Just a Girl With Mental Illness But I am Good To Go. It is about my experiances through life, including the ten times I was hospitalized for mental illness which I do not have. I have acute hearing."],"Summary":"I saw many orb shapped ones"}