{"Source":"MUFON","Latitude":"39.776153","Summary":"UFO over Cumberland, IN lights up, goes dim as it leaves trail","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12232.html.txt","/var/www/straped/mufon/more/12232_submitter_file1__ufostreak.jpg","/var/www/straped/mufon/org/12232.html"],"Sighting Duration":"Undisclosed","City":"Cumberland","Object Features":"None","Object Shape":"Star-like","Date of the Event":"08/09/2008 04:00 UTC","Region":"Indiana","Tags":"City","Weather Factors":"None, Does Not Apply","Date Submitted":"08/09/2008 04:00 UTC","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"12232","map":"<A HREF = \"http://maps.google.com/maps?q=39.776153,+-85.957204(12232)&iwloc=A&hl=en\"> mufon case (12232) map </A>","Log Number":"US-08272008-0003","divs":["Sighting DetailsMy wife and I have a new puppy, and if you've had one you know that they have to piss every time they wake up from a slumber. She sleeps in the bed with my wife and I and she was awake and restless around 4-ish. I took her outside on our back porch hoping she would go to the yard. As she started to pee on the concrete, i picked her up and walked out into the yard and sat her down, and patiently awaited numbers 1 and 2 from the little pup. The skies were mostly clear so I took a deep breath the fresh air we have at night lately and was looking up to the south when something like a fast moving bird coming from the east caught the corner of my eye and in a split second as I started to look toward it... the \"bird\" (which it clearly wasnt)lit up and became a washed out amber (very bright almost white)streak that then became two streaks that were connected at both ends like an oval(open in the middle) then shifted back to a single streak before the lights went dark and the object shot off into the west, and it appeared to be going higher into the sky during this sighting. I was able to see it after the lights blacked out for a split second just as I did when it caught my eye initially. The speed was faster that any jet fighter that I have ever seen (been to many airshows) and left me with some serious goosebumps."],"trends":["There have been no other sightings in Cumberland","This sighting has never been favorited."],"Longitude":"-85.957204"}