{"Case Number":"12243","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-08282008-0001","files":["/var/www/straped/mufon/html2text/12243.html.txt","/var/www/straped/mufon/more/12243_submitter_file1__DSC_0987.JPG","/var/www/straped/mufon/org/12243.html"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Flash, Sphere, Star-like","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Weather Factors":"None","Summary":"metoric in appearance. broke into 2 arials. turn into clouds at the end.","Region":"South Carolina","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around January 31st 2005","This sighting has never been favorited.",""],"Tags":"City","Date Submitted":"01/31/2005 11:00 UTC","City":"Charleston","map":"<A HREF = \"http://maps.google.com/maps?q=32.884652,+-80.036939(12243)&iwloc=A&hl=en\"> mufon case (12243) map </A>","Date of the Event":"01/31/2005 11:00 UTC","divs":["Sighting Detailsgoing outside to smoke. smoking in barracks not allowed. a coworker steps outside to join me. everyone else (5 or so more friends) inside still watching a movie. i see an aircraft approaching perpendicular towards our airstrip. too high. coming in steep. no blinking lights to identify it. i point it out to my friend. we watch, expecting to see USAF aircraft pursue it. minutes go by. moving steeper in a downward decline, gradually faster. i observe that it may be a meteor, in which case we better leave the top floor and move to lower ground. aircraft very large and very bright by now (approx. 4:00\" into sighting). everyone steps out to watch. all of us are pretty scared now. as soon as we all gather to watch, a large light ring flares, radially away from the light, parallel to the earth. i now realize that it is indeed very high up. our fear freezes us all into pure silence. we all KNOW that it's a comet or something, and coming directly towards were we stood. a few seconds after light ring, the object halts instantly. flashes brightly. breaks into 2 pieces. one much smaller. the other maintaining original size. resumes descent- in opposite directions. both objects, moving quite fast but easy to discern shape and dimension, appear to both be spherical and moving intelligently. descent turns into upward curves upward- both, still in opposite directions. curves turn to paths away from one another, parallel to the earth. smaller piece (on the left- now at 6-7\" into sighting) halts entirely. looms. larger piece, a few seconds later halts. looms. both flash very brightly and turn off. not disappear, but simply stop glowing. can't really recall how we knew that they were still there but everyone in the group commented on just that. what was a clear, cloudless night soon changed when enormous (cumilonimbus) clouds appeared where the two light spheres once were. exactly where they once were. the stars obscured by clouds that now grew and grew to cover them. over the clouds, however, it appeared that there was also black looking smoke coming from those two points. did they explode?get shot down? cross dimensions? anything is possible from this point, really. total time spent on the event was approx. 15\" minutes or so."],"Country":"United States","Latitude":"32.884652","Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-80.036939"}