{"Country":"United States","Date of the Event":"11/30/1965 12:00 UTC","Date Submitted":"11/30/1965 12:00 UTC","Object Features":"Unknown","Source":"MUFON","Log Number":"US-08282008-0002","Latitude":"38.692046","Case Number":"12244","map":"<A HREF = \"http://maps.google.com/maps?q=38.692046,+-121.369264(12244)&iwloc=A&hl=en\"> mufon case (12244) map </A>","Tags":"City","Longitude":"-121.369264","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsA section of Roseville Rd., in Sacramento Country, travels directly through the now defunct McClellan AFB. I was traveling on this part of Roseville Rd. with a female companion, in a southwest direction on , what I recall being a late spring or early fall evening in 1966 or early '67. We witnessed the sudden appearance of a ball of green fire to our right. I assumed it was some sort of explosion from the base until I noticed that not only did it not dissipate, it moved very close to our vehicle and began to follow along side. Its color was quite remarkable but there was no mistaking it to be fire. It had a tail, yet I do not recall any smoke being emitted from its tail section or from above it. It did not appear menacing but left no doubt, in my mind, that it was intensely observing us. I don't recall it making any sound. It was well within 100 feet of our vehicle and within 30-40 feet from the ground and traveling at approximately 45mph. It seemed to change intensity of color but remained green. When I slowed, it slowed and held its position. It was a fairly large ball and I remember thinking it strange that there were no alarms or any detectable activity from the military base. As I remember, the event occurred for approximately 30-45 seconds, maybe longer. There was another strange occurrence that night that I have never fully understood, so I will not attempt to explain it at this time. I've never reported this before because it seemed like just another unexplainable oddity and the object did not fit the profile of any UFO I had ever heard of. Recently I ran a search to see if anyone had ever seen a green fireball anomaly and was surprised to find others have seen them. I would like to add a pet peeve, if I may. I've always been puzzled as to why NASA scientists have put so much effort into researching the possibilty of life ever existing on Mars? The planets are moving toward the suns gravitational pull, not away from it. So if there were any signs of life ever existing on another planet, it would most likely be found on a planet that, at one time, held the same solar position as earth and that would be in front of us, not behind us. Shouldn't they be looking at Venus?"],"Summary":"Green fireball followed vehicle, at upper right side.","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12244.html.txt","/var/www/straped/mufon/org/12244.html"],"Weather Factors":"None","City":"North Highlands","Object Shape":"Fireball","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Region":"California","trends":["There have been 6 other sightings in North Highlands","There were no other sightings in North Highlands on or around November 30th 1965"]}