{"Longitude":"-92.969356","Weather Factors":"None","Object Features":"None","Summary":"Sphere shaped approximately 15 feet in diamater. Very shiny, like polished chrome.","Log Number":"US-08282008-0005","Country":"United States","files":["/var/www/straped/mufon/html2text/12247.html.txt","/var/www/straped/mufon/org/12247.html"],"Tags":"City","trends":["There have been 2 other sightings in Macks Creek","There were no other sightings in Macks Creek on or around October 31st 1989"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.966423,+-92.969356(12247)&iwloc=A&hl=en\"> mufon case (12247) map </A>","Date of the Event":"10/31/1989 12:00 UTC","divs":["Sighting DetailsI was 18 years old it was deer season and my father and I were out hunting not too far outside of town. We always hunted in the same area and parked the truck in the same area. He would go over the hill to his favorite spot and I would do like wise which was about halfway up the next hill. From my vantage point I could clearly see the truck parked on top of the hill. We always hunted like this so that a hill would be between us allowing for a greater firing range without worrying about hitting each other. The day progressed like usual and we met at the truck for lunch about 1PM. After lunch, we again went to our respective spots. I went back and sat against my usual tree. Suddenly I heard a noise in the leaves, I look over and see three does standing about 20 feet away. I was surprised that they were there and never saw them coming. The woods are fairly open and I just don't see how I didn't see them. I fumbled with my rifle in surprise and as they ran off I noticed that things looked different. I checked my watch and over two hours had passed! I had never fallen asleep hunting before. I turned to look at the truck to see if my father had returned. Sitting next to the truck was a sphere shaped (perfectly round) very shiny, chrome like something. I had no idea what it was. It was about 15 feet in diameter. I looked back at the deer running away for just a matter of seconds and when I looked back at the truck, the sphere was gone. Not too long afterwards my father returned to the truck and signaled that it was time to go home. When I returned to the truck I notices a flattened area in the grass off to one side. I can't be 100 percent certain that it wasn't there before, but I remember looking for where the deer had bedded down for the night and I don't remember any flattened grass that close to the truck. I asked my father if anyone else had driven up there and he said that noone had. I really don't know if this is the \"missing time\" phenomenon that I have read about, I truly may have fallen asleep. But I don't see what else that sphere could be. The sun was over the hill and there no other vehicles parked there."],"Viewing Distance":"101-500 Feet","Object Shape":"Sphere","Date Submitted":"10/31/1989 12:00 UTC","City":"Macks Creek","Source":"MUFON","Disposition":"Unresolved","Region":"Missouri","Case Number":"12247","Latitude":"37.966423","Sighting Duration":"Undisclosed"}