{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-08282008-0007","Summary":"round shiny object extremely high in atmosphere moving slowly from N to S, splitting into 2 then back to one , then moved distintly towards the west","Case Number":"12249","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 65 other sightings in Reno","There was one other sighting in Reno on or around August 28th 2008"],"Date Submitted":"08/28/2008 04:25 UTC","divs":["Sighting DetailsNoticed object small round and reflecting sun light very high in atmosphere, coming from the north moving distictly towards the south east at a very slow rate, made some quick movements to the right then to the left but resumed the slow movement, obviously being propelled by its own power(not the wind) then it split into two distinct objects, then back into one, then into two again, then back to one all the while continuing on the the same path towards the south west. Then at one point it changed course and began heading towards the west to south west. All the time the object was in view it was getting higher and higher into the atmosphere but maintaining a very distict rate of travel. I along with several co- workers witnessed this, and one saw the \"split\" as well. I was working at the time,in a 4 story building, I am on the second floor facing directly north with several very large windows for view in all directions. I noticed the object simply because of standing up, and looking out into the sky as it was very clear and bright and the object immediately caught my eye. At first I thought it was a balloon, but then it became very apparent this object was moving under its \"own\" power and not by the wind and because it continuted in a distinct course I ruled out a balloon. This is my first day light sighting it was interesting, and I was glad I was not the only one witnessing it for the first time. I lost sight of the object simply because it moved out of my range of view in the building and because I was working I was unable to go outside to follow its movement."],"Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"39.538203","City":"Reno","Longitude":"-119.812183","Disposition":"Insufficient Data","Object Shape":"Circle","Region":"Nevada","Date of the Event":"08/28/2008 04:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.538203,+-119.812183(12249)&iwloc=A&hl=en\"> mufon case (12249) map </A>","files":["/var/www/straped/mufon/html2text/12249.html.txt","/var/www/straped/mufon/org/12249.html"]}