{"Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.630512,+-90.195224(12245)&iwloc=A&hl=en\"> mufon case (12245) map </A>","Case Number":"12245","Disposition":"IFO","Summary":"Star or Planet like UFO moving NW! Plus an Update!","Viewing Distance":"Unknown","divs":["sighting detailsthis happen on august 25th, 2008 around 9:30 pm central time in saint louis. i'm a usual stargazer as i love to look at the sky and admire its beauty in our front yard. i have had ufo experiences previously so i also go outside to see if i can see any activity up in the sky. (please read below for more!). i saw this star-like ufo traveling north west. it was extremely high up. it seemed hundreds if not thousands of feet above the atmosphere. it has no blinking lights as it looked like a star. it was traveling straight and slow and then it slowly disappeared because of the streetlight. when i saw it i was excited and had my eyes on it for most of the time and i knew it wasn't a plane and then with further observing i knew it wasn't any earth vehicle or satellite, it was one of them! ----------------------------------------------- previous sight & information this happen on august 11th, 2008 around 9:30 pm central time in saint louis. i'm a usual stargazer as i love to look at the sky and admire its beauty in our front yard. i have had ufo experiences previously and i also go outside to see if i can see any activity up in the sky. (please read below for more!). i saw this star-like ufo traveling down south. it was extremely high up. it seemed hundreds of feet above the atmosphere. it has no blinking lights as it looked like a planet. it was traveling straight and slow and then it slowly disappeared which appeared the object had cloaked. when i saw it i was excited and had my eyes on it for most of the time and i thought is that a plane and then with further observing i knew it wasn't any earth vehicle or satellite. i have had many experiences like this in the past since 2001. i have seen several like this one this year. i seen a ginormous ufo a few weeks prior which appeared to be as big as jupiter traveling north which behaved like the one i saw on the 11th. i have seen these behave different in many ways. i have seen them travel back and forth, and cloak and uncloak like a peek-a-boo or a now you see me, now you don't game. i have recently seen one that was going down east which the entire object was flashing but it was a very slow flashing characteristic. now, i have seen two that were not like these a couple years ago. these were on two separate days. they both were extremely high but had a very unusual red flashing characteristic and the one went into hyperspace or warp speed like you see in the star wars and star trek films. that was incredible to witness! i believe these red ones are man made but has alien technology. i have been wondering so long what these are and who\\what might be piloting them. it is a wonderful but creepy feeling that i get when i see these objects because i wonder are they the grays, the insectoids or something that we know absolutely nothing about or all of these different species. by seeing these ufos i know that we are not alone! if anyone has any answers and\\or has had these experiences please contact me at capri1981@aol.com with your information!"],"Object Flight Path":"Undisclosed","Log Number":"US-08282008-0003","files":["/var/www/straped/mufon/html2text/12245.html.txt","/var/www/straped/mufon/org/12245.html"],"Country":"United States","City":"St Louis","Object Features":"Undisclosed","Weather Factors":"Unknown","Longitude":"-90.195224","Date of the Event":"08/25/2008 09:35 UTC","Date Submitted":"08/25/2008 09:35 UTC","Source":"MUFON","Object Shape":"Star-like","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around August 25th 2008"],"Region":"Missouri","Latitude":"38.630512"}