{"Region":"Wisconsin","Country":"United States","Case Number":"12246","Date of the Event":"10/15/2005 09:30 UTC","trends":["There have been 23 other sightings in Madison","There were no other sightings in Madison on or around October 15th 2005"],"Log Number":"US-08282008-0004","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=43.082862,+-89.39868(12246)&iwloc=A&hl=en\"> mufon case (12246) map </A>","Date Submitted":"10/15/2005 09:30 UTC","Disposition":"Insufficient Data","Summary":"UFO sighting exhibiting the effects of a possible Jump Drive flight process.","Object Shape":"Star-like","divs":["Sighting Details This sighting took place in late October, 2005 at approximately 9:30PM CST. Being an amateur astronomer since childhood, I stepped outside just before going to bed for a casual look at the night sky. I did not have my telescope or binoculars with me, I now wish that I did. While I was looking to the west there was nothing unusual to observe only dim to moderately bright stars, nothing inusual. Then all of a sudden a very bright object just appeared out of knower. It was as if someone had turned on a light switch. It did not fly into view it just appeared. This took me by total surprise. The object was no bigger then a bright star and had a slight yellowish hue to it, similar to the planet Jupiter when it is at its brightest. It was completely motionless just staying in one spot. Its glow was steady and did not have the flickering effect noticed when you look at a star. I could not distinguish any shap to the object only its bright glow. At first I thought I had observed a Nova burst an exploding star. I continued to observe the object for around ten minutes, it did not move but stayed in one spot. Not knowing what to expect next I stayed outside and did not want to go inside for my binoculars and possibly miss something. I then noticed that the object was changing position, moving very slowly to the south. Its movement was so slow that if it was not for the background stars as a reference you would not have noticed that it was moving. I continued to watch the object for around twenty minutes until it disappeared behind a tree line in the distance. The object did not change in brightness or speed. Its movement was very smooth and made no sound nor give off any noticable exhaust or trial of any kind. As I mentioned above I have been into astronomy since childhood and have never experienced such an event. There is nothing celestial that could account for this incident. Meteors, comets nor asteroids could not account for what I observed. Celestial objects do not appear out of knower, hover in one place for several minutes then slowly move off and disappear. Having been in the US Air Force from 1964-67 I had considerable experience observing aircraft in flight (single & formation flying) during the day and at night. No aircraft that I know of could account for what I observed. This was not a coventional aircrfat unless it was some form of black box stealth design which is possible but I highly unlikely It does not fit our current stealth designs. It was during a recent TV broadcast covering interstellar space flight possibilities that one of the scientists discussing UFOs felt that if UFOs are real it was possible that they could be using what he called a Jump Drive process. I did not really undewrstand what he was saying except that a space craft could be at one place in time, go thriugh a Jump Drive process and reappear at another place an time. Some knd of worm hole or something. Since the object I observed just appeared out of knower could it have been the result of a Jump Drive process. It also appears that UFOs have ther ability to travel at phenominal speeds and can instantly stop on a dime so to speak. It also appears that they are not plauged by atmospheric friction problems as our shuttle craft and other re-entry vehicles experience. With that in mined, could the object I observed have been a space craft traveling on a direct path toward the earth at such a phenominal speed which after entering our atmosphere and air space had just suddenly stopped which accounted for the objects sudden appearnce. I don't know the answer. I only bring this sighting to you attention in hopes of providing something of value to the UFO investigations."],"Latitude":"43.082862","files":["/var/www/straped/mufon/html2text/12246.html.txt","/var/www/straped/mufon/org/12246.html"],"Longitude":"-89.39868","Sighting Duration":"00:45:00","Source":"MUFON","City":"Madison","Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown"}