{"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Caboolture","There were no other sightings in Caboolture on or around August 29th 2008"],"Weather Factors":"Windy","Date Submitted":"08/29/2008 08:10 UTC","Object Flight Path":"Stationary","Summary":"UFO hiding in clouds.","Disposition":"Unresolved","Object Features":"None","divs":["Sighting DetailsI was admiring the storm clouds over the Glasshouse Mountians as I waited for the bus, watching them drift. Early on I noticed one cloud which I thought 'Hey, that's a UFO shape!' but figured it was a cloud. I continued to see it as I waited, the 'cloud' didn't move at all even though the huge storm clouds were drifting along around it... I was amused, I took photos of it. The top of it was fluffy, like a cloud, like a topping over the smooth white saucer ovel shape which was why I didn't think anything more of it, but it was very very white where as the clouds around it were all that dark grey stormy look. The next part happened all at once. I saw an old fashioned plane entered the air in the area, slowly, quietly. It seemed to turn, so that it was narrow below the fluffy part... like an ovel, like a () shape, then as the plane came closer it suddenly vanished... no sign of it whatsoever... leaving behind the fluffy cloud part that'd been on top. I was taking photos as I watched the old fashioned plane, and this cloud, (I can't zoom in with this camera so it was impossible NOT to) so I have the series of photos... I will get them off the camera as soon as possible."],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"-27.083469","Date of the Event":"08/29/2008 08:10 UTC","City":"Caboolture","Case Number":"12253","Log Number":"AU-08282008-0011","Region":"Queensland","files":["/var/www/straped/mufon/html2text/12253.html.txt","/var/www/straped/mufon/org/12253.html"],"Object Shape":"Disc, Oval","Longitude":"152.951689","Country":"Australia","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-27.083469,+152.951689(12253)&iwloc=A&hl=en\"> mufon case (12253) map </A>"}