{"Case Number":"12254","divs":["Sighting Details It was a clear moonless night with stars visible and all. I had just taken my dog outside to relieve himself and was walking him out into the grass field. I've recently taken a liking to spotting satellites orbiting the earth at night, so I was just standing out there staring up at the sky trying to notice any 'moving stars'. After maybe eight minutes of being outside, I noticed a slight flicker to my right in the sky. So I turned and concentrated at that area but couldn't see anything. I then resumed looking back directly up in the sky. After 10 seconds, I noticed a slight flicker in the same spot and had decided to just keep looking in that direction. Again I saw the flicker and decided it was obviously a plane and was able to ignore it as I went back to trying to spot satellites as I pass the time. Perhaps 20 seconds later, I looked back to the same spot again and noticed a 'plane' flying across the sky. Since I hadn't found anything of interest in the sky, I decided to just watch that 'plane' out of boredom. After a while of staring at it, I began to notice and realize things about it. The first thing I noticed was the speed it was traveling and the size of the 'plane'. At first glance, it seemed it either had to be a really huge plane far off in the distance. Or it had to just be an average sized plane just not so far in the distance. If it were to be the latter, then it would have still had been traveling extremely slow for a plane. I figured when planes go somewhere... They actually GO SOMEWHERE. This 'plane' was moving, just not very fast. I assumed it was just a plane doing a routine survey or something... The second thing I noticed about this 'plane' were the lights. I realized that any other plane I've ever seen at night have had constantly flashing lights and usually just two, perhaps a blue and a red. But this 'plane' was different. The lights on it weren't flashing at all. It also had three lights. Two amber colored lights, and one red light about half the size. So I thought that was odd, but again figured maybe some planes are like that. When I first saw it clearly with the lights, all I could really see were two lights at first, a bright amber and a red. Since it was moving to my left with the bright amber light ahead, I could clearly see that the red light was the tail of the 'plane' (even though I could not see the body of the UFO, just the lights). The lights were also exactly even with each other. The two bright amber lights in front, while the red in the back; pretty much making a triangle. Again, I'll remind that since it was flying from my right side to my left side across the sky, all I could clearly see were two lights. While staring at the 'plane', I started to think about how I've always wanted to witness a UFO and perhaps have it abduct me. I sort of laughed out loud and thought \"Yeah, that would be silly. But perhaps I would be willing to be abducted by aliens, as long as I wasn't harmed...\". Just at that very instant, I noticed the 'plane' change direction, but couldn't tell at first what it was doing. After two seconds, I saw the two bright amber lights and knew it was facing in my direction but still wasn't aware that it was coming right at me. I stood my ground just trying to make it out better then realized that it was indeed coming right at me. So it was then when I was starting to freak out that it started to head this way right when I wanted it to come this way... Regardless, I still stood there, but ready to dart to the house. After another couple seconds of watching it come towards me, I decided to start walking towards the house while keeping my eye on it. It was amazing at how far away I thought it was and to see it start coming at me so quickly. The lights started getting really bright, large, and closer really fast. I then decided to start running as fast as I could when my dog started bolting to the door. I just continued running towards my porch and as I looked back, I could see that it was just so close and had the chill on my back as if it were right on me and was going to get right on top of me before I could get to my door. I was just praying to Jesus and just kept running as fast as possible. I managed to reach my door just before it would have flown over me. I quickly got my dog inside but couldn't see the UFO at all as I had my head out the door for a couple seconds. That was when I started running down to my mom's room to explain to here what just happened. As I had gotten into her room, my mom was talking on the phone and I was breathing heavy. She noticed me and urgently asked me what's wrong. I then started to tell her that I was chased by a UFO in the field. While I explained to her my story, I realized that the UFO didn't make any sound at all during my experience. While I was running towards my house, three scenarios came into my head. All giving me enough reason to want to freak out and run for cover. A) It was a plane that for some reason had made a 90 degree angle and started to make a crash landing towards me. B) It was an alien UFO that had decided to respond to my thoughts and come abduct me. (perhaps coincidence with it responding to my thoughts) or C) It was purely demonic. Either way, any of these were good enough reason for me to want to run. If planes do make random right angle turns, speed up, and get lower to the ground, then sure I'll accept the fact it was just a plane. Otherwise I know it was something else... Demonic force or alien UFO, I know what I saw and it was the scariest experience of my life.. And I've had really scary experiences in my life..."],"Weather Factors":"None","Log Number":"US-08292008-0001","Date Submitted":"08/28/2008 10:20 UTC","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.152488,+-95.145152(12254)&iwloc=A&hl=en\"> mufon case (12254) map </A>","Source":"MUFON","Object Shape":"Unknown","Object Features":"Unknown","Tags":"City","Region":"Iowa","Date of the Event":"08/28/2008 10:20 UTC","trends":["There have been 4 other sightings in Spencer","There were no other sightings in Spencer on or around August 28th 2008"],"Sighting Duration":"00:13:00","files":["/var/www/straped/mufon/html2text/12254.html.txt","/var/www/straped/mufon/org/12254.html"],"Object Flight Path":"Path with directional change","Longitude":"-95.145152","Viewing Distance":"101-500 Feet","Summary":"Saw three lights far in the distance going to my left then taking an immediate right angle turn towards me. Getting faster, lower, closer.","City":"Spencer","Latitude":"43.152488"}