{"Date of the Event":"08/13/2007 12:00 UTC","Weather Factors":"Unknown","Summary":"Conical object noticed on a picture of lenticular clouds near Yosemite Park, California","Sighting Duration":"Undisclosed","Latitude":"37.965242","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Lee Vining","There were no other sightings in Lee Vining on or around August 13th 2007","This sighting has never been favorited.",""],"Tags":"City","City":"Lee Vining","files":["/var/www/straped/mufon/html2text/12257.html.txt","/var/www/straped/mufon/more/12257_submitter_file1__IMGP4368.JPG","/var/www/straped/mufon/more/12257_submitter_file2__OptioS_3QtrView.jpg","/var/www/straped/mufon/org/12257.html"],"Longitude":"-119.112853","map":"<A HREF = \"http://maps.google.com/maps?q=37.965242,+-119.112853(12257)&iwloc=A&hl=en\"> mufon case (12257) map </A>","Source":"MUFON","divs":["Sighting DetailsI was touring the United States on my Harley and had just crossed the Yosemite Park in the morning of the August 13th 2007. I was sitted a a table in a restaurant at Lee Vining, California. By the window beside me, I was seeing lenticular clouds over the Tioga Pass nearby. I took a picture of those clouds through the window. I know that this type of clouds are sometimes mistakenly beleived to be UFOs. It is just lately when I look back at that picture that I found that dark conical object seeming to hover i the center of the picture. I thought it may be a fly that was on the window when I took the picture but the zooming of the object reveals clearly light and shadow on it that could not be on a fly in a window. I have to admit that when I found it I was and I am still very excited about it. As I did not even noticed it when I took the picture, I cannot tell how it was moving or if it was making any sound, etc. Looking at a map I saw that the place is just about 150 miles from area 51. Could it really be a UFO? Please tell me what it is."],"Viewing Distance":"Unknown","Log Number":"US-08292008-0004","Region":"California","Object Shape":"Cone","Country":"United States","Date Submitted":"08/13/2007 12:00 UTC","Object Flight Path":"Undisclosed","Case Number":"12257","Disposition":"IFO"}