{"Source":"MUFON","divs":["Sighting DetailsThis was a daylight sighting on a very clear and calm day that I noticed a small round metallic object very high in sky (this is in Reno NV) coming from the N moving directly over the city, distinctly moving to the SE, again very slowly, at one point split into two objects then returned to one, and repeated then returned to one. Made several quick moves to the right then to the left but maintained distinct course towards the SE. The object was not affected by upper atmosphere wind or anything and clearly appeared to be powered by its own means. At one point after about 10 minutes it began a slow change of course towards the SW, again movement was very slow and deliberate. I work in a 4 story building on the 2nd floor with ,many large windows facing directly to the N with a clear view of the north, west and east. So , when I turned around at my desk and stood up this object caught my eye immediately and as I began to watch I realized it was something other than a stray balloon . It was so far up in the sky I cannot estimate its size, the only thing I can use to estimate it's size and distance from me was a commercial jet which was up in the sky moving from S to N a short time after I started watching the object and as it flew \"under\" it, I could see the object was very very far out. This object was witnessed by several of my co-workers who also feel its almost impossible for this to be a balloon as it clearly had a course of travel. As it moved towards the SW I lost sight as it flew out of range and I was unable to go outside to continue watching it. Total time that I saw this object was about 15 minutes."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.535233,+-119.809603(12251)&iwloc=A&hl=en\"> mufon case (12251) map </A>","Summary":"small bright metallic object moved from N to SW very slow rate of speed , splitting into 2 then returning to 1, then repeated","files":["/var/www/straped/mufon/html2text/12251.html.txt","/var/www/straped/mufon/org/12251.html"],"Disposition":"Insufficient Data","Tags":"City","Country":"United States","Longitude":"-119.809603","City":"Reno","Viewing Distance":"Over One Mile","Latitude":"39.535233","Case Number":"12251","Object Shape":"Circle","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Region":"Nevada","Object Features":"None","Date Submitted":"08/28/2008 04:25 UTC","Weather Factors":"None","Date of the Event":"08/28/2008 04:25 UTC","Log Number":"US-08282008-0009","trends":["There have been 65 other sightings in Reno","There was one other sighting in Reno on or around August 28th 2008"]}