{"Weather Factors":"Does Not Apply","Source":"MUFON","divs":["sighting detailsi never thought about reporting this until tonight listening to coast to coast. my wife and i about 10 yrs ago were in palmdale ca (where my uncle retired from northrup as the head qc guy and i toured northrup with him in 1969 when i was visiting and in the usmc in mcas el toro ca)... i saw only one small cloud in the sky and with my sunglasses (without them yo could still see it but not as good) could clearly see a black light slowly rotating counterclockwise. the black light (no other way to describe it as it was black and clear but faint like something you could see through) was broken (spaces between the black light parts) and also curved being small near the cloud's edges and wider (and curved) as it went out from the cloud. the edges of it ended in a perfect circle extending about twice the size of the cloud outward from it. we just looked at it as it stayed there and after about 1\\2 an hour got bored and left. i noticed it was very odd that not one person was there to share this sighting with but it was in the middle of the day in a residential area that my wife was a us census taker in at the time (which i made her quit that day because it is not safe to do as far as i was concerned). that made me think that a lot of this stuff is government stuff. i also took digital pics of a rainbow over a radio antenna tower for kvta in ventura ca near my old home and in the pics there were lots of yep,,, ufos that looked just like the flying hat ones. i thought they might get energy from the towers or perhaps they can not see them but notice a strange energy coming from them in that area and investigate it??? just my thoughts about it."],"Case Number":"12267","Log Number":"US-08302008-0006","Summary":"Hiding in the onlu cloud in sky - black rotating light extending from the cloud.","files":["/var/www/straped/mufon/html2text/12267.html.txt","/var/www/straped/mufon/more/12267_submitter_file1__ufopic.JPG","/var/www/straped/mufon/org/12267.html"],"Date of the Event":"01/01/1998 12:00 UTC","Latitude":"34.27566","Tags":"City","City":"Ventura","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"01/01/1998 12:00 UTC","Longitude":"-119.227385","trends":["There have been 17 other sightings in Ventura","There were no other sightings in Ventura on or around January 1st 1998","This sighting has never been favorited.",""],"Object Shape":"Other","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.27566,+-119.227385(12267)&iwloc=A&hl=en\"> mufon case (12267) map </A>","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Region":"California","Disposition":"Unknown"}