{"Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=33.69442,+-78.878244(12269)&iwloc=A&hl=en\"> mufon case (12269) map </A>","Viewing Distance":"101-500 Feet","Longitude":"-78.878244","Object Flight Path":"Straight-line path","Case Number":"12269","Source":"MUFON","Date of the Event":"08/29/2008 09:20 UTC","Disposition":"Unknown","Sighting Duration":"00:00:45","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around August 29th 2008"],"Object Shape":"Bullet, Missile, Chevron, Flash, Triangle","Tags":"City","Log Number":"US-08302008-0008","Weather Factors":"None, Heavy","Object Features":"Unknown","Date Submitted":"08/29/2008 09:20 UTC","Latitude":"33.69442","Summary":"Flash of light turned into shooting star which turned into a fast descending triangle","divs":["Sighting DetailsLast night, I was driving in the car through my girlfriend's neighborhood. After turning a bend in a dense residential area, I noticed a bright flash of light about 2-3 times the size of a normal star in the night sky. I thought it was odd, but about a second later, what resembled a shooting star flew out of the bright star-like object. The shooting star was only visible for a second, as it turned into something that we thought was a plane. The bright star and the shooting star trail both disappeared simultaneously and my girlfriend and I thought we were imagining things. From the end of the trial, what appeared to be an airliner making a descent toward the nearby airport was flying in the normal landing air pattern. We noticed that, while at first too fast, it slowed down to the point that we wondered how it would make it all the way to the airport. It then began to descend rapidly and we thought it was crashing. As we were driving, we got directly under the object and got out of the car to look at it. As it continued to descend, we saw one blinking light on the front, similar to an airliner, but three lights arranged in the shape of a triangle. The lights of the city were shining in the distance and the object caught some of that light and we were able to make out a black triangle flying through the sky. We watched in awe, not believing what we were seeing, as it continued to descend. We lost sight of the object after it passed the treeline. We both looked at each other and just asked 'Did you see that?' at the same time. We walked around outside for a minute or two when we heard a series of approximately 15-20 loud booms and flashes of light off in the direction that we lost sight of the object. At this point, we were very weirded out and parked the car in her driveway and headed inside."],"files":["/var/www/straped/mufon/html2text/12269.html.txt","/var/www/straped/mufon/org/12269.html"],"City":"Myrtle Beach","Country":"United States"}