{"Source":"MUFON","divs":["Sighting Details My husband and I were watching a movie video, andthe object was seen at about 22:15 to 22:30. As I was watching the movie, amoving light caught my eye out the window. I turned away from the TV to look atit and expected to see an airplane flying towards the Medford airport on finalapproach (United Airlines 737s regularly fly over our area enroute to landingat Medford). Our house is at approximately 2,000 feet MSL, and is locatedoutside Talent, Oregon3B we are able to see the City of Medford in the distance, to thenorthwest.Instead of seeing an airplane, there was a slow-moving blue lightmoving toward the right (our window faces due north). My next thought was thatit was a shooting star, and I told my husband, Look at that light, expecting itto disappear very quickly like a shooting star. He looked and saw what hedescribes as a blue light with a light blue circle around it3B then it went out like a light---not like a shooting star trailing debris.Myhusband said that the crew of a UAL 737 which flew over about 1 to 2 minuteslater, was pointed in approximately the same direction, and could easily haveseen the phenomenon. My husband is a licensed private pilot and former AirForce Navigator. The object moved in a straight line, toward the NNE,descending away from us as we looked to the north. I thought that the objectwas at an altitude similar to that of other aircraft which fly over our house. My husband thought that its altitude was probably quite high---at least thatswhat my husband estimates, but that is perhaps because he thought that it iseasy to compare its track to that of a meteorite entering the atmosphere.Wewould appreciate knowing if other people observed this phenomena tonight.Myhusband typed this narrative with my input."],"Tags":"City","Weather Factors":"Unknown","Region":"Oregon","Date of the Event":"07/21/2001 10:00 UTC","Sighting Duration":"00:00:59","Longitude":"-122.875595","Case Number":"1226","Latitude":"42.326515","Date Submitted":"07/21/2001 10:00 UTC","Object Shape":"Sphere","Summary":"Blue Light Above Medford, Oregon","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around July 21st 2001"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/1226.html.txt","/var/www/straped/mufon/org/1226.html"],"Country":"United States","Object Features":"Undisclosed","City":"Medford","map":"<A HREF = \"http://maps.google.com/maps?q=42.326515,+-122.875595(1226)&iwloc=A&hl=en\"> mufon case (1226) map </A>","Log Number":""}