{"files":["/var/www/straped/mufon/html2text/12266.html.txt","/var/www/straped/mufon/org/12266.html"],"Tags":"City","Disposition":"IFO","Latitude":"26.209537","trends":["There have been 11 other sightings in McAllen","There were no other sightings in McAllen on or around August 14th 2008"],"Source":"MUFON","Region":"Texas","City":"McAllen","Country":"United States","Log Number":"US-08302008-0005","divs":["Sighting DetailsI arrived home at night, about 9:30 PM, (CST),and was in my yard looking at the stars before going inside, and I noticed a very bright light moving in a southerly direction. I assumed it was the space station, as I have heard it is as bright or brighter than Venus, and it moved in a steady, fairly rapid trajectory. I watched it cross the sky and then disappear as it was right above my head. I think it glowed red for a mili-second after it went dark, my assumption was that it,(the space station) must have changed attitude so it wasn't reflecting light anymore. This is a little strange since I have seen the space station and shuttle fly over a few times and I could always follow them from horizon to horizon as they slowly came into and then faded from view. That got me watching the sky for a while, and I saw two shooting stars within a couple of minutes. (the light I saw was not a shooting star as I watched it move steadily for several seconds) The sighting I find interesting is the next one. I was facing north looking up, and I spotted another satellite. This one looked more like a \"regular\" satellite, not as bright as the first light I saw,(the space station), but clearly visible. I watched it for a few seconds as it moved steadily to the west. Just as it crossed paths with another star, it \"merged\" with the star. I had a strong feeling of \"Did I just see what I saw?!\" The sky was clear, and I could see the light clearly; instead of passing the star and continuing on its path, it simply \"merged\" or disappeared instantly. I've never seen a satellite disappear in mid-flight like that, and find it especially strange that if it did somehow change attitude and stop reflecting as the first light appeared to do, that it would happen at the exact moment that it passed behind a pin-point of light. I stood glued to the spot, watching the star for about ten more minutes, half expecting to see the light re-emerge at some point, which it did not. I noted the time,(9:50) and the direction and the star positions. To me, it looked like a satellite, but I've never seen one appear to merge with a \"star\"."],"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"12266","Date of the Event":"08/14/2008 09:50 UTC","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=26.209537,+-98.225792(12266)&iwloc=A&hl=en\"> mufon case (12266) map </A>","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Object Features":"Unknown","Summary":"Watched satellite-looking object in sky travel briefly then merge(?) with another star.","Longitude":"-98.225792","Date Submitted":"08/14/2008 09:50 UTC"}