{"Weather Factors":"Unknown","Object Shape":"Star-like","Region":"Illinois","Country":"United States","trends":["There have been 2 other sightings in Glendale Heights","There were no other sightings in Glendale Heights on or around August 29th 2008"],"Longitude":"-88.070059","Tags":"City","Latitude":"41.924","Disposition":"Unknown","Summary":"Star or planet like with white green(blue) and red","map":"<A HREF = \"http://maps.google.com/maps?q=41.924,+-88.070059(12262)&iwloc=A&hl=en\"> mufon case (12262) map </A>","files":["/var/www/straped/mufon/html2text/12262.html.txt","/var/www/straped/mufon/org/12262.html"],"Sighting Duration":"Undisclosed","Log Number":"US-08302008-0001","Object Features":"Undisclosed","Date of the Event":"08/29/2008 10:35 UTC","Viewing Distance":"Unknown","Date Submitted":"08/29/2008 10:35 UTC","divs":["Sighting DetailsI was looking westward from my back patio at 10;35 PM. At first it appeared to be an aircraft, but it's extreme slow movement would exclude that. It did have lights similar to an aicraft, red, green or perhaps blue and white. The bright blinking colors first caught my attention. Then the fact that it wasn't moving, mystified me, so I called out my wife, daughter and her boyfriend. The three of us observed it for about 15 minutes. It first appeared in the west sky just above tree top level, then slowly, very slowly moved into the trees and out of sight. Observed with both 10 X 25 and 10 X 50 binoculars. Only the lights were visable. Total movement: about the lenght of my thumb at arms lenght. Best description of the movement...straight line drifting. Lost visability at 10:50. Sky clear, stars and aircraft clearly visiable. This was no star or planet since it did move. It was no aircraft since the movement was so slow. Perhaps some hoaxer set free a ballon with dangling lights, but only the lights were visible with the binoculars. Hopefully others got a better vantage point."],"Case Number":"12262","City":"Glendale Heights","Source":"MUFON","Object Flight Path":"Straight-line path"}