{"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/12276.html.txt","/var/www/straped/mufon/org/12276.html"],"Summary":"UFO SIGTING","trends":["There have been 7 other sightings in Chelsea","There was one other sighting in Chelsea on or around August 30th 2008"],"Tags":"City","Log Number":"US-08302008-0015","map":"<A HREF = \"http://maps.google.com/maps?q=42.318092,+-84.020503(12276)&iwloc=A&hl=en\"> mufon case (12276) map </A>","Viewing Distance":"Unknown","Latitude":"42.318092","Disposition":"Unknown","divs":["Sighting DetailsLast night about 12:30 A.M. I was putting my dogs outside and saw white lights in the sky like those on the tips of an airplane wings. At first I thought he was going to land but could not think of were. As I was watching I saw it was eradicaly moving around, going up, down, backwards,and forwards. Then the white lights turned into a row of white lights. Then the lights changed color. Red Green White an Yellow. The sky was clear visibility unlimited not a cloud in the sky. do to the fact the a cold front came through. the reflected off what look like fog or a cloud. Then there was a flash of light bigger than the object. then it went up higher as a white light. where it bounced around. It came back down to the same location. I came in the house and woke up my wife to show her, I was looking for my binoculars and glasses. I showed my wife the object that now looked the same as an airplane with landing lights. then it did the same this about three times. on the fourth time it can down horizonal to the earth where I saw a circle of colored lights. inside the ring of colored light was another circle of colored lights. it also had a flash of lightning. I t went back up and bounced around again. when it came down again I got my camera and tried to caught on film which I have not developed. Watched it do the same thing about two more times then about 3 am it took off in an easterly direction. made a mark on the porch today I used a compass which made it about 28 degrees of mag north. The reason I watched it for 2 and a half hours is because it fasinated me. I have never seen anything move or act the way it did. It did not fly anyway a normal plane or helicopter would fly."],"Country":"United States","Date of the Event":"08/30/2008 12:30 UTC","Region":"Michigan","Object Flight Path":"Path with directional change","Object Shape":"Circle","Source":"MUFON","Sighting Duration":"03:00:00","Longitude":"-84.020503","City":"Chelsea","Object Features":"Undisclosed","Date Submitted":"08/30/2008 12:30 UTC","Case Number":"12276"}