{"Case Number":"12272","trends":["There have been 7 other sightings in Southampton","There was one other sighting in Southampton on or around August 23rd 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI first got into UFO's through watching various footage on the internet site youtube. One night I watched the 2005 UFO Conference with Jaime Mussan and became very intrigued by the information given about UFO capture in infared, and decided to purchase a camcorder. After of summer of trying out various filters and lenses, the latest addition, a 1000nm infrared filter (which I was using for the first time), combined with uv filter 0.45X wide angle lens tele convertor 2.0X lens, I happened to make my catch. I was in the garden generally filming the sky trying out various sun positions and filming techniques. After 30minutes or so watching the sky filming this and that, I decided to watch the footage that I had captured, on my laptop. When watching the footage that I had recorded, I suddenly saw somthing that I had previously looked over in the garden. Upon seeing the object on my computer screen, I then realised that I had caught somthing rather special. My initial reaction when seeing this anomoly, was almost a sense of disbelief. Then the satisfaction of actually catching it on film set in. After several veiwings of the said footage, I felt a feeling of unease and a little unsettled because I was unsure whether the I was watching the object, or, the object was watching me! I would estimate the object being no more than 50-80ft above the roof-tops of the neighbouring houses. The object appeared as a fairly round ball of light, with no hard edges, approximatly 6-10ft in diameter. As you can see from the footage, it hovered for several seconds before excelerating at a very high speed upwards into the sky, before disappearing out of sight."],"City":"Southampton","Object Features":"Unknown","Region":"England","Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Log Number":"GB-08302008-0011","Date Submitted":"08/23/2008 12:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/12272.html.txt","/var/www/straped/mufon/org/12272.html"],"Country":"United Kingdom","Date of the Event":"08/23/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.9097,+-1.404351(12272)&iwloc=A&hl=en\"> mufon case (12272) map </A>","Summary":"Filming the skies in infrared when caught ufo above neighbours house","Sighting Duration":"Undisclosed","Latitude":"50.9097","Object Flight Path":"Hovering then path","Longitude":"-1.404351","Tags":"City","Object Shape":"Circle, Fireball"}