{"map":"<A HREF = \"http://maps.google.com/maps?q=32.744867,+-97.105386(12273)&iwloc=A&hl=en\"> mufon case (12273) map </A>","Case Number":"12273","divs":["Sighting DetailsJuly 4th 2006 at 10:40 Pm It had rained July 4th 2006 and the Rangers baseball game had been delayed almost 2 hours. They wanted to finish the game before the fireworks display, so we had a 2 hour wait. The sky, \"Ceiling\", was very low and the clouds were snow-white, except for a large round hole, just above me. The clouds were so low , that the lights from Ranger Stadium reflected off the clouds as almost daylight. I was lying on my back on the parking lot of \"WET & Wild water park\", watching MD80\"s depart from the West side of DFW in a heading North to South. They would turn West for the planes going West. They would turn West right about the North side of I30. They would fly very close or under the \"open hole\" above me, then they would shortly dissapear into the low clouds. I am a long-time Pilot and I still love to watch aircraft. This story has never been reported to officials or to the press. MD 80's have an approximate wingspan of 120 feet, this length became important a short time later. After the departures slowed down at DFW, I continued to look through the large open hole because I noticed that I could only see one star. To my dismay , at approximately 10:40 PM (4) \"Disk-shaped, Flying saucers in an oblique formation flew directly through the large open hole. I was in a large crowd of people and I didn't want to be accused of yelling \" Fire in a theater\". They were flying a pattern where-as, \"they all\" could fly at any direction in a moment of danger. The ships were Pewter and Bronze mixture and were the smothest metal that I have ever seen. I could only view the bottoms of these craft. They had no lights on and noiseless, no visible propulsion system. They were traveling at approimately 350 miles per hour. The \"lead on\" craft had a lower conning tower. All the other 3 were identical--- Smooth bottoms. All the craft were approximatly 60 feet in diameter. They were flying due East directly opposite the MD 80's departure Route West Route, at approximatly 10 to 20 feet above the cloud cover, only about 100 ft. above the MD 80's departure trek. The FAA would call this very illegal and it could have caused a mid-air collision-- but, it didn't. Two days later, I had a very scarey visit with another UFO right above my head , but hundreds of feet up , there is a witness to this event. We were standing at the back of Marvin's pick-up truck and I was looking up into a clear sky and I see a red-light moving at an astronomical speed accross the sky about 10 degrees off of my normal angle. I said , \"Marvin look at that light and pointed to it and Marvin saw it. When I said that\", It stopped on a dime\" , and began billowing a bright blue and yellow beam to the Earth, just like \"StarTrec\". I told Marvin, they may be coming after me because I observed then a few days ago\". \"We need to hide or run\". When I said that , the beam zoomed back to the craft and it exited faster than the speed of light, it shot off and dissapered before our eyes. I think these craft can hear us speak. B. Smith"],"Tags":"City","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around July 4th 2006"],"City":"Arlington","Region":"Texas","Latitude":"32.744867","Object Features":"Other","Country":"United States","Summary":"Pilot sees (4) Flying saucers in an oblique formation flying the opposite direction in a DFW highly restricted West departure zone.","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/12273.html.txt","/var/www/straped/mufon/org/12273.html"],"Date Submitted":"07/04/2006 10:40 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"07/04/2006 10:40 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-97.105386","Object Shape":"Disc","Log Number":"US-08302008-0012"}