{"map":"<A HREF = \"http://maps.google.com/maps?q=33.427195,+-94.039298(12279)&iwloc=A&hl=en\"> mufon case (12279) map </A>","Weather Factors":"None, Windy","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"08/29/2008 02:19 UTC","Object Features":"Unknown","Region":"Texas","Summary":"it was a horizontal row of hovering lights that pulsated in diffrent colors. It moved in a small figure 8 pattern","Case Number":"12279","Date Submitted":"08/29/2008 02:19 UTC","Country":"United States","City":"Texarkana","divs":["Sighting DetailsMy friend [S. H.] and I were at lake Wright Patman starting at about 1am 5 nights ago. We were discussing plans for our music project when I noticed what looked like a VERY bright star. It was about -60 degrees to the bottom left of what I think is the little dipper. At first I ignored it. Then it started to move towards the north west at a very slow rate. I told [S. H.] and we watched it for about 3 hours. We noticed that it seemed to have diffrent colors that were pulsating. We then walked to diffrent parts of the lake to try to get a better vantage point. After about 2 hours of watching it, the lights would extinguish and come back on for a few seconds randomly. We watched it do this for two more hours and then we left for our homes. The next night and the night after, the object was back. Same place, around the same time, and the same consistency. We watched it slowly move in a small figure 8 pattern like the first day but at one point on the 3rd day, we saw what appeared to be a smaller solid white point of light arrive to the bottom of the lights and go up inside it. On the 4th night (last night) we were at [S. H.]'s house watching TV. I went in the back yard to smoke a cigarette and I saw it again. This time it was in a totally diffrent part of the sky and a little lower. I told [S. H.] and he got his binoculars. Through the binoculars we noticed that there were at least 5 if not 6 lights lined up next to eachother horizontaly. One white, blue, red, green, yellow and what appeared to be orange. All of the lights were binking but the colors would change their stations randomly. The span of the row was about 30ft. The object still seemed to move in the figure 8 pattern as before. I called 911 and reported it because I thought that it might be an aircraft that was about to crash. 911 transferred me to the Ashdown 911 (because that is where it appeared this time) and they had an officer investigate. Im not sure if they saw anything because i did not follow up on it with them. After about 3 hours we decided to drive towards Ashdown to see if we could get a better look at it. It started to move away towards the south-east this time and we lost sight of it. [S. H.] and I are not the only persons to have seen this. The fishermen at the lake saw it and the gas station customers and employees saw it too. Tonight [S. H.] and I are going out to see if we can see it again, this time we have a DV 3.1 megapixel camcorder and will attempt to find a random 3rd party to come with us. I'll post the pics and the video if tonights investigation yeilds anything."],"Source":"MUFON","Tags":"City","Log Number":"US-08302008-0018","Latitude":"33.427195","files":["/var/www/straped/mufon/html2text/12279.html.txt","/var/www/straped/mufon/org/12279.html"],"Longitude":"-94.039298","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around August 29th 2008"],"Object Shape":"Circle, Disc, Flash, Oval, Star-like"}