{"Region":"Arizona","files":["/var/www/straped/mufon/html2text/12277.html.txt","/var/www/straped/mufon/org/12277.html"],"City":"Phoenix","Tags":"City","Longitude":"-112.071167","Disposition":"Unknown","Latitude":"33.450727","Date of the Event":"09/10/1993 08:30 UTC","Object Flight Path":"Straight-line path","Object Features":"Other","Date Submitted":"09/10/1993 08:30 UTC","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.450727,+-112.071167(12277)&iwloc=A&hl=en\"> mufon case (12277) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsThis happened years ago (1993) when I was ten years old. It was a friday in early to mid september night after dark around 830 pm or so and it was partly cloudy with a full moon. Every friday evening my mom and I would go walk around my school I was going to for fun etc. My mom and I were only a few blocks from the home I lived in at the time. My mom and I were returning from our walk and I was a little bit behinder looking down to the ground and out of nowhere a very bright dark blue light flashed on the ground is such a weird way ( its like the sun light type of light you would see at bottom of a pool with the water moving around kind like electricity with bubbles but a dark royal blue very pretty)the light was one inch or so from touching my shoes and was about three feet wide and six feet long and only shine in front of me nothing else and made no noise. this lasted 5 seconds then I looked up to the sky. When I looked up to the sky it was partly cloundy, calim, and the moon was out. there happen to be a very large cloud behind me and a clear opening to the sky where I was standing ( I want to note that the clouds were about 25,000 feet up or so and the opening was very large miles wide) So when I looked up I first saw nothing at all.. I looked back down and was trying to figure out what happened. I think at the time I was thinking lightining or something like that. At this point I looked up again and the moment I did this very very very large object came out of the cloud made no noise and took off very fast to the west to Luke Air Force Base area. The object was massive it covered the whole opening in the sky, I want to say it was about 9-12 aircraft cairries long and about 5-7 wide. it was crazy big.the shape was rectagulr with no wings. the shape looked like it should not have been in the air at all no wings nothing. there were a very large number of lights on it and the back of the object was pure white lights and DID NOT MAKE ONE SOUND something of that size, speed, and the light coming off the back should have made a noise of moved the clouds or somthing that was the second weridest part of this first would be the light on the ground in front of me. I lost the object behind more clouds, but was heading to Luke Air Force Base which was 8 miles from the area I was. after the object was gone I was scared ( I was ten years old at the time) and was very uneasy for the rest of the night plus my eye were burning for a unknown reason. this was what made me a full beleaver of UFOs. The one question I want ansewered was why did that UFO shine that weird light in front of me for?, but will most likely never get a answer. The moment Saw it I knew I was a UFO. There was no other answer for it.... I would also like to note in 1997 the Phoenix Lights were NOT flares I saw that (who didn't see that) I clearly saw the lights where connected to each other.. if you have any questions please feel free to contact me. thank you"],"Object Shape":"Square, Rectagular","Summary":"never seen or heard about an object like the one I saw before ever","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around September 10th 1993"],"Sighting Duration":"00:01:00","Log Number":"US-08302008-0016","Weather Factors":"Unknown","Case Number":"12277"}