{"Weather Factors":"Unknown","Date Submitted":"08/30/2008 07:41 UTC","Case Number":"12287","Country":"United States","Object Shape":"Other","Date of the Event":"08/30/2008 07:41 UTC","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around August 30th 2008","This sighting has never been favorited.",""],"Longitude":"-78.871369","Region":"New York","Summary":"Ringish/Oval Hovered high over neighborhood for 20 minutes then at an incredible speed left","Tags":"City","Object Flight Path":"Undisclosed","divs":["Sighting Detailstoday at approximatley 7:40 Me, My brother, and 2 friends were playing basketball outside on the driveway. for some time I had been looking at a redish yellow light that would come and go and was moving slowly across the sky and that sometimes made sudden movements. In my area we are near the buffalo airport so we get commercial planes but nothing special so i thought it may have been a jet. I then proceeded to take out binoculars and to me, my brother, my friends, and eventually my dad realized that what we were seeing was a ufo. It was very quiet but looked huge for how high it mustve been which ive estimated between 50 and 70,000 feet. At first thought I was amazed because I myself always had thought ufos were hoaxes but its one of those things that you need to see for yourself we started going crazy and were really just shocked. The object had fantastic moving capabitlities that allowed it to stop on a dime in midair and perform incredible turns. There were very few clouds yesterday so what happend was eventually it got to high to see but then 20 minutes later it was back again, but only for 5 seconds as at an incredible speed it went over our head completley out of view."],"City":"Buffalo","map":"<A HREF = \"http://maps.google.com/maps?q=42.889817,+-78.871369(12287)&iwloc=A&hl=en\"> mufon case (12287) map </A>","Latitude":"42.889817","Object Features":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12287.html.txt","/var/www/straped/mufon/more/12287_submitter_file1__ufo2.jpg","/var/www/straped/mufon/org/12287.html"],"Log Number":"US-08312008-0007","Disposition":"Insufficient Data","Viewing Distance":"Unknown"}