{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","trends":["There have been 15 other sightings in Yakima","There were no other sightings in Yakima on or around April 16th 2008"],"Weather Factors":"Unknown","Disposition":"Insufficient Data","City":"Yakima","Date Submitted":"04/16/2008 12:00 UTC","Log Number":"US-08312008-0003","Summary":"UFO swarm of white and red dots in the afternoon sky","Sighting Duration":"Undisclosed","Date of the Event":"04/16/2008 12:00 UTC","Object Shape":"Star-like","Country":"United States","Object Features":"Undisclosed","divs":["Sighting Details They say that Washington is a UFO hotspot and now I can say I saw something. It was wednesday(16th-04-2008), right before 4:00. The Baxter delivery guy had just arrived to get me my PD dialysis supplies for the month. I went out to talk to him and then he went into the depths of his truck to pull my supplies. So I was standing there in the driveway and I happened to look up at the tree in the front yard, to see if any greenery had budded yet. Beyond it, in the sky was a pinprick of light. Now, I'm looking almost due east, it's cloudless, pure blue sky, with the sun behind me (since it was almost 4) as I looked, I noticed more and more points of light. They seemed to be clustered together in the same general vicinity. And there were two sets. Some which were bright white and some fainter one which were reddish in color. So, It's like, this can't be what I think it is. Let's see, satilites? baloons or something? Nope. They were all moving, slowly, but moving, but in different directions. Satilites follow orbits. Ballons follow wind trajectory. These were going all over. Planes? Maybe. but about that time, a commersial plane came into my view, traveling from the SE to the NW. I figured it was an ordinary flight going to Sea-Tac or Vancouver, and it proved that whatever I was seeing was farther distant and considerable higher up. It could still be planes of some type so I watched for a bit longer. These two points of light drew side-by-side and then reversed themselves. That's rather odd. And then, Ah! that one there did a right angel. And then another one did two consequtive right angles to reverse it's course. Nope. Not Planes! As I was standing there watching this, my neck crained to the sky, the stories on coast-to-coast about people seeing LEO (Low Earth Orbit) spacebattles came to mind. Well, that's what it reminded me of. If you think of the opening scene from Star Wars 3 or some of the battle scenes from Battlestar Galactica, were you have all those ships grouped together. Each one moving in relationship to the others, but everything confined in this relatively small space in the sky, well, that's what it looked like. About the time I thought to count the lights, the fainter red ones were gone. The brighter points of light were 16 in number. They fadded from view after another minute or so. Total time was under five minutes. Probably closer to 3. The Baxter guy then came out of his truck with the first load of my supplies, right about then, when it was over and they were gone. I didn't even think to call him. Hey, there's a UFO swarm going on out here."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.604861,+-120.496159(12283)&iwloc=A&hl=en\"> mufon case (12283) map </A>","Region":"Washington","Latitude":"46.604861","Case Number":"12283","Source":"MUFON","Longitude":"-120.496159","files":["/var/www/straped/mufon/html2text/12283.html.txt","/var/www/straped/mufon/org/12283.html"]}