{"Date Submitted":"08/11/2008 09:00 UTC","files":["/var/www/straped/mufon/html2text/12293.html.txt","/var/www/straped/mufon/org/12293.html"],"divs":["Sighting DetailsMy wife, a friend, and myself were sitting on our back porch enjoying the evening air and sky when my wife gasped and asked, \"what's that?\" as she pointed towards a white sphere to the north of us. It travelled in a linear path south to north, but seemed much larger than a normal satellite crossing the night sky. It flared out like a light bulb when its given way too much juice, stayed brilliant and the size of a dime held in my hand at arms length, then went back to its original brightness of about the size of a popcorn kernel at arms length then in a few seconds simply disappeared. The next evening I was outside on my back porch about the same time and noticed the exact same object to the north but flying in a curved fashion start out as a kernel of light, to the dime sized light, then to the kernel again and vanish. I felt as if I was watching something unusual and debated whether or not to tell about the sighting."],"Weather Factors":"None","Disposition":"IFO","Object Shape":"Flash, Sphere","Date of the Event":"08/11/2008 09:00 UTC","Tags":"City","City":"Grants Pass","Log Number":"US-08312008-0013","Source":"MUFON","Sighting Duration":"00:00:10","Object Features":"None","Case Number":"12293","Viewing Distance":"Unknown","Latitude":"42.446007","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around August 11th 2008"],"Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=42.446007,+-123.322132(12293)&iwloc=A&hl=en\"> mufon case (12293) map </A>","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","Summary":"A bright sphere flew to the north of us, illuminated like a light bulb given extra juice, then went back to its normal lighting and a few seconds later simply vanished.","Longitude":"-123.322132"}