{"Longitude":"-72.644167","Weather Factors":"Unknown","Region":"Connecticut","Summary":"Triangle ufo flies over my car while driving on highway 91","Date Submitted":"07/16/1997 11:40 UTC","Country":"United States","Log Number":"US-08312008-0016","Latitude":"41.8525","Sighting Duration":"Undisclosed","City":"Windsor","Viewing Distance":"101-500 Feet","Case Number":"12296","Object Flight Path":"Straight-line path","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.8525,+-72.644167(12296)&iwloc=A&hl=en\"> mufon case (12296) map </A>","Object Features":"Unknown","Object Shape":"Triangle","Source":"MUFON","Date of the Event":"07/16/1997 11:40 UTC","trends":["There has been one other sighting in Windsor","There were no other sightings in Windsor on or around July 16th 1997","This sighting has never been favorited.",""],"divs":["Sighting DetailsHere is what my wife and I saw; We were driving from Hartford toward Springfield, Mass. on interstate 91 at approximatly 11:40 PM when my wife and I first spotted a cluster of lights in the sky about a couple of miles ahead of us. We first thought that it could be a helicopter of some kind with many lights under it as it seemed to be stationnary in the sky. But as we were appoaching the sighting, the cluster of lights did not look like anything I've ever seen on a helicopter. It was heading slowly toward the South-West and could not make a good description of it. As we were trying to understand what we had just witnessed, I asked my wife to keep an eye over the trees in case she might spot it again. As I was asking her, I spotted another one near Windsor CT. following the same path as the first, from the North-East heading South-West . This time we were getting much closer as we kept on driving. The more I drove, the more we knew we were going to drive right over the craft. As it got closer we knew that this was something we had never seen in our lives. As we were almost over it, we could finally make out the light pattern. It was in a V shape with 6 big round glowing white lights. These big lights did not lit the ground. There was a smaller white light at the front with 3 smaller white blinking lights and a small pulsating red light in the midlle of the craft. It made no noise, as our windows were pulled down because it was a hot and muggy night. It was not going very fast. It must have been about 300 to 500 feet over us. We could not make out the triangle dark craft itself as the 6 lights were overshadowing the structure but could tell it was a solid craft because of the difference between the sky and the flying object. Ounce it had past over our car, we pulled over and looked at it until we lost sight of it. We were at approximatly at Windsor, Connecticut on highway 91 heading toward Springfield Mass. There were other cars on the highway who also witnessed these crafts. Thank you ever so much for your time!"],"files":["/var/www/straped/mufon/html2text/12296.html.txt","/var/www/straped/mufon/more/12296_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/12296.html"]}