{"Date of the Event":"08/31/2008 09:45 UTC","Object Features":"Dome","Disposition":"Insufficient Data","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around August 31st 2008"],"Weather Factors":"None","Date Submitted":"08/31/2008 09:45 UTC","Object Flight Path":"Straight-line path","Object Shape":"Circle","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/12297.html.txt","/var/www/straped/mufon/org/12297.html"],"Latitude":"43.018997","Log Number":"US-09012008-0001","Summary":"Bright, then changing to no light at all, circular object at approximately 1000-2000 feet traveling westerly at about 30 degrees towards the north.","map":"<A HREF = \"http://maps.google.com/maps?q=43.018997,+-83.681336(12297)&iwloc=A&hl=en\"> mufon case (12297) map </A>","Country":"United States","Tags":"City","City":"Flint","divs":["Sighting DetailsOn August 31, 2008 at 8:45 PM, I was standing on the front porch smoking a cigarette, facing due south. I seen a bright light through the gaps in the tree canopies that line the road, the road being approximately 60 feet from the front of my house, traveling towards me from a south easterly direction. Having served in the U.S. Air Force for four years and have seen many aircraft flying at 500 feet during excercises, I feel comfortable at estimating the altitude to be approximately 1000-2000 feet. When I first noticed the light I had assumed it to a small propeller aircraft. I realized within 10 seconds or so, the craft was flying slightly faster than you would expect a small aircraft to fly. I was waiting to hear the engine as it came closer. After a brief moment listening and it came closer to be almost overhead, there was absolutely no noise at all. I immediately knew when it cleared the obstructed view of the tree canopies, it was definitely not any kind of \"normal\" aircraft. I quickly turned to open the front door and told my daughter to come outside and fast. In the way I said it and quickly running out to the front yard, she knew to run to see something. By the time we both looked up, the craft was directly overhead and had a defined outer ring of light with another inner and brighter ring of light. It was also considerably dimmer than it was when I first noticed it. My best guess in the diameter would be at least twice the diameter of what I would expect for a helicopter's blades to be for the altitude it was at (approximately 100 to 200 feet in diameter). Just before we lost sight because of the maple tree to our west, we saw one blip of a small red light that appeared to be on the top part of the craft. When the tree obstructed our view, we ran to the driveway on the opposite side of the tree and looked upward. Surprisingly, the craft was very dim and just past a directly overhead direction. The next second, there was no light at all, only the dark silhouette of the perfectly circular craft against the clear night sky and background of stars. As the craft continued north west at it's constant speed and the distance from us increased, we were able to see it had a domed dimension above and below the centerline of the craft. We continued watching for about 10 to 15 seconds until we lost sight of it beyond the tree line that is approximately 150 to 200 yards away and the trees being approximately 60 to 80 feet tall. I turned to my daughter and told her she had just witnessed a once in a lifetime event. We were both in awe of what we had just witnessed."],"Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Michigan","Case Number":"12297","Longitude":"-83.681336"}