{"Latitude":"40.624325","map":"<A HREF = \"http://maps.google.com/maps?q=40.624325,+-79.142835(12295)&iwloc=A&hl=en\"> mufon case (12295) map </A>","Disposition":"Unknown","Object Shape":"Flash","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/12295.html.txt","/var/www/straped/mufon/org/12295.html"],"City":"Indiana","Summary":"Pulsating object, multicolored strobing, moving erratically at high speed","Date of the Event":"08/31/2008 11:00 UTC","trends":["There has been one other sighting in Indiana","There were no other sightings in Indiana on or around August 31st 2008"],"divs":["Sighting DetailsMy son and I were on our back porch looking at the stars, as I was looking to the North West I saw an object that appeared to be stationary like a star but it seemed to be pulsing. My son commented that it was sometimes red, sometimes, blue, sometimes white and I concurred. I then sent him in for binoculars as I continued to observe the object. After getting the binoculars I focused in and indeed it was flashing red blue and white and it wasn't actually stationary but moving about very fast in a tight area. Kind of looked like the squiggly lines a sparkler or light stick make if you jiggle them around. The other celestial objects near this thing were not squiggly so it ruled out us making it do that with the binoculars and to be sure we steadied them on a railing and the object continued to move erratically. Sometimes it appeared to stop and just change colors then it would start up again. I called my wife out and my other son and they both confirmed what we were seeing. We continued to watch it for about 20 mins and then it slowly moved beyond the horizon, sometimes stopping. All the while it was moving away it was still pulsing and moving about in the zig zaggy jiggly motion. Also in the binoculars the lights sometimes appeared to be spinning around rather than flashing in succession or strobing. We have a small airport in our area and an army helicopter base not far so we frequently see helicopters and other conventional aircraft at night and know what they look like and how they behave. This thing definitely did not look like anything any of us have ever seen before. I tried to take a photo but the object was too far away. Truly freaky!!!!"],"Country":"United States","Case Number":"12295","Date Submitted":"08/31/2008 11:00 UTC","Log Number":"US-08312008-0015","Object Flight Path":"Stationary,Path with directional change,Other","Weather Factors":"Unknown","Longitude":"-79.142835","Tags":"City","Sighting Duration":"Undisclosed","Region":"Pennsylvania"}