{"Country":"United States","Region":"Colorado","Source":"MUFON","Date Submitted":"05/17/1973 08:30 UTC","Date of the Event":"05/17/1973 08:30 UTC","Weather Factors":"None","Latitude":"40.5873","Case Number":"12301","Tags":"City","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around May 17th 1973"],"Object Flight Path":"Straight-line path","Object Features":"Dome, Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=40.5873,+-105.076183(12301)&iwloc=A&hl=en\"> mufon case (12301) map </A>","Object Shape":"Circle, Disc, Oval","Longitude":"-105.076183","Summary":"See in Ft Collins at night later reported seen in Boulder same night","Log Number":"US-09012008-0005","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12301.html.txt","/var/www/straped/mufon/org/12301.html"],"Disposition":"Unknown","divs":["sighting detailsi was in the backyard of my house wagon wheel dr ft. collins, co between 8-9 pm. it was dark except for the city glow. i was facing north and lookup to the ne to see an elongated disk shaped object with pulsating colored lights around the object; reds greens and yellows. it was solid against the city din. there was absolutely no associated noise and i would estimate the elevation at 1500 or less feet. it was not a usual aircraft. it was moving slowly in a south-westernly direction. i watched it for maybe 15-20 secs in absolute amassment. i rushed into the house and told my wife there was a ufo above the backyard and rushed around to get my camera. it seemed forever to locate the camera and when i went outside to take a picture it was gone. the next night on channel 7 (i think) news the denver tv station reported a ufo (maybe several ufo sightings) sighting in boulder. (you can check the exact date by the tv report\\maybe denver\\boulder paper too i do not know). the\"ufo\" was moving as i watched it in a direction directly towards boulder, co. i was a student at csu for 8 years. i never reported this but the tv station report the next evening from denver confirmed for me what i had seen in the ft. collins airspace. my times and dates are very approximate. i was moved to report this from the nbc dateline ufo program last night. one of the segments was similar to what i am reporting that happened nearly 35 years ago."],"City":"Fort Collins","Viewing Distance":"501 Feet - 1 Mile"}