{"Source":"MUFON","Summary":"A large UFO descened from the clouds above my home.","Object Shape":"Oval","Object Features":"Patterned Surface","divs":["Sighting DetailsI awoke from a sound sleep early on the morning of 28 August 2008. For some reason, I was wide awake and could not fall back to sleep. After tossing turning for some time, I realized I could not sleep and decided to go outside and maybe the night air would relax me, enabling me to return to sleep. I dressed and went out to our backyard patio. I noticed the time was 3:37 a.m. After sitting on the patio for a few minutes, I noticed a light in the southern sky. It appeared to be standing still so I thought it was a helicopter but I heard no sound. Then, the light moved eastward and stopped again. Still, there was no sound. After a few seconds, the light started moving northward. As I was observing this through trees, I walked out into the yard, where there were no trees, to see the light better. The sky was very overcast. As the light moved northward, toward me, I could see that it was several lights in a vee formation with the apex of the vee pointing north. When the object was almost directly overhead, it stopped. It was huge. A few seconds later, the lights dropped through the overcast and I could plainly see a large \"V\" structure. It had 11 lights; five on each \"leg\" of the vee and one at the apex. It continued to descend and soon, a huge structure, apparently connected to the vee, broke through the clouds. The many lights from the city illuminated the structure and I could distinctly see very symetrcial seams of the structure. It was somewhat oval shaped with a flat edge at the rear--somewhat like a clam shell shape. There was a protrusion out each side, near the rear of the craft. The craft stopped descending and stood still for a few seconds. Then, a small, orbital light came out of the protrusion on the east side, passed between the vee and the larger part of the structure and appeared to re-enter the craft on the west side. A few seconds later, another light exited the west side protrusion, crossed between the vee and the main body, and hovered there. I had a ver distinct feeling I was being observed. Then, the light recrossed the craft and re-entered the craft via the protrusion it had started from. The lights appeared to have other lights within them that changed colors from red to blue to a purplish to red again. The craft remained stationary for a few more seconds, then rose back through the overcast. A few seconds later, the craft very quickly shot northward and disappeared. I remained standing in the yard, for I don't know how long, trying to comprehend what I had just seen. I re-entered my house and immediatly made a sketch of the craft while everything was fresh in my mind. I noted the time was 4:25 a.m."],"Log Number":"US-09022008-0001","Case Number":"12308","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-98.483738","City":"San Antonio","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around August 28th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/12308.html.txt","/var/www/straped/mufon/more/12308_submitter_file1__unidentifiedobject.jpg","/var/www/straped/mufon/org/12308.html"],"Object Flight Path":"Path then hovering","Region":"Texas","Disposition":"Unknown","Date of the Event":"08/28/2008 03:45 UTC","Date Submitted":"08/28/2008 03:45 UTC","Latitude":"29.430622","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.430622,+-98.483738(12308)&iwloc=A&hl=en\"> mufon case (12308) map </A>"}