{"Summary":"Orange/yellow/white fireball with tail was noticed in Natrona Heights, PA","divs":["sighting detailsi was playing outside with siblings and cousins in the front yard of our natrona heights, pa home. it was a warm summer night with clear skies. as a youngster i was always intrigued with ufos, aliens, and the like. having a tendency to gaze into the nighttime skies, it was easy for me to notice the ufo as 9 year-old child. when i first noticed the object, it looked like an enormous comet. it was a bright orangish\\white\\yellow color with a tail. however, i knew it was much too big to be a comet. it really resembled a comet in the sense that the \"head\" of the fireball was at the bottom, and the \"tail\" was pointed \"up\" at about a 45 degree angle. the strangest thing was that the ufo was not traveling \"downward\" towards the horizon but was traveling \"up\" with the tail leading the way forward! i was so excited that i told my siblings\\cousins who were outside with me, but they really didn't seem as interested as i was. i ran frantically into the house to get my parents so they could see it and photograph it. they were busy entertaining my relatives and really didn't believe me as i hysterically tried to convince them that there was a ufo outside. unfortunately i clearly remember the helpless feeling and frustration that overcame me as i realized that they either did not believe me or just didn't want to be bothered. when i returned outside the object was gone. i have not seen a ufo since then. i have estimated the date and time of the sighting to be either 1983\\1984 summer and it was about 9:30pm."],"files":["/var/www/straped/mufon/html2text/12304.html.txt","/var/www/straped/mufon/org/12304.html"],"Source":"MUFON","Case Number":"12304","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 15th 1984"],"Country":"United States","Date of the Event":"07/15/1984 12:00 UTC","Longitude":"-79.991066","Log Number":"US-09012008-0008","Tags":"City","Region":"Pennsylvania","Object Shape":"Fireball","Sighting Duration":"Undisclosed","Latitude":"40.450125","map":"<A HREF = \"http://maps.google.com/maps?q=40.450125,+-79.991066(12304)&iwloc=A&hl=en\"> mufon case (12304) map </A>","Weather Factors":"None","City":"Pittsburgh","Object Features":"None","Date Submitted":"07/15/1984 12:00 UTC","Disposition":"Insufficient Data"}