{"Case Number":"12311","divs":["Sighting Details i saw a ufo on august 16,2008 at 9 to 930pm flying by top portion of full moon.warm humid night. i was with sister on august 16 on staten island east sea shore for a fireworks show.she saw the ufo too. it was too small a ufo to be scared of. it was like artifical light and orange ionized trail. it didnt change course,traveling in straight line { east to west of moon }. if it was meterite it wouldnt have same color light and would flicker. the artificial light was white and steady,the trail was orange ionized praticles about three time the length of craft or a bit more. it was high in the sky the trail has tiny orange bright dots it wasnt damaged,it looked like proplusion,but oddly it looked like the ion trail was as large or larger then the craft { white light portion }. it wasn't a piece of space junk or something. space junk or meterite is very radom looking trail while entering the atmospere. this trail was constant in size at all time,and oddly beauty looking. area we were at was on broad walk { bench chair },near father capodanno blvd and midland ave."],"files":["/var/www/straped/mufon/html2text/12311.html.txt","/var/www/straped/mufon/org/12311.html"],"City":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 16th 2008"],"Disposition":"Unresolved","Latitude":"40.588912","Object Features":"None","Summary":"small { distance } white artifical light with steady orange ionized trail","Tags":"City","Date Submitted":"08/16/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.588912,+-74.143121(12311)&iwloc=A&hl=en\"> mufon case (12311) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Weather Factors":"None","Region":"New York","Sighting Duration":"01:30:00","Longitude":"-74.143121","Object Shape":"Circle","Date of the Event":"08/16/2008 09:00 UTC","Log Number":"US-09022008-0004","Viewing Distance":"20 Feet or Less","Source":"MUFON"}