{"Summary":"Another night sighting as usual :-)","Longitude":"-88.300933","Date Submitted":"09/02/2008 05:00 UTC","files":["/var/www/straped/mufon/html2text/12316.html.txt","/var/www/straped/mufon/more/12316_submitter_file1__12305_submitter_file1__100_0884.jpg","/var/www/straped/mufon/org/12316.html"],"Sighting Duration":"04:00:00","City":"St Charles","Object Shape":"Star-like","Weather Factors":"Unknown","Latitude":"41.916511","Tags":"City","Source":"MUFON","Log Number":"US-09022008-0009","Disposition":"Hoax","Case Number":"12316","divs":["Sighting DetailsHey its me again. Well anyways that guy who recently sent those photos from Sublette, IL, that thing has been hovering near our house every single night I for I dont know how many months. It is the same beautiful aqua blue and if you stare you can mildly see the red lights blinking on it. I wonder who is on it and I play it cool, I dont even take pictures although we have a digital camera and I could, I dont see the point I'm so used to seeing it hovering there. It doesnt leave it slowly drifts over many hours and everynight I take my last glance after a cigarette and walk back inside falling back asleep without a problem. Maybe im a nerd but I dont know wether to feel blessed to cursed but somehow I know it is there because of me. I even have been writing a new bible with the rules of eternal life enjoying the feeling of being a King Solomon god-like figure, like Im preparing for resurrection or abduction because I have something to offer. My life is sad. But yeah check out that Sublette, Illinois post, one of those things is blinking in the east skies of downtown st charles. That is the most I got going in my life so I figure id share with MUFON and the people in hopes we can move on with life and they will share theyre secrets with us. We all are suffering. I didnt take that pic that other guy did but that thing dont budge or play swing. It seems to dock itself in my presense"],"Object Features":"Undisclosed","Date of the Event":"09/02/2008 05:00 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.916511,+-88.300933(12316)&iwloc=A&hl=en\"> mufon case (12316) map </A>","Country":"United States","Region":"Illinois","trends":["There have been 12 other sightings in St Charles","There was one other sighting in St Charles on or around September 2nd 2008","This sighting has never been favorited.",""]}