{"map":"<A HREF = \"http://maps.google.com/maps?q=39.557091,+-105.774867(12317)&iwloc=A&hl=en\"> mufon case (12317) map </A>","Object Shape":"Diamond, Disc","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"08/26/2004 03:30 UTC","Disposition":"Unresolved","Summary":"18 metalic ufos playing","Latitude":"39.557091","Longitude":"-105.774867","Tags":"City","Source":"MUFON","Date of the Event":"08/26/2004 03:30 UTC","trends":[],"Object Features":"Unknown","divs":["Sighting DetailsIn August of 04 I was at work and had gone out for a break, when something in the east caught my eye. At first I thought they were geese flying in a V formation, and then realised that geese don't fly at 3000 feet and at 500 miles per hour (approx). They were about 5 to 8 miles away and heading south, about where Shreiver Air base is at.About that time , two of my co workers came out, and I pointed out what I was looking at. They also seen it. The objects were playing it looked like, because at first they were in the v formation, then the two in the rear would separate and fly up front while the two up front would separate and go back where the two had been. Then the second to the rear ones would go up front, while the front ones would go to the rear. Then they would all break formation and would fly in a group of a rough circle, flying erratically. All at once in a instant as one all together, they tilted at a 45 degree angle very fast as if they had dodged something, then immidiately straightened back out as a group. As they did this the sunlight glanced off of them, showing them to be metallic craft of some kind, and were in the shape of something between a diamond and a disk.The tall trees out side then got in the way, so I ran around the building to see if I could spot them as they went southward, but the trees were also in the way in the front of the building, so I lost them. I then went back to where my two friends were still at, and was discussing the strange event, when I looked up where the objects had been earlier, there was a plane flying in the very same spot and in the very same direction as the earlier objects had been. It was not a jet or a passenger plane,but looked like a military plane. Now that led me to believe that someone knew about this event as well.Two years later my sister sent me a dvd that she had transfered from my dads old movie films onto disk of our childhood in Montana, and 15 minuets into the footage, lo and behold THEIR THEY WERE AGAIN! Only this footage was taken in the late 1960's or early 70's. The same exact thing flying at about 2,000 or 3,000 feet.and doing the same thing as what I witnessed in 2004 , only this time in Montana!I believe if the footage now on disk were enhanced with computer technology, it would show very clearly, and up close what I also witnessed in 2004.It was unusual enough, that my Dad filmed them for approx 30 seconds or so. I'm not sure how to download the dvd clip for you, otherwise I would.(SORRY) I'm only in colorado springs, which isn't far from you in FT, COLLINS. MAYBE YOU CAN HAVE SOMEONE CALL ME OR STOP BY AND i WILL BE HAPPY TO PLAY IT FOR THEMM AND SEE WHAT THEY THINK. THANK YOU. SINCERELY; MATT"],"Log Number":"US-09022008-0010","Region":"Colorado","files":["/var/www/straped/mufon/html2text/12317.html.txt","/var/www/straped/mufon/org/12317.html"],"Weather Factors":"None","Case Number":"12317","Object Flight Path":"Straight-line path","City":"Undisclosed"}