{"Log Number":"US-09022008-0015","files":["/var/www/straped/mufon/html2text/12322.html.txt","/var/www/straped/mufon/org/12322.html"],"Summary":"Ball of light, approximately beach ball size.","Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"12322","Longitude":"-85.337337","Tags":"City","Source":"MUFON","Object Shape":"Sphere","Object Features":"Unknown","Region":"Kentucky","trends":["There have been 5 other sightings in Campbellsville","There were no other sightings in Campbellsville on or around February 21st 2006"],"City":"Campbellsville","divs":["Sighting DetailsI was reading a report from back in february of 2008 from the Campbellsville area in Taylor county, and it reminded me of something that happened back in February of 2006. My wife doesn't really care to discuss stuff like this much, even though we've both seen our share of weird stuff, but she came home one night and told me about a light she saw on the way home from work. We live out on 70 between Campbellsville and Liberty, and the Taylor county line is about halfway to Campbellsville. She works overnights there, and drives home in the early hours of the morning. The following is what I entered in my journal at that time: \"A couple of nights ago, my wife saw a light following along side her as she drove home from the night shift at work. She described it as a white ball of light. I asked her if maybe it was the moon through the trees, and she said no, that the moon was on the other side. I asked her how large it was, and she said that it was hard to tell because she couldn't be sure of the distance, but it looked to be about as big as a beach ball.\" I remember her telling me that it seemed to stay alongside her. Also, I entered this into my journal about my neighbor's sighting a few days after hers: \"I told my buddy about it, who has seen far stranger things along with me, and he reacted by asking if she was hallucinating. I thought it was a little unnecessary. Then last night, he comes running over when I get off work, and tells me that he forget to tell me what happened Thursday night on his way home from his in-laws. He saw a white strobing type light in the sky, and at first thought it might be some sort of tower beacon, even though he'd never seen one there before. But the light kept moving as he'd get closer, and change position. Then it eventually just left. I told him that it wouldn't surprise me, as the place he saw it is only a few miles from the famous UFO sighting near Liberty, KY in the mid 70's. I restrained myself from asking if he'd hallucinated it.\""],"Weather Factors":"Unknown","Date Submitted":"02/21/2006 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.345107,+-85.337337(12322)&iwloc=A&hl=en\"> mufon case (12322) map </A>","Latitude":"37.345107","Sighting Duration":"Undisclosed","Date of the Event":"02/21/2006 12:00 UTC","Country":"United States","Object Flight Path":"Straight-line path"}