{"Sighting Duration":"Undisclosed","Country":"United States","Latitude":"38.444529","Region":"Colorado","Source":"MUFON","divs":["Sighting DetailsOn this day in january, it was very clear and cloudless. I worked at a correctional facility (Prison) in Canon City, Colorado. At approximately 1515, I was taking my crew of inmates back to the shop to turn in our tools and prepare the gang to be searched and put back into the general population of the prison. Myself and an inmate who I remember as (dog)Williams, (His gang Name). We were discussing something about what we were going to do the next day. I then (for whatever reason) looked up into the bright afternoon sky, very clear...no clouds very bright afternoon. I then saw at about 11 oclock from the zenith almost straight up and out at a distance of 7 miles to the north of my location, a very large sphere, chrome in color with three brown spots on the side facing me. This sphere was absolutely huge and very high, I estimated the heightth to be 50 to 60 thousand feet. It was much higher than a jet would fly. on certain clear days one can almost see windows on a jet airliner and can sometimes identify what a jet type is 727. or737 or DC-10. this was one of those clear days... The sphere was large enough that at least ten airliners could have fit across the face of the side that I was observing. The sphere was hovering for about 1 minute and then, noiselessly, and very quicky accelerated over the horizon in about 1 to 2 seconds. One of the interesting facts was that the craft was some ten miles west of NORAD (North American Air Defense Command) located in cheyenne mountain Colorado. It was very like the craft that picked up the Starman in the movie Starman with Jeff Bridges. The inmate and I just looked at each other and said what in the hell was that? To this day I have no idea what it was..."],"trends":["There have been 6 other sightings in Cañon City","There were no other sightings in Cañon City on or around January 10th 1998"],"Date Submitted":"01/10/1998 03:17 UTC","Object Shape":"Sphere","Weather Factors":"None","City":"CaÃƒÂ±on City","files":["/var/www/straped/mufon/html2text/12329.html.txt","/var/www/straped/mufon/org/12329.html"],"Case Number":"12329","Date of the Event":"01/10/1998 03:17 UTC","Summary":"Very large chrome sphere","Disposition":"Unresolved","Object Flight Path":"Hovering then path","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=38.444529,+-105.216607(12329)&iwloc=A&hl=en\"> mufon case (12329) map </A>","Viewing Distance":"Over One Mile","Log Number":"US-09032008-0003","Tags":"City","Longitude":"-105.216607"}