{"Source":"MUFON","Longitude":"-99.858889","City":"Ainsworth","Weather Factors":"Windy, Heavy","Object Shape":"Unknown","Tags":"City","Case Number":"12320","Date Submitted":"09/02/2008 03:30 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=42.5475,+-99.858889(12320)&iwloc=A&hl=en\"> mufon case (12320) map </A>","trends":["There have been no other sightings in Ainsworth","This sighting has never been favorited."],"Log Number":"US-09022008-0013","Region":"Nebraska","Latitude":"42.5475","Country":"United States","Disposition":"Insufficient Data","divs":["Sighting Details I live in the country about 2 miles from town. I can and do hear truck and car noises from the highway. I am in the flight path of the rescue helicopters that land in our hospital and go to the airport to fuel. I have lived in this area for 5 years at this location. Grew up within a few miles and lived out in the country during the late 80's and 90's, where I also have had a strange unexplained sighting. Let me say that I have also hunted and been around all kinds of animals and machinery. The wind was blowing all day and into evening. A storm was in the area. I had shut the windows except for my bedroom window on the west was open a couple inches. My window above my head on the south was open all the way. I had gone to bed early and was sleeping soundly. I was awakened suddenly out of sleep by a loud strange worbling noise. This noise was like nothing I had ever heard before. I did not see anything to be quite honest I did not want to look out of the window. This noise went on for at least 15 minutes because I remember looking at the clock. The impression that I got from the noise was that it was moving in a grid like pattern north to south then east to west. As if looing for something. This was the impression that I had. The noise got louder and softer as it moved. As I said I have heard a variety of things and this is like nothing I have ever heard. I lay in bed thinking of any possible thing that it could be. This was a worbling whistling noise. I didn't have a tape recorder in the house. This continued back and forth very close, seemed to be right over the back yard and a little to the south until it came from the west and moved east until it abruptly stopped when it got very close. I would estimate withing 50 yards or less. I never heard it again. I wanted to look out the window but really was very uneasy of what I might see. I felt very uneasy. I layed awake for quite a while until I fell asleep and did not feel uneasy when I woke this morning. We have a grove of trees behind our house and ever since we moved here I have not felt comfortable going in the north side of it. My son who is grown feels the same way. A few weeks ago I was sleeping and was awakened in much the same way by a noise that I have not heard before. It was coming from the north edge of the trees this time. It was a call that sounded like some other kind of animal but again nothing that we have in this state. We have had foxes out there and they sound really strange but this was no fox. Both times the dogs didn't seem to notice which I find strange. The call from the trees went on for several minutes and made me very uneasy."],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12320.html.txt","/var/www/straped/mufon/org/12320.html"],"Summary":"Awakened from a sound sleep having heard a very strange noise","Viewing Distance":"Unknown","Date of the Event":"09/02/2008 03:30 UTC"}