{"divs":["Sighting DetailsOn Aug. 30th at about 2230 hours I was laying on my couch. I glanced out the window at the stars.I saw a light blinking in the sky. I thought it was a star, but it blinked too rapidly.I thought maybe it was satellite maybe.I got my binoculars and looked at it. That's when I saw the lights in a horizontal line. There were 5 of them: two elongated square shaped lights on each side of a brighter center light.Sometimes above the center light a green light flashed very rapidly, then it would change to orange.The white light always brilliant.At first I thought it must be a plane with its landing lights on, but it never changed direction or altitude. The lights remained stationary for most of the time. I could hear no noise associated with the lights. I saw the same lights on Aug. 31 at about 2400 hours.They were in almost the same area of sky - north east of Lakeport and about 20 to 30 degrees above the horizon.They only remained for about an hour. On Sept.1st I saw them again at about 2245 hours, slightly more to the east than the previous two nights, but the same distance above the horizon.Again they stayed for about an hour.However, this time at one point there was another set of lights above the first set; they appeared to be slightly smaller, but had the same configuration and colors.They were very close to the larger set, almost as if they were sitting on the larger set.They only stayed about 2 minutes, then were gone. They were there then gone. I could not discern a shape; I could only see the lights. I reported this info to an friend of mine who is an astronomer and he plans to try and observe the lights tonight. He should get a better view because he has telescopes available to him. When the object left, it just seemed to disappear.One minute it was there and the next it was gone."],"City":"Lakeport","Source":"MUFON","Tags":"City","Date of the Event":"08/30/2008 10:30 UTC","Summary":"I saw a horizontal row of 5 lights. The center one was very bright and flashed at time. There were two lights on each side of the center light which were dimmer and shaped like an elongated square. It remained stationary for the 2 hours.","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12321.html.txt","/var/www/straped/mufon/org/12321.html"],"Object Features":"Unknown","Log Number":"US-09022008-0014","map":"<A HREF = \"http://maps.google.com/maps?q=39.052171,+-122.911609(12321)&iwloc=A&hl=en\"> mufon case (12321) map </A>","Latitude":"39.052171","Sighting Duration":"02:00:00","Country":"United States","Date Submitted":"08/30/2008 10:30 UTC","Longitude":"-122.911609","Disposition":"Unknown","Viewing Distance":"Unknown","Region":"California","Object Flight Path":"Stationary","Case Number":"12321","trends":["There have been 4 other sightings in Lakeport","There were no other sightings in Lakeport on or around August 30th 2008"],"Object Shape":"Unknown"}