{"Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed","Tags":"City","Summary":"Stationary disc, illuminated amber, Seemed to seperate in two several times.","Object Features":"None","Date Submitted":"08/30/2008 11:30 UTC","Object Flight Path":"Stationary,Straight-line path","divs":["sighting detailsattending a cub scout event with my son at arbor lake in westminster, colorado. the weather was clear blue and i noticed a stationary object that i could not identify with the naked eye. so i borrowed a pair of binoculars and observed what appeared to be a self illuminated amber disc that seemed to sometimes become two objects, although it may have been an optical illusion(when it sepearated). at first, i thought it might be a balloon of some sort but it was absolutely stationary for at least 15 minutes. altitude was difficult to determine, but i would guess 10k to 20k feet above the ground. about 1\\3 the size of a thumb-tack. no noise. remained stationary for about 15 minutes and then starting moving at an almost negligable speed from it's position nw of me towards the se. when it reached a point of being almost directly overhead it vanished. i couldn't say it went up, it just disappeared. during and after the event was excited and curious as to its nature. i was also happy that my son was able to view something so extraordinary and that we could share the experience. many witnesses, but not much reaction from the crowd? that struck me as curious. they seemed to just want to forget about it."],"Log Number":"US-09032008-0011","Source":"MUFON","City":"Westminster","Latitude":"39.846053","Region":"Colorado","Country":"United States","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around August 30th 2008"],"Weather Factors":"None","Viewing Distance":"Unknown","Longitude":"-105.032815","Date of the Event":"08/30/2008 11:30 UTC","files":["/var/www/straped/mufon/html2text/12337.html.txt","/var/www/straped/mufon/org/12337.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.846053,+-105.032815(12337)&iwloc=A&hl=en\"> mufon case (12337) map </A>","Disposition":"Unknown","Case Number":"12337"}