{"Object Features":"Dome","Sighting Duration":"Undisclosed","Country":"United Kingdom","City":"Liverpool","Object Flight Path":"Stationary,Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.41739,+-2.985396(12333)&iwloc=A&hl=en\"> mufon case (12333) map </A>","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around August 30th 2008","This sighting has never been favorited.",""],"Object Shape":"Circle","Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"GB-09032008-0007","Summary":"orange balls in the sky","files":["/var/www/straped/mufon/html2text/12333.html.txt","/var/www/straped/mufon/more/12333_submitter_file1__camara077.JPG","/var/www/straped/mufon/org/12333.html"],"Case Number":"12333","Tags":"City","Longitude":"-2.985396","Source":"MUFON","Date Submitted":"08/30/2008 09:40 UTC","divs":["Sighting Detailsi was on my way to my cousins house and i was driving through the village next to where i live. as i was driving i just happened to look up and noticed several orange glowing balls in the sky. there was ten to fifteen of them roughly. i decided that knowing i had my camera on me i would stop in a good clear place and take the photo. i stopped where there was no trees. the sky was very clear so these balls were shinning bright. i took the photo watched them for about a minute and noticed that they were still and there was no noise. one or two of them appeared to move up and down slightly but mainly they were still. i got back into my car and started to drive. i kept looking back at them and after about minute and half they had disappeared, before the end of the road. when i got to my cousin house i took a look at my photo and i was expecting to see the orange balls that i saw, instead i saw what appeared to be metal disc like shapes all of them being the same shape with a little point on the top. when you zoom in and brighten the picture a little they look good. have no idea what they are, but i think they look like death gliders out of stargate."],"Date of the Event":"08/30/2008 09:40 UTC","Latitude":"53.41739","Region":"England"}