{"trends":["There have been 5 other sightings in Goose Creek","There were no other sightings in Goose Creek on or around September 4th 2008"],"Tags":"City","City":"Goose Creek","Sighting Duration":"Undisclosed","Summary":"Flashing light that circled then went straight up.","Log Number":"US-09042008-0004","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.986946,+-80.030727(12346)&iwloc=A&hl=en\"> mufon case (12346) map </A>","Weather Factors":"None, Does Not Apply","Object Flight Path":"Stationary","Source":"MUFON","Date of the Event":"09/04/2008 05:01 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/12346.html.txt","/var/www/straped/mufon/org/12346.html"],"Case Number":"12346","Disposition":"Insufficient Data","Date Submitted":"09/04/2008 05:01 UTC","divs":["Sighting DetailsAt 05:00 hours I went outside to the backyard with my dog as usual. And as usual I was looking at the stars, trying to think about the different constellations and then I noticed a star out of place. I thought it strange and started to question myself that I had not noticed the star before. All of a sudden the star started blimking in diferent colors, mostly white, red and flashes of blue. Then it made a semicircle motion, appeared to move down, then it turned bright white and moved up extremely fast and disappeared. Even though I have seen many other \"Stars\" and \"Thing\" in the sky since I was a child, I still feel awed when I see it happen again. I felt pretty calm, my dog was also calm, the sky was pretty clear even though we are expecting a storm, we have a new moon in the sky so there was hardly any interference. At that time in the morning I was observing Cassiopeia and my eye wandered to the left of it about 2 degrees and that is when I saw the \"star\". Had it remained still I would not have given it any more thought. This is the first time I have seen one fly up though. I do live close to an civilian airport that is connected to a military airport. Watching airplanes and helicopters is nothing new to me (retired military)and the civilian flights do not start arriving until 05:40 hours and military flights don't start till 07:40 hours. In order to be at the same place as this \"star\" they would be approaching from the east, and normally when they do this they are about 200 to 300 feet up from my house. This particular object seemed to be about 1000 or more feet up."],"Region":"South Carolina","Longitude":"-80.030727","Object Shape":"Star-like","Latitude":"32.986946"}