{"Date of the Event":"08/30/2008 10:42 UTC","Country":"United States","Object Features":"Unknown","Tags":"City","Log Number":"US-09042008-0005","Disposition":"Unknown","Case Number":"12347","files":["/var/www/straped/mufon/html2text/12347.html.txt","/var/www/straped/mufon/org/12347.html"],"Weather Factors":"None","Latitude":"41.455308","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=41.455308,+-88.26173(12347)&iwloc=A&hl=en\"> mufon case (12347) map </A>","Summary":"Illuminated sphere of yellow light","City":"Minooka","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["sighting detailsmy son and i were eastbound on i-80 on saturday 30 aug 2008 at 2242 hours. while approximately 1\\2 mile west of minooka road there appeared on the south side of i-80 and likely over the area of minooka rd., a sphere of light, traveling west at not a high rate of speed. the altitude was perhaps as high as 2000 feet. as it closed on us i kept looking at the object expecting to see other lights on it. we were traveling at about 70mph and due to the amount of traffic i could not pull off to view the ufo due to safety concerns. i instructed my son to keep it in his view until such time as i could pull off. after just about 2 minutes in view, my son stated that the light simply went out. it did not appear to fly away but instead simply blinked out or disappeared. at this point the object was behind us and to the right, out of my view but within my sons field of view. the object appeared as a ball of yellowish light, not very bright but incandescent in its brightness or the color of flame. i did not, nor at my direction, did my son view any other lights on the object as would appear on any conventional aircraft."],"Sighting Duration":"00:02:00","Date Submitted":"08/30/2008 10:42 UTC","Longitude":"-88.26173","trends":["There has been one other sighting in Minooka","There were no other sightings in Minooka on or around August 30th 2008"],"Region":"Illinois","Object Flight Path":"Straight-line path"}