{"Country":"United States","Date Submitted":"09/01/2008 11:00 UTC","Source":"MUFON","Object Features":"None","Date of the Event":"09/01/2008 11:00 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=34.07689,+-118.397156(12356)&iwloc=A&hl=en\"> mufon case (12356) map </A>","files":["/var/www/straped/mufon/html2text/12356.html.txt","/var/www/straped/mufon/org/12356.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"California","trends":["There have been 8 other sightings in Beverly Hills","There were no other sightings in Beverly Hills on or around September 1st 2008"],"Log Number":"US-09052008-0006","Disposition":"IFO","City":"Beverly Hills","Weather Factors":"None","Case Number":"12356","Object Shape":"Cylinder, Egg, Oval","divs":["Sighting DetailsAt around 11:00pm I was standing in a small park which is part of the Motion Picture Library on LaCienga Blvd. I notice a mad standing alond on one side of the field kicking a soccer ball around but not really paying much attention to it. My dog started to chase various object around the park when I noticed what looked like 3 to 4 white headlights in the sky flying towards me. I assumed nothing and went about my business watching my dog. After a minute or two i looked back in the sky and noticed the same lights in the same flight pattern; which was odd. At that point the lights should of been farther away. I watched the lights to see where they were going and proceeded to witness strange maneuvers. It would fly straight, stop and hover for a few beats rise at an angle which would show it's belly (which was full of flashing). Then it would fly up turn and take off only to return and repeat the same maneuver. I got the guy with the soccer ball to look after some nudging ( he thought I was crazy) and he saw it too. He told me it was fake and took off. I have been going to that park for over 5 years and never saw him before or since. Strange. After a few more minutes of watching, I decided to go across the street to the bigger park and see if this was some practical joke. That is when I noticed the police helicopters and cars circling the park. So I left. The disc flew away at the sign of the helicopter"],"Sighting Duration":"Undisclosed","Summary":"A disc with hovering over a Beverly Hills Park on Sept 1st 2008. Doing repetative manuvers","Tags":"City","Latitude":"34.07689","Longitude":"-118.397156"}