{"Region":"Wisconsin","Viewing Distance":"101-500 Feet","Object Shape":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsTuesday night around 1230 am I was sitting in my living room when something caught my eye as being very bright and moving straight across my back yard about 300 feet in the air. It moved from one end of the property to other in a fairly quick manner but not incredible fast. What was strange was the red to orange to white trail the looked sort of like fire but was much more stable and the edges were sharper than a fire. I watched it pass sitting down and immediatly got up after I couldn't see it any more because of my angle in the house. By the time I got outside it was gone, which was even more odd because we are up on hill and can see for a long way. For that reason and the composition of the glowing trail it didn't add up as an airplane. And we see a lot of small airplanes fly around here and this wasn't anything like those. I thought about this for the last few days and went online to see if maybe someone else may have seen and posted and to my complete surprise I found a post here on mufon from someone with the exact same description on the same night and same time in Sun Prairi which is like 30 miles due west of us."],"Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"09/02/2008 12:30 UTC","trends":["There have been no other sightings in Monches","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.191111,+-88.343611(12352)&iwloc=A&hl=en\"> mufon case (12352) map </A>","Disposition":"Insufficient Data","Log Number":"US-09052008-0002","files":["/var/www/straped/mufon/html2text/12352.html.txt","/var/www/straped/mufon/org/12352.html"],"Object Features":"Undisclosed","Date of the Event":"09/02/2008 12:30 UTC","Longitude":"-88.343611","Case Number":"12352","Latitude":"43.191111","Object Flight Path":"Straight-line path","Tags":"City","City":"Monches","Summary":"red, orand to white trail from something moving above tree line"}