{"Disposition":"Hoax","Date Submitted":"09/05/2008 08:00 UTC","Object Shape":"Star-like","Region":"Texas","Summary":"Bright Light moving toward me the stops and hovers for 10 min.","Country":"United States","Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-09062008-0002","City":"McKinney","Viewing Distance":"Unknown","Object Features":"Undisclosed","Case Number":"12358","Date of the Event":"09/05/2008 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.200716,+-96.637642(12358)&iwloc=A&hl=en\"> mufon case (12358) map </A>","Latitude":"33.200716","trends":["There have been 30 other sightings in McKinney","There was one other sighting in McKinney on or around September 5th 2008"],"Longitude":"-96.637642","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I were at Erwin Park in McKinney. She walks the dogs and I usually fly my model electric airplanes. While watching my airplane I spoted a bright white light comming toward me from the south. It stoped in a position just above and to the right of the cresent moon. I called my wife to come watch. She brought the dogs and sat in the grass right beside a bike trail. I was distracted by bicyclest asking about my plane as I was flying it. For some reason I got to thinking that it was just Jupiter and when my plane landed went to put in a fresh battery for the next flight. All the while my wife continued to watch the light. She said that it seemed to move slightly side to side but stayed in the same spot. She said that it would get very bright and then dim. After she watched it for about 10 min. she turned her head and when she turned back it was gone. I found Jupiter way east of the moon and could see Venus in the west but I never again found the bright star like light again. The altitude of this light was above the flight path of the jets aproaching DFW. I have pictures of an earlier event with a bright white light that hovered over the park."],"Tags":"City","files":["/var/www/straped/mufon/html2text/12358.html.txt","/var/www/straped/mufon/org/12358.html"]}