{"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.756427,+-119.767976(12365)&iwloc=A&hl=en\"> mufon case (12365) map </A>","Latitude":"36.756427","files":["/var/www/straped/mufon/html2text/12365.html.txt","/var/www/straped/mufon/org/12365.html"],"Summary":"The 30th and 31st we saw stars moving west to south and west to north and a oblong red lights no flashing ship no wings no noise headed tothe south","Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Object Shape":"Square, Rectagular, Star-like","Case Number":"12365","Country":"United States","Log Number":"US-09062008-0009","Date of the Event":"08/30/2008 11:25 UTC","trends":["There have been 63 other sightings in Fresno","There was one other sighting in Fresno on or around August 30th 2008"],"City":"Fresno","divs":["Sighting DetailsMy husband and I were sitting outside as we usually do and he was looking up and said look and up in space we saw a star shape moving between stars going from west to south inbetween stars going toward the very bright star,kinda going from high to a lower range. Then the clouds covered it and as we were looking towards the north at this plane we saw another star shape moving between the stars going from west north to north total oposite directions,it was going from like the bottom of one star to the top of the other star.they both where changing directions. I told my husband that that was strange cause I thought the spacestation only went one way. Now this was much higher than that and the same size as the stars so they had to be big for us to see them.Then on the 31st of August we were watching the sky and talking when we saw this strange red and green light that was the size of a I guess jet no it was oblong flying no noise coming from the north to the south when it went to go by the airport the lights turned only a solid red no flashing and it was under radar because we saw a plane above it but not directly next to it.The red thing went towards the mountains like to Kingscanyon national park cause the plane was headed different like to LA Cal.We live in Fresno California and live close to the airport and if you want to telephone us I would be happy to talk to you.I contacted Billy Booth he was very sincere with the email hope I gave the right directions. This all happened between 10 and 11;30 at night. This is the forth something that we have seen in August 2008.You have my phone number you can call collect if you want.The red ship kept going until we couldn't see it anymore.The ship that was green and red to solid red got bigger as it came closer. We know this could not be a copter or a plane as there was no noise until we saw and heard the plane that went by."],"Date Submitted":"08/30/2008 11:25 UTC","Longitude":"-119.767976","Region":"California","Object Flight Path":"Undisclosed"}