{"Log Number":"US-09062008-0011","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Flight Path":"Path with directional change","Date of the Event":"08/30/2008 12:00 UTC","Latitude":"36.753857","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"California","divs":["Sighting Detailson the 30th my husband and I were out side sitting and talking when he told me to look up and in between two stars in the west the object was moving towards the south not going straight then the clouds came and covered it these were the size of the stars so they had to be really big for us tosee them. Then we were watching a plane heading to San Francisco and looked up higher and saw another star moving from the bottom of one star to the I guess east to west near the top of one going up. They really had to be big because each one like I said was the size of the stars.These were going in oposite directions.mI told my husband that this was strange because the spacestation goes one way and these were going two different ways.Then on the 31st we saw coming from the north a strange craft that was green and red not pulsating going to the south like the east to the south. We ran to the front of our yard and it was big it got close to the airport and turned solid red I figured it was under radar cause we saw a plane that was going south but up higher than the red one. We knew it wasn't a copter or plane there was no sound.It turned towards Kingscanyon National park cause the plane headed south towards L A."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.753857,+-119.764996(12367)&iwloc=A&hl=en\"> mufon case (12367) map </A>","Disposition":"Unknown","trends":["There have been 63 other sightings in Fresno","There was one other sighting in Fresno on or around August 30th 2008"],"Object Shape":"Square, Rectagular, Star-like","Summary":"We saw on the 30th and 31st of August 2008to moving stars inbetween stars going oposite directione between the stars and a red green rectangular object no sound close to my house.","files":["/var/www/straped/mufon/html2text/12367.html.txt","/var/www/straped/mufon/org/12367.html"],"Object Features":"Other","City":"Fresno","Tags":"City","Weather Factors":"Unknown","Date Submitted":"08/30/2008 12:00 UTC","Longitude":"-119.764996","Country":"United States","Case Number":"12367"}