{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"Unknown","Date Submitted":"09/05/2008 09:45 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","City":"Atlanta","Disposition":"Insufficient Data","Summary":"my son and i saw the objects while at six flags amusement park","Region":"Georgia","Country":"United States","Longitude":"-84.383112","map":"<A HREF = \"http://maps.google.com/maps?q=33.755995,+-84.383112(12361)&iwloc=A&hl=en\"> mufon case (12361) map </A>","Case Number":"12361","Date of the Event":"09/05/2008 09:45 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12361.html.txt","/var/www/straped/mufon/org/12361.html"],"Tags":"City","Object Features":"Unknown","Log Number":"US-09062008-0005","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around September 5th 2008"],"Latitude":"33.755995","divs":["Sighting Detailsmy son saw the objects first, there were at least three of them and possibly five. they were stationary for the most part though one or two raced about the sky in movements that a plane could not do, ie. fast dips and sharp turns that would tear a plane apart. they were at least a mile west of the park straight down interstate 20 toward alabama. i would put the altitude at about 1000 to 1500 feet. i pointed my canon gl2 and started shooting. i did not have a tripod so some of the images are shaky, but you can clearly see three of the objects hovering in place in a triangular formation. the ones that were moving were no longer visible. i used the digital zoom to its maximum, and as the object wafted in and out of automatic focus you can see it pulsating. one pulsed blue, the other red. i did not shoot close-ups of the third. an unusual aircraft (in terms of its large bright signal lights) can be seen flying in the airspace between the park and the object. this same jet or another one identical to it came by several minutes later and did the exact same thing. these were not stars or planets. the north star was to the left as we faced the objects and was brightly lit. there were few stars that could be seen over the corona of the amusement park, and none at that low orientation in the sky. the objects all seemed to rotate vertically like a wheel. i shot for several minutes, but since it was like shooting the points of pins in space, i couldn't get any better video so i stopped. i work in the media and have hundreds of hours in choppers. i am familiar with optical anomalies and tricks of light with cameras, and these images were not those. this is actually the second ufo event i have witnessed, but it is the first where i actually had a camera. i plan to post the video on youtube soon."],"Object Shape":"Sphere"}