{"Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Challenge-Brownsville","This sighting has never been favorited."],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"09/06/2008 08:25 UTC","City":"Challenge-Brownsville","Summary":"Metallic object,, two shiney spheres attached to upper ends of vertical columnar structure.","Date Submitted":"09/06/2008 08:25 UTC","Latitude":"39.473222","files":["/var/www/straped/mufon/html2text/12368.html.txt","/var/www/straped/mufon/more/12368_submitter_file1__08Se06UFO001.jpg","/var/www/straped/mufon/org/12368.html"],"Longitude":"-121.269128","Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsObservers: wife and self. Brownsville, California, 95919. Time: 0825AM. Duration: 25 minutes. Photos taken. We were walking along our ridge (el.2800ft) west of Brownsville, looking Southeast over Brownsville Valley. We were mildly arrested by a motionless rectangular black spot in the sky over the valley, and expected it presently to declare itself as a helicopter, but it remained unidentifiable and motionless long enough that I became curious and set my Canon S5 digital camera on a rock to use as a telescope. It has 48x magnification that can resolve the moons of Jupiter. My immediate reaction was: \"no way is that a helicopter!\" Then it began drifting westward, decreasing altitude. I started snapping photos. Its motion was smooth like a balloon, no irregularities. I finally concluded that it almost had to be some wacky balloon, but there seemed not enough volume to support any weight. And it was bright reflective metallic not matte surface. It looked heavy, compact, and structurally very complicated. The object went between two superimposed ridges on the skyline, precisely where a forest fire had been receiving tanker drops 4 days earlier. We at first thought it might be some Govt recon vehicle doing a followup of that, but it was unnecessarily radical for such work, and we've never seen anything remotely like this in the past. Distance to object was about 2-3 miles. No sound, and the environment here is nearly silent. We realized later that the object, if it continued drifting westward following behind that ridge, would pass by the villages of Rackerby amd Bangor. Palermo is also in that direction. Beale AFB is 15mi to the south. Photos available. The object has turned slightly between photos so that stereo resolution is obviously possible, though we I haven't tried it yet. d & r Brownsville"],"Object Shape":"Cylinder, Sphere, Other","Log Number":"US-09062008-0012","Country":"United States","Object Features":"Undisclosed","Case Number":"12368","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.473222,+-121.269128(12368)&iwloc=A&hl=en\"> mufon case (12368) map </A>"}