{"Case Number":"12369","Region":"Texas","Object Flight Path":"Straight-line path","Date of the Event":"09/06/2008 04:03 UTC","Date Submitted":"09/06/2008 04:03 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.085923,+-97.838693(12369)&iwloc=A&hl=en\"> mufon case (12369) map </A>","Longitude":"-97.838693","Viewing Distance":"Over One Mile","Log Number":"US-09062008-0013","Disposition":"Unknown","Object Shape":"Unknown","Source":"MUFON","trends":["There have been 2 other sightings in Buda","There were no other sightings in Buda on or around September 6th 2008"],"Tags":"City","Summary":"Looked like a kite, began changing shapes or flipping onto its side. Cresent shape on one side, white in color, turned red and disappeared.","Latitude":"30.085923","Object Features":"Unknown","divs":["Sighting DetailsOn 9-6-09 at 4:03 PM (CST), my girlfriend called me outside and pointed out a very bright white object almost overhead. It appeared to be at least 8000 feet in the sky. I retrieved my (10 by 50) binoculars and watched the object for a good 7 minutes from one position. It was moving slowly from the southeast to the northwest. It looked to be a kite sailing by, however, it had a cresent shape on one side and appeared to be changing shapes or changing its angle of orientation every second or two. Its size was about the size of a pencil erasier held out from an arms length. I could not get a good look at the object due to its constant changing shape. I quickly laid down on the lawn so I could steady my binoculars for a better look. I am quite sure it did have a cresent shape on one side of its structure. I observed it move a good 45 degrees in the sky, coming straight overhead of my backyard orientation. It had a very intense white hue to its shape also. The only feature I could make out of its structure was its cresent side. The cresent side was only visable as it appeared to be rolling over, changed its angle of orientation or changing shapes. The cresent appeared to be in porportion with the rest of the object. After about 7 minutes of viewing, the cresent side of the object began to change color from its bright white hue into red. Within 5 seconds of the cresent changing to red, the whole object appeared to have turned red and disappeared. I scanned the sky for a good 5 minutes and could not see this object and observed nothing unusual. The sky was clear with little wind and very few clouds. The cresent moon was in the southeast but was not what I was observing. This was my first UFO sighting. I feel excited to report, I am now a believer. My thanks to MUFON and to all who report their events."],"City":"Buda","Country":"United States","files":["/var/www/straped/mufon/html2text/12369.html.txt","/var/www/straped/mufon/org/12369.html"],"Weather Factors":"Unknown"}