{"City":"St George","Date of the Event":"07/26/2001 10:30 UTC","Longitude":"-113.578056","files":["/var/www/straped/mufon/html2text/1236.html.txt","/var/www/straped/mufon/org/1236.html"],"Disposition":"Unresolved","Summary":"Object travelled North to South at a high rate of","Country":"United States","Log Number":"","Sighting Duration":"00:00:59","Source":"MUFON","divs":["Sighting DetailsWe were sitting on our back porch, watching the stars and airplanes. Weobserved the object appear out of the North and travel to the South at a veryhigh rate of speed. The object appeared to be dimly lit, emitted no noise andtravelled in a straight line. About 45 minutes later the object reappeared,travelling from the Southwest to the Northeast. The first sighting, the objectappeared to be ovoid in shape3B however, the second sighting, the object appeared to be more of an elongatedrectangular shape. It was hard to get any better observation3B because the object appeared so suddenly and was gone within seconds. We aresure that it was the same object, since the dim peachy colored glow was thesame.There was no mention of it in the local paper the next day or the dayafter. It is doubtful that many could have seen the object, since it appearedand disappeared so quickly and it was fairly late at night.We lost sight of theobject, when it disappeared over the horizon. I have been interested in UFOssince I was a little boy3B but this is the first time that I have actually observed something quitedifferent than anything else that could be explained.What is curious to me isthat if it were a physical craft, why would it not have created a sonic boom? Iwould think that anything that would have been man made, would have created asonic boom, travelling at such a high rate of speed!!"],"trends":["There have been 6 other sightings in St George","There were no other sightings in St George on or around July 26th 2001"],"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.095278,+-113.578056(1236)&iwloc=A&hl=en\"> mufon case (1236) map </A>","Date Submitted":"07/26/2001 10:30 UTC","Case Number":"1236","Tags":"City","Latitude":"37.095278","Region":"Utah","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Object Shape":"Oval"}