{"Summary":"Object over house caught on digital camera","City":"Littlestown","Tags":"City","Date Submitted":"09/06/2008 07:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","Object Features":"Unknown","Source":"MUFON","Longitude":"-77.081118","Latitude":"39.751394","Disposition":"IFO","Case Number":"12371","map":"<A HREF = \"http://maps.google.com/maps?q=39.751394,+-77.081118(12371)&iwloc=A&hl=en\"> mufon case (12371) map </A>","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/12371.html.txt","/var/www/straped/mufon/more/12371_submitter_file1__UFO1stpic.jpg","/var/www/straped/mufon/more/12371_submitter_file2__UFObatch2pic1.jpg","/var/www/straped/mufon/more/12371_submitter_file3__UFObatch2pic5.jpg","/var/www/straped/mufon/org/12371.html"],"Region":"Pennsylvania","Object Shape":"Bullet, Missile, Circle","Viewing Distance":"Unknown","divs":["sighting detailsi was taking pics of the sunset outside the house. i took a few pics and decided to take one over the house. i thought i saw something on the lcd screen (after the shot was taken) that wasn't visible to the naked eye. i came in to look at the images and caught something odd. i went back out to take more pics. i stood in exact spot using the roof of the house as a reference point. nothing was there. i moved the camera to the left and right taking random pics with and without flash. the object was only visible after the photo had been taken and only showed up when i used a flash. when i viewed the second batch of images, the object was there again, but jumping all over the sky. it moved all around like no plane or satelite. one minute it was there and the next it was not and then it reappeared somewhere else. the moon was half full and south\\south west. i was facing due east. took random pics until it got too dark. i captured 7 pics showing the object."],"trends":["There have been 2 other sightings in Littlestown","There were no other sightings in Littlestown on or around September 6th 2008","This sighting has never been favorited.",""],"Date of the Event":"09/06/2008 07:30 UTC","Country":"United States","Log Number":"US-09062008-0015"}