{"Region":"Texas","Date of the Event":"09/06/2008 07:45 UTC","Object Shape":"Star-like, Other","Country":"United States","Disposition":"Hoax","trends":["There have been 30 other sightings in McKinney","There was one other sighting in McKinney on or around September 6th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Latitude":"33.202286","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Case Number":"12375","files":["/var/www/straped/mufon/html2text/12375.html.txt","/var/www/straped/mufon/more/12375_submitter_file1__100_1767.jpg","/var/www/straped/mufon/more/12375_submitter_file2__1767.jpg","/var/www/straped/mufon/org/12375.html"],"Date Submitted":"09/06/2008 07:45 UTC","Object Features":"None","Weather Factors":"Windy, Light","Object Flight Path":"Stationary,Path then hovering","divs":["Sighting DetailsI was flying my RC airplane in Erwin park and first noticed an object at around 7:45 pm floating overhead at a very high altiude I could see some detail appeared some black and white areas on object could not tell shape was moving like a baloon with the wind. At one time it looked like it stoped for about 30 seconds then moved backwards only slightly against the wind then continued on with the wind. Duration about 8 min. Lost sight of it when I turned my head. It seemed to be getting higher and smaller. I have one picture of it but the camera I took it with is not very good and it appears as a white spot. About 15 min. later like clock work I had a another sighting at 8:00 pm just like the one I saw yesterday at 8:pm this lasted about 2 min. It was a star like object that appeared above and to the right of the moon about 6 degrees from the moon. Very bright same magnatude as Jupiter. Did not move. Lost sight when high thin clouds passed in front of it. Waited untill 8:30 pm getting dark, dim magnatuide stars could be seen but not the object. My wife saw this object again also."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.202286,+-96.631752(12375)&iwloc=A&hl=en\"> mufon case (12375) map </A>","Log Number":"US-09072008-0002","Longitude":"-96.631752","Summary":"Two sitting in Park 15 min apart one baloon like other star like","City":"McKinney"}