{"Latitude":"15.51126","Country":"Honduras","City":"San Pedro Sula","Log Number":"HN-09082008-0005","Weather Factors":"Unknown","Date Submitted":"07/31/2008 10:33 UTC","Case Number":"12389","trends":["There has been one other sighting in San Pedro Sula","There were no other sightings in San Pedro Sula on or around July 31st 2008","This sighting has never been favorited.",""],"Source":"MUFON","Summary":"Object moving at a high rate of speed from left to right","Viewing Distance":"Over One Mile","Date of the Event":"07/31/2008 10:33 UTC","files":["/var/www/straped/mufon/html2text/12389.html.txt","/var/www/straped/mufon/more/12389_submitter_file1__1UFOoverSanPedroSula9588.jpg","/var/www/straped/mufon/more/12389_submitter_file2__2UFOoverSanPedroSula9589.jpg","/var/www/straped/mufon/org/12389.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=15.51126,+-88.0226(12389)&iwloc=A&hl=en\"> mufon case (12389) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Cone","Object Features":"Unknown","Longitude":"-88.0226","divs":["Sighting DetailsI was on a photo assignment in San Pedro Sula, Honduras. I went up on the second story of a small building to take some panorama shots of the mountains in the background and the area in general. While doing my pre edit of the photos that evening is when I first notice the object on the screen on my camera (canon 40D). When using the scroll wheel on the back of the camera I could really see how the object is moving in flight. At first I thought that it might be dust on the cameras senor, but 1. dust is always darker in color and 2. both shots are taken at the same time because the camera was set to High speed and dust doesn't move. Please note the object was moving so fast my naked eye never noticed it until that evening while I was doing my pre edit. So, while scrolling back and forth in the cameras playback screen right to left and so on, I could clearly see it was some type of unidenafiable object moving very fast."],"Region":"Cortes"}