{"map":"<A HREF = \"http://maps.google.com/maps?q=35.148907,+-114.559828(12383)&iwloc=A&hl=en\"> mufon case (12383) map </A>","Date of the Event":"09/05/2008 11:29 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Disposition":"Unknown","Source":"MUFON","Country":"United States","Case Number":"12383","Summary":"Pictures of Green , White and Blue lights flashing way up high. Came out odd on digital camera.","Longitude":"-114.559828","files":["/var/www/straped/mufon/html2text/12383.html.txt","/var/www/straped/mufon/more/12383_submitter_file1__DSCN1573withenlargement.jpg","/var/www/straped/mufon/more/12383_submitter_file2__DSCN1576withenlargement.jpg","/var/www/straped/mufon/more/12383_submitter_file3__DSCN1588wtithenlargement.jpg","/var/www/straped/mufon/org/12383.html"],"Weather Factors":"None","City":"Bullhead City","trends":["There have been 11 other sightings in Bullhead City","There were no other sightings in Bullhead City on or around September 5th 2008","This sighting has never been favorited.",""],"Tags":"City","Object Shape":"Flash, Other","Object Features":"None","Log Number":"US-09072008-0010","Region":"Arizona","divs":["sighting detailsi went outside because the neighbor's dogs were barking and i wanted to see what was going on. when i looked up into the north\\north east part of the sky i saw 2-4 different areas where there were lights flashing. i went back in and got my binoculars to check it out. i could see then that there was some sort of craft. not an airplane... too far up to get a good glimpse. but i did get some odd pictures in which i will attach 3 of them. i took several. i know that whatever those were they stayed in the same area for a long time...i went inside after about 10 mins. this was friday 090508 and since then there is more in the sky. i also took more pics of them today in different and the same areas. i will also do a report for those.... i know someone will be able to check them out and know then what it was that i was looking at. there is alot of activity around here lately. not only do i sense it and feel it, i know."],"Viewing Distance":"Over One Mile","Date Submitted":"09/05/2008 11:29 UTC","Latitude":"35.148907"}