{"Object Shape":"Star-like","Viewing Distance":"Over One Mile","Object Features":"Unknown","Longitude":"-119.769996","Region":"California","Summary":"Very bright misplaced star hovered then moved and quickly faded.","divs":["Sighting DetailsMy daughter and I were leaving our apartment and walked to the garage, where I noticed a star or planet near the moon. I pointed the moon out to my daughter and told her that it might be Jupiter near the moon, but I didn't know how accurate that was. We were facing the South and I pointed out what I believed to be Sirius, blazing brightly. I then turned around and faced north and saw an identical star blazing out of place. It was bright, unmoving, and steady. It was at roughly the same angle in the sky as \"Sirius\", only directly opposite and in the Northern sky. I thought that it might be a plane, but it was not following any standard approach, nor was it moving, but I figured that might be simply due to my angle and it could be moving roughly in my direction. Then, it started to moved either downward or farther north. I could not be certain because it seemed to drift slowly, but the light was fading very quickly. Within only a few seconds it had dimmed out completely, moving only a degree, maybe two, in my field of vision. When the light had dimmed, I noticed no blinking lights, red and blue lights, or in fact any other light that I would expect to see on an aircraft. It simply faded. There was no sound of a jet, prop engine, or helicopter, or any other sound for that matter. The light was white and faded out in the same color. The event lasted only 15 seconds at most, but was a little eerie as I didn't have time to analyze all the information before it was over."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.756777,+-119.769996(12398)&iwloc=A&hl=en\"> mufon case (12398) map </A>","Object Flight Path":"Hovering then path","Source":"MUFON","Date of the Event":"09/06/2008 08:50 UTC","Sighting Duration":"Undisclosed","Case Number":"12398","Country":"United States","files":["/var/www/straped/mufon/html2text/12398.html.txt","/var/www/straped/mufon/org/12398.html"],"Log Number":"US-09082008-0014","Latitude":"36.756777","Disposition":"IFO","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around September 6th 2008"],"Tags":"City","Date Submitted":"09/06/2008 08:50 UTC","City":"Fresno"}