{"Sighting Duration":"Undisclosed","Case Number":"12390","Country":"United States","Latitude":"41.885954","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12390.html.txt","/var/www/straped/mufon/org/12390.html"],"Viewing Distance":"Unknown","Log Number":"US-09082008-0006","divs":["Sighting DetailsI woke up around 5:40am and looked out my window facing west from the 7thfloor of my building to look at the rain coming down. When I looked I saw a very bright light low in the sky. At first I thought it was a plane but it did not move or blink . Then I thought it must be a planet. So I went about my business of making the bed and starting the coffee. As I was going into the bathroom to take my shower I heard someone yelling down below on the city street. So I quickly went to the window and looked down to find a tow truck down on the street. My attention then went back to the light in the sky which was still bright white and in the same location. I looked out the window some more and then to my amazement I saw this bright white object start turning orange and getting bigger in size. But it still did not move. I was then wondering what this could be. This object as it turned orange got 3 times bigger in size. This object then turned smaller and then got back to its original size and bright white. But it still did not move. As I watched this object it then turned off and just disappeared. I saw no objects flying away or lights blinking. Then all of a sudden the object came back in the same spot it was in when I first saw it and now it was blue. It then disappeared again, only to come back to the bright white object still in the same stationary spot. I then was running late for work and took my shower. When I came out I quickly went back to the window and saw the bright white object still in the same location in the sky. This time this object disappeared and then came back to a blue color and then back to the white stationary object in the sky. Then while this one object was there another same sized and same bright white object came out of the sky to the south of it and it then hovered to its right next to it very close. I was thinking what is this. I turned on the news searching for breaking news and bad accidents that may involve helicopters. I found none that morning. As I watched the second object join next to the first, this object remained white and stationary to the first object. Then another same bright white object appeared out of nowhere and joined the 2 other objects and formed what looked like a triangle. The third object hovered below the 2 other objects. Both the second and third objects moved to the right of the object and just disappeared into thin air. I waited and watched as the first light I first saw just disappeared into thin air. This all happened within 25 minutes."],"Longitude":"-87.621658","Region":"Illinois","Object Flight Path":"Undisclosed","Date of the Event":"09/04/2008 05:40 UTC","Source":"MUFON","City":"Chicago","map":"<A HREF = \"http://maps.google.com/maps?q=41.885954,+-87.621658(12390)&iwloc=A&hl=en\"> mufon case (12390) map </A>","Tags":"City","Date Submitted":"09/04/2008 05:40 UTC","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around September 4th 2008"],"Object Shape":"Sphere","Object Features":"Undisclosed","Disposition":"Insufficient Data","Summary":"Bright white stationary object turns different colors and is joined by two other objects"}