{"files":["/var/www/straped/mufon/html2text/12396.html.txt","/var/www/straped/mufon/org/12396.html"],"Object Shape":"Star-like, Triangle","Summary":"Hovering light in distance, changing colors and oscillating up and down, then flew toward house - aircraft-like","Object Features":"None","Tags":"City","Source":"MUFON","Date Submitted":"09/08/2008 08:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.386993,+-80.386702(12396)&iwloc=A&hl=en\"> mufon case (12396) map </A>","Object Flight Path":"Straight-line path","Country":"United States","City":"Burgettstown","divs":["Sighting DetailsI was walking outside from the barn to the house and noticed a bright object in the Southern sky - brighter than a star. It caught my eye because it was lower to the horizon and brighter than stars are in my area. As I watched longer it seemed to change colors from green to white to red to white to orange, etc. At this time I stopped walking and watched some more. I thought maybe it was an aircraft approaching but it didn't get any closer or seem to change in position relative to the horizon like approaching aircraft do. It seemed to be hovering - not moving left or right or toward me. It also seemed be oscillating up and down slowly. It wasn't making big movements, but rather small. At this point I really thought my eyes were playing tricks on me in the darkness and that thing really couldn't be moving only up and down. I had been watching for maybe a few minutes at this point. I went inside to get my wife to look at it also, to make sure I wasn't just \"seeing things\". I took her out on the front porch and asked her to look in the direction of the light, without telling her what to look for. She immediately noticed it and I prompted her to further describe to me what she was seeing. She said that it was moving up and down and changing colors. After about another 3-4 minutes it seemed to slowly move to the East and then it seemed to be moving North toward our house. Within 30 seconds or so we could start to see flashing lights on the object. As it got closer, I could see a white flashing light on one side and a steady red light near the rear. It started to look like an airplane (delta shape) but it was getting pretty close and I still didn't hear the engines. Eventually, it flew to the East of our house at an altitude of maybe 2000-3000 ft. and seemed to be traveling about the speed of commercial aircraft normally seen in our area. I eventually heard the sound of a gas turbine engine but it was quieter than most commercial aircraft. From the time it started to no longer hover until it passed by our house was probably about one minute. I think this might have been an airplane but the hovering in one place for almost ten minutes and the oscillating movement lead me to believe otherwise. I figured I'd report it anyway, though."],"Longitude":"-80.386702","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Log Number":"US-09082008-0012","trends":["There has been one other sighting in Burgettstown","There were no other sightings in Burgettstown on or around September 8th 2008"],"Case Number":"12396","Date of the Event":"09/08/2008 08:55 UTC","Region":"Pennsylvania","Viewing Distance":"Over One Mile","Latitude":"40.386993","Weather Factors":"None"}