{"Summary":"four dim balls of green light","Country":"United States","divs":["Sighting DetailsOn a cloudy, rainy night, at around 8:20pm on Tuesday, September 9th, 2008 I went for a quick drive to Wal-mart to pick up some school supplies. I drove down Woodsom Farm in Amesbury, a large field with hills and maybe 4 or 5 houses, which isn't too far from my house. It takes a couple minutes to fully drive down the farm, I had my windows open and was listening to a CD with decent volume. I looked to my left, where there are no houses and a clear view of a large field, when I saw four balls of green light hovering in the sky, each crisscrossing each other in a big circle. I remembered seeing those exact things about a year ago when me and my mother were driving down that same road, we even stopped the car I think to watch them. I turned off the music in my car and called my mother on my cell phone, all the while watching those odd beams of light moving in the sky. They didn't look like they were just hovering over one spot in the field, they were clearly moving along the road at around the speed I was going in my car (about 30 mph). My mom didn't answer her phone, but I still kept an eye on the lights. I forgot about the lights after I drove down the farm and got on the main road, route 110, however I took a left heading towards Seabrook, NH I noticed out of the corner of my eye the same balls of dim green light. They appeared to have followed me, gliding along maybe 50 feet in the air, circling around each other. At that point I was a little freaked out, since the last time I saw them with my mother, we didn't see them again that night. I called my mom again, hoping to reach her this time, when she finally answered I told her about them and rolled up my windows in my car. They followed me right into Seabrook but when I pulled into the Wal-mart parking lot, they were gone, they seemed to have just vanished in the sky. I don't know what they could have been, but it was definitely an odd sight."],"Region":"Massachusetts","Date of the Event":"09/09/2008 08:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.858392,+-70.930038(12407)&iwloc=A&hl=en\"> mufon case (12407) map </A>","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Object Flight Path":"Path then hovering","Latitude":"42.858392","files":["/var/www/straped/mufon/html2text/12407.html.txt","/var/www/straped/mufon/org/12407.html"],"City":"Amesbury","Case Number":"12407","Object Features":"None","Weather Factors":"Rain","Tags":"City","Longitude":"-70.930038","Log Number":"US-09092008-0009","Disposition":"IFO","Object Shape":"Circle","trends":["There have been 2 other sightings in Amesbury","There were no other sightings in Amesbury on or around September 9th 2008"],"Date Submitted":"09/09/2008 08:20 UTC","Source":"MUFON"}