{"Case Number":"12406","Country":"United States","Summary":"traveling from co. to tx. spotted lamesa tx. circluar disc lost 20min of time","Log Number":"US-09092008-0008","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.001516,+-102.073965(12406)&iwloc=A&hl=en\"> mufon case (12406) map </A>","Date of the Event":"11/25/1991 12:00 UTC","Tags":"City","City":"Midland","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","trends":["There have been 9 other sightings in Midland","There were no other sightings in Midland on or around November 25th 1991"],"Region":"Texas","Date Submitted":"11/25/1991 12:00 UTC","divs":["Sighting DetailsWe left denver co.around 9am, hoping to arrive in midland tex. by midnight. My daughter Karen who was 17 at the time, jay a friend of ours and me Brenda the driver. I have made this many times.If you have ever driven hyw349S from Lamesa to midland texas you would dicover a worn out 2 lane highway,for as the senery, well there is none unless you like mesquite,cacti,and of course lots and lots of horney toads. It is about a 60 mile stretch from Lamesa to Midland. Around 11pm mountain time (car clock)we were going about 80 mi hr. when the car began to viberate and jerk, Karen began to hollar \"pull over there is something wrong with the car!\" I quickley looked down at the gauges, the clock read 11pm andthe other gauges read normal. I looked up and everything was lit up by a brillant blue light. a colbat blue or the blue on a gas flame. I looked to the right (west) there it was, a circluar disk (like a plate turned upside down) red white and blue lights spun around in a uncounter clock way around the disc.The disc was silvery,no noise what so ever. All of a sudden it shot over the car to the east then in a split second it was behind us.The next thing i remember Karen screaming (go go go!!!!!)She was terrified.Idon\"t remember ever pulling the car over but here we are in a ditch with the cacti.I really had to punch the gas pedal to get up the incline of the ditch.I looked at the gauges the clock still read 11 but the radio said it was 12:30 (that was texas time) my car clock should have read 11:30 but read 11. i guess i began to panic I kept repeating did you see it, did you see it, what do we do, what do we do!!!!!!! I wanted to call some one yea right who in the hell would believe us. We were 30 miles from midland when our incounter happened, 30 miles to go. We got to midland told everyone in the household, their response (Yea Right.)Karen,Jay and I needed to get some rest for in 5 hrs we had to head back to colorado. Oh i forgot about Jay, he slept through it all! Karen and I did not get any sleep she was sick at her stomach and I was trying to warm myself with a small heating pad.I was so cold i could not quit shaking,it felt like my body was in shock. Two odd things i can't explain! 1. My wrist watch stopped at 11 too and never worked again. 2. The car's electrical system never worked properly again. Try driving at night and your car lights go off and you have to wait for daybreak to continue drivig. Needless to say the car was sold!! Thanks for listening, Brenda J"],"Longitude":"-102.073965","files":["/var/www/straped/mufon/html2text/12406.html.txt","/var/www/straped/mufon/org/12406.html"],"Latitude":"32.001516","Object Shape":"Circle"}