{"Latitude":"49.293039","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12400.html.txt","/var/www/straped/mufon/org/12400.html"],"Source":"MUFON","Object Features":"Undisclosed","Log Number":"CA-09092008-0002","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Circle, Fireball, Flash, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=49.293039,+-122.785959(12400)&iwloc=A&hl=en\"> mufon case (12400) map </A>","Sighting Duration":"Undisclosed","Longitude":"-122.785959","divs":["Sighting DetailsI was sitting in my living room in Coquitlam facing towards Golden Ears in Maple Ridge, and in the corner of my eye, I saw a very bright object coming up from behind the mountains as if it was like someone was taking a metal object and reflecting the shine into my eyes. So I got up to look out the window, and it slowly rose higher and higher, still shining very bright. It was about the size of a star, and then doubled in size. After that for about a minute, it got very small and vanished. I waited about 5 minutes while calling my friend who lives down the street to look outside only to see it come out of the same spot again, from behind the mountains. I was thinking it could be an airplane, but it would not have vanished like that, and be in the same position as it was before. We were both looking at it from our houses when it vanished again, this time not doubling in size. For a third time, it popped up from the mountains again, and started moving to the left, looking like it was curving towards us, and also flying higher, then it vanished. After that, she went to go look for her binoculars, and a fourth time it popped out of the mountains. This time was the weirdest because I watched it for about 5 minutes as it slowly creeped to the right of the mountains (mind you it is still very high up from the mountains) and it started to dim to a very dark orange colour. As it looked like a very bright star before (still light out at this time), it was now a dark orange sphere and it kept floating towards the right. After that I did not see it anymore. Another thing is, between the months of July-Present, my friend and I (and alot of other people) have also seen star looking shapes in the sky, that blink red and green very fast. I am actually currently looking at one right now. I am just wondering if there are any explanations for these sightings or if anyone has seen the same thing around the lowermainland."],"Case Number":"12400","Summary":"Very weird bright light coming from behind the mountains and slowly moving","Disposition":"Unresolved","Region":"British Columbia","City":"Coquitlam","Date Submitted":"09/03/2008 08:15 UTC","Date of the Event":"09/03/2008 08:15 UTC","Country":"Canada","trends":["There have been 4 other sightings in Coquitlam","There were no other sightings in Coquitlam on or around September 3rd 2008"]}