{"Object Features":"None","Date of the Event":"06/27/2008 12:00 UTC","Log Number":"US-09092008-0004","Object Shape":"Sphere, Teardrop","Longitude":"-73.11834","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.606204,+-73.11834(12402)&iwloc=A&hl=en\"> mufon case (12402) map </A>","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/12402.html.txt","/var/www/straped/mufon/org/12402.html"],"Date Submitted":"06/27/2008 12:00 UTC","Latitude":"41.606204","trends":["There have been 2 other sightings in Watertown","There were no other sightings in Watertown on or around June 27th 2008"],"Case Number":"12402","Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn late June 2008 while walking my dog \"Jake\" at approximately 8:45 pm I looked up at the early evening sky. It had rained and I wanted to see if it was still overcast guessing at whether it might rain again or perhaps in the morning.I saw a streak of light in the western sky and had thought at first it was a bolt of lightning. However as I continued to view the growing darkness of night I realized that there were lines of light that simultaneously came out of each direction--north, south, east and west; met in the northern sky spun in a clockwise direction three or four times and then each went back from where they came to start the dance in the twilight over again.These \"lights\" were not saucer or cylinder shape they were \"globes\" of intensely bright white light. As they traveled from each direction bright white light trailed behind them. When they met and spun they appeared to look like four \"ying and yang\" shapes.I live about one to one and a half miles away from several car dealerships which are in the north and I thought to myself that perhaps it was a laser light show used as an advertising tool. Waterbury, Connecticut is known for its steep hills and valleys so to me it seemed impossible as each globe went to the north south east and west as far as the eye could see; if it was a laser show a hill or valley would get in the way stopping me from seeing its straight continuous path.These \"globes\" traveled faster than any plane, helicopter or jet that I have ever witnessed in my fifty plus years.I do not drink alcohol and I do not take any illegal substances I was not sleeping before I took my dog outside so I wasn't dreaming. I have NEVER seen anything like this. My one regret is that I didn't have my camera phone with me as this sighting lasted more then ten minutes and I could have gotten some great shots. As quickly as they appeared they disappeared silently again to the north south east and west. Since I witnessed this in June (2008) several other people have come forward to claim that they've seen similar \"lights\" have called the police and have even made it to the Waterbury Republican newspaper.If there is an explanation for this I would sure like to hear it....since then....I go nowhere without my camera phone!"],"Viewing Distance":"101-500 Feet","City":"Watertown","Object Flight Path":"Path with directional change,Other","Region":"Connecticut","Summary":"Four bright white silent spheres","Tags":"City"}