{"files":["/var/www/straped/mufon/html2text/12419.html.txt","/var/www/straped/mufon/org/12419.html"],"trends":["There have been 20 other sightings in Savannah","There were no other sightings in Savannah on or around September 8th 2008"],"Latitude":"32.085301","Tags":"City","City":"Savannah","Region":"Georgia","Country":"United States","divs":["Sighting DetailsI have seen it several times before this one, but i recently heard about being able to report ufos through a hotline or on mufon, and decided to report it! It is always the same thing but in different spots above my house. It will sometimes go south to north and other times west to east or vice versa! The only way I can describe it is that it truly is a U.F.O. to me because i'm not saying it's an alien starship, but it is unidentified to me and there are no F.A.A. regulation lights on it! It seems to be just a moving star and my mom has seen it as well!! The object just seems to float in mid-air miles above our house. It will look like a shining, bright star in the nighttime sky, but then we will see it moving at a slow pace. It flashes real bright sometimes but only when I look at it, because i have told my mom and she hasn't seen it flash yet. After it flashes real bright, it will appear as a normal star but it is moving and it gets dimmer and dimmer untill you can't see it anymore!! I'm not sure what it is but i see it alot and my sister-in-law said it could be a satellite but i heard they only move south to north?? This one that I have seen moves in all directions and makes no noise at all!! It also seems to disappear right in front of your eyes?? So to whomever is reading this report, if you have any information about what this object is please contact me and relieve my curiousity!!! I know I didn't leave any contact info in this report, but I'm sure someone out there knows how to find me and get in touch?? Well thanks for taking the time to read this!!! And one last note this isn't a hoax I am dead serious and I would like to know what this object is thanks!!"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","Date Submitted":"09/08/2008 12:00 UTC","Longitude":"-81.090904","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.085301,+-81.090904(12419)&iwloc=A&hl=en\"> mufon case (12419) map </A>","Log Number":"US-09102008-0009","Object Shape":"Circle, Star-like, Other","Summary":"IT was like a moving star","Date of the Event":"09/08/2008 12:00 UTC","Disposition":"IFO","Case Number":"12419"}