{"Log Number":"US-09102008-0005","Object Features":"Undisclosed","Region":"Illinois","Sighting Duration":"00:02:00","trends":["There have been 2 other sightings in Mt Vernon","There were no other sightings in Mt Vernon on or around August 26th 2008"],"Date Submitted":"08/26/2008 12:00 UTC","Latitude":"38.317271","Summary":"White Luminescent Boomerang Shaped UFO","Tags":"City","divs":["sighting detailsbefore i submit this let me begin by saying i am of sound mind.i'm not some kind of nutjob. i live in southern illinois within the salem,mt. vernon,centralia,nashville area.on approximately 8\\26\\08 there was a crescent moon that particular evening.it was after midnight.i went outside because it was rather nice out and looked up toward the moon.as i was looking up i saw \"something\" coming into my scope of view heading directly from the west heading easterly.i have always been fascinated by flight since i was a child and i have no idea what this \"thing\" was.it appeared as though it was at about 10,000-12,000 feet in altitude,was a luminescent almost transparent color of greyish white,crescent shaped and appeared to be about the 100 yards across.as it traveled toward the light of the moon it had what i could only describe as a feathery appearance between the outward edges of whatever it was.and no,it was not a bird.it was moving a very high rate of speed.not extremely fast,but at a very good clip.i continued watching this \"thing\" move toward the light of the moon and once it reached the aura of the light of the moon...poof...it was gone.the thing about my sighting was how smooth and fluid like its movement was.it was amazing to behold.i don't know what it was,but it was the most amazing thing i have ever seen in my entire life. the one thing that really puzzled me was the feathery appearance between the outside edges as it moved across the sky.propulsion signature,preparing to cloak?very puzzling!!"],"Country":"United States","Object Flight Path":"Undisclosed","Case Number":"12415","Date of the Event":"08/26/2008 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12415.html.txt","/var/www/straped/mufon/org/12415.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.317271,+-88.90312(12415)&iwloc=A&hl=en\"> mufon case (12415) map </A>","Longitude":"-88.90312","City":"Mt Vernon","Disposition":"Insufficient Data"}