{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Tags":"City","trends":["There have been 2 other sightings in Monroe","There were no other sightings in Monroe on or around July 31st 1957"],"Disposition":"Insufficient Data","Date Submitted":"07/31/1957 12:00 UTC","divs":["sighting detailsbeing the sole competent witness of this event, my elderly mother in law requested i file this report on her behalf. she would do so herself if her vision were better. the siting occurred on a clear summer night in either 1957 or 1958. she, her husband, their two young children,her husband's sister and sister's husband were returning from a drive in movie. at the in-laws home, as everyone started to exit the parked car, she glanced over the house toward the open fields and saw what she thought was a blimp trying to land. she shouted to the others to look. it was then that they all realized that it wasn't a blimp. based on the tree-line behind the field they estimated that it was a disk shaped craft 100 feet wide, hovering about 100 ft above the field at a distance of less than 200 ft away. it had a even spacing of lights in its middle with no visible windows or sound. they all quickly ran into the house and hid the children in the bedroom. when the men went back outside a few minutes later the craft was gone. they agreed never to speak of this with anyone including their families, and they didn't. they children, now in their 50's, were young and don't remember the event. the current location puts the craft's position n\\west of the \"bobby chez seafood restaurant\" on hurffville-cross keys road, sewell (gloucester county) , n.j. the field was located, on the west side of the road an equal distance from the restaurant and the cross keys bypass."],"Summary":"Hovering 100 feet above a field behind house.","Object Flight Path":"Undisclosed","Longitude":"-74.991188","files":["/var/www/straped/mufon/html2text/12413.html.txt","/var/www/straped/mufon/org/12413.html"],"Country":"United States","Sighting Duration":"Undisclosed","Case Number":"12413","Date of the Event":"07/31/1957 12:00 UTC","Source":"MUFON","Log Number":"US-09102008-0003","Region":"New Jersey","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=39.693676,+-74.991188(12413)&iwloc=A&hl=en\"> mufon case (12413) map </A>","Object Features":"Undisclosed","Latitude":"39.693676","City":"Monroe"}