{"trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around September 11th 2008"],"Region":"Massachusetts","divs":["sighting detailswife wakes at at 3:45 as she is sick. i get up with her and see something out the bathroom window while i am using the bathroom. i live out in the country where it is quite dark and nothing to obscure my view. i happened to look out the window and saw something small in the sky that was too high in altitude to be a plane. i then saw it changing colors ans thought again of the lights on the plane, but too high. i could clearly see that it was changing colors. i got my binoculars and looked out the window at it. my first vision i feel that i can not trust as i was unable to reproduce what i first saw. i thought i saw a triangular shape with lights around the perimeter with rotating colors. i had my wife look through the glasses and she could clearly see the color changes but not the overall shape of it. i then looked again at it 10 minutes later and could still see it but could no longer make out the shape. as such i am not sure if what i initially saw shape wise was correct or if it had moved. my vision is 20\\20. i compared this object to other stars in the sky and while it looked very far away (somewhere over the atlantic i would say) it was larger and brighter, course changing colors too, than any other object in the sky. i have never seen this before and will look again tonight and from here on out to see if i can see it again. the early morning was dark but very clear, no wind, rain or anything else to note. i went to bed ad 4:00am and it was still there."],"files":["/var/www/straped/mufon/html2text/12426.html.txt","/var/www/straped/mufon/org/12426.html"],"Date of the Event":"09/11/2008 03:50 UTC","Country":"United States","Date Submitted":"09/11/2008 03:50 UTC","Source":"MUFON","Log Number":"US-09112008-0004","map":"<A HREF = \"http://maps.google.com/maps?q=41.967926,+-70.660092(12426)&iwloc=A&hl=en\"> mufon case (12426) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","Summary":"Bright object in sky changing colors: red, white, blue, green","Object Shape":"Triangle, Unknown","Latitude":"41.967926","Case Number":"12426","Viewing Distance":"Over One Mile","Longitude":"-70.660092","Object Flight Path":"Stationary","City":"Plymouth","Disposition":"IFO","Tags":"City"}