{"Longitude":"-84.129728","Summary":"Extremely fast moving triangular white/silvery object moving at extremely high speed silently","Latitude":"44.652236","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"00:03:00","Viewing Distance":"Unknown","Tags":"City","Case Number":"12425","trends":["There have been no other sightings in Mio","This sighting has never been favorited."],"Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.652236,+-84.129728(12425)&iwloc=A&hl=en\"> mufon case (12425) map </A>","divs":["Sighting DetailsMy gf and I were in Mio, Michigan for a family event today. We decided to go visit the Au Sable River just outside of town off of M-33 to see the hydro-electric dam. When we got there we noticed a few hawks gliding over the river and started to watch them. After a few moments we both noticed an object in the sky near the sun that was moving towards us. It seemed to be very high up based on its size, but it was moving incredibly fast. I've seen airliners flying overhead at 30,000 feet and this was moving much faster. I've also seen military jets flying overhead and this was also much faster than that. We expected to hear some sort of noise from the engines, thinking that I was possibly a jet of some sort, but it was absolutely silent from the time we saw it to a few minutes after it had passed. It was triangular in shape and few straight almost directly overhead. It was near impossible to judge height based on the lack of noise or noticeable details and the whole experience lasted maybe a few minutes until it was blocked from view by the treeline. I searched through google for any other people that may have seen something like this in the area or in neighboring states, but haven't seen anything yet. My gf and I are very skeptical of what we saw today and really want some sort of verification of what it was, whether that's someone else seeing the same thing or some sort of logical explanation. Please tell us we're not crazy."],"files":["/var/www/straped/mufon/html2text/12425.html.txt","/var/www/straped/mufon/org/12425.html"],"Object Flight Path":"Straight-line path","Date of the Event":"09/10/2008 12:00 UTC","Source":"MUFON","Object Shape":"Triangle","Log Number":"US-09112008-0003","Object Features":"Undisclosed","Date Submitted":"09/10/2008 12:00 UTC","Weather Factors":"Unknown","City":"Mio"}