{"files":["/var/www/straped/mufon/html2text/12428.html.txt","/var/www/straped/mufon/org/12428.html"],"Summary":"silent triangle shaped object with lights on end of each tip","Tags":"City","Case Number":"12428","Object Flight Path":"Straight-line path","City":"Burlington","Date Submitted":"09/10/2008 09:25 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=44.482242,+-73.209132(12428)&iwloc=A&hl=en\"> mufon case (12428) map </A>","Region":"Vermont","Disposition":"IFO","Latitude":"44.482242","Date of the Event":"09/10/2008 09:25 UTC","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was standing on porch with my fiance . it was a very clear night at first i thought i was see a shooting star when it was first coming into sight . but as I stared to wait for it to \"burn out\" it only became more clear it was easily seen in a tripod shape and it was completely silent. on each end of the shape there was like a like but different than an airplane light because the lights were not blinking nor did they reflect off the night sky.it was flying across the sky at the same speed as a typical flying object but also rotating as it was moving foward i live directly in the landing path of the Burlington international airport I am Very familiar with what airplanes sounds and what they look like when they are landing and taking off . this is nothing like ive ever seen in my entire life. after we could not see it anymore we looked at each other like in disbelief or shock did we just see a ufo? my first reaction was to call anyone service like the airport who may be sky watching or wouldve know of any type of plane THAT would be this unusally shaped and quiet . the woman said she only passanger planes were arriving last night and there was no plane landing or taking off around the time we had witnessed this unkown aircraft. I dont know if ill ever see somthing like this again but this was truly amazing! I wish I knew if anyone else had witnessed this."],"Longitude":"-73.209132","trends":["There have been 13 other sightings in Burlington","There were no other sightings in Burlington on or around September 10th 2008"],"Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Triangle","Log Number":"US-09112008-0006"}