{"Object Features":"Unknown","trends":["There has been one other sighting in Covington","There were no other sightings in Covington on or around July 27th 2008"],"Date Submitted":"07/27/2008 03:35 UTC","City":"Covington","Log Number":"US-09112008-0001","Case Number":"12423","Disposition":"Insufficient Data","Tags":"City","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"Does Not Apply","Object Shape":"Unknown","divs":["Sighting DetailsI was at work pulling a midnight shift, I had gone out for a smoke break at 3:30 AM. I had been out there for several minutes, I wasn't watching the clock, but I had only smoked about half of a cig. and star gazing as the stars were well visible that night. I first saw the lights of a large airplane pass over at a high altitude from west (over the Mississippi River) moving toward the east. The plane wasn't audible until it had dissapeared from my sight over the facility's roof. About a minute later I noticed another object following the same trajectory as the plane, I first believed this to be another plane as commercial flights often pass over this area. As the object moved closer, I noticed that the lights were not typical of the commercial planes I am familiar with. The lights seemed to blink red, blue, and yellow in a distinct pattern. At this point I was thinking that it was just an odd plane, but when the object was directly over my head it simply dissappeared. Given that it is very dark here at this hour, I thought that perhaps a small random cloud had passed between my view and the object, so I continued to watch for it to reappear as the stars in the area I had seen the object dissappear were still well visible. After several minutes with still no sound associated with this second object and no further sighting of it I heard a helicopter to the west. I looked in that direction and saw a helicopter (obviously identifiable by the lights and sound). The helicopter made a loop around the area I had seen the object dissapear in and then returned to the west, dissapearing behind the tree line. Growing up in Atoka, TN very near the Naval base at millington, I am quite accustomed to seeing various aircraft in the sky at all hours of the day and night. We used to watch the air show from my front yard every year, but this was unlike anything I have ever seen, military or commercial. I heard no reports on the local news about anything occurring, or being witnessed in the sky that night. I don't know what it was, but it was strange and gave me a gooseflesh sensation (which I have rarely experienced since childhood). By the time I had returned inside, 20 minutes had passed. I am not 100% on the date, it was early on a Sunday morning in late July or early August."],"Latitude":"35.564247","Object Flight Path":"Straight-line path","Longitude":"-89.646467","Region":"Tennessee","Date of the Event":"07/27/2008 03:35 UTC","files":["/var/www/straped/mufon/html2text/12423.html.txt","/var/www/straped/mufon/org/12423.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.564247,+-89.646467(12423)&iwloc=A&hl=en\"> mufon case (12423) map </A>","Summary":"blinking lights that abruptly dissappeared","Sighting Duration":"Undisclosed"}