{"Weather Factors":"None","Log Number":"US-09122008-0001","Viewing Distance":"Unknown","divs":["sighting detailsmy 18 year old daughter actually saw this event tonight and took a picture with her cell phone and sent it to me. i did not witness it, but from her description, i knew this was something extraordinary. the first time she saw it, there was a loud boom and a flash of light. by the time her eyes caught sight of it, the object was at the horizon, moving so fast that she saw tracers\\trails behind the lights. it then looped around and flew over the darkened playground in which she was sitting. she said it was low enough to light up the entire area and absolutely silent, moving extremely slowly. at this point, she took the photo of the object. she got scared and started walking home. i called her and while we were talking, it flew over her again very fast. i have included the one photo she managed to obtain. i hope it helps. she was not able to gauge altitude, distance, size, or speed, but i am certain that she would be able to give you an accurate account with the help of someone who is skilled and knowledgeable. i also spoke with a friend in the military. he told me some things that i absolutely do not want to repeat in this public forum. not yet. please contact me soon and i will discuss with you what i know. i will say this much. you absolutely must file a foia request for the radar data immediately! this thing flew over my neighborhood at least the 3 times that she saw. this is a military aircraft, allegedly the fastest man has ever known. one other thing. i also know what you found on your radar data from january. please contact me asap."],"Region":"Texas","Case Number":"12438","files":["/var/www/straped/mufon/html2text/12438.html.txt","/var/www/straped/mufon/more/12438_submitter_file1__09-11-08_2139.jpg","/var/www/straped/mufon/org/12438.html"],"Sighting Duration":"Undisclosed","Object Shape":"Boomerang","Disposition":"Unknown","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around September 11th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Date Submitted":"09/11/2008 09:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.210556,+-97.654444(12438)&iwloc=A&hl=en\"> mufon case (12438) map </A>","Date of the Event":"09/11/2008 09:39 UTC","Object Features":"Unknown","Summary":"Fast flyover, loop around, slow and low, loop, fast again","Tags":"City","Longitude":"-97.654444","Latitude":"30.210556","Country":"United States","Source":"MUFON","City":"Austin"}