{"Object Flight Path":"Straight-line path","Longitude":"-75.160879","Region":"Pennsylvania","Country":"United States","Date Submitted":"09/07/2008 08:00 UTC","Case Number":"12431","Date of the Event":"09/07/2008 08:00 UTC","Tags":"City","Sighting Duration":"00:10:00","Object Shape":"Disc","Source":"MUFON","Viewing Distance":"Over One Mile","Summary":"UFO over Philadelphia?? Viewed by six people. 4 orange Discs/Orbs","City":"Philadelphia","Latitude":"39.953435","files":["/var/www/straped/mufon/html2text/12431.html.txt","/var/www/straped/mufon/org/12431.html"],"Log Number":"US-09112008-0009","Disposition":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around September 7th 2008"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.953435,+-75.160879(12431)&iwloc=A&hl=en\"> mufon case (12431) map </A>","divs":["sighting detailsi was sitting outside talking on the phone around 8pm sun 9\\7\\08. looking north towards plymouth meeting. i noticed a bright orange orb(it was hard to miss) flying accross the sky coming from the nw(316 degrees) heading east. i first thought it was a plane, but it was orange, no blinking lights and the light was big and bright. i followed it accross the sky until it disappeared at about 76 degrees. another one then appeared around the some area ( 316 degrees). it also flew towards the east, that is when i ran into get my binocs. it was not a plane. it was not a meteor - no tail. it was orange there was also something coming out of the top. my fiance also saw it through the binocs and described it as a disc with \"fire balls\" coming out of it. there were four orbs in total, i did manage to film the last two, the final one disappearing at about 8:15. they all travelled on a straight line, not moving up or down. all four disappeard in the same exact spot. no more followed. the video i have is shaky, i was trying to get the tripod hooked up and i was trying to zoom in to see if i could figure out what it was. the best shot i have is around 1:30 in my video, it shows the houses and you can see the orb travelling in the background. this was witnessed by about 6 people. link to youtube video: http:\\\\www.youtube.com\\watch?v=y3a4tdvksfm can you please email and let me know what you guys think it is. thank you."],"Weather Factors":"Unknown"}