{"Viewing Distance":"101-500 Feet","Object Flight Path":"Unknown","Object Features":"Dome","Region":"Florida","Log Number":"","Tags":"City","Latitude":"27.839747","trends":["There have been 8 other sightings in Seminole","There were no other sightings in Seminole on or around September 7th 1999"],"Summary":"Spiraling Pinwheel of color changes into UFO at cl","Date of the Event":"09/07/1999 04:59 UTC","Source":"MUFON","divs":["Sighting DetailsThe witness woke up abruptly at 4:49 a.m. because colored lights were flashingin her bedroom. They were so bright and she said that she was more wide awakethan she usually is on rising in the morning. She then went into the livingroom which also was lit with flashing colored lights. She immediately openedthe locked front door and looked around the area and saw nothing, she wasexpecting to see emergency vehicles outside. She then looked up to the west tosee a swirling, beautiful bunch of lights that were the cause of all thebrightness in the surrounding area. These lights were forming a giant counterclockwise circle and contained every color of the rainbow, pink, rose, red, redorange, yellow,yellow orange, green, white, blue green and violet, she said. The were swirlingin a counter-clockwise direction and somehow made the witness stare in awe atwhat she described as the most beautiful thing she had ever seen (figure 1). This swirling light formation was traveling very slowly from the west towardsthe south and just above a small palm tree and light post only 250 to 300 ft.away when the witness first saw it. She then started yelling for her son, whowas asleep in the living room, to come and see this. After more yelling andwatching the object briefly out of the living room window, the witness persuadedhim to come out and look. After only a very short time she was again outsidewatching this swirling light phenomena move a little to the south. Her son wasable to see the object as it was in a second phase, a turquoise ball with astreak behind it (figure 2). It was approximately 75 ft. wide. After approx.two minutes both witnesses were then astonished to see it change into a saucerlike object which formed a cloud around it and then rose directly up anddisappeared. Both witnesses agreed to witness twos drawings of what they sawand that the gray object had two white lights at either end. Both witnesses suddenly became frightened and ran into the house, barricadingthemselvesand a younger child in the house. She called her husband at work who was on amidnight shift asking him to come right home. She continued to secure the houseand when he came home he found them both distraught.They called the airports and did not get a satisfactory answer nor did they knowwho they should call for help. After waiting on hold, the last airport saidthere had been a lot of meteor sightings this morning and also that RussianSatellite Debris had reentered the atmosphere. They informed the husband tocall the police. The local TV station heard of their calls and cameras andmedia employees arrived five hours later and interviewed her on camera. She had also called the MUFON hotline and Lorraine Gerber, responded with aphone call in the morning arranging for an interview at 1:00 p.m. thatafternoon. Three investigators, Lorraine Gerber, Robert Kruse and Jimmy Kruse,arrived on the scene for the initial interview and Lorraine Gerber followed upwith several other visits after that time. Bob Kruse returned to the area several days later, to take some of the measurements.Because of the negative reaction she received from her family and friends whosaw the FOX TV news coverage, she preferred to have us withhold names etc."],"Date Submitted":"09/07/1999 04:59 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.839747,+-82.791213(1243)&iwloc=A&hl=en\"> mufon case (1243) map </A>","Disposition":"Unresolved","Object Shape":"Unknown","Country":"United States","Sighting Duration":"00:05:00","City":"Seminole","files":["/var/www/straped/mufon/html2text/1243.html.txt","/var/www/straped/mufon/org/1243.html"],"Weather Factors":"Unknown","Longitude":"-82.791213","Case Number":"1243"}