{"Tags":"City","Object Shape":"Circle, Saturn-like, Star-like","files":["/var/www/straped/mufon/html2text/12444.html.txt","/var/www/straped/mufon/org/12444.html"],"Longitude":"-120.426539","Date of the Event":"09/11/2008 01:00 UTC","Disposition":"Unknown","City":"Santa Maria","Region":"California","Date Submitted":"09/11/2008 01:00 UTC","Log Number":"US-09122008-0007","trends":["There have been 4 other sightings in Santa Maria","There were no other sightings in Santa Maria on or around September 11th 2008"],"Summary":"Star-like objects in giant triangle formation","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.962754,+-120.426539(12444)&iwloc=A&hl=en\"> mufon case (12444) map </A>","Source":"MUFON","Object Features":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting Detailsi took a drive coming back after dropping my girlfriend off, something told me too, so i ended up in these back roads up in the hills very dark i noticed the stars outside and have always been an admirer so i decided to park. low and behold i noticed a couple of very bright stars in the sky so i focused my attention on them and noticed they would move left to right up and down, not major movements either but they were definetly moving then i noticed the third object and they had formed a triangle these objects were not close to each other. it was very dark since i was away from the city lights and you could see at times smaller star-like less bright objects in the sky moving in the middle of the triangle and towards the brighter star like objects this went on for hours. i was able to spot probably 30 or more objects in the entire night sky, at first glance these would be \"stars\" until you noticed the movements. at times they would become very bright like shine brighter than they already were, i was able to see smaller ones shoot off and then back, it was weird. after hours of observation i finally went home since the sun was going to be coming up anyway, it was amazing there was just so much activity that when i decided to go home i wasnt even disappointed about not having a camera. i went out again last night but of coarse it was foggy."],"Weather Factors":"Unknown","Case Number":"12444","Viewing Distance":"Unknown","Latitude":"34.962754"}