{"map":"<A HREF = \"http://maps.google.com/maps?q=33.400406,+-104.521224(12441)&iwloc=A&hl=en\"> mufon case (12441) map </A>","City":"Roswell","Disposition":"Unknown","Latitude":"33.400406","Object Shape":"Triangle","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around October 9th 1996"],"Weather Factors":"Unknown","Case Number":"12441","Tags":"City","divs":["Sighting DetailsIt was right before my husband were leaving for work. He had just bought me a telescope for my birthday (10-08) and we were in the front yard trying to focus on the moon. I was leaning on my car waiting for him to set it up. I was looking to the east when my pereiferral vision cought something to my left. I turned to see what it was and there was this big triangle just floating softly over the street and moving very slowly to the south. There was absolutely no sound or wind from it. My dog was in the yard and he wasn't disturbed by it! It continued to float down the street and hovered over the hangers at the Roswell industrial center. We lived about four blocks away from the hanger where the 1947 crash debri was taken. It hvered there for about 15 seconds then shot straight up and was gone in a split second. I tried to get my husband's attention but I just couldn't speak! I did file a report of the incident with the Roswell UFO Museum the very next day. I had told Mr. Glen Dennis about it. The strangest thing was that I wasn't scared during the incident. It was after that I started to shake from the meer thought of it being so close to me. I was only about 100ft. away from the road. and the objest was only as high as the power lines!"],"Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/12441.html.txt","/var/www/straped/mufon/org/12441.html"],"Date of the Event":"10/09/1996 12:00 UTC","Object Flight Path":"Path then hovering","Longitude":"-104.521224","Date Submitted":"10/09/1996 12:00 UTC","Region":"New Mexico","Sighting Duration":"Undisclosed","Summary":"objest was about 50ftx50ft triangular, satiny grey w/a light in each corner","Country":"United States","Log Number":"US-09122008-0004","Object Features":"None","Source":"MUFON"}