{"Country":"United States","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.457537,+-112.066577(12449)&iwloc=A&hl=en\"> mufon case (12449) map </A>","Weather Factors":"None","Region":"Arizona","Source":"MUFON","Sighting Duration":"01:00:00","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around June 28th 1996"],"Summary":"Big Pearl Like Object Hovering Over Phoenix","City":"Phoenix","Object Shape":"Fireball, Sphere","divs":["sighting detailsmy mother and i were driving home from grocery shopping. we were heading west on guadalupe road in tempe, az. it was another hot, clear summer day. it was 7:30pm and still well lit. my mom was driving. all of a sudden she gasped and pointed at something way up high out of the view of the windshield. i leaned forward and saw a streaking silver object coming down at an angle. my mother told me her first thought was a falling plane. my first thought i told her later was a meteorite. it seemed to fall for a full minute or maybe i just thought time had slowed down. it stopped suddenly in the sky and appeared to be above the foothills (guadalupe and ahwatukee edge) over south mountain. but there is really no way to tell how far it was. this is when mom and i really became alarmed. we knew immediately something otherwordly was going on. we turned down to grove parkway where we lived, pulled into the driveway, and i ran and got dad and my sister out to the lawn. they wanted to know what was going on. i said, \"there's a ufo outside.\" i had to repeat myself, \"there's a ufo outside.\" i retrieved my binoculars even though i was scared it wouldn't be there when i got back out. surely enough, it was still there. it had changed when it had stopped falling from a silver bullet\\comet shape to a giant, pearl-like sphere in the sky with a black wedge exactly on the bottom which seemed to be spouting out a clear gas and it was hovering over the mountain. i looked through the binoculars, focused in and it was still just a big pearl, except i could see little red sparks of fire shooting off the surface which would zig zag in the air and then blink out. it just stayed there while cars zipped past us on the street. it was bizarre. it didn't seem like anyone else was seeing this. after about 45 minutes, it seemed to be moving with the curve of the earth because it was getting farther and farther away at the same rate of the sun and was slowly coming down. it got dark and finally it was out of sight behind the mountain. we turned on the news to see if it was on there. nothing. i personally called luke air force base to see if anything had shown up on their radar. the lady i spoke with said no and noone had called."],"Tags":"City","Date of the Event":"06/28/1996 07:30 UTC","Longitude":"-112.066577","Viewing Distance":"Unknown","Log Number":"US-09122008-0012","Object Flight Path":"Stationary,Path then hovering","Date Submitted":"06/28/1996 07:30 UTC","Disposition":"Unknown","Latitude":"33.457537","Case Number":"12449","files":["/var/www/straped/mufon/html2text/12449.html.txt","/var/www/straped/mufon/org/12449.html"]}