{"files":["/var/www/straped/mufon/html2text/12453.html.txt","/var/www/straped/mufon/org/12453.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.686049,+-121.172208(12453)&iwloc=A&hl=en\"> mufon case (12453) map </A>","Object Flight Path":"Stationary","Longitude":"-121.172208","Source":"MUFON","City":"Folsom","Weather Factors":"Unknown","Latitude":"38.686049","divs":["Sighting DetailsI went outside at about 2:25 a.m. to smoke a cigarette. I sat down in my usual spot, and I happened to glance up at about a 45 degree angle from the ground, and I noticed a bright blinking light. At first I thought it was an airplane, but then I saw that it wasn't actually moving anywhere. It was staying in the same spot, but the blinking light was throwing colors that I've never seen on a close Venus or Mars experience, and it was too bright to be a satellite...and airplanes don't have pink lights on them. I kept my focus on the light, and I realized there was a random pattern emerging. The base color was white, but then I'd see the color change in sets of threes. It went right to left, and the colors it was giving off were pink, purple, green, blue, red, and orange. It was as bright as an airplane coming in for landing, but it was too far away. There weren't any other stars in the sky at this time, and it wasn't moving. After about 7 minutes of just watching the light, it faded and then disappeared. If this were the first time this had happened, I would probably be terrified. Frankly, it's not. It happens from time to time, and I can go a couple years without seeing one, or a couple months. There's no set pattern of when I see it. It was pretty how it sparkled, but the lights were distinct features when each color came on."],"Date of the Event":"09/13/2008 02:25 UTC","Disposition":"IFO","Object Features":"Unknown","Log Number":"US-09132008-0004","Case Number":"12453","Sighting Duration":"Undisclosed","Summary":"Blinking stationary light in southeast sky, too bright to be a planet or satellite.","Object Shape":"Flash, Star-like, Other, Unknown","trends":["There have been 8 other sightings in Folsom","There were no other sightings in Folsom on or around September 13th 2008"],"Date Submitted":"09/13/2008 02:25 UTC","Region":"California","Country":"United States","Viewing Distance":"Over One Mile"}