{"Object Shape":"Sphere","Source":"MUFON","Date of the Event":"09/07/1999 03:08 UTC","Latitude":"27.779246","Sighting Duration":"00:00:59","map":"<A HREF = \"http://maps.google.com/maps?q=27.779246,+-82.63673(1245)&iwloc=A&hl=en\"> mufon case (1245) map </A>","Region":"Florida","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/1245.html.txt","/var/www/straped/mufon/org/1245.html"],"Summary":"Sept. 7th, 1999 TWO SPHERES","divs":["sighting detailsthe witness called the ufo reporting center, seattle, wa on 9\\7\\99 and the casewas taken from their information. the witness was asleep in her bedroom whenshe awoke at 3:08 a.m. the room was fully illuminated with a silvery whitelight. her first thought was that it might be lightning, but when she lookedout of her bedroom window, which is situated directly on the bay, she observedtwo hugh balloon-shaped spheres gliding from west to east over the bay. thespeheres were about six times the size of a full moon but much brighter. theywere about 600-700 feet above the bay and so close to her window that she feltshe could almost reach out and touch them. there were rays of white lightstreaming from the bottom of each. the objects did not make any noise. theircolor was a luminous white. the night was clear , no precipitation and the baywas serene and calm. the spheres were traveling rapidly and when she changed her view to the kitchen,the objects were gone. the witness said this was nothing that she had ever seenbefore. the light was so intense it permeated every corner of her bedroom. shefelt awe and peace. she then went back to bed and slept soundly for theremainder of the night."],"Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"","Case Number":"1245","Longitude":"-82.63673","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around September 7th 1999"],"Tags":"City","City":"St Petersburg","Date Submitted":"09/07/1999 03:08 UTC","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Straight-line path"}