{"Region":"California","Summary":"A black disc quickly moved over the Monterey Bay and hovered for some time.","Case Number":"12463","Log Number":"US-09142008-0001","divs":["Sighting DetailsAs I was smoking a cigarette on the balcony of my apartment, I noticed a fast moving black disc with a redish white light skip over the Monterey Bay very quickly. The light was on top of the object and appeared to be revolving around the top of the object. As it came over land on the south side of the bay, near the Presidio of Monterey, it slowed down and hovered for a few minutes, just a few hundred feet off the ground. It then proceeded to gain altitude and after gaining several hundred more feet, it began to slowly fly back over the bay until it reached about the middle of the bay. It continued to gain altitude, as I eventually could barely see the object and was only able to follow it based on the light atop the disc. It continued climbing into the sky over the bay until it eventually disappeared into the sky over the bay. It lasted about 23 minutes and was also witnessed by my wife. Although she only came out to see it climb over the bay and disappear into the sky. It manuevered unlike anything that I am aware of and certainly looked very strange. At first I thought it may be a helicopter, however there was never a noise made by the object and it climbed far to high into the atmosphere to be a helicopter."],"City":"Monterey","Tags":"City","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12463.html.txt","/var/www/straped/mufon/org/12463.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.603128,+-121.889556(12463)&iwloc=A&hl=en\"> mufon case (12463) map </A>","Latitude":"36.603128","Date Submitted":"09/13/2008 10:30 UTC","Object Flight Path":"Path with directional change,Path then hovering","Longitude":"-121.889556","Weather Factors":"None","Object Shape":"Disc","Date of the Event":"09/13/2008 10:30 UTC","Viewing Distance":"Over One Mile","Object Features":"None","trends":["There have been 18 other sightings in Monterey","There were no other sightings in Monterey on or around September 13th 2008"],"Sighting Duration":"00:03:00"}