{"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/12464.html.txt","/var/www/straped/mufon/org/12464.html"],"Log Number":"US-09142008-0002","Source":"MUFON","Latitude":"45.526022","Date of the Event":"09/13/2008 09:00 UTC","Summary":"Initial appearance looked like birds, lit from below, flying toward, then away from each other. Appearance quickly changed to satellite-like and circular.","Sighting Duration":"Undisclosed","City":"Portland","Region":"Oregon","Object Features":"Wings","Object Shape":"Circle, Star-like","divs":["sighting detailswe were walking out of a restaurant facing south when i looked into the sky. i saw two lights that initially looked like very fast flying birds that were lit from below. the shapes were weaving in and out, toward and away from each other. at arms length, they would fit between finger and thumb spaced approximately 1\\16th of an inch apart. in the matter of about 20 seconds the appearance changed from bird-like to airplane-like then they seemed to quickly get much further away and higher and look more like satellites moving in a non-linear pattern as they faded, one a second or two before the other. they were headed east to west toward the sunset. it seemed strange that the brightness would fade flying towards the sun. there were no other lights on the objects such as strobes or wing markers. the objects seemed to be self illuminated. after they disappeared, what looked like a very slow moving satellite appeared in the same area, moving south to north. it was fairly bright, then faded within about 10 seconds. it was moving in a linear pattern and seemed to slow as it faded. it was strange to see the \"birds\" moving and lit up. i mentioned it to my wife and she stated that she did not see birds, but lights. we watched together, guessing what they could be. the lights seemed very close at first (within 200-300 feet), then quickly gain altitude and move very far away."],"Disposition":"Insufficient Data","Longitude":"-122.667157","Case Number":"12464","map":"<A HREF = \"http://maps.google.com/maps?q=45.526022,+-122.667157(12464)&iwloc=A&hl=en\"> mufon case (12464) map </A>","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around September 13th 2008"],"Weather Factors":"None","Object Flight Path":"Path with directional change","Date Submitted":"09/13/2008 09:00 UTC","Country":"United States","Tags":"City"}