{"divs":["Sighting Detailsthis is Shane Gray. We spoke on the phone earlier this evening concerning a sighting over the Panhandle near Panama City, Florida. I do have video tape of the sighting on September 9, 2008. The following is an account of what my family and I saw on that date. It was approximately 8:00 p.m. on Tuesday, September 9, 2008. I was walking from my barn to my house when the object caught my eye. It was a big ball of light and there was a small plane flying directly behind it as if it was chasing or following the object. The ball of light was incredibly bright and coming directly toward me. It started to make a big circle south toward Panama City. When it was directly over head, I was able to see the shape of the object, which looked to me kind of like a cigar shape and it looked like there was light coming out of the sides kind of like there was windows on the side. I did not see any wings or any strobe lights at all. It continued south until I lost sight of it. Ten to fifteen minutes later, I saw the same object coming back toward my house following the same flight path with the small plane still in trail. Then when it started to circle back to the south, the plane continued on a straight path to the north and two fighter jets showed up and followed the object until I lost sight of it again. Then ten to fifteen minutes went by and the object showed back up following the same path, but there were a total of six fighter jets following it at this time. One was extremely close to the left side of the object, one to the far right and four behind it flying in formation and it was obvious then that they were following this object. This continued for four more circles in the same flight path. The last time I saw the object it was approximately 9:30 to 10:00 p.m. During the time of this sighting, there were no other planes in this air space. Usually there are planes coming over going to and from the airport in Panama City. My daughter brought her video camera out and began filming the object on the second pass. On Thursday, September 11, we were outside in the yard at approximately 9:00 p.m., when we noticed four fighter jets overhead flying erratically. After about thirty or forty-five minutes, these fighter jets began dropping what looked like flares. In the twenty years I have lived on this property, I have never seen these fighter jets drop flares like that, which makes me think that they were trying to confuse us about what we saw two nights before because the flares looked like balls of light coming form the jets. The difference is that the flares disappeared in about ten seconds; the ball of light from September 9 circled around and did not disappear and was constant. We did not video tape the jets on September 11. am in the process of making a digital copy of the video footage we shot on September 9. I will get it to you as soon as possible."],"Source":"MUFON","Tags":"City","Object Shape":"Oval, Sphere","Date of the Event":"09/09/2008 08:00 UTC","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","City":"Panama City","Summary":"I was able to see the shape of the object, a cigar shape","Object Features":"None","Longitude":"-85.653206","map":"<A HREF = \"http://maps.google.com/maps?q=30.163313,+-85.653206(12468)&iwloc=A&hl=en\"> mufon case (12468) map </A>","Region":"Florida","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around September 9th 2008","This sighting has never been favorited.",""],"Latitude":"30.163313","Weather Factors":"None","Date Submitted":"09/09/2008 08:00 UTC","Sighting Duration":"00:01:30","Case Number":"12468","Log Number":"US-09142008-0006","files":["/var/www/straped/mufon/html2text/12468.html.txt","/var/www/straped/mufon/org/12468.html"],"Country":"United States"}