{"Source":"MUFON","City":"Dayton","Disposition":"Unresolved","Object Flight Path":"Straight-line path","divs":["Sighting Details A friend of mine named Peggy N. and I were leaving the back door of the libraryon Germantown Pike. It was August or September of 1971 or 1972. There was aclear sky and the entrance and parking lot looked south past an alley andbackyards to a residential area. It was getting dark earlier (7 or 7:30) and wasdusk. As we were leaving the library I turned to my friend and said, \"Do you seethat?\" We saw a cigar-shaped object approximately 50 feet above the ground justpast the alley. I noticed red, blue, and green flashing colored lights whichflashed in a pattern. The whole neighborhood was deadly silent, no sound, nosmells. The craft made no noise, it was just hanging there, hovering there. Wewere very scsred. We statred walking towards it, Peggy was very curious. I saidto her, \"Dont go towards it.\" The craft then began a slow slant type of ascentand then it took off real fast and zoomed away. Direction of the departure wasfrom the South to the Southwest. We lost sight of it due to the distance. Weobserved it altogether about 4 minutes. It was a large object, about 2semi-tractor trailer trucks in size.We sat in the car for quite a long time and then telephoned WHIO-TV Channel 7. Iwas advised that many sightings took place that day. It was mentioned on thetelevision that evening. I believe I was 19 years old at the time of thesighting."],"Date Submitted":"11/30/2000 07:00 UTC","Object Shape":"Triangle","Summary":"Singhting of a cigar-shaped UFO","Object Features":"Undisclosed","Log Number":"901112","map":"<A HREF = \"http://maps.google.com/maps?q=39.767938,+-84.190037(1246)&iwloc=A&hl=en\"> mufon case (1246) map </A>","Latitude":"39.767938","Country":"United States","Case Number":"1246","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/1246.html.txt","/var/www/straped/mufon/org/1246.html"],"Date of the Event":"11/30/2000 07:00 UTC","trends":["There have been 40 other sightings in Dayton","There was one other sighting in Dayton on or around November 30th 2000"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Longitude":"-84.190037","Region":"Ohio","Tags":"City"}