{"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.591072,+-121.300048(12476)&iwloc=A&hl=en\"> mufon case (12476) map </A>","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/12476.html.txt","/var/www/straped/mufon/org/12476.html"],"Summary":"I was standing in my backyard and noticed to my north east a solid black object totally silent.","Tags":"City","Country":"United States","Object Flight Path":"Straight-line path","Region":"California","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsMy wife and I hosted a dinner for another couple on saturday night. while the ladies were in the house making the dinner myself and my friend (who I will keep anonymous,hes about 50yrs old) were in the backyard simply talking about current events. Ive confidently expressed my belief in ufo's in the past so he knows were my interest lie. as we were talking I looked over at him but noticed just about his head above the horizon about 18 degrees was a solid black object which made absolutely no sound. the object was not in the shape of a helicopter and most definately not a plane. ive never seen a black blimp before and this object was way to far to be a black balloon or even a bunch of black balloons. I did not want to make a huge deal over it with the guest, but mentioned him to take a look at the object with me and i gave him a moment to really take it in. When the time was right I tested him by saying, \"well it looks like a trash bag floating off\" but of course i didnt mean that at all. he responded by saying \"no way, its way to far and big to be a bag\" the object was about the size of a pea (at arms length) in the dusk sky. more day than night. this was my first sighting."],"Date Submitted":"09/13/2008 06:30 UTC","Longitude":"-121.300048","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around September 13th 2008"],"City":"Rancho Cordova","Date of the Event":"09/13/2008 06:30 UTC","Latitude":"38.591072","Weather Factors":"Windy, Light","Case Number":"12476","Sighting Duration":"Undisclosed","Object Shape":"Diamond, Unknown","Log Number":"US-09152008-0005"}