{"Source":"MUFON","Date of the Event":"09/13/2008 10:15 UTC","Viewing Distance":"Over One Mile","Latitude":"40.61936","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Star-like","Weather Factors":"None","Log Number":"US-09152008-0003","Date Submitted":"09/13/2008 10:15 UTC","Longitude":"-111.935773","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.61936,+-111.935773(12474)&iwloc=A&hl=en\"> mufon case (12474) map </A>","trends":["There have been 10 other sightings in West Jordan","There were no other sightings in West Jordan on or around September 13th 2008"],"files":["/var/www/straped/mufon/html2text/12474.html.txt","/var/www/straped/mufon/org/12474.html"],"divs":["Sighting DetailsMy husband and I were star gazing in our hot tub saturday night. I noticed a star moving in the sky. I said what is that? We watched it travel from west to east then it turned north at a 45 degree angle. It was the size of a star, a little bit brighter. No FAA lights on it. No blinking lights. AS we watched it I got chills because I knew what we were looking at. A UFO!! It disappeared as it headed north. 15 minutes later or so we were looking for it in the same area. It came back again. Traveling along the same path as before but came from the north heading south. Same size like a star. It stopped in the sky and to me it was \"pretending\" to be a star. THen it started moving again and passed below the moon and disappeared while traveling south. We were amazed and shocked. Then last night we were again in the hot tub, but with our son this time. We were talking about what we saw the night before. Not even 10 minutes later, same area of the sky, I spot a traveling star again. We all watched it move from south to north again. Then disappeared, again. It was cool that my 12 yr son got to see it. It was a little freaky though. My husband said mabey it was the ufo freeway or something. We'll be looking again tonight, and everynight!"],"Summary":"Star like ufo moving in the sky Saturday & Sunday night","Case Number":"12474","Disposition":"Unknown","Object Features":"None","City":"West Jordan","Region":"Utah"}