{"map":"<A HREF = \"http://maps.google.com/maps?q=41.968106,+-70.661852(12479)&iwloc=A&hl=en\"> mufon case (12479) map </A>","City":"Plymouth","Object Features":"Undisclosed","divs":["Sighting DetailsI was on a bus on Long Pond Road, sitting in the front of a bus. At this point in the road there are almost all trees on both sides and hardly many houses. The bus took a left turn and I went to open a window. After I sat down I looked up into the front window and I saw a sleek black shape catch the corner of my eye. I thought it might be an F14 or F15 jet from Ottis Air Force Base, which would have been cool, but it stopped and changed it's ascending angle much higher, and actually went through the cloud, and i realized it didn't look like a jet as well, even from as far away as i was. it was shaped like a diamond that has been squished down pretty sqwat. I think but am not etirely sure it made a small hole in the cloud. I did not hear any sound, and i believe that i would have with a jet, even a few miles away, but I'm no jet expert. All this happened in seconds. During it I was excited because i thought it was a jet until it changed direction and I became nervous about it, this was the first time I have ever seen an Unidentified Flying Object. *Looking back, maybe a jet could have turned it's angle in a split-second but the shape is what gets to me."],"Viewing Distance":"Unknown","Tags":"City","Longitude":"-70.661852","Region":"Massachusetts","Date of the Event":"09/15/2008 02:14 UTC","Case Number":"12479","Country":"United States","Object Shape":"Diamond","Sighting Duration":"00:00:06","Source":"MUFON","Date Submitted":"09/15/2008 02:14 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-09152008-0008","Latitude":"41.968106","Disposition":"IFO","trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around September 15th 2008"],"Summary":"A black object that went into a cloud.","files":["/var/www/straped/mufon/html2text/12479.html.txt","/var/www/straped/mufon/org/12479.html"]}