{"Date Submitted":"03/31/1984 11:00 UTC","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/1247.html.txt","/var/www/straped/mufon/org/1247.html"],"Disposition":"Unresolved","Tags":"City","Log Number":"","Summary":"Sightiing of a round, red UFO","Sighting Duration":"00:05:00","Case Number":"1247","Source":"MUFON","trends":["There have been 3 other sightings in Westerville","There were no other sightings in Westerville on or around March 31st 1984"],"Object Features":"Undisclosed","Longitude":"-82.92907","Latitude":"40.126174","Region":"Ohio","Object Flight Path":"Unknown","Date of the Event":"03/31/1984 11:00 UTC","Country":"United States","divs":["Sighting Details I was driving home from a Grange meeting around 11 p.m. at night listening tothe radio with music, when all at once I seen a red flashing light in the sky,about that time some trees cut out my view, so I kept driving and then I seen itagain. It was a very large round object appeared overhead in the sky about treetop high with amber lights all around it and the rest of it was real red allover. It kept coming closer so I stopped the car and turned off the radio andjust looked at it because I was frightened and thought it was going to land inthe road in front of me. No one else was on the road but me, and I was alone soI was very scared. I kept watching it to see what it was going to do, and all atonce it disappeared. It was going very slow. This was April either the third orthe seventeenth, as that is Grange meetings. It was real weird, as I had neverseen anything like that before, and I hope I never do again. It looked like youcould see out of it from all around it. It did not make any noise. I would saythat it was traveling about 35 mph. It just kept coming closer to the ground.When it got below the tree top, it just disappeared out of sight. Where itdisappeared there was no trees, just an open field. I rolled down the car windowso I could see better to try to tell what it was. After it disappeared I startedthe car again, and kept looking to see if I could see it again, and I didnt soI kept going home. I wa on Worthington Road close to Alum Creek when I spottedthe object. The next morning I told my husband what I saw. He just shunned itoff so I didnt tell anyone else about it, as they would think that I was crazy.My niece was telling me about people spotting objects around, so I told herabout it. Later my daughter and others spotted an object in our fields onenight, but it was different than what I seen. I do not drink, so I was of soundmind, and I know what I seen was frightening, so now I do very little driving atnight by myself. I do feel that someone or something is watching our country,and someday may invade us and we will not have any control over it. Once beforeI was coming home from work around dark, I spotted an object in the sky that wasodd. It was going real fast. That was about four years ago about 1980 around 6pm in March. It wasnt a plane. It was small, sorta like a big bird with a tailand it left a trail behind it like when an airplane writes in the sky, or when acar starts up and leaves a trail of smoke behind. It was very low but speedy. Itwas over Worthington road going North at a very high rate of speed. It was soonout of sight. These objects are very queer looking. I am of sound mind and Iknow what I saw. I have heard of UFOs but I didnt believe that people seenthem, but now I do believe that they seen something. We dont know what theyare. (?) other people seen it but are afraid to say anything about it like Iwas."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.126174,+-82.92907(1247)&iwloc=A&hl=en\"> mufon case (1247) map </A>","Weather Factors":"Unknown","City":"Westerville","Viewing Distance":"21-100 Feet"}