{"trends":["There have been no other sightings in Canajoharie","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","City":"Canajoharie","Object Features":"Unknown","Log Number":"US-09152008-0002","Disposition":"Unknown","Summary":"UFO flying by then disappeared, then AWAC jet flying by","Case Number":"12473","Longitude":"-74.571807","Date Submitted":"09/14/2008 06:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.905629,+-74.571807(12473)&iwloc=A&hl=en\"> mufon case (12473) map </A>","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/12473.html.txt","/var/www/straped/mufon/org/12473.html"],"Object Shape":"Unknown","Latitude":"42.905629","Country":"United States","Weather Factors":"Unknown","divs":["sighting detailson 09\\14\\08 at 6:58pm i went out to my front porch which faces north. i sat down on my swing and called my friend who lives 3 mile north of me. we were talking and i noticed an object in the sky moving form the east to the west in a straight line kind of slow. i knew it wasn't a plane, jet or hellicoptor. it was also silent. i told my friend about it and they asked me where i was looking and that they were also outside. then they told me they could also see it and that it was silent. they also said they could not figure out what it was. i then said maybe it is a ufo. we were both watch it and i said i was going to go get my camera and get some pictures then blow them up. immediately after that the thing disappeared. i told my friend it vanished and they said the same, it was just there and now gone. they then said it must be a ufo. within seconds i started to hear a sound of a jet. i said to my friend i am starting to hear a jet, maybe it was some kind of jet. right after i said that a jet coming from the south flew over my house towards where the ufo was. it was one of those jets with the radar on top of it. i think they call them awax or awac. shortly after it was out of sight and you could not hear it anymore."],"Object Flight Path":"Straight-line path","Region":"New York","Source":"MUFON","Date of the Event":"09/14/2008 06:58 UTC","Tags":"City"}