{"map":"<A HREF = \"http://maps.google.com/maps?q=43.174583,+-78.68893(12485)&iwloc=A&hl=en\"> mufon case (12485) map </A>","Region":"New York","Sighting Duration":"Undisclosed","Log Number":"US-09152008-0014","files":["/var/www/straped/mufon/html2text/12485.html.txt","/var/www/straped/mufon/org/12485.html"],"Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMyself and my 14 yr old son were visiting a friend of mine on the evening of August 19 2008. I remember it being very clear out as we were in his garage the whole time. We were also looking at a plane coming at us from the east that evening as we were discusing if it was a star or a plane in the distance. I remember watching it for quite awile before we realized it was a plane. Anyway we left at around 9pm and were headed for home, we took a short detour to the local supermarket to get some ice cream. As we headed west toward the store, we saw some strange lights to the north, My first thought that it was some kind of a carnival going on, we saw the lights about at treetop level as we did loose sight as our vision was interrupted by the trees. I was trying to think of the area and what and were it could possibly be, but the area of the lights was rural. Then we reached our destination about 10 -15 seconds later. We got out saw nothing and went to the store. while i was in the store my wife called, and said you wont believe what she and my 18 yr old daughter just saw, i said yes i would cause i just saw it myself. We went home talked about it and that was it, I guess were all loosing our minds together. I forgot about it pretty much till the other day talking to my nieghbor, they brought up, So you saw the UFO too? IM like YA. Turns out they saw something to but after confirming the dates this evening, they saw the ufo on the 2nd of september also a tuesday night. Im sorry but no pics were taken as i guess we were to mesmorized to react fast enough. Well I guess im officially nuts since i just wrote this letter to you. Sincerally John Mullett"],"Date Submitted":"08/19/2008 09:15 UTC","Date of the Event":"08/19/2008 09:15 UTC","Country":"United States","Tags":"City","Latitude":"43.174583","Case Number":"12485","Source":"MUFON","Disposition":"Unresolved","City":"Lockport","Object Features":"Unknown","trends":["There have been 13 other sightings in Lockport","There were no other sightings in Lockport on or around August 19th 2008"],"Summary":"driving home from a friends house, with my 14 yr old son on a very clear night, looked to the north and saw something that looked very strange.","Weather Factors":"Unknown","Object Shape":"Circle","Longitude":"-78.68893"}