{"Tags":"City","divs":["Sighting DetailsI was going to work, approximately 4:55 a.m. and I saw an object that lookedlike a Jet Liner that was about to crash, I got out of the truck, left the motorrunning and lights on. I saw a blinking light on the front, a blinking light onthe rear, a glow around the object. It was not on fire. I thought it was ablimp that came back from an exercise. I got back into the truck afterwatching it for approximately five minutes, I didnt hear anything, no airhitting anything, no engine. (The witness was alone in the car at the time.) He looked to the south while on the highway (which was going west at that time). The object was heading towards Englewood, to the west. At arms length themovement from what I saw was approximately 12 inches for the time I watched. He thought, What the h is going on here. I thought it might be landing,because it wasnt going anywhere. When he determined that it was not a planecrashing he just started to observe it. He thought it was some kind of blimp atthat time. It was moving very slowly to the southwest. The light on the front was white. The rear light was blue, flashing like thelight on top of a bus. It was a kind of glow. It had three windows, like a commercial jet liner, but I just saw it like a passenger blimp. The lightsinside the windows were like lights on in a room. The outer area was glowingall around it, like a yellow-white look to it. It was approximately 225 ftlong , like a DC10, it was big, and it was approx. 1000 yards away from me and800-850 ft. above ground. It was a wooded area, thats why I stopped, Ithought I would get a pinpoint of the area where it went down. I left becauseI had to go to work. It was just about 5:05 a.m. 2 of 4I stopped at a 7-ll for my coffee when I got off 75 onto exit 39 there werequite a few police cars and fire engines roaming around in circles. I wasbetween exit 33 and 35.Then I came into work it was about 6:00 a.m.. I got to talking to a friend ofmine about an hour later and he asked did you hear about this UFO Sighting? What do you mean? I asked him. He told me that UFOs were reported that on thenews. I then told him that I saw something this morning. It hit me real hadwhen he told me that. Then I called the Sarasota Tribune and then SMN News (?) called me and I toldthem the same thing. When I did get off 75 onto exit 39 there were quite a fewpolice cars and fire engines roaming around in circles. I was between exit 33and 35."],"Longitude":"-82.529153","Source":"MUFON","Weather Factors":"Unknown","Region":"Florida","Log Number":"","trends":["There have been 39 other sightings in Sarasota","There were 3 other sightings in Sarasota on or around September 7th 1999"],"Sighting Duration":"00:10:00","Summary":"Sept. 7th, 1999 Sarasota cigar shaped object","Latitude":"27.343635","files":["/var/www/straped/mufon/html2text/1248.html.txt","/var/www/straped/mufon/org/1248.html"],"Case Number":"1248","Date of the Event":"09/07/1999 04:55 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Shape":"Blimp","City":"Sarasota","map":"<A HREF = \"http://maps.google.com/maps?q=27.343635,+-82.529153(1248)&iwloc=A&hl=en\"> mufon case (1248) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"09/07/1999 04:55 UTC","Object Features":"Window(s)","Country":"United States"}