{"Sighting Duration":"Undisclosed","Region":"Tennessee","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.155624,+-90.04126(12487)&iwloc=A&hl=en\"> mufon case (12487) map </A>","Date of the Event":"09/10/2008 12:00 UTC","Summary":"two ET encounters","Weather Factors":"Does Not Apply","Tags":"City","divs":["Sighting Detailslast week 9-10-2008 i went to sleep about 8:00pm and i awaken with other small gray aliens about 5 to 6 of them and it was dark in the room. and i am not shure where we all where but i got up and turn a light on and the room was white and the light seemed to shock the little grays for some reason and then somebody turned out the light i think and that is all i remember for that event. the next night 9-11-2008 i went to sleep about 8:00pm and i awakened i think it was maybe 11:00pm to 3:00am and i saw a dark entity next to my bed it had its head a few inches from my head and it was moving its head back and forth a bit and the ET was produceing a energy that was agravating saying something like \"era\" and \"gra\" and something else i cant remember by its mentail projection instead of words because they can speak english, i have heard them many times. and i fell back to sleep. i was haveing a dream at the time with a girl that was about 38 because i am 46 that i was just talking to about something and the event with the ET disruped me or the dream. it took me a few day to figure out what happen and how to write this up where it made sence."],"Latitude":"35.155624","Longitude":"-90.04126","files":["/var/www/straped/mufon/html2text/12487.html.txt","/var/www/straped/mufon/org/12487.html"],"Date Submitted":"09/10/2008 12:00 UTC","Log Number":"US-09152008-0016","Country":"United States","Source":"MUFON","City":"Memphis","Viewing Distance":"Unknown","Object Shape":"Undisclosed","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around September 10th 2008"],"Object Features":"Undisclosed","Case Number":"12487","Object Flight Path":"Undisclosed"}