{"Log Number":"US-09162008-0002","Tags":"City","Viewing Distance":"Over One Mile","Region":"California","Object Flight Path":"Straight-line path","Longitude":"-121.892076","Sighting Duration":"Undisclosed","Case Number":"12489","Source":"MUFON","Date Submitted":"09/16/2008 08:30 UTC","Latitude":"37.347216","Date of the Event":"09/16/2008 08:30 UTC","divs":["sighting detailsat approx. 8:30 pst, i was standing facing northwest on my back porch observing the skyline and noted three objects in the sky. two objects easily identifiable as (1) commercial airliner inbound for san jose international airport, and (2) a smaller civilian aircraft heading southest. i first thought the third object was another commercial aircraft flying at cruising altitude, but noted no marker lights. heading was from nw to south. object was low against the skyline, but was definitely at greater height than both identifiable craft. was able to extrapolate heading based on flight paths of both identifiable craft (commercial flight heading north inbound to sji, civilian\\small craft heading se, possibly inbound to airfield in morgan hill (best guess). unitentifiable object crossed paths (at it's higher altitude) with both craft, flying opposite direction of commercial craft, and continuing south behind civilian\\small craft. after noting no discernable flight markers required of craft in high density flight zone (i am also close to moffett field), i began tracking object, having to move several feet to my right, as object was going to be obscured by treeline. i noted the object had a very stable flight pattern, like a commercial liner in flight, but the bright light with no flashing was peculiar. as i tracked object southward, the bright light dimmed and turned a dull, brick-red. i was able to track object through trees with some difficulty, moving once to get a better view. object continued to grow more dim, or had suddenly moved much further away (i could not be certain). went through my side gate to the front yard to continue tracking object, as tree obstructed view again, but could no longer follow it's flight path. i live in a high air-traffic area, and being prone to looking up at the night sky when i am outside, i can be fairly certain this was not a commercial craft, and was too high to be a civilian\\small craft. light pollution rules out a satellite (can't see them at night here)."],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/12489.html.txt","/var/www/straped/mufon/org/12489.html"],"Country":"United States","City":"San Jose","Object Shape":"Star-like","Summary":"Point of light tracked across night sky; Light faded to red, then disappeared from view","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around September 16th 2008"],"Weather Factors":"None","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.347216,+-121.892076(12489)&iwloc=A&hl=en\"> mufon case (12489) map </A>"}