{"Object Features":"Unknown","Date of the Event":"09/02/2008 09:35 UTC","Object Shape":"Fireball, Other","Viewing Distance":"101-500 Feet","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","City":"Lockport","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.175393,+-78.68525(12484)&iwloc=A&hl=en\"> mufon case (12484) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I were watching Sarah Palin on TV about 930 at night, it was the night of the Republican National Convention. My husband popped up from the couch and said, what's that! I turned the lights off in the house to see the set of three lights revolving across the treetops. The lights seemed to move horizontally about 300 yards from our house. The lights were orange and we just stood there in amazement saying what is that? I grabbed the binoculars to see it better when the sky burst in to a bright orange color behind a treetop like a firework but with no sound. It looked as if it were a base or the bottom of something, not shaped like an airplane but something elongated. As it moved horizontally across the sky, we lost sight of it behind the tree tops and the woods to the right of our house. We didn't even think to go out side, we were too stunned to and I was frightened. I'd never seen anything like that ever! Nothing rational seems to explain it as I have mulled it over in my head for about two weeks."],"Case Number":"12484","Region":"New York","Tags":"City","files":["/var/www/straped/mufon/html2text/12484.html.txt","/var/www/straped/mufon/org/12484.html"],"Summary":"diagonal set of three lights like it was revolving across the sky just above the treetops then lit up like a fire work","trends":["There have been 13 other sightings in Lockport","There were no other sightings in Lockport on or around September 2nd 2008"],"Object Flight Path":"Straight-line path","Log Number":"US-09152008-0013","Date Submitted":"09/02/2008 09:35 UTC","Latitude":"43.175393","Longitude":"-78.68525"}