{"Tags":"City","Longitude":"-82.524903","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Diamond","Object Features":"Undisclosed","trends":["There have been 39 other sightings in Sarasota","There were 3 other sightings in Sarasota on or around September 7th 1999"],"files":["/var/www/straped/mufon/html2text/1249.html.txt","/var/www/straped/mufon/org/1249.html"],"Latitude":"27.345105","Sighting Duration":"00:00:59","Viewing Distance":"101-500 Feet","Region":"Florida","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=27.345105,+-82.524903(1249)&iwloc=A&hl=en\"> mufon case (1249) map </A>","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["Sighting DetailsUpon arrival on-site, at the motel, the witness made it clear that a taperecorder could not be used. Also expressed was some concern for possiblenegative Public Relations that could result for the motel and the witness. There was some reluctance expressed to even allow an interview to be done. Bothinvestigators expressed their understanding of the concern and explained thatcomplete anonymity would be maintained. This arrangement was acceptable and theinterview proceeded. My best memory of the witnesss narration follows:I was standing on the (north side of the) second story walkway of the motel atabout 5:05 when I first saw some very bright (assumed) aircraft headlights rightover there (pointing northwest over the water at about 20 degrees of armelevation while standing at the point of observation). The airport is alsonearby right over there (pointing northward) a few miles and that entire area iswithin the normal flying pattern for its aircraft. I first thought that a planewas either coming in for a landing or taking off. I soon changed my mind. Thisthing was coming too fast for that, and then I realized it was several vehiclesin formation. The one in front was big and triangular in shape. There werethree others following behind with I believe similar shapes. It was easy to seethe lead vehicle because those following behind it were in close formation andwere shinning their lights on it. I could clearly see its unusual triangularshape and the surface looked like shinny metal or silver colored. As theformation came closer, it still remained out over the water. Then I walked(about fifteen feet) over here (to the northwest of the building) to be able tocontinue keeping them in sight. When they were right out there (perpendicularto the coastline-westward) I knew I was seeing something very different fromnormal aircraft. They were going so fast that I felt sure I would hear a shockor see their afterburners lit up, but it was completely silent. It was eerie. I felt strange, as if the hairs were standing up on the back of my neck. Asthey continued southward the formation stayed right together, but I could seespace between the vehicles. I never saw anything change or heard any noise.They quickly flew on by and went out of sight that way (pointing southward). Idont know whats going on, but it didnt seem normal. So, I later reported itto the news media. Well, I guess thats my story. I still dont know what tothink of it and would like to know more about it, since the news media tookpretty light of it."],"City":"Sarasota","Summary":"Sept. 7th, 1999 Sarasota six speeding lights in f","Case Number":"1249","Date Submitted":"09/07/1999 05:05 UTC","Date of the Event":"09/07/1999 05:05 UTC","Country":"United States"}