{"Disposition":"Unknown","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/12498.html.txt","/var/www/straped/mufon/org/12498.html"],"Latitude":"35.802011","Longitude":"-86.911391","trends":["There have been 3 other sightings in Thompson's Station","There were no other sightings in Thompson's Station on or around September 11th 2008"],"Date of the Event":"09/11/2008 05:10 UTC","Case Number":"12498","Object Flight Path":"Straight-line path","Log Number":"US-09162008-0011","Date Submitted":"09/11/2008 05:10 UTC","Object Shape":"Cigar, Cylinder","divs":["Sighting DetailsIt was Thursday afternoon, Sept. 11, 2008. There were clouds in the sky, various sizes and various elevations. I live in the country and I was returning home from running errands. I was about to turn left (east)off of the main circular road in my neighborhood onto my street which is a cull-de-sac with my home at the end on the left. The beginning of my street is a slightly higher elevation than at the end of the cull-de-sac, about 400 yards distance. My home is the only home on my street. Yard sizes range from 2.1 acres and up. At the end of my street there are two white fence lines running south to north which is a horse riding trail, and right past the last fence is a tree line that borders a farm that also runs south to north. It was about two seconds before I actually turned left that I noticed an object in the south east flying south to north. I had a perfect line of sight view, because from my position the object was above the tree line and below the clouds. I estimated the object to be no more than 1,000 feet in elevation. The object's shape appeared to be a combination of cylinder and cigar shape. The object appeared to be two tone in color, pewter on the bottom half and silver on the upper half. Neither halves were showing any reflection which I thought rather strange since the sun at that time was shinning through a break in the clouds from the west. As I turned onto my street I slowed down and continued to watch the object fly in the same south to north direction. I ruled out commercial airline (too small), military helicopters and planes (wrong color), small private or crop dusting planes (no wings, landing gears, rudder or tail fins). The object was flying at a rather quick pace, but then when the object was right in front of me as I looded straight down my street, the object slowed down quickly and came to an almost dead stop. It was at this location that I was able to see the craft fully from the side and with much better detail. I had all of my windows down in the car (4), and the only noises I heard were the natural sounds emanating from a country setting...No cows were mooing and no horses were neying. The object's length was about the size of a chap stick held between my thumb and first finger at arms length. I would estimate the distance between myself and the object at less than a mile. About two to three seconds later the object just vanished. It did not turn left or right, go up or down, or fly backwards...it just vanished from my physical sight. I then drove to the end of the cull-de-sac, turned around and drove to various higher and lower elevations in the neighborhood to see if I could spot the object again. I could not. Sandy Nichols www.alienresearchgroup.com"],"Summary":"Object moving at good clip then slowed almost to a stop","City":"Thompson's Station","Sighting Duration":"00:00:10","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.802011,+-86.911391(12498)&iwloc=A&hl=en\"> mufon case (12498) map </A>","Source":"MUFON","Tags":"City","Region":"Tennessee","Weather Factors":"Unknown"}