{"divs":["Sighting DetailsThe weather was clear with a sleight morning haze and very little wind. My two friends who were already at the Carlsbad RC Model Airport noticed the object in the sky almost overhead but to the East somewhat. They brought it to my attention at 0830 hrs when I arrived. The object stayed stationary without any change in color, size or shape as best we could determine during the time we observed it. Around 1030 hrs I decided depart. Before leaving I took three pictures with my Canon PhotoShot S110 camera using the edge of the sun shelter to block the morning sun and give some depth to the pictures also. While driving out of the area I encountered another friend and brought this object to his attention. He believed it was a tethered balloon because of his perceived side to side motion of the object. I did not ever notice this motion. I proceeded driving home after a 10 minute visit with him."],"Object Flight Path":"Stationary","Tags":"City","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around September 16th 2008","This sighting has never been favorited.",""],"Summary":"opaque white sphere/disc/oval hovering overhead to the East approx 65-75 degrees for the entire time of observation","Weather Factors":"Windy, Light","Viewing Distance":"Unknown","Case Number":"12499","Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-09162008-0012","City":"Carlsbad","Longitude":"-104.224458","Date Submitted":"09/16/2008 08:30 UTC","Region":"New Mexico","Object Shape":"Disc, Egg, Sphere","Latitude":"32.427974","map":"<A HREF = \"http://maps.google.com/maps?q=32.427974,+-104.224458(12499)&iwloc=A&hl=en\"> mufon case (12499) map </A>","files":["/var/www/straped/mufon/html2text/12499.html.txt","/var/www/straped/mufon/more/12499_submitter_file1__UFO16Sep08a.jpg","/var/www/straped/mufon/more/12499_submitter_file2__UFO16Sep08b.jpg","/var/www/straped/mufon/more/12499_submitter_file3__UFO16Sep08c.jpg","/var/www/straped/mufon/org/12499.html"],"Disposition":"Unknown","Source":"MUFON","Date of the Event":"09/16/2008 08:30 UTC"}