{"trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around September 16th 2008","This sighting has never been favorited.",""],"Longitude":"-95.995528","Log Number":"US-09162008-0017","Object Features":"Wings","Object Shape":"Triangle","Region":"Nebraska","map":"<A HREF = \"http://maps.google.com/maps?q=41.254383,+-95.995528(12504)&iwloc=A&hl=en\"> mufon case (12504) map </A>","files":["/var/www/straped/mufon/html2text/12504.html.txt","/var/www/straped/mufon/more/12504_submitter_file1__Object.jpg","/var/www/straped/mufon/org/12504.html"],"Date of the Event":"09/16/2008 06:40 UTC","divs":["sighting detailsi was driving to work this morning heading east on interstate i-80. i had just passed gretna and was about 4 miles west of the 144th\\highway 50 exit. the sky was the clearest it had been all week not a star not a plane not a single cloud just a early crisp morning. i looked up as i was gazing at the early morning sun and saw 3 lights that where very bright. this object was approximatly to my south east(the right side of the road). i am watching this thing thinking well there is offut airforce base and epply airport so its probably a plane coming or going and its just the landing or take off lights. as i get closer i realize its getting easier to see but i still can not make a good enough glimpse to really judge. it is not very high off the ground probably about the height of a taking off or landing jet. now knowing that the base and the airport are further east i am starting to wonder why i am seeing the front landing lights that are in the middle of the two outer lights.because if they were facing me it would not be landing. right about the time i am thinking is there something more to this is it in fact a ufo. bam one two three all lights shut off in succession. right as i am looking at it. now i am really curious cause if it was in fact a plane where are the red and green lights one the ends of the wings that are supposed to be flashing. i look intensly as i can while driving and i see absolutly nothing no lights no other planes, no jet engine smoke or condensate nothing. i am just stumped. i was in the military for 4 years and i have seen lots of planes, jets, and helicopters. so one part of me says it was just a plane and i just couldnt see it for whatever reason. but another part of me is still asking why did it shut its lights off like that right at the moment i really took a great intrest in it. almost like it knew i had spotted it then since i witnessed the lights shut off i should have seen the red and green navigation lights. again the object was 3 bright white lights, center light slightly above the 2 outer lights. if there is anyway of investigating any flights in that area at that exact time i would appreciate it i did take note of the exact time the lights went off."],"Tags":"City","Latitude":"41.254383","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Summary":"Saw an unkown object heading East on interstate I-80","Date Submitted":"09/16/2008 06:40 UTC","City":"Omaha","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Country":"United States","Case Number":"12504"}