{"map":"<A HREF = \"http://maps.google.com/maps?q=30.419097,+-97.011652(12508)&iwloc=A&hl=en\"> mufon case (12508) map </A>","files":["/var/www/straped/mufon/html2text/12508.html.txt","/var/www/straped/mufon/org/12508.html"],"Date of the Event":"05/16/1966 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09172008-0003","trends":["There have been no other sightings in Lexington","This sighting has never been favorited."],"Case Number":"12508","Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","Disposition":"Hoax","Longitude":"-97.011652","Weather Factors":"Does Not Apply","Date Submitted":"05/16/1966 12:00 UTC","Summary":"although I have seen a possible ufo, this is about aliens? maybe","Tags":"City","Object Features":"Undisclosed","divs":["Sighting DetailsThis is about seeing a alien, not a ufo. I saw one alien two different times, although not sure if the same one. Both times at my grandparents house in the country. The first time was when my mother was putting all three of us kids to sleep. My Mother and I sleeping in one bed and my brother and sister sleeping in the other, both beeds in the same small room. While watching my Mother fix the covers on the bed my siblings were in, a alien appeared in front of me. This was about 43 years ago, I was about 9 yrs old. I can tell you now the alien looks just like a lot of pictures you see now, slightly transparent, slight glow, big tear drop type balck eyes. At the time this happened I had not seen anything like it. It was not tell my 30's when I saw my first pictur of exacly what I had seen. It said nothing, i said nothing, i remenber nothing else afterwards. All i remember was looking at it and seeing my mother working with my siblings in the background. a year or so later, at the same house, I was playing with my cousins and nephews. Most of the time there were a lot of kids and people around, my mother had 12 keids in her family. Something made me look towards the hosue, at the cornor was another alien some distance, not sure if the same, but looked the same from my memory. Again, nothing said, and nothing remembered other then the first sight. That was my only sighting on a alien and the only memory I have about it. The other thing that happened to me one time was at my uncle house. His house is about 5 miles from my grandparents house, both houses about 70 miles from my home. I was abruply awaken at night while sleeping in the same bed as my brother. I woke to something pulling both my feet, I jump up and out of bed and ran to where my mom and dad were sleeping, jummping over the area I knew the person was pulling my feet from. i ended up sleeping with my folks as I was scared to death, my dad, by far not a senitive person, could tell something was really upseting me. The next day he even asked my brother or sister if they had pulled my feet trying to scare me. He must of known something had relly scared me. At 52 years old, and not scared of anything, I still rap the cover around my feet becasue of that night. Only my mom, dad (died) and wife know about these moments in my life. I will forever remember and wonder what this was all about. There are a few other strange thing about myself that happend when I was young, but just had to get this out. Has anyone had this happen to them?"],"Object Flight Path":"Other","Latitude":"30.419097","Region":"Texas","Country":"United States","City":"Lexington","Object Shape":"Other"}