{"Region":"Maryland","Log Number":"US-09172008-0004","Country":"United States","Tags":"City","Disposition":"Unresolved","Object Shape":"Other","Longitude":"-77.719993","Source":"MUFON","Weather Factors":"None","trends":["There have been 10 other sightings in Hagerstown","There were no other sightings in Hagerstown on or around September 14th 2008"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/12509.html.txt","/var/www/straped/mufon/org/12509.html"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date Submitted":"09/14/2008 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.641763,+-77.719993(12509)&iwloc=A&hl=en\"> mufon case (12509) map </A>","divs":["sighting detailsi stepped outside my apartment building at about 2:15 a.m. on sunday morning to smoke a cigarette and enjoy the cool air. something caught my eye and i looked up to see a very, large, black, v shaped object floating over my apartment building and parking lot. it was moving in a south - westerly direction and it moved very slow, no sound at all, it blocked out the stars as it moved. it was about 100 feet off the ground. on the bottom of the object was 4 white lights on each side ( 8 total ). i knew it wasn't a helicopter as i have seen medivac and the presidents helicopter flying over at times, besides, they made a chopping noise and this didn't make a sound at all, none. i was shocked and startled for just a moment and i felt sick to my stomach but it didn't last long. i wanted to go inside and get my digital camera but decided not to, i didn't want to miss anything that might happen, i wanted to see where it went. i knew it wasn't one of ours or of this planet, we could not make something this large and have it fly in this manner. i was seeing something that should not be there, but it was. i just stood there and watched it float away. the object floated away and was about 1\\4 mile away, when it just vanished. i could see the stars again. after it was gone, i stood outside for another few minutes, didn't see anything else. on monday morning, i called the local newspaper to see if anyone else had reported seeing anything unusual in the wee hours of sunday morning and was told that no one had. i was going to report it to mufon on monday morning but hesitated, i went on - line and signed up for your e-mails instead. i thought about what i had seen and if i should report it, i decided that i should. 1 more thing, camp david is about 20 miles or less from where i live and our airport is about 15 miles from here."],"Date of the Event":"09/14/2008 02:15 UTC","City":"Hagerstown","Case Number":"12509","Summary":"FLOATED OVER MY APARTMENT AND PARKING LOT & DISAPPEARED INTO THE NIGHT","Viewing Distance":"21-100 Feet","Latitude":"39.641763"}