{"Source":"MUFON","Case Number":"12500","divs":["Sighting DetailsI was about fifteen years old, and my father, mother, and myself were coming back home from the riding stable where we kept our horses. Daddy was driving, Mom sat next to him and I was in the back seat. It was dark out, and I was the first to notice what seemed an intesely bright star, but then it made a sudden shoot, straight upwards. I pointed it out to my parents and as we watched, it shot back down to the point it began from. Because Daddy was driving, most of this was seen by my Mom and I. We exited the highway with the windows down, keeping the object in sight as we made several turns and stops. At this point, Daddy would also observe. The object would go straight up, then down, up, 90 dg.left, back to center, 90 dg.right, and back to center. This went on continuously for nearly the whole time it took us to go from Mesquite,TX. to Dallas. It did'nt blink or twinkle like a regular star, and in fact, we could see Venus off in another direction, and we spoke about it. It continued the movements until we reached home, and was then obscured by the trees. We were completely unnerved and shaken, but later told the rest of the family and friends about the incident."],"Longitude":"-96.592819","Object Features":"Unknown","Date of the Event":"11/15/1972 09:00 UTC","Date Submitted":"11/15/1972 09:00 UTC","Latitude":"32.770266","files":["/var/www/straped/mufon/html2text/12500.html.txt","/var/www/straped/mufon/org/12500.html"],"Weather Factors":"Unknown","Summary":"Bright,star-like object made random, up-down-90 degree movements .","trends":["There have been 12 other sightings in Mesquite","There were no other sightings in Mesquite on or around November 15th 1972"],"Country":"United States","Log Number":"US-09162008-0013","City":"Mesquite","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.770266,+-96.592819(12500)&iwloc=A&hl=en\"> mufon case (12500) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"00:25:00","Object Shape":"Star-like","Region":"Texas","Viewing Distance":"Unknown"}