{"City":"West Point","Longitude":"-73.955972","trends":["There have been no other sightings in West Point","This sighting has never been favorited."],"Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.391483,+-73.955972(12502)&iwloc=A&hl=en\"> mufon case (12502) map </A>","Date of the Event":"07/31/1993 12:00 UTC","files":["/var/www/straped/mufon/html2text/12502.html.txt","/var/www/straped/mufon/org/12502.html"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"12502","Object Features":"Window(s)","Log Number":"US-09162008-0015","Sighting Duration":"Undisclosed","Date Submitted":"07/31/1993 12:00 UTC","Object Shape":"Blimp, Cigar, Square, Rectagular","divs":["Sighting DetailsI would like to state first that I have not told this previously for obvious reasons. In Aug. 1993 at aprroxmately 2am, I was on duty as a military policeman stationed at West Point Military Academy. I was with two other M.P.'s. It was a really slow night as usual as nothing much ever really happened. This particular night we were out of our vehicles just talking amongst ourselves. We were parked next to the main parade field. As I was talking I noticed one of the M.P.'s was distracted as he was looking over my shoulder and he asked,'\"Hey what is that?\" I kept talking ignoring him. He repaeted,\"Hey whats that?\" I turned around in the back drop was this mountain. It was a clear night and visibilty was excellent as it was a full moon. When I first saw the object it was the size that shocked me initially. It was stationary and absolutely silent it was black in color, the length of at was unbelieviable. It had three huge square lights on the first story the second story had three square lights on bottom as well. We observed it for about 3-4 min. We were trying to figure out amongst us what were looking it, whether or not we should report it, but not knowing what to report. I can tell you for certain what it was not. It was not a plane, blimp, helicopter so on and so forth. As all this is happening the object all of a sudden flashes a light like a camara flash in rapid sequence three times. However, this light lite up the entire side of mountain. At this time we were very alarmed. We jumped into our vehicles and started towarded the object. As we made our way the object the object started moving slowly to my left, then it stop for about 3 seconds and traversed against it's flight path and darted to the right at an incredible speeds it was gone. Within a second it was gone. We decided not to report the incident as the military tends to frown on this type of thing. I was so shaking that at the end of my shift I had to call my father and reluctantly told him what happened, I had to tell someone. He calmed me down and then told me his story of sighting while flying on a mission in Vietnam. ......I felt better at that point...check six.....somethings out there......wish I knew what"],"Summary":"HUGE OBJECT IT LOOKED LIKE A FIVE STORY BLDG LAYING ON SIDE BLACK IN COLOR SILENT","Source":"MUFON","Disposition":"Unresolved","Region":"New York","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Country":"United States","Latitude":"41.391483"}