{"Longitude":"-120.02658","Date of the Event":"08/28/1982 02:30 UTC","trends":["There have been no other sightings in Kings Beach","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.237685,+-120.02658(12503)&iwloc=A&hl=en\"> mufon case (12503) map </A>","Object Features":"Undisclosed","Summary":"we didnt remember event came back to us 3 months later","Viewing Distance":"Unknown","Object Shape":"Triangle","Region":"Nevada","Date Submitted":"08/28/1982 02:30 UTC","Weather Factors":"Unknown","divs":["Sighting Detailswent to spend my birthday at lake tahoe my boat got stuck on a low tide we took all the property out so it wouldnt be stolen. My grilfriend was in reno at work she got to the cabin at2:00 am we talked for a few minites and drove down to beach to check on my boat we sat at the boat dock rocks it was a clear sky no traffic a beutiful night we said she noticed the lights and asked me what they where I said they where a helecoptor it had 4 down ward lights like the one in huntington beach it was 5 miles away at first sight and 40 ft off the ground and moving at 20mph so it got 2 miles away we both said there is no sound and i got off the rock and was standing walking to see it now it was over me and I searted to jog a bit to get a look at itbut it stayed above me I joged to the pear 100 yards away I steped on the pear and joged down 125 ft to the end of the pear now it was above meall that time but when it shot off to south shore Ipointed and said to a fisherman did you see that and I looked at beach and it was morning time thousand or so people on beach we didnt remember it till chrismass time in bed we both started to talk about it. the end"],"Tags":"City","Latitude":"39.237685","Log Number":"US-09162008-0016","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12503.html.txt","/var/www/straped/mufon/org/12503.html"],"Case Number":"12503","City":"Kings Beach","Disposition":"Insufficient Data"}