{"Object Flight Path":"Straight-line path","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/12514.html.txt","/var/www/straped/mufon/org/12514.html"],"Date Submitted":"09/16/2008 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-111.631179","Disposition":"Unknown","Country":"United States","Object Shape":"Boomerang, Chevron, Triangle","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around September 16th 2008"],"Log Number":"US-09172008-0009","Weather Factors":"None","Sighting Duration":"Undisclosed","Case Number":"12514","map":"<A HREF = \"http://maps.google.com/maps?q=35.208092,+-111.631179(12514)&iwloc=A&hl=en\"> mufon case (12514) map </A>","Source":"MUFON","divs":["sighting detailsi was up in flagstaff on my day off from work to enjoy the much cooler tempures and the forest, which is about a two hour drive north of phoenix az. my girlfriend and i just finshed eating dinner and we wanted to walk around a little bit before we took the drive back home as we did we took a trail by the place we ate at and started walking down it for a few minutes and started to look at the stars which are amazing up in flagstaff at almost 7000 feet unlike the phoenix area. about one minutes after we were looking up we both saw coming from the northwest ( like the grand canyon or the corner of utah area) a massive balck triangle\\boomerang looking object.. this thing had to be at least 1000 feet wide and had two red lights on it. one on eachside of the object moving very fast. it went from the time we saw it going southeast to the point we could not see it anymore in the sky was no more then 30 seconds. this objest was maybe 6000- 8000 feet in the sky and made no sound expect a little humming sound almost like a vibrating sound. when we came back to our car few poeple asked if we saw what they saw and we all talked about it for a few minutes then went our own ways i first though it was a b-2 but the object was way to big and way to fast and of corse made no sound, i have seen a b-2 at air show so i could say it was no that. but i really like to know what it was i do not thing it was man made. maybe we got it from aliens but i want to know!!!!!!!!!!!!!!"],"Date of the Event":"09/16/2008 10:15 UTC","Region":"Arizona","City":"Flagstaff","Latitude":"35.208092","Summary":"a massive black boomeranged object flys south west from the grand canyon area (MADE NO SOUND)"}