{"Summary":"Superimposeed Pic of what I saw June 17, 2008","files":["/var/www/straped/mufon/html2text/12519.html.txt","/var/www/straped/mufon/more/12519_submitter_file1__SuperimposedUFOB.jpg","/var/www/straped/mufon/org/12519.html"],"Object Flight Path":"Undisclosed","Object Shape":"Other","Log Number":"US-09172008-0014","Weather Factors":"Unknown","Source":"MUFON","Case Number":"12519","Date of the Event":"06/17/2008 12:00 UTC","Date Submitted":"06/17/2008 12:00 UTC","divs":["sighting detailsfor a detailed report of what i saw click into mesquite ufo on the internet. since i posted that report (june 17, 2008), many people have asked me to describe exactly what i saw. others think that i am crazy. (who knows, maybe i am . . .). to illustrate exactly what i saw in june 2008, i went back to the scene and photographed it from the exact position that i was in when i witnessed the craft. i then superimposed a ufo (the closest to what i actually saw) onto the pic. now this is 99.99% of what i actually witnessed. the craft (refer to the superimposed photo) was about one-half mile from my position and about 300 to 500 feet high. after i first saw the craft, it hovered in place for about 3 minutes. i did not have a camera (i now keep one in my car) so i could not photograph it. the craft was behind the two story apartments in the foreground. notice how much larger the craft is than the apartments (the apartment buildings are pretty good size). after hovering for about three minutes, it departed in a northerly direction toward arizona and utah (note the location is about one quarter mile from the nevada\\arizona border and twenty miles from utah). it took less than two minutes for it to completely disappear. while hovering, it made no noise and did not wobble. if i had to guess abouts the craft's objective, i would say that it was interested in the mesquite airport of which is located behind the trees on the far left of the photo. this experience was the most incredible observation that i have ever had. one funny element of this story is that mesquite, nevada is a city of 20,000 people. i have not met a single person that witnessed this craft (or will admit to it). i could not have mistaken it for anything else (look at it . . .what else could it have been?) i will probably never get the opportunity to see another one but if i do i will be prepared with a camera. i pass the area several times a week and my attention is glued to the craft's location in june 2008."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Region":"Nevada","Country":"United States","Disposition":"Insufficient Data","City":"St. George, Utah","map":"<A HREF = \"http://maps.google.com/maps?q=37.324278,+-113.47289(12519)&iwloc=A&hl=en\"> mufon case (12519) map </A>","Tags":"City","Latitude":"37.324278","trends":["There has been one other sighting in St. George, Utah","There was one other sighting in St. George, Utah on or around June 17th 2008","This sighting has never been favorited.",""],"Longitude":"-113.47289","Viewing Distance":"Unknown"}