{"divs":["Sighting DetailsHappened in the early evening, was stationed at the Air Force Tracking Station on top of the mountain near Mayaguez, PR. Objects approached from our south heading north across the mountain top. Sky was clear and dark, no aircraft were in the area. Several of us were grilling and chatting will waiting for the evening movies when the objected passed directly in frount of us. There were no comments between us at the time; however, it was obvious we all watched them pass. Before we could talk about what we had seen the duty officer on communications watch call on the telephone looking for the Base Commander or Base Manager, saying that the Duty Officer at Ramey,SAC, AFB, just north of us, wanting to know if we were shooting something at them? The word was relayed back to Ramey that we were not operating any events and had no idea what the objects were, but we did observe them. Ramey Ops said that if it could not be identified they were going to scramble the alert intersepters, which they did. They scrambled a flight of Marine fighters (type unknown), they could not catch the targets. We were informed there will be no comments to anyone about this until the air force had an oppertunity to investigate. The very next day the official air force statement from Patrick AFB, FL, our bosses, was it was a Snark Turn Around mission. The only problem with that was our station at PR was the turnaround command station and we weren't working. Plus the Snark was an air breathing missile and could not outrun first line fighters. Just wondering if in that period of time there were any other reports of that type of incident on the area? Thanks"],"Summary":"Series of five bright disks in a V formation approx 200 ft above mountain.","map":"<A HREF = \"http://maps.google.com/maps?q=18.201346,+-67.145152(12517)&iwloc=A&hl=en\"> mufon case (12517) map </A>","Case Number":"12517","Region":"","Log Number":"PR-09172008-0012","Date Submitted":"07/31/1961 12:00 UTC","Date of the Event":"07/31/1961 12:00 UTC","Tags":"City","Latitude":"18.201346","Disposition":"Unresolved","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12517.html.txt","/var/www/straped/mufon/org/12517.html"],"Object Shape":"Other","Weather Factors":"None","Object Features":"Undisclosed","trends":["There has been one other sighting in Mayagüez","There were no other sightings in Mayagüez on or around July 31st 1961"],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Country":"Puerto Rico","Source":"MUFON","City":"MayagÃƒÂ¼ez","Longitude":"-67.145152"}