{"Sighting Duration":"Undisclosed","Date of the Event":"05/14/2008 05:14 UTC","Summary":"UFO unseen until examination of photos","City":"Cross Plains","divs":["Sighting DetailsIt was after 5:00 PM, the afternoon of May 14, 2008. I was outside, taking photos of storm clouds. I was looking at the view screen and did not notice anything unusual until much later. When I decided to download and look at the photos on my computer, I happened to notice an \"accidental\" photo, that had 2 large blurry objects between my house and the trees in the back yard. I could not make out any details and decided the objects were probably birds. I decided to look more closely at the rest of the photos and that is when I noticed a disk shaped object over the tree line, in one of the photos. It took several months for me to even show the picture to my husband or anyone else, for fear of ridicule. When I did finally show it to him, my husband looked at the photo closely and told me I should report it, that it looked like a \"flying saucer\" to him. I showed it to a friend and she said the same thing. All I can say is that the object must have been traveling very fast, for me not to see it when I took the photo. There was no sound, like when a jet, plane, or helicopter passes overhead. I heard nothing unusual and capturing the image of the UFO was pure serendipity."],"Latitude":"32.126249","map":"<A HREF = \"http://maps.google.com/maps?q=32.126249,+-99.165342(12515)&iwloc=A&hl=en\"> mufon case (12515) map </A>","Weather Factors":"Windy","Country":"United States","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/12515.html.txt","/var/www/straped/mufon/more/12515_submitter_file1__eastland-county-ufo.jpg","/var/www/straped/mufon/org/12515.html"],"Object Flight Path":"Unknown","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around May 14th 2008","This sighting has never been favorited.",""],"Region":"Texas","Log Number":"US-09172008-0010","Date Submitted":"05/14/2008 05:14 UTC","Object Shape":"Disc","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-99.165342","Source":"MUFON","Case Number":"12515"}