{"Viewing Distance":"21-100 Feet","Object Features":"Window(s)","divs":["Sighting Details AT this time I was eight years old and no grown up would believe my story so I just quit telling it until I was a grown man. I was playing with my best friend on Walnut Street real close to the intersection with Church Street in Danville, Pa. in the summer of 1965. I can't be sure of the exact month it occured, just that it occured during the summer months when there was no school. I can still take you to the exact spot on the sidewalk where we were playing because nothing else in my life is burned into my mind like that. I can still see it and hear what noise was involved just like it just happened and I am almost 52 years old now. Me and my best friend were kneeling on the sidewalk playing with GI Joe figuremen. It was early afternoon in broad daylight. We both looked up when we heard an unusual noise overhead. It took about 10 seconds or so for the ufo to descend and hover about 40 feet or so above us. It was a saucer shaped ufo and had colored lights all around it. It had quite a few windows around it or it appeared like windows. The noise that the ufo made on descent was not of any engine known to me and I have worked around jet engines before so I know what they sound like. It wasn't a real loud noise but you could hear it. I only seen it for a real short time because me and my friend were so scared that we ran in separate directions to our houses. I went into my house and ran up and hid underneath the bed and shook like a dog does when it hears lightning. I was never so afraid of anything in my entire life. I can't remember how long I stayed under the bed until I came back out. When my parents came home I told them and they was nice about it but it was evident they didn't believe me at all. MY friend's parent't didn't believe him either and when you are 8 years old it is pretty hard to convice a grown up of seeing such a thing. I ran it over and over in my mind since then and I can't come up with an explanation. I was only eight years old and it couldn't be attributed to alcohol or drugs or an overactive imagination. The reason I say this is my friend seen exactly the same thing I did. We both have an above average IQ and seen the very exact thing and heard the very exact thing. That's pretty much my story but I wanted to tell you the reason that we were so afraid is because we thought somebody was looking at us through the windows. It was like the burning energy at a rock concert or a sporting event with a lot of people there and the energy from so many people. It was like there was a bunch of beaty little eyes looking at us to the point it made the hair on the back of your neck stand up. And besides, we were only eight years old. I am going to make sure all of your following points section is answered. 1. We were on the sidewalk playing with GI Joe figuremen on Walnut Street in Danville, Pa. in the summer of 1965. 2. We first noticed the object because of the noise of it descending to hover above us. 3. I thought it was a flying saucer and it was broad daylight so I wasn't seeing something in the night sky. It was very clear and very big. 4. It was a saucer shaped object that descended quickly and stopped suddenly to hover around 40 foot in the air. Things look bigger to you when you are younger but it looked like it was about 60 or 70 yards if you measured it all around it. It had multi-colored lights on it but the only colors I can remember for sure is green, red , and white. I can't describe its motions any better than that because I was so afraid. 5. I never was so afraid in my life and I ran home and hid under the bed and shook like a scared dog. I still get chills up and down my spine when I think about it. I will never forget it. 6. I lost sight of the object when I turned and ran home at a dead sprint. Thank you for allowing me to report this to you. I only ever mentioned it to a handful of people in my life because nobody would believe me when I was a child but no one will ever convince me I didn't see what I seen. I am not saying it wasn't something the government had but if the government did have such a thing I can't imagine them keeping that technolgy to themselves for all these years because it was definitely powered by something I have never seen or heard of yet. Have a nice day"],"Tags":"City","Disposition":"Insufficient Data","trends":["There has been one other sighting in Danville","There were no other sightings in Danville on or around July 15th 1965"],"Sighting Duration":"00:02:00","Country":"United States","Latitude":"40.96342","Region":"Pennsylvania","City":"Danville","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Longitude":"-76.612733","Object Shape":"Disc","Date Submitted":"07/15/1965 01:00 UTC","files":["/var/www/straped/mufon/html2text/12526.html.txt","/var/www/straped/mufon/org/12526.html"],"Date of the Event":"07/15/1965 01:00 UTC","Summary":"Seen ufo hovering in broad daylight, it seemed to fly down to look at me and my friend.","map":"<A HREF = \"http://maps.google.com/maps?q=40.96342,+-76.612733(12526)&iwloc=A&hl=en\"> mufon case (12526) map </A>","Log Number":"US-09172008-0021","Case Number":"12526","Source":"MUFON"}