{"map":"<A HREF = \"http://maps.google.com/maps?q=42.387597,+-71.099497(12527)&iwloc=A&hl=en\"> mufon case (12527) map </A>","Latitude":"42.387597","Tags":"City","files":["/var/www/straped/mufon/html2text/12527.html.txt","/var/www/straped/mufon/org/12527.html"],"Summary":"I watched a bright light in the sky looking east towards the Boston area. It hovered in the area for over 2 hours and then took off at an amazing speed.","Country":"United States","Disposition":"Unknown","Source":"MUFON","Date of the Event":"09/21/1978 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","divs":["Sighting DetailsWhile hanging around with a friend of mine we both saw this bright light in the sky and questioned each other about it. My friend was an Army Reservist at the time and I went on to be an Anti Submarine Air Controler in the Navy in 1980. We both watched the bright light hover there and wasn't sure if it was a helicopter or not.The light was like a magnesium candle and we didn't think it looked like a commercial aircraft. After watching the object for over an hour we decided that we would walk to the store and if we came back and it was gone that it had to be a helicopter hovering. We returned a half hour later and the object was still there. I thought that was funny because at some point aircraft have to refuel and can't remain on site for hours on end. As we watched the object it started to move across the sky at a great rate of speed. I can't be sure how fast but it was really flying. It then made a zig zag patern in the sky and as it did it was moving so fast that it left streaks of light behind it as it moved. The radical turns would have had such G forces that any human inside the craft in my estimation would have been crushed. It then made a final zig and them took off up straight into the ski and disappeared. I have seen many aircraft during my time spent in the US military and I have seen jets break the speed of sound as I watched them. As impressive as that is to witness I have never seen an aircraft that could zig and zag at such sharp angles like that. I can only assume that this was a UFO sighting and I can not account for the rapid motion or abrupt turns."],"Case Number":"12527","Object Flight Path":"Path with directional change","Object Features":"Unknown","Log Number":"US-09172008-0022","City":"Somerville","Date Submitted":"09/21/1978 12:00 UTC","Longitude":"-71.099497","Region":"Massachusetts","trends":["There has been one other sighting in Somerville","There were no other sightings in Somerville on or around September 21st 1978"],"Weather Factors":"Unknown","Object Shape":"Unknown"}