{"Longitude":"-83.036384","Log Number":"US-09172008-0031","Source":"MUFON","Date Submitted":"02/28/2007 12:00 UTC","Region":"Michigan","Date of the Event":"02/28/2007 12:00 UTC","Summary":"Reddish-orange lights, each end, separated by oject that could not be seen in dark.","Country":"United States","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/12536.html.txt","/var/www/straped/mufon/org/12536.html"],"Sighting Duration":"Undisclosed","City":"Detroit","Case Number":"12536","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Object Features":"Unknown","Tags":"City","Latitude":"42.336557","map":"<A HREF = \"http://maps.google.com/maps?q=42.336557,+-83.036384(12536)&iwloc=A&hl=en\"> mufon case (12536) map </A>","divs":["Sighting DetailsFirst some background: I am a pilot (instrument flight instructor) and understand the relative speed of aircraft at various distances and what sound to expect. I was accompanied by someone who described exactly what we saw - immediately when we saw it. I am a serious amateur astronomer who understands oddities other than UFOs. My mental state has never been questioned by myself or anyone. My occupation is a high level executive with success throughout a 35 year career. My friend and I were identifying constellations when the sighting occurred. We were within the city lights of a small community. While facing north, staring at the sky near the zenith, we both noticed an object coming from the north, passing directly overhead, and disappearing to the south in less than 1-3 seconds. There was no sound. Understanding relative speeds at various distances, I know that if the object was to high to produce a sound, it could not pass overhead from one horizon to the other in 1-3 seconds. If it were - let's say - 100 feet overhead, I would expect a sound. But even at 100 feet, it could not pass from one horizon to the other in the time witnessed. The reddish-orange lights were clearly separated by something that could not be discerned in the dark. I am also a professional artist, who understands perspective. The two-light separation appeared as one as it approached from the north horizon; separated as it neared overhead passing; and appeared as one as it disappeared at the southern horizon. The apparent path was straight, from due north to south. Simultaneously, my friend and I looked at each other in disbelief and wondered if the other actually saw the same thing. We both described - identically - what we had witnessed. There is absolutely no question in mind mind - or my friends - that we saw what I have described. I was more excited than fearful of the event."],"trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around February 28th 2007"]}