{"Weather Factors":"Windy","Country":"United States","Source":"MUFON","Tags":"City","Longitude":"-96.883274","files":["/var/www/straped/mufon/html2text/12539.html.txt","/var/www/straped/mufon/org/12539.html"],"Date Submitted":"02/10/1991 01:30 UTC","Summary":"Hovering over Carrollton Airport silently, zooms off exponentially, reported in paper next day.","Object Features":"None","Disposition":"Unknown","Object Shape":"Oval","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"02/10/1991 01:30 UTC","Sighting Duration":"00:01:10","map":"<A HREF = \"http://maps.google.com/maps?q=32.979642,+-96.883274(12539)&iwloc=A&hl=en\"> mufon case (12539) map </A>","City":"Carrollton","Latitude":"32.979642","Object Flight Path":"Hovering then path,Straight-line path","Case Number":"12539","Region":"Texas","trends":["There have been 15 other sightings in Carrollton","There were no other sightings in Carrollton on or around February 10th 1991"],"Log Number":"US-09172008-0034","divs":["sighting detailsi was on a break from work at budget rent-a-car in carrollton, texas, standing outside the facility. the clouds were moving quickly, but there was no precipitation, and they were underlit by the lights from the airport runway which could be seen across the hiway from my work. after a slight distraction, i looked back at them, since they were the only moving things at night which could be seen. under them i noticed, hovering silently, a grey\\metallic oval, also illuminated by runway lights. it was perfectly silent. my first thought was, \"that is a ufo, it must be.\" it was an easy object to notice, since the clouds were moving and it plainly was not. there was no exhaust, no sign of movement at all, as if it had been let down from the clouds on a string. then, as i watched, it began to move, just as silently. it was as if you could sense a power surge, although silent. in front of it was created some sort of light vortex which was colorful and as it moved, the color built up momentarily, then seemed to \"peel off\" around the streamlined shape of the object. the object moved exponentially southward in a line of flight that was seemingly straight. [the farther it went, the faster it went.] it was soon gone away. i went back off my break and told a co-worker about it. there was no to-do about it. next day i told another co-worker about it, and he reported to me that the dallas morning paper had reported 300 phone calls about an object over dallas that night. therefore, you see, i came to believe what my eyes had shown me. in fact, i reported this fact to another researcher on ufos in gulf breeze, florida while i was living in carrollton."]}