{"Object Shape":"Other","Date of the Event":"06/07/2008 07:11 UTC","trends":["There have been no other sightings in Kentland","This sighting has never been favorited."],"Latitude":"40.770315","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.770315,+-87.445303(12545)&iwloc=A&hl=en\"> mufon case (12545) map </A>","Date Submitted":"06/07/2008 07:11 UTC","Case Number":"12545","files":["/var/www/straped/mufon/html2text/12545.html.txt","/var/www/straped/mufon/org/12545.html"],"Source":"MUFON","Region":"Indiana","Longitude":"-87.445303","Sighting Duration":"00:00:22","Disposition":"Insufficient Data","Country":"United States","divs":["Sighting DetailsI was heading into kentland one night to go and watch a TV show with my girlfriend. I left the house around 7:08pm est and began to drive east twords state highway 41 which is only about .8 miles down the road. Usually I take a country road to town about .5 miles down the road in the same direction but I decided to take 41 just because. After I passed the country road that heads to kentland a plane and its lights caught my attention in the SE sky or outside my passanger side of the windshield. As I turned my head around to look back at the road thats when I sall it. 6 evenly spaced out white lights lined across the Eastern sky that appeared to have the same circumfrance as the next. I Definiatly did a double take thinking what I was seeing was just a few aircraft flying in the sky since I knew that there are a few air bases south of home. But as I kept looking I notice they were not moving at all. They lights were hovering in unisin in the sky. Then they faded out becoming dimmer then like a knob on a latern they became very bright again not moving at all.They stay lit for about 7 more seconds and that was it they faded away not to be seen again that night.By that time I had stopped in the middle of the road to see if I could get another glimps but there was nothing. I had called my sister during the experiance to see if she could see it from the house but it was already gone by that time. I think I have ever been so exsided,scared and in aww at the same time ever like that. I finished the drive to my girlfriends and told her what happened she really didnt believe me but she said to me that she has not ever seen me that frantic before. So whatever it was it was definatly a U.F.O . Wheather it was of this earth or not.. I Don't know. If it is then someone is keeping a good secret."],"Summary":"6 Identicle lights appear in the eastern sky appeared to all be part of one major U.F.O.?","Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Kentland","Log Number":"US-09172008-0040","Object Flight Path":"Undisclosed"}