{"Case Number":"12547","Summary":"Quiet Slow Moving UFO About 250-300ft. overhead","Object Features":"None, Dome, Other","Date Submitted":"01/31/2005 01:02 UTC","City":"San Clemente","files":["/var/www/straped/mufon/html2text/12547.html.txt","/var/www/straped/mufon/org/12547.html"],"Log Number":"US-09172008-0042","Disposition":"IFO","Tags":"City","Longitude":"-117.607482","Weather Factors":"None","Source":"MUFON","Region":"California","Date of the Event":"01/31/2005 01:02 UTC","Sighting Duration":"00:03:30","divs":["Sighting DetailsMy friend Dave and I were playing cards in my garage in San Clemente (Off camino de estrella). We walked out to the street to grab something out of the car and were standing by the car smoking when I noticed some lights off in the distance. This was not unusual as Camp Pendleton is only 15mi from the house and the San Diego Naval base is about 60mi south as well so aircraft were not uncommon. We just sat smoking for about five minutes and were slowly walking and talking towards the garage to play some more cards. He asked me if I heard something and I did. It was kinda like a very loud phane with a slight metallic whine (almost like a tuned down jet engine of sorts). We both watched this \"thing\" get closer from the north heading south almost directly over pch (about .5 miles to the west of us, PCH runs along the shore all the way to Oceanside). It was circular in shape and was moving very slowly. We thought it was just another military test run (these were not uncommon) but when this thing got closer, it was about the size of a very small helicopter and made virtually no noise. I ran and grabbed my neighbor mark who was still awake watching tv and he came out and was amazed as well. This thing was only about 300ft overhead, was moving very very slowly (my guess is about 25-30mph? We watched it get larger and larger and could not believe how close it was and how little noise it made for being such a large object. Not large by airplane or helicopter means, but about the size of a large SUV or a Very Small helicopter. We watched it pass over head for about 3 minutes until it was out of sight. We all kinda stood for a minute and blamed it on the military base testings that go on quite often. We did however, assume it was a military spy drone being tested or some kinda freak new stealth helicopter type craft being tested. We kept discussing how quiet it was and how the lights on the bottom were in circular formation and not blinking, yet the underbelly of the craft was not able to be seen. Mark is a hobbyist in flying remote airplanes so he was especially tweaked about this. His little b52 made more noise than thia thing. It was kind of like a blanketed howl of a jet enjine. The only way we could see the shape of this thing was when it passed overhead. We then were only able to see the outline of a circular shaped object with lights in one circle around the base of it. Non-flahing lights at that! They were yellow and soft white only as well. It could have been a military test thing......but I figure if it was a ufo you guys would want to know. Either way it was a neat thing to see. There were three of us (including me) who witnessed this. It happened quite a while ago but i just stumbled across your site and figured you might want to know."],"Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Object Shape":"Circle, Disc","Latitude":"33.430923","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.430923,+-117.607482(12547)&iwloc=A&hl=en\"> mufon case (12547) map </A>","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around January 31st 2005"]}