{"Weather Factors":"Unknown","Object Shape":"Star-like","Object Flight Path":"Hovering then path,Straight-line path,Other","Summary":"Object was sited among a group of three other stars. Was noted for not being a part of them. To our surprise, it moved one inch in sky and vanished. Color, VERY bright, deep blue-white.","Viewing Distance":"Unknown","Date of the Event":"09/01/2008 08:47 UTC","files":["/var/www/straped/mufon/html2text/12544.html.txt","/var/www/straped/mufon/org/12544.html"],"Source":"MUFON","Date Submitted":"09/01/2008 08:47 UTC","Disposition":"Unknown","Tags":"City","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around September 1st 2008","This sighting has never been favorited.",""],"Case Number":"12544","City":"Scranton","divs":["Sighting DetailsMy friend and I were surveying some of the property at a friend's farm here in PA. It was already passed nightfall. We were making our way back out to the hayfield from the woods when my friend spotted a light in the sky but I didn't see it right away. I am not a very firm believer to UFOs, though I kept an open mind to remain optimistic. So when she said this I wasn't really listening to her that well. Especially after she said the light moved. I still couldn't find it. Where we were is directly below where alot of planes fly, both military and civilian, so there are alot of odd lights at night that turn out to be planes. As we hadn't planned to be out past dark, we didn't have a flashlight with us, so the stars were very visible from time to time. As we reached the edge of the woods I spotted a moving light as well, almost over us but north a little. I can't say how far, as judging distance of things in the sky is difficult. Still, I was surprised enough at seeing it that I actually fell right off a cliff spraining my ankle. That held us up for a while till I felt able to walk again. We completely forgot about the light after that. However, I only managed to make it to the field again before I had to sit down. Actually, I rather laid down as I realized I was bleeding. Unable to do anything about it I decided to lay back and wait a bit for the pain to pass. Where again I noticed the same light as we saw before in the woods. This time it was definitely almost overhead, though still a little north. The only reason I picked it up was because it was sitting in a cluster of stars that formed a triangle with the point south. This particular light I hadn't seen among them before to my recollection, though I remember that group of stars enough times from summers past. I was just beginning to say, \"hey, take a look at that star\", grabbing her shoulder to pull her around so she could see it too when it moved about an inch in the sky. Then it was like this halo wrapped around it from west to east, taking up, I'd say three inches of my total field of vision, and it was gone. It didn't go up or down move anywhere else. It was simply there, then not. I've never seen anything like this before, but I'm willing to say that wasn't normal, nor some comet or confusion from pain. I was on the fence about this kind of stuff before this but well, you have my confidence and support. If you are looking for this location on a map, Email me, it is easy to reach, but I wish to remain anonymous at this time. Thank you and good luck!"],"Log Number":"US-09172008-0039","Country":"United States","Region":"Pennsylvania","Object Features":"None","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.415629,+-75.654042(12544)&iwloc=A&hl=en\"> mufon case (12544) map </A>","Longitude":"-75.654042","Latitude":"41.415629"}