{"Object Flight Path":"Undisclosed","Date Submitted":"08/31/1970 04:45 UTC","Country":"United States","Object Features":"Undisclosed","Latitude":"39.955335","Object Shape":"Disc","divs":["Sighting DetailsI was 16 years old. I was walking to my after school job around 4:45pm. I stopped for a red light on Garrett Road, I forgot the name of the side road, but on my left was a Catholic Church called St. Alice. I don't know why I looked up but I did and in the middle of the intersection about 10 feet or so above the street lights was this disc shaped object that was just there. I would say it was about a 30 foot round object. It was silent and all I did was look at it for about, I think, 30 seconds. It had huge windows with I remember different colored lights blinking. It wasn't moving at all or making any noise. I wasn't scared or excited or anything else. I remember there were some people walking behind me, but I didn't even turn around to ask them if they saw anything and I didn't hear anyone say anything about it. There were cars in the street but I don't think anyone else saw anything because it was so eerily quiet. All I did was look straight ahead and went to work. I felt like I was numb in a strange way. I didn't even look back to see if it was still there. I didn't talk about it until maybe a week later, but no one would believe me so I just kept quiet all these years. Even today when I tell anyone, even my family, they just shake their heads."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.955335,+-75.161499(12546)&iwloc=A&hl=en\"> mufon case (12546) map </A>","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/12546.html.txt","/var/www/straped/mufon/org/12546.html"],"Date of the Event":"08/31/1970 04:45 UTC","Viewing Distance":"Unknown","Case Number":"12546","Disposition":"Insufficient Data","Summary":"I looked up and it was there silent and 10 feet above the street lights","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around August 31st 1970"],"City":"Philadelphia","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Log Number":"US-09172008-0041","Longitude":"-75.161499"}