{"Object Features":"Undisclosed","Summary":"Lights observed in sky, stopped car and observed","Case Number":"1254","Country":"United States","Log Number":"","divs":["Sighting DetailsINTERVIEW AND INTERROGATION:From the initial telephone contact with the witness, it was clear that he had noreluctance to openly discuss his sighting. Equally important, as a DeputySheriff, Mike realized that I would rely on his professional training to helpcontribute to an accurate account of his sighting. Mike also volunteered ToInquire at the Sheriff Department for possible additional information or witness(action pending) to better evaluate this activity.Upon my arrival at Mikes home for the interview, it was immediately obviousthat his enthusiasm to discuss his sighting and not diminish. He also showedand expressed no concern for any possible recrimination from the SheriffsDepartment for his linkage to UFO reporting. From this atmosphere, theparaphrasing of his account that follows is presented as accurately as possibleand with his review and concurrence:\"I was driving north on Highway 75 and turned westward onto M. L. K. Avenue. Ithen turned right (south) on Falkenburg. It was then that I immediately saw anarray of very bright lights to the Southwest and about 35 degrees elevation inthe sky. Since I am also a private pilot, my first thought was that it may be anairplane in trouble. I, pulled over and stopped to get a better look, I alsoinitiated a call to the airport that confirmed they had no aircraft in that areaand I concluded that the object was not any conventional airplane. I was now nolonger driving; just sitting and looking and more accurately observing.I continue to watch and was fascinated with the lights. They were reddish bluein color with an overall orange glow emitting. Wherever it was continued tomove from right to left (Southwest towards the south) on an apparent constanttrack anarchy. I also heard no sound from it. I estimated it to have been atabout 35 degrees of elevation and maybe oblong or oval shaped. I could not seeits shape that clearly. I can estimate its size either because I was primarilywatching the lights, although it seemed to be about 25 to 30 miles away. Fromthe time I stopped, I believe its lights were in view for about 20 to 25seconds until they disappeared. It also must have been moving reasonably fastto get out of sight that quickly. The unfortunate part is that I had a set ofbinoculars right beside me, I was so fascinated with what I was seeing that Iforgot to use them for a closer look. It was all very unusual and I aminterested to know what it was that I saw\"."],"Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Longitude":"-82.448098","City":"Tampa","Sighting Duration":"00:00:59","Date of the Event":"09/07/1999 05:02 UTC","Object Flight Path":"Straight-line path","Date Submitted":"09/07/1999 05:02 UTC","files":["/var/www/straped/mufon/html2text/1254.html.txt","/var/www/straped/mufon/org/1254.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.956075,+-82.448098(1254)&iwloc=A&hl=en\"> mufon case (1254) map </A>","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around September 7th 1999"],"Object Shape":"Oval","Weather Factors":"Unknown","Disposition":"Unresolved","Latitude":"27.956075","Region":"Florida"}