{"divs":["Sighting DetailsA friend who lives a few blocks away called and said she saw strange objects in the sky. I went outside and saw the same strange objects in the sky. We learned the next day that I was actually looking in the opposite direction so we think this was happening in two places. To me, they appeared to be several miles away, somewhat near LAX airport, actually, but there was nothing about them that was anything like the activity of a plane or planes. They were like small bouncing balls of light. Maybe three to five going at one time. They bounced in circular patterns but not like making one circle, they were all doing their own bouncing. I can think of an analogy to maybe juggling balls. I seem to think they were changing color but I can't really recall. There were three of us who saw them and then my friend and her roommate saw them too. We watched for about ten minutes. They were still there when we went inside but were gone by about 12:15 (I have a text from the friend around that time that says they disappeared). Does this sound like something that is actually identifiable? The weird part to me is that I saw them in a different area than my friend. She thought they were very close to my house. I thought they were very close to her house."],"Case Number":"12549","Object Flight Path":"Other","Longitude":"-119.410722","Tags":"City","Date Submitted":"09/13/2008 11:50 UTC","Region":"California","Country":"United States","Date of the Event":"09/13/2008 11:50 UTC","Weather Factors":"Unknown","Latitude":"36.786261","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":[],"Summary":"bouncing balls of light","files":["/var/www/straped/mufon/html2text/12549.html.txt","/var/www/straped/mufon/org/12549.html"],"Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=36.786261,+-119.410722(12549)&iwloc=A&hl=en\"> mufon case (12549) map </A>","Log Number":"US-09172008-0044","Object Features":"Undisclosed","Disposition":"IFO","City":"Undisclosed"}