{"Date of the Event":"01/03/2006 12:00 UTC","Tags":"City","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=31.71674,+-98.987201(12542)&iwloc=A&hl=en\"> mufon case (12542) map </A>","Latitude":"31.71674","Object Features":"Unknown","Object Flight Path":"Stationary","trends":["There have been 21 other sightings in Brownwood","There were no other sightings in Brownwood on or around January 3rd 2006"],"Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-09172008-0037","Disposition":"Unknown","Longitude":"-98.987201","Case Number":"12542","Source":"MUFON","City":"Brownwood","files":["/var/www/straped/mufon/html2text/12542.html.txt","/var/www/straped/mufon/org/12542.html"],"Date Submitted":"01/03/2006 12:00 UTC","Object Shape":"Boomerang","Summary":"seven lights in the night sky close to the ground, lasted about a minute to minute and a half","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI had walked out to my brothers driveway and was looking up at the clear night sky when all a sudden 7 lights, very distinct lights appeared in a semi circle or arch accross the sky. the entire group covered probably close to a football field or more. Stunned I watched them for a minute thinking they might be helicopter, there is a national guard base nearby. But there was absolutely no sound. Then I figured they were flairs from artillary, but I was in artillary in the military and flairs always leave a smoke trail. there was no smoke trail. I realized that could no longer see the stars behind the lights and new it was something out of the ordinary. I ran back into to house shouting for my brother and wife to come out and see the thing. I just opened the door and then came back outside. When I got back outside the lights dissapeared as quickly as they had appeared. No smoke trail, no sound, and now the bright stars were visible again. My brother and wife missed the lights and didn't really believe me so I just blew it off."]}