{"Case Number":"12541","divs":["Sighting DetailsSAT NIGHT AUG 1969 (COULD HAVE BEEN 1968) APPROX 10 PM. WALKING DOG ON STATEN ISLAND. NOTICED WHAT I THOUGHT MIGHT BE SILVER BLIMP HEAD-ON GIVING SPHERE-LIKE APPEARANCE. AS IT GOT CLOSER I SAW IT ACTUALLY WAS SPHERICAL WITH A BAND OF ROTATING LIGHTS AROUND MIDDLE. LIGHTS WERE GREEN, YELLOW AND RED. NO SOUND ISSUED FROM OBJECT WHICH APPEARED APPROX 500 FT IN SKY DESCENDING WESTWARD (FROM NORTHEAST). I FELT EXHILARATION AND A SENSE OF SHOCK. I TRIED FLAGGING DOWN SOME CARS TO VERIFY SIGHTING BUT NO ONE STOPPED. OBJECT CONTINUED MOVING WESTWARD DESCENDING SLOWLY, MOVING IN COUNTER CLOCKWISE MOTION,FROM MY VANTAGE POINT. SKY WAS CLEAR. OBJECT LOOKED METALLIC. I COULD SEE WHAT LOOKED LIKE METAL OR ALUMINUM PANELS ON THE OBJECT. IT CONTINUED WESTWARD AND DISAPPEARED BEHIND WOODED AREA NEAR A GOLFCOURSE. ALL MY FRIENDS LAUGHED WHEN I ANNOUNCED THAT I HAD SEEN A UFO..SO MOSTLY I HARDLY EVER MENTIONED IT AGAIN! RECENTLY, (IN 1999) I WORKED WITH A WAITRESS WHO SAID TWO OF HER GIRLFRIENDS WERE IN A GOLF COURSE ON STATEN ISLAND AROUND SAME TIME (68-69) ON A SAT NIGHT AND SAW SIMILAR OBJECT HOVERING ABOUT 10 FEET OFF THE GROUND. THEN IT ASCENDED AND SPED OUT OF SIGHT. APPARENTLY ARTICLE IN SUN STATEN ISLAND ADVANCE RECOUNTED THEIR EXPERIENCE, WHICH I NEVER SAW. ALSO IN 1953 OR 54 @ DUBLIN AIRPORT I WITNESSED (ALONG WITH SEVERAL OTHERS) A LIGHT 'DANCING' RANDOMLY IN NIGHT SKY AS THOUGH A LIGHT ON A STRING. MY FIRST SIGHTING IN LATE '40S (ALSO WITNESSED BY HUNDREDS OF PEOPLE..MANY KNELT AND PRAYED AS THOUGH IT WAS SOME SIGN FROM 'GOD') IT WAS INCREDIBLY HIGH IN SKY OVER DUBLIN IRELAND. WAS CROSS-SHAPED AND SLOWLY ROTATED COUNTER-CLOCKWISE. IT STAYED SATIONARY ROTATING FOR ABOUT HALF HOUR CAUSING MUCH EXCITEMENT IN THE STREETS. I ASSUMED IT WAS A SECRET BRITISH AIRFORCE EXPERIMENTAL AIRPLANE."],"Latitude":"40.718153","Longitude":"-74.001913","map":"<A HREF = \"http://maps.google.com/maps?q=40.718153,+-74.001913(12541)&iwloc=A&hl=en\"> mufon case (12541) map </A>","Log Number":"US-09172008-0036","Region":"New York","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"07/31/1969 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12541.html.txt","/var/www/straped/mufon/org/12541.html"],"Object Features":"Patterned Surface, Other","Viewing Distance":"101-500 Feet","Object Shape":"Sphere","City":"New York","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 31st 1969"],"Date Submitted":"07/31/1969 12:00 UTC","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Summary":"SAW SOUNDLESS SPHERE IN SKY OVER STATEN ISLAND NY IN 1969 (APPROX)","Disposition":"Unresolved"}