{"City":"Lutz","Longitude":"-82.461483","Object Flight Path":"Straight-line path","Summary":"He saw the object as he drove to work.","Tags":"City","Case Number":"1255","Log Number":"","Date Submitted":"09/07/1999 05:30 UTC","Disposition":"Unresolved","Object Shape":"Disc","Viewing Distance":"Unknown","divs":["Sighting DetailsSIGHTING ACCOUNT:The witness was going to work that morning, leaving his house going south onHighway 41 towards Tampa. He observed an object and thought it to be a planecoming in, but he did not see a beam of light coming from it. It had a glow,yellowish tent coming from the outside of it. It did not have the aircraftwarning or identification lights on it. It was coming in from the Southeastheading in a westerly but southern path. It was about 18 degrees above thetrees. The climbs were not up yet, there were none in the sky. He thoughtmaybe it was something in danger. And he proceeded south on Highway, he couldsee it was moving very slow. Slightly above it at the 11:00 oclock position,there were jets flying close to it. The first one or two jets strayed close toit. As he went down the road a little bit, the object grew smaller and thenchanged brighter. It lost its Corona around it and became a light blue and itconcentrated to a smaller even whiter light with the dark as the steel blueedge. Then it became a much smaller light and it shot out little BB likeobjects, like oil on a hot surface, and then it came back into itself and it wasgone. When it was yellow, it was more nebulous but when it turned to the bluecolor it became sharper. (See appendix \"\"1 and 2\"\" )I stopped at Sunset road for a light, proceeding south another mile among themand there were a bunch of planes coming in from south. They were coming in fromthe East and West, like a bunch of fingers. I thought there were between 9 or15, I couldnt tell. I could see as far as Riverview, coming in from Baerss inthat direction. He was coming from south, Southeast and Southwest. The firstobject traveled, at arms lenth during a total of three feet in the course ofabout 15 minutes. It takes about 15 minutes to travels this distance at thistime of the morning. It was about the size of quarter. My windows were downand when I stopped for the lights, I did not hear any sound at all.The first light was in sight for approximate 3-4 minutes. It moved real slow atfirst and then it moved quickly at the end.At first one or two planes were coming at it and then they were more coming inand then one I stopped at the like they were more. They were going faster thanwhat you expect a jet to fly at that altitude, but not really fast. I I thoughtthey must be rendering assistants, there must be plane in trouble.I took it as a matter of fact until I read in the papers that other people sawsomething that morning. I need not flank it was a space debris, now or I sell. There was nothing there that was traveling at 17,000 mph. This was aone-of-a-kind event, it looked like it was coming from Homassassa, going tomaybe Hillsbouro Avenue in Tampa. I cant say what it was, but I know therewere plane coming in to it.Pasco Airport nearby and another at Zephrhills. I know all of the flightpatterns that airplanes take in this area."],"Sighting Duration":"00:00:59","Latitude":"28.151124","files":["/var/www/straped/mufon/html2text/1255.html.txt","/var/www/straped/mufon/org/1255.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.151124,+-82.461483(1255)&iwloc=A&hl=en\"> mufon case (1255) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Lutz","There were no other sightings in Lutz on or around September 7th 1999"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Region":"Florida","Country":"United States","Date of the Event":"09/07/1999 05:30 UTC"}