{"Log Number":"US-09172008-0045","Summary":"After photographing the Blue Angels flying show I uploaded digital photos I took and saw a speck near a cloud I photographed. When enlarged you can see the oval shaped object.","trends":["There have been 2 other sightings in Mercer Island","There were no other sightings in Mercer Island on or around August 3rd 2008","This sighting has never been favorited.",""],"Latitude":"47.576855","Case Number":"12550","Weather Factors":"None","Longitude":"-122.220047","Country":"United States","files":["/var/www/straped/mufon/html2text/12550.html.txt","/var/www/straped/mufon/more/12550_submitter_file1__BlueAngelandUFO2up8x10photocopy3.jpg","/var/www/straped/mufon/org/12550.html"],"Object Flight Path":"Unknown","divs":["sighting detailsevery year the blue angels do an air show over lake washington when they are having the hydroplane races on the lake. i live about a 1\\2 mile from the lake and was at home. i heard a loud low flying jet pass over my house and i knew the show was on. i quickly grabbed my camera and ran outside to get some photos of the jets as they did the show. when i got outside you could not see or hear the jets at all. i took the time to set all the functions on my camera which were manual settings, asa or iso 400 ( film speed ) and shutter speed at 1\\250th of a second so the planes would be sharp ( stop action ) and the 300mm lens set to infinity as i did not expect the planes to be any closer focus than this. while i waited i did a few test photos of clouds that would be in the direction of the jets as they did the show over the lake and island. within five minutes of me setting the camera up the show began and i took some great photos of the blue angels in formation etc. when i uploaded the images after the show had ended i noticed a speck near one of the clouds i had photographed during my first few test shots. i blew the image up in photoshop and saw it was a disk or oval shaped object quite a ways out near the bottom right corner of a large puffy cloud. i don't know what the object is as the camera resolution is only 8 megapixels and when enlarged the image falls apart pretty badly. it is oval shaped though, has a highlight on it making it look reflective metallic silver colored, and can be seen in a different area on one other photograph but only very faintly. i did not see the craft or object when i took the photographs at all. too far away to see with the naked eye at that distance i suspect, as i did not notice it when looking through the 300mm lens. one other note is they restrict the air space near the fly zone when they do the air show for safety purposes. i will attach the photos that are relevant to this incident. i have a photo of the cloud and circled the spot where the speck (oval object)is. i did nothing to this image from photoshop at all. then i blew the image of the disk up as large as i could and still hold detail. then i blew the oval shaped object up a second time, using unsharp mask, contrast and hues to try and define it a bit clearer. the photograph of the blue angel plane is to show the distance proportionally and in the same direction as the cloud was when i photographed the speck earlier in the show with the same camera settings. maybe you have seen this object somewhere else in your files? hope it helps!"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.576855,+-122.220047(12550)&iwloc=A&hl=en\"> mufon case (12550) map </A>","Viewing Distance":"Over One Mile","City":"Mercer Island","Object Features":"Unknown","Source":"MUFON","Tags":"City","Object Shape":"Oval","Date Submitted":"08/03/2008 01:05 UTC","Date of the Event":"08/03/2008 01:05 UTC","Disposition":"Unknown","Region":"Washington","Sighting Duration":"01:00:00"}