{"Source":"MUFON","Summary":"Saw a light dancing in the sky","Object Features":"Unknown","Latitude":"40.445435","Longitude":"-79.991576","Log Number":"US-09172008-0049","Tags":"City","Object Flight Path":"Stationary","City":"Pittsburgh","Date Submitted":"01/15/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/12554.html.txt","/var/www/straped/mufon/more/12554_submitter_file1__Picture050.jpg","/var/www/straped/mufon/more/12554_submitter_file2__Picture049.jpg","/var/www/straped/mufon/more/12554_submitter_file3__Picture053.jpg","/var/www/straped/mufon/org/12554.html"],"Object Shape":"Star-like, Unknown","Date of the Event":"01/15/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.445435,+-79.991576(12554)&iwloc=A&hl=en\"> mufon case (12554) map </A>","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"None","Case Number":"12554","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around January 15th 2008","This sighting has never been favorited.",""],"Sighting Duration":"02:00:00","divs":["Sighting DetailsComing home from a run to walmart. i noticed a light in the sky, it was dancing and was various colors. i thought it was wierd that it wasn't moving, it was just changing colors. like a blinking christmas light i saw red, blue, green, yellow. i found it wierd that it was sitting there so i went to get my digital camera and took a picture of it. well in the digital camera the lights where all blue and it looked like it was dancing. i went back in, an dcame back out an hour later, and saw it was still there. so i took another picture. and did it again a half hour later, finally at 11:00 pm i went out to see if it was still there, and it wasn't. there is an airport near here, its a private airport, only small planes and helocopters take off from there. on occasion a blimp lands there, but there was no event going on that would have a need for a blimp. helecoptesr are only seen there during the day, at the airport they give tours in them. so what this was that i saw.. i have no idea."],"Region":"Pennsylvania","Disposition":"Unknown"}