{"City":"El Monte","Case Number":"12556","Weather Factors":"Unknown","Summary":"I Saw A Triangle UFO Fly Over, Then 2 Minutes Later A Bright UFO Light","Region":"California","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Log Number":"US-09172008-0051","Viewing Distance":"Over One Mile","trends":["There have been 7 other sightings in El Monte","There were no other sightings in El Monte on or around September 1st 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=34.074191,+-118.019287(12556)&iwloc=A&hl=en\"> mufon case (12556) map </A>","divs":["Sighting DetailsAt 7:30pm Me And Friend (Micheal) Are Smoking At A School Called Baker School. We Were Standing In The School's North Field, When All Of Sudden I Heard At Noise (It Sound Like When Jets Make Noise) But Only This Noise Wasnt That Loud. But You Can Clearly Hear It. The Noise Was Coming From Mountains North Of Us. So I Said What The Heck Is That Noise, Then I Turned To My Right An I Was Lookin West, When All Of Sudden I Saw A \"Triangle Shape\" UFO It Had 4 Lights 2 White, Green, And Red,..... So I Said WTF Is That!!!!! I New Immediatley It Was No Ordinary Plane Becuase The UFO Made A VERY Soft Turn, It Then Turned Goin North To The Mountains. I couldnt See It After.......... Then 2 Minutes Later Another UFO Flys Over Us This One Looked Like A Bright Star or A Bright Pearl Flying, and The Light Was In A Triangle.. You Could Bearly See The Triangle Around It... It Was A Redish Color..... It Flew Over Us Coming From The West Then Flying Over Us Then Goin East... It Then Started Dissapearing When It Just Left The Earth Goin Into Space!.............. I AM NOT FAKNG THIS STORY!!!! I WONT WAIST MY TIME WRITING THIS STORY!!............ I WONT FORGET THAT MOMENT!!!!!!! (An My Reaction To The UFO) I Said WTF Im I Looking At... I Said Damm I Cant Believe It.... I've Always Wanted To See UFO I Finaly Saw ONe I Aint No Artist But I Drawed Some Pics On How The UFO Looked.... 1st Picture Is The First UFO"],"files":["/var/www/straped/mufon/html2text/12556.html.txt","/var/www/straped/mufon/org/12556.html"],"Object Shape":"Star-like, Triangle","Country":"United States","Date Submitted":"09/01/2008 07:46 UTC","Date of the Event":"09/01/2008 07:46 UTC","Longitude":"-118.019287","Source":"MUFON","Latitude":"34.074191","Object Features":"Other, Unknown","Tags":"City","Disposition":"IFO"}