{"City":"Los Angeles","files":["/var/www/straped/mufon/html2text/12567.html.txt","/var/www/straped/mufon/org/12567.html"],"Latitude":"34.101009","Summary":"humming noise with lights,","Log Number":"US-09172008-0062","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date of the Event":"07/08/1964 12:00 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.101009,+-118.319391(12567)&iwloc=A&hl=en\"> mufon case (12567) map </A>","divs":["Sighting DetailsI was about 13 years old. I was walking home from a friends house after dark, and I noticed 3 lights way off in the sky. I didn't think to much about it and kept going. But it was getting closer and I am trying to figure out what it could be. It must have spotted me because it came to me and stopped about 20 feet away about 15 feet up so I got a pretty good look at it. I couldn't see the shape of it because there were 3 Lights on the front flashing on and off. Rectangle shape on the lower front.Red, Green,White. flashing one at a time. I was thinking what the hell is it? UFO never even crossed my mind, I haden't heard about ufo's much back then. It hovered right there for about 2 minutes. I didn't hear any engine noise just a humming sound. After about a minute the lights stopped flashing and came on solid. I was starting to wonder if I should run away. Then the 3 flashing lights turned off and a spotlight came out of the left side bottom. All right I've had enough, The spotlight pointed at me and I ran like hell. There was a trailer park about 100 yards back so I ran in there and hid In the restroom. I waited about 20 minutes then snuck out to take a peek and it was gone. I ran and didn't stop until I was home. Thinking back now I still have not a clue what it was, Helicopter? No there was no noise. Planes don't hover. as far as I know it didn't chase me. I never said anything to anyone then, they would called me crazy. I told my wife and some relatives about it a couple years ago. They said belive me but I know they didn't so here I am wondering what the hell it was and did I almost get abducted?? The main reason I am writing this is because I would like to know if anyone else has seen anything like it? Thanks, David Williams"],"Object Flight Path":"Undisclosed","Case Number":"12567","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other, Unknown","Country":"United States","Viewing Distance":"Unknown","Longitude":"-118.319391","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 8th 1964"],"Date Submitted":"07/08/1964 12:00 UTC","Tags":"City","Source":"MUFON","Region":"California"}