{"Date Submitted":"08/19/1969 08:15 UTC","Region":"Missouri","Case Number":"12566","Weather Factors":"None","Sighting Duration":"00:15:00","Summary":"Classic saucer shape just yards away, disappeared and reappeared in different area many times","Tags":"City","Disposition":"Insufficient Data","Date of the Event":"08/19/1969 08:15 UTC","divs":["Sighting DetailsI was 14 years old and was staking out the foundation of a new home on some property my parents owned. It was my parents, my brother, and I. It was late in the day and although there was still sunlight in the western sky, my parents decided to call it a day. We loaded in our pickup truck to head back to our house. My parents were in the cab of the pickup and my brother and I were sitting on the tailgate which had been lowered for us to ride on. Before my father started the pickup, I noticed first that there was a saucer across the road from us above the Cave Springs cemetery. This was only about 100 yards away. There was no sound whatsoever. It was the classic saucer. Round with a dome on top and a row of lights and maybe windows around the rim. I shouted and pointed and we all sat and watched the saucer. It disappeared suddenly without a sound and reappeared much higher above the horizon in the north western sky. It remained there a couple of minutes, the disappeared again and reappeared in another part of the sky. We continued to watch this for about 15 minutes. Then, the saucer disappeared never to be seen again. We are a very religious family, coming from a Pentecostal background. This was quite a shock to us. I don't know if it was extraterrestrial or perhaps even demonic, but I do know there was something there. I saw it in daily light and close up."],"Viewing Distance":"Unknown","City":"Neosho","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12566.html.txt","/var/www/straped/mufon/org/12566.html"],"Latitude":"36.868955","Log Number":"US-09172008-0061","map":"<A HREF = \"http://maps.google.com/maps?q=36.868955,+-94.367996(12566)&iwloc=A&hl=en\"> mufon case (12566) map </A>","Object Shape":"Disc","Object Flight Path":"Hovering then path","Longitude":"-94.367996","trends":["There has been one other sighting in Neosho","There were no other sightings in Neosho on or around August 19th 1969"]}