{"Viewing Distance":"Over One Mile","Weather Factors":"Does Not Apply","Latitude":"28.541906","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around September 15th 2008"],"City":"Orlando","Tags":"City","Region":"Florida","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Oval","Summary":"Jumbo-jet size silvery object with no wings which dissapeared straight upwards","Disposition":"Insufficient Data","Date of the Event":"09/15/2008 04:30 UTC","Object Features":"None","divs":["Sighting DetailsAs I was walking home from the store, I noticed a very large object above cloud level towards the East, against the clear blue sky. It may have been just above the altitude I usually see planes at when they start descending into the Orlando airport. I see dozens of these planes go by every single day. This particular object seemed to be of either oval or cigar shape: it was too shinny or too far to tell. It looked like twice the size of a 747, but without wings. At fist I thought it was an airplane, becuase its underbelly was silvery and reflective, but it was not moving at all! I could actually see one plane east of it at very high altitude above it headed North, and a another plane coming from the West amd apparently going to the Orlando airport. The plane at higher altitude was sereral miles away and left the regular streaks of water vapor that planes usually leave as they move across the sky. My mind wondered what this could be, since it was obviously not a plane, and thought that it might be a meteor or a satelite, but it was not moving at all. Then I thought it could be a star, but how could it be if this was in broad daylight? As I neared my home, I could still see it from the sidewalk. I kept looking up, and it very, very, slowly started to move straight upwards, making no sound at all, until it was too small to see anymore. From the moment I noticed it until it was gone, it must have been 20 minutes or so. Unfortunately, I did not have a camera. I wish I did. Did anyone else notice this? What could this have been?"],"Country":"United States","files":["/var/www/straped/mufon/html2text/12568.html.txt","/var/www/straped/mufon/org/12568.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.541906,+-81.371736(12568)&iwloc=A&hl=en\"> mufon case (12568) map </A>","Case Number":"12568","Log Number":"US-09172008-0063","Object Flight Path":"Hovering then path","Longitude":"-81.371736","Date Submitted":"09/15/2008 04:30 UTC","Source":"MUFON"}