{"Disposition":"Insufficient Data","Date of the Event":"02/15/1958 05:00 UTC","Longitude":"-89.615357","trends":["There have been no other sightings in Lilbourn","This sighting has never been favorited."],"Tags":"City","Country":"United States","Summary":"Alien","Log Number":"US-09172008-0064","files":["/var/www/straped/mufon/html2text/12569.html.txt","/var/www/straped/mufon/org/12569.html"],"Region":"Missouri","City":"Lilbourn","Source":"MUFON","Latitude":"36.592282","Sighting Duration":"Undisclosed","Object Shape":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsI was about five years old. My brother and I slept in the same room and same bed. He was about four years old, now decesed. We lived in a house, located almost on the edge of a ditch-bank, near a city called \"Lilbourn.\" The house was surrounded by cotton. We were both playing in the bed. It was near \"daylight\" outside. My head started to itch in the top. I had long hair. I scratched it. Upon scratching it, I felt my braid sticking up. I reached up trying to smooth it down. It would not go down. I proceeded to move my hand up as high as I could get it. I felt a hand that felt like a human's hand. I was not afraid. I asked my brother if my braid was sticking up and he said yes. I asked him to pull it down. He tried with no success. In that moment, my mother came into the room turning on the light asking us why were we up so early. I don't know why I didn't ask my mom if my braid was sticking up. That was the end of it. I have always told this story to my family and friends about the hand I felt, but could not see, and I have never heard anyone other than my mom saying she saw a pair of hands over her in the same house. Her story was different. This isn't a ghost story either. You are not suppose to feel a ghost. I believe, in that same night, I saw the outline of a man's figure, dressed like \"Dick Tracey,\" on the outside of my window. Was that an alien or a man using technology that is being covered up by the government?"],"Weather Factors":"Unknown","Case Number":"12569","map":"<A HREF = \"http://maps.google.com/maps?q=36.592282,+-89.615357(12569)&iwloc=A&hl=en\"> mufon case (12569) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"02/15/1958 05:00 UTC"}