{"Source":"MUFON","City":"Waco","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-97.14398","Weather Factors":"None","Country":"United States","Object Shape":"Saturn-like, Star-like","Date of the Event":"09/14/2005 06:35 UTC","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around September 14th 2005"],"Summary":"Venus Traveling","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Region":"Texas","Latitude":"31.550743","Case Number":"12561","Log Number":"US-09172008-0056","divs":["Sighting DetailsSunday Morning. I always go for a pray'r walk at 6 30 a.m. I live on 356 acres of land, a tad north of a Central Texas town. In September, the eastern sky is only beginning to fade into a dark blue, over-all the sky was dark, stars easily pin-pointed. I could see Orion, the moon was setting low in the western sky. My Dog accompanies on my pray'r walk. My house sits about a half mile back on the property and there are no street lights or other houses. I walk up the tree cover'd lane. At the gate, I veer south. I have huge power-line poles crossing the front of my property. They almost serve as sentinel stands. There is a well-worn dirt road that leads into a cascade of lakes, one upper that feeds into a lower lake. As I turn'd onto the dirt road, I look'd up into the southeastern sky and a traveling object immediately caught my eye. It look'd like Venus was wandering across the sky. I immediately knew it was not a plane. It appear'd to be crescent in shape when observed closely, attempting to discern something that look'd like a plane. On Sunday morn, the world is quieter than normal. No traffic noise, just morning sounds. This morning was particularly quiet. I stopp'd and listen'd intently. I tried to hear an airplane buzz. None. The \"WANDERING STAR\" appear'd to be flying very low. I knew it was not an airplane, no noise, no blinking lights. It moved fast like the satelites my father had taught me to spot in the night sky as a child. But it was so bright and seem'd to be in such close proximity to the earth. I then just watch'd it. It appear'd to have a slight bobble to it, almost as if it were wiggling back y forth, I expected it to back up any moment, it appear'd as if it were looking for something, not like it was on a fix'd course. For some reason the object gave the impression that it could fly in any direction without having to turn in a 360 arc. It finally disappear'd into the southeastern sky. As if it were suddenly hidden by an opaque veil. I know the atmosphere can swallow up things in the sky in hazes. I did not feel like I had witness'd anything eerie but I did recognize it was an object un-explain'd. It didn't follow prescribed flying patterns."],"Date Submitted":"09/14/2005 06:35 UTC","files":["/var/www/straped/mufon/html2text/12561.html.txt","/var/www/straped/mufon/org/12561.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.550743,+-97.14398(12561)&iwloc=A&hl=en\"> mufon case (12561) map </A>"}