{"files":["/var/www/straped/mufon/html2text/12579.html.txt","/var/www/straped/mufon/org/12579.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.812796,+-77.042101(12579)&iwloc=A&hl=en\"> mufon case (12579) map </A>","Summary":"Saw two lights travel parallel then circle each other and take off at right angles at high speed.","Source":"MUFON","Date of the Event":"11/30/1956 12:00 UTC","Disposition":"Unresolved","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","trends":["There have been 10 other sightings in Alexandria","There were no other sightings in Alexandria on or around November 30th 1956"],"Longitude":"-77.042101","City":"Alexandria","Date Submitted":"11/30/1956 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"12579","Object Shape":"Star-like","Log Number":"US-09172008-0074","divs":["Sighting DetailsMy best friend and I were very interested in astronomy. One moonless night we were lying in the grass of his back yard watching stars. We noticed two lights traveling side by side at high altitude east to west and assumed they were jets from Andrews AFB. Suddenly the \"lights\" began to circle each other in a complex pattern that no aircraft could perform; it was as if they were orbiting each other at high speed while having stopped their forward motion. The suddenly both objects broke contact and one went north and the other south at an incredible speed, too fast to follow. We were both so astounded by what we had seen that we ran into the house where my friend called the telephone operator. She told us that we were probably just imagining things and to tell our parents. (they were out for the evening) I have thought about this for years. Looking back it seems like a thing search lights could do, however; the lights were very high and bright like planes or stars and search lights would have shown beams. Lasers might have done it, but I don't believe they had them at that time or at least not to play with. No, these lights were flying like airplanes until they stopped and did the weird orbit thing and then vanished at high speed. Certainly this could be replicated today with special effects, but we are speaking of the 1950s. Of course the Washington area was a hot bed of UFO activity in the late 40s and early 50s. I was born in 47 as was my friend, but we had been told stories by some older kids about jets flying low level down the Potomac River on many nights during that time. (I suppose to get beneath the radar) At any rate the UFO situation was something everyone seemed to take as a fact of life in the DC and Northern VA area back then. All I can say is what I am describing really happened and I have no solid explanation for it. Perhaps someone else has had a similar experience."],"Viewing Distance":"Over One Mile","Latitude":"38.812796","Country":"United States","Region":"Virginia","Weather Factors":"Unknown"}