{"Country":"United States","Latitude":"32.529812","Viewing Distance":"501 Feet - 1 Mile, Unknown","Case Number":"12572","Source":"MUFON","Date Submitted":"02/29/2008 04:42 UTC","Weather Factors":"Does Not Apply","Summary":"Seen at 4:42pm travelling south at a constant speed. At best guess, it may have been about a mile west of my vantage point. Lost sight of it behind a building.","Object Flight Path":"Undisclosed","trends":["There have been 16 other sightings in Shreveport","There were no other sightings in Shreveport on or around February 29th 2008","This sighting has never been favorited.",""],"Longitude":"-93.743529","Date of the Event":"02/29/2008 04:42 UTC","divs":["Sighting DetailsMy family and I were walking west in the Sam's Club parking lot toward the building. My wife and I both saw the object at about the same time. It didn't look like a plane or move fast enough to seem like a plane. I thought it may have been a helicopter tracking I-49 south. My wife (she was pretty excited at this point) has better eyes than me and said it looked like a floating rubber duck. (I really couldn't see a definite shape until I reviewed my pictures.) The object had a somewhat oval shape with 'fins', and a rectangular 'flag' or 'sail' above it. It moved at a moderate, constant speed from north to south. I decided to take a movie of it. I had my camera (Canon A510) in hand and started to take a little movie of it. As soon as I hit the shutter button I realized that the quality wouldn't be very good. You can hear me in the video saying, \"Uhh, this ain't gettin' it.\" So, I took a quick photo, zoomed in and took a second photo. Then we lost sight of it behind the building. We continued with our shopping. We thought afterwards that maybe we should have gotten back into the van and followed it, but by then it was too late."],"Tags":"City","Sighting Duration":"00:00:30","Object Features":"Appendage(s)","Log Number":"US-09172008-0067","files":["/var/www/straped/mufon/html2text/12572.html.txt","/var/www/straped/mufon/more/12572_submitter_file1__IMG00001.JPG","/var/www/straped/mufon/more/12572_submitter_file2__IMG00002.JPG","/var/www/straped/mufon/org/12572.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.529812,+-93.743529(12572)&iwloc=A&hl=en\"> mufon case (12572) map </A>","Disposition":"IFO","City":"Shreveport","Region":"Louisiana","Object Shape":"Egg, Oval, Square, Rectagular, Other"}