{"Date Submitted":"07/19/1999 03:23 UTC","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Chennai","There were no other sightings in Chennai on or around July 19th 1999"],"Sighting Duration":"Undisclosed","City":"Chennai","Tags":"City","Disposition":"Unresolved","Summary":"2 balls of light hovering up and down on top of the building opposite my house","Object Features":"Undisclosed","Country":"India","Latitude":"13.062312","divs":["Sighting DetailsOk, this all happened when i was a little kid back in India. I had noone to tell bout all of this because ofcourse...who the heck would believe me?. Ive seen this website on my msn page today so i guess i can finally talk bout wat i saw when i was young. Back in India where im from, I saw 2 orbs of light hovering up and down across my house on top of the building opposite mine. Now these orbs couldve been anything right? guys with flashlights w.e but the thing is...after a short while they just ROSE into the air and flew off!!!. Since i was a little kid at that time i didnt really care but thinking bout it right now after watching all those UFO videos like Jamie Maussan and others im just kinda shocked that i might have seen 2 ufos when i was a kid. Also i have 1 more story to share with you guys. When i was on vacation to Chennai during the summer time, i was travelling in the train that goes there. I always used to go there every summer so yea, it was this specific trip that startled me. When i looked out of the window from the moving train, i saw a saucer like object that was pure grey flying really low just a little far away from the train. Im totally sure it wasnt an aircraft coz there is noooo frickin way an aircraft would fly that low and there were absolutely no airports around that area as well coz we were like really far away from Chennai so the idea of an aircraft flying low to land would be out of the question. This object was no jet since jets werent round and they too dont fly that low. I dont think any of this would be of any use to u guys anymore since it happened a long ass time ago but yea i just wanted to share it with some people who actually do believe that we have visitors on this planet. Thank you."],"Log Number":"IN-09172008-0068","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/12573.html.txt","/var/www/straped/mufon/org/12573.html"],"Case Number":"12573","Region":"Tamil Nadu","Date of the Event":"07/19/1999 03:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=13.062312,+80.250783(12573)&iwloc=A&hl=en\"> mufon case (12573) map </A>","Object Shape":"Bullet, Missile, Circle, Oval, Sphere, Star-like","Source":"MUFON","Object Flight Path":"Undisclosed","Longitude":"80.250783"}