{"Disposition":"Unknown","Weather Factors":"Unknown","Case Number":"12576","Latitude":"41.133429","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Region":"Nebraska","Summary":"Bright light approached taking 45 minutes - left at right angle gone in 10 sec.","Tags":"City","Log Number":"US-09172008-0071","map":"<A HREF = \"http://maps.google.com/maps?q=41.133429,+-101.711494(12576)&iwloc=A&hl=en\"> mufon case (12576) map </A>","Date Submitted":"11/30/1953 12:00 UTC","Source":"MUFON","trends":["There have been 2 other sightings in Ogallala","There were no other sightings in Ogallala on or around November 30th 1953"],"Viewing Distance":"101-500 Feet","Longitude":"-101.711494","divs":["Sighting DetailsI was in the 8th grade. I went fishing with Mr. Franke who lived about 7 miles South of Ogalalla, Neb. We went to Lake McCounaghey a few miles North of Ogalalla. It was late at night and we had a Coleman lantern lit to be able to see our bobbers. I saw a small white light to our left. It kept getting larger and larger and when I asked Mr. Franke \"What is that?\", he replied \"I don't know but it isn't bothering us.\" It kept getting larger and larger and brighter and brighter till the bay we were fishing in was completely lit as if it was daylight. Mr. Franke turned off the Coleman lantern and we fished without the lantern for quite a while. At this time I would say the bright light was about as big as a house. Suddenly it took off and went at right angles from its approach going straight away from us and was gone in about 10 seconds. We had a terrible time re-lighting the lantern. I had and have no idea what it was. It was only a light but it became as big as a house and lit up the area we were in like daylight. I could see nothing except a huge bright light. Once it got to a position about the end of the bay it sat there for 30-40 minutes and got no brighter nor closer than that. As I was in the eighth grade I was scared at first until Mr. Franke made his comment. Then he said \"We might as well turn this light off\". It was as bright as daylight. We caught no fish until it zoomed off at which time the fish started biting although we had a terrible time re-lighting the lantern. It was gone in 10 seconds just a streak across the sky. I had no camera so there is no real proof. I grew up and became an engineer, worked at Cape Canaveral during the 1960s and have never seen anything like it since nor understood what it was."],"files":["/var/www/straped/mufon/html2text/12576.html.txt","/var/www/straped/mufon/org/12576.html"],"Date of the Event":"11/30/1953 12:00 UTC","Object Shape":"Sphere","Object Features":"Unknown","City":"Ogallala","Country":"United States","Sighting Duration":"Undisclosed"}