{"map":"<A HREF = \"http://maps.google.com/maps?q=33.153474,+-96.820282(12587)&iwloc=A&hl=en\"> mufon case (12587) map </A>","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around April 20th 2005"],"Case Number":"12587","divs":["Sighting DetailsActually, this one event turned into many events that still happen to this day. It started out as a quiet drive back to our house on a country road miles from our house. Me and my wife were coming back from an outing and decided to take the back way to our home, which is in an area that is still mostly rural and dotted with corn and wheat fields, although development was only about ten miles behind us. At this point we were due east of Celina. Needless to say, it is pitch black out there, and the only lights visible is from farm and ranch homes. The roads are long and winding. Anyway we were driving along talking, and we were about to reach a curve in the road where an old cemetary and church is, when we both saw this object in the night sky that was turning all different colors. We pulled down by the cemetary on a whiterock road to get a better look at it to see what it was. I wanted to see if the object was stationary as we had observed it from the road while we were driving. As I stopped the car, lights still on, me and my wife observed that the object was truly stationary, and hovering about two or three hundred feet off the ground. Now there were many trees in front of us, no bare ground, but I made an educated guess at its elevation from the ground. I decide to get out of the car to get a better look at this thing to determine if it was a helcopter, plane moving slow, a passenger jet heading for DFW Airport. It was none of these things as far as I could tell. I ask my wife what she saw, and she said that she saw a stationary object turning different colors and it looked to her as if it were spinning around as it was changing colors. I told her that I agreed and we continued to watch this object until I got an idea. Now, you must understand that I am not a scary person, just the opposite, and I wanted to see if I could get a reaction out of this thing to see if it would come our way, or at least acknowledge that it saw us, so despite my wife's protests, I stood in front of our car lights and waved my hands and jumped up and down to get its attention. In that kind of darkness, anyone could have seen me doing what I was doing in a plane flying much higher. I was counting on that. Well, at first nothing, but then this object went completely dark, like nothing was there, then its lights gradually came back on. I told my wife, I think I got a reaction. Well, I started jumping up and down again waving my hands, and this time the object began coming our way. My wife wanted to leave, but I said let's see what this thing really is. We did not have long to wait, because it was almost over us in a mater of about 30 seconds, but veered to our right as it got near. It had dropped altitude to about 100feet, and was slowly moving by us at about 150 yards away. The first thing we noticed was that there was no sound coming from this thing, we were listening real hard, nothing but dead quite. I told my wife that I saw an object that was triangular with three white lights at its rear, she said she saw the same thing, and that it looked like a triangular wedge shape. The different colored lights that it had been displaying were no longer being displayed. It was black in color all over. I began to follow it on foot down the whiterock road to the right of where we were parked. It began to move off from us as I motioned to it to come back our way. I wanted it to land. It continued away from us at a steady speed going southwest, finally disappearing into the night. Now I want to say that this object has been a regular visitor about a quarter of a mile away, about 200 feet up, and west of our house for two years now. It appears with its spinning multi-color lights on many nights. I have flashed my flashlight directly at it to get a response from it, and most times it will begin to spin faster and flash more colors. Sometimes though it will almost stop emitting light altogether, and begin moving off to the north and west. It does not show up all the time, there are periods when I do not see it at all. But I want to say that I have watched it trying to maintain its hovering position making movements to the left or right to keep its center of gravity. Much like a person trying to keep their balance on a round ball, little corections that keeps it stable. I have even turned my back patio light on so that it can see me, and I make gestures that tell it that I can see it. I do not know what this is, I have speculated that it could be a military platform that our government is trying out over populated areas. However, I do not think that we are even capable of this type of technology, and My instincts tell me these could be some type of probes from another craft monitoring this area. You see, me and my wife have speculated that the reason that this thing or things are around here is because of all the air traffic that comes and goes north and south. It is a perfect place to observe without being noticed to much. One more thing, one night a month ago, I was outside at about midnight and observed a dimly lit round object flying from west to east at about 1000 feet at a high rate of speed, no sound. All I can say about these things is that, why has someone else not seen this, and how could they not. With no pictures, video, or anything, it is just my word, and personal account. End of event."],"Date Submitted":"04/20/2005 10:15 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Object Features":"Undisclosed","Date of the Event":"04/20/2005 10:15 UTC","Longitude":"-96.820282","Object Shape":"Triangle, Other","Summary":"spotted in sky on country road while driving","Latitude":"33.153474","City":"Frisco","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"01:00:00","Region":"Texas","files":["/var/www/straped/mufon/html2text/12587.html.txt","/var/www/straped/mufon/org/12587.html"],"Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Log Number":"US-09182008-0008"}