{"City":"Laughlin","files":["/var/www/straped/mufon/html2text/12588.html.txt","/var/www/straped/mufon/org/12588.html"],"Summary":"total of about 8 oval to round balloon shapes on ea side for a total of 16 ea the size of about a sm VW bug","Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","divs":["Sighting Detailswe my husband and I were at laughlin, Nv. there was no one else around. we were right on the boardwalk near the River Palms Hote. It came over us very slowly with out any any any sound at all. It was huge. The were in a v shape almost like a flock of geese but much much bigger. The entire area was so huge if you can imagine how big 16 vw bugs in the sky in a v formation but and yet independent. We froze and stared as if we take our eyes off we may miss something. Then they gradually disappeared into the coulds. No one else was around, someone is almost always around however it was midweek but still that was somewhat rare. I called the air traffic control and they did not see anything, no reports. Just recently I hear that the air traffic control at laughlin closes at 6pm that was something that has bothered me for 7 and a half years that there is no way they could not see that thing. but it was about 6:30 so there was no one there to see it. they were all together however they seemed to be very independent I say that because one side seemed to move a little different almost like a push off of a wing kind of like. Each one was not lite but seem to illuminate the lights shinning into the sky from the bug hotel. They almost looked opal not a light not a color but like it was reflecting light. We have gone back to the exact same spot and same time of year same time of day it just to this day boggles my mind. All I can say is what ever it was was really big and I have no ideal what it was. I would like to think they were deaf geese of extreme in size unable to honk and each a white opal in color what in the world was it I don't know I am just glad my husband saw it too! He tells no one in fear they will believe him crazy I did at first tell others but not really any more because it is unbeleivable. I have notified many on the internet however I have tried and tried to locate someone who has seen something like it the closest I have come up with is those balloons in Mexico except the ones we saw were in a formation all together. that's it wish I had had a cell phone with a camera back then only a cell phone and no camera.It had us spellbound."],"Longitude":"-114.569731","Case Number":"12588","trends":["There have been 4 other sightings in Laughlin","There were no other sightings in Laughlin on or around May 31st 2001"],"Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=35.174977,+-114.569731(12588)&iwloc=A&hl=en\"> mufon case (12588) map </A>","Region":"Nevada","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Shape":"Circle, Oval, Other","Disposition":"Insufficient Data","Date of the Event":"05/31/2001 06:30 UTC","Object Features":"None, Unknown","Latitude":"35.174977","Log Number":"US-09182008-0009","Country":"United States","Source":"MUFON","Date Submitted":"05/31/2001 06:30 UTC"}