{"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.783622,+-119.066503(12586)&iwloc=A&hl=en\"> mufon case (12586) map </A>","Longitude":"-119.066503","Summary":"spaceship with lights appeared over the sierra in june lake calif.","Country":"United States","Date Submitted":"06/15/1972 12:00 UTC","Disposition":"Hoax","Region":"California","Viewing Distance":"Unknown","Latitude":"37.783622","City":"june lake","Object Features":"Undisclosed","divs":["Sighting Detailsin june 1972 I met Jack Bing at a market in June Lake Calif. He asked me and Leah to visithim at his house and he wanted to show us some things. we went a few hours later and he went on to explain many ufo sightings and showed us many new forms of music that we had never heard before.He even later that eveningclaimed to show us a light in the sky that he said was a spaceship. we went back to out cabin and were a littleunnerved by the whole storybut not unbelieving. A few years later we ended up moving there.and there was what we called a spaceship school there. It was ran by two women Hope and Grace and they claimed to have communications with the Brothers of Light that inhabited these spaceships.There were a good number of students who attended that were our age and we visited a couple of their Sunday services. The story went that the main angel was gabriel and Jesus himself had been at one time taken away in one of these spacecrafts. All of this would have been hard to take except for the fact that sightings of crafts were happening continually at this time and both of us with other witnesses had seen craft on more that one occasion.Still I felt uneasy about this and went to the bible and God for some help. I found three scriptures that seemed to disagree with the philosphy being taught and went to the school to ask a few questions. Hope told me she loved questions from her students and we sat down for a chat I asked her the first scripture and she answered ,\"well what Jesus meant by that was,..\" with a little chuckle in her voice and I said well if that's true what about this scripture and she answered alittle more intensely \"well what Jesus Really meant was!!!\" andI said well if that is true then what about this scripture? Hope was in her late 60-70's at the time and jumped straight in the air twirled and flew out of the room!! I was left sitting at the table with mouth opened and a litle man grabed me by the arm and said Hope has a headache and I was put out the door of the trailor and left looking at the beautiful high sierras wondering if that really just happened!!The next morning I was up early and on the way to Mammoth and sunsshining and the sky was blue and as clear as can be and a spacecraft came up over the pine trees in full sight and I looked at it and pointed my finger at it and said these words \"satan you're a liar! and in the name of Jesus be gone\" The craft shook in the air and disappeared and I've never seen one since that day. I believe that this entire UFO lore is just the demons trying as hard as they can to do the job they do so well,deceive. It says that Satan is the Prince of the air and would do many miracles in the last days to fool many even the elect if that was possible.Not many have had the experience that I had or have been lead to the complete conclusion because with so many seeing is believing but the magician knows if he can distract the veiwer the trickand illusion will be a great success.I'm telling this story knowing that manywill think I'm lying or fabricating this for a personal religious view but I promise you that nothing could be further from the truth. at the time I was NOT a christian but these events plus others have helped me to find that way of living.I witnessed these things and tell you that I stand by this statement. Michael Corry Sept 17th 2008"],"Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in june lake","There were no other sightings in june lake on or around June 15th 1972"],"Log Number":"US-09182008-0007","Source":"MUFON","Date of the Event":"06/15/1972 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"12586","files":["/var/www/straped/mufon/html2text/12586.html.txt","/var/www/straped/mufon/org/12586.html"],"Tags":"City","Object Shape":"Circle, Disc, Flash, Other"}