{"files":["/var/www/straped/mufon/html2text/12583.html.txt","/var/www/straped/mufon/org/12583.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","Weather Factors":"Unknown","Case Number":"12583","Date of the Event":"09/17/2008 09:10 UTC","Object Flight Path":"Undisclosed","Date Submitted":"09/17/2008 09:10 UTC","Disposition":"Unresolved","Summary":"star-like object moved sporatically / pulsing / stationary. At angles lights moved along an axis to center light","Tags":"City","divs":["Sighting DetailsI live in outside of Mancos CO.,population of ~ 800 people. I enjoy resting in my hot tub and viewing the night sky. Viewing the sky, I noticed -- what appeared to be a star, but moved slowly, in spurts, and somewhat in a pulsating manner westwardly. Movement was slow and irratic. Depending upon the angle that I saw the object; it appeared to have lights moving horizontally across in a sweeping fashion. It also appeared as if there was a \"main\" light, but also smaller sweeping lights moving in either direction, and what appears to have no order. Difficult to determine if the object at times moved closer to the ground or was moving laterally, or combinations thereof. Seamed harmless, and difficult to determine size and distance. Two planes (I think normal flights) flew somewhat near the object ... and the object then stayed stationary and looked like an ordinary star. Shortly after each plan passed then the object would move slightly and the horizonatal lights would appear. The horizonatal lights were predominately white in color, but on occasion ( I think I saw some green and red hues). My neighbor, Harry Kinder has mentioned he has seen several unidentified objects in the sky previously. I too, have seen these star-like objects previously, but to be honest, I thought my imagination or eye sight may have been playing tricks upon me. Getting back to this object, I was in the hot tub for at least an hour .. just gazing at this object, and to try to figure out if a pattern was in involved with the lighting. No photos, difficult to determine how high or size of object. Appears to have moved around in the sky, then stopped, as if to look as if it were a star. My feelings were at best neutral. It was just there, no excitement thrill or anything. I was more curious than anything. It presented no harm or sudden movement."],"Longitude":"-108.289249","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.344996,+-108.289249(12583)&iwloc=A&hl=en\"> mufon case (12583) map </A>","trends":["There have been 6 other sightings in Mancos","There were no other sightings in Mancos on or around September 17th 2008"],"Object Shape":"Saturn-like, Star-like","Log Number":"US-09182008-0004","City":"Mancos","Region":"Colorado","Latitude":"37.344996"}