{"Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"06/15/1969 11:00 UTC","divs":["Sighting DetailsMy friend and I were driving in a VW bus about 11 pm one summer night across the drawbridge from Pensacola Beach to Gulf Breeze, Fl. I glance out the window and see some strange craft sitting up in the air over the marina. We pulled over to the side of the road as soon as we crossed the bridge. I have never seen anything like it before or since. It was about two to three hundred feet up in the sky and sitting there not making a sound. It was a 6 sided figure with the lines that were parallel with the horizon about 3 or 4 times longer than the other 4. It was approximately 50' wide and 15' feet high. If you can imagine that. it was divided through the middle with a line parallel with the other two longer sides. It had rows of panels along the top and bottom halves. These alternated in color from red to green to blue to yellow in such a way as to give it the appearance of the panels moving around the craft. We watched for a few minutes and then the next thing i know is that we were heading down the road and i was looking up in the sky and it was still there. We rode home without speaking and i don't remember talking about it for years. Not even the next morning, it was like we had put it out of our heads. And when I would try to bring it up my buddy would say \"i don't wanna talk about it\". This has gone on now for 40 years and i still wonder about that night. I lived next to airbases as a child and i have never seen anything like this. Pensacola Naval Air Station is nearby. It was nothing from there i am sure."],"Object Flight Path":"Stationary","Tags":"City","City":"Gulf Breeze","Latitude":"30.364454","files":["/var/www/straped/mufon/html2text/12589.html.txt","/var/www/straped/mufon/org/12589.html"],"Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.364454,+-87.162137(12589)&iwloc=A&hl=en\"> mufon case (12589) map </A>","Object Features":"Window(s), Appendage(s)","Longitude":"-87.162137","trends":["There have been 55 other sightings in Gulf Breeze","There were no other sightings in Gulf Breeze on or around June 15th 1969","This sighting has never been favorited.",""],"Log Number":"US-09182008-0010","Date of the Event":"06/15/1969 11:00 UTC","Region":"Florida","Country":"United States","Object Shape":"Other","Viewing Distance":"101-500 Feet","Summary":"about 50' wide and 15' tall. had multicolored panels in 2 rows that seemed to move","Case Number":"12589"}