{"Weather Factors":"Unknown","Latitude":"39.742944","City":"Denver","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around September 16th 2008"],"files":["/var/www/straped/mufon/html2text/12594.html.txt","/var/www/straped/mufon/org/12594.html"],"Date of the Event":"09/16/2008 09:10 UTC","Country":"United States","Longitude":"-104.981493","Summary":"Some sort of Pulsar Crystallike colored Star Read more almost same as other guy from colorado yesterday","Region":"Colorado","Source":"MUFON","Case Number":"12594","Object Shape":"Diamond, Star-like, Unknown","Disposition":"Hoax","divs":["Sighting DetailsI went out onto my top floor balcony with a friend and he then pointed at a light and said \"what the [pd] is that\"? I was like what it's a [pd] helicopter and then I actually looked at it was sitting still like a low hanging uber bright star. I then stared at the light and it began to protrude a star like pattern with crystal like properties. The center of the light was so intense it created a unique one of a kind whiteness of bright light in the center...on the tips of the light pattern the color was the most vibrant green color I have ever seen. We stared at the light for about 3 minutes and then I noticed there was another one very close to it. I then noticed about 4 airplanes (commercial jets I think) flying next to these stationary objects. The lights were 100 fold dimmer in comparison but were obviously closer in distance. The object must have noticed our observation and comparison the jets flying in the foreground. It then turned around and slowly drifted North's and the star like light pattern changed as if it was facing away and started blinking the most intense red LED type light. It appeared to me it was disguising itself as another airplane and it then moved what seemed to be about Mach 15 upwards into the atmosphere stratosphere whatever and left into space. The lights twin then started slowly drifting towards the same direction. I looked down and looked back, the second one had vanished after two eye blinks. The planes around were it was had barely moved what would be about the distance of a finger nail in comparison to the objects travel of an arms length into space. It seemed to be about NWish of Denver I observed from Southern Denver. I was extremely interested, wasn't frightened. It seemed like it was just checking out something or I don't know. Maybe it wanted us to see it. Maybe not. Maybe it was showing off, either way it was cool. Until yesterday I have never given a [pd] about UFOs or stories now I read the other guys post from Colorado seeing about the same color pattern and I saw TWO at the same time and so did my friend. He told me he saw the similar pattern but he indicated that the color spectrum appeared to be \"purple\".. No [pd]."],"Date Submitted":"09/16/2008 09:10 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-09182008-0015","map":"<A HREF = \"http://maps.google.com/maps?q=39.742944,+-104.981493(12594)&iwloc=A&hl=en\"> mufon case (12594) map </A>","Object Features":"Undisclosed"}