{"Sighting Duration":"Undisclosed","Object Flight Path":"Unknown","City":"Leesville","Latitude":"31.143519","Source":"MUFON","divs":["Sighting DetailsMy step-father who has passed away now, encountered something while driving back to Texas from Louisiana at night. He was on a two lane road in Vernon Parish, a road that the entire family has traveled many many times. He was about 5 miles from an intersection where he would turn right and travel north. Then, he rounded a curve and just above the road was a string or a row of very bright lights. He said that the lights blinded him. There were 8 to 10 lights, it seemed to cover the entire road. He swerved thinking he was going to hit whatever this thing was and ran off the road on the left side and into a ditch, continued down the ditch for a bit and pulled back on the road. The lights were behind him at this time. Well, he kept driving and was expecting that intersection in just a few miles but instead he found a sign saying that he was about to be at the Toledo Bend Dam. He stopped the car in a mass of confusion. He was something like 15 to 20 miles from where he was suppose to be and was traveling south and not west. In just a few seconds he had gone from one point to another point with no memory of anything. He turned around and drove north, found the intersection that he was suppose to be at and went back, driving east and found the area where he ran off the road. he could see where he left the road but he could not find where he got back onto the road. He drove back home to Texas and told me and the family what had happened. This event really shook him up. My step father, before this happened, would have said \"hog wash\" if anyone told him a story like this but after this happened to him........he was a beliver."],"Summary":"8 to 10 very bright lighs in a row just above the highway","Region":"Louisiana","Case Number":"12593","Date Submitted":"07/02/1990 12:00 UTC","Tags":"City","Longitude":"-93.260998","Log Number":"US-09182008-0014","Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"United States","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=31.143519,+-93.260998(12593)&iwloc=A&hl=en\"> mufon case (12593) map </A>","files":["/var/www/straped/mufon/html2text/12593.html.txt","/var/www/straped/mufon/org/12593.html"],"Date of the Event":"07/02/1990 12:00 UTC","Object Shape":"Unknown","Viewing Distance":"21-100 Feet","trends":["There have been 3 other sightings in Leesville","There were no other sightings in Leesville on or around July 2nd 1990"]}