{"Date Submitted":"09/15/2008 03:00 UTC","Log Number":"US-09182008-0016","City":"Richland","Date of the Event":"09/15/2008 03:00 UTC","Source":"MUFON","Object Shape":"Star-like","Case Number":"12596","Summary":"A large star-like object traveled across sky at a steady speed, did a curved dive straight down and disappeared.","Latitude":"46.287691","Weather Factors":"Unknown","divs":["Sighting DetailsI went into my dark living room and sat down on couch to look out the large picture window at the eastern sky for a few minutes before going back to bed. It was quite late, long after midnight in the early morning hours of September 15, 2008. There weren't many stars visible in the sky (because of city lighting), but there were 2 stars that were about the same height and size and were much brighter than the others in the sky. I was looking at those two stars which were about level with each other and in my vision I estimate about 16 inches apart (if I had held a ruler against the window). The one directly in front of me was not as bright as the one on the left which was very bright. I would compare the brighter star to Venus when it is at its brightest and I was wondering if it was Venus. I looked back and forth at those 2 stars a few minutes and was staring at the dimmer one directly in front of me when in my peripheral vision, I realized that the brighter star on the left seemed to have started moving towards the dimmer one--headed in a straight collision course towards it. My first thought was that it was a satellite, but it was much larger and brighter than any satellite I've seen. It was moving from north to south in the eastern sky towards the other star that hadn't moved at all. I really didn't have all that much time to think about it as the whole thing lasted only a few minutes! When the moving star on the left got to the other not-moving dimmer star, the moving bright star took a curved dive to change direction from straight horizontal to straight down. (It was not a sharp-angle turn, it was a sharp-curved dive!) It went straight down directly beneath the dimmer star for about 5 or 6 inches and then poof, it was gone! It first appeared to be sitting still, and then it traveled across the sky for about 16-18 inches at a steady speed, did a curved dive straight down for about 5 or 6 inches and disappeared. It did not go behind a tree (it was too high in the sky for that) and it did not go behind a cloud or fade out--there were no clouds as the sky was clear. It just vanished---instantly! I do not know if I saw a star, a meteor, a satellite or something else."],"Sighting Duration":"00:04:00","Disposition":"Unknown","Longitude":"-119.278662","Region":"Washington","files":["/var/www/straped/mufon/html2text/12596.html.txt","/var/www/straped/mufon/org/12596.html"],"Object Flight Path":"Stationary,Straight-line path,Path with directional change","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.287691,+-119.278662(12596)&iwloc=A&hl=en\"> mufon case (12596) map </A>","trends":["There have been 9 other sightings in Richland","There were no other sightings in Richland on or around September 15th 2008"],"Viewing Distance":"Unknown","Country":"United States","Tags":"City"}