{"Date Submitted":"08/20/2008 12:00 UTC","Date of the Event":"08/20/2008 12:00 UTC","Country":"United States","Case Number":"12606","Latitude":"41.508324","files":["/var/www/straped/mufon/html2text/12606.html.txt","/var/www/straped/mufon/org/12606.html"],"Object Shape":"Boomerang, Sphere","Disposition":"Insufficient Data","Summary":"A bright sphere appeared followed by three wings","Sighting Duration":"Undisclosed","Region":"Illinois","Log Number":"US-09182008-0027","City":"Matteson","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.508324,+-87.708162(12606)&iwloc=A&hl=en\"> mufon case (12606) map </A>","trends":["There have been 5 other sightings in Matteson","There were no other sightings in Matteson on or around August 20th 2008"],"Tags":"City","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsI was driving east on rt 30 at the stop light on Cicero when I saw a sphere in the eastern sky against the sun set. The sphere disapeared. A few minuts later while in a parking lot by the Holiday Inn I saw a wing shaped black craft lifting vertically into the sky. It had a jet trail that formed an inverted V shape behind it as opposed to a side by side jet trail. As it slowly lifted and accended through clouds my girlfriend ( whom I had called to look as she works in an office building off of Cicero and had a higher view ) also saw the craft ( and has since seen another recently. ) While watching two other crafts shot across the sky momentairly leaving the same V trail behind them and were gone. ( I'm not a Star Trek fan but when their ship jets away at the end of the show was the clostest thing I could relate to this as I could almost see them speed up and away. ) Eventyally I noticed that this black wing had no blinking lights as a airline plane does ( we get two airports worth of traffic in south Cook county, I know what a plane looks like.). Eventually, I lost track of it in some clouds well after it had passed over head and began to head east. Later I thought that it looked kinda like the stealth bomer or something. My sister said she saw a triangle craft that same night, but I can't vouch for that. BTW, I tried to video tape it but I have a crappy samsung phone to thank for nothing showing up."],"Longitude":"-87.708162","Source":"MUFON","Object Features":"Undisclosed"}