{"Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Log Number":"US-09182008-0020","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsMy friends and I,(it was about three people) were just strolling through the park next to the baseball field. None of were drunk, due to the fact we were 13 at the time. None of were paranoid because we were the kind of kids that enjoyed being outside in the dark, I for one wanted to investigate the local ghost stories. But all three of us ended up witnessing the most amazing event any of us had ever seen, and to be seen to clearly as well. The baseball diamond that day had been re sanded it so there were no bike marks or footprints at all. I remember it really clearly as we continued walking, or voices dropped as we turned around after hearing something behind us...but it was just my Friends little brother who left after we told him to \"Leave us alone!\" As we turned back, we were in shock. The baseball diamonds sand had been marked up with what seemed to be little tire marks, but they were to big to be from a bike. A four wheeler maybe but surely we would have heard that. And in the time we were turned around...its not possible. Not knowing what to do we just stayed there and tried to trace it, until a bright flash attracted us to look up at the clear night sky. A bright orange flash caught our attention as it swerved around the sky,at first we passed it off as a plane, but soon we knew we were wrong. As it continued going around the sky we saw that the clouds started forming the same markings that were in the sand. That started to amaze us and scare us at the same time. As we stared at the thing, we saw that it was moving way to fast to be a plane and a jet doesn't circle around that fast...we knew also that it was a disk shape. As we kept staring for about five minutes the object just suddenly flashed and disappeared. At the moment we did not know what to think, it was like it was there and then not. We looked up at the clouds and then back at the sand. It formed approximately 8 perfect rings, inter circling each other and there was about 7 or 8 circles on top of the rings. They were spaces apart almost one apart from the other. This symbol looked like our solar system or maybe another. But we say the thing was perfectly drawn, it couldn't have been bikes."],"City":"Phillipsburg","trends":["There have been 2 other sightings in Phillipsburg","There were no other sightings in Phillipsburg on or around June 7th 2007"],"Date of the Event":"06/07/2007 08:30 UTC","Latitude":"40.69371","Disposition":"Unknown","Object Features":"Other","Longitude":"-75.190176","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.69371,+-75.190176(12600)&iwloc=A&hl=en\"> mufon case (12600) map </A>","Region":"New Jersey","Weather Factors":"None","Date Submitted":"06/07/2007 08:30 UTC","Case Number":"12600","Sighting Duration":"00:05:00","Summary":"Cloud formation descripted the same formation in sand at baseball field","Object Shape":"Disc, Flash","files":["/var/www/straped/mufon/html2text/12600.html.txt","/var/www/straped/mufon/org/12600.html"],"Source":"MUFON"}