{"Longitude":"-84.288552","divs":["Sighting DetailsI'll be short and to the point. I know this sounds crazy, but I know others out there are looking for answers just like me. The other night, Sept 14 or 15, I was at home sleeping. I woke up from a really vivid-dream about 3am. Strange thing is, when I woke up, I was wide awake and felt like my bladder was going to explode. Weird thing, everything in the house was too still and quiet. I used the bathroom and immediately went back to sleep. The first dream was about me in a waiting room. Some time later, I had something wake me up, open my mouth, and slowly inserted a probe into my mouth which was like an X-ray of some sort. The probe was illuminated and could see through the skin and bones and muscle, and projected the image on like a hand-held machine. The beings or aliens, not really sure what to call them, woke me up in the middle of the procedure and showed me what the inside of my lungs looked like on somekind of like display screen. I'm a smoker, and the inside of my lungs looked like they had cancer or something. I freaked, but then the Beings somehow spoke to me telepathiclly, and told me if I stopped smoking I would be ok. That's the crazy thing, I never got scared and I felt like I was with a Doctor or something. This one was stronger than the others, very reassuring. Then it was over and I woke up at 6am. I was wide awake again, and I immediately got out my Sketch Book and start drawing what happend. I dont know what to do other than write here. I sure as hell can't tell anyone, they will think I'm crazy. And for the record, I HATE the TV show Star Trek and other one with Sully and Muller, or whatever there names are. I'm a half-redneck southerner, and I can not talk to other people about this. Also, back in 2001, I lived in Dahlonega, Ga and saw a UFO. It was a round object, and it was a mile or two away, it appeared suddenly, was stationary, then it would do a figure 8, then hover. This went on for 5 hours, then it shot out a beam, low intensity, that illuminated the forest canopy. It did this 10-15 times. Then it shot lazer beam, and a large tree in the middle of the wooods burst into flames. The power line to my house was extremely loud, humming sound, then lights in my house never glowed that bright before. Then it was over."],"Latitude":"33.782108","files":["/var/www/straped/mufon/html2text/12605.html.txt","/var/www/straped/mufon/org/12605.html"],"Object Shape":"Circle","Disposition":"Insufficient Data","Tags":"City","Summary":"Something made Contact with me","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.782108,+-84.288552(12605)&iwloc=A&hl=en\"> mufon case (12605) map </A>","Case Number":"12605","Object Features":"Window(s), Patterned Surface","City":"Decatur","Log Number":"US-09182008-0026","Date of the Event":"09/14/2008 03:28 UTC","Country":"United States","Region":"Georgia","Weather Factors":"Unknown","Date Submitted":"09/14/2008 03:28 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile","trends":["There have been 7 other sightings in Decatur","There were no other sightings in Decatur on or around September 14th 2008"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change"}