{"City":"Lakewood","Date of the Event":"10/08/2004 06:03 UTC","Sighting Duration":"Undisclosed","Region":"Colorado","divs":["Sighting Details The date was Saturday, 8Oct2004. I was standing in my front yard near 10th Ave. and Garrison St. in Lakewood, Colorado, a suburb of Denver. The sun was close to setting but had not yet set. While watching a flurry of leaves fall from a tree I noticed a bright object in the northeast sky through the tree's branches. At first I thought it was the sun reflecting off an airplane but it became apparent to me that the object was not moving in relation to the tree's branches. I checked my watch and it was about three minutes past 6:00 p.m. (Mountain Daylight Time). The object appeared to be in a position not quite half way between north and east and all the activity I describe took place at an elevation of between 30 and 45 degrees above the horizon. Having no reference point, I can not guess as to the distance or altitude of the objects I saw. I moved to get the tree out of the way and began thinking perhaps I was seeing a star becoming visible as the sun was setting but it was just too early for a star to come out. I then began to think it was a weather balloon reflecting the sun. I have not seen a weather balloon since I was a kid and am now 60 years old. By the time I changed position and got the tree out of the way, I could see that the object was now moving in relation to some overhead electrical wires. About 30 seconds had elapsed at this point. Now I began to think I was seeing a satellite of some kind, as it was moving to the southwest at about the speed I have seen satellites move. I called to my daughter (age 24), \"Come see the satellite,\" and when I looked back the bright object was moving to the straight west. While I was waiting for her to arrive I saw several smaller bright lights (of two sizes) appear and disappear randomly at varying distances around the first object. Some were visible for several seconds, others just flashed on and then off. She arrived just in time to see several smaller objects, about six of them, form a semi-circle around the first object for a few seconds and then, in a split second, a number of the secondary objects formed a straight line with the first object for a few seconds. No object was seen that discernibly moved into the line formation. The line was angled in such a manner that, if extended upward, it would have crossed the northern sky in direction of the north compass point. My daughter looked at the bright objects through binoculars and said that they appeared to have orange and green lights on opposite sides. After this, both the primary and secondary objects appeared and disappeared randomly in the same vicinity for several minutes. Some were large and others were small. At some point one of the secondary objects separated from the group and began moving in a southwesterly direction toward us. Every so often it appeared to produce flames, like propulsion in fireworks, and would accelerate rapidly for a short distance in a random direction each time. When the object made a definite turn to the west, another object appeared from behind it or deployed from it and acted in a similar manner, flaming and changing direction at odd angles but keeping in the vicinity of the object as though chasing it. Both objects headed west for perhaps 15 seconds, sometimes bright and sometimes dark, as silhouettes, but I could not discern any particular shape. The offshoot object disappeared but I continued to watch the other object for a while. It became dark continuously and looked and acted much like a radio controlled model airplane. It flew west and I swear that at times it looked like the silhouette of a large bird flapping its wings, then it too suddenly disappeared. While this took place, several of the other secondary bright objects moved off slowly in a northeasterly direction. The first object then disappeared and by 6:15 p.m. all objects had completely disappeared. A few minutes later, a lone, conventional jet aircraft appeared from the west, flying at a very high altitude, and was observed to head off in the direction that the objects had disappeared. My daughter continued to watch the sky and about 10 minutes later she said she saw a bright object again in the vicinity of where the dark objects had disappeared."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.71067,+-105.078563(12604)&iwloc=A&hl=en\"> mufon case (12604) map </A>","Longitude":"-105.078563","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around October 8th 2004"],"Tags":"City","Object Features":"Wings","Source":"MUFON","Date Submitted":"10/08/2004 06:03 UTC","Object Flight Path":"Stationary,Path with directional change","Country":"United States","files":["/var/www/straped/mufon/html2text/12604.html.txt","/var/www/straped/mufon/org/12604.html"],"Object Shape":"Star-like, Other","Log Number":"US-09182008-0025","Weather Factors":"Does Not Apply","Viewing Distance":"Unknown","Case Number":"12604","Latitude":"39.71067","Disposition":"Unknown","Summary":"A bright object in northeast sky 6:03 p.m. Several smaller bright lights (two sizes) appear and disappear randomly at varying distances around the first object. Dark silhouettes later."}