{"Sighting Duration":"00:01:00","City":"Corona","Case Number":"12610","Latitude":"33.882554","Summary":"early morning/dark, sighted starlike object in northern sky above foothills. Object initially stationary, noted slight movement to east with no change in altitude and increase in brightness followed by a sudden move to the east at incredible speed.","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.882554,+-117.558758(12610)&iwloc=A&hl=en\"> mufon case (12610) map </A>","Tags":"City","Object Shape":"Saturn-like, Star-like","Longitude":"-117.558758","Log Number":"US-09182008-0031","Date of the Event":"09/17/2008 03:30 UTC","Object Features":"Unknown","Source":"MUFON","Date Submitted":"09/17/2008 03:30 UTC","Disposition":"IFO","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy oldest son and I work together in Long Beach and share the ride. We leave our residence 5 miles south of Corona on I-15 around 3:30 AM to beat the traffic. We live in a neighborhood on the foothills just below Saddleback Mountain and have a good view north across the San Bernadino Valley and are familiar with the night sky at that time in the morning.I wear corrective lenses and my son has excellent vision. We are both familiar with a variety of aircraft, both military and civilian and the flight path to John Wayne Airport is right over our neighborhood so we know what landing lights and running light appearances are on both airplanes and helicopters.This particular morning I observed a bright single point of light that at first appeared to be a bright star and then intensified to a Venus brightness as it began to move towards the east. I called my sons attention to it as he was driving and although he observed it for a few seconds I continued to watch it as it was observable out of the passenger window. It was around 30 to 40 degrees above the horizon and never appeared to increase altitude. It had a sudden burst of instant speed and moved across the sky towards the east southeast for a period of several seconds until it stopped again. Light intensity never changed, so there was no appearance of the object moving either away or towards me. I have never seen an aircraft of any type move that fast, and abruptly just stop. The rapid movement lasted about 4 to 5 seconds, however the distance covered in that period was well beyond any aircraft performance that I am familiar with. As we came off the hill I lost sight of the light."],"trends":["There have been 36 other sightings in Corona","There was one other sighting in Corona on or around September 17th 2008"],"files":["/var/www/straped/mufon/html2text/12610.html.txt","/var/www/straped/mufon/org/12610.html"],"Region":"California","Object Flight Path":"Path with directional change"}