{"Region":"Ontario","files":["/var/www/straped/mufon/html2text/12614.html.txt","/var/www/straped/mufon/org/12614.html"],"Date of the Event":"11/20/2007 12:00 UTC","Object Flight Path":"Undisclosed","Case Number":"12614","Sighting Duration":"Undisclosed","Country":"CA","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Flash","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.596646,+-77.737978(12614)&iwloc=A&hl=en\"> mufon case (12614) map </A>","Tags":"City","Object Features":"Undisclosed","Longitude":"-77.737978","Latitude":"43.596646","City":"Vaughn","divs":["Sighting DetailsOn the evening of November 20, 2007, my wife and I were travelling from Barrie to Toronto along highway 400 south. It was completely dark outside and the sky was fairly clear. Somewhere south of highway 88 but north of Major Mackenzie, we saw a very large neon greenish glow above and to the west (to the right of our vehicle travelling south). Being close to the airport my first instinct was that this was an airplane. However, the glow was very large, a very brilliant colour of green that we have never seen before (radiant type glow) and it was completely stationary. My wife and I kept driving but remained fixated on this object. We tried to \"figure this out\" but the longer it stayed, the more mysterious it seemed. After about 1 to 2 minutes, the glow suddenly took off like a reverse bolt of lightening or something seen on star trek. My wife and I were literally both completely choked for words and for a few moments could not say a thing - like we were in shock. We looked at each other to confirm that we both saw this and were 100% convinced, unquestionably, that whatever this was, it was not from our planet. There was an incident years ago that we also did not report - unrelated to this one. During March of 2001, my wife and I flew for a 3 day vacation to Las Vegas. While sitting at my window seat well above the clouds (minutes to our destination - presumably somewhere over Nevada), I saw a large black triangular object - it was wedge like and had lights on the vertices. It was seemingly stationary, yet changing slightly in orientation. I spent a few seconds staring at it before nudging my wife to look out my window and see if she saw anything. She said she saw some black triangular object. We were pretty suprised by it and wondered if anyone else was watching. It didn't seem to draw anybody else's attention so I didn't want to alarm anyone or draw attention to myself. Shortly after, the plane dipped into the clouds for landing and we could not see it any more. We didn't tell anyone about it for fear of people thinking we were crazy."],"Date Submitted":"11/20/2007 12:00 UTC","Log Number":"CA-09182008-0035","trends":["There have been no other sightings in Vaughn","This sighting has never been favorited."],"Source":"MUFON","Summary":"Bright neon green stationary in sky, then quick take off."}