{"Country":"United States","divs":["Sighting Details I was standing in my girlfriends back yard finishing a cig,before i got in my car to go to the store, i just bought some oakley sun glasses(pricey i might add, but the vision is great,anyway, in my field of vision about 45% nw about 2 to 3 thousand feet give or take an inch,this object appeared in the sky right in exactly where I was looking, couldnt believe it, thought it was a plane at first,but it wasnt moving, then in a blink it moved, id say about 5 miles and stopped, then it zig zagged straight up and into god knows where, but im hear to tell you i wouldnt be here writing this if i wasnt certain what i saw wasnt anything made by man, i hope their friendly, because somethings here on earth and their not paying any taxes ( little humor keeps me humble) BUT I SWEAR THIS IS THE TRUTH Before i go i guess i need to describe the object so here goes, it kinda looked like a long pyramid or a cone with flat sides, i could see frames or design on the sides, in between the frames it was a white bright shiney metallic look, frames were slant in the oppisite direction then it traveled, I really got a good look at it and I almost had a bow movement when i realized what i had just seen, i dont know if im lucky to see it or cursed, BUT IT JUST PUT A WHOLE NEW TWIST ON THE GOD THEORY IN MY BOOK! TAKE CARE JW"],"Log Number":"US-09182008-0039","trends":["There have been no other sightings in Columbia Mo.","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"38.943004","Case Number":"12618","Date Submitted":"09/17/2008 12:00 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12618.html.txt","/var/www/straped/mufon/org/12618.html"],"Tags":"City","Region":"Missouri","Source":"MUFON","Summary":"i now know why the government keeps ufo\"s a secret, to keep chaos from happening, i had a perfect daylight clear sky sighting, no doubt they exist now, i want one of them little sky boats they fly, they fly like a fish in water, sent chills down my back,","map":"<A HREF = \"http://maps.google.com/maps?q=38.943004,+-92.36162(12618)&iwloc=A&hl=en\"> mufon case (12618) map </A>","Date of the Event":"09/17/2008 12:00 UTC","Weather Factors":"Unknown","Longitude":"-92.36162","Object Shape":"Diamond","City":"Columbia Mo.","Disposition":"Hoax","Sighting Duration":"Undisclosed"}