{"trends":["there have been no other sightings in cms\\jt","This sighting has never been favorited."],"Tags":"City","Weather Factors":"Unknown","Longitude":"-105.776437","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12612.html.txt","/var/www/straped/mufon/org/12612.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.552651,+-105.776437(12612)&iwloc=A&hl=en\"> mufon case (12612) map </A>","Region":"Colorado","Date of the Event":"07/22/1974 08:00 UTC","Log Number":"US-09182008-0033","divs":["Sighting Details On our way home from church one evening we drove up a long canyon road to pick up rocks to line our walkway at home. While we were gathering rocks, my father got my attention and pointed to some lights in the sky overhead and far off to the northeast. There were approximately 10-12 lights in a row moving in formation. Suddenly they disbursed in variegated directions at right angles moving apart at incredible speed. Then they twinkled out and vanished, as quickly as they had appeared. A few minutes later they reappeared in the same formation and repeated the same amazing performance. We continued to watch for the next 45 minutes to an hour as this amazing light show over the Rocky Mountains continued. Finally they lined up in one last formation and accelerated quickly upward at a 45 degree angle from earth, then spreading out and disappearing into the clear night sky. My father was a decorated military pilot from the Korean War and was a flight instructor for the Viet Nam War in both fixed and rotor-wing aircraft. He said that he had never seen anything like that in his experience and did not believe it to be military aircraft. I knew in my heart that it was UFO's although he could never bring himself to say that outright in front of my mother. I have since gotten my pilots license and realize that even as of today, we do not have anything that can fly or hover in a stationary position, then take off at a 90 degree angle at supersonic speed, in absolute silence. We observed these lights at an approximate altitude of 8500', and my father estimated their performance altitude envelope to be between 11,000 and 20,000 feet. They were between 2-8 miles away. My father and I spoke of this event occasionally, but he passed away 2 years ago this summer. I will never ever forget the amazing light show in the clear cool night over the Rocky Mountains!"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"39.552651","Sighting Duration":"Undisclosed","Summary":"Linear lights sighted over the Rocky Mountains.","Viewing Distance":"Over One Mile","Source":"MUFON","Object Features":"Unknown","City":"cms/jt","Country":"United States","Case Number":"12612","Date Submitted":"07/22/1974 08:00 UTC","Object Shape":"Star-like"}