{"Tags":"City","files":["/var/www/straped/mufon/html2text/12627.html.txt","/var/www/straped/mufon/org/12627.html"],"Date of the Event":"09/18/2008 06:28 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.639099,+-112.395758(12627)&iwloc=A&hl=en\"> mufon case (12627) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around September 18th 2008"],"Summary":"UFO OVER SURPRISE, AZ","Region":"Arizona","Object Flight Path":"Path with directional change","Disposition":"Unknown","Object Features":"Unknown","divs":["sighting detailsmy husband was driving us home, with me in the passenger side, and our son in the back seat. we were traveling west on bell road in surprise; when i noticed \"something\" flying. i am always looking for the luke afb jets and anything else buzzing around. i kept looking at the object trying to determine if it was a local jet from nearby luke afb, a loose helium balloon, bird, or commercial airliner. the object was black and circular moving at a steady incline in the sky below the cloud level of the atmosphere. after a few seconds, i asked my husband and son to look and see if they were seeing the same thing i was seeing; and we all determined that it was indeed our first ufo sighting. the trajectory of the object, the speed, no strobe lighting . . . we ruled out all logical explanations and concluded it was\\is a ufo. being in the middle of traffic, my husband was unable to pull over for us to keep watching; and as we drove near a building which blocked our view, it vanished from our sight. we were totally excited that we saw this. it just moved too fast and too far for us to truly get a good observation. sorry, no photos. caught me off-guard and it was moving too fast to try and focus with a camera. i hope someone else saw this too."],"Country":"United States","Log Number":"US-09182008-0048","Object Shape":"Sphere","Date Submitted":"09/18/2008 06:28 UTC","Viewing Distance":"Unknown","Longitude":"-112.395758","City":"Surprise","Latitude":"33.639099","Case Number":"12627"}