{"Weather Factors":"None","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/12622.html.txt","/var/www/straped/mufon/org/12622.html"],"Longitude":"-81.22232","Viewing Distance":"Over One Mile","Case Number":"12622","City":"Bluefield","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Date Submitted":"04/15/1974 07:45 UTC","divs":["Sighting Details WAS IN THE BACK YARD AT NIGHT A SPOTTED A BRIGHT LIGHT,IT LOOKED TO BRIGHT FOR A STAR. I WAS AT THE FOOT OF EAST RIVER MOUNTAIN LOOKING TOWARDS THE MOUNTAIN TOP, VIRGINIA BEING ON THE OTHER SIDE. THE LIGHT WAS MOTIONLESS THEN MOVED A BIT IN RANDOM DIRECTIONS MAYBE WHAT LOOKED TO BE 4 OR 5 MILES THIS WAY AND THAT. I WENT INSIDE AND CALLED MY FATHER AND MOTHER AND ONE OF MU=Y BROTHERS CAME OUT ALSO AND WE WATCHED THE LIGHT FOR ABOUT 20 MINUTES. IT MADE NO SOUND AT ALL, NO BLINKING,NOTHING BUT A MOVING BRIGHT LIGHT. ALL THIS WAS VERY ODD AND EVEN MY DAD SAID IT LOOKED UNUSUAL. WHILE STILL LOOKING WE THEN SAW SEVERAL ( ABOUT 5 )SMALLER LIGHTS SEEM TO COME FROM THE LARGE LIGHT AND MOVE IN DIFFERENT DIRECTIONS AROUND THE SKY. ONE OR MORE WENT OVER THE MOUNTAIN TOP AND BACK IN A FEW MINUTES AND THE OTHERS WENT TO THE RIGHT AND LEFT. IT WAS SUCH A WILD THING TO SEE AND HAD NO EXPLANATION, WE TALKED MY FATHER INTO CALLING THE NEWSPAPER AND THEY SENT A FEMALE REPORTER OUT TO OUR HOME. SHE ARRIVED IN ABOUT 30 TO 40 MINUTES. SHE TOOK PHOTOS I REMEMBER WITH A NICE CAMERA BUT AS I GREW UP AND BECAME AN AMATEUR ASTRONOMER,I REALIZED SHE IN NO WAY COULD HAVE AQUIRED A REASONABLE PHOTO WITH SUCH EQUIPMENT. THE LIGHTS COLLECTED BACK TO THE LARGER LIGHT AND WENT OVER THE MOUNTAIN TOP. BY THIS TIME THE REPORTER HAD LEFT, SHE WAS JUST AS CONFUSED AS WE WERE. THE NEXT MOURNING WE ALL SET AROUND THE BREAKFAST TABLE TALKING ABOUT WHAT WE HAD SEEN AND HOW WILD A NIGHT IT WAS. THIS WAS REALLY A NIGHT I THOUGH. BUT WHAT HAPPENED NEXT WAS SORT OF A SCARE. WHEN MY FATHER GOT HOME FROM WORK HE COULD NOT WAIT TO TELL US WHAT HE HAD HEARD AT WORK. HE SAID A COUPLE OF GUYS HE WORKS WITH HAD BEEN ON THEIR WAY HOME OVER THE MOUNTAIN ON A COUNTRY ROAD ON THE VIRGINIA SIDE.iT WAS DARK AND IT IS A 2 LANE COUNTRY ROAD BUT THERE WERE CARS BACKED UP BECAUSE THEY TOLD MY FATHER THERE WAS A LARGE BRIGHT LIGHT THAT HAD BLOCKED THE ROAD. DAD TOLD US THEY SAID IT WAS SO BRIGHT THEY COULD NOT MAKE OUT A CLEAR SHAPE, JUST THAT IT WAS LIKE DOZENS OF HIGH BEAM LIGHT WERE AIMED AT YOU. THEY TOLD HIM IT MADE NO NOISE, IT STAYED FOR A FEW MINUTES LONGER AFTER THEY GOT THERE AND THEN JUST WENT STRAIGHT UP AND GONE OUT OF SIGHT. WOW, IS ALL I COULD SAY, AND IT JUST CONFIRMED WHAT WE HAD ALL THOUGHT THE NIGHT BEFORE ( A REAL UFO) TO THIS DAY I WILL SWEAR TO ANYONE THAT I SAW A REAL UFO, AND NO BODY CAN EXPLANE IT AWAY TO ME OR MY FAMILY. I,VE HAD AS BIG AS AN 11 inch CELESTRON TELESCOPE, USED IT, TAKEN PHOTOS WITH IT, SEEN THE HEAVENS, STARS, PLANETS ,SATELITES AND MORE. i KNOW WHAT A PLANE AND A HELICOPTER LOOK LIKE AND SOUND LIKE AND I CAN JUDGE DISTANCE WELL. THIS WAS A UFO TO ME, AND I WILL DIE BELEIVING SO."],"Date of the Event":"04/15/1974 07:45 UTC","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.26984,+-81.22232(12622)&iwloc=A&hl=en\"> mufon case (12622) map </A>","Country":"United States","Log Number":"US-09182008-0043","Summary":"LARGE LIGHT MOTIONLESS, 5 SMALLER LIGHTS COMING OUT","Source":"MUFON","Disposition":"Insufficient Data","Latitude":"37.26984","trends":["There has been one other sighting in Bluefield","There were no other sightings in Bluefield on or around April 15th 1974"],"Sighting Duration":"Undisclosed","Region":"West Virginia"}