{"Object Features":"Undisclosed","Region":"Minnesota","Longitude":"-93.259376","Object Flight Path":"Stationary","Latitude":"44.988335","divs":["sighting detailson a partly cloudy afternoon during the onset of rush-hour traffic me and a coworker named steve, were heading westbound on highway 62 at 4:34 pm on june 26th, 2006. a coworker named steve as the passenger, pointed towards the sky and said \"it looks like a plane is on fire!\" i glanced up and saw a small dark grey cloud formation, suspended along the east side of a metallic object, which seemed to be about even with the existing scattered cloud line. we both assumed it to be a very large plane, located about 20 or so miles due west in line and directly above the highway. in fact, there were no flames nor billowing smoke present, just the cloud of about one third the size of the craft of what appeared to be water vapor or dark condensation, but certainly not smoke from a fire. i reasoned that the \"plane\" was not on fire because it lacked these. as i looked again at the object to determine what direction it was heading, i realized that it was not moving in any direction,only hovering. it then occured to us that there were no wings, tail, windows, seams, lettering or landing gear. i can simply describe it as a highly mirror-like polished metal object\\craft,; shaped like a cigar\\capsule; about 4 times larger than a 757 jumbo jet; that which reflected the sun unlike any airplane we have ever seen. as we continued heading west on 62, we noticed an additional cloud of water vapor? suddenly appear adjacent to the existing water vapor formation, hindering a portion of the view. at this moment in time the shape and reflection of the object\\craft was not as distinct and seemed to be fading or transforming as though you could begin to see through it. we were now at our intended exit glancing up at the object while exiting and noticed that it suddenly vanished without a trace, except for the mysterious vaopr formations. we were both baffled and curious as to what it was and where it originated from. we are aware that there is a national guard airport on the south side of the highway as well as the minneapolis international airport, just west of the national guard. as of now, we are dumbfounded as to what to do with this information. hesitate to speak of it and have to believe that there is either a military related source that is aware of this or that we have actually witnessed a ufo or a perhaps a high tech hologram."],"Summary":"Large Stationary Capsule/Cigar Shaped Metalic Object at Cloud Height","Weather Factors":"Does Not Apply","Country":"United States","Disposition":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around June 26th 2006"],"Tags":"City","files":["/var/www/straped/mufon/html2text/12628.html.txt","/var/www/straped/mufon/org/12628.html"],"Log Number":"US-09182008-0049","City":"Minneapolis","Sighting Duration":"Undisclosed","Date of the Event":"06/26/2006 04:36 UTC","Date Submitted":"06/26/2006 04:36 UTC","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=44.988335,+-93.259376(12628)&iwloc=A&hl=en\"> mufon case (12628) map </A>","Case Number":"12628","Source":"MUFON"}