{"Date of the Event":"09/18/2008 08:10 UTC","divs":["Sighting DetailsI was driving down a darkly light roadway with my daughter in the car when I noticed in front of me what I thought was two planes that were passing extremely close. I slowed my car to a crawl to make sure of what I was seeing. The plane which was coming from the left side passed just below the other craft. What was different about this other \"craft\" was that it was not moving as the plane passed below it and in comparasion the lights were much brighter and the overall size was much bigger larger. It was circle shape (although I could not see an actual outline) with four very bright lights (lights were red and white(tinged with blue)). I could not believe what I was seeing and thought it had to be a plane, but it still was not moving. I asked my daughter if she was seeing this, but she said no and was starting to panic. I look away and then it was to my left, still just siting in the sky, but this time it was a thick cylindar shape of bright white lights. Up the road, I pulled over in a parking lot to get a steady look. I could not see the object, but I could see that there were planes in the sky and you could definitely see their outline. I say this because the \"craft\" I saw you could not see an outline, just very large bright lights. The sky was very clear and there were lots of stars in the sky and there was no mistaken how much larger this \"craft\" was to everything else in the sky. As I was driving (another 10 minutes or so away from this area), I was still looking into the sky toward the general direction of the first location because I thought I could not have seen what I just saw, there had to be an explanation. I could clearly see stars and planes. I then again saw sitting in the sky (in the first general location), what appeared to be the same object (thick cylindar shape of bright white lights). I am still completely baffled by what I saw, but I have never seen anything like it. Did anyone else see this??"],"trends":["there have been no other sightings in holbrook \\ braintree","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.202044,+-71.014118(12639)&iwloc=A&hl=en\"> mufon case (12639) map </A>","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Latitude":"42.202044","Disposition":"IFO","Case Number":"12639","Object Flight Path":"Stationary,Other","City":"Holbrook / Braintree","Log Number":"US-09192008-0005","Longitude":"-71.014118","Summary":"Large cirle of 4 very bright lights","Region":"Massachusetts","Object Shape":"Circle, Cylinder","Tags":"City","Weather Factors":"None","Object Features":"None","files":["/var/www/straped/mufon/html2text/12639.html.txt","/var/www/straped/mufon/org/12639.html"],"Date Submitted":"09/18/2008 08:10 UTC","Sighting Duration":"Undisclosed"}