{"Date Submitted":"09/18/2008 09:20 UTC","Date of the Event":"09/18/2008 09:20 UTC","divs":["Sighting DetailsI was sitting in the backyard having a cigarette, looking around and noticed 2 cherry red blinking lights in the sky. At first I thought it was a plane, but they did not blink like the planes do, and they had a distinct distance between the lights. They were flying fast without sound and then disappeared. My mom came outside and I told her about the red lights. She thought it was an airplane then the lights reappeared but there were a couple more this time. They were traveling the same flight path the first set of lights were on. My mom saw the lights and said those don't look like airplane lights. A couple minutes after that 2 fighter jets took off from the Fresno Airport, then a 3rd fighter jet. We heard the noise from the jets. The jets flew in the same flight path the red lights were on. I have not seen anything like this before. The lights seemed to stay the exact distance from eachother then after a about 60 seconds they just vanished. They were very bright lights, but there was not other color light flashing like airplanes have. What made me notice the object was that it was flashing so brightly it caught my attention against the dark sky, it was very fast and there was no sound. The lights took turns flashing. One corner flashed, then as soon as the flash stopped the other corner flashed, then it went dark. Then the pattern repeated itself. The object was going straight for the most part, then it vanished. When it reappeared it was as if it went back to where it started and did the same pattern again, only I never saw it circle back to the beginning so I don't know how it got back there. When the fighter jets took off and followed the same flight pattern I knew something was up. I wanted to take pictures but I didn't want to miss anything. Since this summer this is my 3rd sighting of strange things in the sky. I was excited because I believe we are not the only ones in this huge universe."],"City":"Clovis","Latitude":"36.833128","files":["/var/www/straped/mufon/html2text/12648.html.txt","/var/www/straped/mufon/org/12648.html"],"Summary":"Cherry red lights flashing alternately in sky followed by fighter jets","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.833128,+-119.701779(12648)&iwloc=A&hl=en\"> mufon case (12648) map </A>","Viewing Distance":"Unknown","Log Number":"US-09192008-0014","Sighting Duration":"Undisclosed","Disposition":"Unknown","Case Number":"12648","trends":["There have been 20 other sightings in Clovis","There were no other sightings in Clovis on or around September 18th 2008"],"Tags":"City","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Object Shape":"Circle","Region":"California","Longitude":"-119.701779","Object Flight Path":"Undisclosed"}