{"Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"09/17/2008 11:05 UTC","files":["/var/www/straped/mufon/html2text/12641.html.txt","/var/www/straped/mufon/more/12641_submitter_file1__C.Hammond12641.jpg","/var/www/straped/mufon/org/12641.html"],"Case Number":"12641","Latitude":"39.963386","Date of the Event":"09/17/2008 11:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.963386,+-82.996734(12641)&iwloc=A&hl=en\"> mufon case (12641) map </A>","Object Shape":"Triangle","Weather Factors":"None","Viewing Distance":"101-500 Feet","Summary":"flew over, my wife saw it too, white lites underneath, no flashing airline lites, red or blue","Object Features":"None","Disposition":"Unknown","Tags":"City","City":"Columbus","Source":"MUFON","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around September 17th 2008","This sighting has never been favorited.",""],"divs":["Sighting Detailssolid triangular object, it had white lights underneath. Around 11pm EST Wednesday night I walked out onto our back deck with the dog. I looked up to see the stars when I noticed the object. It was almost directly overhead. I always keep binoculars on the table because I look at the sky alot at night, I keep late hours and theres not a lot to do, my wife and son go to bed around 10:30 to 11:00pm every night. So I grab my binoculars and look at the object. I couldn't believe my eyes so I yelled real loud for my wife to come see. We both saw it through the binoculars, it was definately a solid triangle,maybe the size of a football field or more and it had white lights underneath. There was no sound and it was moving rather slowly, definately not a plane or jet! It made no quick movements and did look like it hoovered for a minute or two. We live relatively close to Port Columbus International and we both know what planes, jets and helicopters look like. Also Rickenbacker is at the south end of Columbus and we've seen their planes before as well. The sighting lasted about 10 maybe 15 minutes before we could no longer see it. I tried to call someone. I even called a number I found in my UFO Universe magazine but was an incorrect number."],"Region":"Ohio","Longitude":"-82.996734","Log Number":"US-09192008-0007","Object Flight Path":"Straight-line path"}