{"Object Features":"Unknown","Source":"MUFON","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around September 19th 2008"],"divs":["Sighting DetailsI had just turned on HWY 40 from HWY 95 and was driving west with cruise control set at 75 mph. I had not taken off my sunglasses yet and noticed large dark areas on both sides of the highway. I thought at first there had been fires overnite but did not smell any smoke. I took off my sunglasses and found the dark patches were huge shade spots in the desert, not from desert fires at all. There were only minimal small bands of cumulus clouds in the sky, not enough cloud cover to create the large shade spots at all. The shade covered all elevations of terrain. I called my husband on the cell phone to tell him about the shade spots and at one point told him I was driving parallel to one of the shade spots. I counted for fifteen seconds to measure the distance of length of the shade cover. I calculate at 75 mph, 15 seconds is approximately 1290 feet. There were at least 4 shade spots on the north side of the highway and 2 shade spots on the south side of the highway. I could not discern any specific shape since the areas were so large. I lost cellphone coverage and hung up. At this point I was close to the Golden Shores exit and could no longer see the shade spots since I was between cliffs obstructing my view."],"Viewing Distance":"Unknown","Country":"United States","City":"Lake Havasu City","Region":"Arizona","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.490451,+-114.314235(12643)&iwloc=A&hl=en\"> mufon case (12643) map </A>","Latitude":"34.490451","Sighting Duration":"Undisclosed","Longitude":"-114.314235","Object Flight Path":"Stationary","Log Number":"US-09192008-0009","files":["/var/www/straped/mufon/html2text/12643.html.txt","/var/www/straped/mufon/org/12643.html"],"Weather Factors":"None","Tags":"City","Date of the Event":"09/19/2008 07:55 UTC","Case Number":"12643","Disposition":"Unknown","Date Submitted":"09/19/2008 07:55 UTC","Summary":"massive shade spots with minimal clouds in the sky"}