{"Country":"United Kingdom","Object Shape":"Circle, Oval","Weather Factors":"Unknown","Latitude":"54.986392","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around April 17th 1997"],"Region":"England","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/12654.html.txt","/var/www/straped/mufon/org/12654.html"],"City":"Newcastle Upon Tyne","Case Number":"12654","Log Number":"AU-09192008-0020","Object Features":"Undisclosed","Longitude":"-1.61432","Disposition":"Unresolved","Source":"MUFON","Date Submitted":"04/17/1997 05:30 UTC","Date of the Event":"04/17/1997 05:30 UTC","divs":["Sighting DetailsWell it was a sunny evening I don't remember what day it was but myself, my nephew & a friend of ours were doing some rallying through the bush at a place called Kitchener outside a town called Cessnock. After doing some rallying we decided to go to a small lookout called ASHLEYS TOWER we drove up to the top & when we got there we pulled up & turned the engine off. I was sitting in the front with my friend who was driving & my nephew was in the back in the middle of the seat so we all had a clear few. When we stopped we were all in the car at this time. I looked out the windscreen in the direction of the small town named Kitchener that's when i sore about 6 or more dark round objects either flying or hovering I said to the others look look out there what are they they replied we don't know at this point we got out of the car & stood in or of these objects we watched them for a while when one of the oval objects started coming our way we pinched each other to see if we were dreaming we were not. As we stood there with our mouth's open in amazement this object was getting closer it didn't fly at us or Harris us from were we were standing there was a mountain about 1000 yards away at the bottom of the mountain was a white farm house with a dirt road that runs past it anyway this object was traveling i would say about 5 to 10 kilo meters an hour ( it was going slow ) so we all got a great look at it. It was oval in shape with what looked like steel pipe work on the out side i would say it was as big as a house if not bigger there were no lights on it or on at all no windows that we could see it was dark in colour & the sound it made i have never heard before. it slowly flew past us in between us & the mountain & slowly flew out of sight. I can tell you this it was not a helicopter or a plane or anything we've ever see before. I know this because i was born in 1960 & from when i first heard or seen ufos on TV i have been following & taking a keen interest in U F O's right when i heard about area 51 & the one that was stuck in the mud that was to deep to get out. And what about the one's that are in the sky at night they are moving very slow with flashing red,green,amber lights i see them just about every night there are about 4 to 6 in the night sky. I even bought a reflector telescope so i could see them better but that was no good they are a lot farther away than they look anyway i wish i had a more powerful telescope. Anyway could you send me some up todate pic's or some thing to read please Thank you. Im sorry i don't have any photo's or drawings."],"Summary":"Small round objects flying over a small town & one flew past us.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=54.986392,+-1.61432(12654)&iwloc=A&hl=en\"> mufon case (12654) map </A>"}