{"Viewing Distance":"Unknown","divs":["Sighting DetailsBelow is my story as an email to a friend that informed me about this site. I was behind Clack Middle School off of Corsicana Street in Abilene, Texas (1800 hrs CST) playing catch with my youngest daughter, coaching her. There was a small on prop plane flying overhead with an ad banner behind it informing onlookers about the new Hastings (bookstore) that opened where the closed Albertsons (grocery store) was off of 14th. Then I noticed four dots in the air (1816 hrs CST), I though to myself that the plane must be dropping fliers and thought how stupid it was to drop fliers in an area that has a lot of open land and land full of tress and high grass... then I noticed that these four dots were not descending rather they were gaining altitude. Then four turned into five... five into six... so I thought I would call you (Hector) to let you know what I saw and to see if you could see what I saw... before the phone was answered, six was 12.... 12 turned into 13... surely these ARE NOT weather balloons. Fine I can believe four weather balloons in the same area, it's a stretch that I could still believe... four weather balloons multiplying into 13? I refuse to believe that... when I started talking to you, you asked me if I happened to have a camera on me, I told you only my camera phone... then I remember that I keep my digital camera in my laptop backpack and that I always carry my laptop where ever I go... I ran to the car and started snapping pictures like crazy... I even took some footage too... My last count of these objects was 22, then it became to difficult to keep track and count, I would guess that they replicated, duplicated, multiplied (whatever you want to use) up to possibly 50. All the while gaining altitude and moving Westward, I was looking at them to the North and had my head cranked up to about 80 degrees angle. Here's the only picture that shows what I saw, unfortunately it's a little blurry. I'M TRIPPED OUT!!!!"],"Log Number":"US-09192008-0022","Country":"United States","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around September 19th 2008","This sighting has never been favorited.",""],"Tags":"City","City":"Abilene","Source":"MUFON","Disposition":"Unknown","Region":"Texas","Object Flight Path":"Other","Weather Factors":"None","Longitude":"-99.725544","Date of the Event":"09/19/2008 06:15 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12656.html.txt","/var/www/straped/mufon/more/12656_submitter_file1__HPIM0689.JPG","/var/www/straped/mufon/org/12656.html"],"Object Features":"Unknown","Date Submitted":"09/19/2008 06:15 UTC","Latitude":"32.457386","Summary":"Started as four dots, slivery or shinny or emitting light mutilplied to 22 and beyond","Case Number":"12656","map":"<A HREF = \"http://maps.google.com/maps?q=32.457386,+-99.725544(12656)&iwloc=A&hl=en\"> mufon case (12656) map </A>"}