{"Source":"MUFON","Region":"Texas","Log Number":"US-09192008-0024","Latitude":"29.433922","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date of the Event":"09/19/2008 08:40 UTC","divs":["Sighting DetailsI am a smoker but never smoke indoors and am outside frequently in the backyard. I was outside looking up at the stars (or lack of from being downtown San Antonio and having a heavy haze tonight in addition to light pollution) and I noticed a star object that was traversing the sky. I was standing looking northeast which is the direction the object was heading. I did notsee any other objects in the sky at this time and presumed I was looking at a satelite or space station (I don't know if the space station is over Texas tonight). Being that most of the stars are not visible tonight from the haze, I was surprised that I could see a satelite. As I watched the object dissapear behind neighbors tree I then saw approximately 15-30 seconds later a similiar object, star like in appearance, high in the sky, etc., coming from the north heading south-southeast. There was also a jet in the sky which at first I thought was following the object but the paths diverged and the jet stayed on a course heading south-southwest. The jet did give me a perspective of height and brightness, and so I am safe to speculate that both objects where much higher than commercial jets. Again I watched this object dissapear behind trees and wasunable to watch it any further. Each object was in view for about a minute, traversing the night sky in this time. The speed was steady and the brightness did not seem to vary beyond what you would expect from atmosperhic distortion. Since each object was similiar in size and brightness, but at completely intersecting flight paths it is hard to image that satelites are that close to knocking into eachother as well as being on such different courses. I was not paniced nor excited, mostly curious and observant of what I was seeing."],"Summary":"Two high altitude objects crisscrossing sky","Longitude":"-98.485758","City":"San Antonio","Viewing Distance":"Unknown","Country":"United States","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/12658.html.txt","/var/www/straped/mufon/org/12658.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.433922,+-98.485758(12658)&iwloc=A&hl=en\"> mufon case (12658) map </A>","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around September 19th 2008"],"Date Submitted":"09/19/2008 08:40 UTC","Tags":"City","Case Number":"12658","Object Shape":"Star-like"}