{"Region":"Pennsylvania","Viewing Distance":"Unknown","Latitude":"40.107762","Object Shape":"Circle, Flash, Triangle","Log Number":"US-09192008-0016","Object Features":"Undisclosed","Sighting Duration":"00:00:03","divs":["Sighting DetailsToday I was reading a news paper from Sept. 16 on a story about Discovery Channel coming to Bucks because of about 45 recent UFO reports. I knew NOTHING about that, but it triggered my memory. On Aug. 11 at about 11pm I went out on my front step to have a cigarette. I was really nervous because my husband had to be in court the next morning trying to get custody of his son. So I was out there praying all would go well. I am a star gazer so I'm usually looking at the sky. All the sudden I see this incredibly bright flash in a circle shape and a bright yellow color which immediately turned into a sort of trail of bright yellow in a triagular shape then disappered. It didn't fade, it just vanished. I looked around to see if any neighbors were out, which there were none. I was like \"what the \"f\" was that?\" I never considered it to be a UFO only because it was August and there are meteor showers in August. But I'm a star gazer and have seen countless numbers of showers and \"shooting stars\", even a comet. I had NEVER seen anything like this. It was so intense. In fact for days after that I kept telling everyone about the crazy shooting star I had seen. I can't say what it was, but reading the article I thought I would report it because to me if was definately something \"unidentified.\""],"Case Number":"12650","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around August 11th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.107762,+-74.922768(12650)&iwloc=A&hl=en\"> mufon case (12650) map </A>","Disposition":"Insufficient Data","Source":"MUFON","City":"Bensalem","Longitude":"-74.922768","Summary":"The recent reports in Bucks County, PA","files":["/var/www/straped/mufon/html2text/12650.html.txt","/var/www/straped/mufon/org/12650.html"],"Date Submitted":"08/11/2008 11:00 UTC","Tags":"City","Weather Factors":"Unknown","Country":"United States","Date of the Event":"08/11/2008 11:00 UTC","Object Flight Path":"Undisclosed"}