{"Latitude":"27.446706","map":"<A HREF = \"http://maps.google.com/maps?q=27.446706,+-80.325606(12659)&iwloc=A&hl=en\"> mufon case (12659) map </A>","Disposition":"Hoax","Summary":"Black soundless triangle with 6 white lights that seemed to dim and grow bright separately at different paces flying at slow speed then suddenly made a sharp right turn and flew faster than any plane or aircraft I have ever seen.","Case Number":"12659","Object Shape":"Triangle","Date of the Event":"09/19/2008 09:35 UTC","Viewing Distance":"101-500 Feet","Tags":"City","Weather Factors":"Unknown","Log Number":"US-09192008-0025","Object Features":"None","Sighting Duration":"00:05:00","trends":["There have been 6 other sightings in Fort Pierce","There were no other sightings in Fort Pierce on or around September 19th 2008"],"divs":["Sighting DetailsI was in Wal-mart DC parking lot getting into my car. I felt suddenly heavy almost like I was paralyzed. I noticed a black slow low flying triangle almost directly above my head (I have a sun-roof). The object had six white lights and all of them dimmed or grew bright at different times and speeds and not in any order. At the time my car was not turned on and I had no music playing also my windows were open. The object seemed to hover and not move for approx. 3-4 minutes. It made absolutely no sound and I did not hear any engine or whirring noise as those from airplanes or helicopters etc. I watched it and was tempted to leave but felt like it would see me and for some reason felt very scared and alone at that moment. It suddenly made a sharp right turn without moving forward and flew off in front of me until I couldn't see it anymore. It moved very fast almost like it was trying to get away from something. I waited in the parking lot approx 2 mins. to try and gather my thoughts when I saw a police or ambulance helicopter flying in the same direction as which the object had gone. Perhaps they may have also seen it? Note: I did not use my cell phne it didn't seem to be working it was turned on but seemed to be powered off. I messed with my phone afterwards and hit a button and it lit right up."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Longitude":"-80.325606","City":"Fort Pierce","Country":"United States","Region":"Florida","files":["/var/www/straped/mufon/html2text/12659.html.txt","/var/www/straped/mufon/org/12659.html"],"Date Submitted":"09/19/2008 09:35 UTC"}