{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date of the Event":"03/13/1997 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.456546,+-112.356694(12666)&iwloc=A&hl=en\"> mufon case (12666) map </A>","trends":["There have been 8 other sightings in Goodyear","There were no other sightings in Goodyear on or around March 13th 1997"],"Tags":"City","Country":"United States","Object Shape":"Circle","Case Number":"12666","Region":"Arizona","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Latitude":"33.456546","Source":"MUFON","Log Number":"US-09202008-0006","City":"Goodyear","Date Submitted":"03/13/1997 08:30 UTC","files":["/var/www/straped/mufon/html2text/12666.html.txt","/var/www/straped/mufon/org/12666.html"],"Longitude":"-112.356694","Summary":"It was large and round","divs":["Sighting DetailsI was in High School at the time and I was with a friend out in Goodyear to teach pop warner cheerleading. At that same time there were several pop warner football and cheer squads on the field practicing. It was strange because there was an empty field right next to us, and out of no where there were a bunch of lights. We noticed them, but They looked like street lights, except you couldn't see any poles holding them up. No one payed attention to it really until it started moving towards us. It finally made it to us, but I couldn't see what it looked like because it was so dark. It just looked like a black object, but almost like the color of the night sky, like it blended in or something. The UFO must have been 500 feet or more from one side to the other. I remember everyone looking up because it was so close to us. No one said anything, just looked. Then I don't remember much except all of the sudden it had moved away into the distance. As it moved slowly, it all the sudden disappeared. After that everyone just went back to what they were doing like nothing had happened. I know it's late to report this sighting, but I saw your website on a report on yahoo. I have always wanted to report my sighting because it was so strange. No one believes me. I know that there were many sightings that night, and I don't know if anyone reported this one, but I just did. I think it was a very close sighting. It couldn't have been more than 100 feet above our heads. It made no sound. The next day they were saying that all the lights over Phoenix were lights from Luke Airforce base, that they were testing some new airplanes. I don't believe it because I was there and saw it. I don't believe we have enough technology yet to create what I saw."],"Weather Factors":"Unknown","Object Features":"None","Sighting Duration":"00:20:00"}