{"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-09202008-0002","Country":"United States","Summary":"Mystery Balls of Lights in western sky of White Mountains,NH","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/12662.html.txt","/var/www/straped/mufon/org/12662.html"],"Weather Factors":"None","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.25812,+-71.441189(12662)&iwloc=A&hl=en\"> mufon case (12662) map </A>","trends":["There have been 2 other sightings in Carroll","There was one other sighting in Carroll on or around September 18th 2008"],"Case Number":"12662","Date of the Event":"09/18/2008 07:54 UTC","Region":"New Hampshire","Date Submitted":"09/18/2008 07:54 UTC","Object Flight Path":"Straight-line path","Object Features":"None","Source":"MUFON","Longitude":"-71.441189","divs":["sighting detailsdistance was hard to tell if these bals of lights where in earths atmosphere or light years away. i am assuming near the atmosphere. there was a series of lights in short event. weather was extremely clear, 1st fall like autum evening crisp and clear with no wind. ball of gold \\ copper light with glow sphere around it about the size of a dime if you held the dime up to the sky by hand. ball of light fade out and back on with in 1-2 seconds and moving in sequence to the left and diagnol down. movements to the left every 1-2 seconds, fade on\\off all time. the 5th time i seen it go on it was behind a tree line on a moumtain top but i can still make out the glow beyond in the sticks. rapidly another ball of light appread far off to the right of wear the 1st ball started. then it multiplied 1x,3x,5x from it's center to both left and right each time on\\off until all 5 balls of light vanished like someone turned off a switch. in the background of space i also noticied tiny rapidly moving stobes 2 or 3 moving like bees in the sky. just seemed like these objects could have been launching these lights in a sequence. others in the local seen them also from nearby towns."],"Latitude":"44.25812","City":"Carroll","Object Shape":"Fireball, Flash, Oval"}