{"Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like, Other","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Latitude":"32.724523","map":"<A HREF = \"http://maps.google.com/maps?q=32.724523,+-102.64113(12667)&iwloc=A&hl=en\"> mufon case (12667) map </A>","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"09/19/2008 08:33 UTC","Summary":"came out of s.w. to n.e. low altitude. very bright white light .object appeared silver in color observed through bi-noculars","divs":["Sighting DetailsI was sitting on our deck 8:30 in evening. Had bi-noculars with me, I like to look at stars and I heard a small plane, stood up look to southwest at plane landing at airport about 1m to 1.5miles away.Now I'm looking at plane through bi-nocs as it turned you could see its blinking lights red & white running lights. I used to work at that airport refueling planes ect.. anyway behind the plane came a super bright white light out of the southwest heading straight over my house. It was low altitude a little higher than the small plane. Thought it was another plane but no blinking lights. I was looking at it with bi-nocs it was spherical silvery shimmered no sound traveled northeast .As it went over head it appeared to slow a little then resume speed. Then I marked time because this was not a plane. I was alone at the time but when my son came home from football game. I told him I seen a u.f.o. and he said I qoute ...thats funny because during the game some people yelled look at that u.f.o... So I wasn't alone!! anyway the object continued its same path until it went out of sight.."],"Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Seminole","There were no other sightings in Seminole on or around September 19th 2008"],"Case Number":"12667","files":["/var/www/straped/mufon/html2text/12667.html.txt","/var/www/straped/mufon/org/12667.html"],"Country":"United States","Longitude":"-102.64113","Disposition":"Unknown","Log Number":"US-09202008-0007","Date Submitted":"09/19/2008 08:33 UTC","Region":"Texas","City":"Seminole"}