{"Longitude":"-93.621152","Tags":"City","Source":"MUFON","Date Submitted":"09/19/2008 10:30 UTC","Viewing Distance":"Unknown","Date of the Event":"09/19/2008 10:30 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","Region":"Iowa","Log Number":"US-09202008-0001","divs":["Sighting DetailsAround 10:30 PM my husband called from his brother's house in a town about 10 miles away and said that he thinks he sees a UFO in the sky about 30 degrees up in the northeastern part of the sky about 20 degrees left of the moon. I go out on our apartment deck that faces directly north and I see what looks like a plane. While watching it, it pulses different colored lights. To the nake eye it is blue, red and white. I decide to try and look at it through my telescope. The object is tracking straight up from its location so in order to keep it in the view finder I just have to move the scope up every 5 mins or so. Through the telescope I see rotating rainbow lights. It is not a plane. Through scope I can't see the outline of the object, however there are rotating flashing lights that are moving in a clockwise circular direction. I can tell that it is rotating because the flashing lights are all of the colors of the rainbow and they are moving from top to the right side to the bottom and then back up. The lights seem to be rotating at a fairly fast speed, completing a cycle in about 3 seconds. The object continues to move upward in the sky and right now it is 12:18 and it is still visable. It has move to about 45 degrees in the sky."],"Case Number":"12661","trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around September 19th 2008"],"Disposition":"Unknown","City":"Ames","Object Features":"Unknown","Latitude":"42.02849","files":["/var/www/straped/mufon/html2text/12661.html.txt","/var/www/straped/mufon/org/12661.html"],"Country":"United States","Object Flight Path":"Straight-line path","Summary":"Object in the North East part of the sky that rotates color flashes in all colors of the rainbow in a clockwise rotation. Lasting several hours moving upward in the sky toward.","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.02849,+-93.621152(12661)&iwloc=A&hl=en\"> mufon case (12661) map </A>"}