{"Date of the Event":"03/12/1988 12:00 UTC","Log Number":"US-09202008-0019","Object Flight Path":"Undisclosed","Longitude":"-121.797973","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.691763,+-121.797973(12679)&iwloc=A&hl=en\"> mufon case (12679) map </A>","Weather Factors":"Unknown","Date Submitted":"03/12/1988 12:00 UTC","trends":["There have been 5 other sightings in Marina","There were no other sightings in Marina on or around March 12th 1988"],"City":"Marina","files":["/var/www/straped/mufon/html2text/12679.html.txt","/var/www/straped/mufon/org/12679.html"],"Object Features":"Undisclosed","divs":["Sighting DetailsMy first husband was in the Army and we were living on post at Ft. Ord, California on Rd. with our three children. I was in my bed and saw 3 greys gliding in at the foot of my bed. I sat up and shut my eyes thinking when I opened them, the aliens would be gone because I must have been seeing things. I opened my eyes and they were still there and they looked like a sick light grey-green color, like they were made of powdered donuts that went bad, a cross between a Lion and a Praying Mantis. At some time I went into the bathroom and saw lights shining in the hall. I have trouble remembering or even making sense of things. I didn't care. I ran out of the house yelling something like \"Spacemen, Martians, Aliens...UFO's did anybody see them?! I think some neighbors came out and I only heard one slightly negative comment like \"Quit drinking\" and I went out in the street (I lived on the corner) to see if there was anything in the sky. It was dusky-dark. A car drove up and a young lady told me they were the greys, that she and her husband had seen them and what did they look like to me. \"E.T.'s parents.\" I used to think my children were okay, that they had slept through it, but one of my daughter's had nose bleeds growing up and one developed asthma and my son had an interesting reaction. I have developmental dryspaxia and he was slow in learning to talk. He kept saying \"A man!\" Wondering if he had seen them, I went into the toy room, and picked up a Rambo doll \"A man like this?\" He shook his head no. Then reluctantly I picked up the little E.T. figure \"A man like this?\" He shook his head yes and I felt flushed. It would take me some time to remember the young lady who came by my house. She was the same girl that was on the other baking pan. I had nightmares about it for years. One memory I have is of seeing someone hold up what looked like a small strip of bacon fat that must have been taken from me because I was laying on a table. I have marks on the sides of my knees and ankles that are faint except when I am in the bathtub. The following year I we would be threatened over the phone by a \"Man in Black\" and when I called the police, I was put in a Mental Hospital and diagnosed with severe schizophrenia. The medicine further confused me. My husband and I divorced and my oldest daughter and I ended up on a bus from California to NC. My other daughter and son were taken to the island my ex was from and I haven't seen them since I went back out on the bus to try to get them. I am on SSI for Post Traumatic Stress Disorder and my learning disorder was finally diagnosed, but I have never seen anything that one would associate with schizophrenia. I figured it must have been a mild case or something associated with the illness. I have never been committed since. The only medication I have to take is for anxiety and I have horrible sinuses. MM"],"Region":"California","Disposition":"Unknown","Latitude":"36.691763","Summary":"Greys","Case Number":"12679","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Undisclosed"}