{"Tags":"City","Log Number":"IE-09202008-0020","files":["/var/www/straped/mufon/html2text/12680.html.txt","/var/www/straped/mufon/more/12680_submitter_file1__biggles111.jpg","/var/www/straped/mufon/more/12680_submitter_file2__biggles104.jpg","/var/www/straped/mufon/more/12680_submitter_file3__biggles103.jpg","/var/www/straped/mufon/org/12680.html"],"Object Shape":"Boomerang, Bullet, Missile, Cigar, Disc, Sphere, Square, Rectagular","Region":"County Dublin","Viewing Distance":"Unknown","Longitude":"-6.260974","City":"Dublin","Date Submitted":"07/21/2008 09:45 UTC","Disposition":"Unresolved","Source":"MUFON","trends":["There have been 12 other sightings in Dublin","There were no other sightings in Dublin on or around July 21st 2008","This sighting has never been favorited.",""],"Country":"Ireland","divs":["Sighting Detailsi was looking at some strange clouds moving from left to right across the canal where i live. i thought they where unusual because they were in a line and they looked like small tornadoes. so i decided to photograph them. as i was taking the pictures i only saw the clouds and nothing else. when i finished taking the pictures i went inside to put them on the computer . when i uploaded the pictures i noticed that some of the pictures had objects in them and some did not. at first i thought there was something wrong with the camera but it is working perfectly. as i look at the pictures i keep finding more objects by cropping and enlargeing.i am sending you the pictures as they were when i uploaded them to my computer. you will need to enlarge areas of the picture to find all the objects contained. but some objects are visible without enlargeing. please can you give me an opinion on the pictures as i really dont know what i am seeing in them. thank you."],"Sighting Duration":"Undisclosed","Latitude":"53.353674","Object Features":"Unknown","Date of the Event":"07/21/2008 09:45 UTC","Case Number":"12680","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.353674,+-6.260974(12680)&iwloc=A&hl=en\"> mufon case (12680) map </A>","Weather Factors":"None","Summary":"i saw nothing except the clouds i was photographing. discovered them when i put the pictures on my computer"}