{"Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.120786,+-115.168106(12688)&iwloc=A&hl=en\"> mufon case (12688) map </A>","Region":"Nevada","Object Shape":"Oval","Date Submitted":"08/11/2005 12:00 UTC","City":"Las Vegas","Log Number":"US-09212008-0005","Sighting Duration":"Undisclosed","Date of the Event":"08/11/2005 12:00 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 11th 2005"],"Case Number":"12688","Longitude":"-115.168106","Source":"MUFON","divs":["Sighting DetailsI was at the hottub in my condo at the far west end of Flamingo road, located only a block from the loop. I had at that time a regular habit of going to the hottub every night at seven. I was engaged in conversation with two other people there talking about the troubles small business have, or somesuch. I sat on the edge of the hottub with my feet in the water and lay back. It's an outside hot tub with a great view of the sky and mountains. I'm looking up at the sky chit-chatting with these other two gentlemen when I saw what at first looked like two balloons, and said something like \"Small businesses should be exempt from certain taxes because WHAT THE HELL IS THAT?!\" He answered \"I was about to ask you the same thing.\" What the three of us saw were two brightly lit, completely silent, oval shaped objects moving in perfect unison. One slightly ahead and to the left of the other, moving as if they were attached. Directly overhead. They were not a single object because we could see stars between them. They had come over the mountain and were moving across the valley towards the airbase. They seemed to be the size of largish airplanes. They were not blimps. We lost sight of them in a strange way, they appeared to become transparent the further they got from us. As we watched them, they got dimmer and dimmer until they were over the brightness of the strip and disappeared completely. The sighting lasted about ten minutes. I checked my watch, which I used to make sure I wasn't at the hottub for too long, and thus know the exact time of the encounter."],"Latitude":"36.120786","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/12688.html.txt","/var/www/straped/mufon/org/12688.html"],"Object Flight Path":"Straight-line path","Object Features":"None","Viewing Distance":"101-500 Feet","Summary":"Two oval shapes moving in perfect unison"}