{"Log Number":"","files":["/var/www/straped/mufon/html2text/1268.html.txt","/var/www/straped/mufon/org/1268.html"],"divs":["Sighting DetailsWe were driving west on Pleasant Grove Blvd. approaching intersection atWashington Blvd. Passenger, Janice, looked toward Chevron gas station on NWcorner of intersection, and behind and above gas station (about 20d abovehorizon) sighted group of six objects she thought were big birds coming along. As she pointed them out to Richard, she noticed they were acting in a mannerbirds do not act, i.e., changing formation and moving up and down individually. Richard then saw them. They looked unusual to him, he wasnt sure they werebirds. To get a closer look, we turned left on Washington (south), thenu-turned on Diamond Oaks Rd. (1 block away), stopped car to observe them fromintersection of Diamond Oaks Rd. and Washington, and we stepped out of car. Atthat time, they were moving towards us (toward the SE). They seemed fairlyclose to us now. The objects moved under their own power and individually, attimes flying in pairs, straight lines, semi-circular patterns, constantlychanging their formations, some seemed to have higher altitudes than others attimesthey seemed to have no particular destination, as if they were observing ordoing some type of maneuvers. From our long-standing bird watching activities,we were in agreement they were not birds, nor balloons, but seemed under theirown mode of power maneuvering in unusual patterns. As the objects changeddirections, their color would change from a very bright white to a brilliantsilver. The objects seemed to move away from us, then come back. Someformations observed: three pairs in a loose triangular shapefrom a straight line moving eastward when front object raised above the line,then the line reversed direction and made a semi-circular curvetwo groups of three at one point, forming a delta shapemaking circular and arcing turns. We watched for about five minutes, then theobjects formed a delta shape again, and moved away from us at what appeared tobe very high speed. Richard observed the objects quickly disappearing as theymoved north-east. We got in the car in an attempt to follow them, but whenarriving at the intersection, the objects were no where to be seen. We drovedown Pleasant Grove in the direction we thought they had taken. Janice wassearching, but they were gone. FYI: from where we were standing, we could sightthe objects at times between the two tall pine trees that were nearby."],"Summary":"Six objects sighted over Roseville, CA, changing f","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Longitude":"-121.288006","City":"Roseville","Weather Factors":"Unknown","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around August 26th 2001"],"Date Submitted":"08/26/2001 12:15 UTC","Object Flight Path":"Unknown","Date of the Event":"08/26/2001 12:15 UTC","Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Object Shape":"Oval","Object Features":"Undisclosed","Region":"California","Latitude":"38.752124","Country":"United States","Case Number":"1268","map":"<A HREF = \"http://maps.google.com/maps?q=38.752124,+-121.288006(1268)&iwloc=A&hl=en\"> mufon case (1268) map </A>"}