{"Object Features":"None","Sighting Duration":"Undisclosed","Date Submitted":"09/19/2008 09:50 UTC","Viewing Distance":"Over One Mile","Latitude":"33.779743","Date of the Event":"09/19/2008 09:50 UTC","Summary":"Watched small dot of light move laterally across horizon at VERY high rate of speed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.779743,+-116.465291(12681)&iwloc=A&hl=en\"> mufon case (12681) map </A>","City":"Cathedral City","Source":"MUFON","Region":"California","divs":["Sighting DetailsI was walking my dog in an empty lot next to our apartment complex in Cathedral City, CA (next to Palm Springs) at about 9:50 p.m. on Friday, Sept. 19, 2008. We live near an airport, and I looked up to see an airplane taking off of landing. As I continued to look at the night sky and the mountains in the horizon to my north (toward Interstate 10 highway), I noticed, to my right, away from the airport and seemingly a much farther distance away, a very small dot of light, moving from the northwest to the southeast at a very high rate of speed, far too fast to be any kind of airplane. I tracked its fast move across the horizon for a couple of seconds, but it was small to begin with, and began to fade from my view as it moved farther away. And it moved into an area bathed with light from a very bright moon. It absolutely, positively was NOT an airplane. It was a very small dot of yellowish-whitish light. No airplane I've ever seen, even flying at the highest altitude, looks that small in the sky. And again, it was travelling much too fast to be an airplane. Size-wise, it looked about the size that a satellite appears when you spot one in a starry sky out in the country away from city lights. But whereas a satellite tracks slowly through the sky, this shot across it. It was also much lower in the night sky, just above the mountain range north of the I-10. It occurs to me that it could be a meteorite, but it was not moving with any downward trajectory whatsoever. It was moving laterally."],"files":["/var/www/straped/mufon/html2text/12681.html.txt","/var/www/straped/mufon/org/12681.html"],"Disposition":"IFO","trends":["There have been 3 other sightings in Cathedral City","There were no other sightings in Cathedral City on or around September 19th 2008"],"Case Number":"12681","Longitude":"-116.465291","Country":"United States","Log Number":"US-09202008-0021","Weather Factors":"None","Object Shape":"Circle","Object Flight Path":"Straight-line path"}