{"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Disposition":"Unknown","Source":"MUFON","Region":"Colorado","Object Shape":"Diamond, Star-like","Case Number":"12686","map":"<A HREF = \"http://maps.google.com/maps?q=39.743734,+-104.977613(12686)&iwloc=A&hl=en\"> mufon case (12686) map </A>","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around September 20th 2008"],"files":["/var/www/straped/mufon/html2text/12686.html.txt","/var/www/straped/mufon/org/12686.html"],"Tags":"City","Sighting Duration":"00:02:00","Latitude":"39.743734","Log Number":"US-09212008-0003","City":"Denver","Date Submitted":"09/20/2008 06:30 UTC","Weather Factors":"None","Country":"United States","Viewing Distance":"Over One Mile","Longitude":"-104.977613","Summary":"glowing venus-like object rising into the clouds.","Date of the Event":"09/20/2008 06:30 UTC","divs":["Sighting DetailsI witnessed an glowing venus-like (but bigger) object slowing rising and eventually disappearing into the clouds. This occured in the Northeast sky from where I was walking through Cheeseman Park in the Capitol Hill area of Denver. Initially, I thought it could be a low flying helicopter or plane catching the sun's reflection. I was waiting for it to turn so I could identify it. Instead, it kept rising in a straight trajectory for maybe two minutes before it entered the clouds. Given the distance and altitude of the clouds, the object was probably much further away than I had originally thought. It also means the object must have been quite large. During the time of the sighting, 2 fighter jets flew overhead at subsonic speeds. They were flying in a straight line probably within 10 miles of the object. Within 5 minutes of the sighting, several high altitude planes flew over following the same general flight path taken by the fighter jets. I do not know if this was some kind of test launch. However, I saw no exhaust or any indication of how the object was propelled. Its direct trajectory and quick ascent ruled out the possibility of it being a ballon or lantern. It would also be unusual to launch a UAV on a beautiful Sunday evening in Denver. I file this report in the hopes that others might have noticed the object and the shared information can shed light on what was haping in the Denver skies this Sept. 20."],"Object Features":"Unknown"}