{"City":"Vineland","Date of the Event":"08/05/1967 12:00 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.492817,+-75.017871(12685)&iwloc=A&hl=en\"> mufon case (12685) map </A>","Country":"United States","divs":["Sighting DetailsI was just 14 years old at the time, the year 1967. I was riding shotgun with my mom driving and my little brother and sister in the back seat. We were driving in my mom's 1967 Oldsmobile convertible, a very fine car. We had a summer house on the Jersey shore in Beach Heaven which was a few hours drive from our Trenton home. During this time the Jersey Pine Lands were undeveloped and the drive was dark, remote and long, unlike what it is today. In a barren stretch of road we all see it in the sky. It was enormous, so large I could not see the ends, I saw just the belly of the craft. It was before us and mom pulled over to watch it. We all saw it, it was unbelievable. It was dead silent and floated barely above tree level and it did not make a sound. We huddled together. The crickets stopped whistling. One of it's lights focused on us and it stopped directly above us. I remember how it lit my moms skin, an unusual light not like florescent or incandescent or neon but more like todays LED's except a thousand times more intense. As fast as it came it was gone, with smaller crafts zipping around it, as we continued to the shore an excessive amount of military trucks passed us. We were right outside of Fort Dicks military base. What struck me was instead of the soldiers looking at us or at ground level they all looked up. We knew it was about what we saw. This was before everyone had cellular phones and when we got to the shore house mom called dad who was still in Trenton. She told him what we had seen and then came our realization of the time gap. Over six hours had passed and we can account for only ninety minutes, that's the normal drive time. My dad instructed us not to say anything to anybody and the secrete was kept until 2000. I was living in California and my brother called me home to New Jersey to help care for our dieing mother. I brought it up asking her if she remembered and she did, every little detail exactly as I did, so did my brother and sister. My mother seemed relived to retell the story, but she asked me something strange, \"did they hurt you?\". We all noticed that we all have the same scoop mark on our legs, and a patch where no hair grows on the other. I had medical problems and the doctor noticed scars in my organs from previous surgeries. Not odd except for the fact that I never had any surgery. The blue light appeared in my life several times over the years, once on the NJ turnpike with fireballs, once in my Hollywood home with a flickering man and witnessed by my partner and again camping in remote woods. I figured it to be Saint Elmo's fire until I realized it occurred too many times for me to witness that rare light so often. Today I am frail and sick with complications that can not be diagnosed. I believe my conditions to be related to that event."],"trends":["There have been 9 other sightings in Vineland","There were no other sightings in Vineland on or around August 5th 1967"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12685.html.txt","/var/www/straped/mufon/org/12685.html"],"Summary":"1967 Jersey Pines Family Encounter","Disposition":"Insufficient Data","Case Number":"12685","Region":"New Jersey","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Undisclosed","Latitude":"39.492817","Date Submitted":"08/05/1967 12:00 UTC","Longitude":"-75.017871","Object Flight Path":"Undisclosed","Log Number":"US-09212008-0002"}