{"Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=42.105563,+-72.586051(12695)&iwloc=A&hl=en\"> mufon case (12695) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"12695","Source":"MUFON","Date of the Event":"09/20/2008 07:31 UTC","Object Features":"Undisclosed","Disposition":"Unknown","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around September 20th 2008"],"files":["/var/www/straped/mufon/html2text/12695.html.txt","/var/www/straped/mufon/org/12695.html"],"Sighting Duration":"Undisclosed","Summary":"rectangular w/yellow and white lights","Tags":"City","Log Number":"US-09212008-0012","Latitude":"42.105563","Date Submitted":"09/20/2008 07:31 UTC","City":"Springfield","Country":"United States","Object Flight Path":"Undisclosed","Longitude":"-72.586051","Region":"Massachusetts","divs":["Sighting DetailsI went with my daughter to the Big E and arround 7:00 p.m. we went to the concert area to see jordin sparks? The concert was to start @ 8:00 p.m. I was bored and started looking into the sky .. it was already dark, and I saw a big object, rectangular, moving very slow, I thought what a strange plane because it had too many lights (I know there is an airport close by) then as I kept looking at it I realized it could not be a plane because it wad too slow and then I notice another object to its right. the secon object was not movin at all and was much higher but it had the same shape and lights. I kept looking at them and the second it crossed my mind this was an UFO (even though they did not look like what i have seen on pictures or tv.) the small one moved up at incredible spped and dissapeared. the one closer just dissapeared, almost at the same time, it was like it had turn the lights off ... like they knew I had seen them. I told my family but of course noone believes me! i kept looking for a reappearance until midnight, but the sky was just dark. I want to know if someone else saw something unusual like me ...."]}