{"divs":["Sighting DetailsI was camping at Eleven Mile Resevoir on Wednesday Sept. 15, 2008. At 8:15pm, the skies were dark, with the mountains outlined with light from the recent setting sun. At this time of night, stars were beginning to appear, expecially the bright ones on the horizon. While cooking up dinner I noticed two bright stars appearing in the SW sky. This was nothing to take note of. But, 10 minutes later one of the stars began move East, NE. It simply looked like a star, but moving toward me, in silence and grace. It got bigger the closer it got to me. There were planes in the sky and this certainly wasn't one of them. The guy in the campsite next to me saw it and we tried hard to figure out what it was. For about 45 seconds we watched it as it moved closer to us. There was a band of low clouds in the sky East of the object. The object moved in a straight path into (or behind) the clouds. It was a thin, narrow cloud and we expected the object appear on the other side of the cloud within just a few seconds of entering it. It did not. We sat there trying to figure out where it went. The cloud thinned a little bit and we saw the object again, but it was much smaller and seemed alot further away. My guess is that when the object moved behind the cloud, it changed trajectory and moved at a 90 degree angle toward the South, SW. The cloud moved on toward the East, leaving us with nothing to observe. The object was gone at that point. I was astonsished at what we just saw. It object itself was a bright star looking sphere. It got larger as it move closer to us. I couldn't tell the size of it. It moved slow and remained the same shape and luminescense. It was sureal. I did my best to write it off as a plane, helecopter, blimp, satelite, etc. It was none of the above. It was graceful, peaceful, and moved in such a away that I couldn't take my eyes off of it. Whats more amazing is that it was in the sky for at least 10 minutes, hovering above the mountain skyline, before I noticed it was moving toward us. And it apparently changed direction, and before we knew it, it looked to be 1000 miles away from us. As an optimistic, \"want to beleive\" person, I firmly beleive that this was the most legitimate \"ufo\" I've seen to date. I've seen other oddities in the sky before, but this one was the most convincing."],"Object Shape":"Circle, Sphere, Star-like","Object Features":"Unknown","Region":"Colorado","Longitude":"-104.819303","Weather Factors":"Unknown","Country":"United States","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around September 15th 2008"],"City":"Colorado Springs","Sighting Duration":"Undisclosed","Log Number":"US-09212008-0010","Tags":"City","Disposition":"Unknown","Case Number":"12694","Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/12694.html.txt","/var/www/straped/mufon/org/12694.html"],"Date Submitted":"09/15/2008 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.842232,+-104.819303(12694)&iwloc=A&hl=en\"> mufon case (12694) map </A>","Summary":"Witnessed object move toward me, then disappear.","Latitude":"38.842232","Date of the Event":"09/15/2008 08:15 UTC","Object Flight Path":"Path with directional change"}