{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Dome, Patterned Surface","Sighting Duration":"Undisclosed","Date Submitted":"09/13/2004 12:00 UTC","Object Shape":"Chevron","Date of the Event":"09/13/2004 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.840872,+-104.820333(12697)&iwloc=A&hl=en\"> mufon case (12697) map </A>","Country":"United States","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around September 13th 2004"],"Object Flight Path":"Straight-line path","Case Number":"12697","Disposition":"Unresolved","Tags":"City","Summary":"Large chevron object silently passing overhead at a impossible speed.","divs":["Sighting DetailsNo lights much larger than any aircraft very high rate of speed over 10000 ft. AGL I spotted a very large object flying east SE over my house for less than a minute on 13 Sep. 2004 after the object disappeared over clouds a small aircraft on near the same rout flew over at that time I realized how large the object must have been and how fast it must have been traveling and at what altitude. This event happened 4years ago this month and I would like to post it here for more to see,I did report this to the National UFO reporting center, the above description is the exact copy of the report. I would like to add some details to the report. I was waiting to be contacted by someone and give them this information at that time, however no one ever did try and contact me, so here is the rest of the story. The object I witnessed was Indeed very large it made the hair on the back of my neck stand up when I realized just how massive it was, and the speed at which it had to be moving, to this day I hardly can believe it myself, I still try and calculate the time and distance it traveled during the time I watched it and to come up with a approximate speed. It was late afternoon the sun was still up but low just going behind the mountains and setting fast here in Colorado Springs. The sky was clear except for a couple of billowing (Cumulonimbus)clouds south east from my house. I was sitting in a chair on my back deck when I happen to look up and seen this large chevron shaped object above the peak of my house moving in a SE direction. I did not take my eyes off from it and tried to get the best imaged to remember by scanning from one end to the other and looking for the smallest detail I could possibly get. The under side of it had what appeared to be round lights or blisters of some type. If they were lights they were only a dim yellowish glow. In fact the whole craft was some what subdued I remember thinking if I had not been looking up at the time it was above me it would have been very difficult to spot, meaning the reflection of the sun was not evident on this object. The total time I was able to observe this was about 5 to 7 seconds. During my observation I notice that a cloud would be in its flight path and I figured it would pass under it due to the distance the cloud was to the SE. When this object passed well above the cloud is when I had some what of a reference to it size and speed. This is when hairs on the back of my neck stood up as well as goose bumps covered my arms As it continued out of sight. My back ground is retired USAF with 21yrs 6mo. most of which I held a (SBI) Top Secret clearance. I was on flying status in the Air Force and have over 3000 hrs in the KC135 flying command post aircraft part of flight crew. I also have been a private pilot for the past 12yrs and own a airplane that I fly out of Meadow Lake airport east of Colorado Springs. I have been in and around aircraft most of adult life. I do know this craft that I seen is larger and faster than anything man has built. This is why for the past 1460 + days sense I witnessed this I can't help but look up when I go outside and wounder where it came from and if it went back yet. Sorry I waited so long to give you the rest of the facts to the sighting I encountered."],"Region":"Colorado","Log Number":"US-09212008-0014","files":["/var/www/straped/mufon/html2text/12697.html.txt","/var/www/straped/mufon/org/12697.html"],"Longitude":"-104.820333","Latitude":"38.840872","City":"Colorado Springs"}