{"map":"<A HREF = \"http://maps.google.com/maps?q=42.890537,+-78.871279(12693)&iwloc=A&hl=en\"> mufon case (12693) map </A>","Log Number":"US-09212008-0010","Viewing Distance":"Unknown","Longitude":"-78.871279","divs":["Sighting DetailsStrange @ Night A Door Opened In The Roof Square Shaped Hole, Pulled Out Of It, An Up To An Opening In Dark Sky That Was Blue Rectangle Doorway. I was in bed at the time in an upstairs bedroom, went to bed about 11:00 pm that night june 4 th, 2002, Slept for a few hours, then I awoke in my bedroom about 3:38 AM, June 5th, 2002, I saw the Gray type U-FO creatures four of them inmy room, with a hole in the ceiling roof looking out at the night sky, and I thought to myself, They're here again, I short to sit up, and I check the clock it read 3:38 am, I felt a neele and then a pain in the back of my chest. And I feel my close moving by themselves. Any I think to myself, Why is this happening? looked at the time its 3:52 am, A Doorway in the roof of the bedroom opened up and the roof had footsteps on it. I felt a needle in my left arm at 4:10 am. I started to quote a bible verse at them which was Deuteronomy 7:20-26, and they started to stay to them selves and I heard has it were like a girls voice said, \"he got that myth book and he's reading some myths from that book.\" before they started dropping to the ground. 4:17 am I was picked up. I can see all the roof top's of the houses and their's a holes in them, and they were taking others out too, then I looked where they were taking me A hole in the Heavens Like a Square Doorway. The Dark Cloudy sky I'm flying up above. And theres a doorway in the starry night lit sky. And then I'm through this Doorway and in some sort of room on a table, Needle in my eye. hurts. I see a metal table needles in arm's, back, and penis ((Hurt), warmth, relaxing and then can't feel hand is numb, hard to think, Feel left index finger of left hand chest right side lungs. Why are they doing this to me? Why? Tell me why?... then I'm taken back to the house through the roof, I remember, listening to the Thundering Backwards, Sounds. that about 7:30 am... After this I couldn't write it kept coming out backwards, from that night. thou I had I Parasite or something moving around inside of me. I went to the doctor and they just brushed it off as just a fatty tissue. So later a 6 months goes by the thing moving around in side of me, I showed it to my family and friends, and they told me to go have it removed, because they felt it moving when they touched it, I went back to the doctor and said touch this I grabbed this hand and pushed it over the spot were it was, he jumped back, I then said I want it cut out now. He, give me the name of a surgen, of which I went to, had it removed, a the pathology said that it was the ussaul fatty tissue with an abnormal parasite that was nothing they had seen before. Now, if this happens again, I'm going to cut it out myself. I don't know if this has happen to other as will, but I sure would like to know, about other thing's like this... Don't have much to say. About it, Tried to get a Hypnotist to find out more about this. But they don't bother with me... Please don't disregard this. I know their's something to this. Thundering's sound in reverse... IIt has a lot to do with them. And the Grey's are Violent race of being's, as are the Brown ones and the green reptilian type, I want to fight to stop them... I'll do anything to learn to fight back... II couldn't sleep at night after that, for a little over 2 yrs., sometimes I still have trouble with that."],"Date Submitted":"06/05/2002 03:38 UTC","files":["/var/www/straped/mufon/html2text/12693.html.txt","/var/www/straped/mufon/org/12693.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","Object Shape":"Unknown","Summary":"Strange @ Night A Door Opened In The Roof Square Shaped Hole, Pulled Out Of It, An Up To An Opening In Dark Sky That Was Blue","Latitude":"42.890537","City":"Buffalo","Case Number":"12693","Tags":"City","Disposition":"Insufficient Data","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around June 5th 2002"],"Country":"United States","Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"06/05/2002 03:38 UTC","Region":"New York"}