{"City":"maricopa","map":"<A HREF = \"http://maps.google.com/maps?q=33.299047,+-112.424706(12706)&iwloc=A&hl=en\"> mufon case (12706) map </A>","files":["/var/www/straped/mufon/html2text/12706.html.txt","/var/www/straped/mufon/more/12706_submitter_file1__hotairballoon.jpg","/var/www/straped/mufon/more/12706_submitter_file2__hotairballoon2.jpg","/var/www/straped/mufon/more/12706_submitter_file3__hotairballoon4.jpg","/var/www/straped/mufon/org/12706.html"],"Object Shape":"Sphere","Log Number":"US-09222008-0002","Region":"Arizona","Sighting Duration":"00:01:00","divs":["Sighting Details Today: September 16, 2008 Printer friendly version Send Page Link to a Friend Reader Submission: UFO and the Hot Air Balloon! by Dirk Vander Ploeg Posted: 03:45 May 2, 2008 Photo 1 Photo 2 Photo 3 - Enlarged image of unknown object. Photo 4 - Enhanced and enlarged image of unknown object. Witness: Larry Bunker Date: March 9, 2008 Time: 9.01 AM Location: Maricopa, Arizona Received the following submission, which included a detailed description and the two photos to the right from Larry Bunker, a UFODIGEST reader in Maricopa, Arizona. Larry states that it was 9.01 a.m. in the morning. The weather was sunny and about 60 degreess Fahrenheit. The date was March 9, 2008. He was on his way to work and was driving in his car and watching a hot air balloon through his sunroof and decided to snap a few shots with his cell phone. Larry only saw the hot air balloon and was totally amazed to see the unknown object in the photos. \"Hey, if you could please let me know what you think... I'm at a loss at what this might be. This was not in the picture when I fired off these shots.... I did talk to to a comercial pilot and he said that it is worth looking into... but its definately something,\" asked Larry. He added, \"I was on my way to work stuck my hand through the sun roof of the car and fired saved and fired and saved... put the phone camera away and looked at them later to see I had more than was there my the naked eye.... \" I have enlarged the object which is labelled photo 3. It appears to be definitely a solid object and highly contrsted due to the position of the sun. Photo number 4 is the same image but has been enhanced with Adobe Photoshop using the variations tool. There appears to have an energy field surrounding the object. This is very characteristic of authentic unidientified flying objects (UFOs). We at UFODIGEST appreciate submissions, including photos, videos and articles from our readers. Thanks Larry for your email. Dirk - 30 -"],"Country":"United States","Source":"MUFON","Summary":"it was a hot air balloon i was photographing... the UFO was not visible to the naked eye","Disposition":"Unknown","Latitude":"33.299047","Date Submitted":"03/09/2008 09:01 UTC","Date of the Event":"03/09/2008 09:01 UTC","Case Number":"12706","Object Features":"Unknown","Longitude":"-112.424706","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"None","trends":["There have been 33 other sightings in maricopa","There were no other sightings in maricopa on or around March 9th 2008","This sighting has never been favorited.",""],"Tags":"City"}