{"Viewing Distance":"501 Feet - 1 Mile","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=51.515279,+-0.124045(12705)&iwloc=A&hl=en\"> mufon case (12705) map </A>","Log Number":"GB-09222008-0001","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was working in a Nursing home in East Finchley, London and was walking downstairs to the staff room to have my break. I looked out of the window to check on the weather as I often did, and noticed what looked like very bright stars in the sky. Although it was 6pm, the sky was still in daylight altough the sun was setting, it was far too early to be seeing stars. I ran outside (as you do) and stood watching as a fleet of luminous UFOs moved very slowly across the sky. They must have been moving at walking or cyclying pace, and looked like very bright stars, luminous. I started to count them but gave up, I estimate between 60 - 80 objects. The sky was completely clear, no clouds. They were scattered over the sky but generally in a loose formation, some higher, some lower, the lowest ones would have been a few thousand feet, I saw a few airliners that were flying higher than them, some objects were very high, maybe 20,000 feet +. I watched them for 15 minutes till they dissapeared out of sight. There was no sound at any time from the objects. One object was a pulsating light, not like an aircraft strobe light, but very slowly pulsating. Another object was behind the main group and moving faster, apparrently to 'catch up'. Another object looked like something was dangling underneath it, it sounds silly, but the best way I can describe it was that it looked like a ' flying jellyfish'. That doesn't make logical sense to me, but I can only report it as I saw it. The next day I called the control tower at Luton airport (the closest airport to the sighting), I spoke to the senior controller on duty and asked if they had seen anything on radar, he replied that they hadn't. I received a letter from the Ministry of Defence a week later saying that how 'most ufo sightings can be explained as ordinary natural things.) Basically treating me like an idiot, as if I could have mistaken 'planes' or 'stars' for a fleet of luminous UFOs (in broad daylight and in clear weather no less) A clear and obvious effort to downplay the situation, no matter how ridiculous the official 'explanation' was to anyone with half a brain. I never felt afraid during the sighting, and had a strong feeling that these objects were intellingently controlled, and that they were trying to make themselves known to people, to show that they were peaceful. The conditions for the sighting could not have been better. At that time it was too early to see stars, even if it wasn't, I know what I saw, it was blatantly obvious. A few days later I contacted the editor of UFO Magazine at the time, Graham Birdsall, and told him of my sighting. He said that other people had reported similar sightings in other parts of England in the weeks before mine, and that also someone else in London had seen what I had, had videotaped it, and that it would be available to buy though UFO Magazine. Could I say in certaincy what these objects were? No. I can say with certaincy what they were'nt. They were'nt planes, helicopters, 'balloons' or anything 'normal'."],"files":["/var/www/straped/mufon/html2text/12705.html.txt","/var/www/straped/mufon/org/12705.html"],"Weather Factors":"Unknown","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around June 15th 2002"],"Object Shape":"Sphere, Star-like","Disposition":"Unresolved","Region":"England","Date of the Event":"06/15/2002 12:00 UTC","City":"London","Longitude":"-0.124045","Date Submitted":"06/15/2002 12:00 UTC","Latitude":"51.515279","Object Features":"None, Appendage(s)","Summary":"Mass sighting of fleet of 60-80 UFOs for 15 mins in 100% clear weather, daylight.","Sighting Duration":"Undisclosed","Case Number":"12705","Object Flight Path":"Straight-line path"}