{"Region":"Florida","Case Number":"12701","Log Number":"US-09212008-0018","Latitude":"27.261901","Tags":"City","Date Submitted":"09/20/2008 08:38 UTC","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/12701.html.txt","/var/www/straped/mufon/more/12701_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/12701.html"],"Object Features":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.261901,+-80.22366(12701)&iwloc=A&hl=en\"> mufon case (12701) map </A>","Date of the Event":"09/20/2008 08:38 UTC","Source":"MUFON","Object Shape":"Star-like, Triangle","Disposition":"Unknown","Object Flight Path":"Straight-line path","Summary":"Multiple faded red and white dots in the shape of a long triangle(in length).","Longitude":"-80.22366","trends":["There have been 4 other sightings in Jensen Beach","There were no other sightings in Jensen Beach on or around September 20th 2008","This sighting has never been favorited.",""],"divs":["sighting detailsi was walking my dog down the street when i had seen what looked like a star, then i realized it was more than one dot. i then realized it was moving towards me at a very high altitude. i first thought it was a flock of birds flying in a v formation. the triangle then disappeared into the clouds for 2 to 3 seconds, thats when i ruled out the bird idea because of how tight the formation was, how high the formation was, and how fast the formation was. this formation traveled all the way across the sky in a matter of 10 to 25 seconds. the formation did not stop and go, it just kept flying almost stright south. as a pilot in training, i am fairly familliar with the way certain aircraft act. this or these objects did not have any strobes or red\\green lights on wing tips. the objects also did not make any noise at all what so ever. i am a huge aviation fanatic, and my friends tell me i'm obsessed with military aircraft. i have never seen or heard of anything like this before in my entire life. looking up into the sky, if you hold your hand up, it appeared to be about two to four inches in length. thanks a lot"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"None","City":"Jensen Beach"}