{"Date Submitted":"07/06/2008 02:00 UTC","Viewing Distance":"21-100 Feet","Region":"Montana","City":"Billings","Latitude":"45.788286","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Billings","There were no other sightings in Billings on or around July 6th 2008"],"Tags":"City","Disposition":"Unknown","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/12708.html.txt","/var/www/straped/mufon/org/12708.html"],"Source":"MUFON","Object Shape":"Cylinder, Flash","Longitude":"-108.49776","Country":"United States","Log Number":"US-09222008-0004","Summary":"Pulsing light","Object Flight Path":"Other","Object Features":"Unknown","Case Number":"12708","map":"<A HREF = \"http://maps.google.com/maps?q=45.788286,+-108.49776(12708)&iwloc=A&hl=en\"> mufon case (12708) map </A>","Date of the Event":"07/06/2008 02:00 UTC","divs":["Sighting DetailsMy husband and I were on a roadtrip from Denver, CO to Tacoma, WA. We were traveling on interstate 90 somewhere between Billings, MT and Bozeman, MT and I think it was around 2 AM (MST). My husband was driving and I was in the back seat with our 4 week-old daughter. I had fallen asleep and my husband woke me up when he saw it. He told me to turn around and tell him what the object behind us was. I turned around and saw a very bright, pulsing light. It would pulse about once a second and was very close behind our car (I'm not very good at estimating but I would guess about 20-30 feet behind us) and only a little above the car, making it also very close to the highway. There weren't any street lights around when this happened. At first I was still a little groggy from just waking up and confused but after a few seconds I became frightened because the object was keeping pace with our car. To my great relief, I saw the headlights of another car behind us after a few more seconds (we were alone on the highway until then) and then the object slowed down and kept pace right above the other car. The other car proceeded to slow down and pull off to the side of the road with the object still hovering above them. I continued to watch the object pulse above the car until it disappeared from our view when we went down a hill. When I asked my husband what had happened before he woke me up he said that the light had suddenly appeared in front of him and had stayed there for a few seconds before moving behind our vehicle. He said that the light had appeared to have a multicolored effect, like a rainbow. However, I didn't notice this (maybe because I had just awakened and was groggy). Also, he said that he had been able to discern a little of the object's form when the light would flash and it appeared to be cylinder-shaped. I couldn't make out the object's shape but maybe it was because he observed it from a diffent angle or position."]}