{"Weather Factors":"Windy, Medium","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around September 19th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Object Shape":"Circle","Object Features":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.972093,+-82.794143(12703)&iwloc=A&hl=en\"> mufon case (12703) map </A>","Longitude":"-82.794143","Disposition":"Unknown","Region":"Florida","Date Submitted":"09/19/2008 09:35 UTC","City":"Clearwater","Date of the Event":"09/19/2008 09:35 UTC","Source":"MUFON","divs":["Sighting DetailsI was on the phone with a friend on my dock in the back yard and was watching the sky,I thought I saw something moving very slow over the water facing the West of the Gulf of Mexico. I blink my eyes to take a better look, and blink again then WOW all of a sudden there was this Very large object with around 10 steady lights. With 4 missing lights to make a perfect circle. It was moving very fast to the south. I ran in to get my husband but when we ran out it was gone. I was so shook up I couldn't even talk or catch my breath. I had goose bumps and all my body for a hour. Its was the most exciting thing I have ever seen in my life. I can't tell you it was a UFO of anything else. I will say it was something I have NEVER seen before in the sky. I still can't get it out of my head. I hope that if I ever get a chance to see something like that again, I will beable to keep myself together better. What a wonderful thing to see. I hope that someone else in my area also got to see it. Thank you for your time. Brenda Markle"],"Log Number":"US-09212008-0020","Summary":"I saw a 3/4 Circle moving very low over the canal on my dock moving to the south","Case Number":"12703","files":["/var/www/straped/mufon/html2text/12703.html.txt","/var/www/straped/mufon/org/12703.html"],"Tags":"City","Country":"United States","Latitude":"27.972093","Viewing Distance":"101-500 Feet"}