{"City":"Indianapolis","Region":"Indiana","Case Number":"12702","Object Flight Path":"Stationary","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around September 21st 2008"],"Date of the Event":"09/21/2008 12:00 UTC","Log Number":"US-09212008-0019","Object Shape":"Star-like","Object Features":"None","divs":["sighting detailsfirst, i would like to point out that my boyfriend and i noticed this star-like object for the first time about 2 weeks ago. ever since then, we started going outside at night, usually after 9pm, and sit on the front porch to look at it. at first we thought it was the satellite station because it was brighter than the other stars, but we then realized we were wrong, since we spotted the station directly opposite of this object. how did we know it was the station? i looked up the schedule online and it stated that the satellite station would be in my area between sept 8 - 20. it is now the 21st and this object is still outside, only this time it's situated in another area. i did some research online about stars. yes, stars emit color but usually it is only one color. this object emits several colors: blue, red and green. not only that, it shifts. i remember the other night, we went outside around 10:15pm to check this \"star\" out. it was situated just above the roof of the house in front of us. literally about 40 minutes later, it shifted to the right of the house in front of us. yes, i understand that stars shift due to the earth's rotation. as a matter of fact, i read that stars \"shift by about 1\\365th of 360 degrees per day, which is something like one degree\". the key words here are \"per day\". not \"per 40 minutes\". my initial feeling were goosebumps and then a thought came to me, a ridiculous thought: don't stare at it or its light will paralyze you and lure you in...yes, ridiculous. i'm still here, thank god. i'm wondering if this object is here on a mission. gathering information. or perhaps reading our minds...in any case, i am not afraid. i don't believe in the whole \"war of the worlds\" idea, rather, i feel they're like scientists, definitely more advanced than we are, here to do research. unfortunately i do not have any pictures nor any multimedia attachments for your viewing pleasure, since the deliverable is very poor, though i am sure that many are able to see it with their own eyes."],"Country":"United States","Disposition":"Insufficient Data","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12702.html.txt","/var/www/straped/mufon/org/12702.html"],"Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Latitude":"39.776516","Longitude":"-86.154264","Summary":"Star-like Object emits color\"s\" and shifts, seen in sky","Date Submitted":"09/21/2008 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.776516,+-86.154264(12702)&iwloc=A&hl=en\"> mufon case (12702) map </A>"}