{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.948316,+-84.851851(12713)&iwloc=A&hl=en\"> mufon case (12713) map </A>","Date of the Event":"09/18/2008 06:20 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/12713.html.txt","/var/www/straped/mufon/org/12713.html"],"trends":["There have been no other sightings in Rising Sun","This sighting has never been favorited."],"Country":"United States","Latitude":"38.948316","Object Flight Path":"Straight-line path","Tags":"City","City":"Rising Sun","Disposition":"Unknown","Object Features":"Undisclosed","Summary":"I saw a Britte white light outside my TV room window. I looked out my window to see a large craft pass over my house","Longitude":"-84.851851","Case Number":"12713","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09222008-0009","Source":"MUFON","Region":"Indiana","divs":["sighting detailsi was setting on my couch. there had been a major black out here in the area that week. to date there is still many people with out power from a wind storm that swept through the area from hurricane ike. its reported to have been an unprecedented even for this part of the country. it was around 6:20 am. still dark out. clear sky's with a moon 3\\4's full. i was setting there and saw a britte light out of the corner of my eye thought the sheers behind the couch. it was moving. i pulled back the sheers to see a large craft moving somewhat slowly directly over my house and on past he tree canopy in back where i could no longer see it. it was low. i'm not good with feet and miles but it was low enough to light up my back yard from all the lights that were around it. at first it was very pointed on the very front. one large britte white light on the very tip. as it moved over i saw that it was triangle and had no wings. the white light continues along and down both sides and also the back. in the middle of the back end it had two small red lights on ether side of some kin of vent. it looked man made to me but it was something i have never seen. no sound at all and flying so low it should have rattled my whole house. there was a generator running but i had no problem hearing planes a lot higher then that the very next night. i stayed up and set outside all night hoping to see it again. all the lights were steady burning. none blinked. i could see the bottom well and its details. i knew it would disappear over the trees to fast for me to grab my camera so i just took in as much detail as possible. it looked metallic, gray, silver? the bottom was contoured and not smooth. it looked like vents on the bottom also"],"Date Submitted":"09/18/2008 06:20 UTC","Weather Factors":"Unknown"}