{"Latitude":"50.063338","Longitude":"8.534739","trends":["There has been one other sighting in Kelsterbach","There were no other sightings in Kelsterbach on or around September 22nd 2008","This sighting has never been favorited.",""],"Object Shape":"Star-like, Other","Sighting Duration":"05:00:00","files":["/var/www/straped/mufon/html2text/12718.html.txt","/var/www/straped/mufon/more/12718_submitter_file2__IMG_1178.JPG","/var/www/straped/mufon/org/12718.html"],"Date of the Event":"09/22/2008 08:57 UTC","Tags":"City","City":"Kelsterbach","Weather Factors":"Does Not Apply","Object Flight Path":"Hovering then path,Straight-line path","Summary":"2 orange lights over Germany","Date Submitted":"09/22/2008 08:57 UTC","Log Number":"DE-09222008-0014","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","divs":["Sighting DetailsA family member went outside to put the trash out. Shortly after he went outside he called me and another family member to come out and watch something. We went outside and there was a big orange light hovering to the NE. As soon as all of us 3 were watching it, the orange light began to move and went directly over our yard and over our heads flying under the clouds. As soon as it had passed our yard it slowly began to disappear. The light traveled from the NE to the SE and was of a triangular shape. Approximate 20 minutes after the first light, a second big orange light appeared traveling from the NE to the S. This one had a orange circle around the main light. Between those sightings we were able to see smaller and bigger flying stars. After the first orange light I went inside and got my digital camera and binoculars. Luckily I then was able to record the second orange light and had a glance through the binoculars at it.Both sightings lasted about 5 minutes This is not the first time I have witnessed big orange lights in the sky over my town, back in May 2007 we even had a bigger sighting of orange lights. Please find attached a video (sound removed for anonymity) and a picture of the lights. (Double report, forgot to add information)"],"Disposition":"Unresolved","Country":"Germany","Case Number":"12718","map":"<A HREF = \"http://maps.google.com/maps?q=50.063338,+8.534739(12718)&iwloc=A&hl=en\"> mufon case (12718) map </A>","Region":"Hessen"}