{"trends":["There have been 2 other sightings in Lawndale","There were no other sightings in Lawndale on or around September 19th 2008","This sighting has never been favorited.",""],"Region":"California","Source":"MUFON","Summary":"Bright star like ufo moving across the sky, several smaller crafts released from ufo","Case Number":"12739","Weather Factors":"Unknown","Date Submitted":"09/19/2008 08:11 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","Log Number":"US-09232008-0008","Date of the Event":"09/19/2008 08:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.874101,+-118.352364(12739)&iwloc=A&hl=en\"> mufon case (12739) map </A>","divs":["Sighting DetailsMy sister, husband, and I were outside talking. I looked up and saw this bright object (looked like a large star)moving across the sky. I grabbed my camcorder and video taped it. Upon viewing the video later, I noticed that the object seemed to have smaller crafts come out of it. In the video, when the helicopter flys nearby, one of the smaller crafts accends towards the helicopter then quickly goes back, the smaller crafts seemed to be protecting the larger bright craft. The smaller crafts could not be seen with the naked eye. This is not the first time we have seen this type of object fly by. It has happened several times. This object did not make any sound as it flew by. Generally, I will take notice of objects such as this one. It starts off looking like a regular star, or a satellite, then it begins to jet across the sky with no sound, no blinking light, just a steady solid white color. The object begins to get brighter and brighter."],"Object Features":"Unknown","City":"Lawndale","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/12739.html.txt","/var/www/straped/mufon/more/12739_submitter_file2__DSC_2836.JPG","/var/www/straped/mufon/org/12739.html"],"Longitude":"-118.352364","Object Shape":"Oval, Star-like","Tags":"City","Latitude":"33.874101","Country":"United States","Object Flight Path":"Straight-line path"}