{"Source":"MUFON","Date of the Event":"09/21/2008 08:45 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.812024,+-105.085594(12732)&iwloc=A&hl=en\"> mufon case (12732) map </A>","Country":"United States","Disposition":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","Sighting Duration":"00:06:00","Viewing Distance":"Over One Mile","Case Number":"12732","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around September 21st 2008"],"files":["/var/www/straped/mufon/html2text/12732.html.txt","/var/www/straped/mufon/org/12732.html"],"Longitude":"-105.085594","Object Shape":"Star-like","Summary":"bright star changing direction and fading away","Weather Factors":"Unknown","Latitude":"39.812024","Region":"Colorado","City":"Arvada","divs":["Sighting DetailsI was getting out of my car when I saw something out of the corner of my eye. I looked up and there was a very bright star about the same size as venus but slightly brighter. I originally though it was a very bright falling star. but the object did not fade it kept going and also did not go straight. I watched the object as it went south east towards denver it almost faded at the horizon then it made a sweeping u turn and came back north almost the exact path that it had gone south. but at much greater speed and rapidly gaining altitude to the point where it looked like a satalite going north. It travelled from the southern horizon to the northern horizon in approx 45 seconds with absolutly no sound. I lost sight of the object before the northern horizon as if it was gaining altitude not flying level like a plane would when I originally saw the object it was swerving slightly but when it headed south it was almost perfectly straight. Not sure if what I saw was paranormal just strange Hope someone knows what it was. I watched the sky for nearly two hours after but did not see anything else that night"],"Log Number":"US-09232008-0001","Date Submitted":"09/21/2008 08:45 UTC"}