{"Date of the Event":"10/15/1980 12:00 UTC","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around October 15th 1980"],"Date Submitted":"10/15/1980 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc","Region":"Arizona","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-09232008-0004","divs":["Sighting DetailsI lived at The Cloisters Apartment complex around 1980, at the time I worked at Gates Learjet, so I kinda have a clue what it takes to propel aircraft. Was on the telephoe with my mom and my door was open so I assume it was a cooler time of year. Next door to me was a large parking lot of an Oriental Buffet. I looked out the door and thought what the hell. So I go out on my porch and in broad daylight there was a round craft hovering 20 feet above my roof top but over the parking lot next door so I could see it clearly.. If I had a camera I'd be very famous today.. It was pretty much the typical looking saucer pictures you see and it had pie cut shaped pattern lights under it and the lights curved as they turned. I looked for any means of propulsion to include fans propelers or jet exausts and believe me there were none. After a few minutes it slowly started moving over my roof so I went to my front door to see it pass over, as it was going very slowly, and when I opened my door and went out it was no where to be seen. I have told very few people about this but it told me there is something out here and I have no doubt there is.. I almost called the local radio station to report it, so people in cars could see, but I figured they would think I was nuts. I watched the news that night and the next day and no one reported it.. I know what I saw and I know it wasn't from this earth.. I am 49 now and the USA hasn't came up with anything close to this craft yet so that just reinforces it in my mind.. Since then I have decided that light was the source of its propulsion.. I just saw your news report on yahoo and heard Phoenix so I had to tell my story.. The guys who were supposedly taken for a few days while on a camping fishing trip drew the same exact craft in their pictures that I saw. This is the only UFO story I have seen on tv I believed so far, and ofcourse mine.. Lights are lights folks, I saw the damn craft in broad daylight. Freaks me out to this day.. Why me?"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.228493,+-110.917809(12735)&iwloc=A&hl=en\"> mufon case (12735) map </A>","Latitude":"32.228493","files":["/var/www/straped/mufon/html2text/12735.html.txt","/var/www/straped/mufon/org/12735.html"],"Summary":"Round saucer shape with pie shaped lights on botton the turned slowly, light hum.","Disposition":"Unknown","Case Number":"12735","Tags":"City","City":"Tucson","Country":"United States","Longitude":"-110.917809"}