{"map":"<A HREF = \"http://maps.google.com/maps?q=14.70208,+-91.2506(12737)&iwloc=A&hl=en\"> mufon case (12737) map </A>","Longitude":"-91.2506","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"06/20/1985 12:00 UTC","Region":"Solola","Disposition":"Unresolved","Country":"Guatemala","Summary":"Flyby.","divs":["Sighting DetailsI was on guard duty in the jungle after a heavy rainfall earlier that evening but by this time the skies had partially cleared and the stars were clearly visible through them. While leaning against a truck I happened to look up at the sky, I began studying them when I noticed that one of the began to move slowly from it's position in the sky. I stood very still and held on to the truck assuming that my natural sway and the earths movement was making me see things but I realized that the star was actually moving and descending at a what appeared to be a slow pace. I continued to observe it's path and realized that it was picking up speed as it continued it's descent. I knew it was getting closer because it continued to grow as it came down. It's color was intermittent, from white to royal blue to white to royal purple but touching in between colors like Teal and Lilac as it changed. It seemed egg shaped as it moved but when it finally halted it was spheric. It's hard to judge to give an accurate measurement of how high it stopped because I could barely see the mountains in the dark due to a lack of moonlight, but I'd estimate it hovered at maybe 5ooo feet and was about 2 miles away from my position. It just stood there changing colors for about 2 minutes and began to move away in a sort of cartoonish manner with minimal pauses as it traveled, almost hesitantly. Suddenly, it ascended vertically into the air and in relation to the face of a clock shot like a tracer 6-12-7-3-10-3-8-12-6-12 and was gone. Like it had never been there. I got freaked and excited like getting off of the rollercoaster for the first time. I tried to tell some of the guys in my unit what I saw but they started making fun of me so I never mentioned it to anyone again. BTW, I just remembered that the object made NO SOUND whatsoever."],"trends":["There have been no other sightings in Solola","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Case Number":"12737","Source":"MUFON","Object Shape":"Egg, Sphere","Object Features":"None, Unknown","Weather Factors":"Windy, Light","Log Number":"GT-09232008-0006","City":"Solola","files":["/var/www/straped/mufon/html2text/12737.html.txt","/var/www/straped/mufon/org/12737.html"],"Date of the Event":"06/20/1985 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Latitude":"14.70208"}