{"Sighting Duration":"00:40:00","Tags":"City","Object Features":"Undisclosed","Date Submitted":"09/21/2008 08:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.874214,+-123.710148(12743)&iwloc=A&hl=en\"> mufon case (12743) map </A>","divs":["Sighting DetailsThis is back to the night when my neighbour filed his report of the strange lights of half oval shapes in the sky and the red lights that looked like they came from the ground and went up into the sky. I had gone out to look for these lights that were still flashing and as I was driving N.W. on a country road and I could still observe the flashing lights from a distance to the N.E. My daughter was with me (by the way she has had her own experince with a ufo) and she hollered telling me to stop saying whats that! So I stopped and as I looked out my window towards the west and we saw what looked like a bright star going N.E. I obseved from the car until it had passed us and when we got out of the car to try and get a better look we lost sight of it. I have seen this before and next time I am going to video tape it like the other person did whom said it ejected out other craft that was only seen on video. I would say that at arms length to me it looked like the size of a dime. I do understand that there was a thunder storm off to the north of us but I did not see any lighting or hear any thunder and the flashs were strong and frequent.I figured the folks that lived in that area must have hid under their covers frightned all night from how it looked here."],"Source":"MUFON","Date of the Event":"09/21/2008 08:35 UTC","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/12743.html.txt","/var/www/straped/mufon/org/12743.html"],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-123.710148","Case Number":"12743","trends":["There have been 17 other sightings in Leggett","There were 2 other sightings in Leggett on or around September 21st 2008"],"Region":"California","City":"Leggett","Log Number":"US-09232008-0012","Summary":"looked like a bright star","Object Flight Path":"Straight-line path","Country":"United States","Disposition":"Insufficient Data","Latitude":"39.874214","Weather Factors":"Lightning, Light"}