{"Disposition":"Unknown","divs":["Sighting DetailsToday for some unknown reason I had a strong urge to lookout my bedroom window. As if waiting to see something. I went to the window and started to look at the cars and people below walking up and down the sidewalk. In occasions I look up to the sky only to see airplanes departing La Guardia Airport and a few seagulls and birds flying around. The sky was completly blue no clouds. All you could see were the planes passing by and leaving the airport.So I waited and waited then suddenly I saw this bright red star-like object moving in the sky. This object was shinning bright like stars do at night.I can't tell you more than that because that's all i saw. It flew in a straight line.The object was moving from north to south. I quickly check the time. It was 5:32pm. The object seem to hover for a few seconds then started moving and gaining alttitude. At one point I couldn't see it anymore.It just dissapear. I check the time again and it was 5:34. I had the sense that it wanted me to see it. One other thing that i found a bit strange I was listening to a cd at the same time this all was occuring. Right after the object dissapear this songs started to play. A famous disco song from the 70's \"Got to be Real\" by Cheryl-Lynn I think.I found it very odd. Like if telling me that what I saw was real."],"Tags":"City","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12749.html.txt","/var/www/straped/mufon/org/12749.html"],"Country":"United States","Case Number":"12749","Viewing Distance":"Unknown","Source":"MUFON","Region":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around September 23rd 2008"],"Object Shape":"Star-like","Sighting Duration":"00:02:00","Summary":"Saw a bright red star-like object in the sky.","Longitude":"-74.003503","Latitude":"40.715553","Date Submitted":"09/23/2008 05:33 UTC","Date of the Event":"09/23/2008 05:33 UTC","Object Flight Path":"Undisclosed","City":"New York","Log Number":"US-09232008-0018","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.715553,+-74.003503(12749)&iwloc=A&hl=en\"> mufon case (12749) map </A>"}