{"Case Number":"12740","Longitude":"125.540623","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Date of the Event":"08/31/1996 12:00 UTC","Object Features":"Other","Tags":"City","Country":"Philippines","Latitude":"8.947538","Region":"Caraga","Sighting Duration":"Undisclosed","Date Submitted":"08/31/1996 12:00 UTC","City":"Butuan City","map":"<A HREF = \"http://maps.google.com/maps?q=8.947538,+125.540623(12740)&iwloc=A&hl=en\"> mufon case (12740) map </A>","Log Number":"PH-09232008-0009","Source":"MUFON","Object Shape":"Sphere, Teardrop, Other","divs":["Sighting DetailsGreetings! First of all I'm a Filipino just moved in here in the United States for employment. My story or experience has been held quiet in my heart for a long time. I wasn't able to tell it to anyone exept my Grandmother, and she looked at me in doubt & suspicion rather than believing when I told her about the event. It was a windy night starry night in a very small town of Patin-ay, & I was escorting my little cousin home to their little hut on a hill more than a mile from my Grandmother's. It was a newly constructed village & the road going there was rough gravel with grasses on the side with a height almost 9 ft long. When I reached my destination my Uncle told me about some crazy dog on the loose so he lend me his samurai for my protection. On my way back, while being aware of the danger, I was getting more excited about the samurai so I aimed & hitting those tall grasses along the side of the road when suddenly, a very bright liquid-bluish light coming fast towards my direction flying very low (a height of 3 coconut trees) at fast speed that my eyes can fairly describe it. I can remember that I was mentioning bad words (more like holy [pd]! expresion in my language caused by exitement)when I saw the object and turned sharply to other direction until I could no longer saw it on the tall grasses. I was stunned of what I saw, the hair in my arms were standing & gave me continuos shivers. The closest thing to describe it is like from a movie called \"The Abyss\" when an unknown small object passed through the Nuclear Sub, end up losing power & heading for a crash, That was it! but it was bluish, liquidish more like organic. Since then after I told my Grandma & saw her reaction, I never told it to anyone, until now. Later, I saw your website feature on yahoo so I decided to contribute the story to you rather than the story dies with me & remain untold. My mind expanded since then, & have great understanding that the universe is a very big place that only we human beings alone can inherit. P.S. The object was more like organic & constantly moving (like a blob) while flying."],"files":["/var/www/straped/mufon/html2text/12740.html.txt","/var/www/straped/mufon/org/12740.html"],"Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Butuan City","This sighting has never been favorited."],"Summary":"Not Provided","Weather Factors":"Windy"}