{"Longitude":"-85.752246","Source":"MUFON","Latitude":"38.259055","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.259055,+-85.752246(12746)&iwloc=A&hl=en\"> mufon case (12746) map </A>","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around January 10th 2008"],"City":"Louisville","Date Submitted":"01/10/2008 07:15 UTC","Region":"Kentucky","Summary":"Large black triangle UFO hovered then drifted over residential neighborhood","Tags":"City","Date of the Event":"01/10/2008 07:15 UTC","divs":["Sighting DetailsShortly after sunset in early January, 2008, as stars began to appear on the eastern horizon, I took my dogs into my backyard for their evening jaunt. Living approximately 3 miles from a county airport, I expect to see aircraft of all types flying overhead in a regularly known landing pattern. And, as a retired USG official who held a top secret clearance I have seen a multitude of different aircraft. I have aways been a reluctant believer of life elsewhere in the universe but unable to believe the Earth was being routinely visited by life elsewhere. However, the events of that evening were clear and convincing proof to me of both. I have attempted to analyze and absorb the event over the past 9 months and put it into some rational context. Frankly, I can't and, I now understand why UFO witnesses are so reluctant to come forward. It began innocently enough. As I stood in my backyard watching my dogs, I was startled by an intense flashing red light from the corner of my eye that seemed to come from an aircraft only vaguely outlined. The craft was so low that it seemed to be on a crash course in my own neighborhood, actually next door, which is why I was startled. As I turned east to get a better look, I clearly saw a black matted triangular craft against a darkening skyline silently hovering about 100 feet over my neighbors house with a pulsing red light beneath the craft. It was not moving at all, and there was absolute silence. I was completely transfixed by this sight. My thoughts were that this couldn't be happening, but it was. So, I rapidly tried to put the craft into some context which I understood. I began to compare what I was witnessing with a list of the kinds of aircraft with which I was familiar - none fit. It seemed to be relatively flat on top and bottom with equidistant but rounded sides with no visible windows or visible projections on its surfaces. I also began comparing the size and shape of the craft with my Toyota SUV which was immediately below the craft, with my neighbor's house also below the craft, and with the 50 foot tall trees in my backyard which were bare since it was winter. In relative measure to these known objects, the craft was as large as my neighbors house and most of his backyard combined. So, it seemed to be about 100 to 125 feet on each of 3 sides and about 20 feet in thickness with a dense black matte covering. By comparing the height of the trees in our yards with the craft, the craft was silently hovering approximately 100 feet above my neighbor's house. The red light at the front of the craft was unlike any I have seen on existing aircraft - it was incredibly intense and clear, almost like a super LED. It was located under the craft at one end of the triangle that appeared to be the front of the craft. The craft also seemed to have an equally intense white light eminating from the rear end but its source was not clearly apparent at the angle the craft was to me at that time. That white light was not the same as the flashing lights on wingtips of known aircraft. This white light was not flashing or pulsing but was steady and appeared to be of a soft but equally intense quality of light. After approximately 5 minutes, the craft made a 90 degree turn to the east and began drifting slowly and silently away. As it turned, I was able to see two large circles each approximately 8-10 feet in diameter at either side at the end surface of the craft which were the sources of the white light I had only seen before from an angle. The white light was steady and intense but of a softer nature than the flashing red light. After another 5 or so minutes, the craft had slowly moved out of sight. In closing, let me note that I was absolutely stunned by this event and speechless or otherwise I would have attempted to make some effort to contact the craft. I have never seen anything like this in my life. It was not a US aircraft. I don't believe that any other nation has this kind of technology at the present time. The only conclusion I am able to draw from this event is that the craft was clearly and purposely surveiling the area. It was also clear that the craft saw me watching it but made no attempt to contact me or to evade the area. On reflection, I'm sure those piloting the craft could not perceive any threat to its presence from anyone. One final note, for some unknown reason, my dogs did not respond to its presence, they were quiet and not frantic - it seems that reaction is reserved for the postman."],"Disposition":"Unknown","Case Number":"12746","files":["/var/www/straped/mufon/html2text/12746.html.txt","/var/www/straped/mufon/org/12746.html"],"Country":"United States","Object Shape":"Triangle","Log Number":"US-09232008-0015","Object Flight Path":"Hovering then path","Object Features":"None"}