{"Object Flight Path":"Undisclosed","Log Number":"US-09232008-0016","Date of the Event":"05/24/2008 12:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting Details1. Where were you and what were you doing at the time? At home,taking photo's of other UFO'S and ET'S in the sky. 2. What made you first notice the object? Other UFO'S Flying around in our air space. 3. What did you think the object was when you first noticed it? A ET inside his craft with other cylinder type UFO'S flying with it. 4. Describe the object and its actions and motions. A very bright light moving very fast and then coming to a very fast stop. 5. Describe your feelings, reactions and actions, during and after sighting the object. Did not have time to thing about my feeling, my reactions ( OH MY GOD,THIS PHOTO IS THE BEST PHOTO OF ALL TIMES ). 6. How did you lose sight of the object? It just disappeared, all of them. I TOOK THIS PHOTO STANDING IN MY BACK YARD OF A ET IN HIS SPACE CRAFT, ENLARGE THIS PHOTO AN SEE HIM, ALSO TAKE NOTICE OF THE OTHER WHITE OBJECTS IN THIS PHOTO THEY ARE ALSO FLYING WITH THIS ET, WITH THIS PHOTO WE NO LONGER NEED TO ASK WILL WE SOON FIND LIFE IN THE HEAVENS? I FOUND THAT LIFE WE'VE BEEN LOOKING FOR IN THE HEAVENS. THIS PHOTO WAS TAKEN ON MAY 24,08 The other photos shows two or more very large craft with very bright lights, if you enlarge the photos and look very close at the lights you will see the images of some type of ET inside the lights, also look to the left of image # 0203, 0204, 0205, watch how the two craft becomes one craft and then disappeared. ALL PHOTOS WAS TAKEN WITH A DIGITAL CAMERA USING A 300 mm TElESCOPIC lENS."],"Weather Factors":"Unknown","Summary":"I can not give a description in 25 words or less. Two different events on different dates.","Latitude":"35.721269","map":"<A HREF = \"http://maps.google.com/maps?q=35.721269,+-77.91554(12747)&iwloc=A&hl=en\"> mufon case (12747) map </A>","Longitude":"-77.91554","Object Shape":"Cylinder, Other, Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12747.html.txt","/var/www/straped/mufon/more/12747_submitter_file1__IMG_9525_2.JPG","/var/www/straped/mufon/more/12747_submitter_file2__IMG_0806.JPG","/var/www/straped/mufon/more/12747_submitter_file3__IMG_0204.JPG","/var/www/straped/mufon/org/12747.html"],"City":"Wilson","Disposition":"Hoax","trends":["There have been 2 other sightings in Wilson","There were no other sightings in Wilson on or around May 24th 2008","This sighting has never been favorited.",""],"Country":"United States","Region":"North Carolina","Date Submitted":"05/24/2008 12:00 UTC","Tags":"City","Case Number":"12747","Source":"MUFON"}