{"Tags":"City","Disposition":"IFO","City":"Pioneer","Region":"Louisiana","files":["/var/www/straped/mufon/html2text/12757.html.txt","/var/www/straped/mufon/org/12757.html"],"Date of the Event":"09/30/1974 12:00 UTC","Sighting Duration":"00:01:30","trends":["There have been no other sightings in Pioneer","This sighting has never been favorited."],"Summary":"it looked like a big red glowing ball in the sky. just floating 20 feet off of the ground.","Longitude":"-91.43345","Latitude":"32.736244","map":"<A HREF = \"http://maps.google.com/maps?q=32.736244,+-91.43345(12757)&iwloc=A&hl=en\"> mufon case (12757) map </A>","Weather Factors":"None","divs":["Sighting Detailsmy father and my maternal grandfather were in a cotton trailer packing cotton. i was on the ground beside the cotton trailer picking up cotton off of the ground and tossing it back in the trailer. we all saw a red glowing or shimmering ball in the sky about 15 to 20 feet off of the ground floating in the air above the cotton field. it scared me and i climbed up into the trailer with my father and grandfather as quickly as i could and then turned and looked at the ball again. it floated up about a foot and then floated down about a foot and then just popped out like turning off a light. the ball was about 3 to 4 feet in diameter. it was perfectly round in shape. i later was told that another man about a mile away also saw it and it scared him so bad that he stopped the cotton picker that he was driving and ran to the house. please let me know if anyone else has ever seen anything like this . my grandfather died about 10 years later but every once in a while he would jokingly ask me if i had seen the u f o again and smile or chuckle. thanks, gary mayfield"],"Country":"United States","Object Flight Path":"Undisclosed","Source":"MUFON","Log Number":"US-09242008-0005","Case Number":"12757","Object Features":"Undisclosed","Object Shape":"Circle","Viewing Distance":"Unknown","Date Submitted":"09/30/1974 12:00 UTC"}