{"trends":["There have been 17 other sightings in leggett","There were 4 other sightings in leggett on or around September 23rd 2008"],"Source":"MUFON","Summary":"New update for yesterdays oval shapeds and red lights","Log Number":"US-09242008-0001","files":["/var/www/straped/mufon/html2text/12753.html.txt","/var/www/straped/mufon/org/12753.html"],"Weather Factors":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.870484,+-123.712808(12753)&iwloc=A&hl=en\"> mufon case (12753) map </A>","Case Number":"12753","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Object Features":"None","Disposition":"Unknown","Date Submitted":"09/23/2008 08:40 UTC","Sighting Duration":"00:03:00","Tags":"City","City":"leggett","Region":"California","divs":["Sighting DetailsI went outside by the pond with my night vision goggles to look tonight at the sky and only like maybe a moment passed by when I noticed looking at the sky through a tall tree that a light was moving, and it was back there on the other side of my house and trees were blocking my view, I ran over to where I needed to go for a better view. And when I looked again through my goggles I could see big round objects in the sky over where the lighting and red flashes and shapes all that happened last night. It was truly amazing! One disc would come down like towards the ground and another one would come up and they were each going towards one another in a slanted direction with their lights a solid white then I am wondering whats going to happen do they crash or change directions?!! Then they stopped and then both of them flashed their lights on back and fourth to one another as if they were communicating. And then I seen saw other things flying from the north to the south and around the area that I'm not sure what they were. Maybe someone whom possibley was out there could shed some info? I am going to keep this short for tonight. It seemed to quiet down so it seemed like I ought to get this report out now. but I'm going back out now to see if I can see anything else tonight. These lights were hardly visble with the naked eye."],"Latitude":"39.870484","Object Shape":"Star-like","Longitude":"-123.712808","Date of the Event":"09/23/2008 08:40 UTC"}