{"Viewing Distance":"Over One Mile","Latitude":"33.839489","Case Number":"12762","Object Flight Path":"Straight-line path","Longitude":"-118.335329","City":"Torrance","trends":["There have been 16 other sightings in Torrance","There was one other sighting in Torrance on or around August 31st 2008"],"Source":"MUFON","Summary":"star like ufo moved at rapid speed","Object Features":"None","divs":["Sighting DetailsI was standing with my neighbor Ady in our back yard. I was showing her the planet Jupiter with my binoculars while commenting to her on how well they worked since we could also see the moons surrounding the planet. At that moment Ady asked me \"What's the star next to it?\". I said, \"What star?\" She said, \"That star right there, the one that's moving.\" I replied, \"The star isn't moving, maybe the cloud makes it appear to be moving.\" she handed me the binoculars and said, \"It is moving look\". I looked up at the star she was pointing at and it was a little to the right of Jupiter(was at our 10 o'clock position) the star was moving north. There were no blinking lights and just looked like a regular star moving across. I looked at it with the binoculars and it looked like a gray dot. I put the binoculars down and Ady asked, \"Is it supposed to move like that?\". I told her,\"No,it's not a shooting star\". We watched moved from it's original starting point(by Jupiter) at 10 o'clock to just over our heads into the 1 o'clock in just 5 to 8 seconds then disappeared into the coming ocean layer.There was no sound, no lights of any color, just a gray dot the size of a star. Just after we saw and heard a jet with it's flashing airplane lights coming from the Southern direction and it went to the same area where we last saw this thing and it also disappeared into the marine layer. We could not explain what it was, This is just what happened."],"Sighting Duration":"00:00:15","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/12762.html.txt","/var/www/straped/mufon/org/12762.html"],"Weather Factors":"None","Date of the Event":"08/31/2008 08:50 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.839489,+-118.335329(12762)&iwloc=A&hl=en\"> mufon case (12762) map </A>","Tags":"City","Log Number":"US-09242008-0010","Disposition":"IFO","Date Submitted":"08/31/2008 08:50 UTC","Country":"United States"}