{"Region":"Colorado","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.747094,+-104.977263(12767)&iwloc=A&hl=en\"> mufon case (12767) map </A>","Date of the Event":"09/24/2008 07:30 UTC","Country":"United States","Object Shape":"Fireball, Oval","City":"Denver","Sighting Duration":"00:01:30","Weather Factors":"None","Summary":"Large circular fireball, dark circle after fire faded; after about 30 seconds","Date Submitted":"09/24/2008 07:30 UTC","Longitude":"-104.977263","divs":["Sighting DetailsMy daughter, boyfriend our neighbor and I were standing on our porch at our home when my daughter pointed out something in the sky. We looked up in the sky and it looked like a very large fireball. It was extremely bright and was moving rather fast, but not as fast as an airplane. Initially we thought it was a comet or meteor because of the fire-like appearance however it had no 'tail, and after about 30 seconds the flame faded out and we could clearly see a dark circular object slowing down. It continued southwest through the sky. The dark object then began to quickly descend. We were sure that it was going to crash at the speed it was traveling, and we waited to see some kind of smoke in the sky as a result of the crash, but nothing happened. If it did in fact land, it would have landed somewhere southwest of Denver. We've seen planes, weather balloons, blimps, helicopters...but nothing like this. Every one of us was in shock because we just couldn't pinpoint what might look or move like this object."],"Object Features":"Unknown","Disposition":"Unknown","Latitude":"39.747094","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 24th 2008"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09242008-0015","Object Flight Path":"Path with directional change","Case Number":"12767","files":["/var/www/straped/mufon/html2text/12767.html.txt","/var/www/straped/mufon/org/12767.html"]}