{"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","trends":["There has been one other sighting in Kennett","There were no other sightings in Kennett on or around September 24th 2008"],"Weather Factors":"None","Country":"United States","Tags":"City","Latitude":"36.236176","Date of the Event":"09/24/2008 06:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.236176,+-90.055649(12766)&iwloc=A&hl=en\"> mufon case (12766) map </A>","Source":"MUFON","Case Number":"12766","Region":"Missouri","Object Features":"None","Longitude":"-90.055649","divs":["Sighting Details I just got home from going to the store and was getting out of my car when I saw a flash of light in the sky. When I looked up I saw it was the sun reflecting off of an object. I wasn't sure what it was so I watched it to see if it was a plane or something else. The light only reflected of it for a few more seconds then I could see it long, and cylindrical. It was kind of grayish in color and appeared to be moving kind of slow for a plane. It was moving from the southwest to the northeast. Just to the northwest of the object I could see a jet flying higher and faster in the opposite direction. I could hear no sound from either one and could see no exhaust trail from the object but I could see one from the jet. As the object moved closer and more in front of me I could see there were no visible wings. It was low enough that if there were any wings they should have been at least somewhat visible. At this time I went in the house to get my wife to look at it and when I came back outside I couldn't see it anymore. I took my groceries in and came back out and it was back but appeared to be farther away but I could still see it pretty good and then my wife got a look at it too and agreed that it didn't look like any plane that she had seen before. We continued to watch it until it disappeared in the distance. As it got farther away it looked like it was descending but that could've been because of the angle it was moving away at. As it disappeared there was another jet was coming from north of where I last saw the object. Both jets were also military type jets, in this area were rarely see any commercial jets as the nearest major airport is 100 miles away in Memphis, TN. I've never seen a ufo before but have always been interested in them and believe they exist, but I'm very objective when I look at things and if I had the slightest idea that this was a plane I would never report it. I'm 43 and this is the first time I can honestly say that I saw something in the sky that I couldn't explain. I'm not saying that it was aliens because it probably wasn't but I know it wasn't a plane, helicopter, blimp or anything like that."],"files":["/var/www/straped/mufon/html2text/12766.html.txt","/var/www/straped/mufon/org/12766.html"],"Date Submitted":"09/24/2008 06:15 UTC","Sighting Duration":"00:10:00","Log Number":"US-09242008-0014","Summary":"Slow moving cylindrical shaped object flying at low fairly low altitude.","Object Shape":"Cylinder","Disposition":"Unknown","City":"Kennett"}