{"Viewing Distance":"Unknown","Date of the Event":"09/24/2008 08:56 UTC","Tags":"City","Object Flight Path":"Undisclosed","Longitude":"-86.127489","files":["/var/www/straped/mufon/html2text/12768.html.txt","/var/www/straped/mufon/org/12768.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWe were looking at the stars and saw what we thought was a shooting star. It was traveling to the left of us at a high speed (shooting stars usually travel at high velocity from one point to another point and then disappear); it then moved in an inconceivable way, not like an airplane. It traveled up and then it traveled down. Then it became brighter, and then it stopped moving. The brightness started to dim and then it disappeared. All this happened within a matter of 2 minutes. It was amazing. I posted a sighting a few days ago about a star-like object radiating blue, green and red lights. Tonight, it was out again. It was around 9:30pm and it was situated north of us, to the left of the big dipper, which I used as my guide. About one hour later, this object was no longer where it was originally. It was now east of us, situated to the right of the big dipper. Around 10:45pm, an object appeared below this \"star-like object\" which radiated a red glow. It then traveled up, or north, and then disappeared. I completely froze. This was not an airplane, nor a star. I stayed out there for about 5 minutes to see if i was wrong or if it would re-appear, but it never did."],"City":"Westfield","Case Number":"12768","Log Number":"US-09242008-0016","Region":"Indiana","Latitude":"40.042815","Date Submitted":"09/24/2008 08:56 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.042815,+-86.127489(12768)&iwloc=A&hl=en\"> mufon case (12768) map </A>","Country":"United States","Disposition":"Insufficient Data","Summary":"Star-like object flies horizontally, vertically, and then it disappears plus other sighting","Object Shape":"Star-like","Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There have been 8 other sightings in Westfield","There were no other sightings in Westfield on or around September 24th 2008"]}