{"Summary":"Walking in park near home, flash of light up in the clouds caught my attention. Looked up to see small round object moving slowly across from N.E. to S.W.","trends":["There have been 2 other sightings in Harpers Ferry","There were no other sightings in Harpers Ferry on or around September 25th 2008"],"Object Flight Path":"Stationary,Straight-line path","City":"Harpers Ferry","divs":["Sighting DetailsI was walking in the park this morning near my house, and as I approached the base ball field, a glint of light caught my attention as I was looking at the cloud formations. I thought at first that it was just an airplane , but on further observation, noticed a couple of things. 1) It was way above the clouds, like maybe 60,000 feet, 2) had a brilliant glow when the sun would shine on it, and 3) appeared to be a little round ball with no wings. Also as I watched it, it didnt seem to be moving along like a jet plane, but seemed to meander along as if it where being pulled or towed. It had not wings, no contrail, and no noise. Stayed on a N.E. to S.W heading and If I had to guess, I would say air speed to be around 1000 miles and hour, as it crossed my field of vision in about four minutes, at an altitude of at least 60,000 ft. I have a feeling that I may have been looking at a satellite, but dont know if satellites can be seen in broad daylite, even with the sun reflecting of them, but this object did have a really high level of brightness when it would come from behind the clouds into the sunlite. I guess if I go to the park at 11:00 AM tommorrow and look up in the same spot Ill see it again if in fact it was a satellite. Anyway it dissapeared of to the southwest out of my field of vision, and just after that, I observed to Jets moving in the same general direction behind it."],"Source":"MUFON","Country":"United States","Case Number":"12773","Weather Factors":"None","Log Number":"US-09252008-0005","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-77.738882","Viewing Distance":"Unknown","Latitude":"39.325379","Date of the Event":"09/25/2008 11:00 UTC","Region":"West Virginia","Tags":"City","files":["/var/www/straped/mufon/html2text/12773.html.txt","/var/www/straped/mufon/org/12773.html"],"Object Shape":"Flash, Star-like","Date Submitted":"09/25/2008 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.325379,+-77.738882(12773)&iwloc=A&hl=en\"> mufon case (12773) map </A>","Object Features":"None"}