{"divs":["sighting detailssecond time i think i've seen this. appeared first as a dot...almost as if a plane, on the western sky above the mountains west of boulder, colorado, just after sunset. could be a star...but no stars were visible to the east yet. could be a plane...but stayed around for 10 - 15 minutes as it slowly lowered to the west and behind the trees\\mountains. could be a satellite??? when i focused in, was a ring with a dot inside of it. when i've blown up or darkened the image became much clearer. saw a ring of lights (blue, red, white, other colors???) spinning around it when focusing. probably should have tried putting the camera (a little digital 7 megapixel lumix\\panasonic on video mode to capture the lights, but didn't think about it and was trying for a good still image. when i \"sharpen\" the images i can see the lights, but they appear as small circles around the biggest concentric circle. maybe it's the rings around saturn and saturn at sunset??? or who knows. i'm not going to try and be the judge...but enjoy. (september 24, 2008, 7:14 pm, 60 degrees farenheit, just after sunset)."],"Weather Factors":"Unknown","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=40.017526,+-105.261986(12770)&iwloc=A&hl=en\"> mufon case (12770) map </A>","Case Number":"12770","City":"Boulder","Sighting Duration":"00:15:00","Date of the Event":"09/24/2008 07:14 UTC","Log Number":"US-09252008-0002","Country":"United States","Date Submitted":"09/24/2008 07:14 UTC","Disposition":"IFO","Summary":"Circle with lights spinning around it visible west of Boulder, Colorado for 15 minutes.","Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-105.261986","Object Features":"Undisclosed","Tags":"City","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around September 24th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/12770.html.txt","/var/www/straped/mufon/more/12770_submitter_file1__Dots.jpg","/var/www/straped/mufon/more/12770_submitter_file2__Wakaranai.JPG","/var/www/straped/mufon/more/12770_submitter_file3__Wakaranai1.JPG","/var/www/straped/mufon/org/12770.html"],"Latitude":"40.017526"}