{"Date Submitted":"09/24/2008 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.941452,+-97.074715(12776)&iwloc=A&hl=en\"> mufon case (12776) map </A>","Object Flight Path":"Straight-line path","Object Shape":"Star-like","Longitude":"-97.074715","Country":"United States","Disposition":"Unknown","Summary":"saw what looked like 2 stars moving in tandem by DFW Airport-not a plane","divs":["Sighting DetailsWednesday night, sitting on my staircase outside using the phone i witnessed what initially looked to be 2 stars moving south in tandem over the course of 10-20 seconds. They were at a 75 degree angle from where I was moving directly away from me. At first when i looked up, i thought that they were stationary and I had a split second to think that \"those stars are really close together.\"--but were definitely moving The lead 'star' was profoundly brighter than the back 'star' which remained at a constant dim or dull brightness. Over the next several seconds, the lead light dimmed to the same illumination of the light following. They continued moving South and eventually were not visable anymore. I live next to DFW airport and have for the last 5 years and what i saw was not a plane. i'm estimating that these \"tandem lights\" were 20-40 feet in the air which would make the distance between each light tremendous in size. The object or lights i witnessed were deliberate and was not a satellite, \"shooting-star\" or a plane."],"Case Number":"12776","Weather Factors":"None","Source":"MUFON","Date of the Event":"09/24/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/12776.html.txt","/var/www/straped/mufon/org/12776.html"],"Latitude":"32.941452","Sighting Duration":"00:00:15","Object Features":"Unknown","Tags":"City","City":"Grapevine","trends":["There have been 6 other sightings in Grapevine","There were no other sightings in Grapevine on or around September 24th 2008"],"Viewing Distance":"Over One Mile","Region":"Texas","Log Number":"US-09252008-0008"}