{"trends":["There has been one other sighting in Ashland","There were no other sightings in Ashland on or around September 25th 2008","This sighting has never been favorited.",""],"Summary":"Three bright red lights in triangle shape","Country":"United States","Region":"New Hampshire","files":["/var/www/straped/mufon/html2text/12779.html.txt","/var/www/straped/mufon/more/12779_submitter_file1__famous_cases.jpg","/var/www/straped/mufon/org/12779.html"],"Object Flight Path":"Undisclosed","Object Shape":"Triangle","Viewing Distance":"Unknown","Longitude":"-71.630632","Source":"MUFON","Case Number":"12779","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","City":"Ashland","map":"<A HREF = \"http://maps.google.com/maps?q=43.695351,+-71.630632(12779)&iwloc=A&hl=en\"> mufon case (12779) map </A>","Date of the Event":"09/25/2008 07:50 UTC","divs":["Sighting DetailsHello, For the second time, in the same location, I have seen ufo(s). Tonight it was different than 4 years ago. It was approximately 7:50PM , Thursday, September 25th, 2008. While driving north on 93, just passing exit 24 (Ashland, NH) to the Left, between the south and north lanes almost to tree line height, there were three very bright red lights in the shape of a triangle. The distance between the lights must have been at least 30 ft. It was very brief, just there, then not there. Like it went disappeared. The sky was not clear, so it was hard to see. I looked for other crafts, ours or there's. I always look for some sign of ufo's when I drive through there, which is every day & night. Since I saw the ufo about four years ago in the same spot. Although it was a few months later in the year, the lights were white & yellow, allot smaller looking and there were several aircraft on the horizon, I mean allot of aircraft. When I finally got home, I went onto my deck and looked at the skyline, you could still see several planes on the horizon. I have never seen that many, hardly any to be exact. There was definitely something that night four years ago. I contacted a local ufo person and corresponded my sighting to him. I have saved the emails, but they are at work. I can be more exact when I find them and can give you exact dates and details. If you have heard of anyone else experiencing sightings like mine in my area, I would be interested in hearing the details. I know I am not crazy, I saw something. Weather or not it is a true UFO, that I do not know. attached pic is from your website, it is exactly what I saw."],"Tags":"City","Latitude":"43.695351","Date Submitted":"09/25/2008 07:50 UTC","Log Number":"US-09252008-0011","Weather Factors":"Unknown","Disposition":"IFO"}