{"Country":"United States","Date Submitted":"08/08/2008 12:00 UTC","Longitude":"-116.557882","Disposition":"Unknown","Latitude":"43.547647","Object Shape":"Star-like","Region":"Idaho","City":"Nampa","Object Flight Path":"Path with directional change","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/12784.html.txt","/var/www/straped/mufon/org/12784.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.547647,+-116.557882(12784)&iwloc=A&hl=en\"> mufon case (12784) map </A>","Sighting Duration":"Undisclosed","Case Number":"12784","Tags":"City","Summary":"Small Star-like object taking moving quickly in random directions, over vast distances.","Date of the Event":"08/08/2008 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 15 other sightings in Nampa","There were no other sightings in Nampa on or around August 8th 2008"],"divs":["Sighting DetailsI was in Nampa for the night and was sitting out behind our trailer looking up at the sky with some friends. We were testing our knowledge of the sky, trying to one up each other with points of interest when we saw something moving toward the east in the part of the sky we were focusing on. One of my friends suggested it was a shooting star at first, but it wasn't moving fast enough and didn't burn out. The next decision was that it was probably a satellite, but as we continued to watch it started to make a large arc around the north-eastern portion of the sky and started heading south. It was making large arcs, at an impressive speed, so we had no idea how to classify it. We lost sight of the object when it became so faint in the southern sky we could no longer track it. It was definitely too high to be a plane, especially at the speed it was moving. IT also seemed to have a minor pulse the entire time It was a very interesting experience, and we are all a little stumped over here. We were all in awe, and left rather speechless by the event. It was a day or two before we talked about it again, but everyone agreed that we saw something that night. I supposed we're most interested to know if anyone else in that part of the country saw anything interesting in the sky around that time in August. -M"],"Log Number":"US-09262008-0004","Viewing Distance":"Unknown"}