{"Country":"Canada","Summary":"Went outside for a cigarette, Night sky was clear and visible. Saw street light orange colored object, thought it was moon, Got bigger as it came closer to me, changed shape, Went inside. It went back the other way,And disappeared shortly after.","Log Number":"CA-09262008-0003","Object Features":"Unknown","divs":["sighting detailsi went outside for a cigarette. night sky was clear and visiblility was good, except a couple of small clouds. behind this one cloud was an orange hue. i thought it was the moon and thought it was strange-so i kept looking. it started coming towards me, the shape changed, i realized it was not the moon, it looked like a burning plane. though no sound was heard. i kept on watching thinking it was going to crash and i was preparing myself to dial 911. as it came closer to me, it took on a more rectanglular\\square shape. i was watching it for a few more seconds then went back in. saw the prime time special on ufo's and didn't want to become an abduction eyewitness. when i went inside, i watched from the window, the object went back in the direction it came and got smaller. i went upstairs and woke up my husband. by the time i convinced him to come downstairs and look, it was gone."],"Viewing Distance":"101-500 Feet","Latitude":"48.778694","Date Submitted":"09/21/2008 11:20 UTC","Region":"British Columbia","trends":["There have been no other sightings in Duncan","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City","Longitude":"-123.707861","City":"Duncan","Case Number":"12783","map":"<A HREF = \"http://maps.google.com/maps?q=48.778694,+-123.707861(12783)&iwloc=A&hl=en\"> mufon case (12783) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Shape":"Boomerang, Fireball, Oval, Square, Rectagular","Sighting Duration":"00:03:23","Date of the Event":"09/21/2008 11:20 UTC","files":["/var/www/straped/mufon/html2text/12783.html.txt","/var/www/straped/mufon/org/12783.html"],"Disposition":"Unresolved"}