{"Object Shape":"Disc, Sphere","Source":"MUFON","Region":"Queensland","Object Features":"Unknown","divs":["Sighting DetailsLast night I was very upset, so I decided to stay in the park and not go home. (Big trouble with room mates, but that's another story.) I sat down with laptop and tried to relax but I had the flu and I was sick. (You know, cold chills, sore throat...) It was very cold. And it was getting dark fast. I was feeling worse by the minute, that cold weather would have seriously made me sicker... and then suddenly I knew I had to walk home to sleep. It wasn't really my choice... it was more like a warning. 'Go home and sleep, you're sick.' Not verbal, just ...hard to explain, it was very stern, almost threatening. I got to the home about ten minutes later. Door was jammed. (See above about room mates. lol ) I gave up and sat down outside in the cold again, on the driveway. In the cold. It was while I was sitting on the driveway that I just happened to look up and there it was. At first I thought 'plane?' because it was dark and I saw the lights straight off. But instantly I knew it wasn't. I suddenly saw a ...for lack fo a better term... saucer shaped thing. No, more like two bowls glued together sort of shape. It had lights all around it and was coming out of the heavy clouds. It was also competely quiet. It was not high up either. I wasn't afraid when I first saw it. I knew it was looking for me. But I was emotionally strung up about the arguement with room mates and felt homesick, plus this UFO on top of things... so as soon as I realized it was looking for me, I panicked, I rang the house phone and made the room mate let me in, even if she was putting baby to bed. (I would have waited otherwise in the cold.) We live under frequent air traffic. Planes come and go all the time above us, Quantus, Virign mostly... and we CAN hear them, even when they're on the horizon, they are coming down to land at Brisbane airport. This wasn't one of them. It was low, I could see the shape, it had no sound even so close. It was not that hte wind blew the sound away- I'd watched several big airplanes just ten or twenty minutes ago. And this UFO was upwind, sound would have traveled to me, Anyway, as I got indoors, it passed over some houses about twenty metres away, heading for the park that I had been sitting at. Like it was unsure where I was. I would normally take pictures but I really wasn't in an emotional state to think about that! But even with my panic, even though you' assume I'd sit with people... so I felt safer... I went to my room. On my own. Shut the door, lay down, and fell asleep. I woke up at about 9:50pm... maybe... and felt so groggy, so out of it. I didn't feel fluish anymore, just really stunned and numb, like a lesser extent of what I felt like after general anesthetic. Someone had been knocking on the door and I hadn't even heard them, I'd just gotten up for water and for panadol. And I couldn't bring myself to tell anyone about it till today. There was too much stuff going on last night to tell them."],"Latitude":"-27.078929","Viewing Distance":"21-100 Feet, 101-500 Feet","City":"Caboolture","Date of the Event":"09/25/2008 06:50 UTC","Case Number":"12781","Weather Factors":"Windy","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12781.html.txt","/var/www/straped/mufon/org/12781.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=-27.078929,+152.957279(12781)&iwloc=A&hl=en\"> mufon case (12781) map </A>","trends":["There has been one other sighting in Caboolture","There were no other sightings in Caboolture on or around September 25th 2008"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Date Submitted":"09/25/2008 06:50 UTC","Summary":"Saw a UFO crossing over.","Country":"Australia","Tags":"City","Longitude":"152.957279","Log Number":"AU-09262008-0001"}