{"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=45.51412,+-73.547032(12788)&iwloc=A&hl=en\"> mufon case (12788) map </A>","Disposition":"Hoax","Source":"MUFON","Latitude":"45.51412","Sighting Duration":"00:10:00","Weather Factors":"Windy","Case Number":"12788","divs":["Sighting DetailsIt was a very cold cloudy afternoon in November 1995 my best friend and I were smoking a cigarette outside talking in my backyard balcony on the third floor duplex in the east end of Montreal, and I told him I could not stay any longer outside because it was much too cold. I Insisted for him to come inside , but he refused and seem to be in a strange kind of mood as though something was telling him to stay outside and suddenly he shouted and call my name to come outside quickly, he look up and fought he saw at huge dark black bird, but in fact it was all kinds of bright lights red ,orange yellow ...we were amazed could not believe we were looking at the underneath part of the spacecraft as it was passing at a very slow speed above us moving furthur East, and we had a good view of it was a triangle smooth shape gray metallic craft, I would say a mothership it was huge and hovering about 1000 feet above us it was very close to us there were no window that we can see. we saw it for a good 10 mintutes as was moving away from us. We were sure that this event would be on the evening news but nothing was said. I wish I had a camera on that moment."],"City":"Montreal","files":["/var/www/straped/mufon/html2text/12788.html.txt","/var/www/straped/mufon/org/12788.html"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"11/19/1995 04:29 UTC","Longitude":"-73.547032","Date of the Event":"11/19/1995 04:29 UTC","Log Number":"CA-09262008-0008","Object Features":"Wings","Object Flight Path":"Straight-line path","trends":["There have been 47 other sightings in Montreal","There were no other sightings in Montreal on or around November 19th 1995"],"Region":"Quebec","Summary":"mother ship","Object Shape":"Triangle"}