{"Source":"MUFON","Object Features":"Undisclosed","City":"Binghamton","Date Submitted":"09/24/2008 07:30 UTC","Country":"United States","Object Flight Path":"Stationary,Straight-line path","Tags":"City","Summary":"i went out to call in my cat, it was dusk not many stars out yet ,my eyes were drawn to the s,west skies when i saw a glowy orange pillar shaped object","divs":["Sighting Detailsthe kids just came home from there dads it was about 7:30 pm on wed nite.my daughter was looking for her cat and she was not inside. i opened the front door and began to call the cat,when my eyes were drawn to the south west sky.it was dusk the sun was nearly set and the sky was pink ,there were no stars visible in that part of sky yet ,although in the eastern sky they were just starting to peak out.above the tree line there it was, it was pillar shaped ,up and down , it was absolutely positively not a plane or any thing i have ever seen in the sky before. the whole object was a vibrant yet soft glowey orange. from the top, about a third way down were flashes of blue and light green lights going in sequence with an occasioned red one. they did not flash or blink ,they seemed to be just going on and off around the object again not in a blinky type fashion . I immediately got my boy friend ,and i said to him what is that? he was quite, it was stationary for some time before it moved very slowly, as if to say we know your watching get a good look .when it started to leave our sight it did not co up it moved across the sky continuing in the s.westerly direction we watched it until we could no longer see it ,we even stood on tipppy toes to keep it in sight until it was no more. when i say it ,i was sort of scared but more excited ,in fact i said no dont go i want to keep looking, my boy friend was kinda weirded out and told me to hush up. neither of us can deny what we saw . we live near no army base ,nor do we live near any air ports in fact we live in the middle of the woods."],"Sighting Duration":"Undisclosed","Case Number":"12786","Longitude":"-75.917974","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around September 24th 2008"],"Log Number":"US-09262008-0006","Date of the Event":"09/24/2008 07:30 UTC","files":["/var/www/straped/mufon/html2text/12786.html.txt","/var/www/straped/mufon/org/12786.html"],"Region":"New York","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=42.098687,+-75.917974(12786)&iwloc=A&hl=en\"> mufon case (12786) map </A>","Object Shape":"Cigar, Cylinder","Latitude":"42.098687"}