{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12791.html.txt","/var/www/straped/mufon/org/12791.html"],"Latitude":"43.246503","Weather Factors":"Unknown","Longitude":"-79.887275","Region":"Ontario","divs":["Sighting DetailsI was heading outside to see whether I needed to put Frost Netting on my gardens as it was supposed to be a clear, cold night. I looked up to see whether it was a clear night - or had clouded over (it was starting to cloud over - light wispy clouds) - and noticed a bunch (roughly 9) of bright coloured lights (some Red (3), some Green (6)) travelling in an Easterly Direction in a rough Diamond like formation. The lights looked like little fluorescent balls. It continued in this formation, moving at the same speed, until it had moved out of sight (horizon , distance wise). It was probably in sight for about 1 minute. I am not sure what it was - but I know what it wasnt. I have spent many nights out in the spa pool and have seen planes, satellites and shooting stars on many occasions - this was not any of them. Afterwards I was excited and bewildered - but also disappointed that no one else was home to see it too. I then attempted to make contact with the Local Meteorolgical and Astrnomical Societies - to advise them on what I saw - as maybe someone else saw it too."],"City":"Hamilton","Object Flight Path":"Straight-line path","Date of the Event":"09/26/2008 09:20 UTC","trends":["There have been 15 other sightings in Hamilton","There were no other sightings in Hamilton on or around September 26th 2008"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.246503,+-79.887275(12791)&iwloc=A&hl=en\"> mufon case (12791) map </A>","Log Number":"NZ-09262008-0011","Summary":"Bright Lights Travelling In Formation - Some Green (6), Some Red (3)","Tags":"City","Object Shape":"Sphere","Case Number":"12791","Object Features":"Unknown","Date Submitted":"09/26/2008 09:20 UTC","Disposition":"Unknown","Country":"Canada","Viewing Distance":"Unknown"}