{"Date Submitted":"08/31/1982 12:00 UTC","Latitude":"37.500373","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"12790","Object Features":"None","Date of the Event":"08/31/1982 12:00 UTC","Longitude":"-117.186121","Object Shape":"Oval","Object Flight Path":"Path with directional change","Tags":"City","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/12790.html.txt","/var/www/straped/mufon/more/12790_submitter_file1__MapofSiting.jpg","/var/www/straped/mufon/org/12790.html"],"Weather Factors":"Unknown","Log Number":"US-09262008-0010","Disposition":"Insufficient Data","City":"Goldfield","Region":"Nevada","trends":["There has been one other sighting in Goldfield","There were no other sightings in Goldfield on or around August 31st 1982","This sighting has never been favorited.",""],"divs":["Sighting DetailsA friend and I drove to work every day from Goldfield Nevada to a nearby gold mining claim in the mountains above the small town of Lida Nevada. One day, shortly after turning off hiway 95 at the Cottentail Ranch and driving toward Lida on hiway 266, we spotted a rather large whitish-silvery elongated ball-like (oval) object flying low and hugging the base of the mountain ranges. I drove faster to see if I get to that location before it flew away but there was at least a 6 mile stretch of desert between us, and it was moving too fast. It flew from north to south at a speed slower than a jet or missle but much too fast for a baloon. The whole event took place in about 12-15 seconds. Now the interesting part of all this is that some months later, I was watching a documentary on tv about people who had been sneaking up the top of the mountains at the Nevada bombing range and taking photos of the buildings and such, hoping to catch a picture of something interesting. One of the photos that was shown was of a large air strip with a hanger. Here, in front of that hanger, was exactly what I saw flying about months earlier. I searched the internet to find that photo with no luck. The object flew very smooth and kept it's speed the whole time. It followed the mountain terrain perfectly. Never zigged-zagged. There were no wings, windows, lights or markings of any kind that I could see. It could be likened to a large flying chicken egg, whith the larger of the eggs oval ends both front and back. (ie. no pointy end). The object flew out of site between the mountains. I have never seen anything like it before or since."],"Summary":"White-Silver oval shaped object flying low along the base of the mountains.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.500373,+-117.186121(12790)&iwloc=A&hl=en\"> mufon case (12790) map </A>"}