{"Case Number":"12799","files":["/var/www/straped/mufon/html2text/12799.html.txt","/var/www/straped/mufon/org/12799.html"],"Object Shape":"Star-like","Weather Factors":"None","City":"Castle Rock","Longitude":"-104.84764","Date of the Event":"09/26/2008 08:35 UTC","Source":"MUFON","Latitude":"39.376112","Log Number":"US-09262008-0019","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around September 26th 2008"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.376112,+-104.84764(12799)&iwloc=A&hl=en\"> mufon case (12799) map </A>","Date Submitted":"09/26/2008 08:35 UTC","divs":["Sighting DetailsStanding on deck looking at the sky when I noticed that there was a really bright star that shouldn't be in that spot of the night sky. Watched it for about 5 minutes, started flashing. Didn't move at all, but kept getting brighter and putting off red and blue flashes. Grabbed binoculars and realized it was actually a cluster of 3 lights, white, red, and blue. At first the lights were horizontally aligned, then would instantly change, though didn't see the transition, to a pyramid shape, then to two, one on top of the other, with the third next to it. The lights pulsed one at a time, going around the formation. They were very rhythmic in their movement. About 15 or 20 minutes later, it still hadn't moved, when a plane came close to it. The plane had to suddenly adjust its course and go up and over it very quickly. As it did this, the lights jerked sideways, like they were moving out of the way. All in all, the lights stayed for almost 45 minutes in the same spot, and were relatively low, lower than normal air traffic. There wasn't a sound associated with it either. The light then faded, almost like it was receding and heading N, NW, but staying at the same elevation, and then disappeared."],"Country":"United States","Tags":"City","Region":"Colorado","Summary":"Blue, white, red light formation in NW sky, facing Sedalia, from Castle Rock, off of RT 85","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Stationary,Path with directional change","Viewing Distance":"501 Feet - 1 Mile"}