{"trends":["There have been 4 other sightings in Prince George","There were no other sightings in Prince George on or around October 15th 1985"],"Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"2 small distant light's zipping across space irradically, covering a large area in very little time.","Log Number":"CA-09262008-0012","Latitude":"53.91848","Date of the Event":"10/15/1985 12:00 UTC","files":["/var/www/straped/mufon/html2text/12792.html.txt","/var/www/straped/mufon/org/12792.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.91848,+-122.776584(12792)&iwloc=A&hl=en\"> mufon case (12792) map </A>","City":"Prince George","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Object Features":"Unknown","Tags":"City","Longitude":"-122.776584","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","Date Submitted":"10/15/1985 12:00 UTC","divs":["Sighting DetailsMy girlfriend and I were out for a walk in the evening it was completely dark and the sky was clear. As we were walking we were looking at the star's when I noticed 2 small light's that looked like star's zig-zagging across the sky. One would move at a high rate of speed and cover a great distance then stop dead, the other would do the same keeping up with the first. My girlfriend and I both witnessed it and were both in agreement that nothing of this planet could do what these 2 light's were doing. The most puzzling thing about these light's were that they would stop dead and they appeared to be in outer space not in the sky or in our atmosphere. I am 100% convinced that what I saw was a UFO. I have seen sattelite's and aircraft at night and this was of no comparison as they can't stop dead in the sky or zig zag like these lights were doing. These light's took about 5 minute's to go from horizon to horizon which is incredibly fast. It was an amazing sight and we were privlidged to see it."],"Region":"British Columbia","Country":"Canada","Object Shape":"Star-like","Case Number":"12792"}