{"Object Shape":"Bullet, Missile, Star-like","divs":["Sighting DetailsAt 8:30pm decided to look at stars it was a really clear night. We live close to Port of Los Angeles so it is very rare to see that many stars so clearly. I looked up and saw what looked like a star moving at a high rate from the direction of Catalina Island north. I then called my 3 kids to come out ( ages 13, 11, 8) to see if they would see anything and few minutes later another star like object appeared moving in the same direction at same speed and then slowed down. My kids were screaming. Then in the blink of an eye I don't what was but a streak of light sparked across the sky north the same direction where the object had slowed down. It then picked up speed and another one appears going south toward Catalina Island. About 5 minutes past and then another one appeared going east to west we watched it did not take ekes off of it and it disappeared right before our eyes. These were not planes, we live under the flight path of Lomita Airport, and sometime depending on conditions Long Beach Airport changes there flight patern. These were not military planes doing there normal patrols of the Los Angeles Harbor. These objects were star like in apperence moving faster then military jets able to slow down and flying at such a high altitude that I think its impossible. Please contact me and let me know if anyone else wittnessed this. There is something going on it almost looked like the video that's on YouTube from the space shuttle where you see multiple about flying about and weapons being fired at these objects. This very real my children witnessed it along with me. Thank You Maria Ford"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.749691,+-118.385017(12809)&iwloc=A&hl=en\"> mufon case (12809) map </A>","Object Features":"Undisclosed","Disposition":"IFO","Summary":"Fast moving multiple objects and moving north south and east","Longitude":"-118.385017","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/12809.html.txt","/var/www/straped/mufon/org/12809.html"],"Region":"California","Case Number":"12809","Tags":"City","Country":"United States","Log Number":"US-09272008-0010","Latitude":"33.749691","City":"Rancho Palos Verdes","Date of the Event":"09/26/2008 08:35 UTC","Viewing Distance":"Unknown","Date Submitted":"09/26/2008 08:35 UTC","Source":"MUFON","trends":["There have been 4 other sightings in Rancho Palos Verdes","There were no other sightings in Rancho Palos Verdes on or around September 26th 2008"]}