{"Region":"Indiana","City":"Greenwood","divs":["Sighting DetailsIt was about 11PM and I was laying in bed awake when I chanced to look for the occasional UH-60 Blackhawk out the window, but what I saw threw my body into overdrive. At first, being a believer in UFO's, I assumed thats what it was. So as I looked closer I saw a thin blue light screaming by at low level heading Northeast at a precise altitude. I immediatly bolted for my camera phone and snapped a picture as it screamed to the angle where my windowsill covered it. What I saw when I zoomed in was a bright light surrounded by what looked to be a cloud of vapor. I continued to watch it as I took mental notes on position, hight, sound, and I even took the time to clock the relative speed. I placed it at about 300ft. off the ground which was roughly eye level. I worked out the speed to be somewhere around 1000mph, and created a mental picture of it for on the spot referencing. It seemed to be traveling Northeast, which fits the object based on the only other report from the state. Today I had an old friend look it it to confirm that it was not a military jet, however I knew it couldn't be due to the fact that the traffic pattern for all three of the airports in my area go over the other side of the property. As my friend reviewed it she came to the conclusion that the light was created by a strong artificially created electromagnetic force field. Unfortunately the color of the object was distorted while transfering the digital photo to my computer. This caused it to turn green. She also inferred that for 1 milisecond the objects light seemed to dim, as if it started to move away as soon as I saw it, or it saw me. I was referred here by that friend in hopes of finding more information, and I ask that no official investigations be conducted. The only way I would like to be contacted is through my Email, Thunderbolt31@hotmail.com, by other witnesses only."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.617658,+-86.104383(12801)&iwloc=A&hl=en\"> mufon case (12801) map </A>","Object Features":"Undisclosed","Tags":"City","Country":"United States","Log Number":"US-09272008-0002","Source":"MUFON","Longitude":"-86.104383","Latitude":"39.617658","Date of the Event":"08/05/2008 12:00 UTC","Viewing Distance":"Unknown","Case Number":"12801","Disposition":"Insufficient Data","Date Submitted":"08/05/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/12801.html.txt","/var/www/straped/mufon/more/12801_submitter_file1__Untitled-1.jpg","/var/www/straped/mufon/more/12801_submitter_file2__p_00095.jpg","/var/www/straped/mufon/org/12801.html"],"Weather Factors":"Unknown","Summary":"Blue light flew by my window, I grabbed my camera phone and snapped a picture","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around August 5th 2008","This sighting has never been favorited.",""],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}