{"Date of the Event":"07/12/2005 12:00 UTC","Weather Factors":"None","Disposition":"IFO","Object Flight Path":"Straight-line path","Longitude":"-72.823074","Sighting Duration":"Undisclosed","Summary":"Sited object traveling so. to no. at high speed. No sound. large, golden!","Log Number":"US-09272008-0005","Viewing Distance":"501 Feet - 1 Mile","City":"Wallingford","Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.457011,+-72.823074(12805)&iwloc=A&hl=en\"> mufon case (12805) map </A>","Date Submitted":"07/12/2005 12:00 UTC","files":["/var/www/straped/mufon/html2text/12805.html.txt","/var/www/straped/mufon/more/12805_submitter_file1__scan0002.jpg","/var/www/straped/mufon/org/12805.html"],"Country":"United States","trends":["There have been 4 other sightings in Wallingford","There were no other sightings in Wallingford on or around July 12th 2005","This sighting has never been favorited.",""],"Object Features":"Unknown","Tags":"City","Source":"MUFON","Case Number":"12805","divs":["Sighting Details At work in Wallingford, Ct. Went to loading dock at rear of building for a smoke break. While standing on the loading dock a large object caught my eye. The object was traveling South to North and at a high rate of speed. Altitude was hard to discern as a cloudless sky and no size reference. Best guess 1 to 2 thousand feet. Observed object for approx. 6 to 8 seconds until tree line obscured it. Waited to hear the sound of engines or some propulsion noise but none heard! Speed hard to say, best guess would be around 3 to 4 hundred mph. Object was golden in color. Same color as pure gold, had a orange tinge to it and was enveloped by a aura of same color. No visible windows or openings. Right away I told all at the shop what I'd seen! I also told them that I was thrilled to have been so fortunate to have experenced such an event! The area where the object was viewed should have been seen by many many people. Kept waiting for reports of sightings but none were ever reported. Spent over 4 years in USAF as a Weapons Control Repair Tech. in the 50's, early 60's. Just turned 70 ! not prone to fantasy."],"Latitude":"41.457011","Object Shape":"Other"}