{"Tags":"City","Log Number":"US-09272008-0007","Disposition":"Unknown","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around September 26th 2008"],"Summary":"Transparent almost invisible","Longitude":"-96.691396","files":["/var/www/straped/mufon/html2text/12806.html.txt","/var/www/straped/mufon/org/12806.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.027423,+-96.691396(12806)&iwloc=A&hl=en\"> mufon case (12806) map </A>","Region":"Texas","Source":"MUFON","Object Features":"Patterned Surface","Latitude":"33.027423","Country":"United States","Sighting Duration":"00:00:45","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Object Shape":"Circle, Diamond, Oval, Square, Rectagular, Unknown","divs":["sighting detailsi was going to the store with my daughter and stepped outside to get in the truck. as we usually do at night we both look for the stars and moon. as i was pointing out stars to her i noticed what at first seemed to be a small star cluster obscured by the city lights, except it started moving. my daughter sensed something was out of place when i asked her \"what is that?\" she buried her head into my shoulders as i followed it, with a sense of wonder and a little fear\\excitement. i am not sure what shape it was as it did not have defined edges, possible oval, diamond, or square. as i followed it for what was a little over 1\\2 a minute it finally went out of site\\focus. i initially thought it was maybe a flock of birds, but the formation was very tight and stable, like one single object, and when i initially saw it it was not moving, or moving slowly directly overhead, which is how i was able to spot it. i could only guesstimate the elevation of approx 1500ft. it was like small points of very faint light ever so slightly connected to each other, like a transparent single object. we live in an approach lane for dfw airport, this object was moving west to east. the planes are easily spotted moving east to west. very strange, i cannot stop thinking about what it was."],"Case Number":"12806","Viewing Distance":"501 Feet - 1 Mile","City":"Plano","Date of the Event":"09/26/2008 08:15 UTC","Date Submitted":"09/26/2008 08:15 UTC"}