{"Summary":"black V gliding aross black skies","Log Number":"US-09272008-0008","trends":["there have been no other sightings in cms\\jat n\\a","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","Longitude":"-154.484362","Disposition":"IFO","Object Shape":"Chevron","Country":"United States","Region":"Alaska","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12807.html.txt","/var/www/straped/mufon/org/12807.html"],"Object Features":"Unknown","Date of the Event":"09/26/2008 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=63.593903,+-154.484362(12807)&iwloc=A&hl=en\"> mufon case (12807) map </A>","Latitude":"63.593903","divs":["Sighting DetailsOk, this is the second time I'm typing this, since the first one didn't go through. First of all, we live on a military base so I could have seen anything. We don't have a great view of the sky either, so I consider myself lucky to have seen what I saw. It was just after 9pm and I went outside to potty the dogs. The sky was pretty clear, directly above me was Cassiopeia (if that helps) and I was facing what I believe to be northeast. At first I thought it was a squirrel running across the power lines which is how it caught my eye. Then I realized it wasn't on the power lines but above. The whole \"sighting\" last a few seconds so it's hard to describe. I saw this dark v-shaped object (or objects) literally gliding by. No sound which is what confused me the most I believe. At first I thought it was a flock of birds flying, but I realized it was \"gliding\" too fast and kept it's shape the whole time. It's hard to describe because the sky was dark, there was light pollution in the direction it was flying and the object itself was dark (no lights) and it just blended into the darkness after a couple seconds. I always thought I would be scared to see a UFO but this happened so quickly and suddenly I actually felt elated and lucky to have glimpsed it in the first place! I immediately went in to tell my husband and he came out and I was hoping it would come back so he wouldn't think I was crazy (too late!) but it never came back. He seems to think it was a stealth bomber, but what I saw I wouldn't call \"solid\" or a \"triangle\". It was a v, and the word \"inky\" keeps coming to mind to describe it's blackness. I don't really want to get too involved but I wanted to report it just the same. I don't know what I saw, but I described it as best I could."],"Case Number":"12807","Tags":"City","City":"cms/jat n/a","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"09/26/2008 09:10 UTC"}