{"files":["/var/www/straped/mufon/html2text/12803.html.txt","/var/www/straped/mufon/org/12803.html"],"Date of the Event":"09/27/2008 11:00 UTC","Date Submitted":"09/27/2008 11:00 UTC","Log Number":"GB-09272008-0004","Case Number":"12803","Sighting Duration":"Undisclosed","Latitude":"53.41794","Object Shape":"Sphere","divs":["sighting detailslocation ; liverpool, england whilst walking my dog today with my partner tre, at about 11am this morning i glanced up to the sky to see an aeroplane and what seemed like a couple of red spheres come into the sky from nowhere. the spheres started to change into a white colour after about 1 minute. they were flying faster than the plane but not in any formation at first. then more started to appear up until about a total of 15 spheres started to slow and follow in the slip stream of the plane. i watched this occur for about 10 minutes until the sight of the plane and the spheres disappeared into the distance. when i got home, i got out my sat nav and recorded the exact location. both i and my partner witnessed this occurence. i also remember that each sphere had a white \" aura \" about it. in size to the plane, they were about 15 of them side by side equalled 3\\4 of the plane. i am saying this is a possible sighting because of their speed, appearance from nowhere, the aura of the spheres, trailing the plane ( which i guess was a passenger jet at @ 20,000 feet ), the ability to be so close together as a bundle until they fell into a formation of following the plane. unfortunately, i could not take a photograph with my mobile phone as it was a sunny morning and to high for a picture. the spheres did not appear to be balloons as their actions were to deliberate."],"Summary":"Sighting in sky of approx 15 white spheres following a aeroplane.","trends":["There have been 17 other sightings in Liverpool","There were no other sightings in Liverpool on or around September 27th 2008"],"Longitude":"-2.989016","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Unknown","Weather Factors":"Light","Region":"England","City":"Liverpool","Viewing Distance":"Unknown","Country":"United Kingdom","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=53.41794,+-2.989016(12803)&iwloc=A&hl=en\"> mufon case (12803) map </A>"}