{"Date of the Event":"02/18/1978 08:00 UTC","Object Shape":"Oval","Country":"United States","Sighting Duration":"Undisclosed","trends":[],"Source":"MUFON","City":"Undisclosed","Region":"South Carolina","Viewing Distance":"21-100 Feet","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=33.838421,+-81.155134(12814)&iwloc=A&hl=en\"> mufon case (12814) map </A>","Log Number":"US-09272008-0015","Date Submitted":"02/18/1978 08:00 UTC","Object Flight Path":"Stationary","Tags":"City","Weather Factors":"Does Not Apply","Longitude":"-81.155134","divs":["Sighting DetailsOn the evening of February 18, 1978. I went to check on my clothes in the laundry room. I lived in a apartment complex. In Summerville S.C. I left the laundry room and ran back to my apt, but I had to stop and look around. I felt as if I was going to be attacked. There was no one. But then I looked up and saw a beautiful oval shape craft. It was about 60 feet in lengh. It was hoving above the trees. About 50 feet up. And it stayed there for at least five minutes. There was a light humming sound. The color was metalic blue.It had three flood lights,vents and a circular shape in the middle. It was so beatiful, No screws or bolts. I was not afraid. I thought to myself that these beings were not monsters. But that they were just like us. I turned my head and noticed that my friend on the second story, with her window shades wide open and her lights on, she was watching also. I then watched the craft assend slowly up and then it shot up into space and stopped, then it shot to the left. I was amazed at what I had just witnessed."],"files":["/var/www/straped/mufon/html2text/12814.html.txt","/var/www/straped/mufon/org/12814.html"],"Case Number":"12814","Latitude":"33.838421","Summary":"Hovering above me ,metalic blue oval craft with three flood lights. Each light was spaced between each vent. Three vents in all. Canister shape in the middle. I was fasinated with seeing it.","Object Features":"Undisclosed"}