{"Summary":"oval shapped object with some kind of aura around and bright middle part","trends":["There have been 91 other sightings in London","There was one other sighting in London on or around September 26th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","divs":["Sighting DetailsHi There, I was walking along Thames river path on above mentioned date and time for sight seeing and to see proposed art on Thames river exhibition. I was on north bank of river opposite to mayor's building. I was just taking photos of nice night scene of tower bridge and pier lit in green. I took below attached photo of tower bridge and mayors building with pier in view on above mentioned time. I used my sony ericsson K800i phone with 3.2 cybershot camera. I have submitted two photos in previous report and this is just after that lets say in 15min after when i was on tower bridge i took one photo looking south side of the bridge from middle. I saw some weird object in my mobile screen after taking photo so i again quickly take another snap in almost same position. and again after that i take few more photos but in these two photos this oval shaped object is visible. This obejct wasn't visible with naked eye. It was only on photo. It was bit strange cause in none of other photos anything like that appear. It also dosne't look like some kind of light refection or..light scattering . I suspected that it might be some dust particles on my mobile phone lenses and due to lighting it glows like that. But it wasn't present in all other images which i took on that day. Quite strange. I don't know what it is. They are prominent in these two images. Could it be ufo? I don't think it's stars or planes. It would be fascinating to see if anyone else reported it or found same things in their photos. Cause that day it was very nice day clear sky and many tourists around. Thanks for investigating and providing this facility to report. I hope some of your scientists would help me out in this regard. I have attached 3 photos here."],"Object Shape":"Egg, Oval","Sighting Duration":"Undisclosed","City":"London","files":["/var/www/straped/mufon/html2text/12820.html.txt","/var/www/straped/mufon/more/12820_submitter_file1__DSC03341.jpg","/var/www/straped/mufon/more/12820_submitter_file2__DSC03342.jpg","/var/www/straped/mufon/more/12820_submitter_file3__DSC03343.jpg","/var/www/straped/mufon/org/12820.html"],"Region":"England","Case Number":"12820","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.515389,+-0.120655(12820)&iwloc=A&hl=en\"> mufon case (12820) map </A>","Tags":"City","Weather Factors":"None","Latitude":"51.515389","Viewing Distance":"Unknown","Date of the Event":"09/26/2008 08:30 UTC","Longitude":"-0.120655","Date Submitted":"09/26/2008 08:30 UTC","Object Features":"Dome, Other","Country":"United Kingdom","Log Number":"GB-09282008-0006","Source":"MUFON"}