{"Object Shape":"Other","Source":"MUFON","Case Number":"12822","Viewing Distance":"Over One Mile","Object Features":"None","Weather Factors":"None","Date of the Event":"09/26/2008 11:27 UTC","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/12822.html.txt","/var/www/straped/mufon/more/12822_submitter_file1__UFORecreation.jpg","/var/www/straped/mufon/org/12822.html"],"Summary":"UFO desguised as a flock of birds passing at night!","Log Number":"US-09282008-0008","Sighting Duration":"Undisclosed","Date Submitted":"09/26/2008 11:27 UTC","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around September 26th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=30.446576,+-84.278783(12822)&iwloc=A&hl=en\"> mufon case (12822) map </A>","Latitude":"30.446576","divs":["Sighting DetailsI normally would be skeptic of the stories that I would hear about seeing UFO's, but that night I'm pretty sure that I became a believer. It was was the night of September 26th 2008 at some where around the time of 11:15pm.I remember that the sky was the equivalent of being a beach with no lights around you, while the sky was crystal clear(not a cloud in the sky. I thought it was kind of weird because we hardly ever get nights like that here in my city. I was letting my dog outside to use the bathroom, when I just so happen to look up at the sky like i do every night to look at the stars. Flying right over head at the exact time i looked up was what i thought looked like birds flying in V-formation at first glance. but quickly realized that there was something wrong with how fast they were flying and how it looked. The duration of what i was was pretty brief and lasted with direct flight for about 6-10 seconds max in my field of view. If i had to guess how far up above me it was i would have to say around 15,000 feet or close to it. There were 5 lights that had one in front leading with two on each opposing side forming off to make a \"V\" in the sky, and never once broke formation(which makes me think that they were part of something way bigger than just these lights i saw). Now this part is really going to sound really strange and i have a hard time believing it myself but... the lights were not bright at all....as a matter of fact...it had the same effect to them as when you see on movies and a spaceship has a cloaking device activated. It was that effect that made me at first think that it was birds flying until a kept observing it. If was flying from north-west to east, and I followed it with eyes from first sight til I lost sight of it continuing east over a tree line. What i saw, was not accompanied with any sound what so ever(for the height flew over), no flashing lights, and no distinguishable shape except for the \"V\" formation that it was in. I still can't get what I saw out of my head, nor can I wrap my brain around it. And the fact the it looked somewhat cloaked was just something I could not believe right out of a movies. And it moved pretty rapidly and very steady across the sky. I don't know what I saw, but I can guarantee that it wasn't a flock of birds, and definitely not and airplane.! I attempted to use Photoshop to try and recreate what i saw, although its to give a rough idea as to how wild it was, I wanted to trt and show you what the cloak effect kinda looked like."],"City":"Tallahassee","Country":"United States","Region":"Florida","Longitude":"-84.278783"}