{"trends":["There have been 8 other sightings in Lakewood","There was one other sighting in Lakewood on or around September 26th 2008"],"City":"Lakewood","Log Number":"US-09282008-0010","Viewing Distance":"Unknown","Date of the Event":"09/26/2008 06:30 UTC","Summary":"Sighting over Lake Erie at Edgepark","Object Features":"Unknown","Latitude":"41.489303","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Object Shape":"Unknown","divs":["Sighting Detailssort of like aerodynamic long body with wings. really big and got wide at the end. it was dark and this was a silhouette they were seeing. the lights were the most interesting part of the object. Knew it wasn't a plane has a single light non flashing the lights on this object were all over and covered the entire craft instead of flashing at a constant rate therre were many rates all different colors erradically and quickly looked sparkling. DJ friend got a video on phone poor quality. the lights changed orange green red blue yellow. In Lakewood hanging out at friends house. early morn walk. hadln't planned on going to lake. past park while walking down the road right on lake side. park area with picnic area and trees. hill , slopes down 30 deg. to lake. path and then cliff. at the blottom of cliff was a beach. Stopped aton path and had a weird feeling. Like some psychic thing. She had to go down to beach. There was a hidden area. There was animal and plant debris and saw pagan ritual stuff. Had sacrificed some osrt of animal. Checked out for 15 minutes. Put meteor in pocket. Walking slow and turned around. Beach on Right side trcleveland behind her sun just starting to come up behind cleveland. walking back up saw real bright light from south and flying low. DJ and her were looking at it. They watched it going from Left to Right. siIlent. feels it was connected to pagan stuff they saw. There was a sun dial pointed at north star. the ufo flew in direction thing was ointing. It changed directions had erradic movement. Then it blasted off fast towardsnorth. another came up from behind. same type.and flew off in same direction. saw a bouy or bigship in the distance. hovering around ship.. it landed on water and 30 seconds later 2 lights popped out from where it came from. 2 separate things flying in formation. flew into the direction of north star and disappeared. from the time seen to disappear it was like 10 minutes aor more. Meteor-not sure what it was. Friend suggested that's what it might be. She's pretty sure. She put it back where she found it and does not have it. Plus 4 other little pieces. Not a rock she says. It was in a crafter. Looked as though they built ceremony around meteor."],"Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12824.html.txt","/var/www/straped/mufon/org/12824.html"],"Country":"United States","Disposition":"Unknown","Longitude":"-81.796751","map":"<A HREF = \"http://maps.google.com/maps?q=41.489303,+-81.796751(12824)&iwloc=A&hl=en\"> mufon case (12824) map </A>","Case Number":"12824","Date Submitted":"09/26/2008 06:30 UTC","Region":"Ohio"}