{"Tags":"City","Date of the Event":"09/26/2008 08:15 UTC","Case Number":"12832","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.982316,+-81.749399(12832)&iwloc=A&hl=en\"> mufon case (12832) map </A>","Country":"United States","Latitude":"27.982316","Longitude":"-81.749399","files":["/var/www/straped/mufon/html2text/12832.html.txt","/var/www/straped/mufon/org/12832.html"],"Disposition":"Insufficient Data","Source":"MUFON","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Eagle Lake","There were no other sightings in Eagle Lake on or around September 26th 2008"],"Viewing Distance":"101-500 Feet, Unknown","Summary":"I was on top of a press box filming a football game when i saw a bright object fly over.","divs":["Sighting DetailsI was at a highschool football game up on top of the press box filming the game for the head coach. It was cool out around 74deg I was looking E, ESE maybe. The game started at 7:30pm. It was still in the 1st quarter so I guess the time was about 8:15pm. I was filming each play and then stoping the camera. As I stoped the camera I saw what I at first thought was a rocket like a fireworks rocket It had a tail and a bright spot at the front I watched it for about 3 sec then it just winked out I was kind of waitihg for a pop sound thinking it was a fireworks but I did not here one. The more I thought about it the more it just did not add up. 1. I was below the field lights as bright as they were I should not have been able to see it that clearly. 2. It made no sound now the field PA was on and the crowd was loud so this may not apply. 3. It flew stright not in a arc. 4.It looked bright and soild it was just as bright at the tail as the tip. I dont know what it was and I'm only reporting this so if someone else got a better look you have another source to say yes there was something there. If someone else did see something please let me know what thay saw.If you have any questions feel free to call the provided after 7 pm est Thank You"],"Log Number":"US-09292008-0003","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Florida","City":"Eagle Lake","Object Shape":"Bullet, Missile, Star-like","Date Submitted":"09/26/2008 08:15 UTC"}