{"Disposition":"Unresolved","Object Shape":"Sphere, Star-like, Unknown","Region":"England","trends":["There have been 9 other sightings in Leeds","There were no other sightings in Leeds on or around September 28th 2008"],"Sighting Duration":"00:02:00","Weather Factors":"None","Viewing Distance":"21-100 Feet","Country":"United Kingdom","Longitude":"-1.541447","Tags":"City","Date of the Event":"09/28/2008 06:51 UTC","Object Flight Path":"Path with directional change","Date Submitted":"09/28/2008 06:51 UTC","City":"Leeds","Object Features":"None","files":["/var/www/straped/mufon/html2text/12830.html.txt","/var/www/straped/mufon/org/12830.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.807319,+-1.541447(12830)&iwloc=A&hl=en\"> mufon case (12830) map </A>","divs":["Sighting DetailsWell where should i start this is not the first time we have seen these things but is the first time i have reported it. Me and my girlfreind desided to go outside for a cig because we dont smoke in the house. We were out for about 5 minuites before spotting a star like object comeing towards us from the west we knew it was nothing any human would have made because of the way it moved from side to side as it was makeing its path accross the sky the object tended to pulse in brightness the more it speeded up. There was no engine noise for this object it was silent as it flew overhead and carried on towards the east aventually vanishing behind the trees out of veiw. this is the 3rd sighting of exactly the same object my girlfreind could not beleive what she was seeing again as she has seen the other 2 siteing too. It was a very awsome site still exited about it while posting this report. I did try to record the site with my girlfreinds Sony Erricson W850i but the camera was rubbish and just saw darkness i am now going to buy a night vision camera to start a sky watch to try catch these on camera and finally have proof."],"Source":"MUFON","Latitude":"53.807319","Log Number":"GB-09292008-0001","Case Number":"12830","Summary":"Ufo bright Orb moveing from west to east"}