{"Log Number":"CA-09292008-0007","Object Shape":"Star-like","Sighting Duration":"00:00:06","Country":"Canada","Date Submitted":"09/18/2008 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Latitude":"43.33524","Region":"Ontario","Source":"MUFON","Longitude":"-79.794942","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"09/18/2008 12:00 UTC","Summary":"Time lapse photography of a bright star like object moving slowly and progressively getting fainter until it vanished.","City":"Burlington","map":"<A HREF = \"http://maps.google.com/maps?q=43.33524,+-79.794942(12836)&iwloc=A&hl=en\"> mufon case (12836) map </A>","divs":["Sighting DetailsSept 18, 2008 8:48 p.m. At home in my backyard as usual I was taking time lapse pictures of planes, jets, stars and Jupiter with a clear night sky. I use a remote cord attached to my Nikon D80 digital camera, mounted on a tripod. Set on manual focus, ISO 400 Fine, on bulb at F4.5. (usually) My lens is a DX AF-S NIKKOR 18-135 mm. To preset my camera focus I use Jupiter because it is small and bright. I can see Jupiter with its moons when I zoom in on my image. Of course with time lapse every visible star draws a line due to the rotation of the earth. Planes and jets with their flashing lights will track lines and flash points. Some very interesting array of patterns can be pictured this way. Whenever I spot a dull or bright star like object moving slowly across the night sky I immediately turn my preset focused camera, frame and shoot using time lapse photography. These star like objects always move slowly in a straight line and fade out or sometimes I have seen them also appear into view and fade out again or just sit still and disappear. Most sightings last 5 to 6 seconds but no more than 30 perhaps. ATTACHED PICTURE for Sept 18, 2008 8:48 p.m. At home in my backyard. I saw a large white star like object moving slowly in a straight line. Immediately I turned my preset focused camera, framed and opened my shutter using my time lapse while I watched the light progressively getting fainter until it vanished to the naked eye, which lasted about 10 seconds from the time I had noticed it. I am not sure but I think I left the aperture open for 12 to 15 seconds. Unfortunately I framed this star like object a little too low moving out of my picture area before it faded away. After I took the picture I zoomed in on that portion of the black sky littered with stars, to see what looks like the very faint object spiraling, creating a weird corkscrew path that diminished in diameter. I think it's a bit out of focus too. I have no idea how high or how large this spinning object was moving. I have on other nights photographed such star like objects as well but this one is probably the most dramatic picture I have taken so far. My feelings are mixed. The cosmos has endless possibilities for any form of life, consciousness, technology and science that can only provoke more questions than concrete answers. To witness moments like mine are awesome. I wish is to spread the word to other star gazers with better camera lenses and video cameras so that we can capture better images than mine. Perhaps this method may shed some light about their propulsion systems. I think the corkscrew turning indicates a certain flying method in entry or exit from earths sky's. Who knows what stealth or wonders man made or alien may exist. Maybe it is just a common unnoticed phenomenon in nature. David Sereda, I believe has talked about the \"Galaxy Clock\" \"Electromagnetic wave patterns vibrating so fast within a space that they give the illusion that mass is solid. Because of this dichotmoy, mass is believed to be both made of particles and waves. Particle and wave theory are fusing together as they are both revealing the same thing. All mass has waves that vibrate at different frequencies.\" I hope to receive an experts opinion as to what I've photographed. I will accept any answer other than a hoax."],"trends":["There have been 5 other sightings in Burlington","There were no other sightings in Burlington on or around September 18th 2008","This sighting has been favorited 1 time.",""],"Case Number":"12836","files":["/var/www/straped/mufon/html2text/12836.html.txt","/var/www/straped/mufon/more/12836_submitter_file1__Sept182008UFO.jpg","/var/www/straped/mufon/org/12836.html"]}