{"Object Features":"Undisclosed","Case Number":"12839","Log Number":"US-09292008-0010","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.35983,+-95.296202(12839)&iwloc=A&hl=en\"> mufon case (12839) map </A>","divs":["Sighting DetailsI am reporting this as was told to me. A man and his wife have been seeing some strange objects in the sky between 8 and 8:30 for the past few weeks. During the indicated time frame, he reported seeing a star-like object in the southwest. He presumed it to be a planet or star until he noticed the object flashed colors of red and green. He viewed the object with the usage of binoculars, but was unable to obtain a decent image on account of not having a tripod and the human tendency to not be perfectly still. However, the object still flashes the colors of green and red. Since the first episode, he has viewed up to five of these objects in the sky simultaneously - one lies in the West, one in the Southwest, one in the South, one in the North, and one in the Northeast. According to him, all of these objects are brighter than the normal \"stars\" he views in the night (he has been observing the night sky for a number of years). He mentioned the one in the Southwest had two objects either going around it or the two objects were stationary but equidistant from the main point source object, and these two objects were also flashing green and red. The objects appear to be between 20 and 30 degrees above the horizon and they sink below the horizon as time progresses. He has contacted several friends and relatives about the event, and though they might not see the same total number, all of them have reported seeing the objects and the flashing colors. Again, he first thought they were planets or stars, but after seeing the flashing colors of red and green, he suspected the objects were something else, but he doesn't know what."],"Summary":"5 star-like objects were apparent in the night sky between 8 and 8:30 over the past few weeks","Longitude":"-95.296202","City":"Tyler","Region":"Texas","Country":"United States","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/12839.html.txt","/var/www/straped/mufon/org/12839.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around September 29th 2008"],"Object Shape":"Star-like, Unknown","Tags":"City","Date Submitted":"09/29/2008 12:00 UTC","Date of the Event":"09/29/2008 12:00 UTC","Latitude":"32.35983","Weather Factors":"Unknown"}