{"trends":["There have been 11 other sightings in Sierra Vista","There were no other sightings in Sierra Vista on or around June 28th 2008"],"City":"Sierra Vista","Viewing Distance":"Unknown","Latitude":"31.595004","Sighting Duration":"Undisclosed","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.595004,+-110.327897(12847)&iwloc=A&hl=en\"> mufon case (12847) map </A>","Tags":"City","Object Shape":"Blimp, Cylinder","Country":"United States","Log Number":"US-09302008-0001","Region":"Arizona","files":["/var/www/straped/mufon/html2text/12847.html.txt","/var/www/straped/mufon/org/12847.html"],"Case Number":"12847","Source":"MUFON","Summary":"A silver and white Cylinder object ascending and descending in altitude between 15K-25K in Southern Arizona.","divs":["Sighting DetailsI am an instructor for the US Army on Ft Huachuca, Arizona. Part of my duties requires me to travel to Middle Garden Canyon trail on Ft Huachuca. On one of these excursions I was sitting on a post and just happened to look up and noticed this silver and white object lingering above the mountains. I initially thought it was a weather balloon as it was during the Monsoon season. I watched this thing float in the air for probably 45 minutes to an hour. During the time I was watching this the object seemed to ascend and descend in altitude. Now the whole time I'm veiwing this object it seemed to either reflect the sunlight or flash a light almost as if it were spinning and only one side was silver or really shiny. In my best estimate it was probably somewhere around 15,000 to 25,000 feet in the air. To cover this object at an arms length you would probably have to use the cap of a Bic pen. It moved off towards mexico as it ascended and descend in altitude. A co-worker radioed this into one of the military instructors at our base camp and he reported it to the Border Patrol but they informed him it was one of thier balloons. I am not an expert or even heard of Baloons being controlled. Now I usually bring my camera but unfortunately this trip I had left the camera at home. Now also during this time there weren't very many clouds in the sky, and the ones that were weren't in the same area as this object. I wish I would have known about this website and your organization at the time of the incident then I would have been able to give more details. If you wish I can take you to the area I witnessed this object. You will have to have a SUV as you can't take a sedan to this area. After witnessing this object for about 15 minutes I myself determined it to be a UFO. Most of my Co-workers heard teh call across the radio and when we were all gathered together I was harrassed a little bit. I lost sight of the object as due to work requirements I had to move up the mountain. At the same time I would say the object ascended to between 25,000 and 30,000 feet off towards Mexico."],"Date Submitted":"06/28/2008 11:59 UTC","Date of the Event":"06/28/2008 11:59 UTC","Disposition":"IFO","Longitude":"-110.327897","Weather Factors":"Windy, Light","Object Flight Path":"Stationary"}