{"City":"Dixon","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-09292008-0012","Date of the Event":"09/02/2008 02:16 UTC","Object Shape":"Other","Tags":"City","Object Features":"Undisclosed","Region":"Illinois","Summary":"I promised myself I wouldnt report this","Weather Factors":"Unknown","Case Number":"12841","Longitude":"-89.473248","trends":["There have been 5 other sightings in Dixon","There were no other sightings in Dixon on or around September 2nd 2008","This sighting has never been favorited.",""],"Date Submitted":"09/02/2008 02:16 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.840491,+-89.473248(12841)&iwloc=A&hl=en\"> mufon case (12841) map </A>","Sighting Duration":"00:00:02","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"41.840491","files":["/var/www/straped/mufon/html2text/12841.html.txt","/var/www/straped/mufon/more/12841_submitter_file1__Siragusa.jpg","/var/www/straped/mufon/more/12841_submitter_file2__152.jpg","/var/www/straped/mufon/org/12841.html"],"divs":["Sighting DetailsThis was a breaking point. I was the guy who reported the st charles sightings and talked a little stupid. Anyways I love MUFON sight so ill share this was so cool. To be honest I was at a farm ranch in Dixon , home of Ronald regan for a DUI weekend getaway. So having seen shooting stars numerous times and funny lights moving slowly for a long time I decided to wander off after the rest of the bunch went to bed. So I took a walk on the farm ranch and it appeared the entire sky started following me and this white bright light i see nightly over our house in st charles blinked on and off multiple times as if it knew i was watching the skies for it. So being a fool like I am and acting like Moses I screamed out loud in a way and said \"come pick me up Yeshua , come Shu come Eset, Im not afraid\" deep in the middle of a deserted ranch by myself. So then I said Show me a sign at least , that guy in Arizona gets to see the full show on a regular basis. And this amazing thing happening. This Neon blue thing swooped down like the size of 3 football fields at like 10 times the speed of any plane ive ever seen. It was amazing so I spent until 4 am trying to get abducted and obviously it never happened. I dont pray or go to church. Love Jolly Roger"]}