{"Date of the Event":"09/21/2008 01:00 UTC","Sighting Duration":"01:15:00","Log Number":"US-09302008-0013","map":"<A HREF = \"http://maps.google.com/maps?q=38.429719,+-77.406516(12859)&iwloc=A&hl=en\"> mufon case (12859) map </A>","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"09/21/2008 01:00 UTC","Object Shape":"Unknown","Region":"Virginia","divs":["Sighting DetailsAround 10 pm, I went outside my friend's residence to smoke a cigarette. I had an uneasy feeling about being outside by myself. I dont recall actually returning inside the residence, but my roommate's fiance remembers me walking back inside but I did not speak to or look at anyone when I came back in. About an hour later my roommate's fiance found me asleep in the guest room on the couch. She thought that I was crying so she went outside to get my roommate to comeinside and talk to me. When she went outside she found him wandering towards the edge of the trees. She had to call his name multiple times to get his attention. Finally he responded and came inside where he found me lying on the couch with my arms extended like I was chained up. He woke me up and asked me what was wrong. I explained to him that I had no idea what had happened but that I vividly recalled being on a craft. I was lying naked on a table, and there was a group of slender, gray-colored figures standing over me. I remember watching them slice my chest open then a bright light came on over me and two of the entities began speak loudly, almost like shouting, at one another and motioning towards me. The next thing I remembered was my roommate waking me up. I explained to him that I was extremely paranoid and uneasy about being alone outside, so he came out to smoke with me. While we sat outside smoking I looked up and saw a figure crouched on top of the carport. I pointed the figure out to my roommate and then we began to become very uneasy. We began to look around the yard and saw more figures around the edge of the trees. We decided that it was way too risky to be outside, so we went back inside. Right before we entered the house we saw a figure at the end of the fence so we stopped and looked at it, right as we opened the door the figure moved back behind the fence. While we were outside we called to the figures several times thinking that they may be some neighborhood kids messing around. Not a single one of the figures moved away from us, except for the figure at the fence."],"Latitude":"38.429719","Viewing Distance":"Unknown","Disposition":"Hoax","trends":["There have been 3 other sightings in Stafford","There were no other sightings in Stafford on or around September 21st 2008"],"Summary":"There was no siting of a UFO, but my roommate and I both witnessed several entities.","Longitude":"-77.406516","Tags":"City","Source":"MUFON","Country":"United States","City":"Stafford","Case Number":"12859","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12859.html.txt","/var/www/straped/mufon/org/12859.html"]}