{"divs":["Sighting DetailsEach time I have experienced a siting I've been quietly enjoying a cigarette while seated in my backyard. I had not ingested or smoked any kind of mind altering substance. The most recent siting (approx. Sept 23 2008) was a dark night, and the sky was clear of clouds and some of the brighter stars were visible as they usually are from our back-yard. Three of us suddenly saw a white round ball of light (much, much larger than a star) that was totally silent moving across the North Eastern sky at a steady but fast pace for about 5 seconds; then it simply disappeared about 30 degrees up from the horizon - in mid-air. It seemed to be moving from the North to the East. It was hard to determine how high it was, but it seemed to be flying at the level of jets. There were no flashing lights, no colours and no sound following behind as a jet rumble usually does. We were at a loss to find an explanation for what it was, but it was not the first time we had seen this type of object in the night sky from our back-yard. Earlier this summer (approximately mid-July) another witness and myself were sitting in my backyard and we saw basically the same large, silent white ball of light moving from the North more in a South Easterly direction before it disappeared. It seemed to be moving more slowly but as steadily with no variation in direction or speed...and no accompanying sound. During the summer of 2007 I saw the same type of white ball of light 7-8 times from the back-yard. Each time they were moving in the same fashion, sometimes faster, and from west to east or south to north (sometimes straight, and sometimes in arching trajectory) disappearing in mid-air. Only once did I see one continue to beyond the horizon. I was alone for about 4 of the sitings from our yard, and there had been 4 others witness the other sitings. Last summer,I also saw one following a tree-line while I was outside a cottage on the north shore of Prince Edward Island. The silent, white ball of light was steadily moving from west to east following the tops of the trees. It seemed to be only about several hundred feet above the trees, but it did not look gigantic as one might expect if it was that close to the ground, so I was confused about where it actually was. It did not disappear, but continued until it was beyond the tree-line at the horizon. The most memorable siting occurred last summer, approximately mid-August 2007, from my backyard. This siting occurred at around 10:00 pm. My back-yard is lined on the north and south by tall elm trees leaving a clear vantage of the S.E., East and N.E. sky. I noticed through the trees a white, silent white ball of light moving in the southern sky. I continued to watch it until it was clearly visible and beyond the trees, and a heartbeat after it cleared the trees it's size and brightness expanded with a huge flash...it took my breath away...and then it went back to it's normal size - continued steadily for 4 seconds and then disappeared in mid-air. It seemed to be moving from the south to the north in an arching fashion before it disappeared. I felt extremely excited and yelled for anyone in the house to come out. One friend came out after I ran to the door and called upstairs. He sat outside with me for about 3 minutes and the same type of white, silent ball of light became visible in the north-east sky and moved steadily toward the south for about 5 seconds and then disappeared. This was the first time he had seen anything like this and he was dumbfounded. I was extremely excited by this experience...it felt like the expansive white flash of this ball of light was exclusively directed at me. Of course, my skeptical side dismissed it all as perhaps a satellite hitting the sun's rays at that moment. On the other hand, it was too big to be a satellite. I have no answers, only experiences and questions."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/23/2008 09:30 UTC","Log Number":"CA-09302008-0010","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Features":"Undisclosed","Tags":"City","Longitude":"-63.11752","Country":"Canada","Region":"Prince Edward Island","Summary":"From our backyard facing east we saw a bright, white, silent ball of light move from North to East but disappearing in mid-air.","Object Flight Path":"Straight-line path","Object Shape":"Star-like","City":"Charlottetown","Source":"MUFON","Disposition":"Unresolved","trends":["There have been 6 other sightings in Charlottetown","There were no other sightings in Charlottetown on or around September 23rd 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.251317,+-63.11752(12856)&iwloc=A&hl=en\"> mufon case (12856) map </A>","Latitude":"46.251317","Case Number":"12856","Date Submitted":"09/23/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/12856.html.txt","/var/www/straped/mufon/org/12856.html"]}