{"files":["/var/www/straped/mufon/html2text/12857.html.txt","/var/www/straped/mufon/more/12857_submitter_file1__B.R.Croninnarrative.jpg","/var/www/straped/mufon/more/12857_submitter_file2__B.R.Croninmap.jpg","/var/www/straped/mufon/more/12857_submitter_file3__B.R.Cronin12857pics.jpg","/var/www/straped/mufon/more/12857_submitter_file4__B.R.Cronin12857aerialview.jpg","/var/www/straped/mufon/org/12857.html"],"Latitude":"38.963677","Summary":"I saw a UFO or two UFO's on September the 25th of 2008. It was between 10:00pm and 11:00 pm. The object at first was flashing colors up in the sky. Then it came close and it was a circular lighted object almost the color of a star, but a little warmer.","Disposition":"Unknown","City":"Bethel","Log Number":"US-09302008-0011","Longitude":"-84.080766","trends":["There has been one other sighting in Bethel","There were no other sightings in Bethel on or around September 25th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI walked down to my garage at around 10 and 11:00 pm on September the 25; it was a Thursday night. I was putting my cat in the garage, but before I did that, I walked out to my gate and was gazing at the western sky. It was a dry, warm night, and there were stars out, and a few airplanes in the sky. There is nothing but a field where I was looking; I live in the country. As I was looking out into the field, I saw an object in the sky, a little bit above tree-height, flashing colors. It was an object that seemed to flash colors as it looked to be turning. Or it looked like it might be spinning. The lights emanating from the object were different colors - pink, blue, green... pastel colors. The object was completely silent, and hovered for 10 mintues or so. I couldn't really make out the shape of this UFO. I went up to the house to get my film camera and video camera. When I came back it was gone ...I was disappointed because I had asked the UFO to stay (there) so that I could get a picture. I took my cat into the garage, and when I came out of the garage I walked over to the shop, which is a couple of feet away; and for some reason, I looked down at the ground, looking at the bushes. All of a sudden I looked up and there it was! Staring right at me. In another spot close to me and my gate. It was at tree-top height directly across from me, in front of a house, across the road. The field I was looking at, before, is right alongside the house across the road. The UFO appeared totally different now. It was circular, and of a starlike color, only a little warmer (color). It was white, though. It hovered for a minute or so while I picked up my cameras and took pictures. When I aimed my film camera, I couldn't see anything in the lens, but took the picture anyway. I got my video camera up and shot that too. After I took my photos, the object, completely silent, then started to drop down from the sky toward the ground. It was completely descending to the ground, I thought. I walked over to the gate trying to get a look at it going down to the ground, but when I got around the gate, it was gone. It must have gone behind the house as I couldn't see it anymore. I was wondering why it had disappeared on me, but in the morning I viewed the spot again, where it had descended, and it obviously had to have gone behind the house. It had been further away than I had thought. It must have dropped behind the house and landed somewhere in a field. This is all farmland here. That is, if it landed, of course. I took my video film inside and put it on the tv to view. To my astonishment, I did get the UFO on video! It looked like a five pointed object or something. It looked like it was spinning. Then I got a white circular object and, a green circular object. Funny thing, the UFO that I saw on the video looked totally different than the one I saw with the naked eye (which was a circular white object). And, the circular green object, I didn't even see! It was like there were three objects out there, and my video camera picked up three UFO's. The flashing, turning UFO, and the circular white UFO. Plus, a green UFO. I thought that the flashing UFO probably traveled closer (across the field) and changed into a white circular UFO. ...But I don't know. The UFO's were one right after the other on film, so I didn't see three all at once. It could have been only one UFO changing form. Who knows? Barbara Richey Cronin"],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"None","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=38.963677,+-84.080766(12857)&iwloc=A&hl=en\"> mufon case (12857) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"09/25/2008 10:15 UTC","Date Submitted":"09/25/2008 10:15 UTC","Region":"Ohio","Case Number":"12857","Country":"United States","Object Features":"Other","Object Shape":"Circle, Flash, Sphere, Star-like"}