{"Object Shape":"Star-like","City":"Vacaville","Country":"United States","Summary":"Star like object moving around in sky random then a pattern.","Date Submitted":"07/26/1991 01:01 UTC","Latitude":"38.365077","files":["/var/www/straped/mufon/html2text/12867.html.txt","/var/www/straped/mufon/org/12867.html"],"Tags":"City","Date of the Event":"07/26/1991 01:01 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.365077,+-121.981064(12867)&iwloc=A&hl=en\"> mufon case (12867) map </A>","trends":["There have been 10 other sightings in Vacaville","There were no other sightings in Vacaville on or around July 26th 1991"],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-121.981064","Viewing Distance":"Unknown","Region":"California","Log Number":"US-10012008-0008","divs":["Sighting Details1. My two friends and I were on top of Mt. Vaca on Mix Canyon Rd. with my telescope and binoculars to do some star gazing and get a good look at Saturn. I don't remember if the moon was out or not. We were on the summit for about a half hour and got spooked by some large animals moving about so we got in the car and drove to the road headed down the mountian. We stopped at a large turn out and I pointed the car up hill so we had a great view of the north western sky through the windshield. 2. My two friends noticed it first and I didn't see it at first. They asked me if stars moved and I told them no, its probably a satilite, they only move in straight lines across the sky. My friend stated that it was moving around oddly in the sky. So I could find it he put his finger on the windshield of the car where the object was in the sky. I watched and then I found the object moving in the sky. It moved from west to east in the sky and did a circular spin like it was descending then going back up then it would go west then east. We watched it do this for twenty minutes. We were so enthralled by what we saw we never thought to use the binoculars between my friend and I in the front seat. My freind in the back seat was with the telescope and he never thought to use it either... Finally it stopped moving and just faded away like it went out into space. My friends and I weres excited and scared. In retrospect we felt really dumb for not thinking to use the optical tools we had at hand. It was only discussed between the three of us untill now 18 years later.... I learned about MUFON on the history channel and looked up the web site and here I am..."],"Case Number":"12867","Weather Factors":"None","Disposition":"Insufficient Data","Source":"MUFON"}