{"files":["/var/www/straped/mufon/html2text/12861.html.txt","/var/www/straped/mufon/org/12861.html"],"Weather Factors":"Fog, Medium","Source":"MUFON","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around September 1st 2008"],"Case Number":"12861","Date of the Event":"09/01/2008 03:45 UTC","Disposition":"Unknown","Longitude":"-122.411886","City":"San Francisco","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsIn the small hours of September 1, 2008, I was going to my room via the outside landing where it was my habit to look up at the sky as I passed. I stopped for a moment at the railing and thought to myself, I've looked up at the night sky probably many thousands of times in the last fifteen years, and never seen so much as an unexplainable light. At the very moment I finished that thought a huge thing flew silently over my head coming from behind me, moving from the East to the West. As it moved off it appeared to be traveling a bit to the South so that it would have been going South-West toward the ocean. I knew immediately that it was a UFO. It was a little overcast with wisps of fog. Only some stars were visible. The UFO was under the overcast cloud cover, with just a few wisps of fog under it, so its lights were very clear. It had four small red lights in a perfect square, and between those lights it was pitch black with no stars visible. It felt big, and solid, and maybe 20'-30' across, but I'm not very good at estimating the size, distance, or speed of anything. I couldn't make out the shape of the craft because it blended in with the night sky, and it disappeared, or had moved out of view after only about four-seconds. As it passed over, a circle of larger white lights inside the square created by the red lights came on softly. They slowly pulsed as if they were on a dimmer, and someone had slowly turned them on and then off. It moved dead steady, and fairly rapidly. I tried my hardest to keep sight of it as it moved away, but after only about four-seconds it was just gone. I was frozen to the spot, and just kept repeating OMG. I was a little afraid, and I think I stood there for maybe five-minutes. I went into my room, looked at my clock, and it said 3:50AM. This was the first sighting I've had that I couldn't dismiss as possibly some other thing. This was a month ago now, and my reactions to this experience in the days that followed were not what I would have thought they would be before this experience. Firstly, although I was a believer intellectually, knowing that something is true on a cellular level is very different. At least for me. I was shaken. I only shared the experience with two people, one of whom has also seen a UFO relatively close by. I thought I might not report it at all. I was afraid if others learned about it they would think I was crazy. I was afraid of being visited by MIB. I had a slight feeling of being \"invaded.\" I had to sleep with the lights on, etcetera. I'm feeling better, but I'm realizing that this experience really changes everything that comes after it on some level."],"Country":"United States","Sighting Duration":"00:00:04","Latitude":"37.78052","Object Flight Path":"Straight-line path","Region":"California","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=37.78052,+-122.411886(12861)&iwloc=A&hl=en\"> mufon case (12861) map </A>","Summary":"UFO flying about the height of a six-story building. Had four red lights in a square formation bordering a circle of white lights.","Date Submitted":"09/01/2008 03:45 UTC","Log Number":"US-10012008-0002","Object Shape":"Unknown"}