{"Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"10/01/2008 12:00 UTC","Disposition":"Unknown","Object Shape":"Unknown","Object Flight Path":"Undisclosed","City":"St Charles","Summary":"youd think I would be excited","files":["/var/www/straped/mufon/html2text/12863.html.txt","/var/www/straped/mufon/org/12863.html"],"Latitude":"41.918191","Country":"United States","Sighting Duration":"00:01:00","Source":"MUFON","Date Submitted":"10/01/2008 12:00 UTC","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around October 1st 2008"],"Region":"Illinois","divs":["sighting detailsi had a dream about jesus with my 2 dogs laying on my bed and i couldnt fall all the way alseep so we went down into the kitchen to eat some string cheese and i let them out in the back yard. i let them in and finished my cigarette and saw them both watching me from the kitchen screen door\\glass door. i opened the door and the west highland terrior ran under the kitchen table to escape the door opening. he completely dissappeared and i thought he ran back outside because he is wild and i looked everywhere. so in last attempts i open my parents completely shut door ( he doesnt try to push open closed doors and the knob was in locked position) and he was there laying on his doggie bed. he dissappeared and re-appeared. so after having a nightmare later at 3 am i went back outside to smoke and saw a neon blue thing 5 times the brightness of the north star hovering in the eastern skies towards chicago and appeared to blink. several mysterious planes were also in the area and the big dipper appeared to be decorated by other star like lights , destroying its pot like shape. i dont care about the second coming or eternity. at this point i need a new start and a new body. i dont know why they keep messing with me and i dont think they will ever make me happy without rebirth good luck kids"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.918191,+-88.303723(12863)&iwloc=A&hl=en\"> mufon case (12863) map </A>","Tags":"City","Viewing Distance":"Unknown","Case Number":"12863","Log Number":"US-10012008-0004","Longitude":"-88.303723"}