{"Summary":"Low flying, no sound, strobing light with big bright lights...triangle shape.","Tags":"City","Date Submitted":"09/29/2008 08:20 UTC","Sighting Duration":"Undisclosed","Object Features":"Unknown","trends":["There have been no other sightings in Pinehurst","This sighting has never been favorited."],"Date of the Event":"09/29/2008 08:20 UTC","Object Shape":"Triangle","Log Number":"US-10012008-0009","City":"Pinehurst","divs":["Sighting DetailsI was on my way home from and early band practice in Houston...usually we finish at 8:pm...but that evening we quit at 7:30pm. it takes me about 45 minutes to an hour to get home...depending on traffic. As I get about ten minutes from home...I'm at a red light on 249 N at Decker Prarie Road...there are other cars (about 6) waiting as well. I'm looking at the red light...waiting for it to turn green...when in the distance ( a mile or so)...I see lights just above the pine trees...flying low...going south above the 249 north bound lanes we're on. At first glance...to me it was a helicopter in the distance. I turned to look away for a brief second...and when I looked back at the red light...all of a sudden...what I thought was a helicopter...was all of a sudden much closer (100 yards)...and it is much larger than a helicopter. Where i'm at, 249 is 3 lanes, this plane...object...was about 1 to two lanes bigger on each side than the 3 lanes. So...it's like 5 to 6 lanes wide. By this time...it has my full attention (and everyone elses waiting at the red light cause i glanced over at them)...and is looking more like an airplane...with a large wing span...huge spot lights at the end of each wing (I'm still thinking this is an airplane), it has strobing lights like planes do at the end of what i thought were wings...and flying very very low to the groud...still flying just above the pine trees. I thought it was a plane in trouble...cause it kept dropping down...and then back up. I took a quick glance at the other cars to see if they were looking at the same thing I was. I thought for sure this was a plane in trouble because of the way it was going up an down...like bouncing in the air. I had my windows down...with no radio on. It seemed odd to me that I wasn't hearing any sound come from the airplane. The traffic light turns green...we (traffic) start to cautiously move forward when all of a sudden...it rotates 90 degrees so the lights are now top and bottom...and I thought for sure this plane is going to crash! I'm thinking to myself...this is not about to happen...no way! Brake ligths come on as we all slow down...I stopped completely...thinking this plane is about to crash right in front of me (us). Once it did the 90 degree manuver...it quickly banked to my right...and flew away from me (us) at an angle. At this point my thoughts immediately went to UFO mode. My reaction was...Is this really happening!!!! Am I really seeing what I'm F'in seeing!!!! At this moment...I knew it was not an airplane because of the manuver it did as it flew away...I was able to see the underside and triangular shape with 3 lights...one at each point. It also looked like it had smaller lights in between the big lights. I hit the gas hoping to get closer...but as it flew away at an angle...I lost it between the trees. I have no doubt that others saw what I saw. You couldn't help but keep an eye on it. No one stopped to discuss...everyone just went about their business. I'm hoping that the others that saw this will report it as well. I was gonna hold off and wait to see if I found something on the internet...but decided to go ahead and report this. I did manage to find a couple of pictures that are very similar to what i saw. Please see the attached document."],"Weather Factors":"Unknown","Latitude":"30.188854","files":["/var/www/straped/mufon/html2text/12868.html.txt","/var/www/straped/mufon/org/12868.html"],"Country":"United States","Longitude":"-95.705123","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Region":"Texas","Case Number":"12868","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.188854,+-95.705123(12868)&iwloc=A&hl=en\"> mufon case (12868) map </A>","Disposition":"Unknown"}