{"Country":"The Netherlands","map":"<A HREF = \"http://maps.google.com/maps?q=52.379036,+4.896968(12872)&iwloc=A&hl=en\"> mufon case (12872) map </A>","Weather Factors":"Unknown","Summary":"Circular flying object with white lights (non flashing) around the perimeter of the object","Case Number":"12872","Region":"Noord-Holland","Viewing Distance":"Unknown","divs":["Sighting DetailsI was at the Blauwtheehuis Cafe in the Vondelpark (Amsterdam) from about 8:30 pm - 11:30 pm. I was sitting on the outdoor terrace on the 1st floor. At approx. 9:15-9:30 pm, I happened to notice a circular flying object, with white lights all around its perimeter flying overhead in our direction. It caught my eye because it was moving pretty fast and it was the only thing in the sky, and I tend to like to look at planes from the ground so I generally look up at the sky a lot being so near a major airport. It looked pretty small, but I couldn't tell how high up it was, and it eventually flew roughly overhead. It flew quite quickly, and in a straight line, and I pointed it out to the person I was there with. I asked him what it was, and he said he didn't know. I immediately thought it could be a UFO as it definitely didn't look anything like a plane, and I'd never seen anything like it before. I lost sight of it as it flew overhead and out of sight. I forgot about the event until just now while at my friend's house when a flashing light outside from a car or something jogged my memory and after I told my friend, she and I decided to google \"UFO sighting august 28\", and we stumbled upon another report of a sighting from that night in another town in the Netherlands (Breda), so I couldn't believe it so I thought I'd mention my sighting as well. I didn't film the event unfortunately and I can't really draw, but it just looked like a perfect circle, dark in the middle with the lights on the outside."],"Object Flight Path":"Undisclosed","Tags":"City","Disposition":"Unresolved","Log Number":"NL-10012008-0013","Sighting Duration":"Undisclosed","City":"Amsterdam","Object Features":"Undisclosed","Object Shape":"Circle","Date of the Event":"08/28/2008 09:30 UTC","Longitude":"4.896968","Latitude":"52.379036","trends":["There have been 8 other sightings in Amsterdam","There were no other sightings in Amsterdam on or around August 28th 2008"],"Date Submitted":"08/28/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/12872.html.txt","/var/www/straped/mufon/org/12872.html"],"Source":"MUFON"}