{"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI don't smoke inside the house. This was Mother's Day 2007 around 10:30 am CST. My fiance had to work that day and no one was home except me. I went out on the porch for a smoke. I was sitting in the chair just kind of daydreaming when something shiny in the sky caught my eye. I looked up in the direction where it was moving and at first I thought it was one of those shiny aluminum balloons that you put helium in. I got up and walked out into the yard and I could see that it was moving across the sky really level and not flopping around in the wind like a balloon would. Also, there was really no breeze. As it approached my house and got closer I could see that it was round, pitch black on the bottom, with a very mirrored rounded top. The top was so \"polished\", like a mirror that it was reflecting the sun and you could see reflections in it. It moved slowly closer to my home and as it got closer I could tell it was fairly large. It was really high in the sky either. Maybe a few thousand feet. It was quiet, no sound came from it. But it moved slowly, and in a straight line. It never went higher or got lower, just moved slowly and silently across the sky. As it went over the top of my house I remember my heart speeding up and I started to sweat. I wasn't afraid, just couldn't take my eyes off of it. No one else was outside and there was no traffic on my street at that time. It moved over the top of my house, then just kept going. The underneath was as black as oil, and the top polished silver, chrome I guess would be a better word. And I watched it until it was too far away for me to see. I told my fiance, and some family about it, but they don't believe me. But I know what I saw."],"Log Number":"US-10012008-0014","Date Submitted":"05/18/2007 10:37 UTC","Weather Factors":"Unknown","Date of the Event":"05/18/2007 10:37 UTC","Country":"United States","Sighting Duration":"00:10:13","Latitude":"36.724343","Longitude":"-86.572608","Case Number":"12874","files":["/var/www/straped/mufon/html2text/12874.html.txt","/var/www/straped/mufon/org/12874.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.724343,+-86.572608(12874)&iwloc=A&hl=en\"> mufon case (12874) map </A>","Tags":"City","Disposition":"Unknown","Region":"Kentucky","City":"Franklin","Summary":"I was sitting on my porch when I saw the UFO move across the sky....","trends":["There have been 2 other sightings in Franklin","There were no other sightings in Franklin on or around May 18th 2007"],"Object Shape":"Disc, Sphere, Other","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Dome"}