{"Date of the Event":"09/30/2008 11:00 UTC","Country":"United States","Latitude":"40.303458","Disposition":"Unknown","Object Shape":"Star-like","Sighting Duration":"00:10:00","Log Number":"US-10012008-0012","files":["/var/www/straped/mufon/html2text/12871.html.txt","/var/www/straped/mufon/org/12871.html"],"Date Submitted":"09/30/2008 11:00 UTC","divs":["sighting details09\\30\\2008 approx 11:00 pm est - greensburg, pa - usa i was standing on the sidewalk in front of my house when i looked up at the stars. it was a clear night. i saw what looked like an aircraft illuminated with flashing red and white (maybe also blue) lights. the small spec was especially brilliantly illuminated. i thought nothing of it until the flight path of the object suddenly changed. it stopped flying in a straight line across the sky. it moved sharply to the right (as if turning on a dime). it traveled in a relatively tight circle in a jagged (not smooth) path. i suspected this was a conventional aircraft in some kind of distress - out of control. sometimes the object seemed to not be moving at all. i thought this could be a helicopter but the movements seemed to be too sharp\\tight\\jagged to be performed by any typical aircraft. i looked away for a moment. (i went back to my front door, locked the door, then came back to the sidewalk.) the object had moved further to my right then resumed a straight flying path until it was out of sight. the path flown by the object did not look at all feasible for conventional aircraft. rapid, sharp, movements, headed in no particular direction for several minutes, have me suspecting this was not a conventional aircraft."],"trends":["There have been 21 other sightings in Greensburg","There were no other sightings in Greensburg on or around September 30th 2008"],"City":"Greensburg","Tags":"City","Region":"Pennsylvania","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Unknown","Case Number":"12871","Longitude":"-79.537699","map":"<A HREF = \"http://maps.google.com/maps?q=40.303458,+-79.537699(12871)&iwloc=A&hl=en\"> mufon case (12871) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"looked like civilian aircraft (nighttime but illuminated like aircraft) but movements were not at all conventional","Object Flight Path":"Path with directional change,Path then hovering"}