{"divs":["Sighting Details I was taking a walk at a local school taking pics of sunset late one evening. I took many pics that night of the sunset at varying degrees of light and cloud cover. I packed up and went home not realizing what I shot. About a month later I finally uploaded the images into my computer. About a week after the upload I was photo shopping my images to post on the web. I came across this image and noted a dark spot near the top. After zooming in I realized it looked like an ufo. At first I thought it would be an airplane. I fully expected to find wings attached to the main image but those never materialized. The first time I noticed the image was when I was uploading pics to the web. Upon zooming in I noticed there were no airplane wings attached so I looked again and shouted,\" Holy cr*p, HONEY!! come here\". I asked her what she thought. Of course I was or am excited. I always like to second guess myself so I called in my girlfriend for a second opinion. Her opinion is that it is a ufo. It does not look like a weather balloon or a plane or anything else. She thinks its a ufo."],"files":["/var/www/straped/mufon/html2text/12876.html.txt","/var/www/straped/mufon/more/12876_submitter_file1__Landscapes00017.JPG","/var/www/straped/mufon/org/12876.html"],"Object Shape":"Disc","Latitude":"42.869473","City":"Kentwood","Log Number":"US-10012008-0016","trends":["There have been 4 other sightings in Kentwood","There were no other sightings in Kentwood on or around August 25th 2008","This sighting has never been favorited.",""],"Case Number":"12876","Weather Factors":"Unknown","Region":"Michigan","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.869473,+-85.644749(12876)&iwloc=A&hl=en\"> mufon case (12876) map </A>","Date of the Event":"08/25/2008 08:30 UTC","Summary":"Took pics of sunset and saw object in file","Disposition":"Insufficient Data","Longitude":"-85.644749","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"08/25/2008 08:30 UTC","Country":"United States"}