{"Longitude":"-88.071988","Object Shape":"Circle, Flash, Star-like","trends":["There have been 4 other sightings in Lisle","There were no other sightings in Lisle on or around October 1st 2008"],"divs":["Sighting DetailsIt was about 7:10 pm CST and I was about to close the blinds of our bathroom and prepare a bath for my daughter. The window faces the west and the clouds were parted, so it was a pretty sunset. I saw the chem trails first (there were about 6-8 of them), then saw a really bright \"star\". The \"star\" was flashing - almost like morse code. The lights would go from the top to bottom, then left and right. The shape was circular and at times looked as if \"small, white sparks\" would come off of it as it flashed the white light. When I initially saw it, it was just still - not moving. Then it went a little to the left, then the right, then left, then right again. It was flying slowly and looked as if it went through the chem trails. I lost sight of it when it went into the clouds. My initial reaction was interested in what this was and then disbelief (for I just saw a cluster of UFO's in the same area back in May of 2008 and can't believe I'm seeing another one), excited, and a little scared. I know it was not a plane- there were no red blinking lights nor order of when and where the white lights would flash."],"Object Features":"Unknown","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/12878.html.txt","/var/www/straped/mufon/org/12878.html"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.802541,+-88.071988(12878)&iwloc=A&hl=en\"> mufon case (12878) map </A>","Sighting Duration":"Undisclosed","Summary":"At sunset, saw 6-8 chem trails, then a UFO. It was bright (like a star) and was flashing white lights vertically and horizontally. Stood still at times and would move back and forth.","Log Number":"US-10012008-0018","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Region":"Illinois","Tags":"City","Date of the Event":"10/01/2008 07:10 UTC","Latitude":"41.802541","Viewing Distance":"Over One Mile","Country":"United States","City":"Lisle","Disposition":"Unknown","Case Number":"12878","Date Submitted":"10/01/2008 07:10 UTC"}