{"Object Flight Path":"Path with directional change","Date of the Event":"10/02/2008 09:00 UTC","Longitude":"-82.349263","City":"Johnson City","Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/12899.html.txt","/var/www/straped/mufon/more/12899_submitter_file1__ufo22.jpg","/var/www/straped/mufon/org/12899.html"],"divs":["sighting detailsme and my wife have viewed many strange objects in the sky over the last 6 months we have reported most of them here! last night we were on the deck looking into the western sky and seen what looked like a plane taking off and going upward into the sky. as it got closer we seen that the light on the front of the craft was angled upward and it just looked as if it was going upward into the sky when it was flying the same level. it flew south about 3 miles and made a complete left turn and flew right over our house. it was so big it was blocking out some of the sky and stars as it went by! about the length of 300 yards. it was about 2000 feet above us and \"no sound\" nothing we could not believe it. we live in the landing path of the air port and some of the smaller planes shake our house during landing. this craft had no sound and we find this very strange. my video camera went dead so i could not get it shot but will be investing in a new camera to much activity going on around us not to. i did a search on youtube and found exactly what we seen to the t. i think this was recorded in japan. http:\\\\www.youtube.com\\watch?v=kofrgth-_sw"],"Log Number":"US-10032008-0003","Date Submitted":"10/02/2008 09:00 UTC","Country":"United States","trends":["There have been 7 other sightings in Johnson City","There were no other sightings in Johnson City on or around October 2nd 2008","This sighting has never been favorited.",""],"Object Shape":"Triangle","Region":"Tennessee","Object Features":"Undisclosed","Tags":"City","Disposition":"Unknown","Summary":"Huge Triangle with many lights 300 yards long","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.32104,+-82.349263(12899)&iwloc=A&hl=en\"> mufon case (12899) map </A>","Latitude":"36.32104","Case Number":"12899","Sighting Duration":"Undisclosed"}