{"Sighting Duration":"Undisclosed","Weather Factors":"None","Date of the Event":"10/01/2008 07:20 UTC","Longitude":"-101.125556","Country":"United States","Source":"MUFON","divs":["Sighting DetailsWednesday, October 1st 2008, approximately 7:15-7:20 p.m. My wife and I were standing on our deck enjoying the crisp fall air when, almost simultaneously, we both notice a large metallic cigar-shaped craft in the northern sky. Quickly I realized it wasn't anything either of us had seen before, as it left no exhaust trail and was moving way too slow to be any conventional aircraft other than maybe a blimp which is highly unlikely for our area. As we stood there almost mezmerized by this \"craft\" our kids had come to the door and were curious as to what we were looking at. When we turned to acknowledge them and try to point it out to them (which was a matter of seconds), it was nowhere to be seen. Strangely enough there were at least 4-5 jets in the same area at the same time, which was actually what had brought our attention to that particular area in the first place. After that, we went inside and discussed possibilities of what it could have been, ruling out every earthly possibility (noting that it either \"disappeared\" or took off at an ungodly speed). Later that night after we put the kids to bed we decided to throw on our jackets and do some star gazing. Throughout the evening from roughly 9 p.m. to 10:30 p.m. we also witnessed bright lights that were moving suspiciously slow with no flashing lights whatsoever, most of which were very distant. They had seemed to appear, move a short distance and eventually fade out. The last strange \"light\" we had witnessed was very unnerving as it seemed very low to the ground and alot closer than the rest. It had what appeared to be three stationary lights and again moved slowly from east to west never seeming to be moving farther away, and like the ones before it had just faded out. Considering the event earlier in the evening, my wife and I were excited yet perplexed at the mysterious lights we had seen. Myself, being an avid UFO buff, am convinced that what I witnessed was nothing that I've seen on this planet except in other UFO documentation. My wife, (being somewhat of a \"skeptic\") is not sure what she saw, but stressed to me that it was nothing she's ever experienced before."],"City":"Sutherland","files":["/var/www/straped/mufon/html2text/12890.html.txt","/var/www/straped/mufon/org/12890.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.158611,+-101.125556(12890)&iwloc=A&hl=en\"> mufon case (12890) map </A>","Region":"Nebraska","Date Submitted":"10/01/2008 07:20 UTC","Object Shape":"Cigar","Log Number":"US-10022008-0011","Summary":"Saw large metallic cigar shaped craft moving slowly in northern sky, looked away for couple of seconds and it disappeared.","Disposition":"Unknown","Latitude":"41.158611","Case Number":"12890","Tags":"City","trends":["There have been no other sightings in Sutherland","This sighting has never been favorited."],"Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Object Features":"Unknown"}