{"Viewing Distance":"Over One Mile","Date of the Event":"09/20/2008 11:53 UTC","divs":["Sighting DetailsIt was almost noon time on a gorgeous, 70 degree, cloudless, windless, Autumn afternoon. I was lying on my hammock in the backyard, which is a few acres surrounded by tall bushes and a few trees, gazing in appreciation of the crystal blue clearness of the sky, scanning it as I always do for that hopeful glimpse of something other-worldly as I quite often do. I'm an average 39 year old, with a normal life, a husband and son, living in a normal town, but I have always had an open mind. It's important to note that I have been researching and studying the UFO phenomenon for 20 years or more. Although I have never seen anything I could absolutely, without a doubt, swear was an outright UFO, I have had many \"could be's\". Especially this day in particular... As I lay in the hammock, my back to the sun, and facing North, I thought I would just \"ask\" the powers that be to \"please show me something that I will know right away is not of this world. I'll count down from 10 to 1 and when I open my eyes it will be right there in the distance in front of me when I open them.\" Sounds wacky, I know. But I'm sure anyone who believes in UFO's would love a confirmation of it!! Well, I asked this 3 times to open my eyes to nothing but the beautiful clear sky, with the exception of a plane or two. (All of which had thin trails behind them.) At this point, I sort of gave up, saying \"Some people have the ability to summons them on command, and I'm just not one of those people...sigh.\" Just as I finished that thought, my 8 year old son came into the backyard, and proceeded to lay down next to me on the hammock. I said to him \"Maybe you can help me...\" (He's as open minded as I am, my husband not-so-much!)I asked him to join me in asking to see something out of this world. He agreed. I started the count down. We got to three and he said \"I didn't concentrate. Let's do it again.\" So he very matter of fact said in a whisper \"Dear God, (A phrase I hadn't personally used in addressing the who-evers or what-evers that would make this happen, and we aren't big church go-ers) Please show us a UFO (a word I hadn't used yet in asking either) 5-4-3-2-1...\" It was so endearing, the way he went about it. And lo' and behold, when I opened my eyes, directly in front of them, but many miles away above the tall tree line, there it was. A something!! Just sitting there. I jumped off the hammock in an instant, and shouted to my son while pointing \"DO YOU SEE IT??\" He was silent for a moment, then said, \"Nooo...\" It took me awhile to orient him to the tree line and the exact location (I don't know if you know how difficult that is to do with a child!) Within 20 or 30 seconds, he saw it. I was shrieking and freaking out, and here is what it appeared to be: A star-like shine, completely stationary, as big as Venus in the night sky and a bit brighter, no trails, no smoke. As I stared in amazement, delight, and wonder, I never had any negative feeling. Only complete and utter appreciation. We asked. We received- something! I told my son to run in and grab the binoculars. He was quick! I did not want to take my eyes off of it. Upon looking through the binoculars, I could see this highly reflective egg or diamond shape. It was so reflective (or shining) that all the colors of the rainbow were visible on and around it. The 'object' was motionless for at least 5 minutes. That is, until we called for my husband to come and have a look. Reluctantly, he came out and looked through the binoculars, and couldn't readily give any explanation to what he was seeing. (He's usually full of explanations!)But as he viewed the 'object' it ever-so-slowly started to float away from and East of us. Soooo slowly, though. Until we could no longer see it through the trees. We didn't take a picture, because I know it would appear as a light blob, or just make a mockery of the beauty of it! It was amazing! And even if it wasn't something from somewhere else, it happened before our eyes after asking to see something special. I was reluctant to write, because of the circumstances in which it appeared, and that we have no evidence. But the 3 of us all saw it. Plain as day. For atleast 10 minutes. Giddily, I went in to make lunch. And I have told this story unashamedly, to many non-believers since."],"Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/12898.html.txt","/var/www/straped/mufon/org/12898.html"],"trends":["There has been one other sighting in Boylston","There were no other sightings in Boylston on or around September 20th 2008"],"Sighting Duration":"00:10:00","Log Number":"US-10032008-0002","Date Submitted":"09/20/2008 11:53 UTC","Latitude":"42.388995","Country":"United States","Disposition":"IFO","Longitude":"-71.690814","map":"<A HREF = \"http://maps.google.com/maps?q=42.388995,+-71.690814(12898)&iwloc=A&hl=en\"> mufon case (12898) map </A>","Source":"MUFON","City":"Boylston","Object Features":"None","Summary":"Son, husband and I saw stationary star-like, almost egg-shaped, object in sky. Very metallic and reflective through binoculars. Lasted about 10 minutes until it slowly floated out of view.","Weather Factors":"Unknown","Object Shape":"Diamond, Egg, Star-like","Region":"Massachusetts","Case Number":"12898","Tags":"City"}