{"Tags":"City","Log Number":"US-10032008-0008","Summary":"ROW OF GREEN LIGHTS/VERY LOW AND FAST/NO NOISE","trends":["There have been 3 other sightings in Dublin","There were no other sightings in Dublin on or around August 1st 2008"],"divs":["Sighting DetailsI was returning home from Athens, Ga. traveling South on Hwy 441. I was just comming into Dublin, GA about 10:15 or 10:30, and had just past the elementary school in Dublin, Ga. It had been raining, but there was \"open sky\" no trees or buildings to block my veiw. I was slowing down as I was in a low speed zone, and looked to the right side of the windshield and happen to notice something moving through the air \"very fast\" and unusally low. At first I thought a plane was about to crash. I slowed down some more as it traveled across the air to the left of my car. I rolled my window down to see more clearly, and noticed there was \"no noise\"..no sound at all.. I saw only a row of green lights, I could see no shape other than the row of lights. Maybe six to eight of them, and from my veiw from the ground, they were about the size of a \"mayonaise jar lid\". They flashed \"really fast.\" I came almost to a complete stop as I watched it, then all of a sudden the lights just disappeared and it was gone. I watched and nothing reappeared. This took place in just about 6 to 8 \"SECONDS\" !! I called my husband to tell him what I had seen, I was still about 20 miles from our home in Rockledge, to see if maybe he could see anything from there. He didn't, but talked to a man a couple of days later that had seen the same thing, at about the same time, and he lives on Hwy. 199. We do not know his name."],"Case Number":"12904","Latitude":"32.540445","Country":"United States","Weather Factors":"Rain","Object Flight Path":"Straight-line path","City":"Dublin","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/12904.html.txt","/var/www/straped/mufon/org/12904.html"],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.540445,+-82.903754(12904)&iwloc=A&hl=en\"> mufon case (12904) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Georgia","Longitude":"-82.903754","Date of the Event":"08/01/2008 10:15 UTC","Date Submitted":"08/01/2008 10:15 UTC","Viewing Distance":"Unknown","Source":"MUFON"}