{"Object Shape":"Bullet, Missile","Country":"United Kingdom","Date of the Event":"07/03/2008 09:15 UTC","files":["/var/www/straped/mufon/html2text/12908.html.txt","/var/www/straped/mufon/org/12908.html"],"Summary":"A long missile shape, bright white, no wings, tail, with black mark","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.510369,+-0.119915(12908)&iwloc=A&hl=en\"> mufon case (12908) map </A>","Tags":"City","Object Features":"Undisclosed","City":"London","Disposition":"Unresolved","Latitude":"51.510369","Viewing Distance":"Over One Mile","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around July 3rd 2008"],"Date Submitted":"07/03/2008 09:15 UTC","Region":"England","Longitude":"-0.119915","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was travelling on a train heading towards London Waterloo station on the morning of 3rd July. I had a window seat and the sky was fairly dull. Whilst traveling between 2 stations (Earlsfield and Clapham Junction) I noticed what I thought, at first anyway, was a large aeroplane. For a few seconds I didn't take too much notice, but then I realised this 'plane' didn't look right. It was much longer than a normal passenger aeroplane that I had ever seen before. I couldnt see any wings but thought it might just be the angle of the plane turning. However then another normal plane came into view not far off and it became apparent at how white this object was, not as in glowing, but as if it was a sparkling colour of white, many shades cleaner than the other plane passing by. Straining more to see I could still see no wings, and realised that there was no tail to the plane either - the only marking seemed to be a single black spot in the middle, ie. just a thin missle shape with a black blob! The train move direction and I could no longer see the plane. I've thought hard about it during the last few weeks to think of logically what could it be or whether my eyes deceived me, but I have come to the conclusion that whatever I saw was 'odd' and I've certainly have never seen something like this before. I've no idea if it was a UFO or perhaps a different type of flying vehicle! But I want to add this - the location where I saw it is only a few minutes away from the MI6 building in Vauxhall - I've heard stories from friends and people in the nearby areas of weird things in the skies round there, particularly at night. Is this just a coincidence?"],"Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"12908","Log Number":"GB-10032008-0012"}