{"Summary":"cigar shaped object flying at high speeds disappears","Object Shape":"Cigar, Star-like","files":["/var/www/straped/mufon/html2text/12909.html.txt","/var/www/straped/mufon/org/12909.html"],"trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around September 26th 2008"],"Date Submitted":"09/26/2008 10:15 UTC","Country":"United States","Case Number":"12909","Disposition":"IFO","Date of the Event":"09/26/2008 10:15 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=34.542987,+-117.283996(12909)&iwloc=A&hl=en\"> mufon case (12909) map </A>","Log Number":"US-10032008-0013","Longitude":"-117.283996","Object Features":"Unknown","Source":"MUFON","Region":"California","divs":["sighting detailsi was driving home from work that night and had maybe been driving for 30 seconds to one minute when i noticed lots of light movement in the sky to the south east of me. see the skys over victorvalley at lower altitudes are primarily quiet at night so when i looked i figured it was probably a chp chopper doing their nightly flying but then i saw the chopper to the north with its spotlight shining down at the ground. at seeing this i looked again because of my curiousity and noticed it had moved almost all the way across the horizon in maybe 30-45 seconds to the south-west of me the weird thing was once it was in that general location it seemed to stop completely. as i looked more at the object it was shining a bright orangeish-blue color with no distinct flashing lights, a few seconds later it was joined by another object identical to the first one and about 30 seconds later the first object shot to the north and was gone instantly. i was pretty shocked by that. i stopped at a red light and when i looked back at the area of sky the second light had disappeared as well. i'm not suprised by these type of things happening i have lived in the high desert\\victorvalley area all my life and have probably had upwards of 30 unexplainable sightings."],"Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"34.542987","City":"Victorville","Weather Factors":"None"}