{"files":["/var/www/straped/mufon/html2text/12905.html.txt","/var/www/straped/mufon/org/12905.html"],"Region":"Hessen","Source":"MUFON","Date Submitted":"02/28/1981 12:00 UTC","divs":["Sighting DetailsMarch, 1981, while stationed at Fliegerhorst Kaserne (US Army Post), near Hanau, Germany, my husband, children and I lived in the small town of Langenselbold. It was a crisp, cold evening (no clouds). The time was approximately 9:00 p.m. and my son (age 8) and I were on the patio, viewing the full moon through a small telescope. My son was viewing the moon, when he asked me, \"what is that thing going across the moon?\" I took a look and there was a large, very obvious shadow (elongated, cigar shaped), trailing slowly across the moon from left to right, in a smooth, constant motion. It had to have been a very large UFO, to cast that big of a shadow. As soon as the shadow reached the right side edge of the moon, it disappeared and a very bright object appeared to the right of the moon. I could not see the object when it was casting the shadow, until it moved out from the face of the moon. The unidentified object then passed around and behind the moon, momentarily out of sight. Suddenly, it again appeared on the right side and moved back across the moon, again leaving a shadow that moved right to left. Then, as it came to the left side edge of the moon, the shadow disappeared and the bright object again became visible and darted out into space at a tremendous rate of speed, disappearing from view in 1 second. Total time of observing object was approximately 2 minutes. Distance was approximately 238,855 miles from Earth. At the time of the sighting, I had a feeling of excitement and awe. When my son and I rushed in to tell my husband, his exact words were, \"Hmm.\" He believed me but he wasn't excited at all. I told a couple of friends and their reaction was about the same. I know this was not a satellite orbiting Earth and I don't believe Voyagers 1 & 2 were anywhere near that big, or that our probe (Voyager 2) could fly to one side of the moon, then make a very sharp U-turn, fly back around the way it came and then accelerate to near light speed. The UFO was huge, fast and had to have been controlled by some intelligence, probably not our own. Early this year, I took a photo of a UFO and have reported it to MUFON. As recently as Sept. 22, 2008, my husband saw what he believes to be a UFO. I will put that in a later report."],"Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","Tags":"City","trends":["There have been no other sightings in Langenselbold","This sighting has never been favorited."],"Summary":"Cigar shaped UFO moving across moon.","Object Shape":"Cigar","Case Number":"12905","Country":"Germany","Latitude":"50.179516","Log Number":"DE-10032008-0009","Object Features":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Longitude":"9.040014","map":"<A HREF = \"http://maps.google.com/maps?q=50.179516,+9.040014(12905)&iwloc=A&hl=en\"> mufon case (12905) map </A>","Disposition":"Unresolved","Date of the Event":"02/28/1981 12:00 UTC","City":"Langenselbold"}