{"Disposition":"Unresolved","Latitude":"53.546694","Log Number":"CA-10032008-0014","Object Features":"Undisclosed","Tags":"City","Region":"Alberta","Case Number":"12910","map":"<A HREF = \"http://maps.google.com/maps?q=53.546694,+-113.483342(12910)&iwloc=A&hl=en\"> mufon case (12910) map </A>","divs":["Sighting DetailsMy husband and I were coming back from Morinville. It was apporx. 7:45pm. The sky was dark but not too dark as you can still see the blue in the sky. While driving down the highway to get back to Fort Saskatchewan we notice this very very bright amber colored light in the sky, (almost looks like say three street lights shining down on you). It looked much larger than an airplane for how high it was. It was high but not too high in the sky. It was in the same sky as Jupiter. I asked my husband what it was, seeing as how it seemed very very bright and large for a plane. It didn't seem to be moving either. As we are watching it while driving, it instantly vanishes. The lights seem to dim out and than that was it they were gone. The lights are gone and the object is no where to be found. About forty seconds later while we were still searching for this object that is no where to be found we than notice this flashing red light that is not travelling across the sky but straight up out of our atmosphere. It just kept going up until we could not locate it anymore. My husband said it seemed to look like the red light was rotating. I have never ever seen anything like this before. We know it could not have been a plan or even a helicopter seeing as how when the very bright light went out, we still could not see anything in the sky. If it was a helicopter or an airplane, wouldn't we have still seen some form of light or even the shape of the plane or helicopter?? I'm hoping that someone has seen this same thing that we did. I would love to hear that I am not crazy:) This is not our first sighting, we have seen two other sightings in previous years, but nothing this prominent. I am so sad that I did not have the chance to tape this occurence. If anyone else saw this please e-mail me!"],"Longitude":"-113.483342","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"Unknown","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around October 2nd 2008"],"City":"Edmonton","Date of the Event":"10/02/2008 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12910.html.txt","/var/www/straped/mufon/org/12910.html"],"Object Flight Path":"Undisclosed","Country":"Canada","Date Submitted":"10/02/2008 12:00 UTC","Source":"MUFON","Summary":"Very bright amber colored lights in sky and than disappears"}