{"Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Loleta","This sighting has never been favorited."],"Source":"MUFON","Summary":"A late evening, fast moving, high altitude, approx. NW to SE orange glowing \"ship\".","files":["/var/www/straped/mufon/html2text/12919.html.txt","/var/www/straped/mufon/org/12919.html"],"Sighting Duration":"00:00:10","Case Number":"12919","Log Number":"US-10052008-0001","divs":["Sighting Details I decided to take a break during work. I stepped outside at around 2245 hrs(10:45 PM) The sky was clear, The stars where out. I was setting down looking up, enjoying the fresh air. I sat facing due East. I was out for about 8 minutes. Then I saw an orange light begin to enter the high North West sky above me. At that point I thought \"Cool,a meteor.\" No sooner did this thought enter my mind, then Its intensity grew and I could see it had a solid but plasma appearing form. It had a distinct fusalage and two forward swept wing like appendages. These where located well aft. This form remained constant as it travled to the South East across the sky almost directly over me. Its relative size was about a half to three quarters of an inch at arms length, almost directly over me. This decresed as it neared the SE horizon. Though its attitude remained true to its vector. The relative velocity was great, equivalent to a meteor or a shooting star. It retained the orange color and hue of the discharge from a standard neon glow light as it travled. It finaly disappeared out of veiw about 20 degrees above the South East horizon. It did not make a sound. I felt as though a profound truth was unveiled before me. Regret was also felt in the fact no one else saw the same. But then again, it was huge, maybe some else did? There where two people out side with me. They where about 30 feet away in a small doorless out building. They did not see a thing. I managed to keep my composure. I just shook my head and proceeded to head back to the main building. Thats what I saw. Every word is true. I will stand in any court of law and state the same. Thank you, JR"],"Longitude":"-124.245039","Object Shape":"Bullet, Missile, Chevron, Cross, Diamond","Disposition":"Unknown","Object Features":"Wings","Country":"United States","City":"Loleta","Weather Factors":"Unknown","Region":"California","Tags":"City","Date of the Event":"11/30/2002 12:00 UTC","Viewing Distance":"Over 1 Mile, Unknown","Date Submitted":"11/30/0002 10:50 UTC","Latitude":"40.666713","map":"<A HREF = \"http://maps.google.com/maps?q=40.666713,+-124.245039(12919)&iwloc=A&hl=en\"> mufon case (12919) map </A>"}