{"City":"Fort Lauderdale","Source":"MUFON","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around September 15th 2008","This sighting has never been favorited.",""],"Disposition":"IFO","Object Shape":"Disc, Fireball, Other, Unknown","Summary":"Seen and pictured 3 UFOs from Fort Lauderdale's beach on Sep-15-2008","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"26.131058","divs":["Sighting DetailsThere isn't a lot of description I can give, other than I saw three light-emitting objects hovering over the ocean, maybe a mile or two from where I was, off of Fort Lauderdale's beach on September 15, 2008, and that I took several pictures of which I hereby attach three (3). The first picture, sequentially numbered DSC00066 by my camera, shows one bright round bulb-light object, which could erroneously be taken for Venus, and two fuzzy orange objects at the top-left and bottom-left of the picture. The next image, numbered DSC00067, doesn't show the top-left orange object anymore, shows the one at the bottom-left considerably up and above from its position in the previous picture, and the bright round bulb-light object has not moved. At the last photograph, # DSC00070, the orange-colored objects had disappeared from sight, and the bright round bulb-light object had moved up and to the left of its previous position, now displaying a strange earring-like shape, emitting bright yellow light from its top and bright white light from its bottom. This item, when magnified, suggests a horizontal dish-like shape with small window-like lights on both of its sides. The untouched files, as transferred directly from my camera to my PC are available for analysis. I would greatly appreciate expert or sound comments into what it is that I saw that evening. I'm no expert, just a curious individual."],"Date Submitted":"09/15/2008 07:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.131058,+-80.137429(12917)&iwloc=A&hl=en\"> mufon case (12917) map </A>","Country":"United States","Longitude":"-80.137429","Object Features":"Window(s), Other, Unknown","Sighting Duration":"Undisclosed","Region":"Florida","Date of the Event":"09/15/2008 07:39 UTC","Log Number":"US-10042008-0005","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12917.html.txt","/var/www/straped/mufon/more/12917_submitter_file1__DSC00066.JPG","/var/www/straped/mufon/more/12917_submitter_file2__DSC00067.JPG","/var/www/straped/mufon/more/12917_submitter_file3__DSC00070.JPG","/var/www/straped/mufon/org/12917.html"],"Case Number":"12917","Tags":"City"}