{"Sighting Duration":"00:01:00","Date Submitted":"10/03/2008 12:00 UTC","Weather Factors":"Unknown","Summary":"I did not know I was capturing the objects in the photo. I was taking a picture of the mountains and the view.","map":"<A HREF = \"http://maps.google.com/maps?q=41.751723,+-74.07881(12914)&iwloc=A&hl=en\"> mufon case (12914) map </A>","Log Number":"US-10042008-0002","Object Flight Path":"Unknown","Country":"United States","Longitude":"-74.07881","Case Number":"12914","Region":"New York","Viewing Distance":"Over One Mile","Latitude":"41.751723","Date of the Event":"10/03/2008 12:00 UTC","divs":["Sighting DetailsHello, my name is Vincent Sheppard. I was recently on a retreat with the organization I work for up in Mohonk Mountain Hotel. Mohonk Mountain is located in New Paltz, New York in the Catskill Mountains. While I was there I took several pictures with my cell phone camera of the beautiful country and the surrounding mountains along the Hudson River. When I got home and started to view the pics I had taken. I noticed that one of the pics appears to have something strange captured in it. I figured I would send it to MUFON and see what you guys think. This picture has not been altered in anyway. I took this picture, uploaded it from my cell phone to my email account, and when I got home downloaded it and several others. The picture that I'm sending you appears to have three red objects and a plane or jet chasing it. I know this sounds crazy, but please see for yourself. I would be happy to discuss this further if you have any questions. Thank You,"],"City":"New Paltz","files":["/var/www/straped/mufon/html2text/12914.html.txt","/var/www/straped/mufon/more/12914_submitter_file1__1003081147a.jpg","/var/www/straped/mufon/org/12914.html"],"trends":["There have been 4 other sightings in New Paltz","There were no other sightings in New Paltz on or around October 3rd 2008","This sighting has never been favorited.",""],"Object Features":"Wings","Tags":"City","Source":"MUFON","Object Shape":"Unknown","Disposition":"Insufficient Data"}