{"Disposition":"Insufficient Data","Date Submitted":"10/04/2008 09:36 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","divs":["sighting detailsi was standing out on my deck of my residence looking out at the night sky, around 9:36 p.m.(as i have done the past 2 nights because i saw this the night previously) observing the stars, one in particular towards the west\\northwestern area that was twinkling red,white,blue,green colors and stationary. my first thought was that it was a star just giving off those colors, this i saw with the naked eye, so i first used my eye glasses to focus on it and at one point i noticed an aircraft(with only the standard white,red strobes) going in proximity of it and it looked as if the (star or ufo)thing moved upwards,downwards then to the right and stationary again(i'm estimating this was probably 20-30 mi. away and i used the home next to me as a vantage point so i could tell if it was moving)i felt a little excited and my first instinct was to call a neighbor to witness this with me,but i retained composure. i went into my home to first get some binoculars, seeing it through thoses gave me a bit clearer sight of the various colored lights, i went back in my home again to get my telescope to try to enhance it more. viewing it through the telescope did enhance the varying colors,but was unable to make out a shape as it was moving away slowly, until after about 20 minutes it was no longer visible. after the initial excitement left me i felt rather sad because i wanted a closer look and unfortunately no pictures or video were taken. i do believe in etraterrestrials and feel that the time is very near to a revelation of their existence into our reality. this was my first sighting event and i know there will be others and i will be watching for it in the nights to come."],"Tags":"City","Case Number":"12918","Latitude":"39.346162","map":"<A HREF = \"http://maps.google.com/maps?q=39.346162,+-85.479841(12918)&iwloc=A&hl=en\"> mufon case (12918) map </A>","Date of the Event":"10/04/2008 09:36 UTC","files":["/var/www/straped/mufon/html2text/12918.html.txt","/var/www/straped/mufon/org/12918.html"],"Summary":"Observed what I thought to be a star twinkling, white,red,blue,green colors. I've seen this twice in the last 3 days","Weather Factors":"Unknown","Object Flight Path":"Stationary","Region":"Indiana","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-10042008-0006","trends":["There have been 13 other sightings in Greensburg","There were no other sightings in Greensburg on or around October 4th 2008"],"Longitude":"-85.479841","Object Shape":"Circle, Star-like","City":"Greensburg"}