{"map":"<A HREF = \"http://maps.google.com/maps?q=41.914891,+-88.305123(12920)&iwloc=A&hl=en\"> mufon case (12920) map </A>","Region":"Illinois","Date of the Event":"10/05/2008 03:00 UTC","Tags":"City","divs":["Sighting DetailsI probably have the most sighting reports in Illinois and somehow have become brainwashed I am the reincarnation of an extra terrestrail. Something is happening in Saint Charles, Illinois and I think that they are docked near my house everynight because of me. I am so certain because they often make theyre presence known by sending shooting stars followed by voices numerous times at the exact moment I might look up at the skies. If you should visit St Charles you will see with binaculars continuous unmarked low flying probably government planes circling the area 24-7 non stop for over a year now in St Charles. You will also see funny lights were as you should use a telescope pondering whether theyre satellites will appear as nothing but a bright white light unidentifyable. If you check the astronomy books there is no identifying as if the stars have misplaced itself 10 times the north stars usual brightness in the southern hemisphere. Ive grown so used to them here and the apparitions and voices of mary and jesus that I dont even look at the skies anymore because I know they are always here. It takes a toll on me as if im waiting for revelation \"I will come like a theif in the night\" to happen and these things have been happening my entire life. Back in Wisconsin I remember my neighbor would always be walking his dogs at 4 am and looking up at the skies and I remember slightly sightings In my grandmas in Greendale, WI back when I was little. My west highland terrior now has dissapeared and reapeared the other night and my parents said they never got out of bed or opened there door but the dog jump a flight of stairs in sight of my own eyes and my other dog seemed mystified by his reappearing act. The next morning I pet the terrior making him think he is speciel and magical he seemed to remember what had happenened the night before and my other dog looked at me puzzled. I think that God was testing his power and showing me what is going to happen to people by teletransferring my little dog , I thought I lost my mind afterwards and after investigating I am convinced Jesus or the UFOs or Something is pehaps the 2012 Mayan theory is accurate? My only debate is if Ra sungod was the main god in egypt then Ra was God the father of Jesus therefore God was nicknamed the \"Master of deception\" meaning the mayan 2012 theory is probably false. Also becausee the bible warned about false prophets and fortune telling and jesus was called \"a theif in the night\". My apparitions are in my head , Mary and Jesus pay more attention to me with telepathy like I can see and hear them think about me every 30 minutes Im beggening to believe Im family or perhaps the reincarnation of an extra terrestrail meaning rebirth includes memory erasion because Im uncertain. The proof I have is these unmarked planes sometimes at times every day 5 minutes apart from one another flying directly over our house very lowly. Ive used binaculors and they dont bear UPS logos or even passenger lights but are constantly circling St charles, IL. Usually there is 5 or more unmarked planes circling st charles all day everyday. It is becoming obvious the governments research department is protecting the area from unidentified objects that are as what you can see constantly in st charles , probably because of me. I am growing fatigued or making no plans for the future because this in constant, such as going back to college and am gambling my life and health on skeptical issues of the unknown. They must have theyre own problems if they are letting us suffer and die on a dirty planet. Everyday must not be christmas or why is the beloved Jesus letting the best Texas Christians lives be destroyed by hurricanes? Why are they obsessing on church and God and the Bible in a world of chaos and anarchy? I am enraged at Jesus for letting the people and the world come to this! Is he tired after 2033 years or just lazy or frustrated? I dont pray or go to church but I sure get the ufos above the house on a 24-7 percentage. Go ahead if youre wealthy st charles has a small airport nearby. Rent a room at the Marriot Hotel near our house for a week and watch the constant unmarked planes circling as if they are obsessing on something here seeming not to be getting any answears on the lights. If you should dare come stay at the Marriot or super 8 near our hosue and watch the skies , If you find any answears you would bless my disturbed mind and email me at reharkthte@yahoo.com jolly roger"],"files":["/var/www/straped/mufon/html2text/12920.html.txt","/var/www/straped/mufon/more/12920_submitter_file1__trinity_angels_com_Blessed_Mother__Baby_Jesus.jpg","/var/www/straped/mufon/org/12920.html"],"Object Shape":"Unknown","Summary":"I am growing fatigued","Object Flight Path":"Undisclosed","Log Number":"US-10052008-0002","Longitude":"-88.305123","Date Submitted":"10/05/2008 03:00 UTC","Sighting Duration":"12:00:00","Latitude":"41.914891","City":"St Charles","Disposition":"Unknown","Country":"United States","Case Number":"12920","Object Features":"Undisclosed","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around October 5th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"Unknown"}