{"Summary":"As I was driving, I was taking pictures of landscape outside my vehicle window. When viewing digital image on PC I noticed small object in the upper center of pictuer. Blow up the picture to see the outline better. What is this?","Region":"Kansas","Latitude":"39.016462","Object Shape":"Blimp, Cigar","Disposition":"Hoax","Viewing Distance":"101-500 Feet, Over 1 Mile","Tags":"City","Longitude":"-98.474546","Object Flight Path":"Straight-line path","City":"scott city 20 miles wes","Country":"United States","divs":["Sighting DetailsWhen I blew up picture you can see the distinct outline of the object. There was no plane or helicopted in the sky. Thought it could be a bug but as you can see in the picture Kansas just experienced an ice storm so to cold for bugs to exist. Previous experience: In May 1996 my wife and I had a very intimate experience with a UFO that was about 200 ft from the ground - very low. We were traveling from Gt. Bend, KS to Larnerd on main highway at around 9:30 pm. An object the shape of blimp or cigar slowly flew directly over the highway. The object was silent and had lights underneith the object. All the cars on the road stopped and wathced the object as it flew overhead. I made a u-turn on the road facing back towards the highway. The object slowley flew 2-miles down Radium rd and stopped. My wife was really scared and wanted to go home. I headed about 2-3 miles back to town then decided to make another u-turn and had back towards Larnerd. What ever the object was darted out about 2-3 miles ahead of us and hovered parallel to the highway. I was jolted by this experience and we made another u-turn and headed back home. The object followed us for about 5 minutes then disappeared. I am not sure exactly what the object was but was definitely not normal. My family and friends have for years witnessed sitings in the area."],"Object Features":"None","Date Submitted":"12/24/2006 12:00 UTC","trends":["There have been no other sightings in scott city 20 miles wes","This sighting has never been favorited."],"Weather Factors":"Unknown","Log Number":"US-10052008-0010","Case Number":"12928","Date of the Event":"12/24/2006 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12928.html.txt","/var/www/straped/mufon/more/12928_submitter_file1__Picture253.jpg","/var/www/straped/mufon/org/12928.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.016462,+-98.474546(12928)&iwloc=A&hl=en\"> mufon case (12928) map </A>"}