{"Longitude":"-74.854084","Weather Factors":"None","Country":"United States","files":["/var/www/straped/mufon/html2text/12927.html.txt","/var/www/straped/mufon/org/12927.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"IFO","Object Shape":"Flash, Star-like","Region":"Pennsylvania","Tags":"City","Summary":"Hovering, quick flickering objects in Fairless Hills area.","Source":"MUFON","Case Number":"12927","trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around October 5th 2008"],"City":"Fairless Hills","Date Submitted":"10/05/2008 08:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Log Number":"US-10052008-0009","Object Features":"Unknown","Latitude":"40.184254","Date of the Event":"10/05/2008 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.184254,+-74.854084(12927)&iwloc=A&hl=en\"> mufon case (12927) map </A>","divs":["Sighting DetailsFairless Hills is full this evening. (The time I began seeing all these objects was around 8:30pm)There are bright, quick flickering lights hovering & disappearing in the sky. There are also several quiet helicopters circling the area. There were only 2 helicopters, now there are several, two of which I noticed flying in formation with each other as though they were combing the area. When I was taking out the trash I noticed one very quick flickering light hovering over, I think, the Fairless Hills golf course, quite high up in the sky. Then I saw another quick flickering object hovering around Trenton Rd & Woodbourne Rd. after this one quickly disappeared another one flickered on down around Oxford Valley Rd & New Falls Rd. They all hovered & flickered on again for about five mins or so. I know it to be about that amount of time because I had to run into the house to get my car keys so I could get the camera. I apologize that I did not get any pictures as I couldn't figure out how to get the digital to work at night. I'll get someone to show me so I'll be ready for the next time. I came outside after getting the kids down to bed & saw a number of helicopters circling the area. I noticed another hovering, quick flickering object over the Oxford Valley Mall area, & then another one flickered on & off further south, but in the same vicinity. My daughter came outside to check on me (she's 4, so she's not a good witness), but that's when I saw the helicopters flying in formation & circling the Mall area. Responsibilities took over & I had to go into the house, but the helicopters & flickering objects were still going on when I came in at 9:45pm."]}