{"Disposition":"Unknown","Country":"United States","Weather Factors":"Unknown","Summary":"Observed rectangular UFO over (almost touching) power lines. Watched it leave or disappear.","divs":["Sighting DetailsWhile working at a grocery store bagging groceries I walked a customer out to her car to place her groceries in her car for her. We were walking east in the parking lot. It was afternoon and the sun was behind us. We both saw the object at the same time. We stopped walking and stared. The object was approximately two hundred yards away. It was stationary above large power lines (transmission lines). It was almost touching them. Now I will try to describe it. It was rectangular in shape. Using objects near the craft such as cars and buildings I was able to get an approximate size. It was 40 to 50 feet in length and 10 feet in width. The color is really difficult to describe. It was bronze, bright shiny bronze. This is the best way I can describe what happended next, it appeared that the bronze color was folding in on itself towards the middle. As it was doing this either the object moved directly away from us or collapsed in on itself. It disappeared very quickly. The whole sighting took place in about 10 seconds. When it was gone the customer said \"Did you see that?\". I replied yes. We said nothing else about it. I know 1971 was a long time ago but I remember it clearly like it was yesterday. I still wonder what it was and still look for it when I pass that location today."],"Date of the Event":"05/31/1971 12:00 UTC","Object Shape":"Square, Rectagular","Longitude":"-88.038984","Tags":"City","Date Submitted":"05/31/1971 12:00 UTC","Object Features":"None","Latitude":"30.701647","Log Number":"US-10052008-0005","trends":["There have been 19 other sightings in Mobile","There were no other sightings in Mobile on or around May 31st 1971"],"Object Flight Path":"Hovering then path","Region":"Alabama","Viewing Distance":"101-500 Feet","City":"Mobile","files":["/var/www/straped/mufon/html2text/12923.html.txt","/var/www/straped/mufon/org/12923.html"],"Source":"MUFON","Case Number":"12923","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.701647,+-88.038984(12923)&iwloc=A&hl=en\"> mufon case (12923) map </A>"}