{"files":["/var/www/straped/mufon/html2text/12938.html.txt","/var/www/straped/mufon/more/12938_submitter_file1__oct62008pic1.JPG","/var/www/straped/mufon/org/12938.html"],"Summary":"Picture of extremely bright fireball type of light in western sky at dusk and just after","Object Shape":"Diamond, Fireball, Star-like","Latitude":"39.376092","Source":"MUFON","Longitude":"-104.85415","Date of the Event":"10/06/2008 07:09 UTC","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsOver the past two weeks I\"ve seen several bright star-like objects here in Colorado, in places they shouldn't be, and have even reported them with mufon. Just tonite I got video (vhs sorry), but also got pics of an insanely bright light that hovered just at dusk and just as it got dark, about 30 minutes. It was brighter than venus and at least appeared to be two to three times larger than it and any other star, not to mention that a star or planet wouldn't be at this spot in the sky, especially in the western sky, low, at 7pm. I've attached a picture that I uploaded, cropped and \"auto fixed\" in MS OFfice picture manager so you could see the brightness. The picture was taken at 10x optical zoom. In the picture, there appears to be a perfectly shaped star light above it, that wasn't visible with the naked eye, though in the binoculars, it appeared to \"spit\" colors off of itself, which I guess is what is at the top corner. It looked like an orb in the sky, and pulsed, not flashed, but pulsed like a heartbeat. As you'll see, my hand wasn't perfectly steady at the moment it pulsed, so it looks longer in the picture than it did in the sky. It stayed in that spot for almost 20 - 30 minutes and then was completely gone and away from that spot, heading west into the mountains, in less than a minute or two. There's no way it was a plane. I've never seen anything like it, so close and bright, just after sunset especially."],"Weather Factors":"Windy","Disposition":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-10072008-0001","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around October 6th 2008","This sighting has never been favorited.",""],"Country":"United States","Date Submitted":"10/06/2008 07:09 UTC","Object Features":"Unknown","Case Number":"12938","Object Flight Path":"Stationary,Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=39.376092,+-104.85415(12938)&iwloc=A&hl=en\"> mufon case (12938) map </A>","Region":"Colorado","City":"Castle Rock"}