{"Tags":"City","Object Features":"Undisclosed","Region":"Washington","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"10/01/2008 12:00 UTC","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around October 1st 2008","This sighting has never been favorited.",""],"City":"Bremerton","files":["/var/www/straped/mufon/html2text/12931.html.txt","/var/www/straped/mufon/more/12931_submitter_file1__100_7109.JPG","/var/www/straped/mufon/more/12931_submitter_file2__100_6994.JPG","/var/www/straped/mufon/org/12931.html"],"Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Sphere, Triangle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.57653,+-122.64265(12931)&iwloc=A&hl=en\"> mufon case (12931) map </A>","Latitude":"47.57653","Viewing Distance":"Unknown","Summary":"Invisible to naked eye. Flashes of color outside window caught my attention.","Longitude":"-122.64265","divs":["Sighting DetailsI was working on some art projects when colors of red-green-blue flashes caught my attention outside of the window directly across from me. The blinds were down. At the very top of the blinds where a space is between the slat and the sill (top crack of blind's slats) is where it was flashing. So I looked out and didn't see anything so I grabbed my camera and went outside onto the back balcony deck overlooking the Naval Shipyard. The clouds were anomalous and so I started shooting. Two bright white orbs appeared and kept their distance from each other and came to a stop right above me. Then took off to the left side of the skies above. Two more orbs appeared and came from same area the first two orbs seemed to have come from. This picture is taken around the left side of the skies where the objects took off into. This was not a digital glitch in my 10 meg Kodak digital camera. Then when you zoom into this object- the pixelation is not the usual in digital photography. Instead it appears like a circuit board design! What do you all think? This was invisible to the naked eye."],"Case Number":"12931","Disposition":"Hoax","Log Number":"US-10062008-0003","Country":"United States","Date Submitted":"10/01/2008 12:00 UTC"}