{"Object Shape":"Other","Latitude":"35.202862","Date Submitted":"09/28/2008 09:25 UTC","Region":"Arizona","divs":["Sighting Details My girlfriend and I had spent the day in Flagstaff on the 28th of September 2008. Our last stop was Barnes and Noble, which took us about three hours. We left Barnes and Noble at about 9:15pm with loads new books and cds. My girlfriend unwrapped her new Libera boy's choir cd and we started listening to that. We headed towards Sedona on I-17 and then made our exit onto 89A south as we usually do. We passed Jackson's Grill on our right and continued for maybe 1-2 miles before first seeing the UFO. We saw a steady yellow orange light in the distance, south of us. My girlfriend pointed the light out. Weweresurprisedtoseethislargelightunlike anything we had ever seen in the night sky. We could see the light getting closer and closer. The craft moved to the left, East and disappeared for a second behind the dense pine forest. A moment later it reemerged and at that point it was about 3,000 feet away from us, it was floating right above the pine trees to the left of the highway ahead. We didn't stop the car at any time, we kept moving. We moved closer to the craft until we were about 700 feet away from it. We could see that it was peanut shaped with a large, yellow, rectangular window in the center. Either the window was tinted yellow or the interior was yellow in color. We didn't see any beings inside. There were lights all over the craft but there was no order to their placement, very random. There was a large red light and a large green light and lots of little cream-yellow and blue lights all over the craft. The craft was about the size of a one story large house. There was no noise, no dirt was stirred, the tree tops didn't sway at all. Alexandra was holding my hand tight and somehow seeminly calm. I was quite scared because there was absolutely no doubt or question as to what I was seeing a short distance from the car. That realization gave me an instant cold sweat and an instant desire to leave a quickly as possible. With shouts of curses I urged Alexandra to accelerate. I was even too frightened to look over my shoulder towards the rear of the car, but I did just in time to see a flash of light through the trees followed by a flood light of some kind. The light was shining directly at us, that urged my fear on even more. I looked foward and did not look back. Seconds later we passed a car heading North, our instinct was to stop them but honestly too afraid to do so. This car would have seen the light. There was no other car on the road that would have seen the craft but the two of us. There were two UFOs in the sky that night, one we saw up close, the other stayed in the sky the whole time fixed in one spot. At a distance this second craft looked just like the first one we saw, an orange-yellow large light. We didn't experience any missing time that we know of. We sketched the craft as soon as we got home."],"Sighting Duration":"Undisclosed","Country":"United States","Summary":"Roadside sighting of craft about 5 minutes south of Flagstaff.","Log Number":"US-10062008-0007","files":["/var/www/straped/mufon/html2text/12935.html.txt","/var/www/straped/mufon/org/12935.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.202862,+-111.635479(12935)&iwloc=A&hl=en\"> mufon case (12935) map </A>","Object Features":"Window(s)","City":"Flagstaff","trends":["There have been 24 other sightings in Flagstaff","There were no other sightings in Flagstaff on or around September 28th 2008"],"Disposition":"Unknown","Tags":"City","Weather Factors":"None","Object Flight Path":"Path then hovering","Longitude":"-111.635479","Date of the Event":"09/28/2008 09:25 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"12935","Source":"MUFON"}