{"Object Flight Path":"Straight-line path","Date Submitted":"10/06/2008 02:28 UTC","Case Number":"12940","Region":"California","Object Shape":"Triangle","trends":["There have been 7 other sightings in Murrieta","There were no other sightings in Murrieta on or around October 6th 2008"],"Summary":"A triangle shaped craft passed silently almost directly overhead at an altitude of 300-500 ft AGL.","Longitude":"-117.130883","divs":["Sighting Details1. Q. Where were you and what were you doing at the time? A. I had just finished a bicycle security patrol of the site and had returned to my vehicle to write my observations and complete my report. At 2:26 a.m. I wrote how clear and calm it was outside. No wind what so ever. No humidity in the air or moisture on my vehicle. \"Earthquake Weather\"? I even think the insects and animals in the distance stopped making noises. It was too quiet. 2. Q. What made you first notice the object? A. I had just entered my observations into the site log. Ending comments in the log noted something to the effect that the night sky was extremely clear and calm. I exited my vehicle and looked to the south, the direction the vehicle was facing to observe the site below. I was parked on a dark hilltop away from the city lights and within sight of the rotating beacon at our local airport (French Valley airport - FAA Designation F70) located approximately 2 miles to the southeast. From the hilltop, I look down (and south) onto a lighted parking lot on the site I patrol. The lower surface of the craft became visible as it approached the parking lot from the south. The parking lot lights were being reflected off of the lower surface of the craft which means the craft was low enough to be able to reflect the light off it's lower surface. The craft was not shinny or metallic in nature. My first thought (as a hang glider pilot) was why is there a hang glider flying in the darkness (No moonlight)? A hang glider would not be able to maintain altitude in the current weather conditions. 3. Q. What did you think the object was when you first noticed it? A. I am a hang glider pilot, ex-military pilot and FAA licensed private pilot for over 27 years. I am familiar with all declassified types of military and civilian aircraft. At first, I thought it was a hang glider. But, I thought to myself, what would a hang glider be doing out here flying on a 'moonless' night? The craft was maintaining it's altitude. A hang glider would be descending. It was not a hang glider. I was amazed at how it silently passed overhead without the aid of wings as we know them. I thought the craft appeared to be too large for a so called drone. 4. Q. Describe the object and its actions and motions. A. I observed the craft as it traveled through a viewing arc of approximately 60 degrees. The time to pass through this arc was approximately 10 seconds. I estimated the speed at about 80 to 100 miles per hour. There were no exterior anti collision lights or strobes. There were no markings on the lower surface of the craft except for the unique camouflage pattern. The object was a triangle shape as viewed from the bottom side only. It had an aspect ratio of approximately 3:4. Wing span 3 : Fuselage 4. I did not see a side view profile. As the craft flew directly overhead, I reached through the open window into my vehicle for my fully charged 'Mag Light' flashlight, laying on the drivers seat, which was previously adjusted to deliver a tight beam of light and illuminate an object to approximately 300 feet. I did not take my eyes off of the craft as I reached for the light. I aimed the Mag Light at the passing craft hoping to see anymore detail, with no effect. Therefore the craft was slightly higher than 300 feet. I would estimate 400 or 500 ft AGL. I measured the width (wing span) of the craft by spacing my right thumb and forefinger apart accordingly. Then, I turned south to the parking lot below and held my fingers at the same 'arms length' against a section of fence lining the parking lot. I proceeded to that section of fence and paced it off. I calculated 42 to 45 feet. At a ratio of 3:4. A 45 foot width translates into a 60 foot length. My flashlight can typically illuminate an object at approximately 300 feet under those same atmospheric conditions. However, the craft was just out of range of my beam of light as it passed overhead. And below the standard traffic pattern (approximately 700 ft (AGL) for the nearby French Valley airport. The craft was silently (no humming, electrical or pulsing noise) traveling from south to north (on the grid ). Again, it was dead quiet outside.Not magnetic north. As it passed by, I located Polaris, the north star and the craft was heading directly toward it. My flashlight beam did not affect the craft and there was no reaction from it. I recently learned that a birds flight path can be affected or altered if you shine a high beam light at or in front of the bird in flight. I know this from first hand experience. There was an odd camouflage pattern on the lower surface of the craft as it passed overhead. I asked myself why the bottom of the craft would need to be pattered in such a way? 5. Q. Describe your feelings, reactions and actions, during and after sighting the object. A. I couldn't believe what I was seeing. I removed my prescription glasses and rapidly rubbed each eye while keeping one eye on the object at all times. I only wish a had a witness to verify what I was seeing. I was 'Wowed' but not overwhelmed. However, I am a scientific realist and cannot believe that this object originated on another planet. This technology could be the result of a \"Black Government Project\" The crafts clean, simple and concise lines were easily seen. There was nothing left to the imagination. I felt afterword that if this was extraterrestrial in nature, I would have expected a more aerodynamic looking craft designed with more compound curves. again, I felt this was military and NOT extraterrestrial. However,I felt the technology would be extraterrestrial in nature. 6. Q. How did you lose sight of the object? A. The craft and faded out of sight into the darkness when the lower surface was no longer illuminated from the ambient light provided by the parking lot lights below."],"Disposition":"Unknown","Weather Factors":"Unknown","Latitude":"33.575891","files":["/var/www/straped/mufon/html2text/12940.html.txt","/var/www/straped/mufon/org/12940.html"],"Viewing Distance":"101-500 Feet","Source":"MUFON","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.575891,+-117.130883(12940)&iwloc=A&hl=en\"> mufon case (12940) map </A>","City":"Murrieta","Log Number":"US-10072008-0003","Sighting Duration":"Undisclosed","Date of the Event":"10/06/2008 02:28 UTC","Object Features":"Patterned Surface"}