{"Case Number":"12949","divs":["Sighting DetailsA friend and I were on our way home from a photography workshop in Jackson, and stopped at the City of Rocks National Reserve in Idaho for the night to camp and shoot some night photos. After a while of shooting, my friend told me to come to where he was and pointed out what looked like a star that was changing colors from a pinkish color to green to white, blue and yellow. We both thought the color changing was strange, but he told me to keep watching. A moment later, the color changing light moved very erratically up and to the right. The movement was similar to what a sheet of paper would do if you dropped it, only moving upwards instead of down. We both watched it for a while, trying to figure out what it was. We thought it might be an airplane or helicopter, but the movement was not like any type of aircraft that I know of. The colors were also not that of aircraft that I know of. Sometimes the movement was kind of slow, others it moved a great distance very quickly. We watched it for a while, and after a while we both had to get some sleep, and went to bed. We both thought about reporting it, but figured nobody would believe us, and think that since we are photographers that we were trying to pull off some sort of hoax. We were both very confused just trying to figure out what it could be. It wasn't until I talked to my brother about it that I decided to report it. He told me it sounded similar to the lights sighted over Stephenville, Texas, recently. I looked for photos of this event online, and found something that was very similar to what I had shot, and decided that I should report the incident. The first photo is shot with a 300mm lens fully zoomed in for 5 seconds. The second photo is just a cropped image to enlarge detail. No editing was done to either photo, except for cropping of the second image."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.424469,+-111.886932(12949)&iwloc=A&hl=en\"> mufon case (12949) map </A>","Country":"United States","Weather Factors":"Windy","Log Number":"US-10082008-0003","Disposition":"IFO","Viewing Distance":"Over One Mile","Object Shape":"Star-like, Unknown","Latitude":"33.424469","Date Submitted":"09/27/2008 03:30 UTC","files":["/var/www/straped/mufon/html2text/12949.html.txt","/var/www/straped/mufon/more/12949_submitter_file1__IMG_3664.jpg","/var/www/straped/mufon/more/12949_submitter_file2__IMG_3664zoom.jpg","/var/www/straped/mufon/org/12949.html"],"Region":"Idaho","Source":"MUFON","Summary":"Color changing light moving erratically just off the horizon way off in the distance.","trends":["There have been no other sightings in Tempe","This sighting has never been favorited."],"Sighting Duration":"00:30:00","Date of the Event":"09/27/2008 03:30 UTC","City":"Tempe","Object Features":"None","Tags":"City","Object Flight Path":"Other","Longitude":"-111.886932"}