{"Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Bright constant light moved across sky, headed south, suddenly turned RED and then quickly decreased in size and brightness until it disappeared.","Object Shape":"Star-like","Tags":"City","Case Number":"12947","Latitude":"37.041616","divs":["Sighting DetailsMy girlfriend and I stepped outside my house in Bonny Doon, CA in order to go to an outbuilding. Directly in our line of view as we stepped down the stairs, we noticed a big bright white light moving in a straight line across the sky. I thought it must be an airplane at first. We watched it as it went over head. It moved about the same speed as an airplane. However, it was brighter than a normal airplane and consisted only of a single light - no flashing. There was also no noise. It also occurred to us that it might be a satellite, but it seemed much lower and larger than that. As it moved further towards the southern end of the sky, it began to turn bright red. As it turned red, it also got smaller and smaller. The intensity of the light also seemed to dim as though it was fizzling out or moving very far away very fast. This happened for no more than 5 seconds before it disappeared completely. Neither my girlfriend nor I felt many emotions during the event, other than fascination and a little disbelief. We stopped in our tracks and just watched it. We asked each other, \"is it turning red?\" and \"wow, did it just disappear?\" - stuff like that. We both saw the same thing. About a minute or two after it had disappeared, a loud airplane flew across the sky headed in about the same direction. It was somewhat low in the sky and didn't seem to be a regular passenger jet. Not really an expert on planes but it looked weird - 4 red lights in a row in the back with one long white light along the hull."],"Object Flight Path":"Straight-line path","trends":["There has been one other sighting in Bonny Doon","There were no other sightings in Bonny Doon on or around October 7th 2008"],"Longitude":"-122.150522","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/12947.html.txt","/var/www/straped/mufon/org/12947.html"],"Date Submitted":"10/07/2008 12:00 UTC","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=37.041616,+-122.150522(12947)&iwloc=A&hl=en\"> mufon case (12947) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-10082008-0001","City":"Bonny Doon","Region":"California","Country":"United States","Date of the Event":"10/07/2008 12:00 UTC","Source":"MUFON"}