{"Object Flight Path":"Undisclosed","Country":"United States","Latitude":"25.792889","divs":["Sighting DetailsWEDNESDAY This is what happened...I took Tylenol PM went to sleep, I couldn't tell you exactly the time maybe around 3:15am and some kind of movement inside the bedroom made me open my eyes, I saw a small figure, light grey color around 3 ft tall and very skinny, he was holding a light not a candle more like a long stick with a small flame and he was running out of bedroom to the hall next to the bathroom, I couldn't believe it so I closed and open my eyes several times and got to the conclusion that I was dreaming or maybe the effect of the PM Tylennol and decided to sleep again. Around 15 minutes later or maybe 25 minutes I heard some voices out in the living room, voices in echo like when you go to a funeral and everybody talks whispering to each other but loud enough that if you are sleeping the only thing you can hear is their voices without understanding any word they are saying, after this voices I went to sleep again thinking it was a nightmare. minutes later some movement inside the closet made me open my eyes again, I saw 2 little people like I described above, they were both playing with the fire stick and they seemed to enjoy whatever game they were playing, I felt very scared and tried not open my eyes so much just in case they noticed I was watching them, but again I felt it was a nightmare because my body felt wet from sweat and paralized. At 5:45AM my boyfriend left the house for work and before he left I remembered I asked him to leave the light in the hallway on. I was scared but had no time to tell him about the crazy dreams. After work came home and took a shower I was looking all over my body for some clues but found nothing I even told my boyfriend to check my right ear because was hurting a little he said I had something like a pimple but that was it. Two days later came from work around 5PM and the TV was off, when I noticed the TV screen inmediately asked my boyfriend if he was playing with my head because until this day I think I'm crazy just by think something so different and unknown can happen to me, but he told me no, I do believe his word. then we took the picture. Margaret believe me, until this day I got to the conclusion that I was dreaming but how can I explain the TV screen? I told Bruce I have no reason to lie and if the rest of the world thinks I'm making this up, that's fine with me, I believe in myself and have no reason to lie. I hope I did not bored you with my story, maybe one day we can meet and hopefully I can explained myself better. Thanks, Ana"],"Viewing Distance":"Unknown","Sighting Duration":"00:30:00","Object Shape":"Undisclosed","City":"Miami","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"04/30/2008 03:15 UTC","Object Features":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.792889,+-80.219969(12955)&iwloc=A&hl=en\"> mufon case (12955) map </A>","Tags":"City","Region":"Florida","Date of the Event":"04/30/2008 03:15 UTC","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around April 30th 2008","This sighting has never been favorited.",""],"Longitude":"-80.219969","Case Number":"12955","files":["/var/www/straped/mufon/html2text/12955.html.txt","/var/www/straped/mufon/more/12955_submitter_file1__AnaGsketch047.jpg","/var/www/straped/mufon/more/12955_submitter_file2__TVprints.JPG","/var/www/straped/mufon/org/12955.html"],"Summary":"Small Entities with Light Sticks; Prints on TV Screen","Log Number":"US-10082008-0009"}