{"Region":"Florida","Object Features":"Window(s)","Tags":"City","Case Number":"12965","files":["/var/www/straped/mufon/html2text/12965.html.txt","/var/www/straped/mufon/org/12965.html"],"Log Number":"US-10082008-0019","City":"Brooksville","Viewing Distance":"21-100 Feet","Longitude":"-82.386821","trends":["There have been 8 other sightings in Brooksville","There were no other sightings in Brooksville on or around November 30th 1975"],"Sighting Duration":"Undisclosed","Summary":"Metallic object came over our head VERY close","map":"<A HREF = \"http://maps.google.com/maps?q=28.558232,+-82.386821(12965)&iwloc=A&hl=en\"> mufon case (12965) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"11/30/1975 12:00 UTC","Source":"MUFON","Date of the Event":"11/30/1975 12:00 UTC","Disposition":"Unknown","Object Shape":"Disc","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsI don't tell this very often since no-one believes me anyway, but I think it was 1976 near where I live now which is near some old mine pits, I was on the golf course with my girlfriend when I heard a noise sounded kinda like a motor whine which drew my attention to a pump station which was nearby at which time we saw coming over the trees the most awsome site I have ever seen. A flying saucer ? it was round, it was metallic colored and it did have light panels however I could not see inside or did not see any markings on the vessel. I did not see any exhaust and am not sure if the sound I heard had anything to do with the ufo or if it was the pump kicking in which just caught our attention. I did not notice a sound as it came over us and it was so low it was scary. It did not spin and I did not see legs hanging down or anything like that. My only saving grace is that my best friend had a sister working at the radio station here in town and when I told him the story her laughed then said that he guess it isn't that funny afterall, that alot of calls came in that night about a ufo siting. Anyway, I don't know if it was some NASA test craft or what, but I have yet to see anything else like it. I've never reported this since I didn't know how to go about it and also I really didn't want to be made into some nutcase like another ufo observer locally was. Now that I'm older, I wanted to make sure someone knew that might actually care. Thank you My other witness I no longer see, but I can contact if need be. She's married and in another state. I emailed her a couple years ago about this and she said hardly a day goes by that she doesn't think about it."],"Latitude":"28.558232"}