{"Region":"Michigan","City":"Redford Charter Township","Sighting Duration":"00:20:00","Date of the Event":"10/07/2008 03:35 UTC","files":["/var/www/straped/mufon/html2text/12967.html.txt","/var/www/straped/mufon/org/12967.html"],"Country":"United States","Tags":"City","Disposition":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.394449,+-83.297373(12967)&iwloc=A&hl=en\"> mufon case (12967) map </A>","Case Number":"12967","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/07/2008 03:35 UTC","Weather Factors":"Does Not Apply","Object Shape":"Circle, Flash, Sphere","Latitude":"42.394449","trends":["There have been 2 other sightings in Redford Charter Township","There were no other sightings in Redford Charter Township on or around October 7th 2008","This sighting has never been favorited.",""],"Summary":"Unusual multi-colored light observed from Redford Twp.","divs":["Sighting DetailsIt was about 3:30am and I woke up to get something to drink and make sure my back porch doorwall was locked. I looked to the southwest and these multi-colored lights caught my attention. I live under the DTW flight path but there were no flights at that hour of the night. I watched it for about 5 minutes when I decided to wake my wife up who also witnessed the lights for about 5 minutes. Our digital camera was sitting out so I decided to film about 10 minutes of the lights. When I first observed it was lower in the sky with the tree that can be seen in the video. When I started filming they had moved higher in the sky. As the video shows there was no sound coming from it and it was the brightest object in the sky. What the camera didn't pick up and that I observed were two lights that was circle around from left to right. After about 20 minutes of watching this object I finally went to bed because I had to get up for work in a few hours. I wasn't scared because I knew it was a distance away."],"Longitude":"-83.297373","Object Flight Path":"Hovering then path","Log Number":"US-10092008-0002","Source":"MUFON"}