{"map":"<A HREF = \"http://maps.google.com/maps?q=36.348286,+-88.848028(12969)&iwloc=A&hl=en\"> mufon case (12969) map </A>","Sighting Duration":"00:05:15","files":["/var/www/straped/mufon/html2text/12969.html.txt","/var/www/straped/mufon/org/12969.html"],"Disposition":"Unknown","Date Submitted":"10/08/2008 08:25 UTC","divs":["sighting detailsi had been watching this flashing star for two weeks since my mom told me about it. every few days more and more become apparent. last week i looked through my telescope at the only one noticeable. it was oval and emitted 3 colors. it's center was dim, but the outside..white light like a halo. now, 10\\8\\2008, there are like 15 of them. and the brightest one has many more colors, which i believe is cause it's closer now. i look through the telescope now and i am am [pd] astonished. the colors are moving around in circles around this oval. and the inside of the oval looks like the white fuzz on a tv without signal, and almost like a bullseye more prominent over the fuzz. at 8:25 pm or so, it moved to the left and then downward. it disappeared shortly then hovered back what seemed to be upward with the white lights off...yet still very colorful blinks of light. question 6.. says how did i lose sight of the object. i lose sight when the sun oves out. but they get closer everyday. it's 3:26 and they're out there now. i showed my co-worker and before he thought i was just being as he would say \"retarded\". he seen it and all the rest and he sure can't come up with an explination. my mom as well researched this. she believes that this is not the star sirius as i've read in other blogs and debunking forums."],"Source":"MUFON","Log Number":"US-10092008-0004","Viewing Distance":"Unknown","Case Number":"12969","Date of the Event":"10/08/2008 08:25 UTC","Region":"Tennessee","Tags":"City","Weather Factors":"Does Not Apply","City":"Martin","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Martin","There were no other sightings in Martin on or around October 8th 2008"],"Latitude":"36.348286","Country":"United States","Object Shape":"Oval","Summary":"Flashing star moved horizontally, then downward. turned off white lights and hovered back up.","Longitude":"-88.848028","Object Features":"Unknown"}