{"Longitude":"-95.802741","Date of the Event":"10/07/2008 12:00 UTC","Region":"Texas","Source":"MUFON","Weather Factors":"None, Does Not Apply","divs":["Sighting DetailsMy family and i just moved from the city to the country a couple of months ago and ive been amazed by the view of the night sky out here. You dont see stars like this in the city. I smoke outside and at night spend the break-time looking up at the sky. Since day one, there has been a brilliant star-like light thats always brighter than all the other stars that caught my eye. Its always in a different location, but remains in the same general vacinity- to the right of the house or to the left of the house.. sometimes its a twinkling white light and sometimes its mixed with a shade of red ( but still always brighter than all the other stars ). A few weeks ago i noticed the light moving in a zig-zag pattern until it disappeared behind the tree-line. I rationalized that it was a weather-balloon.. a plane ( though no noise ). Two weeks ago the light has become ( for lack of a better way of describing it ) vividly active.. Moving rapidly across the sky ( sometimes in a zig-zag pattern ) then come to a sudden and complete stop. It always seems to be lower than all the other stars, but just high enough that it only looks like a light. Im still rationalizing its some kind of weather-balloon.. a helicopter even though no sound. To be funny, one night last week i grabbed a flashlight and blinked the light in the direction of the object off and on for about 3 or 4 minutes. It seemed to have made no difference and it just sat there so i went into the house. About 30 minutes later i came out and it had moved directly across the door of the house where i was standing earlier. Scared me to death.. i went in shut the door and decided i didnt want to know what it was or who it was anymore. Over this past weekend, my husband has a police scanner he listens to and overheard a local lady calling in observing \"my ufo\". The dispatch has plugged her call in with the local police department and you could hear her reporting seeing the object in the same vacinity. She was crying.. her kids were crying in the background. Finally.. someone else besides me has seen that light! The police dept. reported they called the local airports and said there is a blimp company starting up tours of the area and that is the object. I had a hard time believing a blimp company was giving tours at 9:00 at night.. what can you see in the dark, but thought ok.. thats all it was. My ufo is a blimp. My usual routine of having a smoke-break out on the porch led me out off the porch .. a few feet out in the yard to look in the direction of the blimp and there it was.. moving towards me in a direct and deliberate way. For some reason, i was scared so i moved a couple of feet in towards the stairs of our deck to see if it would change its direction. I peeked back and it was still moving in my direction. I climbed about 5 steps and kept my view behind our roof-line to see if it would continue.. it stopped. I went back down the stairs to see what it would do next and it just appeared to be going up until it got smaller and smaller until it disappeared. That was No blimp! I dont know what im seeing and ive debated about reporting it on here, but curiosity won on maybe others would report seeing it too thats in my area once someone else did. Theres definately Something other than rational explanations!"],"Disposition":"Unknown","Latitude":"33.024283","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.024283,+-95.802741(12960)&iwloc=A&hl=en\"> mufon case (12960) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12960.html.txt","/var/www/straped/mufon/org/12960.html"],"Country":"United States","Viewing Distance":"Over One Mile","Summary":"A brilliant light hovering then zig-zagging through the sky.","Case Number":"12960","Log Number":"US-10082008-0014","Object Shape":"Star-like","City":"Miller Grove","trends":["There have been no other sightings in Miller Grove","This sighting has never been favorited."],"Date Submitted":"10/07/2008 12:00 UTC","Tags":"City"}