{"City":"Los Angeles","Object Features":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12978.html.txt","/var/www/straped/mufon/org/12978.html"],"Date of the Event":"10/08/2008 09:30 UTC","Latitude":"34.23597","Longitude":"-118.371636","Object Flight Path":"Hovering then path","Case Number":"12978","Object Shape":"Circle, Fireball, Star-like","Summary":"Bright Lights over Los Angeles","Log Number":"US-10092008-0013","divs":["Sighting DetailsI looked up at the sky last night and was surprised at to how clear a view I was getting of so many stars. I had hear about UFOs becoming more apparent as October 14th approaches. So I decided to scan the sky (I live among an Industrial area, so alot of my view of the sky is blocked) So from the point that I looked... (towards East of LA) there was a Star like object. If I had not kep on looking at it, it could very easily be confused for a regular star. But if you look at it intently, you would notice that there were colored lights coming from it. It looked like it was flickering. Then I saw it moving up, down, side too side (it was too far and it moved too fast for it to have been an airplane or helicpoter.) Also, it was shooting out smaller Star like objects. These object would shoot out... like shooting stars through the sky. These smaller object would come in and out of the bigger and colorful object. ( the smaller ones wer just white) I had to call my husband out to check it out. And though he has vision problems... and almost never sees what I see in the sky, this time he saw it too. I plan on borrowing a camera and filming this stuff."],"Region":"California","Date Submitted":"10/08/2008 09:30 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 8th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.23597,+-118.371636(12978)&iwloc=A&hl=en\"> mufon case (12978) map </A>","Tags":"City","Weather Factors":"None","Disposition":"IFO"}