{"Object Features":"Undisclosed","Case Number":"12971","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-81.646981","Country":"United States","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around October 9th 2008","This sighting has never been favorited.",""],"Region":"Florida","Log Number":"US-10092008-0005","Tags":"City","divs":["Sighting Details9:00 in the morning I was on my email, when my son and daughter ran in from the back porch saying they saw a kite. They routinely look in the sky and we watch planes and helicopters and they are excited by that. I started asking what kind of kite and they said at first it was a circle, then a ball. I immediately became curious. I started drawing shapes on a piece of paper like a triangular kite. And he said no. I drew a circle and he said no, then I drew a sphere and shaded a side of it, and my son said it looked like the sphere I drew. I asked what color it was and they started naming all of them. I then thought if this is shiny they might be seeing reflections. I held up my cell phone which has a metallic looking casing and asked my son if that was the color, and he said yes. He said it moved fast and slow. But what I gathered was it moved steady across the sky. He even told me exactly where his sister and he were standing and they both confirmed which way it went. I asked if it made a sound like a plane or helicopters, as we see those often where we live. They said no. In his own words, \"we see airplanes and helicopters. It was different.\" They are 3 and a half years old and gave what i think is a pure description of what they saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.334184,+-81.646981(12971)&iwloc=A&hl=en\"> mufon case (12971) map </A>","Date of the Event":"10/09/2008 09:02 UTC","Latitude":"30.334184","Date Submitted":"10/09/2008 09:02 UTC","Summary":"Son and daughter said they saw a \"kite\"","Object Shape":"Sphere","Source":"MUFON","City":"Jacksonville","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/12971.html.txt","/var/www/straped/mufon/more/12971_submitter_file1__Drawing1.jpg","/var/www/straped/mufon/more/12971_submitter_file2__Drawing2.jpg","/var/www/straped/mufon/org/12971.html"]}