{"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10092008-0010","Date Submitted":"01/30/1947 10:10 UTC","files":["/var/www/straped/mufon/html2text/12975.html.txt","/var/www/straped/mufon/org/12975.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.768763,+-95.36048(12975)&iwloc=A&hl=en\"> mufon case (12975) map </A>","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around January 30th 1947"],"City":"Houston","Date of the Event":"01/30/1947 10:10 UTC","Tags":"City","Country":"United States","Case Number":"12975","Sighting Duration":"00:04:00","divs":["Sighting DetailsMe and my sister were sitting on back porch when i noticed light coming over neihbors roof.The object was moving south to north at about 300 mph.Strange red and blue laser type lights extended about 10 to fifteen feet below craft and stopped.There was no yellow light but was a flashing light close to laser lights but was not yellow. Craft came about one quater of mile form going overhead.There was no sound.Craft seemed to have round shape about 20 feet in diameter.After going over house 2 minutes later it appeared going east to west.Im fimiar with most aircraft and this was strange espicially with no sound.My chair just happened to be facing south and i picked up objest after it came over neihbors roof.I felt that i had seen a real ufo by definition.Me and my sister talked about sighting for 30 minutes and went to bed.I thought about event for 10 or 15 minutes before i went to sleep.It could have been someone trying to do a hoax but there was no sound.Wish i had it in video.Would like to know who else say it and what they think."],"Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Longitude":"-95.36048","Object Shape":"Unknown","Summary":"Object appeared to be at 3 to 5 thousand feet .Six red and blue laser type lights,no yellow. No sound.","Region":"Texas","Latitude":"29.768763"}