{"trends":["There have been no other sightings in Bellmere","This sighting has been favorited 1 time."],"Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"10/09/2008 05:50 UTC","Object Shape":"Bullet, Missile, Cigar, Cylinder","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was walking home from work. The clouds were amazing, beautiful giant stormclouds that rose right up high into the atmosphere, moving so FAST you almost felt like that they were moving away at the same pace you were walking. It was while I was admiring the clouds that I saw something which was white. At first glance I saw it had a white trail behind it, same color, and as we're under plane airspace, I thought 'a plane skywriting'. (Now that I think about that, it's odd to think that, because it was VERY HIGH UP, as high as the top of this huge storm cloud that reached high into the atmosphere, and who skywrites so near a stormcloud?) Then it suddenly cut off. The white 'trail' cut off suddenly. I realized that this thing was all one object, not a white plane with a white trail, that the color was all the same. It was like a long thin white ...worm, cigar, whatever. It must have been huge, it was so high up and yet it was about an inch long from where I stood. So I stood there amazed watching the white thing as it flew, really flew, really moved fast, right into a headwind. (Against the direction of the clouds.) It continued till it was above another really high atmsophere cloud, and there I lost sight of it. But yeah, no question. It was not a plane, it was NOT a 'plane skywriting', it was something long and thin and very very white. I have the feeling that it didn't mind that I'd seen it, but I feel crazy admitting that. It's not the first UFO I've seen in the past two weeks. I reported seeing one fifteen days ago as well, but it was a different shape and different color. Sighting was at location '62 Piggot Rd Bellmere Queensland Australia' as viewable on Google Street Maps. Facing South South west. Sorry about colors in pic, paint isn't very helpful. It wasn't quite THAT dark but it was sunset..."],"City":"Bellmere","Case Number":"12988","Disposition":"Unresolved","Country":"Australia","Summary":"Long white UFO.","Longitude":"152.944912","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/12988.html.txt","/var/www/straped/mufon/org/12988.html"],"Date Submitted":"10/09/2008 05:50 UTC","Source":"MUFON","Latitude":"-27.075527","map":"<A HREF = \"http://maps.google.com/maps?q=-27.075527,+152.944912(12988)&iwloc=A&hl=en\"> mufon case (12988) map </A>","Log Number":"AU-10092008-0023","Region":"Queensland"}