{"Weather Factors":"Unknown","Log Number":"US-10092008-0020","Date Submitted":"06/10/2005 12:00 UTC","Longitude":"-118.108954","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Montebello","There were no other sightings in Montebello on or around June 10th 2005"],"Source":"MUFON","Summary":"Typical Saucer (round) sliver in color and multi colors of lights.","Latitude":"34.022355","files":["/var/www/straped/mufon/html2text/12985.html.txt","/var/www/straped/mufon/org/12985.html"],"Case Number":"12985","Disposition":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","City":"Montebello","Object Shape":"Other","divs":["Sighting DetailsI was walking my dog at the Henry Acuna Park in Montebello. The month is not remembered but the year was 2005 spring. The funny thing is not one person was there to witness it with me when usually there are at least a dozen people who are either jogging or walking their dogs. I was walking east when I looked straight ahead about 100 feet up in the air and one block away from where I was standing- a silver saucer sort of fat with red, blue, yellow lights all around the rim. I have always had an interest in UFO's and it happened on a day when I was not looking for one. It was still day light. A weird sense of calmness came over me. As I turned to look for other witnesses, I didn't find not one person. It was very strange. Just me and my dog. I stopped and stared at it for at least two minutes which is a long time then suddenly (by the way no noise, it was just hoovering so still) the brightest, whitest light came out from the bottom of it, strectching straight down perfectly. I've never seen light like that. It slowly went straight down and obviously landed on someones yard as it was a typical neighborhood. I then began to continue on with my walk as if it was no big deal. I was very calm, which is strange because I should have ran to someones door to have them see it too! I never spoke about what I saw until a few weeks later. I told everyone I knew and course no one beleived me but my mother who has also witnessed a \"ufo\" back in the late 60's with my german father who is pretty closed minded and even he will admit it was not of this world. I also witnessed a strange metallic almost fluid like large ball of whatever it was outside of the 737 airplane while landing in the Ontario airport. The lady sitting in front of me screamed out. We both saw the same thing but the strangest thing again, is we didn't talk about it after that. We saw it clear as day flying side by side with the plane but got off the plane and didn't think twice about it. I do belive what I have witnessed on both occasions were our extended family from other worlds. I have a sense of why they are here and they don't frighten me. I am looking for witnesses to what I saw in the spring of 2005. Thank you, SM"],"Region":"California","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.022355,+-118.108954(12985)&iwloc=A&hl=en\"> mufon case (12985) map </A>","Object Features":"Undisclosed","Date of the Event":"06/10/2005 12:00 UTC","Tags":"City"}