{"files":["/var/www/straped/mufon/html2text/12984.html.txt","/var/www/straped/mufon/more/12984_submitter_file1__DSCF4166.jpg","/var/www/straped/mufon/more/12984_submitter_file2__DSCF4166Enhancedat300Percent.jpg","/var/www/straped/mufon/org/12984.html"],"Object Features":"Dome, Appendage(s), Other","Region":"New Mexico","trends":["There have been 6 other sightings in Angel Fire","There was one other sighting in Angel Fire on or around October 7th 2008","This sighting has never been favorited.",""],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.400298,+-105.280969(12984)&iwloc=A&hl=en\"> mufon case (12984) map </A>","Date Submitted":"10/07/2008 12:00 UTC","divs":["Sighting DetailsI was near the end of shooting about 300 photos of local autumn scenery and stopped at a friend's house to shoot the panoramic view of the Moreno Valley I knew could be seen from his main deck. While returning to my car, I noticed a flower pot on another small deck which juts out from the living room of his house about 12-15 feet above the driveway. The flowers hanging over the pot looked pretty against the bright blue cloudless sky, so I shot four pictures in a row of them, from about 20 feet away, using a telephoto lens. (The first shot was a \"single;\" the next three were a \"burst.\") The shots were aimed up toward the sky, slightly north, but mostly to the west. If there was any wind, I didn't notice it. I noticed the object in photo one (of the four I shot of that scene) when quickly scanning through the photos as I transferred them from my camera to my computer. Since I hadn't noticed anything in the sky when I shot the photo, I thought maybe the \"object\" resulted from a \"glitch\" in the camera. I made a copy of the photo at full size and enlarged it in Photoshop, then enlarged the section with the object in it again and \"enhanced\" it using the Photoshop Unsharp Mask filter at the following settings: Amount-500; Radius-25; Threshold-15. In the enlarged enhanced view, the object appeared to be solid, and not the result of a camera malfunction. I checked and rechecked the other three photos of the same scene and found no trace of the object in any of them. I mentally retraced my activities to determine the time when I shot the photo and then did test shots with the same camera to determine the amount of time which elapsed between the first and last photos in the scene (five seconds). I emailed copies of both the original photo and the enhanced enlargement of the object in the photo to folks I know in the UFO community asking for opinions. One person emailed back recommending I report to MUFON to learn if someone else saw the same object. Camera: Fuji S100, 12 megapixels. Setting for all four photos: automatic. I have saved all four original photos."],"Date of the Event":"10/07/2008 12:00 UTC","Summary":"Noticed object in photo when transferring photos from camera to computer a few hours after I shot them.","Log Number":"US-10092008-0019","Viewing Distance":"Unknown","Weather Factors":"None","Case Number":"12984","Country":"United States","Longitude":"-105.280969","Tags":"City","Object Flight Path":"Unknown","Latitude":"36.400298","Object Shape":"Other","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Angel Fire"}