{"Object Shape":"Flash","Summary":"A bright flash in the southern sky.","files":["/var/www/straped/mufon/html2text/12983.html.txt","/var/www/straped/mufon/org/12983.html"],"Object Flight Path":"Undisclosed","Log Number":"US-10092008-0018","City":"Undisclosed","Tags":"City","trends":[],"Date Submitted":"10/14/2006 12:00 UTC","Case Number":"12983","Viewing Distance":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.970343,+-91.825903(12983)&iwloc=A&hl=en\"> mufon case (12983) map </A>","Longitude":"-91.825903","divs":["Sighting DetailsWhile archery hunting I often look to the sky to relax my eyes from the intensity of looking through binoculars. On this day while gazing into the Southern sky a bright flash appeared at about a 60 degree angle. The flash lasted approximately 1.5 to 2 seconds and was the size of a pea. Not far from my location is a small airport that the Air Guard uses, so immediately I assumed it was one of their C-140's that often fly near the farm. I continued to watch that location expecting to see the military aircraft but saw nothing just empty sky. This struck me as odd because the brightness of the light indicated to me that if it had been from the C-140 I would have seen the airplane. I continued to scan the location, hoping to see something to explain the flash, but saw nothing. Because there was nothing to explain the flash I thought it could be possible that it was just a physiological dysfunction. However within a week while walking the same farm, in the Northern sky this time, I witnessed the same exact flash. Again I searched for something to explain the incident and again nothing but clear sky. It is very odd, because as close as the flashes appeared to be, if it had been a conventional aircraft, I would have seen it."],"Country":"United States","Source":"MUFON","Latitude":"37.970343","Sighting Duration":"Undisclosed","Date of the Event":"10/14/2006 12:00 UTC","Region":"Missouri","Object Features":"Undisclosed","Weather Factors":"Unknown"}