{"Source":"MUFON","Date of the Event":"10/03/2008 10:30 UTC","Tags":"City","Latitude":"42.09342","Case Number":"12982","Log Number":"US-10092008-0017","divs":["sighting detailsit was 10:30 am on 10\\3\\08. i was spproaching service drive going toward us 23 north off of carpenter rd in milan. i was headed toward ann arbor. while going around the loop, something made me look over my left shoulder in an upward direction. sky was clear blue with full sun shining reflecting off of the silver object hovering in the southwest. the entire object was silver. i was amazed in wonderment as to how beautiful it was. it was approx 100 ft above the ground in the plank rd area. it was rectangular in length- about as long as the goodyear blimp and had square segments similar to a plastic pill box. there was no traffic, and i kept driving off onto the shoulder because i kept looking back at it. this happened 2 times, and when i got back on the road, i looked back again and it was gone. the segment lines were clearly defined, and the silver object glistened in the sunshine. absolutely stunning. i have never seen anything like this. although i was moving, it appeared to be hovering. the outline of the object was clear against the blue sky. what was even more strange is that i immediately forgot the sighting until a friend of mine mentioned a ufo sighting up north. this was that evening. there was no \"missing time\". i went about my business the rest of the day. i drove the same route the next day and there was nothing in the sky. i was wondering if those segments would separate and take off!"],"Country":"United States","Object Flight Path":"Stationary","Longitude":"-83.678868","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=42.09342,+-83.678868(12982)&iwloc=A&hl=en\"> mufon case (12982) map </A>","Weather Factors":"None","City":"Milan","trends":["There have been 5 other sightings in Milan","There were no other sightings in Milan on or around October 3rd 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/12982.html.txt","/var/www/straped/mufon/more/12982_submitter_file1__sketchofobject.jpg","/var/www/straped/mufon/org/12982.html"],"Object Features":"Appendage(s)","Region":"Michigan","Date Submitted":"10/03/2008 10:30 UTC","Summary":"Object suspended in mid air, hovering","Viewing Distance":"101-500 Feet","Disposition":"Unknown"}