{"Object Shape":"Circle, Flash, Other, Unknown","Object Features":"Undisclosed","Case Number":"12990","Date Submitted":"10/09/2008 12:00 UTC","trends":["There have been no other sightings in BATSON","This sighting has never been favorited."],"Date of the Event":"10/09/2008 12:00 UTC","Log Number":"US-10092008-0025","Longitude":"-94.606944","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.249167,+-94.606944(12990)&iwloc=A&hl=en\"> mufon case (12990) map </A>","City":"BATSON","divs":["sighting detailsbefore daylight, about 5:00 am,in batson, texas, i was awakened by my grandmother to get my camera;she and my two cousins were up and noticed a flashing light in the distance that move dreally fast.their first assumption was that it was indeed a ufo. the lights flashed really fast, and the object seemed to bounce up and down and side to side.when i first saw it, i was a little skeptical,it looked like one of those stars you sometimes see that twinkle different colors.but as i watched for a while, i knew it couldn't be a star because it was moving too much.and it couldn't be an airplane because it was moving too little. we watched it for a couple hours and it stayed put in the same spot.as the sun came up and the sky turned brighter, we could no longer see it. the lights were mostly white, but occasionally turned green or red\\amber. i snapped some pictures and they looked nothing like your average plane \\star in the sky.it was too nfar away to get a clear video with my digital camera, but i got a little footage also."],"Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/12990.html.txt","/var/www/straped/mufon/more/12990_submitter_file1__UFO10-9-2008011.JPG","/var/www/straped/mufon/org/12990.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Disposition":"Unknown","Summary":"STAYED IN SAME SPOT BUT FLASHED AND BOUNCED AROUND REALLY FAST,MULTICOLORED","Latitude":"30.249167"}