{"Disposition":"Insufficient Data","Object Shape":"Circle, Fireball","divs":["Sighting DetailsWas night fishing with 4 other close friends @ our recreation club. There was no other people on the grounds last night. None. I say this because @ first I thought people were shooting fireworks in the sky above our heads. Not possible though. One of my good friends was sitting on the dock directly behind me aproximatly 5 feet away. He said hey look @ that. When he said that everyone who was with us looked striaght above our heads @ the same time which was really erie because its like we all knew what to look for and where to look. As soon as I lifted my chin to look up \"Bam\" a super super bright \"white\" ball of what looked like to be fire light up the dock the water it light everything up like daytime. I would say about a good 4-5 seconds passed of staring @ this thing which @ the time was staionary but seemed like as soon as we all locked onto it it began to move slowly northeast in the direction of chicago in the next 4 seconds we watched whatever that thing was fly horizontally without sound moving so fast it had to of covered miles before the light completly dissapeared. This thing was only between 1000-3000 ft above. No more than that because I just cant see anyting being that big in mass and farther away than that. It was absolutly mind boggeling as to what we seen. It was so disturbing that I had watery eyes and I dont know why? I want an answer because its just eating me up inside wondering what the hell we all seen. Everyone of us texted each other today to see If we were all thinking about it and Im guessing If it were you, you would do the same. Because we were all thinking about it. The whole thing lasted a miere 8-10 seconds but I will never forget that light. It was amazingly bright and pure but had a undefined edge to it making it appear as a huge white fireball simular to a flair or big big mortar that has a trailing effect. It was not any of these things though I can asure you this. Un-Explainable Feel free to contact me for more details or If you have any information, maybe someone else seen it as-well or there was a report of it in the area so I can asure me and my friends were didnt imagine it. Thanks Ryan"],"trends":["There have been 3 other sightings in Wilmington","There were no other sightings in Wilmington on or around October 9th 2008"],"Object Flight Path":"Stationary,Straight-line path","Country":"United States","Summary":"Absolutly astounding","map":"<A HREF = \"http://maps.google.com/maps?q=41.307809,+-88.146724(12995)&iwloc=A&hl=en\"> mufon case (12995) map </A>","City":"Wilmington","Tags":"City","Latitude":"41.307809","Case Number":"12995","Region":"Illinois","Log Number":"US-10102008-0004","files":["/var/www/straped/mufon/html2text/12995.html.txt","/var/www/straped/mufon/org/12995.html"],"Object Features":"Unknown","Longitude":"-88.146724","Date of the Event":"10/09/2008 09:20 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date Submitted":"10/09/2008 09:20 UTC","Weather Factors":"Unknown","Sighting Duration":"00:00:10"}