{"Region":"Texas","Latitude":"32.726409","Tags":"City","Disposition":"Unknown","Object Shape":"Sphere","Summary":"spherical point of light, shot outwards, disappeared into space","Date of the Event":"10/10/2008 08:00 UTC","Object Flight Path":"Path with directional change","Country":"United States","Longitude":"-97.31498","Viewing Distance":"Unknown","Object Features":"Unknown","Log Number":"US-10102008-0006","Case Number":"12997","files":["/var/www/straped/mufon/html2text/12997.html.txt","/var/www/straped/mufon/org/12997.html"],"City":"Fort Worth","Sighting Duration":"00:00:10","Source":"MUFON","Date Submitted":"10/10/2008 08:00 UTC","divs":["Sighting DetailsThis was my third sighting over several years in this same area. I live in SW Fort Worth, Texas, within about 5 miles of the Naval Air Station Base (formerly Carswell AFB and before that,the famous Fort Worth Air field to which the debris from the Roswell crash was flown to and the famous pics of Jesse Marcel and the \"weather balloon\" were foisted on the public). To that I have to add that i am also real close to highway 377 South which leads to first Granbury, then on to Stephenville. Living as close to the base as I have for a coupla decades, I am very familiar with the planes that are almost always in the sky around here. From my back yard at night there is hardly a moment when yoy cant see a plane in the sky. Wednesday night I was preparing the hot tub and fireplace for a little family R&R. Promptly at 8PM after getting all things in place I sat down in a handy lawn chair and put my feet up on the the brick ledge of the tub and leaned back to take in the sky a little. As soon as I looked up, a point of light emerged from behind the leaves of a large tree in our yard. It was very high in altitude much like a commercial jet at about 35,000 feet or so. It was bout 35 degrees from the horizon, and I was looking due East which would put it travelling Northward. But make no mistake about it, this was no jet. For one thing, even as far away as it was it was easy to see that the object was spherical in shape and very luminescent, as though lit internally rather than reflecting any available sunlight. It seemed to glow a rich golden color. There were no flashing or different color lights. It did not appear to be traveling on an arc similar to the earth as a plane would, but was doing the opposite......slowly arcing upwards and fading and growing smaller at an amazing rate. I knocked on my daughters window and told her to come out. By the time she got outside, the object had disappeared outward.....it just went into space. The entire sighting lasted about7 to 10 seconds. This is the third such object I have seen just like this in the last several years. the first time I saw one of these was on the 377 hiway heading into fort worth from granbury late at night. At first I saw strange red, blue, yellow and greenish lights illumintating the sides of the small rolling hills to one side of the hiway......very strange as they were moving all around very quickly......then as I passed the area where the lights were, I saw what I thought at first was a meteor that seemed to shoot high over my vehicle, travelling in the same direction as I was. As I said, at first I thought it was a meteor, but then I noticed it was too well defined for a meteor and besides that it suddenly slowed down somewhat, did an unbelievable perfect 90 turn to the east and again, shot upwards and off into space at an amazing rate. definitely not a meteor!"],"trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around October 10th 2008"],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.726409,+-97.31498(12997)&iwloc=A&hl=en\"> mufon case (12997) map </A>"}