{"Summary":"At night, while driving, I look up, see 3 lights. No blinking, No colors, white/warm. First appeared as 3, then, while moving quickly NW, the 3 turned into 4, creating a square pattern, moving in unison. Continued to go askew, meaning bottom structure.","Country":"United States","Date of the Event":"10/09/2008 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.955539,+-96.72615(13000)&iwloc=A&hl=en\"> mufon case (13000) map </A>","City":"Richardson","Sighting Duration":"Undisclosed","divs":["sighting detailsaround 9pm, or a little earlier, on 10\\9\\08, i was driving north on coit road, in richardson, texas. on my right hand side, i noticed three lights, out my front window, above the 2 story shopping center. i had just past beltline road, which runs perpendicular to coit road. thinking it might have been headlights, or a reflection of light on my front windshield glass, i looked away to watch the road, to deter any accidents. then, looking up again, i saw the 3 lights again, and noticed that they disappeared behind the 11, or so story compass bank building, thereby resulting in my deduction, that these were not a reflection in my window. i also heard no helicopter sounds, nor plane engines (propeller and jet). the lights were in a straight line, traveling in unison, equidistant apart. as coit road runs north, the 3 lights seemed to be moving north-west. the line they were in seemed to be a slight verticle angle, with the north end higher than the rear. the lights were not blinking. they did not vary in color, nor have any color, such as red, or blue, or green or yellow. i would describe their source as incandescent. not led, or white...but somewhat warm. they did not vary in size, but were consistent with each other. their size seemed to be that of what a plane would have. however, lacking the ability to determine the distance of the object due to no physical structure of the object, i can not give a size of the object themselves. as the lights traveled north-west, a forth light appeared, as if behind the middle light, resulting in a box formation, as if to suggest the lights were the underside of a plane or something. they continued to stay in formation, and moved in their direction, with the angle of the lights askewing more and more, once again reaffirming my observation of the lights were affixed to the bottom of the craft. i did not feel scared, nor did i notice any radio interference, or light interference. i felt a little excited, as any individual would when seeing something that they could not put the words 'airplane' or 'helicopter' to. i kept thinking to myself \"what the hell is that.\" i did not notice any other drivers trying to the observe the object, because i happened to be too busy watching it myself. as i kept driving, the object kept heading north-west, and out of view. coming home, i told my girlfriend of my observation, and saw nothing on the news, internet, or local newspapers. the day after, i continued to search, but found nothing to my avail."],"Log Number":"US-10102008-0009","trends":["There have been 10 other sightings in Richardson","There were no other sightings in Richardson on or around October 9th 2008"],"Region":"Texas","Latitude":"32.955539","Date Submitted":"10/09/2008 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Longitude":"-96.72615","Source":"MUFON","Case Number":"13000","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13000.html.txt","/var/www/straped/mufon/org/13000.html"]}