{"Disposition":"Unresolved","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around October 9th 2008"],"Date Submitted":"10/09/2008 09:10 UTC","Summary":"Multiple white spheres of light appearing and dissapearing over NORAD","map":"<A HREF = \"http://maps.google.com/maps?q=38.843822,+-104.817403(13002)&iwloc=A&hl=en\"> mufon case (13002) map </A>","files":["/var/www/straped/mufon/html2text/13002.html.txt","/var/www/straped/mufon/org/13002.html"],"Weather Factors":"None, Does Not Apply","Viewing Distance":"Over One Mile","Case Number":"13002","Sighting Duration":"00:05:00","Date of the Event":"10/09/2008 09:10 UTC","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","divs":["Sighting DetailsAn ex-girlfriend and I wanted to talk, so we drove to a part of Colorado Springs off Bijou where you have a clear view of Cheyenne Mountain and most of the city. We sat on the car hood and Cheyenne mountain was straight ahead. I saw them first, about 7 very bright glowing spheres of light would appear, swiftly move sideways for about 4 seconds, then they all disappeared one by one. She was on the phone at the time and didn't see it, when I told her she asked if I had been smoking crack. I told her to watch Cheyenne mountain, and sure enough, about 5 minutes later the lights showed up again, this time farther above NORAD. They would be \"on\" for a few seconds, then disappear. the only thing I could think of was that they were some kind of flare on parachutes, but because of their movement and behavior there's no way that's possible. I was in such awe while seeing the second ones, I completely spaced the idea of taking a picture of them. After all the second ones were gone i thought of it and got my camera phone ready, and we stayed there about an hour more, but didn't see anything else."],"Log Number":"US-10102008-0011","City":"Colorado Springs","Latitude":"38.843822","Country":"United States","Object Features":"Unknown","Object Shape":"Sphere, Star-like","Region":"Colorado","Longitude":"-104.817403"}