{"Sighting Duration":"00:10:00","trends":["There have been 33 other sightings in Hickory","There were no other sightings in Hickory on or around October 10th 2008"],"Latitude":"35.735188","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsAs I was driving on 321 S in North Carolina, a circular source of light to my right and close to the horizon caught my attention. At first, the object was still, yet it emitted a skinny ray of blue light. My first reaction was not to jump to conclusions, so I tried to locate the moon but had some difficulty since it was extremely cloudy. Although earlier in the night I had noticed the moon and knew it wasn't that close to the horizon. Luckily, the clouds became patchy and I was able to see that it was clearly NOT the moon. The object continued to move about, shining down this blue beam. When it was closer to the horizon, what I believe to be the craft was round and circular. After watching it for a couple of minutes it disappeared. Strange, I thought. Then I looked in my rear view mirror and it was behind me. Not directly overhead, but behind me a ways. At this point, the craft was more of an oval shape. It darted around in sweeping motions, always emitting the blue beam. It stayed behind me for a couple of minutes and then disappeared. At first I was astonished to have seen it, then as it changed direction and was overhead, my instinctual reaction was fear. I started shaking and my knees went weak, though I generally do not fear the possibility of extraterrestrial encounters. This was my third potential UFO encounter and it was by far the most astonishing. Also this could have possibly been in Lincoln county, I'm not sure because I didn't know my exact location."],"files":["/var/www/straped/mufon/html2text/13005.html.txt","/var/www/straped/mufon/org/13005.html"],"Log Number":"US-10112008-0003","City":"Hickory","Object Shape":"Circle, Disc, Oval, Sphere","Disposition":"IFO","Weather Factors":"None","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.735188,+-81.338697(13005)&iwloc=A&hl=en\"> mufon case (13005) map </A>","Source":"MUFON","Date Submitted":"10/10/2008 11:44 UTC","Case Number":"13005","Longitude":"-81.338697","Tags":"City","Date of the Event":"10/10/2008 11:44 UTC","Region":"North Carolina","Summary":"circular light hidden from plain site by clouds, emitted a blue beam of light constantly","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States"}