{"Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.111788,+-84.50802(13006)&iwloc=A&hl=en\"> mufon case (13006) map </A>","Source":"MUFON","Region":"Ohio","Date Submitted":"10/10/2008 09:30 UTC","Longitude":"-84.50802","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"10/10/2008 09:30 UTC","Object Shape":"Fireball, Sphere","Case Number":"13006","Summary":"It was a red to orange ball maybe 15 in all flying in sequence behind each other","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around October 10th 2008","This sighting has never been favorited.",""],"Latitude":"39.111788","divs":["Sighting DetailsI was driving my girlfriend back home as we saw a movie and had coffee at Starbucks. It was around 9:30 p.m. on Friday October 10th. I was on Hershel Avenue in Hyde Park when I looked ahead and noticed three orange and red balls of fire in the sky. Then I saw another one trailing the first three. I told my girlfriend what is that up in the sky? She said that is odd. The another one came over the car followed by another moving from the east to the west at a good clip and a say about 15 thousand feet in the sky. I stopped the car in the road as nobody was behind us. There were a few cars coming the other way but they just past on the other side of my car. We got out of the car and looked up and saw more of these balls of fire pass over my car. There was no noise so they couldn't be an airplane or a hilicopter. We got back into the car and drove to her apartment which is less than a mile from where we saw the lights. As we drove west we could still see the lights in the sky going due west but as we got to her apartment the light disapeared in sky or they were out of sight. The lights followed each other. There may have been a cluster of three or four but then there were several in session. They headed off to the west but then curved off to the north west before going out of sight. After getting back to her apartment I parked the car and we both go out of the car and went towards the street. I looked into the east sky and saw one more coming right at us. There look there is another one I said but not as bright in color. Sure enough it was the same thing we saw on Hershel Avenue. We both watched it but the red glow started to fade as it got closer to us. Almost right in front of us in the south east sky it disapeared from sight. Again there was no sound Two people were walking down the street and I asked them if they saw anything in the clear skys. They listen to our story but said they never seen anything but they would look in the sky on their way home. My girlfriend adn I went in her apartment and made some phone calls to local TV news stations but again nobody called anything of that nature into the stations. Then we called the local newspaper and no luck then we call Lunken Airport but we didn't call the tower just a local airline that said they hadn't had any reports of unusual sightings in the sky. Saturday October 11th I check the local news and newspapers and there was nothing about the sightings. Then I checked the internet and nothing. When I got home on Friday night I thought many it may have been a meteor or a comet burining off in the earths atmosphere. Not sure but you would think somebody would have saw something. When I got to work today one of my employees said they were driving home last night on I 71 going north when he saw the object I was talking about in my experience the night before. He said the object was red or orange looked like a ball in the sky and when straight down and disappeared. He had his son in the car and his son saw the same thing and was shocked. So it looks like one person saw whatever it was."],"Log Number":"US-10112008-0004","City":"Cincinnati","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13006.html.txt","/var/www/straped/mufon/more/13006_submitter_file1__LocationMapLesHemingway13006.jpg","/var/www/straped/mufon/more/13006_submitter_file2__LocationMapLHemingwayDanHoff.jpg","/var/www/straped/mufon/org/13006.html"],"Object Features":"None"}