{"Country":"United States","Sighting Duration":"Undisclosed","City":"Omaha","Tags":"City","Summary":"about 80 ft. M & M Shaped","Source":"MUFON","Date of the Event":"08/07/2008 08:00 UTC","divs":["Sighting DetailsI was ouat on our Deck that evening playing poker on my laptop. Our house, and deck face west by southwest. Omaha Nebraska faces West. I first noticed three lights as a sprial light of verying colors pointing down, and to both sides of something. I was dark, and i thought that it was a plane landing at Epply Air Feild. (This if a multiple sighting) However planes usually have there landing lights on, and this might well have been a plane. But i kept rubbing my eyes to distingush what this was, and could not get a clear distinction of it. I watched it for about 1 to 2 minutes. the light was coming in from the northwest by west area. then all of the sudden i saw this Globe, glowing pure white, as in a snow white light blub, coming in over my left shoulder, from the south at about i would say 2 to 3 thousand ft. it was not round like a moon, but m&m shaped. The configuration really got to me, as it travled quite fast. Maybee 500 miles per hr, or faster. It had no tail, no sound, and seemed to just cruse effertly from the south to the north. I watched it travle to the north, fully expecting it to crash in north Omaha, or somewhere north of that, when it seemed that everyting that i watching stoped for a milisecond, and it dissapeared, then everyting started up again. Where did it go, i do not know. Also, the three sprial light dissapered at the same time. i can believe that the 3 sprial lights could be an plane landing without its running lites on yet, but the other is very different. Now i keep running this over, and over in my mind, as the white color was so prue, that i can't seem to get it out of my mind. Also, i might add that this ran on a straight tajectry, and constantly seemed to be heading downward. It had no tail, or fire, or smoke of any kind. My feelings are, i don't know exactally, Never saw anything like this before. Breally butiful white lite to it though, and it seemed to move effertly, as thought no friction to it in the air."],"Region":"Iowa","Latitude":"41.254283","map":"<A HREF = \"http://maps.google.com/maps?q=41.254283,+-95.988568(13003)&iwloc=A&hl=en\"> mufon case (13003) map </A>","Object Flight Path":"Path with directional change","Object Features":"None","trends":["There have been 4 other sightings in Omaha","There were no other sightings in Omaha on or around August 7th 2008"],"Disposition":"Unknown","Object Shape":"Oval","Case Number":"13003","Date Submitted":"08/07/2008 08:00 UTC","Longitude":"-95.988568","files":["/var/www/straped/mufon/html2text/13003.html.txt","/var/www/straped/mufon/org/13003.html"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Log Number":"US-10112008-0001"}