{"Country":"United States","Summary":"I sighted a large disk-shaped UFO.","trends":["There have been 28 other sightings in Scranton","There were no other sightings in Scranton on or around September 25th 1970"],"Source":"MUFON","divs":["Sighting Details I was returning home from a local high school football game. I was 16 years old at the time. I left early, before the game was over. I walked from the football stadium, located in Peckville, Pennsylvania, to my home, in Jessup, Pennsylvania. Three blocks from my home, I sighted a huge, disk-shaped UFO. It was very large, glowing white, turret on top, with a row of rectangular windows. The bottom had three large, glowing spheres, with a central, flat disk. The object did not make any sound. Several friends of mine, that remained at the football game saw a glowing object, but their view was somewhat obscurred by the white lights at the stadium. I can't remember if it was a day alter, or several days, when a black limousine appeared at my home, with four black suited men inside, also wearing black hats. The limousine had no insignas or license number. I saw this because, although at night, there was a street lamp across the street. The men sat, motionless, staring straight ahead, in the vehicle. The vehicle returned for the next few evenings. I have had several other UFO sighting experiences. Two diamond-shaped UFO's in Peckville, Pennsylvania in 2002. A triangular UFO in Dunmore, Pennsylvania 2003, also sighted by my fiance. Several UFO's over a cemetary in Dunmore, Pennsylvania in 2005, photographed by UFO researcher, Mary Sutherland. My fiance and I sighted several strange lights in February, 2008, when we were living in Orlando, Florida. I have been searching for answers to these anomalous experiences. Please help me. Sincerely,[pid]"],"City":"Scranton","Viewing Distance":"101-500 Feet","Region":"Pennsylvania","Log Number":"US-10112008-0005","map":"<A HREF = \"http://maps.google.com/maps?q=41.413799,+-75.658012(13007)&iwloc=A&hl=en\"> mufon case (13007) map </A>","Longitude":"-75.658012","Object Features":"Dome, Window(s)","Disposition":"Hoax","Date Submitted":"09/25/1970 08:00 UTC","Date of the Event":"09/25/1970 08:00 UTC","Latitude":"41.413799","Tags":"City","Case Number":"13007","files":["/var/www/straped/mufon/html2text/13007.html.txt","/var/www/straped/mufon/org/13007.html"],"Sighting Duration":"00:03:00","Object Shape":"Disc","Weather Factors":"Unknown","Object Flight Path":"Straight-line path"}