{"City":"Freedom","Object Shape":"Sphere","Log Number":"US-10112008-0009","Source":"MUFON","Date Submitted":"10/08/2008 09:30 UTC","Sighting Duration":"Undisclosed","Region":"Oklahoma","Date of the Event":"10/08/2008 09:30 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/13011.html.txt","/var/www/straped/mufon/org/13011.html"],"Longitude":"-99.112879","Country":"United States","Viewing Distance":"Over One Mile","Object Features":"Other","Summary":"sphere shaped object traveling slowly from s.w. to n.e. moved like a baloon but didnt look like a baloon.","divs":["Sighting DetailsI and my best friends son were deer hunting on property we lease, located 5 miles north and 2 miles east of freedom oklahoma, locqted in woods county. we were sitting in his jeep with our binoculars both of which have image stabilization in them, so we were able to see this object very well. This object traveled like a baloon, in that it never changed direction or altitude or speed. Later that day i called my son who informed me that the news was talking about weather baloons that were being released and said they were kite like in shape with right angles and sharp points on the edge, more like a flying box kite. What we saw was a sphere in shape, it was white and the surface looked like the mateial of a movie screen, sorry, but that is the only way i kno to discribe it, but,,,,, it also had what looked like smaller semispheres that were atached to the surface that were moving in a counter clockwise direction or from my left to my right. at times, the top of this sphere would be a light blue, while the bottom would be a light brown, while leaving the center with the little circling spheres to remain white. we watched this thing for about 45 mins, in the back ground we had two drilling rigs to use for a reference to give us some idea of the distance, and we know for a fact they are 2 miles from our lacation and this object was about half again that far, and if that distance is correct then we estimate the object to be 40 -50 feet in dia. maybe more, cause we cant be for sure of the distance, but it was clearly visible to the naked eye, i was using 10x40 binocs and he my friends son was using 15x 50 binocs, made by cannon. i am not saying this thing was not a man made object, im just telling you what we have seen, and at the same time wondering if you may have some info as to what we actually saw? we do not have any pictures, we were actually hoping you might actually have some pics of something like i have discribed and maybe you could send them to me so i can see if any of them are what we saw, thank you for your time and please e-mail me and let me know what you think, thank you Dennis L Jackson."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.76892,+-99.112879(13011)&iwloc=A&hl=en\"> mufon case (13011) map </A>","trends":["There have been no other sightings in Freedom","This sighting has never been favorited."],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Case Number":"13011","Latitude":"36.76892"}