{"Weather Factors":"Unknown","City":"Anderson","Country":"United States","Latitude":"40.11137","Source":"MUFON","Longitude":"-85.670324","Summary":"Spotted An arrow-shaped blue light above the highway, crossed night sky in about two seconds, disappeared","Date of the Event":"10/10/2008 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.11137,+-85.670324(13010)&iwloc=A&hl=en\"> mufon case (13010) map </A>","Log Number":"US-10112008-0008","divs":["Sighting DetailsI was at a gathering of friends one night during one of my weekends back from Ball State University. I'm a computer science major, in the Armed Forces, and a pretty big skeptic on the field of UFO's. My friend Jack Lawson and I volunteered to run to Wal-mart to pick up a take-and-bake pizza. Coming down IND-109, I caught a glimmer in the upper portion of my windshield and glanced at it. What I saw was a garish blue light in the shape of something between an arrow, football, egg, and triangle. It had a medium-sized tail, and was about as low as a helicopter. I knew it wasn't a military aircraft (as I stated, I'm in the armed forces, and I KNOW what to look for in a plane or helo). This thing was moving pretty quickly. As I said in the brief, this thing transverses the ENTIRE sky in about two-to-five seconds and suddenly disappears into thin air. Jack immediately asked me \"Did you see that, Kyle?\", so I knew it wasn't just my eyes playing tricks on me. After I lost sight of it, I felt rather confused and tried to play it off as some strange ignition of gas or possibly borialis or shooting star or meteor, but it was just too low to the ground and swift moving. When we got to wal-mart, Jack went to the restroom (apparently this thing really did scare him to the point of near loss of bladder control) and he sat on the bench outside of the men's room with his head in his hands. He had seen it for a longer period of time than I had, since I was driving and had my eyes trained on the traffic in front of me."],"Region":"Indiana","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"10/10/2008 09:15 UTC","Tags":"City","trends":["There have been 12 other sightings in Anderson","There were no other sightings in Anderson on or around October 10th 2008"],"Object Shape":"Egg, Teardrop, Triangle, Other","files":["/var/www/straped/mufon/html2text/13010.html.txt","/var/www/straped/mufon/org/13010.html"],"Sighting Duration":"Undisclosed","Case Number":"13010","Disposition":"Insufficient Data","Object Features":"Undisclosed"}