{"map":"<A HREF = \"http://maps.google.com/maps?q=34.615984,+-112.314221(13021)&iwloc=A&hl=en\"> mufon case (13021) map </A>","Date of the Event":"10/08/2008 05:15 UTC","Object Shape":"Cylinder","Latitude":"34.615984","trends":["There have been 12 other sightings in Prescott Valley","There were no other sightings in Prescott Valley on or around October 8th 2008"],"Sighting Duration":"00:01:00","divs":["sighting detailswe were working outside when a helicopter passed by above our house making quite a bit of noise. it was coming from the north heading south. as a natural response, i looked up to observe what kind it was (medical\\military etc.). it did not seem military nor medical so i left it at that. as it was fading out of sight, i noticed a shiny cylindrical object heading the same direction and approximately at the same altitude. it made absolutely no noise that was audible to our ears. i started yelling to my uncle to see what i was looking at. we were both speechless. we watched it head south at steady pace for about another 15 seconds and then it just blinked out. it was gone. not by speeding up but rather just becoming invisible against the blue sky. then another helicopter came also from the north heading the same direction. it looked exactly the same as the first one, no visible id, no flashing lights. it also made quite a bit of noise. i kept gazing at the sky but did not see any other activity. this was the third time in my life i saw something weird in the sky. the object looked like a large shiny metal pipe. it had no visible appendages, wings, propulsion system and was completely silent."],"City":"Prescott Valley","Log Number":"US-10122008-0009","Object Flight Path":"Straight-line path","Tags":"City","Region":"Arizona","Longitude":"-112.314221","Source":"MUFON","Country":"United States","Summary":"Metalic silver cylinder shaped object - no wings - no sound","files":["/var/www/straped/mufon/html2text/13021.html.txt","/var/www/straped/mufon/org/13021.html"],"Case Number":"13021","Viewing Distance":"Unknown","Weather Factors":"None","Disposition":"Unknown","Object Features":"None","Date Submitted":"10/08/2008 05:15 UTC"}