{"Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=33.523211,+-86.79291(13028)&iwloc=A&hl=en\"> mufon case (13028) map </A>","Object Features":"Window(s)","Tags":"City","divs":["Sighting DetailsI was on vacation with my good buddy, Peter (aka Skinny Pete - you may have heard of him), when we saw an extremely bright, fast-moving object flew over the city of Birmingham, AL, for just over an hour. It appeared to 'inhale' clouds as it went, perhaps consuming them for future study. The brightness oscillated periodically, so much so that I thought I could make out windows now and again, with dark silhouettes behind them. One of the figures appeared to wave. My friend Peter was with me, and swore he could hear a high pitched frequency eminating from within, as though it were supersonic. At one point, his eyes rolled up into the back of his head and he passed out for almost a minute. His bowels cleared when this happened, and we had to take him to a public restroom. Unfortunately, the object disappeared after that. After waking up, Peter told us he heard someone speaking to him while he was unconscious, in a language he didn't understand, but he thought it was a sympathetic voice. All the while, he saw images of green pastures. (Peter is a farmer of sorts, so this made sense to us.) We took Peter to a walk-in clinic shortly thereafter because he felt so nauseated -- they told us there that he was severely dehydrated and even a little anemic. After receiving a couple liters of saline, Peter was doing much better, but none of us will soon forget this experience. Yours truly, Randy M. P.S. I've attached an interpretive drawing so you can visualize what I mean."],"Object Shape":"Circle, Oval","Summary":"Garish and Rapacious Oval Object Flying 200mph or more, eating clouds, Casues Dehydrationa nd Anemia","Weather Factors":"None","City":"Birmingham","Sighting Duration":"01:01:01","Object Flight Path":"Hovering then path","Case Number":"13028","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around October 12th 2008","This sighting has never been favorited.",""],"Longitude":"-86.79291","Country":"United States","Disposition":"Unknown","Latitude":"33.523211","Date Submitted":"10/12/2008 10:10 UTC","Source":"MUFON","Log Number":"US-10132008-0004","files":["/var/www/straped/mufon/html2text/13028.html.txt","/var/www/straped/mufon/more/13028_submitter_file1__BrightOval.jpg","/var/www/straped/mufon/org/13028.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/12/2008 10:10 UTC"}