{"City":"Springfield","Object Shape":"Circle, Disc","Object Features":"Dome","Log Number":"US-10122008-0010","Source":"MUFON","Date Submitted":"07/15/1963 12:00 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-123.020129","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.051786,+-123.020129(13022)&iwloc=A&hl=en\"> mufon case (13022) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary","Case Number":"13022","files":["/var/www/straped/mufon/html2text/13022.html.txt","/var/www/straped/mufon/org/13022.html"],"trends":["There have been 14 other sightings in Springfield","There were no other sightings in Springfield on or around July 15th 1963"],"Country":"United States","divs":["Sighting DetailsMe and my family was visiting with my grandparents in Springfield,Oregon. This was in the summer of 1963-66. It's been awhile. Anyway, my cousin Mike and me had walked to the indoor swimming pole to go swimming for awhile. We were supposed to be back home before it got dark but we stayed there longer than we should have. When we did decide to start for home, we took a shortcut through the school yards. It was already dark when we started for home. We were on a path that ran beside the baseball field when we both noticed a strange feeling and the fact that it seemed way to quiet. Don't know why, but we both looked up at the same time and totally freaked out(that's an old term for being really scarred). All we could see was this VERY big round shaped thing with different colored lights all around it. It was not making any noise and it seemed like it was almost close enough to touch. It was so big that we couldn't even see the sky, only this thing! It was just floating directly above us. We were crying and screaming and running as fast as we could, neither of us looked up again. We don't know how far we ran, although it seemed like not very far, when we ran into my older brother and my older cousin. They had been sent to find us and bring us home. We were in big trouble. They wanted to know why we were crying and screaming, so we told them. My brother did not beleve us but my older cousin David did. At least he said that it could be true. We couldn't even remember going swimming or anything that night except what i just told you about. All i remember prior to that is that i know that we were there to go swimming, and i assume that we did. Many years later, i was not certain if this had really happened, or if it was all just a dream. As a young adult, i asked my cousin Mike if he remembered anything weird that had happened to us when we were kids. That's all that i said. His reply was\"You mean that night that we went swimming and saw that thing above us?\" That confirmed that it was real and that it was not a dream. All of my life since that night i have had something like a dream but not a dream. It's alway's the same and it's about many ufo's coming to this planet. Pretty weird huh? Why didn't i report this along time ago? Too who?"],"Latitude":"44.051786","Region":"Oregon","Summary":"It was very big, round, quiet, with many lights","Date of the Event":"07/15/1963 12:00 UTC","Viewing Distance":"21-100 Feet"}