{"Case Number":"13037","trends":[],"Viewing Distance":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"None","Longitude":"-86.572307","Country":"United States","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/13037.html.txt","/var/www/straped/mufon/org/13037.html"],"Sighting Duration":"Undisclosed","Latitude":"35.523621","Date Submitted":"09/30/2008 04:20 UTC","Log Number":"US-10142008-0003","Disposition":"Unknown","divs":["Sighting DetailsMy wife awoke early that morning around 4:15 A.M. and let our dog out. Standing at the back door, facing due south, she saw a very unuseual set of lights approaching from the southwest and traveling toward the northeast. She described two large white lights, with a somewhat smaller red light in the middle; none of which was flashing. Since it was a dark night , with no moon, but clear, she was unable to distinguish any definitive shape of the craft. The object was traveling at a fairly high rate of speed and tracked over our house but made no sound. She described the white lights as appearing to be maybe 3 ft. in diameter, with the red light in the middle at maybe 1.5 ft. in diameter. From her description, and being a former pilot, I would estimate it,s altitude at about 1,000 to 1,500 ft. The lights were visible from the approach thur the departure, until it went out of sight behind the hills to the northeast,as if they were on the bottom of the craft. We have a ridge of hills on both the east and west side of our house so she had only about a 110 degree field of visibility from horizon to horizon. Total viewing time approximately 20-25 seconds. She immediately came back and reported to me that she had just seen a UFO. Our exact location is N35.42697-W86.87725. I also witnessed a very large craft up close and personal in the late 7o's if you are interested in reports that far back. Let me know. Thanks Don Odum"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.523621,+-86.572307(13037)&iwloc=A&hl=en\"> mufon case (13037) map </A>","Summary":"Wife observed lights in sky.","City":"Undisclosed","Date of the Event":"09/30/2008 04:20 UTC","Object Features":"Unknown","Source":"MUFON","Region":"Tennessee"}