{"Source":"MUFON","Longitude":"-83.739588","Region":"Michigan","Object Shape":"Triangle, Other","divs":["sighting details my good friend and i, both students at the university of michigan, were sitting on a lawn on campus. my friend was laying down, looking at the sky, when all of the sudden (at 10:58 p.m., est), he said, \"jake, shooting star!\" at which point, i looked up and saw, directly above us (and no discernible distance away), three collinear lights. these lights were about the same size and shape as the stars around them, but were quite a bit brighter, and a light yellowish-orange color. i realized immediately (i've seen my fair share of shootings stars and the like) that this was unlike anything i have ever seen, and became very excited. i jumped up and watched closely. the three lights, all aligned with each other, appeared (according to my friend; i did not witness them appearing, having been alerted to their presence about a half-second after he first saw them) all at once, instantaneously, superimposed on the constellation cassiopeia. right away, they began moving directly west from us, very quickly. they covered about a quarter of the sky in about three seconds. they were only visible to us for this time, three seconds, until they disappeared from view, either behind trees or out of the sky (i cannot recall entirely). there was only one motion, east to west. the three lights all moved with each other, but as they went further away, they appeared to get closer to each other--though this could be due to our perspective. no sound was observed, nor was there any other observed structure associated with the lights. again, we witnessed this on the night of october 11th 2008, within a minute of 10:58 p.m. the lights were certainly not a plane--moving too quickly and with no noise; nor could they have been a bird, satellite, or other astrological \\ meteorological event. jake"],"Viewing Distance":"Unknown","Summary":"Sudden appearance of a line of three yellowish-white lights that proceeded to fly away very fast.","City":"Ann Arbor","Date of the Event":"10/11/2008 10:58 UTC","Object Features":"None, Unknown","Disposition":"Unknown","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around October 11th 2008","This sighting has never been favorited.",""],"Case Number":"13034","files":["/var/www/straped/mufon/html2text/13034.html.txt","/var/www/straped/mufon/org/13034.html"],"Tags":"City","Date Submitted":"10/11/2008 10:58 UTC","Object Flight Path":"Straight-line path","Country":"United States","Latitude":"42.285666","map":"<A HREF = \"http://maps.google.com/maps?q=42.285666,+-83.739588(13034)&iwloc=A&hl=en\"> mufon case (13034) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-10132008-0010"}