{"Object Shape":"Disc, Sphere, Teardrop","Weather Factors":"None","Region":"Pennsylvania","Date of the Event":"10/11/2008 01:00 UTC","Log Number":"US-10142008-0008","Date Submitted":"10/11/2008 01:00 UTC","Summary":"Strange Cloud Vortex and Disc-shaped Objects over Grampian, PA","Case Number":"13042","Object Features":"Dome","Tags":"City","Sighting Duration":"00:05:00","City":"Grampian","Viewing Distance":"Unknown","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/13042.html.txt","/var/www/straped/mufon/more/13042_submitter_file1__IMG_0071.JPG","/var/www/straped/mufon/more/13042_submitter_file2__IMG_0073.JPG","/var/www/straped/mufon/more/13042_submitter_file3__IMG_0074.JPG","/var/www/straped/mufon/org/13042.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.965893,+-78.613082(13042)&iwloc=A&hl=en\"> mufon case (13042) map </A>","Disposition":"Unknown","Longitude":"-78.613082","trends":["There have been no other sightings in Grampian","This sighting has never been favorited."],"Country":"United States","divs":["Sighting Details I saw this peculiar cloud formation on October 11, 2008 in the early afternoon. The strange part was that it had what looked like a spinning current erupting from its center. I did not notice any active rotation at the time, but it has a definite spiral appearance to it. The formation dissipated a few moments after I took these shots, but it filled the sky at the time. I've never seen a cloud with this pattern or movement. Upon closer examination and magnification of the three photos, I noticed that there were strange objects in and around the clouds. They were not visible to the eye, but they appeared on these pictures. These objects were completely silent, and I could not hear anything in the skies. The object in img0071 is hard to see. It is in the top right quarter of the image, pretty much in the middle of that quarter. This object looks like a disc, but it is so small that its hard to tell. I can send a highlighted version of this picture to show you if necessary, but there were only three slots available and I wanted to post the pictures I had. In img0072, the object appears to be at the top of the cloud vortex or pillar, and looks teardrop in appearance. One side of the object appears metallic, while the other side was very dark and slightly purple. Finally, in img0073, There are now two objects in the top right quarter of the picture, each disc or spherical shaped and dark. All of these shots are taken on a canon digital rebel xt camera with an efs18-55mm lens. Like I said previously, I wanted to take pictures of this weird cloud and did not even see the objects at the time. Had I known that there were objects there I would have put my telescopic lens on. Seeing these objects and this peculiar cloud funnel has definitely made me believe that something is going on that we are not aware of."],"Latitude":"40.965893","Source":"MUFON"}