{"Date of the Event":"10/14/2008 06:00 UTC","Country":"United States","Summary":"3 Orange Hazy Lights in a Triangular Slow-Moving Triangular Pattern","Disposition":"Unknown","City":"Warren","Date Submitted":"10/14/2008 06:00 UTC","Viewing Distance":"Over One Mile","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13046.html.txt","/var/www/straped/mufon/org/13046.html"],"Region":"Michigan","Longitude":"-83.025097","Case Number":"13046","divs":["sighting detailsi am an avid reader of books on the subjects of ufo's and ancient civilizations. and as much as i believe nothing could prepare me for this encounter at 7 a.m. 10-14-08. i was startled when my mother suddenly woke me from my sleep telling me very nervously to come outside. i did. she pointed to the dark sky in a southeasternly direction. at first, my sleep still fresh in my eyes, i noticed nothing unusual. but as my eyes came into focus i saw what she had pointed out. what looked to be bright stars suddenly were recognized as orange and had a distinct hazy radiance about them. could just be stars i told myself. and that could have easily been left at that. but as i noticed there where 3 of them i looked from one to the next and noticed they where moving very slowly- but yes! they were moving. and not only moving but were holding a distinct triangular\\boomerang pattern! i was excited yet baffled. in all the years i have studied the clues left in the history of earth's civilisation's encounters and books i have read- i had never seen any! as i watched they slowly faded from view. the sky still black at this point! also i looked up reports for the area and found several simialar sightings describing the same recently. what is this phenomenom? sincerely, brandon"],"Latitude":"42.50023","Object Features":"Unknown","trends":["There have been 14 other sightings in Warren","There were no other sightings in Warren on or around October 14th 2008"],"Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.50023,+-83.025097(13046)&iwloc=A&hl=en\"> mufon case (13046) map </A>","Weather Factors":"None","Object Shape":"Sphere, Star-like, Triangle","Log Number":"US-10142008-0012"}