{"City":"Magnolia","Date Submitted":"10/13/2008 10:36 UTC","Date of the Event":"10/13/2008 10:36 UTC","Latitude":"30.209379","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.209379,+-95.750782(13049)&iwloc=A&hl=en\"> mufon case (13049) map </A>","Log Number":"US-10142008-0015","Longitude":"-95.750782","divs":["Sighting DetailsAt 10:36 pm, after my son and i watched a movie, I let my dogs out in the backyard. It is very dard and no lights behind my house, so the vieww of the stars is great. I looked up and to the NNE and noticed what looked like a star initially bouncing around. I looked at other stars to see if my eyes were playing tricks on me and looked back at the object. I then yelled for my son to come down and look to see if he was seeing the same thing. He was. We got a digital camera and tried to take pictures of the pbject and the camera would not pick it up. We then got out the telescope ( a large one) and lined it up as best as we could and when viewing through the main eye of the telescope could only see it for a few seconds and it would move drastially. We would then realign the telescope and try again and got the same results. Very interested if anyone else saw the same thing. Hve not done this before and definately believe that what we saw was not man-made. *objects actions and motions: object would move from left to right extremely fast, loops and hover. This would be repeated over and over again and not the same way. My son and I watched this object for over thirty minutes! I don't get it. Help me out here please. I have always been a believer, but never seen anything. I am a defiante believer now."],"Tags":"City","Viewing Distance":"Unknown","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/13049.html.txt","/var/www/straped/mufon/org/13049.html"],"Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Elongated object, thought to be a star initially","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Magnolia","There were no other sightings in Magnolia on or around October 13th 2008"],"Case Number":"13049","Region":"Texas"}