{"Latitude":"41.611629","City":"Pine Bush","trends":["There have been 5 other sightings in Pine Bush","There were no other sightings in Pine Bush on or around May 16th 2008"],"Longitude":"-74.29093","Region":"New York","Date of the Event":"05/16/2008 10:15 UTC","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsMy father was picking me and my brothers up from my mother's house, I had just gotten back from college. We were driving along Route 52 in Pine Bush when I spotted an Orange Orb Just floating outside the Drivers Side Window of the Car. My dad is deaf so I was signing to him when I saw the orb. I then pointed it out to him, at first my father said it was an airplane, but then I said look again, and he said it definately was not an airplane. It was just following us for about 5 minutes and then it disappeared as soon as we looked away from it. We turned left down a side road, and then it reappeared on my side of the car. It was about 300 feet in the air and about 100-150 feet away from the car at all times. It followed us some more and then disappeared again about 7-8 minutes after it appeared on my side of the car. It followed us into the Town of Wallkill and disappeared when it was over a river and we were on a bridge. My brothers passed it off as an airplane, but my dad and I know it wasn't. It was a soft glowing orange orb, and it didn't hurt to look at it, so it wasn't very bright, but at the same time to us it was. What made me report this was the PA Case number 13043, which happened within 200 miles of each other 2 days apart. I KNOW WHAT I SAW"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Fireball, Oval, Sphere","Disposition":"Insufficient Data","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.611629,+-74.29093(13047)&iwloc=A&hl=en\"> mufon case (13047) map </A>","Case Number":"13047","Viewing Distance":"101-500 Feet","Source":"MUFON","Summary":"This sounds Exactly like case number 13043, the Grove Case in PA.","Object Flight Path":"Straight-line path","Log Number":"US-10142008-0013","files":["/var/www/straped/mufon/html2text/13047.html.txt","/var/www/straped/mufon/org/13047.html"],"Date Submitted":"05/16/2008 10:15 UTC","Weather Factors":"Unknown"}