{"Summary":"incredibly fast short orange streaks going in different directions","Viewing Distance":"Unknown","Longitude":"-81.397691","City":"Kissimmee","Date of the Event":"10/11/2008 12:00 UTC","Latitude":"28.296066","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsI was working at the Kissimmee airport with my company at the Festivals of Speed. It was a partly cloudy evening but clear directly overhead when I began seeing the anomalies. I thought the first one was just my imagination as I only caught a glimpse of it in my peripheral vision. When I caught sight of the second one, I realized it really was happening. After seeing a third as clearly as could be seen, I told my wife and she went aside and began looking overhead and ended up seeing one as well. We didn't see any more after that as we were working and couldn't just stand around looking at the sky. We knew there was no way to catch a photo without setting up a camera with the iris open. The best way I can describe what we saw is as follows: It looked very similar to a meteor streak except there was no \"head\" to it. In other words, it was tapered at the beginning and the end. It was an orange-redddish color and a bit thicker than the average meteor trail. The length of the streak was roughly the distance between the tip of my thumb and the tip of my pinkie if I were to extend my arm fully and then with my hand at a 90 degree angle from my arm, spread my fingers and thumb fully. The strangest thing to me was how fast they happened. The speed had to be incredible as they came and went literally just about as fast as a flashbulb going off. All I could think of was the lights that the European's are associating with the Hadron Collider. But I wasn't sure because I don't know if what they were seeing comes and goes as fast as what we saw. One additional note: they were maybe 5-10 degrees off the 90 degree straight up axis line and they all traveled in different directions."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.296066,+-81.397691(13056)&iwloc=A&hl=en\"> mufon case (13056) map </A>","Source":"MUFON","Country":"United States","Log Number":"US-10142008-0021","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around October 11th 2008"],"Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13056.html.txt","/var/www/straped/mufon/org/13056.html"],"Region":"Florida","Case Number":"13056","Object Features":"None","Object Shape":"Bullet, Missile, Flash","Date Submitted":"10/11/2008 12:00 UTC"}