{"Region":"South Carolina","Weather Factors":"Unknown","Latitude":"32.780066","Disposition":"Hoax","Source":"MUFON","City":"Charleston","Object Flight Path":"Undisclosed","Object Shape":"Cone, Circle, Triangle, Other","Object Features":"Undisclosed","divs":["Sighting DetailsOn Thursday December 15, 2005 at 8.35 P.M. at night I was at a nearby neighbors house with some friends. We were out in the backyard we were grilling italian sausage on the outdoor grills out in the backyard. We looked up and saw 3 circle UFOS. They had on the inside of the bottom red, yellow, and green lights then red, yellow, and purple lights then they were a roquefort blue (what I mean by a roquefort blue the lights on the inside of the bottom looked like roquefort and blue cheese salad dressing they were roquefort blue) they were still roquefort blue then on the inside of the bottom they had red and orange lights mainly red lights then again red, yellow, and green lights and emitted orange beams. Then 3 triangler UFOS showed up they were purple lighted with red dots on the corners then yellow lighted with red dots on the corners and emitted blue and green beams. They hovered over the treetops out in the backyard as we were grilling itailian sausage on the outdoor grills out in the backyard. Then all 3 circle UFOS and the 3 triangler UFOS were all white lighted. The 3 circle UFOS on the inside of the bottom had all white lights the 3 triangler UFOS were all white lighted with no dots on the corners and they all disappeard they were going towards the ocean to folley beach I guess they crashed out in the ocean. Then 2 huge cone UFOS showed up they had red on the top and yellow on the bottom then red on top and purple on the bottom then they disappeared as fast as came. They were going towards the ocean to folley beach I beilive they crashed out in the ocean. We saw all of this as we were out in the backyard grilling itailian sausage on the outdoor grills out in the backyard. Then we saw no more UFOS. It was a very clear night outside and it was really an exciting experience for me and my neighbor friends to see the UFOS we saw while grilling in the backyard. We just couldn't beileve the UFOS we saw when we were all together."],"Sighting Duration":"00:45:00","Case Number":"13054","Country":"United States","Date Submitted":"12/15/2005 08:35 UTC","Log Number":"US-10142008-0020","Tags":"City","Viewing Distance":"Unknown","Longitude":"-79.929362","Summary":"WHILE ME AND MY NEIGHBORS WERE TOGETHER WE SAW SOME EXCITING UFO ALL OF US.","map":"<A HREF = \"http://maps.google.com/maps?q=32.780066,+-79.929362(13054)&iwloc=A&hl=en\"> mufon case (13054) map </A>","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around December 15th 2005"],"files":["/var/www/straped/mufon/html2text/13054.html.txt","/var/www/straped/mufon/org/13054.html"],"Date of the Event":"12/15/2005 08:35 UTC"}