{"map":"<A HREF = \"http://maps.google.com/maps?q=33.37032,+-112.583777(13051)&iwloc=A&hl=en\"> mufon case (13051) map </A>","Disposition":"Unknown","Weather Factors":"None","Summary":"Four Redish-Orange orbs appeared one at a time in a arc formation, then dissapeared.","City":"Buckeye","Case Number":"13051","trends":["There have been 13 other sightings in Buckeye","There were no other sightings in Buckeye on or around October 9th 2008","This sighting has never been favorited.",""],"Latitude":"33.37032","Log Number":"US-10142008-0017","files":["/var/www/straped/mufon/html2text/13051.html.txt","/var/www/straped/mufon/more/13051_submitter_file1__Sighting.JPG","/var/www/straped/mufon/org/13051.html"],"Sighting Duration":"00:00:30","Date of the Event":"10/09/2008 07:49 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Arizona","Object Features":"Unknown","Object Flight Path":"Stationary","divs":["Sighting DetailsI started to have an urge to go to this area northwest of the White Tank Mountains in Buckeye Arizona, off on a dirt road in the middle of no where, for about the last month. I have to take the dirt road slow and careful because my BMW has a very low clearance. It's not easy to get there in my vehicle so I have to be very determined to do so. I have always been a sky watcher, and up until this sighting, all other sightings could have been possibly explained away as stars, planes, etc, but not this one. I have never reported the other sightings to MUFON neither. However, this sighting was undeniably something else. After taking my recyclables to the recyclable bin at apx 7:30 pm on October 9th 2008, I felt the need or a precognition to drive to this spot. I live about 20 mins from this spot in a small Dell Webb Community, which is about 30 mins west of the valley of Phoenix or what we like to refer as \"civilization\", there is nothing in between. This spot is even further west from the valley, nestled behind some huge mountains, the White Tank Mountains. I did notice on my way there, the hairs on the back of my neck stood up and a got a strange feeling, I brushed it off as a draft of cool air. Night time was upon us and the back ground sky was pitch black. While driving there, I actually missed the dirt road turn off, so I turned around and started driving back to the road. That's when I seen the first reddish-orange \"orb\" appear, just like the ones I have been seeing over the last month. But then to my amazement, a second one appeared, then a third, then a fourth. The \"orbs\" were equally separated & distanced apart in an arc formation. I knew then it was something that could not be explained away, it was definitely something else. After all four came into view they materialized or vanished. The lights were apx. 1000-2000 ft away in the the northwest sky, noting, I am not too good at judging distances. The \"orbs\" appeared probably a second or two after each other in this arc formation. After realizing what I was seeing I was in awe, slightly shocked and due to my human nature, somewhat frighted, so I kept driving all the way back home. I noted the time was 7:49 pm and immediately called my one friend via cell phone to explain what I just witnessed. \"Baby Steps\" is the feeling or impression I got from this experience. Just to back my credibility, I am highly educated with a BA in Business, Economics & Environmental Science, along with an Executive MBA. I have owned a web development & marketing firm, a publishing company, and now, part owners in a pre-paid gift card company, Cardvark, Inc. www.cardvarkgiftcards.com I hope my story enlightens and intrigues you. I am attaching a photoshop rendering I what I seen, all I had with me was my iPhone, which does not take good night-time photos. Thad J."],"Object Shape":"Fireball, Sphere, Other","Longitude":"-112.583777","Date Submitted":"10/09/2008 07:49 UTC","Country":"United States"}