{"Longitude":"-75.688293","Region":"Ontario","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around October 14th 2008"],"Summary":"wandering rainbow star, very bright and flashing many colours, fades away then reappears","Weather Factors":"Unknown","Case Number":"13066","Latitude":"45.42523","Date Submitted":"10/14/2008 12:00 UTC","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.42523,+-75.688293(13066)&iwloc=A&hl=en\"> mufon case (13066) map </A>","Date of the Event":"10/14/2008 12:00 UTC","divs":["Sighting Detailsstargazing last night, i noticed what was surely the prettiest star. it twinkled a rainbow of hues very brightly. it was not the first time i have observed it in pretty much the same position, which was about forty degrees elevation, to the east south east, just above the neighbourhood treeline. last night though, through both binoculars and naked eye, the star was especially transfixing. i felt an enthrallment and felt unwilling to remove my gaze for several minutes. really a very soothing feeling, almost hypnotic, obviously very hard to describe; i was feeling quite a connection to this star! in my marvel i thought i saw the star wander to and fro, and even change altitude, but i couldnt be sure because these movements were slow, and i have no tripod setup of any sort. so still 'connected', i 'asked' for slightly more conclusive behaviour; i dont know what i was expecting, maybe a figure eight! there was no variation in activity for half a minute or so, but then the star brightened slightly before fading out to black over three seconds. i stayed out only for another five minutes or so, but i came out again about a half hour later to find the same light had returned, and now it was definitely wandering, with noticeable displacement. observed it off and on until about four am, when the the clouds rolled in. i am quite impressed, since until last night i had only suspected this object to be.. unidentifiably compelling. im certain i will see it again. mufon, ill let you know how my date goes tonight but i hope it wont be awkward if i bring my girlfriend :)"],"Disposition":"Unresolved","Object Shape":"Star-like","Object Features":"Unknown","Object Flight Path":"Stationary,Other","Log Number":"CA-10152008-0008","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13066.html.txt","/var/www/straped/mufon/org/13066.html"],"Country":"Canada","City":"Ottawa","Sighting Duration":"Undisclosed"}