{"Tags":"City","Object Shape":"Star-like","Region":"New York","Sighting Duration":"00:10:00","Log Number":"US-10152008-0007","Latitude":"42.223685","map":"<A HREF = \"http://maps.google.com/maps?q=42.223685,+-76.183263(13065)&iwloc=A&hl=en\"> mufon case (13065) map </A>","Longitude":"-76.183263","City":"Newark Valley","Disposition":"Insufficient Data","Case Number":"13065","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/13065.html.txt","/var/www/straped/mufon/org/13065.html"],"Date Submitted":"08/16/2008 12:00 UTC","divs":["Sighting DetailsI was driving home from work in a Westerly direction when I noticed a mysterious bright light in the morning sky that is not normally there when I drive home. I looked up and noticed the object was hovering back and forth across the road ahead of me. It seemed to go from the left to the right and then back to the left again. I continued to drive home and kept a close eye on the object. I started up the last hill on my way into the town I live and realized that the object was above this hill. I couldn't make out any detail except that it was a bright light, very much like a star. But the sun was out and no other objects where in the sky like that. As I was about to crest the hill and go almost directly under the object the light just disappeared and I could not find it again. I have no idea what the light was, if it was a planet, star, or ufo. It's just something that I cannot explain. I felt very paranoid after I lost sight of the object while I was descending the hill into the valley below. It was extremely foggy down in the valley which amplified my paranoid creepy feeling I had. My father has also seen objects(lights) that he can't explain in the sky and he has lived in this town his whole life. On a side note, I noticed a very similar light a few months before but over a different hill and from a much farther distance."],"Country":"United States","Object Features":"Unknown","Summary":"Mysterious Moving Light in Early Morning Sky","Source":"MUFON","trends":["There have been no other sightings in Newark Valley","This sighting has never been favorited."],"Weather Factors":"Unknown","Date of the Event":"08/16/2008 12:00 UTC","Viewing Distance":"Unknown"}