{"Object Shape":"Circle","Weather Factors":"Rain","Object Flight Path":"Stationary","Tags":"City","Object Features":"None","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"39.742444","City":"Denver","files":["/var/www/straped/mufon/html2text/13060.html.txt","/var/www/straped/mufon/org/13060.html"],"Date Submitted":"10/12/2008 10:05 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.742444,+-104.975893(13060)&iwloc=A&hl=en\"> mufon case (13060) map </A>","Longitude":"-104.975893","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around October 12th 2008"],"Case Number":"13060","Summary":"Three, stop light bright yellow lights in a row","Log Number":"US-10152008-0002","Date of the Event":"10/12/2008 10:05 UTC","Region":"Colorado","Source":"MUFON","divs":["Sighting DetailsMy name is Sandy Nichols. My wife Sherrie asked me to write up this report. I am writing up the report as if she was writing it. She also asked me to include my phone contact information. My name is Sherrie Nichols. I am a registered nurse of over 35 years, and a former Captain and flight nurse in the United States Air Force. I own my own business, SRN INC., where I investigate medical fraud. It is imperative in my profession to have keen insight for even the smallest of details. Whenever I experience something strange, I always inform my husband who conducts paranormal research, and we explore and discuss all of the details together. It was Sunday night, 10-12-08, the last night of a family vacation to Denver, CO. The time was 10:05 and my husband and I were smoking a cigarette outside the front entrance of the hotel where we were staying on the west side of Denver. The air temp. was rather cold with a thick overcast. I was looking northwest at the overcast when three, stop light bright yellow and round lights suddenly appeared. The lights were in a straight line spaced about 1 degree and evenly apart from each other. About 2 seconds later all three lights suddenly disappeared as suddenly as they had appeared. My husband in the past has shown me how to make a good determination of the size of an object from a relative postion. Each light was about the size of an American quarter at arms length. I immediately informed my husband of what I had seen, and showed him in relationship to where we were standing where I had seen the lights. My husband informed me that there was hill in the direction of the lights with a long, flat plateau on the top with communication towers located on the hill and wonder if that was what I had seen through the overcast. He said that we would look into this the next morning when the sky and the visibility was supposed to be better. The next morning after breakfast I joined my husband outside of the hotel's front entrance. The morning was gorgeous which allowed us to investigate my sighting further. There were communication towers on top of the plateau, but they were at least 7 to 8 degrees to the northeast of where I had seen the lights and at the end of a sharp decline of the hill into a valley. The top of the tallest tower from where I was standing was about 2 degrees above the plateau floor, whereas the lights were about 15 degrees above the plateau floor. This calculation is based on forming a fist with ones hand, turning the hand on its end with fingers facing left, then holding ones arm at arms length on a level plain with ones eye, while placing the bottom part of the hand on the horizon of the plateau to estimate the elevation......and then to calculate distance left to right, turn ones hand fingers down and measured from the first yellow light right to the first and tallest tower that was to the right. Report submitted and written for Sherrie Nichols by Sandy Nichols"]}