{"City":"Undisclosed","Country":"United States","Date Submitted":"10/14/2008 11:30 UTC","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-81.507304","Weather Factors":"Unknown","Tags":"City","Object Shape":"Star-like","Log Number":"US-10152008-0004","Source":"MUFON","Case Number":"13062","Viewing Distance":"Unknown","Object Features":"Unknown","Disposition":"Insufficient Data","divs":["Sighting DetailsI was in my back yard watching the beautiful night sky lit by a full moon while laying on my back in a chair. A bank of fluffy scattered clouds began moving across the sky comming from the east and moving at a fairly good pace. I wathed them directly overhead and then noticed what I thought was an optical illusion. It seemed the stars that were visible in the breaks between the clouds were moving in the opposite direction of the cloud movement. I thought \"what a cool illusion\" but then I realized that the \"stars\" WERE moving and in utter disbelief I checked this over and over again using fixed point references to my line of sight. I watched them pass the edge of the chair's headrest, pass the gutter edge of the roof. When I realized what I was seeing I jumped up from my chair and really wasn't sure what to do. I thought of waking my mother to witness this but decided to grab my video camera. I did try to tape some but it didn't look to me in the viewfinder that I was really getting anything too clear. Finally I just pointed the thing towards the sky while keeping it steadied against the back of the chair and hoped for the best. There were dozens of them as far as I could tell, not blinking, not changing color, just looking very much like stars moving at a slow to moderate pace towards the east. I did observe one veer slightly more to the north at one point and this convinced me even further that it was not a trick of the eye. After about 8 to 10 minutes of this ( I must guess because I was feeling a bit freaked out and it's hard to judge time exactly) they dwindled out and stopped comming. I've been trying to convince myself for hours now that I didn't really see what I thought I saw, but it's not working. There was definately dozens of white objects on the move high in the sky. I hope I can find something on that tape."],"Region":"Florida","trends":[],"Sighting Duration":"Undisclosed","Summary":"fleet of dozens moving west to east","map":"<A HREF = \"http://maps.google.com/maps?q=27.672507,+-81.507304(13062)&iwloc=A&hl=en\"> mufon case (13062) map </A>","files":["/var/www/straped/mufon/html2text/13062.html.txt","/var/www/straped/mufon/org/13062.html"],"Date of the Event":"10/14/2008 11:30 UTC","Latitude":"27.672507"}