{"Date of the Event":"07/31/2007 12:00 UTC","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.577328,+-96.178311(13079)&iwloc=A&hl=en\"> mufon case (13079) map </A>","Country":"United States","Latitude":"33.577328","Viewing Distance":"101-500 Feet","trends":["There has been one other sighting in Bonham","There were no other sightings in Bonham on or around July 31st 2007"],"Object Shape":"Triangle","Source":"MUFON","Region":"Texas","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy daughter and her friend were on their way to town to get a coke. About 3 miles down the road they spotted this object flying fairly low in the sky. There were some low clouds and the sky was beginning to take on that dusky appearance that makes it hard to see like just before you need headlights on your car.When it got closer they pulled over on the side of the road towatch it go by and called me on the cell phone. They were so excited because I watch UFO shows a lot and tell them about what I see. I had just made them watch part of an episode where a triangle shaped UFO had been seen somewhere in the US...forget where. They were practically yelling for me to go outside and see if I could see it because it was moving toward the community we live in. My grandson and I raced outside and started looking up. The house faces the north. Almost immediately the object came into sight right above where we were standing on the sidewalk! We watched it fly over slowly and proceed in a northeasterly direction headed somewhere between Paris and the Red River.There were sounds of airplanes but not from this object. We live inthe flight path of DFW and hundreds of planes fly over in a days time. It was gliding with no sound and my impression was that it was not in any particular hurry to get anywhere and certainly did not care if it was noticed... except that it was flying at dusk.It actually flew directly over us! It just drifted on out of sight.It was awesome and scary at the same time."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13079.html.txt","/var/www/straped/mufon/org/13079.html"],"City":"Bonham","Log Number":"US-10162008-0007","Case Number":"13079","Date Submitted":"07/31/2007 12:00 UTC","Disposition":"Unknown","Summary":"Triangle, dark gray -black,each\"rounded corner \"held a white light","Longitude":"-96.178311","Tags":"City"}