{"Tags":"City","files":["/var/www/straped/mufon/html2text/13071.html.txt","/var/www/straped/mufon/more/13071_submitter_file1__1.jpg","/var/www/straped/mufon/more/13071_submitter_file2__2.jpg","/var/www/straped/mufon/org/13071.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.887494,+-87.619838(13071)&iwloc=A&hl=en\"> mufon case (13071) map </A>","Date of the Event":"08/01/2008 06:00 UTC","Object Features":"Undisclosed","Log Number":"US-10152008-0013","divs":["Sighting Details1. Where were you and what were you doing at the time? 2. What made you first notice the object? 3. What did you think the object was when you first noticed it? 4. Describe the object and its actions and motions. 5. Describe your feelings, reactions and actions, during and after sighting the object. 6. How did you lose sight of the object? I was enjoying a meal at a chinease restaurant and after i went to the Jewel nearby. After i walked out of the Jewel i crossed the street into the second parking lot and i looked up. This is when i first noticed a bright spot in the sky. I thought it was something bright in the sky, i didn't think right away UFO. The object was two orbs joined together by a shaft that looked like a cresent moon(banana shape) is the best way i can explain it. It was a clear sky that day. During this time i was still walking across the street so i couldn't just stand there all the time. I walked and looked up again right away. This object whatever it was was a circle(sphere) now. Bright yellow emitting light from it. The orbs emitted light too. During this time i was just shocked and in disbelieve that i could've accually just seen a UFO. I thought i would have to move to Mexico to see something like this. Shortly after the object just dissapeared. The whole event from the first time i spotted the object lasted less than a minute. It was an amazing event that i dont think i will ever forget. It was not a star, the sun or the moon. How do i know, the sky looked dimmer at that spot in the sky after this happened and i looked everywhere to see if i could to explain this, but i saw notin afterwards. That's enough proof. Did it had to do anything with aliens? I don't know. Is it possible and do i believe it might? Yes i do."],"Country":"United States","Summary":"Two orbs joined together. Second look at the object, object turned into a circle. Second later it just dissapeared.","Object Flight Path":"Undisclosed","City":"Chicago","trends":["There have been 221 other sightings in Chicago","There were 4 other sightings in Chicago on or around August 1st 2008","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Illinois","Object Shape":"Circle, Fireball, Oval","Disposition":"Insufficient Data","Weather Factors":"Unknown","Longitude":"-87.619838","Sighting Duration":"00:01:00","Latitude":"41.887494","Case Number":"13071","Viewing Distance":"Unknown","Date Submitted":"08/01/2008 06:00 UTC"}