{"Country":"United States","Source":"MUFON","trends":["There have been 8 other sightings in Davis","There was one other sighting in Davis on or around October 8th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.552686,+-121.733677(13073)&iwloc=A&hl=en\"> mufon case (13073) map </A>","Date of the Event":"10/08/2008 07:45 UTC","Object Flight Path":"Straight-line path","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13073.html.txt","/var/www/straped/mufon/org/13073.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10162008-0001","divs":["Sighting DetailsI was in front of my house putting out garbage cans and noticed a bright white light (like Venus in luminosity) moving from NW in sky to SE about the same speed as a small aircraft but no visible flashing wing lights. I decided to watch it as it changed angle in relation to me to see these lights to reassure myself it was a plane (Sacramento airport is not far away or Davis airport). I watched it for several minutes and saw only the one light. I also observed that it had a more graceful movement than a self-propelled vehicle (like gliding) but it stayed at a constant altitude and speed. I heard no noise like you hear with a small prop plane. Finally it was now SE of me and as I watched it- it turned completely red (bright like a laser pointer) and shrunk until it was gone. I was convinced this was not an airplane or helicopter. I have begun staring at the sky since having had several experiences in the past year and going to Mufon conference in July. Would like to talk to someone about this."],"Latitude":"38.552686","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"California","Longitude":"-121.733677","Summary":"Bright light moving NW to SE - no flashing lights. Followed to look for lights - light turned laser red and shrunk","Date Submitted":"10/08/2008 07:45 UTC","Object Shape":"Star-like","Object Features":"Undisclosed","City":"Davis","Case Number":"13073"}