{"files":["/var/www/straped/mufon/html2text/13078.html.txt","/var/www/straped/mufon/org/13078.html"],"trends":["There have been 8 other sightings in Brooksville","There were no other sightings in Brooksville on or around September 30th 1977"],"Longitude":"-82.377971","Date Submitted":"09/30/1977 10:00 UTC","Latitude":"28.559382","Log Number":"US-10162008-0006","Case Number":"13078","divs":["sighting details my boyfriend and i were out walking on the country club golf course around 10 pm as we often did. suddenly we heard a \"buzzing\" or \"humming\" noise coming from above us. we looked up and saw a disc-shaped flying object just above the tree tops. it had rectangular shaped lights glowing individually around the outer edge of the craft. as i remember the lights were different colors and blinking. it was about the length of a semi-truck but round. i just stood there frozen in disbelief. when i finally realized what it was i ran for the car. my boyfriend was far ahead of me b\\c he ran right away when we saw it. we raced home and called the local police. they informed me that they had had a few other reports of what sounded like the same thing from our area. what struck me was the fact that it was so quiet and came upon us so fast. it was flying from west to east and moving at around 45 mph i would say. i'm not sure if it was landing or had just taken off but it was barely above the scrub pine trees on the edge of the course. we were very frightened at the time. i don't think many people took us seriously then but we know what we saw. sightings of ufo's were not as commonly reported then as they seem to be now."],"Viewing Distance":"21-100 Feet","Source":"MUFON","Weather Factors":"None","Object Features":"Window(s)","Country":"United States","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Unknown","City":"Brooksville","map":"<A HREF = \"http://maps.google.com/maps?q=28.559382,+-82.377971(13078)&iwloc=A&hl=en\"> mufon case (13078) map </A>","Date of the Event":"09/30/1977 10:00 UTC","Tags":"City","Object Shape":"Circle, Disc","Summary":"Disc shaped flying object over golf course.","Region":"Florida"}