{"Case Number":"13072","Region":"Maryland","Source":"MUFON","divs":["Sighting DetailsI am a little creeped out at what my husband and I saw along with another couple that passed by us on the boardwalk in Ocean City, MD last night... I don't know who to contact about this, so, I just googled the word \"sightings\" and found your website and figured it was a good place to start... I never had anything like this happen to me in my entire life, and I can't make this stuff up. My husband and I drove down to Ocean City, MD on the morning of Oct. 14, 2008 for a little day trip to make up for lousy weather we had there a couple of weeks ago during our anniversary vacation... Anyway, at around 6pm we went into Phillip's Seafood house(near 12th and boardwalk) We finished our supper around 7pm and were walking slowly on the boardwalk back to our car on 10th street to return to Pennsylvania. I was looking out to the ocean and noticed how beautiful the clear sky was and that the full moon was so bright and really lit up the night sky since there were no clouds to be seen.... When off in the distance just over the ocean's horizon, I saw what looked to be a plane burst into orange fire, but in slow motion. It only illuminated for a few seconds and faded back into the night sky... Then, a few minutes later in another area I saw it happen again, only further away... I kept pointing to the sky and saying to my husband, \"did you just see that?\" and he did... And a couple that passed by came up to us and said. \"I saw you pointing to the sky, tell me you just saw that and we aren't crazy. I thought it was a plane on fire\" And we both told them that we had seen it... The strange orange glowy light popped up about a half-dozen more times within about 10 minutes... Now we were all watching this weird event closer... The lady that was with the man that who asked us if we had seen it called the Ocean City Police right away, but they shoved it off and said it was probably Navy Maneuvers... Then, out of no where off in the distance that faint orange burny-glowy light shined again, but this time it was accompanied by 4 additional lights in a row... It really kind of looked like the Phoenix lights, like the 5 lights were part of the outside ring of a disk... Only orange and it didn't last long... and It didn't really move to much, it just appeared, rotated and then faded away... We got really creeped out and left right away...The entire four hours driving home we didn't say a word to eachother... I couldn't sleep all night long because of this little episode... I'm scared...Was it the Navy? I did see two Navy Helicopters fly over the beach at around 2pm that afternoon... But there were no clouds in the sky, wouldn't we be able to track headlights from a plane or helicopter? These just faded away... It was really creepy..."],"City":"Ocean City","Summary":"Unidentified Flying Objects over the ocean near Ocean City, MD","Log Number":"US-10152008-0014","Tags":"City","Object Shape":"Disc, Fireball, Flash, Star-like","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Disposition":"Unknown","Latitude":"38.340053","trends":["There have been 16 other sightings in Ocean City","There were no other sightings in Ocean City on or around October 14th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.340053,+-75.080626(13072)&iwloc=A&hl=en\"> mufon case (13072) map </A>","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/13072.html.txt","/var/www/straped/mufon/org/13072.html"],"Object Features":"Unknown","Longitude":"-75.080626","Date of the Event":"10/14/2008 07:00 UTC","Country":"United States","Date Submitted":"10/14/2008 07:00 UTC","Sighting Duration":"Undisclosed"}