{"City":"St Petersburg","Date Submitted":"08/10/2001 11:30 UTC","Longitude":"-82.63428","Latitude":"27.778696","Case Number":"1307","Date of the Event":"08/10/2001 11:30 UTC","divs":["sighting detailsinvestigator interviewed the witness by telephone on augut 27, 2001. hestated that he and his sons fiance were sitting by the pool at about11:30 p.m. on august 10, 2001. they were looking toward the north at thenight sky from his residence on 4th street n. in st. petersburg whenthey saw a bright object, white in color, appear in the sky. moving likea skimmer bug skimming across water in a pulsing fashion. it stopped,banked at sharp angles, zigzagging right and left and immediatelychanged directions 180 degrees, then drifted. it would repeat theseactions several times during the sighting.the witness stated that the sky was fairly clear but there was somecloud cover which made it difficult to determine the exact shape of theobject, although it appeared to be spherical. the distance wasapproximately 2 miles and the elevation 5.000 feet.the witness is an ex-air force pilot and is familiar with fighterplanes. he said after about 15 minutes 4-6 fighter planes came from thedirection of macdill afb and passed by in a south to southeasterlydirection as though they were searching for something. the first passthey made was at a low altitude of about 1\\3 mile above the bay directlybelow the object and the next pass was at a higher altitude. however,the object remained motionless during these periods and it escapeddetection.later, about 14 or 15 small white\\beige lights seemed to materializefrom all directions of outer space. they kept circling the large object,getting closer and closer, then all stopped and remained motionless witha little movement from time to time.after about one hour, witness returned to his apartment. he is at acomplete loss to understand what he observed because nothing in his air forcecareer remotely resembled this sighting."],"Weather Factors":"Unknown","Disposition":"Unresolved","Sighting Duration":"01:59:00","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=27.778696,+-82.63428(1307)&iwloc=A&hl=en\"> mufon case (1307) map </A>","Object Shape":"Sphere","Summary":"Skimmer bug sphere and fighter planes","files":["/var/www/straped/mufon/html2text/1307.html.txt","/var/www/straped/mufon/org/1307.html"],"Tags":"City","Log Number":"","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around August 10th 2001"],"Object Flight Path":"Unknown","Country":"United States","Region":"Florida","Source":"MUFON"}