{"Object Flight Path":"Straight-line path","Object Shape":"Cigar, Disc, Flash, Sphere","Date Submitted":"10/14/2008 08:30 UTC","Log Number":"US-10162008-0011","City":"Gold Canyon","Latitude":"33.361944","Tags":"City","Country":"United States","Case Number":"13083","Region":"Arizona","files":["/var/www/straped/mufon/html2text/13083.html.txt","/var/www/straped/mufon/org/13083.html"],"Object Features":"Undisclosed","Date of the Event":"10/14/2008 08:30 UTC","Longitude":"-111.451667","Disposition":"Unknown","trends":["There have been 3 other sightings in Gold Canyon","There were no other sightings in Gold Canyon on or around October 14th 2008"],"Source":"MUFON","divs":["sighting details a friend and i were driving eastbound on us60 between kings ranch rd and peralta trail. off to the south east we observed a mid-air smoke circle and line of smoke through the circle. very high, maybe 10,000'- 15'000', could have been a meteorite breaking up over the desert. but a later event in the day made me reconsider this. the entire sky was cloud free and a very gentle breeze allowed the plume to be visible for sometime, which made me believe it was rather large. as i was driving i could not focus on it very long but my friend was very aware of it as he was in the passenger seat on the side of the smoke. he was the one whom noticed it. we both do not wear glasses for corrected vision. i have noticed this type of object before on two other ocassions. then later in the afternoon at approximatly 2:45pm i was again traveling eastbound on us60 between idaho rd and tomahawk rd when i noticed a very fast moving cigar shaped very bright object moving from superstition mountain towards the south, about 1.5 - 2 miles from where i was situated. i would state that it was approx 150'- 200' feet in length\\diameter at it's largest. it appeared to change shape from cigar shape to a disc to a very condensed point twice, then it disappeared. it was slowly steadily climbing in altitude and at about 1,500' - 6,000' and cruising steadily at about 300+ mph. i did note the bright sunlight and thought that it might have been the sun glinting off of the object that made it appear to change shape, but as i watched it i discounted that and definitly saw it change shape before i lost it. it was again changing shape to a point when i lost it. i did not see any wings nor stabilizer and observed it for about 15 seconds total. it maintained a steady brightness unlike sunlight shining off it. i am aware of williams gateway airport in this area and this did not appear to be a typical military or civilian aircraft. after i came home i called my friend that was with me ealier in the day and he reflected on the earlier smokeplume when i explained to him what i had seen. that made us think maybe they were connected possibly."],"Summary":"Smoke plume mid-air, object observed 6 hours later possibly unrelated, same vacinity.","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.361944,+-111.451667(13083)&iwloc=A&hl=en\"> mufon case (13083) map </A>"}