{"divs":["Sighting DetailsIt is Friday at 4:17am. Just got up for work, grabbed some coffee, sitting at the computer, i noticed something flashing in the window. I got up, looked out and seen 2 solid white flashing balls darting around in the sky. I got up, went downstairs, went outside on my deck. There are no street lights where i live, so it was pretty dark. We had a full moon a few days ago, but today was cloudy, no rain. I watched these balls, speed out to one area, stay still, then dart out into another area. We have had a lot of military activity out here lately so i was thinking at that point that it might be them again, but the speed and distance that they traveled was just too fast. they would seem to get brighter, then fade out some, but come right back again. I watched them for about 10 minutes. while in the sky, the balls , in size were smaller than the full moon would be in the sky, they were about the size of a baseball held up in the air in front of you.I had to go back in to get ready for work and on my way out the back door to the car, i couldn't see them anymore. My feelings at first was trying to determine what sort of military craft they were, but very quickly realized that they weren't ours. then i felt a bit nervous, because i was alone and didn't think anyone else had seen this and was afraid to mention this to anyone because i work for the military, but things like this need to be reported."],"Weather Factors":"Unknown","Date of the Event":"10/16/2008 12:00 UTC","City":"Jim Thorpe","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-10172008-0002","Summary":"Seen 2 round white ball like objects rapidly flashing and blinking in the sky, would hover than take off","Region":"Pennsylvania","trends":["There have been 2 other sightings in Jim Thorpe","There were no other sightings in Jim Thorpe on or around October 16th 2008"],"Longitude":"-75.730273","Sighting Duration":"Undisclosed","Case Number":"13086","files":["/var/www/straped/mufon/html2text/13086.html.txt","/var/www/straped/mufon/org/13086.html"],"Object Features":"Unknown","Country":"United States","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Circle, Disc, Flash","map":"<A HREF = \"http://maps.google.com/maps?q=40.877934,+-75.730273(13086)&iwloc=A&hl=en\"> mufon case (13086) map </A>","Latitude":"40.877934","Date Submitted":"10/16/2008 12:00 UTC","Disposition":"Insufficient Data"}