{"trends":["There have been 2 other sightings in Rancho Santa Margarita","There were no other sightings in Rancho Santa Margarita on or around October 17th 2008"],"Summary":"Lights seen moving in all directions in Southern California","Date Submitted":"10/17/2008 09:30 UTC","divs":["Sighting Details At 9:30 P.M. me and my friend were called to come outside by my friends Dad. We looked into the sky and there were 2 lights bigger and brighter than stars. These white lights were able to change how bright and dim they were. They also had a red light on it that would quickly blink on occasion. When I first looked at it I thought it was a big star until it started moving. These lights were moving in all directions and were able to change direction very fast. These lights would go in circles around each other and drift apart. They would go as high as the moon was and drop to behind the Mountains in about 1 and one half seconds. When planes flew by these lights would dim so much that they could not be seen and as soon as the plane was gone the light would go up and start shining. During this time my cell phone was not able to call or receive calls or messages. My friends house phone that he brought was also having difficulty calling people. I lost sight of the object when it disappeared behind the mountains. The background of this scene was a California suburb with many trees and Mountains in the background. There was also a grey hazy in the sky around this time but it was not very close to the lights. There was at least 11 witnesses and one of them was a police officer."],"Latitude":"33.640855","Object Shape":"Circle, Sphere, Star-like","Sighting Duration":"01:05:00","Log Number":"US-10182008-0002","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/13096.html.txt","/var/www/straped/mufon/org/13096.html"],"Source":"MUFON","Region":"California","Viewing Distance":"Unknown","City":"Rancho Santa Margarita","Date of the Event":"10/17/2008 09:30 UTC","Country":"United States","Object Flight Path":"Other","Longitude":"-117.603104","Tags":"City","Disposition":"IFO","Case Number":"13096","map":"<A HREF = \"http://maps.google.com/maps?q=33.640855,+-117.603104(13096)&iwloc=A&hl=en\"> mufon case (13096) map </A>","Object Features":"Unknown"}