{"Disposition":"Unresolved","Case Number":"13090","Object Shape":"Unknown","Log Number":"GB-10172008-0006","Region":"","Object Features":"None","Country":"United Kingdom","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13090.html.txt","/var/www/straped/mufon/org/13090.html"],"Date Submitted":"10/17/2008 07:10 UTC","Date of the Event":"10/17/2008 07:10 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"0.040765","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.53616,+0.040765(13090)&iwloc=A&hl=en\"> mufon case (13090) map </A>","City":"London","trends":["There have been 154 other sightings in London","There was one other sighting in London on or around October 17th 2008"],"Latitude":"51.53616","divs":["sighting detailswe was on our way home in the car on barking road heading toward eastham. i saw a very bright light in the sky as it was getting dark and assumed it must be the north star but then i realized that it was cloudy and it wouldn't have been visible plus the light was too bright. as we approached closer i could see it didn't have a flashing white light so it could not have been a plane or helicopter, then i opened my winndow and turned my head up toward the sky, i watched it for about 3 mins get closer, by now it was almost over head and i couln't see a bright light hardly at all anymore and i said to my partner look at that, he looked hard at it too and he couln't explain it either. we stared for about 2 mins before getting cought at traffic lights and at this time we were underneath it, i kept thinking was is it, there has to be a reasonable explaination. but the more i thought i just knew it was a ufo it was a dark grey colour with an orange\\red glowing light that orbited it,there was a beaming light glowing upwards and it was spinning, it was swaying, well almost gliding from side to side and and had staggered movements then it was stationary for about 30 seconds then staggered again, the traffic lights changed but i was mesmerized and i still had my head stuck out side of the car, as the car started to move it went straight up and was getting fainter and fainter. unfortunatley our phone didn't take video and the camra was not in working order, but i am happy now that i have seen one."],"Weather Factors":"Unknown","Summary":"Very bright light on top and a dark graphite colour underneath orange/red orbiting light round it.","Object Flight Path":"Stationary,Path with directional change,Path then hovering"}