{"Longitude":"-118.457197","Date of the Event":"10/13/2008 08:00 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around October 13th 2008"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unknown","Case Number":"13095","Object Shape":"Circle, Flash","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Log Number":"US-10182008-0001","files":["/var/www/straped/mufon/html2text/13095.html.txt","/var/www/straped/mufon/org/13095.html"],"Weather Factors":"Windy","Source":"MUFON","Tags":"City","Date Submitted":"10/13/2008 08:00 UTC","City":"Los Angeles","Summary":"A hovering object above Sylmar, CA - with a pulsating light.","Region":"California","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis is my second UFO sighting in the area of Sylmar, California. There were three main fires occuring in my area, including Porter Ranch that night. In Sylmar it was being called the Merrick fire. There were helicopters both monitoring and fighting the fires. But This was NOT a helicopter. This was a glowing, pulsating light which hovered for an extended period of time over the area between Sylmar and Porter Ranch. It did not move - it just pulsated light for about 20 minutes. From time to time it would move further away from my apartment, but then it would just hover, remaining perfectly still. The sun had set with a slight glow in the night sky, so most of the sky was dark now. In this event the UFO was much closer to me than the first which I had encountered, but was still far enough away that no true detail could be seen - aside from the obvious illumination from the craft itself. There was no reflection - just a glowing, pulsating light. No sound came from the vehicle either."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.305828,+-118.457197(13095)&iwloc=A&hl=en\"> mufon case (13095) map </A>","Object Features":"None","Country":"United States","Latitude":"34.305828"}