{"Date of the Event":"09/11/2001 10:10 UTC","Viewing Distance":"Over One Mile","Summary":"sighting of wedge shaped object","divs":["Sighting DetailsI have to report to you that on Tuesday night, Sept 11, 2001, I and my 9 yearold son witnessed a wedge shaped UFO. I live in Colon, MI. (85.19deg west,41.57deg north). The time was about 22:10 when he reported to me that he saw aplane in the sky. I went to his room to see, thinking this odd as all of theairports had been shut down. I have seen airplane lights before, they strobe a aregular, even rate and have a red light on one wing, a blue light on the otherand a white light amid-ship somewhere. What I saw was a slow moving craft with randomly flashing blue, red, and white lights all along the edge of the craft. We then ran outside to get a better view. It was moving due west from a point south east of my position. As it came parallel to our position I did a angle check by hand (a trick I learned in astronomy class) I found that it was about 30 degrees above the horizon over due south. I could not judge its distance as I realized that I was not dealing with just any standard aircraft, and these things could really be any size. I could not detect any sound coming from the craft. But, as I said, I have no idea how far the craft was from my position. As it neared the western horizon I noticed that the only steady lights on the craft were two white rear lights. One on each rear point. I dont know if there have been any other reports of the sighting, but I offer mine as more proof that this type of craft exists. My theory is that they may have been interested as to why there were no other aircraft in the air over one of the busiest air traffic continents on this planet."],"Country":"United States","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.958382,+-85.324982(1310)&iwloc=A&hl=en\"> mufon case (1310) map </A>","Longitude":"-85.324982","Sighting Duration":"00:10:00","Tags":"City","Log Number":"","Disposition":"Unresolved","Source":"MUFON","Latitude":"41.958382","Region":"Michigan","City":"Colon","Weather Factors":"Unknown","Case Number":"1310","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/1310.html.txt","/var/www/straped/mufon/org/1310.html"],"trends":["There have been 2 other sightings in Colon","There were no other sightings in Colon on or around September 11th 2001"],"Date Submitted":"09/11/2001 10:10 UTC","Object Flight Path":"Straight-line path"}