{"Viewing Distance":"Unknown","Object Features":"Undisclosed","Country":"Canada","Summary":"Driving down highway 3 into Yellowknife from Hay River... seen a bright light that appeared to be a shooting star.. was captured by it when it stopped moving and hovered in 1 location for a while. I pulled the Transport over and watched the object through","Object Flight Path":"Undisclosed","Tags":"City","City":"Yellowknife","Latitude":"62.454648","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=62.454648,+-114.376469(13102)&iwloc=A&hl=en\"> mufon case (13102) map </A>","files":["/var/www/straped/mufon/html2text/13102.html.txt","/var/www/straped/mufon/org/13102.html"],"Case Number":"13102","Region":"Northwest Territorie","Source":"MUFON","trends":["There has been one other sighting in Yellowknife","There were no other sightings in Yellowknife on or around April 3rd 2007"],"Date of the Event":"04/03/2007 11:19 UTC","Log Number":"CA-10192008-0002","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Date Submitted":"04/03/2007 11:19 UTC","divs":["Sighting DetailsDriving down highway 3 into Yellowknife from Hay River... seen a bright light that appeared to be a shooting star.. was captured by it when it stopped moving and hovered in 1 location for a while. I pulled the Transport over and watched the object through binoculars. Seen Sphere shaped object in the sky.... Moving closer and Further away..... at great speed.... then hovering. Changed colors... red... blue. green and seemed to have a ring of lights around it... like the rings of saturn. Turned off headlights on vehicle as it was after 11 pm... object hovered and then came closer... got scared and turned headlights back on... object moved closer... There was no noise coming from the object... and it seemed to take on 2 shapes.. between vertical and horizontal movement... the lights surround the object changed between the 3 colors mentionned above Stayed and watched it decend and ascend for an hour... then headed into Yellowknife... Seen on 4 occassions that week."],"Disposition":"Unresolved","Longitude":"-114.376469"}