{"Object Shape":"Other","Source":"MUFON","Disposition":"Hoax","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Country":"United States","trends":["There have been 12 other sightings in Fairless Hills","There were no other sightings in Fairless Hills on or around October 18th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.174101,+-74.858754(13113)&iwloc=A&hl=en\"> mufon case (13113) map </A>","Weather Factors":"Unknown","Case Number":"13113","Summary":"A silent, white, unmarked airplane-like object without wings but with a tail was seen flying in the sky from the Sesame Place parking lot.","Viewing Distance":"21-100 Feet","Object Features":"Other","divs":["sighting detailsi was leaving sesame place with a friend and her son on saturday 10\\18\\08. we were leaving the park and walking towards the parking lot when i happened to look up and saw a white plane-like object that was silent, unmarked, had no wings but a tail \"fin\" fly across the sky from west to east over the trees across from the theme park at the normal speed of an airplane. since it had no wings, i was instantly fascinated but a large tree on my path blocked my view as i watched it. i moved over in less than two seconds to have a better view and saw the object must have turned north and then came back down on a north to southeast angle, now flying in the direction of the old don pablo's. i did not see it turn from the original direction and wondered how it got so far north after being closer to me. it was odd seeing a plane-like object with no wings and it held my attention as i wondered how it ever got off the ground. it appeared to be the size of a normal passenger plane but was solid with no windows and all white. i was speechless and when i glanced at my friend and then back up to the sky it was gone. after this happened, i recalled seeing this same object. i realized i saw it on this website, sketched by a gentleman who saw this object with two other objects. i only saw it by itself but it was exactly as he sketched it and described. this event did not scare me, but i was surprised at how much i was drawn to watch it pass overhead and was disappointed that i lost it when i looked away."],"City":"Fairless Hills","Latitude":"40.174101","Date of the Event":"10/18/2008 03:30 UTC","Longitude":"-74.858754","files":["/var/www/straped/mufon/html2text/13113.html.txt","/var/www/straped/mufon/org/13113.html"],"Log Number":"US-10202008-0003","Tags":"City","Date Submitted":"10/18/2008 03:30 UTC","Object Flight Path":"Path with directional change"}