{"files":["/var/www/straped/mufon/html2text/13111.html.txt","/var/www/straped/mufon/org/13111.html"],"divs":["Sighting DetailsI had steped out inyo my back yard to smoke a cigareete. Couldnt sleep. Noticed a yellow and blue light that seemed out of place in the sky. A small person like thing appeared before me aboput 15 foot away from me. I imediatley felt out of sorts, like I was about to fall down and had no strenght. Sort of grougy. With out opening its small mouth it let me know it wasnt going to hurt me and he would be with me until I was returned. I must have blacked out and the next thing I remembered was laying on a table ina large oval shaped room. Sort of like a horseshoe. The one that came to me was there. I begged him not to drug me or whatever. I wanted to remember everything. I turned to the others and agreed since I wasnt going nuts on them. They checked and took samples from every hole in my body. They wrent real happy with what they got from out back. Made noises of displeasure I guess at the smell. They stuck probes in my nose , mouth and penis and extracted some fluid. I pretty sure it was sprem. I asked them way they were doing all this. It took a while for them to answer, And rember the never made but a few sounds, I heard the answers in my head. I wanted to know where they were from and they showed me a chart I really didnt understand. But explained that we could not ever reach them because of the differance of our time and theres. The called theres C -time. I dont know wht they meant. I was lead to a window and looked out. We where far above the earth. And I could see the lights outlining certain areas that was reconizable. They explained that they needed our help if the were to survive. There race was dieing out slowly and they needed to Biologcally combine our makeup to blend eith theres so they could reporduce. I was then lead to a table and they had a bright green light pass just over my body. I was told of the problems i WOULD HAVE WITH MY PHYSICAL Body. Over the past twenty years they have all come true. They also told me the time of my death. And of a time that they would be known to everyone. They need our help and for that help wiether we give it frrely or not they are going to protect our Earth. 2013 will be the year that changes everthing for us, We will then know that we are but a speck in the sky to whats really out there. I have been visted since and remember each encounter clearly. I was told to let someone know of there visits, They told me they would have others reveil ther contacts too. There not coming to due us harm. And they also have made it clear that they have been helpling us all along with knowledge of our leadrs. They where upset that they had not been reveiled to all of us and the keeping of the secret was not part of there aggreement."],"Country":"United States","Log Number":"US-10202008-0001","Latitude":"27.952085","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around August 15th 1987"],"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"13111","Weather Factors":"Unknown","Summary":"Taken by one to a ship with horsehoe room, examined, talke to & returned.","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.952085,+-82.454668(13111)&iwloc=A&hl=en\"> mufon case (13111) map </A>","Date of the Event":"08/15/1987 12:59 UTC","Object Flight Path":"Undisclosed","Disposition":"Hoax","City":"Tampa","Tags":"City","Date Submitted":"08/15/1987 12:59 UTC","Object Shape":"Unknown","Object Features":"Undisclosed","Longitude":"-82.454668","Region":"Florida"}