{"Latitude":"31.130052","Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply","City":"Copperas Cove","Case Number":"13112","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Shape":"Boomerang","Region":"Texas","files":["/var/www/straped/mufon/html2text/13112.html.txt","/var/www/straped/mufon/org/13112.html"],"Tags":"City","Date of the Event":"06/30/1991 10:30 UTC","Object Flight Path":"Straight-line path","Country":"United States","Summary":"Boomerang object.","map":"<A HREF = \"http://maps.google.com/maps?q=31.130052,+-97.900858(13112)&iwloc=A&hl=en\"> mufon case (13112) map </A>","Disposition":"Unknown","Date Submitted":"06/30/1991 10:30 UTC","Longitude":"-97.900858","Object Features":"None","trends":["There have been 8 other sightings in Copperas Cove","There were no other sightings in Copperas Cove on or around June 30th 1991"],"Log Number":"US-10202008-0002","divs":["Sighting DetailsIt was during a summer night in front of my house and I had come back from college where I was studying astronomy. I was showing my buddy the constellations in the sky. As we were looking at the constellations we began to identify moving lights. We saw satellites traveling across the sky as they appeared as \"non-twinkling\" star sized lights. We also identified airplanes which always seemed to have some type of blinking red beacon light. We knew they were planes because we could hear the sound of the engines finally reaching us. As we continued looking at constellations in the sky, we then noticed a light far away moving toward us. Thinking nothing of it, we were trying to think of what kind of plane it might be. As the light got closer, we noticed it didn't appear to make any sound like we heard with previous planes. We began to anticipate the sound to reach us at any moment. As the light moved closer and closer the light started to get bigger. I then realized this object didn't have any blinking lights on it like the planes we identified previously. It was a surreal moment. As it flew over us, we were struck with awe. The best way I can describe it was that it was shaped like a boomerang and was probably about 50 yards wide. I would guess that it was probably flying at about 150 to 200 feet above us and moving at about 40 mph. It didn't make any unusual movements or aerobatics. It just flew in what appears to be a straight path. The object was emitting a white bright light from the entire surface of its body as if it was one whole light. The light was very similar to quality of light a full moon would produce, but strangely, it didn't light up anything as a full moon would do on a clear night. And I thought I was hearing a very low sound coming from it, almost bordering the lower limit of my hearing range, but wasn't sure. It continued to fly over us and off in the distance. We lost visual contact with it because of the near by houses. We both looked at each other in disbelief. We later went down to a small valley area called \"Ogle Tree Gap\" which was near my house where we could continued to view constellations. On our way to Ogle Tree Gap, we kept wondering if it was some type of experimental craft from Ft. Hood, which was a near by military base. But as we got there about 15 min later after the event, we noticed about a dozen helicopters flying around in formation with search lights on. We then immediately left and went home and called it a night. The next day I was hoping to find something in the local paper or on the news about what we both had experienced to kind of clarify out thoughts. I found nothing. I haven't spoke about this in over 10 years until recently. I have searched for the object since then on the internet. Even stories but I have found nothing at this point that is identical to what I experienced."]}