{"Object Features":"Unknown","Region":"California","Object Flight Path":"Straight-line path","Object Shape":"Boomerang","divs":["sighting detailsat approximately 19:15 hours on october 20th 2008 i went out on my second story apartment balcony which faces north\\northwest to have a cigarette. gazing east\\northeast i observed a string of dark red lights in a boomerang formation travelling southeast to northwest. the lights never changed formation leading me to speculate they were not individual objects but that they belonged to a singular object. the light appeared to blink in a tip-to-tip sequence, alternating starting points. the object was occluded from my view after about 30 seconds due to a very large tree in my building courtyard, so i moved to the other side of the porch hoping that the object's path would allow it to be visible on the other side of the tree. it unfortunately was not. i did however continue to gaze into the sky hoping maybe it would appear. about 5 or 10 minutes after the initial sighting, i happened to look back in the direction i originally saw the object only to see it again or an identical object traveling in the same exact path as the first object. i would estimate this sighting was the same duration, my view being once again occluded by the large tree. this second object as it passed seemed to me to be followed by one or two aircraft. whether these were jet or helicopter i am not certain. i am no aviation expert but having lived in this area for over two years i am quite accustomed to hearing and seeing commercial jets and private headed for lax or burbank pass over my building. had this object been one of these judging from its size, it would have been extremely low and emitting very loud engine noise. there was no discernible noise coming from these objects. my wife who would have normally been here is away on business so i was the sole witness to this event unfortunately."],"Latitude":"34.151749","files":["/var/www/straped/mufon/html2text/13129.html.txt","/var/www/straped/mufon/org/13129.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-118.521428","Log Number":"US-10212008-0001","Case Number":"13129","Date of the Event":"10/20/2008 07:15 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around October 20th 2008"],"Summary":"Two Very Large Boomerang Shaped Objects seen in Encino CA","Country":"United States","Tags":"City","Date Submitted":"10/20/2008 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.151749,+-118.521428(13129)&iwloc=A&hl=en\"> mufon case (13129) map </A>","Disposition":"Unknown"}