{"Summary":"Extreme Shine from sun reflection","Case Number":"13123","trends":["There have been 4 other sightings in Lawrenceburg","There were no other sightings in Lawrenceburg on or around October 20th 2008"],"Object Features":"Unknown","Latitude":"38.037297","Weather Factors":"None","Object Flight Path":"Hovering then path","Date of the Event":"10/20/2008 02:30 UTC","Disposition":"Unknown","Object Shape":"Disc","Country":"United States","Log Number":"US-10202008-0013","Sighting Duration":"Undisclosed","Date Submitted":"10/20/2008 02:30 UTC","City":"Lawrenceburg","map":"<A HREF = \"http://maps.google.com/maps?q=38.037297,+-84.896617(13123)&iwloc=A&hl=en\"> mufon case (13123) map </A>","Region":"Kentucky","Tags":"City","divs":["Sighting DetailsComing back from in Louisville, turned off of Interstate 64 to the Lawerceburg exit. Traveling on road that connects to US Highway 127, very clear blue sky few clouds nice day. Enjoying drive when out the corner of my eye on the right upper side of windsheild noticed a reflecting object. I slowed down to see what type of aircraft it might be, since alot of my family are retired Airforce personal.It had no wings or propelers,as I got a good look at it from 100-150 feet off the ground. I was shocked to see a silver shine disc circle shape, not moving but hovering in the air. Lasted not even a minute,when I finally was getting a 100% accuate identification the object shot off straight up. Shocked I slowed down almost to a stop,trying to find the object. Again and again looking everywhere it disapeared. No clouds where in the area around my sighting all I could see was couple low flying birds. One hour before while in Louisville I saw two airplanes and a low flying traffic helicopter. The weird unknown object didn't fly or look anything like what I previously saw just 1 hour before. I've seen many flying machines from Blimps,balloons and airplanes&choppers.But this incident was strange and exceiting.It all was so fast I didn't get time to take a picture from my cell phone. This is my 100% truthful account of the events as it happened!"],"files":["/var/www/straped/mufon/html2text/13123.html.txt","/var/www/straped/mufon/org/13123.html"],"Longitude":"-84.896617","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}