{"Object Flight Path":"Straight-line path","Region":"California","City":"Pomona","Country":"United States","divs":["Sighting DetailsAround 4:30 AM I was standing in a parking lot in Pomona, CA that was dimly lit. I was looking up at the sky and admiring the Big and Little Dipper. Just then I noticed two stars, both the same brightness as the stars in the Big Dipper. They were just to the left of the Big Dipper, one almost directly above the other, starting to move in an upward direction. I have seen satellites in the desert and they move across the sky in an arcing pattern from either left to right or vice versa, so this was really unusual. These two stars continued moving slowly upward and finally became fainter and fainter until they both disappeared at the same time. This took all of about 30-45 seconds from the time they started moving upward to the time they disappeared. I have seen airplanes at night coming in on a flight path and their lights, as the plane is coming at you or going by you, get brighter. These two lights just got dimmer and disappeared...as if they were going straight up into outerspace. I don't know what to make of it, but it sure was odd!"],"Object Shape":"Star-like","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around October 19th 2008"],"Weather Factors":"None","Case Number":"13122","Log Number":"US-10202008-0012","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"10/19/2008 04:15 UTC","Longitude":"-117.749205","Latitude":"34.063877","Date Submitted":"10/19/2008 04:15 UTC","Tags":"City","Summary":"two stars, one above the other, next to the Big Dipper started moving upward & disappeared","Object Features":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.063877,+-117.749205(13122)&iwloc=A&hl=en\"> mufon case (13122) map </A>","files":["/var/www/straped/mufon/html2text/13122.html.txt","/var/www/straped/mufon/org/13122.html"],"Viewing Distance":"Unknown"}