{"Object Shape":"Other","Tags":"City","City":"Cynthiana","Case Number":"13120","trends":["There have been no other sightings in Cynthiana","This sighting has never been favorited."],"Date Submitted":"10/15/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.390353,+-84.294101(13120)&iwloc=A&hl=en\"> mufon case (13120) map </A>","Longitude":"-84.294101","Summary":"Bright-white horizontal streak across the sky","Log Number":"US-10202008-0010","Region":"Kentucky","Country":"United States","files":["/var/www/straped/mufon/html2text/13120.html.txt","/var/www/straped/mufon/org/13120.html"],"Disposition":"IFO","Sighting Duration":"Undisclosed","Latitude":"38.390353","Date of the Event":"10/15/2008 12:00 UTC","Object Features":"None","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsOn October 15 about 9 p.m., I was sitting on the front porch, looking at the stars when a bright-white light streaked horizontally across the sky at due north. The light appeared suddenly from a point below a very bright star and terminated below the next very bright star. (Sorry, I don't know astronomy so I don't know which stars. According to a constellation map I looked at, they could have been the two lower stars in the Great Square of Pegasus.) It lasted only a second or two. As far as distance, the only way I can explain it is this: If I hold my hands above my head at the same spot where I saw this flash, the distance between my hands would be about two feet. The light was very bright, much like that given off by a sparkler. It did not resemble a meteor at all, especially because it maintained a horizontal course and did not arc or bobble. I associated its sudden appearance and disappearance with acceleration. It reminded me of all the sci-fi movies I've seen where the captain orders warp speed, leaving only a flash of the ship behind before its sudden disappearance. I immediately telephoned my neighbor, who is a member of the local MUFON chapter. She interviewed me, asking very specific questions, about what I had seen. She believed it was a UFO. My first reaction to the sighting was bewilderment. (\"What the hell was THAT???\") Shortly thereafter, I realized the sighting was in the same general area (due north) as unexplained round flashes (similar to a camera flash)I had seen on two previous occasions. FYI: My friends and I often gather on my porch in the late evening to listen to music, philosophize, and enjoy the night-time sky. We are NOT UFO watchers, except for the MUFON member."],"Weather Factors":"None","Viewing Distance":"Unknown"}