{"City":"San Carlos","Summary":"jet sized triangle shaped craft with seven lights and a friend","divs":["Sighting Detailsi work graveyard so i am always up late at night even on my days off. i was outside of my apartment smoking a cigarette just looking at the stars and the moon. when i looked out and noticed that something drifting towards my building. at first i thought it was maybe like a tarp or something but as it got closer i noticed it was a triangle shaped craft with seven lights no bigger than a fighter jet. one at the tip of the craft and three at going down each side to the end of the craft. the lights were orange or more of a dim orange. the craft also had what appeared to be a \"friend\" with it it was just a single light that was traveling just behind it. neither craft made any noise, and they were not very high at all i've seen buildings that are taller than these crafts were high. the airport isn't very far from my place but what i saw was no airplane. i work near the airport and see all sorts of planes coming and going and i can assure you it was not an airplane, at least not one that the common sitizen knows about. the whole event lasted about thirty second to minute. the craft(s) just sort of cruised over my place moving in a staight line like you would cruise down a side street. and the only thing i could think about was \"no one is going to belive me\"."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.509999,+-122.252102(13130)&iwloc=A&hl=en\"> mufon case (13130) map </A>","Region":"California","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13130.html.txt","/var/www/straped/mufon/org/13130.html"],"Viewing Distance":"101-500 Feet","Tags":"City","Case Number":"13130","Date of the Event":"10/20/2008 04:40 UTC","Date Submitted":"10/20/2008 04:40 UTC","Latitude":"37.509999","Weather Factors":"None","Country":"United States","Longitude":"-122.252102","Object Shape":"Triangle","Sighting Duration":"00:00:59","Object Flight Path":"Straight-line path","Object Features":"None","trends":["There has been one other sighting in San Carlos","There were no other sightings in San Carlos on or around October 20th 2008","This sighting has never been favorited.",""],"Log Number":"US-10212008-0002","Source":"MUFON"}