{"Latitude":"43.842205","Case Number":"13131","Tags":"City","Sighting Duration":"Undisclosed","Region":"Wisconsin","Object Shape":"Flash, Star-like, Other, Unknown","Date of the Event":"10/20/2008 12:00 UTC","divs":["Sighting DetailsI very frequently watch the skies on any clear night and last night i saw something awesome. I could barely make it out with the naked eye but nonetheless they were still there. My wife and I also observed these through some 10x50 binoculars too. They were definetly out of focus but easier to see with the binoculars. For over two hours they just danced around, kinda hanging in the same vicinity checkin out everything. When they would move they could do so slow like or they could stretch. like you could see one blur of light in the scope then it would stretch out like a spider-web and either reappear in the new location or go right back to where it was, almost like there were two of the same thing. I saw up to four at once in the binoculars. I hit them with my spotlight a bit and they reacted but not much, i didnt get to talk to them. i could see many shooting star-like movements in the sky too, golden colored that leave trails of light behind them in the same areas and time-frame. the blurry ufos or probes or whatever they were werent that far away from me either, i would say half a mile, seemed like they were in my yard but it was hard to tell. My wife freaked out about it."],"Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change,Unknown","trends":["There have been 11 other sightings in Ripon","There were no other sightings in Ripon on or around October 20th 2008"],"City":"Ripon","Longitude":"-88.835945","Log Number":"US-10212008-0003","Date Submitted":"10/20/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/13131.html.txt","/var/www/straped/mufon/org/13131.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.842205,+-88.835945(13131)&iwloc=A&hl=en\"> mufon case (13131) map </A>","Object Features":"Unknown","Source":"MUFON","Summary":"this wasn't necessarily two lights, but more of a blurred reflection of all the light around maybe?","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Country":"United States"}