{"Tags":"City","Disposition":"Insufficient Data","Case Number":"13137","Log Number":"US-10212008-0009","Date of the Event":"10/10/2008 08:10 UTC","Country":"United States","Object Flight Path":"Undisclosed","Object Shape":"Disc, Other","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","City":"Fayetteville","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-94.149776","Latitude":"36.07025","trends":["There have been 21 other sightings in Fayetteville","There were 3 other sightings in Fayetteville on or around October 10th 2008"],"files":["/var/www/straped/mufon/html2text/13137.html.txt","/var/www/straped/mufon/org/13137.html"],"Date Submitted":"10/10/2008 08:10 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.07025,+-94.149776(13137)&iwloc=A&hl=en\"> mufon case (13137) map </A>","divs":["Sighting Details I was coming home from church and pulling up to my subdivision when I saw a couple acting strangely and running to their van. This was at the corner of Stonebridge and Goff Farm road. I continued to drive to my house, pulled in the garage and shut the door. I wanted to see if they were anywhere around, so I went to my front porch to take a look around. That is when I saw the strange lights in the sky towards the south-southwest. That's when I realized that the people I saw must have been outside watching this as well. I thought it was just a plane at first, but then it started lighting up with multi-colored but predominately red and blue chasing lights in a circular fashion. It was mesmerizing and very large. To the right of the object, there was a series of white diagonal lights extending towards the ground that seemed to stay in the same place as the saucer-like object was lighting up. This lasted a really long time (about 15 minutes). I tried to call my husband and tell him about it, but I couldn't get a hold of him. I ran back outside and much to my disbelief it was still there. When I ran back inside a second time, I came back out and it was gone. All the lights were gone, including the white diagonal lights."],"Summary":"A large saucer-shaped object was seen which contained multi-colored chasing lights and was accompanied with diagonal white lights toward the ground.","Region":"Arkansas"}