{"Object Features":"None","Longitude":"-92.281715","Tags":"City","Viewing Distance":"21-100 Feet","City":"Little Rock","Log Number":"US-10222008-0004","Source":"MUFON","Date of the Event":"04/04/1968 10:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.752281,+-92.281715(13158)&iwloc=A&hl=en\"> mufon case (13158) map </A>","Disposition":"Unknown","Object Shape":"Cylinder, Triangle","Date Submitted":"04/04/1968 10:09 UTC","Weather Factors":"Unknown","trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around April 4th 1968"],"Region":"Arkansas","divs":["Sighting DetailsWas running track timing sprints at Henderson Junior High when I noticed an object materializing over Rock Creek. Around 400 feet long as compared to football field I was practicing at an object had diameter I would place around 60 feet for each cylinder. Ther were three cylinders about 60 feet apart each and they were joined by cylinder cross beams to each main cylinder. There was no noise, no reflection from sunlight and no lights. I would assume a craft made for exploration would not have lights for anti-collision as surely they would be much better equipted for flight than planes. I observed this object as it slowly appeare3d and it was not moving. I observed for about 9 minutes and then began to run home which was only 8 blocks away. I told my daddy what i seen and he got his 8 mm camera and we drove back to ASchopol. The object was gone. The object was about 1000 feet above Rock Creek. I called Little Rock Airforce base to see if radar had seen image and Little Rock Airport. There was no sighting on radar. I asked many who lived in my neighborhood if they had seen object. No one else observed object. This has never led me to believ that what i saw was optical or imagined. I know the ship was real and have searched for others who have seen same type object."],"Case Number":"13158","Object Flight Path":"Stationary","Latitude":"34.752281","Sighting Duration":"Undisclosed","Country":"United States","Summary":"Cylinder Object, no reflection, no sound, no lights","files":["/var/www/straped/mufon/html2text/13158.html.txt","/var/www/straped/mufon/org/13158.html"]}