{"Object Features":"Window(s), Patterned Surface","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Silverado","There were no other sightings in Silverado on or around October 7th 2007","This sighting has never been favorited.",""],"Date of the Event":"10/07/2007 07:21 UTC","Object Flight Path":"Hovering then path,Path with directional change,Other","Longitude":"-117.636994","files":["/var/www/straped/mufon/html2text/13161.html.txt","/var/www/straped/mufon/more/13161_submitter_file2__02242922c.jpg","/var/www/straped/mufon/more/13161_submitter_file3__00013029a.jpg","/var/www/straped/mufon/org/13161.html"],"Latitude":"33.74613","divs":["sighting detailshttp:\\\\www.youtube.com\\watch?v=q4s5c_sqavq eh, was up on saddleback mountain riding my motorcycle and had my little cheap dv aiptek camera with me as its easy to carry and not much loss if i crash. at one point i got one right next to me and also saw one that revealed itself through what seemed to be a light portal. see the video, if you want. all true and lately seemingly a daily experience that most can't see. i went to the top of the mountain to catch the sunset and had a \"feeling.\" the objects seemed to skip like a stone and were completely noticeable and rather touch n go. there seemed to be a really large one in the clouds (mother) that these smaller ones interfaced with drones. one of them seemed as curious as me and looked through a dimensional light breach portal (see pics). my feeling was well you look neat but can you give me a ride... and the ride was more like a dimensional tangent and buzzing sound, which was annoying. i didn't lose sight of the object, seemed to follow me down the hill. despite the noise the light show was great. several people drove by, but i didn't bring it to their attention and they didn't seem to notice, i didn't want to scare off the buggers."],"Log Number":"US-10222008-0007","Disposition":"Unknown","Case Number":"13161","Viewing Distance":"20 Feet or Less","Summary":"Several Dimensional Light Craft & Boomerang","Country":"United States","Weather Factors":"Windy, Medium","Tags":"City","Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.74613,+-117.636994(13161)&iwloc=A&hl=en\"> mufon case (13161) map </A>","City":"Silverado","Date Submitted":"10/07/2007 07:21 UTC","Object Shape":"Boomerang, Egg, Oval, Star-like"}