{"Object Flight Path":"Straight-line path","Weather Factors":"None","Object Features":"None","Date of the Event":"10/22/2008 05:35 UTC","Object Shape":"Disc","Sighting Duration":"00:03:30","Source":"MUFON","City":"Goose Creek","divs":["Sighting DetailsAt about 05:35 I let my dog out to the backyard. I normally look at the stars. Today the moon was almost on its New Moon Phase so I could see many stars. I like to look at them. About 1 minute into it, what appeared to be a meteor skipped on the atmosphere from Southeast to Southwest. The sky is extremely clear due to the cold, and there were no clouds at that time, I was begging myself to breakout the telescope. Maybe 45 seconds after this I looked west because something caught my attention. I thought it may be a military plane since the airport is twenty minutes away, and sometimes they change their landing patern. But it was about 400 to 500 feet up, and moving fast. I noticed it was about the size of a dime if I extended my arm. What caught my eye really was the amount of flashing lights. Then I realized that the lights were all around the object. I retired from the military, and qualified lookout. I had not seen this one before, so I stood there looking. About 200 feet behind was a smaller craft approaching fast. I recognized the lighting patern on that one, Typical of regular aircraft, lights on wing tips, lights on wings, light on top and at rear. Five white one red. The larger craft was different in that the lights flashed at a rapid rate, and seemed to circle the craft. Som lights would seem to rotate on the bottom, but the patern seemed to reflect a disc. The small craft probably came as close as 100 feet and then the large craft sped up and it looked like the little one was having a hard time keeping up. The whole scene took about a minute and a half, they went from south to north in a straight line parrallel to where I stood. About then my dog wanted to come in so I started to turn around and looked up once again to see another meteor skip, this time from east to west. I went in and told my wife about the coincidence of the meteors but omitted the UFO sighting. Then we left for work."],"trends":["There have been 5 other sightings in Goose Creek","There were no other sightings in Goose Creek on or around October 22nd 2008"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.985606,+-80.026237(13165)&iwloc=A&hl=en\"> mufon case (13165) map </A>","Disposition":"Insufficient Data","Case Number":"13165","Region":"South Carolina","Summary":"UFO chased by aircraft","Date Submitted":"10/22/2008 05:35 UTC","Country":"United States","Log Number":"US-10222008-0011","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-80.026237","files":["/var/www/straped/mufon/html2text/13165.html.txt","/var/www/straped/mufon/org/13165.html"],"Latitude":"32.985606"}