{"Country":"United States","Region":"Tennessee","Source":"MUFON","City":"Greenback","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.66119,+-84.172136(13174)&iwloc=A&hl=en\"> mufon case (13174) map </A>","Weather Factors":"None","Disposition":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13174.html.txt","/var/www/straped/mufon/org/13174.html"],"Date of the Event":"10/20/2008 09:15 UTC","divs":["Sighting DetailsI was driving home on HWY411 with my daughters from the movies an I noticed a hugh bright white light. I asked both my daughters do you see that? What is that? The more I drove the closer I got to the light. I then saw that it was about 600feet or so in the air an it wasn't moving. It was just hovering there. I then rolled my window down an there was no sound. As I drove under it I then could see one smaller red light on the side surrounded by several very bright smaller white lights. The object than went away as quickly as it came. I was close enough to really see it for around a minute but could see it from a distance for atleast 5minutes or so. Sorry to say I didn't get any pictures. It was dark an I was on the HWY so wasn't safe.I felt excited when I got close enough to see. I have never seen anything quiet like this an don't know if I will again. After I was home for around 20minutes or so I got in my car an went back on the HWY to see if I could see it again, but of course I didn't. I even took the camara this time. Needless to say I will from here on out pack the camara in the car!!!!"],"Tags":"City","Case Number":"13174","Longitude":"-84.172136","Summary":"Bright Front White Light One small red light on side surrounded by several bright white lights","Date Submitted":"10/20/2008 09:15 UTC","Object Flight Path":"Stationary","Latitude":"35.66119","Log Number":"US-10222008-0020","trends":["There have been no other sightings in Greenback","This sighting has never been favorited."],"Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}