{"Object Features":"Other, Unknown","Latitude":"35.05153","Date of the Event":"10/22/2008 06:30 UTC","Summary":"Riding the bus to school, when I looked up and saw this UFO hovering about 100-200 ft above the ground.","Region":"Tennessee","Source":"MUFON","Sighting Duration":"00:01:00","Object Flight Path":"Stationary,Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.05153,+-85.30046(13176)&iwloc=A&hl=en\"> mufon case (13176) map </A>","Log Number":"US-10222008-0022","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around October 22nd 2008","This sighting has never been favorited.",""],"Country":"United States","Weather Factors":"Unknown","City":"Chattanooga","Tags":"City","Date Submitted":"10/22/2008 06:30 UTC","divs":["Sighting DetailsWell, it was a usual morning. I was on the bus to school. I was kind of bored and thinking about space and the universe, etc. Well, I just happened to look up towards a house and some trees. That's when I saw it. When I first spotted it, I thought it was just a low flying plane. Then I noticed it wasn't moving and made no noise (at least no noise audible over the loud bus engine). It had four sides, but was more of a triangular shape. Like a diamond, almost. There were five lights on it, four being bright white lights, one being a bright red. The craft itself was a dark color. The white lights were on the edges. There were 3 at what I assume was the back of the craft, one at the front tip, and the red light was in the center. Well, naturally I locked my eyes on it. It wasn't moving, but the bus evidently was. The bus kept going, though if I could have stopped it I would have. We went down a hill and some trees and houses blocked the object, when we came back up to where it would be visible, it had vanished. It didn't scare me, but made me curious. I've heard reports of people being repeatedly visited by the same craft. Hopefully my new friends come to see me on the way to school again. :) I've attached a quit MS Paint sketch of what the craft looked like."],"files":["/var/www/straped/mufon/html2text/13176.html.txt","/var/www/straped/mufon/org/13176.html"],"Object Shape":"Diamond, Triangle","Case Number":"13176","Longitude":"-85.30046","Disposition":"Unknown","Viewing Distance":"101-500 Feet"}