{"trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around October 22nd 2008"],"Object Flight Path":"Straight-line path","Case Number":"13181","Date of the Event":"10/22/2008 10:43 UTC","Tags":"City","Longitude":"-82.991384","Disposition":"Insufficient Data","Summary":"Witnessed bright ball of light streaking upward into the sky, gaining speed","Source":"MUFON","divs":["Sighting DetailsI was approaching the on ramp to I-270 (the outer-belt around Columbus OH.) I wanted to get onto 270 West Bound, but road crews has shut the west bound on ramp down, and I was forced to take the East Bound on ramp. My intention was to simply get on I-270 east bound, then get off and turn around at the next exit. As I was going around the on-ramp (facing West) I saw a Spherical object with an extremely odd almost white light (I say odd, because the light looked almost like it was reflecting off of itself (Don't know if that makes sense or not) streaming upward at about a 45 degree angle, the object was moving at an incredible rate of speed, and was gaining speed, before I had even gone a 10th of a mile the object sped out of sight. It wasn't leaving any form on contrail behind it, There was a trail of light behind it, however it was not like the light from a jet engine, it was (and no, I am not a whack job) almost like an animated white light like you would have seen in Disneys Sorcerers Apprentice when Mickey cast a spell. There was absolutely no noise made by the object (I smoke and had my drivers side window rolled down and heard nothing) This was almost like looking at a shooting star up close only it wasn't coming down, it was definitely headed upward, and gaining speed at an incredible rate. I didn't note the time or anything when I saw it, but was able to tell what time it occurred because I called my brother on my cell phone as soon as I saw it, and told him about it."],"Viewing Distance":"501 Feet - 1 Mile","City":"Columbus","Date Submitted":"10/22/2008 10:43 UTC","Region":"Ohio","files":["/var/www/straped/mufon/html2text/13181.html.txt","/var/www/straped/mufon/org/13181.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.965646,+-82.991384(13181)&iwloc=A&hl=en\"> mufon case (13181) map </A>","Object Features":"None","Country":"United States","Log Number":"US-10232008-0004","Weather Factors":"None","Latitude":"39.965646","Object Shape":"Sphere"}