{"Latitude":"39.224641","map":"<A HREF = \"http://maps.google.com/maps?q=39.224641,+-121.053401(13186)&iwloc=A&hl=en\"> mufon case (13186) map </A>","Summary":"another sighting of the same type ufo, fiery object, sme path, s-n","Disposition":"IFO","City":"Grass Valley","Tags":"City","files":["/var/www/straped/mufon/html2text/13186.html.txt","/var/www/straped/mufon/org/13186.html"],"Case Number":"13186","Country":"United States","Region":"California","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around October 23rd 2008"],"Date of the Event":"10/23/2008 04:30 UTC","Source":"MUFON","divs":["Sighting DetailsThis is the second time I have seen this exact same object, at the aprx same time of morning 0430 hrs today....and heading in the same direction which is from south to north. I was standing on my front deck and just happened to look up and saw the object for a second or so,lost sight of it quickly, it moves fast and went behind the tree line, I did not have time to find a spot that I could see it again...It is almost rectangular in shape however the back end flares out on each side. wings ?...the object completely is fiery color bright, doesn't change stays the same...and the speed is phenomenal,faster then a jet..it did not change flight pattern just went straight to the North. The object must be huge, from where I was standing on my front deck it was the size of an apricot pit, imagine how big it really is that far up, which is as high as an air liner would fly. The first sighting which I reported to you was on August 28th, 08 at 0400 hrs. Again I was out on my front deck but in a better location when I just happened to look up and saw it... It went in the same direction then too, from the South to the North...in this spot I could see it better and was able to see it's shape."],"Viewing Distance":"Unknown","Date Submitted":"10/23/2008 04:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"Wings","Longitude":"-121.053401","Log Number":"US-10232008-0009","Object Shape":"Other","Weather Factors":"None"}