{"Tags":"City","City":"Groton","Date Submitted":"10/22/2008 12:00 UTC","Date of the Event":"10/22/2008 12:00 UTC","Object Shape":"Flash","Viewing Distance":"Unknown","Latitude":"42.613412","Region":"Massachusetts","Case Number":"13184","Disposition":"IFO","Longitude":"-71.564605","Log Number":"US-10232008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=42.613412,+-71.564605(13184)&iwloc=A&hl=en\"> mufon case (13184) map </A>","Summary":"Multiple UFOs flashing in and out then one larger one flashing bright white green blue.","trends":["There has been one other sighting in Groton","There were no other sightings in Groton on or around October 22nd 2008"],"Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsA few nights ago I noticed an object above the tree line flashing red, green, and bright strobe white color. It hovered for quite some time not moving at all. My father came over and confirmed this as well. Then we say planes and helicopters, and the object was gone. Last night a friend was over and I picked her up in a town over. On the way to my house we noticed these objects all over the place. When we go to my house we went outside to look. I live on a lake. We saw many of these objects flashing in and out. Then one came closer , hovered above the water and gave a light show. The colors were intense. I can only describe it as bright white light, sporadically chanigne green, blue, maybe some orange. It threw off colors, like a sparkler. It was amazing. Neither of us had a camera, but tonight we will try and film it. Neither of us felt fear, we were both really excited. It was like a tingly peacefull feeling. Amazing is all I can say. This one object which gave the light show, did it then dissappeared behind trees, then cam out and did a light show again. Sometimes these would completely dissapear and then re-apper."],"Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13184.html.txt","/var/www/straped/mufon/org/13184.html"]}