{"Viewing Distance":"101-500 Feet","Date of the Event":"07/10/1997 09:00 UTC","Longitude":"-112.627367","Summary":"Surveying streams for Forest Service, co-worker and I witnessed sphere above trees.","Weather Factors":"Unknown","City":"Dillon","Region":"Montana","Sighting Duration":"00:02:00","divs":["Sighting DetailsI , as was my co-worker, were working for the forest service as seasonal fisheries workers. While surveying the headwaters of the east-fork of blacktail creek in the Snowcrest mountians, we both saw a metallic sphere sitting above the trees on a little rise. We were working around an hour and a-half east of Dillon Mt. This area is really remote with large ranches around the actual mountain range. We hardly saw anybody up in the drainage all summer. Anyway, we pulled up to a new area to survey (end of a old ranch track) We got out of the truck and geared up and started to move down the rutted track. we got about 30 ft when we both noticed at the same time a mettalic sphere above the trees in front of us. ( around 20 ft diam) My co-worker, she just went o my god and sat down in the trail. It was noiseless and slightly mirrored looking. I rememberd that I had some binos in the truck, turned around, ran to the truck and by the timeI had the door opened it was gone. Noiselessy. I still wonder about the strange behavior my co-worker displayed. People also talked about black choppers in area.(local bar talk)."],"Tags":"City","Object Features":"None","Source":"MUFON","Object Flight Path":"Stationary","trends":["There have been 3 other sightings in Dillon","There were no other sightings in Dillon on or around July 10th 1997"],"Country":"United States","Latitude":"45.221673","files":["/var/www/straped/mufon/html2text/13193.html.txt","/var/www/straped/mufon/org/13193.html"],"Disposition":"Unknown","Log Number":"US-10232008-0016","map":"<A HREF = \"http://maps.google.com/maps?q=45.221673,+-112.627367(13193)&iwloc=A&hl=en\"> mufon case (13193) map </A>","Object Shape":"Sphere","Date Submitted":"07/10/1997 09:00 UTC","Case Number":"13193"}