{"Date Submitted":"08/13/1994 08:30 UTC","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/13199.html.txt","/var/www/straped/mufon/org/13199.html"],"Object Features":"Unknown","divs":["Sighting DetailsThis is a story of a ufo siting that was documented by hundreds of people and was on the 10:00 news. The military claimed they knew nothing about this and despite what some claimed to be fireworks it wasn't. To begin with if it was fire works the news stations that reported it would have said so. They did not and neither did the military Further more it only lasted a few minutes and made no noise. What we saw clearly was outside Vegas City Limits because you could see the airport and clearly see that this thing was a considerable distance beyond that and floating at equal level to the clouds. Even though it was clear where we we're their we're clouds of in the distance. In my oponion you had two choices once you saw what we saw. You either make up some excuse like what one person did and said it was fireworks or you eventually go crazy. If you can't come up with an explanation and you can't deny that you saw it then it would turn your world up side down. Everything that you we're taught goes completly out the window. You draw two conclusions from this either it came from another solar system or the government isn't telling you the truth that space travel between the stars is very possible and they're doing it at this very moment. What we saw was very real. The friend that I talked this over with was a fellow cab driver. In Vegas it's very hard to get job driving a cab After talking to him we found that we saw the exact same thing how is that possible considering what we saw was impossible. He even saw it from the beginning and I saw it in what I consider the landing mode. It's impossible for me to see things and it's next to impossible for him to see things. We weren't tired or drunk and we're trained observers. This is what I saw. I was pulling into the show boat hotel. Normally I go directly to the Cab Stand but this time I saw a fellow cab driver looking over his cab like something was wrong. So I decided to stop and ask him if everything was all right. He said yes but look at that. I looked where he was pointing and saw nothing. Then my body completly froze. I thought I saw a shooting star but then I immediately said hey wait a minute a shooting star doesnt go directly up wards. What I saw was sparkling crystals in the shape of a star much like a fire works display. They we're about the width of a 747 pair of wings from one end to another. You could see the crystals very clearly even though you we're most likely about 10 miles away. The crystals didn't start from the grown up but started at cloud level. The crystals slowly fizzled away they went straight up for maybe half a mile difficult to judge though from the distance we we're away. When they finally faded an orange ball appeared about the size of a helecopter. From this Orange Ball more crystal lights came out this time they we're bright red. They came straight forward then curved slowly down and when those lights faded another Orange Ball appeared. So now we have two Orange balls about a half mile apart about the size of a helicopter. Then more crystal red light came from the second orange ball and shot straight across forming a perfect triangle. Now you have three orange balls about the size of a helicopter aprox half a mile apart forming what looks like a perfect triangle. Then all of a sudden the lower right ball looked like it was beginning to rotate and it just vanished. What I saw lasted about 2 or 3 minutes the lights that looked like fire works display lasted maybe only seconds. Theiir was absolutely no noise that you could here. If it was fire works display like one person stated where was the noise and why did it last only a short time. When I talked to my fellow cab driver he saw the same thing that I saw to the letter. However he saw the strange lights come down from the stars and that must have looked very strange indeed. He rushed home and reported it to the news and never came back to work. It must have affected him immensely. It didn't start to bother me till I lost my job and had time to think about it. I know that we don't have anything that can display fireworks from a mile of the ground and that can form a what appears to be a perfect triangle. Most likely the reason why no photographs we're taken is because you had to be looking in the right direction at the right time. The flashes of light probably didn't last that long and when the 3 balls appeared they fairly far of and perhaps most didn't see that aspect of it. Also if you did see the lights your body most likely went into a state of shock You wouldn't have had time to get your camera ready. This was documented on the 10:00 news on I believe to be Saturday 13, August 1994. What's your explanation"],"Log Number":"US-10242008-0002","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","trends":["There have been 229 other sightings in Las Vegas","There were 2 other sightings in Las Vegas on or around August 13th 1994"],"City":"Las Vegas","Case Number":"13199","Weather Factors":"Unknown","Summary":"Huge Triangliar Shaped Object hovered for 5 minutes at least 300 yards on each side.","Region":"Nevada","Object Shape":"Triangle","Date of the Event":"08/13/1994 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.120686,+-115.163676(13199)&iwloc=A&hl=en\"> mufon case (13199) map </A>","Latitude":"36.120686","Source":"MUFON","Tags":"City","Longitude":"-115.163676"}