{"Country":"United States","Latitude":"37.348326","files":["/var/www/straped/mufon/html2text/13197.html.txt","/var/www/straped/mufon/org/13197.html"],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Summary":"Bright amber light fly over","Object Flight Path":"Path with directional change","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around September 10th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.348326,+-121.892206(13197)&iwloc=A&hl=en\"> mufon case (13197) map </A>","Case Number":"13197","divs":["Sighting DetailsI was on my backyard porch smoking a cigarette approximately 11:30 PM PST when I noticed a bright amber oval shaped boject in the southern sky heading Northward at approximately 1000 feet above sea level. The light was constant and did not emit it's light into it's path or to far away from itself. It was completely silent. That was the reason I watched it. Because it was silent. I live in the ;anding approach path to San Jose International Airport and I see planes all the time. Every day and I usually only glance at them for a second or two but this night I kept looking because I could not figure out why I felt impelled to watch it. I thought it was strange that it was silent. I then thought maybe it's a helicopter, but where are the flashing lights? There were non. No landing lights or headlights. Just it's own amber light and it made no sound whatever. It approached from South to North at 1000 feet and I watched it do that in a straight line for approximately 20 seconds. It seemed to be going slower than an airplane or a helicopter. When it came to the area of our house it made a slow left hand turn and began heading due West and I was staring directly at it and it then simply dissapeared. Just gone, just like that. I was excited and told my girlfriend to come running but it was gone and she didn't see it. She believes me though. This is the first time I have seen something like this. Nothing in this area moves like that and all the aircraft have landing and directional lights. All of them! Except this thing. Oh, there were no trees in the way of my view and it was a clear night with no clouds at all. There was no reason for it to dissapear. Very strange. Now I watch the sky all the time when I can. I know it was something weird because I( see planes and helicopters over here all the time. Every few minutes one or the other goes by."],"Log Number":"US-10232008-0020","City":"San Jose","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"09/10/2008 11:30 UTC","Date Submitted":"09/10/2008 11:30 UTC","Tags":"City","Object Shape":"Egg, Fireball","Weather Factors":"Unknown","Longitude":"-121.892206","Region":"California","Disposition":"Unknown"}