{"Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Gadsden","There were no other sightings in Gadsden on or around October 23rd 2008"],"divs":["Sighting Detailsthese lights (starting out as 4 and ending up 6) have been moving in figure 8 patterns and coming back together. I called my mother in law in atlanta who was witnessing the same event, as well as my aunt who lives several cities away. I was inside when my father came in to tell me to come look at these wierd lights, which at first i thought was spotlights until i called my mother in law in the next state who was seeing the same thing. this along with there not being anything resembling beams going to it got me really confused as to what i was seeing. 5 minutes into watching this we (my fiance and i) heard what sounded like jets coming and going into no specific direction in the sky. after about 20 minutes it was gone. i have tried calling several other websites where i was met with very rude people telling me that i was giving a prank call. (thanks nuforc, you jerks) there are several helicopters circling around, this is just to weird. i couldn't take pictures or video because all i have is a very cheap cell that takes crappy pictures, sorry. if anyone here at the website needs more info then call the # i left, there are about 8 witnesses. zip codes here are 35904 in gadsden al. and 30342 in atlanta ga"],"Summary":"4 to 6 lights in differing patterns rotating and radiating outwards coming and coming back together","Log Number":"US-10232008-0013","Source":"MUFON","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=34.014264,+-86.006639(13190)&iwloc=A&hl=en\"> mufon case (13190) map </A>","Latitude":"34.014264","Date Submitted":"10/23/2008 07:30 UTC","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/13190.html.txt","/var/www/straped/mufon/org/13190.html"],"Longitude":"-86.006639","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Gadsden","Region":"Alabama","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"10/23/2008 07:30 UTC","Case Number":"13190","Object Shape":"Oval"}