{"trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around October 20th 2008"],"City":"Harrisburg","Object Features":"Unknown","Longitude":"-76.883028","divs":["Sighting DetailsHarrisburg, Pennsylvania. On the morning of October 20, 2008, I took my dog out at 5AM. I immediately noticed a shooting star coming straight down as I walked out of my front door. The sky was clear. The moon was bright. I looked over to my right looking roughly southeast. I noticed a formation of lights. I thought it was a plane at first. It did not move, so I thought it might be a helicopter. However it then changed orientation so that I could clearly see 8 star like lights. There was a center \"star\" surrounded by 5 others. In between the center and the others darted at least two other red \"stars\". This lasted approximately ten minutes. During this time I saw at least two more vertical shooting stars. I became a little concerned and went to wake up my wife to show her this formation. In the 2 or 3 short minutes it took my wife to come out the formation disappeared. Later in the day I was typing a report on this incident on the computer at work. A coworker asked me what I was typing. I told her she could look but don't repeat what she reads. When she read my report she gasped. She said she had seen the exact same thing 8 months before at 5 in the morning (including the vertical shooting stars). Has anyone else seen this before?"],"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.27962,+-76.883028(13209)&iwloc=A&hl=en\"> mufon case (13209) map </A>","Source":"MUFON","Object Shape":"Star-like","Date of the Event":"10/20/2008 05:00 UTC","Log Number":"US-10242008-0012","Country":"United States","Latitude":"40.27962","Tags":"City","files":["/var/www/straped/mufon/html2text/13209.html.txt","/var/www/straped/mufon/org/13209.html"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","Summary":"Formation with a center \"star\" surround by 5 others and two red stars darting between the others","Weather Factors":"Unknown","Date Submitted":"10/20/2008 05:00 UTC","Case Number":"13209","Object Flight Path":"Path then hovering"}