{"Country":"United States","Region":"California","Tags":"City","Case Number":"13203","divs":["sighting detailsblock looking object was caught from the corner of my eye falling from the sky. the object began to arc to the ground terrain, slowing. i began to see the hull wall structure. multiple, staggered plates lined the perimenter of the ship. the plates were stacked 5 plates high. the hull plates were riveted to the ship. the ship slowed further and crossed my view and the sun began to show on its hull-wall. the hull material was a gold\\green\\grey and seemed to be metalic, in sheen. the ship was less than 1 mile away at this time and appeared to change direction and came toward me, slowing still. i began to guage the dimensionms of the ship more scrutinously at this time since i had not attempted to get away from it. the hull plates appeared to be 300 feet wide by 500 feet tall and the angle of the ship i was viewing had about 25 plates on its lowest row. it was still comming. the ship was traveling very slowly at this time; apporoximately, .25 miles per second and about 200 feet off of the ground. by this time, the terminator was stepping into the air and it was begining to come down toward the ground at me. i still could not run from it. when it stopped , it was less than 1000 feet away from me, standing there. its hull wall was a silver grey now in the dusk of the terminator. it stood for what seemed to be a few minutes then jumped off at an accelerative velosity i thought i calculated at 3700 miles in that splitting of a second that i thought i could make a somewhat correct judgement of time and distance. it was appearantly never reported, that i could note, but it had stopped over the san jose airport. i still don't know why there was no report when the ship had been down that long and had actually stopped over an airport. this ship seemed to be more than a mile in diameter; i had calculated it to be on the order of 3 miles in diameter. the attachement is a computer generated rendition of the actual ship. rivets and hull wall structure could not be attempted here. i wish i could have written the program wcich could have assembled it for showing."],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around November 30th 1988","This sighting has never been favorited.",""],"Summary":"Block looking object fell from the sky; Saucer","Disposition":"Hoax","Date Submitted":"11/30/1988 05:39 UTC","Latitude":"37.343996","Date of the Event":"11/30/1988 05:39 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.343996,+-121.890046(13203)&iwloc=A&hl=en\"> mufon case (13203) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-121.890046","City":"San Jose","Log Number":"US-10242008-0006","Object Shape":"Cylinder, Disc, Other","files":["/var/www/straped/mufon/html2text/13203.html.txt","/var/www/straped/mufon/org/13203.html"]}