{"Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile","Region":"California","Object Features":"Unknown","City":"Lawndale","Log Number":"US-10242008-0005","files":["/var/www/straped/mufon/html2text/13202.html.txt","/var/www/straped/mufon/org/13202.html"],"trends":["There have been 2 other sightings in Lawndale","There were no other sightings in Lawndale on or around October 24th 2008"],"Summary":"Stationary object just above mountain range looking east from LAX airport","Latitude":"33.887237","Longitude":"-118.352574","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"10/24/2008 07:15 UTC","Object Flight Path":"Stationary","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsJust before the sun rose from behind the Tustin Foothills, there was an object just to the north of the sun that was not moving (around the Pleasants Peak area). The object appeared to be reflecting the sunlight, which changed in intensity as the sun continued to rise. There were no clouds or aircraft in the area at the time of the observation. The object was not a planet or a star (verified by astronomical data and object did not travel opposite the rotation of the earth) and it was not an aircraft (verified by air traffic control and no contrails visible). The object was white in color (reflection from sun), approximately half an inch in size at about a 20 degree angle from the ground, at an arms length using my thumb nail as a gauge. As the sun continued to rise, the object did not move. At 8 AM, after the sun rose completely, the object could not be seen due to the sun's glare. The object did not appear to be a sattelite due to its position in the sky and the changes in light intensity when the sun was rising (reflection). No photos were taken due to the sun's proximity to the object."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.887237,+-118.352574(13202)&iwloc=A&hl=en\"> mufon case (13202) map </A>","Date Submitted":"10/24/2008 07:15 UTC","Case Number":"13202","Source":"MUFON","Disposition":"Unknown"}