{"map":"<A HREF = \"http://maps.google.com/maps?q=29.433582,+-98.489098(13219)&iwloc=A&hl=en\"> mufon case (13219) map </A>","Log Number":"US-10252008-0003","Object Shape":"Star-like","Object Flight Path":"Stationary,Path with directional change","Object Features":"Unknown","Country":"United States","Date Submitted":"11/30/0002 06:38 UTC","Date of the Event":"11/30/2002 12:00 UTC","Tags":"City","Case Number":"13219","Viewing Distance":"Over One Mile","Region":"Texas","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13219.html.txt","/var/www/straped/mufon/org/13219.html"],"Sighting Duration":"Undisclosed","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around November 30th 2002"],"Summary":"Two bright stationary star-like objects,suddenly dim simultaneously and move away, one after the other","Weather Factors":"Unknown","Longitude":"-98.489098","Disposition":"Unknown","divs":["Sighting DetailsAt 06:30 in the morning central time I went outside to let my dogs out. It was still nighttime. I then notice two bright objects, one slightly brighter than the other one NW of my backyard. They seemed to me to be too near to be stars, but looked just like bright stars, strangely out of place. That's what caught my attention at first. One was slightly lower than the other one also. At first I thought they were stars, they were very still. Suddenly they dimmed to two very small points of light and started to move, in unison, one after the other to the west! I looked at my watch, it was 06:38 AM in dark nightime skies. Sky was absolutely clear. I was flabbergasted once they started dimming. This was not a slow dimming, it was steady and quick. I have seen strange things in the sky before, but nothing that would make me sit down and report it. There was no sound, and the brightest object was as bright as Venus, dimming to almost invisibility. Several things bother me from this sighting. These two objects were not aircraft, were not stars and were not satellites due to their flight characteristics. I'm familiar with civilian and military crafts in my area from San Antonio airport and Lackland AB. These objects looked like stars with no navigation lights. They sat motionless in the night sky, dimmed and started moving away at a fairly fast speed. I was torn between grabbing my 7x35 binoculars and staying back watching the objects, but did not go into the house in fear I would loose the objects since they dimmed. They went over my house's roof and became undetectable in the sky."],"Latitude":"29.433582","City":"San Antonio"}