{"Longitude":"-85.178024","Summary":"High Altitude elliptical object seen in Battle Cre","trends":["There have been 15 other sightings in Battle Creek","There were no other sightings in Battle Creek on or around August 14th 2001"],"Region":"Michigan","Log Number":"","Date Submitted":"08/14/2001 03:08 UTC","Object Features":"Undisclosed","Object Flight Path":"Unknown","Tags":"City","divs":["Sighting Details\"Here is my observation, taken directly from my notes made at the time of theobservation. 08-14-01 1508 EDST Observed a bright elliptical object travellingin a N.E. to S.W. direction above the upper level clouds at a high rate ofspeed. Elevation from my viewpoint was about 60 degrees above the horizon(almost directly overhead) thru 40 degrees. At the 40 degree elevation theobject came to a dead stop and then turned due South and accelerated out ofsight. Total timed movement of the object thru about 20 degrees was about 3seconds, however, I didnt time the course change of the object and can onlyestimate about 2 seconds before losing visual contact. NOTE: No contrail orglow was observed. A commercial twin engined jet West bound just moments beforemy observation gave me a relative comparison to the objects size, that beingslightly smaller than the aircraft. Location of observation: Approximately 4miles west of the city of Battle Creek, on M89 near 1 mile road. Estimatedaltitude: About 35,000 to 45,000 feet (higher than the commercial jet). That isall I have from my notes. Not sure if object was a meteor or falling debris. Just struck me as curious that there was no characteristic trail like a meteorwould have.\""],"Weather Factors":"Unknown","Object Shape":"Oval","Date of the Event":"08/14/2001 03:08 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/1321.html.txt","/var/www/straped/mufon/org/1321.html"],"Latitude":"42.330292","Viewing Distance":"Over One Mile","Case Number":"1321","City":"Battle Creek","map":"<A HREF = \"http://maps.google.com/maps?q=42.330292,+-85.178024(1321)&iwloc=A&hl=en\"> mufon case (1321) map </A>","Sighting Duration":"00:00:59","Disposition":"Unresolved","Country":"United States"}