{"Object Features":"Unknown","Date of the Event":"10/01/2008 10:15 UTC","Sighting Duration":"Undisclosed","Summary":"Three bright orange lights.","Log Number":"AU-10252008-0002","Object Shape":"Star-like, Other","Viewing Distance":"Unknown","Longitude":"-84.446306","Disposition":"Unresolved","trends":["There have been 5 other sightings in Fort Thomas","There were no other sightings in Fort Thomas on or around October 1st 2008"],"files":["/var/www/straped/mufon/html2text/13218.html.txt","/var/www/straped/mufon/org/13218.html"],"Weather Factors":"None","Source":"MUFON","Latitude":"39.067454","Case Number":"13218","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=39.067454,+-84.446306(13218)&iwloc=A&hl=en\"> mufon case (13218) map </A>","City":"Fort Thomas","Tags":"City","divs":["Sighting DetailsI had just finished my shift as a chef at a Pt Douglas restaurant called Gone Bananas.. no joke.. anyway, I am prone to looking skywards for the weather, as i walked outside i looked upwards to the north a bit, basically directly over Island Point, I saw two bright orange lights in the sky, i never really took much notice of lights in the sky round here because the Cairns international airport is only about 50 Km from here as the crow flies, but these were different, they weren't moving or altering. Because I thought this was a bit odd, I went back into the restaurant and got the owner, to come and look too, he thought it was a joke at first but i convinced him to come outside and check it out, two of the waitresses also came and looked. So, these two lights were still in the same basic location the were in before i went inside (3-4 minutes)and as we all stood and watched another 3rd light appeared from behind a cloud to the east a little and moved in an irregular line towards the other two lights. which then also began to move slowly into a rough triangle formation and then they slowly seemed to just all go out together. My Boss tried to take some photo's on his phone, but they didn't come out. I was not going to rreport this sighting, but, just tonight myself and another person witnessed another strange occurence just forty km from the last one. I have told some of the locals and fishermen about this, they have their own stories, and so do the local indigenous people. I have to say I was sceptical about this subject.. till now even after years of spending nights outdoors both recreationally, sleeping under the stars and during a 15 year security career... I HAVE NEVER SEEN ANYTHING LIKE THIS! Just 3 yrs ago I remember laying in bed looking out my bedroom window at Wonga Beach, to the Dagmar Range to the west and wondering why, over an uninhabited, jungle covered mountain range, and under a clear sky, flashes of light were eminating like distant lightning from the tops of the mountains lighting up the night humidity."],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Date Submitted":"10/01/2008 10:15 UTC"}