{"Sighting Duration":"00:04:15","Date Submitted":"10/23/2008 06:44 UTC","Log Number":"US-10242008-0018","Summary":"Second Sighting","City":"Waco","map":"<A HREF = \"http://maps.google.com/maps?q=31.552753,+-97.14522(13215)&iwloc=A&hl=en\"> mufon case (13215) map </A>","files":["/var/www/straped/mufon/html2text/13215.html.txt","/var/www/straped/mufon/org/13215.html"],"Case Number":"13215","Latitude":"31.552753","Object Shape":"Saturn-like","Source":"MUFON","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around October 23rd 2008"],"Country":"United States","Tags":"City","Viewing Distance":"Unknown","Longitude":"-97.14522","Region":"Texas","Date of the Event":"10/23/2008 06:44 UTC","Object Flight Path":"Straight-line path,Path then hovering","Disposition":"Hoax","divs":["Sighting DetailsAgain, I was out on my morning pray'r walk, 6 30a.m.. The weather was cool, the morning sky clear. Dawn was beginning to come forth in the east, lightly. Orion, Sirius, the brighter stars were still dominant in the sky especially to the west. I was coming down off a mid-sized knoll, there is a depression before the land rolls back up toward a spring fed lake. The bowl forms a natural large canvass for the sky. It was about 6 44. I look'd up and saw a \"Saturn-like\" orb, moving from the N-West to the N-East. It was matte but shining, no twinkle and no flashing light of any sort. It look'd like Saturn had dropp'd down out the high heaven and was roaming in the lower atmosphere. Again, it had a sense of the ability to stop, sort of wobbling, as if to stop in mid-air and hover. It did not but it appear'd to desire a hesitation. I stood there closely watching it, because it looked just like the orb I had seen wandering across the night sky earlier this year--I believe in September. I look'd hard trying to understand what I was seeing. In my knowledge of airplanes and things in the sky, it defy'd an explanation. I thought that it look'd like the same thing I saw and reported in September. I could tell it was not an airplane, there were no sort of blinking light to it, it made no sound. It appear'd as if the object itself were light--and not just possessing lights. I watch'd it until it moved into the N-west sky and as I walk'd the tree line obstructed the orb."],"Weather Factors":"Unknown","Object Features":"Unknown"}