{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=-16.460787,+145.373458(13217)&iwloc=A&hl=en\"> mufon case (13217) map </A>","Object Shape":"Star-like","Date of the Event":"10/25/2008 12:00 UTC","Region":"Queensland","divs":["Sighting DetailsWas about to go hunting, on foot, in the rainforest between canefeilds near Miallo in north Queensland, while I was standing outside inhaling a cigarette I looked at the sky behind Black Mountain to the west to check the weather. It was then that I noticed an unusually large and bright star, because I hadnh't noticed this before i called Netka outside to have a look too, while we both stood and watched the \"star\" began to get brighter, then suddenly dimmed and went out, then, suddenly came back on... this happenned a couple of times, when the light appeared to go out, there was a glow on the mountain top below where it was seen.. also during this happening, while the light was flashing intermittently there where what looked like little shooting stars darting across the sky from different points, directly towards this flashing star. After about ten minutes of this some clouds covered the top of the mountain, when the clouds cleared, the light was gone alltogether the object made no obvious movements. Neither of us had ever seen anything like this light in the place this happened, it was no star, or planet or aircraft, the light was bright white and had no other navagation lights etc.. The mountain and the range surrounding it are part of the Daintree River World Heritage Listing, it's almost impenetrable jungle and there are no people living up there and access is restricted under Native Title Legislation making it exclusive use for the Traditional Owners. This happenned just moments ago."],"Source":"MUFON","Log Number":"AU-10252008-0001","Viewing Distance":"Over One Mile","City":"Mossman","Object Flight Path":"Stationary,Straight-line path","Latitude":"-16.460787","Date Submitted":"10/25/2008 12:00 UTC","Summary":"Unusually bright star, not seen before.","Disposition":"Unresolved","trends":["There have been no other sightings in Mossman","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/13217.html.txt","/var/www/straped/mufon/org/13217.html"],"Tags":"City","Weather Factors":"Unknown","Case Number":"13217","Longitude":"145.373458","Country":"Australia","Object Features":"Unknown"}