{"Date Submitted":"10/20/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/13224.html.txt","/var/www/straped/mufon/org/13224.html"],"Date of the Event":"10/20/2008 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Circle, Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=37.2735,+-79.939517(13224)&iwloc=A&hl=en\"> mufon case (13224) map </A>","Object Flight Path":"Stationary","Tags":"City","Longitude":"-79.939517","Sighting Duration":"Undisclosed","Disposition":"IFO","Log Number":"US-10252008-0008","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around October 20th 2008"],"divs":["Sighting DetailsHello, I was closing the blinds to the back of my home in the evening and noticed a very bright star outside. Did not pay much attention to it until it moved. I then ran outside to get a better view of it. The bright star looking object would move but would stay positioned in the sky like a star for a long period of time. Then suddenly it would move again. Similiar to like a bee moves in the sky or a hummingbird. Right to left in small almost unnoticable movements. Then from time to time it will move up and down. The object or (UFO) is about 30 - 50miles from my home. Usually I stop watching it when clouds come in and cover it or it goes behind a tree. I had seen it outside 3 days in a row. And the last two days it has been raining and cloudy. However, this evening the sky was clear again and it is out there again. I notified the local news channel asking them to check it out, of course they don't believe me. They said it was the planet VENUS! How ridiculous!! I managed this evening to get my video camera out. And got some good footage of it. It is incredible when I would zoom in on the Ufo, it had definition and would change yellow and red and orange and then would get small then expand. The object is West of where I live. I live off of 29, about 2 miles from the Lynchburg Airport. There is a lake in the back of my yard and an open view of the sky west of where I live. And that is where the UFO is at. Hopefully, if you get this message in time, it would be great to get some good camera's out here to see the UFO closer. For some reason it seems like it is just staying in the same spot. Unsure how much longer it will stay where it is. But seems to be coming out about 7 pm or so, right when it starts to get dark. And then I can't see it after about 8 - 8:30pm or so."],"Summary":"Appears to look like a bright star in the sky. Stays in one place for long period of time.","Case Number":"13224","Region":"Virginia","Country":"United States","Viewing Distance":"Over One Mile","City":"Roanoke","Latitude":"37.2735","Source":"MUFON","Object Features":"Window(s), Other"}