{"Latitude":"31.974639","Summary":"UFO seen in the night sky","files":["/var/www/straped/mufon/html2text/13223.html.txt","/var/www/straped/mufon/org/13223.html"],"Log Number":"US-10252008-0007","Region":"Texas","Weather Factors":"Unknown","Source":"MUFON","trends":[],"Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.974639,+-99.894033(13223)&iwloc=A&hl=en\"> mufon case (13223) map </A>","divs":["Sighting DetailsWell it was around 11pm on October 9, 2008. I went outside to smoke a cigarette, I was alone by the way. After I was almost done I looked up, cause I always looked up at the sky, and I see something out of the corner of my eye, so I looked in that direction, I immediately knew it was a UFO, as it was not too far up in the sky, matter of fact, it was close enough to where I can see its outline, it was a narrow triangle, with 3 huge round lights, 1 in the front, 2 in the rear, and to the UFO's right side was a small round white sphere trailing it precisely side by side, at that moment I could not believe what I was seeing, I was standing between 2 apartment buildings just in complete awe,I was wishing I had a camera phone or just a camera on me but I did not, and I wasnt going to run inside and look for 1 and miss the UFO when I came back out, and I wasnt about to follow it as I didnt want to be abducted lol, so it passed by out of my sight and I just went back inside, my mind was going crazy, didnt know what to think :(, anyways, we have a naval base nearby and I wanted to call them to let them know a UFO was headed in that direction, I couldnt find their contact numbers, so I called my stepfather who is a pilot and tried to see if he could call someone there for me, he didnt believe me and said \"sometimes there's things in the sky that play tricks on our eyes\" I was like man, im not retarded, I know for a fact of what I witnessed. It was such a clear sighting that I was scared. I've been into UFOs for a very long time, Im a 28 year old male and have been waiting for the day when I would see my 1st UFO, but I wanted to see one from a distance, and not so close, I was scared and confused. I can DEFINITELY say we are not alone folks....."],"Case Number":"13223","Sighting Duration":"00:01:00","Date of the Event":"10/09/2008 11:01 UTC","Country":"United States","Object Shape":"Triangle","Date Submitted":"10/09/2008 11:01 UTC","Longitude":"-99.894033","Disposition":"Unknown","Object Features":"Undisclosed","City":"Undisclosed","Object Flight Path":"Straight-line path"}