{"Tags":"City","Object Shape":"Flash, Unknown","trends":["There has been one other sighting in Ashland","There were no other sightings in Ashland on or around October 26th 2008"],"Longitude":"-71.463889","Date Submitted":"10/26/2008 02:28 UTC","Summary":"Strange event, Unknown light source and humming","Date of the Event":"10/26/2008 02:28 UTC","divs":["Sighting Details I was up all night playing video games. I heard sensed or felt something, I live on a state highway and the street lights went out. At first it felt like a blackout but my house still had power. I looked toward the back windows and the entire backyard was as bright as day with some sort of green light. The light lasted maybe 60-90 seconds and could be seen through windows on all three side of the room. The light then went off like a switch. I was curious as to what happened so I went outside and looked in the forth directgion towards a hill up the road. Then the light came back on I could see a glowing white light on the other side of the hill I jumped onto the hood of the car in my driveway. I could hear at this point a humming noise I had the sense that something was happening on the other side of the hill. I ran back inside and grabbed a phone incase it was an accident or something. When I got back inside the light was back I ran toward the road and started to head up the hill I stopped because I saw headlights coming. Im waiting for him to stop at an accident. He kept coming so I wanted to see if it was a squad car or a citizen that might tell me to call 911. The car as moving at what seemed like the posted speed limit of 35mph. I looked at it as it passed me it was dark with dark tinted windows. I saw it hit the brakes and turn around. For some reason I decided to go inside and watched the car pass at the same speed back up the hill. I never saw any first responder reds or blues on the other side of the hill but a squad car did pass my house some miniuets later with silent blues coasting at maybe 45mph down the hill and into the distance towards the town line. At some point what looked like a long wells fargo truck and a dark SUV passed by in a 2 car convoy. When I thought about it later I became convinced there was no accident. I never saw any response from law enforcement that would suggest this. It looked to me like they were looking for soemthing or quitely performing some task. The green light I describe was like nothing I have ever seen. My mother the next morning said she awoke to the humming and the light on the forth and rear side of the home. I was outside in this light and it seemed to come out of dark matter or space itself. There was also a bright white light diagonally across the road near the doorstep of a neigbhbors house at one point. This light could easily have been a flashlight inside the home although I never saw it moove. This event cannot be explained at this point by any man made source I know of. My mother remains convinced that something unhearthly occured around 230am lastnight near her home. There was never any thunder lightning or high winds witnessed durring the even."],"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"42.261111","City":"Ashland","Object Flight Path":"Other","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13239.html.txt","/var/www/straped/mufon/org/13239.html"],"Country":"United States","Weather Factors":"Unknown","Case Number":"13239","Log Number":"US-10262008-0012","Disposition":"IFO","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.261111,+-71.463889(13239)&iwloc=A&hl=en\"> mufon case (13239) map </A>","Region":"Massachusetts"}