{"trends":["There have been 10 other sightings in Vacaville","There were no other sightings in Vacaville on or around October 24th 2008"],"Tags":"City","Disposition":"IFO","Source":"MUFON","City":"Vacaville","Log Number":"US-10262008-0005","Region":"California","Object Flight Path":"Stationary,Straight-line path,Path with directional change","divs":["Sighting DetailsI was out late letting my dog do her business while we stayed at the Extended stay Hotel we were at in Vacaville. My phone said the time was exactly 2:30 a.m. I looked up to the south towards Fairfield and noticed a rather large light. It was bigger than a planet so I assumed it was the headlight of an airplane far off. It looked stationary so I assumed if was a decent ways away. It was almost exactly one hand length from the top of a 2 story building from the horizon. I direguareded the light and turned west to watch one of the large planes that frequnts the Travis airforce base make its lazy turn while decending. I watched this for roughly 45 seconds to 1 minute. I then turned back to the south to look at the light again and it was not there. I scanned for a bit and found it flying towards my direction still from the south but at a 45 degree angle in the sky. It was moving at a normal pace for a plane so I just figured that I didn't notice how far it really had been from me. I had only looked at it for about 30 seconds and returned to watching my dog. I looked up after a few seconds and the object had already passed over head. It was now 1 hand length from directly above me to the north. I continued to watch it travel North. It still traveled at the same speed it had appeared the first time I noticed it move. AS I watched it , I realized that it was not loosing any brightness at all. If it was a plane I should have seen it dim or have not seen the headlight but the green and red back lights, but there never was any sign of green or red. It stayed white. It then jumped west from its position nearly a full hand length instantaniously and began traveling North eastern in the direction of Sacramento. It continued to stay the same brightness untill it was lost near the horizon in the city haze. I looked at me phone and it said 2:34:52."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13232.html.txt","/var/www/straped/mufon/org/13232.html"],"Longitude":"-121.981094","Case Number":"13232","Object Features":"None","Country":"United States","Summary":"strange bright white(think plane headlight) object advances accross sky making immpossible jumps","Latitude":"38.362297","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Weather Factors":"Unknown","Date Submitted":"10/24/2008 02:30 UTC","Date of the Event":"10/24/2008 02:30 UTC","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=38.362297,+-121.981094(13232)&iwloc=A&hl=en\"> mufon case (13232) map </A>"}