{"Date of the Event":"10/23/2008 12:00 UTC","Log Number":"US-10262008-0003","Country":"United States","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsThese objects appeared on film but didn't see them when photos were being shot. This was a clear night and there was no smoke or fog, however, the photos tell a different story on file 3 attached. If you look in the upper left hand corner you will see what apears to be a gray alien head with 2 black eyes and to the right of the alien appears to be a girl with long hair kissing the alien or whispering in his ear. I'm a lifetime experiencer and my description of file 3 might sound somewhat silly so you can take what you want and throw out what you don't, but there are some amazing stories relating to these images and the area I live. One of the buildings on my property was scorched by a ufo in 1981. I thought at the time that it was a crashed plane because it appeared that the whole back of the mountain was on fire because these lights were so bright the woods outside were lit up like daylight. My room was brightly lit as well. Things were being thrown all over the room and clothing dressers being slid from one side of the room to the other and turning upside down. The bed had been tossed where I was sleeping and it was like I was surrounded by a huge fire and my flesh felt like it was going to melt. These huge orange lights forming waves came out of this massive light and directly up to where I was standing to my window then formed an X at my window and when these X shaped lights locked together I was thrown across my bedroom before they shot off into the night sky and vanished."],"City":"Boone","Disposition":"Hoax","Case Number":"13230","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 11 other sightings in Boone","There was one other sighting in Boone on or around October 23rd 2008","This sighting has never been favorited.",""],"Source":"MUFON","Latitude":"36.221315","map":"<A HREF = \"http://maps.google.com/maps?q=36.221315,+-81.673362(13230)&iwloc=A&hl=en\"> mufon case (13230) map </A>","Region":"North Carolina","Viewing Distance":"Unknown","Summary":"Taking pics on a clear night for fun . This is a hot spot for ufos.","Longitude":"-81.673362","files":["/var/www/straped/mufon/html2text/13230.html.txt","/var/www/straped/mufon/more/13230_submitter_file1__cool.jpg","/var/www/straped/mufon/more/13230_submitter_file2__farout.jpg","/var/www/straped/mufon/more/13230_submitter_file3__035(2).JPG","/var/www/straped/mufon/org/13230.html"],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/23/2008 12:00 UTC"}