{"Region":"California","Date Submitted":"10/25/2008 07:40 UTC","trends":["There have been 8 other sightings in Davis","There were no other sightings in Davis on or around October 25th 2008"],"Viewing Distance":"Unknown","Tags":"City","Country":"United States","Latitude":"38.548336","Case Number":"13231","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Shape":"Fireball","Object Features":"Undisclosed","Date of the Event":"10/25/2008 07:40 UTC","Log Number":"US-10262008-0004","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=38.548336,+-121.731267(13231)&iwloc=A&hl=en\"> mufon case (13231) map </A>","files":["/var/www/straped/mufon/html2text/13231.html.txt","/var/www/straped/mufon/org/13231.html"],"divs":["Sighting DetailsMy teenage son and I were driving west on I-80 freeway from Sacramento towards Davis when at first I thought I saw a falling star.. it was a very bright ball of light with a comet-like tail of sparks coming from above at an angle like it was a falling star. Then the sparks quit and the ball of light got brighter and then after about 6 seconds it disappeared. I thought it was an amazing falling star like I had never seen. Then my son noticed another orange glowing light lower in the sky. The light kept getting brighter and was kind of pulsing. then a second light appeared beside it that was pulsing as well they danced around a bit moving slowly lower and lower toward the ground. Then there was a third light dancing around with it and then as they got lower to the ground one light went out and then the second and then the third. We exited the freeway and pulled over, but there were no other lights in the sky other than a few airplane lights we could see and stars. I would imagine that anyone driving the same direction that we were had to have seen this strange show of lights. There was just no explanation for it. I came home and immediately started searching the internet for sightings and have not been able to find any yet. I did find a video on youtube from Oct. 14, 2008 sighting that looks exactly like what we saw."],"Weather Factors":"Unknown","Longitude":"-121.731267","City":"Davis","Summary":"bright orange light with a comet like tail hovering then disappearing"}