{"Date of the Event":"01/01/1970 12:00 UTC","Object Features":"Undisclosed","Log Number":"US-10262008-0006","Longitude":"-91.095647","trends":["There have been 5 other sightings in Black Rock","There were no other sightings in Black Rock on or around January 1st 1970"],"Object Shape":"Disc","Latitude":"36.113363","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13233.html.txt","/var/www/straped/mufon/org/13233.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.113363,+-91.095647(13233)&iwloc=A&hl=en\"> mufon case (13233) map </A>","Object Flight Path":"Undisclosed","Summary":"Three Concentric","Date Submitted":"01/01/1970 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsEvery time I have visited my uncle on his northeast Arkansas dairy farm I ask if the \"rings\" are stil apparent. It's been about 35 years (aprox.) since this incident happened. I remember him describing this event happening on a summer night. He remembers being woke up from dogs freaking out. He walked out to his back yard where he remembers hearing a noise resembling that of an electrical \"hum'. He relates, \"didn't think to much of it\". Got his dogs to settle down but said they seemed to be very agitated. (Austrailian Heelers). The next day he walked down to a pasture that he thought the commotion may have been generated from. This is when he noticed three concentric circles or \"bands\" of dark grass in the pasture. The bands were aproximately thirty feet in diameter. The bands appeared to be possibly one to two feet wide. What makes this unique is the fact these bands were created in a pasture of tall grass and the bands are a darker color than the surronding grass. The true uniqueness of this event is the fact that after 35 years these bands are still apparent! I've seen these rings,or bands, everytime I've visited my uncle over the years and they are still very obvious. I have also been a witness to the orange orb type of UFO seen in the skies over Rockford, IL. I am a Professional Pilot(ATP) with an Aircraft and Powerplant Mechanics license. I have been flying for 35 years. Have witnessed many different types of aircraft in flight. (Fighters with glow of afterburner to satellites in orbit)."],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Country":"United States","Case Number":"13233","Region":"Arkansas","Weather Factors":"Unknown","City":"Black Rock"}