{"Object Features":"Dome, Window(s)","Case Number":"13240","Date Submitted":"05/30/1956 01:05 UTC","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around May 30th 1956"],"Tags":"City","Country":"United States","City":"Birmingham","map":"<A HREF = \"http://maps.google.com/maps?q=33.525651,+-86.79718(13240)&iwloc=A&hl=en\"> mufon case (13240) map </A>","Object Flight Path":"Path then hovering","Longitude":"-86.79718","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Classic round shape, domed top UFO over Birmingham, Al. in the mid 1950s","files":["/var/www/straped/mufon/html2text/13240.html.txt","/var/www/straped/mufon/org/13240.html"],"Viewing Distance":"21-100 Feet","Source":"MUFON","Latitude":"33.525651","Disposition":"Unknown","Region":"Alabama","Date of the Event":"05/30/1956 01:05 UTC","Log Number":"US-10262008-0013","Object Shape":"Disc","divs":["Sighting DetailsI was standing in my front yard discussing whose turn it was to ride the bike with my younger sister, when a bright light flashed in my eyes. I turned slightly to my left to see where the flash came from, and to my absolute horror, a UFO descended from some clouds not a mile from my home. I was frozen in fear, and I said \"But mother said that they do not exist, they are just in the movies\" to my sister, who turned to see what I was talking about. We both stood frozen as the UFO descended from the clouds, leveled out and headed in our direction. It slowly moved along the length of our street, coming to a halt directly over the house across the street from where we were standing. The UFO was perhaps 10-20 feet above the house. The UFO was perhaps 30-40 feet from edge to edge. I do not remember seeing windows, but I remember thinking that they were watching us because of windows. I was afraid that \"they\" were going to kill us because we knew that they really did exist. We stood frozen looking at it for what seemed to us forever, but was more likely only a minute or two, then the UFO tipped up on edge, and just disappeared up into the sky. My sister and I ran into the house, screaming, and when our mother came running, my sister fainted. I was crying and shaking, telling mother that we saw a UFO, that the aliens knew that we saw them because it stopped and \"looked\" at us. Mother said to call the police, and when the operator answered, she said that they had received over 350 calls reporting a flying saucer. I remember my father bringing home the paper the next day, and there was an article on the bottom of the front page about the UFO. I so wish that I had kept that newspaper!"]}