{"Case Number":"13241","Date of the Event":"08/24/1958 10:00 UTC","Region":"North Carolina","Source":"MUFON","Object Features":"Other","divs":["Sighting DetailsIt was in the late 1950s when I was around 7 years old. My brother and I were lying on the front steps at our grandparents farmhouse watching the sky. He was around 14 years old. I was too young to work hard on the farm but he spent the day working in the tobacco field and was tired. He fell asleep as I was still looking at the billions of stars above that night. Looking eastward, the horizon was lit with a thin line of light shining from the town of Wilson. It was around 10PM. Suddenly a glow rose above the horizon and proceeded to come toward the farm. I quickly noticed that the glow was 3 balls of fire moving at a high rate of speed at about a thousand feet above the ground. There was no noise coming from them. The ball in the middle was twice as large at the two others on each side of the middle one. In a moment of maybe 6 to 10 seconds it moved from the horizon and went straight overhead and into the opposite horizon. I was so excited that I tried to scream to my brother but nothing would come out. I shook him awake and gained my voice and told him of the incident. For several minutes we watched hoping it would come around again. We had thought that maybe it was going around the world! After maybe 15-20 minutes he fell asleep again and I continued watching the sky. As God is my witness it happened again! And again I was too excited to voice myself right away. All I could do was shake my brother and tell him again. I really don't quite remember what happened after that except that we eventually went to bed. The fireballs never came back again. The reason that I'm reporting this now is that awhile back I was watching a UFO show on TV and one of the reports was of three fireballs going over Russia in the late 1950s! I can't help but think that I saw those very same fireballs on my side of the earth. So I'm writing to try to find some possible confirmation about this. Could you tell me if you have any reports of something of this type around this timeframe? Thank you, Phillip Batchelor"],"trends":["There have been 2 other sightings in Wilson","There were no other sightings in Wilson on or around August 24th 1958"],"Country":"United States","Object Flight Path":"Straight-line path","Latitude":"35.727039","Tags":"City","Weather Factors":"None","City":"Wilson","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.727039,+-77.91079(13241)&iwloc=A&hl=en\"> mufon case (13241) map </A>","Disposition":"Insufficient Data","Longitude":"-77.91079","files":["/var/www/straped/mufon/html2text/13241.html.txt","/var/www/straped/mufon/org/13241.html"],"Object Shape":"Fireball","Date Submitted":"08/24/1958 10:00 UTC","Sighting Duration":"Undisclosed","Summary":"3 fireballs moving across night sky","Log Number":"US-10262008-0014"}