{"Log Number":"US-10272008-0005","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around October 26th 2008","This sighting has never been favorited.",""],"Object Shape":"Boomerang, Chevron, Triangle","Date of the Event":"10/26/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/13247.html.txt","/var/www/straped/mufon/more/13247_submitter_file1__strangelightconfiqurationtriangleshapegreenlightontheleftoldmillroadchesapeake930pmslownotaplanenosound.jpg","/var/www/straped/mufon/org/13247.html"],"Object Features":"Wings","Source":"MUFON","Case Number":"13247","Latitude":"36.858869","Viewing Distance":"101-500 Feet","Object Flight Path":"Hovering then path","Tags":"City","City":"Norfolk","Summary":"UFO over Dismal Swamp VA","Region":"Virginia","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Country":"United States","divs":["Sighting DetailsI was alone on my way home from Chesapeake to Portsmouth VA, Friday Oct 24, about 9:30 PM. I was driving my usual route on the edge of the Dismal Swamp. My favorite route, Old Mill Rd, is a lonely dark curvy road, with no traffic lights. The sky was a beautiful dark blue. I think the moon was full. The sky was patched with large fluffy white clouds. It's close to deer mating season, and deer run across the road, so my eyes were closely following on the road. Above a clump of Cyprus and Oak trees, I noticed what I thought was an oddly moving jet airliner. I say odd because it moved much slower than a helicopter and emitted no sound. It was also to low to be an airliner. It wasn't a blimp either. The aircraft displayed about 7 large lights on each side of the chevron or triangular shaped craft with a green light on my left as I looked up. As I stated before, the sky was bright, but it was night.I was not afraid, but curious. The craft soon flew over trees that obscured my view. The last time I saw something strange like this I was around 12, 1973. My brother told me to wait while he went in the house to get Daddy. Heck, no! I went with him, when Daddy came out it was gone. It was shaped like a shallow bowl on top of a saucer. The aircraft had many windows and lights all around and red lights on top. We saw this aircraft two more times the summer 1974 with my eldest brother and a neighborhood kid. I live 20 miles from Norfolk Naval, Oceana Air Naval and Langley Air Force Base. I have lived within the proximity of naval and air force bases all around me all my life. I have seen plenty of planes, jets, helicopters, Stealth Fighters and jets that take off straight up from a aircraft carrier, but I have never seen something like this and what we saw when I was 12."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.858869,+-76.284873(13247)&iwloc=A&hl=en\"> mufon case (13247) map </A>","Weather Factors":"Unknown","Date Submitted":"10/26/2008 09:30 UTC","Longitude":"-76.284873"}