{"Tags":"City","Region":"Tennessee","Object Shape":"Other","Latitude":"36.1679","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Case Number":"13245","Log Number":"US-10272008-0003","files":["/var/www/straped/mufon/html2text/13245.html.txt","/var/www/straped/mufon/org/13245.html"],"Object Features":"Unknown","Country":"United States","Longitude":"-86.784443","Date Submitted":"10/25/2008 11:10 UTC","divs":["Sighting DetailsI live on the western limits of Nashville proper. Friday, October 24th 2008,shortly after dark as I was sitting on my balcony I began to see strange lights strobe in the western sky. The strobe was not continuous, but just a single flash of light here and there, much like a camera flash. I became very curious and decided to sky watch that night till after midnight. I saw a half dozen events that night where a single white light appeared at high altitude, then slowly traversed a hands-width distance (est.) before fading out. The next night(Saturday, Oct. 25th) I decided to sky watch again, being intrigued by these events. Shortly after dark I began to see the same events unfold again. Only this time, the strobe flashes was pretty much all I saw till a few minutes after eleven. At that time, I was looking to the western sky along the I-40 corridor when suddenly a luminous object was descending about a half mile from me. Initially, I can only describe it as a vertically destorted glow worm. The object was silent, and appeared to be veiled in a thin cloud of vapor as it moved. I called out to my wife to come and look. As she stepped out it was maybe 100 yards from us, and at an elevation of maybe 400 feet. At that point the object had leveled horizontally into a cresent shape and was moving easterly into the Belleview community at 20-25 mph. Within a minute the object had moved silently out of sight. The object appearance was a soft luminous glow. The sky was clear, the temperature was upper 40's, there was no wind at all this night, and we both witnessed this reality that defies our logic, and has challenged every sense of reasoning."],"Date of the Event":"10/25/2008 11:10 UTC","Sighting Duration":"00:01:00","Object Flight Path":"Straight-line path","Summary":"125' -150' long - crescent shaped string of (25 to 30) 6' luminous irregular shaped spheres.","City":"Nashville","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.1679,+-86.784443(13245)&iwloc=A&hl=en\"> mufon case (13245) map </A>","trends":["There have been 72 other sightings in Nashville","There was one other sighting in Nashville on or around October 25th 2008"]}