{"Region":"Texas","Source":"MUFON","Object Features":"Unknown","Date Submitted":"11/30/1994 12:00 UTC","Summary":"8 small orange lights in a circular shape with 1 large orange light in center","Sighting Duration":"Undisclosed","Log Number":"US-10272008-0004","Tags":"City","Disposition":"Unknown","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=30.1316,+-94.015454(13246)&iwloc=A&hl=en\"> mufon case (13246) map </A>","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Vidor","There were no other sightings in Vidor on or around November 30th 1994"],"City":"Vidor","Date of the Event":"11/30/1994 12:00 UTC","Longitude":"-94.015454","divs":["Sighting DetailsFirst off, this event happened to me many years ago when I was just a little kid living in Vidor, TX. I now live in Orange, TX. I know that this story will probably not do you guys any good, but I feel like I need to finally tell it. Up to this point, I have only told my fiancee of this event. It was a nice summer night and the skies were clear. I use to live in a house that my parents built with a nice 5 to 7 acre lake behind it, secluded from town. I was six years old at the time, I am now currently 19, soon to be 20. I remember exactly what happened on that night. My parents were inside the house along with my older brother. I was in the backyard playing fetch with my black lab, named Tucker. Growing up, Tucker was my best friend. I remember throwing the ball and racing Tucker to see who could get to it first. Of course he did, so we started wrestling for it. At that time he stopping playing and let out a soft whimper. I thought I had acciently hurt him. As I was asking him if he was okay, I noticed that he was looking up into the night sky. I then turned my head and looked up and saw the aircraft that I knew, even at that age, was NOT an airplane or jet. From where I was there were 8 orange lights, apart from each other, making a circular chape. In the middle was one large orange circular light. Thinking back on it, the large light was the size of a football field, and the smaller one's were 50 yards wide. All of the light would be bright for a second, then the next second, they would be dim. It was stationary just for a brief moment, then all of the sudden it started zooming through the air with no sound at all. It traveled one direction for about 2 or 3 seconds, then disappeared. I was so scared that I grabbed Tucker's collar and ran inside to my room. After that, I was scared for months. So scared that a part of my hair turned grey from the amount of stress the fear was putting on me, and I still have the greys in my hair to this day. As I am writing this, I am feeling the fear that I had forgotten. When I see the gray patch in my hair, I sometimes think back to what I saw that night. At that age, I knew what aliens and UFO's were, but like magic, I thought it was just make-believe. But on that night, I knew what I had saw. Ever since that night, I have always shown a keen interest about the truth that is out there. I know what I saw, but was afraid of what others may think, so I kept it to myself until I was 15. I told my girlfriend, who is currently my fiancee about my encounter. But now, with all of the UFO sightings out there, I don't think people will be too quick to judge me now. This is the first time I am telling this story to the public."],"files":["/var/www/straped/mufon/html2text/13246.html.txt","/var/www/straped/mufon/org/13246.html"],"Country":"United States","Latitude":"30.1316","Case Number":"13246","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown"}