{"Region":"Texas","Summary":"At 22:20 on October 26, 2008 Three(3) objects spotted in upper stratosphere directly EAST of Princeton, Texas in Collin County.","Object Features":"Undisclosed","Longitude":"-96.498042","trends":["There has been one other sighting in Princeton","There were no other sightings in Princeton on or around October 26th 2008"],"Date of the Event":"10/26/2008 10:20 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","City":"Princeton","divs":["Sighting DetailsAt 22:20 on October 26, 2008 Three(3) objects spotted in upper stratosphere directly EAST of Princeton, Texas in Collin County. The three objects rotated COUNTER CLOCKWISE first flashing all at the same time(independent event lasting 10 minutes), as rotation slowed and spread the three individual object flashed INDEPENDANTLY of each other. (independent event lasting 5 minutes). After spreading apart the point pointing EAST flashed very brightly and moved to form SINGLE line with the other 2 flashing points (independent event lasting 5 minutes). After this episode the 2 flashing end points moved to complete another triangular formation (one moving west the other moving south, event lasting another 5 minutes) all objects continued random bright flashing . Object then ceased flashing but shone a continuous light the objects then spun very quickly(counter clockwise) and coming together with a very bright flash and the disappeared. Total occurrence lasted approximately thirty(30) minutes. The color of the flashes ranged from deep red to bright white. During this episode my two dogs acted very peculiarly whining and crying and rubbing their head upon the ground(as if they could hear something I could not). I was unable to look away as this events were taking place. Knowing only what the dogs were doing by what I heard."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.180116,+-96.498042(13244)&iwloc=A&hl=en\"> mufon case (13244) map </A>","Log Number":"US-10272008-0002","Source":"MUFON","Weather Factors":"Windy","Object Flight Path":"Undisclosed","Object Shape":"Flash, Triangle","Latitude":"33.180116","Tags":"City","Date Submitted":"10/26/2008 10:20 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13244.html.txt","/var/www/straped/mufon/org/13244.html"],"Case Number":"13244","Country":"United States"}