{"Tags":"City","Object Features":"Undisclosed","Log Number":"US-10272008-0014","Latitude":"30.2316","Disposition":"IFO","Viewing Distance":"Unknown","Case Number":"13256","Summary":"Cluster of white lights shaped like >","Sighting Duration":"Undisclosed","City":"Lafayette","trends":["There have been 7 other sightings in Lafayette","There were no other sightings in Lafayette on or around October 25th 2008"],"divs":["Sighting DetailsI was sitting in a friends back yard around a little fire pit fire with about 8 friends. We were just sitting around talking and having a good time. A few friends had started seeing falling stars. So I was keeping a eye on the skies in the hope of seeing a falling star myself. My friends backyard that we were at is kinda on the outskirts of town but still in the city limits. Lafayette Louisiana is were I was. Their airport in very close to town and it is a normal thing to see little planes and large planes coming and going. I work at night and see planes all the time. And because the airport is very close to the city, planes are low flying all around. Just saying that to let you know, that I know what I did see was NOT a plane. But I was sitting to where I was facing towards town and I had seen a couple looked like 20 or so passanger planes heading up and out of town. And I could see the lights of the city illuminating the sky. I happened to look up at one point and see a cluster of tiny white lights shaped like a triangle without the bottom line to close it. > Like that. Or like a flock of birds. None of the lights blinked. They all stayed pure white. Along the outter all the lights where straight and defined the triangle shape. But there were some set out from the outter lights. I watched it for a few seconds then started asking others to looks and see if they could see it. Asking if I was just seeing things or if they saw it too. I literally pulled a friend down buy me to try and make her see it. But with all the powerlines and few trees no one could see it. It kept moving on a straight path until it did finally dissapear behind some trees. I started asking friends there if they knew if birds could reflect light. Because it really is the best way to describe the lights formation. It was like a flock of pure white glowing flock of birds. No one including me didn't hear any noise. My girlfriend immediatly asked me if it was just a plane. I said of course not. We would have heard jet noise and the lights i saw looked to be higher up than the planes are coming and going from our airport. I have researched in vain since seeing the lights. Trying to find out if birds really can relect light or if there have been ufo's sighted that look like the one I saw. And honestly the ufo's that were sited over Lubbock Texas back in the 50's seem to be the closets I can find of a ufo documented that I have found that looked like the one I saw. Except the one I saw the lights were bunched closer together. The the outter line of the > then a couple rows of lights out from the outter lines. I hope I have conveyed good enough what I saw. It has really thrown me for a loop. I feel so odd seeing something unexplainable. I want to know I'm not crazy and others have seen what I did or there is an explenation for what I saw. But I am not believing that just birds reflecting light is what i saw!"],"Date of the Event":"10/25/2008 11:00 UTC","Date Submitted":"10/25/2008 11:00 UTC","Longitude":"-92.014023","Region":"Louisiana","Weather Factors":"Does Not Apply","Object Shape":"Triangle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13256.html.txt","/var/www/straped/mufon/org/13256.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.2316,+-92.014023(13256)&iwloc=A&hl=en\"> mufon case (13256) map </A>","Country":"United States","Object Flight Path":"Straight-line path"}