{"Latitude":"30.271793","Date Submitted":"11/30/1974 05:00 UTC","Longitude":"-97.739811","Log Number":"US-10272008-0023","Viewing Distance":"101-500 Feet","Summary":"Milky - white in color","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.271793,+-97.739811(13265)&iwloc=A&hl=en\"> mufon case (13265) map </A>","Object Flight Path":"Hovering then path","Disposition":"Unknown","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around November 30th 1974"],"Object Shape":"Disc","Region":"Texas","Tags":"City","City":"Austin","files":["/var/www/straped/mufon/html2text/13265.html.txt","/var/www/straped/mufon/org/13265.html"],"Case Number":"13265","Date of the Event":"11/30/1974 05:00 UTC","Sighting Duration":"00:00:15","Object Features":"Patterned Surface","Country":"United States","Weather Factors":"None, Light","divs":["Sighting DetailsMy husband & I were driving west toward Bee Caves Rd. on Ben White Blvd. in 1975 on a Sunday. The road was under construction and there was a dead end.(the Barton Creek Mall area ) A man driving a white Ford Falcon had pulled over to the side of the road. We thought something was wrong with the car since he had not turned around due to the dead end road. We pulled over directly in back of him and saw him looking towards the south west. We immediately look up and saw a UFO hovering so close to us. It looked to be almost in reach. We rolled the car windows down to get a better view. It sit there for a few seconds longer. My husband opened the car door to get out and that is when it took off in such a high speed. If you blinked you would miss it. That is how fast it actully went up. We went back to my parents house and told them. My father absolutly forbid me to call the Bergstrom AFB. I will never forget that day. I still close my eyes at night and see it after all those years. After you see what we did, you will never feel the same. It is almost like you have a secret that you can't tell anyone because they will not believe you. My husband was working on his Ph.D. at UT at the time. I wanted him to report it to the proper department there but he would not."]}