{"Object Flight Path":"Undisclosed","Source":"MUFON","Object Shape":"Sphere, Star-like","divs":["sighting detailsmy son and i playing softball in our backyard noticed several star-like orbs coming out of the eastern sky from the columbia river gorge during a beautifully \"clear\" blue sky!!! at approx 3pm!!! each orb travelled its own path as if they were preditory military placements in the sky... a few took lower altitude positions others took random high altitude positions as much as i could guess being 35-45,000 feet. each became stationery as they floated gracefully into a \"sound\" position as if they stood a battlefront!!! my son pointed out a 7th after we had counted together 6 orbs!!! one of the orbs as within a near-path of a commercial airliner flying toward seattle from the south and the orb was undisturbed by the turbulence of the large aircraft!!! as it held its position in the commercial plane's wake! we pointed out to our neighbors and one neighbor across the street who was an older viet resident looked and looked and then said \"oh!!! you guys have great eyes to see them!!! yeah!<< i see them!!\" the orbs hovered for about 5 minutes then it seemed they faded into the outer atmosphere!!! they were brighter than the sun with a beautiful pure white light to them!!! as well nearly blinding if you looked too long! i told my son that we will go inside to see the tv because i felt there was something very strange about this event in broad daylight!!! sure enough!!!! on the tv was a news report of 2 f-15 fighters downed in the eastern columbia river gorge near the bio\\chem\\radiation munitions bunkers and soon to be incinerator!!! i forgot the name of the site! on the tv there were instant broadcasts of hundreds of witnesses of 2 fighters in \"chase\" as they elevated into the blue sky then they said they saw flashes of light.. . soon they also said on the news report that 2 fighters were downed in the columbia river. one of the 4 crewmembers survived being dragged from the river stating that \"they were struck from behind and there was nothing they could do about it!!! they came from nowhere!!!\" i knew then that our sightings of the orbs were significant to the downing of our own fighters!!! john michael"],"Region":"Oregon","Date of the Event":"07/31/2003 12:00 UTC","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around July 31st 2003"],"Log Number":"US-10272008-0022","Disposition":"Insufficient Data","Country":"United States","Longitude":"-122.672697","Case Number":"13264","Summary":"7 star-like orbs in random patterns leaving Columbia Riv. after 2 F-15's downed","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"45.525932","Viewing Distance":"Unknown","Date Submitted":"07/31/2003 12:00 UTC","Object Features":"Undisclosed","City":"Portland","files":["/var/www/straped/mufon/html2text/13264.html.txt","/var/www/straped/mufon/org/13264.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.525932,+-122.672697(13264)&iwloc=A&hl=en\"> mufon case (13264) map </A>"}