{"Disposition":"Unknown","Country":"United States","Sighting Duration":"00:02:00","Viewing Distance":"Over One Mile","Summary":"Bright WHITE light bursted into view, then dimmed then went North, disappeared after 10 sconds.","Object Features":"Unknown","Tags":"City","Object Flight Path":"Hovering then path","Object Shape":"Fireball, Flash, Star-like","Date Submitted":"10/26/2008 12:00 UTC","divs":["sighting detailsi was outside sunday morning between 5:20 to 5:45 (no later) in my backyard and i was viewing the western\\northwestern sky looking for meteors and i saw a bright, white flash suddenly come into view in the west and it started to move west\\nw. it dimmed very quickly and disappeared altogether. i continued to view the skies thinking i just saw a satellite, but to my utmost amazement, i saw a very bright white flash to the right of my viewing, and it too started to dim and move due north and disappeared in a manner of seconds. i would to add that there was no sound, no 'after sound' of an airlplane. i would like to add, that i am a light sleeper and i have been going outside to views stars in the early morning for quite a few years now and i know what airplanes, satellites and the space station look like when they are passing by. this flash was brighter than vega or venus and the initial viewing was too the right of perseas constellation about 10 degrees. the second observation was to the left of the big dipper about 80 degrees. (if you showed me a constellation map of the sky right now, i would be able to pinpoint both sightings). as i said, this was too odd to be taken at face value, i do not know of anything that can burst into such brightness then dim, move and disappear in about 15 to 20 seconds, and to happen twice within about 2 minutes. it was too weird!"],"Case Number":"13261","map":"<A HREF = \"http://maps.google.com/maps?q=40.182136,+-75.033821(13261)&iwloc=A&hl=en\"> mufon case (13261) map </A>","trends":["There have been 4 other sightings in Southampton","There were no other sightings in Southampton on or around October 26th 2008"],"Latitude":"40.182136","Source":"MUFON","City":"Southampton","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13261.html.txt","/var/www/straped/mufon/org/13261.html"],"Log Number":"US-10272008-0019","Region":"Pennsylvania","Date of the Event":"10/26/2008 12:00 UTC","Longitude":"-75.033821"}