{"Sighting Duration":"Undisclosed","Log Number":"US-10272008-0020","Source":"MUFON","Longitude":"-97.3098","Summary":"Odd cluster of lights.","Tags":"City","Latitude":"30.112475","Region":"Texas","Viewing Distance":"Over 1 Mile, Unknown","City":"Bastrop","Country":"United States","files":["/var/www/straped/mufon/html2text/13262.html.txt","/var/www/straped/mufon/org/13262.html"],"Case Number":"13262","Disposition":"Unknown","Weather Factors":"None","Object Flight Path":"Stationary,Path then hovering","divs":["Sighting DetailsOn the night of October 23rd. My wife was closing a window in our master bedroom when she observed a strange cluster of lights in the distance. She called me over to take a look at it, and at first I thought It might be a helicopter, since is was at a lower level then a domestic aircraft would have been at night. It was level with our backyard treetops but many miles out. The more I observed this, the pattern of the lights was unlike any I have ever observed before. We live fairly close to Austin Bergstrom International Airport and Camp Swift and observe a fairly steady amount of air traffic usually heading in the direction of ABIA coming in from the east. So, we have seen domestic and military aircraft in flight at night many times before. I myself am an ex Paratrooper, and have had extensive experience with military aircraft at night and these lights where unlike any aircraft night lights I have ever seen. As I said I thought it might be a helicopter at first but it made no noise that I could discern and seemed to be hovering at much higher ceiling then a helicopter would, along with the wacky lightshow. I thought that perhaps it could be a star, it was about as clear that night as the night sky could be, but the lights coming off it were unlike any starlight reflection and it was much lower on the horizon then the stars in that direction. With the naked eye we could make out red and white colors flashing with a strobbing effect off it. I retrieved a pair of binoculars, 7 x 50 mm with a zoom lens, and could clearly see not only the red and white lights but blue, red, white and greens. The lights were flashing with a very fast strobbing effect. Different colors in a cluster strobbing very fast without any real pattern. I could not make out a shape of the craft of any sort with the binoculars, since it was too far out of range for the binoculars, I could just make out the cluster of lights. I observed this UFO for 30 minutes with the binoculars, and for the most part it would be fixed in same part of the sky with slight deviations Up, Down, Right and Left. After 30 minutes observing it with the binoculars waiting for it to do something like take off or disappear, I went to bed. I told my wife that if that isn't a UFO then the only thing I could think of that it might be would be a Star. She stayed up for awhile longer I and told her that if it was still there by the time she went to bed that it might be a Star, however if it was gone in the next 30 minutes chances are it was UFO. She came in 30 minutes later to tell me it was no longer visible. The reason I felt it necessary to report it, is because our sighting corresponds to another sighting in Stephenville Texas on the same night and, the direction of our sighting would have placed it in that general location Northeast of Austin Texas."],"Object Shape":"Circle, Sphere, Star-like","trends":["There have been 8 other sightings in Bastrop","There were no other sightings in Bastrop on or around October 23rd 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.112475,+-97.3098(13262)&iwloc=A&hl=en\"> mufon case (13262) map </A>","Date Submitted":"10/23/2008 10:00 UTC","Date of the Event":"10/23/2008 10:00 UTC","Object Features":"Unknown"}