{"Object Shape":"Circle","Longitude":"-88.778868","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Latitude":"43.78947","divs":["Sighting DetailsI was at home in my rural Wisconsin home with my four young children and dog.The children were sleeping. It was around 10:30 at night in late August. My rat terrier dog started barking and would not stop when I told her to so I got up to investigate. The house has 5- 6 by 8 foot windows and had no window coverings. The house sits on a slight hill above Potato Creek which connects with Potato Lake which is east of Chetek Wisconsin and south of Weyerhauser.The windows face south towards Potato Lake. Anyway, I went outside to investigate. It was very still outside with no wind at all. I looked to the south and hovering above the treeline which is north of the lake was a very large round extremely white bright ball of light. It was just hanging there above the treeline and seemed to be about five feet above the trees. I realize now that it had to be a bit higher than that when I take into consideration the distance from the house to the treeline. I watched the ball of light for a few minutes and then it started to drop straight down VERY slowly until it was down behind the treeline and I couldn't see it anymore. I have extremely good hearing and there was no noise whatsoever. The house is isolated and at that time there were no buildings or anything in those woods. I went back inside the house and locked all of the doors. I also shut off all of the lights in the house so I could watch for it again through the window but I never saw it again after an hour of watching for it to reappear. At first I thought that it was maybe a flare because it was as bright as a flare, but it was perfectly round and sat in the same place for a few minutes. Also the color and shape never changed. My feelings were at first a little bit scared because something got the dog barking and the house is so isolated and it was pitch black outside that night. Then I was curious and went outside to see if there was an animal or something in the yard. After I viewed the object I was scared again only more so which is why I made sure the doors were locked."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Summary":"bright white stationary ball of light, no noise, above tree line, sat still for a few minutes before dropping behind the tree line","Region":"Wisconsin","Log Number":"US-10272008-0037","Date Submitted":"07/31/1987 10:30 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/13279.html.txt","/var/www/straped/mufon/org/13279.html"],"Case Number":"13279","Tags":"City","City":"chetek/weyerhauser","trends":["there have been no other sightings in chetek\\weyerhauser","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.78947,+-88.778868(13279)&iwloc=A&hl=en\"> mufon case (13279) map </A>","Country":"United States","Date of the Event":"07/31/1987 10:30 UTC"}