{"Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Jonesville","This sighting has never been favorited."],"divs":["Sighting DetailsI was probably outside already when my dads friend was walking back from the woods deer hunting. We were outside talking and I noticed this red light above the mountian across the road. I rember saying \"hey look at that\" and their might of been a ufo joke and we kept talking. I never took my eyes off of it at the time.After about twenty minuts Terry left,and my dad and me went inside. I belive I went back out once at least before it got dark and it was still out their.I rember noticeing that it had decended about a quarter inch in perspective over the mountian.By dark it was gone. I rember rideing the buss the nextday and looking at the other side of the mountian, much closer this time and seeing that their was no tower.I knew this. Also, I was hunting squirrel one day.It would have to had been the same year and time of year mabe a month or two earlier.I was on the trail down my mountian and seen a squirrel, sighted on it, and was about to pull the trigger and a dog jumped at the squirrel semingly off the forrest floor like it was laying down when it jumped.The dog was grey some black spots and the hind legs were shorter like a hyeana.The dog took off into the woods.I went home and told my father knowing that this was unusual and he sugested that it was the neighbours australian shepord this dog did not look like LASSY. By the way their is a perfect scar on my back like i had surgery,no stiching. My exgirlfriend noticed it when I was 18. Just to put that out their."],"Log Number":"US-10272008-0035","Region":"North Carolina","Weather Factors":"Unknown","Longitude":"-80.844515","Latitude":"36.239301","files":["/var/www/straped/mufon/html2text/13277.html.txt","/var/www/straped/mufon/org/13277.html"],"Object Flight Path":"Undisclosed","Summary":"Red, looked like a tower light but larger. In the same area i have seen mabe a mutant dog. Also a unexplaned surgical scar on my back.","Case Number":"13277","Object Shape":"Circle, Fireball, Sphere","Date of the Event":"10/30/1994 12:00 UTC","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.239301,+-80.844515(13277)&iwloc=A&hl=en\"> mufon case (13277) map </A>","Date Submitted":"10/30/1994 12:00 UTC","Viewing Distance":"Unknown","City":"Jonesville","Country":"United States","Object Features":"Undisclosed"}