{"map":"<A HREF = \"http://maps.google.com/maps?q=32.223046,+-98.195963(13271)&iwloc=A&hl=en\"> mufon case (13271) map </A>","files":["/var/www/straped/mufon/html2text/13271.html.txt","/var/www/straped/mufon/org/13271.html"],"Date Submitted":"10/28/2008 12:00 UTC","divs":["Sighting DetailsI am a asst manager of a elderly and diabled apt. complex. in the last several days I have heard stories from alot of my residents about sightings and saying the UFO's are back. Tonight I was out walking my dog and looked up and saw 4 extrmly bright objects in the sky. Plus we do have a satelligt up there most nights. I watched the objects swaying back and forth and then two took off and just disappered, the other two stayed there, I ran and took my dog in and got someone else to come out and look. we looked in aw as one went up and was just gone at the same time a spooky green hase flew over the space were it was like a ghost. Our hair stood up on the back of my neck. I came in to call a friend in another apt, by the time she got there all that was lest was the satelligt and i ufo that had move over to the other side of the complex that we could see between the tree limbs. I am not crazy! I did see them and others swear they are here again also. thay are shaped like umbrellas and are so bright, there is no sound what so ever but you just can fell that the are truley UFO'S. I am going to try and tape them tomarrow night if they are out there again."],"Object Shape":"Other","Tags":"City","trends":["There have been 74 other sightings in Stephenville","There were 7 other sightings in Stephenville on or around October 28th 2008"],"Date of the Event":"10/28/2008 12:00 UTC","Source":"MUFON","Region":"Texas","Sighting Duration":"08:10:00","Weather Factors":"None","Disposition":"Unknown","Summary":"4 umbrella shaped very bright objects in the sky","City":"Stephenville","Case Number":"13271","Object Flight Path":"Hovering then path,Other","Latitude":"32.223046","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Longitude":"-98.195963","Object Features":"Undisclosed","Log Number":"US-10272008-0029"}