{"City":"Miami","Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","Case Number":"13275","files":["/var/www/straped/mufon/html2text/13275.html.txt","/var/www/straped/mufon/org/13275.html"],"Country":"United States","Log Number":"US-10272008-0033","Object Features":"None","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around November 30th 1977"],"Disposition":"Insufficient Data","Date of the Event":"11/30/1977 07:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=25.796799,+-80.225149(13275)&iwloc=A&hl=en\"> mufon case (13275) map </A>","Date Submitted":"11/30/1977 07:00 UTC","Longitude":"-80.225149","Summary":"Bright green underwater craft passed by the fishing boat I was on.","Weather Factors":"None","Object Shape":"Bullet, Missile, Cigar","divs":["sighting detailsi was a young teen 13-15 maybe and i believe i was on summer vacation from school. my father routinely traveled on his fishing boat from miami to bimini for fishing trips. we were with a bunch of friends of my father who were also fishermen. about halfway across to bimini, i was instructed by my father to take the wheel and he gave me a compass heading to follow. he then went downstairs into the cabin area to drink with his buddies. i was on the bridge of the boat already for some time and had the chair turned around momentarily facing the west and i was watching the sun set as it was spectacular to view. i then noticed a bright green luminesent cigar\\bullet shaped craft in the water coming up behind the boat. as i was on a elevated position so it was easy to view the craft as there was a contrast between the color of the craft and the dark blue sea water. it was approx. a couple of hundred yards behind the boat and approached quickly. when it got to the stern of the boat, it moved to the right side of the boat and went by. as it passed the boat only a few feet away it was maybe 10-15 feet under water and glowed like a bright green glow stick. it made no noise and had no fins of any kind that i could remember. it just glided by and then dissapeared out of sight. it was shaped like a long missle and was pointed on both ends. i remember not being scared, probally more fascinated by what i just saw. i just watched your show on the discovery channel and this is the first time i am officially contacting anybody who investigates these matters. of course thru out the years i have told the story to friends who of course dismiss it as i was \"drunk\" or \"stoned\" like everybody else on the boat. the boat itself was 35+ feet and the craft was maybe 3\\4 of that size which i noticed when it passed by. i hope this information is helpfull in some way.."],"Region":"Florida","Latitude":"25.796799","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","Source":"MUFON"}