{"Disposition":"Unknown","Date Submitted":"09/15/1973 04:00 UTC","Case Number":"13281","Viewing Distance":"21-100 Feet","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around September 15th 1973"],"files":["/var/www/straped/mufon/html2text/13281.html.txt","/var/www/straped/mufon/org/13281.html"],"Summary":"A completely quite, bright but none illuminting circular object , zig, stop,then zag, stop. again and again. Then it stopped about 100' above me.","City":"San Clemente","Weather Factors":"Unknown","divs":["sighting detailsboot camp. usmc camp pendelton, camp san onafra, i.t.s training. this was to be our over night war games training. all four platoons marched about six to eight miles to the training area, full combat gear. when we arrived it was maybe around 1600 hrs. my platoon and one sister platoon were ordered to the top of the valley area. the other two platoons were to remain at the bottom of the valley. they were to oppose us in combat. we were ordered to take positions two men in each fox hole at the top ridge and remain 50% alert. i was the only one in my fox hole because of an uneven man count. i set up my field of fire and waited. at about 0100 hrs the platoon comander took me and about four others down the mountain to do some recon on the enemy platoons at the bottom. this took about an hour to go down. about thirty minutes to recon then we headed back up. about 3\\4 the way back up we were ordered to rest. i was told to keep guard while the rest slept for 30 minutes. i woke them and we continued back up the mountain. when we arrived we were told the other recon group captured the enemy flag and we had already won. i was ordered back to my fox hole but remain alert. this was about 0345 hrs. all was quite. then i noticed this small object darting from one side to the other of the valley just above the top ridge. there was no moon by this time and it was pitch black. i couldn't see my hand in my face. the object went side to side pausing for a minute or so each stop. it finally stopped just to the right, over my head about 100' up. it just sit there for about five minutes. no sound. then a very bright spot light came on from the lower side of the object. it sort of bounced as it started to lower towards the ground. just as it was to shine on the ground someone on the ridge shouted attack, attack, their attacking. the platoon commander ran out of the command hut and shot off an illumination round. it was headed right at it then just vered off and lit. an instant later the object seemed to pop and it was gone. it left a horizontal fingering white film that spread out over the entire valley. there's more detail but i'm out of room."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.435853,+-117.606402(13281)&iwloc=A&hl=en\"> mufon case (13281) map </A>","Date of the Event":"09/15/1973 04:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Region":"California","Longitude":"-117.606402","Source":"MUFON","Object Features":"Unknown","Latitude":"33.435853","Object Shape":"Circle, Disc, Sphere","Country":"United States","Log Number":"US-10272008-0039","Object Flight Path":"Stationary,Hovering then path,Path with directional change"}