{"files":["/var/www/straped/mufon/html2text/13283.html.txt","/var/www/straped/mufon/org/13283.html"],"Latitude":"41.355654","Region":"Connecticut","Object Features":"None","Date of the Event":"08/04/2008 09:05 UTC","trends":["There have been 2 other sightings in New London","There were no other sightings in New London on or around August 4th 2008"],"City":"New London","Source":"MUFON","divs":["Sighting Detailsjust another Monday night. my wife put our son to bed around 7:30 then she went to bed shortly after.I stayed up as always.I'm a smoker so as always I stepped out our kitchen door lit up a smoke.The night was still and dark and very quiet.Standing in the darkness I noticed a light coming through the trees. It was coming from the northwest. First thought was plane or helicopter. Watching this move through the trees(in the sky but coming through the trees)I could not hear anything. As it cleared the tree line I instantly knew it wasn't what I thought. Earlier that evening I had changed the battery in my camera and put in a new tape. So when this thing broke the tree line I turned looking through the screen door the camera was right there on the counter.I opened the door and grabbed it turned it on and hit record. At this time the object was right over head.Still following its course same rate of speed. I filmed it for around a minute.when it seemed to dim a bit then in an instant it shot off leaving almost like a vapor trail. And like before it was just me standing in the dark.knowing even though I just filmed it no one will believe me. this thing looked the same coming towards me overhead and going away.There was no sound no wings no flashing lights.It was a twinkling bright orb. From Aug. until now I've shown quite a few people. Two of these people are former air traffic controllers. they had no answers."],"Case Number":"13283","Object Shape":"Sphere, Star-like","Country":"United States","Date Submitted":"08/04/2008 09:05 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"orb slow moving for a minute then took off at a high rate of speed (caught on tape)","Log Number":"US-10272008-0041","map":"<A HREF = \"http://maps.google.com/maps?q=41.355654,+-72.099521(13283)&iwloc=A&hl=en\"> mufon case (13283) map </A>","Object Flight Path":"Straight-line path","Longitude":"-72.099521","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City"}