{"Log Number":"US-10272008-0038","divs":["Sighting DetailsOver the past years I have seen now fifteen ufo's. On 10-8-08 I sent the D.O.E. an e-mail concerning a theory I have worked on for thirty years. This thoery is called a displacement theory. It allow a displacement from point \"a\" tppoint \"b\" to be reprasented by the radious in a curve. In this theory a ship displaces across a distance toward infinity while time atempts to go to zero, better know as UFO technology. Over the years I have wrote them many letters concerning the theory. Strange things have happen to me in the past two years. I feel the government is paying close atention to me. Anyway, the next day after sending the e-mail, I was lieing in bed looking at the moon. It was very bright outside; all lit up. Over a time of about ten seconds, I heard a very high pitch sound getting louder and louder. Finaly, it became stable. I fell into a trance and could not move my body. I struggled against it. But when I did, there seem to be a force holding me back. When I struggled, it made a sound in my ears. When the pitch became stable, two ufo's came into my eyesight. They came by under the moon. I could see them very well. They were unlike any I have ever seen. They were shaped like a disk, but stealth. I keep leaning toward the idea that they came from our government because of the e-mail. In 1972 I saw one come in from outer space then make contact with four others. The one that came in from outerspace, it did triangular cordanants to reach one that was all ready in a location. The one in the location spontaniusly went south all the way across the sky so fast my eyes could barely keep up. I know what a UFO looks like, but this ship that did the cordainants seem primitive to me, something I would exspect from our government. By the way The two ships I saw on 10-09-08 were a color of green, a green I have never seen. When they left the sound they made went a way then I came out of the trance. Something else, I have metal in my body. I have no understanding how they got there. I have lived a strange life. I had a problem of uncontrolable out of body in which I fell into a trance. I have been out to jupter and saturn but in a fly by. The green UFO's left me a little tromatized. I become startled when I hear sounds untill I can identafie them. I also have a strange feeling of ---I dont know how to discribe it, but a feeling of being violated, helplessness; having to keep it to myself. I feel like they are watching me. Sorry for my bad spelling, I see no spell check. Thank you, Glenn D. Parham"],"Country":"United States","City":"Waynesboro","Latitude":"35.319522","map":"<A HREF = \"http://maps.google.com/maps?q=35.319522,+-87.762247(13280)&iwloc=A&hl=en\"> mufon case (13280) map </A>","Object Shape":"Circle","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Date of the Event":"10/09/2008 02:30 UTC","Source":"MUFON","Sighting Duration":"00:00:10","Disposition":"Unknown","Case Number":"13280","files":["/var/www/straped/mufon/html2text/13280.html.txt","/var/www/straped/mufon/org/13280.html"],"Tags":"City","Date Submitted":"10/09/2008 02:30 UTC","Longitude":"-87.762247","Region":"Tennessee","Object Features":"Patterned Surface","Weather Factors":"Light","trends":["There have been no other sightings in Waynesboro","This sighting has never been favorited."],"Summary":"stealth"}