{"Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-10282008-0004","Object Features":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Other","Date of the Event":"10/27/2008 11:30 UTC","Region":"Texas","divs":["sighting detailsthis is a summary of events that occurred on october 27, 2008, at approximately 11:30 pm. i am a cop and deal in facts, end of story. i went outside my suburban home to let my dogs out in back yard. i was looking into the sky and noticed that the moon was not out and admiring the stars. there was not any observable light pollution which made the sky appear clearer. as i was looking up, i observed four (4) subdued orange\\red lights traveling in a linear pattern from sw to ne. they were moving at a high rate of speed and without sound. i thought it was one long object, but then i observed the last two objects run up on each other and get out of \"sequence\". they immediately returned to a linear formation and disappeared into the ne sky. the length of the formation was about the length of my thumb if i held my hand outstretched from body. they cleared a large amount of distance within a few seconds 4 to 5 seconds. i have never seen any object in the night sky track that fast as did those 4 objects. my thoughts on their speed and motion were very similar to ufo's spotted in the atmosphere from space and tracking at a high rate of speed as seen on ufo shows. it was as if the objects were on a smooth rail in the sky. i have been skeptical about this subject until now!!! i lost the objects over my neighbors roof line. i cannot explain what i saw as man made unless the government has a top security project that is doing this. amazing. again, the lights were subdued orange\\red."],"Source":"MUFON","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around October 27th 2008"],"Sighting Duration":"Undisclosed","Longitude":"-96.763063","Latitude":"32.810325","Summary":"4 subdued orange/red lights in a linear pattern moving SW to NE over Rockwall,TX","Case Number":"13288","City":"Dallas","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.810325,+-96.763063(13288)&iwloc=A&hl=en\"> mufon case (13288) map </A>","files":["/var/www/straped/mufon/html2text/13288.html.txt","/var/www/straped/mufon/org/13288.html"],"Date Submitted":"10/27/2008 11:30 UTC"}