{"Tags":"City","Case Number":"13287","Object Features":"Appendage(s)","divs":["Sighting DetailsI was starting to enter the Burger Chef where I worked, just prior to the start of my shift. I remember placing my hand on the door of the store (or maybe reaching for the door) to open it, while looking across the street at the Town and Country shopping center. Suddenly, I found myself watching a very large object as it sat silently over a large portion of the shopping center parking lot. It was so large and suprising to me, that I feel as though I was in a state of shock because I lost track of the time I was standing there. I didn't even realize I was outside staring at something until a work friend alerted me to the fact that I was standing there. Whatever I was looking at, was suddenly no longer there, and I was left somewhat disoriented and wondering if I had really seen anything at all. It was only after the fact that it occurred to me that my experience was somewhat strange: seeing an object that was so large it hovered over the entire shopping center parking lot, yet no one else noticed it but me; also that something this large was so silent and still. I have never seen a description of the object I saw in any UFO descriptions, so I have wondered all these years if I really saw what I feel certain I saw. It was dark or black, as I recall, and remainded me of an old spanish galleon ship, because of way the ends curved up and out. It also seemed to have something like propellors rotating or pulsating on both ends."],"Object Shape":"Unknown","Region":"Texas","Date Submitted":"11/30/1975 05:00 UTC","Date of the Event":"11/30/1975 05:00 UTC","Latitude":"27.806243","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-97.394001","Summary":"Believe I saw a very large, silent hovering object, over a Corpus Christi, TX shopping center in the 70's","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Log Number":"US-10282008-0003","City":"Corpus Christi","Country":"United States","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around November 30th 1975"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.806243,+-97.394001(13287)&iwloc=A&hl=en\"> mufon case (13287) map </A>","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13287.html.txt","/var/www/straped/mufon/org/13287.html"],"Weather Factors":"None"}