{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting Detailsit was one of those nites that was very bright. my friend and i were standing in the parking lot after eating dinner. we were talking when i looked up and saw a very large object pass over and behind the resturant.i quickly said \" mike, look at that\". he turned around and said \"\"what the hell is that\". i said \"look, look\" and we both watched it move slowly from the south to the north. i am very good at estimating things.time, distance, number of people in a room etc. etc. we watched in awe as it , . traveled in perfect silence approx. 500ft. away from where we stood and approx. 500 ft. high.it traveled paralell to rt. 19,which was only about 300ft. from where we stood,at about 50mph with no lights.having a good look of at least 15 seconds, it was about 400ft. long and about 50 ft thick and triangular shaped. as soon as i saw this object i got very excited and knew right away it was not from this world. maybe someone can tell me what is that big, shaped like that and can move that slowly with out making a sound?? this incident is certainly somthing i will never forget!! acually i wish i could see it again."],"Sighting Duration":"00:00:15","City":"Spring Hill","Object Shape":"Triangle","Case Number":"13289","Date of the Event":"02/23/2004 10:05 UTC","trends":["There have been 12 other sightings in Spring Hill","There were no other sightings in Spring Hill on or around February 23rd 2004"],"Source":"MUFON","Region":"Florida","Latitude":"28.485148","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-82.529337","map":"<A HREF = \"http://maps.google.com/maps?q=28.485148,+-82.529337(13289)&iwloc=A&hl=en\"> mufon case (13289) map </A>","files":["/var/www/straped/mufon/html2text/13289.html.txt","/var/www/straped/mufon/org/13289.html"],"Object Features":"Unknown","Country":"United States","Summary":"ufo passed so. too no. 50mph.500ft away, 500ft. high. no sound no lites it was one of those","Date Submitted":"02/23/2004 10:05 UTC","Disposition":"Unknown","Log Number":"US-10282008-0005","Tags":"City"}