{"Source":"MUFON","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Star-like","Case Number":"13292","Weather Factors":"Unknown","divs":["Sighting DetailsThe fist time I saw the oblect was in Mountain Home North Carolina September of 2007. I was staying at a friends house and I was laying down to sleep about 1-2 am when I kept seeing this green and white light moving in the sky. It looked small just like a star but the light was more clear almost like a LED light. At first I thought tht branches were just swaying in the wind blocking the star from time to time until I saw it at another end of the window. I got up and watched it moving around, the way it moved looked like a helicopter in dangerous winds. But I layed back down and told my friends the next day, they said I should have woke them. So the next night the exact same thing, this time I wake up my friends and we watched it for awhile. Mt friend is a private investagator and I've worked on cases with him so we decide to go outside. When we did we noticed 2 other objects moving around in the same way until we got in the middle of the street and all three of them froze looking just like bright stars. In one it was mostly green and white, one was mostly orange and red, the other was like a blue and purple. They also showed other colors at times. With the green one at one point it looked like it had some type of window or something and the greel light was comming from inside, only reason I think that is it looked like there were three black shapes like something standing there looking at us. The black shapes were blocking part of the light like they were standing in a window or in a open doorway. I can't even tell you how many times I have seen them up there but at the same friends house in Florida that he was moving out of we both saw the green and white one again. When we first saw it in Fl. was maybe 6-8 months after we first saw the first one in N.C. Everytime I lost sight it would drop behind the tree line, it went from maybe a 65 degrees angle in the sky down to maybe 30 degrees to the trees in the skyline, from my perspective it looked like a good two feet. On a personal note I've only seen them at my friends house so I don't think they are following me but as I type this I have nervous chills, goose bumps all over my body. Right now I feel like I am being watched but I do not want to look out the window right now and I'm not going to. Those are the same feeling I felt every time I saw the object. I am sure you are thinking it was just a start or a helicopter in strong winds, I know reading what I wrote I would too if it was someone elses but I know for a fact it wasn't, I just don't know any words to describe what I saw"],"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.339424,+-81.649621(13292)&iwloc=A&hl=en\"> mufon case (13292) map </A>","Region":"Florida","Date Submitted":"02/29/2008 07:30 UTC","Summary":"Well first I saw it in N.C. then a week later I saw the same looking object in Fl.","Latitude":"30.339424","Disposition":"Insufficient Data","Longitude":"-81.649621","Tags":"City","Date of the Event":"02/29/2008 07:30 UTC","Log Number":"US-10282008-0008","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around February 29th 2008"],"City":"Jacksonville","files":["/var/www/straped/mufon/html2text/13292.html.txt","/var/www/straped/mufon/org/13292.html"],"Object Features":"Window(s)","Sighting Duration":"Undisclosed"}