{"Viewing Distance":"21-100 Feet","Source":"MUFON","divs":["Sighting DetailsI do not recall the date but I had been in Nashville, TN and planned to go to Cleveland, TN to see some friends. I decided to drive to Lynchberg, TN to visit the Jack Daniels Distillery and then drive to Chattanooga, TN and then on to Cleveland. I traveled down through Shelbyville, TN and remember it was raining so hard it was flooding in places. I arrived at the Distillery about 3:00 P.M. and they gave me the grand tour because of the weather I was their only visitor. After the tour I asked how far it was to Lynchberg and they told me not far down the road. I arrived there about 5:00 p.m. and found the little town with the Courthouse sitting in the middle and all the businesses round about like a rectangle facing the Courthouse. I first went into the Jack Daniels store for a while and purchased some souveniers and then went down to the corner to the restaurant to eat. I stayed there until 8:00 P.M. exactly then headed out towards Tullahoma, TN which is some 14 miles on the two lane highway I came in on. It was pitch black out and raining. I drove about 2 or 3 miles when I could see what I thought were runway landing lights for aircraft coming in and crossing a highway to land. I used to fly airplanes and I remember looking towards where the lights were shining to see if there were any aircraft. I then kept going for a ways when I realized the lights were still with me. I then tried to figure out what the source was. I remember there were seven lights and they pulsed but the light did not dim and they were extemely bright so as to light up everything they crossed over. I rolled the window down to hear any noise and it was absolute silence. I could not see the shape of the craft but from the lights I figured it was over 100 feet in length or diameter. It was locked onto me because I speeded up to about 85 mph and hit the brakes and quickly slowed to about 15 mph and then speeded up again and it was locked onto me like it was part of me. I remember it was little more then tree top high as I could easily see the tree tops. It crossed over a house, barn and road that went to the left lighting up everything. We finally came into Tullahoma and it was a small town with only one stop light and the road went straight or you can turn right to go on to Chattanooga and the craft came with me right into town just above the trees at the stoplight where I stopped and it stopped. I decided to turn right to see if it would do the same. I drove about a block or so and pulled over and got out and it stayed at the light. I could not see what it was due to the brightness of the lights and the rain and darkness. That was the last time I saw it. I remember I never felt scared only curious. I realised when it locked onto me that whatever it was it was not from this planet.I have not experienced anything such as this before or since. I have recounted this many times to people and although no one has ever said it didn't happen you could tell no one thought it to be a big event. Only I know it happened and I guess thats all that matters. I'm sure everyone wants to see concrete proof like having a Bigfoot in a cage or the Lochness Monster tied up to some dock, and even with that there will be those that would still refuse to believe it. This happened back in either 1987 or 1988 I don't recall the date but perhaps the Distillery has a visitor log I signed. I'm sure with some investigation an exact date could be gotten."],"Weather Factors":"Rain, Heavy","Summary":"See below for details","Longitude":"-86.374159","Country":"United States","Latitude":"35.283136","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13297.html.txt","/var/www/straped/mufon/org/13297.html"],"Disposition":"Unknown","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Case Number":"13297","trends":["There has been one other sighting in Lynchburg, Moore County","There were no other sightings in Lynchburg, Moore County on or around November 30th 1987"],"Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.283136,+-86.374159(13297)&iwloc=A&hl=en\"> mufon case (13297) map </A>","Log Number":"US-10282008-0013","Date of the Event":"11/30/1987 08:15 UTC","Date Submitted":"11/30/1987 08:15 UTC","Object Flight Path":"Path then hovering","City":"Lynchburg, Moore County"}