{"Date Submitted":"10/25/2008 09:30 UTC","City":"Waterloo","Longitude":"-85.019967","Object Features":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"21-100 Feet, Over 1 Mile","Log Number":"US-10282008-0006","Date of the Event":"10/25/2008 09:30 UTC","Region":"Indiana","Object Flight Path":"Straight-line path,Path with directional change","Summary":"Bright shinning orange light pulsing slightly as it moved through the sky","Case Number":"13290","Object Shape":"Circle, Fireball, Flash, Sphere, Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.431995,+-85.019967(13290)&iwloc=A&hl=en\"> mufon case (13290) map </A>","Latitude":"41.431995","files":["/var/www/straped/mufon/html2text/13290.html.txt","/var/www/straped/mufon/org/13290.html"],"Source":"MUFON","Sighting Duration":"00:01:25","Disposition":"Unknown","trends":["There have been no other sightings in Waterloo","This sighting has never been favorited."],"Weather Factors":"Windy","divs":["Sighting DetailsAfter I came home and parked my truck for the night I turned it of and noticed a bright orange light in the sky coming from the south over auburn and heading north north east towards the Angola area. I got out of my truck and continued to watch it come towards me I pulled out my phone and got a short video of it moving through the sky, it was a brightly shinning orange light that was pulsing slightly, it made no noise as it passed over where I was at. My first thought when I saw it was that a plane was on fire and about to crash near, but i noticed that it was not losing altitude and was making no noise that I could hear at all on a silent night, this \"object\" was fling under the cloud cover that night. It flew a fairly straight path it turned slightly east in the sky as it was moving. As I saw it moving through the sky my first thought was that I needed to report it as an emergency so i call 911 and gave the operator the best description i could and gave her its headings in the sky as best I could until I lost sight of it in the sky due to the trees and the building i was on the other side of, it made very good time for the distance it covered in the sky for that period of time, I was slightly scared and panicked by the sight of this \"object\" in the sky and watched for it any other time during the night but never saw it again. I still look up in the sky where I saw it that night every time I come home and park my truck and haven't seen it again."]}