{"Date of the Event":"10/27/2008 02:08 UTC","Country":"United States","Source":"MUFON","Tags":"City","Log Number":"US-10282008-0015","Region":"Ohio","City":"North Royalton","Date Submitted":"10/27/2008 02:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.313664,+-81.724574(13299)&iwloc=A&hl=en\"> mufon case (13299) map </A>","Sighting Duration":"00:05:00","divs":["Sighting DetailsI had just gotten off work and walked outside in the parking lot to wait for my wife to pick me up. I was looking up at the stars and it was a very clear night so I could see plenty of them but a few stuck out like a sore thumb. One in particular was triangular in shape and seemed relativley close. It was pulsating 3 blue and white lights not blinking more of in a rhythym. It didn't really seem to be moving. At first I thought this has to be a satelite of some sort because it was not a plane. I thought to myself this cannot be what I think it is. I moved out of the lights and into the darkness of the parking lot to let my eyes adjust. I had this feeling of wonder and amazement even if it was just a satelite and I watched this object for about 5 minutes total and it suddenly vanished. It didn't speed off or dissapear into the clouds because there were very few of them. It seemed to just go out like turning off a light. I noticed a few more objects once I lost sight of the main one. The others were very small but seemed to still hold the triangle shape. The lights were very bright enough to say without a doubt It was no STAR."],"Case Number":"13299","Object Shape":"Star-like, Triangle","Object Features":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/13299.html.txt","/var/www/straped/mufon/org/13299.html"],"Weather Factors":"None","Disposition":"Unknown","trends":["There have been 10 other sightings in North Royalton","There were no other sightings in North Royalton on or around October 27th 2008"],"Summary":"Triangular shaped UFO pulsating blue and white lights","Latitude":"41.313664","Longitude":"-81.724574","Viewing Distance":"Unknown"}