{"Date Submitted":"08/01/1996 09:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","Tags":"City","Case Number":"13293","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Summary":"Mass of fireball slowly moving across field, stopping and hovering, morphing into two small spheres,","Log Number":"US-10282008-0009","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13293.html.txt","/var/www/straped/mufon/org/13293.html"],"Object Features":"Undisclosed","Date of the Event":"08/01/1996 09:00 UTC","divs":["Sighting DetailsI was watching the show about The Fayettville Incident and it sounded very similar to an experience my sister, her huband and I had in S. central Fla in 1996. I was working at the Seminole Farms,(which is located on the Big Cypress Indian Reservation) as the produce shipping supervisor. My sister and her husband were using my truck at the time and they had come to pick me up from work. It could have been later, but it was a 45 min. drive one way out in the middle of no where and it was dark. As we were returning from the farm, approx 10 miles north of the Reserv. my b-in-l, said what is that? We looked to the right and saw a bright orange light across the field. I said stop! We got out and observed a bright orange, flaming ball of fire slowly moving across the field( if you held a golf ball in your hand out in front of you, arms length, thats how big it looks). Smoke was slowly being ejected from all around it, we could tell how far it was, because we could see the light from it shining on the ground below. It appeared to be about 40-60 feet off the ground and about 100-125 yards away moving north to south. It came to a stop and hovered for a few seconds and then morphed into 2 smaller well defined orange orbs, one above the other, the top orb then blinked 3-4 times then the bottom orb seemed to respond with the same blinking order, then the top one shot off up and to the north and the bottom orb shot up and to the south at speeds that I can't even describe. They were just gone. We stood in shock and awe for a moment with literlly our mouths hanging open. when we got home I told my parents of it and I could not explain enough to make them understand what we saw!!!"],"trends":["There have been 6 other sightings in Longwood","There were no other sightings in Longwood on or around August 1st 1996"],"City":"Longwood","Source":"MUFON","Longitude":"-81.344828","Object Shape":"Fireball, Sphere","Latitude":"28.691885","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.691885,+-81.344828(13293)&iwloc=A&hl=en\"> mufon case (13293) map </A>","Country":"United States"}