{"Country":"United States","trends":["There have been no other sightings in Schofield Barracks","This sighting has never been favorited."],"Case Number":"13291","Summary":"Witnessed Hovering Circular Object Over The Treeline For 3 Minutes","Longitude":"-158.063333","Date Submitted":"08/15/1991 12:00 UTC","Object Shape":"Circle","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13291.html.txt","/var/www/straped/mufon/org/13291.html"],"Tags":"City","Latitude":"21.497778","Disposition":"Unknown","City":"Schofield Barracks","divs":["Sighting DetailsIn 1992, I was 13 years old. My father, who was in the Army, was stationed at Schofield Barracks, Hawaii on the island of Oahu. At approximately the above listed date and time, I was walking home from a friend's house, and toward my house which was located on McMahon Rd., Schofield Barracks. My friend's house was located near the PX on base. The date is an estimate, but I know for a fact there was a full moon that night. I was quite a way from my house and was alone. I looked up and I remember looking at and admiring the full moon. A little while later, I looked up and saw the full moon AND another object that appeared to be the same width as the moon and the exact same color, absent the craters that appear on the moon. If I were to guess, the object was trying to mimick the moon in order to blend in with the environment, but was positioned in the wrong place, making it obvious. But this is only conjecture. I estimate that the object was a few hundred feet high and moved silently, trailing me. However, it's possible the object was larger and higher up, or small and lower to the ground. From my position, it was exactly the same size, visually, as the moon. I stopped and looked at the object, trying to figure out what it was and once I realized I was seeing something that I thought was a UFO, I ran as fast as I could toward my house. I wanted someone to see this object besides just me. I wanted a witness. I ran as fast as I could, while constantly looking over my right shoulder to watch the object as it followed me. It's a wonder I didn't trip or run into something. The object was totally silent and moved very smoothly. I felt a combination of fear and awe. I was yelling as I got close to my house, trying to get someone's attention so that I would not have to lose visual track of the object before it disappeared. Unfortunately, no one in my house was paying any attention, or couldn't hear me, and I had no choice but to walk inside and get them. I got my family and ran back into the front yard and the object was gone. I had run so hard and tried so hard to keep the object in view, and wanted to get another witness, and it didn't work despite my best efforts. To this day, I am furious that no one came outside when I was calling them. I know what I saw. I am educated, intelligent, and honest. What I saw that day was definitely a UFO. I have no clue whether this was an alien spacecraft, or perhaps an experimental military aircraft that could blend in with the sky. But I do know that I saw something that I still cannot explain."],"Sighting Duration":"Undisclosed","Object Features":"None","Date of the Event":"08/15/1991 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=21.497778,+-158.063333(13291)&iwloc=A&hl=en\"> mufon case (13291) map </A>","Source":"MUFON","Log Number":"US-10282008-0007","Weather Factors":"Unknown","Region":"Hawaii","Viewing Distance":"501 Feet - 1 Mile"}