{"Object Shape":"Flash, Sphere, Unknown","Date of the Event":"10/26/2008 11:50 UTC","Latitude":"34.726942","Longitude":"-92.334489","divs":["Sighting DetailsI looked out my front window and noticed what I thought was a star, but I noticed it blinking white, red, blue, green, and yellow lights, all very randomly. So I telephoned my friend in Little Rock, 30 miles south, I phoned him because he saw something very strange in Texarkana, TX back when the lights were going on down there. and I knew someone else needed to see this, not just me, to verify its existence. So we both went outside of our homes and watched the light move around a small portion of the sky, all the while blinking it's lights. It was located in the NW sky approximately at 15-20 degrees off the horizon. We could only see it's lights, no structure were visible, and it seemed to be quite a ways away. As we watched we both called out what we saw over the cellphone, to verify that we were watching the same thing. It would move right, while flashing the colors, then back left. Down and to the right. Up, basically it moved in all directions, but it wasn't moving across the sky, just in a small area of the sky. I then noticed a second light due west, it was much smaller and was moving north at a steady pace. It had one blinking red light, I thought it could have been a plane. Once it flew north enough it was approaching the first light, it flew over that light, and when it did, I no longer saw the smaller light, it was gone! The first light then started to dim itself, still blinking the different colors, but they were less apparent by now, because it seemed to be getting much smaller. My friend lost track of it, because where he was from it moved behind a tree. I kept eyes on it for as long as I could stand the cold. It kept moving in the same small area of the sky, before dimming down so much, it just winked out. The light was there, still flashing, although I couldn't make out the colors by now, and then it wasn't. I knew when i saw the colors, that it wasn't a plane, because planes don't have blue or bright white lights. Also, it didn't move across the sky at a steady pace, it would move, stop, and move again."],"Object Flight Path":"Undisclosed","Country":"United States","Case Number":"13313","Viewing Distance":"Unknown","Tags":"City","Region":"Arkansas","trends":["There have been 21 other sightings in Little Rock","There were no other sightings in Little Rock on or around October 26th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.726942,+-92.334489(13313)&iwloc=A&hl=en\"> mufon case (13313) map </A>","Object Features":"Undisclosed","Log Number":"US-10282008-0029","Date Submitted":"10/26/2008 11:50 UTC","Disposition":"Unknown","Summary":"Saw a light in the sky that blinked four different colors randomly.","Weather Factors":"Unknown","City":"Little Rock","files":["/var/www/straped/mufon/html2text/13313.html.txt","/var/www/straped/mufon/org/13313.html"],"Source":"MUFON","Sighting Duration":"01:05:11"}