{"Disposition":"Unknown","Case Number":"13319","Latitude":"38.441411","Region":"West Virginia","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.441411,+-81.471093(13319)&iwloc=A&hl=en\"> mufon case (13319) map </A>","divs":["sighting detailsarmy planes fly over the house, on their way to the airport. army national guard planes. the big ones. c-something. anyway, i love to watch all planes. day or night. the first night i was sitting doing a 1000 piece puzzle. it sounded like an army plane flying over. but, i had no desire to go outside and look at it. the time had not changed.so, it was dark by 6 or so then. then, next night, i was home alone. my husband had taken a friend home. i was sitting doing the puzzle again. i heard an army plane. so, i flew open the door and went out on the front deck. right above the trees, i could see these huge orange 'round' lights. they were not strobbing. but, flashing. they were not hurting my eyes to watch them. i started trying to count them. up to maybe 12. i decided not to concentrate on counting. but instead, just stand there and watch this thing. i could see nothing else, but the orange lights. it went on a straight slow course. as it went over the trees across the way. i could still see the lights. but, could not hear it. i mean, ususally ufos are silent. this was very noisy. it seemed like it was huge. just like the army planes. when my husband got home, i asked him if he saw it. he said, no. it was not reported on our local news. we don't get a newspaper. but, i forgot to look the paper up on the computer the next day. i was thinking about running in the house and getting my camera. i was thinking, this being a ufo to me, it might know what i was doing and turn it's lights off. so, i just stood there and watched it. i saw where it went, when it went over the trees across the way. the next day, i went outside and looked. there is a low gap in the trees and that is where it went over. now, it could have gone near the river and banked and landed at the airport. that is what i was thinking. i was wondering if the control tower at the airport, even had this thing on radar. it had to have crossed our local road. then, maybe it hugged the woods. so, no one else saw it. it had to have passed over the town of elkview. which is very small. someone else in elkview had to have seen it, unless, like i said, some how it just stayed over the trees and woods. well, earlier this year, when the ufo was sighted in texas. they said, on our local news. that it had orange lights straight in a row. i didn't think too much about it. until they reported it the next night. while the news man was still talking about it. i called the station. i told the lady, that is what i had seen the march before. she said, someone might call me or come out, but they never did. i should have called them back or emailed the news man and had this report keep going. then, maybe someone else would have spoke up and said, they saw it too. we lived in va, starting in 1998. in 1999, my son and girlfriend were visiting us. it was the day after thanksgiving. we had gone to walmart. we came home about 4. we stopped at the mailbox. there were two jet trails. right inbetween them, i said \"look\". there was a silver flat object, just hoving over our pond. my son and his girlfriend said, they would get the mail and walk back to the house. it was 1\\4 of a mile. we drove down to the house. but, if i had looked up. i could have seen it real close. i mean, it was up kind of high. but, the house was not far from the pond. i thought about my camera, but was afraid to go get it. i never looked up either. guess i was afraid too. my husband didn't either. he said, it was just a plane. but, gee it was round and had no wings and it was just hovering. anyway, my son and his girlfriend, kept their eye on it and it had never moved. then, they had to pass a patch of trees. they said, after they passed the trees, the object would be gone and it was. she wanted to go fishing at the pond. i sat on the ground and just watched the sky. i would say, there were more jet trials that evening, then i had ever seen. everyone went in the house. i looked out by the pond, one for time, before dark and swear, there was a jet trial, shaped like an 's' with 3 jet lines through it. i told everyone, but no one came outside to look. all we could see of this ufo was just a little sliver of the side. since i didn't look up, we coudn't see the bottom. we couldn't see a top. it was flat, flat, flat. all we could see was this little side silver. then, maybe that same year or the next year, it was new years eve. we were at the girlfriends house near ft. myers. it was like 70 degrees. it was 9:30 at night. we four were just standing in a row talking. there were two stars, that seemed evenly spaced. they looked a little slanted to us. but, i said, maybe it was straight because of the curve of the earth. anyway, my husband noticed a red light. just a red light, he said, it was going moc 3. it was on a straight course. one star was brighter than the other one. i kept calling them 'headlights'. well, when the red light went under the duller one, it brightened up. we all saw it. it was saying like. \"t is okay to enter this air space.\"we thought maybe it was a mother ship. i think after moving back home to wv. i could still see the 'head lights'. but, i don't think i can see the where we live now. we live out in the country and lots of hills and mountains. but, i am happy we live were we can see planes and army planes going to land at the airport."],"Longitude":"-81.471093","Date Submitted":"03/15/2007 06:30 UTC","Object Flight Path":"Straight-line path","Object Shape":"Circle, Flash, Other, Unknown","City":"Elkview","Country":"United States","Source":"MUFON","Weather Factors":"None","Sighting Duration":"00:10:00","trends":["There have been 4 other sightings in Elkview","There were no other sightings in Elkview on or around March 15th 2007"],"Viewing Distance":"Unknown","Log Number":"US-10282008-0035","Summary":"FLASHING ORANGE LIGHTS, STRAIGHT IN A ROW","Date of the Event":"03/15/2007 06:30 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13319.html.txt","/var/www/straped/mufon/org/13319.html"]}