{"Summary":"Had to run to the store, on the way back i saw a smokey sphere like star at the end of road.","Source":"MUFON","Weather Factors":"None","Region":"Florida","Date of the Event":"09/08/2008 11:50 UTC","Sighting Duration":"Undisclosed","Object Shape":"Oval, Sphere, Square, Rectagular, Star-like, Other, Unknown","files":["/var/www/straped/mufon/html2text/13317.html.txt","/var/www/straped/mufon/org/13317.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.060751,+-83.166988(13317)&iwloc=A&hl=en\"> mufon case (13317) map </A>","Country":"United States","divs":["Sighting Detailsi was going through my diary today and discovered another sighting. i had to run back to the store at 11:45 on my return down a clearing in the road i saw a smokey sphere like star. i solwed down only briefly to look and went on home, dismissing it. until i happened to remember early one morning at between 430am and 500am i saw the same smokey srar like sphere for over 20 minutes driving along sr. 51 going to mayo, through the clear cut patches in the woods. it was clear, i could see tiny stars all around but this one just stood out from all the rest. i was calm, cool and collected, and a bit curious as to what this object might be. i lost sight of it when i reached town. but no way was i going to stop in an eight mile stretch where noone lived to observe this object, not by myself. fyi i have had encounters ALL my life, some much scarrier than this one. daylight and dark."],"Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile, Over 1 Mile","Latitude":"30.060751","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around September 8th 2008"],"Tags":"City","City":"Mayo","Longitude":"-83.166988","Date Submitted":"09/08/2008 11:50 UTC","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Other","Log Number":"US-10282008-0033","Case Number":"13317","Object Features":"Dome, Window(s), Patterned Surface, Other"}