{"Date Submitted":"10/23/2008 10:00 UTC","Source":"MUFON","City":"Arlington","Object Features":"Unknown","Weather Factors":"None","Longitude":"-97.099786","divs":["Sighting DetailsI just cannot believe this happened again!! I was sure I must have imagined it. I wasn't going to report it because I thought there is no way that I saw another ufo and that it was just an illusion. Well, I don't think that now. Oct. 23 around 10 pm I went into the garage and sat down to smoke a cigarette. My husband sat next to me, but of course he wasn't looking when I saw the lights. When I sit, I can see out the garage windows with nothing obstructing my view. I have a clear view of the sky looking east. I sat down and looked out the window after I lit my cigarette. All the sudden there was this large white strobe light, NOT BLINKING, a strobe. The light was large and very bright which is what caught my attention immediately. It was moving south to north. The light flashed three distinct times. I was thinking at the time that this was too big and bright. I kept looking for any other color light like plane, but I never saw anything other than the big white strobe light. After the three flashes, the light went solid white for a moment and then DISAPPEARED RIGHT IN FRONT OF MY EYES. I jumped up to look closer, nothing. There was not one single cloud in the sky!!!!!!!!! This is when my heart rate went through the roof. I have never over-reacted to an aircraft that may look odd. For some reason this caused my adrenalin to sky rocket. I did not see anything else that night, but then we went to bed not long after that. The whole event lasted about 30 sec."],"Region":"Texas","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unknown","Case Number":"13315","Object Flight Path":"Hovering then path","Date of the Event":"10/23/2008 10:00 UTC","trends":["There have been 43 other sightings in Arlington","There was one other sighting in Arlington on or around October 23rd 2008"],"Sighting Duration":"00:00:30","Latitude":"32.743857","files":["/var/www/straped/mufon/html2text/13315.html.txt","/var/www/straped/mufon/org/13315.html"],"Log Number":"US-10282008-0031","Tags":"City","Summary":"Strange large strobe lights flashed 3 times then 1 solid large white light-then just disappered. There were no clouds!!! to lose the object, I was looking right at it when it vanished.","map":"<A HREF = \"http://maps.google.com/maps?q=32.743857,+-97.099786(13315)&iwloc=A&hl=en\"> mufon case (13315) map </A>","Object Shape":"Circle"}