{"Region":"North Carolina","Log Number":"US-10282008-0028","Date of the Event":"10/26/2008 03:30 UTC","Case Number":"13312","Disposition":"Hoax","Source":"MUFON","Country":"United States","trends":["There have been 31 other sightings in Winston-Salem","There was one other sighting in Winston-Salem on or around October 26th 2008","This sighting has never been favorited.",""],"Date Submitted":"10/26/2008 03:30 UTC","City":"Winston-Salem","Tags":"City","Object Features":"Wings","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.10178,+-80.239916(13312)&iwloc=A&hl=en\"> mufon case (13312) map </A>","Latitude":"36.10178","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/13312.html.txt","/var/www/straped/mufon/org/13312.html"],"Weather Factors":"None","Object Flight Path":"Straight-line path","Longitude":"-80.239916","Summary":"Taking video of tops of trees, facing north and saw a streak from west to east at 23 second mark","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was home this weekend with not much to do and after reading online about UFOs being captured in pictures by accident, I decided to take a few pictures as an experiment. So on Saturday, I took a few digital pictures of the sky and indeed captured on film some amazing orbs. A few of the pictures were submitted to your website on Saturday. So Sunday afternoon I decided to try taking random videos of the same area, North of my home. I was standing on my front porch and began filming with my digital camera. While video taping the tops of trees and sky, I saw a brief streak moving from west to east. After I loaded the mpeg file into my computer, I performed a frame by frame of the video, which shows a cylinder shaped object at the 23 second mark, with small wings at the sides and small v shaped rear, lower wings. It also looks like a missile. I heard no sound at all. I'm not quite sure why this part of North Carolina is so active with these unknown objects. Furthermore, I would like to know why I am able to capture these objects so often. I don't really have any negative emotions about these observations and it's a bit fascinating. I believe my experiment worked."]}