{"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date Submitted":"07/25/1978 12:00 UTC","Region":"Georgia","City":"Lawrenceville","Object Flight Path":"Hovering then path,Path with directional change","Longitude":"-83.986062","Source":"MUFON","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around July 25th 1978"],"Date of the Event":"07/25/1978 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.965615,+-83.986062(13314)&iwloc=A&hl=en\"> mufon case (13314) map </A>","Disposition":"Insufficient Data","Tags":"City","Log Number":"US-10282008-0030","Object Features":"None","Object Shape":"Disc, Other","files":["/var/www/straped/mufon/html2text/13314.html.txt","/var/www/straped/mufon/org/13314.html"],"Weather Factors":"None, Does Not Apply","Country":"United States","Summary":"Two not quite round disc like objects.Aluminum like shine,but not glowing.Very high up.","divs":["Sighting DetailsI was walking around to the back of my grandmothers home,which was rented, to collect the rent.Something sort of told me to look up in the sky,which was very blue and no clouds.I saw what I thought was a bird in flight,but very high up.This object was several different colors and was begining to take a shape.At this time I was looking straight up.The traffic noise in town had stopped and it was as if I was the only one there.I then saw that the object had a sort of aluminum shine,but not quite a shine, and was about 15,000 to 20,000 feet up.Then another like object came into view next to the other one.I looked around me to see if anyone else was close so that I might ask them if they were seeing the same thing.But no one was in the back yard but me.Now this is downtown Lawrenceville,Ga. Very noisy but I was hearing nothing.It was as if I was told to watch.As if time stood still while I was watching.These not quite round,not real shiny UFO's were side by side and not moving.I could not believe my eyes! I have no idea how long this went on but I watched until one of the UFO's turned on its own axis and just sort of disappeared at the speed of light or faster. The other UFO,by this time I was sure nothing like these were in our airforce,stayed for a short while and then turned several different colors and disappeared. I was shocked to the max.Why was I seeing this happening and who could I tell? I served in the army,army aviation,and had access to a lot of army and airforce bases that you normally could not get on.Nothing and I mean nothing the U.S.A. has looked like what I saw.I mentioned this to several of my close friends who are very open minded and was assured that I had seen two UFO's. Now, my time line may not be right.This was in the 1970's and I was discharged from the army in 1968. But I know what I saw and it is just as clear in my mind today as it was right after it happened. I know this sounds sort of out of sorts but it was as if I was being a part of what I was looking at.I just can't explain it any other way. Why did I feel like looking up,and I mean straight up, at the moment these objects came into view.It was as if I felt their presence. They were very large but they were very high up and I could see them clearly. To this very day I still wonder WHY ME? At this time that is all I have to say. wos"],"Latitude":"33.965615","Case Number":"13314"}