{"Date of the Event":"11/17/1993 12:00 UTC","files":["/var/www/straped/mufon/html2text/13318.html.txt","/var/www/straped/mufon/org/13318.html"],"Viewing Distance":"21-100 Feet","Latitude":"33.302341","Sighting Duration":"Undisclosed","Date Submitted":"11/17/1993 12:00 UTC","trends":["There have been 2 other sightings in Senoia","There were no other sightings in Senoia on or around November 17th 1993"],"City":"Senoia","Disposition":"Insufficient Data","Source":"MUFON","divs":["Sighting DetailsIt was in mid November 1993; sometime around the 17th, 18th or 19th I do not remember the exact day but I do remember the event and want to make a record of the sighting. My friend Joel and I were standing alongside State Hwy 16 just outside of Senoia, Georgia. It was a very dark night and if I remember correctly there was no moon. Joel and I were facing North and were just standing and talking when out of nowhere - we did not see where the craft came from - there appeared this very, very large object just above the tree top level. The object was more horse-shoe shaped than triangle or boomer-rang shaped and it was glowing with an intensity that made it appear white hot. Joel saw the object first and when I looked at it I just could not look away. I was dumb founded. It took a minute for me to realize what we were looking at. Joel said, \" what in the world is that? \" to which I could not respond. I was struck by the fact that though we were less than 100 feet from the object there was no noise. Silent. The object was not making a single sound. No hum, no vibration, nothing. As the object passed over the trees the tree tops were illuminated and I could clearly, clearly see that the tops were waving back and forth. There must have been some air or motion coming from the object that had caused the tree tops to sway back and forth. The brightly lit large object continued to pass over the trees going in an east to south easterly direction which would have taken it over Griffin and Spaulding County. We watched it until it was out of our sight. To this very day whenever I watch some program or read an article about UFO's and UFO sightings I remember this event. The things that most stand out in my mind concerning the object are: The size. It was BIG. The brightness and white hot intensity and glow the object gave off. The complete and utter silence of the object. The glow from the bottom of the object - heck it was glowing all over. The way the glow lit up the tops of the trees - which were about 60 feet at least or more in height. The way the tree tops swayed. The way that once the object was gone from sight - the area returned to darkness. How dumbfounded I was and remain at what I witnessed."],"Object Shape":"Boomerang, Triangle","Tags":"City","Log Number":"US-10282008-0034","Case Number":"13318","Country":"United States","Region":"Georgia","Longitude":"-84.553816","Summary":"UFO at Tree Top Level","Object Flight Path":"Straight-line path","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.302341,+-84.553816(13318)&iwloc=A&hl=en\"> mufon case (13318) map </A>","Weather Factors":"Unknown"}