{"Latitude":"26.198551","divs":["Sighting DetailsI was picking up my daughter and I was walking outside the house towards the car. I notice something red seemed like a star. I started noticing it more because it started getting bigger and brighter. I walked back into the house but before entering three other people walked outside. I pointed the light to them. We all stood outside and the light got brighter. It passed us to the left and you could see it had two or three lights. It seemed to stall but it kept moving it had no blinking lights just red circle lights. Once it passed us to the left it vanished. I thought maybe it was clouds that made it disappear but no clouds were out that night. You could see the stars perfectly. They were dark red and big circles. It flew near us and no noise was heard it was awesome. Earlier that week I also saw a light that seemed to be a salliate or a star but it kept moving towards me and then disappeared and then reappeared but going a totally different way. It all happened in the same location. I was excited about the whole thing, I love to lesson to Coast to Coast."],"City":"Harlingen","Country":"United States","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=26.198551,+-97.694103(13324)&iwloc=A&hl=en\"> mufon case (13324) map </A>","Log Number":"US-10282008-0040","Object Features":"Undisclosed","Longitude":"-97.694103","Case Number":"13324","Source":"MUFON","trends":["There have been 6 other sightings in Harlingen","There were no other sightings in Harlingen on or around October 16th 2008"],"Object Shape":"Circle","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13324.html.txt","/var/www/straped/mufon/org/13324.html"],"Object Flight Path":"Undisclosed","Sighting Duration":"00:05:00","Date Submitted":"10/16/2008 09:20 UTC","Tags":"City","Date of the Event":"10/16/2008 09:20 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Summary":"The Ufo had big red circle lights to it. It had two or three red circles."}