{"Sighting Duration":"00:02:00","Longitude":"-96.694386","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13329.html.txt","/var/www/straped/mufon/org/13329.html"],"Latitude":"33.023553","Object Flight Path":"Path with directional change","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around October 26th 2008"],"Country":"United States","divs":["sighting detailsi was driving south on coit road on my way to a local wal-mart when i caught an object with blinking lights coming into my view from the east. at first i figured it was just a regular passenger jet, but then the object started to move in an odd way. it seemed to be moving continuously at a tilted angle. it wasn't even horizontal to the horizon! the object also seemed to be moving a lot slower than an airliner. i've seen a lot of airplanes in my life both at night and in the day (dfw is one of the busiest airports), and none of them looked like the object i saw sunday evening. there were red lights that were blinking. as one would turn off, another would be on. the lights made a circular pattern. i kept telling myself that i was just seeing things, and that what i was looking at was just an airplane. but the object did not have the shape of an airplane nor did it move like one. the sun had set, so it was hard to visualize the exact shape of the object. it had a disk\\diamond\\triangular shape. my encounter with this object lasted around two minutes. i lost sight of the object because i made a right turn into a sams club (i missed the wal-mart entrance because i was looking at the object). when i realized that what i was staring at was not an airliner my heart started pounding. i couldn't believe what i was actually seeing. i have heard about others having ufo sightings, i just never thought i would also be one. there were lots of other cars going south on coit sunday evening, i wonder whether any of them saw what i saw."],"Object Features":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.023553,+-96.694386(13329)&iwloc=A&hl=en\"> mufon case (13329) map </A>","Region":"Texas","Disposition":"Unknown","Summary":"Thought it was a plane until I saw lights flashing around the object in a very odd way.","Date Submitted":"10/26/2008 07:15 UTC","Date of the Event":"10/26/2008 07:15 UTC","Case Number":"13329","Log Number":"US-10282008-0045","Object Shape":"Diamond, Disc, Triangle","Tags":"City","City":"Plano","Source":"MUFON"}