{"map":"<A HREF = \"http://maps.google.com/maps?q=41.701422,+-87.77922(13326)&iwloc=A&hl=en\"> mufon case (13326) map </A>","Date Submitted":"10/19/2008 11:00 UTC","Object Shape":"Circle, Disc","Date of the Event":"10/19/2008 11:00 UTC","Disposition":"Unknown","Weather Factors":"None, Does Not Apply","Tags":"City","Latitude":"41.701422","files":["/var/www/straped/mufon/html2text/13326.html.txt","/var/www/straped/mufon/org/13326.html"],"Summary":"two sightings in october of an object in the night sky by myself on Fri and me and my wife on Sun","Country":"United States","Object Features":"Appendage(s)","Region":"Illinois","Longitude":"-87.77922","divs":["Sighting DetailsOn Fri Oct 17, 2008 Oak Lawn IL I went out in front for a smoke and of course caught a glipmse of the street light situated on the block across from me facing west. I always catch the light out of my eye because it's a light an it's dark. Now through the tree line I noticed a white light, very bright and just thought it was a plane, I have alot of plane activity above my house because i live in close proximity to Midway airport. Now I finished my smoke an for some reason looked back in the area where the light was and it was still there. I said to myself that's strange so made my way towards the light. I crossed the street and noticed it had some mass to it so I hopped my neighbors fence and got closer. I observed that it was hovering and made a hissing sound which was very smooth sounding. As I started to come out of the tree cover I think it saw me so it started to move back north east. I made my way back to my house and thats when I noticed it was dropping in altitude about 500 yds above the tree line and moved where ever it wanted. As it made two to three slow pauses and then flew right over me. I couldn't believe what i saw, it appeared to be shapped like a smashed oval and had a huge tail or like a dorsal finn on its back end. This lasted for about 3 to 5 min, I was amazed. The next morning I explained this to my wife and thought nothing of it until, Sunday Oct 19 night at 11 to 11:30 pm. My wife and I went out in front to smoke, she went out first and me second. I looked in the same location that I saw the object on Fri night and to my utter surprise there it was and not just one but two. So I said \"OK Kris tell me what that is\" and sher said \"I dont know\". So we watched for about a min and Kristy said should we get the camera and I was already on my way. As soon as we started to take photos they started to move. We photographed them together and then chose the one situated to the right. We chased ans shot at the same time. It came low and in towards us and then moved away. It did choose a different flight pasth in comparison to the first night. My wife said as we were shooting shots its like they dont want us to photo them, it would speed up and slow down, and it emitted a terrific light arrangement from it when it began to move. It also seemed likr it change shapes, it was awesome. The other one began to move and came right towards us in our direction. My wife was scared and I was too as it moved at us, we decided that now is a good time to get in the house. We got 9 different shots. As the second one came over us it was very quiet but you could still heard it, just like the fri night event. My wife said it was a plane but all the evidence and the visual make-up of the object eliminated that observation. It was low enought to get a visual look at it and know what it looked like. We looked at the pictures and have showed them to people and nobody can explain, everyone says its amazing. The best part is that the camera has a zoom in feature so you can really examine the shots. Let me know if you want to see them and we can make an arrangement. I still look in front every night at around 11pm but have not seen anyrthing since. I did some research and found sightings reported on line starting oct 9 in Chicago ridge, Oak Lawn and Orland. So your the expert and have experience with this phenomana contact me and I'LL let you see the photo. Thanks Sean Collins"],"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Chicago Ridge","There were no other sightings in Chicago Ridge on or around October 19th 2008"],"Log Number":"US-10282008-0042","Viewing Distance":"21-100 Feet, 101-500 Feet","City":"Chicago Ridge","Case Number":"13326","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON"}