{"Longitude":"-81.516005","Latitude":"41.089145","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13325.html.txt","/var/www/straped/mufon/more/13325_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/13325.html"],"Disposition":"Insufficient Data","Log Number":"US-10282008-0041","Summary":"2 star-like ufos hovering in place then make short movement then dissappear","Date Submitted":"10/21/2008 10:30 UTC","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around October 21st 2008","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Sighting Duration":"00:01:00","Case Number":"13325","Object Shape":"Star-like","Date of the Event":"10/21/2008 10:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy girlfriend and I were driving north on rt 91 right in front of Springfield High School. I looked up about 30 degrees above the horizon directly in front of us and saw two star-like objects hovering in place. The objects were diagonal from each other, not exactly on top of one another. I pointed out to my girlfriend that I had never seen stars like that and they seemed too bright because the visibility wasnt the best that night. We watched them for about 30 seconds as we drove. After 30 seconds the top object suddenly moved in a northeast direction for a few seconds and then completely vanished. About 10 seconds later, the bottom object followed suit and completely vanished. I couldnt tell how fast the objects were moving, although I can say they didn't seem to be moving very fast before they vanished. They moved in a steady and sustained direction and velocity before they completely vanished. It was as if someone turned out a light. These were not stars or any other kind of phenomenon I had ever seen before. They looked similar to the lights over Phoenix that turned out to be flares that I saw on the History Channel. They were similar to those flares however they did not have any color and they moved before they vanished. I am not sure how long the objects were in the sky before I noticed them. I have always looked up in the sky with skeptisism because I have seen strange phenomenon that turn out to be a satellite or a plane. This time however, I cannot explain what I saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.089145,+-81.516005(13325)&iwloc=A&hl=en\"> mufon case (13325) map </A>","Tags":"City","City":"Akron","Region":"Ohio","Viewing Distance":"Unknown"}