{"files":["/var/www/straped/mufon/html2text/13333.html.txt","/var/www/straped/mufon/org/13333.html"],"Object Flight Path":"Stationary","Source":"MUFON","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.209657,+-71.534592(13333)&iwloc=A&hl=en\"> mufon case (13333) map </A>","City":"Concord","Case Number":"13333","Latitude":"43.209657","Object Shape":"Unknown","Longitude":"-71.534592","Log Number":"US-10282008-0049","divs":["Sighting DetailsMy family and I were driving home from a restaurant on a two lane paved road (Route 302) about 1 mile from our home. We were travelling at about 45 mph at the time of the sighting. Most of the road is lined with trees except for an occasional home, business or other clearing. We were driving past a parking lot that is accross the street from a local ski area. My husband happened to be looking in the direction of the parking lot and quite suddenly two sets of very bright lights appeared in the sky just over the tree line at the back of the lot. He screamed \"what the heck is that!\", I had been talking to my children in the back seat and turned my head to see. The lights were in the sky, fixed, with no movement. We later believed they must have been \"attached\" to the same object since they seemed so fixed. They were very low, less than one tree length on top of the tree line about 100 yards away from our vehicle. They looked like two \"sets\" with four lights each, similar to those in an outdoor sports stadium. They were actually larger than the lights at the local high school stadium. Their appearance was so sudden and bright we were slow to react and continued to drive for 15-20 seconds before we pulled over. During this time, our view was again blocked by the tree line. When we pulled over there was nothing there...no lights, no sound. We went home and stood outside, convinced we had just seen a UFO. Our children continued to ask us what was wrong, why did we pull over and why were we using so many bad words! We could not explain how these huge light would suddenly turn on in the sky from no where. The next day my husband went back to find a reasonable explanation (construction lights or new parking lot lights??) There was nothing. There are condominiums behind the parking lot and my husband randomly drove around and asked people who were outside if they had seen any strange lights the night before around 8:00. One couple looked at him very strangely and said that they had seen strange lights (stadium style) at 9:30 the previous night but not in this same spot. They happened to be driving 15 miles away on another road (route 112). They thought they were passing a newly constucted building but realized there are no buildings on route 112 (it is national forest). They also said they saw the lights appear twice, turn on and off in the sky and appear again a few miles down the road. Over the next two weeks we told many people and heard from 3 others that they had seen some strange lights in the sky that evening but all had seen it from a distance (a mile or more). One person we told said he heard strange \"hovering\" sounds behind his house over the trees around the same time. He said it sounded like a plane hovering and passing back and forth over the trees. He looked outside and saw nothing. We are hoping to find others who have seen something similar or, even better,would be a reasonable explanation for this sighting. We certainly can't think of one!"],"Object Features":"Unknown","Summary":"two set of stadium style lights appeared sunddenly over an opening in the trees","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around September 19th 2008"],"Date Submitted":"09/19/2008 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"09/19/2008 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Region":"New Hampshire"}