{"Tags":"City","City":"Stephenville","Log Number":"US-10282008-0051","Date of the Event":"10/28/2008 07:52 UTC","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Texas","Object Flight Path":"Hovering then path,Straight-line path","Object Shape":"Triangle, Other, Unknown","Source":"MUFON","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=32.227876,+-98.198763(13335)&iwloc=A&hl=en\"> mufon case (13335) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"13335","trends":["There have been 74 other sightings in Stephenville","There were 7 other sightings in Stephenville on or around October 28th 2008"],"divs":["Sighting DetailsI left my house at approximately 7:45 to pick up my fiance from work. When I got to Rent-A-Center (his work) I sat in the car for a few minutes waiting for him to come out. I saw something out of the corner of my eye (to the left) and saw three orangish-yellow lights hovering. They formed a single line that pointed up at a diagonal and the highest point was to the left. I watched them disappear and reappear and each time the lights disappeared and reappeared, they were at the same angle just a little higher in the sky. I ran into the store to tell my fiance and his co worker to come outside and they came out in time to see the lights a couple of times before they disappeared. I tried to record some video on my cell phone, but as soon as I got the camera setting on it activated the lights were gone. We waited for about 5 minutes to see if anything would show, but nothing else happened. There was no sound during the entire event. After we saw the last lights disappear, we saw a plane flying through the same air space where the lights had previously been, and we could identify the plane and hear it, unlike the lights we saw only moments before."],"Country":"United States","files":["/var/www/straped/mufon/html2text/13335.html.txt","/var/www/straped/mufon/org/13335.html"],"Latitude":"32.227876","Longitude":"-98.198763","Date Submitted":"10/28/2008 07:52 UTC","Disposition":"Unknown","Summary":"saw 3 orange lights moving at an upward diagonal to the left and lights came on and off"}