{"Region":"Alabama","Longitude":"-86.297009","Viewing Distance":"Unknown","Date Submitted":"10/28/2008 12:15 UTC","Country":"United States","trends":["There have been 659 other sightings in Montgomery","There were no other sightings in Montgomery on or around October 28th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.375525,+-86.297009(13336)&iwloc=A&hl=en\"> mufon case (13336) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Object Shape":"Disc","Sighting Duration":"00:15:05","Case Number":"13336","Tags":"City","Object Features":"Unknown","Log Number":"US-10282008-0052","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13336.html.txt","/var/www/straped/mufon/org/13336.html"],"Date of the Event":"10/28/2008 12:15 UTC","Summary":"Three disks, red, N. to S. direction dancing around each other but moving at a high rate of speed in one direction.","City":"Montgomery","Source":"MUFON","divs":["Sighting DetailsAt 12:15A.M. my dogs and I awoke to the after burners of a fighter jet kicking in over head. That got my attention. A cold front had pushed through the previous day so the humidity was around 26% and no clouds. I threw on my jacket and went outside to see what was up because they are not supposed to be kicking in after burners at that time of night over the city. My backyard faces north. As I was looking north, motion to my right caught my attention. At this point the sound of the jet was gone. I noticed three objects spinning and dancing around each other but traveling fast in one direction going from north to south. They quit dancing around each other and one disk dipped below the others. It then changed to a color as I would discribe that like a florescent light. The red was vivid and bright. The actual sighting took no longer than 5 seconds at the most. But the thing that stood out in my mind was the absolute quiet. We do have an Air Force base in our town. So, if what I saw is ours.....yay for us. I later thought it may have been geese or other large migratory birds caught in one hell of a tail wind but the accrobatics of these disks were just too rapid. After the sightings I went back to bed knowing what I had just seen was out of the ordinary. This makes my fourth sighting in my life. My first was when I was 6. My second was when I was 12. My third was when I was 22, in the Air Force and was in Amarillo Texas. I find this event very interesting and would like to know if anayone has reported anything in this area over the last few days."],"Latitude":"32.375525","Weather Factors":"Unknown"}