{"City":"New Lenox","Weather Factors":"Unknown","Object Shape":"Flash, Star-like, Other, Unknown","Tags":"City","trends":["There have been 3 other sightings in New Lenox","There were no other sightings in New Lenox on or around November 15th 2000"],"divs":["sighting detailsthis happened quite a few years ago, so the exact date is foggy in my mind, but i remember it being around november 2000. i then lived in the town of new lenox,il. it was approximately 12:00am, i remember it being that time, because i was driving with my girlfriend and that's when she needed to be home. as i was driving south i noticed this bright flashing\\sparkling light, it was flashing faster than any strobe light i have seen, and it was all different colors. it seemed to be low in the southern sky, but far off in the distance. i noticed this light because it was flashing so many colors so rapidly, it seemed to just be hovering in the sky, i thought it may be a helicopter in the distance, but i had never seen lights of this kind. it was not very bright,but it was twinkling different colors, that is the best way i can describe it.. i asked my girlfriend if she was seeing what i was seeing, and at that point trees were blocking the view, and it went out of sight behind some branches, but there were no leaves on the trees. as i came to the end of the neighborhood, the street curves to the right and i had to turn heading west. now at this point i am looking out my left window drivers side. as i passed the trees there was a small clearing between the branches when the flashing lights became visible again, i started to slow the car to stop, i wanted my girlfriend to see this. now this was the crazy part, and probably the strangest occurance of my life i am about to tell you. before i had even slowed to say 10 miles an hour, i'm watching these lights when i see a bright flash and what i call the check mark, or light tail left in the sky, greenish in color and seemed to fade away instantaniously.. i was freaked out! goose bumps... i had to stop the car.. i got out and looked up in the sky where it was, and nothing was there.. i looked all around in the sky.. nothing. i just remember having this feeling at the time of wonderment,amazment,astonished, maybe even a slight fear. i remember feeling like, wow, was i at the right place, at the right time.. from the first spotting the lights to when it vanished in a flash of light all occured within approx 15 seconds.. this was a very short,but very memorable experience.. needless to say, since then i have always kept my eye on the sky."],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Log Number":"US-10292008-0010","Object Flight Path":"Undisclosed","Date of the Event":"11/15/2000 12:00 UTC","Date Submitted":"11/15/2000 12:00 UTC","Longitude":"-87.96561","map":"<A HREF = \"http://maps.google.com/maps?q=41.511976,+-87.96561(13349)&iwloc=A&hl=en\"> mufon case (13349) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"13349","Latitude":"41.511976","Region":"Illinois","files":["/var/www/straped/mufon/html2text/13349.html.txt","/var/www/straped/mufon/org/13349.html"],"Source":"MUFON","Summary":"Driving in my Car I witnessed a sparkling object far off in the southern sky, seconds later a bright Flash and it was gone."}