{"Date of the Event":"10/28/2008 11:30 UTC","Tags":"City","Region":"North Carolina","Date Submitted":"10/28/2008 11:30 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Mint Hill","This sighting has never been favorited."],"Longitude":"-80.65703","Latitude":"35.17354","Country":"United States","Object Shape":"Cross, Diamond","Object Features":"Unknown","divs":["Sighting DetailsI was taking out the trash. My wife was asleep. After taking out the trash, it was a very clear sky and I thought I would enjoy it for a second. I spend most of my time inside and wanted to take a look around. I tried to find the big or little dipper unsuccessfully. Then I thought I saw Orion. Which reminded me of an argument I had with a friend over the constellation. But below Orion's belt (or what I think is Orion) I saw a small cluster of stars. It looked pretty, but I couldn't say I saw that ever before. I thought it must be some constellation I didn't know. But it was about 5-7 stars in a group. I decided to watch in for a few moments when I noticed that the stars were moving. The group of stars moved as a whole across the night sky. They seemed very far away and difficult to be certain at first, but they moved as a group in different directions. The stars moved very slowly and without a sound. I also noticed that not only the cluster moved, but also that 3 or 5 of the stars would change position. The 'object' appeared to be in the shape of a cross or letter 'T'. Only two stars that never moved made up the tail or the 'I' shaped part of the cluser. The other 3 to 5 stars would disappear and reappear in a similar orientation. There was no blinking and all the lights appeared the same size. I watched this for about 30-45 minutes, taking several breaks inside to warm up and get my camera. I thought about waking up my wife, but she would think I was being and idiot. So I took as many pictures and video as possible, however my camera did not capture much at all. On film, I feel they would have looked like stars. I did watch for long enough to notice that i made its way across the sky partially. It went from the east headed west, but never crossed over my head. It would occassionally fully stop and change directions. I grew up in the country and watch the star for many nights. I know what an airplane looks like. This was far different from anything I have ever seen. I called a hotline who told me this was a star. But I am quite sure that stars don't move and don't move in a group. My feelings while watching this were excited, cold, interested, in awe, anxious and wanted to wake the neighborhood and my wife. I took several photographs and video and made several trip inside because I had watched for so long. I did not lose sight of the object, it is likely out my window right now! But it is cold, I can't seem to document it and no one else seems to care. I don't feel comfortable calling local news and be made to look foolish in my town. I am a fairly well respected individual. I do not know what this was and I am not saying it was alien. It was an unidentified flying object to me. Thanks for your time. I hope this reaches someone in time so that other may view what I viewed."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.17354,+-80.65703(13341)&iwloc=A&hl=en\"> mufon case (13341) map </A>","Disposition":"IFO","City":"Mint Hill","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"13341","files":["/var/www/straped/mufon/html2text/13341.html.txt","/var/www/straped/mufon/org/13341.html"],"Log Number":"US-10292008-0002","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Summary":"Cluster of moving stars that moved together in several directions. The stars moved individually and in a group."}