{"Summary":"This was our second sighting in a week, but much more dramatic than the first. The first one occured Tuesday, Oct. 21st. We saw 5 silver bullet looking objects but at that time did not realize that people in Stephensville were seeing them at same time.","Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Hovering then path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.724613,+-96.165248(13351)&iwloc=A&hl=en\"> mufon case (13351) map </A>","files":["/var/www/straped/mufon/html2text/13351.html.txt","/var/www/straped/mufon/org/13351.html"],"trends":["There have been 8 other sightings in Fairfield","There were no other sightings in Fairfield on or around October 28th 2008"],"Weather Factors":"Unknown","Region":"Texas","Case Number":"13351","Date of the Event":"10/28/2008 08:20 UTC","Latitude":"31.724613","Object Shape":"Oval, Sphere","Sighting Duration":"Undisclosed","Date Submitted":"10/28/2008 08:20 UTC","Log Number":"US-10292008-0012","Longitude":"-96.165248","Object Features":"Unknown","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","City":"Fairfield","divs":["Sighting DetailsThis is our second incident in one week. We did not know at the time that UFO sightings were coming in from Stephensville which is only a few counties over. Once we realized that we were seeing the same things here in Freestone County from a distance, we decided to report the sightings. We still cannot believe or grasp what we have been witnessing. We are on a ranch in a rural area and observe many things in the night sky (jet patterns, satellites, meteor showers etc.) but have never seen things like these. Here is the information we sent to Whitney Ashley at the Empire Tribune in Stephensville, this is about the second sighting Oct. 28th. I had already been in contact with her about our other sighting October 21st. We also observed strange things in January 2008 but did not report those to anybody. Here is a copy of what we sent to Whitney: Our back porch is right off our kitchen, we have four dogs on the ranch and I went outside to give two of them a treat at exactly 8:20 PM. I have gotten into the habit of scanning the sky because of what happened last week. As soon as I looked to the South West (in the direction of Temple), an object was very evident suspended just above the horizon. I watched it briefly, it was large (I was seeing it from far off), it had a definite red glow and had a faint strobe effect with a whitish blue light emitting around it. At this point, I called out to Andy (my significant other) and he came out and started watching it too. He said to go inside and see exactly what time it was. We watched this thing hover just above the horizon from 8:20 to 8:33 PM, so we were able to observe it for a long time. We actually wanted to get into the car and get closer but we knew it was so far away that we would probably lose it. Instead Andy went inside and got his rifle with a high powered scope on it to use as binoculars. We both looked at it through the scope. We could clearly see an oval or round object that had a red glow, it pulsated. What ever this was, it was big because we were seeing it from a great distance from where it actually was. Occasionally it would throw a whitish blue light. We could see other air traffic way high above it (planes fly along I-45 as a normal route). This looked nothing like what else was in the sky. We really could not believe our eyes. It finally just looked like it disappeared over the horizon (or lowered itself to a point we could not see) at exactly 8:33 PM. We wrote it all down when we returned inside with the intension of contacting you, we wanted to know if others saw it too! This was totally different than what we saw last week. I am curious to know if others in our area are seeing this but so far I have not heard anything. I am the curator for the museum of Freestone County and have been researching some information that was sent to me about sightings in the late 1800's. There are newspaper clippings that show that people here in Freestone county saw a \"space ship\" the night of the alleged crash in Aurora, Tx. The funny thing is, in those days they would not have linked the two locations together."]}