{"Longitude":"-73.425676","Sighting Duration":"Undisclosed","Summary":"Alien encounter.","Object Features":"Other","Case Number":"13353","divs":["Sighting DetailsI was on one of my first overnight boyscout hikes in Camp Kaufman in Huntington NY back in 1966. I was walking alone through a large empty grassy field.It was getting very dark and I returning from the trading post to my campsite. I saw a bright glowing blue creature.My initial thought was that it was a large penguin...but glowing very brightly. It almost appeared that I could see all the different internal organs beneath the glow. I stopped and stared at it for 10 seconds and then proceeded to run away as fast as I could. Of course no one believed me,they thought I was just trying to scare them, but this was not a dark obscure shape in the woods...this was a brightly glowing blue large penguin with blue and yellow internal organs...or so it appeared. I never really gave it much thought after that. It wasn't until I was watching the movie SIGNS and they showed a drawing in the book they were reading of a blue glowing alien and there it was.. This was a strange event in my life that seems to confirm my newly discovered beliefs that we are one big digital universe and all our Biblical history was profoundly affected by more advanced technological beings acting on our behalf and that there are Hybrids among us. Jesus?? \"Ockhams Razor\" plainly stated that simplest answer is usually the correct one. Technology or supernatural...Really seems obvious to me. Thanks for listening"],"Log Number":"US-10292008-0014","Latitude":"40.868154","Source":"MUFON","trends":["There have been 3 other sightings in Huntington","There were no other sightings in Huntington on or around April 30th 1966"],"Object Flight Path":"Stationary","City":"Huntington","map":"<A HREF = \"http://maps.google.com/maps?q=40.868154,+-73.425676(13353)&iwloc=A&hl=en\"> mufon case (13353) map </A>","Date of the Event":"04/30/1966 06:00 UTC","Weather Factors":"None","Viewing Distance":"20 Feet or Less","Object Shape":"Undisclosed","Region":"New York","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/13353.html.txt","/var/www/straped/mufon/org/13353.html"],"Tags":"City","Date Submitted":"04/30/1966 06:00 UTC","Country":"United States"}