{"Log Number":"US-10292008-0013","Longitude":"-93.517386","Summary":"very large trangular shaped dark in color with strobing lights","Viewing Distance":"501 Feet - 1 Mile","Case Number":"13352","divs":["Sighting DetailsIt was the summer of 1981 and I was preparing to enter my freshman year at St. Olaf College. I was visiting a friend in Burnsville Minnesota who was joining me at St. Olaf College. I went on a date with a girl from Lesuer Minnesota and she met me in Shakopee. At the time Shakopee Mn was mostly farmland and we parked in an open area. It was quiet and dark out that night because there wasn't many homes or businesses there to illuminate the area. We first noticed the ufo when we saw an extremely bright light in the sky. It seemed as high as the other stars. We thought it was a star and spoke about how bright that star was. We listened to about 6 songs on the radio and talked when I noticed that the star was moving. I told the young lady I was with that it was moving and she told me I was seeing things and waved her hand in front of me. She then sat up and saw the same thing I was seeing. The object within 2 or 3 minutes was down from high in the sky to down on the horizon and coming towards us. I would guess within another minute or so it was very close to us and going directly over the top of my car. I then told her that I needed to see what this thing was that was now on top of us. The girl was hysterically crying and scared to death. She jumped under the dash of my 78 Impala and I jumped out of the car to see this thing. The object was massive, dark in color and triangular shaped. It moved quietly with no sound approximatley 4-5 mph over the top of the car. It seemed to be maybe 100 yards above my car and had strobing multi colored lights on the bottom. It slowly passed over the car and then suddenly with unimaginable speeed it shot off in the distance. My mother and I called a branch of the military the next day and they questioned me for about 5 minutes. One of the interesting questions they asked me was did I feel that I had a missing block of time or could not remember somethings. I told them I didn't think so. When they were done questioning me they told me not to talk to anyone about this event. I don't know if I can remember everything and hope that you can have someone contact me about recalling the events that continue to consume me over 25 years later."],"Weather Factors":"Does Not Apply","Region":"Minnesota","Date of the Event":"06/20/1981 10:00 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.802846,+-93.517386(13352)&iwloc=A&hl=en\"> mufon case (13352) map </A>","trends":["There have been 3 other sightings in Shakopee","There were no other sightings in Shakopee on or around June 20th 1981"],"Tags":"City","files":["/var/www/straped/mufon/html2text/13352.html.txt","/var/www/straped/mufon/org/13352.html"],"Latitude":"44.802846","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","Object Shape":"Triangle","Object Features":"Undisclosed","Date Submitted":"06/20/1981 10:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","City":"Shakopee"}