{"Object Shape":"Flash, Sphere","Object Features":"None","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/13356.html.txt","/var/www/straped/mufon/org/13356.html"],"Case Number":"13356","Summary":"2 lights flickered behind my car..then merged into one..then went high in the sky..shot a blue bean down","Longitude":"-116.203416","Tags":"City","Disposition":"Unknown","Date of the Event":"06/30/1997 12:00 UTC","Viewing Distance":"21-100 Feet","Source":"MUFON","divs":["Sighting DetailsIn the summer of 97 i went alone on a trip to see a freind in Idaho. I traveled from Texas to Moscow Idaho. As i stopped at a store before I went north onto route 95 thru the Cascade mountains a man told me not to travel thru those parts at that time of night but I continued on.. It must have been around 2-3 in the morning.. I had been on the road alone for hours.. when I saw lights coming up behind me pretty fast..they seemed like normal sized headlights at the time. I was just relieved to not be on the road alone anymore.. I noticed that one of the lights on the vehicle behind me kept flickering brighter than dim..then really bright..as it got brighter it seemed to grow a little larger but not a huge amount bigger.when i looked in the rear view mirror the two lights became one.... Im tryin to figure out what was goin on thru my rear view mirror but then at the same time watch the curvy road in front of me. the the light was considerably larger but then shot up high in the sky.. I tried to see where it went thru my mirrors but was unsuccesful. Then I saw a huge blue beam of light come down onto the road behind me and start catchin up to my car..there was no odd sounds that i could hear or remember... i drove as fast as i could while screamin and crying because I was terrified.. Im not sure what else happened.. I remember finally finding a town with a light on.. I ran inside and asked a man in a little motel if they ever saw strange lights.. i dont remember his answer..but for some reason it was now 5 in the mornin..I called my friend to find out how long it would take me to get to Moscow... he said another hour.. I was scared to get back on the road but even more terrified to stay where i was.. when i got to my friends house and told them what happened they seemed unphased. they told me that \"THEY\" wont hurt me that \"they\" were just checkin me out. 2 girls in the room showed me triangular red markings on their chests on the left side above the breast.. I had the same markings. In the days to follow I had a large pellet in the bottom fo my right foot that made it very uncomfortable to walk.. if I were to turn my foot over and try to see or feel it.. i couldnt find it.. I could only feel it when I walked..the object slowly moved from the pad of my foot..to the back of my foot..then i dont know where it went. for a few years after that incedent.. everything electronic around me went crazy... everything is fine now tho!"],"Country":"United States","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around June 30th 1997"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.614281,+-116.203416(13356)&iwloc=A&hl=en\"> mufon case (13356) map </A>","Latitude":"43.614281","Sighting Duration":"Undisclosed","City":"Boise","Weather Factors":"Unknown","Region":"Idaho","Date Submitted":"06/30/1997 12:00 UTC","Log Number":"US-10292008-0017"}