{"Date Submitted":"03/13/1997 12:00 UTC","divs":["Sighting DetailsWE STEPPED OUTSIDE TO LOOK FOR THE HALE-BOP COMENT ON MARCH 13, 1997. THE SAME EXACT NIGHT AS THE LIGHTS OVER PHOENIX. MY HUSBAND LOOKED UP ONE WAY AND I LOOKED UP ANOTHER WAY. AS SOON AS I LOOKED UP, I SAW A PERFECT TRIANGLE OF STARS. IT WAS TINY, AS IT WAS HIGH UP. SIZE OF A DIME. AS SOON AS I LOOKED AT IT. A LIGHT SHOT OUT FROM THE TIP OF THE TRIANGLE. NOW, THE LIGHT WAS A PIN-PRICK OF A LIGHT. SO, I NEVER TOOK MY EYES OFF OF IT. IT WAS GETTING DIMMER AND DIMMER. I KNEW IT WAS GOING HIGHER AND HIGHER. IT WENT ABOUT HALF THE LENGTH OF OUR HOUSE AT THE TIME, BEFORE I LOST IT FROM SIGHT. I DON'T KNOW WHY, BUT I NEVER LOOKED AT AGAIN. WHEN WE LIVED IN THE THAT HOUSE TO SEE IF THE TRIANGLE WAS ALWAYS THERE IN MARCH. I KNOW NOTHING ABOUT CONSTELLATIONS. SO, I THOUGHT, THAT MUST HAVE BEEN A MOTHER SHIP. I DID SEE A STAR BOOK ONE TIME AND I LOOKED THRU IT REALLY QUICK AND DID FIND SOME STARS THAT WERE IN A TRIANGLE. WE LIVE UP THE HILL FROM THAT HOUSE NOW. SO, I WILL GO DOWN THERE AND LOOK UP IN MARCH. I THINK, LAST MARCH 13, IT WAS CLOUDY, WHEN I THOUGHT OF IT. IF IT IS A CONSTELLATION. IT WOULD BE THERE THE WHOLE MONTH OF MARCH. JUST NOT ON THE 13. WE LIVE IN A HILLY AREA. SO, WE FOUND OUT, WE COULD ONLY SEE THE COMET FROM DOWN THE ROAD."],"Viewing Distance":"Over One Mile","Source":"MUFON","Disposition":"Unknown","Log Number":"US-10292008-0019","files":["/var/www/straped/mufon/html2text/13358.html.txt","/var/www/straped/mufon/org/13358.html"],"Weather Factors":"Unknown","Tags":"City","Sighting Duration":"09:00:00","Case Number":"13358","Summary":"LIGHT SHOT OUT FROM A TRIANGLE, AT HIGH ALTITUDE","City":"Elkview","Country":"United States","Longitude":"-81.473573","trends":["There have been 4 other sightings in Elkview","There were no other sightings in Elkview on or around March 13th 1997"],"Object Shape":"Star-like","Region":"West Virginia","Date of the Event":"03/13/1997 12:00 UTC","Latitude":"38.437961","map":"<A HREF = \"http://maps.google.com/maps?q=38.437961,+-81.473573(13358)&iwloc=A&hl=en\"> mufon case (13358) map </A>","Object Features":"Unknown","Object Flight Path":"Stationary,Straight-line path"}