{"Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Latitude":"32.224566","City":"Stephenville","files":["/var/www/straped/mufon/html2text/13354.html.txt","/var/www/straped/mufon/org/13354.html"],"Region":"Texas","divs":["Sighting DetailsI was driving west down Washington St. at approximately 8:30 p.m. on the night of Thursday, October 23, 2008, towards the square in downtown Stephenville. I was approximately .5 miles away from the first stop sign you come to at the square. I spotted the object in the sky just before you get to the bridge over the creek coming into downtown from the intersection of 281 and Washington St. I noticed it because I was looking at the top of the Courthouse and a light in the sky caught my attention. The light was located to the left of the top of the courthouse, and at about a 10 o'clock position from the top of the courthouse. It would have been located to the southwest of town. When I first saw it, I thought it might be a flare or a firework, the the intensity of the light never faded. At further inspection, the object had a orange glow to it, and it was very bright and looked to be fairly large. It did not look to be moving, or if it was, it was moving very slow. It looked as if there was a trail of light behind it. I slowed down to take a more deliberate look, and the object looked as if it split apart, and before I knew it, it disappeared. The entire time I saw it, the object maintained the orange color, even when it \"split\" apart. Like I said before, at first sight I thought it to be a flare or firework of some sort, but it maintained its level of brightness and it seemed to be stationary. Once it disappeared, it never resurfaced."],"Date Submitted":"10/23/2008 08:30 UTC","Object Flight Path":"Undisclosed","trends":["There have been 74 other sightings in Stephenville","There were 6 other sightings in Stephenville on or around October 23rd 2008"],"Longitude":"-98.200563","Viewing Distance":"Unknown","Log Number":"US-10292008-0015","Summary":"Orange, large object that split into two then disappeared","Tags":"City","Country":"United States","Date of the Event":"10/23/2008 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.224566,+-98.200563(13354)&iwloc=A&hl=en\"> mufon case (13354) map </A>","Object Shape":"Undisclosed","Case Number":"13354","Weather Factors":"Unknown"}