{"Latitude":"32.677918","Longitude":"-97.263961","Region":"Texas","Object Shape":"Other","Log Number":"US-10292008-0011","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Forest Hill","There was one other sighting in Forest Hill on or around November 30th 1977"],"Source":"MUFON","City":"Forest Hill","divs":["sighting detailsin 1977\\1978 i was living in forest hill, texas. i only remember the approx. year. i was only about 21 years old and had bs'd my way into a job in which i had no skills. one skill i needed was typing so i had immediately enrolled in a night typing course which was in fort worth, texas. i was traveling home on i-20 east. there was not much traffic that time of night. as a matter of fact i do not remember any traffic being present at all which now seems rather strange to me. all of a sudden there was a huge light that was the brightest light i have ever seen, before or since, in my life. while being a bright light it also seemed very white. i slowed down to see what it was but could only see the light. i then realized what the light was showing me. there was a mattress in the lane ahead of me that i would have never seen which would have caused me to have an accident. i pulled to the side of the road forgetting about the mattress and rolled down my window. my first thought was that it was a helicopter but there was absolutely no sound. when i say no sound i mean no sound as in any normal sounds of night or traffic much less a helicopter sound. i wasn't scared. as a matter of a fact i felt a feeling of peace like i have never felt. all of a sudden the light was gone. i went straight home and called carswell air force base in fort worth, texas to report what had just happened. the man they had me talk with said there was absolutely nothing in the area but yet he then questioned me about the whole incident. i never knew who else to report this to until i saw the show \"ufos over earth\" and got the name of your organization. a few months back i came in on some tv show that someone had reported basically the same event in the same time frame and area. unfortunately i didn't know who to contact about that show. what i experienced back then was the most awesome and peaceful event that anyone could experience. i do not know what it was but i do know it was real, very real. whatever or whoever it was saved me from what could have been a horrible accident. it could not have been some thing from this earth."],"Date of the Event":"11/30/1977 12:00 UTC","Case Number":"13350","Summary":"Brightest light I have ever seen in my life yet it was white with absolutely no sound.","Country":"United States","files":["/var/www/straped/mufon/html2text/13350.html.txt","/var/www/straped/mufon/org/13350.html"],"Date Submitted":"11/30/1977 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.677918,+-97.263961(13350)&iwloc=A&hl=en\"> mufon case (13350) map </A>","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Disposition":"Unknown","Object Features":"Undisclosed"}