{"Tags":"City","Date Submitted":"07/28/2008 03:00 UTC","Weather Factors":"None","Date of the Event":"07/28/2008 03:00 UTC","Longitude":"-97.213953","Latitude":"29.823406","Region":"Texas","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10292008-0027","Summary":"Pulsating light with litle ones underneath","map":"<A HREF = \"http://maps.google.com/maps?q=29.823406,+-97.213953(13366)&iwloc=A&hl=en\"> mufon case (13366) map </A>","Source":"MUFON","City":"Cistern","trends":["There have been 2 other sightings in Cistern","There were no other sightings in Cistern on or around July 28th 2008"],"Disposition":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsWe were southbound on HWY 95, 1 mile N. of Cistern when we first spotted the UFO. We went to our driveway and sat by the cattleguard and notised it was getting brighter & pulsatting. We could see it thru the trees. We saw 2 faint blinking lights under the larger craft. We moved closer then a plane flew by. We moved again and saw other blinking ufo's , we decided to go to the house because it was getting closer .Then we saw another blinking light under the 2 smaller lights. we stopped and saw something fall from the sky from the larger ufo or mothership(the top UFO). It was a green tail light that lasted exactly 5 minutes.The bright UFO lite the sky up. Later we both saw another object fall from the mothership with a green tail light fall to the ground. we decided to go inside beacuse we were scared!The Am there were 3 black hawk helicopters checking out the area we saw the occurance.During the event the animals were bothered and it got really cold where we were.The sky looked like dawn just starting although that was a few hours away."],"Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Hovering then path,Path then hovering","files":["/var/www/straped/mufon/html2text/13366.html.txt","/var/www/straped/mufon/org/13366.html"],"Object Shape":"Cross, Star-like","Case Number":"13366"}