{"Summary":"V Formation of Yellow Lights","Region":"Florida","files":["/var/www/straped/mufon/html2text/13363.html.txt","/var/www/straped/mufon/org/13363.html"],"Source":"MUFON","Country":"United States","Object Shape":"Chevron","Weather Factors":"None","City":"Coral Gables","map":"<A HREF = \"http://maps.google.com/maps?q=25.72149,+-80.268384(13363)&iwloc=A&hl=en\"> mufon case (13363) map </A>","Object Features":"Unknown","Case Number":"13363","Date Submitted":"10/28/2008 09:55 UTC","trends":["There have been 3 other sightings in Coral Gables","There were no other sightings in Coral Gables on or around October 28th 2008"],"Object Flight Path":"Straight-line path","Log Number":"US-10292008-0024","Sighting Duration":"Undisclosed","Latitude":"25.72149","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Longitude":"-80.268384","Tags":"City","divs":["sighting detailscoral gables, fl, 10\\28\\08, 9:55 pm. taking a walk in the cool clear night before i went to bed. i am an amateur astronomer so i was looking at the clear night sky identifying constellations and stars. just before i went in i stepped into the middle of my street to get a good look to the east to see what constellations were rising, so i was looking for faint stars in the light glow of the city. i noticed a v formation of faint yellow\\gold lights moving from north to south. there were no flashing or blinking lights and no non-yellow lights, just steady faint yellow lights in a v formation. there were approx four to five lights in each leg of the v, possibly nine or ten in total. it gave the impression of being distant, high, or far away. there was no sound associated with the lights. at one point the v formation suddenly became sloppy with the lights going out of alignment into a very rough formation and then suddenly and quickly they came back into a perfect v. this quick movement out of and back into a v was odd looking, it did not seem like \"normal\" movement. i lost sight of the v formation as it moved behind a tall building. this all there is to say, nothing more to add."],"Date of the Event":"10/28/2008 09:55 UTC"}