{"Viewing Distance":"Over One Mile","Object Flight Path":"Other","Region":"Oklahoma","Summary":"Camping at Lake Murray witnessed orange light zig-zag extremely fast","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.174261,+-97.143625(13361)&iwloc=A&hl=en\"> mufon case (13361) map </A>","Disposition":"Unknown","Date of the Event":"10/25/2008 10:30 UTC","Case Number":"13361","Latitude":"34.174261","Source":"MUFON","Object Features":"Unknown","Longitude":"-97.143625","Date Submitted":"10/25/2008 10:30 UTC","trends":["There have been 4 other sightings in Ardmore","There were no other sightings in Ardmore on or around October 25th 2008"],"City":"Ardmore","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/13361.html.txt","/var/www/straped/mufon/org/13361.html"],"divs":["Sighting DetailsI was camping with my 13 year old daughter at Lake Murray near Ardmore Oklahoma over the weekend and I was setting up my walmart special telescope looking for a star or planet or something i could try to actually find through the viewfinder. I was looking west and noticed an orange light that looked like a star but much brighter. After looking at it for maybe 10-15 seconds it looked like it was moving up and down, almost like it was bouncing. I called my daughter over and told her to look at that star and see if it looks like its moving. Thats when the object started making eratic movements side to side makin zig-zags then it looked like it might have made a spiral movement upwards then it would sit still then a few more zig-zags and bounces then it slowly fell behind the tree line. I asked my daughter what that was and she said \"That was a UFO\". I best estimate is the object was at least 5 to 7 miles away, possibly more and the distance it traveled in the sky while making zig-zags had to be close to a mile or more. The speed it made these movements seems to rule out anything inside flying it since it would be smashed against the inside and I have never seen anything move that fast except in cartoons so I would like to know what the heck it was and what it was doing. I have read a lot of posts here on mufon with similar sightings but not one single answer."],"Country":"United States","Log Number":"US-10292008-0022","Object Shape":"Star-like"}