{"Tags":"City","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"05/25/2008 01:00 UTC","Object Features":"None","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around May 25th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Other","Disposition":"Unknown","divs":["Sighting DetailsMay 25, 2008 1:00 am I went to Manhattan with my sister in law and her husband to see the Indiana Jones movie. When we were on the Long Island Expressway headed back to Queens, about 1:00Am; I looked up at the moon. It was almost full but not quite. It was bright. There was a thick black line going almost all the way across the moon!! Hold up a CD and put a black pen in front of it, directly under the middle, that's how it looked!! At first I thought it was clouds covering it, but the edges of the line were straight and the line stayed perfectly straight for about five minutes. It couldn't have been a satellite or space station because the line stretched almost all the way across the moon; way too large. It was directly in front of the moon and seemed to be closer to the moon than the Earth. When I first saw it, it was above the middle it gradually got lower and lower. After five minutes it was gone. Everybody in the car saw it, no one could figure out what it was. Unfortunately, I did not have camera or camcorder with me. However, I drew this bizarre image as soon as I got home that night. I've included this picture as an attachment. This is perhaps one of the strangest things I have seen in my life. I would like to know what this can possibly be, and if others had similar sightings around that time. Thank you"],"Log Number":"US-10292008-0038","Object Shape":"Other","Latitude":"40.793304","Summary":"Moon was almost a full moon. I saw a solid straight black line infront of the moon, almost completely covered the entire width.","Region":"New York","Date Submitted":"05/25/2008 01:00 UTC","City":"New York","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.793304,+-73.96389(13377)&iwloc=A&hl=en\"> mufon case (13377) map </A>","files":["/var/www/straped/mufon/html2text/13377.html.txt","/var/www/straped/mufon/more/13377_submitter_file1__JGDrawingofUFOscan.jpg","/var/www/straped/mufon/org/13377.html"],"Longitude":"-73.96389","Weather Factors":"None","Case Number":"13377","Sighting Duration":"00:05:00"}