{"Source":"MUFON","Region":"Washington","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around October 28th 2008"],"Case Number":"13378","Country":"United States","Tags":"City","Object Features":"Unknown","Date of the Event":"10/28/2008 07:30 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Date Submitted":"10/28/2008 07:30 UTC","Log Number":"US-10302008-0001","files":["/var/www/straped/mufon/html2text/13378.html.txt","/var/www/straped/mufon/org/13378.html"],"Weather Factors":"None","Summary":"I saw 3 lights while driving, Then one light stand still for a couple minutes, then it started to move.","divs":["Sighting DetailsThis took place in Bremerton, Wa. I was delivering a pizza for my job. My destination was 11th st place. I was going from the store, which is on the east side, to my destination. While i was crossing the Warren Ave bridge i looked to my left and three lights up in the sky. About 9 o clock to me. They were very bright. Brighter than stars. The lights were vertical with space between them, and it seemed like the outside lights were spreading further apart. Since i was driving and couldnt stop on the bridge, they soon were out of sight for me. And at the time i thought it looked weird but thought that it could just be flares. so after i crossed the bridge they were out of sight for me. i realized that my pizza delivery destination was near the water, where i would be able to see it, if it was still there. when i was able to see it again, there was only one light. i got out of my car and moved to where i could see it best. from where i was standing it looked to be over the port orchard area, but it was difficult for me to tell distances. i stood and watched it for about 3 minutes. it was very bright. and was basically still, not moving, except for small movements in a kind of wobbley way. after about 3 minutes, the light slowly dimmed. then all of a sudden it started to move. it moved to my left, which would be to the east. as it moved it got dimmer and dimmer, and then started to blink like a plane. then it just looked like a plane at night moving to the east until it was out of my sight. as soon as it started to move i said \"what?\" out loud. after this whole thing happened, i delivered the pizza and had to hold back from telling the people i was delivering to. then i called my wife and told her and drove back to the store. crazy."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.57765,+-122.6487(13378)&iwloc=A&hl=en\"> mufon case (13378) map </A>","Longitude":"-122.6487","Object Shape":"Star-like","Disposition":"Insufficient Data","City":"Bremerton","Viewing Distance":"Unknown","Latitude":"47.57765"}