{"trends":[],"Date of the Event":"10/29/2008 08:45 UTC","Object Features":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=31.974199,+-99.893513(13385)&iwloc=A&hl=en\"> mufon case (13385) map </A>","Source":"MUFON","City":"Undisclosed","Latitude":"31.974199","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Unknown","Summary":"In Southern Sky (Rural Comanche County)","Sighting Duration":"00:15:00","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/13385.html.txt","/var/www/straped/mufon/org/13385.html"],"Tags":"City","Case Number":"13385","Weather Factors":"Unknown","Date Submitted":"10/29/2008 08:45 UTC","Disposition":"Unknown","Longitude":"-99.893513","divs":["Sighting DetailsMy husband and I were leaving home to drive to DeLeon, TX (about 16 miles from our home) where we had seen the UFO's the previous night (Tuesday, October 27, 2008). As I approached the passenger side of our truck I looked south to see bright white lights. They appeared to be blinking on and off and with each blink they appeared to zoom up and down and from side to side. The blinks looked some like a code. When a plane appeared they blinked another signal and disappeared. The night before at DeLeon they put on a spectacular show which scared my daughter's dogs and cats as well as my granddaughter (10 years old). On the 27,2008 it was my young granddaughter who came running to her mother's shop telling her there was something strange going on in the sky just south of her home. My daughter, granddaughter, my daughter's husband, and my husband all witnessed the show. Both my daughter's husband and my husband seemed to think it was a plane but all was silent until a plane suddenly appeared from the west headed toward the east. It was then that the UFO's made some final blinks and simply disappeared. That was not unlike tonight's visual they too appeared randomly until a plane crossed this time from east to west and then the UFO's disappeared into the sky. Both locations are rural areas. There is limited light at night (both locations) and the sky was clear, the moon was not visible. There were stars and a planet visible in the western sky though we could not see any in the area where we saw the UFO's. The flashing lights on the UFO and the sudden sound of a plane shortly before the UFO's vanishment was eerie to say the least. My granddaughter attempted to take pictures but failed to capture them although minutes later she readily filmed her cats."],"Log Number":"US-10302008-0008"}