{"Object Shape":"Circle, Disc, Egg, Oval, Sphere","Viewing Distance":"Unknown","City":"Ottawa","map":"<A HREF = \"http://maps.google.com/maps?q=41.349449,+-88.839027(13384)&iwloc=A&hl=en\"> mufon case (13384) map </A>","Log Number":"US-10302008-0007","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"10/12/2008 12:00 UTC","Region":"Illinois","Source":"MUFON","Disposition":"Unknown","Tags":"City","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around October 12th 2008","This sighting has never been favorited.",""],"Longitude":"-88.839027","Date Submitted":"10/12/2008 12:00 UTC","Latitude":"41.349449","Case Number":"13384","Summary":"Grey oval shaped object in a bright section of cloud with a disc shape object to its right.","divs":["Sighting DetailsMy family and I were on our way out the door to pick up our dinner. When we got out to my truck from my house which is located in Ottawa,Il a bright section of cloud cover caught my eye. When I looked up at it I noticed a dark gray oval shape in that section of cloud which was to the west of Ottawa. I asked my wife what she thought it was. She thought it may just be a small dark cloud. Upon further viewing, it became evident that it was not because it never moved and it had a weird shape. I decided to take pictures of it with my camera which is a Nikon coolpix 7.1 mp. The first picture was with no zoom. The second and third picture was zoomed in about half way. We watched the object for about five more minutes or so. To the human eye it didn't really have much definition. We left to pick up dinner. A little more than a week passed before I reviewed the pictures that I took. When I loaded them on to my computer which is hooked up to a 47 inch HD tv, I was totally blown away by what I had captured! The camera picked up way more definition than my eyes. The first picture I took of the oval shape has a solid object in the center and to the right of it and slightly higher is a classic saucer shaped object! I'm 99.9% sure this was not visible to my eyes. I have included all three pictures totally untouched. What you see is what the camera saw. Please contact me for any additional info that you may need."],"files":["/var/www/straped/mufon/html2text/13384.html.txt","/var/www/straped/mufon/more/13384_submitter_file1__Picture035.jpg","/var/www/straped/mufon/more/13384_submitter_file2__Picture036.jpg","/var/www/straped/mufon/more/13384_submitter_file3__Picture037.jpg","/var/www/straped/mufon/org/13384.html"],"Country":"United States","Object Features":"Unknown"}