{"Viewing Distance":"Unknown","Log Number":"US-10302008-0005","files":["/var/www/straped/mufon/html2text/13382.html.txt","/var/www/straped/mufon/org/13382.html"],"Tags":"City","Country":"United States","trends":["there have been no other sightings in cms\\sg n\\a","This sighting has never been favorited."],"Date Submitted":"10/29/2008 12:00 UTC","Longitude":"-81.514174","Latitude":"27.666437","Object Flight Path":"Undisclosed","Case Number":"13382","map":"<A HREF = \"http://maps.google.com/maps?q=27.666437,+-81.514174(13382)&iwloc=A&hl=en\"> mufon case (13382) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Florida","Date of the Event":"10/29/2008 12:00 UTC","Object Shape":"Other","City":"CMS/sg n/a","Object Features":"Undisclosed","Disposition":"Insufficient Data","Summary":"comment on illinous sighting","divs":["Sighting DetailsDear UFO Hunters, I was watching your program tonight and after seeing these 3 lights in a rotating fix manner it appeared that these so called light were scanning the earth or an aera of interest, why have 3 lights go in a random path, if they are smart enough to plan and exicute this type of display then I would assume they have a real motive, I would look into the idea that they may be scanning the earth with this slow turn fix type frame, maybe deep with in the earth, my first impression was a grid 1500x1500 would be big enough to cover a large area. I just thought you might like a new Idea as to what they would want What looks like random lights could very well be some kind of scanner of some kind, they have become more brazen in the last severe years as if they really dont care if there seen, I wish I had been there as I have a million candle spot light to pearse the knight with to see if this oject was a solid mass, was there any visible stars or lights from helicopter that past behind oject and was blacked out??they left running lights on and appear to have been in a stealth mode for main body, or sencors on it tips for navigation, Just a thought I might send to ya all. Again keep it up, soon very soon this UFO and USO will be in the open, everyong is watching, we need that daylight close up. Mr Dana Cannon, sky watcher"]}