{"Weather Factors":"None","Region":"Michigan","files":["/var/www/straped/mufon/html2text/13398.html.txt","/var/www/straped/mufon/org/13398.html"],"trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around October 29th 2008"],"Date of the Event":"10/29/2008 07:35 UTC","Tags":"City","divs":["Sighting DetailsI was standing outside my house looking southward (toward Detroit Metro Airport which is about 10 miles straight south from my house) and admiring all the airplane lights in the sky. There were so many because it was so clear and I could see them practically to the horizon and many more stars were visible than usual. I noticed a large round and very white ball crossing from east to west moving much faster than an airplane would. It appeared to be a fireball. When I first saw it, I was confused because it was so big. If the airplane lights were the size of the period at the end of the sentence, this object was the size of a dime held about seven feet from my eyes. I was afraid it was a large meteor and it was going to crash into a populated area. It moved in a straight line, it did not appear to lose altitude, the light seemed as if I was looking at more of a light bulb than a fireball, except there was a tail that made the overall shape appear to be a long oval. I tried to remember everything because I knew I was going to report it to MUFON. I was first confused, then concerned, then just amazed. The amazement came when the object simply disappeared with no change in altitude, no fading, no trailing pieces. I watched for a few more minutes but nothing else happened. It disappeared at what I would describe a 2 o'clock position, and I remember thinking that I did not want to lose sight of it behind a tree. The leaves are off the tree. The object disappeared as it approached the tree, which was my object of reference."],"Longitude":"-83.34963","Source":"MUFON","Disposition":"IFO","Log Number":"US-10302008-0021","Latitude":"42.36941","map":"<A HREF = \"http://maps.google.com/maps?q=42.36941,+-83.34963(13398)&iwloc=A&hl=en\"> mufon case (13398) map </A>","Case Number":"13398","Sighting Duration":"00:00:07","Summary":"Fireball crossed the sky, disappeared.","Date Submitted":"10/29/2008 07:35 UTC","Object Shape":"Fireball, Oval","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","City":"Livonia","Object Flight Path":"Straight-line path"}