{"divs":["sighting detailsthis is the accounting that i posted on http:\\\\lucianarchy.proboards21.com\\index.cgi?board=ufotexas&action=display&thread=4329&page=1 i was traveling last night from ranger to wards lake leon around 7:45 and seen the weirdest lights in the sky. i had never seen anything like it. i was on the cell phone with my brother who was approx. 20 miles north west of ranger and when i started hollering at him about the lights...he ask what direction and i told him toward the dam at lake leon...then he could see them. he had never seen anything like it either. the lights were big...maybe softball sized in my windshield at their most intense. they came and went...and it was almost like they started small and then ballooned to wards me...getting bigger and more intense. the color was kinda amber or at time a white with a reddish aura and smaller colored lights blending in or kinda around the bigger light. i know i am not describing this well...but i just have never seen anything like it. my brother said it was almost like the marfa lights..but not quite....that this was bigger and more intense. i was glad he seen it...because my husband thought i was nuts when i got home. i live on the other side of the lake. about thirty minutes after i got home...we had three low flying planes circle around the lake and then fly over our home. this was kinda odd as they were circling and very very low....but they were definitely planes. my parents who live over close to chaney high way said when they first seen the planes there were four and they separated. three went to the lake and one went back from the direction it come...desdamona area. i went inside and posted that i had seen weird lights on the eastland spin. time was round 8:30. about 8:45, my brother called me and he had gotten home (he lives out close to the lake too). he told me to go out side and see if i could hear anything weird. once outside...first thing i noticed was all the dogs in the neighborhood were barking and the cows in the pasture behind my home were all bawling. my lab was worked up...jumping off the porch and running around the yard and then back to me. his hair on his back was standing up...and he was shaking all over. this lasted about 10 minutes and then he calmed down and all the barking of the neighborhood dogs subsided. my brother said his dogs were howling and one kept chewing on her leg. i don't know if the animals acting odd was related at all...just thought that was interesting. overall...last night was one of the weirdest nights i have ever experienced."],"Case Number":"13395","Weather Factors":"Unknown","City":"Ranger","Object Shape":"Circle, Oval","Region":"Texas","files":["/var/www/straped/mufon/html2text/13395.html.txt","/var/www/straped/mufon/org/13395.html"],"trends":["There have been 4 other sightings in Ranger","There were no other sightings in Ranger on or around October 28th 2008"],"Date Submitted":"10/28/2008 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-98.672468","Latitude":"32.477802","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.477802,+-98.672468(13395)&iwloc=A&hl=en\"> mufon case (13395) map </A>","Disposition":"Unknown","Country":"United States","Log Number":"US-10302008-0018","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"Unknown","Summary":"I was driving south on 2461 and the first time I seen any lightd was about a half a mile before I got to the 570 intersection. The lights were towards the south east., maybe like the direction of desdemona.","Date of the Event":"10/28/2008 12:00 UTC"}