{"Summary":"3-5 BRIGHT ORANGE LIGHTS APPEARED THEN DISSAPPEARED","trends":["There have been 13 other sightings in De Leon","There were no other sightings in De Leon on or around October 29th 2008"],"Log Number":"US-10302008-0015","divs":["Sighting DetailsI WAS DRIVING FROM MINERAL WELLS TO COMANCHE TEXAS ON HWY 16 SOUTH. I WAS APPROX. 3.5 MILES NORTH OF DELEON TEXAS WHEN A HUGE PBJECT APPEARED IN THE DARK NIGHT SKY. IT WAS HARD TO TELL THE SIZE AND EXACT SHAPE BECAUSE IT DID NOT LAS LONG, IT WAS PROBABLY 2-3 FOOTBALL FIELD LENGHTS IN SIZE AND HAD 3-5 BRIGHT ORAGNE LIGHTS THAT WERE APPOX. THE SIZE OF A BUS THAT ROTATED FROM LEFT TO RIGHT AND WAS FOLLOWED UP BY A BLUISH OR GREENISH LIGHT THEN DISAPPEARED. I PULLED OVER WHEN I SAW THIS AND TOLD THE PERSON THAT I WAS ON THE PHONE WITH THAT I HAD TO GO BECASUE I SAW SOMETHING WEIRD AND WANTED O CONCENTRATE ON WHAT THIS WAS. I WATCHED IT FOR A LONG TIME AFTER IT DISAPPEARED AND ALL THAT I COULD SEE WAS TWO BLUISH OR GREENISH LIGHT THAT WERE ABOUT 1-2 FOOTBALL FIELD LENGTHS APART THAT MOVED ACROSS THE HORIZON AT VERY FAST SPEEDS UP AND DOWN UNLIKE ANY MOVEMENT SEEN IN THE SKY BEFORE. I DECIDED TO START DRIVING AGAIN BECAUSE IT NEVER REAPPEARED AND I FELT STUPID SITTING THERE THINKING ABOUT WHAT I SAW. NOT SURE WHAT IT WAS AND CAN NOT BELIEVE THAT I AM EVEN REPORTING SUCH A THING BUT, FIGURED WHAT THE HECK, THIS MIGHT BE SOMETHING THAT COULD HELP OUT."],"Longitude":"-98.530362","Disposition":"Unknown","Case Number":"13392","Object Features":"Unknown","Date of the Event":"10/29/2008 07:40 UTC","files":["/var/www/straped/mufon/html2text/13392.html.txt","/var/www/straped/mufon/org/13392.html"],"Object Shape":"Sphere","Region":"Texas","Latitude":"32.115414","Weather Factors":"Unknown","Country":"United States","Tags":"City","Object Flight Path":"Hovering then path","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/29/2008 07:40 UTC","City":"De Leon","map":"<A HREF = \"http://maps.google.com/maps?q=32.115414,+-98.530362(13392)&iwloc=A&hl=en\"> mufon case (13392) map </A>","Sighting Duration":"Undisclosed"}