{"City":"Murrieta","Source":"MUFON","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/13393.html.txt","/var/www/straped/mufon/org/13393.html"],"Country":"United States","trends":["There have been 7 other sightings in Murrieta","There were no other sightings in Murrieta on or around October 30th 2008"],"Object Flight Path":"Hovering then path","Date of the Event":"10/30/2008 06:00 UTC","Longitude":"-117.213923","Case Number":"13393","map":"<A HREF = \"http://maps.google.com/maps?q=33.553914,+-117.213923(13393)&iwloc=A&hl=en\"> mufon case (13393) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"10/30/2008 06:00 UTC","Disposition":"IFO","Log Number":"US-10302008-0016","Summary":"viewed from bedroom window by wife and son","Tags":"City","Weather Factors":"None","Latitude":"33.553914","Object Features":"Unknown","Object Shape":"Other","Region":"California","divs":["Sighting DetailsMy wife told me this morning that she and my son saw a UFO from my son's bedroom window at 6:00 am this morning. Luckily my wife saw it as well or we might have chalked it up as our sons imagination as we were watching UFO Hunters last night. Their accounts are a little different but my wife's eyes aren't what they used to be without her glasses. My Son's account: He says he woke up, go out of bed and was looking out his window as always does. He saw a light in the sky (looking outhis window would be facing approximately 27 degrees South East. My son says he saw it and new it couldn't be a plane or a helicopter. It was bright and sitting still and pulsating. He says it's shape was like an ear plug. The best we could get out him is that looked mostly like along upside down bell. He says he saw it turn red once and saw light or something shoot out it's sides (whereas) my wife didn't see something shoot out the sides. Then it slowly lowered down a bit from watching my wife's finger movement, I am guessing maybe 1,000 - 2,000 feet. and then slowly went back up into the sky and behind the clouds. My wife's account: She saw it when my son pointed it out. She says it looked like a bright shimmering star. She says it was too bright and pulsated way too much to be a star. Then her account is the same of it dropping down slowly, then rising back up and ddisappearing behind the clouds. If it's any help, two nights before, about 12:30 am, I was out side smoking a cigarette and noticed a star I haven't noticed before (I watch and study the star movements almost every night) to the East. It was the lowest start in the sky. I noticed it becasue if its brilliance. It was about the brightest start in the sky yet no where near the biggest. It was pulsating red, green, blue just like a star does. However, I have never seen a star with colors that noticeable before. I watched it for a good 10 minutes and it never moved. I figured it was a star but noted where it was and decided to check out it's location the next night (last night). Last night I went out at 11:30 pm and I saw nothing like the night before. I did see a very very small, dull, almost not visible star in around the same location. Was it the smae star? I don't think so but maybe? The difference between the two nights and the object in question was definitely two different things to me. Over the last few months, during the days, I have been seeing things in the sky that I can't classify as airplanes. I can't say exactly what I have been witnessing, but the events are striking me as something other than typical aircraft and typical aircraft behavior. If you want specifics on these efvents, I can get more specific. Thank you for your time, Wife: 42 son: 9 Brent Dougherty"]}