{"Case Number":"13405","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"Large, dark object with strange \"lights\" flies silently, directly overhead.","City":"Burlington","Date of the Event":"10/08/2008 05:05 UTC","divs":["Sighting DetailsI was walking across the bus park, on the way to check out my assigned bus for my morning commuter \"county connector\" run to Everett, when something caused me to look up. There, in the pre-dawn blackness, directly above me, I saw a large, dark object passing over, in a general south to north direction. This object, while appearing to be at a relatively low alititude (hard to judge accurately in the dark), was completely silent; I heard no sound whatsoever at any time during this sighting. This object was large, and had a generally circular shape, but with protrusions on the leading edge. It appeared to be black, or, more like it was colorless and was somehow \"reflecting\" the color or the night. On its underside there were two equally-sized circular openings which glowed in a phosphorescent green. This was a glow and did not appear to be any sort of lighting, as we normally see it. My guess is that it was suggestive of some sort of energy source, or some other, unknown application. These openings were large, each taking up about half of its side of the underside of the object. Other than that I could see little detail. I did get a good enough look at its starboard side to see that it was definitely three-dimensional. Whatever it was, I would estimate that it was flying at about 200-300 miles per hour, at an altitude of less than 2000 feet. I watched it for a good 4-5 seconds and then it disappeared into the night. Now, I have done 20 years in the military, and have observed numerous types of aircraft in a wide variety of applications, including day and night close air support under combat conditions. I have been around military aircraft (and in them) long enough to have a pretty good idea what they look like, move like and sound like. This fella is clear outside the scope of my experience. I left me feeling kind of dumbfounded. I didn't feel threatened or frightened, but my curiousity has definitely been at work. What was this? Why was it flying so low and letting itself be seen. Who or what is crewing it? And, most of all: why is it here???"],"Log Number":"US-10302008-0027","Date Submitted":"10/08/2008 05:05 UTC","files":["/var/www/straped/mufon/html2text/13405.html.txt","/var/www/straped/mufon/org/13405.html"],"trends":["There have been 8 other sightings in Burlington","There were no other sightings in Burlington on or around October 8th 2008"],"Region":"Washington","Longitude":"-122.325438","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=48.475662,+-122.325438(13405)&iwloc=A&hl=en\"> mufon case (13405) map </A>","Object Shape":"Other","Latitude":"48.475662","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Country":"United States"}