{"Sighting Duration":"00:05:00","Date of the Event":"10/24/2008 06:30 UTC","Longitude":"-88.778788","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in between Elkhorn and Darie","This sighting has never been favorited."],"Region":"Wisconsin","Log Number":"US-10302008-0025","Country":"United States","Source":"MUFON","Tags":"City","City":"between Elkhorn and Darie","Disposition":"Insufficient Data","Latitude":"43.78944","Summary":"Multi-circular object flew over me while in my car with beam of light pointed ahead of it","divs":["Sighting DetailsI was heading home after work. I take I-43 south for about 19 miles. I got on the interstate, set the cruise and started my long drive home. Approximately 2-3 minutes into my drive I noticed what appeared to be a bright star in the western sky. I determined that is was a star so I took my eyes off of it and continued. I looked at it again and it appeared to be moving. I thought it was my eyes playing tricks on me, so I looked again, and I noticed it was moving. It was moving towards my general direction. I also noticed that the sky was overcast, so it couldn't be a star. I was heading west, southwest on I-43 south. The light was headig east, southeast. As it got closer, I noticed that the bright light was a type of spotlight, beaming ahead of the object. It did not appear to be sweeping the light side to side, just ahead and down at about a 30-35 degree angle. The object was 3 spheres connected together, in an L shape. They appeared to be roughly 10-15 feet in diameter, accept for the end sphere. That one looked a tad smaller, about 8-10 feet in diameter. It could be the way the configuration was that made the last one appear smaller, but it appeared that way. It was moving very slow. It had no typical flashing lights like a helicopter or small plane. there were however lights on the object. Very dull lights on the spheres, bright enough to give me a view of the shape. I almost ran off of the interstate looking at this, I didn't want to take my eyes off of it. As it passed me I saw it in my mirrors, and it had a slow pulsating red light, almost a glowing effect. I was able to keep it in view of my mirrors for a few minutes. I regret not getting out and really looking at this. I was , I guess, stunned, trying to explain it away, in denial? I then turned around and started to see if I could catch up to it, and could not find it again. Shortly thereafter it started to rain and there were a few flashes of lightning in the southern sky. I then proceeded home."],"Object Features":"Window(s)","Case Number":"13402","Object Flight Path":"Straight-line path","Weather Factors":"Lightning, Rain, Light","map":"<A HREF = \"http://maps.google.com/maps?q=43.78944,+-88.778788(13402)&iwloc=A&hl=en\"> mufon case (13402) map </A>","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/13402.html.txt","/var/www/straped/mufon/org/13402.html"],"Date Submitted":"10/24/2008 06:30 UTC"}