{"Weather Factors":"Unknown","Longitude":"-82.456603","map":"<A HREF = \"http://maps.google.com/maps?q=29.053343,+-82.456603(13404)&iwloc=A&hl=en\"> mufon case (13404) map </A>","Viewing Distance":"Unknown","Latitude":"29.053343","Source":"MUFON","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/13404.html.txt","/var/www/straped/mufon/org/13404.html"],"Sighting Duration":"Undisclosed","Log Number":"US-10302008-0027","Disposition":"Insufficient Data","Tags":"City","Case Number":"13404","Summary":"orange sphere1ft dia,grew to vw beetle size and back to 1 ft,1-3ft. off ground","Country":"United States","trends":["There has been one other sighting in Dunnellon","There were no other sightings in Dunnellon on or around November 10th 1969"],"Date Submitted":"11/10/1969 12:00 UTC","Object Shape":"Sphere","Date of the Event":"11/10/1969 12:00 UTC","divs":["sighting detailsi just started reading your web site,preety neet stuf,i will be watching your show.thought i might as well join the band wagen and tell my story as crazy it mite be.i was in high school at the time in so. fla. my parents had just bought 20acres in so. marion co,it was,at the time,in the middle of no where (bfe).my parent asked me if i would like to ask my fishin\\huntin buddy(will call him chet for now)if he would like to go to the property this weekend to do some hunting.yea you bet he would,thats all we ever did when we were young,that and chase girls.at that time my parents had put a small travel trailer on the property.we had a verry cool chevy chevelle station wagon, it worked gerat for hunt,fish.that sat. nite it was pretty cool air ,about low 50.my parents stayed in the trailer and chet and i stayed in the wagon.we had our sleeping bags laid out inside with a 12ga. ,22and a 410ga shot gun in between us. the 22 had a small scope on it and chet brought his dads binoculers with him.about 3am we both woke up,in side the tree line(50yrds away)30yrds into the treeswe saw a orange glowing perfect ball hovering 1-3ft off the ground.it would grow up and down from the size of a basket ball to the size of a vw beetle.i told chet lets go out there,he looked at it with the binoculars and firmly said no!i said ,hay we got guns.another firm no was his answer.he was afraid of something, i did not understand this from him.i was always the chicken [cms\\pd] of the two of us!seconds later his head hit the pillow as if he was shot.thats all i remember,i to must have \"passed out\".next day we took alook at the area where we saw this thing,no sign of fire,foot prints made by man or even wildlife.the trees had no leaves on them(time of year).to this day chet will not talk of the event,but before we both die i`ll beat it out of him as to what happen in those woods to scare him so bad!"],"Region":"Florida","City":"Dunnellon","Object Flight Path":"Undisclosed"}