{"Object Features":"None","Weather Factors":"None","City":"Glen Rose","Object Shape":"Circle, Disc","Case Number":"13409","Date Submitted":"10/29/2008 08:00 UTC","Log Number":"US-10302008-0032","Date of the Event":"10/29/2008 08:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-97.746526","files":["/var/www/straped/mufon/html2text/13409.html.txt","/var/www/straped/mufon/org/13409.html"],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.241507,+-97.746526(13409)&iwloc=A&hl=en\"> mufon case (13409) map </A>","trends":["There have been 8 other sightings in Glen Rose","There were no other sightings in Glen Rose on or around October 29th 2008"],"Region":"Texas","Viewing Distance":"Unknown","Disposition":"Unknown","Summary":"My 11 year son reported seeing a UFO on 10/29/08 near our home at Dusk.","Object Flight Path":"Hovering then path","Latitude":"32.241507","divs":["Sighting DetailsMy 11 year old son was playing with friends outside at dusk last night. I was not with him at the time, so I am not sure what time the sun set last night. When he got home, he told my husband that he saw a UFO. My husband told me when I arrived home from work. I called my son into my room and asked him to sit with me and explain what he saw. My son is a very quiet child and is a horrible liar. You can always tell by his expression when he is not being completely honest and he does not suffer from an over-active imagination. His description was so detailed and the way he described it, like he could see it as he recalled it, convinced me that his claim has merit. He said that he and his friend were walking home a friend, several streets away, to his house. (*Note- he knew by telling me this that he was informing me that he did something that was not allowed)While walking back something caught his attention. He looked up and saw a circle or disk shaped object hoovering. When asked,how high up was it?, he replied \"not as high as a airplane; more like a helicopter\". When asked, how big was it?, he replied \"big...like 5 houses put together\". When asked, did it have lights?, he replied \"it did light up like the glow sticks we get sometimes, but it didn't shine like a flashlight.\" When asked, was it a solid or transparent?, he replied \"Solid, I couldn't see thru it.\" When asked, what color was is?, he replied \"white, but shiny.\" When asked, was it silver?, he replied \"no, white\". When asked, where was it going?, he replied \"it just stayed in one spot, then moved slowly away, then disappeared.\" When asked, what sound did it make?, he relied \"it didn't make any sound, because when my friend and I were walking home and turned back on to our street, we heard 2 planes flying in the direction of when the UFO was headed before it disappeared.\" When asked, what kind of planes were they?, he replied \"I don't know, the fast ones.\" When asked, where they military planes, like fighter jets?, he replied \"yes\". When asked, are you making this up?, he replied \"no\". When asked, did you talk about UFO's at school recently or with your friends?, he replied \"no\". We went over this several times and then sent him off to bed. He had a very hard time going to sleep. I am certin that his account is true."]}