{"Date Submitted":"10/29/2008 10:30 UTC","Region":"Florida","Source":"MUFON","Log Number":"US-10302008-0029","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around October 29th 2008"],"Longitude":"-83.172168","Case Number":"13406","Disposition":"Unknown","Latitude":"30.060181","Weather Factors":"None","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","divs":["sighting detailsi had just let the pups out and was waiting on them to come back to go inside, i saw a beautiful whirw shooting star, but did not think any more about it. the pups seemed to be in a hurry because it was so cold. i looked up to see an aircraft flying over waiting to hear the sound of the receeding jet engines,but there was none. i heard the pups comming up the steps and started to look down at them when a beautiful white orb went flashing through the trees. there was absolutely no sound, anywhere. it was almost deffining. know what i mean. the dog at a neighbors house began to bark, the owner yelled at them and they hushed. i kept looking for the orb to reamurge some where but it never did. i let the pups inside and comtinued to wait. there were all kinds of jet strobe lights but no sound. and it still seemed extreamly cold. sudenly there was all kinds of yepps and barks from a family of coyte that live up the road about 1\\4 mile and it seemed everything was back insink again. the sighting of the falling star and the orb took only 30 seconds but for every thing to go forward again took about 10 to 15 minutes. seemed like a long time."],"Object Features":"None","City":"Mayo","Date of the Event":"10/29/2008 10:30 UTC","Tags":"City","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=30.060181,+-83.172168(13406)&iwloc=A&hl=en\"> mufon case (13406) map </A>","files":["/var/www/straped/mufon/html2text/13406.html.txt","/var/www/straped/mufon/org/13406.html"],"Object Flight Path":"Straight-line path","Summary":"i had just finished an interview mnad taken my pups out for potty breaksaw white shooting star."}