{"Date of the Event":"10/30/2008 09:20 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.318566,+-75.121794(13408)&iwloc=A&hl=en\"> mufon case (13408) map </A>","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around October 30th 2008"],"Country":"United States","Log Number":"US-10302008-0031","Date Submitted":"10/30/2008 09:20 UTC","Case Number":"13408","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13408.html.txt","/var/www/straped/mufon/org/13408.html"],"Region":"Pennsylvania","Latitude":"40.318566","Object Shape":"Cigar","Longitude":"-75.121794","Object Flight Path":"Path with directional change","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","divs":["sighting detailsi went outside to walk the dogs into my backyard and as i was about to bring them back in a flash of light caught the corner of my eye. i looked up and saw what at first i thought was a chrome painted jet. then i realized it didn't have wings. it went into a light cloud and was slightly obscured so i kept my eyes trained till it emerged. it was flying northerly but drifting closer in my direction. as it got closer i saw that about 3\\4 down the length of it, it segmented and then was gold colored with lines.( so chrome 3\\4 down it's body) there was no vapor trail.it seemed to me that the body of it was a little bit smaller than a regular commercial jet liner. it keet drifting closer but still moving north and then the front of it sort of turned a degree. it seemed to lose a bit of altitude and then drifted the other way. there was no nooise coming from it that i could discern. while watching i was amazed and kept trying to explain to myself what i was seeing. i never thought in my life i would see something like that especially in broad daylight. as it moved over the trees to my left i noticed that even my dogs had stopped and were watching it. i finally lost sight of it behind the trees. i don't pay attention to ufo shows. i don't watch the night sky nor do i believe in aliens. i'm a business owner in college working on my bachlor's degree. i cannot explain what i saw. it had no wings, stayed at a steady speed and drifted unlike a jet which would have only flown straight."],"Summary":"Chrome cigar shaped object in the sky","City":"Doylestown"}