{"Region":"North Dakota","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=45.940834,+-102.15932(13419)&iwloc=A&hl=en\"> mufon case (13419) map </A>","Weather Factors":"None","Date of the Event":"10/25/1975 09:30 UTC","Country":"United States","Latitude":"45.940834","Longitude":"-102.15932","Tags":"City","Case Number":"13419","Source":"MUFON","Log Number":"US-10302008-0042","Summary":"Flight of UFO's drifed overhead complete quiet","divs":["Sighting DetailsIt was fall in a very rural part of south-western North Dakota. The USAF had been flying low level and high level missions in that part of the state most of the year and we became quite used to seeing aircraft doing bombing runs and refueling tracks. After I joined the AF I found that our barn had been used as a visual sighting aid during those runs. During the month of October my church decided to have a hay ride on our farm and I was the elected driver of the small case tractor that would pull the hay rack. The ride lasted from just before dark to well after dark. In the pasture during the return to the yard my brother who was also riding on the tractor with me tapped me on the shoulder (it was too noisy from the exhaust of the tractor to talk) and pointed to the sky. When I looked up I saw a flight of several triangular shaped objects each with 3 round white lights on the bottom with one light at each apex of the triangle. I believe there were 6 black triangles flying in formation of one in front then two behind then three behind that. On seeing them I turned off the tractor and started talking with my brother. We were wondering what they were. I asked the people riding on the hay rack about them but none of them could see the objects. It was a very bright moonlit night with very light cloud cover. So light and the clouds so thin you could see the stars and moon thru the clouds and they left a shadow on the clouds. The Triangles were above the clouds but it appeared they were very close to us. They made no sound and were moving in a direction of WNW to ESE relative to us at about a speed of 10 to 15 knots. My brother and I watched for a few minutes then as they were moving away I started the tractor. We never spoke of it again until almost 30 years later. My initial feelings were wonder at what they were that quickly turned to boredom. I got tired of watching them and then went about my business. My brother remembers this happening but is very reluctant to talk about it. The odd thing is I will watch a known airplane for several minutes and I had better things to do that night and then never mentioned it to the person that was with me for that long. Thinking back on it now I don't remember anything after starting the tractor to drive away. That is the last of my memory of the evening. I remember events leading up to that very well."],"Object Features":"Other","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13419.html.txt","/var/www/straped/mufon/more/13419_submitter_file1__formation.jpg","/var/www/straped/mufon/org/13419.html"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","City":"Lemmon","Disposition":"Unknown","trends":["There has been one other sighting in Lemmon","There were no other sightings in Lemmon on or around October 25th 1975","This sighting has been favorited 1 time.",""],"Date Submitted":"10/25/1975 09:30 UTC"}