{"Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-98.198263","Log Number":"US-10302008-0038","files":["/var/www/straped/mufon/html2text/13415.html.txt","/var/www/straped/mufon/org/13415.html"],"Summary":"two sessions of lights appearing and disappearing and unusual con trail","Sighting Duration":"Undisclosed","Case Number":"13415","Latitude":"32.229946","divs":["Sighting DetailsMy house is located about 4 miles ESE of Stephenville, TX. It was nearly dark so I could not see if the objects were solid or lights only. At about 7:17 to the WSW about 15 degrees off the horizon there was an orange to red \"star\". Knowing there was no bright star (or planet) in that location, I first thought it was the ISS but it wasn't moving. It was about the same brightness as the visible planet (perhaps Venus). It was red to orange ...I best describe the look as if the colors were liquid. Then, it blinked off ...then back on in the same location. About 5 (or so) seconds later, it reappeared in the S at about 15 degrees off the horizon. Blinked off then back on then disappeared. When the light first blinked on, coyotes started barking loudly (I know that sounds strange) ...when it went off, they quit. I stood there probably another 3 or 4 minutes scanning the western sky and saw a faint con trail in the remaining sunlight at a VERY high altitude probably 45 degrees off the WSW horizon and that puppy was MOVING! Made a \"comma\" shape then disappeared ...the con trail disappeared quicker than one from a plane. A minute or two later, another con trail made the same \"comma\" shape only going downward. It disappeared quickly as well. Then, I saw three BRIGHT lights (lined up) and appeared to be from one \"craft\" blink on then off ...repeated two times. A couple seconds later, another three (like the first three only more orange) blinked on then off more towards the south. If it was from the same vehicle, that thing was going FAST to get from point \"a\" to point \"b\" in that length of time. When the lights started flashing, there were no jets (other than the odd one or two headed to DFW) but maybe 10 to 15 minutes later, there seemed to be multiple jets (it was too dark to see what kind they were) but I assume military. Two flew directly over head coming from SSW heading NNE both flying low and very fast. I had my camera but couldn't get it focused fast enough to get an image."],"Source":"MUFON","trends":["There have been 74 other sightings in Stephenville","There were 5 other sightings in Stephenville on or around October 29th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.229946,+-98.198263(13415)&iwloc=A&hl=en\"> mufon case (13415) map </A>","Country":"United States","Weather Factors":"Unknown","City":"Stephenville","Object Features":"Unknown","Region":"Texas","Disposition":"Unknown","Object Shape":"Star-like, Other","Object Flight Path":"Stationary","Date Submitted":"10/29/2008 07:17 UTC","Date of the Event":"10/29/2008 07:17 UTC"}