{"Viewing Distance":"Unknown","Case Number":"13413","Log Number":"US-10302008-0036","Weather Factors":"None, Does Not Apply","Longitude":"-81.685353","Tags":"City","Date of the Event":"10/30/2008 11:22 UTC","Object Flight Path":"Hovering then path","City":"Eustis","Region":"Florida","Latitude":"28.852768","Country":"United States","Object Shape":"Cigar","Sighting Duration":"Undisclosed","divs":["sighting detailsi was heading west on hwy 44 towards eustis at approximately 11:22 am. it was a bright, blue-sky, sunny, crisp day (today 10\\30\\08). i was listening to the radio, singing along out loud to the song on the radio with the windows open. an elderly man in a very old, white chevy pickup with a trailer hitch\\trailer and equipment was traveling in front of me... as we rounded a bend with a large bank of trees and foresting & fielding on either side, there was an object (cigar shape), very lengthy and very, bright silver hovering over the road just below the tree horizon line. we both swerved off the road and i no sooner said \"holy s---!\" and it disappeared to the southwest in a flash... couldn't have last more than a minute. if i had to judge its size from arm length, it was larger than a baseball (oblong) to cover it's body as it sat in the distance... but it was oh so visible! fantastic! i've never seen anything move so fast and out of sight! and there was absolutely no noise whatsoever! i was excited beyond belief. the elderly man of course didn't know what to make of it and had a good laugh, but i was jumping out of my skin with enthusiasm."],"Disposition":"Unknown","Date Submitted":"10/30/2008 11:22 UTC","Source":"MUFON","Summary":"Turned corner of tree banks on Hwy 44... object was below tree horizon hovering in air, then disappeared in seconds","files":["/var/www/straped/mufon/html2text/13413.html.txt","/var/www/straped/mufon/org/13413.html"],"Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=28.852768,+-81.685353(13413)&iwloc=A&hl=en\"> mufon case (13413) map </A>","trends":["There have been 2 other sightings in Eustis","There were no other sightings in Eustis on or around October 30th 2008"]}