{"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.969803,+-82.793083(13426)&iwloc=A&hl=en\"> mufon case (13426) map </A>","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around"],"Region":"Florida","Source":"MUFON","Object Shape":"Flash, Sphere","Tags":"City","Date of the Event":"Unknown","Log Number":"US-10312008-0003","Object Flight Path":"Stationary","Latitude":"27.969803","Summary":"multiple objects flashing red blue green and white","files":["/var/www/straped/mufon/html2text/13426.html.txt","/var/www/straped/mufon/org/13426.html"],"Longitude":"-82.793083","Object Features":"Other","City":"Clearwater","Case Number":"13426","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"10/31/2008 12:54 UTC","Sighting Duration":"Undisclosed","divs":["Sighting Detailswest central florida; this may be an unusual story last week i just happened to look up in the sky and saw 2 objects that were flashing multiple colors approx. 20 miles apart i watched them for 20 minutes and they stayed stationary. when i first noticed them they were in a northern position after showing them to my neighbors my one neighbor noticed a small white light moving around the flashing object on the left but not the right, i to a certain degree dismissed them however the next night i curiously looked again and they were not in the northern position they moved to the west, same distance between the 2 but this time i saw 4 small white lights around the left one and 2 white lights around the right one. they are both at the same altitude no matter what position north or west. my first instinct was to rush and get my camera however the fact is there is no reason to do that becaause this has gone on for a week and i can walk outside right now and they are there. i only have a set of binoculars so defining a shape is difficult but i can see the changing of the lights clearly, also the white lights that are moving around them. i have looked to see if there were any ufo sightings in my area and i could not find any i would love to know what they are they definitly not a aircraft, if they are they have the ability to hoover for hours but the small white lights around them just does not make sense. if anyone has seen similar objects please let me know"]}