{"Latitude":"41.608492","Source":"MUFON","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/13422.html.txt","/var/www/straped/mufon/org/13422.html"],"Viewing Distance":"Unknown","Case Number":"13422","Tags":"City","divs":["Sighting DetailsI was driving west down 159th St. before Oak Park Ave when I saw what looked like the old Tinley Park Lights hovering over the Forest Preserve. I initially filed a report on the UFO Reporting site. I talked to my mother about it and told her I thought I had been seeing things. It amazed me though. If I wasn't driving, I would have probably gone into a trance staring at it. But because I was driving, I don't know exactly how long it hovered over the Forest Preseve. I don't know why I moved my eyes to the side, something caught me and I gasped and thought, \"Oh my gosh! I am NOT looking at the Tinley Park Lights\". Pretty odd since it was just a week before Halloween, one of the second biggest events for them here in Tinley. My mother told me about UFO Hunters being on History Channel and how they were going to be talking about the Tinley Park Lights 3 days after I witnessed the latest event. She recorded it on DVR and since I just finished watching it and saw the people involved were from MUFON I decided to look it up on the internet and leave a report here too. I will say, the object I saw appeared to be smaller than what they showed on UFO Hunters. But the lights are the same, the shape was the same."],"trends":["There have been 4 other sightings in Oak Forest","There were no other sightings in Oak Forest on or around October 25th 2008"],"Country":"United States","Object Flight Path":"Stationary","Date Submitted":"10/25/2008 08:00 UTC","Disposition":"Unknown","Date of the Event":"10/25/2008 08:00 UTC","Weather Factors":"None","Summary":"Three red lights over Oak Forest","Sighting Duration":"Undisclosed","Log Number":"US-10302008-0045","Object Features":"Unknown","City":"Oak Forest","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.608492,+-87.738178(13422)&iwloc=A&hl=en\"> mufon case (13422) map </A>","Longitude":"-87.738178"}