{"Region":"Indiana","Weather Factors":"None","City":"Evansville","Latitude":"37.978849","Date Submitted":"10/30/2008 07:15 UTC","Sighting Duration":"Undisclosed","Summary":"A very large, bright light that appeared to change colors. Moved/hovered in zig-zag motion. Was not conventional aircraft.","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around October 30th 2008"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.978849,+-87.56997(13421)&iwloc=A&hl=en\"> mufon case (13421) map </A>","Disposition":"Unknown","Longitude":"-87.56997","Source":"MUFON","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/13421.html.txt","/var/www/straped/mufon/org/13421.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","Case Number":"13421","Date of the Event":"10/30/2008 07:15 UTC","Log Number":"US-10302008-0044","Object Shape":"Unknown","Tags":"City","divs":["Sighting DetailsMy wife came into our house at approx 7:10 PM CST and said there was an unusual, bright light in the sky. It was a clear, night time sky and she was driving home and noticed the light in the sky as she was going down our road, traveling north, and directly ahead and above (an undterminable distance away). I was inside the house, but immediately went outside when she mentioned the light in the sky. We live in a rural area, so it is naturally dark outside at this time. We walked down our driveway to the road, let our eyes adjust to the darkness and looked north and up in the direction she described. We both saw the light, just as she described it. We stood there for maybe 5-10 minutes and watched it flash multiple, visible colors: white, red, yellow and others we couldn't describe. It hoovered and dipped up and down in jerky movements. My wife said it appeared larger when she first saw it, and it now seemed smaller. We both decided it must be moving away from us, headed north. We eventually went back inside the house. An hour latter I went out for another view and the night sky, looking north, seemed perfectly normal. This was a conventional aircraft."]}