{"divs":["Sighting DetailsBetween 1 pm and 2 pm, witness was outside her home with her elderly mother, her niece and grandchild, after returning from taking her mother around the corner for a walk. Mother was wheelchair bound and the day was so beautiful that witness said she was enjoying the warm winter day with her family members. Witness was looking for birds to show her grandchild who liked the activity. The trees were bare of leaves and there were no birds in sight. The sky was clear blue and sunny. As witness was searching the sky, she noticed an object in the sky that looked at first like a tool or an upside down screw. She thought to herself .. \"what the hell is that?\" and asked her niece if she saw it. She said her niece got frightened, said she didn't see anything and went in the house. Witness continued to watch the object. There was no noise, no sound, and the object was getting closer to her, very, very slowly. As it came closer she saw that the object looked like a short lighthouse, wider at the bottom and smaller at the top. It was just slowly flying in the sky at what witness estimated to be maybe 5 mph. She described the object as being old and rusty looking, reminding her of something midieval, with no windows or doors visible. As it approached closer to her view -- which she states \"I never turned away, kept looking at it the whole time\", it dropped closer to Earth. At this point, Witness said she saw a metallic flash, like the way a pie pan would flash in the sun, and the object turned brilliant like glowing metal. It began to change shape as she watched. First, it looked like a dumb bell and continued to glow. It then changed into an hourglass shape. She noticed that seagulls began to fly around it attracted, she said, by the glint of the shiny metallic shape. Witness said that the seagulls began to glow as well. Then, the object turned into a box shape, changing into the same color as the seagulls, like it was trying to camouflage itself. Then it went back to the hour-glass shape, and began to move west in the direction of Port St. Joe."],"files":["/var/www/straped/mufon/html2text/13429.html.txt","/var/www/straped/mufon/org/13429.html"],"Viewing Distance":"21-100 Feet","Object Flight Path":"Hovering then path","Log Number":"US-10312008-0006","Tags":"City","Region":"Florida","Date of the Event":"01/27/2008 12:00 UTC","Disposition":"Unknown","Country":"United States","City":"Apalachicola","Latitude":"29.725768","map":"<A HREF = \"http://maps.google.com/maps?q=29.725768,+-84.983244(13429)&iwloc=A&hl=en\"> mufon case (13429) map </A>","Longitude":"-84.983244","Source":"MUFON","Summary":"short, lighthouse shaped ship morphed into hourglass shape","Date Submitted":"01/27/2008 12:00 UTC","Object Shape":"Cone, Flash","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"13429","trends":["There have been 4 other sightings in Apalachicola","There were no other sightings in Apalachicola on or around January 27th 2008"],"Object Features":"None"}