{"Date Submitted":"10/30/2008 11:05 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"IFO","Summary":"One low flying set of lights, followed by two sets of moving red/orange/white lights","Object Features":"Undisclosed","Date of the Event":"10/30/2008 11:05 UTC","divs":["Sighting DetailsI live in downtown Manchester, but the night sky is still pretty easy to see. I live across from a parking garage, so I figured i'd go up to the roof and see if I could see anything. I live maybe 5 miles from a major airport, so lights at night are nothing out of the ordinary because I can usually tell by listening for engine noise and lights. As I was walking to the parking garage and looking down the street between the parking garage and my building, two close together yellowish lights passed across the sky and behind a high-rise from (my) right to left, maybe between 500-700 ft in the air. It seemed odd because aircraft usually have a flashing light, and the two lights seemed too close together since the plane would have been passing by perpendicular to my field of vision. At first I assumed it was a 747, but as I was climbing the steps in the garage I realized I didn't hear any jet or prop noise. I settled in on the roof of the parking garage. After 5 minutes of scanning the sky I focused on a twinkling red light approximately Northwest in the sky. Whenever I see something at night i have a sort of mental checklist, is it 1. A planet, 2. a satellite, 3. plane, 4. helicopter. The more I focused on it, I could tell that it was moving. Not slowly, but in rapid jerky movements in random directions, far too fast to be any sort of conventional aircraft. It's possible that my vision could be somewhat shaky because I wear glasses, but as it was close by to other stars, I am quite sure that this was neither a star nor a planet, and my vision wasn't playing tricks on me. After 15 minutes it appeared to be closer, and I could almost make out other lights as if it were a triangle or tetrahedron that were tumbling around as it moved, but i'm not entirely confident on that. I remember looking away for a quick second and saw another set of lights, one white and one yellowish on the horizon due west of me. Again, at first they seemed stationary and I didn't hear any jet noise so I continued to watch them for a few minutes, and they were slowly moving back and forth in unison, approx. 4-5 seconds at a time before stopping and moving in the other direction. I could have stayed out longer, but I was cold and tired, so I gave up and went back inside, satisfied that I at least saw something I couldn't readily explain."],"Source":"MUFON","trends":["There have been 19 other sightings in Manchester","There were no other sightings in Manchester on or around October 30th 2008"],"Country":"United States","Log Number":"US-10312008-0009","files":["/var/www/straped/mufon/html2text/13432.html.txt","/var/www/straped/mufon/org/13432.html"],"Latitude":"42.99917","City":"Manchester","Case Number":"13432","Object Flight Path":"Undisclosed","Longitude":"-71.447599","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.99917,+-71.447599(13432)&iwloc=A&hl=en\"> mufon case (13432) map </A>","Tags":"City","Object Shape":"Star-like, Other","Region":"New Hampshire"}