{"Case Number":"13430","Weather Factors":"None, Does Not Apply","Sighting Duration":"00:00:10","Country":"United States","trends":["There have been 4 other sightings in Blue Ridge","There were no other sightings in Blue Ridge on or around October 30th 2008"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/30/2008 08:15 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13430.html.txt","/var/www/straped/mufon/org/13430.html"],"Summary":"300 to 400 feet above ground with low white lights on two points and one red/white light on third point.","Log Number":"US-10312008-0007","Disposition":"IFO","City":"Blue Ridge","map":"<A HREF = \"http://maps.google.com/maps?q=34.865042,+-84.317587(13430)&iwloc=A&hl=en\"> mufon case (13430) map </A>","Date Submitted":"10/30/2008 08:15 UTC","Object Shape":"Triangle","Latitude":"34.865042","Tags":"City","Region":"Georgia","divs":["Sighting DetailsI was driving North-East on Hwy. 515 and I pulled off the road to check a load on my truck. Got back into my truck and pulled up to a stop sign and heard a low ocillating sound that I thought was from my truck but it was not the same sound pitch. Thats when I look up out of my windshield and saw an object moving over and perpendicular to Hwy 515 going South approx. 300 to 400 feet above the ground. Object was triangular in shape and the leading two points had faint low lights on each two points. The single rear point had two lights together. One was reddish and the other was a white light. I cannot remember if the rear lights were blinking or not. Each leg of the triangle was about 200 to 300 feet apart. I saw the rear lights first then a second later I saw the faint front lights. I'm not certain that the lights were connected but it seemed to be so because the background of the sky was lighter than the foreground of the craft. I thought maybe this was a helicopter but I only heard a faint sound of a low pitch ocillating sound. I thought maybe the front lights were from the rear double lights and that it was a reflection off mist in the sky but it was a clear night. The object moved slowly about 40 to 50 mph. I first thought that this was one of the silent military helicopters but realized that there are no bases close by. As I drove onto the main road I lost sight of the object. The location was about 5 miles on the north side of Blue Ridge, Georgia going North toward Blairsville, Georgia."],"Source":"MUFON","Object Features":"Unknown","Longitude":"-84.317587"}