{"Country":"United States","Object Flight Path":"Straight-line path","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/13433.html.txt","/var/www/straped/mufon/org/13433.html"],"Case Number":"13433","Region":"California","Weather Factors":"None","Longitude":"-117.924238","City":"Fullerton","divs":["Sighting DetailsI had just gotten out of my car and walked over to my mailbox to get the mail. Before I could even reach for the mail inside, I saw what looked like a fireball of red light. It turned yellow and zipped a short distance before becoming an orb of green light. It stayed there for about 2 seconds before disappearing in a flash of green light. I just stood there stunned with my hand in the mailbox for a couple of seconds before coming back to my senses. I didn't know what to do, feel, or think. I must have gotten the mail out already because I had it in my arms and then I thought \"I saw a UFO.\" I felt dizzy walking back up to my door as well. It might've just been me though. The thing about that light was it all had to have been within Earth's atmosphere. It was just too big to be a far off shooting star and it was too small to be a low flying airplane. (I live farly close to a small town airport.) I don't know of anything on earth that could've produced something like that. Also, it looked like something straight out of Star Wars or something. As if a ship were zipping into hyperspace from Earth's atmosphere. I never used to believe in UFO's before, but I know what I saw. I've told just a few other people including my parents, and they all didn't believe me, saying \"Uhuh...suuurrree.\""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.875852,+-117.924238(13433)&iwloc=A&hl=en\"> mufon case (13433) map </A>","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"33.875852","Object Features":"Unknown","Source":"MUFON","Summary":"There was a fireball of red light, which turned to yellow, then it turned into a small sphere of green light for about 2 seconds before disappearing.","Date Submitted":"10/30/2008 10:02 UTC","Object Shape":"Fireball, Flash, Sphere","Date of the Event":"10/30/2008 10:02 UTC","trends":["There have been 14 other sightings in Fullerton","There were no other sightings in Fullerton on or around October 30th 2008"],"Log Number":"US-10312008-0010","Sighting Duration":"00:00:45"}