{"files":["/var/www/straped/mufon/html2text/13436.html.txt","/var/www/straped/mufon/org/13436.html"],"Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=39.06763,+-94.553253(13436)&iwloc=A&hl=en\"> mufon case (13436) map </A>","Summary":"two small discs pass over me heading east. I could see one being in each craft.","divs":["Sighting DetailsIt was a low overcast morning; cool and expecting rain. I was heading for work and was only a half mile from my home going south on North 67th Street. As I am driving up a hill on North 67th Street 2 small discs passed over me heading east (there are open fields on each side of this street). They were traveling at a slow rate of speed and were just above the trees. As they passed over me, very quiet and one leading while the other was a little to the right and a little back, I stopped the car and watched them go by. I was surprised and knew these were not known human aircraft (they were so quiet.). What I saw was 2 silver discs with glass domes. I could see the passenger in each one. These crafts seemed to be made for only one passenger each, they were that small. I'd say about the size of my car. One passenger was looking at the other. I did not see any helmets and could not see whether they were human or not. All I know is that they were traveling east very slow and very quietly. There was no way for me to follow them. I had to go to work. The thought that came to my mind after they left my sight is that they were heading for the Richard Gabour Air Force base, which was still being used then. And I knew what I saw was NOT human built (as far as I knew). Sorry no photos--wasn't expecting to see this."],"Date of the Event":"02/28/1985 07:30 UTC","Case Number":"13436","Region":"Kansas","Date Submitted":"02/28/1985 07:30 UTC","Country":"United States","Sighting Duration":"00:01:32","Latitude":"39.06763","Tags":"City","Object Shape":"Disc","trends":["There have been no other sightings in Kansas City, Missouri","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","City":"Kansas City, Missouri","Longitude":"-94.553253","Log Number":"US-10312008-0013","Weather Factors":"Rain, Light","Source":"MUFON","Viewing Distance":"21-100 Feet","Disposition":"Unknown"}