{"Summary":"Alien Contact","Region":"Texas","Date Submitted":"10/14/2006 11:05 UTC","divs":["Sighting DetailsWent to a friends ranch in George West Texas October 14, 2008 we were there to move some deer blinds and mow the fields. Prior to that my friend showed me some photos taken with a game camera of what appeared to be 4-6 aliens that were transparent almost like a ghost but we could make out the head and eyes. My friends and I looked over the photos and believed this to be nothing more that dust particles. Later on that night of October 14, 2006 I was at our campsite around 11:05pm and had an uneasy feeling that whole day like we were being watched. I was making my way around our trailer to put up some gear when I saw something moving from out of the brush. I stayed still acting like I did not notice anything when I saw a skinny arm and leg come out of the brush and change color to match the surrounding bushes. I immediately turned around and stomped my foot on the ground and clapped my hands together very loud and screamed get out. To my surprise whatever this was let out a loud scream and took off running through the bushes. My friends jumped out of their seats and said what was that? I replied have no idea that was the last time I have been to the ranch in George West."],"map":"<A HREF = \"http://maps.google.com/maps?q=28.3325,+-98.117505(13439)&iwloc=A&hl=en\"> mufon case (13439) map </A>","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:40","trends":["There have been no other sightings in George West","This sighting has never been favorited."],"Object Features":"Undisclosed","Longitude":"-98.117505","Weather Factors":"None","Viewing Distance":"Unknown","Date of the Event":"10/14/2006 11:05 UTC","Latitude":"28.3325","Object Shape":"Undisclosed","Source":"MUFON","Log Number":"US-10312008-0016","Disposition":"Unknown","Case Number":"13439","files":["/var/www/straped/mufon/html2text/13439.html.txt","/var/www/straped/mufon/org/13439.html"],"Country":"United States","City":"George West","Tags":"City"}