{"Object Shape":"Circle, Fireball, Sphere","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=38.582296,+-109.54579(13443)&iwloc=A&hl=en\"> mufon case (13443) map </A>","divs":["sighting detailsmy husband and i have wondered for years if someone else may have witnessed this same huge orange pulsating sphere. it was the friday before easter 1968. we were traveling to nm to visit relatives. we left ogden after work on friday. we traveled in the evening because traveling with 2 little babies was easier at night. we were traveling south and were approx. 20-30 miles past moab heading to monticello. we were the only car on that stretch of highway in the church rock \\ looking glass rock area of the desert. it was dark with no other lights in sight except our headlights. i'm estimating it was about 11:00 pm when all of a sudden the whole surrounding area of the desert lit up like daylight. i don't know where it came from but we could see through our windsheild a huge orange pulsating light hovering right above us. it was about 30 ft. in diameter and approx. 20-40 feet above us. i remember telling my husband,\"stop, it's going to hit us\". he braked and we just stared at it for what seemed like an eternity but it was probably only a minute or two. we did not hear anything or see it coming at us, all of a sudden this huge ball just appeared above our car. after a minute or so the light\\sphere just sort of bounced over a couple of times to the east and disappeared over a mountain. the only comparison of what we saw that night would be like a bright orange sunset in the dimensions i described. i remember we were very scared and drove to monticello, the nearest town and parked in front of a downtown business and waited for dawn to continue our trip. we were just a young married couple with two little babies and it never occured to us to stop and report what we saw. we have always wondered if anyone else saw this. after this my husband and i became very interested in ufo's and to this day i wish i had documented every detail and the exact time everything happened. my husband disagrees with the time of sighting and thinks we lost some time that night. a few years back i wrote down everything my husband and i remembered from that night. this is the best recollection of this event to my knowledge."],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Moab","Date of the Event":"04/12/1968 11:00 UTC","Tags":"City","Summary":"In the spring of 1968, In the middle of the desert at night, past Moab, a huge orange pulsating sphere appeared above our car","files":["/var/www/straped/mufon/html2text/13443.html.txt","/var/www/straped/mufon/org/13443.html"],"Longitude":"-109.54579","Disposition":"Unknown","Latitude":"38.582296","Log Number":"US-10312008-0020","trends":["There have been 13 other sightings in Moab","There were no other sightings in Moab on or around April 12th 1968"],"Case Number":"13443","Date Submitted":"04/12/1968 11:00 UTC","Viewing Distance":"21-100 Feet","Region":"Utah","Object Features":"None","Country":"United States","Weather Factors":"None"}