{"Sighting Duration":"Undisclosed","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around October 29th 2008"],"Weather Factors":"Unknown","Date Submitted":"10/29/2008 01:24 UTC","Date of the Event":"10/29/2008 01:24 UTC","divs":["Sighting DetailsI awoke sometime after 1am, because I could not sleep. So I went out back to have a smoke. The night seemed pretty calm, until I saw a flash of light right there on the grass in front of me. At first I thought it was a lightning strike. That was until I saw what came out of it. It was somekind of transparent being. I froze solid in my chair,didnt move,or yell for anybody. I just looked at it, as it approched me. For some reason I wasnt affraid, when I should have been. It showed itself to be one of those grey beings, except it was a little taller than me,and I'm 5'8''.I could understand it clearly as if I was talking to anybody else. It said \" Do not be affraid, for you are the one we seek\". He said they will soon come to take me back home. It touched my hand, and my hand began to light up, I could see my bones in my hand, so I pulled away. Then I became a little affraid. It said my mother has sent for me. It said they are all around me and that the time is soon near to reveal they have been gaurdians. And just like it appeared, it dissappeared, in a flash. This is not the first contact with this being. The first time I seen it, I was 10 yrs old, and we lived in the country. At that time I couldn't beleive I had seen what I was looking at, so I dismissed it as an illusion. I dont know whats about to happen to our planet, but its something very big."],"Latitude":"30.271913","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13442.html.txt","/var/www/straped/mufon/org/13442.html"],"Country":"United States","City":"Austin","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.271913,+-97.733471(13442)&iwloc=A&hl=en\"> mufon case (13442) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-97.733471","Object Shape":"Flash","Log Number":"US-10312008-0019","Summary":"I just looked at it, as it approched me","Case Number":"13442","Region":"Texas","Object Features":"Undisclosed"}