{"trends":["There have been no other sightings in Pittsburg, KS or Joplin,","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown","Disposition":"Unknown","Log Number":"US-10312008-0026","Latitude":"39.014022","Country":"United States","Summary":"3 points of light came from the southwest, high in the sky, and then stopped without slowing down. it then rotated and was gone.","Source":"MUFON","divs":["Sighting DetailsAt my house, about 5 miles from a town of about 20,000, you can see the lightning from thunderstorms in Wichita, Kansas City, Springfield,Mo., and Fayetteville Ar. This is a lot of sky, and I have always loved to sit at night and just watch it. I grew up on a farm, and had always liked to stargaze. I was sitting on our back porch about a year ago looking to the west southwest when three lights shaped in an equilateral triangle came across the sky. The tip of the triangle acted like the front of a craft pointing the direction of travel, but I can not tell you it was a solid craft or three points of light. They looked to me like bright stars, but I have a color deficit at a distance, and probably don't make a very good witness for you on that point. But I can tell you that it acted like one solid object, took a minute or two to cross half of the sky, and then stopped. It did not slow down and stop, it just stopped. And then it rotated on its front tip, sat there for a second or two and then was gone. It was like the lights were turned off. I am very sorry I did not write down a date and time. I am telling the story in hopes that someone else saw this. I could be off quite a little on the time, but it was dark outside, and if this was one object it was beyond huge. It was also very high in the sky, so someone else should have been able to see it. I know that what I saw was impossible, unless it had no mass, and that has bothered me all this time, that is why I am telling this now. I also know that it is hard to believe unless you are the person that sees it, and it changes you when it happens to you."],"Object Features":"Unknown","Tags":"City","Weather Factors":"Unknown","Date of the Event":"09/01/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.014022,+-98.477596(13449)&iwloc=A&hl=en\"> mufon case (13449) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13449.html.txt","/var/www/straped/mufon/org/13449.html"],"Case Number":"13449","Object Shape":"Triangle","City":"Pittsburg, KS or Joplin,","Date Submitted":"09/01/2007 12:00 UTC","Longitude":"-98.477596","Region":"Kansas"}