{"files":["/var/www/straped/mufon/html2text/13458.html.txt","/var/www/straped/mufon/org/13458.html"],"Region":"Oregon","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was on my way to my friends party. I was riding my bike and i heard the football stadium at aloha high. There might have been a game. When i was riding down the street, i was looking at one of the lights over the stadium. Then to the right of it at about 1000 feet or so(estimated) was a very bright light. It had a red glow to it and i thought it may have been a plane. i stopped and watched it for about 5 min. it never moved and the light was very bright. I know that sometimes planets can be seen and they can glow red, but this was no planet. I felt like something dropped inside of me and that my heart skipped a beat. I was very intrigued and didnt want to stop watching it, the entire time wishing i had a camera. all i could see was the light, but I'm guessing it was a spherical shape. i kept riding to my friends and saw it in the same spot the entire time till i got there. I couldn't see it anymore after i went behind some tall evergreens, but i saw it for at least 10 minutes. It may have been there longer too. I believe that I witnessed a UFO. It was close to a football game, so people might post pictures somewhere. I'll be on the lookout for them too."],"Country":"United States","Latitude":"45.494284","Source":"MUFON","trends":["There have been 2 other sightings in Aloha","There were no other sightings in Aloha on or around October 31st 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.494284,+-122.867045(13458)&iwloc=A&hl=en\"> mufon case (13458) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-122.867045","Date of the Event":"10/31/2008 08:00 UTC","Summary":"Large bright red light that hovered in one spot for 10min or longer.","Object Shape":"Fireball","Case Number":"13458","Viewing Distance":"Unknown","City":"Aloha","Log Number":"US-11012008-0005","Date Submitted":"10/31/2008 08:00 UTC","Object Features":"Undisclosed","Disposition":"Insufficient Data"}