{"Object Features":"None","Summary":"star - like stationary lites daytime sky","Viewing Distance":"Over One Mile","divs":["sighting detailsi was sitting outside sunday morning having my coffee and reading the paper when i noticed about ten stationary lites in the sky. they were spread out in the middle of the sw sky and looked like stars, almost like a constelation across the sky; but it was a clear blue sky and a bright sunny day. once i realized this i got really excited and i went in and grabbed my binoculars and focused in on a couple that looked liked they were vibrating and bigger - like a nebula would seem to with in the nite sky. some that were initially there had disapeared but others popped up periodicaly. as i focused in on a couple they were vibrating and a little elongated. then i noticed a much smaller blue lite a little below and to the left of the object i was focused in on. i noticed this blue light on one other one through my binaculars, the blue dots were not visible as the lites were with the naked eye. the lites continued to faid in and out for about a 1\\2 an hour. they were even bright enough to be seen thru some lite clouds as they passed by. near the end as i was focused on a couple behind some power lines about 50 yards from me, i noticed that they were moving very slowly in northerly and down towards the horizon."],"files":["/var/www/straped/mufon/html2text/13457.html.txt","/var/www/straped/mufon/org/13457.html"],"Log Number":"US-11012008-0004","Date of the Event":"10/19/2008 08:45 UTC","City":"Chicago","Date Submitted":"10/19/2008 08:45 UTC","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 19th 2008"],"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Disposition":"Insufficient Data","Region":"Illinois","Source":"MUFON","Object Shape":"Star-like","Tags":"City","Object Flight Path":"Hovering then path","Case Number":"13457","Latitude":"41.880854","Longitude":"-87.627128","map":"<A HREF = \"http://maps.google.com/maps?q=41.880854,+-87.627128(13457)&iwloc=A&hl=en\"> mufon case (13457) map </A>"}