{"Case Number":"13451","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/13451.html.txt","/var/www/straped/mufon/org/13451.html"],"Disposition":"Unknown","Longitude":"-122.079922","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"05/31/1995 12:00 UTC","Region":"California","trends":["There have been 5 other sightings in Castro Valley","There were no other sightings in Castro Valley on or around May 31st 1995"],"Latitude":"37.703987","Log Number":"US-10312008-0028","Object Flight Path":"Stationary","Object Shape":"Unknown","Object Features":"Unknown","Tags":"City","Summary":"bright metallic object in sky","Date of the Event":"05/31/1995 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.703987,+-122.079922(13451)&iwloc=A&hl=en\"> mufon case (13451) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsFor what it's worth... I was in Castro Valley, California, waiting for a stop light. I was looking east, and noticed a bright, metallic appearing object in the sky. I could see that it was bigger than a point, but I could not determine its shape. My first thought was that it must be a mylar balloon floating up from some birthday party, until I realized that it was not moving, and this was a very windy day. I kept staring at it, wishing I had a pair of binoculars or something, because I wanted to know the shape. Then I noticed that the stop light changed, and I looked to the street, and started to cross. When I got near the curb on the opposite side, I looked up again, and it was gone. I would estimate that time I spent walking was no longer than 15 seconds. I sure wish I had my eyes on it when it disappeared. I would like to have seen it if it went away at a high speed or something like that. To this day, I wonder what it might have been. my best theory is that it might be an aircraft landing light pointed directly toward me, which was turned off while I was crossing the street. This was broad daylight, so I am not sure I would have seen an aircraft landing light at this apparent distance. If it was an airplane, it had to be very far away to appear to be hovering like that. This is an old story, and I just thought I would mention it in case it meant anything to anyone who might have been in that area at that time. I know it was no later than 1995, in the summer, and I am pretty sure it was in the afternoon, which means the sun was behind me. That might have been why I thought at first it was a mylar ballon. A mylar balloon would reflect a lot of sunlight under those conditions. Balloons usually rotate and move around, but this light was very steady. The time of the entire event was about 2 minutes. I had a friend in that area who says he saw 3 lights in a triangle formation flying very slowly over the rock quarry he was working at on the night shift. It followed the bottom of the valley where this quarry was located, and stayed at a very low altitude. I now think this description fits one of those big black triangles seen at night. I don't know when this was, or exactly where, but it was near Castro Valley. He was an old salt of the earth kind of guy who was not likely to make up stuff like that. He was near retirement at the time I knew him. I am sure his sighting happened a few years before the thing I saw there. The county is just a guess. I am not sure which county Castro Valley is in, but it's in the bay area, near San Leandro and Oakland."],"City":"Castro Valley"}