{"Object Shape":"Fireball","Case Number":"13455","Summary":"Very Slow Big Bright Green Meteor","Disposition":"IFO","Region":"Colorado","Object Flight Path":"Straight-line path","Longitude":"-104.976813","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around October 28th 2008"],"Latitude":"39.745234","map":"<A HREF = \"http://maps.google.com/maps?q=39.745234,+-104.976813(13455)&iwloc=A&hl=en\"> mufon case (13455) map </A>","Tags":"City","Date Submitted":"10/28/2008 07:30 UTC","Object Features":"Undisclosed","Date of the Event":"10/28/2008 07:30 UTC","files":["/var/www/straped/mufon/html2text/13455.html.txt","/var/www/straped/mufon/org/13455.html"],"Log Number":"US-11012008-0002","Sighting Duration":"00:00:04","divs":["Sighting DetailsI was at work at aproximately 9:00 to 9:15 p.m. talking on my cell phone when a BIG BRIGHT GREEN meteor fell from east to west direction directly overhead of me. It lasted in the sky for about 4 seconds much longer than meteors should last. This is not the first time I have seen this - about 6 or 7 years ago I saw the EXACT same Big Green Meteor event as I described above except this one went from a west to east direction. The one I saw years before occurred at 92nd and federal blvd and also was very slow moving. These 2 diffrent events were almost identically exact in what I saw except the directions of movement and the strange part about them both was that to me they seemed to be moving on exact east to west and west to east latitudes. The one 6 or 7 years ago went in an exact paralell to 92nd ave at federal and the one I saw the other night seemed to be exactly paralell to the nearby streets of 48th ave and 52nd aves as well. I see others saw this event so it would be nice to see if they witnessed the same patterns I did. Oh and also when the meteor went overhead my cell phone dropped the call I was on."],"City":"Denver","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown"}