{"Tags":"City","Country":"United States","Object Shape":"Circle","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2008 06:53 UTC","City":"Moline","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13450.html.txt","/var/www/straped/mufon/more/13450_submitter_file1__Photo_103108_001.jpg","/var/www/straped/mufon/org/13450.html"],"Disposition":"Insufficient Data","Log Number":"US-10312008-0027","Case Number":"13450","Source":"MUFON","Date Submitted":"10/31/2008 06:53 UTC","Weather Factors":"Unknown","Object Features":"None","Latitude":"41.5067","trends":["There have been 7 other sightings in Moline","There were no other sightings in Moline on or around October 31st 2008","This sighting has never been favorited.",""],"Summary":"Two Red Glowing Orbs slowly drift over my house South West to North East","Region":"Illinois","Longitude":"-90.515134","divs":["sighting detailsi was standing on my front porch, i had just lit a cigar and neighborhood kids were trick or treating. as i turned around toward the street my eye caught a red light in the sky at about 2 o'clock high. this red light was approaching slowly toward me. at first i thought it was a plane however it was moving too slow to be a plane. i stepped off the porch to observe the light as it was passing over my house. it passed straight over my house at a height of i would guess to be several thousand feet. looking at the object straight above it had no flashing marker lights as a plane would have. the object appeared to be round and it glowed orange\\red. as it passed over the brighness of the object suddenly changed to a faint red dot. i could track this dot as it proceeded north east. i lost it as it passed behind the neighbors house. the object made no noise. i called my father at 6:58pm after the object left my field of view. he lives about 20 minutes in that direction and i asked if he would go out and look west. hoping he would see this object as it approached. my father noticed a white light moving slowly but didnt think anything more of it. while on the phone with my father i looked up and another orb was moving on the same trajectory. i disconnected the call and managed to take one photo with my camera phone. the orb faded out as the first one did and i could track a smaller faint dot as it moved north east. second sighting was at 7:00 pm shortly after two older teens were walking in front of the house. i asked them if they saw anything and the teens indicated that they saw what looked like a flying pumpkin."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.5067,+-90.515134(13450)&iwloc=A&hl=en\"> mufon case (13450) map </A>"}