{"Weather Factors":"None","Date Submitted":"11/01/2008 10:30 UTC","City":"Frisco","files":["/var/www/straped/mufon/html2text/13462.html.txt","/var/www/straped/mufon/org/13462.html"],"Disposition":"Unknown","Region":"Texas","Case Number":"13462","Country":"United States","Summary":"High, metallic, shiny (sun reflecting), hovering","Sighting Duration":"00:10:00","Longitude":"-96.818852","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around November 1st 2008"],"Object Flight Path":"Stationary,Straight-line path","Date of the Event":"11/01/2008 10:30 UTC","Object Shape":"Circle","Latitude":"33.157674","Object Features":"Dome","divs":["Sighting DetailsAt daughter's soccer game at Warren Park in Frisco, TX. Game started at 10:30. Seated, facing west. I looked up and saw the airliners flying overhead inbound to DFW. Then I noticed a shiny object much higher than the commercial aircraft. Didn't think anything of it at first, figured it was a higher airplane above the DFW Class A airspace enroute. But then looked again a few minutes later. It was still there. Hovering, it seemed. It was slowly moving to the ENE, it looked like. There were a couple of photographers there taking professional pictures of the soccer players, so I went over to the male (who speaks with a British accent, didn't get his name, or the name of the company, but could easily be found) and asked him if he was using a zoom lens, then told him that this is going to sound weird, but there might be a UFO above us. I pointed up at it and suggested to take some pictures, said he might become famous some day because of it. So he did, and came over to me and showed me an interesting picture. He zoomed into the image (digital camera) as far as he could, and it looked like three or more connected circles. He even said it looked weird. The object was moving slowly. The sun was to the SE. I watched it for a few more minutes, then the game, then looked up again, and the object was gone. I was thinking if it was a weather balloon that maybe it deflated or was in a position where it wouldn't reflect the sun anymore. But it was a round object, so even if it rotated I think it would still reflect sunlight. I scanned the sky all around and didn't see it. Or it was an aircraft (man made or alien, I don't know) and it left the area. The photographer can easily be found. I need to check with the soccer coach to get the company name that was taking the pictures. This occurred in Frisco, Texas, 75034 zip code. You can find Warren Park on Mapquest at the intersection of Eldorado and North County Road. Warren Park is on the SE corner of the intersection. Again, object was very high, angle up from the soccer field was probably 60 to 80 degrees during the observation time. It was above the DFW Class A airspace. I know because I am a pilot. The Class A airspace ceiling is 10K feet. It was slowly moving to the east, then it disappeared."],"Tags":"City","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.157674,+-96.818852(13462)&iwloc=A&hl=en\"> mufon case (13462) map </A>","Log Number":"US-11012008-0009","Source":"MUFON"}