{"Source":"MUFON","trends":["There have been 7 other sightings in Roswell","There were no other sightings in Roswell on or around October 31st 2008","This sighting has never been favorited.",""],"Country":"United States","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","divs":["sighting detailslast night around 8:45 to 9:00pm; i went for a walk after one of my friends had left. i walked south down out of the cul-de-sac on which i live, and down the street. i was about halfway down the road when i decided to stop under a streetlamp, and do what i always do on cloudless nights. scan the skies. i called my dad to ask him something as i began to look around. i began to scan intently and saw a few planes in the distance, but when i looked in the western sky i noticed an orange sphere\\or orb. it was oscillating\\pulsing as it drifted off to the north. i told my dad i saw something weird in the sky and he must have though i was crazy. i began to feel very startled and almost freaked out by the experience, yet at the same time exhilarated. the object was following a direct flightpath of most planes in our area, but i assure you this was no jetliner. i have seen many planes, jets, and helicopters; military and civilian in this area but it just didn't meet the description of any earthly craft i have seen. panic set in as i realized this definitely wasn't something i could not readily identify. i began to review stories in my head of people being taken while on a stroll in their neighborhoods after dark. that was when i decided i wasn't just going to just stand there and watch it. i was still on the phone with my dad at this time i so i told him that i would be home in a few minutes, and hung up. i then seeming ran for dear life as fast as i could back to my house and watched from the porch. the craft flew almost directly overhead and just then the orange light turned off and gave way to what looked like airplane lights but there was no green or red lights on the wingtips just bright yellowish-white ones, and there were no flashing lights at all. i went inside the house; my heart pounding. i sat down and reviewed what i saw. it was then that i noticed the craft also made no noise whatsoever. after calming down i turned on the tv and began watching ghost hunters live, and all the while i couldn't get the thoughts out of my head of what in the hell had i seen. after a couple hours i began to get tired so i walked up to to my room, and jumped in bed. surprisingly i slept very soundly."],"Date of the Event":"10/31/2008 09:00 UTC","Object Shape":"Circle, Fireball, Sphere, Star-like","Case Number":"13461","files":["/var/www/straped/mufon/html2text/13461.html.txt","/var/www/straped/mufon/org/13461.html"],"Sighting Duration":"00:05:00","Disposition":"Insufficient Data","City":"Roswell","map":"<A HREF = \"http://maps.google.com/maps?q=34.030315,+-84.357583(13461)&iwloc=A&hl=en\"> mufon case (13461) map </A>","Date Submitted":"10/31/2008 09:00 UTC","Object Features":"Undisclosed","Latitude":"34.030315","Summary":"Pulsating/Oscilatting Sphere or Orb Spotted Over Marietta/Roswell Area","Log Number":"US-11012008-0008","Longitude":"-84.357583","Object Flight Path":"Undisclosed","Region":"Georgia"}