{"Log Number":"US-11012008-0011","Region":"California","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"10/31/2008 12:00 UTC","Latitude":"33.675104","Object Shape":"Blimp, Cigar","Summary":"cigar,translucent blimp, lights on left, moved eliptical, then seperated.","Country":"United States","files":["/var/www/straped/mufon/html2text/13464.html.txt","/var/www/straped/mufon/org/13464.html"],"trends":["There have been 3 other sightings in La Quinta","There were no other sightings in La Quinta on or around October 31st 2008"],"divs":["Sighting DetailsI was in my backyard in LaQuinta, Ca. Halloween night, 2008 when I saw a cigar, see through, blimp shaped, object in the sky to the East. First thing I thought of HG Wells halloween prank. When I realized what I was actually seeing I yelled for my husband to come out and look at the object and tell me what he saw. It was the same discription. It was very high in the sky, moving to the west in an almost eliptical pattern. The left side had a circular pattern of lights while the right seemed to have only one light. We shut off our pool equipment to listen for any type of noise, it was silent. We covered up an uplight to try and see the object better. The lights on the left side of the object seemed to seperate and spiral away from eachother. They seperated in different directions. While all of this was happening I said we should take a picture and my husband said there is no way it would take on our plain old kodak camera, that we would have have a specialized equipment. I now understand why you never see any really good photos of ufo's. The whole experience took about three minutes. After the lights seperated everything seemed to fade and it was gone. No trails or flashes like you see on Star Trek. We are forever changed from this event. While we were viewing the event, we called some of our friends and told them what we were seeing. My sister inlaw told a friend of what we had seen. He checked the web and said someone else in San Mateo,Ca. had seen the same thing. The friend told her about this site and for us to post our sighting. I wanted to call the police and report what we saw. My husband said that nobody would believe us, especially on Halloween. We tried to explain away what we saw and have not been able to rationally, explain away the experience other than it was a ufo sighting. I will now try to find confirmation that others experienced the same event."],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.675104,+-116.305947(13464)&iwloc=A&hl=en\"> mufon case (13464) map </A>","Date of the Event":"10/31/2008 12:00 UTC","Case Number":"13464","City":"La Quinta","Weather Factors":"Unknown","Disposition":"IFO","Longitude":"-116.305947"}