{"Log Number":"US-11012008-0014","map":"<A HREF = \"http://maps.google.com/maps?q=30.180613,+-81.736418(13467)&iwloc=A&hl=en\"> mufon case (13467) map </A>","Case Number":"13467","trends":["There have been 8 other sightings in Orange Park","There were no other sightings in Orange Park on or around October 26th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Weather Factors":"None","Country":"United States","Sighting Duration":"00:00:01","Longitude":"-81.736418","Tags":"City","Summary":"After viewing video of the Blue Angels Airshow at NAS Jax on Oct. 26th we noticed a sphere travel extremely fast past a jet we were video taping","files":["/var/www/straped/mufon/html2text/13467.html.txt","/var/www/straped/mufon/more/13467_submitter_file3__MVI_1078_0003.jpg","/var/www/straped/mufon/org/13467.html"],"City":"Orange Park","Date of the Event":"10/26/2008 02:30 UTC","Object Shape":"Sphere","Object Flight Path":"Straight-line path","Date Submitted":"10/26/2008 02:30 UTC","Disposition":"IFO","divs":["Sighting DetailsMy wife and I went to see the Blue Angels on Oct. 26th at NAS Jax in Clay County. The airshow was being held on the landing strip from 9am through 5pm. We arrived about 1pm just in-time to video a F-18 flying overhead. As it zoomed past us it turned on it's burners and went straight up. Once it reached it's peak height, it rolled over and headed back down. As it's coming down you'll see at the bottom right of the screen a small white sphere come across at a diagonal to the upper left portion of the screen. Attached is an example of it at normal speed, another example slowed down to 2 times and a still frame of the object. It looks as though the object is pulsing as it comes across. It's hard to tell but it seems to fade and then come back brightly. In the short span of video, it does this four times. When viewing the video at normal speed, the object is traveling so fast that it makes the jet look like it's standing still. The skies were crystal clear that day. We didn't see it while watching the airshow or video taping. Once we got home, after about a week we starting looking at the video we shot and this is what we captured. Does anyone know what this might be?"],"Latitude":"30.180613","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Region":"Florida"}