{"Country":"United States","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Unknown","Latitude":"32.697714","Date of the Event":"10/28/2008 07:15 UTC","Case Number":"13468","Source":"MUFON","City":"Aledo","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/13468.html.txt","/var/www/straped/mufon/org/13468.html"],"Log Number":"US-11012008-0015","Summary":"3 objects with large round lights - I believe there were at least 3 to each object and they were bright and white lights","map":"<A HREF = \"http://maps.google.com/maps?q=32.697714,+-97.596747(13468)&iwloc=A&hl=en\"> mufon case (13468) map </A>","Object Features":"Undisclosed","Tags":"City","Disposition":"Unknown","trends":["There have been 4 other sightings in Aledo","There were no other sightings in Aledo on or around October 28th 2008"],"Region":"Texas","Sighting Duration":"00:01:00","Object Shape":"Disc, Oval, Unknown","Date Submitted":"10/28/2008 07:15 UTC","Longitude":"-97.596747","divs":["Sighting DetailsMy friend and I were driving from Aledo to attend a baby shower in Fort Worth. We were pulling onto the highway from Aledo and it was about 7:15 pm on Oct. 28, 2008. It was dark and we were just talking and looking straight ahead and we saw 3 ufo's that appeared to be fairly low straight ahead of us sort of hovering above the interstate. If they were moving at all they were moving slower than we were because we soon passed underneath them and there were cars driving past us because we had slowed down to try to digest what we were seeing. I told my friend to watch the road so that we would not have an accident and I turned around to try to see them out the back of the car but it was so dark and once we passed them I could not see them any longer. I was in such shock that I could not tell you much about them except that there appeared to be 3 objects and they each had at least 3 large round bright white lights. My best guess is that they were oval shaped but it was so dark that I could not be sure. The lights were extremely bright and they appeared to be fairly low sort of hovering above the highway. There is no way that other cars did not see them because there was alot of traffic. The next morning we were both on the internet trying to find out all we could and to see if other people had reported seeing them. The next day (Oct. 30) the Star Telegram had an article about sightings in Brownwood and Erath but nothing was mentioned about Parker County that I am aware of. I have never been one to believe in ufo's but these were definitely not any kind of aircraft that I have ever seen before. We were hesitant to tell people at the shower for fear that they would think that we were crazy, but we did tell them and when the article came out in the paper they all were calling us and saying that they believed us now. We do not want to be interviewed or recognized and we want to remain anonymous. I did feel that it was important to report it though."]}