{"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.457997,+-112.064967(13465)&iwloc=A&hl=en\"> mufon case (13465) map </A>","Country":"United States","Tags":"City","Weather Factors":"Unknown","Object Shape":"Triangle","Date Submitted":"10/31/2008 06:44 UTC","Region":"Arizona","Log Number":"US-11012008-0012","Disposition":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13465.html.txt","/var/www/straped/mufon/org/13465.html"],"Longitude":"-112.064967","divs":["Sighting Details On Halloween, my wife and I like to sit outside of our house to greet the trick-or-treaters and chat with the neighbors. We had just gotten everything set up and had yet to greet our first visitors when I turned my head up to look at the stars. I am an astronomy buff and tend to often look up at the stars. When I looked up - almost straight up, I happened to look directly at this object. It had five dim lights that were arranged like a sharp isosceles triangle. At first I thought it was some geese, but as my eyes adjusted, I then began to be able to discern the craft's body. The body was solid a triangle that wrapped around lights with a decent amount of margin between the lights and the edge of the craft. Its large, dim, diffuse and unblinking lights were very different from the sharp and bright points of light given off by all of the aircraft I had ever seen at night. I immediately tried to point it out to my wife, but since it was dim she never did spot it. As I pointed it out for her, I never took my eyes off of it. Through the short time I saw it, it silently traveled about 40 to 50 degrees using the astronomy rule of thumb of a fist at arms length = 10 degrees before it had traveled beyond the range of my vision. It traveled a straight line from west to east with a slight variance from the north to the south. I had nothing to judge its size or distance by, but if I had to guess - it was 700-1000ft up and roughly 40 foot long and 25 foot wide. I am not a believer in UFOs and I am quite surprised to have seen what I saw. This is not what I expected to see from my front yard that night."],"City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 31st 2008"],"Summary":"I looked up and saw a fast moving, trianglular shaped object with 5 large, dim lights on it.","Object Features":"None","Date of the Event":"10/31/2008 06:44 UTC","Case Number":"13465","Latitude":"33.457997","Viewing Distance":"501 Feet - 1 Mile"}