{"Summary":"Saw light 3x. Drove towards it. stayed in place then moved over and shot upwards out of sight.","Sighting Duration":"00:15:00","Weather Factors":"None","Longitude":"-97.586139","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Disposition":"Unknown","trends":["There have been no other sightings in Decatur","This sighting has never been favorited."],"Date of the Event":"10/29/2008 05:40 UTC","Date Submitted":"10/29/2008 05:40 UTC","Source":"MUFON","divs":["Sighting DetailsI was walking outside preparing to go to work when noticed bright light in the sky that was stationary. Walked back in the house and came out again and light was still there and fairly bright in the northwest sky. Walked in the house once again and came out to leave for work and light was still stationary. Now I have lived by a municipal airport now for over 30 years and have even had flying lessons so I am very familiar with aircraft, there lights and their flight patterns. It so happened to be in the direction I had to drive towards for work, so I headed that direction and realized that it definitely was not a plane for there were no flashing lights. It then slowly started heading towards me not sure about the exact distance up in the sky but too low for a plane to be flying. When it was overhead, I stopped my truck and looked out the window to see where it was heading when it suddenly took off at a very fast speed swerving upwards till it was out of sight and gone. I live on the edge of a very small town and basically in the country where the night sky is quite visible and this is not the first time this has occurred. On any given night you are almost guaranteed to see some foreign objects in the night sky that are unexplainable as I and my son have witnessed numerous times."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.234283,+-97.586139(13474)&iwloc=A&hl=en\"> mufon case (13474) map </A>","Tags":"City","Country":"United States","Object Shape":"Circle, Star-like","Viewing Distance":"Over One Mile","Region":"Texas","Case Number":"13474","City":"Decatur","files":["/var/www/straped/mufon/html2text/13474.html.txt","/var/www/straped/mufon/org/13474.html"],"Latitude":"33.234283","Object Features":"Unknown","Log Number":"US-11022008-0006"}