{"Disposition":"IFO","Tags":"City","Object Flight Path":"Stationary","Case Number":"13472","Date of the Event":"10/29/2008 07:20 UTC","Viewing Distance":"Over One Mile","Longitude":"-97.793764","City":"Weatherford","Source":"MUFON","Object Shape":"Unknown","Region":"Texas","Latitude":"32.765086","trends":["There have been 9 other sightings in Weatherford","There were no other sightings in Weatherford on or around October 29th 2008"],"Summary":"Four bright lights in line horizontially suddenly turned vertical and disappeared.","Object Features":"Unknown","divs":["Sighting DetailsOn the night of Oct. 29, 2008 at about 7:15 I took our new puppy outside for a potty break. The sky was clear and all of the stars were visible. I was looking at Venus, which was very bright in the southwestern sky, when I noticed 4 bright white lights low in the southwestern sky. They were in a horizontal line and they were evenly spaced apart. They looked like they were sitting still, but they could have been moving toward me. I watched them for several minutes, all the while trying to yell for my daughter to come out. Suddenly the lights became orangish and turned to a vertical line still evenly spaced then the lights went out and I did not see them again. I went and got my daughter and we continued to watch the sky. We began to see many planes fly to the southwest. We live just west of Ft. Worth and the Joint Reserve Base so we are used to aircraft activity, but this activity was definitely different. It seemed like they were patrolling or looking for something. My husband had been at work 4 miles to the south of our house. When he got home at 7:45 my daughter ran out and said \"Guess what Mom saw\", he said \"No, let me tell you what I saw\". He works in the gas well industry and had been on a location on a bluff in the middle of nowhere. He was taking a picture of Venus with his cellphone when he noticed the lights. He only saw them long enough for them to turn vertical and then disappear. I was amazed but happy that he had seen the same thing and I was not crazy. I immediately got on the internet to see if anyone else had seen them. I found that people had been seeing things the whole week before in the Stephenville and Dublin area. These sightings had not been reported on our news or in the paper yet, but oddly enough they were the very next day. I had started to report this to you on the night it happened, but stopped because I kind of felt dumb. I didn't want anyone to think I was crazy, but the next day my husband and I both told people and most people seem to believe us. I guess people around here are getting used to the idea that something is going on and our government knows about it. By the way, the planes have been patrolling every night since the incident and this is not a normal pattern for them."],"files":["/var/www/straped/mufon/html2text/13472.html.txt","/var/www/straped/mufon/org/13472.html"],"Sighting Duration":"00:02:00","Log Number":"US-11022008-0004","Date Submitted":"10/29/2008 07:20 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.765086,+-97.793764(13472)&iwloc=A&hl=en\"> mufon case (13472) map </A>","Weather Factors":"None"}