{"Case Number":"13480","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Longview","There were no other sightings in Longview on or around July 15th 1969"],"Date Submitted":"07/15/1969 08:30 UTC","Object Features":"Other","Source":"MUFON","Log Number":"US-11022008-0012","map":"<A HREF = \"http://maps.google.com/maps?q=32.509164,+-94.735849(13480)&iwloc=A&hl=en\"> mufon case (13480) map </A>","Country":"United States","City":"Longview","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-94.735849","Region":"Texas","Tags":"City","files":["/var/www/straped/mufon/html2text/13480.html.txt","/var/www/straped/mufon/org/13480.html"],"Disposition":"Unknown","Latitude":"32.509164","Object Shape":"Triangle","Date of the Event":"07/15/1969 08:30 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI am not sure about the year exactly, but I do know that it was the late 60's or early 70's. My husband, two young sons, and I were at a drive-in theater watching a movie that I found to be boring. We were parked close to the concession stand, which was clearly lighted. It was a warm summer night, clear weather with the stars beginning to show up nicely. I leaned back against the door, leaned my head back out the window to look at the stars. The area that I was looking at was directly up and slightly over toward the concession stand when I saw this huge triangular shaped craft slowly going from West to East. It had no sound, moved about the speed of a small private airplane, such as a Cessna. The light from the Concession stand and the drive-in seemed to possibly aid in the soft glow from the center circle. I did notice the small green light on the triangular wing-tip. I didn't notice anything else-no other lights or areas for lights. It appeared to be fairly flat on the bottom, and I couldn't see any depth due to the fact that I was very close to being under it. I saw no exhaust. I jerked back inside the car and told my husband to look, but by that time, it was not visable. It definately was a solid craft because I could see it clearly outlined against the sky, blotting out the stars, and having a green light, plus softly lit circle in the center underneath. There was no time to really react. I was in awe at what I what I was looking at, but there was an air force base in Barksdale, LA and I guess that I thought that this was one of our new crafts headed over there. Years later, I read that Mr. Bell, the radio guy, and his wife saw one simular to this craft. No government in the world has come forth to make this particular craft public during these last thirty-eight to forty years since I saw it."],"Summary":"Silent. Matted black with softly lit circular center area.Triangle about 700-1000 ft up. and about football field from tip to widest end. Had small non-pulsating (airplane) green light on left wide end."}