{"Longitude":"-71.282778","Object Shape":"Unknown","Viewing Distance":"101-500 Feet","trends":["There have been 2 other sightings in Bartlett","There were no other sightings in Bartlett on or around September 18th 2008"],"divs":["Sighting DetailsTwo 42 year old adults returning home just after 8pm EDST saw two sets of \"stadium intensity\" lights, 4 to each set, suddenly appear over a power substation of the Attitish Ski area approximately 100 yards from witnesses in a pickup truck. The light groups were separated by a short distance and one set was to the left and slightly below the other. Startled, it took 10-15 seconds to stop the truck but by then the lights were gone. The color of the lights was white or yellow. No sound was heard. Their two children, under 7 years of age did not see the lights but kept asking their parents why they were so upset. The next day, trying to find a logical explanation, the husband returned to the area asking any resident outside if they had seen anything. One couple from Massachusetts who were renting one of the condo's had seen lights but from a location app. 12 miles away on route 112 at about the same time. Their names are unknown. The witness's did locate 3 others who saw the lights and will try to get their permission to release their names to me for followup. One of those witnesses heard a strange \"hovering\" sound behind his house but saw nothing. In his search, the husband found a white SUV sitting at the sighting location but the driver refused to acknowledge his presence. There are no time anomalies or other effects reported by the primary witnesses or their children."],"City":"Bartlett","Source":"MUFON","Date of the Event":"09/18/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.077778,+-71.282778(13481)&iwloc=A&hl=en\"> mufon case (13481) map </A>","files":["/var/www/straped/mufon/html2text/13481.html.txt","/var/www/straped/mufon/org/13481.html"],"Log Number":"US-11022008-0013","Weather Factors":"None","Latitude":"44.077778","Region":"New Hampshire","Sighting Duration":"00:00:15","Disposition":"Unknown","Date Submitted":"09/18/2008 12:00 UTC","Country":"United States","Summary":"Two sets of 4 high intensity lights appeared just above trees over a power substation","Object Flight Path":"Stationary","Case Number":"13481","Tags":"City","Object Features":"Unknown"}