{"Country":"United States","Case Number":"13488","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.178489,+-122.23583(13488)&iwloc=A&hl=en\"> mufon case (13488) map </A>","Weather Factors":"Unknown","Date of the Event":"08/31/1960 05:00 UTC","Latitude":"40.178489","Sighting Duration":"01:30:00","Summary":"Orange Sphere appeared 4 evenings in a row and lasted for about 1 1/2 hours.","Region":"California","Longitude":"-122.23583","Tags":"City","Date Submitted":"08/31/1960 05:00 UTC","trends":["There have been 6 other sightings in Red Bluff","There were no other sightings in Red Bluff on or around August 31st 1960","This sighting has never been favorited.",""],"Object Shape":"Sphere","Disposition":"Unknown","divs":["sighting detailsthis event happened about 48 years ago and i was about 15, but i will never for get it. i was in the house with my mom when my father came home from work. i do not know what i was doing, but my dad told my mom and i to come outside and see something very unusual. when i first looked into the west evening sky, i thought i was looking at the moon. but instead of the normal color of the moon, this thing was a bright dark orange. it was about the same size of the moon, and as i recall now about 500 feet in the air. when i told my dad, its just the moon my dad told me to turn around and look in the eastern sky. there was the moon high in the eastern sky. it was not the moon. this object just stayed in the same place, size and color. when my dad and i walked south to a neighbor's house (about 1\\4 mile) the object vanished. as we walked back north, the object reappeared. after stopping and moving back and forth several time, there was a point in which the object could be seen and by moving a short distance (maybe 10 feet) south the object would vanish. move ten feet north and the object would reappear. this also happened if you drove north and south. there was a certain area that the object could only be seen in. this happened for about 4 days at the samae time and the the object dissapeard at the same time each day. we contacted my high school science teacher (mr. mckay who taught at red bluff union high school, red bluff) on the second day to observe the object. he called some friends and they came to observe the object on the 3rd and 4th evenings. we had a lot of people by the 4th day looking at the object. (note: when you looked at it with binoculars, i looked just the same, no closer just the same size, a dark orange sphere). i was totally awe-struck and to this day do not know what it was. has anyone else seen this or reported it in the past. i am only bringing this to your attention, because i watched a show on the tv history channel where mufon was mentioned. this has always bothered me, and i always think about it mr. mckay took photos of the object, but passed away years ago, and i'm sure the photos are lost as well. my mother and father are both deceased as well. again, this object would not rise, fall, or drift left or right. i stayed at the same spot, and appeared at the same time and disappeared at the same time for 4 day in a row. it never appeared on the 5th day or since. please tell me some one else has seen somethig similar. see attached sketchs file #1 and file #2"],"Object Flight Path":"Undisclosed","City":"Red Bluff","Log Number":"US-11032008-0003","files":["/var/www/straped/mufon/html2text/13488.html.txt","/var/www/straped/mufon/org/13488.html"],"Viewing Distance":"Unknown","Source":"MUFON"}