{"Disposition":"Unknown","Summary":"Circling lights -- yellow on one side of the car, and blue on the other -- on each side of our vehicle as we moved north on County Rd. 106","Object Features":"None","Country":"United States","Viewing Distance":"101-500 Feet","Log Number":"US-11022008-0015","divs":["Sighting DetailsOn Friday night, August 22, 2008, my five-year-old son (Joe) and I were driving north on County Road 106 towards State Hwy. 10. We were driving our 2003 Camry; he was seated behind me -- belted and in his booster seat. We were the only two people in the vehicle. It was a clear and dark evening, around 10 - 10:15 p.m. We were on our way to Perham, MN. Along County Road 106, there are scattered farms. I was driving about 60 or 65 miles an hour. I was in a hurry to get to Perham before too late so that my little son could get to bed. We were both talking and awake. We drove through the Leaf River valley, which has no farms (just scrubby brush). North of the Leaf River valley you ascend a small rise. We were there -- between the rise and State Hwy. 10 to our north when the event happened. I saw bright yellow circling lights -- each light was rectangular shaped, and when they spun I could tell the ship, or whatever it was, was circular -- out the passenger side window of the car. They were spinning very fast. The object looked to be about 50 yards from my vehicle -- it was maybe 15-20 feet wide and it was in the air. I could not see any mass to it except the lights. The only thing I could hear was my own vehicle. Our car windows were closed. I said, \"Joe! Look at that! What is that?\" He says, \"Mom! There are blue lights out the other side!\" I turned my head to the left and looked out the driver's side window and saw the same thing, circling rectangular lights, but these were blue. I took my foot off the gas and began to pull over to the side of County Road 106. I put the vehicle in \"park\" and rolled down my window. When I turned to look at the sky (back and to the south), the lights were gone. We were quite excited about it and have told many people about the circling lights. I have driven a lot -- at night, and through farm county -- but I have never seen anything like this in my life."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.391072,+-95.321423(13483)&iwloc=A&hl=en\"> mufon case (13483) map </A>","Date Submitted":"08/22/2008 10:00 UTC","files":["/var/www/straped/mufon/html2text/13483.html.txt","/var/www/straped/mufon/org/13483.html"],"Weather Factors":"Windy","Latitude":"46.391072","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Deer Creek","This sighting has never been favorited."],"Tags":"City","Date of the Event":"08/22/2008 10:00 UTC","Case Number":"13483","Source":"MUFON","Region":"Minnesota","Object Shape":"Circle","Longitude":"-95.321423","Object Flight Path":"Hovering then path","City":"Deer Creek"}