{"divs":["Sighting DetailsI was riding in the left backseat of the car as we were heading to Lakeland from Bartow. I was gazing absentmindedly through the front passenger window when I noticed something unusually bright in the sky at about a 2:00 position. At first I thought it was a star or a planet, but the closer we got to it the bigger and brighter it became. Also, it started out lowish in the sky and gradually rose a bit higher (or perhaps that was an illusion created by us nearing it). I did not feel frightened or even very surprised when I realised I could not identify the object. I am very accustomed to the subject of UFOs and research them in-depth regularly. My only emotion at the time was a determination to analyse it as thoroughly as possible and look for any signs of aircraft parts or other things that would help me to identify it. It was quite bright, a slightly bluish, VERY crisp light. Piercing, really. Sharp. Not a soft glow at all. Very intense, very non-aircraft-like. Steady, no blinking, no falter at all from dust or atmospheric distortions. Persistent and clear, with a certain powerful presence in the sky, a stability. At first it didn't seem to be moving at all, just hovering over one spot, but after about three minutes I could tell that it had begun moving in the same general direction we were going, obviously faster than us. After about five minutes total of having the object in sight, it rose too high into the sky for me to see and I lost sight of it. The other person in the car did not seem to have noticed it, which is understandable as he was tired and trying to focus on driving. After the sighting I felt slightly unsettled because I had never before witnessed a light in the sky that had been that bright and stable. It truly did seem \"other-worldly\", as I've heard other UFO witnesses describe."],"Viewing Distance":"Unknown","Object Shape":"Star-like","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/13497.html.txt","/var/www/straped/mufon/org/13497.html"],"Sighting Duration":"00:05:00","Tags":"City","Longitude":"-81.509204","trends":[],"Log Number":"US-11032008-0012","map":"<A HREF = \"http://maps.google.com/maps?q=27.671097,+-81.509204(13497)&iwloc=A&hl=en\"> mufon case (13497) map </A>","Country":"United States","Date Submitted":"11/02/2008 09:40 UTC","Weather Factors":"Unknown","Case Number":"13497","Source":"MUFON","City":"Undisclosed","Latitude":"27.671097","Region":"Florida","Date of the Event":"11/02/2008 09:40 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Summary":"In car. Noticed starlike object, which became larger and brighter as we neared it (or it neared us?)"}