{"Case Number":"13490","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/13490.html.txt","/var/www/straped/mufon/more/13490_submitter_file2__mapsight.jpg","/var/www/straped/mufon/org/13490.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.706346,+-98.117873(13490)&iwloc=A&hl=en\"> mufon case (13490) map </A>","Date of the Event":"10/23/2008 09:00 UTC","Region":"Texas","Latitude":"31.706346","Viewing Distance":"Unknown","Date Submitted":"10/23/2008 09:00 UTC","Sighting Duration":"Undisclosed","Object Features":"None","Summary":"4 Large Orange Lights Disappear, Reappear, & Merge to 1 Then Vanish","Tags":"City","City":"Hamilton","Country":"United States","divs":["Sighting DetailsNote: This sighting is reported by William Puckett (MUFON UFO Investigator) who received this report via phone call from the primary witness: I talked to both witnesses and they reported the sighting one week after it happened. They stated that they were driving north-northeast on Highway 281 just south-southwest of the Hamilton, Texas Airport. They noticed four very large orange lights in a horizontal line. Each light was about 50% the size of a full moon. The lights were at high angle, but then all blinked out and then reappeared at a lower angle. The lights then blinked out and reappeared a lower angle, but only one light reappeared. This light then gradually dimmed and disappeared. The witnesses stated that the lights were seen outside the driver's side window (northwest). The witness stopped his car and viewed the lights before they disappeared. No sound was heard. The witness got out his camera, but the lights disappeared before he could take a photo. William Puckett Comments: Several sightings of similar lights (object) were seen in this area of Texas on October 23 and again on October 25. The identity of these sightings is unexplained. Apparently the military was conducting exercises in the nearby Brownfield Operation Area on the evening of October 23. This investigation is in progress."],"trends":["There have been 8 other sightings in Hamilton","There was one other sighting in Hamilton on or around October 23rd 2008","This sighting has never been favorited.",""],"Disposition":"Unknown","Object Flight Path":"Other","Source":"MUFON","Longitude":"-98.117873","Weather Factors":"Unknown","Log Number":"US-11032008-0005"}