{"Summary":"Stars that have flashing lights and seem to move in strange patterns","Latitude":"33.364846","Date Submitted":"10/25/2008 09:30 UTC","Viewing Distance":"Unknown","City":"Smackover","Date of the Event":"10/25/2008 09:30 UTC","Tags":"City","Object Flight Path":"Stationary","Log Number":"US-11032008-0013","Country":"United States","Object Shape":"Disc, Sphere","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI was in the back yard looking at the stars and noticed a very bright star. The longer I looked at it, I started noticing it moving. It was only one of several I would see over the next two weeks. I have seen as many as 12 in the night sky at once. Others have also seen them. They seem to have stationary positions on the nights I see them. I also noticed a red one follow a jet for a few minutes. One thing most of them had in common were these small orbs, or points of light that were going around, to and from the large crafts. I called local police and reported the event on the first night. They send a car. The police shined their lights in the trees. I called again to explain that these crafts were high up in the atmosphere and not over the tree tops. They put me on hold and never picked up on the line on that call. I hung up. There have been a couple of nights that I didn't see them, but most every night for the last two weeks I have at least seen one or two in the night sky. One night I saw them flying in a formation like a school of fish. At least 30 or so would all move in the same direction, but these were orbs, not the large crafts with the colored lights. I took a picture with a digital camera, but the image was a line. I couldn't keep the camera still. In the pictures, the lines have all different color lights. Pictures of other stars appear round and white. Thats all so far."],"files":["/var/www/straped/mufon/html2text/13498.html.txt","/var/www/straped/mufon/org/13498.html"],"Longitude":"-92.724882","Source":"MUFON","Disposition":"IFO","Object Features":"None","Region":"Arkansas","trends":["There have been no other sightings in Smackover","This sighting has never been favorited."],"Case Number":"13498","map":"<A HREF = \"http://maps.google.com/maps?q=33.364846,+-92.724882(13498)&iwloc=A&hl=en\"> mufon case (13498) map </A>"}