{"Summary":"Update to Freestone County Sighting on Tues. Oct, 21st. Three long cylinder objects above horizon due West of Fairfield at dusk","files":["/var/www/straped/mufon/html2text/13506.html.txt","/var/www/straped/mufon/org/13506.html"],"divs":["sighting detailsthis is my second report as i would like to update what i reported previously. we had two sightings back to back on tuesday, oct. 21st and then tuesday, october 28th. i previously reported (at length) the sighting on oct. 28th and was contacted by a mufon investigator from waco who was extremely professional. i told him verbally about the first sighting but i did not report it here at length on this website. i would like to now because of the heightened number of sightings here in this part of texas (an hour 1\\2 from stephensville)and the fact that we know of at least two other people here in fairfield that saw the same thing (we just found this out yesterday). if there are others who are reading this and live in freestone, limestone or navarro county, please consider reporting what you saw to mufon. here is the tuesday, october 21st sighting: i had just returned from town from a business meeting and i know the meeting ended around 6:30 so the sighting occured around 7:00 (we live 6 miles out of town and have very clear views of the surrounding sky). my boyfriend and i had gone out to the back porch to watch the beautiful sunset (cool, clear, fall weather). we immedietly noticed 3 streaks in the sky in perfect formation. at first we assumed they were jet trails and did not think much of them. as we continued working in the backyard we noticed that the \"streaks\" were not disappearing and that they were actually highly reflective and had a distinct gun barrel shape. they were very shiny and did not seem to be moving. keep in mind, they were pretty far off from where we were (they looked like they were over by mexia towards waco). my boyfriend then noticed 2 more of them that seemed to be moving from south to north over by the jewett mine (at the very south of our county). they were visible until the sun went down maybe 20\\25 minutes from the time we actually saw them. last night, sunday nov. 2nd we went to dinner with a friend who lives in town. he is a very well respected person in town and had no reason to make anything up. we were making conversation at the table and mentioned our two sightings....i could not believe it when he said he saw the same 3 objects on the same date around the same time we did. he was with another well respected citizen and they both commented on how strange the \" cigar shaped balloons or whatever looked \". he said that they were really shiny and kind of floating in the western horizon. he said they were far off but he could tell they were big. i watched a video that was on the louisiana news this past week about a cylinder object or balloon that was captured on film by a flight instructor. the object this man captured on film looks very similiar to what we saw. it seems like there are a lot of sightings all of a sudden of unexplained objects - please if you are reading these reports and saw something here in this area - report it! i am asking mufon to continue an in depth investigation, whether it is military or not - something big is going on."],"Tags":"City","Date of the Event":"10/21/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.728823,+-96.155908(13506)&iwloc=A&hl=en\"> mufon case (13506) map </A>","Object Flight Path":"Stationary,Path then hovering","Log Number":"US-11032008-0020","Viewing Distance":"Unknown","Longitude":"-96.155908","Object Features":"Other","Country":"United States","Date Submitted":"10/21/2008 12:00 UTC","trends":["There have been 8 other sightings in Fairfield","There were 5 other sightings in Fairfield on or around October 21st 2008"],"Region":"Texas","City":"Fairfield","Case Number":"13506","Disposition":"Unknown","Object Shape":"Cigar, Cylinder, Other","Weather Factors":"Unknown","Source":"MUFON","Latitude":"31.728823","Sighting Duration":"Undisclosed"}