{"Weather Factors":"Windy, Lightning, Heavy, Light","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 28th 2008"],"Summary":"UFO appeared to me as I watched a lighting lit sky.","Sighting Duration":"Undisclosed","Longitude":"-112.064527","Case Number":"13508","map":"<A HREF = \"http://maps.google.com/maps?q=33.453117,+-112.064527(13508)&iwloc=A&hl=en\"> mufon case (13508) map </A>","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"33.453117","divs":["Sighting DetailsI am a cigerette smoker and always go to the back patio outside to smoke. That night we were having an incredible lightning storm. During a tv show my wife and I were wathcing, it went to a comercial so I went outside to have a cigerette. The lighting was impressive so I called my wife out to take alook she was afraid it was so violent with lighting and thunder, she went back inside, and I decided to just observe the lighting while I finished my cigerette. I was standing on my patio which has a patio roof or overhang I was facing south southeast, now I usally see many flying objects in that direction flying to and from an area where there is a small airport Deer Valley Airport, and I actully was observing an airplane heading towards the aiport and thinking what a rough ride that guy was having in this storm. At that moment a huge lighting flash really litup the sky when I saw what appeared to be a triangular object moving faster than any airplane or jet I've seen at that altitude which was below the airplane I had been observing and was coming from a east to west direction and appeared to be on a rail extending in front and behind the ufo which starteled me so much I froze not sure what to think I became overwhelmed with fear knowing what I saw but haveing a very hard time believing what I saw. I could not see it prior to the big flash or after, but the airplane that I was watching prior to the flash was still there heading toward Deer Valley Airport. The ufo was there, then gone, as if the lighting gave up it's stealth or invisability to me I was horrified, I walked to the other end of the patio to see if I could catch another look as it traveled away from my location. I did not see anything else, but more lighting, it was travling so fast I would of been shocked if I did see it again. I stood there for a few minutes when I noticed how bad I was shaking, I went back inside to get another cigerette and my wife looked at me and asked, what was wrong with me she said I looked like I just seen a ghost, then I explained to her what had just happened, she did not know how to respond to me, I can't explain what I saw but I know what it wasn'nt, we have no powerlines overhead or anything else that could be mistaken for what I saw. I beleive what I saw was real, that moment will alway's be in my memory."],"Region":"Arizona","Source":"MUFON","Date Submitted":"08/28/2008 09:00 UTC","files":["/var/www/straped/mufon/html2text/13508.html.txt","/var/www/straped/mufon/org/13508.html"],"Log Number":"US-11032008-0023","Object Features":"Other","Date of the Event":"08/28/2008 09:00 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Phoenix","Disposition":"Unknown","Object Shape":"Bullet, Missile, Triangle"}