{"divs":["sighting detailsi was interviewing a previous witness to the orange lights at the ranch that he manages. he has seen the lights 2 other times in the same location. during those occasions he said that the orange lights moved from west to east. we started watching the dark sky at about 8:00pm. the wind was calm and the visibility was unlimited and there were no clouds. the temperature was about 60 degrees. then at 8:50pm the orange lights blinked on, one at at time. they blinked off at different intervals so that they were not all on at the same time. there were about 15 total. they did not form a straight or curved line as some other witnesses have reported to me. during the event no other object was seen. the lights did not seem to be attached to any other object because they appeared to blink on randomly. the light were a bright color orange with maybe a hint of red or yellow. it was hard to tell there distance from us and they were about the size of a pea held at arms length. my estimate or their distance would be 3-5 miles away. we did not see or hear any military jets or helicoptersas other witnesses have reported. there was no sound and no physical effects were noticed. the other witness, greg plyant, said that his other tow sightings may have been a large disk with the orange light on them because the lights seemed to curve around in a 1\\4 semi-circle. he also noted about 6 military jets in the area. his previous sightings took place on october 23rd between 8-8:30pm and on october 28 at about the same time."],"Tags":"City","Country":"United States","Case Number":"13500","Latitude":"31.706276","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"10/30/2008 08:50 UTC","City":"Hamilton","Region":"Texas","Sighting Duration":"Undisclosed","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=31.706276,+-98.118893(13500)&iwloc=A&hl=en\"> mufon case (13500) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13500.html.txt","/var/www/straped/mufon/org/13500.html"],"trends":["There have been 8 other sightings in Hamilton","There were no other sightings in Hamilton on or around October 30th 2008"],"Date Submitted":"10/30/2008 08:50 UTC","Weather Factors":"Unknown","Log Number":"US-11032008-0015","Object Flight Path":"Undisclosed","Disposition":"Unknown","Summary":"15 large orange lights were spotted SW sky about 25 degrees above the horizor. The blinked on and off did not move.","Longitude":"-98.118893"}