{"Case Number":"13501","Latitude":"31.348121","Source":"MUFON","Date Submitted":"08/15/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.348121,+-94.725307(13501)&iwloc=A&hl=en\"> mufon case (13501) map </A>","files":["/var/www/straped/mufon/html2text/13501.html.txt","/var/www/straped/mufon/org/13501.html"],"Object Flight Path":"Hovering then path","Date of the Event":"08/15/2008 12:00 UTC","trends":["There have been 7 other sightings in Lufkin","There was one other sighting in Lufkin on or around August 15th 2008"],"Summary":"BRIGHT WHITE longer than a BLIMP LOW slow than just gone REALLY BIG!","Country":"United States","Weather Factors":"None, Does Not Apply","Longitude":"-94.725307","Viewing Distance":"101-500 Feet","Object Features":"None","Sighting Duration":"Undisclosed","Object Shape":"Blimp, Cigar","Log Number":"US-11032008-0016","City":"Lufkin","Tags":"City","Region":"Texas","Disposition":"Unknown","divs":["sighting detailswe, me and my cosin and 3 of our kiddos were traveling south on tulane dr. in lufkin tx and about 1\\2mile befor it intersects w\\ whitehouse dr. now just to make it clear tulane dr runs almost parallel with us hwy 59 and they are very close together. it was 5pm very daylight out and this thing was so bright in the sky... http:\\\\maps.yahoo.com\\index.php#mvt=m&lat=31.298946&lon=-94.718135&zoom=16&q1=lufkin%2c%20tx%2075901 this is a map of lufkin so you can see exactly were we were.as we came down tulane dr we see to our left (northeast)a large white bright object very low maby 3 times as hi as the trees traveling northeast at about 25-35 mph..i couldn't say for sure on the speed tho. it had to be as long as 2 football feilds long. we pulled over in to the center lane and so did 3 other cars but then they left. it had to be visabul from the hwy and our very small airport is less than 2miles from there. the \"ufo\" was comming from the direction of our airport.we watched it for about 3min and then when it started to drift befind the tree line we drove up to white house drive and turned left to try to catch up but it was just gone. we couldn't find it. i had grabed my cammra that i always have with me and tryed to take some pics but i must have missed it completly. i know it wasn't a blimp i have seen blimps and i use to live in norfolk va so i have seen lots of aircrafts. this was nothing i have ever seen in my life. it was so big and low and no noise what so ever. the thing i thought was so strange was there was no wings or extra stuff sticking out of it. it seemed to be very smooth on the outside. there was no logos or marks of anykind. that was my first clue taht something was wrong with this. it wasn't scary just very intresting...very stange...ans something like this should have been big news around here. so i waited till the 10 o'clock news and looked on line and nothing...when we got back to hwy 59 and went across the over pass i truly expected to see ppl stoped and out of there cars but nothing.the other cars that had stoped with us just got pulled off like wow that was cool...i haven't found anyone eles that has a clue what this was or could have been...i would love just to have some answers. i really just want to know what it is. or if someone eles has reported something like it. i didn't think alot about it and truly thought i would hear something about it soon but never did and then one day while me and my cosin were talking about it she told me that it was not something people want to talk about and we had seen something that was once in a life time. that is when i started digging and trying to find something...and i found this sight. thank you so much i know if i would have reported it sooner there would have probly been alot more you could do as far as investigating it but i have to get this out there and find some answers i hope. mabey if someone eles that pulled over that day sees this they will want to also tell their story. thank you again jenn"]}