{"Object Features":"Undisclosed","Latitude":"38.605626","Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-80.448593","Tags":"City","divs":["sighting detailsi was driving home from elliot county ky last night. on my way south on 119 in mingo county wv, near nolan, wv and near the ky counties of martin and pike on the tug fork of the big sandy river. i noticed low flying red and blue lights that seemed to move from the left to right. i thought it was a plane but it did not seem right for a plane to be flying so low that time of night. i slowed my vehicle. i thought this could be a ufo. because it just did not seem right, it was out of place. i thought to myself about ufo reports and how people who have reported being abducted had telepathic encounters. i thought, \"why don't you just reveal yourself? you are chicken [pd\\tg] to just reveal yourselves.\" then i got the impression that i was being answered. \"now your getting mad. you have a history of getting mad don't you.\" at this point the lights seemed to change direction drop and hoover in the sky and get larger as my car moved south on the highway, thus stopping the left to right movement, for all intents and purposes it felt like the lights or object was watching me. this made me feel slightly strange. eventually my car passed under the lights. i thought every thing was over but i noticed in my peripheral vision something up high between two of the mountains. i looked to the left and up above the ridgetop was a circle of silver lights. this made the hairs on my arms stand on edge because first of all the lights were different and i felt a definate presence. i became very anxious at this point, in fact i am feeling the same anxiety while i am writing this narrative. i lost sight of the object because at this point i was beginning to be slightly scared and just looked forward and drove home. i felt like i was being watched on my way home. i felt like i should look at the sky before went into my home. this is my second such encounter. around 9 years ago in elliot county ky. i had a ufo follow me home from morehead, ky. what was significant about that encounter was the lights were the same color and the object not only trailed along the ridge as i drove but as i crested the hills on the road it would be waiting for me."],"Object Flight Path":"Hovering then path,Path then hovering","Date of the Event":"11/02/2008 07:13 UTC","Summary":"UFO Near Nolan WV in Mingo County and Near Pike/Martin Co. KY","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-11032008-0027","Country":"United States","City":"Nolan, WV Pike/Matin Co K","Region":"West Virginia","Weather Factors":"Unknown","Date Submitted":"11/02/2008 07:13 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.605626,+-80.448593(13512)&iwloc=A&hl=en\"> mufon case (13512) map </A>","files":["/var/www/straped/mufon/html2text/13512.html.txt","/var/www/straped/mufon/org/13512.html"],"Object Shape":"Circle, Disc, Other, Unknown","Case Number":"13512","trends":["there have been no other sightings in nolan, wv pike\\matin co k","This sighting has never been favorited."]}