{"Date Submitted":"10/19/2008 01:22 UTC","Latitude":"34.110627","Country":"United States","files":["/var/www/straped/mufon/html2text/13513.html.txt","/var/www/straped/mufon/org/13513.html"],"Summary":"Star-like sphere that sped off","Tags":"City","divs":["sighting detailsi had just received a new high-tech telescope for my october 2nd birthday. when using it, i was studying the stars around the moon and noticed that one of the stars seemed to be barely changing position, about moving 1\\8 of a centimeter to the right. i focused the lens, and noticed that after moving 1\\8 of a cm, it had suddenly became about 1\\2 bigger coming closer to me in around 2-5 seconds. as it got closer, it became green from white. it was about 60 feet in length, and 20 feet high. it was an exact oval with only tented windows. i could see 1 figure, but it was to dark to see the color\\facial features of the figure. looking through the window, i saw an advanced computer like screen above and behind the figure which consisted of triangles, slashes, circles, and squares with dots and dashes inside of theses language like shapes. it hovered over the golf course lake, and then all of a sudden, it zapped a beam like laser at me and it felt like i was entering heaven, it was the best feeling i have ever had, and then my left arm had what so ever no feeling in it, i couldn't lift it, i couldn't feel it, and i touched it and the craft sped off in light speed."],"Log Number":"US-11032008-0027","map":"<A HREF = \"http://maps.google.com/maps?q=34.110627,+-84.511605(13513)&iwloc=A&hl=en\"> mufon case (13513) map </A>","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around October 19th 2008"],"City":"Woodstock","Disposition":"Hoax","Region":"Georgia","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Date of the Event":"10/19/2008 01:22 UTC","Longitude":"-84.511605","Case Number":"13513","Weather Factors":"Unknown","Object Features":"Undisclosed"}