{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13515.html.txt","/var/www/straped/mufon/more/13515_submitter_file1__10-18-08_nottouched.jpg","/var/www/straped/mufon/more/13515_submitter_file2__10-18-08_nottouched3.jpg","/var/www/straped/mufon/more/13515_submitter_file3__10-18-nottouched.jpg","/var/www/straped/mufon/org/13515.html"],"Weather Factors":"None","Object Flight Path":"Path with directional change","Case Number":"13515","Source":"MUFON","Date Submitted":"10/18/2008 08:00 UTC","Sighting Duration":"00:20:00","Longitude":"-97.31175","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.732459,+-97.31175(13515)&iwloc=A&hl=en\"> mufon case (13515) map </A>","Log Number":"US-11032008-0029","Latitude":"32.732459","Object Shape":"Circle, Star-like","Disposition":"Unknown","City":"Fort Worth","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around October 18th 2008","This sighting has never been favorited.",""],"Tags":"City","Viewing Distance":"Unknown","Region":"Texas","Summary":"Multiple sightings","divs":["Sighting DetailsWe were driving down 30 going west from Dallas to Fort Worth. As we were driving my boyfriend which was driving told me to look in the sky to my left as I looked into the sky I noticed what appeared to be a star however it seemed to be blurry or something it looked like a five point star or if it had a glare to it. I figured since I didnt have on my glasses that it was just a blur so I disregaurded it. We continued to drive we were now in Arlington when my boyfriend kept telling me to look up in the sky that this star was changing colors and he kept saying that it kept disappering and reappering. I thought he was losing it he told me to look I thought for what I cant see that far anyway. I looked up at the sky and it was kinda strange because it would appear and disappear at first I was like no it must be clouds or something. As I looked up at the light I seen a plane pass right over it. This is where it gets strange I was like what the hell and all of a sudden there where flashes of lights and all of a sudden there were balls of lights that just popped out of nowhere tight next to this ball of lights. I was freaking out as I looked out on my side the passanger side multiple flashes of lights started appearing. My window I rolled down to get a better view. it seemed as all of these balls of light started to appear the weather changed the wind picked up and the air felt different thicker. At this point im terrified and in disbelief. I thought this cant be right I looked around at other cars to see if they were seeing what we saw there was a suv on the left side that had there window down pointing at the sky. My boyfriend wanted to pull over I told him no. It was a terrifying fifteen minutes. We finally reach Fort Worth we are now on Berry Street we reach the house of my boyfriends friend Marcel which he told here on the phone of what we had experienced which I was not to happy about. It seemed to of have stoped the lights. I stepped out of the car with my camera phone as I had tried to gain my composure to see if could snap any pictures as I messed with the phone I thought that I had spotted it again my boyfriend said no its a plane and walked in the house as I looked at the plane to the left of me I looked straight up and seen rows and rows of blue lights I wanted to hit the ground thinking it was to close. I looked away and jumped back in the car. I dont know what I saw I just knew I seen it. It wasnt the typical triangular shape. I snapped a pic of the sky and this what I got. Please review it its not the best please put my mind at ease and let me know what it may be."],"Date of the Event":"10/18/2008 08:00 UTC"}