{"Case Number":"13524","Object Shape":"Boomerang","Weather Factors":"None","Date of the Event":"11/03/2008 10:10 UTC","Summary":"300FT WIDTH, SILENT W. INTENSE BLUE-GREEN LIGHTS, LOW ALTITUDE","files":["/var/www/straped/mufon/html2text/13524.html.txt","/var/www/straped/mufon/org/13524.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","trends":["There have been 11 other sightings in Key West","There were no other sightings in Key West on or around November 3rd 2008"],"Country":"United States","Longitude":"-81.774291","Latitude":"24.565072","divs":["sighting detailswhile standing in my front yard at 10:00 p.m. on monday, 11\\3\\08, i witnessed a very large (about 300 ft) object crossing from west to east. it was boomerang shaped, with 6 very intense blue-green lights on the leading edge. it was travelling at a very low altitude, about 500 feet above the ground, at approximately 30mph. it was completely silent, and blotted out the stars as it passed over and out of my line of sight behind the neighbors homes and trees. i was so excited when i realized i must have seen a ufo, i ran inside and woke my wife, who asked if i had the telescope handy. i am an astronomy buff, and had considered bringing out the telescope, as the sky was very clear. too bad i didn't, as i would have gotten a good close-up look! this morning i called the boca chica naval air station, which is quite close to me, just across the highway (busy us1) and a few miles east. they had no knowledge of any object, but did tell me two helicopters were in the vicinity around that time. in the past they've had surveillance blimps at the base, so initially that's what i thought it was, until it moved closer. i live in a suburb just north of key west called key haven, where there are few street lights and little other light interference. there is no place at the air station for something this large to land, so i doubt it originated there. i find it difficult to believe no one else has reported this (so far), and i even called the local newspaper, \"the key west citizen\", to ask if anyone had called them about it. i have a background in surveying, so i'm able to fairly accurately judge distance, angle, and size - this thing was huge, and passed almost directly overhead. i don't drink or do drugs, i have a degree in biology, and i work as a construction estimator and occasionally do autocad drafting. i'm a \"show me\" kinda guy - n0-nonsense, logical, and pretty straight-forward. this is definitely a first for me; i've always tried to keep an open mind, never saying never, but i will never forget this experience. with or without my telescope, i will always be looking for a repeat performance. one of the guys i spoke with at the base said he'd check the radar data and call me back, but i doubt he will."],"Tags":"City","Object Features":"None","Date Submitted":"11/03/2008 10:10 UTC","Disposition":"Unknown","Log Number":"US-11042008-0008","map":"<A HREF = \"http://maps.google.com/maps?q=24.565072,+-81.774291(13524)&iwloc=A&hl=en\"> mufon case (13524) map </A>","Viewing Distance":"101-500 Feet","Region":"Florida","Source":"MUFON","City":"Key West"}