{"Date of the Event":"08/01/1958 03:00 UTC","Longitude":"-122.568493","Country":"United States","Summary":"I and four friends encountered a landed ufo at the base with a human selling(?) four young women to a grey","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13526.html.txt","/var/www/straped/mufon/org/13526.html"],"Case Number":"13526","Viewing Distance":"Unknown","divs":["Sighting DetailsThe time indicated above is approximate. I collected my sister pamela and some of the kids we played with from the family across the street Larry, Dennis and one of the girls either evelyn or joyce Heifner and I took them to the grey base just over the hill from where I lived at 615 Plum St Novato calif. to see the base that was there. At the time i was greatly impressed by the base and was strongly attracted to it. we went to the ratty old grey house that served as one of the entrances to the base and we saw the following sight. a landed smaller UFO was sitting on the ground behind the old house. It was the same type that I and Larry, Dennis Heifner and Steven Laycock explored when we found it empty on the same hill side in another event. At the foot of the ladder of the UFO that was behind the old house were three young human women in bubble hair dos that were kind of huddled together and acting subdued. One of the twin young men that I have mentioned in other postings at the MUFON site was talking to a grey a little ways away from the women. the young man was about 20 years old white dark hair and had an over all Italian look to him and was dressed in dark clothes. the grey was a classic grey. As we watched things from the edge of the surrounding brush in the back of the house I became very concerned for the safety of the women that the young man was selling them in effect to the grey. The man had a big smug grin on his face and was a vicious predator in appearance. Very dangerous. The grey saw us and paniced and said \"Look down\" so I looked down at the ground. The grey was furious that we were there seeing what was going on. My sister who was younger said \"Dont you hurt my brother\" She was young but she would have fought for me. the grey said \"Go away and stop bothering us\" and that is about where my current memory of the event stops. I have selected this event out of many because of the multiple witnesses and the presence of a Landed UFO, other adult abductees, the human like man working with the greys and the presence of the grey. The ufo is as I have described in Postings at MUFON. Round with a dome in the center. tripod landing gear hinged at the edge of the thing, stairs coming down from the center a ring of vents on the out side edge. Tail on the top part.It was the color of the dry grass on the hill at the time. The event establishes the presense of greys and UFOs at the house and the fact that human like beings were working with the greys probably as agents in our society at that early date. It also establishes that abduction were being carried out by the human like beings. at the time I was very concerned for the lives of the young women above. it was the feeling I got at the time that they. were really in danger. i had no doubt in my mind at the time that i was looking at a landed UFO, a space alien (grey) and a human that was an agent for the greys who was very dangerous."],"Weather Factors":"Unknown","Log Number":"US-11042008-0010","Object Flight Path":"Undisclosed","Latitude":"38.11111","Object Features":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=38.11111,+-122.568493(13526)&iwloc=A&hl=en\"> mufon case (13526) map </A>","Date Submitted":"08/01/1958 03:00 UTC","Object Shape":"Circle","Region":"California","Sighting Duration":"01:00:00","City":"Novato","trends":["There have been 18 other sightings in Novato","There were no other sightings in Novato on or around August 1st 1958"]}