{"Object Shape":"Circle, Oval, Sphere","Weather Factors":"None","Sighting Duration":"00:15:00","Longitude":"-111.086871","Log Number":"US-11042008-0006","divs":["Sighting DetailsAll of the sightings occurred at my house in Surprise AZ looking SSW. I noticed them because I always look up to see what if anything is visible. I have witnessed orange spheres on various occasions in various formations. They appear as if a light switch is turned on and disappear as if the switch is turned off. Sometimes they come on all at once and sometimes one at a time. As you can see from the photo they are quite bright. The UFOs seem to flicker which may be the effects of the atmosphere. The only time I see them move is when they reappear in a different position. I have no clue how high they are. One of the first sightings was in the early spring of 2006 at approximately nine pm wherein I saw three spaced similar to the two in the photo. When I shined a green laser at them they disappeared and instantly reappeared with five and formed into a huge \"W\" in the same area of the sky. The fact that they disappeared and reappeared may be coincidence, if they are located approximately one-hundred miles from my location. If they are that far away they would have to be huge. On another occasion I saw six in a very odd lopsided rectangle. I was unable to get photos of that event. Every sighting occurred at approximately ten pm on Tuesday. I never heard any sound. On a number of occasions I have seen and heard six to twelve F-16's from Luke air force base heading in the direction of the lights. I never felt threatened or danger. Just a strong curiousity of where and what they are. The photo was taken using a Canon Rebel 35mm using a 75mm to 300mm lens, on a tripod, time exposure of 4 seconds.The photo is not changed in any way and yes I do have the negatives."],"Source":"MUFON","Date of the Event":"06/15/2008 10:15 UTC","files":["/var/www/straped/mufon/html2text/13522.html.txt","/var/www/straped/mufon/more/13522_submitter_file1__023_20.JPG","/var/www/straped/mufon/more/13522_submitter_file2__025_22.JPG","/var/www/straped/mufon/more/13522_submitter_file3__026_23.JPG","/var/www/straped/mufon/org/13522.html"],"Disposition":"Unknown","Case Number":"13522","Summary":"Have seen orange spheres on numerous occasions.","Latitude":"34.050058","Object Flight Path":"Stationary","Date Submitted":"06/15/2008 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.050058,+-111.086871(13522)&iwloc=A&hl=en\"> mufon case (13522) map </A>","trends":[""],"City":"Undisclosed","Region":"Arizona","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Object Features":"Unknown"}