{"Date of the Event":"08/15/1993 03:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.518715,+-74.412095(13532)&iwloc=A&hl=en\"> mufon case (13532) map </A>","Disposition":"Unknown","trends":["There have been 6 other sightings in Edison","There were no other sightings in Edison on or around August 15th 1993"],"Log Number":"US-11042008-0016","Viewing Distance":"Over One Mile","Weather Factors":"None","Latitude":"40.518715","Longitude":"-74.412095","divs":["Sighting DetailsI worked as a night watchman for a private contractor (Rail Services) at the now defunct Ford Motor assembly plant in Edison, NJ, from 1991 to 1995. I was responsible for night-time security of an outdoor staging lot filled with new vehicles waiting to be loaded onto specialized railroad cars each morning. Part of my job was to walk through the lot and place inspection slips on the dashboard of each vehicle. One night while I was carrying out this procedure, my attention was suddenly drawn to a brightly illuminated section of cloud cover overhead. My first thought was that it was just a spotlight being tested for a store opening or some other such event. I panned the horizon, looking for a beam of light eminating from the ground, but no such beam was visible. As I continued to observe the lighted area of clouds, I felt strongly that the light source was shining through the cloud cover from above. Here's where the story gets really interesting. While looking directly at the illuminated section of clouds, the color of the light changed instantly from white to red. It remained red for approximately 10 seconds, then instantly changed back to a white color. After approximately 10 more seconds, the light went out as if someone threw a swith to turn it off. The area of lighted clouds was stationary throughout the duration of the event - no movement whatsoever. I am still convinced that the light source was eminating from above the cloud cover and shining through the clouds form above, not reflecting off the underside like a spot light. I am a graphic designer and I have an advanced knowledge of lighting effects - reflection, refraction, ambience, etc... No light beams were visible. There was no noise at all - just dead silence. I worked as a night watchman at various locations for almost 15 years and I have witnessed meteors, lunar eclipses, planes, helicopters... you name it. This was something different that I cannot explain."],"Summary":"Strange multi-colored illumination of a section of clouds","files":["/var/www/straped/mufon/html2text/13532.html.txt","/var/www/straped/mufon/org/13532.html"],"Case Number":"13532","Object Features":"Unknown","Tags":"City","City":"Edison","Country":"United States","Object Shape":"Other, Unknown","Sighting Duration":"00:00:30","Object Flight Path":"Stationary","Region":"New Jersey","Date Submitted":"08/15/1993 03:00 UTC"}