{"Country":"United States","Object Features":"Other, Unknown","Log Number":"US-11042008-0015","Source":"MUFON","Case Number":"13531","Date Submitted":"11/13/2007 10:00 UTC","Sighting Duration":"Undisclosed","Latitude":"30.160363","divs":["Sighting DetailsItwas bigger than the C4 transport planes frequent to this area. At first it appeared as a bright whit boomerang shape coming from the north. It then grew in size to the shape of a chev, the font center of it grew brighter approaching slowly due south. It emmited a low hum. Answer to #1 It was about 10 oclock at night, I was with a friend on a dock on lake powel florida fin#2nishing up a day of fishing. #2 at first I thought it was a flock of white birds in a v shaped formation But as it got closer it started to change. It got bigger as it grew closer, and took on the shape of a chevron. As it passed over the lake it was a v type triangle shape,bright white at its tip ,fading down the sides. When it passed over us it appeared to be a arrowhead shaped object that was translucent, evan transparent in the center. It distorted the starfield that was above it.It slowly moved off to the south eimitting a low humming sound and disappeared from sight after several minutes. I turned to my friend and asked \"Did you just see that?\" My friend aswered \"Did you just see that too?\" We had been speechless for over 5 minutes durring the sighting. We don't know what we saw, but we both aggreed that it was visible approaching, then was semi transparent as it passed over{in a triangle, arrowhead shape} and faded in light as it flew south and dissapeared."],"Tags":"City","Summary":"It approched from the north, boomerang shaped bright white light, it grw in size","map":"<A HREF = \"http://maps.google.com/maps?q=30.160363,+-85.657806(13531)&iwloc=A&hl=en\"> mufon case (13531) map </A>","City":"Panama City","files":["/var/www/straped/mufon/html2text/13531.html.txt","/var/www/straped/mufon/org/13531.html"],"Disposition":"Hoax","Weather Factors":"None","Date of the Event":"11/13/2007 10:00 UTC","Object Shape":"Boomerang, Chevron, Diamond, Triangle","trends":["There have been 19 other sightings in Panama City","There were no other sightings in Panama City on or around November 13th 2007"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-85.657806","Object Flight Path":"Straight-line path","Region":"Florida"}