{"Longitude":"-93.192851","Object Features":"Undisclosed","trends":["There has been one other sighting in New Brighton","There were no other sightings in New Brighton on or around October 29th 2008"],"Latitude":"45.068621","Date of the Event":"10/29/2008 06:40 UTC","Source":"MUFON","Case Number":"13539","Viewing Distance":"Unknown","City":"New Brighton","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/13539.html.txt","/var/www/straped/mufon/org/13539.html"],"Object Flight Path":"Undisclosed","Summary":"Driving home from work at dusk and noticed an odd craft that didn't look like any of the myriad of jets that are in the heavy fly zone over the Twin Cities. Tried to keep eye contact as long as possible during traffic heading home.","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.068621,+-93.192851(13539)&iwloc=A&hl=en\"> mufon case (13539) map </A>","Region":"Minnesota","divs":["Sighting DetailsHeading home from work on Wednesday evening, October 29 around 6:30pm. This was before daylight savings time kicked in, so there was still the dusky watercolor of twilight in the sky. I check out what's in the heavens as I drive to and from work; catch a meteor or watch aircraft every now and then. My drive time is approximately 1 hour and 10 minutes each way - St. Cloud, MN to the Twin Cities and vice versa. I had just passed the Silver Lake Road exit on Hwy 694 and was heading West (and North) towards St. Cloud. There's a lot of air traffic through the 694 corridor, as I am not far from the international airport, and something odd caught my eye as it was flying parallel to my car and I could see it from underneath. I can't say at what altitude it was flying or the exact size, but I can say that the majority of other air traffic was either taking off or coming in for landing were approximately at same height. I was able to keep my eye on the object until I got close to the East River Road split, where it banked off to my left and I lost it behind the skyline. The traffic behind me was probably not happy with me; but there was no place for me to stop - and I didn't want to cause an accident. The shape of the object was triangular, it wasn't so much the shape that caught my eye but the fact that if it was a jet or plane or helicopter, it's lights would have been flashing; also there were no red or green lights on this object that I could see from underneath. Each corner of the triangle had a harsh, bright white light, and the center of the object seemed to have a muted light of white and blue. I could easily see the silhouette of the triangular shape against the twilight of the sky. There was no reflection. No exhaust. I've seen other reports where they would say that the triangular craft is monstrous - this was nothing on a grand scale. I talked to my friend first, as I didn't want to report it as I thought it was some type of military craft. Then my thought was, why wouldn't they hide in plain sight - all this air traffic - they would just blend in. I wasn't scared, I wasn't excited, I just wanted to keep my eye on it and try and figure out what \"it\" was."],"Disposition":"Unknown","Log Number":"US-11042008-0023","Date Submitted":"10/29/2008 06:40 UTC","Tags":"City"}