{"Date of the Event":"11/01/2008 06:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.379787,+-98.820305(13549)&iwloc=A&hl=en\"> mufon case (13549) map </A>","trends":["There have been 2 other sightings in Rio Grande City","There were no other sightings in Rio Grande City on or around November 1st 2008"],"Object Features":"Undisclosed","City":"Rio Grande City","Longitude":"-98.820305","Tags":"City","Log Number":"US-11052008-0010","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/13549.html.txt","/var/www/straped/mufon/org/13549.html"],"Summary":"Multi Color Morphing UFO.","Source":"MUFON","Case Number":"13549","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Flash","Disposition":"Hoax","divs":["Sighting DetailsNovember 1st is opening day for deer season in my county in Texas. I live in Rio Grande City buy I hunt on a family ranch about 30 miles north near a small town called San Isidro. My friends and I been planning to spend the night there since we have a ranch house on the property. This year was unusual in that opening day of deer season fell the day after Halloween so that night we were pretty much occupied going to get togethers and what not.at We ended up leaving the city at around 1 in the morning and arrived at the ranch house at around 1:30 A.M. I was with 5 other indvidual riding in the same vehicle which is my 2000 ford excursion. We arrived at camp decided that it was better to stay awake than to risk not waking up in the morning. All of us stayed up and made a fire under a tin porch and we barbecued fajtas,sirloin, and burgers. We stayed up cooking and playing poker until we decided it was time to start going so we loaded up on the truck and left the house at approximately 530. Once arriving at the first gate which is hitched with a chain my freind go down to open the gate and i drove through and stopped to wait for him go get back on. It was during this pause that i observed a large ball of color changing light which appeared to be static in the sky and appeared to be to the right of the ranch house and facing more or lees south east of our position. I observed the light morphing into different colors without any pause between transitions the lights were literally morphing into different colors and hues or green blue, red, violets within fractions of a second it seemed almost like a kaleidoscope sparkling in the sky. I got down from my truck and grabbed a pair of Bushnell 10x32 binoculars and observed the light continuing to morph with light seeming to glow left to right and many horizontal angles. I did not believe what I was seeing so i asked my other friends to see if they were seeing the same thing they all said they were witnessing the lights change color and we identified the colors we were seeing aloud simultaneously. After about 5 minutes i witnessed the light seem to move positions and move towards the left hovering just right of the ranch house the Light seemed to be about the size of large red antenna bulb but there are no antennas in that direction and the light seemed to be only 2-4 miles from wher we were aty hovering at the end of a filed and past a path of the woods. I considered the what the light could be but it was too close. large and colorful to be a satellite or planet or even star. Considerations towards oter aircraft maybe be considered but the lights i saw continuously changed and morphed lights and seeme to hover for extended periods of time and slowlya nd progressively hove. The lights were so bright i could not distinguish solid distinct shape but it seemed round and some what cross shaped in nature. After viewing this 20 minutes we decied we had enought and that it was getting late to go into the deer stand so we took off and i observed it from afar through the mirror as we road down the road."],"Date Submitted":"11/01/2008 06:10 UTC","Latitude":"26.379787","Region":"Texas","Sighting Duration":"Undisclosed"}