{"Source":"MUFON","Latitude":"40.699229","Viewing Distance":"20 Feet or Less","Date of the Event":"11/04/2008 06:20 UTC","Weather Factors":"Unknown","Log Number":"US-11052008-0006","trends":["There have been 7 other sightings in Peoria","There were no other sightings in Peoria on or around November 4th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.699229,+-89.584196(13545)&iwloc=A&hl=en\"> mufon case (13545) map </A>","divs":["Sighting DetailsI was driving to Spoon River College for an evening class. I immediately spotted a bright orange \"ball\" of light to the left of my car and ahead of me. The half-moon and Venus were very visable. This object was brighter than anything else in the sky. It was directly on a east to west direction and was very fast moving. I tried to catch up to it and could not. It had a weird very bright orangish glow, had no flashing lights, no associated sound. I got to the school parking lot and asked a girl from class to look at the object. She just shrugged and said it didn't look like any conventional aircraft she had seen and said, \"Huh...maybe it's a ufo.\" We watched it for about a minute before having to leave to get to class. It changed or maybe faded is a better term from bright orange to a very bright amber. I was slightly shaking and it definitely distracted me from my psych test. I looked and did not see the object about an hour latter leaving the school."],"Sighting Duration":"Undisclosed","City":"Peoria","Summary":"I was west on Hickory street, when I saw a bright orange ball of light. I speed to try and catch it and could not. It was flashing light orange to a bright amber color.","Object Features":"Unknown","Case Number":"13545","Tags":"City","files":["/var/www/straped/mufon/html2text/13545.html.txt","/var/www/straped/mufon/org/13545.html"],"Country":"United States","Region":"Illinois","Date Submitted":"11/04/2008 06:20 UTC","Longitude":"-89.584196","Object Shape":"Sphere","Disposition":"Unknown","Object Flight Path":"Straight-line path"}