{"Object Features":"Unknown","Summary":"High altitude round white light/object with no contrail moving 3 times faster than airplanes with contrails in the area.","Disposition":"Unknown","trends":["There have been 5 other sightings in West Des Moines","There were no other sightings in West Des Moines on or around October 28th 2008"],"Date of the Event":"10/28/2008 01:40 UTC","Latitude":"41.580842","Date Submitted":"10/28/2008 01:40 UTC","divs":["Sighting DetailsAs my grandmother and I were driving through traffic, I was noting how many airplanes were traversing the sky at that time (I counted 6 airplanes complete with trails at the time). Scanning the horizon while stopped at a traffic light, I noted 2 more airplanes with trails in the distance. I then glanced up high in the sky out the driver's side window and happened to see a shining light, very small but up much higher than the airplanes. It was zipping along at a much faster rate than the airplanes were flying. It had no trail. I shouted to my grand mother \"Do you see that! Look! Look!\" Unfortunately my grandmother wasn't able to see the light from the passednger seat as it was above her line of vision due to the roof of the van. Not only that, but she is legally blind in one eye and has somewhat limited vision in the other. I realized that the light was so small she probably would not be able to see it anyway. I did not bother to try to photograph the light as it was very small and I doubted that its image would have been recorded on my camera (which I now carry with me, just in case - but not enough zoom power to capture the light, I guessed). Moreover, it was moving at such a high rate of speed that I also doubted that I would be fast enough to capture it in a photograph if I pulled over, as it was moving in the opposite direction. The light turned green and I had to move on, and thus quickly lost sight of it. When we arrived at our destination, I scanned the sky for the light but as I expected, it was no longer visible. Just to be sure in my own mind, I have a few questions. Are satellites ever visible as small reflective-type lights during the day? Do satellites appear to move faster than planes? This thing was so high up I suppose it could have been a satellite, as it was moving at a uniform rate and was moving in a straight line. The light did not appear to be a meteor as it was not descending, nor did it have a tail, nor was the color of the light red (it was plain white, like a reflection or just a white light) but do meteors ever appear as white lights in the sky?"],"City":"West Des Moines","Region":"Iowa","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13547.html.txt","/var/www/straped/mufon/org/13547.html"],"Log Number":"US-11052008-0008","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.580842,+-93.704832(13547)&iwloc=A&hl=en\"> mufon case (13547) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"13547","Longitude":"-93.704832","Object Shape":"Circle","Source":"MUFON","Sighting Duration":"00:00:25","Viewing Distance":"Unknown"}