{"files":["/var/www/straped/mufon/html2text/13544.html.txt","/var/www/straped/mufon/org/13544.html"],"Case Number":"13544","Viewing Distance":"Over One Mile","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Longitude":"-80.222579","Region":"Florida","Log Number":"US-11052008-0005","divs":["Sighting DetailsOn November 1st,2008; in my backyard in Miami,FL; at approximately 2pm, possibly a little later; my fiance, Lauren Sylvester, and I were enjoying the good weather and playing with our dogs. As we were resting on the ground I noticed a distinct five point american flag type star beyond the furthest clouds I could see. It appeared to be, at arm's distance, approximately the size of the top half of my thumb. As the lower level clouds passed, it appeared to be separate from all other clouds, but yet seeming to be made of clouds. However it's shape appeared geometrically perfect and distinct. The interrior seemed solid much like the moon appears in the daytime sky. The shape was perfect like the plastic \"glow in the dark\" stars you can buy for children's bedroom ceilings. My first thought was that it could be a holographic image like the ones at Disney World's Haunted House. My next thought was, 'how could that be? since it's daytime and so far away?' My next reaction was (silently)...what the hell is that? I immediately turned to Lauren who was right next to me reclining, and asked her \"do you see that?\". She said...\"Yes!!\" My next question was...\"What do you see?\" She said, \"a star!! a perfectly shaped star!!\" HER impression was that it was a way too perfectly star-shaped cloud. There was several exclamations of \"Oh my God!!!\" Then it's edges seemed to begin to disintegrate starting with it's upper, right side. And moving to the other edges of this image and then disappating altogether. It was not moving in conjunction with any of the other cloud formations. I have hesitated to tell anyone about this, and Lauren has only told her 15 year old daughter. The reason for my hesitation is to avoid ridicule. Also, it was directly above us, and I would like to know if anyone in the area of southeast florida had noticed anything like this on that day."],"map":"<A HREF = \"http://maps.google.com/maps?q=25.797969,+-80.222579(13544)&iwloc=A&hl=en\"> mufon case (13544) map </A>","Object Shape":"Star-like, Other","Country":"United States","Object Flight Path":"Stationary","Date Submitted":"11/01/2008 02:20 UTC","Source":"MUFON","trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around November 1st 2008"],"City":"Miami","Latitude":"25.797969","Object Features":"None","Date of the Event":"11/01/2008 02:20 UTC","Sighting Duration":"Undisclosed","Summary":"Playing with dogs in backyard, paused to relax on ground, staring up, noticed PERFECTLY formed five point star in clouds. Verified visual with fiance, Lauren Sylvester."}