{"Object Flight Path":"Undisclosed","Region":"Arkansas","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"08/01/1976 08:00 UTC","files":["/var/www/straped/mufon/html2text/13543.html.txt","/var/www/straped/mufon/org/13543.html"],"Date Submitted":"08/01/1976 08:00 UTC","Source":"MUFON","Disposition":"Insufficient Data","divs":["Sighting DetailsYears ago, I'm 49 and was 17 or 18 at that time, my date and I were going to a party. It was on a back road in Arkansas. Between Conway and my small town was a nuclear missile base though I don't know if that has anything to do with this, but as a side note. We were on this back road, less than 10 miles from this base, but it was desserted. In the distance we both saw two red lights, spaced apart slightly more than car headlights and above the ground ten feet, maybe a few more. In a second or two, it flew over the top of our car, following the path of this crooked road an a rapid speed. I would estimate a hundred miles per hour or more. I was numb and sat there and my date kept driving. After a minute or two, I looked over at him and asked, \"What was that?\" He was graduating college soon and had his career to think about so he said, \"I don't know, but I'm not telling anyone.\" I nodded. I still remember it clearly as to this day, I don't know of anything that can go this fast at this height. Since it was dark and flew over us so quickly, I didn't get the shape. There were no street lights on this seldom used road."],"Weather Factors":"Unknown","Summary":"My date and I were driving on a little used road when a craft flew over the car.","Longitude":"-92.437721","trends":["There have been 12 other sightings in Conway","There were no other sightings in Conway on or around August 1st 1976"],"Log Number":"US-11052008-0004","Tags":"City","City":"Conway","Sighting Duration":"Undisclosed","Latitude":"35.094136","Object Features":"Undisclosed","Object Shape":"Unknown","Case Number":"13543","map":"<A HREF = \"http://maps.google.com/maps?q=35.094136,+-92.437721(13543)&iwloc=A&hl=en\"> mufon case (13543) map </A>"}