{"Sighting Duration":"Undisclosed","Summary":"It was exactly like Bentwaters England. a close up with a slow U.F.O.","Disposition":"Unknown","Object Shape":"Sphere","Date Submitted":"10/15/1996 05:40 UTC","Case Number":"13540","Source":"MUFON","Latitude":"35.564521","City":"Woodland","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.564521,+-89.098954(13540)&iwloc=A&hl=en\"> mufon case (13540) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/13540.html.txt","/var/www/straped/mufon/org/13540.html"],"Date of the Event":"10/15/1996 05:40 UTC","Country":"United States","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change","Log Number":"US-11052008-0001","Longitude":"-89.098954","divs":["sighting detailsit was october of 1996. i was in the sixth grade and had been voted king of my class for harvest festival. me and a guy who really is the meaning of hillbilly. {terrible witness!!}. were outside of my house as it had just turned dark. we had went to my mothers mustang to eat some cupcakes i could'nt sell at school.{trying to raise money for my school.} when i noticed a red ball of light in the distance, i immediately thought it was a cellular tower, because they had just started setting those up out here. but my thoughts quickly changed when the light started to come in our direction. i told my ex-friend. \"hey man look at this [pd\\tg].\" he got out of the car and then we both witnessed a small red ball of light that was not pulsing or anything just glowing. it was less than a football field away from us and very low to the ground. {just above the powerlines.} it come toward us and then stopped and sat there for about 30 seconds. then it took a left and slowly disappeared behind the trees. and i am very serious when i say i felt like i was being watched!! i was pretty sick to my stomach. we went inside my house quickly, and told my mother, and i've loved aliens and u.f.o.'s ever since."],"Tags":"City","trends":["There have been no other sightings in Woodland","This sighting has never been favorited."],"Region":"Tennessee"}