{"City":"Santa Barbara","Weather Factors":"Unknown","Case Number":"13556","Disposition":"Unknown","Date Submitted":"11/04/2008 06:25 UTC","Source":"MUFON","Date of the Event":"11/04/2008 06:25 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Fireball, Sphere","divs":["Sighting DetailsAs I was walking my dog I looked up casually to see what I thought was just a plane. It kind of was glowing orange like planes sometimes appear to. But as it was flying at a pretty fast rate it all of a sudden came to a stop. Now at this time I had stopped myself to make sure it wasn't just a trick on my eyes. At no point did I see any other lights on the object. The entire time it was a pretty bright glowing orange and looked kind of like a plane coming toward you on the horizon a couple miles away except it wasn't moving toward me it was moving, if anything, away from me but appeared to be moving left to right above the city. But it was very hard to tell exactly where it was over. But as I was saying the object was moving quickly and came to a stop. From the point of when I noticed the object to when it stopped was probably around 15 - 20 seconds. And it didn't just slowly come to a stop, it just stopped. At a stand still, the object's glow began to intensify. It light up very very bright and then all of a sudden disappeared. This was probably around 3 - 5 sec before it disappeared. And then later on my way home I saw another. This one however looked nothing like that bright orange pretty big sized object. This one flew past me very fast, hundreds if not thousands of miles an hour. It looked only a couple hundred feet in the air. It was tiny though. It looked kind of like a star in the sense that it was a tiny orb of whitish colored light but it of course wasn't a star and I know it wasn't a meteor because I got a clear view of this object and it was so low and I could see it so clear. It shot past my head down the street in matter of seconds. I have had previous experiences with orbs like this but they have moved much slower. And they have appeared over my house moving very slowly. I'm talking what appeared to be only 50 - 70 mph. Sometimes two orbs. One following the other. These have no other lights and they don't blink or flicker at all. No sound either to any of these objects. Even my parents have had a UFO what looked like a star thousands of feet in the air come down to just hundreds of feet above them. The object went from a dot in the sky to a craft maybe 100ft in diameter; To where they got so scared they ran in the house and only a couple of minutes later they went back outside and the object was gone. Another strange thing that happened to me was I by accident a couple months ago sliced off a piece of my fingernail on my right thumb by a cheese grader. I didn't cut the rest of it off because it hurt so damn bad so I just put a band-aid on it and went about my business. I changed my band-aid every morning. I just wanted to fingernail to grow out and I would cut it as it grew. But one morning I woke up and my fingernail was perfect. It was perfectly brand new! I had no explanation for this and it really freaked me out. Over the summer I also think that I just had bad sleep insomnia but every night I would wake up at 3am. I would then either go get a drink or just put my head back down. Before I knew it, it was 7am and I was wide awake. Now before summer I would ALWAYS sleep in until the afternoon. There was no way you could get me out of bed before 10am. Ever since then I have waken up at 7am. I have witnessed more and more UFO's. I don't know if anything is going on. Personally I think I had a sleeping problem or something because to this day I wake up at 7am every morning no matter what time I go to bed; however on those nights I would wake up at 3am, I would go back to sleep, and what felt like a second I was awake and it was 7am."],"Longitude":"-119.69278","files":["/var/www/straped/mufon/html2text/13556.html.txt","/var/www/straped/mufon/org/13556.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.42467,+-119.69278(13556)&iwloc=A&hl=en\"> mufon case (13556) map </A>","Sighting Duration":"00:00:30","Tags":"City","Latitude":"34.42467","Summary":"Orange orb that moved left to right from my view stopped began to glow and dissapeared","Country":"United States","trends":["There have been 20 other sightings in Santa Barbara","There were no other sightings in Santa Barbara on or around November 4th 2008"],"Region":"California","Log Number":"US-11062008-0003","Viewing Distance":"Unknown"}