{"Weather Factors":"None","Date Submitted":"01/08/2008 11:10 UTC","divs":["Sighting DetailsI've debated for almost a year too even report this. But I have continued to see this or similar objects up too 4 times since my first. I was a none believer before this event!! I always thought I wouldn't believe until something came down and shook my hand. But I can no longer deny what I've been seeing for the past year. I drive at night all the time as I'm a night person. So I know what stars look like, I know how a plane looks and flashes and how fast they move but this isn't like anything I'm used too seeing. It was in middle of January, a Tuesday, and I was driving from Allen,TX too my friends apartment in Denton. I was going down HW 380 and this is a road I drive all the time at day and night so I'm extremely familiar with the area. It was around 11:00 pm-11:10pm there weren't many other cars on the road but me which was slightly odd but it happens from time too time. As I passed the intersection for HW 377 I saw a very large, very bright, triangular object in the sky in the north bound direction. It appeared too be falling FAST and I mean really fast. Now as you pass 377 there is a large hill and I lost track of it for a split second when I was at the bottom of the hill. Because it was falling so fast I first thought \"Oh my God!! A plane is crashing what should I do!\" But as I reached the top of the hill I can see that it is now hovering. Right after the hill there is a bridge to get over the edge of a Lake. The object went from several hundred feet in the air too an abrupt hovering about 80-90ft above the lake about 50-60ft off of the edge of the bridge. I could have thrown a rock or baseball and hit it was so close. The object was triangular and gun metal colored, not shinny, like coal almost like it could have had some texture too it. It had 3 bright lights, one at each corner and a bright red light in the middle it was about the size of a 747 but maybe a little bigger area wise as it was solid. A plane has clear wings and a tale this didn't, it was just a large triangle. Clearly when something that large is falling that fast and then STOPS in mid-air, just stops and starts to hover it can shake you and it scared the hell out of me. But I slammed on my brakes too stop and see what the it was and I stopped in the middle of the bridge. No one was coming behind me or infront of me at the time so I seemed to be the only one there. I watched it hovering for another thirty second and I decided to get out and I tried not too take my eyes off of it. I got out and got too the rail of the bridge. This is I noticed it wasn't making any noise. It was completely silent then about 10 seconds later it tilted up slightly in my direction it wasn't standing straight up more like a 30-45 degree angle then vanished right infront of me! I was staring right at it and it just disapeared like the greatest magic trick I've ever seen! Something that big doesn't just become invisible. I can't explain what I felt. But I sat there stunned still for another minute or two looking searching the sky, the ground, the lake anywhere I could but it was gone entirely. Shortly two cars passed, one in each direction. Both slowed down too about 30mph from 60mph as they passed me and came over the bridge it seemed like they were looking for it. They both looked out over the lake and pointed at me as they passed but they didn't stop. I think they had seen it too but I obviously don't know for sure or who they are etc... I had another siting with a friend about two months later. It was at the end of March and I had only told him because he's my best friend and he was the only one I could trust to not think I'm insane or something. But we were driving down the same road headed back from Denton towards Allen this time. And as we passed the Dallas North Tollway on 380 we both witnessed the same object. It was only about 10 miles from the other siting. But it certainly was the same shape, same three lights, same red light, and about the same size but it was farther away this time but we were able too see it for a greater amount of time. We were driving for about 4-5 miles able too see this thing in the air. We thouhgt plane or helicopter but then we noticed that for about 2 minutes it didn't move at all. Then we thought light on a pole so something doesn't hit it but we drive that road all the time and we know there usually isn't and hasn't been since that night. Plus it was so high more like a plane but a low flying plane. So we ruled out all we could think of. With-in the last mile we watched it entently until we passed it. It was still about half a mile from 380. We were not alone on that road there is no way we were the only ones able to see it but again I'm not sure if anyone else on the road did. No one had stopped and before we could stop to watch, it vanished just like the last one did. We were looking at it and was about to stop so I looked forward and he said Foley it's gone. This time I did lose track of it for a second and he said the same thing but it was 100% gone when we looked back. And neither of us said anything too anyone about it. Until now obviously. He said he \"Doesn't know what he had seen and leave it at that.\" I asked him if I reported this if he would also but he wont. But he was there with me!! And he does know this event happened. I'm not sure what's happening too me really, but in August I had seen it again on the back road too my house on Country Club Rd. It was about 4:00AM and it flew right over me stopped over a housing development and the crossed back over the road and over the top of me two more times before taking off into the atmosphere. Same thing triangular, three lights, red lihgt in the middle and it wasn't a plane, a plane doesn't just stop and then start going the other direction and then into space. And I really have this strange unsettled feeling like I'm being followed or watched. I know it sounds crazy and stupid but there was one night that I lost track of about 3 hours of my night and it was right after there was this extremely bright light outiside my room. I was playing poker online at about 1:00AM and all of a sudden there was a light that filled up my room I thought it was a car with it's light on my window but I'm on the second story and when I looked outside there wasn't any car and the light went away about 5 seconds after I started looking out the window but it could have only come from above me because I couldn't see anything on the ground in position to hit my room with a light. So it had too come from above. But the next thing I remember after that is that I woke up and it was like 4:30AM, and again about 3 hours were gone. I know what a skeptic would just say that I fell asleep playing poker but I never had before or since. And I'm always up playing cards so this was a very normal night other than what happened too me. I can't explain what has been happening to me but in know I'm sane I know I'm smart and I know I'm really scared! I didn't know what else too do other than report to MUFON. I've watch all I can on TV and I've heard similar reports and similar experiences but I feel powerless to do anything about what I'm seeing and I can't stand that feeling. I honestly don't even know what this will do but I can't stand doing nothing but be afraid anymore."],"trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around January 8th 2008"],"Case Number":"13558","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Latitude":"33.222741","files":["/var/www/straped/mufon/html2text/13558.html.txt","/var/www/straped/mufon/org/13558.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.222741,+-97.126028(13558)&iwloc=A&hl=en\"> mufon case (13558) map </A>","Source":"MUFON","Region":"Texas","Date of the Event":"01/08/2008 11:10 UTC","Sighting Duration":"00:03:00","City":"Denton","Tags":"City","Disposition":"Unknown","Log Number":"US-11062008-0005","Object Shape":"Triangle","Summary":"I've scene 3 UFO's in the past year!!! One I could hit it with a rock!!!","Object Features":"Unknown","Longitude":"-97.126028"}