{"Object Flight Path":"Straight-line path","divs":["Sighting DetailsSo I am driving home from taking my wife some lunch at her work, Yeah I know, I'm a nice guy, I see this black helicopter with no marking flying around the area. I really don't think to much of it as I keep driving like normal. I then come to an intersection and I am sitting at the red light, I happen to look up to my left and I see this silver object in the sky. It wasn't a saucer. The best way I could describe it would be a very short cigar shape. I would estimate it was about a half mile from me, and about 1000 feet high. Now I am pretty into UFO's, but believe me when I say i am not a cook who thinks every object in the sky is something from another planet. Here are a couple reasons why I do not think it was a plane. There was no contrail. There was no noise. Keep in mind this is broad daylight and it was a beautiful clear day here today. I then try to get my camera on my phone set up to take a pic, I look back up and to my amazement there is another one. Right behind it and higher. Same exact color and shape. They are now traveling at the exact same speed. Then out of no where the black helicopter appears and looks like its following them. As I turn the corner and head down the road to the east one of them is gone. I am like WTF is going on here. Meanwhile the Helicopter seems to be in hot pursuit. It was hard to watch as I was driving. Now unfortunately the picture I took showed nothing. I must have taken it too low. Now I am not saying they were alien space ships, but it was pretty strange and like nothing I have ever seen. I really wish I got a picture."],"Date Submitted":"11/05/2008 03:30 UTC","Summary":"2 Identical objects traveling at the same speed.","files":["/var/www/straped/mufon/html2text/13553.html.txt","/var/www/straped/mufon/more/13553_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/13553.html"],"Object Shape":"Cigar","Sighting Duration":"00:05:00","Disposition":"Insufficient Data","Date of the Event":"11/05/2008 03:30 UTC","Source":"MUFON","Log Number":"US-11052008-0014","Case Number":"13553","Country":"United States","Tags":"City","Longitude":"-81.43508","City":"Stow","Region":"Ohio","trends":["There have been 4 other sightings in Stow","There were no other sightings in Stow on or around November 5th 2008","This sighting has never been favorited.",""],"Latitude":"41.16324","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.16324,+-81.43508(13553)&iwloc=A&hl=en\"> mufon case (13553) map </A>","Weather Factors":"Unknown"}