{"Latitude":"33.145709","Longitude":"-96.104977","City":"Greenville","Date of the Event":"11/03/2008 08:23 UTC","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/03/2008 08:23 UTC","files":["/var/www/straped/mufon/html2text/13568.html.txt","/var/www/straped/mufon/org/13568.html"],"Disposition":"Unknown","Region":"Texas","Summary":"Small object over Greenville, Texas, grows, changes color several times, vanishes","Viewing Distance":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.145709,+-96.104977(13568)&iwloc=A&hl=en\"> mufon case (13568) map </A>","Object Shape":"Fireball, Flash, Star-like","Log Number":"US-11062008-0015","trends":["There have been 7 other sightings in Greenville","There was one other sighting in Greenville on or around November 3rd 2008"],"Case Number":"13568","divs":["Sighting DetailsI was driving from Commerce, Texas, to the nearby city of Greenville, Texas. As I was driving along HYW 50, the moon was half-full, rather bright, and as I looked at the moon I noticed a really bright \"star\" a little down and to the left of the moon. It was so bright that it seemed odd to be able to see a star like that with the light of the moon also being bright. So, I drove on and every once in a while I glanced up to see if it had moved, thinking it might be a satellite or some military aircraft or something of that nature. After about 10 minutes, when I got on Interstate-30, about 6 miles Northeast of Greenville, this \"star\" was a little bigger now and it was changing from purple to blue to red to yellow and then a very bright fiery orange color. I slowed down very slow as did several other vehicles on the Interstate. As I fumbled around for my phone the object was growing larger. I also noticed a plane near the object (in the sky it looked near it but I have no way of knowing how close they really were) and it was a tiny little blinking light compared to this \"star\" object. That's when I began to feel scared and I finally got my phone unhooked from the charger in my truck and was initially thinking about taking a picture of the object but on instinct I dialed 911 emergency. I don't think it was the fact that I didn't understand what I was saying, but more the fact that with the elections and all this could have been some kind of terrorist attack of some sort. When the lady answered, \"Hunt County Emergency...\" I looked up and the entire object was gone. Totally vanished. You could see a sort of foggy, smoky looking film in the sky beside the moon where the object had been. It was strange, as if the object \"heard\" me making the call and disappeared before people could get evidence of some kind. I felt as if I was a very small, insignificant speck in a large universe at this time. I described everything to the woman and she said it sounded like a meteor or something. I have seen many meteor showers in my life but never have I seen one coming into the atmosphere for 14 minutes. Also, this object never moved. It just expanded and grew into the size of a B-B Pellet in the sky with changing colors and mainly a bright orange around the time it disappeared. I need to disclose that I have been seeing these types of phenomena here in Texas since 2005, when I first moved here. This is the first time I have ever reported something to authorities or public figures because I am going into a professional career and I wouldn't want people to think that I was strange or hallucinating or something. This has been going on for quite some time and I can only speculate as to what is really going on in our skies above Northeast Texas."],"Weather Factors":"Unknown","Object Flight Path":"Stationary","Country":"United States"}