{"trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around September 22nd 2008"],"Source":"MUFON","Country":"United States","Weather Factors":"Does Not Apply","Summary":"Large, very bright cigar/ovoid shaped object, at altitude of over 80,000 ft. and traveling very fast.","Date of the Event":"09/22/2008 09:55 UTC","City":"Breckenridge","Case Number":"13567","Latitude":"32.761777","Longitude":"-98.90035","files":["/var/www/straped/mufon/html2text/13567.html.txt","/var/www/straped/mufon/org/13567.html"],"Date Submitted":"09/22/2008 09:55 UTC","Tags":"City","Disposition":"Unknown","Log Number":"US-11062008-0014","Object Shape":"Blimp, Cigar","Viewing Distance":"Unknown","divs":["Sighting DetailsRecently, I sent MUFON a report and photo of an object that was in a picture I took (May, 2008). I also reported a sighting I had, of a UFO flying around the moon (Mar, 1981). Recently my husband had a sighting of his own, so I am reporting this for him. Sept. 22, 2008, 9:55 PM CDST: My husband Joe, was in Breckenridge, Texas, at our farm just outside of town. I'm house sitting at his Dad's farm in Eastland county, so Joe called me to see how I was doing. As we were talking, he was sitting out on the porch, looking at the stars in a clear sky. Suddenly he saw a bright light way up in the night sky, traveling from the SSW to the NNE, moving very fast. Faster than any jet and much higher up. He was very excited (for him that is unusual), telling me what he was seeing. I am located only 45 minutes SSE of him, so with him still on the phone, I ran outside to try and see it myself. Unfortunately, by the time I got outside and my eyes had adjusted to the darkness, the object had already disappeared. Joe described the object as brighter than any star in the sky, including the planets. He said the object did not \"twinkle\" but remained a constant brightness, like light reflecting off a mirrored surface, or possibly that it produced it's own steady bright white light. It appeared at that distance, to be the size of a grain of rice and approximately the same shape (ovoid or cigar). He estimated the altitude to be over 80,000 ft. and traveling in a straight line, NNE. The object had no navigation or anti-collision lights. From his perspective, the object passed to the East of Polaris (North Star) and simply disappeared. He did not believe it was a jet, or a satellite and it was traveling to fast to be a weather balloon, which we both has seen in the past. Total viewing time was approximately 90 seconds. Joe was in the military for 13 years, in Army Aviation. He has seen and been able identified all sorts of man-made aircraft. He told me that he has never seen anything like this before and I consider him a very knowledgeable and credible witness. I waited this long in reporting, to see if he remembered the event exactly as he related it to me that night. His memory of the event has not changed at all."],"Object Flight Path":"Straight-line path","Object Features":"Unknown","Region":"Texas","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=32.761777,+-98.90035(13567)&iwloc=A&hl=en\"> mufon case (13567) map </A>"}