{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.887476,+-105.071958(13566)&iwloc=A&hl=en\"> mufon case (13566) map </A>","Source":"MUFON","Country":"United States","Object Flight Path":"Other","Latitude":"39.887476","Object Shape":"Flash, Unknown","Summary":"4 lights in a row. each blinking lightly one after the other.","Date of the Event":"11/05/2008 06:45 UTC","Weather Factors":"Windy, Heavy","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Longitude":"-105.071958","Disposition":"Unknown","Date Submitted":"11/05/2008 06:45 UTC","Log Number":"US-11062008-0013","Sighting Duration":"Undisclosed","City":"Westminster","Region":"Colorado","Case Number":"13566","files":["/var/www/straped/mufon/html2text/13566.html.txt","/var/www/straped/mufon/org/13566.html"],"divs":["Sighting DetailsI was driving down 108th ave. I looked up and noticed 4 bright lights in a row. I was comming from my home that was just a few block west. I work and have lived next to a small airport for many years. My first thought was it was an airplane. As i got closer to old wadsworth rd. on 108th. I was also getting closer to the object. Thats when I knew it wasnt a plane. First off ive never seen any kind of plane with lights like that, I also noticed the lights were blinking one after the other, but very dim like. At this point i slowed down a little and rolled down my window wondering if i could hear a plane engine, thinking it could still be a plane. I didnt hear an engine but i heard a weird beeping noise that seem to be beeping as the lights on the ship where blinking. After all this i would still maybe think it was a plane, but the one thing that spooked me and made me think otherwise was the fact it was hovering. It didnt make and fast movement, and it could have even been moving slow, but it was hovering for sure, it was a very windy night and as it was hovering i could see it swaying back and forth fighting the wind. About two years ago i spotted a ufo which slowly flew over the city, that was the biggest craft weather it be a plane or ufo that I have ever seen in my life. The craft I saw last night was way smaller, like the size of a small plane, but all I could see were the four lights, I couldnt make out any other part or shape of it. Once I took a left on 108th was the last time I saw it. I drove by that same spot maybe 20mins. later and it was gone. This is the second very cose encounter with a ufo ive had, the other one was two years ago like I mentioned, although this is the only time ive reported what ive seen. Each time ive seen the ufo's they have been very close to my home"],"trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around November 5th 2008"]}