{"Object Shape":"Sphere","City":"Guadalajara","divs":["Sighting DetailsActually it was a very close fried who saw it but he said that he's got to move on and won't do anything about it,but I will.Him and his sons where milking their cows at their little ranch about 20 minutes from Guadalajara city and my friend who is about 45 years old was taking a short brake and looked up,that's when he noticed this sphere shaped object aproaching floating in his direccion about 300 yards from their property.At first he thougt that some kids where playing whith some kind of a remote control flying toy, but it was too big about 6 feet tall, and then he called one of his sons and asked him if he knew what the hell that was,and his son screamed \"a ufo\" and ran into the house. He stared feeling a little nervious but he tried not to show it and called his son to come out and asked: How do you know it is a ufo if you never saw one before? but he also knew that it was something out of this world because it wasn't making any noise and it didn't have windows or wings, it was moving slowly over the little river and over a tequila factory near by.They kept waching it for over 20 minutes floating back and forth, and then stared flaying away very slowly following the river course.He said it was very bright and it had little \"cuts\" as if was cover by lots of little mirrors like the sphere they used to put on top of the dance floors back in the 70's. He is a pretty honest guy and knows the difference between an airplane a helicopter or other human made object and he said that whatever that was it wasn't form this neighborhood.I know he is telling the truth. Thank you for taking the time to read this,and sorry for my english typing."],"Disposition":"Unresolved","Longitude":"-103.341313","trends":["There have been 8 other sightings in Guadalajara","There were no other sightings in Guadalajara on or around January 31st 2008"],"Source":"MUFON","Date Submitted":"01/31/2008 12:00 UTC","Summary":"it looked like the disco little mirror sphere they used to put on top of the dance floor","Viewing Distance":"Unknown","Case Number":"13564","Object Features":"Undisclosed","Latitude":"20.67759","map":"<A HREF = \"http://maps.google.com/maps?q=20.67759,+-103.341313(13564)&iwloc=A&hl=en\"> mufon case (13564) map </A>","files":["/var/www/straped/mufon/html2text/13564.html.txt","/var/www/straped/mufon/org/13564.html"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Country":"Mexico","Date of the Event":"01/31/2008 12:00 UTC","Region":"Jalisco","Weather Factors":"None","Log Number":"MX-11062008-0011","Tags":"City"}