{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.100028,+-113.568956(13578)&iwloc=A&hl=en\"> mufon case (13578) map </A>","Case Number":"13578","Summary":"Nine very bright lights in perfect curved formation","Log Number":"US-11072008-0003","Object Features":"Undisclosed","divs":["Sighting DetailsI was pulling up to my friends house in my car, which was facing the mountains over where mesquite, NV is. Its pitch black over where these mountains are and It is also a very dark area where my friend lives. There was nobody around cause its a very quiet neighborhood. Anyways, I pulled up in my car and went down to shut my car off and when I looked up again I saw approximately 9 very bright lights about 30 degrees above the horizon in a perfectely curved shape. These lights where very bright. I stared in absolute amazement and in absolute shock at what I was looking at. I have never seen anything like this before. After about 30 seconds they started to dim starting with the outer lights first in the formation and ending with the middle light, so it dimmed going in. I hurried and got out of my car and about 5 seconds later I saw two bright lights glowing next to where i saw the first lights. Also, this thing I saw never moved... It was completly still and so was the 2 lights I saw after the first bright 9. I went and grabbed my friend but we came out and saw nothing. I then looked at a plane flying high level in the sky and just one of the lights on this thing was easily 20 times brighter than the plane itself. Whatever it was it was massive. It was very scary because I felt as if this thing was looking right at me before it disappeared. I tried to film it but I was in absolute shock and couldnt get my camera phone out in time before it disappeared."],"Longitude":"-113.568956","Tags":"City","Date Submitted":"11/06/2008 09:15 UTC","Latitude":"37.100028","trends":["There have been 6 other sightings in St George","There were no other sightings in St George on or around November 6th 2008"],"Object Shape":"Boomerang","Disposition":"Unknown","Object Flight Path":"Stationary","Date of the Event":"11/06/2008 09:15 UTC","Country":"United States","Region":"Utah","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/13578.html.txt","/var/www/straped/mufon/org/13578.html"],"City":"St George"}