{"Disposition":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-98.528892","Object Shape":"Sphere","Object Flight Path":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-11062008-0021","Viewing Distance":"Unknown","Tags":"City","Latitude":"32.112724","files":["/var/www/straped/mufon/html2text/13574.html.txt","/var/www/straped/mufon/org/13574.html"],"Case Number":"13574","Date of the Event":"11/06/2008 06:45 UTC","divs":["Sighting DetailsI had just left my house with my daughter to go to the grocery store. As I headed East in my car I saw something out of the corner of my eye. Up in the sky in the northeastern direction I noticed this large looking glowing orange orb that just seemed to be hovering. It was not very far up in the sky because when I continued driving down the road, the trees got in my way of seeing it. I continued to stare at the UFO in disbelief when I got back into view of it (truthfully I was in shock). When I got to the intersection in which I was turning left, more trees got into my view of the orb and I lost sight of it. However, as I began to head North and there were no more trees in my way (towards downtown DeLeon), I quickly looked to see if the orb thing was still up there but instead all I saw were what it looked to be three jets with blinking lights in the exact spot where I saw the UFO. I am still in shock that I actually saw this weird glowing object. I know from experience in the past that military aircraft often use this aerospace in this general area to practice manueavers and also, set off flares. But I promise ya'll what I saw tonight was NOT a flare. Hopefully someone else saw what I did."],"Summary":"Giant Orb-Like Glowing Orange Object","trends":["There have been 13 other sightings in De Leon","There were no other sightings in De Leon on or around November 6th 2008"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.112724,+-98.528892(13574)&iwloc=A&hl=en\"> mufon case (13574) map </A>","Date Submitted":"11/06/2008 06:45 UTC","City":"De Leon","Region":"Texas","Country":"United States"}