{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.260923,+-95.990978(13577)&iwloc=A&hl=en\"> mufon case (13577) map </A>","Viewing Distance":"101-500 Feet","Case Number":"13577","Object Shape":"Unknown","trends":["There have been 4 other sightings in Omaha","There were no other sightings in Omaha on or around November 3rd 2004"],"Tags":"City","Longitude":"-95.990978","Sighting Duration":"00:03:00","City":"Omaha","files":["/var/www/straped/mufon/html2text/13577.html.txt","/var/www/straped/mufon/org/13577.html"],"Weather Factors":"None","Summary":"Stationary set of brilliant lights above and alongside interstate","Country":"United States","divs":["Sighting DetailsNovember 3, 2004, My friend and I were traveling north just out of Omaha on Interstate 29, around 8:30 p.m., when I saw what I assumed to be a large plane coming in for a landing at Eppley Airfield. Although I'm not sure of the airfield's location in relation to ours at that point in time, I know it was nearby, west of the interstate.(My friend was driving, by the way.) The aircraft's white lights were very bright; approaching from the east, off to our right, it looked like it would be awfully low when it passed overhead. I even became a little concerned, but then as we drew nearer, I was amazed to find it was stationary! As if suspended in mid-air, not much higher than the normal height of power lines, in my estimation, and so bright I couldn't see anything but the lights. Completely baffled, I watched this configuration as we drove past it and when looking back at it, it appeared to be a single row of lights, at a right angle to the highway. All of the lights were white except for a red one, slightly off-center, if I recall correctly. Though it was a clear night and visibility was good, the lights were too intense to see any structure behind them. They reminded me of stadium lighting. And I wasn't aware of any sound or vibration despite its close proximity. Unbelievably, my companion was busy talking and too preoccupied to witness this sighting, despite my attempts to get his attention. We had made this trip to and from Omaha on other occasions, during the day and at night, but had never observed anything of this nature along this route before."],"Date of the Event":"11/03/2004 08:30 UTC","Latitude":"41.260923","Source":"MUFON","Object Flight Path":"Stationary","Log Number":"US-11072008-0002","Disposition":"Unknown","Date Submitted":"11/03/2004 08:30 UTC","Region":"Iowa"}