{"Tags":"City","Latitude":"42.121136","Object Flight Path":"Undisclosed","Date of the Event":"07/31/1988 02:33 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13583.html.txt","/var/www/straped/mufon/org/13583.html"],"Source":"MUFON","Disposition":"Unresolved","Longitude":"-88.257858","Weather Factors":"Unknown","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=42.121136,+-88.257858(13583)&iwloc=A&hl=en\"> mufon case (13583) map </A>","Object Features":"Undisclosed","Date Submitted":"07/31/1988 02:33 UTC","trends":["There has been one other sighting in Carpentersville","There were no other sightings in Carpentersville on or around July 31st 1988"],"divs":["Sighting DetailsI left work at 2:28AM from restaurant in West Dundee, I drove to my boyfriends place of work(now my husband)across the river in East Dundee, so we could follow each other to my apartment behind Meadowdale shopping center.He followed me home, we drove past his mothers house in E.Dundee to make sure all was ok there at 114 King William St.,left through her neighborhood into Old Town Carpentersville past the park and both turned right on Maple heading up the hill.At bottom of hill to my right were several deer looking up the hill.I motioned to David and he waved back that he saw them also.As we came around the curves there were more deer at each bend in the road,all looking upward to top of hill.We agree that we both looked up the hill at about the same time.We saw a large,no gigantic white sphere glowing at top of hill.As we got closer I could see it was shorter than water tower because I could see signage at top of tower,we were behind shopping center, so we could see it was in between Weibolts and tower.I was terrified as I pulled into my apt. parking lot, But David pulled up behind me yelling at me to get in and go see it with him.I was more afraid of being alone than going with him so i went.... the last thing I conciously remember was driving past the movie cinema and around into the front parking lot of shopping center..the next we were sitting in the dark car in the pitch black parking lot..I can tell you that we were both very much aware that it was now 17 minutes later than when I got into his car..As time has passed I'm more scared than ever..I have fuzzy memory of\" people\" taking water from the tower..David probably remembers more clearly...I need to talk to someone about this very much, because in the past year I saw a show on history channel called An Alien History of Planet Earth and DR. J.Allen Hynek standing in the same parking lot with a man pointing at the same water tower circa early to mid 1960's.I lived in the house across the highway from here when I was a child..Could I please talk to someone about this, my husband doesn't talk about it except to say it was a chance happening on our part, and that I have nothing to fear from them."],"Summary":"Saw bright sphere between old Wiebolts store & water tower at old Meadowdale shopping center.","Case Number":"13583","Log Number":"US-11072008-0008","Country":"United States","City":"Carpentersville"}