{"Log Number":"US-11082008-0004","Weather Factors":"Unknown","City":"Wichita","Disposition":"Unknown","Object Shape":"Sphere, Triangle","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13592.html.txt","/var/www/straped/mufon/org/13592.html"],"Tags":"City","Object Flight Path":"Straight-line path,Other","Summary":"Several round bright ligths surrounding a large triangle shaped craft (about the size of an aircraft carrier","Case Number":"13592","Object Features":"Other","Region":"Kansas","Latitude":"37.698206","divs":["Sighting DetailsIn the winter of 1986 a friend and I decided to go to the Lake Afton observatory for a tour they offered every weekend. When we got there it was night and the skys were clear. The observatory wasn't open yet. We could see may stars. The night air was comfortable so we waited outside of the car for the obsevatory to open. We layed out in the open field with other customers looking at the might sky waiting to get in to the obsevatory. There were approximatly 20 people. As we were gazing up in the sky we noticed the stars moving. Everyone was shocked. The bright stars appeared to move back and forth in an extrodinary speed. We realized that they were not shooting stars because the moved down closer to us. They were fast moving lights. They appeared and dissapered very quickly. It was as if they could move in and out of the fabric of the sky. As we stood up to get a better look we were astonished by a feeling that all sound had suddenly been sucked out of the air. We could breath but there was no sound or vibrations in the air. As I looked on I saw a large object fly over my head. It was the size of an aircraft carrier. It moved incredably slow. It was as if you could reach out and touch it but that it didn't really exist. Almost like a holigram. My mind would just not let me believe it was real. Everyone was silent and in shock. I looked at all the people around us and it was as if everyone was in slow motion. The craft was triangle shape, black and moving with no sound. How could this be without sound. It was if they past by us in a diffrent time. As if we were witnessing crafts in front of us that had already been here before. Like we were seeing a shadow of the past. I wouldn't believe it happened if there weren't other people there with me. They saw the same thing. So I new it wasn't a hallutionation. The craft flew over us so low as if they didn't see us. It was as if they were passing through but in a diffrent time zone. The same way we look at the stars of the past when we look in the sky. They dissapeard into the night as fast as they arrived. It was like a brief moment of the past mixing with the fabric of the present. A flash of past light showing in the present. Seemingly they didn't see us but we could see them. I don't remember seeing any actual pilots. There were no windows. Just a large flat black craft moving slowly in the night sky. But I felt someone had to be piloting the craft. They were in there but not interacting with us. I worked for Boeing and had been around air bases all my life. I was learning to fly. I know what aircraft look and sound like at night. I know what the night sky looks like and can seperate the diffrence between lights and stars. These were crafts that could move very slow or quickly. Faster than anything I had ever seen in my life. They seem to traval on electro magnetic sound waves and use our waters electrolytes as fuel. I don't know why I would know that. My friend is an engineer and witnessed this too. We have moved on to seperate lives but after 25 years keep our bond because of what we witnessed that night. Its as if we feel a need to stay in touch because it is too overwhelming to keep this in your mind alone. We have a need to be understood and reassure ourselves it actually happened. The strangest thing that occured that night was how everyone reacted after the crafts were gone. Everyone was silent. We all wandered around for a moment or two. Very confused like we couldn't believe what we saw but we new everyone saw it. No one talked! We forgot about the tour and decided to go home. Everyone left. No one stayed. We just wanted out of there. Why didn't someone say something?! My freind and I didn't talk all the way home. It was as if we were trying to mentally block out what just happened. Put in the back of our minds but I couldn't let it go. I haven't forgot a single thing about that night after all these years and neither has my friend. We never discuss what happened when we talk . We don't have too. We just know what the other is thinking about it. I'm sure its the same for all people that see it up close like that. Your brain can't process something like this that isn't supposed to exist. I am still amazed today how something so large can move with out sound. It was as if it were travaling in a vaccum. I believe that if they crash its because they need water or electrolytes from our water to traval. If they are flying over a desert area they can't traval or move and fall to the earth. It sounds crazy and is too simple to be possible but for some reason after the incident it seems logical. I am certainly not a scientist so I don't know why I know that information. It should be researched as to how many incidents of crashes happened in areas that don't have water available. Salt water in particular. My husband has encouraged me to report this so I can move on and forget about it but I doubt I ever will and neither will my friend. I know what I saw and it wasn't frightening. It was encouraging and interesting. I hope we finally get to the point that all the collections of stories will be looked at as an exciting legitimate science and not just a mystery."],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date Submitted":"11/30/1985 12:00 UTC","Longitude":"-97.334885","map":"<A HREF = \"http://maps.google.com/maps?q=37.698206,+-97.334885(13592)&iwloc=A&hl=en\"> mufon case (13592) map </A>","Date of the Event":"11/30/1985 12:00 UTC","trends":["There have been 39 other sightings in Wichita","There were no other sightings in Wichita on or around November 30th 1985"]}