{"Log Number":"GB-11082008-0003","Longitude":"-86.80103","Source":"MUFON","Summary":"saucer shaped, rotating, brightly lit","map":"<A HREF = \"http://maps.google.com/maps?q=33.526941,+-86.80103(13591)&iwloc=A&hl=en\"> mufon case (13591) map </A>","Object Shape":"Disc","Object Features":"Patterned Surface","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around December 1st 1982"],"Date Submitted":"12/01/1982 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/13591.html.txt","/var/www/straped/mufon/org/13591.html"],"Viewing Distance":"Over One Mile","Region":"Alabama","Case Number":"13591","Latitude":"33.526941","Date of the Event":"12/01/1982 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsFirstly, I am not entirly sure when this incident took place, I know that it was in the winter months of late 1982 - early 1983. I was meeting my cousin in Birmingham City Centre at 6pm, on the way I walked through Union Passage in Birmingham Cityy centre at approximately 5.30pm. I was walking past my place of work (Ladbroke Hotel B2 4RX). I happened to look up into the sky and saw a huge saucer shaped craft oscelating in the sky, it was brightly lit, it appeared to be 2 miles high although I cannot be sure. I was mesmorised by what I saw, I just stood there and looked at it for a while trying to take in what I was seeing. People were walkinmg down the passage with bags of shopping, it was a cold winter's evening, I tried to tell people to look up into the sky but the words would not come out of my mouth, I cant remember if I actually made any noise but everyone was ignoring me. This was getting me frustrated. I starred at the object as it slowly moved away from me. I walked up Union Passage and stood outside Rackhams Store in Corporation Street. I watched the object slowly move to my left, again, I was trying to tell people to look at it but it was as though I did'nt exist. Approximately 5 minutes later the object began to move to my left then shot into the distance. I went into my place of work to tell the receptionist (Linda Bullock) what I had seen, she just laughed at me. For some reason I kept this sighting to myself until I marriedin 1992. I told my wife about the incident. She sent some Emails to UFO investigators. We had a visit one Sunday to opur home in Asby-de-la-Zouch. I was looking forward to telling the investigator about my experience but for some reason was unable to meet with them, I felt compelled to stay in the berdroom. This was an amazing experience. I have never felt the same since this day. When people contemplate about life on other planets I feel at an advantage becuase I know that it is true. I am a level headed 45 year old man, I have my own graphic design and sweet shop business. I would be intrigued to know if any sightings similar to mine were reported in the Birmingham are around this time. Yours Faithfully Steve Welsh"],"Disposition":"Unresolved","City":"Birmingham"}