{"City":"Vivian","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","Sighting Duration":"Undisclosed","Latitude":"32.871528","Source":"MUFON","Date of the Event":"Unknown","Date Submitted":"11/08/2008 06:58 UTC","Log Number":"US-11082008-0012","Tags":"City","Longitude":"-93.987403","Weather Factors":"Unknown","Summary":"often at night behind house cannot capture on video seen 5 types: red white and green pulsating light,reddish white revolving disc shape orangesh white flickering orb, red orb, white orb","files":["/var/www/straped/mufon/html2text/13601.html.txt","/var/www/straped/mufon/org/13601.html"],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Vivian","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.871528,+-93.987403(13601)&iwloc=A&hl=en\"> mufon case (13601) map </A>","divs":["Sighting DetailsJust about every other night, still ongoing, in and around same area behind house object will appear over treeline slowly hovering back fourth stationary descending and acsending and irradically move, have witnessed the lights appear to horizontally stretchout and almost slingshot into space all of my family has seen and a few friends. I have already got a taste of ridicule don't care for that!I would say this ongoing event has been taking place for the last 2 to 3 years. I have no idea why they are attracted to this area, but they have, I feel, definitely observed us watching them and apparantly have disabled our cameras. I have gotten really good looks at the reddish white disk with my binoculars to where the red and white looks like a glow around the disc shape, that appears to be dark grey with portholes. In a diffrent area one time I was chased in my car by a white orb in the sky that looked like a star then moved and followed me after a hard left onto another road it appeared to move exactly as i did appearing to be a part of the background but then it moved where I coudn't see it thought it was gone then looked past the outline of my windshield around the lip of roof and saw it again I was really scared, my cars lights seemed to dim a little and at that time I was taking no chances so I started pushing in and out on my clutch to prevent my engine from possibly stalling, it didn't and after that it seemed to have dissapeared but when i looked in sideview mirror it shot straight up out of the woods again, I made a right back towards town and didn't see it anymore. I was travelling to Shreveport one night when I noticed what looked like beacon lights around a huge spot that blocked out the stars as i drove south underneath i 220 overpass in shreveport i saw what seemed to be an opening with light outlining the opening on the bottom as I drove underneath in aww with my sunroof open I noticed the people around me in their cars did not see this at all next day i called air traffic control in s'port and asked if their was a blimp flying in area and thay readily said it was But as big as it was and as low as it was I find that a little hard to believe because Ive never seen a blimp in or anywhere around our area, I think if you came down here you would see firsthand what i'm talking about and perhaps capture them on film!"],"Case Number":"13601","Region":"Louisiana","Object Features":"Window(s), Other","Object Shape":"Blimp, Disc, Fireball, Sphere, Star-like","Disposition":"Insufficient Data","Country":"United States"}