{"Tags":"City","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around September 27th 2008"],"divs":["Sighting DetailsI was attending the Phillies Game with my wife that would ultimately clinch the national league for them. It was about 5 pm in about the 2nd inning I think. The sun was setting on the western part of the stadium and I could see a flock of birds. As they passed over the outfield I could see beyond them that there was a weird \"Blurry\" point in the sky. When I focused on the blurry point I noticed it was a distinct \"V\" formation of black dots and must be very high up in the sky to be that blurry. I couldn't believe what I was seeing so I asked my wife and the girl I was sitting next too if theys saw it too. My wife being such a Phillies fan said \"shut up and watch the game!\" Anyway the girl next to us said she could make out a weird \"V\" high in the sky that was black. If anyone else saw this at the game it would validate what I have written here tonight. It was very strange and to describe it again: During 5pm sun setting Large Black Dots in a \"V\" formation very High up moving slowly. If you had similar experience write back on \"Phillies UFO\" so I know you saw it."],"Latitude":"39.960375","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Philadelphia","Object Shape":"Boomerang","Disposition":"Hoax","Source":"MUFON","Date Submitted":"09/27/2008 05:00 UTC","files":["/var/www/straped/mufon/html2text/13603.html.txt","/var/www/straped/mufon/org/13603.html"],"Summary":"\"Phillies Game\" Black Boomerang UFO with 3 or 5 black points","Country":"United States","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Case Number":"13603","Object Flight Path":"Undisclosed","Longitude":"-75.159769","Date of the Event":"09/27/2008 05:00 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.960375,+-75.159769(13603)&iwloc=A&hl=en\"> mufon case (13603) map </A>","Log Number":"US-11082008-0014"}