{"Object Shape":"Disc","Source":"MUFON","Object Flight Path":"Undisclosed","Region":"California","Viewing Distance":"Unknown","Summary":"3 objects over LAX circular ring lights occasional red bouncing in the sky","Latitude":"33.866547","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.866547,+-118.395119(13600)&iwloc=A&hl=en\"> mufon case (13600) map </A>","Weather Factors":"Unknown","City":"Hermosa Beach","divs":["Sighting DetailsIt was halloween and I was hanging out with some friends in front of my neighbors house and me along with 7 other people noticed 3 disced shaped objects bouncing around in the sky over or next to LAX. They appeared to be disc shaped because the objects lighting made it look like a ring of light in the sky. All three objects were bouncing around but were staying with in a certain mile range in the sky. The objects would move up then freeze, then move right, freeze, then make a U shape, and freeze over, and over. The objects height in which it was flying at was above were planes were descending to land, but below a plane at cruising altitude. I used the size of the planes as a comparison for the size of the rings of light. They appeared to be the same size. They hung out in the sky from 20-30 minutes. I thought of the possibility of it being a rc kite with led lights. But one disc seemed to be almost on top of a plane for a moment. But wouldn't that be against the law because of airspace regulations for airplanes and helicopters? All I know is That I was shocked and still am. I have no clue what they were. So, for now, I'll just label them as un-identified flying objects. ALso, I couldn't get any footage because the video camera was out of battery and a regular digital photo wouldn't of picked it up."],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/13600.html.txt","/var/www/straped/mufon/org/13600.html"],"Date Submitted":"10/31/2008 09:30 UTC","Date of the Event":"10/31/2008 09:30 UTC","Longitude":"-118.395119","Log Number":"US-11082008-0011","Case Number":"13600","trends":["There have been 2 other sightings in Hermosa Beach","There were no other sightings in Hermosa Beach on or around October 31st 2008"],"Tags":"City","Disposition":"IFO"}