{"Object Shape":"Disc, Other, Unknown","divs":["Sighting DetailsI was driving home from my dads house on New Circle when I saw a really bright light up in the sky, at first I thought it was a star. Then I saw it was in fact an object of some type, though I couldn't really make it out. I passed this figuring it was just some helicopter hovering perfectly above the road. Then, maybe 5 minutes later, I was still on New Circle between exit 5A and 5B (I was getting off at 5B, onto Versailles Rd.) when I saw a low flying object slowly come down at an angle towards the ground as if to land (though the airport is not over there and I don't know of any airstrip in that direction). I at first thought it was a plane but then the object stopped in mid-air, hovering. It had at least 3 bright white lights on it, and 1 red blinking light (thus I thought it to be a commercial plane at first). The shape of it seemed to be pretty thin, shaped kind of like a saucer. It looked to me like it had a flat top and the edges came out at slight diaganols pointing towards the ground. I was not able to get a very good look for long because I was driving and was literally just about at my exit, though I did brake to slow down and get a longer look. I have no clue if it made noise or not, I happened to be listening to my radio very loudly at the sighting. I believe that some others on the road saw it and thought it was something strange as well, as I noticed cars braking abnormally near the object. I'd like to note that I do watch UFO shows all the time. When I first saw the light hovering in the air, I immediately thought of UFOs. I thought I was being pretty silly, which is why I dismissed it. When I next saw the craft @ approximately 7:55 pm I really believed it to be a commercial jet. I was thinking about how easy it would be to mistake that as a UFO...But then the object stopped. I thought \"Is this really happening?\" because it seemed to be far too much of a coincidence. I lost sight of it because I didn't think it possible to stop on that road without wrecking into something."],"Country":"United States","Object Flight Path":"Path then hovering","Sighting Duration":"Undisclosed","Tags":"City","City":"Lexington","Case Number":"13602","Longitude":"-84.497106","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/13602.html.txt","/var/www/straped/mufon/org/13602.html"],"trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around November 8th 2008"],"Region":"Kentucky","Latitude":"38.046194","Source":"MUFON","Log Number":"US-11082008-0013","Summary":"A craft with multiple lights, 1 red blinking light, in a saucer type shape in flight and hovering near a main road.","Disposition":"IFO","Object Features":"Other","Date Submitted":"11/08/2008 07:55 UTC","Date of the Event":"11/08/2008 07:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.046194,+-84.497106(13602)&iwloc=A&hl=en\"> mufon case (13602) map </A>","Viewing Distance":"Over One Mile"}