{"Weather Factors":"None","Latitude":"40.044399","Summary":"Saw three light moving through clouds, followed by large object with oval red non blinking lights.","City":"Payson","divs":["Sighting DetailsLast night I couldn't get to sleep and I got up to open up my bedroom window and since it was so beautiful I just stood there looking at the sky. Then I saw lights going in and out of the clouds and at first thought it was a spotlight, but then were about two others came into sight at the same time. Then coming from the West I saw something strange it looked like a formation of red lights, but it was not in the same formation that any of our planes would use, as there was one at the top and three sets of red lights below each other and then one at the bottom. they were not blinking lights. I did see one white light blink just at the edge of them, but only once and they seemed to be traveling rather slow. There was no sound to be heard, which was stange because it was close enought in the sky that I would have heard any sound it might has made. I watched until I couldn't see the object anymore, but it was heading in an north eastern direction. As I think back, the first white light that I thought was a spotlight and the two that followed it had disappeared into the clouds just before I saw the object of the red lights."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"13612","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.044399,+-111.732152(13612)&iwloc=A&hl=en\"> mufon case (13612) map </A>","Country":"United States","trends":["There has been one other sighting in Payson","There were no other sightings in Payson on or around October 19th 2008"],"Object Shape":"Unknown","Longitude":"-111.732152","Object Features":"Unknown","Region":"Utah","Date of the Event":"10/19/2008 01:55 UTC","Date Submitted":"10/19/2008 01:55 UTC","files":["/var/www/straped/mufon/html2text/13612.html.txt","/var/www/straped/mufon/org/13612.html"],"Viewing Distance":"Unknown","Disposition":"Unknown","Log Number":"US-11092008-0006"}