{"Date Submitted":"11/09/2008 07:10 UTC","Country":"United States","Source":"MUFON","Object Features":"Unknown","trends":["There has been one other sighting in Hamilton","There were no other sightings in Hamilton on or around November 9th 2008"],"divs":["sighting detailsat 7:10 pm nov 9th 2008 in hamilton ks i was coming home from my parents house when i was walking to the back door i looked up at the sky and noticed what i thought was a new radio and\\or cell tower. after watching said lights i came to realize it was very slowly moving with no noise the object appeared to be three quarters to one mile away from where i was standing. it had a dominate orange light with occasional red glittery flashes but they were not in a rhythm as with a commercial aircraft. it had moved and tree branches were obstructing my view so i walked to the back yard and finally went to the road where there is an open field with one tree for a better look. as i was watching i noticed from in front left of the object there was a flash ,one flash that reflected off the sky some how. then it seemed to spread into a boomerang shape and then back to a single object. i watched for about ten minutes as it slowly vanished. after seeing the flash i remembered when i pulled in the driveway seeing a flash i though might of been lightning and then noticed there were no clouds above town but dismissed until i saw it come from this object. it was moving south in almost what appeared to be a zigzag fashion. i felt my hair on my arms stand up. and kind of disorientated. for some reason."],"Tags":"City","Longitude":"-96.154875","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/13616.html.txt","/var/www/straped/mufon/org/13616.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Boomerang, Flash","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"13616","Latitude":"37.98766","Summary":"Slow Moving Shape Changing Flash","City":"Hamilton","Date of the Event":"11/09/2008 07:10 UTC","Region":"Kansas","map":"<A HREF = \"http://maps.google.com/maps?q=37.98766,+-96.154875(13616)&iwloc=A&hl=en\"> mufon case (13616) map </A>","Log Number":"US-11092008-0010","Disposition":"Unknown","Sighting Duration":"00:10:00"}