{"Disposition":"Unknown","Summary":"a ring of very bright light with a point of equally bright light in the center.","Longitude":"-93.702052","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13618.html.txt","/var/www/straped/mufon/org/13618.html"],"divs":["sighting detailsit was 8:00pm, and i was letting my dogs out. i stood on my deck, as i always do, waiting for them to finish their business. i was looking up at the moon, which was about a 3\\4 moon and fairly bright. it was a clear, cold night. out of the corner of my eye i saw what i immediately thought was a shooting star. i shifted my sight so i was looking directly at it as it finished moving over me, and was then in front of and above me. i saw that it was definitely not a star, shooting or otherwise. it was a perfect ring, of bright light, with a point of bright light in the very center. it was moving quickly, but not as fast as a shooting star would, and i didn't see it burn out. it sort of slid, or glided across the sky, and over a tree in the yard behind mine, which is when i lost sight of it. i tried to see any flickering or lights of any kind through the leaves of the tree, but it was gone. it was totally silent, and had only bright yellowish ring of light with point in the center. no blinking red or blue lights. didn't look like a spot light or search light, or like anything else i have ever seen. i have lived at this location for eight years, and i let my dogs out frequently and always stay out with them. something very different. i felt sort of bewildered, or stumped after saw it. i looked over to my neighbors yard, as she had been out a few minutes before, to ask her if she had seen it also, but she had gone inside. i stood there for a minute, searching my mind for what it may have been before i realized i could think of nothing, (strange feeling) then i went in and told my husband and daughter what i had seen, and he came out so i could describe it to him. he suggested i check the internet to see if anyone else had seen it and reported it, so here i am."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.585022,+-93.702052(13618)&iwloc=A&hl=en\"> mufon case (13618) map </A>","Log Number":"US-11092008-0010","Date of the Event":"11/09/2008 08:00 UTC","Latitude":"41.585022","Case Number":"13618","Object Features":"Unknown","trends":["There have been 5 other sightings in West Des Moines","There were no other sightings in West Des Moines on or around November 9th 2008"],"City":"West Des Moines","Country":"United States","Sighting Duration":"00:00:05","Region":"Iowa","Weather Factors":"None","Object Flight Path":"Straight-line path,Unknown","Tags":"City","Date Submitted":"11/09/2008 08:00 UTC","Object Shape":"Disc"}