{"map":"<A HREF = \"http://maps.google.com/maps?q=32.727529,+-97.31337(13620)&iwloc=A&hl=en\"> mufon case (13620) map </A>","Object Shape":"Sphere","Case Number":"13620","Disposition":"Unknown","Weather Factors":"None","Object Features":"None","Longitude":"-97.31337","Sighting Duration":"Undisclosed","Date of the Event":"10/04/2008 11:00 UTC","Summary":"I filmed 2 UFO's, one of which descended out of range at the end of the footage. The 2nd UFO executed a very uncanny aerobatic maneuver. Both UFO's are of the bright-orange-pulsating-orb-variety. I have about 10 minutes of footage of the entire incident.","Latitude":"32.727529","City":"Fort Worth","trends":["There have been 128 other sightings in Fort Worth","There was one other sighting in Fort Worth on or around October 4th 2008"],"Log Number":"US-11092008-0012","Date Submitted":"10/04/2008 11:00 UTC","Tags":"City","Region":"Texas","Country":"United States","divs":["sighting detailsmr. cherry or whom it may concern, i am an artist in fort worth, texas, who is working\\filming for a company that produces a haunted house- the cutting edge haunted house in fort worth, texas. we are currently producing a documentary on the haunted house industry and have accumulated over 55 hours of raw footage for the documentary thus far. i am the cinematographer for the documentary. we are filming the documentary on canon gl1 cameras. the owner of cutting edge purchased skytracking (rotating spotlighs) lights this year for advertising the show at the haunted house. earlier in october we wired in the skytrackers and turned them on- they are quite spectacular. the night that we turned them on, for the first time i believe, i filmed 2 ufo's, one of which descended out of range at the end of the footage. the 2nd ufo executed a very uncanny aerobatic maneuver. both ufo's are of the bright-orange-pulsating-orb-variety. i have about 10 minutes of footage of the entire incident and there are many witnesses, given i was filming customers exiting the haunted house. at the time that i first noticed the objects- i was filming people exiting the haunted house out of our 'foam room' which consists of large soap bubble machines. the objects came out of the south\\southeast and were tracking northward\\northwest. this all occurred near the i-30 \\ hwy 287 interchange near downtown fort worth, texas. at first we all thought it was a blimp because there was no sound emanating from the craft\\lights whatsoever and because both objects were moving so slowly. i didn't even film it at that point- but then the object bringing up the rear starting performing eye-catching maneuvers which made it obvious that they were not attached to the same structure, among other things, and i started filming the phenomenon. both objects very much resembled the type of red\\orange tower lights which you can view on most radar and antennae towers, aside from their slow consistent energetic pulsation. in fact- if they had not been moving i would have assumed that's what they were. the rear object- after performing an incredible maneuver, appears to change direction and move away at a rapid clip to the east\\southeast until it disappears from view, at which point i focus on the front object. the best way i've thought of to describe the actions and motions of the ufo's- or at least how i described them to roland herwig of the faa when i called him to request radar information from that evening (he told me i'll probably have to file a freedom of information request and possibly pursue legal action to get radar reports, etc...), is 'rapid horizontal displacement', but that really doesn't do the maneuvers complete justice. at any rate, i am aware of your professionalism and expertise, and am contacting you because i believe we have very intriguing (and i know totally authentic) footage. i have always believed there was something to the ufo phenomenon but this is the first time for me to ever personally witness something so convincing. i really still have trouble believing i got it on film. witnessing the event was an incredible but surreal experience. i'm convinced what we filmed is either 'secret air force' classified craft or 'unknown craft'. you can hear several of the witnesses on the footage and there are interesting perspectives expressed. this has been on my mind since the night we filmed it. it's really quite something. at the end of the footage- when we have lost track of the rear object- the remaining object descends straight down in a deliberate and controlled fashion. i am hopeful there were other eyewitness reports you may have received that could match up with what we filmed. the descending object should have been easily viewed (observing east viewing from the west) from the i-30 exits of beach street, riverside exit, and it appeared to be right over the oakland or brentwood stair exit area in fort worth. we were filming all night and i had to get back to work after the objects moved out of range of view, so i'm not sure about the exact time but i'm fairly certain it was between 9:30 pm and midnight. we had the objects under observation for between 15-20 minutes. there were a core group of witnesses around me which numbered around 40- half of which were staff- half of which were customers. there were perhaps more but i know i can get in contact with at least 10-15. again the objects never made a sound and appeared to move through the sky like fish move through water. their motions were very fluid and completely silent."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/13620.html.txt","/var/www/straped/mufon/org/13620.html"],"Object Flight Path":"Path with directional change,Other","Viewing Distance":"Over One Mile"}