{"files":["/var/www/straped/mufon/html2text/13628.html.txt","/var/www/straped/mufon/org/13628.html"],"Log Number":"US-11102008-0003","map":"<A HREF = \"http://maps.google.com/maps?q=32.117194,+-98.527622(13628)&iwloc=A&hl=en\"> mufon case (13628) map </A>","Date of the Event":"11/08/2008 10:45 UTC","Object Shape":"Triangle","Tags":"City","Date Submitted":"11/08/2008 10:45 UTC","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Over One Mile","Case Number":"13628","Region":"Texas","Longitude":"-98.527622","Country":"United States","Disposition":"Unknown","Summary":"Two triangular shaped objects pulsating lights.","divs":["sighting detailsmy sister and i were visiting our parents who live in the country just outside of deleon texas. at about 10:15 she went outside to receive a phone call because her signal was weak inside. when our dad turned off the outside lights she noticed a lighted object due east just above the tree line. at first she thought it was a plane. she watched it for approx 30 min then came in to get me. we took our dad's binoculars and watched the object for at least 30 more mins, we could see the the colors with the naked eye and with the binoculars. it was triangulur in shape and was pulsing red, green, blue and white lights. it seemd to turn from time to time changing the order of the lights. it stayed in the same spot then appeared to get higher slowly and started to drift more south. then we noticed appearing to our left as we looked east another one rising over the trees. it looked just like the same one only appeared to be further away. it also turned from time to time. we then got in my sister's truck and went out to the road and sat looking at them. they appeared to get smaller and then the clouds started to move in and obscured them both. we also noticed that at some times there was a white light tail following them. the moon was 3\\4 full and until the clouds moved in from the southwest we could see the stars. between us both we watched them for at least 2 hours."],"City":"De Leon","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","trends":["There have been 13 other sightings in De Leon","There was one other sighting in De Leon on or around November 8th 2008"],"Latitude":"32.117194"}