{"divs":["Sighting DetailsI was young. I lived in Poland, city of Gdansk suburb of Dragana, seventh building top 5th floor. This is one of those things that stuck with me for life. I remember it like it was yesterday eventhough it happened years ago. I never tell people bout this just because...well just because of what it is. I woke up, somehow, in the middle of the night. I felt, heard...i dunno how to describe it but it was this very low hum. It was pulsating very slowly, and systematcally. It was coming from the out side so I ran to the window. We lived on the top floor of a 5 story apartament building. All the buildings were only 4 story so I could clearly see over them.When I got to the window I saw a light. It was moving slowly over our building and that sound just kept on going. All of the sudden it just jolted ahead. Now keep in mind that I was young so I can't really tell how far it went, but it went far very fast. I could still see the light and it stoped. It stood still for a seconds or minute at the most, then out of nowhere it moved at a 90 degree angle to the right really fast. Then it stopped again. Next it shot back to where it was originally. It stopped again. Then it moved back towards out apartment. It was following the same lines of travel. It kept coming toward me. It started to speed up but was still moving kinda slow. As it got closer the sound started to come back. The noise was never loud...its hard to describe it. It was like I felt it more then hear it, but it was there, something was there making it. It went right over the top of the building, I ran to the back to the balcony. I remember the clock it said 130 and it was pitch black out side, no stars no moon. My dad was sleeping on the couch in the living room as I ran by I tried to wake him up, but he didn't even move or respond in any way. When I got to the balcony I saw it. It was getting farher away and then it just...like disapeared but not right away. It was like I dunno a train going into a subway tunnel but A LOT faster. No trail just no tail just gone. I never felt affraid, I was more mezmorized then anything. I still remember that \"sound\" what ever it was I remember how it made me feel like I was at ease and really relaxed. Next day I told my dad about it and that I tired to wake him up but he just told me that he didn't even remember me tring to wake him up. Another thing is that I didn't know what a UFO was. I was young and we lived in Poland back when USSR still had some hold on us. I never saw ET or any UFO movies. We just got the Smurfs from the US and that was a huge deal. I really hope that you belive me because I KNOW what I saw. There is NO WAY that it was a dream. This is one thing that I can remember from my childhood so clearly. I can still remeber it like it was yesterday."],"Country":"Poland","Region":"Pomorskie","Latitude":"54.353235","Source":"MUFON","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date of the Event":"11/30/1989 01:30 UTC","Object Shape":"Circle, Oval","Object Features":"Unknown","Case Number":"13627","Summary":"This is the first and last time I saw anything like this and I remember it till this day.","Log Number":"PL-11102008-0002","Longitude":"18.656038","trends":["There has been one other sighting in Gdansk","There were no other sightings in Gdansk on or around November 30th 1989"],"map":"<A HREF = \"http://maps.google.com/maps?q=54.353235,+18.656038(13627)&iwloc=A&hl=en\"> mufon case (13627) map </A>","files":["/var/www/straped/mufon/html2text/13627.html.txt","/var/www/straped/mufon/org/13627.html"],"Weather Factors":"None","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"11/30/1989 01:30 UTC","City":"Gdansk","Disposition":"Unresolved"}