{"City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There was one other sighting in Buffalo on or around November 1st 2008"],"divs":["Sighting DetailsWalking across Buffalo State College campus by the Rockwell street across from the football practise field, I observed what I thought was a low-flying plane. The area is an approach to the airport and I frequently see planes in the area. My husband is a former pilot so I recognize take off and landing patterns. A football practise was being held at the time. The object was about half way between the conrails of some higher aircraft and the boys playing football. At first I just thought it was another aircraft but I could not see wings or a tail, which should have been observable at that altitude. What I saw was a thin line of silver with red across the middle two-thirds. No lights of any kind. Metallic. It seemed to be moving slowly and I thought of calling across to the players to see if they saw it but didn't, as I was still not sure it was not an airplane and they didn't seem to be observing anything anyway. I did not hear any noise but didn't consider that unusual as I would not expect to at that height. I watched the object for about a minute and a half and was surprised that it stayed in roughly the same area for that time. If I had held a quarter at arm's length, it would have taken approximately 8 quarters to have covered it. As I watched, it appeared to bank a bit upwards, showing more of the red \"rim\" and then simply wasn't there. As I recall, it was a sunny day but slightly overcast. I assumed, if it was an airplane, that the disapearance was an optical illusion. I did ask my husband if he knew of any airlines whose planes were silver with a red stripe down the side but he could not think of any. My feelings during this sighting were primarily those of curiosity and confusion. After the sighting, I was vaguely uneasy and kept stopping and looking back and around the sighting area to see if I could see it again, see it emerge from the clouds, see a contrail, anything so I could explain it to myself..but didn't."],"Weather Factors":"None","Disposition":"Insufficient Data","Latitude":"42.895237","Object Features":"Other","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/13633.html.txt","/var/www/straped/mufon/org/13633.html"],"Object Shape":"Bullet, Missile, Disc","Log Number":"US-11102008-0008","Longitude":"-78.874029","map":"<A HREF = \"http://maps.google.com/maps?q=42.895237,+-78.874029(13633)&iwloc=A&hl=en\"> mufon case (13633) map </A>","Date of the Event":"11/01/2008 12:00 UTC","Summary":"Observed silver object with red marking, like an airplane observed from the side, minus wings and tail.","Sighting Duration":"00:01:30","Source":"MUFON","Country":"United States","Date Submitted":"11/01/2008 12:00 UTC","Object Flight Path":"Path then hovering","Case Number":"13633","Region":"New York"}