{"divs":["Sighting DetailsMy children and I were coming home from church on a road that is in the country surrounded by farmland. All of the sudden I see a huge green and blue and red explosion of light off to my right. It was massive. My oldest daughter saw it too. I stopped the car on the road to keep looking at it. Next, a large white light zoomed across the sky faster than anything I have ever seen. Now I live by the airport and see alot of planes and this was no plane, I dont think it was a shooting star it went level with the ground all the way over to where the explosion of light happened. I drove about a mile down that road and then about a mile to the left twoard my home and when I pulled up in the driveway I saw a huge green and blue ball of light disappear over the trees behind my house. Now when I say huge in here I mean big. A plane is like a tiny spec in the sky and this was twenty or thirty times larger than that. I am not really into the alien thing, but I saw what I saw.I called the National weather service today and thv news and no other reports were called in. I know someone else had to see this. I don't think it could have been a meteor shower, I have looked at some photos online. I went back outside for a few minutes to see something else I was so amazed but I didn't see anything."],"Date of the Event":"11/09/2008 08:30 UTC","files":["/var/www/straped/mufon/html2text/13632.html.txt","/var/www/straped/mufon/org/13632.html"],"Tags":"City","Case Number":"13632","Log Number":"US-11102008-0007","Country":"United States","Summary":"Large green and blue glowing lights and large white very fast light","Longitude":"-91.828863","Object Features":"Unknown","City":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"11/09/2008 08:30 UTC","Object Shape":"Circle, Fireball, Star-like","Disposition":"Unknown","trends":[],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"35.21033","Region":"Arkansas","map":"<A HREF = \"http://maps.google.com/maps?q=35.21033,+-91.828863(13632)&iwloc=A&hl=en\"> mufon case (13632) map </A>","Source":"MUFON"}