{"files":["/var/www/straped/mufon/html2text/13637.html.txt","/var/www/straped/mufon/org/13637.html"],"Date of the Event":"11/10/2008 03:13 UTC","Longitude":"-75.922375","Country":"United States","City":"Reading","Weather Factors":"Unknown","Object Shape":"Fireball, Flash, Other, Unknown","Case Number":"13637","Summary":"Standing in a parking lot I witnessed a huge bright strange light over Reading.","Source":"MUFON","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around November 10th 2008"],"Latitude":"40.339838","map":"<A HREF = \"http://maps.google.com/maps?q=40.339838,+-75.922375(13637)&iwloc=A&hl=en\"> mufon case (13637) map </A>","divs":["Sighting DetailsAs soon as I went inside I recorded this event on a piece of paper while it was still fresh. This is exactly what I wrote down: I work third shift, and was on break having a cigarette in the parking lot of my employer in Lyon Station Pennsylvania when I saw a HUGE yello orange light which seemed to be over the Fleetwood area but farther out. As the clouds rolled past the light faded behind them and lit them as well. The clouds then seemed to stop, and the light actually then seemed to blend into them. I could see what I can only describe as a heat wave surrounding this area of the sky. The light was gone but now in the sky I could make out a HUGE mass which had the color of the clouds and the shape of the object but was not moving in any direction. It just sat and rippled in the sky. This light was twice the width of the moon, as big as I have ever seen it, and flat. It was very bright and looked like molten steel as it faded back and forth between yellow and red shades. Thats what I wrote down last night while at work. I was amazed at what I saw. I wasn't scared, but excited. I was mad that no one else was outside with me to see this thing. It was the strangest thing I have ever witnessed. It was not what I thought a UFO sighting would be, if thats what you would call it. It looked like an intelligent fireball."],"Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Sighting Duration":"00:15:00","Region":"Pennsylvania","Log Number":"US-11102008-0012","Tags":"City","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"11/10/2008 03:13 UTC"}