{"divs":["sighting detailsthis is a direct reponse to the arkansas witness post 13632. you are describing similiar events as to what my group and i experienced. my fiance and two good buddies of mine where traveling to houston motorsports park located off of beltway 8 and lockwood friday night when this event happened. we where all having a good time and talking about what our race car we had just finished would do that night at the track. then about 5 minutes down lockwood right after the rail road tracks it happened. i noticed it first then the others passengers noticed as well. we were all quoting wtf!!! a giant green\\bluish flash\\streak just appeared off to our left in somewhat of a darkend field and that is what made it so obivious. it was so fast and then it just disappeared. the funny thing this was about 200 feet away from our truck. another interesting fact about this occurance is this streak just appeared and seemed to have a path of about a 45 degree slant. i'd say it started about 70 feet off the ground and continued on it's slant travel and disappeared at about 10 feet of the ground. it was so bright that it stopped us immediately in our tracks. it was a neat experience and all of us kind of just hung around for a bit hoping to see more of the unexplained. i've always been interested in ufo's and i'm not sure if we saw one or not but nonetheless it was an exciting moment of confusion for all of us. things just dont' appear and disappear that fast in normal circumstances. this streak of light was amazingly fast."],"Longitude":"-95.36404","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 7th 2008"],"Disposition":"IFO","Region":"Texas","City":"Houston","Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"13634","map":"<A HREF = \"http://maps.google.com/maps?q=29.766903,+-95.36404(13634)&iwloc=A&hl=en\"> mufon case (13634) map </A>","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"11/07/2008 09:00 UTC","Date of the Event":"11/07/2008 09:00 UTC","files":["/var/www/straped/mufon/html2text/13634.html.txt","/var/www/straped/mufon/org/13634.html"],"Weather Factors":"Unknown","Object Shape":"Cigar, Fireball, Flash","Log Number":"US-11102008-0009","Summary":"Bright blue/green flash of light came out of no where. Response to Arkansas witness post 13632.","Country":"United States","Object Features":"Undisclosed","Latitude":"29.766903","Viewing Distance":"Unknown"}