{"trends":["There has been one other sighting in Chisholm","There were no other sightings in Chisholm on or around June 23rd 2001"],"Sighting Duration":"00:05:00","Object Features":"Dome","Latitude":"47.489097","Viewing Distance":"101-500 Feet","Longitude":"-92.883796","Log Number":"","Weather Factors":"Unknown","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/1364.html.txt","/var/www/straped/mufon/org/1364.html"],"Object Flight Path":"Straight-line path","Summary":"Two pictures of possible disk taken on digital cam","divs":["Sighting DetailsThe prime subjects of this investigation were anomalous images on twophotographs.The 15 year-old son was trying out a new digital camera. He took pictures ofsome cloud formations. Neither he nor his father saw any anomalous objects. When the pictures were downloaded into the computer, an anomalous objectappeared in two of them. The object is very small in one, but appearsdisc-shaped in the other.Because the object appears to be headed downward at a steep angle, the mother ofthe family came to believe the object had crashed into the swamp. She also hadother reasons for believing something had crashed nearby. First of all, sheheard noises for three of four nights afterwards. She described these noises ashigh-pitched squeaky sounds. She had no tape recorder, so was unable to recordthese noises. The prime investigator thinks these noises may have been birdsor frogs, which start to make a lot of noise around four a.m. that time ofyear.Also, the mother observed what she called a UFO, which was visible in theeastern sky for several nights, at about the same spot every night. It appearedabout 3:00 a.m. at about 35 degrees elevation every morning, and traveled fromnorth to south. The prime investigator has determined that this was most likelyVenus. I would concur, and consider this probably identified.A few days after the pictures were taken, the neighbors son witnessed some menpouring something into the swamp. According to the witness, they were dressedin unusual suits. One possible explanation could be that these men were from anenvironmental agency and were pouring dye into the water to measure the waterflow. There is concern about ground water contamination from nearby mines.The mother also claims that her children have seen glowing figures approximatelyfour feet tall when camping overnight in the backyard."],"Source":"MUFON","Case Number":"1364","map":"<A HREF = \"http://maps.google.com/maps?q=47.489097,+-92.883796(1364)&iwloc=A&hl=en\"> mufon case (1364) map </A>","Country":"United States","Date of the Event":"06/23/2001 07:00 UTC","Date Submitted":"06/23/2001 07:00 UTC","City":"Chisholm","Disposition":"Unresolved","Object Shape":"Disc","Tags":"City"}