{"Log Number":"US-11102008-0019","Disposition":"IFO","Longitude":"-119.414552","Date Submitted":"11/09/2008 12:00 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was out walking my dog and noticed in the western sky there was a bright orange object. I thought it may have been a jet coming towards me with its landing lights on as it was as bright. But the light did not get any closer and instead was moving right in a northerly direction and did not change color as landing lights from aircraft that I have seen are typically white. I concentrated to find the typical green and white flashing lights on their wings that planes have when flying at night and could not see any. It stayed a constant orange when moving through the sky. There were no erratic motions and stayed straight in its path. It was moving as fast as a prop plane but did not make any sounds. I originally stopped to look at the object to check out any other lights that may be seen but after a few minutes starting walking again to get back home keeping a constant eye on the object in case it was going to do something erratic. By the time I got home the object was going into the clouds, disappearing and reappearing so I knew that it was not very high in the sky. It finally disappeared into the clouds and was getting too low in the horizon plus the obstruction of houses made it difficult to watch any further. I have seen planes at night before which the only thing that you're able to see are the blinking green and white lights so what made this unusual were the absence of the blinking lights and the fact it was a constant bright orange no matter where it was the sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.782861,+-119.414552(13644)&iwloc=A&hl=en\"> mufon case (13644) map </A>","Object Shape":"Circle","Case Number":"13644","Source":"MUFON","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/13644.html.txt","/var/www/straped/mufon/org/13644.html"],"Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"36.782861","Summary":"Bright Orange Object","Date of the Event":"11/09/2008 12:00 UTC","trends":[],"Region":"California","Weather Factors":"Unknown","Object Features":"None","Tags":"City"}