{"Longitude":"-85.746644","Summary":"As I was driving my delivery truck along ole stateroad 132 I saw a light moving below the cloud deck.It circled several times and flew directly over my ttruck","Case Number":"13641","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-11102008-0016","Region":"Indiana","Object Flight Path":"Undisclosed","Date of the Event":"11/10/2008 03:45 UTC","Country":"United States","Object Shape":"Triangle","Date Submitted":"11/10/2008 03:45 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13641.html.txt","/var/www/straped/mufon/org/13641.html"],"trends":["There have been 4 other sightings in Pendleton","There were no other sightings in Pendleton on or around November 10th 2008"],"Latitude":"39.997541","Source":"MUFON","City":"Pendleton","divs":["Sighting DetailsI deliver doughnuts for Goods Doughnuts on saturday and sunday nights. My hours are from 10pm to whenever I get done,usually from 5:30am to7:00am depfnding on the load that day and the weather.I had just left Lapel and was headed southeast on old 132 when I saw what appeared to be aircraft landing lights moving under the cloud deck. It circled for a moment or two and then Isaw other lights on it so I assuned it was a small plane.This was not to be the case as I crossed the bridge over I-69 it approached the road. I stopped my truck right in the middle of the bridge,rolled down the window and stuck my head out and it flew over in front of my truck.It was ared equalateral triangle it had lights on the parimeter and halve sphere in each corner of the triangle.My first thought was \"WOW\"my second thought was get this truck off this bridge.Which I did but the chances of being rearended on a bridge on a rural road at 3:45am are extreamly rare. I finished my route without incident."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.997541,+-85.746644(13641)&iwloc=A&hl=en\"> mufon case (13641) map </A>","Tags":"City","Disposition":"Insufficient Data"}