{"Tags":"City","Source":"MUFON","City":"Casa Grande","Log Number":"US-11102008-0031","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around November 8th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was at home on a break from work when my wife looked out the kitchen window and said, \"Oh, look! There is a UFO in the sky!\" \"Ya, sure.\" I replied thinking she was joking. \"No!\" she responded, \"For real!\" She then said she thought they might be balloons again. The past several weeks we had some balloons from local functions in the community escape that could possibly fool some people at a glace. I went to the window and took one good look and new instantly these where not balloons. There were three bright white shimmering objects straight south approx 30 degrees elev. They were in the shape of a triangle with the top center one the brightest and almost appeared to be two overlapping. I would compare it to the brightest star or planet such as Venus and approx 3 times larger in the sky. The lower left was very bright but not as big. The lower right one was half as bright as the left one and a little closer to the top one. I told my wife to keep watching while I got my video camera. Canon XH-A1 Hi-Def set at 1080i 60i fps. By the time I grabbed the camera, inserted the battery and an HD DV tape and got outside to the patio to start filming, a good minute had pasted. I set the camera to full auto mode so I would not wast anymore time making manual adjustments. By profession I am a videographer and an independant filmmaker. I do alot of \"Gun and Run\" or \"Shoot and Scoot\" at weddings and events. This camera does very well in those uncontrolled environments. I asked my wife to get my tripod in hopes of getting a nice steady shot. In the mean time I steadied myself against the patio support post. The camera has a 20x optical zoom and would need to be as steady as possible on full zoom. I did have to turn on one stop on the ND filter plus there was no UV filter on the lens, FYI. As I filmed I noticed that there was a fouth object to the lower right of the other three and the three were in a wider upside down \"V\" patteren much like three aircraft in formation with the fourth man out military style, excecept if this were the case of actual airplains then they would be comming towards us, these seemed to remain in a fixed possition in the sky with no direction of travel. I noted that all high altitude jet aircraft that day were leaving very heavy vapor trails, these had none. As my wife returned with the tripod the objects started to fade in and out and the camera started to have problems staying in focus lock and I was having a hard time keeping in frame with the view finder. The objects instantly disappeared. I had a total of 46 seconds of actual video of the objects. I down loaded the video into my computer using Sony Vegas Pro-8 software. Upon evaluating the video on an HD monitor I could see that my camera took a little longer than normal to focus lock on the objects when I zoomed in. Once it did I could see they had more of a white cigar shape with a faint blury smear to the left of each. The left object was now not as bright as the right and closer to the top one while the right one was a little further away and not as bright as it was when viewed at the kitchen window. Halfway through the video I could see the fourth object got very bright at on point then faded with the others. When played in slow motion I could see a definate pulsing of the white light which seemed to totally surround whatever the object was at times. Towards the end of the video and enlarging the frames or zooming in tighter with the editing software, it appeared the bright white was fading and an actual object was taking form. On the last few frames zoomed in it almost looked like an airplane with no tail fin. A center body with left and right wings but no center fin. The camera could no longer hold focus and they where gone. At the beginning of the video I marked a reference point on one of the tree branches to the top center object. Near the end of the video I marked the same two points. The objects were in the same position and angle on the screen indicating to me they had not changed position through the whole scene clip. About an hour later a high altitude commercial jet was passing over to the north of us and the sun was reflecting off of it similar to the bright white light of the four objects except the jet was leaving a heavy vapor trail. Curious, I grabbed my camera again and did a test shot to compair. The camera instantly focus locked when zoomed. I could make out every detail of the jet liner. The body, the wings, the tail and even the nose shape. The bright glare from the body was clearly distinguishable but not interfearing with the details of the craft. The glare was not pulsing or seperating. Since this event I have not found anyone who wittnessed the same in order to get validation and a position triangulation. It is my feeling that these objects were very far away and not in the local proximity. Possibly so far that the atmosphere may have been playing tricks on light and magnification. Also the sun would not have been side reflecting off them since they were to the south and not to the north like the jet was. I have been a photographer and videographer for over 20 years and shot a lot of aircraft and things in the sky both nightime and daytime. I have always beleived that most everything can be explained and have. However, I do know that sometimes an anomaly may occure that the common person cannot identify or explain. Right now I cannot identify or explain this one. In all my years of expereance in the Navy, a NASA certified electonics inspector during the Apollo program, a law enforcement officer, envolvment in space communications programs, photography and videography this one caught me totaly by surprise and slightly unprepaired for the expereance. If you can come up with any information that would explain what this was or even what it definitly was not it would be greatly appreciated by my wife and I. Thank you."],"Summary":"Three bright white objects in triangle, due south 30 degrees elev, clear sky, fourth object appeared lower right of others all glimmering then fadded and disappeared, caught on HD video.","Case Number":"13656","Date of the Event":"11/08/2008 11:32 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.885792,+-111.747952(13656)&iwloc=A&hl=en\"> mufon case (13656) map </A>","Object Shape":"Cigar, Chevron, Egg, Oval, Star-like","Latitude":"32.885792","Region":"Arizona","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/13656.html.txt","/var/www/straped/mufon/org/13656.html"],"Object Flight Path":"Stationary","Date Submitted":"11/08/2008 11:32 UTC","Longitude":"-111.747952","Viewing Distance":"Unknown"}