{"Region":"California","files":["/var/www/straped/mufon/html2text/13652.html.txt","/var/www/straped/mufon/org/13652.html"],"Object Shape":"Star-like","Case Number":"13652","Weather Factors":"None","Tags":"City","Source":"MUFON","City":"Fresno","Summary":"two stationary bright lights with two satellite like lights passing behind","Latitude":"36.754457","Disposition":"Insufficient Data","Date Submitted":"11/10/2008 06:30 UTC","Date of the Event":"11/10/2008 06:30 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Viewing Distance":"Unknown","divs":["Sighting Details I was walking home from buying a soda when i looked up at the sky. two very bright lights caught my eye, they had to be the brightest in the sky. the lights didn't move, as i wathed them i noticed what looked like a small satellite light passing by the lights. the sat light kept moving in a straight line until i couldn't focus on it anymore. then i looked back at the two bright lights. Another sat light was passing the two lights.. at this time i started thinking something was kinda weird.. that sat light moved passed the lights almost like it was following the previous sat light. After i couldn't see the sat light anymore, the two bright lights started to dim until they vanished. I was pretty excited to see something so strange, cause about two nights before i saw something else VERY ufo like... Two days ago i think. I was walking home from work.. It was about 7:30pm and i was halfway home walking through woodward park. i decided to look up at the sky, and i saw something. to me at first it looked like a shooting star, and i can't explain it quite right but it looked like instead of falling it was going up?? or like horizonaly towards me?? i didn't have much time to think about it because as soon as the light dissapeared it reapeared and shot in a different 90 degree angle then dissapeared again.. both of these events seem extremely weird to me. If someone has an explaination i would love to hear it. -nick"],"Log Number":"US-11102008-0027","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.754457,+-119.770466(13652)&iwloc=A&hl=en\"> mufon case (13652) map </A>","Country":"United States","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around November 10th 2008","This sighting has never been favorited.",""],"Longitude":"-119.770466","Sighting Duration":"00:01:10"}