{"map":"<A HREF = \"http://maps.google.com/maps?q=29.378886,+-100.892487(13666)&iwloc=A&hl=en\"> mufon case (13666) map </A>","Region":"Texas","Source":"MUFON","City":"Del Rio","Country":"United States","Object Features":"Dome","Object Flight Path":"Path with directional change","divs":["Sighting DetailsON MARCH 31 AFTER THE YEAR 2000 (I REMEMBER THIS WAS THE SAME DAY SOME RELIGOUS GUYS IN TEXAS WERE WAITING FOR A UFO TO PICK THEM UP)I WAS TRAVELING WEST TOWARD LAKE AMISTAD. SUDDENLY I SAW A BRIGHT LIGHT THAT WAS STILL AND NO MOVEMENT, THIS WAS APPROXIMATELY 30 TO 40 MILES AWAY (FAR EYE SIGHT) AND IN MATTER OF SECONDS LETS SAY 3 SECONDS IT TRAVELED HALF THE DISTANCE TOWARD ME. STILL OVAL AND SHINY STANDING STILL FOR 10 TO 20 SECONDS. AFTER SOME LIGHT RAYS GLOWED FROM THE BOTTOM OF THE OBJECT IN A 45 DEGREE ANGLE AROUND THE OBJECT. THE RAYS WERE ABOUT6 TO 8 JUST ON ONE SIDE. THEY EXTENDED ABOUT 30 FEET, THE LIGHT WAS A NICE SOFT WHITE, BEUTIFUL VERY EYE CATCHING. IF THE OBJECT WOULD LAND NEXT TO ME I WOULD CALCULATE ITS LENGHT TO BE ABOUT 100 TO 120 FEET WIDE BY 25 TO 30 FEET HEIGHT. THE OBJECT TOOK OFF TO THE NORTH ALMOST IN THE SAME DIRECTION IT CAME FROM AND GRADUALLY DISAPPEARD BUT TRAVELING AT A SLOWER SPEED. AFTER THIS EVENT I CONSTANTLY LOOK UP AT THE SKY WITH A HOPE TO FIND THIS OBJECT SINCE IT WAS A HARMLESS, PLEASANT, EYE CATCHING EXPERIENCE!"],"Tags":"City","Date Submitted":"03/31/2001 04:00 UTC","Log Number":"US-11112008-0010","Weather Factors":"Unknown","Longitude":"-100.892487","Case Number":"13666","files":["/var/www/straped/mufon/html2text/13666.html.txt","/var/www/straped/mufon/org/13666.html"],"Latitude":"29.378886","Summary":"OVAL, SHINY, WITH LIGHTS, AND RAYS(LIKE SUNRAYS) UNDER OBJECT IN A 45 DEGREE ANGLE","Sighting Duration":"00:01:20","Disposition":"Unknown","Viewing Distance":"Unknown","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around March 31st 2001"],"Object Shape":"Oval","Date of the Event":"03/31/2001 04:00 UTC"}