{"Longitude":"-81.432826","Tags":"City","Sighting Duration":"00:05:00","trends":["There have been 4 other sightings in Solon","There was one other sighting in Solon on or around November 11th 2008"],"Region":"Ohio","Disposition":"Unknown","City":"Solon","Country":"United States","Case Number":"13667","Object Shape":"Unknown","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13667.html.txt","/var/www/straped/mufon/org/13667.html"],"Object Features":"Unknown","Latitude":"41.390866","Date Submitted":"11/11/2008 05:55 UTC","Viewing Distance":"Unknown","Log Number":"US-11112008-0011","Summary":"Saw two separate sets of four horizontal lights, each set moved side to side quickly then moved west.","Object Flight Path":"Path with directional change","Date of the Event":"11/11/2008 05:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.390866,+-81.432826(13667)&iwloc=A&hl=en\"> mufon case (13667) map </A>","divs":["Sighting DetailsI was traveling north on route 91 in Solon, Ohio approaching Parkside Elementary School and Solon High School when I saw flashing lights in the sky. There were four lights which flashed left to right that were slightly to my left looking out of the windshield. Within a few seconds the set of lights suddenly zoomed quickly to the right in the sky and then continued on a quick pace to the left (West). I reached the stoplight at Portz Parkway (on right) and Inwood Drive (on left) and suddenly noticed a second set of lights exactly like the first set. I could still see the other set of lights in my peripheral as I watched the second set of lights suddenly zoom to the right and then continue moving left (West)just as the other set did. I watched the first one for almost a minute and the second one for about thirty seconds until traffic began to move. The weather was overcast with a slight fog and it was beginning to become dark. The lights were very bright and seemed to be like halogen lights (slight blue tint). It's difficult to say how high in the sky or how far away they were as I was driving at the time, though they did not look to be too high in the sky. I did not see any shape that would bring the lights together, but as I stated it was overcast and slightly hazy above the surface."]}