{"Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.094803,+-98.339988(13663)&iwloc=A&hl=en\"> mufon case (13663) map </A>","Log Number":"US-11112008-0007","Sighting Duration":"Undisclosed","Latitude":"32.094803","Case Number":"13663","trends":["There have been 40 other sightings in Dublin","There were 3 other sightings in Dublin on or around October 23rd 2008"],"Date Submitted":"10/23/2008 08:30 UTC","Weather Factors":"None","Object Shape":"Circle","Date of the Event":"10/23/2008 08:30 UTC","divs":["Sighting DetailsI interviewed Ms. Ashleigh Cole on Thursday, October 30, 2008 at the hotel where I was staying while in Stephenville. She said she had already been interviewed by Whitney-White Ashley, reporter from the Empire Tribune, the local newspaper in Stephenville on Friday October 24th. It should be noted that Ms. Ashley gave me Ms. Cole's name as a witness who seemed reliable. Ms. Cole said that she an three other people were riding their horses on the the ranch that she manages on the night of October 23rd. all four people were riding about 20 feet away from a one-story barn and as they passed the West end of the barn, they saw three large orange lights hovering about 100 feet above the ground. The lights were very big and looked to be eliptical. about 150 feet away from the group. The lights were in a row that moved straight up and were on an angle. The lights stayed at an angle while they moved around the area. She said that the lights were observed for about five (5) minutes. The size of the object was 45' to about 50' long. The lights looks like they were attached to an object, but because the lights were so bright, she couldn't see the object, if there was one. The lights flashed on and off intemittently, then they just flashed off and it was gone. She further said that when the lights were moving she thought it was about 30-40 miles per hour. There were no military jets is the area at the time of the sighting, however, after the lights blinked out for the last time, jets, probably F-16's were seen in the sky several miles away, but not in the immediate area."],"Region":"Texas","Object Flight Path":"Hovering then path,Path then hovering","Viewing Distance":"101-500 Feet","Source":"MUFON","Tags":"City","City":"Dublin","Longitude":"-98.339988","files":["/var/www/straped/mufon/html2text/13663.html.txt","/var/www/straped/mufon/org/13663.html"],"Disposition":"Unknown","Summary":"Not Provided"}