{"Disposition":"Unresolved","Sighting Duration":"00:00:05","Longitude":"-74.002943","City":"New York","Case Number":"13660","Date of the Event":"11/11/2008 01:00 UTC","Weather Factors":"None","Region":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 11th 2008"],"Object Shape":"Fireball, Flash","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13660.html.txt","/var/www/straped/mufon/org/13660.html"],"Summary":"Bright Flash Of White Light Appeared Coming Down to the Ground","map":"<A HREF = \"http://maps.google.com/maps?q=40.720943,+-74.002943(13660)&iwloc=A&hl=en\"> mufon case (13660) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Log Number":"US-11112008-0004","Latitude":"40.720943","divs":["Sighting DetailsI was coming home from my friends house who I had visited. As I pulled into my drive way at home, directly in front of me in the sky I saw a bright flash of white light almost like a fireball but not exactly. It happened so quickly I couldn't exactly make out a shape. I do know that it appeared to be heading down towards the ground and did not appear to be all that far away. It is possible that this could have been a meteor however the light seemed to appear out of nowhere and disappeared as quickly as it came into my sight. I would think that if it were a meteor the light would have been more constant and I would have saw it falling from the sky. It was a very clear night and you could see every star in the sky and the moon was very bright. The light I saw was just a bright (if not brighter) than the moon. This sight gave me quite a scare because for some reason on my way home I somehow got the idea in my mind that I would see a UFO over my house. Perhaps it was because I just finished reading the book Communion and since I began reading it about a week ago have had UFOs on the brain. Regardless I had this vision in my mind that I was going to see something unusual in the sky that night and that it would be right above my house. To my surprise as I pulled into my drive way and that was when I saw the light. If anyone thinks this was just a meteor please let me know. It was very real I don't think that I imagined this."],"Source":"MUFON","Date Submitted":"11/11/2008 01:00 UTC"}