{"Case Number":"13669","map":"<A HREF = \"http://maps.google.com/maps?q=42.367781,+-71.051433(13669)&iwloc=A&hl=en\"> mufon case (13669) map </A>","Sighting Duration":"00:20:00","Summary":"Strange lights hovering over Boston.","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around November 11th 2008"],"Latitude":"42.367781","Disposition":"IFO","Longitude":"-71.051433","Source":"MUFON","divs":["Sighting DetailsI was on my lunch break from work. There is a pretty good view of the Boston skyline from our building, and I like to look at it while I'm enjoying a cigarette. Today I was sitting down looking at the city, and at first everything seemed normal, and then I realized that I was seeing two very bright lights that were not normally part of the skyline. I assumed my eyes were playing tricks on me, and decided that it was beacons on top of large buildings, however, after staring for a few more minutes I realized these light were very slowly moving, from right to left, I could gauge their movement in relation to how close or far they appeared to be from the Prudential. My mind was trying to come up with rational explanations, and since I was observing them from a good distance I wasn't sure if they were blimps or helicopters, but then I saw a couple of planes fly by the same area, and their lights were dwarfed by the ones I had been watching. I'm not sure what I saw, but it was very unusual, and I'm reporting it in the hope that maybe someone else saw the lights too."],"City":"Boston","Log Number":"US-11112008-0013","Object Flight Path":"Hovering then path","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/13669.html.txt","/var/www/straped/mufon/org/13669.html"],"Country":"United States","Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","Date Submitted":"11/11/2008 06:00 UTC","Date of the Event":"11/11/2008 06:00 UTC","Object Shape":"Blimp, Sphere, Other, Unknown","Viewing Distance":"Over One Mile"}