{"files":["/var/www/straped/mufon/html2text/13670.html.txt","/var/www/straped/mufon/more/13670_submitter_file1__bottom_and_side_view1CMS13670.jpg","/var/www/straped/mufon/more/13670_submitter_file2__Triangle1CMS13670.jpg","/var/www/straped/mufon/org/13670.html"],"Longitude":"-75.383552","City":"King of Prussia","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"13670","Date Submitted":"11/11/2008 07:30 UTC","Summary":"What appeared to be stars or planes were in a triangle shape...which initiall caught my eye. They were blinking white, red and green in a strange pattern...did not appear to be airplanes","Weather Factors":"None","Region":"Pennsylvania","divs":["Sighting DetailsI was driving south on 202 from King of Prussia to Newtown Sq around 7pm tonight. Off to the west I initially saw three star like objects. I thought they were planes and then realized that they were not moving along any flight path that I have ever seen in that area. Then I noticed about a dozen or so more in the area. Moving again off of any flight path. They were flying in every direction...slow and steady. The lights were blinking bright white, red and green and seemed to flow in a circular motion. I took back roads home through Radnor, Strafford, and then to Newtown Sq. As I was driving I was looking up in the sky and these object seemed to be consistant two and three of them together at a time. When I pulled in my driveway I could still see them...to the North West of Newtown Sq (King of Prussia PA area). There were two that seemed to be either circling or going back and forth in the NorthWest sky up until 9..which is the last time I looked. Ive never been into UFO's as a matter of fact, I wished I hadnt looked up tonight because now Im scared to death. Had to post though. I had to share this weird experience and see if others in the area may have seen the same phenomenon. The only person I shared with is my son..he saw them also. Yeah...I wont be sleeping tonight...guess I have a new hobby also!"],"Object Shape":"Oval, Star-like, Triangle","Object Features":"Unknown","trends":["There have been 5 other sightings in King of Prussia","There were no other sightings in King of Prussia on or around November 11th 2008","This sighting has never been favorited.",""],"Date of the Event":"11/11/2008 07:30 UTC","Log Number":"US-11112008-0014","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Latitude":"40.101286","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.101286,+-75.383552(13670)&iwloc=A&hl=en\"> mufon case (13670) map </A>","Country":"United States"}