{"divs":["Sighting DetailsIt was just after 10 pm in Pirenopolis, Brazil. My husband and I were sitting on the balcony of our hotel room. I was looking in the direction of the forest. I saw a bright white circular light with a yellow outline, rising upwards. This light stopped suddenly, remained stationary for about 10 seconds and accelerated downwards. At first I thought it could be ball lightening, until it returned. In about 20 minutes, this light reappeared and seemed closer, or bigger. This time it jumped to the left and right a few times which would leave a tail like yellow trail. It stayed for about 10-15 seconds and again accelerated downwards. In about 20-30 minutes it reappeared again and stood still before accelerating downwards. In about one hour this light reappeared for the fourth and last time, this time a lot closer. This time it rose slowly and stayed still for a few seconds then just disappeared. My feelings during this event would have to be described as excited and calm and a desire to get closer. My husband has always been a unbeliever in UFOs, but not anymore, he also felt very happy to have had this experience. At no time did we experience any fear. The following morning I did my own research to make sure there are no military bases, etc. in that area. There is nothing except forest, mountains, rivers and waterfalls. It is a totally deserted area. I spoke with a few of the locals and they confirmed that there are not even any roads in that part of the forest. The locals also informed me that UFO sightings are becoming very common in Central-East Brazil."],"Object Shape":"Circle","Log Number":"BR-11122008-0003","Tags":"City","Date of the Event":"11/10/2008 10:00 UTC","Disposition":"Unresolved","Source":"MUFON","Latitude":"-15.853804","Case Number":"13674","files":["/var/www/straped/mufon/html2text/13674.html.txt","/var/www/straped/mufon/org/13674.html"],"Summary":"Bright white and yellow circular light over forest, returns four times.","Sighting Duration":"Undisclosed","Longitude":"-48.958554","Region":"GoiÃƒÂ¡s","Country":"Brazil","Weather Factors":"Lightning, Rain, Light","Object Flight Path":"Stationary,Path then hovering,Other","Date Submitted":"11/10/2008 10:00 UTC","Viewing Distance":"Over One Mile","City":"PirenÃƒÂ³polis","map":"<A HREF = \"http://maps.google.com/maps?q=-15.853804,+-48.958554(13674)&iwloc=A&hl=en\"> mufon case (13674) map </A>","Object Features":"Unknown","trends":["There have been no other sightings in Pirenópolis","This sighting has never been favorited."]}