{"trends":["There have been 13 other sightings in Williamsport","There were no other sightings in Williamsport on or around November 12th 2008"],"City":"Williamsport","Date Submitted":"11/12/2008 06:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I had just left the lycoming mall in Williamsport Pa. and were traveling on south 220 when my wife said what the h is that?! Only about 100 ft or so above the Susquehanna river was a very large diamond shaped craft with over a dozen white lights. Not airplane lights these were like the flood lights at a ball park. it was moving slowly south for a minute then it simply banked to the left and disappeared as we passed a cropping of trees. NO noise.. it was dark metallic underneth with some kind of satelite things toward the front end.. others had to see this it was huge and there was a large number of police in the area. maybe a accident at the bridge. but we missed the exit n to 15 becouse we were so distracted by this. I have never seen anything like this in the sky. I tried to take a picture with my cellphone but none of the buttons worked! It just locked up! It was not untill about a half mile down the road that it worked again. weird stuff. we were both freaked out. and our 4 yr old daughter saw it too."],"Object Flight Path":"Undisclosed","Region":"Pennsylvania","Longitude":"-76.995489","Disposition":"Insufficient Data","Case Number":"13682","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.24409,+-76.995489(13682)&iwloc=A&hl=en\"> mufon case (13682) map </A>","Log Number":"US-11122008-0011","Object Features":"Undisclosed","Object Shape":"Diamond","Date of the Event":"11/12/2008 06:15 UTC","Source":"MUFON","Latitude":"41.24409","Summary":"Large craft with bright white lights & satelite like attachments moved over Susquehanna River for a short time and then disappeared.","Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13682.html.txt","/var/www/straped/mufon/org/13682.html"],"Viewing Distance":"Unknown"}