{"files":["/var/www/straped/mufon/html2text/13683.html.txt","/var/www/straped/mufon/org/13683.html"],"Summary":"Craft flew over me bright lights extremely quiet HUGE.","map":"<A HREF = \"http://maps.google.com/maps?q=43.682103,+-70.582794(13683)&iwloc=A&hl=en\"> mufon case (13683) map </A>","Longitude":"-70.582794","Tags":"City","Viewing Distance":"20 Feet or Less","Date of the Event":"08/20/2006 09:45 UTC","Log Number":"US-11122008-0012","Weather Factors":"Fog, Light","Object Shape":"Square, Rectagular","Source":"MUFON","Date Submitted":"08/20/2006 09:45 UTC","Disposition":"Unknown","City":"Buxton","Country":"United States","Case Number":"13683","divs":["Sighting Detailsi was driving down rt 117 in buxton maine talking on my cell phone to my girlfriend.it is a realy dark rd and its very country no airports or anything but trees and a few houses. i notice a huge thing coming from my left with 3 huge lights in the front. the bulbs lookied like they could be 6 ft or so in diamiter. this thing was only about 100 ft above the trees. i pulled over n got out of my car and tried to get a photo of it on my phone but i couldnt get the camera to turn on fast enough. this thing had no sound at all hardly. very faint.as it got directly above me the 2 out side lights turned off n the middle one stayed on. i could see the beems from the lights through the fog or mist that was in the air n it traveled about 3-4 football fields distance infront of the thing flying. it flew very very slowly and kept going over me. i hung up with my girlfriend and called my mother to see if she could see it from her house in the next town over . she said she couldnt. so i called my uncle and he said he thought he could but in a distance. after a few min it disapeared behind the tree line and i could no longer see it. i have kept this to my self other than the few people that i told that night. then i heard about you and i thought i should tell u . the way i heard about u was on tv. also on a different show on tv you were on, i saw a re creation of the exact thing i saw. or atleast similar to what you recreated with extreamly close detail . i dont get on my email much but i do get on it. i hope to hear from u and posibly figure this out. thank you very much. jason madara p.s. i forgot to mention i used to work for a major air line refuling pass jets and luggage and i know this wasnt any thing of that sort, it much much bigger. it scared me pretty good. i honestly did not have any clue what i was seeing. to this day i still think about it. and i still look to see if i will see it again and have not."],"Latitude":"43.682103","Object Flight Path":"Straight-line path","trends":["There have been 5 other sightings in Buxton","There were no other sightings in Buxton on or around August 20th 2006","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Maine"}