{"Region":"Indiana","Disposition":"Insufficient Data","Object Features":"Unknown","Object Flight Path":"Stationary,Path with directional change","divs":["Sighting DetailsI was in my mothers backyard with some family members having a Bar-B-Que on July 6, 2008. A few cousins and myself were sitting around eating while talking. I was facing the back of my mothers yard when I noticed a orangish-yellow light move out from behind the tops of a tree. It had no shape other than being a light. I wasn't sure if it were some sort of firework. So I watched it for a few seconds. The light moved along the street it was above and seemed to have turned at the intersection. There was no wind to explain its odd movement. After a few shocked seconds I told my cousins about it. They all sort of laughed about it but I told them it was still there. They turned and seen it as well. We watched the light travel down the road it turned on until it vanished from sight. We all were talking about it for a few minutes when I noticed a second light appear about the same place as I seen the first. The second light followed the same course as the first. The second light had me stumped so I walked to the back fence of the yard to try to get a better look. Again the second shape had no shape other than a light. In shape I mean no body like a plane or such. Just a bright light. It was daylight out so it was bright enough to stand out in daylight. I again watched the light travel until it vanished from sight. Due to distance I would think since I didn't see it go up or down. Several times I've thought maybe it was those parachutes with the little flares on them you shoot off around the 4 of July. Only things that keep me from believing that is there was no wind and they turned at the intersection at a right angle. I had a second (or third if you count the first as two.) sighting on October 25, 2008. My girl-friend, my daughter, nephew, and I were coming home from a birthday party (around 8 p.m.). We had just turned off Holt Road onto Morris Street heading west. We went about a block to a block and a half when I looked out the car window (passenger side window.)and noticed a bright redish-orange light about 100 to 150 feet in the air. I told my girl-friend to look at it. We passed it up so I only got to see it for a few seconds. If it moved it did so at a really slow rate of speed. It didn't seem to have moved at all from first seeing it until I lost it to the tree line. My girl-friend dropped me off at home and left to go to a family members house when she called me and told me there were now three of the lights where we seen the first. From the time we last seen the first light until she called me about the three lights was about 5 minutes."],"City":"Indianapolis","trends":["There have been 126 other sightings in Indianapolis","There were 2 other sightings in Indianapolis on or around July 6th 2008"],"Summary":"I saw two orangish-yellow lights in the sky. One was first seen then another followed a few minutes later.","Log Number":"US-11132008-0001","Country":"United States","Date of the Event":"07/06/2008 05:00 UTC","Case Number":"13685","Source":"MUFON","Latitude":"39.778276","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/13685.html.txt","/var/www/straped/mufon/org/13685.html"],"Object Shape":"Other","Longitude":"-86.149014","map":"<A HREF = \"http://maps.google.com/maps?q=39.778276,+-86.149014(13685)&iwloc=A&hl=en\"> mufon case (13685) map </A>","Weather Factors":"Unknown","Date Submitted":"07/06/2008 05:00 UTC","Tags":"City","Viewing Distance":"101-500 Feet"}