{"files":["/var/www/straped/mufon/html2text/13687.html.txt","/var/www/straped/mufon/more/13687_submitter_file1__light.JPG","/var/www/straped/mufon/more/13687_submitter_file2__forearm.jpg","/var/www/straped/mufon/more/13687_submitter_file3__rightunderarm.jpg","/var/www/straped/mufon/org/13687.html"],"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Latitude":"36.118646","map":"<A HREF = \"http://maps.google.com/maps?q=36.118646,+-115.163276(13687)&iwloc=A&hl=en\"> mufon case (13687) map </A>","Summary":"Four orbed object; I have no memory [except a photograph].","Date of the Event":"08/09/2004 12:00 UTC","Log Number":"US-11132008-0003","City":"Las Vegas","Object Features":"Undisclosed","Object Shape":"Circle","divs":["Sighting DetailsOkay... I developed a roll of 35mm film, I looked through everything paid no attention. Went home, looked through them...and started to notice things. The first photograph was at my girlfriend at the time, and after the curious photos, concrete smashing of a medium in the road. There are two photos which I have no memory of what so ever. [see 'light'] Since I have looked into the photos, things have been happening to me. A year after wards, I had extracted two metallic objects from my body. The first was with the help of a women I was with and a pair of tweezers in my tear duct. It was long, skinny, had a few barbs and crooks at the end...It has since seemed to dissipate. And the other from my left middle finger in the center joint. I have a red spot that will not go away now from the area from which I pulled it out. That piece has turned into smaller pieces. Waking up with marks, burned in scars, memories of places..Faces at night, my hair standing up on end when I walk in my house at night. Back when I had a car, back when all this happened...I worked at this coffee shop, across town. When I would exit the freeways on my way home, I had noticed one dark blue car following me at some length. I never went home, drove around, the car behind me...then the car went away. ---- That was years ago Now...Well, recently, I have been waking up with scary marks, hole like bruising. my life still is mine, though...things have changed, not sure for the better, or not. everything has just changed as a whole entity. I have written everything that I not only can remember, but what has been happening to me for the past four years. My feelings about all this range from comfortable to extreme terror. I have became unsettled, I mean the feeling I have a lot of the time. A feeling of disconnection and restlessness."],"Viewing Distance":"Unknown","Longitude":"-115.163276","Case Number":"13687","Source":"MUFON","Date Submitted":"08/09/2004 12:00 UTC","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 9th 2004","This sighting has never been favorited.",""],"Region":"Nevada"}