{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"13686","Weather Factors":"None","Disposition":"Unknown","trends":["There has been one other sighting in Nephi","There were no other sightings in Nephi on or around September 28th 2007"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"Limited sighting. 3 lights forming a triangular shape. Silent.","map":"<A HREF = \"http://maps.google.com/maps?q=39.710234,+-111.836322(13686)&iwloc=A&hl=en\"> mufon case (13686) map </A>","Country":"United States","Source":"MUFON","Region":"Utah","Longitude":"-111.836322","Date of the Event":"09/28/2007 10:15 UTC","Latitude":"39.710234","files":["/var/www/straped/mufon/html2text/13686.html.txt","/var/www/straped/mufon/org/13686.html"],"Object Features":"Undisclosed","Tags":"City","Date Submitted":"09/28/2007 10:15 UTC","Log Number":"US-11132008-0002","City":"Nephi","Object Shape":"Triangle","divs":["Sighting DetailsMy wife, three daughters and a friend were out on our driveway talking at approximately 10:15 pm. The conversation was centered around motorcycles. I noticed my wife looking up toward the North. She said: \"Do you guys see that?\" We looked up and witnessed three lights in a triangular formation approximately 500 feet off the ground moving slowly in our direction. Since all I could see were the three lights, I assumed it was a helicopter as there are regular military exercises launched from out small municipal airport. After relaying my assumption to my wife, I continued talking with my friend. At that point my wife touched my arm and said: \"What's it doing now?\" We all looked up and watched as it began to glow bright orange in the center and then drop something toward the ground. The dropped object glowed with the same intensity, but as it drew closer to the ground, it either went dark or possibly dissipated entirely. This happened 3 more times, I told my wife to go get the camera. When the object neared the point of being directly over us, it looked to me as though it just dissapeared. When I stated this, my friend corrected me and said: \"No, it's lights are just off\". At that point I could make out the dark triangular shape in the sky as it passed over our house. When we went to the other side of the house, it could no longer be seen."]}