{"City":"West Jordan","Object Shape":"Sphere","Sighting Duration":"00:00:05","Date Submitted":"11/13/2008 01:57 UTC","Latitude":"40.61298","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13688.html.txt","/var/www/straped/mufon/org/13688.html"],"Viewing Distance":"Over One Mile","Longitude":"-111.937293","Log Number":"US-11132008-0004","Tags":"City","divs":["Sighting DetailsAt 1:55 a.m. a co-worker and I went outside to smoke. As we were smoking I was facing west and he was facing me. We were talking about something when I saw a bright orange-yellow sphere break through the clouds and shoot towards the earth. I yelled out \"Holy S@#t!!\" and pointed directly at the object. When I did this my co-worker instantly spun around to see what I was pointing out. Almost instantly he yelled out \"Holy S@#t!!\" just as I had done. The object was heading almost straight towards the ground, but at a slight angle, and it was going faster than any airplane or helicopter I have ever seen. It actually appeared to be accelerating the entire way down. I looked for any flashing navigation lights but there were none. It was just a solid Orange-yellow sphere,no tail, not pulsating or anything of the sort. I am pretty sure that the object was between myself and the mountain range by Tooele, but there is a chance I'm mistaken about that fact(it may have been behind the mountains). The reason I'm almost positive it was in front of the mountains is because of how far I was able to follow the object before it dissapeared. If it were behind the mountains I would have lost sight of it a lot sooner. At the speed it was traveling there is no way any conventional aircraft would have been able to make this manuever without hitting the ground, but there was no explosion or sound at all. That is when the object left my field of view. I then asked my co-worker if he saw what I saw and he confirmed that what he saw was no conventional aircraft. He and I both used the term UFO simultaneously. After the sighting we were both too excited to say anything, we just ran to where we thought we might be able to get another look of the craft and stood there stairing for about ten more minutes. After we were fairly certain it wasn't going to make another appearance we went back inside and I instantly took notes of the time, and details of what we saw. I live in an area that is very heavy with air traffic so I know the behaviors of airplanes...and this was no airplane."],"trends":["There have been 10 other sightings in West Jordan","There were no other sightings in West Jordan on or around November 13th 2008"],"Region":"Utah","Summary":"Facing Tooele I saw something flying extremely fast towards the ground","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"13688","Date of the Event":"11/13/2008 01:57 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.61298,+-111.937293(13688)&iwloc=A&hl=en\"> mufon case (13688) map </A>","Disposition":"Insufficient Data","Source":"MUFON","Object Features":"Unknown"}