{"divs":["Sighting DetailsI am a teacher. At the very end of class, the kids were packing up their bookbags to gp home for the day. 2 boys looked out the window and said \"what is THAT\"? I thought that they were watching people outside the building or birds flying in the air. I walked over to the window and watched something that was expelling exhaust from the tail end. I then watched this object fly across the sky, get lost in front of the sun's glare and emerge more clearly to see what the boys had seen- that there was a dark grey straight line in front (it was making a shadow in front of itself), and it was expelling white exhaust from the back. It was hard to see what exactly was between the grey frontal shadow and the exhast, or if teh frontal shadow was indeed an \"object\". At the time, I made sure to look around the sky and saw 2 commercial airplanes flying normally under the \"object\". One of the boys said \"it looks like a missle\"- I had to agree. The \"missle\" was much higher in the air than the 2 planes, and was MUCH MUCH faster. It was heading South, but angled in an upwards direction. The three of us watched the sky until the \"missle\" was out of our sight. The bell rang, the kids were dismissed to the busses, and I remanined watching the white exhaust lines in the sky wondering what it was that I just witnessed. The sun was now making a circular rainbow glow in the sky that I still could see driving down the parkway on my way home. It was quite a strange sight."],"Tags":"City","City":"Red Bank","map":"<A HREF = \"http://maps.google.com/maps?q=40.350754,+-74.054386(13681)&iwloc=A&hl=en\"> mufon case (13681) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"13681","trends":["There have been 3 other sightings in Red Bank","There were no other sightings in Red Bank on or around November 12th 2008"],"Region":"New Jersey","Disposition":"Unknown","Date of the Event":"11/12/2008 02:29 UTC","Object Shape":"Bullet, Missile","Log Number":"US-11122008-0010","Date Submitted":"11/12/2008 02:29 UTC","Object Features":"Unknown","Longitude":"-74.054386","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/13681.html.txt","/var/www/straped/mufon/org/13681.html"],"Summary":"Strange sight speeding past the sun","Weather Factors":"Unknown","Latitude":"40.350754","Object Flight Path":"Straight-line path"}