{"Weather Factors":"Unknown","Object Shape":"Other","Object Flight Path":"Straight-line path","Latitude":"28.114184","Longitude":"-81.617854","Viewing Distance":"Unknown","Case Number":"13680","trends":["There have been no other sightings in Haines City","This sighting has never been favorited."],"Log Number":"US-11122008-0009","Disposition":"Insufficient Data","Object Features":"None","Date Submitted":"11/10/2008 12:00 UTC","Source":"MUFON","Date of the Event":"11/10/2008 12:00 UTC","City":"Haines City","map":"<A HREF = \"http://maps.google.com/maps?q=28.114184,+-81.617854(13680)&iwloc=A&hl=en\"> mufon case (13680) map </A>","Region":"Florida","Country":"United States","Summary":"UFO shaped like a Hersey Kiss","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI was headed east on sr544 off of 27 south just outside Haines City Florida at 6:35am on Monday 11-10-08. The sun was just breaking over the horizon when I noticed to the right of the sun an object shaped like a Hersey Kiss, it was gold in color and was about the size of my thumb nail at arms length. I pulled off to the side of the road to observe it better. The color contrasted with the yellow orange fireball of the sun which viewed was about the size of a golf ball at arms lenght. The UFO was moving slowly to the south, after viewing for a moment or two I noticed two silvery objects exit from either side of the craft and flew off quickly to the east until they disappeared. A few moments after this the UFO started to fold in on itself(collaspe upon itself), until it too disappeared. It was a clear morning with very few clouds, but what clouds there were, were at a higher altitude than the UFO or the sun. Having seen UFO's on several ocassions in my life, I've come to take then with a kind of ho-hum attitude. I mean I know they're here, have been here for eons, so it would take something spactacular to really get me excited at this stage in my life."],"files":["/var/www/straped/mufon/html2text/13680.html.txt","/var/www/straped/mufon/org/13680.html"]}