{"Object Features":"None","trends":["There have been 2 other sightings in Swainsboro","There were no other sightings in Swainsboro on or around October 30th 2008","This sighting has never been favorited.",""],"Log Number":"US-11122008-0013","files":["/var/www/straped/mufon/html2text/13684.html.txt","/var/www/straped/mufon/more/13684_submitter_file1__cowboyhat.jpg","/var/www/straped/mufon/more/13684_submitter_file2__Swainsborosighting.jpg","/var/www/straped/mufon/org/13684.html"],"Viewing Distance":"Over One Mile","City":"Swainsboro","Date of the Event":"10/30/2008 08:20 UTC","Weather Factors":"None","Summary":"It reminded me of a Pringle's potato chip from the side.","divs":["Sighting DetailsMy mother, 15 year old neice, and I were taking my children around on the Golf Cart trick or treating by the Golf Course. We were on Barbara Ave the Golf Course was to our backs. I turned around to look at the kids and I looked up and saw this large object just as it went over the tree line. I told my neice and my mom to look. My daughter saw it when we pointed it out. I am unclear of the distance or really the shape of the object because the only thing we noticed were the lights. The best way that I could describe them was they were in the shape of a Pringle's Potato Chip or the Brim of a Cowboy hat but the lights were white and flowed kinda like trickling water. We did not hear anything because it was high in the sky. We did not watch it long because we saw the back part of it as it was going over the tree tops. When the kids got back on the Golf Cart we drove down Rebecca Dr because it is more of an open area and less lighting. But we never saw it any more. I have no idea what it was but I know it was not a plane or helicopter. My grandaddy said that it could have been a Dirigible but the two shapes they have here in Georgia are of a ball shape and a rocket shape. This was not shaped like either. I really did not have a reaction to it other than curiosity. I just want to know what it was. The uploaded file is a picture I downloaded from the internet but it's the best way that I can describe the shape. The curved line above the bottom line in the picture is the exact shape. I know it sounds crazy describing it this way but thats the best example I can find."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/30/2008 08:20 UTC","Case Number":"13684","Object Flight Path":"Straight-line path","Tags":"City","Latitude":"32.597386","Country":"United States","Region":"Georgia","Longitude":"-82.333738","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.597386,+-82.333738(13684)&iwloc=A&hl=en\"> mufon case (13684) map </A>","Source":"MUFON"}