{"Log Number":"US-11132008-0010","Date Submitted":"11/11/2008 07:37 UTC","divs":["sighting detailsmy husband and i were on our driveway, i was facing west and he was facing south. i saw around 20 red\\orange lights appear over our tree line to the west, moving from west to east. we both started to run across our field towards them, and they changed formation and began to move west. i called my 19 year old son on my cell phone at 7:37 who was in the house to come outside to see these incredible lights. by the time he arrived in our field, there were approximately 10 lights, which were moving to the west, northwest. we remained outside until the last of the lights moved to the west\\northwest. my intitial reaction was that it was a fleet of aircraft of some type, there were so many and they were approaching rapidly. i honestly thought it was an invasion of some sort. i have never seen any types of lights like these in my life. we have lived near the dfw airport for 14 years, and these were unlike any lights or aircraft i have ever seen. there were at least 2 aircraft that were approaching for landing at dfw. approximately 10-15 minutes after the event, at least 2 large military helicopters flew directly over our house and fields."],"files":["/var/www/straped/mufon/html2text/13694.html.txt","/var/www/straped/mufon/org/13694.html"],"Object Shape":"Circle, Sphere","Longitude":"-97.094265","Country":"United States","Disposition":"Unknown","Object Features":"Unknown","Latitude":"33.019067","trends":["There have been 4 other sightings in Flower Mound","There were no other sightings in Flower Mound on or around November 11th 2008"],"Case Number":"13694","Region":"Texas","City":"Flower Mound","Date of the Event":"11/11/2008 07:37 UTC","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.019067,+-97.094265(13694)&iwloc=A&hl=en\"> mufon case (13694) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"Approximately 20 red/orange lights in semi circular formation."}