{"Log Number":"US-11132008-0009","Country":"United States","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/13693.html.txt","/var/www/straped/mufon/more/13693_submitter_file1__IMG_0042.JPG","/var/www/straped/mufon/more/13693_submitter_file2__IMG_0043.JPG","/var/www/straped/mufon/more/13693_submitter_file3__IMG_0146.JPG","/var/www/straped/mufon/org/13693.html"],"City":"Covington","Object Features":"Unknown","Latitude":"40.117273","Longitude":"-84.353837","Sighting Duration":"00:00:06","divs":["Sighting DetailsI usually tag along with my mom when she brings my dad to work over in Kentucky and I almost always sit behind the passenger seat with my digital camcorder taking pictures of the sky, and while my mom drove along the freeway going toward Hebron Kentucky we pass open fields that haven't been developed yet and the sky was nice and clear with no clouds and I took these two snapshots one after another, as you can see the reflection of the inside of the car and the camcorder but I did not realize what was on the photo's until I looked over them. I took many more photo's that day but these two are the only ones with objects in them. On another occasion after my mom already dropped my father off at work and we were on our way home I snapped this 3rd photo on a mildly cloudy day from directly out of the open passenger side window, the first two mentioned above were taken on July, 13th of 08 and the last one was taken on October 18th of 08. Neither of the photo's were visible my the naked eye, only after I went though my pictures."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.117273,+-84.353837(13693)&iwloc=A&hl=en\"> mufon case (13693) map </A>","Source":"MUFON","Date Submitted":"07/13/2008 06:45 UTC","trends":["There have been no other sightings in Covington","This sighting has never been favorited."],"Object Shape":"Circle, Oval, Sphere","Viewing Distance":"Unknown","Summary":"Taken from inside my moms van on a clear day going into Kentucky","Object Flight Path":"Unknown","Tags":"City","Date of the Event":"07/13/2008 06:45 UTC","Region":"Ohio","Disposition":"Insufficient Data","Case Number":"13693"}