{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.403601,+-95.013878(1369)&iwloc=A&hl=en\"> mufon case (1369) map </A>","Summary":"A glowing blue ball of light very quickly passed o","Log Number":"","Country":"United States","Weather Factors":"Lightning, Light","Object Flight Path":"Straight-line path","Date Submitted":"10/31/2001 08:35 UTC","Disposition":"Unknown","Date of the Event":"10/31/2001 08:35 UTC","Case Number":"1369","divs":["sighting detailsas i was on my break from work, i was driving around the park finishing mycigarette. as i drove up a short, but steep hill i was looking at some fairlylow-lying clouds when all of the sudden a large ball of glowing blue\\green lightpierced through the bottom of the clouds going very, very fast almost directlyover me. it passed back into the clouds not even a second after it appeared. itmad no sound that i could hear, but visually the glow of the craft appeared tohum with light and energy. i said holy24hit to my self and came to a stop right on this hill. it didnt even occur tome to follow it for a second or two. my first gut reaction was that it might ofbeen a crashing plane, but it was just the angle i was at on the hill. it wasactually heading in a strait line due south-west. my three other friends werenorth of town in the country and only saw the light through the clouds in thesouth-western horizon. all of them agree that it moved across the sky fasterthat anything theyve seen. i was surprised to learn that they saw the samething! im going to encourage them to report it also, which is why i left themanonomys."],"Longitude":"-95.013878","Region":"Iowa","City":"Atlantic","Object Features":"Undisclosed","Sighting Duration":"00:00:59","files":["/var/www/straped/mufon/html2text/1369.html.txt","/var/www/straped/mufon/org/1369.html"],"Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There has been one other sighting in Atlantic","There was one other sighting in Atlantic on or around October 31st 2001"],"Latitude":"41.403601","Object Shape":"Sphere"}