{"Source":"MUFON","Region":"Colorado","Disposition":"Unknown","Object Features":"None","divs":["Sighting DetailsThe day before the 2004 Air Force Academy graduation, I was walking my dog in a field behind my house. I noticed that everything became oddly silent, I could not longer here traffic or crickets. After a few seconds of looking around I looked up and saw an equilateral triangle not more that 25 feet above me. It was approximately 10 to 20 feet in length and there were lights at each corner of the triangle. The lights were more of a glow-in-the-dark light and not at all like a headlight. After a few seconds of silently drifting overhead like a kite, it smoothly angled up 90 degrees and accelerated directly upward, all without a sound. For the last couple of years I believed what I saw was an aircraft like the stealth bomber, especially since President Bush was addressing the Air Force Academy graduation the next day but the size and maneuvering of the triangle didn't quite match what I would expect from a plane. It was too small, too close to the ground and I have never seen anything angle up and accelerate that quickly and silently before. The timing was also odd, based on the sound dampening effect, I believed it hovered directly overhead for a minute and flew away immediately after I spotted it. I didn't observe any odd behavior from my dog, but she was about a hundred feet away from me at the time."],"Object Flight Path":"Hovering then path","Object Shape":"Triangle","Weather Factors":"None","City":"Colorado Springs","Case Number":"13709","Longitude":"-104.819883","Date Submitted":"06/01/2004 10:30 UTC","Sighting Duration":"00:00:30","Tags":"City","Viewing Distance":"21-100 Feet","Date of the Event":"06/01/2004 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.843482,+-104.819883(13709)&iwloc=A&hl=en\"> mufon case (13709) map </A>","Latitude":"38.843482","Summary":"A triangular craft appeared the day before the 2004 Air Force Academy graduation","files":["/var/www/straped/mufon/html2text/13709.html.txt","/var/www/straped/mufon/org/13709.html"],"trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around June 1st 2004"],"Log Number":"US-11142008-0007","Country":"United States"}