{"Tags":"City","Country":"United States","Longitude":"-120.95771","Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"13702","City":"Ceres","Source":"MUFON","Region":"California","Summary":"I saw a disc shaped object appox. 1 to 2 miles away hovering low on the south horizon.","Date Submitted":"11/13/2008 10:35 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.594932,+-120.95771(13702)&iwloc=A&hl=en\"> mufon case (13702) map </A>","files":["/var/www/straped/mufon/html2text/13702.html.txt","/var/www/straped/mufon/org/13702.html"],"Latitude":"37.594932","Sighting Duration":"00:02:00","Disposition":"Unknown","Date of the Event":"11/13/2008 10:35 UTC","Log Number":"US-11132008-0018","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI am an automotive technician. I was at work working on a vehicle on the south side of the shop. I walked to the rear of the vehicle and I noticed out of the corner of my eye a bright reflection from something in the southern sky. The reflection was bright enough to catch my attention. I have worked in the same place for nearly seven years and have never seen anything like what I saw before. I immediatly stopped what I was doing and walked to the door entrance to get a better look. What I saw was disc shaped and metallic and was slightly fluttering up and down and side to side in one spot. The sun relection was extremely bright and it reflected off the entire object. There was no shadow visible on the object. At first I thought that it must be a plane or a hellicopter but as I got a better look I could make out the shape of the object as disc or saucer shaped. I suddenly became aware that I was looking at something unique and I called to one of my co-workers to come and see what I was looking at. I continued to watch the object as my co-worker made his way to my location. By the time he got to me the object began to rapidly move directly south away from my vantage point getting smaller and smaller until it just vanished. I would guess the distance from myself to the object to be maybe a mile to two miles. The amount of time it took from hovering until it disappeared was maybe five seconds. The total time I observed the object was about two to three minutes."],"Object Shape":"Disc","trends":["There have been 2 other sightings in Ceres","There were no other sightings in Ceres on or around November 13th 2008"]}