{"Object Shape":"Circle","Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Summary":"Sighted 6 orange lights in the sky two vertical columns of 3 lights each","Object Flight Path":"Stationary","divs":["Sighting DetailsWitness, D'Ann Wheeler was visiting her friend, who lives south of Hico, Tx. They were outside the friend home and looking at the stars. It was a clear night. All of a sudden 6 orange lights, about the size of a baseball, just blinked on. There were two vertical rows of three lights each. They did not blink on or off, but the entire pattern rotated to the right, maybe 10-15 degrees. The lights did not seem to move, it just hovered. The lights were about 60 degrees above the horizon and maybe 1.5 miles from the witness. The lights appeared in the West and were last seen in the West. The witness also said that there were military jets in the area before the lights were spotted and the jets, maybe F-16's, were in the area during and after the lights blinked off. She said that the jets were so high in the sky that she couldn't hear them. The lights were visible for about2-3 minutes, then the jets headed towards the lights, which were still hovering, then the lights just blinked out and weren't seen again. The jets stayed in the area and flying around as if they were looking for something."],"Tags":"City","Source":"MUFON","Weather Factors":"None","Log Number":"US-11142008-0003","City":"Hico","Region":"Texas","Longitude":"-98.026905","Date Submitted":"10/23/2008 08:30 UTC","Country":"United States","trends":["There have been 7 other sightings in Hico","There were no other sightings in Hico on or around October 23rd 2008","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Date of the Event":"10/23/2008 08:30 UTC","Latitude":"31.984965","Case Number":"13705","files":["/var/www/straped/mufon/html2text/13705.html.txt","/var/www/straped/mufon/org/13705.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.984965,+-98.026905(13705)&iwloc=A&hl=en\"> mufon case (13705) map </A>"}