{"Longitude":"-97.31407","map":"<A HREF = \"http://maps.google.com/maps?q=32.726879,+-97.31407(13706)&iwloc=A&hl=en\"> mufon case (13706) map </A>","Tags":"City","Region":"Texas","Summary":"2 Glimmery silver shinning like sparkles about a block apart.","City":"Fort Worth","files":["/var/www/straped/mufon/html2text/13706.html.txt","/var/www/straped/mufon/org/13706.html"],"Disposition":"IFO","Sighting Duration":"00:05:00","Date Submitted":"11/13/2008 07:15 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Latitude":"32.726879","Date of the Event":"11/13/2008 07:15 UTC","Case Number":"13706","Object Shape":"Circle, Diamond, Flash, Star-like","Object Flight Path":"Stationary,Straight-line path","Country":"United States","Source":"MUFON","Log Number":"US-11142008-0004","divs":["Sighting DetailsI was outside feeding my dogs and getting them some water in their can. I was watching them for a minute and looked up standing on my concrete porch. I saw this silvery white line, like the ones that they shine up in the sky to adverise a store's opening. Only this one was partly in the sky and above the ground. It was slanted like when someone draws a white line, but the line was the size of the objects. I thought how weird as I saw it with naked eye. Than I went inside got my binoculars and peered thru them. I saw the most incredible sight - one shiny sparkling light just sparkled back and fro, pulsating,a third of the way thru the top line and the other sparking sparkle was about a block down sparkled back at it and the white line extended on. It was if both of them were sparkling at each other the same time and the one on the bottom, there was still a line below it, it was as if both lights were on this strand of white light suspended in space. I watched it for a good five minutes or so and than all a sudden the line just dropped swiftly with both lights still intact, almost like a smooth piece of thread but this was a heavier bigger thread the size of the sparkles and it just floated every so smoothly all the way down until it disappeared behind a clump of trees. At this point, I couldn't see because the trees and surrounding landscape covered everything. It was so beautiful. I have never seen such a display. It was almost as if these two round sparkles were magnetized to each other. I could not understand how both of them could stand upside down in space one in front of the other, sparkle at each other at the same time and than slowly everything white line and sparkles all float down at the same time. I called the FAA, today and they had nothing in the skies. I called and the police came out and went to check. I drew a picture and left it at the police dept. I do not believe those objects were planes, satellites or etc. from here. They were too way out, like nothing I've seen before. I just felt after viewing this beautiful sight, than our technology here on this earth can't ever compare to whoever is visiting us. Because these were some beautiful objects. Also, I believe other people like maybe a pilot or too saw it too. Maybe, they are afraid to speak out. I don't know but there was a plane close by and I did recognize that. I don't know why no one else reported it but me. If we are being visited by out of this world folks, than we should have the guts to speak out and say I say so and so. What we could learn from our out of this world friends might help our technology to advance. Who knows what they might want to teach us, who knows?"],"trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around November 13th 2008"],"Object Features":"Unknown"}