{"Date of the Event":"11/14/2008 06:30 UTC","divs":["Sighting DetailsI was sitting on my couch next to my back door and my cousin Dominic was in my backyard talking on the phone. He ran into the house and told me to come outside, he thought a big animal was in my trees. I go outside and he described to me what he heard. As I was looking into my trees, very high in the sky, we saw a moving light floating across the sky. We paid close attention to it as we knew it wasn't a plane or a helicopter. The UFO disappeared within about a minute, just gone. That made us start looking into the sky more. About 2 minutes later, my cousin Dominic pointed south and said 'UFO.' I looked where he was pointing and in the sky, about a quarter of a mile away, was a HUGE black isocolese triangular UFO with 8 (I believe, maybe 7 or 9) red lights on the front, left, and right sides, coming at us with the V of the triangle in front, very, very slowly. At first, it looked like 7 helicopters, with solid red lights, flying in formation next to each other, but that went away as quick as it came. It was less than 100 feet in the air, and when it got over my backyard, the red lights started blinking very rapidly, like the way the red lights on a modem would blink. Rapid and untamed. It took about a minute and a half for it to get from one end of my yard to the other, which is about 50 feet, so if you did the math on that you would figure out how fast it was going. It was from the look of it about a few hundred feet across, and about a few hundred feet in length, and maybe 50 feet in height. It was solid, perfectly shaped, very black, no sound, very close, we could see the technology which theres not much to say other than it was perfectly smooth and black, and the way it flew was unlike anything I have ever seen. It glided straight, thats the best way to describe the way it flew. It didn't fly unnaturally, that's probably the hardest thing to describe. To get a visual, picture taking a backwards checkmark, giving it depth, painting it black, taking it off the page and pointing the 'check' at you, and putting red lights across the front of it, and making it the size I speak of, and you would be able to visualize what I, my cousin, the people across the street, and other randoms in my neighborhood saw tonight. My cousin was calm about seeing this. I was scared. Very scared. I have never seen anything that big in my life save for a skyscrapper. When you see something that big flying that close to you, knowing what it is, its petrifying. I did not get a good feeling about it. I would say its one of the, if not the most frightening thing I've ever seen in my life and to be completely honest I'm scared to go in my backyard alone. When it got over my backyard was when the lights started blinking, which I got the feeling that they wanted us to know they saw us maybe or something, I didn't think that was coincidence but logic would assume it was. I don't know what to say about that part of it, but that's the part that made me scared, that mixed with the slow pace and the closeness to me and my house. I could've hit that thing with a slingshot, thats how close it was. Very, very scary. We tried to film it but we didn't have time. We wanted to see it. We didn't get our cameras till it had past our house, and we caught the back of it on film with the lights in the front blinking, but it didn't come out too good at all. In the hopes of filming it, we got in my cousins car and chased after it. But with traffic at that time in LA mixed with the other things in the sky we saw that night (which I believe there to have been more UFO's but I cannot confirm that because they were only distant lights in the sky), we lost it. We ended up going to the park on Woodley ave by my house to look at the other things we saw in the sky. Another thing I want to point out is that by the time we got to Woodley Park there were dozens of helicopters and planes in the sky. Dozens. They were everywhere. It was like an invasion of our own air force. But, either way, we did lose sight of it and ended up going home. We played back the footage we took but nothing came out. I wish it did. But other than testimony of me and at least 4 other people I know, there isn't any evidence of this other than my 911 call. Personally, it was a life altering event, truly. I don't know if you got other reports about this thing tonight, but hopefully MUFON can do what they do and find some evidence. Good luck."],"files":["/var/www/straped/mufon/html2text/13719.html.txt","/var/www/straped/mufon/org/13719.html"],"Latitude":"34.155482","Summary":"Black Isoceles Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=34.155482,+-118.447957(13719)&iwloc=A&hl=en\"> mufon case (13719) map </A>","Case Number":"13719","Region":"California","Date Submitted":"11/14/2008 06:30 UTC","Country":"United States","Source":"MUFON","Log Number":"US-11152008-0002","Disposition":"Unknown","Tags":"City","Longitude":"-118.447957","Object Flight Path":"Straight-line path","Object Features":"Other","Object Shape":"Triangle","trends":["There have been 404 other sightings in Los Angeles","There were 3 other sightings in Los Angeles on or around November 14th 2008"],"Sighting Duration":"00:15:00","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","City":"Los Angeles"}