{"Region":"Indiana","files":["/var/www/straped/mufon/html2text/13716.html.txt","/var/www/straped/mufon/org/13716.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-87.56603","Date Submitted":"11/13/2008 12:00 UTC","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around November 13th 2008"],"Summary":"Flying Triangle over I-64 by Evansville","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=37.973679,+-87.56603(13716)&iwloc=A&hl=en\"> mufon case (13716) map </A>","Date of the Event":"11/13/2008 12:00 UTC","Object Shape":"Triangle","divs":["Sighting DetailsI was driving home from work (North on 164-Headed for Interstate 64). It was around 11 o'clock at night. I look to the west and notice a very bright light in the distance, thinking it must be a plane getting ready to land at Evansville Regional airport. Still driving, I kept looking in that direction and the light was getting closer and closer. I then noticed that it was actually two lights. As the lights kept getting closer, I noticed it was a perfect triangle of three very bright white lights. I was trying to see if there was any blinking lights on the craft and there wasn't any, and then it kinda dawned on me that this craft was moving way too slow to be a normal airplane and it was headed right toward me. I stopped my car about 6 miles south of Interstate 64 to see if it was even moving at all. This flying triangle appeared to be about 1000 feet off the ground give or take, and it didn't seem to be moving any faster than a car driving down a highway. As this craft flew over head and turned south toward Evansville, I could see that the back of the craft was concave with three bright white lights as well and three smaller, dimmer red lights on the lower end of it......none of the lights were blinking. I kept watching the craft, amazed at how large it was flying at low altitude, and also how SLOW it was moving....watching it until it went behind the horizon. I obviously don't think this was an alien space craft...because I am a bigtime skeptic of all things paranormal.....especially UFO's....all UFO means is something in the air that a person doesn't recognize....nothing more, nothing less. However, I am fascinated by aviation and I would like to know if anyone else has seen these craft in this general area."],"City":"Evansville","Source":"MUFON","Log Number":"US-11142008-0014","Latitude":"37.973679","Country":"United States","Case Number":"13716","Sighting Duration":"Undisclosed","Object Features":"Undisclosed"}