{"Tags":"City","Region":"Oregon","Country":"United States","Log Number":"US-11152008-0001","Case Number":"13718","Latitude":"43.811393","divs":["Sighting DetailsAt approx. 7:05pm I was standing outside looking up at the full (or nearly full) moon, when I witnessed an object high in the night sky. It had no lights, the only reason I saw it was because of the brightness of the moon and it's close proximity to it. It \"tumbled\" slowly horizontily beneath the moon, rather how I would expect things to tumble in zero gravity, end over end, but this was definitly in the atmosphere. And it's \"tumbling\" was seen as the moonlight reflected off of it's metallic surface. It's shape was odd, not exactly oval, not exactly egg shaped, very hard to describe but something close to that. After only seconds, 30-40, it disappeared into heavy cloud cover and was gone. This is the first time I've ever seen anything like this, I thought that if I were to see a ufo there would be lights or something... but I guess not. A brief note here: While watching it my eyes lost focus on it for just a moment and it seemed to disappear in that time, then my focus came back and it was there again. This might sound weird but when that happened I felt like it was looking back at me."],"Disposition":"Insufficient Data","Object Features":"Undisclosed","Source":"MUFON","Object Shape":"Unknown","Date of the Event":"11/12/2008 07:00 UTC","City":"cms/jat/n/a","Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"Brief sighting of metallic object high in the night sky","Date Submitted":"11/12/2008 07:00 UTC","Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/13718.html.txt","/var/www/straped/mufon/org/13718.html"],"Longitude":"-120.550561","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.811393,+-120.550561(13718)&iwloc=A&hl=en\"> mufon case (13718) map </A>","trends":["there have been 2 other sightings in cms\\jat\\n\\a","there were no other sightings in cms\\jat\\n\\a on or around november 12th 2008"]}