{"Object Features":"Unknown","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around November 14th 2008"],"Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/13720.html.txt","/var/www/straped/mufon/org/13720.html"],"Viewing Distance":"Over One Mile","divs":["Sighting DetailsWas in my parking lot of apartment complex and saw a orange object coming from the southwest part of san antonio heading to location where I lived and then swiched locations and begin to hover over san antonio. It made no noise and remained the same color(orange).I estimate it was 2 to 3 miles in the air when I saw it.I saw it for a total of about 5 minutes.I noticed closely to it a plane(air force maybe)streak by it and I lost sight of object.It was not a weather ballon,aircraft,or helicopter.It had no flight pattern and was of unknown orgin.I was by myself and had no camera with me or any other witnesses.I called 911,ksat 12 news,kens news and no other reports of sighting.I do not know what it was.I noticed it flying from ingram mall area as I was at frederickburg road and callaghan area when I noticed object.That is when it started to hover over san antonio.Strange to say the least.I first thought object was a plane when it came into view but what got my attention was the area it was coming as I have never seen object come from sw direction.I was in parking lot feeding deer at time of object being first noticed.I looked down briefly and when I looked up it was out of my sight.I knew when I saw it that it was something I could not identify.I wanted someone else to see it too,as I have never seen a orange object hover in the air like that.Hope to see it again.Was at about 4:30 pm.The lights of what I believe was a plane was very close to object as it hovered was interesting.The plane appeared out of nowhere and streaked by object,shortly after this I lost sight of object.First time I have ever seen anything like this."],"Date Submitted":"11/14/2008 05:22 UTC","Source":"MUFON","Tags":"City","Weather Factors":"None","Log Number":"US-11152008-0003","Disposition":"Unknown","Longitude":"-98.492398","Latitude":"29.429402","map":"<A HREF = \"http://maps.google.com/maps?q=29.429402,+-98.492398(13720)&iwloc=A&hl=en\"> mufon case (13720) map </A>","Object Flight Path":"Path then hovering","Country":"United States","Case Number":"13720","Sighting Duration":"00:05:00","City":"San Antonio","Region":"Texas","Date of the Event":"11/14/2008 05:22 UTC","Summary":"Orange object came my direction at about 200 mph,switched locations and hovered over San Antonio."}