{"Object Shape":"Flash","Weather Factors":"Unknown","Log Number":"GB-11152008-0009","divs":["sighting detailssome idiot with nothing better to do with their lives had taken to stabbing through the sidewalls of the tyres on my daughters car. we set up a security camera in the hope of catching the guilty party, the camera is screwed to the window frame of my daughters living room and is kept focused on the car. images are recorded through the night while the household sleeps, running through the recording of the 13\\11\\2008 we came across a flash of light moving from left to right at great speed (blink and you'll miss it sort of speed)but it looks to be about only 1mtr away from the camera, on freezing the image you can see that it has a darker centre but you still can't make much out of it. i'm sure someone with the right equipment could make more sense of this thing than i ever could. this \"thing\" whatever it is does not look very big on the tape, maybe 1ft to 18ins long and about 9ins wide, given that the camera is fixed at about 4mtrs high and the car and pavement (sidewalk) are about 10mtrs away i'm sure that someone with the proper expertise could work out the exact dimensions of this thing (whatever it is) using the distances with the exact size of the car, perhaps the image could be enhanced to the point where we can see for certain what this is, if i was capable of doing it myself i would---but i can't---anyway i would'nt know where to begin when it comes putting things onto the net i'm just starting out on the www, but if you are interested and have the capability to do these things let me know and i'll send out a few tapes, i would love to have stumbled on to something without looking for it. obviously i do not have an infinate number of tapes to give away--so please if you are a mentalcase dont ask."],"Date of the Event":"11/13/2008 06:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13726.html.txt","/var/www/straped/mufon/org/13726.html"],"Case Number":"13726","Tags":"City","Date Submitted":"11/13/2008 06:00 UTC","Disposition":"Unresolved","Object Features":"Unknown","Longitude":"-4.246006","Object Flight Path":"Straight-line path","trends":["There have been 22 other sightings in Glasgow","There were no other sightings in Glasgow on or around November 13th 2008"],"Latitude":"55.872617","Summary":"Flash of light moving at speed directly in front of a security camera.","City":"Glasgow","Region":"Scotland","Country":"United Kingdom","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=55.872617,+-4.246006(13726)&iwloc=A&hl=en\"> mufon case (13726) map </A>"}