{"Date Submitted":"11/13/2008 10:02 UTC","Date of the Event":"11/13/2008 10:02 UTC","divs":["sighting detailsi had just turned on the late evening news, weatherman said possible snow showers later. i went out to the backyard deck to bring my tools into the garage. i stood on the deck and heard a commercial aircraft approaching from the northeast (i live along one of the flight corridors for dia) and watched it pass over the house at about 10,000 ft. just as the plane passed off to the southwest, i saw a bluish\\white double light pass over my head at about 8,000 ft. just below and to the right of the airliner. it then just vanished, lights out, hyperspeed. it made no sound. i could not tell what the shape was because it was gone too quickly, but the shape of the lights could be described as bullet-shaped and smaller in size than the airliner. this account is very similar to the one that occurred earlier in the evening in arizona (posted by the pilot). because of that post, i decided to add mine, they are both very similar. what struck me afterwards was whether the pilots or passengers in that airliner had witnessed the same thing. about an hour later, the weirdest ground-level fog came in from the northeast, very quickly. i am sure it wasn't related, but it still freaked me out."],"Region":"Colorado","Weather Factors":"Unknown","Case Number":"13728","Latitude":"39.733722","Log Number":"US-11152008-0011","map":"<A HREF = \"http://maps.google.com/maps?q=39.733722,+-104.82608(13728)&iwloc=A&hl=en\"> mufon case (13728) map </A>","Object Features":"Unknown","Sighting Duration":"00:00:03","Disposition":"IFO","Object Shape":"Unknown","Country":"United States","City":"Aurora","trends":["There have been 48 other sightings in Aurora","There was one other sighting in Aurora on or around November 13th 2008"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Summary":"Bright bluish/white double light passed overhead at same time as commercial jet.","files":["/var/www/straped/mufon/html2text/13728.html.txt","/var/www/straped/mufon/org/13728.html"],"Longitude":"-104.82608","Tags":"City","Source":"MUFON"}