{"Source":"MUFON","divs":["Sighting DetailsI was driving home to Modesto from my job in Pleasanton Calif. In order to get to Modesto, you have to go North on Interstate 5 for a few miles then proceed east on Highway 120. During that jog on Interstate 5, off to my right (east) I spotted what looked like a meteor coming in. It had all the speed of the meteors you see in the Perseid or Leonid meteor showers. It was much too fast to be a plane, based on my experience in the audience of a few airshows with the Thunderbirds, etc. There was no visible fire with this meteor, although comet shaped, with a tail nearly half way across the visible sky, the \"coma\" and tail appeared to be composed of vapor, like that which comes from the wingtips of a fighter plane executing a really hard turn. The trajectory appeared to be horizontal. Within a few seconds, the meteor's coma was directly in front of our lane of traffic. I looked at it and inside the coma of vapor was a definite mechanical shape. It was sort of like looking at a disk brake's rotor edge on. There were maybe six evenly spaced rectangular vents, or windows all along the rectangular body. The overall color was matte charcoal gray, much like you would expect from a body that went through re-entry. I'm pretty sure what I saw was just a \"peek\" at part of the craft which was mostly obscured by the coma of vapor. All this time, I was alternatively stealing a glimpse of the unfolding spectacle then rechecking the traffic that flowed along like nothing unusual was happening. About the time I saw the mechanical part of the meteor it was time to move to the right so that I could make the transition onto Highway 120 so I lost track of the \"meteor\". I never reported this for fear of redicule from the authorities. I know their policy is to discredit those who come forward with sightings like this."],"Object Features":"Undisclosed","Date of the Event":"03/15/2005 04:30 UTC","City":"Lathrop","trends":["There has been one other sighting in Lathrop","There were no other sightings in Lathrop on or around March 15th 2005"],"Sighting Duration":"00:00:30","Longitude":"-121.27661","Case Number":"13739","Tags":"City","files":["/var/www/straped/mufon/html2text/13739.html.txt","/var/www/straped/mufon/org/13739.html"],"Disposition":"Unknown","Object Flight Path":"Undisclosed","Summary":"An apparent meteor was streaking in, in full daylight, when it got even with us we could see it was some sort of mechanism.","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.822705,+-121.27661(13739)&iwloc=A&hl=en\"> mufon case (13739) map </A>","Country":"United States","Log Number":"US-11152008-0022","Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","Date Submitted":"03/15/2005 04:30 UTC","Latitude":"37.822705","Weather Factors":"Unknown"}