{"Object Flight Path":"Stationary","Latitude":"37.648457","divs":["sighting detailsi left livermore at 1:30am and was driving on corral hollow road when i noticed the mountain tops were lit up with orange light. when i got to the end of corral hollow road, i turned onto 580 south towards 132. when i was driving down the ramp to get onto 580 i noticed in the distance an orange square object. the time was approx. 1:50 am. when i was 3\\4 a mile from the 132 exit i was up on a small hill looking down at what appeared to be a large tear drop object. i wasn't making any sense of this. the top was blacker then the blackest night sky. if i had to guess it was aroung 600 feet across. i turned onto the 132 exit seeing the object directly in front of me hovering around 40 feet above the ranch houses to the right of the guard rail. i was scared but did not know what to do so i kept driving. the object was located just above the ramp where the road turns to go over 580 towards modesto. as i got close to the object red lights came on. the pattern of the red lights was 1-6, 2-5,1-4 etc. i remember looking in my rear view mirror but the rest of the drive to modesto is a blank. the next clear thing i remember is being in my apartment and asking myself what i just saw. i have kept this to myself and only decided to write this letter after seeing ufo files and ufo hunters on the history channel. this experiance has changed my life forever and there hasn't been a day that i haven't thought about it."],"Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"13737","Source":"MUFON","Summary":"Square glowing orange at approx. 4 miles away","Object Features":"Window(s)","Log Number":"US-11152008-0020","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around January 26th 2003"],"Sighting Duration":"Undisclosed","City":"Modesto","Weather Factors":"Unknown","Country":"United States","Longitude":"-120.988728","Tags":"City","Disposition":"Unknown","Object Shape":"Egg, Square, Rectagular, Teardrop","Date of the Event":"01/26/2003 01:50 UTC","files":["/var/www/straped/mufon/html2text/13737.html.txt","/var/www/straped/mufon/org/13737.html"],"Date Submitted":"01/26/2003 01:50 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.648457,+-120.988728(13737)&iwloc=A&hl=en\"> mufon case (13737) map </A>"}