{"Object Shape":"Circle, Diamond","City":"Los Angeles","Region":"California","Object Features":"Unknown","Date of the Event":"11/14/2008 09:00 UTC","Country":"United States","Log Number":"US-11152008-0014","Summary":"On 11-14-08 I heard low humming sound which caused me to look up , that's when I seen 7 to 8 red lights on the sides of what looked like a diamond or triangle shaped craft.","Object Flight Path":"Path then hovering","Date Submitted":"11/14/2008 09:00 UTC","Tags":"City","Weather Factors":"Windy","Sighting Duration":"00:25:00","Source":"MUFON","Latitude":"34.310698","Case Number":"13731","Disposition":"Unknown","divs":["sighting detailson 11-14-2008 at approximatly 9:00pm (pt) in the foothills of sylmar,ca.i was sitting on the porch of my home when suddenly i heard a low humming noise from above me,i stepped off the porch to look up in the sky , when i noticed 7 to 8 bright red lights on what looked like a very large diamond or triangular shaped craft ,it moved very slow ,my house sits on the north east end of the san fernando valley in so. calif. the red lights were stationary and suddenly they began to move rapidly around the edge of the craft in a strobe like fashion , the object moved silently and stealth like in a s\\e direction , i rushed in my house to call my wife yolanda and kids and also a friend ,who all came out to see it , i wanted to make sure i had other witnesses, because this was something unlike any thing i have ever seen in my life. my son david asked me dad what is that, and i had no answear. all this took place within a 7 min. time frame ,once my family and i resumed to observe the object for 20 mins. heading east towards the pacific coast , it moved very slowly ,all of a sudden this large object appeared to seperate into 7 smaller crafts,each had one white light with a red light encircling it very rapidly ,we observed these smaller objects fly off in different directions with one flying back towards our house ,when it was close enough i noticed that it had 4 white lights on its underside and a single red light going rapidly around it, now here's where it gets more intresting ,this object along with another one headed west over some hills towards veterans park ,where less than an hour later around 10:30pm, a major fire began in the area where i lost sight of these objects the fire has caused evacuations and loss of homes,all the rescue helicopters in the air resembled \"nothing\",i repeat \"nothing\" looked like what my family and i witnessed,did this ufo have something to do with the sayre fire ? i'm feeling excited,and confused,i hope you guys find some answears to these sightings that took place an hour before this horrible fire started. my life will forever be changed by this. sincerely and truthfully david aguilar. sylmar,ca. 11-15-2008"],"trends":["There have been 404 other sightings in Los Angeles","There were 3 other sightings in Los Angeles on or around November 14th 2008"],"Longitude":"-118.448917","files":["/var/www/straped/mufon/html2text/13731.html.txt","/var/www/straped/mufon/org/13731.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.310698,+-118.448917(13731)&iwloc=A&hl=en\"> mufon case (13731) map </A>"}