{"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around March 15th 2001"],"Case Number":"13733","Region":"California","divs":["Sighting DetailsMy wife and adult son and I went down to the cliffs in Ocean Beach, San Diego, County for the purpose of watching the sunset and maybe seeing the \"green flash\" that's common at lower latitudes. When the sun was very near the horizon and dim enough so that we could stare straight into it, I noticed that the sun seemed to have two oval shaped, black \"eyes\" much like the eyes on the prototypical \"Happy Face,\" \"Have a Nice Day\" logo. The two vertical ovals were spaced about the right distance apart and their tops were lined up perfectly so that neither was higher on the \"face\" than the other. Someone said, \"Oh they must be Marine helicopters coming straignt at us. But I didn't think any helicopter would have a perfectly oval profile. Also, if they were helicopters coming straight at us then the sun would appear to move behind them and pretty soon they would no longer be in a direct line with the sun. I said \"Maybe they are sunspots,\" not really thinking that sunspots are never symmetrical and never identical to any other sunspot, and never that large in relationship to the entire sun. As it was, the ovals moved with the sun until it had sunk below the horizon. This would indicate that the earth was turning away from both the sun and the ovals. I didn't even think about that at the time. I just knew the ovals were not helicopters or planes. Only within the past month (more than 8 years later) did it dawn on me that only a UFO could be that far out from Earth and still have that large an apparent size."],"Summary":"Two symmetrical and identical \"eyes\" seen in setting sun which followed it down to horizon.","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","City":"San Diego","Country":"United States","Date of the Event":"03/15/2001 05:15 UTC","Log Number":"US-11152008-0016","Latitude":"32.718139","Object Shape":"Oval","Longitude":"-117.154765","Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.718139,+-117.154765(13733)&iwloc=A&hl=en\"> mufon case (13733) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/13733.html.txt","/var/www/straped/mufon/org/13733.html"],"Date Submitted":"03/15/2001 05:15 UTC"}