{"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 31st 1997"],"Log Number":"US-11152008-0015","Date Submitted":"08/31/1997 02:30 UTC","Tags":"City","divs":["Sighting DetailsMy boss and I were returning to Sacramento, CA on Southwest Airlines from business meetings in Phoenix, AZ. We had just left Phoenix on the Phoenix to San Diego leg of the trip. We were in the back of the plane where seats face each other. As I recall, we were far enough out of Phoenix to be at or near cruise altitude. I was looking down at the scrolling dessert floor and I spotted what I first thought was some huge boomerang shaped cement building. From our altitude it just seemed surprising that a building would be so huge. Also, there were no roads, dirt or paved leading up to the \"building.\" I had flown over Meteor Crater in Arizona from approximately 30,000 feet. Meteor Crater is almost a mile in diameter and it appeared to be about the size of a nickle held at arm's length. This boomerang thing looked about twice that length. Then I notice that the desert floor was moving under it. That's when I knew that it was hovering and not planted on the ground. I then pointed it out to my boss, who was seated opposite me. We both watched the object until it was no longer in sight. This object was smooth, the wing tips were squared off, not rounded. The wing was clean, with no engine nacelles or control surfaces. Both of us thought it was pretty puzzling but we had no emotions about it, per se."],"Case Number":"13732","Summary":"Huge triangle seen hovering above desert floor from airliner at cruise altitude.","Latitude":"33.456227","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.456227,+-112.066567(13732)&iwloc=A&hl=en\"> mufon case (13732) map </A>","Country":"United States","Object Shape":"Boomerang","Date of the Event":"08/31/1997 02:30 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13732.html.txt","/var/www/straped/mufon/org/13732.html"],"Object Flight Path":"Undisclosed","Disposition":"Unknown","City":"Phoenix","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Arizona","Longitude":"-112.066567","Source":"MUFON"}