{"Tags":"City","City":"Paducah","Country":"United States","Sighting Duration":"00:08:00","files":["/var/www/straped/mufon/html2text/13734.html.txt","/var/www/straped/mufon/org/13734.html"],"Object Flight Path":"Undisclosed","Summary":"Alien abduction thwarted.","Longitude":"-88.597048","Case Number":"13734","map":"<A HREF = \"http://maps.google.com/maps?q=37.093269,+-88.597048(13734)&iwloc=A&hl=en\"> mufon case (13734) map </A>","Latitude":"37.093269","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Paducah","There were no other sightings in Paducah on or around November 14th 2008"],"Date of the Event":"11/14/2008 05:30 UTC","Log Number":"US-11152008-0017","Disposition":"Unknown","Region":"Kentucky","divs":["Sighting DetailsOn 11-14-08 at approx. 5:30 A.M. I woke up in my bed unable to move or scream. My girlfriend was sleeping right next to me, and my 93 pound Great Pyrenese puppy was asleep at the foot of my bed. I moved my eyes around to my avail on my left side I saw what looked like a rouned expandable antenna held by a white hand moving towards the side of my head. My dog was woken up and immediately jumped up off the bed and started growling and went into alert mode. ( Im a former Police Officer and K-9 Handler I work in Corrections Now and my dog is a working dog.) Then my dog got low to the ground and was out of my sight. The hand holding the antenna was now pointed at her and she stoped barking and growling. I then was able to move a litle and was filled with unbridled rage. I moved my eyes to the left and saw my alarm it said 5:35 A.M. My left hand that had felt like it was being held down as I stated before being paralyzed now swung to my left with all the force in my body and made contact with a hard but latex feeling body. Immediately I jumped and looked to my left where this being was at previously and it was gone. And my alarm now stated it was 5:38 A.M. My girlfriend now woke up i told her to run into the living room and the dog followed her, I grabbed my 9mm Glock went into my living room cleared that room and cleared my apartment. I do not know what this was and why it had happened but I prayed to Jesus Christ to help me and he did. I have had many strange experiances but not on this magnitude and have always felt like I am being watched. I work 11pm to 7pm so I dont have to sleep at night. I work in corrections now so someone is always around be it another staff member or an inmate or my dog. I can never have enough weapons either I am always buying a new gun every few months, and just always feeling like some one is going to try and take me or invade my home. If someone could help me out with this please do so, or maybe just a few helpfull words of encourgement from people that this is happening to as well. Thank You. Respectfully Submitted Jon"],"Object Shape":"Unknown","Weather Factors":"Unknown","Date Submitted":"11/14/2008 05:30 UTC"}