{"City":"Lawrenceville","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around October 24th 2008","This sighting has never been favorited.",""],"Log Number":"US-11152008-0013","Object Shape":"Other","Case Number":"13730","Sighting Duration":"00:00:04","Tags":"City","Date Submitted":"10/24/2008 04:30 UTC","files":["/var/www/straped/mufon/html2text/13730.html.txt","/var/www/straped/mufon/more/13730_submitter_file1__PWLocationDuringSighting.jpg","/var/www/straped/mufon/more/13730_submitter_file2__LineofSightofPWDuringSighting.jpg","/var/www/straped/mufon/more/13730_submitter_file3__ObjectsDirectionofTravel.jpg","/var/www/straped/mufon/more/13730_submitter_file4__USgas.jpg","/var/www/straped/mufon/org/13730.html"],"Summary":"Cloud like shape moved across nieghbor's yard into cul de sac. Exited NW direction.","Object Flight Path":"Straight-line path,Path with directional change","Region":"Georgia","Disposition":"Unknown","Country":"United States","Source":"MUFON","Latitude":"33.958445","Weather Factors":"None","Longitude":"-83.985962","divs":["sighting detailsroughly 4:30pm while visiting with a neighbor in his driveway we observed a cloud-like object move from behind his neighbors house. object aprox 15 feet off the ground moving in a straight line south to north. aprox speed 15 mph which did not vary faster nor slower for short time it was viewed. no sound from object. other normal noises from neighborhood not dampened. object aprox 25feet long by 12feet high by 10feet wide. could be said to be somewaht teardrop shaped or conical. as object broke cover i asked my neighbor, \"wtf is that?\" turning slightly for answer. he was tracking abject the same as i was. later questioning him for description...matches mine. total viewing time aprox 4 seconds as object moved across the yard into cul-de-sac where it left line of sight raising over opposing nieghbors house. aprox distance covered; 60yards. -orignial vector obstruction free or object not required to manuever around ornamental trees. did not pass through any obstructions. - no winds. no breezes at the time of sighting. no tree branches moving. misc. observations: -no roiling nor changes in surface or shape for duration of sighting. -no vapour trail. -examination of nieghbor's grass\\yard shows no visible disturbance. -trees semi-visible through object. -multiple surfaces on object which did not reform nor otherwise change orientation. -object had a vague opalescent quality as though a stronger light source was available in spite of object being sited in shade and below tree-line. right front of object initially had pale pinkish opalescence coloring wich faded quickly. left top of object briefly opalesced pale blue. - no animals in the area disturbed such as neighborhood dogs being set off. possible related data: -3 blackhawk helicopter teams reported in immediate area and not at the l'ville ap. -local pilots diverted to athen ap due to other military traffic at the lawrenceville airport. -object very low to the ground as though intentially trying to stay out of sight from main hwy or lawrenville swannee directly behind my house. lifted out of vector or new vector at point of densest tree cover from that line of sight. -initial point of sighting secluded and otherwise not visible from hwy nor cul-de-sac. -object would have been entirely visually camoflauged or otherwise unremarkable if sighted higher in the air\\sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.958445,+-83.985962(13730)&iwloc=A&hl=en\"> mufon case (13730) map </A>","Object Features":"Other","Viewing Distance":"21-100 Feet","Date of the Event":"10/24/2008 04:30 UTC"}