{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13735.html.txt","/var/www/straped/mufon/org/13735.html"],"Summary":"Chevron-shaped object with no lights flew over at night, made two right-angle turns.","Latitude":"37.647767","Viewing Distance":"Unknown","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around August 16th 2006"],"Longitude":"-120.995318","Object Shape":"Chevron","Log Number":"US-11152008-0018","Tags":"City","Date of the Event":"08/16/2006 09:00 UTC","Object Features":"Undisclosed","Sighting Duration":"00:00:45","Case Number":"13735","Source":"MUFON","Region":"California","Date Submitted":"08/16/2006 09:00 UTC","City":"Modesto","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.647767,+-120.995318(13735)&iwloc=A&hl=en\"> mufon case (13735) map </A>","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was sitting in our back yard in Modesto, California enjoying a glass of wine (yes, just one) and admiring the stars that were very brilliant that night. Suddenly, a black shape zipped by, right in my line of vision. I quickly turned my head and caught up with the shape. It might be described as a chevron shape with all corners rounded. It was slightly reflective because I could see the orange light from our city's sodium street lights flickering on the bottom of the craft. There were no running lights of any kind on the craft and it was absolutely silent. I could see that in a fraction of a second the object would be obscured by my neighbor's two story house so I ran quickly to our front yard just in time to see the craft execute an abrupt right-angle turn. This took him from a Northerly direction to a Westerly. About five seconds later he made another right-angle turn that took him back to a Northerly course again. Being close enough to the ground to see the reflections of street lights, I estimate that the \"wingspan\" of the craft was no greater than 30 feet. I'm puzzled about why the right-angle turns made to noise as I've witnessed airplanes executing aerobatic maneuvers and the wings make a lot of racket when pulling tight turns sort of like a golf club makes during a hard swing."]}