{"divs":["Sighting DetailsI haven't any real idea what it was exactly i saw all i know is i saw something completely bizar in broad daylight in the east torwards Pikes Peak Mountain. The \"Objects were shiny in nature at first looked connected with each other I thought possibly at the time it was a flock of birds trailing each other like following the leader. But with zero clouds in the sky as they were turn in a slow motion manner would disapear from sight then return to my sight slowly as these objects moved in the sky. The best way i can describe these tiny or at least what appearerd as tiny silvery objects like awave of water in the ocean moves in random directions while a jellyfish swishes around the tide in a ever slow motion manner. These tiny silver and shiny lookin objects would change directions as if it were follow the leader except i could figure out how these little objects were disappearing from my view and back all this happened in broad daylight and no ther werent any other spectators other then myself bizar i tell ya! Didnt have any cameras on me and no other witnesses i even hate writing this tiny little bit of info to you guys i knowing for damn sure noone is gonna believe such none sense but i know what i saw wasnt an illusion i simply cant explain any of it. some might ask was a UFO by webster's dictionary as defines yes it was plural many objects i could possibly identify but you ask me was it an ET type UFO and i will respond to \"I have no friggin clue\" I wasnt able to ask this thing anything cause of how far up in the sky it was LOL! At anyrate if you know what this is by all means please explain it because i cant."],"trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around November 16th 2008"],"Object Features":"None","Longitude":"-104.817503","Object Flight Path":"Path with directional change","Case Number":"13747","Date of the Event":"11/16/2008 10:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/13747.html.txt","/var/www/straped/mufon/org/13747.html"],"Region":"Colorado","Object Shape":"Star-like, Other","City":"Colorado Springs","Country":"United States","Weather Factors":"None","Log Number":"US-11162008-0004","Latitude":"38.835582","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.835582,+-104.817503(13747)&iwloc=A&hl=en\"> mufon case (13747) map </A>","Sighting Duration":"Undisclosed","Summary":"very odd and not sure at what it was i was watching for ten minutes","Date Submitted":"11/16/2008 10:30 UTC"}