{"Disposition":"Unknown","Date Submitted":"11/30/1979 12:00 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/13741.html.txt","/var/www/straped/mufon/org/13741.html"],"Date of the Event":"11/30/1979 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.263167,+-104.602921(13741)&iwloc=A&hl=en\"> mufon case (13741) map </A>","Country":"United States","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around November 30th 1979"],"Viewing Distance":"101-500 Feet","Summary":"Triangle - Wedge Shaped","Sighting Duration":"Undisclosed","Object Features":"Other","Log Number":"US-11152008-0024","Region":"Colorado","divs":["Sighting DetailsThis happened quite some time ago. However, my memory of this 'sighting' is still quite clear. I was waiting outside for my grandfather to pick me up for a program at school. It was cold and early evening, but dark outside, which leads me to believe that it occurred sometime during late fall or winter. I walked several feet down the parking lot, towards the basketball hoop behind the apartment building. I look up to see a wedge shaped object, with many flashing lights, hovering, silently. I did not know what it was. I stood there and looked at it for just a few seconds before having this 'feeling' (for lack of a better term)... I recall a sense of knowing that this thing was going to leave. I didn't want it to go. I reached out and said 'wait, don't go'. As I reached toward it with my hand, it went from motionless to gone in a zig-zag streak of light. There was no sound. As a point of reference, the apartment building was 3 floors tall and the object was hovering at about three times that height, back and off to the right of where the basketball hoop was located. If I were to guess the size, I would say that it would have been close to the size of the apartment building. Aside from the obvious, there are some things that I find odd about this: 1. I was approximately 8 years old at the time, yet I was not afraid... really, considering the circumstances, I don't recall being terribly surprised to see the thing. 2. I did not run in and tell my mother about it. I just went back to where my grandfather picked me up and waited. I did not tell my grandfather when he arrived, either. 3. Though I never 'forgot' it, I never had a desire to mention it to anyone until just the last few years. The incident just sort of sat there, in the back of my mind. 4. Shortly after this occurred, I was picked up and taken to my granparents house to get ready for the program and I recall having a headache that was so painful, I was crying and had to cover my eyes because any kind of light made the pain worse. My grandmother had to put a warm washcloth over my forehead and eyes while I lay on a bed with the lights off. 5. I don't recall going to the program at school, or much of anything else that evening."],"Latitude":"38.263167","Case Number":"13741","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-104.602921","Object Flight Path":"Stationary,Other","City":"Pueblo"}