{"Tags":"City","City":"Rathdrum","Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unknown","Region":"Idaho","Case Number":"13743","Log Number":"US-11152008-0026","Date Submitted":"09/21/2008 02:30 UTC","divs":["Sighting DetailsWhile I was sitting on my couch at approximately 2:30 AM, I heard a faint buzzing sound overhead. I stepped out onto my porch and spotted a saucer shaped object about 50 feet from me.I then ran out into the yard closer to it and snapped a photo.Slowly it started moving towards me so I ran back inside my house.I heard something land on my roof.I saw some kind of vapor falling from my ceiling.I started losing feeling in my arms and legs so I hurried outside the house onto the porch.An alien being four to four and a half feet tall charged towards me.I then held out my camera to snap a photo and it instantly stopped.As I took the photo it retreated as if it was scared of what I had. At this time, I was very frightened so I went into the house and locked the door . I looked toward the kitchen window and saw another type of alien staring in.I walked to the window and snapped a photo.The alien appeared to be upset by this and shook it's head in an unusual fashion. I then backed away and tried to stay in the center of the house. I noticed the bottom of my window blinds pulling away from the wall about ten inches. Earlier, I phoned my father to hurry over for help.He was not answering so I immediately dialed 911. I had a large caliber hunting rifle(338 win mag) I was thinking about grabbing but the dispatcher told me not too.An officer came shortly afterward and they disappeared quickly.The officer looked around a little from his patrol car and left.Shortly after,my father showed up it was about 3:15 AM.During this encounter my cell phone shut off twice. I managed to take about six digital photos.The next day, I went onto my roof and noticed three large scatterings of two inch staples lying on top of the shingles.Also there where depressions on the lawn where the craft landed."],"files":["/var/www/straped/mufon/html2text/13743.html.txt","/var/www/straped/mufon/more/13743_submitter_file1__picture171.jpg","/var/www/straped/mufon/more/13743_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/13743.html"],"trends":["There have been 2 other sightings in Rathdrum","There were no other sightings in Rathdrum on or around September 21st 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=47.812403,+-116.896586(13743)&iwloc=A&hl=en\"> mufon case (13743) map </A>","Summary":"Multiple craft landing on roof and yard with two different types of beings seen at close range.Digital images captured of craft and beings.","Latitude":"47.812403","Date of the Event":"09/21/2008 02:30 UTC","Longitude":"-116.896586","Country":"United States","Object Shape":"Disc, Oval, Square, Rectagular, Other","Viewing Distance":"21-100 Feet","Weather Factors":"Rain, Light","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path"}