{"Sighting Duration":"00:02:00","City":"Cambridge","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around November 16th 2008"],"Log Number":"GB-11162008-0006","Date Submitted":"11/16/2008 08:30 UTC","files":["/var/www/straped/mufon/html2text/13749.html.txt","/var/www/straped/mufon/org/13749.html"],"Summary":"3 objects flying in line rear object released sparkly fire and second fell from sky.","Date of the Event":"11/16/2008 08:30 UTC","Object Features":"None","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Latitude":"42.38249","divs":["sighting detailsmy wife, a friend and i witness an un usual event in the skies over st.neots cambridgeshire, at exactly 8.30pm tonight 16th november 2008. when we came out of our front door (8.30pm) we notices three bright lights heading directly over us at a guess the first one was about half a mile ahead of the second object the third abject was around quarter of a mile. what we saw was as follows each light had around it 5 or 6 other light in a circle closely gathered looking like one object all 3 objects looked the same. the lights were flickering yellow\\orange (mostly orange). while we were watching these object the 3rd object released a rally of lights off in the direction of the second object, this lasted only about 8\\10 seconds, the second objects lights dimmed and changed direction it seemed to slow up stop for a split second and then fall at an increase speed back from the direction it was first coming and then fall from the sky. as it fell it lights faded and no longer could be seen. the first light continued until it went out of sight followed by the third object."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.38249,+-71.105073(13749)&iwloc=A&hl=en\"> mufon case (13749) map </A>","Object Shape":"Circle, Other","Region":"Massachusetts","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-71.105073","Disposition":"Unresolved","Case Number":"13749"}