{"Date of the Event":"06/30/1994 12:00 UTC","Object Features":"Dome","Summary":"The Object That was seen looked like an egg- shaped, or looked like the side of a football-with bright luminous lights-the kind they use in a stadium. It flickered from red to white and the lights were circling counter-clock wise as the object hovered","map":"<A HREF = \"http://maps.google.com/maps?q=41.525852,+-81.553035(13750)&iwloc=A&hl=en\"> mufon case (13750) map </A>","Longitude":"-81.553035","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/13750.html.txt","/var/www/straped/mufon/org/13750.html"],"City":"Cleveland Heights","Case Number":"13750","Log Number":"US-11162008-0007","Latitude":"41.525852","Region":"Ohio","trends":["There has been one other sighting in Cleveland Heights","There were no other sightings in Cleveland Heights on or around June 30th 1994"],"Tags":"City","Object Shape":"Egg, Oval","divs":["Sighting DetailsMe and my brother were coming from the first ever \"freaknic\" in Ohio. It was late at night around 12:50-1:00 am. We were traveling northbound on Superior Road. When we arrived at the intersection of Superior and Mayfield Road, I immediately noticed the brightest lights I had ever seen. I was a passenger and my brother was the driver. We were stopped at the the light and I told my brother \"What is that\"!!! He looked at me and I seen the look of terror mixed with uncertainty in his eyes.As we crossed the intersection,there is a heavilywooded area know as Ski Hill. It sits behind a steep ravine and a basketball court which is at the top of the ravine. Still northbound on Superior, I told my brother to stop the vehicle. I got out and ran toward the basketball court. As I got closer to trees, I could see plain as day, something hovering behind the trees, and it was coming down into the ravine. I looked back at my brother and he stood outside his car door on total shock. I was so animated, like WTF!! I noticed the lights were not the type of lights that are on any type of helicopter or plane that I had ever seen. I made sure that I got a real (good) look at it too. There were like red circle lights that fluctuated to a bright white and back to red. It never touched the ground. It must have noticed that I seen it, because it started slowly hovering back up, coming out of the ravine. I am keeping my eyes on it as it slowly hovered around the treeline next to the basketball court. I ran toward the street(Superior) and steadily trying to get all the passing cars attention to look at the hovering lights!!! I then got back into the car and told my brother to follow the craft. We made a left on Belmar street, another left on Rosedale, and another left on to Eddington which leads back to Superior Road. We still see the object and the lights are flickering even faster-still counter-clockwise. It is at least 80 yards above the treeline-making our way back to the intersection of Mayfield and the next intersection of Mayfield and Monticello we still see the object..then with lightening fast speed it zig-zagged motion and darted east and was gone...we were in awe..and I still get the chills when I talk about it. I finally wanted to come forward because I didnt want to seem crazy. I recently saw on UFO Hunters the same object that I seen, was also seen in Trumbull County..in 1994!"],"Date Submitted":"06/30/1994 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown"}