{"Object Flight Path":"Unknown","Source":"MUFON","Disposition":"Unresolved","Region":"Minnesota","City":"Hastings","files":["/var/www/straped/mufon/html2text/1375.html.txt","/var/www/straped/mufon/org/1375.html"],"Object Shape":"Sphere","Summary":"Retired railroad worker sees tightly maneuvering l","Longitude":"-92.84694","trends":["There have been 4 other sightings in Hastings","There were no other sightings in Hastings on or around June 22nd 2000"],"Tags":"City","Viewing Distance":"101-500 Feet","Log Number":"","Weather Factors":"Unknown","Case Number":"1375","Date of the Event":"06/22/2000 11:00 UTC","Sighting Duration":"00:30:00","Date Submitted":"06/22/2000 11:00 UTC","divs":["Sighting DetailsThe witness was referred to us by his son, who had met the investigator during acase several years ago. The witness is a retired employee of the Soo Linerailroad. He had taken a part-time job with the Allina Medical Group as a nightjanitor at one of their clinics in Hastings, Minnesota.The witness was walking out of the clinic carrying bags to a dumpster when hisattention was directed to eight spherical lights in the northern sky. Subjectively, he felt that each of the lights appeared to be the size of thefull moon, that they were possibly 200 - 300 feet away from him at an altitudeof 200 feet and at an angle of 45 degrees from horizontal to vertical. It was alittle before 11:00 PM. He estimated that the actual size of each object wassimilar to that of a washtub.The interesting aspect of this encounter was the odd behavior of the objects. They would be briefly located in pairs at the 12:00, 3:00, 6:00, and 9:00 clockpositions, then quickly move simultaneously in a clockwise circular path to newpositions 180 degrees on the opposite side of the circle. The path was circularwith respect to him as he looked up into the sky at a possible 45 degree angle.The witness watched them for a while and then walked back into the clinic tocontinue his work. As he did so, it was his impression that the group movedparallel with him while continuing their rapid intermittent circling around acommon center.After working for a few minutes he decided to go out and see them again. Theywere still there and doing their maneuver. He went back into the clinic, butwhile he was working, would walk over to a window from time to time and look outto still see the objects in the sky. Once more he went outside to observe theformation, but they were no longer to be seen. The entire incident had lastedfor something in excess of 20 minutes.From inside the building he called the sheriff to inquire if there were anyreports of lights in the sky, but there had not been."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.74145,+-92.84694(1375)&iwloc=A&hl=en\"> mufon case (1375) map </A>","Country":"United States","Latitude":"44.74145","Object Features":"Undisclosed"}