{"trends":["There have been 74 other sightings in Stephenville","There were 6 other sightings in Stephenville on or around October 23rd 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/13751.html.txt","/var/www/straped/mufon/org/13751.html"],"Object Features":"None","City":"Stephenville","divs":["sighting detailson october 23, 2008 at around 8:30pm, my friend hannah fair and i were driving out of stephenville, tx towards proctor, tx on hwy 377.when we were almost to the red light to turn onto hwy 377 towards proctor hannah told me to look at the shy because there was something she was seeing that could not be explained. i turned and looked out the passenger side window and saw an unidentified lighted \"object\" in the sky. the lighted \"object\" can be described as follows: a row of moving lights traveling horizontal in a straight line that appeared to curve or trail off to the right as it would fade. the row of lights was in a set of three a space and three mor lights. the lights were yellowish in color and larger than the stars out as well as larger than the planes and other miscellaneous aircraft in the shy that could be seen. the \"object\" appeared to be closer to the ground because of the difference in six of the lights in comparison. also the lights were very bright. hannah grabbed her digital camera from her purse and handed it to me. the \"object\" appeared 4 separate times in 4 separate locations. it would be lit up from 5-10 seconds, then disappear and reappear in a different area of the sky. i made a recording on her digital camera of the object upon the second appearance of the unexplainable lights. the lights appeared tw0 more times but i was unable to capture it on camera again due to the fact that i did not know how to work her camera very well and it would disappear by the time i coud get the camera ready. the time between the appearances varied but were around 30 seconds between each one. the fourth and final time there was a space of a couple of minutes. this time the object was in motion moving downward very rapidly. the lights were vertical this time and it did not stay lit up for more than 5 seconds. the sky was completely clear that night as far as weather. when we arrived in proctor, tx, i entered handy's and one of the ladies that worked there asked me if i saw any lights in a joking manner. i was shocked because although i had seen it with my own eyes it was strange\\exciting to discover we were not the only ones who saw them. i told the customers and employees around about what i had seen. end of statement"],"Date Submitted":"10/23/2008 08:30 UTC","Country":"United States","Object Flight Path":"Hovering then path","Latitude":"32.223606","Tags":"City","Disposition":"Unknown","Case Number":"13751","Region":"Texas","Date of the Event":"10/23/2008 08:30 UTC","Log Number":"US-11162008-0008","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Longitude":"-98.200183","Summary":"My friend and I were driving South from Stephenville on Hwy 377 to Proctor, TX. I looked out the passenger side window and saw an object in the sky.","Object Shape":"Circle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.223606,+-98.200183(13751)&iwloc=A&hl=en\"> mufon case (13751) map </A>","Weather Factors":"None"}