{"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Log Number":"US-11162008-0010","Region":"Florida","Case Number":"13753","divs":["Sighting DetailsI was in the Army at Ft. Rucker, AL and several friends and I had travelled to Panama City Beach for a weekend away from post. Saturday night my roommate Gail Rodriguez and I decided to take two of our friends out to a little bar at the south end of the strand which I believe is Thomas Dr. My roommate and I wanted to come back to town to enjoy a carnival that was in town, so when we got to the bar, we dropped our girfriends off and agreed we would see them later in the evening. As we were driving north again on Thomas Dr. the first thing I noticed is that the bumper to bumper traffic that was normal for a Friday or Saturday night along Thomas Drive was non-existant. We seemed to be the only ones on the road. No cars passed us and none was behind or in front of us. Being an aviation buff, an air traffic control student at Ft. Rucker and an Air Force \"brat\" I had a habit of watching the sky for anything that moved. I loved locating satelites. But I saw something in the sky that night that I found odd. There was a star, just a pin point in the sky that looked odd. It was bright orange. I had never seen a star that bright or that color before and thought it was odd. Gail and I continued our conversation and drive - but I kept glancing at the odd colored star I had seen and each time I looked at it - it appeared to be larger. I thought my eyes were playing tricks on me, but kept watching, soon it was almost as big around as the moon. So I finally said to Gail, \"Have you been watching that star?\" She asked if I was referring tot eh Orange one. I told her yes, but \"That's not star\"! And we decided to pull to the side of the road and watch it. Still not another car passed us on the road. We don't know how long we watched, but as we huddled together in the front seat of the car(with the doors locked) the thing got bigger and bigger until it seemed to engulf the sky from horizon to horizon. It was the biggest thing I's ever seen. We couldn't tell how close it might be, but it appeared to settle halfway into the Gulf of Mexico so it looked like a huge cake plate cover. We didn't know if it was far enough away that it was hovering over the gulf and what we were seeing was the curvature of the earth - or if it had actually setteled into the gulf. We don't know for sure how long we watched it, but when it was ready to leave, it lifted up from the survace of the gulf and rose into the sky at a very fast rate of speed. No sound, no water dripping off of it, no contrail - just this enormous bright orange ball lifting quickly into the night sky. From the time it started lifting, to the time we could no longer see it might have been 30 - 45 seconds. Still not another car had passed us the entire time we were pulled to the side of the road. Shaking, we pulled back onto the road and continued our travel to Panama City. Neither one of us spoke a word. We dind't know what we had seen, but whatever it was, was not of this earth. We elected not to go to the carnival, but instead chose to go back to the apartment we had rented and turn on the news to see if anyone had reported anything. There was nothing on the news. Later that night we asked our friends if they had heard of anyone seeing anything weird in the sky that night. None had. We continued listening to news broadcasts to find out if anyone had reported anything? Nothing. We considered reporting it - but thought if no one believed us they might think we were emotionally unstable and get kicked out of Air Traffic Control school at Ft. Rucker. So we kept it to ourselves. We talked about it often over the years until sometime in the 80's when I lost touch with Gail. Bur if anyone can find her - I'm betting she'll tell you the same story."],"Date Submitted":"02/28/1974 12:00 UTC","Summary":"Round, bright blourescent orange - bigger than anything I'd ever seen.","City":"Panama City Beach","Object Features":"None","Longitude":"-85.800158","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13753.html.txt","/var/www/straped/mufon/org/13753.html"],"Source":"MUFON","Latitude":"30.181791","map":"<A HREF = \"http://maps.google.com/maps?q=30.181791,+-85.800158(13753)&iwloc=A&hl=en\"> mufon case (13753) map </A>","trends":["There have been 12 other sightings in Panama City Beach","There were no other sightings in Panama City Beach on or around February 28th 1974"],"Date of the Event":"02/28/1974 12:00 UTC","Country":"United States","Tags":"City","Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path"}