{"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-117.862854","Date Submitted":"11/15/2008 12:10 UTC","Region":"California","Sighting Duration":"Undisclosed","Log Number":"US-11172008-0008","City":"Santa Ana","divs":["Sighting DetailsI was standing on my deck having a cigarette at about 12:10 AM. I live by South Coast Plaza and I was facing South looking up at the moon and the constellation of Orion. A plane had just gone by and was fading from sight at about 10,000 feet. Then 3 star like lights flying much higher and faster came flying between Orion and the Moon. At first I thought it was a plane because I could hear them. But When I looked at the wing span, I said to myself, that is too huge to be a plane, it was a vast distance between the 3 lights forming a triangle. Then just as I realized it couldn't possible be a plane, the 3 lights moved together laterally without touching but forming a very tight triangle, while still flying at an incredible speed. They continued in this manner for only 5 or 10 seconds then split apart again into the original formation. This gave me a slight feeling of nausea. It was incredible. At that point I ran to get my fiance to tell her to come look, but when she got out to the deck they were gone. They were heading due South, or slightly South West. John Wayne Airport is nearby our house. I got my camera and waited for about 20 minutes to see if any more would fly by. At 12:20 another normal plane flew by at about 10,000 feet, which reaffirmed the other objects were flying much higher and must have covered great distances in mere seconds in their maneuvers. I couldn't sleep all night, until about 6 AM I nodded off and awoke at 8 AM."],"Country":"United States","files":["/var/www/straped/mufon/html2text/13765.html.txt","/var/www/straped/mufon/org/13765.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.752043,+-117.862854(13765)&iwloc=A&hl=en\"> mufon case (13765) map </A>","Object Features":"Unknown","Summary":"3 craft flying in triangle formation at fast speed executing impossible manuevers.","Latitude":"33.752043","Disposition":"Unknown","Weather Factors":"None","Case Number":"13765","Object Shape":"Star-like","Date of the Event":"11/15/2008 12:10 UTC","trends":["There have been 17 other sightings in Santa Ana","There were no other sightings in Santa Ana on or around November 15th 2008","This sighting has never been favorited.",""],"Source":"MUFON"}