{"Latitude":"42.190025","files":["/var/www/straped/mufon/html2text/13764.html.txt","/var/www/straped/mufon/org/13764.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.190025,+-87.908404(13764)&iwloc=A&hl=en\"> mufon case (13764) map </A>","City":"Lincolnshire","Date Submitted":"11/14/2008 11:34 UTC","divs":["Sighting DetailsI was travelling down the M180 on the 14,11,2008 at 11.30 when i notive on the horizon a cluster of what at first i thought was the 'Plough' star formation'. This at first i accepted but as i was travelling in a northerly direction for 10 miles the objects that made up this formation went from west to east. I pulled over and got out of my car, glancing up at them they were what seemed to be in formation in a sorte' type pattern. They were travelling at the same speed i would sy that a commercial jet would be on a gears down' approach to an airport, They were all the same shape but for a few smaller only slight and all the same colour. There was no sound, no strobe flashing, no smell, at one point i counted 15 in line with more coming at the time that i was talking to my partner on my mobile phone explaining what i was witnessing. I was at the time very calm, not upset or confused at what i saw but in awe at the spectaculsr 'fly past'. When they had past my vehicle i got back inside and looked up again to see the last one had dissapeared. I started travelling on my journey north and could not see them any more."],"trends":["There has been one other sighting in Lincolnshire","There were no other sightings in Lincolnshire on or around November 14th 2008"],"Date of the Event":"11/14/2008 11:34 UTC","Tags":"City","Viewing Distance":"Unknown","Case Number":"13764","Region":"Illinois","Summary":"Solid orange sphere like object","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"GB-11172008-0007","Object Features":"None","Longitude":"-87.908404","Object Shape":"Sphere","Country":"United States"}