{"Object Shape":"Sphere","Date Submitted":"06/10/1997 12:00 UTC","Disposition":"Unknown","Object Features":"None","Log Number":"US-11172008-0019","map":"<A HREF = \"http://maps.google.com/maps?q=34.705144,+-113.611821(13776)&iwloc=A&hl=en\"> mufon case (13776) map </A>","City":"Wikieup","Summary":"6 Orange Spheres with smaller red lights orbiting them","Date of the Event":"06/10/1997 12:00 UTC","Latitude":"34.705144","Longitude":"-113.611821","Source":"MUFON","Region":"Arizona","Weather Factors":"Unknown","Case Number":"13776","Country":"United States","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on the roof of our ranch house 17 miles outside of Wikieup Arizona, wathching these objects in the southern sky. They were very large and we initially thought they were flares, but they would remain stationary,,, drop down behind a ridge approximately 20 miles away and come back to their previous altitude. They had smaller red lights circling them and those smaller lights would go inside the Larger orange lights then come back out and go down to the ground. This went on for about 4 hours. My mother father and some of our friends saw them. A few weeks later my brother in law and his friend and I saw two of them on a mountain top closer to the ranch house. about 4 miles away and we went to investigate them. They were on a mountain called Groom Peak which is south of highway 93 by the Burro Creek bridge. They also were spherical in shape and orange. They also released smaller red lights that were traveling down the side of the mountain and going into the canyons around the base of the mountain,,, they then would go back up to the orange lights and go into them. we drove up to an abandoned ranch house that was about 2 foot ball field away from the lights and they were gone in an instant, no noise, Sometimes during the day we could here a deep rumbling in the distance toward the ridge where we saw the first 6 lights."],"Tags":"City","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/13776.html.txt","/var/www/straped/mufon/org/13776.html"],"trends":["There have been 2 other sightings in Wikieup","There were no other sightings in Wikieup on or around June 10th 1997"]}