{"Log Number":"US-11172008-0014","Object Shape":"Circle","Source":"MUFON","files":["/var/www/straped/mufon/html2text/13771.html.txt","/var/www/straped/mufon/org/13771.html"],"Date Submitted":"10/23/2008 08:50 UTC","Date of the Event":"10/23/2008 08:50 UTC","Country":"United States","Sighting Duration":"Undisclosed","City":"Hamilton","Latitude":"31.707366","divs":["Sighting DetailsI was out on the back patio and at about 8:30pm I saw what initially looked to be \"Giant\" orange spotlights in the sky, Northwest of our home. Three were two sets. One set had 9 horizontal lights and the other had a set of 3 orange lights. The distance between them was not very far and they were brightly lit for about 30 seconds. I called for my wife to come out and see the objects. There were about 20 to 30 separate objects moving in close proximity of the orange lights location. Each of the smaller objects were small, but very bright cone of iridescent green which was readily visible. The \"green cones\" moved up, down, and sideways. the green glow would become bigger and brighter. A few seconds after that, the big orange lights appeared fairly close to where I'd seen them earlier, but it was clear that the big object had moved, and the green cones were all around the orange lights. The big orange lights came on horizontally, one after another until all 9 lights were brightly lit. The second object, with the 3 lights, came on about 20 seconds after the bigger (9) light show was complete, but this time the smaller orange one was a considerable distance away. The green cones split up and some were clearly with each orange object. The bigger orange object was closer to us now and I detected two things I hadn't noticed earlier. The diameter of the orange light was huge and it appeared to have spoke like markings like an old wagon wheel. The other thing I noticed was the glow of orange light on what looked to be metal. My wife and I were convinced that the larger object was a craft of some sort. The entire episode lasted about 20 minutes. The orange lights were repeated about six times. Then everything disappeared as abruptly as they had showed up. We waited another 30 minutes, but nothing else appeared."],"Disposition":"Unknown","Case Number":"13771","Object Features":"Unknown","Tags":"City","Region":"Texas","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=31.707366,+-98.119293(13771)&iwloc=A&hl=en\"> mufon case (13771) map </A>","Summary":"My wife were on our back patio when we saw an object with 9 orange lights and another object with three orange lights and there were ot her objects, about 30 that were moving in the proximity of the orange lights.","Longitude":"-98.119293","Weather Factors":"None","trends":["There have been 8 other sightings in Hamilton","There was one other sighting in Hamilton on or around October 23rd 2008"]}