{"Date Submitted":"10/31/2008 04:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.7633,+-91.568476(13770)&iwloc=A&hl=en\"> mufon case (13770) map </A>","Tags":"City","Case Number":"13770","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","trends":["There has been one other sighting in Houston","There were no other sightings in Houston on or around October 31st 2008"],"Latitude":"43.7633","Date of the Event":"10/31/2008 04:00 UTC","Region":"Minnesota","Longitude":"-91.568476","Weather Factors":"None","Object Shape":"Disc","Disposition":"Unknown","divs":["Sighting DetailsMy wife and 3 children (two our own) were driving west on Hwy 76 on Oct. 31st at 4:00pm, near Houston, MN. (SE MN) When my wife, a ufo skeptic, seen two metallic disk shape craft flying at approx. 100mph to the north. The craft were about 1000 feet in front of the vehicle, and at about 20 feet over the tree tops. A 13 year old in the back seat seen the crafts at about the same time my wife did. He asked my wife, what are those in the sky, and her response was, they must be UFO's that your dad talks about. At that time the other two children seen the crafts. At one point they slowed and hovered over the roadway. My wife said, the bottom part of the disks were silver and reflected sun light and the top part was black with port holes. My youngest stated that the bottom of the both crafts rotated, in a spinning motion. All that seen the crafts agreed that they were about 30 feet across and 8 to 10 feet tall. As my wife approached, where the craft was hovering over the roadway, they began to move. The crafts then vanished out of sight. They did not fly out of sight, they just vanished. (No clouds in the sky) The craft did not make any sound, did not have nay lights and produced no visible trail. People in the van remained calm and interested, and not frightened in anyway."],"Log Number":"US-11172008-0013","Summary":"Silver disk shape.","Object Flight Path":"Path then hovering","Sighting Duration":"00:05:00","Object Features":"Dome, Window(s)","Source":"MUFON","City":"Houston","files":["/var/www/straped/mufon/html2text/13770.html.txt","/var/www/straped/mufon/org/13770.html"]}