{"Object Flight Path":"Path with directional change","Sighting Duration":"00:00:15","City":"Katy","Region":"Texas","Object Shape":"Fireball, Flash","Date Submitted":"11/14/2008 11:45 UTC","Case Number":"13773","Tags":"City","Log Number":"US-11172008-0016","Latitude":"29.793495","Disposition":"IFO","Weather Factors":"None","divs":["Sighting DetailsMy wife and I were driving along I10 west towards katy where we live after having left a concert event downtown. I was driving and she was in the passenger seat sitting back and resting her eyes. At around 11:40 pm I noticed in the distance a light in the sky darting earthward in the area of Bear Creek Park. Initially I thought it was a meteor as the elapsed time I saw it was no longer that about 10 seconds. The object became invisible or should I say no light was emited anymore so I assumed it had flamed out and hit the ground somewhere in the area where I saw it fall. I would add that as it appeared to be large enough to make a definite impact I did slow down to see if from the freeway I could see any smoke or fire from an impact. As I drove by the area where I felt it had fallen I could see no signs of any type of impact. As I passed the Bear Creek park area moving west about 5 minutes later I noticed a bright light flying in the sky. I just kinda appeared out of nowhere. Like the object I had seen before I looked like a comet or meteor what was different however was that the object was moving upward towards the sky at a very fast rate so fast that with in about 15 seconds it just accelerated and disappeared. To emphasize the upward flight of the object was at first level with the ground then arched slightly upward vanishing as it accelerated. The light I saw from the object at both times was a whitish ball and tail with an orange glow emanating from the front part of the front. I believe it may have been the same object I initially saw because it was coming from the area of the park where I had seen the initial object. Once the object vanished the first words can remember saying was what the hell as I was shocked by what i had seen. My wife was not witness to what I saw as she was sleeping and to date I still havent told her what I saw."],"Date of the Event":"11/14/2008 11:45 UTC","Summary":"UFO spotted along I10 west corridor near Bear Creek Park.","Longitude":"-95.820366","Country":"United States","trends":["There have been 21 other sightings in Katy","There were no other sightings in Katy on or around November 14th 2008"],"files":["/var/www/straped/mufon/html2text/13773.html.txt","/var/www/straped/mufon/org/13773.html"],"Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.793495,+-95.820366(13773)&iwloc=A&hl=en\"> mufon case (13773) map </A>"}