{"Object Features":"None","Summary":"Big bright blimp thing in the sky near HWY 59 in Lufkin.","Longitude":"-94.723597","Latitude":"31.341531","trends":["There have been 7 other sightings in Lufkin","There was one other sighting in Lufkin on or around August 15th 2008"],"Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Date Submitted":"08/15/2008 05:00 UTC","divs":["Sighting DetailsOk my cousin has already reported this I know but she started talking about it the other day and told me i should also report it. I haven't thought much about it since it happend tho. I was driving and she was riding with me to Lufkin,I live about 30min west of lufkin and only Come to Lufkin about 1 time a week.They are doing road construction on 59 by walmart so we went down this side road to keep from running in to traffic at 5pm. we were going down a naborhood street that runs next to HWY 59 Going South, I wouldn't have noticed it becasue it was over the tree line and i was watching the road. my cousin noticed it so we pulled over along with a few other cars...The only reaction I remeber having was WOW thats real cool. We watched it for a few min. maby 3min and then it moved off tword our left so We turned down the next road to the left to try to see it again and it was gone. I can't estimate on the size of it or how hi it was. It was not a blimp tho. there was nothing patruding out from it like wings or campartments, It was very smooth and sleek and Bright white.Almost as if it could have been matalic with white light reflecting off of it. It was A very clear day. Blue sky 5pm still very daylight out. it kinda stayed still for a few min then begain to move slowely,but as soon as we turned down the other road wich was probly a block up from where we were it was gone.Never seen it again and haven't thought alot about it since then either.So I hope this report helps in someway Thank You"],"City":"Lufkin","Country":"United States","files":["/var/www/straped/mufon/html2text/13785.html.txt","/var/www/straped/mufon/org/13785.html"],"Disposition":"Unknown","Source":"MUFON","Log Number":"US-11172008-0028","Case Number":"13785","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Blimp","Date of the Event":"08/15/2008 05:00 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=31.341531,+-94.723597(13785)&iwloc=A&hl=en\"> mufon case (13785) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path"}