{"City":"Portland","Case Number":"13788","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around November 15th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.531542,+-122.673167(13788)&iwloc=A&hl=en\"> mufon case (13788) map </A>","Tags":"City","Country":"United States","divs":["Sighting DetailsI was on the back porch of my house (on the second floor) when my room mate and I saw an extremely bright yellow-white flickering light about 30 degrees up from the horizon and toward the south-west of my house. This lasted about 5 seconds and then flickered out until a star-like light remained and traveled toward the west. I thought it was an aircraft turning on and off it's landing lights but it seemed WAY too bright for that. After about 3 minutes the exact same thing happened but the light seemed even more bright causing a halo effect in my eyes. The second time was in a completely different place in the sky and was not moving. My room mate and I became extremely excited and called all of our friends out to look at the light. This light appeared 3 more times and seemed to be progressively dimmer each time. Each time was in a different spot in the sky. There was a total of 5 events. I am a former airman in the military and can say with total certainty that this was not any aircraft type event. The light was way too bright. I also had a feeling that this was a lot further away than it appeared, leading me to believe that it was in space rather than in our atmosphere. I really would like to speak with a MUFON rep and I would also like to know if there were any other witnesses to this event. I have seen things in the sky before that I can not explain but this was such a profound event that I can not just \"brush it off.\""],"Disposition":"Unresolved","Source":"MUFON","Longitude":"-122.673167","Date Submitted":"11/15/2008 09:13 UTC","Object Flight Path":"Undisclosed","Date of the Event":"11/15/2008 09:13 UTC","Log Number":"US-11182008-0003","Summary":"Extremely bright repeating flickering light. 5 seperate occasions.","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Oregon","Latitude":"45.531542","files":["/var/www/straped/mufon/html2text/13788.html.txt","/var/www/straped/mufon/org/13788.html"],"Object Features":"Undisclosed","Object Shape":"Star-like"}