{"Viewing Distance":"501 Feet - 1 Mile","Log Number":"NL-11172008-0025","Weather Factors":"None, Does Not Apply","Longitude":"5.978041","Date Submitted":"08/31/1999 10:00 UTC","trends":["There have been no other sightings in Gennep","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Summary":"Lights in sky moving around each other. One light moved away and approached an aircraft. Lights joined together and left as military aircraft approached.","Object Features":"Unknown","Date of the Event":"08/31/1999 10:00 UTC","files":["/var/www/straped/mufon/html2text/13782.html.txt","/var/www/straped/mufon/org/13782.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.695511,+5.978041(13782)&iwloc=A&hl=en\"> mufon case (13782) map </A>","Object Shape":"Star-like","Disposition":"Unresolved","Tags":"City","Latitude":"51.695511","City":"Gennep","Region":"Limburg","divs":["Sighting DetailsWhilst living and working in The Netherlands me and three friends were off to a friends house in the near by town of Gennep. We were cycling through a forested area (two bikes, one person riding the other on the back) when I noticed what looked like a star moving quite quickly across the sky. I first thought it was a satellite but it stopped suddenly and then changed direction. I pointed it out to my friends and we stopped cycling and watched it for a couple of minutes. As we watched we noticed, what had first looked like two stars, move in the same fashion as the other one. Fast movement with sudden changes in direction. The three lights seemed to move around each other. As we watched and wondered what they were the noise of a commercial aeroplane became apparent and we watched as the planes lights (the flashing lights on its wings) came into view. One of the lights then left the other two and circled around the plane and as the plane moved out of sight the light returned to the other two. At this point my friends and I were starting to get a bit excited, as you can imagine it's not everyday you see something like this. After about 35-40 min we decided to head off toward town, we then herd another noise. The noise was so loud we ducked and covered our ears as 5 military jets shot over our heads at a staggeringly low altitude heading toward the three lights. As they drew closer and started to gain altitude the three light seem to join together and streaked across the sky and upward leaving the military jets as if they were standing still. Unfortunately it was about nine years ago we all saw this so I'm not sure of the date, all I know it was in the autumn of 1999."],"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"The Netherlands","Case Number":"13782"}