{"Tags":"City","City":"Oceanside","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsNot that it probably makes any difference now, but here it goes: I was about 18 yrs. old at the time living in southern California in 1977. It was trash night, and the subdivision we lived in was not very brightly lit, so on a clear night, you could see the stars very clearly in the sky, as it was this night. As I was hauling the first trash can to the curb, I noticed in the sky a V-shaped pattern of lights all moving in my direction very slowly about 2 miles from me. I remember a patteen of about 7-9 lights in a flat, wide, V-shaped boomerang configuration, that were orange-red in hue, but did not throw a beam like the headlights of a car. Instead, they were subdued, like dim reddish flourescent lights. The lights retained a fixed distance of separation relative to each other. The group appeared to be about 2000-3000 feet off the ground and were slowly approaching my direction. After staring at this for a minute or so, it was now about a mile away. Originally, I dismissed the issue as a group of helicopters flying in formation at night, on the way from, or back to Camp Pendleton marine base in Oceanside, CA. I walked back to the house to get another trash can. With the second trash can to the curb now, the formation was directly over my head, still at the same elevation, and the lights were still moving in the same direction in absolute perfect silence. Not a single sound. It was then that I realized these were not planes, helicopters, or balloons because now I could just barely see the outline of the large V-shaped craft that the lights appeared to be attached to. It was just a silhouette against the backdrop of normal stars in the sky. It was the lack of visible stars that I could make out its outline as it moved across the sky. No other lights, markings, openings, protrusions, or anything else on the underside of this V-shaped craft. It size was about 500-700 feet across and 200-300 feet front to back as I could judge given its altitude. I stood there for a second then immediately ran to the house in a panic, suspecting it was a UFO, and hoping this thing did not see me underneath it and come after me. A few minutes later, I looked outside again to see that it had passed overhead and was still there, but heading away already a mile or so away. Again, I asserted to myself that this must be some military craft, and soon forgot about it. Fast forward to 2008, I now see the exact UFO being shown on some of the Discovery and History channel shows recently. Again, this story likely has little significance now at this late date other than a timeline for how long this type of craft has been spotted."],"Source":"MUFON","Date of the Event":"07/15/1977 10:00 UTC","Country":"United States","Sighting Duration":"00:15:00","Date Submitted":"07/15/1977 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.19694,+-117.376373(13791)&iwloc=A&hl=en\"> mufon case (13791) map </A>","files":["/var/www/straped/mufon/html2text/13791.html.txt","/var/www/straped/mufon/org/13791.html"],"Longitude":"-117.376373","Log Number":"US-11182008-0006","Case Number":"13791","Region":"California","Latitude":"33.19694","Disposition":"Unknown","Weather Factors":"None","Summary":"Seen exact UFO in 1977 as shown on TV shows now.","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around July 15th 1977"],"Object Features":"None","Object Flight Path":"Straight-line path","Object Shape":"Boomerang, Chevron, Triangle"}