{"Weather Factors":"None","Longitude":"-74.821575","Country":"United States","Latitude":"40.16445","Object Features":"None","City":"Levittown","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around March 31st 2008"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.16445,+-74.821575(13792)&iwloc=A&hl=en\"> mufon case (13792) map </A>","files":["/var/www/straped/mufon/html2text/13792.html.txt","/var/www/straped/mufon/org/13792.html"],"divs":["Sighting DetailsI was at work and you have to go outside to have a cigarette so I did. I was standing at the door of our office which is connected to the convent and a man waved to me to come over to him at the school. I walked about 40 feet and he asked me to look up into the sky. I did and at first I thought it was clouds but then I thought they were birds in some type of formation. But these objects were*- big and beautiful and pure white. There were absolutely no distinct marks at all. They were moving extremely fast and they appeared really far away. We watched them for about 30 seconds and then they just disappeared. The man and I looked at each other and I said to him \"that was really weird.\" He shoot his head and we parted ways. I went back to work and never gave it another thought. Until I read an article today in the Bucks County Courier Times. I could not believe someone else saw the same thing. That's why I am contacting you now. I don't remeber the exact day or month, I know it was April or early May because I stopped smoking on Mother's Day and haven't smoked since. Also the day was beautiful with a clear blue sky and long small clouds. I remember the clouds because at first I thought the objects in the sky were clouds because they were so white. I would have never thought UFO's but now that someone else saw what we did it definitely was something I would like explained. It was the strangest and weirdest thing I ever witnessed for all of 30 or 40 seconds. I remember it like it was yesterday and could still point out where they were in the sky. It was like they were flying with a mission and heading West."],"Disposition":"Unknown","Summary":"Smoking a cigarette outside near school and a gentleman called me over to school and asked me to look up in the sky. At first I thought it might be birds flying in some type of formation. But they were pure white. They were also moving extremely fast.","Tags":"City","Region":"Pennsylvania","Case Number":"13792","Date Submitted":"03/31/2008 12:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"03/31/2008 12:00 UTC","Log Number":"US-11182008-0007","Object Shape":"Other","Source":"MUFON"}