{"Longitude":"-87.850112","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Orland Park","There were no other sightings in Orland Park on or around October 20th 2004"],"Log Number":"US-11182008-0017","Date Submitted":"10/20/2004 05:00 UTC","Date of the Event":"10/20/2004 05:00 UTC","Summary":"I headed West from Tinley and watched these lights manuever 4-6 in ridiculous unexplainable patterns in the sky t=","Object Flight Path":"Path with directional change","Case Number":"13802","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.63482,+-87.850112(13802)&iwloc=A&hl=en\"> mufon case (13802) map </A>","Country":"United States","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/13802.html.txt","/var/www/straped/mufon/org/13802.html"],"Latitude":"41.63482","divs":["Sighting DetailsI dropped my fiance off at chilis on Harlem and headed west on 151st street at 4-5pm in the evening. In the course of driving straight ahead I noticed these glowing lights in the West do incredible patterns and I couldnt believe what I was seeing. I stopped in the orland park mall parking lot got out watched for a min while the objects continued west I decided after calling my mom and telling her extacticly that I want pictures no one is going to believe me. I jumped in my car raced to domicks for a throw away camera got in bought it ran out and the objects were disappearing in the west and I drove as far west as I could till the street ended at the same time the objects disappeared. the patterns were amazing. If someone could contact me and let me know what I saw or if anyone else saw this I would like to know what it was or anything. Although Im not sure exactly of the date but I maybe able to narrow it down because my daughter was not born and my fiance was working still at chillis we were only together for 6-8 months so with some thought we maybe to narrow down to a month. Somebody contact me by email or whatever let me know what I saw it was broad day light out!!!"],"Object Features":"Unknown","Source":"MUFON","City":"Orland Park","Tags":"City","Sighting Duration":"00:25:00","Disposition":"Unresolved","Region":"Illinois"}