{"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Object Features":"Unknown","divs":["Sighting DetailsMy daughter and I were traveling north on Lazy Bend toward Brock in SW Parker Co., right about 7 pm. It was dark, I noticed two flashing white lights directly ahead, what caught my attention was the great distance apart they were and they were blinking one, then the other, then a pause. Then one then the other. In a sequence. It appeared to be fairly low, about where a small plane would fly. The distance between the lights was much too great to be any kind of plane. It didn't appear to move at the time, I pointed it out to my daughter and she too commented on the size. We pulled over to get a better look, it suddenly was moving to the west. We tried to keep it in sight but it moved very quickly to the west and out of sight, probably within 15-20 seconds once it started moving. The two lights stayed a steady distance apart and once it moved to the west, the lights were blinking in unison, two quick flashes then a pause. They had to be part of the same object as they traveled at exactly the same rate at a steady distance apart. I didn't see it long enough to be able to tell whether there was any type of structure, but the two lights were obviously connected by something. There were many planes in the sky at the same time, this was definitely not a plane."],"Latitude":"32.676243","Longitude":"-97.940872","Disposition":"Unknown","Date Submitted":"11/18/2008 07:00 UTC","City":"Brock","Source":"MUFON","Tags":"City","Weather Factors":"None","Log Number":"US-11182008-0018","Country":"United States","Object Shape":"Boomerang, Flash, Other, Unknown","Case Number":"13803","trends":["There have been no other sightings in Brock","This sighting has never been favorited."],"Sighting Duration":"00:01:00","Date of the Event":"11/18/2008 07:00 UTC","Region":"Texas","Summary":"Very large object, two lights blinking in unison very far apart moving over SW Parker Co.","map":"<A HREF = \"http://maps.google.com/maps?q=32.676243,+-97.940872(13803)&iwloc=A&hl=en\"> mufon case (13803) map </A>","files":["/var/www/straped/mufon/html2text/13803.html.txt","/var/www/straped/mufon/org/13803.html"]}