{"Log Number":"US-11182008-0020","Region":"Texas","Viewing Distance":"Unknown","Date Submitted":"11/18/2008 06:59 UTC","Tags":"City","Latitude":"32.225156","Object Flight Path":"Undisclosed","Date of the Event":"11/18/2008 06:59 UTC","Summary":"Spotted south of Stephenville,bright white lights spaced evenly,could have been a mile long.","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.225156,+-98.192983(13805)&iwloc=A&hl=en\"> mufon case (13805) map </A>","trends":["There have been 74 other sightings in Stephenville","There were 5 other sightings in Stephenville on or around November 18th 2008"],"Sighting Duration":"Undisclosed","Longitude":"-98.192983","files":["/var/www/straped/mufon/html2text/13805.html.txt","/var/www/straped/mufon/org/13805.html"],"Case Number":"13805","Disposition":"Unknown","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI was traveling on the loop in Stephenville heading south toward hwy 377, when I spotted an object to the south of the city with a row of four bright white lights spaced apart in a row. These lights blinked off, then four more lights appeared in the same configuration immediately to the left of the original lights . They blinked off ,then all eight lights came on .These were very bright. At that point I could see the whole configuration was moving in an easterly direction. then all of the lights disappeared. I would guess that the object could have been a mile long. I was talking to a friend on the cell phone when he spotted the same object from a different vantage point in the city. About a month ago I spotted a different type of UFO kind of in the same area but looked totally different. this one looked like a bright neon orange ball then it replicated itself immediately into two spheres the same size as the original then it disappeared just as quickly as it appeared Many people in the area have seen this one. The object I saw tonight really freaked me out as I could see the whole configuration moving as an object.This confirmed to me that it wasn\"t an illusion.The way the lights popped on and off was really like science fiction, The craft appeared to be about 1000-2000 feet off the ground and was traveling at a moderate speed. Was really hard to tell because of the size of the craft."],"Weather Factors":"None","City":"Stephenville","Object Shape":"Blimp, Disc"}