{"Country":"United States","trends":["There have been 3 other sightings in Knob Noster","There were no other sightings in Knob Noster on or around November 18th 2008"],"Disposition":"Unknown","Log Number":"US-11182008-0016","City":"Knob Noster","Summary":"Triangle followed by 2 jet aircraft","Date Submitted":"11/18/2008 08:20 UTC","Latitude":"38.76668","files":["/var/www/straped/mufon/html2text/13801.html.txt","/var/www/straped/mufon/org/13801.html"],"Object Shape":"Triangle","Region":"Missouri","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.76668,+-93.558546(13801)&iwloc=A&hl=en\"> mufon case (13801) map </A>","Date of the Event":"11/18/2008 08:20 UTC","Case Number":"13801","Longitude":"-93.558546","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","divs":["Sighting DetailsI live in the country, no streetlights. I was at the end of our driveway away from the porch light taking the trash to the road. I noticed the triangle with lights on the corners and heard a faint jet engine far away, I saw 2 other lights I thought were airliners at a higher altitude. As I watched the triangle it was moving North, I thought it was making the noise. I cant guess the altitude but it was high, about 35 degrees above the horizon. It continued north for about 30 seconds after I noticed it and then turned East, at that point the 2 \"airliners\" turned to follow it and I realised they were much closer than I thought and much smaller than the triangle. It seemed to be their engines I heard. I dont know if the triangle made noise or not, it seemed to be pretty far away. It turned East and either the lights went out, or werent visible anymore I didnt see it again. The 2 jets (maybe military?) turned East to follow the triangle and continued East. They didnt change course as I went back to the house and finally couldnt see them for the trees around my house."],"Source":"MUFON"}