{"Viewing Distance":"101-500 Feet","Object Features":"Unknown","Source":"MUFON","Latitude":"39.960995","Date Submitted":"11/18/2008 06:00 UTC","Case Number":"13809","files":["/var/www/straped/mufon/html2text/13809.html.txt","/var/www/straped/mufon/org/13809.html"],"trends":["There have been 216 other sightings in Philadelphia","There were 3 other sightings in Philadelphia on or around November 18th 2008"],"Disposition":"Unknown","Country":"United States","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Summary":"I saw two identical UFOs this evening about 45 miles apart.","Tags":"City","Longitude":"-75.155739","Date of the Event":"11/18/2008 06:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Straight-line path","City":"Philadelphia","map":"<A HREF = \"http://maps.google.com/maps?q=39.960995,+-75.155739(13809)&iwloc=A&hl=en\"> mufon case (13809) map </A>","Log Number":"US-11182008-0024","Object Shape":"Triangle, Other","divs":["Sighting DetailsI saw a UFO twice today, in two different locations. I have seen the same aircraft 7 times now in the last month. I am a well-educated woman in her 20's who is not crazy, but I can't explain what they are. The aircraft is shaped like a trapezoid (although it may be a triangle- I only see it at night), and has two extremely bright \"headlights.\" On the two corners that stick out most there are lights. One has a red light, and the other has a green light. The colored lights lead me to believe that it is man-made, but I'm not aware of any aircraft like it. It doesn't have wings like an airplane, and it doesn't fly like an airplane. It hovers over an area, very low. I frequently see them when I drive west on the PA turnpike Tuesday evenings. I drive from the Willow Grove exit to the Downingtown exit. Tonight I saw the UFO at 6pm in Southampton, PA when I was driving. Then I saw it again (or another one) 1 mile from the Downingtown exit of the turnpike while I was driving. That one turned all of its lights off a few times, plunging it into darkness. I thought that was odd. Last week my husband was in the car with me and saw it, too. He didn't know what it was either. I didn't think it was safe to pull over to get a better look, so I kept driving and eventually lost sight of them due to trees, since they were flying low."]}