{"Date of the Event":"11/18/2008 07:00 UTC","files":["/var/www/straped/mufon/html2text/13804.html.txt","/var/www/straped/mufon/org/13804.html"],"Latitude":"32.222906","Log Number":"US-11182008-0019","Longitude":"-98.194023","Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","City":"Stephenville","Object Flight Path":"Stationary","trends":["There have been 74 other sightings in Stephenville","There were 5 other sightings in Stephenville on or around November 18th 2008"],"Viewing Distance":"Over One Mile","Region":"Texas","Object Shape":"Circle","Date Submitted":"11/18/2008 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.222906,+-98.194023(13804)&iwloc=A&hl=en\"> mufon case (13804) map </A>","Disposition":"Unknown","Sighting Duration":"00:00:05","Case Number":"13804","divs":["sighting detailson 11\\18\\08 at about 1900 hours, i was standing in the front yard of a residence on clifton street in stephenville texas. i was standing with two other people. one of the people pointed to an object in the night sky. i looked towards the southwest and observed a circular shaped object that was displaying lights in a circular pattern. the object appeared to be just outside the city limits towards the southwest of town. it appeared to be approximately 1000 feet in altitude. if you imagine a wall clock laying flat on a table. the lights started lighting up at the 12 o'clock position and cycled counter clockwise to the 6 o'clock position. the lights went out and then began on the opposite side at the 12 o'clock position and cycled clockwise to the 6 o'clock position. the lights formed a perfect circular shape. another person i was standing with said a light appeared on top of the craft prior to the lights forming in a circular pattern. i am currently in the law enforcement field and have prior military experience. the lights i observed did not resemble any type of aircraft or flare i have ever seen."],"Summary":"I observed a circular shaped object in the night sky that displayed lights in a circular pattern.","Country":"United States","Source":"MUFON"}