{"Weather Factors":"None","Object Shape":"Other","Date Submitted":"11/18/2008 07:00 UTC","Log Number":"US-11192008-0002","divs":["sighting detailsmy wife and i were driving west on the south loop in stephenville ,texas at 7 pm cst tonight 11\\18\\08. i first thought it was a b-52 only 1,000 feet away sse. i discussed the event tonight with a recently retired high ranking military commander that confirmed it was not military flares as was told to me by a sherrif's deputy immediately after tonights sighting . it was for real , i am 63 years old and have never seen anything resembling this. we saw 4 bright round lights in a straight horizontal line and then 4 more appeared to the west with a skipped space in between. the left lights went off and then came immediately back on with one new light above the west lights. then total darkness. no sound. could have been 300 yards to a mile in width. could not determine exact distance away. time elaspe 10 seconds. no time for camera. looked at one time exactly like phonix lights. a friend located about 1 mile to the nw and i were talking on cell and he saw the same lights. three other people i talked to saw the same occurance. i was very excited and could not accuretly spell words on my computer when i returned home ."],"Summary":"4 bright lights in straight line then 4 more in same straight line . Very bright and went off and on for 10 seconds.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 74 other sightings in Stephenville","There were 5 other sightings in Stephenville on or around November 18th 2008"],"Longitude":"-98.195583","Date of the Event":"11/18/2008 07:00 UTC","Source":"MUFON","Latitude":"32.228466","Object Flight Path":"Stationary","Region":"Texas","Disposition":"Unknown","Case Number":"13811","Country":"United States","City":"Stephenville","Tags":"City","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13811.html.txt","/var/www/straped/mufon/org/13811.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.228466,+-98.195583(13811)&iwloc=A&hl=en\"> mufon case (13811) map </A>"}