{"Case Number":"13815","map":"<A HREF = \"http://maps.google.com/maps?q=33.094704,+-97.287259(13815)&iwloc=A&hl=en\"> mufon case (13815) map </A>","Summary":"Heard a loud huming noise outside my bedroom window , pulled blinds and it was above back of neighbors house","Date Submitted":"10/12/2008 01:00 UTC","Object Flight Path":"Stationary","divs":["Sighting DetailsI woke up to the sound of a cycling humming noise. Looked out my bedroom window and saw what looked to be a group of lights circling a oval shaped object back to the southwest of my house. Appeared to be less than 100 feet from the ground. The various number of lights circled the oval shaped unknown craft. There where more than 10 lights that I could see moving in a counter clockwise motion. It only lasted a few minutes, as I was froze in a fixed stare, as I was petrified and could not move. My heart was racing and I ran into the other end of the house to tell my mom and dad. I was shaking like a leaf when I got to my mothers bedside. She got up and put her robe on and came to my bedroom and the craft was gone. My mom asked me if I could be dreaming. Definately not, I had just turned off the TV around 12:00 midnight and that is when I heard the loud humming sound, making a pulsing type sound. That is what made me get out of bed to see where the noise was coming from. That is when I saw the circling lights. I can send you a drawing of the craft if you would like for me to. Thank you. Kayla Caldwell"],"Disposition":"Unknown","Object Features":"None","Log Number":"US-11192008-0006","files":["/var/www/straped/mufon/html2text/13815.html.txt","/var/www/straped/mufon/org/13815.html"],"Date of the Event":"10/12/2008 01:00 UTC","Tags":"City","trends":["There have been 5 other sightings in Justin","There were no other sightings in Justin on or around October 12th 2008"],"Longitude":"-97.287259","Sighting Duration":"00:03:00","Region":"Texas","Weather Factors":"None","City":"Justin","Latitude":"33.094704","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Object Shape":"Oval"}