{"files":["/var/www/straped/mufon/html2text/13819.html.txt","/var/www/straped/mufon/org/13819.html"],"Region":"Texas","Sighting Duration":"00:05:00","Log Number":"US-11192008-0010","Weather Factors":"Unknown","Case Number":"13819","Latitude":"32.702764","divs":["Sighting DetailsIn SW Parker County, about 8 miles southwest of the Joint Reserve Base (Formerly Carswell AFB), I was doing yard work. It was overcast and I happened to look up and at about the 2 o'clock position East I saw a pinkish glow moving perfectly horizontal; stopping; moving again; and, then accelerating at an impossible speed (as if it almost just disappeared) to the north. I could not see the object itself, just the glowing outline within the clouds as if a very large, bright oval object was there. It appeared to be much larger than any aircraft; made no sound; stayed on a horizontal plane from south to north. I have never seen anything like this in my life and have reserved judgment on the existence of UFO's, but this went a long ways to making me a believer. It put me in a mild state of shock that I had witnessed this and wished my husband had been here to experience this. We live in the country under the flight path of helicopters, jets, airliners and other aircraft and see (and hear) those every day. This was definitely not any aircraft I am aware of in size, shape, movement or sound. Wow!"],"Date of the Event":"11/14/2008 07:15 UTC","Country":"United States","Summary":"Pinkish oval shape in clouds moving horizontally over SW Parker County, Texas","Date Submitted":"11/14/2008 07:15 UTC","Longitude":"-97.593577","City":"Aledo","trends":["There have been 4 other sightings in Aledo","There were no other sightings in Aledo on or around November 14th 2008"],"Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=32.702764,+-97.593577(13819)&iwloc=A&hl=en\"> mufon case (13819) map </A>","Object Features":"None","Object Flight Path":"Straight-line path,Path then hovering","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City"}