{"Country":"United States","Viewing Distance":"Unknown","Summary":"Bright white sphere with a smaller sphere circling it","Date Submitted":"11/17/2008 04:22 UTC","divs":["Sighting DetailsMy husband & I just got done splitting and stacking our firewood and looked up to see a bright object. It was about 75 degrees up to the south and east. There were some clouds and jet trails lingering. I ran inside to get my camera to take some pictures, (I have a video camera but all of my tapes are full)my husband got his binoculars. It seemed to be staying in the same spot. I took a few pictures then came inside to look on the computer to make sure it wasn't a sattelite or a planet, there were none in that area, there was Venus and Jupiter way to the South but they were still not visible to us. I grabbed my telephoto lense (3x)and put it on the camera to take more photos. The object had moved towards the North West and was straight obove our heads. Just about then (about 5-10 mins after we first saw it) the kids came home and we had them look also, I had my son bring out the telescope and sight it in. Looking at it in the telescope it looked like a large bright bubble and we could see a smaller sphere cicling it, what I saw looked like it was slowly swinging back and forth and what my son saw (he was looking at it longer) was that it was going around the larger object in a random erractic way. We couldn't see if it was attached by anything. The sphere started moving faster to the North and we could hardly keep it in the telescope sight. My son took the telescope to the backside of the house to try to keep an eye on it longer. I called my sister, and reached her husband, to see if she could see it from the next town over, they could not see anything but clouds. While I was talking to him the object went dim though I could still see it. My son lost sight of it. One of the clouds moved over it and at first I could still see it but then lost it as the cloud got thicker. We couldn't find it after that. I did get one picture that shows the smaller object. I am including that photo and the same one cropped and enlarged."],"Longitude":"-122.485667","Tags":"City","trends":["There have been 7 other sightings in Prospect","There were no other sightings in Prospect on or around November 17th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","Case Number":"13814","City":"Prospect","Log Number":"US-11192008-0005","Object Shape":"Sphere, Star-like","files":["/var/www/straped/mufon/html2text/13814.html.txt","/var/www/straped/mufon/more/13814_submitter_file1__111708140.jpg","/var/www/straped/mufon/more/13814_submitter_file2__111708140crop.jpg","/var/www/straped/mufon/org/13814.html"],"Date of the Event":"11/17/2008 04:22 UTC","Region":"Oregon","Source":"MUFON","Object Features":"Appendage(s), Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.757515,+-122.485667(13814)&iwloc=A&hl=en\"> mufon case (13814) map </A>","Weather Factors":"None","Latitude":"42.757515","Disposition":"Unknown"}