{"Object Features":"Unknown","Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/13816.html.txt","/var/www/straped/mufon/org/13816.html"],"Tags":"City","Source":"MUFON","divs":["sighting detailsmy daughter and i were in the backyard on our porch watching airplane comtrails off to the west\\southwest. i happened to look up at the sky to the east and saw a bright flashing object quite high in the sky. at first i thought it looked like a metallic object reflecting the sun. i mentioned to my daughter that it was kind of early for the stars\\planets to be out so soon and so brightly. she saw it and said it was strobing and she saw colors - white, blue and red. i then looked back over to the western\\southwestern sky and could just barely begin to make out the two brightest lights at dusk, jupiter and venus. we stood out there for about 20 minutes and i continued to watch both the strobing light and the planets. as the planets became brighter in intensity, the strobing light became fainter until at just about sundown, the strobing light completely disappeared, and the usual planets and stars became brighter. i didn't think stars\\planets did that, fading away in the early evening sky. for the next several days, i went back out to the deck and stood in the exact same place at the exact same time frame and i still have not seen that object return."],"Sighting Duration":"00:20:00","Latitude":"39.733852","Log Number":"US-11192008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=39.733852,+-104.82858(13816)&iwloc=A&hl=en\"> mufon case (13816) map </A>","City":"Aurora","Viewing Distance":"Over One Mile","Region":"Colorado","Object Flight Path":"Stationary","Longitude":"-104.82858","Weather Factors":"None","Date of the Event":"11/12/2008 04:30 UTC","Case Number":"13816","Summary":"Flashing object in sky disappeared at sundown.","Object Shape":"Star-like","trends":["There have been 48 other sightings in Aurora","There was one other sighting in Aurora on or around November 12th 2008"],"Date Submitted":"11/12/2008 04:30 UTC"}