{"Date Submitted":"11/18/2008 05:55 UTC","City":"Brookhaven","Object Features":"Undisclosed","Longitude":"-90.433391","Sighting Duration":"Undisclosed","Latitude":"31.588959","Summary":"LIKE A BRIGHT VERY INTENSE WHITE STAR CRUISING THE SKY","Object Flight Path":"Undisclosed","Disposition":"Unknown","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI WAS WALKING FROM THE BACK PORCH OF MY HOUSE TO THE POOL HOUSE TO GET SOMETHING FROM OUR FREEZER OUT THERE. WHEN IN THE CORNER OF MY EYE I FIRST NOTICED THE BRIGHT OBJECT. IT TOOK A FEW SECONDS TO REALIZE IT WAS NOT A STAR OR PLANETARY OBJECT. IT WAS SLOWLY WITHOUT ANY NOISE WHATSOEVER, GRACEFULLY MOVING FROM THE SOUTHEAST TOWARD THE NORTHEAST. I ALSO LOOKED IMMEDIATELY TO THE SOTUHWEST WHERE I KNEW THAT JUPITER AND VENUS WERE VISIBLE IN THE NIGHT SKY. THEN BACK TO THE OBJECT AS IT WAS CONTINUING ON IT'S PATH TO THE NORTHEAST. IT WAS AT AN ALTITUDE OF ABOUT 1500 TO 2000 FEET BEST GUESS. STAR LIKE IN APPEARANCE WITH VERY VERY BRIGHT AND VERY WHITE LIGHT. HIGHLY INTENSE LIGHT NOT LIKE A LIGHT BULB BUT MORE INTENSE CELANER WHITE LIGHT. LOCATION IS ABOUT LAT. 31DEG31MIN AND LONG. -90DEG15MIN. WHERE SIGHTING OCCURRED. I WATCH AIRPLANES ALL THE TIME AND THIS WAS NOT ONE OF THEM. THERE WERE NO AIRCRAFT FLASHING BEACONS ON THIS OBJECT. I CALLED FOR MY DAUGHTER TO BRING ME THE CAMERA SO I COULD POSSIBLY SNAP A PICTURE OF OBJECT AS IT HEADED AWAY. JUST AS I HAD FOCUSED THE OBJECT IN THE VEIWER IT CUT OUT THE LIGHT AS IF IT KNEW I WAS GOING TO PHOTOGRAPH IT. THIS WAS PROBABLY AN COINCIDENCE BUT STRANGE NONETHELESS. I COULD STILL MAKE OUT THE OBJECT AFTER THIS HAPPENED BARELY AND THEN BAM! IT JUST DISAPPEARED AT AROUND 5:59PM CST. TIME OF SIGHTING WAS 5:55PM CST AS I LOOKED MY WATCH WHEN I FIRST SAW OBJECT."],"trends":["There have been 3 other sightings in Brookhaven","There were no other sightings in Brookhaven on or around November 18th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.588959,+-90.433391(13817)&iwloc=A&hl=en\"> mufon case (13817) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13817.html.txt","/var/www/straped/mufon/org/13817.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Region":"Mississippi","Log Number":"US-11192008-0008","Date of the Event":"11/18/2008 05:55 UTC","Tags":"City","Case Number":"13817"}