{"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=28.812827,+-97.000198(13820)&iwloc=A&hl=en\"> mufon case (13820) map </A>","Latitude":"28.812827","divs":["Sighting DetailsTime: 9:10p.m. Place: Victoria, Texas Area: Burroughville Rd., FM 2615, Wischkaemper Rd. Conditions: After dusk. Sky moderately cloudy, clear, Full moon, no visibility hinderances. Description: At about 9:10p.m. I was driving down Burroughsville Road when I noticed a bright object sitting stationary in the southern sky. The sky was clear and all that could be seen was a bright full moon and this object, no stars were present at the time. I then stopped my car on the side of the road to get a better look at the object. I rolled down my window to get a clear view out of the passenger side door when the object began to move in an easterly direction. I observed the object for about a minute, then it stopped. The object stayed stationary for about another minute and then began moving again in upward motion. The object stopped and then after a few seconds, began moving easterly again. I started my car and then drove onwards down the road while making sure to keep an eye on the object as I drove. There were no other visible objects in the sky other than the moon. As I headed home, which was in a southeastern direction, the object continued to move with the same erratic flight pattern, periodically stopping and then moving once again. I arrived at home and still saw the object off to the southeastern sky. I called my mother and brother to come look at the object, which at that time was stationary. The time was about 9:18. We observed the object for approximately 10 more minutes. From the time that I entered my house to inform my mother and brother, to the time that we returned outside, the object stayed in the same place. The object then began to move after several minutes, and then began to move erratically once again. The object moved upwards in altitude, and then would stop and move downwards and then towards the East. I had brought out a pair of binoculars to get a better view of the object, and from what I could tell, it was shaped like an elongated circle which had lights going down the middle of its center going lengthwise. The object continued to move towards the East and then stopped again. It then ascended upwards and was gone from view. I am absolutely sure that this object was neither an airplane nor a helicopter. The object was able to hover and move in all directions unlike an airplane and it was at much too high of an altitude to be a helicopter. No other objects or celestial phenomenon were present in the sky at the time other than the moon. I have no other explanation for the object other than to say that it was a UFO."],"Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13820.html.txt","/var/www/straped/mufon/org/13820.html"],"Longitude":"-97.000198","Date of the Event":"07/14/2008 09:10 UTC","City":"Victoria","Case Number":"13820","Source":"MUFON","trends":["There have been 8 other sightings in Victoria","There were no other sightings in Victoria on or around July 14th 2008"],"Region":"Texas","Summary":"Elongated Circle (oval) with numerous lights running down the middle.","Object Features":"Undisclosed","Date Submitted":"07/14/2008 09:10 UTC","Log Number":"US-11192008-0011","Object Shape":"Oval"}