{"Source":"MUFON","trends":["There have been 38 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around July 15th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsClear sunny day in St. Petersburg, Russia. Observed small dark object above cloud at about 30 degree elevation. Suspected it was a helicopter. No sound. Estimated distance: 5 - 40 miles away. Observed several (6-12) smaller dark objects above the main object. Appeared like black toy balloons with no formation. I photographed at 3x optical with Canon S-80 camera. See ufoA.jpg. See small dot above central cloud and many spheres above it. The objects moved as a group to my right about 10 degrees into a cloud. I snapped a second picture which shows the larger object in greater detail upon enlargement as a weird shape but still unrecognizable. The larger object is visible inside the small cloud and a few of the smaller spheres also are visible both inside and outside the cloud. See ufoB.jpg. Time between photos is about 1 minute or less. Upon enlargement, the spheres resolve to a bright center surrounded by a darker circumference. I verified the visual sighting with another person sitting beside me. The two pictures demonstrate that these objects are real and not lens dust. Extreme computer enlargement is necessary to see these objects. An even larger faint black halo also extends way outside some of these objects, perhaps an artifact of the CCD and not a real effect. These objects are similar to photos displayed by Jaimie Massoun (sp?) of SA sightings. Does anyone know what these objects are? Domestic or alien? Possible weather balloons?"],"Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Sphere, Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=60.076238,+30.121383(13822)&iwloc=A&hl=en\"> mufon case (13822) map </A>","Object Features":"Undisclosed","Date Submitted":"07/15/2008 12:00 UTC","Sighting Duration":"00:02:00","Case Number":"13822","Region":"","Object Flight Path":"Undisclosed","Latitude":"60.076238","files":["/var/www/straped/mufon/html2text/13822.html.txt","/var/www/straped/mufon/more/13822_submitter_file1__ufoA.jpg","/var/www/straped/mufon/more/13822_submitter_file2__ufoB.jpg","/var/www/straped/mufon/org/13822.html"],"Date of the Event":"07/15/2008 12:00 UTC","Tags":"City","Log Number":"RU-11192008-0013","City":"St Petersburg","Summary":"Observed several unknown objects 5-20 mi. away","Longitude":"30.121383","Country":"Russian Federation"}