{"Object Shape":"Oval","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/13826.html.txt","/var/www/straped/mufon/org/13826.html"],"Date of the Event":"11/19/2008 06:20 UTC","Disposition":"Hoax","Log Number":"US-11192008-0017","Latitude":"33.427865","map":"<A HREF = \"http://maps.google.com/maps?q=33.427865,+-94.039158(13826)&iwloc=A&hl=en\"> mufon case (13826) map </A>","divs":["sighting detailsi stepped out at about 6:00 p.m. on today and was smoking a cigarette on my patio ,when my cat starting acting a little strange,alot of meowing(hardly does it).i started playing the with the cat when i notice something really ,bright in my perpherial vision(i was kinda bent over).ilooked up and saw this large bright ,white object moving at a fast speed and it had no soud to it.i checked the object for other colored lights,but their was none on it.another smallerlight which belonged to a plane was like trying to follow ,butwas a long way back and moving way slower,but a t a fast pace also(looked like jet).object was moving so fast too be they the sixe it was and finally started srinking in size and changed color from the white to a reddish color and disappeard ou of site. i have seen ufo's before and i believe i was abducted in the end of the year 2000.on that incident for about 4-5 months i noticed a bright star during the day time ,but it seemed like the object was communciating with me.i became obessed with ideas for new inventions,i ended submitting the idea for digital camera binoculars,wireless internet w\\small plug-in box(alltel\\att) and a new energy drink with which coca cola contacted me about .i also felt i was led to tell people that a real bad winter strom was going to hit christmas day(warzone).i told people in know about 3 months before it acually hit on christmas day.thwe worst ice strom in history for most southern states.before tonight i had my real last up close contact thanksgivig eve 2005 around 9:00 p.m. and that lasted about 20 minutes or so.i am ready for them to reveal themselves to the masses because maybe if the rest of the world see at they do exist,maybe we whouldn't have all this chaos and wars going on.if most the world believe in some kind of god,then why can't they believe in aliens?"],"Summary":"Step outside and my cat was acting a little crazy.I saw something really bright in my perpherial vision and looked in the sky,Something was moving at very fast speed.The object was bright white and very large oval shaped.Disappeared shortly.Wasn't meteor.","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Region":"Texas","City":"Texarkana","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around November 19th 2008"],"Weather Factors":"Unknown","Country":"United States","Tags":"City","Date Submitted":"11/19/2008 06:20 UTC","Longitude":"-94.039158","Case Number":"13826","Sighting Duration":"Undisclosed"}