{"Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.720193,+-74.001713(13824)&iwloc=A&hl=en\"> mufon case (13824) map </A>","Date of the Event":"11/19/2008 04:00 UTC","Object Shape":"Star-like","Case Number":"13824","divs":["Sighting Details1. I was on the 22nd floor of a building located between 42nd and 43rd on the 1st avenue, New York City. The sky was very clear and not dark yet. 2. A bright light was seen from the window when I was speaking to my colleague. 3. I thought an aeroplane or a helicopter. 4. But it was very bright and only moved slightly. I went back to my office on the same floor, and gazed at the light for sometime. Two other lights appeared horizontally to the light I fist was looking at. I let my another colleague see the lights and asked for his views. He was of the view that the lights were some kind of aeroplanes'. I looked around in search for flights to and from JFK and helicopters. A few helicopters I saw were not putting lights on as it was still not dark. The direction of those lights did not seem to be the same direction of JFK which should be north-east. As well, I have never seen such lights in that direction. 5. I wonder what these lights were. It did not seem to me an aeroplane judging from its move (did not move much);their brightness; and appearing and disappearing. 6. They just disappeared."],"Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/13824.html.txt","/var/www/straped/mufon/org/13824.html"],"Weather Factors":"None","Longitude":"-74.001713","Latitude":"40.720193","City":"New York","Viewing Distance":"Over One Mile","Tags":"City","Country":"United States","Object Features":"Unknown","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around November 19th 2008"],"Source":"MUFON","Date Submitted":"11/19/2008 04:00 UTC","Summary":"Three lights appeared in the sky in the East","Log Number":"US-11192008-0015"}