{"Tags":"City","Date Submitted":"11/18/2008 07:00 UTC","Date of the Event":"11/18/2008 07:00 UTC","trends":["There have been no other sightings in Union","This sighting has never been favorited."],"City":"Union","Region":"South Carolina","Case Number":"13839","Country":"United States","divs":["Sighting DetailsAt approximately 7pm I was traveling home on hwy 105 toward hwy 49 east and I noticed immediately after turning onto hwy 105 that there were three bright lights that I casually thought must be lights from a tower and then I noticed the movement in the lights. The lights weren't in a vertical position, they were in a horizontal formation. The light in the middle and the light on my right came closer to one another and then the light on the right started movement toward my car. I was slowed to a crawl on watching this and as this light that seemed bright white, like the other two got lower and closer, I could actually see the bottom of this thing. What I saw was big, triangular-shaped, made no noise, and was heading eastward at a very slow speed. I was awed, scared, and shaking as I was alone. I don't necessarily believe in \"UFOs\", but I know that I saw something out of the ordinary for sure. Instead of going home, I went to my mother's home which is located a few blocks from our mainstreet with the two remaining lights in view the entire time. These two lights appeared to be moving westward. I got to my mother's home and brought my mother and one of my older sisters out to view these lights when a third light appeared again, close in proximity to the other two lights. Upon seeing the third light moving toward us, but at a much greater distance than what I had witnessed earlier, my sister said, \"it's a helicopter.\" Then upon seeing the object appear to immediately stop, we witnessed the object shoot straight up at such a speed that it disappeared very quickly. No sound. The sky was completely clear and the weather is unusually cold for this time of year in this area. We watched these other two lights approximately until 8:30 pm until they moved beyond our view on the city horizon. I did see aircraft flying at the time of this ascent, but they had flashing red lights clearly visible underneath. I don't know what I saw, but was dissapointed that there was nothing reported locally. I can't believe that I'm the only one in this area to see these moving lights. I guess I just don't want to think that I'm nuts all alone. I did want more input on what I had possibly seen so I googled UFOs and found this site. Thanks."],"Log Number":"US-11202008-0004","Object Flight Path":"Hovering then path","Weather Factors":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.661278,+-81.603506(13839)&iwloc=A&hl=en\"> mufon case (13839) map </A>","Sighting Duration":"Undisclosed","Longitude":"-81.603506","Object Features":"None","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/13839.html.txt","/var/www/straped/mufon/org/13839.html"],"Viewing Distance":"101-500 Feet, Unknown","Disposition":"Insufficient Data","Latitude":"34.661278","Summary":"Noiseless, triangular shaped with bluish lights underneath."}