{"files":["/var/www/straped/mufon/html2text/13830.html.txt","/var/www/straped/mufon/org/13830.html"],"Log Number":"US-11192008-0021","Summary":"Brite object going southwest to north east at low altitude","Case Number":"13830","Longitude":"-98.198863","map":"<A HREF = \"http://maps.google.com/maps?q=32.225656,+-98.198863(13830)&iwloc=A&hl=en\"> mufon case (13830) map </A>","Object Flight Path":"Straight-line path","Object Features":"None","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Star-like, Unknown","trends":["There have been 74 other sightings in Stephenville","There were 6 other sightings in Stephenville on or around November 19th 2008"],"Sighting Duration":"00:06:10","Date of the Event":"11/19/2008 06:20 UTC","Region":"Texas","City":"Stephenville","Latitude":"32.225656","Date Submitted":"11/19/2008 06:20 UTC","divs":["Sighting DetailsI was walking from one building to another at work when I saw what look like a dim light star to the southwest but it instantly became brighter and was moving very fast toward me going northeast. The object was very brite, I thought it might be the landing lights on a plane, but as it passed over head I never saw any blinking of any kind and if it was a jet (because of the rate of speed it was going) it had no sound that I could make out. As it went into the Northeast sky it dimmed and vanished. the only explanation I can think of is that it was a satalite, but afterward there was a large amount of air traffic then there usually is at this time of evening. I just happen to catch to whole episode, because I have gotten into the habit of looking into the sky due to the number of ufo sightings in Stephenville. I felt like I was loosing my mind at what I was seeing and there not being any logical explanations for it other than it being a satalite, but like I said the air traffic got heavy afterward, which makes me wounder what did I see."],"Disposition":"Unknown","Tags":"City"}