{"City":"Elkhart","Log Number":"US-11202008-0012","Country":"United States","Date of the Event":"11/18/2008 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.685034,+-85.972637(13847)&iwloc=A&hl=en\"> mufon case (13847) map </A>","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around November 18th 2008"],"files":["/var/www/straped/mufon/html2text/13847.html.txt","/var/www/straped/mufon/org/13847.html"],"Viewing Distance":"Unknown","Summary":"A very bright star or one big head light.","divs":["Sighting DetailsAs I was closing the drapes, I happen to look out to the sky.It was a clear cold night. I noticed to the south west, one very bright star or head light. It was brighter than the closest star. I retrieved my binoculars to get a better look. It was one very bright head light. As I watched it, at one point, with my binoculars,it turned a colorful shade of different colors. Colors like red,blue purple and violet. Sometimes it would fade out and come back strong again. Than it did a very astonishing thing, it bounced up and down. It reminded me of a pickup truck on a holy road. Stars and planest do not bounce like that. Then it would stay still again. As all this went on, it moved ever so slowly to the north west and then it would stop, and move again. I even seen a plane that passed south of it, and planes blinking beacons were not as bright as the UFO. Before I left I even had my brother and neice to our window to view it. And he seen it bounce up and down as well. I had to leave and go pick my husband up. We drove down a treeless road, and I spotted it again. But only shortly, for 13 minutes after the hour it just dissappered. I never ever thought I would see such a sight, and as others, you believe that there are others out in this vast universe, besides ourselves. Hopefully we will be able to meet with these personages someday. We may be able to help each other."],"Object Features":"Undisclosed","Case Number":"13847","Disposition":"Unknown","Latitude":"41.685034","Sighting Duration":"01:13:00","Object Flight Path":"Hovering then path","Object Shape":"Circle, Star-like","Date Submitted":"11/18/2008 06:30 UTC","Region":"Indiana","Weather Factors":"None","Longitude":"-85.972637","Source":"MUFON","Tags":"City"}