{"Sighting Duration":"Undisclosed","Region":"Pennsylvania","Case Number":"13849","Disposition":"Insufficient Data","Object Features":"Undisclosed","Date of the Event":"11/12/2008 12:00 UTC","Longitude":"-74.920896","Source":"MUFON","Tags":"City","Object Shape":"Diamond","files":["/var/www/straped/mufon/html2text/13849.html.txt","/var/www/straped/mufon/org/13849.html"],"Summary":"Looked like a yellowish orange orb in sky hovering around.","Country":"United States","Log Number":"US-11202008-0014","map":"<A HREF = \"http://maps.google.com/maps?q=40.176694,+-74.920896(13849)&iwloc=A&hl=en\"> mufon case (13849) map </A>","Weather Factors":"Unknown","Latitude":"40.176694","Object Flight Path":"Undisclosed","divs":["sighting detailsi was sittin in the walgreens parking lot that is at the intersection of oxford valley and woodbourne roads waiting for my husband to come out of the store.out of the corner of my eye i saw an flame colored object come from behind the trees(it was a good 1\\2 mile away) and it went straight up in the sky and then slowly hovered to the left. the color of it was what caught my eye and the way it moved. almost like a hoovering bug-quickly and fluently. it was shaped like a diamond but was all covered in yellow and orange like a flam. there definitely was not any white or red lights like a helicopter and it was too high to be a helicopter.it hovered in the same spot for a good minute and i thought i must be crazy so i just ignored it. my husband got back in the car and started to talk to me and cut himself off and said what the heck is that. the light of it caught his eye too. i finally felt not so stupid. i explanied where it had come from etc.. he wanted to get closer to see if it could be coming from something explainable!! as we continued out of the parking lot in the direction it was, it started going up slowly. it was going straight up - no angle. then it was gone. it totally just disappeared straight up but in a blink. we hadn't taken our eyes off of it. we still can not get over it. my daughter who is 8 also was in the car and she was also in shock.we were so mad as we did not have a camera with us."],"City":"Langhorne","trends":["There have been 15 other sightings in Langhorne","There were no other sightings in Langhorne on or around November 12th 2008"],"Viewing Distance":"Unknown","Date Submitted":"11/12/2008 12:00 UTC"}