{"Latitude":"53.728058","Sighting Duration":"00:02:00","Region":"British Columbia","Object Flight Path":"Hovering then path,Straight-line path","Weather Factors":"Unknown","Longitude":"-127.644611","Summary":"3 sightings, same thing, multiple people saw it with me.","Tags":"City","City":"Undisclosed","Log Number":"CA-11202008-0009","Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=53.728058,+-127.644611(13844)&iwloc=A&hl=en\"> mufon case (13844) map </A>","Date of the Event":"10/10/2008 12:00 UTC","Disposition":"Unresolved","Case Number":"13844","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Star-like","Object Features":"Undisclosed","divs":["Sighting Details My name is Brian Anctil, I'm 22 years old. The first sighting was outside my work, it was Augest 2008 around 9:00pm, I cannot remeber the day exactly, but I walked outside looked up and took notice of one of the brighter stars with a yellowish color to it, it was twinkling, so i watched it for a few seconds until it gave a sort of pulse, and went out, i watched the area for a little while longer and it never came back. I thought that was weird and told my girlfriend about it and some other friends, and we just thought it was odd. Then Oct.10,2008 around 8:00pm,I went out for my break with my girlfriend Kris, who works with me, anyway, i sat down looked up and saw the same bright light with the same yellow look to it, it was on the other side of the building this time, so i pointed excitedly out to my girlfriend to look at it and she did, as we watched it, it moved straight up in a line and pulsed a bit and went out. At this point i think something odd is up, but now 2 of us have seen it and that was freaky enough. So at this point, I'm telling friends and family about it, thinking how odd it was that i had seen this thing twice now. Anyway, so on Oct 13, 2008 around 11:00pm, My friend Branden picked me up to go for a drive to the beach to talk and hang out. So we get too the beach and we had a good view of the stars and it reminded me to tell him all about the last 2 sightings. I starting explaining but the call of nature was herd and i had to step out for a to go pee, so i stepped out and headed for some logs on the beach and did my thing, as i was looking up at the sky wondering if i was going to see anything, but alas, nothing, so i got back in the car and started finishing telling him what i had seen, when he jokingly pointed out the window and said \"Like that?\" And it was the same bright yellow looking star, and i just say star because it was bright as hell and made no noise any time i saw it... So i said yes, it looked exactly like that, then i told him i would start to be freaked out if it just faded out, and thats what it did. Each sighing lasted about a min or 2, same bright star looking object, moved up on one sighting before fading out. But all faded out in the same sort of way. Feel free to contact me, i talk better than i type. Sorry i have no footage, just other people who saw it. Just figured someone should know something is going on over here."],"files":["/var/www/straped/mufon/html2text/13844.html.txt","/var/www/straped/mufon/org/13844.html"],"trends":[],"Date Submitted":"10/10/2008 12:00 UTC","Source":"MUFON"}