{"City":"Picayune","Summary":"Bright silver/white cigar shape UFO with black band in middle.","Log Number":"US-11202008-0006","map":"<A HREF = \"http://maps.google.com/maps?q=30.533359,+-89.677848(13841)&iwloc=A&hl=en\"> mufon case (13841) map </A>","Viewing Distance":"Unknown","Disposition":"Unknown","Country":"United States","Source":"MUFON","Object Shape":"Cigar","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/16/2008 07:30 UTC","trends":["There have been 4 other sightings in Picayune","There were no other sightings in Picayune on or around November 16th 2008"],"Longitude":"-89.677848","Tags":"City","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13841.html.txt","/var/www/straped/mufon/org/13841.html"],"Object Features":"None","Region":"Mississippi","Case Number":"13841","Date of the Event":"11/16/2008 07:30 UTC","Latitude":"30.533359","divs":["sighting detailsi was in the walmart parking lot in picayune, ms at approximately 7:30 am cst. i saw a bright silver\\white cigar shaped object in the sky with a black band around it's middle. the black band covered about 1\\5 of the total objects length. it was traveling at a constant speed west to east. object traveled in a straight line. object was orientated in-line with direction of travel. the sky was completely clear and very blue. i first thought it was a plane. as it got closer i noticed it had no wings or tail section. next, i thought it might be a bird (black body and white wings) soaring in the morning sky. as it passed overhead and slightly north i realized the \"bird\" had no head or tail. and, it appeared to be a smooth surfaced cylindrical object with rounded ends. i heard no sounds from the object as it passed over. i have no idea how high it was, but object length was about one finger width at arm length when overhead. speed is also unknown. however, there were few nearby trees etc. and it took a good two-three minutes for the object to pass over. compared to my observation of a space station fly over here in houston on nov 20, 2008, it appeared to be traveling across the sky at about the same speed. i looked around the parking lot, but saw no one outside. it was very cold that morning - about 32f. as far as i know i'm the only one to observe the object. unfortunately, i had no binoculars or camera with me. is it possible it was the space station and the cold morning air acted like a magnifier? seems unlikely, but i've seen \"inversion\" mirages over water that make houses, etc. 20 miles away and over the horizon appear to be only 2-3 miles away. any help identifying the object would be really appreciated."]}