{"Country":"United States","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 19th 2008"],"Summary":"Bright triangular object...","Date of the Event":"11/19/2008 06:22 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.767923,+-95.36692(13848)&iwloc=A&hl=en\"> mufon case (13848) map </A>","divs":["Sighting DetailsStepped out my back door to feed my cats and as usual I look up to check out the night sky. Jupiter and Venus are bright and beautiful in the clear western sky when I see another bright star(object) near them. I didn't think much of it because Houston's International Airport is only some ninety-eight miles away and a lot of the time the planes have the landing lights still on and are very bright when they fly over. As this object drew closer(moving west to east) I waited to see navigation lights (red & green)but saw nothing, I went to get my binoculars all this has only taken about a minute and a half. I look through my binos and at the object nearly over head. There are no navigational lights at all and it's not one bright light but three small, bright lights in a triangular formation one in front and two closely behind. I call my son to take a look, \"Dad it's a star or plane(unaided eye)\" first response I do not tell him what I saw through my binos. \"Here take a look,\" I tell him, \"Tell me what you see the object is over head now.\" He says,\"Dad it's three smaller lights, not one, it's in an arrow or trianglur shape, that's what I see.\" I then get excited and tell him \"That's exactly what I saw!\" There was also no navigational lights and no sound and maybe eleven to twelve hundred feet high. We watch the object til it's out of sight and still have no idea what it could have been."],"City":"Houston","Latitude":"29.767923","files":["/var/www/straped/mufon/html2text/13848.html.txt","/var/www/straped/mufon/org/13848.html"],"Longitude":"-95.36692","Weather Factors":"Unknown","Tags":"City","Region":"Texas","Object Shape":"Triangle","Date Submitted":"11/19/2008 06:22 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:07:00","Case Number":"13848","Log Number":"US-11202008-0013","Disposition":"Unknown","Source":"MUFON"}