{"Object Features":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13850.html.txt","/var/www/straped/mufon/org/13850.html"],"Latitude":"32.945222","Summary":"Fast blinking orange lights in different formations.","Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in Graford","There were no other sightings in Graford on or around November 19th 2008"],"Country":"United States","divs":["Sighting DetailsThis is a confirmation of report 13842 where the man from Eastland, TX, saw the same thing although he was much closer. I had the close to the same experience last month, although the lights were further SW. Just after 1800 I sat above Possum Kingdom Lake off of HWY 16 in a new development called \"the Hills above Possum Kingdom\", excellent elevated view to the S and SW, and it was where I witnessed the event last month. I had nothing to do so I stopped there on my way home from work in Graham, TX. Sat there for a bit; saw either a huge satellite or space station move quietly from SW to NE, extremely bright, so that had me fired up. And I was not to be disappointed. The orange lights appeared like flashes - you blink, you miss. Then some would stay a little longer, all in same area in sky. They would line up, then one on right would blink off and appear to the left of the other. For a millisecond there were two lined up vertically (the others were all horizontally lined), barely caught them. This lasted from 6-7pm and then I left. The other report referencing this same event, 13842, has his sightings an hour later so apparently they didn't quit when I stopped watching. Also, these \"lights\" didn't (to me) appear to be their own source of light at times; almost as if they were being lit up by another source(?). Very strange and wondrous at same time. I would advise anyone reading this to station yourself west of Fort Worth, in a good elevated, dark area (west of Palo Pinto on HWY 180 is good spot) and sit after the sun goes down and scan from south to west and take a good camera (like I don't have) on a tripod and have it ready or just keep it recording. You will probably not be disappointed - this seems to be an ongoing happening."],"Log Number":"US-11202008-0015","Viewing Distance":"Unknown","City":"Graford","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"11/19/2008 12:00 UTC","Case Number":"13850","Weather Factors":"Unknown","Object Shape":"Circle, Flash, Sphere","Region":"Texas","Longitude":"-98.243472","map":"<A HREF = \"http://maps.google.com/maps?q=32.945222,+-98.243472(13850)&iwloc=A&hl=en\"> mufon case (13850) map </A>","Date of the Event":"11/19/2008 12:00 UTC"}