{"Latitude":"41.246537","Region":"Ohio","Country":"United States","trends":["There have been 8 other sightings in Warren","There were no other sightings in Warren on or around November 20th 1965"],"Summary":"Many siting's in \"Niles Boardman , Struthers\" Trumbull County Ohio.","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/13853.html.txt","/var/www/straped/mufon/org/13853.html"],"City":"Warren","map":"<A HREF = \"http://maps.google.com/maps?q=41.246537,+-80.817417(13853)&iwloc=A&hl=en\"> mufon case (13853) map </A>","divs":["Sighting DetailsI was 12yrs and after a football game that we just won against WestSide Colt's we were Niles little Red Dragon's. After shaking hand's both team's seperated and huddled on the side line's of Wilder feild Wadell Park Niles, Oh. At that point the crowd got suddenly quiet and started pointing and looking directly up above the center of the football feild. About one hundred feet above the light's was A UFO disk shaped object motionless and no noise coming from object. At that point parent' started to pull there family's off the feild toward's the car's in a hurry also many of them scared. As I and other's were looking up across the street at the same height was A second UFO object of the same shape and size. They had white light's probally 3'x4' rectangular shaped circling around the edge of the two object's. I was the last person on the feild as I had to retrieve some football gear for my Coach Mr. Al Cirrello And Mr. Reggie Giancola, Also a few of my fellow player's. I ran directly under the object while keeping an eye on the UFO the whole time. My Coach told me to \"hurry up and get up over here and go turn the main light switch for the feild off\" which was alway's standard proceedure. The object's were still sitting in the same spot's in the air. We then waited for everyone to leave the feild, Then we got into the van and proceeded to pull out of the parking lot and onto exit road. We turned left and pulled over to the side of the \"Bowl\" which was known as the practice feild. Out of all that time the two object's had not yet began to move or make any kind of noise for about 20 minute's. Are Coaches said \"let's stay here and see what happen's\" they also said \"that you boy's may never see anything like this again\". \"We are older and have never seen except heard of something like this\". Then the one UFO came acrossed the road and postioned itself right next to other one still never making any kind of sound. Within a couple of second's they took off toward's the city of Niles. Only leaving a light trail then in too different direction's they made unbelievable different turn's and dissapeared. There was an art class from our high school, Niles Mckinley the teacher Mr. Bertolenni of which his student's were at Stevens Park that evening drawing picture's of the fall evening just by chance some of the student's noticed the UFO above the park and proceeded to sketch picture's of the UFO's that they had seen of what they sketched as fast as they could because the object's did not stay very long. There was alot of attention drawn to the sighting's for a couple of day's then it was part of history. Since then I have been in the United State's Marine Corp during 1972 - 1974 of which at that time my M.O.S. was to go to school to learn how to refuel aircraft. During that time I had went to school and graduated top of my class in Tank Farm and Aircraft fuel station's in the feild. I refueled many type's of aircraft and helicopters also vertical and horizontal flying jet's. I have never seen or experienced anything that move's or fly's without any noise while being so close from what I seen on that evening. I am now and alway's will be Semper Fidelias to my belief in UFO's noone or nothing can ever change that."],"Date Submitted":"11/20/1965 07:00 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Longitude":"-80.817417","Date of the Event":"11/20/1965 07:00 UTC","Object Flight Path":"Undisclosed","Object Shape":"Disc","Object Features":"Undisclosed","Case Number":"13853","Log Number":"US-11202008-0018","Weather Factors":"Unknown"}