{"map":"<A HREF = \"http://maps.google.com/maps?q=38.802032,+-81.350953(13858)&iwloc=A&hl=en\"> mufon case (13858) map </A>","Date Submitted":"11/19/2007 12:00 UTC","City":"Spencer","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","Object Flight Path":"Stationary,Other","Summary":"I have it filmed on dvd","trends":["There have been no other sightings in Spencer","This sighting has never been favorited."],"Disposition":"IFO","Object Shape":"Circle","Object Features":"None","Longitude":"-81.350953","Region":"West Virginia","Tags":"City","Date of the Event":"11/19/2007 12:00 UTC","Log Number":"US-11202008-0023","Case Number":"13858","divs":["Sighting DetailsI was visiting my sister in WVa. I took my dog outside before going to bed. Over from her house, above the tree line in the sky, there was a bright light. I asked my sister what it was and she said she didn't know. We started watching it get bigger and brighter. I ran inside to get my video camera. I have it all on video. To see it with the naked eye, it doesnt seem to move but on the video it dances around, goes out then comes back on brighter. It is like a sphere with multi colors. ON the video you can see something at the bottom of the light that looks to me like the top of a spaceship.It happened around 11:00 p.m. but was later the next couple of nights. We watched and videoed it for three nights straight. It stayed there for about 1 to 2 hrs. each night. There are three other witnesses besides me. My sister says it was never there before that time and hasn't come back as far as she knows. But here husband gets up early for work and they go to bed early. Maybe she has just missed it. Spencer, WVa. is in the middle of nowhere. There are no industries or military bases there where we saw it, In fact there was nothing except trees. I would love to know what it is. I have tried and tried to get someone to listen but they wont.This was filmed about a year ago and I have been trying to get someone to explain it all this time.I know we saw something strange and unusual those nights. Everytime I watch the video it gives me an uneasy feeling,"],"Latitude":"38.802032","files":["/var/www/straped/mufon/html2text/13858.html.txt","/var/www/straped/mufon/org/13858.html"],"Weather Factors":"None","Sighting Duration":"01:00:00"}