{"Date of the Event":"11/18/2008 07:00 UTC","Tags":"City","Date Submitted":"11/18/2008 07:00 UTC","files":["/var/www/straped/mufon/html2text/13854.html.txt","/var/www/straped/mufon/org/13854.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.457586,+-99.728544(13854)&iwloc=A&hl=en\"> mufon case (13854) map </A>","Object Shape":"Square, Rectagular, Unknown","Sighting Duration":"Undisclosed","Latitude":"32.457586","Weather Factors":"None","Disposition":"Unknown","City":"Abilene","Longitude":"-99.728544","Object Flight Path":"Stationary,Unknown","Case Number":"13854","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around November 18th 2008"],"divs":["Sighting DetailsI was on the back porch talkin on the telephone to a friend, when i noticed in the eastern sky a line of lights in the distance that was about one inch long parallel to the ground, seconds later a second set of lights appeared above and to the left of the first lights at a 45 degree angle, these lights appeared to be goin away from me........then a third set of lights appeared off to the right of the first set of lights and they were postioned at a 45 degree down angle, the lines of lights were going from right to left and back again on all three sets at the same time. I told my friend on the phone and called my wife out but they were gone before she could see them.........i noticed off to the right a US aircraft proceeding towards them from the south.....the lights disappeared. the second set disappeared first, then the third set and the first set was last disappearing and then they didn't re-appear. the US aircraft continued on a northly path to the area where the lights were and just kept on goin north........the lights were like an orangish, reddish, gold color just flashing from right to left and back again, similar to ones i previously seen on Oct. 23, 2008 and Oct. 29, 2008, but this time there were three sets instead of just one set........and the same colors........."],"Viewing Distance":"Over 1 Mile, Unknown","Summary":"Lights over Abilene.","Log Number":"US-11202008-0019","Region":"Texas","Object Features":"Unknown","Source":"MUFON","Country":"United States"}