{"map":"<A HREF = \"http://maps.google.com/maps?q=52.76628,+0.403124(13869)&iwloc=A&hl=en\"> mufon case (13869) map </A>","Case Number":"13869","Tags":"City","trends":["There have been 3 other sightings in King's Lynn","There was one other sighting in King's Lynn on or around December 18th 1992"],"Object Features":"Dome, Other","files":["/var/www/straped/mufon/html2text/13869.html.txt","/var/www/straped/mufon/org/13869.html"],"Date Submitted":"12/18/1992 11:45 UTC","Summary":"Observed at first a huge silver star, which after a minute vanished. then was fortunate to observe oval craft some eighty feet above me, I felt they were also aware of my prescence.","Disposition":"Unresolved","Date of the Event":"12/18/1992 11:45 UTC","Object Flight Path":"Straight-line path","divs":["Sighting Detailswhilst driving a pizza delivery van {last delivery of night} down a serpentine road into a popular estate, noticed approx quarter mile away a very large silver star {four points ] just silently commanding the night sky, which by the way in dec was absolutely void of cloud or haze, crisp clear night. i looked at my watch time was as indicated 2345, there was no other traffic so slowed van down to a standstill. After switching off the engine and winding down the drivers side window I commenced to get a better look at this strange silent star. After perhaps two mins the star vanished, not unlike the quickness of a illuminated light bulb suddenly switched off , still there was no traffic and no percievable noise or inquisitive sightings from any one else. For perhaps a minute i strained my eyes in the night sky to identyfy anything which may have been a repercussion of this star. suddenly i was rewarded,and dare i say it, not in anyway frightening I observed the following now some eighty feet above me.. I observed an oval shaped craft some thirty feet long with a misshapen type of dome some eight feet high upon its upper surface. The colouring was very distinct, kind of a rusty red colour, like metal after it had undergone extreme tempertures. The base of the oval craft was also very definable showing a number of exhaust-ports rather than lights, which began to intensify as the craft negotiated what i percieve was a Portal,a gateway to inner-space. Please take note.. this craft was moving uncannily slow four-five mls per hour in earthly terms. directly in front of the oval craft immediately as the orange ports rotated a \"Doorway\" was created by some release of unknown energy. Twas not unlike watching this craft dissapearing behind a shaking mirror in space, for please remember the night sky was crisp and clear. again because I have also been privy to other close encounters I would say I was NOT afraid either before seeing the star and craft nor after. there is little phenomena of this kind that actually could frighten me. After returning back home I drew strange pictures of alien orighns, perhaps even dimensional entitys.It is my perception as a psyche that the star first sighted was not a star but a portal opening within two space times. I always have and always will be available for stringent tests, scrutiny to prove the validity of this sighting and a few others,"],"Sighting Duration":"Undisclosed","Longitude":"0.403124","Log Number":"GB-11212008-0008","Viewing Distance":"21-100 Feet","Region":"England","Source":"MUFON","Object Shape":"Oval, Star-like","Country":"United Kingdom","Weather Factors":"Unknown","Latitude":"52.76628","City":"King's Lynn"}