{"Object Features":"Other","Country":"United States","Longitude":"-79.53338","Source":"MUFON","Date Submitted":"04/15/2008 11:00 UTC","divs":["Sighting Details VERY LATE WINTER, EARLY SPRING, I TOOK MY GARBAGE OUT TO THE NEARBY DUMPSTER AND NOTICED A BRIGHT, ORANGISH LIGHT, COMING VERY SLOWLY TOWARDS ME, FROM A SOUTHEASTERLY DIRECTION. THIS DIDN'T SURPRISE ME. I ALWAYS LOOK AT THE STARS, ESPECIALLY IN COLDER MONTHS AND ALWAYS NOTICED THAT MANY PLANES FLY FROM THAT DIRECTION, OVER MY HOUSE. I THREW MY GARBAGE AWAY AND WAS HEADED BACK INTO THE HOUSE WHEN I NOTICED IT RISE UP A BIT HIGHER. THIS IS WHEN I REALIZED THAT IT WAS A LOT CLOSER THAN I HAD FIRST THOUGHT. THEN I NOTICED IT GETTING CLOSER AND NOW I COULD SEE A LARGER, DARK MASS BEHIND THE LIGHT. IT WAS ANN ODD SHAPE. CONICAL IN THE FRONT, SQAURISH AND FLAT IN THE BACK, SIMILAR TO PICTURES OF A SPACE SHUTTLE. I KNEW IT WAS SOMETHING OUT OF THE ORDINARY. IT FLEW, VERY SLOWLY OVERHEAD. IT WAS SO LOW THAT I COULD SEE LIGHTS FROM THE NEARBY EXXON MOBILE STATION REFLECTED OFF OF IT. THE THING THAT REALLY SURPRISED ME WAS THAT IT MADE NO SOUND WHATSOEVER, AS IT CONTINUED OVER MY HEAD AND SLOWLY DISSAPEARED OVER THE TREE LINE. YOU KNOW WHEN YOU SEE SOMETHING THAT IS OUT OF THE ORDINARY BECAUSE YOUR HEART SPEEDS UP AND YOUR HAIR STANDS UP. THIS DIDN'T SCARE ME, IT JUST WAS A BIT UNSETTELING. BUT I HAVE SEEN STRANGE THINGS LIKE THAT A FEW TIMES BEFORE IN MY LIFE. I GREW UP IN ACME ON A HILL AND SEEN UFO'S THREE TIMES BEFORE. ONE OF THEM BEING WHAT LOOKED LIKE A STAR, ONLY IT MOVED AND STOPPED DIRECTLY OVER ME AND TWO OTHER PEOPLE I WAS WATCHING STARS WITH. WE RAN. WE WERE TEENAGERS. I THINK IT IS GREAT THAT MORE PEOPLE ARE COMING OUT ABOUT WITNESSING THESE THINGS, WHATEVER THEY ARE. NOW WHEN YOU SAY YOU'VE SEEN SOMETHING, PEOPLE CHIME IN WITH THEIR OWN STORIES INSTEAD OF TELLING YOU YOU'RE CRAZY."],"Sighting Duration":"00:03:00","Date of the Event":"04/15/2008 11:00 UTC","Case Number":"13877","trends":["There have been 6 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around April 15th 2008","This sighting has never been favorited.",""],"Latitude":"40.157941","Object Shape":"Other","Object Flight Path":"Straight-line path","Weather Factors":"None","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.157941,+-79.53338(13877)&iwloc=A&hl=en\"> mufon case (13877) map </A>","City":"Mt Pleasant","Log Number":"US-11212008-0016","Disposition":"Unknown","Tags":"City","Region":"Pennsylvania","Summary":"Low flying, no sound.","files":["/var/www/straped/mufon/html2text/13877.html.txt","/var/www/straped/mufon/org/13877.html"]}