{"Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"13871","trends":["There have been 16 other sightings in Englewood","There were no other sightings in Englewood on or around October 22nd 2008","This sighting has never been favorited.",""],"Object Features":"Unknown","Date of the Event":"10/22/2008 07:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.655795,+-104.9834(13871)&iwloc=A&hl=en\"> mufon case (13871) map </A>","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/13871.html.txt","/var/www/straped/mufon/more/13871_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/13871_submitter_file2__Pics1152.jpg","/var/www/straped/mufon/org/13871.html"],"Viewing Distance":"101-500 Feet","Country":"United States","Log Number":"US-11212008-0010","divs":["Sighting DetailsI was at home, I stepped out the back door to stand on the porch, and smoke. I looked the the left, to make sure my dogs were not going to wrestle too hard, and then looked forward satisfied that they were being good. I didn't notice it out of the corner of my eye at all, because the craft was just above Swedish medical Center, which has a bunch or red lights, because they have (it seems) constant helicopter traffic (flight for life). Anyway I looked and saw this craft going maybe 5 miles an hour, like it was letting it self drift a little, and then within a couple seconds it zoomed off to the south. I was able to see it leave, but it was so fast, that if I would've blinked at the time, I might have only seen a trail of red light, hence the reason the picture of it in my head is kinda blurry. When I first noticed it, I thought it was the previously mentioned hospital's red lights, but no longer than a second later, there was no doubt in my mind that it was unidentifiable, and I realized that I could not see a single light from the hospital, from where I was standing. It was a right triangle, from what I could see (meaning there was a 90 degree angle in it). It was faced south the entire time, and the lights were on the right angle sides that was the leading point. It happened so fast, that I could not count the lights, and in my memory they kinda blend together, since 2 out of the three seconds I saw it, it was moving faster. It had to have been no more than 300' above Swedish. Also, it was REALLY dim, I mean it would not have had light reflecting on any surface, I'd guess, but It was bright enough to make the reddish color glow..kinda. It's hard to explain. I was not scared at all, just amazed. I was filled with excitement shortly after, but I am proud to say that my emotions don't get in the way of doing what needs to be done (thinking on my feet, and making the best decisions, in very little time), so I was in the moment, and had no thought or feeling about it, until it was gone, and THEN I was amazed. I lost sight of it as it left going south, and from what I could tell, was aimed at the horizon, so I could not see it after a second or two, because of my neighbor's house blocking my vision. I stayed there, and didn't even move my head (for about a minute), so I could gauge where it was, and what direction it took off, and after I collected my thoughts, and went over what had just happened, I walked fast to the east, to see if I could see it around the house, , but I knew it was going to be gone already(judging by the speed it left), and it was nowhere to be seen. If I had been up higher, I might have been able to see it, but the hospital blocks my vision of the south horizon. The picture I drew is not to my liking, but I am tired of working on it, and it's close enough. I just want to say that the lights were more separated than in the picture. I estimate the craft to be about 100-200' wide. And, it was lower than I drew, I could see all of it, but it was closer to the house, than I drew, and was bigger in comparison to the house, than I drew. I included a picture of where I was standing, at the best angle I could get to show you where I was. I wanted to be very thorough, so if you (internet readers) made it to the end of this report, then thank you for your time! Any further questions are welcome, from any sincere person(s). Thanks, Destiny"],"City":"Englewood","Object Shape":"Boomerang, Triangle","Latitude":"39.655795","Date Submitted":"10/22/2008 07:30 UTC","Tags":"City","Weather Factors":"None","Summary":"It was a very dim, right triangle, with about 7 to 9 reddish lights on the front two sides.","Longitude":"-104.9834","Region":"Colorado"}