{"City":"Calgary","Sighting Duration":"Undisclosed","Case Number":"13878","Log Number":"CA-11212008-0017","Object Flight Path":"Undisclosed","Summary":"This Cigar shaped object flew over my home at tree level.","Region":"Alberta","Viewing Distance":"Unknown","Date of the Event":"08/15/2008 09:45 UTC","Date Submitted":"08/15/2008 09:45 UTC","Object Features":"Undisclosed","Object Shape":"Cigar","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around August 15th 2008"],"Latitude":"51.04732","map":"<A HREF = \"http://maps.google.com/maps?q=51.04732,+-114.048062(13878)&iwloc=A&hl=en\"> mufon case (13878) map </A>","Disposition":"Unresolved","Country":"Canada","files":["/var/www/straped/mufon/html2text/13878.html.txt","/var/www/straped/mufon/org/13878.html"],"Source":"MUFON","divs":["Sighting DetailsMy wife and I where sitting and standing around our back yard watching the left overs of a metorite storm. Just veiwing the falling stars, because one of my employees said it was incredible the night before. I was looking at a red star in the sky and I noticed it to be moving around in the sky and I thought that was odd. All of a sudden I was looking North East , and it looked like the sky was opening up, like a cartoon, and this large cigar shaped object came right out of the just becoming dark sky. I said to my wife, \" here comes something\" and then all of a sudden it was coming right towards me and next thing I see it dirctly above my house, when I first saw it I thought it was a large star heading toward my house. But, all of a sudden a weird chill came over me . The object was dark grey and made of an unusuall metal, it was tree level with my tall trees in my yard. It was completely silent when it past over. The material was strange to look at , it was nothing of this earth.It glided with ease, I ran out onto the street to watch it fly over the city. It was so smooth and fast, going south over the city. My feeling where of excitement, and fascination, my employee saw it fly over his home around the same time as I described. He chased after it down the street , pointing and getting people to look up at this ship. But the strange thing is that no one would look up. The object just kept on moving straight until I lost sight of it."],"Weather Factors":"Unknown","Tags":"City","Longitude":"-114.048062"}