{"Object Shape":"Cigar, Flash, Unknown","City":"Everett","Disposition":"Hoax","Longitude":"-81.63872","map":"<A HREF = \"http://maps.google.com/maps?q=31.390501,+-81.63872(13888)&iwloc=A&hl=en\"> mufon case (13888) map </A>","Region":"Georgia","trends":["There have been no other sightings in Everett","This sighting has never been favorited."],"Summary":"8 seperate objects seen over the course or 2-3 hours.","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/13888.html.txt","/var/www/straped/mufon/org/13888.html"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Latitude":"31.390501","Case Number":"13888","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Viewing Distance":"20 Feet or Less","Source":"MUFON","Country":"United States","Date of the Event":"11/20/2008 12:00 UTC","Log Number":"US-11222008-0003","Tags":"City","divs":["Sighting Details Me and my roommate went camping for 1 night on the altamaha river. We were at a sandbar near powerlines about 2 miles from altamaha regional park in everett ga. we had fished for a few hours on the river, and headed back to the sanbar at dusk. Shortly after the sun was completely down,and we had a beautiful view of the heavens. This is my favorite place to camp because its fairly remote; you can see planets , galaxies, everything the night sky has to offer. I have camped here, along with my roommate, for years, probably since 1999. We have observed tons of meteors and have done a lot stargazing in the past, but weve never seen anything unusual until last night. after arriving at the sandbar we made a fire, and i baited and rod and casted it out. As i was setting my rod in a holder in the sand, i noticed a light, bluish, similiar to a star, travelling over the treeline on the other side of the river at a very high rate of speed, horizontaly. I told my roommate to watch it while i grabbed a pair of high end binoculars. I could not make out a shape as this object was very far away. we passed the binoculars back and forth, and watched the object travel west to east for about 2-5 minutes, then it suddenly dissapeared. I knew immediatley that it wasnt a plane because it had no flashing lights. From this sandbar u can look through binoculars and almost make out the lights in the windows on passenger planes flying at night. After several minutes had passed, me and the roommate were talking excitedly, as this was our first-ever sighting and we were pretty freaked out, i observed another object exactley the same but coming from the south to the north. I pointed it out to my roommate and we watched it travel overhead for about 3 mins. it dissapeared over the treeline in front of us. Several minutes later we watched yet another come overhead from west to east, same star like qualities as the others, and dissapear suddenly. I was pretty freaked out and told myself not to look up at the sky anymore, because i was having fealings of wanting to leave, but i didnt want to ruin our trip. I threw a cast iron skillet on the fire and cooked a burger. After eating, about 30 mins later, i layed on my back in the sand next to the fire, and looked up into the sky for awhile. The stars were very bright. Suddenly, a bright starlike object just appeared in the sky overhead. I jumped up and ran down to the water and stared at it for about 10 seconds with my roommate. It was still for a moment, then it.. i can only describe it as blasting off, it flared white light intensly and accelerated at what had to be the speed of light vertically. Gone just as quick as it had appeared. Over the course of 20 mins we saw 2 more starlike objects appear, travel south to north for maybe 2 or 3 mins and dissapear instantly without a flash or any noise.these 2 were 1 after the other, not simultaneously. I must have watched too many x-files episodes growing up, because at this point i was terrified. My roommate was too. These objects were very high up, and posed us no threat, but they seemed so unnatural. Ive obsereved hundreds of meteor showers from this sandbar, for years i have stared into this portion of the sky and have NEVER seen anything like this. Me and the roomie decided to hit the tent about 8pm. We were ready to just go to sleep and not see anything else. The temp was about 35 degrees, so sleep didnt come easy. I woke up around 9pm and just layed there wide awake for a while. Around 10 pm i was really cold and couldnt sleep, so i got outta the tent and got the fire going again. As soon as the flames caught and the fire got big, my roommate came running outta the tent saying i was a lifesaver. No less than a minute later i looked over the river at the horizon, and saw an object orange to red in color. My roommate described it as orange or red, but flashing, or changing color. This one was like a disc or cigar, too far to make out a clear shape, but a whole lot closer than the other objects. This one really scared me. It travelled slower than the others, but still very fast horizontily over the treeline. It would dip, or go down behind the treeline then come back up over the trees, but still travelling horizontily. it dissapeared out of thin air after about 6 mins. I laid by the fire for a while just pondering what i had seen. That night we saw one more starlike object travel overhead, very fast from west to east. Not too long after that objet had dissapeared, i pointed to a clearing across the river in the treeline to show my roommate a falling star. but before the words even came out of my mouth, the object took on an s shaped path to the ground; it sorta snaked left then right. That was enough for me. I went to the tent and refused to come out until the sun came up. I didnt want to see anymore. i tried to take pictures and video of all these objects, but i had borrowed the camera the day before and didnt know how to set the night vision. throughout that evening we had observed aircraft flying overhead. The objects we saw werent comparable in any way to a plane; the majority of them were faster and brighter but farther away. we did hear the occasional roar of a jet, and saw some planes flying, but we heard nothing immediatley before, during, and after we had seen these objects."],"Date Submitted":"11/20/2008 12:00 UTC"}