{"Sighting Duration":"00:03:15","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.588138,+-95.902918(13882)&iwloc=A&hl=en\"> mufon case (13882) map </A>","Case Number":"13882","Latitude":"33.588138","City":"Honey Grove","Country":"United States","Region":"Texas","Object Shape":"Star-like","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-11212008-0021","Disposition":"Unknown","divs":["Sighting DetailsWell I was sitting in my house watching tv when I decided that I wanted to go outside and star gaze. The night sky was very clear, no clouds at all. The temperature outside was very cold I think around the high 30's if not a little lower. There was a pretty good bit of planes out, so I could tell the difference between the star like objects I seen compared to what a your usual planes look like. It all begin just by me looking up into the sky, and gazing at all the stars that were out. There were abunch of them. Excellent visibility so there was no way that I would have missed these objects due to clouds. The first one I seen was just cruising from the South to the North direction heading toward the Red River. The object did not exzibit intelligent behavior. It went in a straight path just like a plane or jet would do, but it looked just like a star moving across the sky. NO BLINKING LIGHTS AT ALL! The object was not a shooting star, because if it was a shooting star I woudn't have been able to observe the object for 3 minutes and 15 seconds. This is exact time. From when I first seen this object I started counting from when I seen it until I lost sight of it. Not to much longer after I seen the first star like object I seen another identical object heading the same direction as the first. The difference between the times were about 5 minutes. This object did the same exact maneuvers as the first object did. Really no differences except that the second object I seen was a little smaller than the first. I could only observe the second object fro about 45 seconds. They went out of my sight when they got to out of my viewing range. Nothing like what I seen with my friend and my brother, and what happened that night that we all three thought we were going to campout, but this exprience was pretty cool also. I am going to try to capture these objects on cam corder if I can. I'll try my best!"],"Date Submitted":"11/21/2008 07:20 UTC","Date of the Event":"11/21/2008 07:20 UTC","Longitude":"-95.902918","Object Flight Path":"Undisclosed","Summary":"Seen two star like objects cruising from north to south direction.","files":["/var/www/straped/mufon/html2text/13882.html.txt","/var/www/straped/mufon/org/13882.html"],"Object Features":"Undisclosed","trends":["There have been 2 other sightings in Honey Grove","There were no other sightings in Honey Grove on or around November 21st 2008"]}