{"Region":"Minnesota","Disposition":"Unresolved","Date Submitted":"12/12/2000 05:20 UTC","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting Details.Witness Account: I had attended a meeting of the Lake Superior Writers at theDeWitt-Seitz building in Canal Park that afternoon. I took the Duluth TransitAuthority bus home and got off at the corner of Piedmont Avenue and West SeventhStreet at 5:20 p.m. It was dark but there was still a glimmer of blue dusk atthe summit of Spirit Mountain, on the western edge of the city. As I crossedPiedmont Avenue, I looked downhill to my left and saw that the full moon hadjust risen. It was about 10 degrees above the eastern horizon, over LakeSuperior and Park Point. It was very cold, about zero degrees Fahrenheit, andthe sky was completely clear.As I passed the Lakeside Ice Co. building, I saw what I thought was a Christmasdecoration through the pine trees, an arch of multicolored lights. Afterwalking about 100 feet (30 meters) west on West Seventh, I saw the object moreclearly.It was a black triangle, with its apex pointed upward at one oclock angle, andthe base at the bottom. The object was in mid-air, and estimated 35 degreesabove the southwestern horizon. It was the size of my thumbnail at armslength. The color was matte black, a shade darker than the surrounding nightsky. The object had no discernible motion and hovered silently. There was nosound.The sides of the triangle were slightly rounded, a bit concave, giving theobject the look of a bulky arrowhead. Also there were three sets or arrays offour lights each on either side of the triangle. There were no lights at thebottom. Twelve lights in all on either side. In descending order, the lights ineach array were red, green, gold and white.I halted at the corner of West Seventh and 22nd Avenue West and observed theobject for five minutes. It was hard to judge distance, but my guess is that theobject was a few miles away, possibly over the Spirit Valley area in the WestDuluth section of the city. I was alone on the street. There was intermittenttraffic on Piedmont Avenue a block behind me. I walked on to my home, wentinside and grabbed a small camera. I wasnt sure the object itself would show,but I knew the steady multicolored lights would. However, when I reached thefront porch again, the object was gone."],"Summary":"UFO Roundup editor reports triangular craft","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/1388.html.txt","/var/www/straped/mufon/org/1388.html"],"Longitude":"-92.100485","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"00:05:00","City":"Duluth","Latitude":"46.786672","Date of the Event":"12/12/2000 05:20 UTC","Log Number":"","Case Number":"1388","Object Features":"Undisclosed","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=46.786672,+-92.100485(1388)&iwloc=A&hl=en\"> mufon case (1388) map </A>","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around December 12th 2000"],"Country":"United States"}