{"Log Number":"US-11222008-0013","Viewing Distance":"Over One Mile","Source":"MUFON","trends":["There have been no other sightings in Medicine Bow","This sighting has never been favorited."],"Object Features":"None","Sighting Duration":"00:08:00","Summary":"Object hovering on horizon then ascending in stair step pattern.","Case Number":"13898","Country":"United States","Tags":"City","divs":["Sighting DetailsThis event happened when I was about 12 years old in 1974 in the foothills west of the Medicine Bow mountains during daylight while traveling to our cabin on the Medicine Bow river. My Uncle and I were following my parents and we had just turned off of county road 62 headed due west to our cabin (the old Taylor homestead). I was riding in the passenger seat of my Uncles Land Cruiser when I noticed something unusual on the ridge to the north about 3 miles away but at about the same elevation as we were. When I first observed it, it seemed to be sitting on the ridge and rectangular in shape like a long building, but then began ascending slightly and hovered at about 200 feet over the ridge for at least 3 minutes. It then began ascending again but in a slow series of step like moves, this seemed very geometric slow and coordinated. It was at this time that I pointed the object out to my Uncle - I believe he saw it briefly and tried to watch it with me but was busy trying to maneuver and drive on a very rough 4 wheel drive road, but told me to keep watching it. It seemed very large to me - at least 100 feet long. I was looking at it from the side for the most part but it did seem to have somewhat of disc shape as it began ascending. At this time in my childhood I had heard very little of UFO's but was still utterly fascinated while watching this thing and just really wanted to figure out a normal explanation for what it was. I kept thinking it must be some kind of strange helicopter but as I continued to watch it - knew that it could not be. After stair stepping to an elevation of several thousand feet, it hovered for a moment longer and then suddenly took off at a very steep angle to the east. It was gone in the blink of an eye. Afterwards I was very excited and told the whole family about it when we got to our cabin. It has been 34 years since I witnessed this object but have been an avid daytime and nighttime sky watcher every since."],"Date of the Event":"04/30/1974 10:00 UTC","City":"Medicine Bow","Disposition":"Unresolved","Longitude":"-106.204738","files":["/var/www/straped/mufon/html2text/13898.html.txt","/var/www/straped/mufon/org/13898.html"],"Weather Factors":"None","Latitude":"41.895521","Date Submitted":"04/30/1974 10:00 UTC","Object Shape":"Disc, Square, Rectagular, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.895521,+-106.204738(13898)&iwloc=A&hl=en\"> mufon case (13898) map </A>","Object Flight Path":"Stationary,Hovering then path","Region":"Wyoming"}