{"Disposition":"Unresolved","Sighting Duration":"00:05:00","Source":"MUFON","Longitude":"-83.182705","Object Shape":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"06/16/2001 11:30 UTC","Country":"United States","Log Number":"","trends":["There has been one other sighting in Oak Park","There were no other sightings in Oak Park on or around June 16th 2001"],"divs":["sighting detailswitnesss account:at around 2330 on 6\\16\\01 i took my two dalmations out for a briefwalk. i live on a corner lot next to a large park. i was standing at thecorner waiting for my dogs to catch up, when i saw what i thought was alightning bug across the street at the park. i followed this green\\yellowish light as it went streight up slowly. when i first saw it, thelight was already above the tree line, so i couldnt tell how close itwas. i thought it odd that it wasnt flickering, just getting smaller. then thelight started moving south to north. i never heard a sound as it flew itscourse. i thoughtit must be a heliocopter and didnt take my eyes off of it because ithought it was interesting that i couldnt hear it yet. as it got midwaybetween the park and my house i could tell that it was not assending anylonger and i could see some reflection from the city lights on theunderside of the craft. its then when i couldnt belive what i wasseeing. i saw a round saucer shape with only one green yellowish lightat the rear of the object. as it went north ii was able to follow itnorth untill it slowly went out of sight. i thought to myself, did ijust see what i thought i saw! i could not tell how high the craft was,how fast it was moving, or hear any sound at all. i do know that thecloud deck that night was around 8000 ft asl. and winds aloft were lessthan 5 knots. the craft never went behind the clouds the whole time thati saw it, so i know it was under 8000 ft. i,ve never seen anything likethis before....ever!"],"Object Flight Path":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/1389.html.txt","/var/www/straped/mufon/org/1389.html"],"City":"Oak Park","Date Submitted":"06/16/2001 11:30 UTC","Object Features":"Undisclosed","Summary":"Green-Yellowish Light seen in Oak Park, Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.45948,+-83.182705(1389)&iwloc=A&hl=en\"> mufon case (1389) map </A>","Case Number":"1389","Tags":"City","Region":"Michigan","Latitude":"42.45948"}