{"Weather Factors":"Unknown","Case Number":"13899","Object Shape":"Disc","City":"Plainsboro","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.338254,+-74.585292(13899)&iwloc=A&hl=en\"> mufon case (13899) map </A>","Latitude":"40.338254","Date of the Event":"11/22/2008 11:30 UTC","Date Submitted":"11/22/2008 11:30 UTC","trends":["There has been one other sighting in Plainsboro","There were no other sightings in Plainsboro on or around November 22nd 2008"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Region":"New Jersey","Log Number":"US-11222008-0014","Summary":"3 people witness disc like object in Middlesex county N.J.","files":["/var/www/straped/mufon/html2text/13899.html.txt","/var/www/straped/mufon/org/13899.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving with my wife and mother in law in Plainsboro N.J. at approx. 11:30 A.M. on the morning of November the 22nd. We were at a red light at the intersection of Plainsboro rd and Dey rd. facing what I believe to be West. While looking forward at the light, facing what I believe to be West I observed what appeared to be a dark grey disk like object in front of me in the sky, to the West, moving slowly toward the North. There appeared to also be a smaller object, which could have been a plane at a higher altitude and further West as well. I alerted my wife and mother in law, who also confirmed they could see the object. We made the right turn onto Dey rd, and drove toward the next intersection which is Scudders Mill rd and Dey rd. We could still clearly see the object (now to our left), which seemed to hover then initiate a turn to the left or west. It seemed to tip on it's edge when it did this which allowed us to see the shape better and determine there were no wings we could see. At this point the object appeared to be at about 5000 ft or less and one half mile away. A visual estimate would be 100 ft in diameter. We drove on after the light turned green, but as we left visual range, we could still see it moving West. We then were out of visual range as we continued North."],"Tags":"City","Longitude":"-74.585292"}