{"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=38.582762,+-121.48847(13905)&iwloc=A&hl=en\"> mufon case (13905) map </A>","Case Number":"13905","Object Features":"Unknown","Weather Factors":"Unknown","Country":"United States","Region":"California","Viewing Distance":"101-500 Feet","Longitude":"-121.48847","Date of the Event":"11/20/2008 12:00 UTC","divs":["Sighting Details I had told my friend if he ever saw a UFO to make sure he told me right away because I would like to see one. One night while he was visiting with my son they came running out of my sons room yelling get outside quick. So we all ran out the door and and there was a craft that had just flew over the house at a slow speed. I told them I thought It was a scrolling sign for advertising. A couple of days later I found out that many people in the sac. area had seen the craft and it had been caught on film by a local news team. This is what we saw, yet at the time I just thought it was too far away to read the letters. It turns out there never were letters, just lights. My daughter and her boyfriend were in the car at the same time a few blocks away and said that it had a boomerang shape to them. To me it had more of an oblong saucer type shape. If you would like more info I suggest you guys check out News 10 they did some research and as far as I know they haven't come up with any answers from the local airports or bases. Finally saw one."],"Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"11/20/2008 12:00 UTC","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around November 20th 2008"],"City":"Sacramento","Latitude":"38.582762","Log Number":"US-11232008-0002","Tags":"City","Object Shape":"Boomerang, Disc","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/13905.html.txt","/var/www/straped/mufon/org/13905.html"],"Summary":"Lights overhead low in altitude and moving slowly."}