{"Summary":"Bright white steady light from western horizon to zenith, from zenith to eastern horizon turn deep ruby red.","Object Features":"Unknown","Country":"United States","Longitude":"-71.079167","Case Number":"13907","divs":["sighting detailswhile observing after dark in the western sky both jupiter & venus i noticed what appeared to be an aircraft with it's landing lights on. as it approached my position it remained steady without diminishing in brightness nor did i observe aircraft running lights. i then thought it may have been two military aircraft, (hanscom a.b. is only a few miles west from the position i was observing this event) in formation, because, in hot pursuit was an aircraft with it's running lights on, (red and green on wings, strobe). the steady bright light seemed to be moving at a much greater speed than the pursuing aircraft. as the bright light came directly above me at zenith it could be mistaken as a satellite but it's brightness was about twice as bright as venus at this time of night and twice the size. as the object past my zenith and heading east it slowly started to turn a beep ruby red. a red i've never seen from an aircraft, then disappear, vanish. the pursuing aircraft could not catch up with this object and broke off the pursuit after this object turned red and disappeared. the pursuing aircraft then bank left and turn around and headed back west. i could not see the profile of the pursuing aircraft, but the engine sound was distinctly military. approx. 6pm, sat. 11\\22\\2008, weather was clear, cloudless, cold. unobscured view of the sky. place: north reading, ma, off chestnut street, across from harmony vale cemetery, property is raised higher off the street level and about 200 feet back from the road. few lights with little light pollution."],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.575,+-71.079167(13907)&iwloc=A&hl=en\"> mufon case (13907) map </A>","Log Number":"US-11232008-0004","Date of the Event":"11/22/2008 12:00 UTC","Source":"MUFON","Region":"Massachusetts","City":"North Reading","files":["/var/www/straped/mufon/html2text/13907.html.txt","/var/www/straped/mufon/org/13907.html"],"Disposition":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in North Reading","There were no other sightings in North Reading on or around November 22nd 2008"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"42.575","Date Submitted":"11/22/2008 12:00 UTC"}