{"Region":"Pennsylvania","Log Number":"US-11232008-0012","Object Features":"None","City":"Brookville","Sighting Duration":"00:10:00","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.161175,+-79.083092(13915)&iwloc=A&hl=en\"> mufon case (13915) map </A>","Latitude":"41.161175","Summary":"Dark, triangle shaped object with three white lights on each corner","Longitude":"-79.083092","divs":["Sighting DetailsI was looking at the night sky at my cabin near Brookville, PA. From the east, I noticed three star like objects flying in formation very slow (about 25 degrees apart [the width of my hand]). I thought that they were three military aricraft flying in formation at a very high altitude because I heard no noise. I often see passenger aircraft overhead and I have to wait a few seconds to hear it as it flys by. However, this object made no noise at all and I thought it must be fery high as it also moved so slow. However, what I did notice was that the background stars between the lights were not present. That should only mean that the objects (the three points of light) must be one object. It made no noise at all and flew very slow. If it was in fact very high then the object must be extremely large in size! Or, it was not very big but flying silent at a very low altitude. I had my daughter come out and look but I don't think she saw anything and she doesn't remember...she was seven at the time. So I don't know what it was."],"Date Submitted":"05/26/2006 11:30 UTC","Viewing Distance":"Unknown","Country":"United States","Tags":"City","Weather Factors":"Unknown","Disposition":"Insufficient Data","trends":["There have been 3 other sightings in Brookville","There were no other sightings in Brookville on or around May 26th 2006"],"Object Flight Path":"Straight-line path","Date of the Event":"05/26/2006 11:30 UTC","Case Number":"13915","files":["/var/www/straped/mufon/html2text/13915.html.txt","/var/www/straped/mufon/org/13915.html"],"Source":"MUFON"}