{"map":"<A HREF = \"http://maps.google.com/maps?q=42.759285,+-122.485697(13919)&iwloc=A&hl=en\"> mufon case (13919) map </A>","Sighting Duration":"Undisclosed","Latitude":"42.759285","Longitude":"-122.485697","trends":["There have been 7 other sightings in Prospect","There was one other sighting in Prospect on or around November 23rd 2008","This sighting has never been favorited.",""],"Country":"United States","Summary":"Bright sphere object that exploded and drops more spheres.","Date of the Event":"11/23/2008 04:17 UTC","Case Number":"13919","files":["/var/www/straped/mufon/html2text/13919.html.txt","/var/www/straped/mufon/org/13919.html"],"Object Flight Path":"Path with directional change","Weather Factors":"None","City":"Prospect","Tags":"City","Object Shape":"Sphere, Star-like","Disposition":"Unknown","Log Number":"US-11232008-0016","Date Submitted":"11/23/2008 04:17 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsWent outside to have a cigarette with my husband and spotted a bright sphere about 75 degrees up in the sky just to the south of us. It first appeared to be moving to the north west then later started moving to the south. I went inside to grab my video camera and call the kids out to see it also, it took a few minutes to get it in sight on the video camera. We had the telescope out and my son got it sighted in and it had the same smaller sphere circling it like the last one we saw. I could not see it in the video camera and never got a chance to see it in the telescope this time. I had my oldest daughter take photos, my youngest got mad that she could not locate the binoculars, said she was bored and went back inside. About 25-30 minutes into the sighting it got bright and in the camera you could see debris coming out the back of it and more sphere like objects appeared to come out of it. We could not see it any longer with our eyes though we still could see it on the video camera. My son lost sight of the object and couldn't find it again after it \"exploded\". He was also taking pictures with my oldest daughter's camera. I imported part of the video to my computer and it is 517MB and it did not want to go through the first time that I attached it. So I reduced the size in movie maker to 10MB, but I will get the full video on a dvd disc and mail it tomorrow."],"Source":"MUFON","Object Features":"Appendage(s)","Region":"Oregon"}