{"Disposition":"Insufficient Data","Date of the Event":"06/20/1964 12:00 UTC","Tags":"City","divs":["Sighting DetailsMy uncle and I are at the Gorge Dam powerhouse. He is just inside talking to the electrical engineer creating power for the grid at a panel next to the turbines. The huge disc on edge comes down and around in front of the powerhouse and lays down flat hovering above the water in front of the powerhouse and begins taking energy from the grid causing the alarms to start making the engineer immediately make more power. I am at the exterior door in front of the powerhouse on a landing above stairs watching the disc from thirty feet away. Right away a row of windows appear to open all the way around the lower portion of the disc which is about 100 feet in diameter and thirty feet thick. I see many dark colored small human looking occupants looking at me and moving aside so that others take turns looking at me. They seem to smile at me and I feel they like me. I am trying to get my Uncle to come to where I am and look but he is talking to the engineer whom is anxiously working. I see a whirling motion in the water below the disc and it is humming lightly and then the outside edge in two places like rings begin to counter rotate increasing in speed and the windows close. I yell at my uncle that he is going to miss it if he doesn't come. Just as he comes to my side the disc moves away and up to just above tree level of the nearby forest covering the residences of Newhalem and I see a clear dome on the top of the disc with two brightly dressed occupants shaped like humans but they are not inside the dome I believe are piloting it slowly away from us. It flys directly over my uncles house in Newhalem and I tell him it is a UFO. He is a Christian and tells me it is made by the Russians and threatening the dam. As we are watching the disc an Air Force RF-101 jet flys around in front of the powerhouse and lights its afterburners knocking out some of the powerhouse windows. My uncle thinks it is a Naavy jet from Oak Harbor. I tell him no, I have bubblegum cards with the RF-101 on it. The jet tries to get close to the disc. The disc moves about five miles in two seconds and easily gets away.The FBI is called after we find my aunt and others whom it flew over crying. End."],"Summary":"Large occupied disc taking energy from Gorge Dam Powerhouse near me.","City":"Newhalem","Country":"United States","Date Submitted":"06/20/1964 12:00 UTC","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=48.673889,+-121.246111(13918)&iwloc=A&hl=en\"> mufon case (13918) map </A>","trends":["There have been no other sightings in Newhalem","This sighting has never been favorited."],"Case Number":"13918","files":["/var/www/straped/mufon/html2text/13918.html.txt","/var/www/straped/mufon/org/13918.html"],"Viewing Distance":"21-100 Feet","Latitude":"48.673889","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Dome, Patterned Surface","Log Number":"US-11232008-0015","Weather Factors":"Unknown","Object Shape":"Disc","Object Flight Path":"Hovering then path","Longitude":"-121.246111"}