{"divs":["sighting detailson a normal route with post-office mail, ie from peterborough to kings lynn norfolk, noticed brilliant illumination of coloured lights less than quarter a mile away. the road i was travelling on (the a47) was unaturally lacking traffic, the time was approaching 2045, the normal time i usually reached this part of the road system. i first observed on closer inspection, now only yards away. a object quite static and settled upon the field to my right. i instictively slowed the post-office vehicle down to a stop and looking through the drivers side-window saw the following,, { now some 25ft away) a cage shaped multi-coloured highly luminous object. about 8ftsquare. there was a very noticeable sequence of lights rotating around its bars..and they pulsated in green\\blue\\red fashion, that is to say each independent bar on this cage-formation turned on and off at great speed. at this point i decided to take a closer look. after releasing the foot-security door-lever i pulled the door open and stepped out. again :supisiously: there was no car movement moving up or down this a47 road, there was no audible sound whatsoever. i proceeded across towards the fields fence so was then approx 18 or twenty feet from this :object?: my right eye was smarting terribly and i needed to rub it to move the blur from my sight. i stopped unafraid and observed. there was no top or bottom to this object just the rotating bars around its cubed form. it was roughly 8ftsquare. the lights had dimmed or i imagined they had, again no sound just colour. after perhaps two-mins the craft? rose upward, again without sound. it ascended to forty feet and then dissapeared, as though into a time-corridoor. the weather conditions were perfect. no clouds clear wonderful night sky. the craft\\object did not ascend up into the heavens, i watched it de-materialise. for a moment i collected my thoughts then returned back to my van.still there was no traffic. i resumed a steady drive to kings lynn sorting office and said nothing to no one about the experience."],"Summary":"Whilst driving post security van noticed very illuminated object to my right landed as it were to the edge of a field, slowed down van to investigate.","Log Number":"GB-11232008-0007","Region":"England","Date of the Event":"09/03/1983 08:45 UTC","files":["/var/www/straped/mufon/html2text/13910.html.txt","/var/www/straped/mufon/org/13910.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.75879,+0.402154(13910)&iwloc=A&hl=en\"> mufon case (13910) map </A>","Disposition":"Unresolved","Longitude":"0.402154","Sighting Duration":"00:08:00","Weather Factors":"None","Country":"United Kingdom","Source":"MUFON","trends":["There have been 3 other sightings in King's Lynn","There were no other sightings in King's Lynn on or around September 3rd 1983"],"City":"King's Lynn","Object Flight Path":"Stationary","Viewing Distance":"20 Feet or Less","Tags":"City","Object Shape":"Square, Rectagular","Object Features":"Other","Date Submitted":"09/03/1983 08:45 UTC","Case Number":"13910","Latitude":"52.75879"}