{"Summary":"Three bright hovering lights seen from portland, oregon","Longitude":"-122.668387","Disposition":"Insufficient Data","Date Submitted":"11/23/2008 05:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.531832,+-122.668387(13929)&iwloc=A&hl=en\"> mufon case (13929) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Latitude":"45.531832","Viewing Distance":"Over One Mile","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around November 23rd 2008","This sighting has never been favorited.",""],"Country":"United States","Tags":"City","divs":["Sighting DetailsSaw three very bright, still moving lights looking SSW rom 39th street in SE Portland, as I was driving to see a friends house. At first I thought it was Jupiter and Venus, which were visible low on the horizon, but then saw these three lights in the sky at the same time. They were very bright and motionless, at first I thought they were airplanes but two of them remained motionless and did not increase in size as a moving airplane would. They caught my eye because of the intensity of the lights and their still positions. Same time saw a slow moving airplane very quietly moving around in the same area. I called my girlfriend to witness my account, she told me to take a pic but my camera doesn't do well with pinpoint lights at night. I was going to let it slide, but then saw a similar report and decided to collaborate. I was very excited and felt I had witnessed something unusual. As I was driving trees and small hills obscured my view and I had to pull off and park to get a good view of it."],"Date of the Event":"11/23/2008 05:55 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Sphere, Star-like","City":"Portland","Object Flight Path":"Stationary","Region":"Oregon","Log Number":"US-11242008-0009","Case Number":"13929","files":["/var/www/straped/mufon/html2text/13929.html.txt","/var/www/straped/mufon/more/13929_submitter_file1__CMS13929UFOdrawing.jpg","/var/www/straped/mufon/org/13929.html"]}