{"Region":"Maine","Country":"United States","Date of the Event":"01/10/1977 09:15 UTC","divs":["Sighting Details This took place in Turner, Me. around Jan. 10,1977. Night was crystal clear, temp approx. 10 degrees F. At about 9 or 9;15 p.m., as three friends were leaving, my wife & I stepped out to enjoy the night and say goodby. One of the others said to look at a sattelite going over. I knew it was too late to see any, thought it might be plane.Light was brighter than Sirius,(I always look at Orion in winter) going almost due north. The object suddenly stopped, made an almost 90 degree turn, then stopped again. It continued to move at odd angles & at varying speeds. This went on for several minutes 5-10. Object then diminished Extremely rapidly, as if receding or shrinking. During the entire time there was no sound. We all were exited, talked about it for several days & have told this many times over the years. In 2005, after not hearing from one of these freinds in more than 20 years, The first thing he said was \"Hey, remember that u.f.o.?\" It left a lasting impression on all of us! As the object was silent against a starry background we couldn't guess at size or distance."],"Date Submitted":"01/10/1977 09:15 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Case Number":"13923","Summary":"Star-like object moving erratically,no noise.","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.259049,+-70.252907(13923)&iwloc=A&hl=en\"> mufon case (13923) map </A>","Longitude":"-70.252907","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/13923.html.txt","/var/www/straped/mufon/org/13923.html"],"Log Number":"US-11242008-0003","Latitude":"44.259049","trends":["There has been one other sighting in Turner","There were no other sightings in Turner on or around January 10th 1977"],"City":"Turner","Tags":"City","Weather Factors":"None","Object Features":"None","Source":"MUFON","Object Shape":"Star-like"}