{"Log Number":"US-11242008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=37.975119,+-87.56889(13927)&iwloc=A&hl=en\"> mufon case (13927) map </A>","Date Submitted":"10/10/2008 03:30 UTC","Latitude":"37.975119","trends":["There have been 27 other sightings in Evansville","There was one other sighting in Evansville on or around October 10th 2008"],"Case Number":"13927","Date of the Event":"10/10/2008 03:30 UTC","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","City":"Evansville","Disposition":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailshi, i am wondering if there have been any recent reports of old satellites re-entering the atmosphere. i believe it was friday afternoon 10-10-08 somewhere between maybe 14:45 and 16:45. i was on my front porch and observing the high flying jets that cross overhead daily here in evansville. i noticed a very bright whitish light moving slowly from an easterly direction to a southwesterly direction, apparently at very high altitude. what was odd about this is that while i was watching this object, i also noticed jets flying in the same close area of the sky. while i could see the wings on the jets, i could see no wings on the bright object. i also noticed that the speed of the object relative to the jets was very slow. i am guessing it took maybe 4 minutes for this object to travel approximately a 60 degree field of view. neither the jets or the object were leaving any visible contrail. i have observed the shuttle\\iss traveling overhead two different times, and it seems that this object was moving slower across the sky, but it was just as bright. one other thing, as this object moved towards the sun, it remained at the same brightness. i went inside my house to get a pair of small binoculars and was unable to find them so i went back out on my porch to try and locate this object again, but by that time it had passed from my view. i am wondering if this might have been space junk re-entering the atmosphere, the shuttle\\iss going overhead (the two times i saw this the shuttle\\iss was going in an easterly\\southerly direction) or maybe the much blamed weather balloon. or could it have been something else? i am kind of ruling out a meteor as this object was going way too slow and not leaving any kind of trail."],"Summary":"Unknown light crossing sky during early afternoon.","files":["/var/www/straped/mufon/html2text/13927.html.txt","/var/www/straped/mufon/org/13927.html"],"Longitude":"-87.56889","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Region":"Indiana","Object Shape":"Star-like, Unknown"}