{"Date Submitted":"11/23/2008 06:10 UTC","divs":["Sighting DetailsAt first sight 3 bright white lights were vey low and in a triangular shape from point to point. Keeping their exact position (in relation to distance apart from the other) two lights moved South. The third moved North but we were on the freeway southbound so couldn't see where it went. I noticed them because it worried me that planes were that low were flying that close to each other. We soon realized they were unlike any planes we have ever seen before because they could stay still. We wondered if they could be blimps. Oddly, we did see an airplane and a chopper flying at what seemd to be a fairly close distance, close enough they would have to had seen them. The question remains, what were these unbelievably bright lights hanging motionless in the sky and why aren't we hearing anything on the news?? Surely many others saw this as we were not alone on the freeway. Going out periodically to check, it seemed from my new vantage point (my mom and dad's place) that they were almost directly above the Willamette river in Canby or perhaps a little further SW. Whatever it was it was nothing we have seen before. We would like to note we aren't claiming we saw aliens. We ARE saying we saw something in the night sky that was very unusual to us"],"Longitude":"-122.670207","Case Number":"13921","files":["/var/www/straped/mufon/html2text/13921.html.txt","/var/www/straped/mufon/org/13921.html"],"Latitude":"45.530692","Date of the Event":"11/23/2008 06:10 UTC","Summary":"On I 205 S. three very bright lights were fixed in sky at very low altitude. Too dark to see more than the bright white light.","Source":"MUFON","City":"Portland","Disposition":"IFO","Viewing Distance":"Unknown","Object Features":"Unknown","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around November 23rd 2008"],"Sighting Duration":"Undisclosed","Region":"Oregon","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","Object Shape":"Triangle, Unknown","Tags":"City","Country":"United States","Log Number":"US-11242008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=45.530692,+-122.670207(13921)&iwloc=A&hl=en\"> mufon case (13921) map </A>"}