{"City":"Marietta","Object Shape":"Diamond, Triangle","Case Number":"13925","map":"<A HREF = \"http://maps.google.com/maps?q=33.937045,+-97.116679(13925)&iwloc=A&hl=en\"> mufon case (13925) map </A>","Latitude":"33.937045","Date of the Event":"11/20/2008 05:45 UTC","Region":"Oklahoma","Source":"MUFON","Country":"United States","divs":["Sighting Detailsnorth bound I35 in a 60 mile an hr. big truck north of the cassino at thackerville oklahoma. that's just over the texas boarder. I came upon some flashing lights on the side of the hiway. very strange,they didn't fit in with the surrounding's. as i got closer I could see they were airborn hoverying over the tree's just east of the roadway,my right side.maybe 30 yards off road and 100 ft. up in the air kinda nestled in the tree line but in plain site.it just hung there like it was watching traffic go by.it had three large dull white lights with two small white lights on either side of the big light.it appeared trianle shaped in the soft glow of the flashing [one second interval] light's.the light's were positioned under the point's of the triangle not on the sides,also they were angled downward about 30 degree's.the overall size of the objet was maybe 100 feet from end to end,not much longer than my big truck with 53 ft. trailer as far as I can guess.these big light's by the way,were as big as one of those large round bail's of hay you see in the pastures out there. at least that big. the structure of the craft was of a black metalic nature and not smooth in all places.it had a lot of hardware looking texture to it so to speak. hard to describe.it didn't have piont's at the triangle tip's either.the piont's were not point's at all but instead recessed like some kind of vent system or exhaust maybe.very menacing and strange to see. I never saw it move and I was like a deer in the headlight's,had too make myself pull over but had already past it so I looked back and it was still there. I was at a loss,I couldn't go backward. someone else had to see this thing,there was light to medium traffic in both direction's. I travel that way alot and had never seen anything like this in the area before. I wish I had stopped right there and could have gotten a picture but no camera in my possesion and i really could't believe I was actually seeing what I was seeing. a once in a lifetime event and I drove rite by !"],"Object Features":"Patterned Surface, Appendage(s), Louvres, Unknown","Log Number":"US-11242008-0005","files":["/var/www/straped/mufon/html2text/13925.html.txt","/var/www/straped/mufon/org/13925.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"11/20/2008 05:45 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Other","trends":["There have been no other sightings in Marietta","This sighting has never been favorited."],"Longitude":"-97.116679","Summary":"Small hovering craft with large, dull white flashing lights angled 30 degrees downward located under tri points.","Tags":"City","Sighting Duration":"00:01:30","Disposition":"Unknown"}