{"Date of the Event":"11/23/2008 08:05 UTC","Latitude":"43.368521","Object Shape":"Boomerang","Longitude":"-124.21677","trends":["There have been 10 other sightings in Coos Bay","There were no other sightings in Coos Bay on or around November 23rd 2008"],"Summary":"Fast as a meteor.","Region":"Oregon","Object Flight Path":"Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.368521,+-124.21677(13920)&iwloc=A&hl=en\"> mufon case (13920) map </A>","Case Number":"13920","Log Number":"US-11232008-0017","Source":"MUFON","City":"Coos Bay","Weather Factors":"None","Object Features":"None","Tags":"City","Date Submitted":"11/23/2008 08:05 UTC","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Insufficient Data","divs":["Sighting Detailsi just got home and let the dog into the backyard which faces west. it was clear out. i love looking at the stars and looked up about 45 degrees due west. all of a sudden i thought i was watching a meteor. which is cool. it was heading north. it was near the normal jet traffic height and direction here on the coast. it was too fast for a jet. i noticed shortly after first noticing it that it had 5 white lights underneath it in a v or boomerang configuration. the lights were constant and not blinking. when it reached a northwestern position, it veared left or west in a gradual curve the vanished. this all happened in about a 30 second time span or less. it was perfectly quiet. i went in and told the wife about what i saw and thought i was nuts. i know what i saw. it was not a typical jet. it was not a meteor. it was not a satellite either. i've seen lots of all these things. i felt elated enough to write you guys. which i have never done. there was no time for a camera. it was just good timing and luck, i think. i'm 44 years old. married, quite sane and have lived here most of my life. i have a great eye for detail also. thank you for your time. hope this is of use."],"files":["/var/www/straped/mufon/html2text/13920.html.txt","/var/www/straped/mufon/org/13920.html"],"Sighting Duration":"00:00:30"}