{"Disposition":"Insufficient Data","Tags":"City","Source":"MUFON","Longitude":"-82.989574","Latitude":"39.968636","Object Features":"Unknown","divs":["Sighting DetailsI live in a below-ground apt. in the rear of the building, which faces the parking lot and a small wooded area...On Sunday, Nov. 23, at 6:30 am, I was just sitting down to turn my TV on, when out of the corner of my eye I saw a very large, bright light go from the right of my living room window to the left - it moved in a steady motion, from right to left, then was gone..I could see the light thru my draperies and it was very bright...I knew it could not be a car as cars have to park facing the opposite direction, & no car would have lights that big or bright..I went to the window to see what was happening, and there was nothing in sight....there was no sound of any kind.....in the past, we've had helicopters fly over the area, which of course make noise; however, their searchlights are smaller, as they are above the treeline....this object appeared as though it was going right by the building - it was not in the sky.....it was a rather large light; if I had to give a size estimate, I'd say it had to have been about six feet in diameter...again, I got the impression that it was a circular object, as seen thru my (very light weight!) drapes.......I was more amazed than anything, especially when I could not see anything in sight, even at a distance, (such as something flying away)."],"Region":"Ohio","Log Number":"US-11242008-0006","Case Number":"13926","Weather Factors":"None","Date of the Event":"11/23/2008 06:30 UTC","City":"Columbus","Country":"United States","Summary":"Very bright light seen thru drapes; appeared to be round.","Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:05","map":"<A HREF = \"http://maps.google.com/maps?q=39.968636,+-82.989574(13926)&iwloc=A&hl=en\"> mufon case (13926) map </A>","Object Shape":"Circle","Date Submitted":"11/23/2008 06:30 UTC","files":["/var/www/straped/mufon/html2text/13926.html.txt","/var/www/straped/mufon/org/13926.html"],"trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around November 23rd 2008"]}