{"Tags":"City","files":["/var/www/straped/mufon/html2text/13930.html.txt","/var/www/straped/mufon/org/13930.html"],"Date of the Event":"09/16/2008 07:00 UTC","Object Shape":"Sphere","Region":"Vermont","Country":"United States","Latitude":"43.646227","Object Features":"None","divs":["Sighting DetailsI was driving south on I-89 during the evening of September 16 of this year to pick my wife up at Dartmouth Hitchcock Medical Center when I noticed a dark object in the sky ahead of my position. It was moving in the same direction as I was traveling. The setting sun was brightly illuminating the sky as I was trying to determine what I was seeing when my eye caught a brillient (can't quite find the right desciptive term) shining sphere to my right moving quickly (not incredibly fast) to my left. It was perfectly smooth on the sunward side , moved absolutely straight and did not change speed or coarse the entire time it was in view , from horizon to horizon. This object was approximatley at the same altitude as the first. About half way between me and the first. But it was moving at a right angle to the first. As I continued down the interstate I caught up to the first object and discovered it was a hot air baloon. Whith leaves me with nagging questions. With the baloon in the background it lends scale to the sphere, I estimate it to be 4-6 feet in diamiter. Whitch would be a large mylar baloon and if a baloon why was it going noticeably faster than the known hot air baloon and at a 90 degree angle to it."],"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been no other sightings in Hartford","This sighting has never been favorited."],"Disposition":"IFO","Sighting Duration":"Undisclosed","Summary":"I observed a shiny metalic sphere (it had no detail and was highly reflective) moving quickly across the sky as I drove.","Weather Factors":"None","Source":"MUFON","Log Number":"US-11242008-0010","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.646227,+-72.41861(13930)&iwloc=A&hl=en\"> mufon case (13930) map </A>","Case Number":"13930","Date Submitted":"09/16/2008 07:00 UTC","Longitude":"-72.41861","City":"Hartford"}