{"map":"<A HREF = \"http://maps.google.com/maps?q=40.586258,+-98.389873(13936)&iwloc=A&hl=en\"> mufon case (13936) map </A>","Object Features":"Unknown","Latitude":"40.586258","Region":"Nebraska","Weather Factors":"Unknown","Log Number":"US-11242008-0016","Source":"MUFON","Object Flight Path":"Path then hovering","Date of the Event":"11/23/2008 12:00 UTC","Date Submitted":"11/23/2008 12:00 UTC","Viewing Distance":"20 Feet or Less","Disposition":"Insufficient Data","Summary":"A green light flew over my head then came back and shined on the side of my garage.. rabbit dead","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/13936.html.txt","/var/www/straped/mufon/more/13936_submitter_file1__dog046.jpg","/var/www/straped/mufon/more/13936_submitter_file2__dog047.jpg","/var/www/straped/mufon/more/13936_submitter_file3__dog048.jpg","/var/www/straped/mufon/org/13936.html"],"Country":"United States","City":"Hastings","Case Number":"13936","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Hastings","There were no other sightings in Hastings on or around November 23rd 2008","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting DetailsSo, last night I had went outside to check on my rabbits that are in a hutch up against my garage. I was getting their water bottles and I seen something fly by my head just over the top of our privacy fence. It sort of looked like a bat flying really fast so I didn't think anything of it. Well, I seen it fly back in front of me going the opposite direction, in the way it came the first time. Still, didn't think anything of.. I grabbed the bottles and was getting ready to come back into the house when I looked up on the side of the garage and there was a small, approx 2 inch in diamater circular light shinging on it.. Actually, it was more l like bouncing around on the side of the garage. I looked all around because I thought it was someone with a flashlight, which didn't make sense because it was green, and I saw no one. At one point I think I actually seen the light shine on my jacket and I got a little freaked out and walked to the other side of the yard. Again, still thinking someone was shining a flash light. Well, as soon as I walked to the other side of the yard I looked and the light was gone from the side of the garage. We have a privacy fence so it would be hard for even a neighbor to shine a light on me or the spot the light was on. I thought it was strange but came back inside, told my girlfriend and that was that. Well, I went outside today to play with my dogs and I seen my baby rabbit sitting down in the cage. I walked over and I noticed he wasn't moving. It's because he was dead!!! He was sitting up against the door of the hutch like he was just laying down taking a rest, his eyes were open.. everything looked fine at first. except for the fact he was stiff and dead. As I looked closer, the right half of his ear was gone. It looked like it had been cut off. And, after we got him out, on his left hind leg there is a small spot where his fur is missing. The fur has been perfectly removed. There isn't one hair in this spot left, yet the skin hasn't been broken at all. You can see all of his muscles, his veins, etc. There was only one drop of blood which was on the door of the hutch and that's it. He is in with his mother and at first I thought maybe she killed him, but I find it odd that he's been in with her for two weeks now and last night he was just fine when I seen the light and now today hes dead with these mysterious things wrong with him. If I can post pictures, I will. It's just strange for this to be a coincidence. I don't know if I should freeze the rabbit, if anyone could do any kind of testing on it or what. Maybe I'm overreacting, but if you had seen the light I saw and the thing fly over your head, you would wonder too.. Anyone have any ideas? ps the rabbit has something coming out of his nose.."],"Longitude":"-98.389873"}