{"Latitude":"39.33647","Weather Factors":"Unknown","Log Number":"US-11242008-0017","files":["/var/www/straped/mufon/html2text/13937.html.txt","/var/www/straped/mufon/org/13937.html"],"Region":"Ohio","Tags":"City","Case Number":"13937","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","divs":["sighting detailsi was letting my dogs out after just arriving home. it was a beautiful, clear night so i was admiring the early evening view. that is when i spotted a light that was not blinking -- unlike all the other flying objects i ever see over my house. the light had somewhat of a floodlight appearance emanating from it (i could make out a vague funnel of light), but it flared out quite wide, it was not a focused beam\\tight-funnel like a spotlight. i expected to hear some distinct engine noise as the light was brighter than the other air traffic. it's altitude was difficult to judge, but it was flying higher than normal local private plane and helicopter traffic, but seemed lower than airliners from\\to columbus. i could not make out any shape, it was just a bright light. the sky was clear and cloudless, the object was brighter than an airliner, and at one point from my vantage, it looked to pass below an airliner. the only sounds i heard were the distant rumble of airliners (no helicopter beating, or anything else out of the ordinary). i could see two airliners in the same portion of the sky when this object was visible. one airliner was heading n-nw towards columbus, the other was moving se away from columbus. this object was headed ne, moved in a straight line, and stayed a constant speed, until it eventually moved beyond my sight."],"Disposition":"IFO","Object Shape":"Other","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around November 23rd 2008"],"Date Submitted":"11/23/2008 06:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.33647,+-82.096415(13937)&iwloc=A&hl=en\"> mufon case (13937) map </A>","City":"Athens","Sighting Duration":"Undisclosed","Longitude":"-82.096415","Date of the Event":"11/23/2008 06:45 UTC","Summary":"Bright, non-blinking light -- didn't look like normal air traffic."}