{"Log Number":"US-11242008-0019","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"11/23/2008 06:30 UTC","City":"Corvallis","Latitude":"44.564566","trends":["There have been 5 other sightings in Corvallis","There were no other sightings in Corvallis on or around November 23rd 2008"],"Object Features":"None","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13939.html.txt","/var/www/straped/mufon/org/13939.html"],"Sighting Duration":"Undisclosed","Region":"Oregon","Source":"MUFON","divs":["Sighting DetailsAt about 18:30 pm I was standing on the back deck of my house in full darkness observing the night sky. The Milky Way was visible, and numerous distinct stars. I saw a small meteorite streak & burn up. About 2 minutes later, a round glowing object about the size of a distant star moved across the sky very fast, high, and without a sound. It eminated a steady white light, but also rhythmically flashed red light as it moved from the SW to the NE in a straight trajectory very quickly. Then 1 to 2 minutes later, a large bright white object appeared from the SW and also moved very fast NE in a straight path which seemed to pursue the first object. It seemed to be several miles in altitude, but was fully at least 10 times brighter and larger in diameter than the brightest star. It too moved completely silently across the sky. My house is in the country, and except for 2 dogs barking in the distance, no sound was heard. This object definitely was not a satellite nor a plane. Both objects seemed to take up a stationary position, in a triangular configuration with a star, in the NNW sky, perhaps 20 to 30 degrees elevation from horizon. The largest object continuously pulsated white, green, red, blue, as did the smaller object. I watched for 10 minutes and then left the property. Have there been any other reports of these 2 anomalies?"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.564566,+-123.262044(13939)&iwloc=A&hl=en\"> mufon case (13939) map </A>","Tags":"City","Date of the Event":"11/23/2008 06:30 UTC","Longitude":"-123.262044","Country":"United States","Case Number":"13939","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Summary":"Bright white round light moved fast & silent from SW to NE in straight trajectory","Object Shape":"Other"}