{"Date of the Event":"10/28/2008 11:30 UTC","files":["/var/www/straped/mufon/html2text/13938.html.txt","/var/www/straped/mufon/org/13938.html"],"Disposition":"Unresolved","Country":"Denmark","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsMe and some friends went on a trip to Denmark. A close friend (I'm going to call him John) told me (a few weeks before this happened) that he saw strange objects in the sky back in Sweden. I believed him and got interested. So that night in Denmark, me and John were the only ones awake. All my other friends were asleep so me and John decided to go to the beach wich was located less than 40 yards from our hotel. The main reason was to search for UFOs, becaus John just had a feeling that something was going to show up in the sky. So we went down to the beach and stood there looking up in the sky for about 10 minutes. What happened after those 10 minutes was the wierdest thing that had ever happened to me. We saw a HUGE flash that lit up the whole sky and the whole beach. The flash just came from nowhere and the night literally became daylight for about 2 seconds and then everything went dark again. Suddenly everything became even more interesting. I wasn't scared, I was amazed. John had seen this flash three times before so he didn't react in any special way. He just told me to keep looking up in the sky. So we stood there again, looking at the same part of the sky and a few minutes after the flash a strange \"light ball\" appeared in the sky. We both saw it and reacted at the same time. I don't know how to describe the motions of the object in a good way, but it was almost as if the ball was going down towards the water. It went in a vertical direction. It's really hard to explain but I tried my best. Anyways, the \"light ball\" went extremely fast from point A to point B in 1 second and then dissapeared. We continued looking up and we stood there for almost an hour before another \"light ball\" appeared again. But this time the distance between point A and point B was bigger, I mean the ball flew a longer distance before it dissapeared again and it flew in a vertical direction just like the earlier one. I couldn't see the actual shape of the object since the light coming from the object was very bright. I just saw the object like a ball-shaped thing. After this we stood on the beach for one hour but nothing happened. It was really cold outside so we went back to the hotel and went to bed. But believe me, if the was better we would sit there on the beach the whole night. I tried to explain everything as detailed as I could, I hope you understood me. I apologize for my bad English. This is just half of the story. The reason why I don't want to tell you the whole story is becaus it's a really wierd story wich started more than a month before this event and the story is out of this world so I guess people wont believe me if I tell it. It's pretty sick, trust me you're not going to believe me. If you wanna hear the story anyways you can contact me on my email."],"City":"Blokhus","Object Flight Path":"Path with directional change","Longitude":"9.584375","Region":"Nordjylland","Summary":"A flash that lit up the whole sky followed by two extremely fast UFOs.","Log Number":"DK-11242008-0018","Sighting Duration":"02:00:00","Weather Factors":"Windy, Medium","Case Number":"13938","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=57.251395,+9.584375(13938)&iwloc=A&hl=en\"> mufon case (13938) map </A>","Latitude":"57.251395","trends":["There have been no other sightings in Blokhus","This sighting has never been favorited."],"Date Submitted":"10/28/2008 11:30 UTC","Object Shape":"Flash, Unknown"}