{"Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 6 other sightings in Gainesville","There were no other sightings in Gainesville on or around November 21st 2008"],"Weather Factors":"None, Does Not Apply","Date Submitted":"11/21/2008 09:00 UTC","Country":"United States","divs":["Sighting DetailsI was outside having a cig and I was like man I wish you guys(the visitors) would show yourself...and after I got done saying this I saw a light in the norther part of the sky threw the trees coming my way. I thought at first it was just a plane the as it got closer i thought different. My fiance doesnt believe in ufos or aliens and when i saw this i ran inside to get her and she was like what is that? i told her to listen,do you here any sound from it she said no! i told her for a craft that size and as close as it was to us we should be hearing it. and she said yeah,you would think you would.? after that the object moved away from left to right and dissapeared over the trees and where i was standing i could no longer follow the object. ive seen more stuff in the sky at my house as well on one insident it was a black ball looking thing and it moved silently threw the sky. the next day there was a black helecopter flying around the area in a leaning position as if it was looking for something. it done this for about 10 minutes and dissapeared."],"Tags":"City","Object Shape":"Other","Date of the Event":"11/21/2008 09:00 UTC","Object Features":"Unknown","Sighting Duration":"00:02:00","Source":"MUFON","Longitude":"-83.817206","Region":"Georgia","Latitude":"34.298979","map":"<A HREF = \"http://maps.google.com/maps?q=34.298979,+-83.817206(13942)&iwloc=A&hl=en\"> mufon case (13942) map </A>","files":["/var/www/straped/mufon/html2text/13942.html.txt","/var/www/straped/mufon/org/13942.html"],"Log Number":"US-11242008-0022","Object Flight Path":"Straight-line path","City":"Gainesville","Case Number":"13942","Summary":"like a plane but made no sound. it had a tail like a plane that was alluminated,and had 2 white and 1 red light flashing on it.","Disposition":"IFO"}