{"Summary":"extremely bright, moving quickly and leaving a trail...it exploded in a flash and disappeared","Latitude":"40.20472","map":"<A HREF = \"http://maps.google.com/maps?q=40.20472,+-77.18828(13946)&iwloc=A&hl=en\"> mufon case (13946) map </A>","files":["/var/www/straped/mufon/html2text/13946.html.txt","/var/www/straped/mufon/org/13946.html"],"Country":"United States","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-77.18828","Sighting Duration":"Undisclosed","divs":["Sighting Details The evening of August 3, 2008 at about 10:20 pm my husband and I were sitting outside with our neighbors on their deck when something in the sky off to the East caught our attention. It was extremely bright, multi-colored, moving quickly and leaving a trail...it exploded, or appeared to explode in a very bright flash and disappeared. It was amazing! When I came into the house that night, I began a thread in our local newspaper's forum, to see if anyone else had seen this same thing and if they knew what it was. There were several other people who confirmed that they had witnessed it also. The local paper (the forum is located on the paper's website) ended up doing a story on the \"sighting\" since several people admitted to seeing it also. Through their research they said that it was the International Space Station making a closeby pass. The Space Station theory just doesn't make sense. I don't know if it was a meteor, a bolide or something else but it was very pretty and had a very colorful tail trailing it. I looked up pictures of what the Space Station looks like from Earth as it makes a pass, and it looked nothing like what we saw. To this day we still wonder exactly what it was."],"trends":["There have been 6 other sightings in Carlisle","There were no other sightings in Carlisle on or around August 3rd 2008"],"City":"Carlisle","Date of the Event":"08/03/2008 10:15 UTC","Case Number":"13946","Log Number":"US-11242008-0026","Region":"Pennsylvania","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"08/03/2008 10:15 UTC","Disposition":"IFO","Tags":"City","Object Shape":"Fireball, Flash","Source":"MUFON"}