{"Sighting Duration":"Undisclosed","City":"Kingsland","Longitude":"-81.683756","Date of the Event":"11/24/2008 08:35 UTC","files":["/var/www/straped/mufon/html2text/13948.html.txt","/var/www/straped/mufon/org/13948.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsthis object was a meteor moved at meteor speed from northeast to southwest and was breaking up and burned out at tree line and was yellow in color, typical fireball meteor I've seen them a number of times and even had the chance to see one that was so close you hear it crackeling similar to what sound the space shuttle makes when in accent and a few miles off the deck.. But in this case something odd happened a minute or less later, after me and my girlfriend saw the meteor come down we were talking to eachother about what we just saw and th recent sighting in Canada of a fireball meteor and looking in the same direction we saw a dimmer object same shape, speed as meteor ,leaving the ground moving in the exact opposite direction at a very high rate of speed and just vanished after moving 40 degrees ... This sighting has me puzzled and wondering how this is possible...meteors do move from ground up!"],"Source":"MUFON","Region":"Georgia","Country":"United States","Date Submitted":"11/24/2008 08:35 UTC","Object Features":"Undisclosed","Case Number":"13948","Latitude":"30.802966","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Kingsland","There were no other sightings in Kingsland on or around November 24th 2008"],"Object Shape":"Fireball","Tags":"City","Summary":"A meteor fireball type came down from northeast and moved southwest and a minute later a somewhat dimmer object same speed shape moved from ground to sky in oposite direction \"very strange.\"","Object Flight Path":"Straight-line path","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=30.802966,+-81.683756(13948)&iwloc=A&hl=en\"> mufon case (13948) map </A>","Log Number":"US-11242008-0028"}