{"Source":"MUFON","divs":["sighting detailsi awoke early in the morning.. between 6:00 & 6:30 to let my dog out. seeing as he hadn't awoken yet, i walked by my front door to look out the window to see how light it was. through the long window panel on the side of my front door, i noticed an aspirin sized (size it appeared to be from where i stood) orange\\yellow orbish shape hovering in the sky. it was quite a different shape than a star.. it appeared to flucuate from an upside down bowl w\\ saucer shape to an oval orb..almost as if it were shape shifting. the right bottom side of the object grew brighter as the left side grew dimmer, and then reveresed to the alternate side. it wasn't moving but it wasn't the sun as the it was an hour before sunrise. it didn't appear to be a star either as the sky was lit up with still visible white stars. i couldn't explain what i was seeing other than to \"know\" it was a ufo. all i can say is that i felt it was so beautiful, and i felt at peace, and no hositility or fearfullness from it. i should say i have had a previous, although different encounter of seeing a ufo 18 years previously in the same town. and i know what something that diffies logical explanation looks like. i wanted to take a picture of it, but my spouse had taken the digital camera on an out of town trip the night before!!! i remained very at peace as it was quite lovely and knowing that there was no one i could wake up and show it too, or take a picture of it, i headed back to bed. i felt pretty ill later that morning when i akoke mid sunday morning and strangely enough forgot to mention it to my spouse until 3 days later!!!"],"files":["/var/www/straped/mufon/html2text/13943.html.txt","/var/www/straped/mufon/org/13943.html"],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-84.274713","Date Submitted":"11/16/2008 06:00 UTC","Object Flight Path":"Stationary,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.444276,+-84.274713(13943)&iwloc=A&hl=en\"> mufon case (13943) map </A>","Date of the Event":"11/16/2008 06:00 UTC","Case Number":"13943","Object Features":"Undisclosed","Region":"Florida","Object Shape":"Egg, Oval, Saturn-like, Sphere, Unknown","Tags":"City","Summary":"Orange-Yellow Orb observed in pre dawn sky","Weather Factors":"None","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around November 16th 2008"],"Sighting Duration":"Undisclosed","Log Number":"US-11242008-0023","Latitude":"30.444276","Country":"United States","Disposition":"Insufficient Data","City":"Tallahassee"}