{"Date of the Event":"11/03/2008 04:45 UTC","Object Features":"Unknown","City":"Columbia City","Case Number":"13940","Summary":"It was going east on a downward slide, stopped, backed up a little and went straight down.","Object Flight Path":"Path with directional change","Date Submitted":"11/03/2008 04:45 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.163759,+-85.482623(13940)&iwloc=A&hl=en\"> mufon case (13940) map </A>","Latitude":"41.163759","trends":["There have been 2 other sightings in Columbia City","There were no other sightings in Columbia City on or around November 3rd 2008"],"Source":"MUFON","divs":["Sighting DetailsI was heading down 9 going towards Columbia City. It was around 4:45 AM going to work. I was south of Merriam closer to Columbia City. Not paying too much attention to the sky because I was watching for deer as they often run into the road at that time of the morning! Looking ahead I saw a light in the sky,greenish in color. At first glance I thought it was a shooting star. Then I realized Shooting stars were not that color. It was heading east on a downward slide. It went from the right to the left of me. once it got to the left of me it stopped in mid air, backed up and went straight down. When it stopped ,backed up and went straight down, I knew it was a controled move. As far as I could tell, It landed east of Columbia city. But I couldn't say if it was north or south of it. I'm thinking north. All I was thinking was, what a cool way to start my day! It wasn't until it disapeared that I remembered my cellphone has a camera in it. Since that sighting, I keep my phone in my lap just in case!"],"Region":"Indiana","Weather Factors":"Does Not Apply","Country":"United States","files":["/var/www/straped/mufon/html2text/13940.html.txt","/var/www/straped/mufon/org/13940.html"],"Sighting Duration":"00:00:30","Log Number":"US-11242008-0020","Tags":"City","Longitude":"-85.482623","Object Shape":"Unknown"}