{"Case Number":"13956","Weather Factors":"None","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Date of the Event":"11/23/2008 07:02 UTC","divs":["sighting detailson sunday, nov. 23, 2008 i was driving west on the pennsylvania turnpike from the willow grove exit to the downingtown exit. between the valley forge\\king of prussia exit and downingtown (approximately 13 miles of highway) i saw 7 different ufos that looked the same as each other. they looked like the ones i reported last week. each one was the shape of a trapezoid with rounded edges, with 2 bright \"headlights\" and a dull green light on one back corner and a dull red light on the other back corner. tonight, the red and green lights were pulsing. 7:02 pm mile marker 325 moving right to left across turnpike (south). i passed directly underneath the object as it moved. it was quite slow- maybe 20 miles an hour. 7:05 mm322 didn't note where it was moving 7:08 mm319 ufo to the left (south) of the turnpike. saw it at the same time i was seeing the next one. this one was near mile marker 319. 7:08 mm320 ufo a little to the left (south) of the turnpike\\crossing over (heading north), higher up than the others, moving to right. i could see this one when i was at mile marker 319, but it was physically closer to mile marker 320. 7:10 mm317\\yellow springs road this ufo was at mile marker 317, where yellow springs road crosses over the turnpike. the ufo was just north of the turnpike. 7:12 mm317 it was to the right (north) of turnpike, moving parallel w\\turnpike but heading east. 7:14 mm312\\downingtown exit to the right (north) of turnpike, heading east."],"Object Features":"None","Summary":"Saw 7 UFOs in a 12 minute window while on PA turnpike","Object Shape":"Other","Date Submitted":"11/23/2008 07:02 UTC","files":["/var/www/straped/mufon/html2text/13956.html.txt","/var/www/straped/mufon/org/13956.html"],"Disposition":"Unknown","Latitude":"40.111206","Longitude":"-75.373882","Region":"Pennsylvania","Source":"MUFON","Log Number":"US-11242008-0036","map":"<A HREF = \"http://maps.google.com/maps?q=40.111206,+-75.373882(13956)&iwloc=A&hl=en\"> mufon case (13956) map </A>","Tags":"City","City":"King of Prussia","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Straight-line path,Path with directional change","trends":["There have been 5 other sightings in King of Prussia","There were no other sightings in King of Prussia on or around November 23rd 2008"]}