{"files":["/var/www/straped/mufon/html2text/13952.html.txt","/var/www/straped/mufon/org/13952.html"],"Object Shape":"Other","City":"New York","Disposition":"Unresolved","Region":"New York","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 17th 1976"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.716873,+-73.996613(13952)&iwloc=A&hl=en\"> mufon case (13952) map </A>","Log Number":"US-11242008-0032","Longitude":"-73.996613","Date Submitted":"08/17/1976 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Summary":"I am writing this because I was just watching your show on witness describing glitter","Object Flight Path":"Other","Date of the Event":"08/17/1976 12:00 UTC","Case Number":"13952","Latitude":"40.716873","Object Features":"Other","divs":["sighting detailsi was driving home on the northway going south sometime just after midnight in 1976. i remember it was very dark that night and i do not remember seeing a moon. there were colored lights everywhere in a black sky. it reminded me of what the woman tonight on tv was telling mufon about \"glitter\". the only difference is what i saw were lights of various colors. there did not seem to be any pattern. this went on for a long time. i do remember seeing the lights from a plane that was going to land at albany airport. it started it's decent across the northway and was surrounded by this glitter. i was thinking whatever this is...it's on their radar. i do not remember driving or hearing any noise what so ever. i do know there were some cars in back of me driving very slowly watching in disbelief as i was. suddenly to the left there was a huge ball of light that decended rapidly. i was absolutely shocked at what i was seeing. when i arrived home i immediately called my mother who told me it was on the three available networks...channel 6, 10 and 13 i believe. the next day there was some kind of news blackout because it was treated as if it never happen. all these years i have hoped someone would report seeing what i saw that night. this is the first time i've heard anyone say glitter. that is exactly what it looked like. thank you. sincerely, [cms\\tg\\pid]"]}