{"Log Number":"US-11242008-0031","Region":"New Jersey","Country":"United States","files":["/var/www/straped/mufon/html2text/13951.html.txt","/var/www/straped/mufon/org/13951.html"],"Tags":"City","divs":["Sighting DetailsMy husband called me from the parking lot at the Shoprite that is located within blocks of our home. He asked me to hurry up and run out across the street and see if I saw what he just saw pass overhead of him in the parking lot. He told me that the object was coming toward the park that is directly across the street from our house. When I ran out I saw a black flying object that looked like a human figure holding on to something directly above it like an umbrella. I laughed because it almost made me think of a Mary Poppins type figure but it was completely black and was moving a little faster and more direct than anything like a balloon would. Not only that but it was a good 150 feet in the air and looked to be a bit larger than any person would ever be. The object moved at a steady pace, was completely silent, and was flying in a direct horizontal movement across the tops of the tree line. I didn't know what to think about the object and questioned to myself, \"ok if that was a person flying throught the sky....huh what am I saying people don't fly through the sky.\" I did not think that it was any flying craft that I had ever seen. The figure looked almost like a completely black human figure, head to toe, with another round black shape just above it. My husband and I just kind of laughed and said \"What the hell was that?\" But at the same time we were really puzzled but didn't know who to notify. My husband and I still wonder if anyone else had seen this same object in this area around this time."],"Date Submitted":"05/31/2005 12:00 UTC","Source":"MUFON","Latitude":"40.225773","trends":["There have been 8 other sightings in Trenton","There were no other sightings in Trenton on or around May 31st 2005"],"Object Features":"Appendage(s)","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Date of the Event":"05/31/2005 12:00 UTC","Object Flight Path":"Straight-line path","Case Number":"13951","City":"Trenton","Weather Factors":"Unknown","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.225773,+-74.736338(13951)&iwloc=A&hl=en\"> mufon case (13951) map </A>","Longitude":"-74.736338","Summary":"Black assymetrical flying object","Disposition":"Insufficient Data"}