{"Longitude":"-84.50209","files":["/var/www/straped/mufon/html2text/13955.html.txt","/var/www/straped/mufon/org/13955.html"],"Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Region":"Ohio","Summary":"Triangular Shaped Craft slowly hovered close to ground, before rapidly flying away","Country":"United States","Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"11/30/1990 12:00 UTC","Log Number":"US-11242008-0035","Tags":"City","Date Submitted":"11/30/1990 12:00 UTC","trends":["There have been 82 other sightings in Cincinnati","There was one other sighting in Cincinnati on or around November 30th 1990"],"divs":["Sighting DetailsI was 6 maybe 7 years old and this occurred sometime between the summer of 90 and the fall of 91. I was young so the date is hard to remember but the image is permanently burned into my brain. It was late in the evening and my family had all gathered for a little party, and it was all coming to an end. I cannot remember exactly who was there but there were several of us in my driveway when the sighting occurred. As we all walked in the driveway, as members of my family were going to their cars we noticed lights coming over my house. The craft floated slowly over the my house and coasted at a height that seemed low enough, to my young mind, that it was possible to pick up a rock and throw it in the air striking the underside of the craft. There were three lights in each corner of the craft. The craft seemed to form a perfect equilateral triangle with the lengths of the sides at approximately 40 ft long. As I looked with my peripheral i searched for a rock and before i was able to pick up a rock that i found, in my driveway the craft moved slightly faster and within a few seconds it wa across the street and about 200 yards away. When it reached a distance of about 400 yards away it ascended and went out of sight. This all happened in a matter of 10 seconds. The craft was utterly silent. This was without a doubt the most terrifying moment in my life. Since that day i have been scared to go out into my driveway at night. I am scared to look into the night sky. This was the most real experience of my life. I know for a fact that this was a real experience. IF YOU LIVED IN CINCINNATI IN THE EARLY NINETIES AND YOU SAW A UFO, REPORT IT. PLEASE HELP ME FIND OUT ANYTHING ABOUT THIS."],"Object Flight Path":"Straight-line path","Latitude":"39.105798","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.105798,+-84.50209(13955)&iwloc=A&hl=en\"> mufon case (13955) map </A>","City":"Cincinnati","Case Number":"13955"}