{"Date of the Event":"11/23/2008 07:00 UTC","Log Number":"US-11242008-0030","Latitude":"39.956475","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.956475,+-75.161719(13950)&iwloc=A&hl=en\"> mufon case (13950) map </A>","Summary":"My friend called me up to come over and see the balls of light because he saw them a week before. He lives around the corner and shore enough there were three stationary lights in the sky in a big triangle. Over a pretty large area.","Source":"MUFON","Longitude":"-75.161719","City":"Philadelphia","files":["/var/www/straped/mufon/html2text/13950.html.txt","/var/www/straped/mufon/org/13950.html"],"Disposition":"Insufficient Data","Region":"Pennsylvania","Case Number":"13950","Country":"United States","Weather Factors":"None","Sighting Duration":"02:30:00","Object Features":"Other","Viewing Distance":"Over One Mile","Object Shape":"Sphere","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around November 23rd 2008"],"Date Submitted":"11/23/2008 07:00 UTC","divs":["Sighting DetailsMy friend called me up to come over and see the balls of light because he saw them a week before and they were back. He lives around the corner and sure enough there were three stationary lights in the sky in a big triangle. Over a pretty large area. They were not stars or aircraft, because there were stars and aircraft that we could see and they weren't comparable, they were just sitting there not moving and very bright. It was freezing cold that night so we stood out there for about a half hour with the binoculars, but couldn't get any pics, I tried to on my cell phone but couldn't get it. They didn't move and I went home. He called me later and said that eventually they went away, but he said he started seeing them at about 6:00 PM, I left around 7:15 PM and when he called about 7:30 he said they were gone. I called the police and the local news station to find out if anyone else called. I figured someone else had to see them, but both said no one called. I called the East Norrition Police dept. They took my name and number. They looked like they were very high in the sky though, it was dark. But they were about plane level or maybe higher. They were not planes and they were not stars. We both saw it."],"Object Flight Path":"Stationary"}