{"Object Shape":"Triangle","Country":"United States","trends":["There have been 6 other sightings in Stillwater","There were no other sightings in Stillwater on or around November 15th 2008"],"Case Number":"13959","Viewing Distance":"21-100 Feet","Date of the Event":"11/15/2008 08:30 UTC","Object Features":"Other","Object Flight Path":"Hovering then path","Log Number":"US-11242008-0039","divs":["Sighting DetailsIt was the evening of November 15,2008 around 8:15 or 8:20 when my friend Connor Hughes and I were driving down State Highway 177 headed to get groceries from Sillwater which is about 11 miles away from Perkins. We were about 1 mile away from the highway intersection headed North on highway 177 when something caught my eye. Over the Oklahoma State Agriculture fields there was this shape with three white lights. At first glance we thought it was a cell phone tower of some sort and as we got to looking there was no base so it wasnt a tower. The object had three white lights at the ends indicating that it was of a triangular shape. The object was approximately 100,yes 100 feet off the ground. I then drove onto a side dirt road that was parallel with the field it was over. As soon as we turned on the road it was like it jumped or skipped about 100 to 150 yards.We then pusued the object for the mile stretch heading east now.Once we got to the intersection it all of a sudden shot away about 3 miles and soon was out of sight. keep in mind this object HOVERED in one spot for more then 5 minutes and what i forgot to mention was that we got out of the car on the road and the object made no noise i repeat no noise. This is not the first sighting in Payne County this is actually my second sighting of an unidentified object in the past 3 years."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.120407,+-97.057018(13959)&iwloc=A&hl=en\"> mufon case (13959) map </A>","Date Submitted":"11/15/2008 08:30 UTC","Summary":"Very breathtakin almost unbelieveable hover object","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Latitude":"36.120407","Source":"MUFON","City":"Stillwater","Sighting Duration":"Undisclosed","Region":"Oklahoma","Longitude":"-97.057018","files":["/var/www/straped/mufon/html2text/13959.html.txt","/var/www/straped/mufon/org/13959.html"]}