{"Latitude":"40.800495","Longitude":"-77.858161","divs":["Sighting DetailsI was driving Rt220 going towards State College, PA from Bellefonte, PA. When I notices bright lights in the shape of an octagon over a tree line ahead. First I thought it was street lights on the side of the parkway but as I drove closer it took shape in the sky. I couldn't determine the size of the object as I could only see the lights in the sky. It looked to be hovering in a stationary position over the tree line. The lights were about 50ft to 100ft apart from eachother in the shape of an octagon there where 5 lights overall. All I know I wasn't staying around to find out what it exactly was so I went back to my hotel. While I was driving away it looked to be slowly moving towards the sky. And then in a matter of seconds it disapeared from my sight. The following morning I drove by the area to see if there were anything I could have mistaken it with and there was only forest. I have always been entriged by UFO's and researched them as a kid but experiencing it first hand was more than what I expected. It is very scary because of the whole concept of the unknown but also cool as I thought I would never see something like this in my lifetime. I placed an attachment of what I seen I did take a picture on my cell phone only it took a black photo but I drew a little something to give everyone an idea..."],"Log Number":"US-11242008-0034","City":"State College","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.800495,+-77.858161(13954)&iwloc=A&hl=en\"> mufon case (13954) map </A>","Object Shape":"Other","trends":["There have been 10 other sightings in State College","There were no other sightings in State College on or around August 18th 2008","This sighting has never been favorited.",""],"Case Number":"13954","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/13954.html.txt","/var/www/straped/mufon/more/13954_submitter_file1__August182008.jpg","/var/www/straped/mufon/org/13954.html"],"Country":"United States","Date Submitted":"08/18/2008 11:45 UTC","Disposition":"Insufficient Data","Object Features":"None","Region":"Pennsylvania","Source":"MUFON","Weather Factors":"Unknown","Summary":"I thought it wasn't real but it was","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Date of the Event":"08/18/2008 11:45 UTC"}