{"trends":["There have been 2 other sightings in Warrenville","There were no other sightings in Warrenville on or around September 19th 2004","This sighting has never been favorited.",""],"Longitude":"-88.169962","Object Features":"Undisclosed","Summary":"Huge Star like object that was rising in the eastern sky at 3:30am and waning out to the SE @ 7:15am. last object shining in thew sky @ sunrise","Latitude":"41.825387","Object Shape":"Star-like","Date of the Event":"09/19/2004 03:00 UTC","divs":["Sighting Details1. Began on Sept. 19th 2004- Dec. 19th 2004 in Warrenville Illinois 3:30am-7:15am 2. Stationary star like object in the sky, however would rotate with the movement of the Earth 3. Was first sighted by me in August 2004 and decided to take photos of object in Sept. 2004 4. Object has been seen all over the world in other countries as well. 5. Objects on photos were not the object seen in real time 6. object seemed to have been trying to communicate through digital technology, almost projecting a hologram. 7. Standing on a suburban street not moving with no cars or lights around. I have numerous photos of light beings that look like something out of the movie \"The Abyss\", asteroids, a morphing organic like object and what seems to look like tears in our fabric of time. A gaping whole in the sky that appears to look like a worm hole which is allowing other space crafts to come through into our demension. As crazy as this may sound, I have proof to prove it. It is imperative to know that these photos were taken with a digital camera. So there is no way \"whatsoever\" that I could take a picture of the asteroid \"Tutoutis\". I saved the newspaper clipping of the article that came out on Sept. 21st 2004, just two days after I took the photo. What I am trying to tell you is that this object was trying to communicate to me through the photos. As you can see \"they\" came up to me while being in the street. Of coarse I couldn't see them at the time. It must be that the digital camera could pick up what the human eye can't. I would love to meet in person to share these photos. I have them saved on a memory chip so none of them have beenn altered. I only am e-mailing you some of the many photos that I have. If your interested in seeing more, please by all means contact me. Sincerely,"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.825387,+-88.169962(13963)&iwloc=A&hl=en\"> mufon case (13963) map </A>","Log Number":"US-11242008-0043","Case Number":"13963","Country":"United States","Source":"MUFON","Weather Factors":"Does Not Apply","Date Submitted":"09/19/2004 03:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Path with directional change","City":"Warrenville","Viewing Distance":"Unknown","Region":"Illinois","files":["/var/www/straped/mufon/html2text/13963.html.txt","/var/www/straped/mufon/more/13963_submitter_file1__Scan0016_EDIT16_0032_0032.jpg","/var/www/straped/mufon/more/13963_submitter_file2__Scan0007_EDIT7_0014_0014.jpg","/var/www/straped/mufon/more/13963_submitter_file3__Scan0008_EDIT8_0016_0016.jpg","/var/www/straped/mufon/org/13963.html"],"Tags":"City"}