{"Longitude":"-75.155209","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"08/15/2008 12:00 UTC","Source":"MUFON","Object Shape":"Boomerang","Region":"Pennsylvania","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around August 15th 2008"],"Sighting Duration":"Undisclosed","Latitude":"39.961805","Summary":"this is some interesting info i found","Case Number":"13960","Log Number":"US-11242008-0040","map":"<A HREF = \"http://maps.google.com/maps?q=39.961805,+-75.155209(13960)&iwloc=A&hl=en\"> mufon case (13960) map </A>","Date of the Event":"08/15/2008 12:00 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/13960.html.txt","/var/www/straped/mufon/org/13960.html"],"Weather Factors":"Unknown","City":"Philadelphia","divs":["Sighting Detailsreguarding the case of i believe of a \"kathleen\" in which \"glitter\" was deposited and recollected and showed unusually high levels of Boron. i have a hypothesis to follow the article. Common uses of boron Borax, the most common natural form of boron, has a wide variety of uses. Borax is used in cleaning compounds, glass and ceramics, fertilizers, papers and paints, and fire retardants. Borax is also used in enamels covering the steel of refrigerators, washing machines, and other like objects. Boron nitride, or borazon, is a hard material and is used as an abrasive. Boracic acid is used as a mild antiseptic. Other boron compounds are used for heat-resistant glass, detergents and soaps, enamels, and medicine. Boron is known as a very hard element. It is also very strong and light weight. Boron is almost as hard as diamond, so it is used in place diamonds in many cases. Boron is added to steel for extra hardness and strength at high temperatures. Boron is conducts heat very well, and is a great insulator, thus it has increasingly amounts of technological appliances. Boron also serves many uses in atomic energy. It is used in instruments designed to detect, and count slow neutrons. It also has a high absorption of neutrons, so it is used as a control absorber in nuclear reactors. My Hypothesis: 1.)If these are E.T.s mabe they need to extract boron in order to strengthen their bone structures to counter the effects of space that cause bone loss. But why not just beam it up from a drug store? In any case it is interesting to see this element show up due to the technological applications it is used for especially the nuclear, and ceramics fields as i believe they will both in the very near future be used by us (If not already) to create craft with the magnetic and electronic powerplant properties neccessary to conduct these flight charactoristics. I would love to hear back from you regaurding my thoughts and share some ideas. This was based on UFO'S over earth on the science channel at 9pm eastern on monday november 24th"],"Disposition":"Unknown","Country":"United States"}