{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13979.html.txt","/var/www/straped/mufon/org/13979.html"],"Object Shape":"Sphere","Viewing Distance":"Over One Mile","Longitude":"-93.966035","map":"<A HREF = \"http://maps.google.com/maps?q=36.587014,+-93.966035(13979)&iwloc=A&hl=en\"> mufon case (13979) map </A>","divs":["Sighting DetailsThis UFO is seen in Barry Co. Mo on a regular basis. It has records going back to Civil war. The first time I saw it, I was seated on my back steps looking south west toward Washburn Mo. At first I thought it was a planet or other space object. Then it started going up and down like a yoyo I figured it was not a moon or stationary space object such as a satalite. I have observed this object on a regular basis for almost 20 years. I have been interested in UFOs since the 1970s when one landed in our back yard when I was in high school. When I moved to Barry Co. Mo I did not realize I had moved to the most populated county for UFO sightings in US outside of Area 51 when it was active. This is according to Readers Digest of all things. It has been observed as far north as Monett Mo 17 miles away. It seems attract to activity and is a observer of some sortl. because it reacts to the surrounding. I will give you an example of this activity. When they built a new Wal-Mart supercenter in our area, the object seemed very interested in what was going on. I did not see much reaction out of it until they turned the lights on for the first time, it moved from its typical station (as I call it)in the sky to the southeast part of the sky. Also when they built a new water tower behind the new building and turned its warning becon on, the object apeared to try to stare it down. I saw it paralell to the new tower and it stayed that way for several hours. The object has been said to based out of an old rock quarry around Washburn Mo. Though I have never seen it come out of there personaly. I have observed it comming out of the prarie around Washburn on several occasions. If you MUFON people want to see the real thing come to Barry Co. MO. We have them all the time. Also along with the object that I described there are several other ones, one red one, a green one and a larger craft that I call the Mama ship. I have observed it on many occassions. It is large enough that the smaller crafts can be seen entering and leaving from it. The only reason I can think of these crafts are attracted to radio active minerals found in the area. They have also evidently built a series of underground caves as well I have observed one such tunnel above my house on the same street, they were putting in new water lines and dug up the tunnel while excavating the ditch. I do know they were require to fix the tunnel where it was still open by putting a culvert in (a large metal tube). If this sounds like something you would be interested in investigating, contact me by phone or email."],"City":"Washburn","Sighting Duration":"12:27:29","Date Submitted":"11/24/2008 08:00 UTC","Region":"Missouri","Latitude":"36.587014","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Case Number":"13979","trends":["There have been 3 other sightings in Washburn","There were no other sightings in Washburn on or around November 24th 2008"],"Weather Factors":"Unknown","Log Number":"US-11242008-0059","Country":"United States","Summary":"When this one is seen in daylight which is occassionly it is a silver sphere, at night it appears as a bright light in sky","Object Features":"None","Source":"MUFON","Tags":"City","Date of the Event":"11/24/2008 08:00 UTC"}