{"City":"Hudson Falls","Summary":"I saw the ufo when I was about 14, I am now 45","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13978.html.txt","/var/www/straped/mufon/org/13978.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-11242008-0058","Longitude":"-73.580499","Country":"United States","divs":["Sighting DetailsI was baby sitting at my mother's house, she used to run a day care. There were several children in the living room watching tv. For no reason the tv started to turn on then off a few times, I think the channels changed as well. I figured one of the kids had the remote and was just goofing on the rest of us. No one had the remote , I found it on top of the fridge where my mother would keep it so no little hands would get it. I remember my mother had a huge picture window in the living room, for some reason I went to it as well as one of the little boys. That is when I saw a greyish cylinder just hovering over the junk yard across the street from my mom's, it wasn't much higher than the telephone pole. It might have been there a minute maybe two then all of a sudden it took off and was gone in like a half a second. I can remember not even hearing all of the little kids that were in the living room, it was really weird. I just looked at Petey,he was just as shocked as I was.I think we tried to tell my parents we saw a ufo, of course they never believed us. Years later when I was about 21 I told my boyfriend who is now my husband. Every once in a while I tell the story, Some believe me and some do not. I can still see it as if it were yesterday. I didn't hear any sounds coming from it either. Unfortunately I do not have photos,just my memory.Whenever there is a show on about UFO'S I am always very interested, I always watch just to see if there are any similarities."],"Date of the Event":"03/13/1977 12:00 UTC","Source":"MUFON","Object Shape":"Cylinder","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Latitude":"43.303738","Tags":"City","Region":"New York","Case Number":"13978","Object Flight Path":"Hovering then path","trends":["There has been one other sighting in Hudson Falls","There were no other sightings in Hudson Falls on or around March 13th 1977"],"Date Submitted":"03/13/1977 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.303738,+-73.580499(13978)&iwloc=A&hl=en\"> mufon case (13978) map </A>"}