{"Object Shape":"Cylinder, Square, Rectagular","files":["/var/www/straped/mufon/html2text/13971.html.txt","/var/www/straped/mufon/org/13971.html"],"Longitude":"-90.292878","trends":["There have been no other sightings in Cardwell","This sighting has never been favorited."],"Source":"MUFON","City":"Cardwell","Sighting Duration":"Undisclosed","Date of the Event":"11/18/2008 04:35 UTC","Disposition":"IFO","Summary":"Shiny long rectangular/cylindrical object at fairly low altitude, soundless","Object Features":"Undisclosed","Log Number":"US-11242008-0051","Latitude":"36.047013","Date Submitted":"11/18/2008 04:35 UTC","Case Number":"13971","Tags":"City","Region":"Missouri","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.047013,+-90.292878(13971)&iwloc=A&hl=en\"> mufon case (13971) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsThe day was perfectly clear, the sun very low in the West, but hadn't quite set yet. I had stepped out to get the newspaper, and when I turned back facing the house (facing South), I noticed the object in the distance in the Southeast. It was approaching, and at first I thought it was a jet; but I quickly realized that it was too low. I can't be specific about the altitude, but I'd say a few hundred feet - maybe where smaller aircraft usually fly. As it neared, I observed that it appeared as a long rectangular, or possibly cylindrical object. Again, I can't be clear about the object's size. I don't think it was as large as a jetliner, though. It was shiny, a little more so, I'd say, than typical aircraft metal would be. At first it appeared to have no additional features, but as it appeared at it's closest point, overhead (though to my left), I could make out what appeared to be two very small appendages of some type, one on either side of the object, rather more near the front of the object than the center. They were very small, much too small to be considered any type of \"wings.\" The surface was smooth metallic, with no images, windows, etc at all. Although the day was very quiet and still, the object made no sound that I could detect. It was going too fast to be a blimp, in my opinion; and I could observe no basket or passenger area underneath as it passed over. It moved in what appeared to be a perfecty straight course to the North, when I lost sight of it. I'd say the whole episode lasted no more than 3 or 4 minutes. One oddity was that I got the distinct impression that the object was almost imperceptibly speeding up and slowing down as it proceeded, rather than remaining perfectly uniform in motion; but I couldn't swear that this was so. I've seen a few oddities in the sky before, but this is about the only one I really can't explain, except as possibly some kind of experimental craft. I felt at the time that I was experiencing something unique."]}