{"Tags":"City","Summary":"Triangle shaped object with round light or windows around the perimeter.","Date Submitted":"11/20/2008 04:15 UTC","Weather Factors":"Unknown","Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=40.921615,+-74.162871(13973)&iwloc=A&hl=en\"> mufon case (13973) map </A>","trends":["There have been 9 other sightings in Paterson","There were no other sightings in Paterson on or around November 20th 2008"],"Source":"MUFON","Object Flight Path":"Undisclosed","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/13973.html.txt","/var/www/straped/mufon/org/13973.html"],"Disposition":"IFO","divs":["Sighting Detailsi moved from New York city to New Jersey about 18 months ago. In New York city there are many lights that obscure the night sky, unlike here. anyways have always been intersted in anything having to do with science, astronomy, physics, and all that, and i'm well inform about many ufo cases that have been reported, and also many of such cases as the lazard, and many others that claim about how aliens such as,The greys,alfadraconians, lyrians and the Plaidians are here on this world,and that some have bad intent. First, i have been seing orbs for about 4 months now, i see them moving throght the clouds, sometimes there are about 4 or five at a time just hovering . These objects stay motionless for 20 to 30 minutes at a time i have also seen them fly towards each other against the wind.I have never seen them at night only during the afternoon hours.I have also noticed that when there is airplane trafic coming towards them, they just seem to desapear, and then appear at the same place, they are very shiny and gray in color,but when they see airplanes come by them they thin out. i have seen other peoples video about this orbs,but the main reason for me to report this is that a few days ago i saw the most amazing ufo i ever seen. i had just finish smoking a ciggarete in the back porch of my house. I was about 4pm, when i happen to look up at the sky, when i dirctly saw(not periferal) a triangular object moving at low speed from north to south, a don't know how big it was because there wasn't a single cloud in the sky to determine its size,to the nake eye it was the size of a thumb nail with arms held straight. The object was grey in color, and had round lights, or windows around its perimeter.WHat amazed me so much is that this object was cloaked, i could see the sides clearly, but the bottom part of the craft would was invisible,but not completely, there was like somekind of wave around the craft.The best description i have, is that this thing was cloak.The object moved slowly across the sky, and i lost sight of it when i came inside the house to tell my wife to come out and see what i'm watching.I hope that my description can help in some ways, i am now planing on getting an infrared camara so that i will be able to record them ."],"Viewing Distance":"Unknown","Sighting Duration":"00:01:30","Log Number":"US-11242008-0053","Object Features":"Undisclosed","Latitude":"40.921615","Case Number":"13973","Date of the Event":"11/20/2008 04:15 UTC","Longitude":"-74.162871","Country":"United States","City":"Paterson"}