{"Tags":"City","Log Number":"US-11242008-0057","files":["/var/www/straped/mufon/html2text/13977.html.txt","/var/www/straped/mufon/org/13977.html"],"Object Shape":"Diamond, Disc","Region":"Texas","trends":["There have been 3 other sightings in Madisonville","There were no other sightings in Madisonville on or around August 31st 1974"],"Viewing Distance":"20 Feet or Less","Date Submitted":"08/31/1974 09:00 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.957011,+-95.906599(13977)&iwloc=A&hl=en\"> mufon case (13977) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI'm sorry that this has never been told to someone like you. It happened when I was 14 and I am now 50. However, all people (5) in the car who saw this event are still living today. My family and I were coming home from Bible Study in Bedias, TX. on a Wednesday night in September of 1974. The only reason that I can remember the date and year is because it was during the beginning of football season and I was a sophomore on the team, therefore I can deduce the approxamate date. In the car was myself (14 at the time, now 50), My father (now 79, my mother (now 72, and my two younger sisters (11 and 8 at the time). We saw a light about a mile and a half ahead of us as we aproached the Bedias Creek bottom heading North on Hwy 90 toward Madisonville. (Bedias is a small town of about 650 people and Madisonville had a population of around 2850 at the time). There had been talk of UFO sightings in Texas and we joked that the light we saw in front of us was a UFO as well, never dreaming about what was about to happen to us. As we came closer to the light, we realized that it was moving very slowly from our left towards the Hwy that we were on. As we drove down a hill placing us in the Bedias Creek bottom, the light had come from what was far enough to joke about, to right before our car. All we could see were 4 lights all of the same color in the shape of a very flat diamond. The craft landed on Hwy 90 right in front of us and spread across the entire Hwy, causing my father to come to a complete stop to avoid hitting it. Everyone in the car except my father was either crying or screaming for him to turn around. My 2 little sisters were in tears. I tried as hard as I could to get my father to turn around and my mother tried as well. I'll never know how he knew to do this, but my father pressed down on the gas pedal as hard as he could. We were driving an Oldsmobile 98 that could fly. It was a heavy car, but we were going 110 before I knew it and the UFO had managed to hop up off of the road and to our right, staying just above the tree line yet exactly even with our automobile. Our home was about 2 miles up the road and the town of Madisonville was about 7 miles up the road. After staying even with us for a little over a mile, we lost it in the trees and could no longer see it as we cruised well over 100 miles per hour heading North. Just before reaching the drive to our house (our house was out in the country) there was an open pasture where the heavy trees that we had been watching to our right came to an end. Thinking that when we came to this opening we might see what had happened to the UFO, well...we were right. It was landing in our back pasture...basically our back yard. Now the crying and screaming was at a peak. We all begged my father to go to Madisonville and then come back, but don't go into our drive with this thing sitting just feet from our back door. Again, I don't know why, but my father turned into the drive despite the screaming and begging, pulled into our car port, then with all of us still in the car and the car running, he ran into the house and grabbed his M-1 carbine with a 15 round clip. Before he could even get out of the house, the craft made a right turn due East and went over a hill just as slowly as it travelled when we fist saw it. As we stepped out of the car we could hear the craft as it \"hummed\" and went out of sight. Every word of this is true. I told everyone that would listen the next day, and as I am no Lier and was not then, I know that everyone I told knew that me and my family had seen something that scared the bejesus out of us. The craft absolutely was picking us out for some reason. The craft made us come to an absolute stop on a big hwy. There was no going around it. We could not see the craft, only the lights that gave us an indication of it's form. It follwed us almost all of the way home avoiding, what seemed to me at the time, my father's attempt to crash into it, then stayed up with us no matter the speed of our car. Then, as we reached our peak speed of probably 120, it dissappeared then reappeared settling far ahead of us at our home. It knew where we lived! It knew my dad was going to hit it in the hwy or it couldn't have moved so quickly to av oid the crash. It knew my dad was going to shoot at it when he came out of the house or it wouldn't have left before he made his way out of the house. In 1974, this was nothing like we had been hearing as to the sightings of UFOs. My dad and mom would not and still will not speak of this unless they are directly asked about the episode. They don't like to talk about it and never have. They will talk about it if directly asked. I am now 50 and my dad 79. I still think it was the bravest thing that I ever saw him do and don't believe many grown men would have reacted in the same manner. If the 5 of us were put on a polygraph, we would not fail. This happened. I've never had anything like it happen since. My parents still live in the same house on Hwy 90, 5 miles south of Madisonville."],"Date of the Event":"08/31/1974 09:00 UTC","Country":"United States","Source":"MUFON","Longitude":"-95.906599","Latitude":"30.957011","Summary":"1st saw as my family and I were coming home from Bible study. UFO landed in Hwy stopping us from going forward, then picked up off of hwy, stayed even with us, dissappeared, then reappeared landing in our back yard.","Case Number":"13977","City":"Madisonville","Disposition":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed"}