{"Country":"United States","Latitude":"38.679129","divs":["Sighting DetailsAround 11pm, I looked in the sky and saw what looked like a flashing star. But it was too big to be a star. I looked at it, brought my friends out, and they looked at it. We didn't really know what it was and still don't, but we got binoculars out and looked at it and it was spinning and flashing red, blue and green. Since i was at my friends house, i came home immediately to look at it through my telescope(I was about 15-20 minutes away from my house). I couldn't find the correct lenses but from what i could see, it looked exactly as i described. It wasn't moving for about 2 hours then it started to travel slowly across the sky. I tried to debunk it by comparing it to other stars. it occurred to me that it could be a plane or helicopter but it stayed in the same spot for too long. Planes even flew under it and then i was positive that it wasn't either. I got this gut feeling that it was a U.F.O. Although, the pictures i have really don't do any justice, I'd like to mention that the camera was completely still, for it was on a tri-pod. We kept track of it through the telescope for about 4 hours, but we decided to go to bed. It was gone the next day"],"files":["/var/www/straped/mufon/html2text/13974.html.txt","/var/www/straped/mufon/more/13974_submitter_file1__November2008002.JPG","/var/www/straped/mufon/more/13974_submitter_file2__November2008013.JPG","/var/www/straped/mufon/org/13974.html"],"trends":["There have been 8 other sightings in Folsom","There were no other sightings in Folsom on or around November 17th 2008","This sighting has never been favorited.",""],"Region":"California","Object Flight Path":"Undisclosed","Summary":"5-9 small circles spinning around emitting blue, red, and green lights.","Viewing Distance":"Unknown","Longitude":"-121.167048","Case Number":"13974","Date Submitted":"11/17/2008 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"11/17/2008 12:00 UTC","City":"Folsom","Object Features":"Undisclosed","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=38.679129,+-121.167048(13974)&iwloc=A&hl=en\"> mufon case (13974) map </A>","Object Shape":"Circle, Star-like","Tags":"City","Weather Factors":"Unknown","Log Number":"US-11242008-0054"}