{"Disposition":"Unknown","Longitude":"-101.34253","Log Number":"US-11242008-0055","Weather Factors":"Unknown","Latitude":"48.42744","Date Submitted":"06/30/1963 12:00 UTC","trends":["There have been 11 other sightings in Minot","There were no other sightings in Minot on or around June 30th 1963"],"Country":"United States","Summary":"July 1963 Sighting over Minot Air Force Base","Source":"MUFON","Region":"North Dakota","Object Flight Path":"Hovering then path","Case Number":"13975","Tags":"City","files":["/var/www/straped/mufon/html2text/13975.html.txt","/var/www/straped/mufon/org/13975.html"],"Viewing Distance":"101-500 Feet","Object Shape":"Disc","divs":["sighting detailsmy parents were stationed at minot afb, nd. our residence faced another complex. behind that complex was a field, then north plains elementary school. to the right of the school was the base chapel. it was about 9pm, my father was upstairs sleeping as he needed to get up early for work in the morning, and my mother was in the living room watching tv. as i stood by the front screen door wanting to go outside to play, i looked across the field. there i saw a silvery, metallic type,round, rotating object. it was silently, slowly circling behind the school, then gliding towards the chapel. there was a row of red, flashing lights circling at the base beneath the circular object. it was hovering for quite some time to the left of the chapel. i was so terrified i screamed so loud i woke up my father. my mother and father both came to the door, pushed me aside, then never spoke about the incident again. many years have come and gone and i think about the incident, and have even shared it with a few people.it is now 11\\24\\08 and as i sit in my home in ga. 45 years later i happened to come across the show \"ufos over earth\". this episode was about ufos over mexico. not paying too much attention to it i happened to glance over to the show when it was showing photos of pictures taken by a mayan indian may 12, 2007. as soon as i saw it sheer panic and fear came over me, even bringing tears to my eyes as i relived the same thing i saw when i was 6 years old. the pictures shown in that story looked exactly as the object i saw when i was a child. i will ever forget the fear and terror of seeing this object. more than that, the silence my parent maintained pretending they never saw it, nor did they ever speak about it again."],"map":"<A HREF = \"http://maps.google.com/maps?q=48.42744,+-101.34253(13975)&iwloc=A&hl=en\"> mufon case (13975) map </A>","Object Features":"None","City":"Minot","Date of the Event":"06/30/1963 12:00 UTC","Sighting Duration":"Undisclosed"}