{"Object Shape":"Triangle","Sighting Duration":"Undisclosed","Region":"Oklahoma","Weather Factors":"Unknown","Country":"United States","Summary":"It was a interesting moment not one you get to experience to often.","map":"<A HREF = \"http://maps.google.com/maps?q=35.346198,+-97.482193(13976)&iwloc=A&hl=en\"> mufon case (13976) map </A>","Log Number":"US-11242008-0056","City":"Moore","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"13976","Viewing Distance":"Unknown","Latitude":"35.346198","divs":["Sighting DetailsThat night I was outside goofing off when I looked to the south and saw a bright light. I called my mom and told her I was seeing a bright light she told me to get my phone and take a picture so I did. I then went outside again and waited. I watched it and when it flew over it had two bright orange yellow lights on each side of it. Two lights on the bottom one was a light blue color the other red the lights phased slowly back and forth. The craft moved slowly at the time it was a triangle arrow head shaped craft. It did not make much noise it made a buzzing noise we live near alot of airports so I know what a plane sounds like a plane makes a loud rumbling noise and this was just a buzz. At first I thought it might be a helicopter but it made a buzzing noise not a loud fluttering noise like a helicopter. So when I took a picture of it it was not a very good picture so I watched it go by it disappeared when it went a little farther away I could not see it after like two minutes because I was surrounded by houses. After I saw the aircraft I was astonished I saw one but I did. I have always kind of beleived they existed now I know they do. I was not scared but interested in it I wanted to come forth with this information as soon as possible to let people know they aren't the only one's out there who see strange things and give them confidence to come forth and tell their stories."],"Object Features":"Undisclosed","Date of the Event":"11/21/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/13976.html.txt","/var/www/straped/mufon/org/13976.html"],"Disposition":"Unknown","trends":["There have been 23 other sightings in Moore","There were no other sightings in Moore on or around November 21st 2008"],"Longitude":"-97.482193","Source":"MUFON","Date Submitted":"11/21/2008 12:00 UTC"}