{"Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=33.69676,+-78.885694(13980)&iwloc=A&hl=en\"> mufon case (13980) map </A>","Summary":"Oval but more egg like shape, I would say it would have been below the clouds if it was cloudy out.","Longitude":"-78.885694","Weather Factors":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13980.html.txt","/var/www/straped/mufon/org/13980.html"],"City":"Myrtle Beach","Viewing Distance":"Over One Mile","Case Number":"13980","Log Number":"US-11242008-0060","Tags":"City","Source":"MUFON","Sighting Duration":"00:00:05","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around July 3rd 2008"],"Object Features":"None","Latitude":"33.69676","Country":"United States","Date of the Event":"07/03/2008 11:30 UTC","divs":["Sighting DetailsIt was the last night of our vacation in Myrtle Beach. I was standing outside, alone and facing the east tracking the flight path of an airplane, watching while it moved from North to south. I was following the red blinking light of the plane. I stop following the plane for moment, After a few seconds I tried to locate the plane again. To my right I saw an egg shape object. It was at least an inch thick and and inch long and it was much lower than the plane. It did not move. the light coming off of it was a dull grayish light and it stood still for roughly 2 sconds or so. All of sudden it got very bright. The same type of brightness that a light bulb would give off if you were to turn it on while your eye was inches away from the bulb. It was the brightest light I have ever seen. The egg moved across the sky in a southerly direction after it lit up and was only visable for a second but It left a trail of light, a thin beam, the egg dissappered but the beam continued and then there was a bright star like burst at the end. If I put my hands up to measure the lenght that it traveled, from hand to hand I would say the ufo traveled only a foot to a foot and a half before it was completely gone. The egg itself dissagpeared shortly after it lit up and traveled for about an inch. It moved so quickly. I'm sorry I can't give you a better discription.Maybe there is proof on radar."],"Object Shape":"Egg, Oval","Date Submitted":"07/03/2008 11:30 UTC","Object Flight Path":"Stationary,Straight-line path"}