{"Date of the Event":"11/18/2008 07:40 UTC","Log Number":"US-11242008-0062","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.22928,+-96.665853(13983)&iwloc=A&hl=en\"> mufon case (13983) map </A>","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/13983.html.txt","/var/www/straped/mufon/more/13983_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/13983.html"],"divs":["sighting detailsat approx 7:40 - 8 pm range, my fiance and i were heading to the store that night when we noticed what looked to be a fairly low flying plane, but it had a light kind of going around it with the part directly pointed at us almost flashing like a strobe light it was so bright. not sure how to explain it.. there were two stationary red lights and a white light that rotated with another dimmer light off to one side. i tried to do a simple drawing in paint to help visualize it. my fiance is the one who first saw it.. it was almost directly over our house. the flash is what got our attention. it was really bright. when i first looked up, i thought it was maybe a mediflight or helicopter.. then realized there was no noise. it wasn't really windy.. so there should have been noise.. when we first saw it.. the side light was almost up against the other lights, then it moved off to a fairly good distance and stayed in that spot.. maybe like it turned slightly then went on a straight path heading east. like it was heading southeast then changed to straight east. it seemed to be about the height of a helicopter when doing a mediflight run.. but there was no noise. nothing that sounded like a plane or a chopper. and i don't know of any planes that have lights that bright that strobe around it, or for that matter.. planes and choppers have red on one side, green on the other, and white to the front.. right? this had no green light that we saw. if you take into account the side light as maybe wingspan.. it would have been rather large.. maybe about the size of 1 1\\2 commercial airliners plus the wing(?) light off to the right. guess that is all relative to how high it was and if that was a wing or tail or something. anyways, we watched it while standing in the driveway of our house for about 3 minutes then it was where the trees were blocking it.. so we got in the car and went along our route to the store. the road we drive down heads straight east and we had a clear view of it for about another minute and a half. then it blinked behind a tree.. and was very far away and a few seconds later it was out of view. i don't understand how it would take so long to fly over the small patch of sky we can see from our driveway then in such a short peroid of time be so far away. and it appeared to be flying really low, but we didn't hear anything. i really don't think it was a plane or chopper. i am really confused. have never seen anything like this before. i feel kinda silly writing this, but i had to tell someone. i'm not trying to get attention.. not trying to elaborate.. i just had to tell someone. not too sure how the cops here would treat us if we started calling in ufo reports. small towns aren't exactly nice to you aren't a 4th or 5th generation. and i've only lived here for about 3 1\\2 years now.. you get the idea."],"trends":["There have been 5 other sightings in Seminole","There were no other sightings in Seminole on or around November 18th 2008","This sighting has never been favorited.",""],"Object Features":"Wings, Unknown","Viewing Distance":"501 Feet - 1 Mile","Summary":"UFO heading east over Seminole OK on Nov. 18th","Disposition":"Unknown","Latitude":"35.22928","City":"Seminole","Weather Factors":"Unknown","Country":"United States","Date Submitted":"11/18/2008 07:40 UTC","Case Number":"13983","Sighting Duration":"00:06:30","Tags":"City","Object Shape":"Oval, Unknown","Region":"Oklahoma","Longitude":"-96.665853"}