{"map":"<A HREF = \"http://maps.google.com/maps?q=33.021343,+-96.689786(13984)&iwloc=A&hl=en\"> mufon case (13984) map </A>","Date Submitted":"10/10/2008 01:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Plano","Country":"United States","Tags":"City","Region":"Texas","Latitude":"33.021343","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-96.689786","Sighting Duration":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/13984.html.txt","/var/www/straped/mufon/org/13984.html"],"Log Number":"US-11242008-0064","Summary":"Brownish cigar shape fuzzy texture. Moving similar to an airplane.","Date of the Event":"10/10/2008 01:30 UTC","Object Shape":"Bullet, Missile, Cigar","Case Number":"13984","trends":["There have been 25 other sightings in Plano","There were no other sightings in Plano on or around October 10th 2008"],"Viewing Distance":"101-500 Feet","Object Features":"Insignia, Appendage(s)","divs":["Sighting DetailsI HAD COME OUT OF MY HOUSE AND WAS HEADED ACROSS THE STREET TO CORNER STORE.I HAPPENED TO LOOK UP AND SAW A SILVER CIGAR SHAPE OBJECT AND IT HAD WHAT LOOKED LIKE AT LEAST ONE FIN. IT WAS NOT MOVING AT ALL .I SAW IT CLOSE ENOUGH THAT IT LOOKED LIKE BLACK STRIPE ON THE SIDE . IT WAS NOT A BLIMP.THE DATE TODAY IS NOV.20-08.WHAT BROUGHT IT TO MIND AGAIN WAS THAT I DID SEE A BLIMP TODAY AND IT WAS NOTHING LIKE WHAT I SAW BEFORE.AS I RODE MY MOTOR CYCLE ACROSS THE STREET I WATCHED IT WITH AMAZEMENT AND WONDERED AT JUST WHAT IT WAS,IT WAS NOT AN AIRPLANE,OR ANY AIRCRAFT I HAVE EVER SEEN. .AS I WENT ACROSS THE STREET THE VIEW WAS BLOCKED BY A TREE THAT HAD COME BETWEEN ME AND THE OBJECT.WHEN I GOT PAST THE TREE TO THE POINT THAT IT SHOULD HAVE BEEN THERE, IT WAS GONE!!!I COMBED THE SKY EVERY WHERE AND THERE WAS NOT ONE SINGLE CLOUD IN THE SKY , AND THE THING WAS JUST GONE!!!I continued to the store and was excited and sure that it SAW a ufo,so I told the lady in the store all about it.When I came out ,10-15 MINUTES later, I continued to look for it ALL OVER THE SKY. THEN ;DUE EAST,I SAW IT AGAIN (I THINK) EXCEPT IT LOOKED DIFFERENT NOW .IT WAS LONGER ,OR AT A DIFFERENT ANGLE.IT HAD GOTTEN DARKER AND WAS MOVING FAST AND MOVING FARTHER AWAY.IT WAS GETTING BLURY OR FUZZY AND WHILE I WAS WATCHING IT, MY EYES TUNED TO IT, WATCHING IN AMAZEMENT, THE THING JUST DISAPPEARED!!!NOT A CLOUD IN THE SKY TO RESTRICT THE VIEW ,,,JUST VANISHED!!!IT WAS THERE , AND THEN IT WAS NOT THERE.I WATCHED THE AREA WHERE IT WAS FOR A FEW MINUTES THINKING IT MIGHT COME BACK... BUT IT WAS GONE. ....I CALLED THE POLICE THE FFA AND HOME LAND SECURITY TO REPORT IT. ( IF YOU CAN BELIEVE THIS) THEY TOLD ME THAT I WAS LUCKY BECAUSE NOT VERY MANY PEOPLE EVER GOT TO SEE \"ONE OF THOSE\".... I SAID DO YOU BELIEVE ME? WAS I THE ONLY PERSON TO SEE THIS? WAS I GOING CRAZY? THEY SAID NO ,NOT AT ALL. MANY PEOPLE HAVE SEEN \"HIS KIND OF THING\"(SHE NEVER SAID UFO) , AND THE PEOPLE THAT SHE WAS TALKING ABOUT (SHE SAID)WERE STATE TROOPERS, CITY POLICE, COMERCIAL AIR LINE PILOTS AND CO-PILOTS.(SHE THEN USED THIS TERM)AND \"PROFESSIONALS\" .................... THIS IS TRUE!!!"]}