{"files":["/var/www/straped/mufon/html2text/13994.html.txt","/var/www/straped/mufon/org/13994.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.102276,+-94.572377(13994)&iwloc=A&hl=en\"> mufon case (13994) map </A>","Tags":"City","divs":["sighting detailsi live in an apartment complex in the city. i was on my balcony having a cigarette and looking at the sky. i was looking east\\southeast towards orion. i saw what looked like a flock of birds, which seemed weird for night, but i kept looking and it was moving way too fast and there was no noise at all. completely silent. only in my field of view for about 7-10 seconds. i would guess it covered a half mile in that time. was very smooth moving. it wasn't lit up though. that's why i thought it was birds. looked like 10-15 birds flying in a v (more like a boomerang. wider angle than a v) formation and the underbellies were lighter in color. like a whitish color. i see birds all the time flying in formation right now because of migration, but never at night and never moving that fast. and birds tend to move closer and further from each other. this was in perfect symmetry. weirdest thing i ever saw. was about 400'-500' off the ground i'd guess. i believe in ufo's but never thought i'd see one. neat!"],"Date Submitted":"11/24/2008 10:45 UTC","Weather Factors":"None","Disposition":"Unknown","Summary":"Saw what looked like a flock of birds at night, but moved moved way to fast and didnt make a sound","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around November 24th 2008"],"City":"Kansas City","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Case Number":"13994","Log Number":"US-11252008-0001","Latitude":"39.102276","Sighting Duration":"10:45:00","Date of the Event":"11/24/2008 10:45 UTC","Region":"Missouri","Object Shape":"Boomerang","Object Features":"None","Longitude":"-94.572377","Object Flight Path":"Straight-line path"}