{"Summary":"See attached-","Disposition":"Unknown","Object Features":"Window(s)","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/13999.html.txt","/var/www/straped/mufon/org/13999.html"],"Sighting Duration":"Undisclosed","Latitude":"32.718349","Date of the Event":"11/30/1974 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.718349,+-117.155555(13999)&iwloc=A&hl=en\"> mufon case (13999) map </A>","Tags":"City","Longitude":"-117.155555","Object Shape":"Saturn-like","Source":"MUFON","City":"San Diego","Date Submitted":"11/30/1974 11:30 UTC","Object Flight Path":"Stationary,Hovering then path","Case Number":"13999","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around November 30th 1974"],"Region":"California","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was about 24 yrs. old, staying for awhile at my parent's house in Chula Vista, Ca. I was in the den wathing Johnny Carson Show that starts at 11pm. I was sitting in the middle of the couch and happened to pull back the curtain - it was very quiet outside at that hour. I closed the curtain and continued to watch Johnny Carson - it bothered me that the big light I saw up in the sky was too high to be a street lamp and too low to be a star - so I pushed the cutain back again to take another look. The big light was so interesting I left the den and opened up the front door facing east. It was an enormous light just hanging there in the sky with no noise. I ran to the bathroom and hollared at my mother to come look at it - it was a UFO. She wrapped a little towel around her and we stood on the front porch watching the light dim and then we could see the circular craft. It was so clear that night and it was so close we could see the port holes. In the middle on the right side was three port holes and each port hole you could easily see red light in each of them. On the left side in the middle were two port holes that shone white light from the port holes. It just stood there and made no sound. I was so excited I wanted to get a flash light and signal it, but mom was so scared she was making the sign of the cross - and my little two year old sister was in the background. Because she was so scared I didn't get the flash light but I did call the Chula Vista Police Dept. but they didn't believe me - I tried to convince them but they would take me seriously. I then called a radio station and they wouldn't believe me either. It was so frustrating and it just stood there near the hospital on the next block. We watched the enormous light grow all around it one more time and after a while the light dimmed. It was just incredible - then we watched it float off effortlessly noisless heading north. I wanted it to come back - it was so amazing - I wasn't afraid of it like mom was. I went the to the star newspaper the next morning and told them the story. They found it interesting but you could see they too didn't know whether to believe it or not. This is the first time I have ever sent my story of this occurrence to anyone-it has stayed on my mind all these years and I would just like for once to tell someone like you about it. Seeing it is indescriable in words. Now I can have some peace that I finally was able to tell someone. Thank you for that."],"Country":"United States","Log Number":"US-11252008-0006"}