{"Date of the Event":"09/25/2008 12:00 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-11252008-0005","files":["/var/www/straped/mufon/html2text/13998.html.txt","/var/www/straped/mufon/more/13998_submitter_file1__Robert005.JPG","/var/www/straped/mufon/more/13998_submitter_file2__Robert026.JPG","/var/www/straped/mufon/more/13998_submitter_file3__Robert018.JPG","/var/www/straped/mufon/org/13998.html"],"Object Shape":"Disc, Star-like","Summary":"It was just a unbelieveable event and it lasted for acouple of days so it was exciting.","map":"<A HREF = \"http://maps.google.com/maps?q=42.96946,+-85.661836(13998)&iwloc=A&hl=en\"> mufon case (13998) map </A>","divs":["Sighting DetailsTo Whom it may concern , my name Robert j White of muskegon on Sept 25 , 2008, I decided to take some photos of the stars messing around with my cousins. So I went outside and started taking photos of the stars. As I looked threw my camera I really didn't see anything at all., so after taking nine photos I headed in. But when i got in the house to view the photos. I found them too not only have stars on them, but also it held photos of quite abit of circle discs. If my eyes is not failing me it must be about (12) disc shaped objects or more, My camera is a fujifilm fine pix digital 2600zoom 3x optical zoom 2.0 mega pixel. So I decided to go out every chance I get, I went out the Sept 25, 26, and 27 , of 2008. All togehter I took 35 photos and 12 of them have something on them. I don't want to stick my chip in this computer and lose the photos by error. However, if you send the directions to and how to down load the imformation to you , I will do that as well. My email address is alvera.atkinson@yahoo.com, you could send your response Robert of Muskegon county. The photos was taking outside of my home in the back yard of Muskegon MI,and yes I felt petty weird I showed everyone I could.I also have more photos and film of something undescribe-able in the skies of Muskegon michigan.So these first photos was the beginning of a line of photos and film. P.S Thank you for giving me the opportunity to share what I saw the night of Sept 25,26,and 27 2008. Robert of Muskegon"],"trends":["There have been 45 other sightings in Grand Rapids","There was one other sighting in Grand Rapids on or around September 25th 2008","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Latitude":"42.96946","Weather Factors":"Unknown","Tags":"City","City":"Grand Rapids","Longitude":"-85.661836","Sighting Duration":"02:00:00","Region":"Michigan","Country":"United States","Date Submitted":"09/25/2008 12:00 UTC","Object Flight Path":"Undisclosed","Case Number":"13998","Source":"MUFON"}