{"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Summary":"Very bright light/ spotlight in sky.","Case Number":"13996","trends":["There have been 9 other sightings in Junction City","There were no other sightings in Junction City on or around November 24th 2008"],"Object Features":"Unknown","Disposition":"Unknown","City":"Junction City","Sighting Duration":"Undisclosed","Region":"Arkansas","Weather Factors":"Unknown","divs":["sighting detailsme and my brother was walking north on our street. onpon reaching the corner we observed 2 very bright objects in the sky we took to be stars. they were odd because they were extemely bright and very low. one of the objects was smaller than the other sitting at about a 11:00 position above the very large one. we jokingly say to each other that they are probably some ufo's and begin to say how bright they are. we turn around to go back home because no one was outside. about 40yd from the corner of my street in front of a neighbors house. we look up to observe a fast star like object headed north very fast. 3x or 4x faster than a plane. a plane or jet was in close persuit of the object. we kept walking just a few feet furher we see another object going estremely fast being chased by a plane. we see this all the time, so we joke they are chasing the ufo's tonight. we keep about another 40yd then we see a very bright starlight object just to our left just sitting still. it wasnt very high or very far away. we still pay not much attention, we see it all the time. it's nothing, and keep walking. about 10 yards later my brother notice lights were coming from behind us say, \"here come a car, get out the road\". i tell hime, \"i dont hear a car.\" my brother then turn around and then says,\"oh sxxt! oh sxxt! it fixing to get us! its fixing to get us! im going through the woods.\" next i turn around and look then say, ahh aahhh. i was trembing with fear at what i saw and couldnt say anything. what i saw was the bright star like object coming at us with a white beam\\light on the ground. i grab him from running through the bushes and tell him, \"hell nawl, we are togethter.\" in less then a second the light was from the corner of my steet to about 20feet from us. by then he bolts and take off running full speed to the house. i follow behind running for my life. neiher one of us looked back. when we went back up the road with more people. the 2 obeject were still in the sky where we first notice them. it is now around 6:22 we go out stay till about 7:40. then we notice both object were gone."],"Viewing Distance":"20 Feet or Less","Source":"MUFON","Date of the Event":"11/24/2008 12:00 UTC","Date Submitted":"11/24/2008 12:00 UTC","Object Shape":"Star-like, Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.01799,+-92.716724(13996)&iwloc=A&hl=en\"> mufon case (13996) map </A>","Longitude":"-92.716724","Country":"United States","files":["/var/www/straped/mufon/html2text/13996.html.txt","/var/www/straped/mufon/org/13996.html"],"Log Number":"US-11252008-0003","Latitude":"33.01799"}