{"Latitude":"38.80657","Case Number":"14000","Date of the Event":"10/08/2008 02:00 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.80657,+-116.411689(14000)&iwloc=A&hl=en\"> mufon case (14000) map </A>","Object Features":"Undisclosed","trends":["there have been no other sightings in ? [cms\\tg]","This sighting has never been favorited."],"Tags":"City","Date Submitted":"10/08/2008 02:00 UTC","Country":"United States","Object Shape":"Egg","divs":["Sighting DetailsOn October 8, 2008 I was flying to Oakland, CA from Chicago, IL. About half way into the flight, or a little more, I was bored and just started staring out the window as we were flying over the Mountain States. I soon realized a black egg flying around the same height as the plane was. It had a ghostly black tail (my first thought was that it was a plane on fire!) and was smoothly flying near the plane, as if it was supposed to be there. Curious, I started taking pictures of it, so I could later zoom in and see it clearer. I remember looking around and not seeing anyone else notice it...and I didn't say anything to anyone. I remember thinking \"If this is a dangerous object...the pilot would know, right?\" Then I took a video of the Egg as it changed directions to be perpendicular to the plane. Any suspicions of falling asteroids were immediately dismissed...as they can't change directions...or fly. It seemed like the tail got bigger and bigger as the Egg flew away from us. I tried to convince myself that it was some militaristic plane, as we were over one of the Mountain States where they could do testings. But it didn't seem right...I really think that what I saw was unexplainable."],"files":["/var/www/straped/mufon/html2text/14000.html.txt","/var/www/straped/mufon/more/14000_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/14000_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/14000.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-116.411689","Region":"Nevada","Summary":"Black egg with ghostly tail.","City":"? [cms/tg]","Log Number":"US-11252008-0007","Sighting Duration":"Undisclosed","Disposition":"Unknown"}