{"Sighting Duration":"Undisclosed","Summary":"A stationary flashing blue and green sphere, some came out of the flying object.","Date of the Event":"11/17/2008 12:00 UTC","Region":"Texas","Tags":"City","files":["/var/www/straped/mufon/html2text/14001.html.txt","/var/www/straped/mufon/org/14001.html"],"divs":["Sighting DetailsOn November 17, 2008 at approximately 2200hrs, I was walking home from my drive way which is approximately 15 yards from my house when I notice a silent flashing object on the horizon due south-east from my location, upon further observation, I notice it was a stationary sphere flashing in a green and blue multi-colored, at first I thought it was a border patrol helicopter or a UAV which they a common in my area due to the proximity to the Mexican border, the object did not appeared to be any conventional aircraft, I thought that was awkward, and kept observing the object for a couple of minutes possibly two to three minutes when, I notice a smaller white light it either came out or fall off the object, I lost track of the smaller object because at that point I could not believe my eyes, I was mesmerize by the event I had just witness, I then notice the stationary green and blue sphere move up in an unexplained manner and disappear. The whole event only lasted no more than ten minutes, I wish I would off taken some video or pictures, I thought about it, but my camera did not have a charge batteries and video camera was at my brothers house, I tried my cell phone camera but it was useless. I know that with out pictures or video is hard to back up my case, I was by myself and I do not know of any other witness. The weather that night was beautiful, with a real clear sky, and most of the stars were visible. I have no reason to make this up, I am a current federal government employee that works at a local airport, I work day in and day out with airplanes, and I know how airplanes sound, how they look at night and at a distance etc., prior to my current employment I was employed at a local police department, and I am a amateur astronomer so I am familiar with the night sky. And my residence is located outside city limits in the ranch country so I have a very clear view of the night sky."],"trends":["There have been 2 other sightings in Progreso","There were no other sightings in Progreso on or around November 17th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.096479,+-97.953944(14001)&iwloc=A&hl=en\"> mufon case (14001) map </A>","Country":"United States","City":"Progreso","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Case Number":"14001","Disposition":"Unknown","Longitude":"-97.953944","Weather Factors":"Unknown","Object Flight Path":"Stationary","Date Submitted":"11/17/2008 12:00 UTC","Latitude":"26.096479","Object Shape":"Sphere","Log Number":"US-11252008-0008","Object Features":"Undisclosed"}