{"Object Shape":"Circle, Sphere, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14009.html.txt","/var/www/straped/mufon/org/14009.html"],"Weather Factors":"None","divs":["Sighting Detailsit happend in the summer in the mnth of june, me and my girfriend and her cousin were in terrace heights on a canal road that over looks yakima. we were sitting in the car for about 2 hours talking about the days events and other none speciface topics. at one moment of a conversation i looked up threw my moon roof and noticed a bright light in the sky, at first i thought it was an airplane. i realized that the light had no blinking light like and airplane and was not moving so at that time i asked my girlfriend and her cousin \"what is that\" and i pointed at the moon roof towerds the object, they tried to look at it threw th moon roof but couldnt see it so my girl friend looked out the passanger window, as she did this the object at that time was the brightist light in the sky went from a bright light in the sky to a small dim star looking light, it started moving north in an upward direction until it vanished into the sky. me and my girl friend looked at each other and i asked her\"did u see that\"? she replied yes\" and i said\" what was that\"? and we both just stared at each other in disbalief. that was my first sighting of these lights and have abserd many more over yakima since."],"Region":"Washington","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-77.028606","Date of the Event":"05/31/2008 08:02 UTC","Case Number":"14009","Object Flight Path":"Hovering then path","Date Submitted":"05/31/2008 08:02 UTC","Summary":"Bright light that dimmed and flew north and up.","Tags":"City","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around May 31st 2008"],"Viewing Distance":"Unknown","Latitude":"38.900812","Log Number":"US-11252008-0016","Disposition":"Insufficient Data","City":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=38.900812,+-77.028606(14009)&iwloc=A&hl=en\"> mufon case (14009) map </A>","Source":"MUFON"}