{"Summary":"Low flying, slow moving object, very little noise, I could the structure on the surface that I could see.","Sighting Duration":"Undisclosed","Case Number":"14008","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"48.219821","trends":["There has been one other sighting in Coupeville","There were no other sightings in Coupeville on or around April 23rd 1960"],"Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/14008.html.txt","/var/www/straped/mufon/org/14008.html"],"City":"Coupeville","Longitude":"-122.68628","Log Number":"US-11252008-0015","Region":"Washington","Object Shape":"Other, Unknown","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=48.219821,+-122.68628(14008)&iwloc=A&hl=en\"> mufon case (14008) map </A>","divs":["Sighting DetailsI had attended a 4-H club meeting at Mrs Knights house near Ebey's landing, near Coupeville, WA. I left the house after the meeting and walked down the long drive way to the street to wait for my mother to pick me up, I was about 7 to 8pm. Everyone else was gone and I was alone standing by a street light. I think it was in the spring, because as I remember it was dark early and yet it was not vary cold, so I am guessing maybe March or April, the day,not sure. Also the night was still, not common for that area near the West beach of Whidbey Island. As I waited I could hear a low pitched, low volume sound comming from over head. I looked up and could see what I thought was a plane flying over head, planes were common, because there was a Naval Air Station and a Sea Plane base on the island. What was uncommon was the slow movement of the object, the low noise level,and the low altitude,it seemed to be just about three telephone pole lengths off the ground. I tried to estimate the by looking at the pole the street light was on. The most important thing I was the structure of the object, the way the surface was assembled. It looked like bolts or rivets connecting plates to an unders structure. The light by which I could see the details of the structure was not from the street light but moved with the object. I could not see the size of the object because it was too dark. I watched it for maybe a minute or two until it was out of sight. When my mother arrived I told her about it, but she was not imperssed. I did't think too much more about it, until I became friends with an Air Force pilot, just a few years ago, and told him thinking that he might know what kind of a plane it was. His response was \"I have always wanted to see one of those\", I ask, those what? He answered a UFO, there arn't planes that can do what you describe. Tonight I saw a program about you research so I thought I should tell someone, that would be you. Let me know if more dtails would be helpful. Thanks, Sonny Sleater p.s. sorry any typos or spelling errors"],"Date Submitted":"04/23/1960 12:00 UTC","Weather Factors":"Unknown","Date of the Event":"04/23/1960 12:00 UTC","Viewing Distance":"21-100 Feet"}