{"Longitude":"-156.46516","Country":"United States","Case Number":"14018","Latitude":"20.895962","Sighting Duration":"01:22:00","Object Shape":"Cylinder","Summary":"This is one of MANY sightings. The object moved low on horizon in circular patterns, often stopping and reversing direction","Object Flight Path":"Stationary,Path with directional change,Path then hovering,Other","Date Submitted":"11/23/2008 01:25 UTC","Tags":"City","Date of the Event":"11/23/2008 01:25 UTC","City":"Kahului","files":["/var/www/straped/mufon/html2text/14018.html.txt","/var/www/straped/mufon/org/14018.html"],"Log Number":"US-11252008-0025","Disposition":"Unknown","Region":"Hawaii","map":"<A HREF = \"http://maps.google.com/maps?q=20.895962,+-156.46516(14018)&iwloc=A&hl=en\"> mufon case (14018) map </A>","Object Features":"None","trends":["There have been 4 other sightings in Kahului","There were no other sightings in Kahului on or around November 23rd 2008"],"divs":["Sighting DetailsAgain I say that this is one of MANY different sightings that I have witnessed. This is only the second time that I have seen this particular object. At exactly 1:25 am I was out on my deck peering through my telescope. As the motor moved the scopes declination, I noticed something of a blur. I quickly looked up, and to my surprise I saw what appeared to be a light(maybe white), long, cylindrical object moving VERY slowly at about 20 degrees above horizon. At first glance I thought it might be a missile because the moon was fairly bright and shaded what turned out to be a large portion of the object. As the clouds slightly shrouded the moon and the object turned counterclockwise I noticed that it was quite a bit larger that my previous assumption. It resembled a passenger aircraft with no wings, no tail, no discernible nose and from what I could tell and see in my telescope, no markings whatsoever. This object moved in all directions and pivoted on its axis allowing me to see it VERY well. There were lights but not like an aircraft. From what I could see, the only lights were on its nose or tail(one end as there was no way to tell which end was nose or tail). The object moved in such a way that I have NEVER seen before or after. Most of the time it looked as if it just was creeping along but every now and then it would move so fast that it appeared to vanish and appear a mile or two across the sky in an instant. This got my attention as I have NEVER seen something move THAT FAST. It continued to creep and sometimes dart for exactly one hour and 22 minutes. I could see that the object was relatively close because I would occasionally loose it behind a group of clouds( I live up on the Haleakala crater) and other times I noticed the same clouds BEHIND the object. I would estimate the length at an astounding 700-1000 feet. The method I used to come to that length was, I waited for it to pass between myself and the crater and used some geographical features that I know to be approx. 100 yards in length. The object simply dwarfed the crater feature I mentioned, possibly 3 times as long. After watching it for almost an hour and a half, I thought it went behind some low clouds. It turned out that it did not go behind or into the clouds, it simply disappeared but with what I would call a trace. Where I saw it last in the sky, the moon lit up the group of clouds that it went into, and there I noticed a fairly large but perfectly round hole in the cloud mass. I stayed out scanning the sky for another 30 minutes but the object did not return to the best of my knowledge. I had called my good friend and told him to look low on the western horizon about 15 minutes before it dissipated. I had waited to call him simply because his wife is pregnant and it was very late. After about an hour+ of viewing the object came VERY close to being over his house, it was then I decided to chance the wrath of his wife simply because it was so close to him that I thought he might be able to tell what it was. He ran to his lanai and looked but described the same as me except the size which he said was bigger than my estimate and absolutely NO SOUND WHATSOEVER! I had seen something very much like this about 8 years ago in the skies above Malibu Canyon Road. It was the middle of the day and I was comming back from a surf session with a buddy of mine. We both witnessed it before it disappeared out of sight. I would have to say that given the close resemblance to the object I saw the other night, that this was probably the same type of object. I think that just about covers it....If you could venture a guess as to what I saw I would be open to suggestions. Aloha and Ma Halo for taking the time to read my account. GH"],"Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet"}