{"Longitude":"-75.156369","Object Shape":"Circle","Viewing Distance":"Unknown","divs":["Sighting DetailsMyself my co-worker soupi,and my other peer hayden,were just getting off work on that morning and we were walking towards the employee parking lot,we work at inquier daily news in conshocken p.a.,the direction we where walking was torwards what we call around here mid county where all 3 counties meet.and we saw a green flash like nothing none of us had ever seen before.we paused and where amazed for about a minute,and then we dropped it,never talked about it again for fear of being called insane.well at least thats what i was thinking,until i saw the show on the discovery channel last night i now know i am not insane.sightings of ufos over bucks county,i do believe now.i also 2 days later had a out of body experience i did not go anywhere as far as i can remember i fell asleep on my couch and was out of my body in my living room looking down at myself sleeping.and that never happened again.i to also have nothing to gain out of this ,i get to express what happened without being called crazy.but this object was so fast i am assuming it was round and the green trail behind it was just as fast,and it was low heading south west about five ten am i always wear a watch.,it is a good feeling inside to be able to express this to someone who can relate that show last night has put my mind at ease.Thank you for generating that show. CD."],"files":["/var/www/straped/mufon/html2text/14016.html.txt","/var/www/straped/mufon/org/14016.html"],"Country":"United States","Region":"Pennsylvania","Weather Factors":"Unknown","Latitude":"39.957525","Object Flight Path":"Undisclosed","Date Submitted":"05/13/2008 05:10 UTC","Object Features":"Undisclosed","City":"Philadelphia","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around May 13th 2008"],"Case Number":"14016","Summary":"Walking to car and saw it.","Log Number":"US-11252008-0023","Tags":"City","Sighting Duration":"00:00:02","Disposition":"Insufficient Data","Date of the Event":"05/13/2008 05:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.957525,+-75.156369(14016)&iwloc=A&hl=en\"> mufon case (14016) map </A>","Source":"MUFON"}