{"Object Shape":"Triangle","Log Number":"US-11252008-0022","Sighting Duration":"Undisclosed","City":"Escondido","Country":"United States","Disposition":"Insufficient Data","trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around November 30th 1999","This sighting has never been favorited.",""],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14015.html.txt","/var/www/straped/mufon/more/14015_submitter_file1__escondidoUFO.jpg","/var/www/straped/mufon/org/14015.html"],"Date of the Event":"11/30/1999 03:00 UTC","Date Submitted":"11/30/1999 03:00 UTC","Source":"MUFON","Region":"California","divs":["Sighting DetailsOn a clear afternoon about 3 pm, I was walking in our back yard and looked up to see a triangular shaped object. It never made a sound. My guess is that it was perhaps flying at 7000 feet up in the sky. The sky was fairly clear with scattered clouds at the south towards San Diego. The object was not a hard triangle, but rather the edges were smooth. I saw no outstanding features on it. The color was a \"dull shiny gray\".. not high gloss, but more of a sheen rather than a shine. Perhaps satin-like in appearance. I only ever saw the underneath and it appeared to bulge slightly at the center.. not straight and smooth, but a slight inflated appearance towards the center. It was almost directly above me and flew very slowly and silently directly towards the south and then made a right angle into a cloud and disappeared several miles south... maybe 15 miles down. My mom was with me during the first few minutes, then went into the house to get a pair of binoculars. She returned about 5 minutes later, but by that time, it had disappeared. It was in the sky for about 10 minutes or so. It never turned around or made any sudden movements. It traveled slowly and smoothly. I made an illustration to show you appoximately what it looked like."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.127907,+-117.077321(14015)&iwloc=A&hl=en\"> mufon case (14015) map </A>","Latitude":"33.127907","Weather Factors":"Unknown","Tags":"City","Longitude":"-117.077321","Summary":"Triangular-shaped UFO over Escondido, California - 2000","Viewing Distance":"Unknown","Case Number":"14015","Object Flight Path":"Undisclosed"}