{"files":["/var/www/straped/mufon/html2text/1401.html.txt","/var/www/straped/mufon/org/1401.html"],"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Date Submitted":"01/05/2001 08:00 UTC","Latitude":"44.314844","Object Shape":"Other","Date of the Event":"01/05/2001 08:00 UTC","trends":["there have been no other sightings in jackson\\grasslake","This sighting has never been favorited."],"divs":["Sighting DetailsOn January 5, 2001 at approximately 8:00 pm, the witness was traveling eastboundon I-94, between Race Road exit and the Truck Weigh Station. He initiallyobserved an intensely bright light at approximately a 45 degree angle (initiallythought it was a planet), at 2:00 ESE, south of the highway, out of his frontcar window. Witness described the light as the size of a half-dollar held atarms length. The witness continued to observe the light as he drove along thehighway at approx. 60-65 mph. The light was fast moving and intensely brightwhen he observed it at 11:00 (ENE) over the drivers side-view mirror, north ofthe highway. At the time the light reached the weigh station, it was describedby the witness as a huge, a half-dollar sized at arms length, intenselybright glowing ball of light at nine oclock (N). At this point it seemed to bestationary while the witness drove by. Suddenly, as the witness reported, theball of light shot up and away and \"blinked off. He reported a brighttrapezoidal-shaped streak was left on his eye, but he clarified it was not atail from the object. The witness reported that he traveled approximately 3-4miles during the sighting and the duration of the sighting was between 1-5minutes, though it felt like 15 seconds. The witness also indicated that thevelocity increased, decreased, and then increased again. The witness reportedthe sky conditions were partly cloudy. There were large open areas, whichrevealed a bright, star-filled sky. The moon was bright just west and south ofzenith (straight above and a bit behind him, at 5:00 high). The witness alsoreported observing two aircraft at the time of the sighting. The first aircraftmoved from NE to NW at a higher altitude, slower moving with blinking lights. The second aircraft was moving NW to NE, also slower moving at a higher altitudewith blinking lights. The witness further indicated that driving past the samearea at 10:00 pm the same night, he noticed the area to be very dark and free oftowers, floodlights, large homes, industrial or other electrical light sources. However, he related that driving past the same area two weeks later on January19, 2001, he noticed towers, lights and other electrical equipment that he didnot see two weeks earlier. The witness reported that he felt a lot of anxietyand fear when he saw the object. He relayed that he ended up crying, which isnot his usual character. When he arrived at the home of his friends in AnnArbor, he was upset. He recounted his story to them and reported they believedhim because of his state of mind."],"Sighting Duration":"00:05:00","Country":"United States","Region":"Michigan","Viewing Distance":"Unknown","Case Number":"1401","Summary":"Bright Ball of Light seen in Jackson, Michigan","Tags":"City","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=44.314844,+-85.602364(1401)&iwloc=A&hl=en\"> mufon case (1401) map </A>","City":"Jackson/Grasslake","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-85.602364"}