{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.727882,+-76.451908(14022)&iwloc=A&hl=en\"> mufon case (14022) map </A>","trends":["There has been one other sighting in Fawn Grove","There were no other sightings in Fawn Grove on or around November 23rd 2008"],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14022.html.txt","/var/www/straped/mufon/org/14022.html"],"Date Submitted":"11/23/2008 06:00 UTC","City":"Fawn Grove","Sighting Duration":"Undisclosed","Log Number":"US-11252008-0029","Object Flight Path":"Stationary","Object Features":"Unknown","Latitude":"39.727882","Region":"Pennsylvania","Disposition":"Insufficient Data","Summary":"Black triangle with three lights hovered in the sky","Case Number":"14022","divs":["Sighting DetailsI was walking my dog for the evening and gazing up to enjoy the night sky when I noticed a trio of lights hanging in the sky in a perfectly even triangle. Faint light, almost bluish, seemed to come from the sides of the object. For the few minutes I was outside, the object made no sound or movement, but hung visibly in the sky, below the clouds when they were on occasion blown through. As I looked at it, I felt only disbelief. Obviously I was seeing something else. But there were no strobe lights to indicate a standard man-made aircraft, and it hung in the sky, too low to be stars or a a reflection on clouds, and too high to be part of some terrestrial structure. I went inside to put the dog away and note the time. When I came back outside to look at the object, I could no longer find it. The next day I went out at the same time, hoping to see the object again and confirm that it was a natural celestial event. The three lights did not appear, nor was I able to find the bluish light that seemed to come from its sides. I was, however, able to locate the nearby star patterns that I had used to note its location in the sky."],"Longitude":"-76.451908","Date of the Event":"11/23/2008 06:00 UTC","Tags":"City","Object Shape":"Triangle","Country":"United States","Weather Factors":"None"}