{"Log Number":"US-11252008-0032","trends":["There have been 4 other sightings in Brewster","There were no other sightings in Brewster on or around January 31st 1989"],"Sighting Duration":"Undisclosed","Date Submitted":"01/31/1989 12:00 UTC","Viewing Distance":"101-500 Feet","Region":"New York","files":["/var/www/straped/mufon/html2text/14025.html.txt","/var/www/straped/mufon/org/14025.html"],"Weather Factors":"Unknown","City":"Brewster","Date of the Event":"01/31/1989 12:00 UTC","Tags":"City","Longitude":"-73.600377","Object Flight Path":"Straight-line path","Case Number":"14025","Latitude":"41.398289","Object Features":"Undisclosed","Country":"United States","Object Shape":"Bullet, Missile, Cigar","Disposition":"Unresolved","divs":["Sighting DetailsHi, I am a medical professional. The event happened some time ago in the late 1980's or earlier. I never really spoke too much about this because it wasn't the typical UFO space craft story. That all changed when I saw the television episode titled \"UFO Files Black Box Secrets\" in 2006. The episode describes an \"east coast\" style UFO from the 80's and 90's the same as I saw, which did really startled when I saw this tv show. I saw the \"black Box\" episode recently and thought you might like to hear this. I was driving with a good friend of mine, to this day, up north probably going to New Hampshire to ski. We were on route 684 near Brewster NY in the afternoon or earlier when I heard a powerful roar and rumble at my right. I was in the front passenger seat. I looked out the right side window and saw what appeared to me to be a cigar missle shaped vehicle maybe some 100 to 200 feet above me shooting right over us with a mist coming out of its end. I immediately turned my head to the driver side window asking my friend if he saw it? At the same time I'm asking this I can see the vehicle (out through his driver side window) was now many MILES away I'm guessing 10 to 20 or more miles shooting straight up through the clouds and into the sky and gone. My friend said he saw nothing and we drove on. This whole event took about 1 to 2 seconds only. Thank you for taking a look. p"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.398289,+-73.600377(14025)&iwloc=A&hl=en\"> mufon case (14025) map </A>","Summary":"Late 1980's- cigar missle like vehicle with mist going incredibly fast","Source":"MUFON"}