{"City":"Philadelphia","Sighting Duration":"Undisclosed","Log Number":"US-11252008-0028","Country":"United States","trends":["There have been 216 other sightings in Philadelphia","There were 3 other sightings in Philadelphia on or around November 18th 2008","This sighting has never been favorited.",""],"Tags":"City","files":["/var/www/straped/mufon/html2text/14021.html.txt","/var/www/straped/mufon/more/14021_submitter_file1__IMG_1708-CMS14021.JPG","/var/www/straped/mufon/org/14021.html"],"Date of the Event":"11/18/2008 06:30 UTC","Longitude":"-75.160869","Region":"Pennsylvania","Date Submitted":"11/18/2008 06:30 UTC","Object Features":"Unknown","Summary":"Formation of 5 followed by formation of 2.","Case Number":"14021","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Latitude":"39.961995","divs":["Sighting DetailsI was cooking and I went out in my yard to smoke a sigarette when I noticed lights above my head. My first impression was an airplain flying very low but I had immediately a perfect sight of five triangular yellow lights, in a wing formation. The lights were not bright. Each triangle was perfectly visible but the image I would describe it out of focus. The two latelal lights left the formation and moved towards the center. The right object moved very quicly left, right left, remaining flat. The second one also moved but not as fast. In that moment I thought that somebody was projecting some kind of laser lights into the sky but there were no clouds. When I lost sight of these lights behind a neighbour wall I went inside to take my camera in case they came back. Instead,I spotted two more of these lights, not right over my head but more toward the center of the yard, flying at the same speed and altitude but very close to each other. By the time I was ready to take a picture these objects were pretty far and all I have is an image with 2 little lights that could be anything. At least I know that this is what I have seen.... It seems impossible that nobody else have reported this event as the lights were flying low, parallel to I-95 direction south towards center city Philadelphia. Thank you."],"Disposition":"Unknown","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.961995,+-75.160869(14021)&iwloc=A&hl=en\"> mufon case (14021) map </A>","Source":"MUFON"}