{"Latitude":"39.958955","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI got off duty from my job as a police detective at about 2300 hrs. and when I was being driven home I saw the object to my right up in the sky. It was a clear night. The object caught my attention because it was bright and hovering but I didn't pay any more attention to it. I got dropped off at my house about one half mile down the road and when I got out of the car in front of my house I saw the same object across the street from my house hovering between two houses. I said to my driver who was a Lt. \"What to hell is that\". We stared at it fro about one minute and he said, \"I don't know what it is but don't say anyitng to anyone because they wll think we are nuts\". Then he left. I stood there looking at the object for about five minutes and then went and sat on my front porch watchng it fro about another ten minutes. Hard to gauge time because I was scared and fascinated at the same time. The object was quite large, disc shaped and had bright pulsatng lights around it. The colors were amber, green, red and blue. They were very bright. I could vaguely make out what appeared to be a dome on top but the lights were so brihgt that I coudn't see clearly but I believe the color of the dome was a dull silver. I had an eerie feeling that the object was focusing on me because no body else was around and it was a Sunday night in the suburbs which means no traffic was out. The object was about 75 yards across and was hovering at about 100 feet. It did not move the whole time and there definitely was not any noise. I did not have a camera and even if I did I was too scared to use it. I got up and went inside and woke my wife up and showed her and when we both looked out the front window it wsa still there. My wife asked if we could take a vidieo with the old beta type recoreders but I told her no because I didnt want to have to turn on the light apparatus with the camera because it might scare the object away. We watched it fro about ten more minutes and it didnt move. When it did move it sped up and back at a speed I never saw before. Then it seemed to just reappear at the new location. About 5 seconds later it went up higher and forward and stopped fro another 5 seconds then up and out of sight at incredible speeds. I never heard anyitng from the object as it moved and even today there is nothing that comes close to the speed that it moved. It moved literally like the blink of an eye. I was a seasoned law enforcement officer and detective and I spent a few years in the USMC working around helicopters and jets. This object was not a military aircraft and it moved wiht speed that is not possible from our aircraft. I never told anyonme about this for many, many years partly because if my Lt. found out I was afraid to get him involved and I would be disciplined and parly because I didnt want people to think I was insame. After your story aired about the sightings in Bucks County which is wher my incident happened I feel more comfortablee talking about it. My only regret was that I didnt take a pic but I didnt own 35 mm amd the movie cames was antiquated and I didnt want to take time away from observing the object. I do know that I was very frightened even though I was armed. Again I had the disitnct feeling that hthe object was studying me."],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.958955,+-75.159389(14026)&iwloc=A&hl=en\"> mufon case (14026) map </A>","Object Shape":"Disc","Longitude":"-75.159389","files":["/var/www/straped/mufon/html2text/14026.html.txt","/var/www/straped/mufon/org/14026.html"],"Date Submitted":"09/23/1980 11:15 UTC","Log Number":"US-11252008-0033","Country":"United States","City":"Philadelphia","Region":"Pennsylvania","Summary":"Spotted a disc shaped object wiht multi colored pusaitng lights. Large, made no noise and hocvered an moved about three times at incredible speed. I was getting off work as polcie detective when I spotted it.","Object Features":"Undisclosed","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around September 23rd 1980"],"Case Number":"14026","Date of the Event":"09/23/1980 11:15 UTC","Source":"MUFON"}