{"divs":["Sighting DetailsOur alternative education school was taking a \"lantern walk\" in which everyone walks with lanterns and sings songs. I cannot remember exactly how I came to notice the object, but it may have been the sound it was making. A quiet buzz or hum perhaps. When I eventually did notice the object I assumed it was a passenger plane. Then i realized there were many clues all telling me it was something else. First, it was a disc. I could tell its shape because it was outlined with small lights, similar to those seen on an airplane. Then I realized how low it was. It was either very low or very big which, either way, means it was not an airplane. It was also moving at a very slow, constant speed. I do not remember what I saw when it left my field of vision. It may have simply passed over some trees out of my line of sight. After it was gone, I went to a couple of my friends to see if they had seen it. They said they had, and a few days later we decided to draw a picture of what we had seen. We all agreed; we had all seen the same object. While I was watching the object I don't think I really knew what to think. I had never really thought about UFOs or really the unknown in general. I will definitely not forget what I saw."],"Country":"United States","files":["/var/www/straped/mufon/html2text/14038.html.txt","/var/www/straped/mufon/org/14038.html"],"Date Submitted":"10/31/2003 08:00 UTC","Object Features":"Patterned Surface","Case Number":"14038","Longitude":"-91.235751","City":"La Crosse","Source":"MUFON","Summary":"Flying disc glides slowly overhead. Two friends confirm sighting and agree on description.","Object Shape":"Disc","Region":"Wisconsin","Date of the Event":"10/31/2003 08:00 UTC","Log Number":"US-11252008-0045","Sighting Duration":"Undisclosed","Weather Factors":"None","trends":["There have been 3 other sightings in La Crosse","There were no other sightings in La Crosse on or around October 31st 2003"],"Latitude":"43.802676","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.802676,+-91.235751(14038)&iwloc=A&hl=en\"> mufon case (14038) map </A>","Object Flight Path":"Straight-line path","Tags":"City"}