{"divs":["Sighting DetailsI just heard about you guys. This happened 30 years ago. I was watching cartoons inside my house and my older brothers and sister were doing house chores. Some one called the rest of us to come outside to see something up in the sky. When we came out all the neighbors and pedestrians (in total about 50+ people) were looking up and pointing at a silver ring hovering over the town. I saw no windows or other distinguishable features but it was clear to all of us that the ring was rotating. My brothers climbed to the top of a mango tree to get a better view. The ring moved out of sight very slow. The whole thing lasted a bit more than an hour. When I was stationed in germany in 2002. I was on top of a Ace looking at the stars with my NVG's (it was my first time using them)and noticed what appear to be a flock of birds flying very fast and sig sagging. I followed them looking at them through the NVG's and realized that the objects were flying way above the clouds. It was October or November. Other thatn a few high white clouds, the sky was cleared and it was a cold night (2300 to 0000 hours). Some time later I saw a dramatization of what a pilot saw over Alaska or Washington and that was exactly what I had seen in Germany. In Graffenwoehr."],"trends":["There have been no other sightings in Penonome","This sighting has never been favorited."],"Tags":"City","Longitude":"-80.366667","Summary":"Silver ring (like a wedding ring).","Case Number":"14036","Source":"MUFON","Disposition":"Unresolved","Log Number":"PA-11252008-0043","City":"Penonome","Object Flight Path":"Undisclosed","Country":"Panama","Latitude":"8.5","Date of the Event":"11/30/1976 10:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=8.5,+-80.366667(14036)&iwloc=A&hl=en\"> mufon case (14036) map </A>","Weather Factors":"Unknown","Object Shape":"Circle","Date Submitted":"11/30/1976 10:00 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14036.html.txt","/var/www/straped/mufon/org/14036.html"],"Region":"Cocle"}