{"City":"Undisclosed","divs":["Sighting DetailsDear Sir; I was out walking my dog before putting her inside for the night like I do every night. I observed a huge triangle shaped object flying over my house at about 9:00 PM last night, November 24, 2008. I live at 56th and I-29 in one of the flight paths for KCI airport. I've lived there for a couple years as such I've seen jets flying in every night from 10 to 20 times a night. This was not a jet. It was about 2000 feet off the ground, and completely silent. White or yellow lights were on the leading edges of the triangle. There were about 3 to 5 lights on each side in a straight line. I watched it pass overhead slowly for about 2 minutes then it vanished or flew out of sight. I say vanished because I watched it fly away but I expected that I should have been able to watch it longer. I reported this to the KCMO police 911 dispatcher about 10 minutes later. It was flying directly in the direction of KCI Airport so I wonder if they picked it up on radar. I'd like to know if anyone else reported seeing the triangle last night above Kansas City? I'm a former United States Commissioned Naval Officer, and a former assistant Jackson County Prosecuter. I want to remain anonymous."],"Region":"Missouri","Date Submitted":"11/24/2008 12:00 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","trends":[],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-11252008-0041","Date of the Event":"11/24/2008 12:00 UTC","Latitude":"37.973053","Case Number":"14034","Summary":"Silent dark triangular object flew at low speed about 2000 feet off the ground.","Country":"United States","Weather Factors":"Unknown","Object Shape":"Triangle","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.973053,+-91.824293(14034)&iwloc=A&hl=en\"> mufon case (14034) map </A>","Longitude":"-91.824293","files":["/var/www/straped/mufon/html2text/14034.html.txt","/var/www/straped/mufon/org/14034.html"]}