{"Tags":"City","Sighting Duration":"00:05:00","Case Number":"14035","Latitude":"41.284493","files":["/var/www/straped/mufon/html2text/14035.html.txt","/var/www/straped/mufon/org/14035.html"],"Source":"MUFON","Disposition":"Insufficient Data","Object Flight Path":"Stationary","Weather Factors":"Unknown","Summary":"Ufo shaped like a disk with up to 5-6 lights around it.","trends":["There have been 5 other sightings in Defiance","There were no other sightings in Defiance on or around October 1st 1996"],"divs":["Sighting DetailsI am 23 now and this happened when I was 9 or 10 to this day I can play these moments like a movie in my head. I was living in the Clinton circle apartments in defiance, Ohio. I was playing with my friend Craig.I was playing backyard football and the game had finished up a little bit before hand so it was just me and him. It was dark so I was already late from being home and Craig asked me to walk to his house with him. Then it seemed like with both looked up at the same time. I was instantly terrified. I remember looking at it for about 1 min total before we ran home. I remember it was disk like in shape. The lights were flashing multicolored and wrapped around the body of the craft. I never saw it move. It hovered like a helicopter that had a silencer on it. No sound at all. I went to Craig house the next morning and asked his mother at the front door if I could see him. He came to the door and I immediately started talking about the alleged UFO. He start denying it happened then reveal that he was not allowed to talk about it or he would be in trouble and that was the end of it till now. Remember I was a kid with a very big imagination so this could been over exaggerated by my mind. Even so I still think about it all the time and the memory is as fresh as the day it happened."],"Object Shape":"Disc","Object Features":"None","Longitude":"-84.35578","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","City":"Defiance","Log Number":"US-11252008-0042","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.284493,+-84.35578(14035)&iwloc=A&hl=en\"> mufon case (14035) map </A>","Date Submitted":"10/01/1996 08:00 UTC","Country":"United States","Date of the Event":"10/01/1996 08:00 UTC"}