{"Date Submitted":"08/19/1983 11:20 UTC","files":["/var/www/straped/mufon/html2text/1403.html.txt","/var/www/straped/mufon/org/1403.html"],"trends":["There have been 2 other sightings in Flushing Township","There were no other sightings in Flushing Township on or around August 19th 1983"],"Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=43.107465,+-83.868507(1403)&iwloc=A&hl=en\"> mufon case (1403) map </A>","Weather Factors":"Unknown","Tags":"City","Latitude":"43.107465","Longitude":"-83.868507","Disposition":"Unresolved","City":"Flushing Township","Summary":"Nocturnal lights seen in Flushing, Michigan","Object Shape":"Other","Sighting Duration":"00:05:00","Region":"Michigan","divs":["Sighting DetailsOn Aug. 19 at 11:20 pm ____ and I were still on the patio visiting, watching. Suddenly it was just there above the treetops. It was not moving at all and ithad red lights on. We both jumped from our chairs and ran toward the barn. Thered lights went off andone light came on. I yelled \"______ get the guys\" andshe stopped and was going to turn back toward the house. Just then anotherlight came on and it made a 90 degree turn and shot away from us back toward thewoods. This happened on the evening of the morning you guys flew over our area. On August 23 at 1:45 am a young fellow missed the curve and hit a tree. Wewere awake so we heard the crash. _____ went over to the car to see if he couldhelp the young man. By 2:15 there were police cars (2) abmulance and fire truckon the scene. ____ was at the accident site and I was standing on the porchwatching. I do not know how I knew but I knew the UFO was there. I turned andthere it was about 75-100 ft above the ground and about 100 to 150 feet from thehouse. There were only red lights on. It looked like a row of them. The redlights from the emergency equipment was reflecting off of it also. I jumped offthe porch and it turned (90 degrees again) and moved towards the woods. I got agood look at it this time. It was a very bright metallic and the red lights Isaw from the front were reflected off the back and it gave it a slight red glow. There were tripods on the undercarriage. It looked like 2 pie plates turnedupside down and fitted together. The edges were not as shape as a pie plate. _____ was really disgusted because he did not get to see it again. Im stillkeeping watch at night and I know we will see it again. Somehow, somewherethere must be some answers. It must have a hiding place some where near ourhome or it moves faster than we realize. Never the less, Im really excitedabout it and plan to keep my eyes wide open."],"Source":"MUFON","Country":"United States","Date of the Event":"08/19/1983 11:20 UTC","Object Features":"Undisclosed","Case Number":"1403","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown"}