{"divs":["Sighting DetailsI had just got into my car to drive over to a friend's house. I started out heading south on Davisville Rd near Street Rd in Bucks County and almost immediately noticed some really bright red lights in the sky that looked to form a huge triangle. They were very far apart, but you could tell that the angles were all perfect to form a triangle. I watched it for a couple of minutes as I continued driving south on Davisville, and the lights seemed to be moving, getting a little closer together but still retaining the triangle shape. When I turned into the heavily wooded Masons Mill Park area, my view of the lights started to diminish. On the last good look that I got, I noticed that one of the red lights 'disappeared' and at that point I only saw two lights. Anyway I didn't mention it because I thought I must be crazy and that there's no way it could really be a UFO. I'm such a UFO geek, there's no way I'd actually spot one. That's what I thought....and then I started doing some research and realized there have been TONS of similar reports from the same area over the last few months. I don't have any proof to back up what I saw that night, but whatever has been spotted in the Bucks County area over the past few months is still there. I noticed someone else on here made a claim to have seen this object on Nov 18th and was surprised that there were no other reports of it. Well, I didn't catch it on the 18th, but I did see it in the same area only a few nights later."],"trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around November 22nd 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.959115,+-75.154239(14032)&iwloc=A&hl=en\"> mufon case (14032) map </A>","Country":"United States","Weather Factors":"Unknown","City":"Philadelphia","Log Number":"US-11252008-0039","Object Flight Path":"Hovering then path","Object Features":"Unknown","Object Shape":"Triangle","Region":"Pennsylvania","Sighting Duration":"00:05:00","Viewing Distance":"501 Feet - 1 Mile","Case Number":"14032","Longitude":"-75.154239","Latitude":"39.959115","Date Submitted":"11/22/2008 07:00 UTC","Summary":"3 Red Lights forming a Triangle","Date of the Event":"11/22/2008 07:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14032.html.txt","/var/www/straped/mufon/org/14032.html"],"Tags":"City","Disposition":"Insufficient Data"}