{"Object Shape":"Disc","Tags":"City","Region":"Florida","trends":["There have been 5 other sightings in Oldsmar","There were no other sightings in Oldsmar on or around August 6th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.045009,+-82.699869(14045)&iwloc=A&hl=en\"> mufon case (14045) map </A>","divs":["Sighting DetailsI'm a security officer. I patrol a plaza with various stores. On the time and date as stated, this is what I seen. It was around 11:45 a.m. to 12:00 p.m. During one of my patrols, I happen to see a bright light in the sky towards the west of my location. I didn't think anything of it at the time. I went on continuing to patrol the area. I position myself in a different spot about every 15 to 20 min. and scout the area of the plaza. After positioning myself in a different spot, I happen to notice that the bright light was still in the sky in the same location, the time that had past from the first sight, in the 15 to 20 min. range. This continued until I decided to take a picture of it. At this point, it's not a big deal because I'm thinking it's just a star. I mean, it wasn't moving. About 30 min. to an hour later it was gone. At 3 pm, on my lunch break, I reviewed the photo and started enlarging the photo when as everytime the photo got bigger the detail of a star was not there. The light object started to turn in the shape of a hovering disk. I then noticed small black objects around the bright light object. I then called some freinds to tell them I caught something in a photo, I sent them the photo. They told me to contact MUFON. Thank you for you time and please get back to me as to I would like to know what it is."],"files":["/var/www/straped/mufon/html2text/14045.html.txt","/var/www/straped/mufon/more/14045_submitter_file1__IMG_0016.JPG","/var/www/straped/mufon/org/14045.html"],"City":"Oldsmar","Case Number":"14045","Country":"United States","Object Features":"Dome","Date of the Event":"08/06/2008 01:07 UTC","Log Number":"US-11252008-0051","Latitude":"28.045009","Summary":"A hovering bright white object in the sky.","Longitude":"-82.699869","Disposition":"Unknown","Date Submitted":"08/06/2008 01:07 UTC","Sighting Duration":"01:30:00","Weather Factors":"Unknown","Source":"MUFON"}