{"trends":["There have been 66 other sightings in South Kingstown","There were no other sightings in South Kingstown on or around October 5th 2008"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.437324,+-71.501447(14049)&iwloc=A&hl=en\"> mufon case (14049) map </A>","Viewing Distance":"Unknown","Case Number":"14049","Object Features":"Undisclosed","Latitude":"41.437324","Date Submitted":"10/05/2008 12:00 UTC","Longitude":"-71.501447","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/14049.html.txt","/var/www/straped/mufon/org/14049.html"],"Tags":"City","Weather Factors":"Unknown","Date of the Event":"10/05/2008 12:00 UTC","City":"South Kingstown","Region":"Rhode Island","Country":"United States","Summary":"Sitting on back patio, 2 of us, when a slow moving set of red lights seemed to tumble from East to SW across the sky just above treeline (but somewhat far away).","divs":["Sighting DetailsWe live in the flight path of the airport so I've seen countless aircraft landing. However, this particular event occurred just after dusk. Just sitting there having a conversation I noticed a set of red tumbling lights very slowly crossing the sky. They were slow enough to have a conversation about exactly what they were. There are military aircraft in the area often, but nothing like this I've ever seen. It took several minutes to cross the sky not making any noise. I described it as tumbling red lights, while the other person there thought it looked like they were somehow rotating. We both thought it was very strange looking and just really couldn't figure out what we were looking at during the time it was in view. It's speed was slow and very steady and it's appearance made it very difficult to tell how far away it was. I know almost always, as we live in a very quiet place, that any craft that is within eye-shot can usually be heard. This appeared very large if you thought of all the red lights on one aircraft. I believe there is no doubt we would have heard the engine of any plane. There also seemed to be no perspective (like wings) and the movement was eerily slow and steady."],"Log Number":"US-11262008-0002","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"IFO"}