{"City":"Dickinson","Viewing Distance":"Unknown","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Dickinson","There were no other sightings in Dickinson on or around November 20th 2008"],"Date of the Event":"11/20/2008 06:30 UTC","Tags":"City","Longitude":"-95.050267","Summary":"Extremely bright, almost stationary light","Case Number":"14040","map":"<A HREF = \"http://maps.google.com/maps?q=29.461988,+-95.050267(14040)&iwloc=A&hl=en\"> mufon case (14040) map </A>","Latitude":"29.461988","Region":"Texas","divs":["Sighting DetailsWhile walking the dogs, my wife and I noticed an extremely bright light that seemed stationary at first. We both thought we saw it move, but we weren't sure since we were walking. We stopped and watched it for a couple of seconds, but it didn't appear to move. We continued to watch it until we got home (~4 minutes), but we didn't see it move any more. The light appeared much too bright to a planet, and it was near a very bright star or planet. I commented to my wife that it definitely appeared to be within our atmosphere. It seemed close, unlike the stars, but not just because of the brightness. My wife and I have been interested in UFOs for almost two years now, and we regularly watch the skies, rarely missing a day. We are as familiar as a person could get with our night sky, and this was like nothing we had ever seen before. The next night, though I hadn't told anyone about our experience, my Dad randomly asked me if I saw a strange light in the sky. My Uncle was driving in Houston the same night we saw the light. He was on the phone with my dad, and was relaying to my dad that he saw what looked like a UFO come over his vehicle. He said it looked like it went over the area of the Budweiser brewing plant in Houston. Given that I'm submitting this five days later, I've had a chance to read a couple of similar reports and fireball sightings in the area over a period of a few days, which spanned the date of our sighting."],"Log Number":"US-11252008-0047","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14040.html.txt","/var/www/straped/mufon/org/14040.html"],"Object Features":"Undisclosed","Date Submitted":"11/20/2008 06:30 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown"}