{"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.761995,+-88.319072(14046)&iwloc=A&hl=en\"> mufon case (14046) map </A>","Case Number":"14046","Date Submitted":"09/27/1992 11:00 UTC","Region":"Illinois","Summary":"Rotating white light on all 3 axis with small lights dropping away and returning","Latitude":"41.761995","Disposition":"Unknown","Log Number":"US-11252008-0052","Source":"MUFON","Longitude":"-88.319072","Object Features":"None, Unknown","Object Shape":"Sphere, Unknown","divs":["Sighting DetailsI was 18 at the time and some friends and myself decided to drive to a dirt road in the middle of corn fields to the west of Aurora. We specifically went to look for strange lights in the sky, not really believing we would see anything. After about a half hour we saw a light to the west at an estimated mile away from us and about 20deg above the horizon. It was rotating horizontally from left to right about its axis, and we at first thought it was some kind of tower light. We soon noticed that the light wasn't rotating in a striaght line however, it started to spin around it axis slightly rotating clockwise, untill it was now going around an object vertically. Soon it was rotating all the way along the edge clockwise, like it was spinning on all three axis. The light would appear along one edge and go across its face to dissapear behind it. We were all perplexed as to how a light could spin in every direction and not hit the arm that was holding it if it would have been on a tower. Soon, very small points of light started dropping from undernieth the object, about 15 of them. They dropped slowly about the width of a thumb under the object, and then shot off in every direction towards the ground very fast, and were soon gone from sight. Still thinking this had to be some kind of manmade device, such as fireworks from a tower or such. About 10 minutes later, all the small points of light returned to the exact spot the sped off from, below the object, and slowly returned to the larger rotating object. After seeing this we were all perplexed as to what this could be, but were now sure it wasn't man made. As soon as the last small light had returned, the space between the edges of the rotating light seemed to get smaller, and the light dimmer as if receding into the distance, untill we could no longer see it. None of us were drinking or doing drugs that night, and I don't know what we saw, but I know at the time, no known aircraft could have accomplished what we saw. The whole event lasted about 45min to an hour."],"City":"Aurora","Tags":"City","Date of the Event":"09/27/1992 11:00 UTC","trends":["There have been 7 other sightings in Aurora","There were no other sightings in Aurora on or around September 27th 1992"],"Object Flight Path":"Stationary,Straight-line path","files":["/var/www/straped/mufon/html2text/14046.html.txt","/var/www/straped/mufon/org/14046.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States"}