{"Tags":"City","Longitude":"-118.325191","Latitude":"34.094469","Source":"MUFON","Object Shape":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.094469,+-118.325191(14050)&iwloc=A&hl=en\"> mufon case (14050) map </A>","City":"Los Angeles","Object Features":"Unknown","Region":"California","Log Number":"US-11262008-0003","files":["/var/www/straped/mufon/html2text/14050.html.txt","/var/www/straped/mufon/org/14050.html"],"Date of the Event":"03/31/1994 12:00 UTC","Date Submitted":"03/31/1994 12:00 UTC","Disposition":"Unknown","Summary":"Huge Flash of Light in Runyon Canyon","divs":["Sighting DetailsA friend and I were night-hiking up through Runyon Canyon Park. It's usually so beautiful to see the city late at night. We jumped over the fence and walked up the western trail that leads to the bench at the top. We sat on the bench a short while and admired the city. Then on the way down, we passed what was the estate that was in the park on the East side. We passed the tennis court and I said to my friend, \"Wouldn't you just freak if those old delapidated lights went on right now?\" I was feeling a bit freaked out from the darkness at this level of the canyon coming down the eastern trail. Well we went around the tennis courts and started down the trail that is the deepest darkest part of the canyon and suddenly from nowhere, a huge, blinding extraordinary white light flashed...and I noticed that I took exactly 4 steps while the light shined and could see my shadow, and the shadows of the trees and ALL the plants around us. At this part of the trail there are very large eucalyptus trees. I actually could see an owl in the tree startled and flying off. It sounded like everything scurried away at that moment around us. On the 4th step, we both froze in fear. It was SO bright, and seemingly all around us and extremely white. So, we stopped, now in pitch blackness again, looking at each other with complete fear wondering \"what the f@@@\"? With this I told my friend, \"I don't care what it was, just RUN!\". I took him back up there the next day to see where it was because I lived just down the road and knew the park very well..and he swore there must have been some people or cops playing tricks. But when we went back I verified that where we were was dead center in the middle of the canyon where there is absolutely no chance of anyone with a light like that. I can never forget it and was completely freaked out for weeks."],"Viewing Distance":"Unknown","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around March 31st 1994"],"Object Flight Path":"Unknown","Case Number":"14050","Sighting Duration":"Undisclosed"}