{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-11262008-0008","Tags":"City","Country":"United States","Date Submitted":"03/10/2008 09:00 UTC","Object Shape":"Unknown","Weather Factors":"None","Date of the Event":"03/10/2008 09:00 UTC","Latitude":"47.626208","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=47.626208,+-122.521245(14055)&iwloc=A&hl=en\"> mufon case (14055) map </A>","Region":"Washington","Object Features":"Patterned Surface, Appendage(s), Wings, Other","Case Number":"14055","trends":["There have been 2 other sightings in Bainbridge Island","There were no other sightings in Bainbridge Island on or around March 10th 2008"],"Sighting Duration":"00:15:00","Longitude":"-122.521245","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","City":"Bainbridge Island","divs":["Sighting Details1. I was working as a pizza delivery driver at the time and i was delivering my last pizza towards the south end of the island. I was driving on Blakely ave ne heading south, it wasnt untill i passed blakely elementary school and came into the clearing, the road starts to curve left and there is a hill off to the right of the road that i noticed an objects lights closer to the ground than normal. 2. I thought it was an airplane off in the distance with its landing lights on and it appeared to be traveling towards me, this made me instantly alarmed because there isnt a runway around that area for at least 10 miles and not in the direction it was traveling in. from here i never took my eyes off it. 3. I thought the airplane was traveling towards me off in the distance as i traveled further down the road i started to realize the lights wernt really getting bigger and it became apparent that this thing was not traveling at a speed fast enough for an airplane to sustain flight. So i started to slow down and focus on the object. At first, The object had four lights shining towards me, 2 on each side just like an airplane with its landing lights on . 4. I realized that it was much closer than i had originally thought and moving in a way that was impossible to be human technology . I started to get emotional because i instantly recognized the outline of the shape when it became visible to the eye, the only thing i can come close to describing its shape is it very much resembled the mother ship from starfox from the classic nintendo 64 game and also on super smash brothers. it wasnt a 100% replica of the ship but thats the only thing i can describe it as. no other words would describe this object. It was moving towards me from over the water and i noticed the lights actually starting to move up and down in a pattern . the outer left light would move up and the inner left light moved down, the same with the right side. the outer light moved up and the inner light moved down. I didnt know what to make of it at first because i was in complete shock. the object soon moved over the hill and then it soon began to hover directly in front of me and i could see the lights were not actually in a straight line, there were two lights in the front part and two lights in the back, the only way that it could have been possible for me to see the lights moving in an up and down pattern was that the object itself started to tilt at an axis so the rear lights were actually lower in altitude than the front lights. The front lights were on a wider scale than the rear thats why they appeared as outer lights. as i watched it slowly move over me it couldnt have been more than a hundred feet over me. I rolled down my window and stuck my head out the window because it wasnt directly in front of me any more it was directly over me, as i looked up it instantly clicked that these guys wanted to abduct me of some sort and at that point i became emotional and i called my mom to tell her what was happening from there i was on the phone with her for the rest of the experience. As i went further down the road it starts to go down a hill and is surrounded by trees on both sides it started to follow me down the road maintaining its altitude of about 100 ft the whole time. At this point the lights were still in view in the same direction i had saw them before but the object started traveling at a trajectory that was impossible to be from our time, It started to move backwards without rotating like the front of the ship was watching the front of my truck the whole time. as i drove further down the road the object was in the same position, in my front windshield for about half a mile without losing its image of the 4 lights in the same position as i first saw it. 5. at this point i was full on crying but still stable enough to describe everything to my mom as best as i could i couldnt believe what i had just witnessed and i knew there was no possible way for me to convey this information to others and not sound crazy. My mom just tried to calm me down and i knew she didnt really believe me, how would it sound if you got a call out of the blue and the first thing that person said to you was.. There is a UFO hovering over me right now!! I would automatically assume that person was delusional or drunk. so of course i didnt go around blabbing it to everyone I didnt dare mention it at work for a while because i didnt want everyone to think i was a nutter. it was a good job at the time, I eventually mentioned it to a coworker and the owner of the pizza shop, they reacted just as i suspected, just kinda brushed it off and sceptically agreed with me i didnt even explain its movements or it hovering over me. UFOs had come up in a conversation and i said \"Yea ive seen a UFO, while delivering a pizza actually\" and it pretty much was cut off from there. From there on ive only told this to close friends or people that are interested in that stuff because thats the only way for the person not to think you're insane... \"OH you saw the starfox mothership? wow you're just that special i guess(extreme sarcasm).\" 6. As it was directly in front of me towards the end of blakely av, it started to hover back over my roof so i couldnt see it out my front winshield anymore, so i put my head back out the window and looked straight up and it was gone. No trace. Vanished. I stopped the truck and looked everywhere around me and it was absolutely gone."],"Summary":"An object followed me down the road and was hovering about 100 ft over me.","files":["/var/www/straped/mufon/html2text/14055.html.txt","/var/www/straped/mufon/org/14055.html"],"Source":"MUFON"}