{"Disposition":"Unknown","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.227246,+-98.198363(14057)&iwloc=A&hl=en\"> mufon case (14057) map </A>","trends":["There have been 74 other sightings in Stephenville","There were 7 other sightings in Stephenville on or around November 20th 2008"],"Viewing Distance":"Over One Mile","Object Features":"Unknown","Tags":"City","divs":["sighting detailsi was driving home on thursday, november 20, 2008. i was on lingleville hwy. (hwy. 8) headed west just pass hwy. 108. i noticed a red\\orange cirlce just above the western horizon. all of a sudden another red\\orange circle appear just beside the first one i saw. then the first cirlce on the left disappeared. on the right of the second circle another circle appeared. it was the same size, color and spacing as between the first two. this went on for a several minutes and i would guess approximately seven or eight circles appeared, but only two would be visible at one time. as i went around a small curve i notice another set of circles up and to the left of the first set of circles doing the same thing. at first i thought they were jets alternating their afterburners or someting, but i realised it was too large of a circle to be glow of the afterburners of jets. a few weeks ago i saw a jet above stephenville hit the afterburners and it had a tail similar to a comet. these circles did not look anything like that. i found a place to pull to the side of the road and when i looked back at the night sky there were gone."],"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-98.198363","Object Shape":"Circle","Date of the Event":"11/20/2008 07:00 UTC","City":"Stephenville","Sighting Duration":"00:03:00","Summary":"Red/orange circle that one would appear and one would disappear but two could always be seen","Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/14057.html.txt","/var/www/straped/mufon/org/14057.html"],"Latitude":"32.227246","Log Number":"US-11262008-0010","Country":"United States","Case Number":"14057","Date Submitted":"11/20/2008 07:00 UTC"}