{"Object Shape":"Circle","Object Flight Path":"Stationary","trends":["There have been 8 other sightings in Downingtown","There were no other sightings in Downingtown on or around November 25th 2008","This sighting has been favorited 1 time.",""],"Disposition":"IFO","Date Submitted":"11/25/2008 06:00 UTC","files":["/var/www/straped/mufon/html2text/14056.html.txt","/var/www/straped/mufon/more/14056_submitter_file1__112508ufo.jpg","/var/www/straped/mufon/org/14056.html"],"Date of the Event":"11/25/2008 06:00 UTC","Log Number":"US-11262008-0009","Object Features":"None","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.011606,+-75.698464(14056)&iwloc=A&hl=en\"> mufon case (14056) map </A>","Longitude":"-75.698464","Source":"MUFON","Weather Factors":"Unknown","Summary":"Two bright lights southwest from Exton, PA. Smaller light above, larger light below to right. smaller light blink above small light to right. 45 min. view, only light in sky.","Latitude":"40.011606","Country":"United States","Case Number":"14056","Tags":"City","divs":["Sighting DetailsI noticed two very bright lights, really the only lights I saw in the sky. as I left work at approx 5:30 p.m. in Frazer, PA. One light was at say 12 o'clock to my left South West ( looking at Digital Compass in car ) & a larger light & brighter then the top light. Larger by about 20% & also in brightness.The larger light was around 4 o'clock compared to the top smaller light. I saw a few planes go by but they were much dimmer & smaller, also in seconds I could see the planes move in the sky, but the two light stayed stationary all the time I was viewing them & the brightness satayed the same. In the first 10 min. I noticed above the top light to it's right was a much smaller light maybe only 10% the size of the 1st small light. This light blinked on & off around 3 or 4 times, then vanished. I kept my eyes on the light best I could ( kicking myself for not having my camera \" Always Have Your Camera With You \" ) Around 6 p.m. I cam to a red light & could keep the lights in sight between a telephone poll & a wire that ran on a angle from the right poll out away to the ground. I saw a plane again lower in the sky, dimmer & smaller, fly from left to right. In the 3 to 5 min. I was at the red light the plane moved from the left between the distance between the polls & out to the right of the poles. The brighter lights Never Moved. I felt the lights ( UFO ) was maybe out around the Chadds Ford, Kennetsquare area. I turned off of Rt. 113 on to Rt. 30 heading west to Coatesville. The two lights in about 1 min. became very dim & smaller, with in 3 min. they were gone. As I got to the Braindywine Hospital, I noticed a lot of cloud cover in the area. I stopped at my fathers & looked up in to the sky I then could see some stars much dimmer then the lights I saw. I thought I couldn't see the bright lights becouse of the clouds but I could see much dimmer & mean Much dimmer stars & all the time I was observing the two bright lights & planes & Never Saw Any Stars. I wonder what they were & if anyone else saw them, they were the only thing in the sky for a good 45 min."],"City":"Downingtown"}