{"Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.064483,+-83.849073(1405)&iwloc=A&hl=en\"> mufon case (1405) map </A>","Case Number":"1405","Disposition":"Unresolved","Object Features":"Undisclosed","divs":["Sighting DetailsWitness 1- My wife and I were returning late from a bowling league. As we droveSouth-east on River Road., three miles out of Flushing, ____ called my attentionto some lights to our left front. What appeared to be large headlights could beseen pointing down at about a 45 degree angle. The craft, which I could not seeagainst a dark sky, appeared to be heading southish at about a 100 ft. height. I was not aware of any other lights. I slowed down to about 15-20 mph so thatif it maintained its present course and slow movement, it would cross the roadahead of us. Suddenly, without any change in attitude the craft was travelingparallel with us, just above the tree level and to the rear of a row of houseson the North side of the road. It appeared to be settling lower as weapproached our driveway. (South side of road). Instead of turning in I speededup to go around a slight curve and we pulled left into a large parking lot of achurch some 150 yards past our drive. We sat and waited for it to reappear. Itnever did so it had to have landed or crossed the river (Flint). At no timecould I discern a shape or hear any sound relative to its propulsion. Ourheadlights were on so it had to be aware of our movement. The next day we madea search of cornfield and woods which it seemed to head into. We found nothingsignificant. The whole sighting took some 5-6 minutes.Witness 2s account is basically in agreement but goes into more detailconcerning the object description such as, the headlights appeared to belocated in the center of the crafts height and width, appearing to be 3-4 ft.apart. They either spread across its width, or reflected. The lights were verybright but they did not hurt our eyes to look at them. The craft was shiny andvery large.....I got the impression that it was oval shaped and was as long as abig boxcar. I could not make out the outer edges. From the headlights to thetop of the object it appeared to be very tall. I would guess about 15 ft. Welost sight of it behind our neighbors house. We did not hear any sound. Wecould not recall the engine changing sound, stopping, or stalling."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/1405.html.txt","/var/www/straped/mufon/org/1405.html"],"Region":"Michigan","Date Submitted":"09/23/1983 01:10 UTC","Summary":"Oval Lights Seen in Flushing, Michigan","trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around September 23rd 1983"],"Object Shape":"Oval","Log Number":"","Sighting Duration":"00:10:00","Date of the Event":"09/23/1983 01:10 UTC","Weather Factors":"Unknown","Longitude":"-83.849073","Country":"United States","Tags":"City","Viewing Distance":"21-100 Feet","Latitude":"43.064483","City":"Flushing"}