{"Date Submitted":"07/31/2008 12:00 UTC","Weather Factors":"Unknown","Date of the Event":"07/31/2008 12:00 UTC","Summary":"A recurring large multi-colored light spotted several times by myself and a few others. Rises extremely slow and then will jet away.","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around July 31st 2008"],"Country":"United States","City":"Athens","files":["/var/www/straped/mufon/html2text/14065.html.txt","/var/www/straped/mufon/org/14065.html"],"Longitude":"-82.091755","Disposition":"IFO","Tags":"City","Log Number":"US-11262008-0018","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path","Object Shape":"Circle, Unknown","Latitude":"39.33492","Region":"Ohio","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.33492,+-82.091755(14065)&iwloc=A&hl=en\"> mufon case (14065) map </A>","Case Number":"14065","Object Features":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsi have seen this object several times through out the past few months here in athens, oh. i first noticed it when i was sitting on my porch smoking a cigarette late one night during the summer. at first i thought it was just an extremely bright star until i noticed it was moving and the unusual coloring. it is a large lits, it blinks multiple colors (blue, orange, red and purple) and usually slowly ascends straight up until it disappears. sometimes it would simply accelerate at great speeds. the first few times i saw the light it was directly over bong hill. which is maybe half a mile away from my house across highway 33\\50. i often saw it over the hills across the hocking river as i walked to work on the bike path that runs parrallel with the hocking river. i can not make out any discernable craft due to the brightness of the light it projects. i worked 3rd shift so it was usually dark out. heck, i cant even be sure the light is actually attached to a craft of any sort or if the light is the craft itself. this area seems to be getting an influx of unusual aerial activity. two friends of mine saw an unusally bright light descend at great speeds as they drove to mcconnelsville, oh. i have heard others tell similar stories as well. i think we may have an upcoming ufo flap considering the rise in sightings nationwide."]}