{"divs":["Sighting DetailsWitness 1 - Awakened by wife, \"_____, I see it coming, I see it coming, wakeup.\" I looked to the back of our lot (roughly southwest). At first I could seenothing. Then I could see light through some branches high up on a line oftrees. It appeared to be moving to my right and up some. It could have beenrising but Im more inclined to think it was heading towards me, but slightly tomy right on a level flight. Next it appeared between two tall tree tops. ( Imeasured it to be about 630 ft. from where I was.) Then, seeing only thelighted panels, it headed to my left, ESE, slowly. I did not see it move fastat any time. It went out of sight behind the garage. We ran out back but sawnothing else.Witness 2 - ____ and I retired for the day shortly before midnight on Aug. 9 Weread books after we got into bed. ____ read approx. 20-25 minutes before hedecided to go to sleep. I read for another 30-35 minutes. It was probably 1:00am or when I got out of bed to use the bathroom. I went directly back to bed. After lighting a cigarette I turned off the light and sat at the end of the bedsmoking while looking out the window. My thoughts were of the deer who roam thewoods behind our house and open field. Suddenly I became aware of a reflectionof light on the tree line just southwest of the motorhome approx. 600 ft. Thereflection was from some lights that seemed to be rising slowly from the groundon the west side of the tree line. When they rose high enough that I could seethem I reached over and shook my husband, \"_____ wake up, I can see them, I cansee them coming.\" He sat up in bed and moved closer to the window. By thistime the object was on the East side of the tree line and it appeared to floatdownward a little at a time while moving in an easterly direction, but at thesame time it did not appear parallel because I could see all of the lights andonly part of the dome. There seemed to be three lights. The two that were evenappeared round. They were or seemed to be closer together than headlights on acar. The third light was either vertical or was reflected to look so. Behindthe lights I could see a red dome shaped object. I (text or page of narrativeappears to be missing here- Todd Lemire)... up the tall grass and the objectappeared to be no more than 10 or 12 ft. above the grass."],"Disposition":"Unresolved","Summary":"Nocturnal Lights seen in Flushing, Michigan","Sighting Duration":"00:05:00","Longitude":"-83.842583","Source":"MUFON","Object Flight Path":"Stationary","City":"Flushing","trends":["There have been 17 other sightings in Flushing","There were no other sightings in Flushing on or around August 10th 1983"],"Tags":"City","Date Submitted":"08/10/1983 01:10 UTC","Viewing Distance":"101-500 Feet","Date of the Event":"08/10/1983 01:10 UTC","files":["/var/www/straped/mufon/html2text/1406.html.txt","/var/www/straped/mufon/org/1406.html"],"Object Features":"Dome","Latitude":"43.065443","Region":"Michigan","Case Number":"1406","Country":"United States","Object Shape":"Square, Rectagular","Log Number":"","map":"<A HREF = \"http://maps.google.com/maps?q=43.065443,+-83.842583(1406)&iwloc=A&hl=en\"> mufon case (1406) map </A>","Weather Factors":"Unknown"}