{"Weather Factors":"Unknown","Region":"Massachusetts","Object Shape":"Sphere","Sighting Duration":"00:05:00","trends":["There have been 2 other sightings in Oxford","There were no other sightings in Oxford on or around August 26th 1995"],"Country":"United States","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-11262008-0015","Viewing Distance":"Unknown","Latitude":"42.124552","Source":"MUFON","Date Submitted":"08/26/1995 03:00 UTC","Disposition":"Unknown","Case Number":"14062","files":["/var/www/straped/mufon/html2text/14062.html.txt","/var/www/straped/mufon/org/14062.html"],"City":"Oxford","map":"<A HREF = \"http://maps.google.com/maps?q=42.124552,+-71.858644(14062)&iwloc=A&hl=en\"> mufon case (14062) map </A>","Summary":"Pulsating balls of light over water, search lights from sky , completley silent.","Date of the Event":"08/26/1995 03:00 UTC","Tags":"City","divs":["Sighting DetailsIt was about 3am and an ex-girlfriend and I were awake in a bedroom facing south, towards a Pond, which is located behind the house (my parents' House) located in Oxford, MA. We noticed some flashing in the window shades (shades were pulled down half way in the 2 windows). We thought it was heat lightning, so we got up to look. I saw 3 or 4 balls of light hovering about 5 to 10 feet above the water down near a dock. All the balls were rotating around an imaginary central point, moving clockwise (if looking down from the top). All balls were white and were pulsating in sync from dim white to broght white. Then all the balls changed color simultaneiously to either red and then blue (or vice versa, I just cannot remember). While they changed colors simultaneously, they continued to pulsate. Then all the balls moves in tendem away from the house moving in an Easterly direction going behind trees and out of sight. The balls rotated around the central point very slowly and the unit (all balls of light) moved away from the scene very slowly as well. Next, from some point behind some trees (but over the water)it looked like some sort of light \"scanned\" the trees as well as a trailer in which my grandmother was sleeping. The reason I say \"scanned\" is because the pattern the light moved. It started at the tree tops, and then moved in one direction (from right to left) and searched a lower level in the opposite derection. It kept doing this slowly until the entire small area had been completely searched. Finally, the light from above the water (behind the trees)went out and almost immediately, a light from what must have been above the house had \"scanned\" the back yard in the same pattern as the woods...Back and forth, until an entire area had been searched. Then, the light went out. And it was over. The light that scanned the area was an extremely bright, white light which I would describe as a bright powder white, with very well defined sides to the light beam, sort of like how a laser bean is a well defined beam. There was complete silence during this whole event which was extremely odd. No bull frogs, no tree frogs, noo breeze, nothing. I was comletely frozen in shock because I was so scared during this."],"Longitude":"-71.858644"}