{"Latitude":"40.724163","files":["/var/www/straped/mufon/html2text/14063.html.txt","/var/www/straped/mufon/org/14063.html"],"Case Number":"14063","map":"<A HREF = \"http://maps.google.com/maps?q=40.724163,+-73.999023(14063)&iwloc=A&hl=en\"> mufon case (14063) map </A>","Date of the Event":"07/31/1988 12:00 UTC","Longitude":"-73.999023","Viewing Distance":"Unknown","Object Shape":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"When the day stood still.","divs":["Sighting DetailsOne Sunday morning, a friend and I set out to the woods just off the Castle Hill overhead train station in the Bronx. We were bored, so we decided to go there and hunt small game with pellet pistols. It was a bright sunny day. We ventured pretty deep into the woods, but could still hear sounds from the nearby train station and other ambient sounds from cars, dogs, etc. At one point, we stopped to notice how nice the day was and we sort of stood in one spot as we looked around for small game and talked. For some time, there had been dog nearby that was barking. In time this dog's bark became intense and sounded urgent. That's when I suggested that there must be something making the dog bark that way. At that point, the dog's bark intensified. Just as we thought that maybe we should be keep our eyes open for what may be making the dog bark that way, everything froze in place. Before this happened, leaves were rustling in the wind, birds were singing, and there was ambient noise coming from the distant streets. But, suddenly everything stopped. I noticed that the leave were not even moving anymore, and all sound stopped. It was almost as if someone had placed a giant cup over our area and blocked out all sound. Just as I mentioned to my friend that everything seems to have stopped, it is no longer day time, we are in another location within the park and something in coming towards us from behind several tall shrubs. I was very curious to see what might come out of the bushes, but my friend was yelling at me to get out of there. He had already run to a pathway lit by orange glowing night park lights. Whatever was coming through the buses was taking short steps because the steps were shuffling quickly. Just before whatever it was emerged from the bushes I fired several shots from my pellet gun in its direction as I ran towards the lit path. As me and my friend stood in the pathway, whatever it was that was did not come out into the light. We taunted whatever it was to come out, but it did not. We decided that we should leave the area so we started following the path to a gate we saw in the distance. When we got to the gate, I noticed that a huge boulder was blocking the exit to the park. We did not even find it strange that in an instant it got dark, and that we were in a different area of the park. We kept walking as if everything was normal. Just as I remarked about the size of the boulder, the next thing we knew, it was daylight again and we were now walking on the sidewalk of the street side with the park on the other side of a stone wall. However, again, we acted as if nothing was wrong, as if nothing had happened. We simply walked back home without discussing the matter, without discussing anything for that matter. When we arrive back to my house, my girlfriend said that if we were going to stay out all night, I should have at least called. We did not discuss the matter, although we understood then that something strange had happened. That is when we remembered everything stated above. Unfortunately, we remembered nothing else."],"Object Flight Path":"Undisclosed","City":"New York","Date Submitted":"07/31/1988 12:00 UTC","Disposition":"Unresolved","Source":"MUFON","Region":"New York","Weather Factors":"Does Not Apply","Tags":"City","Log Number":"US-11262008-0016","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 31st 1988"]}