{"map":"<A HREF = \"http://maps.google.com/maps?q=42.418035,+-88.067501(14067)&iwloc=A&hl=en\"> mufon case (14067) map </A>","Weather Factors":"None, Does Not Apply","trends":["There have been 2 other sightings in Lake Villa","There were no other sightings in Lake Villa on or around August 1st 2003"],"files":["/var/www/straped/mufon/html2text/14067.html.txt","/var/www/straped/mufon/org/14067.html"],"Longitude":"-88.067501","City":"Lake Villa","Tags":"City","Object Features":"None","Country":"United States","Case Number":"14067","Region":"Illinois","Object Shape":"Sphere, Triangle","divs":["sighting detailsi was driving home through a neighborhood on hot and sunny summer afternoon going about 20-25 mph. out of the corner of my eye i saw something gliding in the air at the edge of the neighborhood near a pond\\swamp and field. i immediately thought(and still wonder if)it was a kite, but recognized as i focused that it was a few individual non-shining,metallic spheres that were about the size of a pilates\\exercise ball each. they were in a flat triangle formation, which did not change\\falter the entire time i saw it. the object\\s was in constant motion. it was about 15 ft. high when i first noticed it and glided up near the side of a house and over the roof when i lost visual for a sec. because it was behind the house. it then emerged from behind the house at about 25-30 ft.(high enough to go over a 2 story roof). it continued to glide towards the field which went up a shallow slope going northwest. i watched it till it was out of view from going up and over this hill. it glided very slowly(10-15 mph) and gracefully(like a bird enjoying the wind) the whole time. the speed was consistent\\ no deviations. there was no sound. a side note: my mom was boating on my lake which is southeast from this sighting and said she saw \"something\" slowly gliding towards where i was(northwest) at the time of this sighting. she didn't elaborate too much. all she said was that it was metal, strange, and queit. this happened around 4:30 p.m. in august. if it was a kite that i saw, the person holding the strings would of had to run through and over the field where this object glided over and out of sight. a wild field full of cattails and other thick vegetation."],"Viewing Distance":"101-500 Feet","Source":"MUFON","Date Submitted":"08/01/2003 04:30 UTC","Sighting Duration":"00:00:15","Disposition":"Insufficient Data","Log Number":"US-11262008-0020","Date of the Event":"08/01/2003 04:30 UTC","Latitude":"42.418035","Object Flight Path":"Path with directional change","Summary":"No-shine metal spheres in a triangle formation gliding."}