{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"14078","divs":["Sighting DetailsI work for a pizza place in St Charles MO. On a delivery I saw two objects in the horizon. When I pulled onto the street near the home, the lights circled around each other and then went drifted away from each other. I was in panic, I stopped at an overpass and noticed there were 4 objects just floating in the sky. I went back to work and told my manager. we both went outside and saw several objects just floating in the sky. Then, we saw MANY unknown aircraft flying around. Most of the were very quiet. They had the shape of F-4's. One of them looked like a 737 but had engines like a F-15. They flew over us at about 1000 feet or less. They flew around the lights for 20 minutes. The lights just vanished and then the planes just flew away. The planes went east very fast,east of St Charles is Scott AFB. My manager Brian was a witness and can prove all statements are true. We both think it was UFO's. The planes we saw were not normal aircraft. This can be confirmed by both of us. The lights flashed white, yellow and red. They Floated side to side. They were seen to the east of St Charles MO near the airport. Total numbers of light seen was 4. When it all stared they moved in ways no human aircraft can move. I knew at first sight that it was a normal aircraft. I felt very scared and excited. The whole situation made me really nervous. I knew something was not right. I knew the aircraft I saw were not right. I studied aviation and all this did not make any sense."],"Object Shape":"Sphere, Star-like","Date of the Event":"11/26/2008 07:50 UTC","City":"Undisclosed","Object Features":"Other, Unknown","files":["/var/www/straped/mufon/html2text/14078.html.txt","/var/www/straped/mufon/org/14078.html"],"Summary":"UFOs and military aircraft.","map":"<A HREF = \"http://maps.google.com/maps?q=37.972743,+-91.828953(14078)&iwloc=A&hl=en\"> mufon case (14078) map </A>","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Date Submitted":"11/26/2008 07:50 UTC","trends":[],"Disposition":"Unknown","Log Number":"US-11272008-0004","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Region":"Missouri","Longitude":"-91.828953","Latitude":"37.972743"}