{"Log Number":"US-11272008-0002","City":"Toledo","Sighting Duration":"Undisclosed","Date of the Event":"04/30/2007 12:00 UTC","Tags":"City","Weather Factors":"None","Date Submitted":"04/30/2007 12:00 UTC","Source":"MUFON","Viewing Distance":"Unknown","Region":"Ohio","divs":["Sighting DetailsI first saw this object when I was walking from my house to my garage. I live in Toledo Ohio. I call it a blinker because that is what it does... it blinks in and out and seems to be moving, but also seems very far away... I have gotten some very interesting pictures at different times of the night and year of it... It may just be a satelite or something, but it is much brighter and much larger than any star I have ever seen. To the naked eye, it flashes different colors, but when you take a picture, you can see that it is moving erratically. In fact I got out my telescope and couldn't seem to even keep it in the frame. If anyone has a theory on what this might be, please let me know. Whatever it is, it seems to be covering a lot of ground, very quickly and very far away. I see it a lot, not always in the same spot. Usually I catch it when I am outside getting some fresh air. I stood on my picnic table to get several of the shots, and also tried to get the fence line and the neighbors house to give perspective, eventhough it is dark out. I always have my eye to the skyline so it really stuck out to me. I thought if it was a UFO, it is very far away. It never seems to come toward me, just moves very erratically. The pictures attached are from a canon powershot digital camera fully zoomed in. I don't know what setting it was on, I just grabbed the camera and started shooting! I have several more pictures of this sighting as well as another from another night. I never lost sight of the object, just had to go back inside."],"Latitude":"41.673378","Longitude":"-83.554212","Summary":"Orbital moving blinker... almost looked like a crazy atom or something.","Disposition":"IFO","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around April 30th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change","Case Number":"14076","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.673378,+-83.554212(14076)&iwloc=A&hl=en\"> mufon case (14076) map </A>","files":["/var/www/straped/mufon/html2text/14076.html.txt","/var/www/straped/mufon/more/14076_submitter_file1__PoolDaysX-mas017.jpg","/var/www/straped/mufon/more/14076_submitter_file2__PoolDaysX-mas018.jpg","/var/www/straped/mufon/more/14076_submitter_file3__PoolDaysX-mas023.jpg","/var/www/straped/mufon/org/14076.html"],"Object Shape":"Flash, Star-like, Other","Object Features":"Unknown"}