{"Tags":"City","Case Number":"14079","Date of the Event":"07/10/1992 09:00 UTC","divs":["Sighting DetailsWHILE WORKING AS A PATROL SERGEANT WITH A MUNICIPAL POLICE POLICE DEPARTMENT IN LUZERNE COUNTY PA, I WAS PATROLING A RURAL CEMETERY CHECKING FOR UNDERAGE DRINKING. WHILE OUT OF MY CAR, I HEARD A LOUD NOISE AND OBSERVED A LARGE BRIGHT ROUND OBJECT LITERALLY TAKE OFF FROM A MOUNTAIN SIDE BEHIND THE CEMETERY. ABOUT 10 MINUTES LATER I RECEIVED A CALL FROM OUR COUNTY DISPATCHER THAT A MULTIPLE VEHICLE ACCIDENT OCCURED ON RT. 309, NORTH BOUND LANE. I PROCEEDED TO THE ACCIDENT SCENE AND ARRIVED IN ABOUT 5 MINUTES. I LEFT MY VEHICLE AND WHILE WALKING TOWARDS THE FIRST CRASHED CAR I WAS APPROACHED BY THE OPERATOR OF THE SAME. HE SAID, \"DONT WORRY ABOUT ME, YOU BETTER CHECK THE BIG TRUCK THAT WAS COMING DOWN THE WRONG SIDE OF THE ROAD AND WENT INTO THE CREEK BELOW.\" I IMMEDIATELY NOTICED SMALL TREES AND BRUSH PUSHED ALMOST FLAT SHOWING THE APPEARANCE THAT SOMETHING WENT DOWN TO THE CREEK. I IMMEDIATELY WALKED TO THE CREEK BELOW. NOTHING WAS FOUND. AFTER STUDYING THE CHAIN OF EVENTS IT APPEARS THAT THE BRIGHT LIGHTED OBJECT I WITNESSED LEAVING THE CEMETERY DID INDEED FLY FROM THE CEMETERY DOWN THE CUT IN THE MOUNTAIN, DOWN THE WRONG SIDE OF THE HIGHWAY RT 309 AND CAUSE THE CRASH. I NOW RESIDE IN FLORIDA AND DID NOT REPORT THE CEMETERY INCIDENT SINCE I WAS CONCERNED ABOUT MY CAREER. I HIT 60 LAST WEEK AND WILL TAKE ABOUT IT, BUT STILL DO NOT WISH TO GO PUBLIC WITH MY STORY SINCE I CONTINUE TO WORK IN LAW ENFORCEMENT AS A FORENSIC DRUG LAB SUPERVISOR. I TESTIFY IN COURT AND HAVE A CONCERN ABOUT REDICULE AND MY CREDIBILITY."],"Object Shape":"Oval","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around July 10th 1992"],"Disposition":"Unknown","Date Submitted":"07/10/1992 09:00 UTC","Summary":"OBSERVED BRIGHT LITED OBJECTED FLY OFF AND CAUSE ATRAFFIC CRASH","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/14079.html.txt","/var/www/straped/mufon/org/14079.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Longitude":"-75.876978","Latitude":"41.252075","map":"<A HREF = \"http://maps.google.com/maps?q=41.252075,+-75.876978(14079)&iwloc=A&hl=en\"> mufon case (14079) map </A>","City":"Wilkes-Barre","Log Number":"US-11272008-0005","Country":"United States","Viewing Distance":"501 Feet - 1 Mile"}