{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.884064,+-87.627178(14072)&iwloc=A&hl=en\"> mufon case (14072) map </A>","Source":"MUFON","Date Submitted":"11/25/2008 07:30 UTC","Case Number":"14072","Region":"Illinois","Object Flight Path":"Straight-line path","Longitude":"-87.627178","files":["/var/www/straped/mufon/html2text/14072.html.txt","/var/www/straped/mufon/org/14072.html"],"Object Shape":"Triangle","Date of the Event":"11/25/2008 07:30 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unknown","Summary":"Semi-clear evening. Looked at ski. Saw only outline of craft, black. Bottom lights. Non-reflective and non-blinking, Round and dark red. Opaque. App. size: 2 football fields. App. altitude: 6,000 feet","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around November 25th 2008"],"Object Features":"Unknown","City":"Chicago","Log Number":"US-11262008-0025","Latitude":"41.884064","divs":["sighting detailsi went to my maibox and heard a jet over my house coming maybe from o'hare. i love to fly and looked up to enjoy its lights. i estimate the plane's altitude at 10,000 feet going east\\north east. as i was observing the jet, a huge triangle shaped object flew over my head toward a more eastern direction. in comparing the altitude of the plane to the triangle, i estimate the triangle flying at about 4,000 feet lower than the jet at about 45 degrees angle, over my house and coming from behind me. the triangle went over and passed over very fast however, i was able to see a black contour and round, opaque dark red lights imbedded in its bottom. there was no noise, and it flew into a few flimsy clouds. when that happened, the red lights became dull, the craft tilted left and it disappeared on a easterly direction. i was breathless. in my life i have seen other ufo's as i worked, before teaching at the local college with virgil staff in california and did the nightly news for a bilingual station in san francisco. i never saw anything so big nor in a triangular shape, flying so low and being so big. i don't know if this can help you find out if last night (november 25), other people saw it also. i want to add that the craft had about 4 red lights on each side, 1 on the apex and about 3 on the base of the triangle. please feel free to contact me at my home phone any evening. during the day i usually have classes (i teach french and spanish) back to back. it was a very exciting experience, no fear only awe and curiosity of course. thank you for reading this report. p.s. i estimate the whole experience lasted no longer than 8 seconds."]}