{"map":"<A HREF = \"http://maps.google.com/maps?q=37.322998,+-122.032182(14077)&iwloc=A&hl=en\"> mufon case (14077) map </A>","Object Flight Path":"Hovering then path,Straight-line path","Longitude":"-122.032182","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"08/31/1999 12:00 UTC","Object Features":"Patterned Surface, Other","Tags":"City","Disposition":"Hoax","Log Number":"US-11272008-0003","Case Number":"14077","City":"Cupertino","Source":"MUFON","Date Submitted":"08/31/1999 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Latitude":"37.322998","files":["/var/www/straped/mufon/html2text/14077.html.txt","/var/www/straped/mufon/org/14077.html"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving home down Stevens Creek blvd. As I reached the bottom of a hill, straight ahead of me was a black military helicopter. I could see there was something \"floating\" in front of it. As I got closer I could tell it was a black sphere approximately 5 feet in diameter. The helicopter and the sphere were \"face to face\". Just as I realized what I was seeing the black sphere took off in a Northerly direction towards Moffett Field Naval Airbase. The helicopter took off in pursuit and by the time I got around the corner both were gone and completely out of site. At first I thought the object was a bird. But as I got closer I could see an almost raised metal band around it. The object seemed to hover in a waving sort of motion. There were no lights on it that I could see. It was in the middle of the day. For those that might say it was the setting sun, since when is the sun black, 5 feet in diameter and takes off in a Northerly direction with a black military helicopter chasing it? This was no balloon, flare or any other object that the skeptics tend to attach to most ufos. I am very familiar with all kinds of Military and civilian aircract. I grew up around planes my whole life. I'm what you'd call an aircraft enthusiast. This was in no way a conventional aircraft. There was no visible propulsion and no wings whatsoever. It didn't strike me as an \"occupied\" vehicle. It seemed like it was being controlled remotely and intelligently."],"Object Shape":"Sphere","trends":["There have been 4 other sightings in Cupertino","There were no other sightings in Cupertino on or around August 31st 1999"],"Region":"California","Summary":"Black military helicopter chasing black spherical ball."}