{"Weather Factors":"Unknown","divs":["Sighting DetailsI was staying at my parents house the day before thanksgiving, i just got into bed when i started to hear a buzzing sound kinda in my head. I started to meditate on this sound and it became more intense, and the dogs outside started to bark. Out of no where i heard a voice tell me to get dressed and go outside, i continued to lay there and the voice said again GO OUTSIDE!I get up with this weird urgency and run outside, I'm looking everywhere and i see nothing. I cant explain the feeling that was going through my body, it was the most intense feeling of fight or flight. After about 3 minutes of looking around i figured i was crazy and began to walk inside because it was so damn cold out. As i was walking into my door, something was drawing my head to a section of the sky. As i looked there was a flashing light, it was going from green to red to white and changing between these colors behind a tree. The tree was about 50 yrds away across the street, but you could tell the object was super far in the distance, and super high. At first i thought it was a plane, but i watched over 20 minutes about 5-6 planes fly across the full span of the sky. This object stayed in the same spot, and it wasn't a constant light or star there was a flicker to it, i couldn't even believe it and i was telling my self it was just a star. I placed the object behind a branch of a tree to hide it from my vision when i was surprised to see that it was clearly blinking, you could tell because the branch was hiding the bright main mass but the surrounding light leaking out behind the branch was cleanly blinking between green, red and white. My knee's were trembling throughout this whole experience, and the weirdest thing happened. I started to get really emotional, my knee's were trembling and i found my self crying and tearing for no apparent reason, and it wasn't a scared cry i cant explain it, it was a good thing. I'm not jumping to conclusions saying i know for sure i saw a ufo or what ever, but all i know is, i know my body. The way my body acted towards what ever this event was amazed me and made me feel like there was something to this."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.411291,+-71.372957(14088)&iwloc=A&hl=en\"> mufon case (14088) map </A>","City":"Undisclosed","Region":"Massachusetts","Summary":"Was told to go outside, saw green, red and white lights, felt emotional.","Case Number":"14088","Log Number":"US-11272008-0014","Longitude":"-71.372957","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/14088.html.txt","/var/www/straped/mufon/org/14088.html"],"Source":"MUFON","Latitude":"42.411291","Sighting Duration":"00:20:00","trends":[],"Object Shape":"Star-like, Unknown","Object Features":"Undisclosed","Date Submitted":"11/26/2008 10:00 UTC","Date of the Event":"11/26/2008 10:00 UTC","Country":"United States"}