{"divs":["Sighting Detailsnot even sure if it should be considered a typical UFO event or a paranormal event ...I've not read about anything like it!! It took me quite sometime before I would talk about it and only would then because there was a credible witness. Am not certain of the exact date or time..it was a year or two after I retired, Probably 1983 0r 1984. It occured during the day while wife was at work and and I was home alone. I was reading in my basement with my left side facing to a row of windows. Location was above a steep wooded cliff that descended to the Coal River. I was suddenly bothered by a crunching feeling in the back of my neck...on looking up there was a globe about the size of a tennis ball...maybe a little larger. floating very slowly past me and toward the closed windows. The globe consisted of a cluster of smaller translucent globes that were about the size of salmon eggs. The smaller globes were undulating around each other as the larger (UFO ..unidentified floating object) slowly drifted towards the windows..I reached out to grab it but was stopped by a powerful feeling of dread...almost like a command NOT to touch the object!! before reaching the window the object faded from my sight...but apparantly not from my dogs vision ( the witness)...at this point I noticed that he was intenly and curiously watching something I could not see...as he watched his neck was suddenly twisted like a corkscrew and he collapsed. I thought he was dead...but in a few seconds he revived and seemed to be all right...the event was over. If my dog had not been so affected I would never have mentioned the incident because of fear of ridicule..in fact at first I thought I might have been halucinating..the entire event lasted less than a minute and left me shaken."],"Region":"West Virginia","Object Flight Path":"Path with directional change","City":"St Albans","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"09/15/1984 12:00 UTC","Disposition":"Unknown","Log Number":"US-11272008-0007","files":["/var/www/straped/mufon/html2text/14081.html.txt","/var/www/straped/mufon/org/14081.html"],"trends":["There have been 2 other sightings in St Albans","There were no other sightings in St Albans on or around September 15th 1984"],"Longitude":"-81.819166","Summary":"Came within a foot or two of a floating globe.","Case Number":"14081","Latitude":"38.37937","Weather Factors":"Light","Object Features":"None, Unknown","Object Shape":"Sphere","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=38.37937,+-81.819166(14081)&iwloc=A&hl=en\"> mufon case (14081) map </A>","Date of the Event":"09/15/1984 12:00 UTC","Source":"MUFON","Country":"United States"}