{"Sighting Duration":"02:30:00","Source":"MUFON","Date Submitted":"11/26/2001 08:30 UTC","Log Number":"US-11272008-0011","Country":"United States","Latitude":"41.764928","Date of the Event":"11/26/2001 08:30 UTC","Longitude":"-124.200527","City":"Crescent City","Object Shape":"Disc, Fireball","Case Number":"14085","files":["/var/www/straped/mufon/html2text/14085.html.txt","/var/www/straped/mufon/org/14085.html"],"Object Flight Path":"Straight-line path","trends":["There have been 11 other sightings in Crescent City","There was one other sighting in Crescent City on or around November 26th 2001"],"Region":"California","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.764928,+-124.200527(14085)&iwloc=A&hl=en\"> mufon case (14085) map </A>","Object Features":"Undisclosed","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsI am just now reporting these sightings because I just learnd there is a place to do so.The number of sightings took place over a period of about two months.The majority of the sightings were the same with a few that were extrordinary.They would always start out as the first star in the sky,but they were'nt.once the transition from twilight to darkness happened everything changed.Looking through the scope of my hunting rifle{the only optical inhancement I had}it changed completely.I could see that there was a red center light with blue,green,and yellow lights rotating around the center.It would then drop in a 90degree angle over a 1-2 hour period.What threw me off was that it moved faster than stars but slower than aircraft.These were the average that me and a friend saw every night for weeks,Then things changed.One night I saw one that was moving very fast.It changed from lights to a decending fireball{like a meteor} then back to lights.From my house you could see the orange glow of lights from pelican bay prison through the redwood trees.One night my friend and I saw one stationary very high.It then shot a huge green laser beem directly into the prison.Those two sightings were the most amazing things I have ever seen.I was not a believer before then but you can bet I am now.over a two month period my friend and I must have seen at the very least two dozen U.F.O.s. wich leads me to believe this is a hot spot. This changed my life forever I now don't think that all u.f.o. sighters are just crazy or looking for attention.Thank you for your time and work in the persuit of the truth."],"Summary":"Dozens of sightings.","Viewing Distance":"Over One Mile"}