{"Latitude":"42.98111","Region":"Michigan","City":"Goodells","Summary":"Triangle of Lights seen crossing St. Clair River","Date Submitted":"09/14/1981 10:10 UTC","Date of the Event":"09/14/1981 10:10 UTC","Log Number":"","Sighting Duration":"00:05:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.98111,+-82.66583(1408)&iwloc=A&hl=en\"> mufon case (1408) map </A>","files":["/var/www/straped/mufon/html2text/1408.html.txt","/var/www/straped/mufon/org/1408.html"],"divs":["Sighting DetailsWitness 1 - I was outside running when I saw this triangle of lights coming fromthe river (St. Clair) going west. It went almost right over our house, red,slow, and pretty low. I ran inside to get my mother and sisters and to get mycamera (Minolta 35mm, with 64 ASA film-daytime, thats what was in it.) So weall watched it and listened but couldnt hear any sound. It was pretty huge, alot bigger than a jet. It was going only like jogging speed in a straightline-west. Then it went up into the clouds or something and was gone.Witness 2 - ___ went outside to play with the dogs as he has done in the pastbefore turning in for the night. We live in an area that is remote andeverything seems to be so quiet and peaceful so both of us usually look to thesky at night it just seems to add to the area. Well this was the case on theeve of Sept. 14, 1981. ____ looked to the sky and sighted the object hoveringover the Northeast area. He watched it thinking it to be a plane but noimmediate movement. Then the object started to move slowly to the Southwest. As soon as ___ realized this was very slow moving he ran into the house to getme. I was at the far end of the house getting ready for bed. I couldntimagine anything so important that he would get that excited about. 3 or 4 minsto get out to see what the matter was. I had enough time to watch the objectmove very slowly from east to west and out of sight. The object didnt make anynoise until almost out of sight to the west then it made a \"whoosh\" sound. Wehad airplanes in the area all the time refueling and knew it was not one. Thedogs bark when planes go overhead but they didnt bark on this occasion. Theobject also was flying lower than airplanes fly in that area and again therewasnt any noise."],"trends":["There have been no other sightings in Goodells","This sighting has never been favorited."],"Source":"MUFON","Object Shape":"Sphere","Object Features":"Undisclosed","Case Number":"1408","Country":"United States","Viewing Distance":"Unknown","Longitude":"-82.66583","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Unknown"}