{"files":["/var/www/straped/mufon/html2text/14080.html.txt","/var/www/straped/mufon/more/14080_submitter_file1__IMG_1772.jpg","/var/www/straped/mufon/more/14080_submitter_file2__IMG_1774.jpg","/var/www/straped/mufon/org/14080.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.02715,+-74.887418(14080)&iwloc=A&hl=en\"> mufon case (14080) map </A>","Longitude":"-74.887418","Case Number":"14080","Object Features":"None","Region":"New Jersey","Date of the Event":"12/09/2004 02:20 UTC","trends":["There have been no other sightings in Willingboro Township","This sighting has never been favorited."],"City":"Willingboro Township","Log Number":"US-11272008-0006","Object Shape":"Square, Rectagular","Viewing Distance":"Over One Mile","Country":"United States","Tags":"City","Latitude":"40.02715","Object Flight Path":"Straight-line path","Date Submitted":"12/09/2004 02:20 UTC","Sighting Duration":"00:05:00","Disposition":"Unknown","Source":"MUFON","Summary":"Unknown object in rapid flight over western edge of New Jersey.","divs":["Sighting DetailsI was sitting outside smoking when I noticed what appeared to be a black line in the northeastern sky moving in a staight line. From my vantage point it appeared to be over the Delaware River or the eastern edge of Bucks County, Pennsylvania. It was moving faster than the airliners that fly overhead and appeared to be close to the same altitude. As it got opposite me it turned on edge and I could see that it was rectangle shaped. It appeared to be black in color. I didn't see any lights openings or attachments. It looked like a big black door several hundred feet in length. As I watched it suddenly disappeared as if it was switched off. The sky was overcast but it didn't slip between the clouds. It just disappeared. I went in the house to check on the time and it was 2:27PM. I watched the news on TV and looked for reports of what I had seen in the newspapers for a few days and didn't see anything so I didn't report it to anyone. I've only told close members of my family and they look at me whith some skepticism. As large as the object appeared, somebody else must have seen it. I would like to know if you have any other reports of this incident."],"Weather Factors":"Light"}