{"Viewing Distance":"Over One Mile","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Weather Factors":"Does Not Apply","City":"D'Iberville","Case Number":"14083","Object Shape":"Sphere","Log Number":"US-11272008-0009","divs":["Sighting Details Over the years I have witnessed this type of event at different times of night and early morning. This particular time I recorded pertinent information. Monday night I stepped outside and as in the past expeiences noticed a star increasing in magnitude until it was brighter than any around. It appears to be stationary but over time I've found that is not the case. The object is entering the atmosphere at a calculated angle of attack and the glow is its shielding which is metallic as the glow is a brilliant white yellow. The object then assumes a more level flight path and begins a rapid cooling phase from the yellow color through the reds and visually fading as it travels. There is no noise when this occurs and no other aircraft in the general area below it. The flight paths do change and I have not noticed any timing pattern. It is purely chance to see it. The predominate entry patten is from the south- southeast to the north- northeast. At the time of this siting my position as fixed to within 25' by GPS is as follows: N.30-30.194' W. 88-57.03'. Facing south visual reference was 179 degr. up angle from the horizon was 80 degr. elevation. The estimated speed was 1000 knts on a heading of 180 degr. The number of times I have seen this leads me to believe these events are by craft under some form of intelligent control and are of some program not known to the public. There is no notice of shuttle or capsule re-entrys on the news."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.426309,+-88.890864(14083)&iwloc=A&hl=en\"> mufon case (14083) map </A>","Longitude":"-88.890864","Summary":"Atmospheric entry event.","Tags":"City","files":["/var/www/straped/mufon/html2text/14083.html.txt","/var/www/straped/mufon/org/14083.html"],"trends":["There have been no other sightings in D'Iberville","This sighting has never been favorited."],"Date of the Event":"11/24/2008 06:15 UTC","Region":"Mississippi","Object Features":"Unknown","Date Submitted":"11/24/2008 06:15 UTC","Object Flight Path":"Straight-line path","Latitude":"30.426309"}