{"Disposition":"Unresolved","Object Features":"Unknown","trends":["There have been 3 other sightings in Brookfield","There were no other sightings in Brookfield on or around November 28th 2008"],"Tags":"City","files":["/var/www/straped/mufon/html2text/14098.html.txt","/var/www/straped/mufon/org/14098.html"],"Case Number":"14098","Country":"United States","Date of the Event":"11/28/2008 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsAt 5am I got up to get water and noticed a flashing light in the sky. It was a perfect clear night. I watched this object for 15mins from 5am-5:15am before I decided to call my parents and see if they could see it too. They could. It was flashing randomly sometimes fast, sometimes slow green red and white. I call the local police and an officer came out. We stood outside and watched it for while. He couldn't explanin why it was so close and acting the way it was. He saw the colors and flashing as well. As the sun started to come up it moved furter and furter west faster and faster. Even though by then the other stars in the night sky had dissapeared, this on still remained. It moved further west but now and then was still blinking. It was the coolest thing to see ever! Me and my parents tried to get photos but I couldn't even get it to show up on my difital camera. My mom did get a picture but it is blurry."],"City":"Brookfield","Weather Factors":"Unknown","Date Submitted":"11/28/2008 12:00 UTC","Object Shape":"Flash, Star-like, Triangle, Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.82392,+-87.851725(14098)&iwloc=A&hl=en\"> mufon case (14098) map </A>","Object Flight Path":"Stationary,Hovering then path","Latitude":"41.82392","Region":"Illinois","Sighting Duration":"Undisclosed","Log Number":"US-11282008-0005","Summary":"I saw a bright object hovering and flashing green white and red. My parents saw it and the local police as well. I was close enough to be a plane but it wasn't. It seemed to bob-about but the light show was like nothing i have ever seen!","Longitude":"-87.851725"}