{"Region":"Washington","files":["/var/www/straped/mufon/html2text/14090.html.txt","/var/www/straped/mufon/org/14090.html"],"Object Flight Path":"Path then hovering","Source":"MUFON","divs":["Sighting Details Me and a buddy had been visiting girlfriends in Canada and then stopped to see some other friends near Spokane for a few hours before we headed home to Seattle. It was a clear night, not a car on the road but us. We were heading West up Stevens pass near the summit just after the road splits into 2 lanes at approx. 4am in the morning. My buddy was driving my 1971 VW baja bug, I was riding shotgun. We had just tuned up the car before we left Canada, it was running great. The car was bright orange with a yellow Starsky and Hutch type stripe over the top and down the side. The car started to spit and sputter and cough as we saw some bright lights through the trees, off to our right. Our first impression was it may be a helicopter, until we realized that it would probably be pretty difficult for any aircraft to manuever between the mountains like that day or night, and why is the car starting to run lousy? We realized that the craft was going the same speed as us and it was glowing like neon exactly the same colors as my car, almost as if it was trying to communicate with us. There was a break in the trees and we saw the whole thing.Yep, it was following right next to us. We felt like we had little control of the situation. Whatever this thing was, seemed to be shaped exactly like an old fashioned box kite. It had 2 ends and a frame. It even seemed to have criss cross support bows like a box kite. It was flying very low and appeared to have no windows and made no sounds or exhaust. I am not sure how big this thing was but I would guess it was at least bigger than a train car but most likely 50 to 100 times bigger. It appeared to be very close to us as it followed us along the highway. The car was starting to run worse and worse. I rolled my window down to see if I could hear it. It seemed to have no sound coming from it. It was silent. The car then died and my buddy coasted the car to the shoulder. We were pretty scared at this point. We looked at each other and said, \"well, lets go see what this thing is\". I remember opening the door and stepping out of the car to look at this thing. When I got out, it had disappeared. It vanished. No smoke nothing, just gone. We looked around for a minute but couldn't see it anywhere.Pretty scared, we got back into the car, it started right up and was running perfectly. As we drove off, we kept looking for it. I did see it again it was up near the top of the mountain and was glowing blue with yellow outline this time as it went over the mountain out of sight. We don't recall being abducted or recall any time lost. I enjoy watching UFO shows in hopes to see something like what we saw. They always seem to be disc shaped or V shaped on those shows or in photos. I would be very interested in hearing about other encounters such as ours. I am wondering if sightings of a box kite shaped UFO is rare. Are they different than others? I don't believe what we saw was of this world. Thanks!"],"Viewing Distance":"101-500 Feet","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around November 10th 1981"],"Longitude":"-77.034346","Case Number":"14090","Weather Factors":"Unknown","Tags":"City","Disposition":"Unknown","Object Features":"Other","City":"Washington","Date of the Event":"11/10/1981 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.901902,+-77.034346(14090)&iwloc=A&hl=en\"> mufon case (14090) map </A>","Date Submitted":"11/10/1981 12:00 UTC","Summary":"The UFO was shaped like an old fashioned box kite. Glowing orange and yellow. It made my car stall.","Latitude":"38.901902","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","Log Number":"US-11272008-0016"}