{"Object Flight Path":"Path then hovering","Case Number":"14096","City":"San Diego","Weather Factors":"None, Does Not Apply","Log Number":"US-11282008-0003","files":["/var/www/straped/mufon/html2text/14096.html.txt","/var/www/straped/mufon/org/14096.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.718179,+-117.154365(14096)&iwloc=A&hl=en\"> mufon case (14096) map </A>","Source":"MUFON","Region":"California","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around November 27th 2008"],"Object Shape":"Unknown","Latitude":"32.718179","Disposition":"Unknown","Summary":"Group of 8 to 10 Bright red lights moving over the City of San Diego.","Date of the Event":"11/27/2008 08:45 UTC","divs":["sighting detailsi was called outside my house by my girlfriend who was in the front yard. pointing to the sww she asked a friend of ours who was visiting with us are those what you saw. previously our friend had called us on the 15th around 7:30pm and had told us that he had just seen 4 bright red lights rapidly descend silently straight down from very high altitude to roughly 1000ft. slightly nww of him. he was in his back yard 3 blocks away. he said that they all appeared to be disk like with a reflective metallic surface that emitted a red light from the bottom with one emitting what he thought to be short vapor trails. he said they then paused briefly 2-3 sec. then 3 took off to the sww with unbelievable speed and vanished. then the one with the c. trails quickly followed suit. when i looked i saw about 8-10 red lights in a random pattern with varied brightness levels. the group was silent and appeared to be getting closer. i did a check of the rest of the sky and there were no other aircraft in the sky. that is very rare for this area. our friend said \"yep that's them, now you know i'm not crazy\" i pulled out my phone and was trying to take some pictures. 1-2 minutes later they all appeared to have stopped approaching. 5-7 min. later as the clouds were about to start to obscure our view and i was thinking to myself \"flairs on balloons\" i saw a brighter red light approaching up towards them from low on the horizon from the west. it was silent and traveling very fast and slowed to a stop in the middle of the group it's color becoming less bright as it did. \"definitely not flairs on balloons\" i thought. my neighbors then came out and caught a glimpse just as the clouds were covering our view. 5 min. later from the east traveling nw a helicopter flew by rather low with an unusual light pattern of many red lights with the top one rotating. it clearly wasn't what we were looking at earlier . about 20-30 min. later the clouds rolled away and the lights were gone. i could see and hear a few jets but not as many as usual. this event was almost identical to the news coverage i saw from 1\\1\\08."],"Tags":"City","Longitude":"-117.154365","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"11/27/2008 08:45 UTC","Viewing Distance":"Unknown","Country":"United States"}