{"divs":["Sighting DetailsWas coming back fron shopping at local grocery. Girlfriend was driving. We both saw it at the same time. Height was just above the standard, wood utility poles along side the roadway. It crossed the roadway, the lights went out then WHOOOOSH! It took off in two blinks of an eye, upward toward the south,but we could see it as it climbed upward and out of sight.The truck windows were rolled up, the radio off. It traveled slowly till it got to the utility poles, then turned off the lights and sped off.It traveled straight for a very short distance, then straight up, leaving a dark trail of ?? behind it. We believe, NOW. . We were traveling west on US Hwy 10, coming from Brillion, Wi, back home to Forest Jct, Wi. They are 4 miles apart.It was the brightness of the object that caught our attention.Our first thought about what it was?UFO . It was spherical, saturn like, lights around center.Feelings? excelerated, hyper, breathless,excited, scared, wont be able to sleep for a while, tonight, and more of a believer then I was befor. We kept driving,but slowed down, and watched till it was out of sight. The night was cold, clear, and bright with stars. Very little light pollution, as this is farm country out here."],"Region":"Wisconsin","Disposition":"Insufficient Data","Longitude":"-88.064266","Case Number":"14106","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Brillion","This sighting has never been favorited."],"City":"Brillion","Latitude":"44.177214","Object Features":"None","Weather Factors":"Unknown","Date of the Event":"11/28/2008 07:15 UTC","files":["/var/www/straped/mufon/html2text/14106.html.txt","/var/www/straped/mufon/org/14106.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.177214,+-88.064266(14106)&iwloc=A&hl=en\"> mufon case (14106) map </A>","Viewing Distance":"Unknown","Summary":"Was in passenger seat of pu truck. Looked up, Saw it going south (fm right to left) and crossed right in front of truck. Full dark out.in country.","Sighting Duration":"Undisclosed","Object Shape":"Saturn-like, Teardrop","Log Number":"US-11282008-0013","Source":"MUFON","Country":"United States","Date Submitted":"11/28/2008 07:15 UTC","Tags":"City"}