{"Date of the Event":"11/28/2008 12:00 UTC","Longitude":"-71.533572","Weather Factors":"Unknown","Log Number":"US-11282008-0014","Region":"New Hampshire","map":"<A HREF = \"http://maps.google.com/maps?q=43.210777,+-71.533572(14107)&iwloc=A&hl=en\"> mufon case (14107) map </A>","Latitude":"43.210777","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/14107.html.txt","/var/www/straped/mufon/org/14107.html"],"City":"Concord","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsMy husband and I went outside our home in Warner NH at approximately 6 pm. There were 2 extremely bright objects hovering above the treeline. One was just above the tree line from where I stood on a deck that is slightly elevated. There was a second object that hovered directly perpendicular above the first, and they seemed to move in conjuction. The lights radiated from the craft at the treeline in the form of beams in all directions from the center straight out. The intensity of the light on both objects started out very strong, the one at the tree line strongest at first, but then the second became brighter. Their movements were erratic, hovering yet moving slightly within a small area on the horizon line. I observed this activity until both lights disappeared - roughly 30 minutes. Three witnesses (including myself) look at this skyline on a daily basis and have never seen any celestial bodies previously in this location at the stated time. 2 other witnesses who showed up during this period had witnessed the lights while travelling: one on 89 Southbound from Lebanon, and the other headed Northbound on 89 from Concord."],"Object Flight Path":"Stationary,Hovering then path","Case Number":"14107","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Cross, Flash, Star-like","Summary":"2 extremely bright objects hovering perpendicular to each other just above tree line, changing intensities in brightness and then dissapearing.","Date Submitted":"11/28/2008 12:00 UTC","trends":["There have been 23 other sightings in Concord","There were no other sightings in Concord on or around November 28th 2008"]}