{"Longitude":"-87.834236","Date Submitted":"11/28/2008 06:20 UTC","Object Shape":"Disc","Summary":"2 Very bright/low lights on top of one another, moving slowly in unison.","Date of the Event":"11/28/2008 06:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.278912,+-87.834236(14113)&iwloc=A&hl=en\"> mufon case (14113) map </A>","Log Number":"US-11292008-0001","Country":"United States","files":["/var/www/straped/mufon/html2text/14113.html.txt","/var/www/straped/mufon/org/14113.html"],"trends":["There have been 3 other sightings in Lake Bluff","There were no other sightings in Lake Bluff on or around November 28th 2008"],"divs":["Sighting DetailsThis sighting began as I was looking out the window while on the phone. I Noticed two lights and immediately grabbed binoculars. The lights appeared to be disc shaped, not round or star like but it was impossible to be sure from the distance. At times it seemed they dimmed and then got brighter. I then went outside to get a better look. The top light was dimmer than the bottom one. They were both significantly lower than any other stars in the sky. There is a lot of light pollution in the area so I could tell they were extremely bright. The lights moved so slowly that they appeared stationary. I kept an eye on them for the next half an hour and they were starting to slowly make their way west. I got in my car with a friend and we watched them on our way out to the highway. It was at this point they finally moved out of site after roughly an hour of watching them. I should mention I have seen many strange things in this area including a massive orb next to a chemtrail as it was being sprayed, lightning striking in a very concentrated area for over an hour, a mile wide rainbow cloud and a flaming Potentially Hazardous Asteroid that was the size of the sun. I always check the skies, day or night, as it appears to be a lively spot in many respects."],"Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Case Number":"14113","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"42.278912","Region":"Illinois","Object Features":"Unknown","Disposition":"IFO","City":"Lake Bluff","Tags":"City"}