{"Date of the Event":"11/01/2008 10:00 UTC","Weather Factors":"Unknown","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around November 1st 2008"],"Object Shape":"Other","files":["/var/www/straped/mufon/html2text/14118.html.txt","/var/www/straped/mufon/org/14118.html"],"Viewing Distance":"Unknown","Tags":"City","Longitude":"-122.654686","divs":["Sighting DetailsIt was about 10 o'clock at night and I was standing outside my house. Stretching out my back I bent over to the side and pointed my had upward, stretching it to the sky, and looking upward. Suddenly, over the trees in the distance came to flying red circular objects. They were flying side by side, strait in my direction. As it got closer I could see that it was connected by cylinder. The craft apperaed to be black with red lights on the bottom. The best way I could describe it is like two old 45 records with red lables, connected by a pipe. It is hard to say how high it was, I would guess about 1000 ft. Each disk was the size of a house, and it was flying very fast, maybe 200 mph. It went almost directly over me, not making a sound, and going on a strait path. It passed over a tree in my front yard, and I tried to run around it to see the craft, but it was gone. I have seen a UFO before when I was 13 that was a single flying saucer hovering over my neighbors houses, so when I saw this one, I really tried to study it. It apeared to be black, but it was at night, so it could of been silver. Barbell shaped, with one red ciruclar light under each disk. The disks were three dementional, how thick I am not sure. After it flew by I was left feeling blown away. I don't know if this is aliens, goverment, or people from the future. Time will tell."],"City":"Vancouver","Sighting Duration":"Undisclosed","Log Number":"US-11292008-0006","Region":"Washington","Object Flight Path":"Undisclosed","Date Submitted":"11/01/2008 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.641988,+-122.654686(14118)&iwloc=A&hl=en\"> mufon case (14118) map </A>","Case Number":"14118","Latitude":"45.641988","Object Features":"Undisclosed","Summary":"Barbell shaped but flat. Circle of red light on the bottom. Flew right over my head very fast.","Source":"MUFON","Country":"United States","Disposition":"Unknown"}