{"Weather Factors":"None","Tags":"City","Latitude":"34.933058","Object Shape":"Star-like","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.933058,+-114.588853(14114)&iwloc=A&hl=en\"> mufon case (14114) map </A>","Object Features":"None","Viewing Distance":"Unknown","Region":"Arizona","Date Submitted":"11/28/2008 07:19 UTC","Date of the Event":"11/28/2008 07:19 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/14114.html.txt","/var/www/straped/mufon/org/14114.html"],"Log Number":"US-11292008-0002","Case Number":"14114","Country":"United States","City":"Mohave Valley","Longitude":"-114.588853","Summary":"Two bright lights. One above the other. Stationary approx. 2+hrs.Then gone! The lights were in the SW sky. Pictures included.","trends":["There have been 5 other sightings in Mohave Valley","There was one other sighting in Mohave Valley on or around November 28th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","Source":"MUFON","divs":["Sighting DetailsI went outside with my dog approx.7:15pm. I looked up towards the SW and saw two Very Very Bright Lights. One above the other. One was smaller than the other. The smaller of the two was above the other. They were approx. 10-15 miles away from me. Not high in the sky at all. You can see that when you look at my pictures. I went back inside real quick to get my camera. Went back out and took a few pictures. First two were clear. rest got shaky. The lights seemed to be very very bright and then dim just slightly, enough to notice it though. Then I went back inside to download the pics. I did not go back out for awhile,as I had other commitments. When I did go back out around 11:00pm They were gone. Stars were out though. Just NONE like or as BRIGHT as what I took pictures of. My husband asked me what I was doing and I told him taking pics.of the sky and he said that he had seen them out there about an hour or so before me..He is used to seeing things in our sky here. I am too. This is the 3rd Report I have sent in to MUFON."]}