{"Longitude":"-120.375968","Weather Factors":"Unknown","Country":"United States","Summary":"Disc with red light following and then towing the low flying object [lots of color].","Date of the Event":"04/14/1989 12:00 UTC","Case Number":"14117","City":"Sonora","files":["/var/www/straped/mufon/html2text/14117.html.txt","/var/www/straped/mufon/org/14117.html"],"trends":["There have been 4 other sightings in Sonora","There were no other sightings in Sonora on or around April 14th 1989"],"Log Number":"US-11292008-0005","Tags":"City","Latitude":"37.991601","Disposition":"Hoax","divs":["Sighting Detailswas comming home with my boss john who was a scottish religious man who hid from evertone alot. while on hiway108 in california foothills. i had just asked him if he beleived in ufo and then suddenly comming over the foothills comming our way, at night. it was flying very low just above us with a seperate vehickel that was red was towing the big disk. i grabed his camera and as we steped out it was finnaly above us. i could see all kinds of lights on its bottom making a low humming from it. as it flew over it just continued on its way over the crossing herizon. the most shocking thing was, as the next week went by i saw the man driving with me at the time had showed me one of the pictures. as he did i jokenly said watch out someone will get you for the picture. two weeks latter the man with the photo died!i latter learnd he had come to the us with a fake visa. he was from the country of scottland, aqnd had something to do with the kgb. and like most people at the church in the seirra and nevadas they were hidding food and weapons for the end of the world.john the man who drove the night of the photo worked for the scottesh military.and was hidding at this church.well although hard to beleive these are defferently the end times[at least for john]"],"Region":"California","Date Submitted":"04/14/1989 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Disc","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.991601,+-120.375968(14117)&iwloc=A&hl=en\"> mufon case (14117) map </A>","Viewing Distance":"Unknown"}