{"divs":["Sighting Detailsmy mother, sister, and myself (moms 73, sister will be 51, i'm 53)had dropped my cat of at a 24hr animal hospital and was on our way back home. I spotted these 2 very bright lights on e directly above the other, asuming they were airplanes i just continuted to watch but they didn't seem to move. After awhile because of the road turning they had been on the passenger side, but became eventually on the drivers side. I finaaly mentioned it to my mother and sister so my sister pulled in to a strip mall and watched it for a couple of minutes and it didn't move. We went on to my sisters house and they were still just sitting there in the sky, so a got a chair and went outside and sit and watch them for about 10 minutes (My brother-in-law also came out and saw them)they would get brighter then dim. I waited and my other sister came over (she is an airline stewart so she asumed it was an airplane at first also)and I asked her to drive me in the direction of the lights out in the country for a better look. We stopped periodically to see if there was any moment. The one on top moved slightly to the right of the one underneath it, they kept diming and then brighten. we were out in the country for aroud 15 minutes and they seem to move down closer to the ground, and as we were watching the bottom one start to dim and just disappear about 5 minutes latter the other one did the same thing. there is noway these were planes, balloons, helicopters, or stars, just noway! Chris Helton"],"Sighting Duration":"Undisclosed","Weather Factors":"Windy","Log Number":"US-11292008-0015","Region":"Indiana","Tags":"City","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around November 28th 2008"],"City":"Brownsburg","files":["/var/www/straped/mufon/html2text/14127.html.txt","/var/www/straped/mufon/org/14127.html"],"Object Shape":"Star-like","Latitude":"39.843377","Object Flight Path":"Stationary","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.843377,+-86.397774(14127)&iwloc=A&hl=en\"> mufon case (14127) map </A>","Date of the Event":"11/28/2008 07:00 UTC","Summary":"Saw 2 really bright lights 1 above the other stationary that just disappeared while wathching.","Date Submitted":"11/28/2008 07:00 UTC","Country":"United States","Disposition":"IFO","Case Number":"14127","Object Features":"None","Longitude":"-86.397774","Source":"MUFON"}