{"Object Flight Path":"Stationary,Hovering then path","Date Submitted":"11/28/2008 08:00 UTC","Object Shape":"Circle, Sphere, Star-like, Other, Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.981681,+-118.225072(14123)&iwloc=A&hl=en\"> mufon case (14123) map </A>","Country":"United States","Summary":"2 bright objects apart and vertical. Bigger one faded and reappeared. Also, last Friday, an unsual green, blue, and white light flickering UFO at night.","Source":"MUFON","Date of the Event":"11/28/2008 08:00 UTC","Latitude":"33.981681","Log Number":"US-11292008-0011","trends":["There have been 2 other sightings in Huntington Park","There were no other sightings in Huntington Park on or around November 28th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"California","Tags":"City","divs":["Sighting DetailsYesterday I finally took a good look at these 2 peculiar bright objects in the sky, I've been seeing them for at least 3 days in a row. But yesterday I got my camera to see what the heck these things were doing, so bright, when I could hardly see any other star in the sky, because of all the cloudiness, in the night. They were a long distance apart, but vertical to each other. The object at the bottom was way triple the size or more of the object above it. I videotaped it, and as I was doing so, the bottom bright sphere faded out and then back in.I didn't think of reporting it and deleted the footage, because I felt somebody will shrug it off as stars, but now that I read all the accounts of the same thing these past few days, I know that this isn't some normal thing. I will take footage again tonight, and send you pictures. Also, what I find odd is that just last Friday, I went outside and witnessed the oddest resilient silver sphere, that looked like a glowing balloon in the night, with what looked like ridiculous red, green and white lights alternately flickering on it. This object seemed so surreal, like a 3D cartoon in the sky. It hovered on the area in the distance above the houses to the east of my house, and then it slowly lowered behind the trees in the distance. I unfortunately did not expect this to happen, and didn't have enough battery in my cam, but nonetheless, I ran to get it and caught the object for a few seconds. I had to climb a ledge to get the scarce footage, but when I uploaded it to myspace video, the quality of the footage was degraded and did not look as clear as it did on my Exilim camera. I'm afraid of this happening again tonight. But nontheless, I will take footage, because whatever these two bright starlike objects are, they've been lingering in the sky for days. The pictures below are of the object that I caught on the previous Friday. I will let you know that the sky above my house is an itinerary of planes to LAX , I believe. But the vague pic with red is the one of the object I saw that night, I also believe the white object was the same thing, but my cam kept turning off as the battery was so low. As for the two star-like objects, they were in a completely different part of the sky, and were immobil. I will try to take pics of these other objects tonight."],"files":["/var/www/straped/mufon/html2text/14123.html.txt","/var/www/straped/mufon/more/14123_submitter_file1__Picture084.jpg","/var/www/straped/mufon/more/14123_submitter_file2__Picture085.jpg","/var/www/straped/mufon/more/14123_submitter_file3__Picture087.jpg","/var/www/straped/mufon/org/14123.html"],"Object Features":"Unknown","Weather Factors":"Unknown","Case Number":"14123","City":"Huntington Park","Longitude":"-118.225072"}