{"Log Number":"CN-11292008-0023","Date Submitted":"05/15/1997 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.914003,+121.614682(14135)&iwloc=A&hl=en\"> mufon case (14135) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14135.html.txt","/var/www/straped/mufon/org/14135.html"],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","City":"Dalian","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Region":"Liaoning","Date of the Event":"05/15/1997 12:00 UTC","Longitude":"121.614682","Case Number":"14135","Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"China","Summary":"UFO bombing.","Latitude":"38.914003","divs":["Sighting DetailsTill now, i still do not know what exactly was i saw ten years ago. When i was in high school, my classmates and i had a several-day outing in the country, a small village near Dalian, China. One night, about 23:00 when all of us lied on the bed, looking out into the sky, talking, joking, suddently some one of us shouted out what a big and bright star and asked anybody could tell him what name of the star. Then all of us started to pay attention to the star, which was alreay the brightest star and becoming brighter and brigher, bigger and bigger. We were all so excited about what we saw. We guessed it maybe was a falling star, but maybe not because falling star just exists for a few seconds then be burned out, and this star had been there for almost 3 minutes since we started to pay attention to it. While we were disscussing about it, the star became even bigger and brighter and suddenly it burst. We saw that in the central it was still shining, and around the central it was something like nebula, expanding all around in a very high speed and soon covered half of the sky and the central started to get grey till it dispeared with only nebula left. Anybody can tell me what exactly i saw?"],"Tags":"City","Object Shape":"Diamond, Fireball","trends":["There have been no other sightings in Dalian","This sighting has never been favorited."]}