{"Viewing Distance":"Unknown","Log Number":"US-11292008-0025","divs":["Sighting Detailson nov 22 2008 i was driving home after driving my sister to her house i happened to look up in the sky and noticed yhis bright star likr thing then i noticed it was blinking red and blue and the white light getting brighter. i sat a little longer and noticed that it started moving real fast straight up and down. i hurried back to my mom house and picked her up and had her come with me she thought it was a plane but then she noticed it was moving in zig zag motions and there were like red dots floating along with it. then for the next 5 days i watched it every night and listened to everyone call me crazy then on nov 28 2008 my family noticed there are 2 of them and they are straight up abd down and they move closer to each other and get brighter at the same time they even move in the same motion. then around 10:30pm i was driving home from berrien springs going north and i noticed that the red blue and white lights looked as though they were descending down. every night they come out at the same time and they disappear around the same time. we also noticed that there are smaller ones all over the place and they look like they are attached together by a red looking string looking thing. i hope you can help me and let me know if this trully is a ufo or something else but i cant imagine it being anything else"],"Date of the Event":"11/22/2008 07:00 UTC","Object Features":"Undisclosed","Country":"United States","Weather Factors":"None","Tags":"City","Longitude":"-86.299739","Case Number":"14137","City":"Eau Claire","Summary":"Looks like a star but it blinks red blue and white.","Latitude":"41.985045","Source":"MUFON","Disposition":"IFO","trends":["There has been one other sighting in Eau Claire","There were no other sightings in Eau Claire on or around November 22nd 2008"],"Date Submitted":"11/22/2008 07:00 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Region":"Michigan","files":["/var/www/straped/mufon/html2text/14137.html.txt","/var/www/straped/mufon/org/14137.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.985045,+-86.299739(14137)&iwloc=A&hl=en\"> mufon case (14137) map </A>","Object Shape":"Star-like"}