{"Tags":"City","divs":["Sighting DetailsMy friend is a hunter and his themal camera, made by COACH, took these night shots. The images were only shot from his camera since it was late at night and neither of us saw them. He emailed me the pictures to view and wondered what I thought. It struck me as odd but who do you show them to? A professional photographer looked at them & said they're not rain drops or lens flare but didn't know what they were. This morning I watched \"U.F.O. Hunters & noticed the one picture, right before the V.W. commercial & one of the lights in the sky looked exactly like the 'packman' light in the woods. That's what got my attention; they were so similar. I guess the one picture of the packman white object, with the tentacles, surrounding what looks like a black ball below it is the best for detecting motion. The pictures give me the creeps since I live on the adjoining property so they're really close to our house. I don't know how long they were there but I think the thermal camera would have kept shooting if they had lingered. I don't care if you tell me they're soap bubbles; I'd just like to know what you think they are. Also, most of the PA. sightings were in Bucks county,this happened during the period of the rash of sightings in our state. Who sits and blows soap bubbles in the middle of the night & decided to go back a week later and do it again? And that packman globe surrounding a black ball? Who could explain that one? Notice the one ball in front of a tree in the background; you can see the tree branch thru the ball. Had to all be generating heat or the camera would not have fired. Curious in Pennsylvania.........."],"Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Circle, Other","Summary":"Balls of light in the woods over 3 days all at the same location.","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14138.html.txt","/var/www/straped/mufon/more/14138_submitter_file1__lightsoriginal2.jpg","/var/www/straped/mufon/more/14138_submitter_file2__originallightsinthewoods6.jpg","/var/www/straped/mufon/org/14138.html"],"trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around August 21st 2008","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Date of the Event":"08/21/2008 02:23 UTC","Longitude":"-79.989106","Latitude":"40.443155","City":"Pittsburgh","Case Number":"14138","Disposition":"Insufficient Data","Log Number":"US-11292008-0026","Date Submitted":"08/21/2008 02:23 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.443155,+-79.989106(14138)&iwloc=A&hl=en\"> mufon case (14138) map </A>"}