{"Object Shape":"Circle","Viewing Distance":"Unknown","Log Number":"US-11292008-0030","Sighting Duration":"Undisclosed","Longitude":"-104.604241","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/14143.html.txt","/var/www/straped/mufon/org/14143.html"],"Summary":"I gazed up into sky and spotted an unusual lighted object.","Disposition":"IFO","Date of the Event":"11/21/2008 06:10 UTC","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around November 21st 2008"],"City":"Pueblo","Latitude":"38.264137","Date Submitted":"11/21/2008 06:10 UTC","Case Number":"14143","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.264137,+-104.604241(14143)&iwloc=A&hl=en\"> mufon case (14143) map </A>","Source":"MUFON","Region":"Colorado","Object Flight Path":"Straight-line path","divs":["Sighting DetailsDinner was almost prepared, with the exception of grilling the steaks. I walked out onto the deck and removed the grill cover in prepartion of firing up the grill. While folding up the cover I gazed up into the night skies, as I usually do. Now this was a very clear night with good star visibility. A bright moving object immediately caught my attention. It was proceeding in a north direction, but not very rapidly, as I compared it to stationary stars up above it. I focused very hard on this object and again immediately noticed it had no flashing markers on it as all aircraft do. I then started listening for some kind of engine exhaust but it was totally quite also. The thing that caught my curiousity the most was the color of this object. It was totally round in dimension from my point of view, but it had two very distinguishing colors to itself. It had an inner color, almost electric blue. The color of blue you see if you hold a plug wire close to a spark plug and see the power jumping the distance, (while the engine is running.) This color was visible in a completely round circle on the inner side of this object. Attached to this electric blue inner circle was an outer much smaller circle, completely around it too. This was probably one fourth of it's total size. Now the color of this section was white with a bluish tint to it. I then realized I've never seen anything like this before, ever. Meanwhile I had been holding the folded grill cover in my hands so I leaned over to place it down and immediately returned my gaze to this unusual object, because I intended on not losing my visual on it. Now this only took about two seconds to do, but on looking back at the same area in the sky there was nothing there. No lights no nothing, it was suddenly gone. No cloud cover to interfere, as I could still see lots of stars wherever I looked. This object disappeared in a matter of seconds, no more than two at the very most. I regret deeply that I did that, because I would have then seen it disappear. But even now I still vividly remember how these colors stood out and seemed to glow from this object."]}