{"Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Case Number":"14141","trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around August 21st 2008","This sighting has never been favorited.",""],"Latitude":"40.441835","Object Shape":"Circle","Date of the Event":"08/21/2008 12:00 UTC","Viewing Distance":"20 Feet or Less","divs":["sighting detailsmy friend is a hunter and his thermal camera took these pictures on 2 different nights. the time stamp on both shows the exact time and date. i watched ufo hunters this morning and was struck by the one \"packman\" light in the sky. (just before it cut to the vw commercial). they are so similar that i went back & looked at his photos. the one is strange; the white globe seems to be surrounding a black one right below it; shows some motion, i guess. they creep me out because we live on the adjoining property and so they're really close to our house. i did show them to a professional photographer and she said they aren't rain drops or lens flare but she didn't know what could produce that effect....esp. the packman white globe surrounding the black one. i don't know how long they were there but if they lingered, the thermal camera would probably have kept shooting. regardless of what you think they are, i'd sure like to know what you think. could it be ball lightening? seems odd there are so many in one spot and i never heard of ball lightening gobbling up black ones. or, could they be 'probes'? i have a set i tossed into photoshop cs and pulled out more contrast and color but these are the originals. the show this morning was \" sightings over pennsylvania\"; saturday, 11\\28? or it could have been the 28th and it was a show that i t-voed. i'm sure it will be easy for you to check.........."],"Summary":"Strange lights in the woods during this past August during the PA flap.","Object Features":"Unknown","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.441835,+-79.994886(14141)&iwloc=A&hl=en\"> mufon case (14141) map </A>","City":"Pittsburgh","Log Number":"US-11292008-0028","Sighting Duration":"Undisclosed","Longitude":"-79.994886","Region":"Pennsylvania","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/14141.html.txt","/var/www/straped/mufon/more/14141_submitter_file1__lightsoriginal2.jpg","/var/www/straped/mufon/more/14141_submitter_file2__originallightsinthewoods6.jpg","/var/www/straped/mufon/org/14141.html"],"Date Submitted":"08/21/2008 12:00 UTC","Tags":"City"}