{"Longitude":"-83.400913","divs":["Sighting DetailsI was coming into my house from the back yard. I looked up into the sky and noticed two very bright objects, what I thought were stars, but brighter than usual and not in the area of the sky where I have seen bright stars before. I went into the house and asked my wife to come out and look and get her reaction. She had the same as I. We watched for awhile and then came in and ate dinner. About an hour and a half. My wife went out to smoke and came back into the house to tell me that they had moved. They had move much lower in the sky than a normal star would have moved in that time. Also we noticed that the lower object was blinking bright red and white. My wife watched for about ten minutes and the lower object kept moving down on the horizon. She also noticed that there seemed to be an airplane circleing around as if it were checking it out. After about twenty minutes it seem to disapear from sight behind the trees and roof tops. We knew these were not stars, airplanes, or planets. We are not sure what they were, but it just didn't seem normal."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.693334,+-83.400913(14142)&iwloc=A&hl=en\"> mufon case (14142) map </A>","Object Shape":"Unknown","Object Features":"Unknown","Date Submitted":"11/28/2008 06:20 UTC","Disposition":"IFO","City":"Waterford","Viewing Distance":"Unknown","Country":"United States","Region":"Michigan","Summary":"2 bright stars never seen b 4 in this area of sky were noted...1pprox. 1 hr later after dinner they had moved significant distance to the west and then dissappeared.","Log Number":"US-11292008-0029","Object Flight Path":"Stationary,Hovering then path","Source":"MUFON","Case Number":"14142","Date of the Event":"11/28/2008 06:20 UTC","trends":["There have been 7 other sightings in Waterford","There were no other sightings in Waterford on or around November 28th 2008"],"Latitude":"42.693334","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/14142.html.txt","/var/www/straped/mufon/org/14142.html"],"Sighting Duration":"Undisclosed","Tags":"City"}