{"Date Submitted":"11/30/0002 05:03 UTC","Summary":"Saw UFO early mornings hours during paper route everyday for about 2 weeks.","Object Shape":"Circle, Flash","Object Flight Path":"Stationary","divs":["Sighting Detailsi had a paper route in the early 1980s i was early teens maybe 12 or 13 i guess,i was doing my regular paper route in the dogwood section of levittown, pa i usually took a break on daffodil lane when i was about half way done my paper route so i stopped around 5 in the morning and i was just sitting there on my bike when a circular ufo just appeared above my head it came straight down from the clouds it stopped just over the street lights and it was perfectly round with all different colors on the bottom it didnt move but was spinning really fast it lit up the whole neighborhood like it was daylight. it was only about maybe a 100 feet above the street lights it only stayed a few minutes and then it went straight up and disappeared in the night like it went into outerspace. i was kind of stunned i finally went and finished my paper route then i went home and went back to bed then i went to school and as the day went on i kinda forgot about it. as i was doing my paper route the next morning i stopped at my usual break spot on daffodil lane when i started thinking about the ufo so i sat there a few minutes when the ufo came back straight down from the sky it stopped instantly just above the street lights in the exact same spot and hieght above the street lights it lit up the neighborhood like daylight it didnt move kinda like it was held in place yet it was spinning insanely fast while the whole bottom was flashing different colors, it only stayed a few minutes then went straight up as afast as it came and it was gone. i was absolutly amazed i finished my paper route went home and told everybody in my famil and nobody believed me then i asked my mom if she could get mr=e a camera and she said no i wanted 1 incase it came back but she said film is expensive and you are not wasting film. so for about the next 2 weeks the ufo came back everymorning at the exact time to the minute and stopped in the exact same spot above my head at the exact same spot and it stayed for the same time the went straight back up and disappeared. i tried everyday to get my brother to go with me to see it but he said no because he thought i just wanted him to help do my paper route finally i convinced hi to go with me so we did my route then stopped there around the time it usually came we sat and waited then at the exact time it came back again right over our heads and lit the neighborhood up and my brother freaked out he said omg you are telling the truth, it stayed a few minutes then went straight up and disappeared the next morning we both got up and di my route we stopped at the spot around the same time again but it didnt come back and never came back after that.. im 39 years old now so im guessing it was around 81,82 or 1983 in or around there im not sure how i would find out the exact year because i dont know if the courier times would have that information after so many years........."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Case Number":"14159","Source":"MUFON","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around November 30th 2002"],"Latitude":"40.15808","Longitude":"-74.825995","map":"<A HREF = \"http://maps.google.com/maps?q=40.15808,+-74.825995(14159)&iwloc=A&hl=en\"> mufon case (14159) map </A>","Tags":"City","Viewing Distance":"21-100 Feet","Disposition":"Insufficient Data","City":"Levittown","Object Features":"Undisclosed","Date of the Event":"11/30/2002 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/14159.html.txt","/var/www/straped/mufon/org/14159.html"],"Log Number":"US-11302008-0012"}