{"Viewing Distance":"Unknown","trends":["There have been 8 other sightings in Tracy","There were no other sightings in Tracy on or around November 29th 2008"],"Country":"United States","Case Number":"14154","Summary":"3 big lights on bottom with 1 little one and about 6 or more lights going across.","Log Number":"US-11302008-0007","Weather Factors":"Unknown","Date of the Event":"11/29/2008 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/14154.html.txt","/var/www/straped/mufon/org/14154.html"],"Tags":"City","Longitude":"-121.425223","divs":["Sighting DetailsI was standing outside of the house in Tracy, CA. my dad just bought a house and I was taking a brake from working on it. I was talking to my mom on the phone and watching the sky looking at the stars and watching all the airplanes fly by. I noticed this craft in The air and thought it was an airplane but noticed a frew seconds later the lighting was different. there were 3 big lights with a smaller one on top these lightings were on the bottom of the craft it looked some what like this: . o o o The 2 bottom larg lights are more together. I couldn't see the shape but I guessed it was a trianguler shape because the back of the crafts lights look like this: ....... Starght in a row. Both ends were light up and it blinked across. The craft look just a tiny bit closer to the ground from an air planes point of view. It was moving straghit as fast as a plane and had a noise that sounded like a plane but only a little noise. During the sighting I felt confused because I don't know what I saw. was my mind planing tricks on me and it was really an airplan? did the military make a craft? Because it looked man made but felt like it had some alien technoligy to it. My action during the sighting I just stood still and watched it fly by. After the sighting I woundered around trying to think of an explaination. I lost sight 'cause it flew out of sight. I wanted to add to this description that there might of been more lights of what I can remember."],"Date Submitted":"11/29/2008 12:00 UTC","Object Shape":"Triangle","Object Features":"Unknown","Latitude":"37.739651","City":"Tracy","map":"<A HREF = \"http://maps.google.com/maps?q=37.739651,+-121.425223(14154)&iwloc=A&hl=en\"> mufon case (14154) map </A>","Source":"MUFON","Region":"California"}