{"divs":["Sighting DetailsIt was about 7:10 PM when I pulled into my driveway so my daughter could go inside and change. I was mindful of the time because she had to be at the movie theater at 7:30 PM. I noticed two orbs of bright white just over the hill I live next to. I didn't hear a noise when I got out of my car and didn't see any red or flashing lights like you would on typical aircraft I see all the time. After taking my daughter to the movie theater I was driving west on Happy Valley Road to return home when I saw the same orbs but they were less bright and seem to be moving south and west. What struck me weird was if they were moving away from me why were they still only white and the fact that although they were moving, they were still seemingly the same formation in relation to each other.I also realized it was about a half hour later. I decided to head west and see if I could catch up to the objects. I couldn't, but I did call my parents who live 40 minutes west of me. They saw the lights south of where they live and also thought they were strange. They viewed the objects through binoculars and saw that the white orbs occasionally pulsated red on the bottom. One object was smaller and dimmer and higher in the sky compared to the other object. The objects continued to move southwest. After a half hour of driving I had to turn back, but I could still see those orbs in the distance. I realized that compared to other planes in the sky, these things were very big and very bright especially to be able to see them so far in the distance over an hour later. Sorry I couldn't photograph it or video it. I wish I had time to investigate further but maybe someone has an answer for me."],"Source":"MUFON","City":"Peoria","Viewing Distance":"Unknown","Country":"United States","Disposition":"IFO","Tags":"City","Region":"Arizona","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.584596,+-112.228628(14155)&iwloc=A&hl=en\"> mufon case (14155) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/14155.html.txt","/var/www/straped/mufon/org/14155.html"],"Log Number":"US-11302008-0008","trends":["There have been 13 other sightings in Peoria","There were no other sightings in Peoria on or around November 29th 2008"],"Object Features":"Unknown","Case Number":"14155","Date Submitted":"11/29/2008 07:10 UTC","Latitude":"33.584596","Longitude":"-112.228628","Date of the Event":"11/29/2008 07:10 UTC","Weather Factors":"None","Object Shape":"Sphere","Summary":"two white light orbs one lower, bigger and brighter"}