{"Source":"MUFON","divs":["Sighting DetailsI first noticed two lights in formation in the sky while driving along the 80 around Berkeley and Emeryville. They caught my eye in the car despite all the traffic, although at the time I assumed they must be planes or helicopters momentarily appearing to by flying in sync. I arrived home around 10 minutes later. After unpacking groceries I went to the upstairs window and noticed the same lights there. They were in the exact same formation, the top one offset about 20 degrees from the one on the bottom. They were by far the brightest thing in the sky. I watched them for another ten minutes or so, waiting for some sign of one to change distance and angle from the other, but they remained locked. I went and found a pair of binoculars and focused in on them. It was immediately clear that there were no signs of these being commercial aircraft of any kind, ie no blinking lights to speak of. The light quality was luminescent and that of a planet when viewed through a high powered telescope, but there and visible to the naked eye in the haze of an urban environment. I saw many aircraft fly by these lights, possibly investigating them. The lights were incidentally far brighter than these aircraft. The distance between the lights could have been anywhere between a thousand yards and a number of miles, it was hard to tell. During the time I was viewing them, roughly 45 minutes, they disappeared down below objects in my foreground. My sense was that they were traveling in the opposite direction and thus sinking below the horizon. I snapped a couple of pictures of the lights, one of which is attached. They all appear to show some kind of dark band around the brighter light on the bottom."],"Object Flight Path":"Undisclosed","Date Submitted":"11/29/2008 07:45 UTC","Region":"California","Object Features":"Undisclosed","Summary":"Two hovering lights","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14151.html.txt","/var/www/straped/mufon/more/14151_submitter_file1__bayareaUFO01.jpg","/var/www/straped/mufon/org/14151.html"],"Latitude":"37.881263","map":"<A HREF = \"http://maps.google.com/maps?q=37.881263,+-122.264647(14151)&iwloc=A&hl=en\"> mufon case (14151) map </A>","Sighting Duration":"01:00:00","Disposition":"IFO","City":"Berkeley","trends":["There have been 7 other sightings in Berkeley","There were no other sightings in Berkeley on or around November 29th 2008","This sighting has never been favorited.",""],"Log Number":"US-11302008-0004","Longitude":"-122.264647","Object Shape":"Saturn-like","Case Number":"14151","Country":"United States","Weather Factors":"Unknown","Date of the Event":"11/29/2008 07:45 UTC"}