{"Viewing Distance":"Unknown","Summary":"High speed curving light just under cloud layer, then shoots straight up.","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Tucson","Date of the Event":"11/28/2008 06:27 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/14165.html.txt","/var/www/straped/mufon/org/14165.html"],"Disposition":"Unknown","Region":"Arizona","Sighting Duration":"Undisclosed","Date Submitted":"11/28/2008 06:27 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsMe and my family were having a Thanksgiving dinner for our immediate family and a few friends the day after Thanksgiving. I stepped out front to light a cigerette standing in the middle of my front yard. After lighting up, I looked up in the the low cloud filled sky; like I tend to do, being a skywatcher like I am, I saw a light directly to my north start moving from east to west. Right off the bat the hairs on my arm stood at attention. It seemed to be skipping the underside of the clouds, so the light was semi-obscured by the moisture vapor, a kind of halo around the light. It moved extremely fast for being as low as it appeared to be. I Followed it with my eyes for about 3 seconds before it seemed to make a curving toward the south (now maybe a mile to my north-west) I yelled to my friend Craig(33) to come outside. I of course turned my head into the house to communicate with him thinking maybe I won't be able to see it when I turned back around. As I turned scanning the sky like a desparate drug fiend looking for his next fix, I spotted it again, Craig right on my tail. My oldest son Tyler(16) followed out as well spotting what I saw, as I was beginning to not beable to see it anymore because the distance it had travelled in such a short amount of time. Right after I lost sight of the object my son said, \"it just shot to the left\". Craig; not seeing it initailly, was upset that he didn't catch a glimpse of it said, \"I just saw it shoot straight up\". We looked around for a while after, hoping this was the beginning of the \"Tucson Lights\" but it seems that nobody else has reported this event, YET! No sound accompanied this fly by as we realized right after the light went up in the sky (per Craig, I or my son did not witness it going straight up but I really don't doubt it one bit.) I have been a sky watcher ever since I was a kid because of my interest in UFO's and have never reported anything like this before. This has affected me; in a way that truely makes me believe that what I saw was a special moment in my life. This was not a plane, balloon, or helicopter. I would believe you if investigations concluded that what I saw was \"inteligentlly controlled ball lightning\" but ball lightning, NO. *****I think that some of the local news channels have video recordings of Tucson from 'A' Mountain constantly scanning. Ask them to see the video from the 28th at 6:27P.M."],"Object Shape":"Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=32.227643,+-110.918709(14165)&iwloc=A&hl=en\"> mufon case (14165) map </A>","Longitude":"-110.918709","Country":"United States","Latitude":"32.227643","Log Number":"US-11302008-0017","Case Number":"14165","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around November 28th 2008"],"Weather Factors":"Unknown"}