{"Latitude":"39.006699","divs":["Sighting DetailsIn early December 1998, around 8 PM I witnessed a near noiseless aircraft fly by my at an extremely low altitude. I was standing on my porch, situated approximately 15ft off the ground. My house was positioned in a cauldesac which opened up on the left and curved at the right from where I was standing. I was standing outside observing the Moon, which was discoloured due to natural atmospheric phenomena when an unmarked aircraft flew by, in between the rows of houses, at high speed and only 15 to 25ft. above ground. The aircraft continued down the street before climbing and turning left at which point I lost sight of it. The aircraft made no engine noise and all I heard was the jet stream as it flew past. The aircraft also had no lights. As visibility was limited and the aircraft was moving too quickly and at such an angle for any detailed observation I was not sure of its shape although certain features made me think it may have been a Sea Harrier, and at the time I accepted it as that or some other military aircraft. However, Sea Harriers are by no means noiseless, they are extremely loud aircraft, and there would be no reason for a military pilot to fly at such a low altitude in a suburban environment where any error would be catastrophic. The fact that it was also flying without lights made little sense as well. A few seconds after the aircraft left my line of sight I returned inside. Although this event took place almost exactly a decade ago and I'm sure it's of little use, I felt that I should report this event to experts in case it provides any information at all."],"Case Number":"14164","Object Features":"Unknown","trends":["There have been 3 other sightings in Sterling","There were no other sightings in Sterling on or around November 30th 1998"],"Weather Factors":"Unknown","Region":"Virginia","Object Flight Path":"Path with directional change","Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/14164.html.txt","/var/www/straped/mufon/org/14164.html"],"Viewing Distance":"20 Feet or Less, 21-100 Feet","Date Submitted":"11/30/1998 12:00 UTC","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.006699,+-77.42913(14164)&iwloc=A&hl=en\"> mufon case (14164) map </A>","Date of the Event":"11/30/1998 12:00 UTC","Source":"MUFON","Tags":"City","City":"Sterling","Longitude":"-77.42913","Summary":"Near noiseless aircraft flew by at extremely low altitude.","Log Number":"US-11302008-0016","Sighting Duration":"Undisclosed"}