{"Tags":"City","Object Shape":"Oval","Source":"MUFON","files":["/var/www/straped/mufon/html2text/1416.html.txt","/var/www/straped/mufon/org/1416.html"],"Log Number":"","Region":"Michigan","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.737425,+-84.549335(1416)&iwloc=A&hl=en\"> mufon case (1416) map </A>","Object Flight Path":"Unknown","Sighting Duration":"00:10:00","Date of the Event":"08/31/1978 07:00 UTC","Disposition":"Unresolved","Latitude":"42.737425","Date Submitted":"08/31/1978 07:00 UTC","Case Number":"1416","City":"Lansing","Viewing Distance":"101-500 Feet","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around August 31st 1978"],"Object Features":"Window(s)","divs":["Sighting DetailsWitness 1 - When asked where were you and what you were doing at the time,Witness 1 stated - \"In car, going for groceries heading west on Hazel. Whenasked what made you first notice the object, Witness 2 stated, \"Was low in thesky and straight in front of me and was very obviously something Id never seenbefore\". When asked what did you think the object was when you first noticedit, Witness 2 stated, \"Defininitely a UFO-nothing Id ever seen before\". Whenasked to describe her actions and reactions during the sighting, she stated,\"Excitement, Scared-turned around to get my boyfriend to show him\". Shedescribes the object and its actions as, \"Kind of oblong with a slow rising humpon top and bottom, greenish windows on bottom with a line of very bright whitishwindows or lights just above green-moved slowly at first then erratically backand forth and headed for same direction\". She lost sight of the object when,\"it all of a sudden disappeared to the South-had not seen it move so abruptlytill then. It was gone in an instant\".Witness 2 - When asked where were you and what you were doing at the time,Witness 2 stated - \"I was in the bath tub when my girl friend, now my wife, camein my parents house very excited telling me to come and see this. I went withher, me driving in the car to see what she had seen. I didnt so going home iswhen we sighted it.\" When asked what made you first notice the object, Witness1 stated, \"I was looking for it\". When asked what did you think the object waswhen you first noticed it, Witness 1 stated, \"I dont know\". When asked todescribe his actions and reactions during the sighting, he stated, \"Surprise andCurious\". He describes the object and its actions as, \"An oval oblong shapehovering when first sighted, with no noise at all then at a blink of an eye itmoved approx. 1 mile with no noise or exhaust from engine. He lost sight of theobject when, \"it just took off again at a blink of an eye, but we heard on theCB radio people talking about it in Easton Rapids."],"Summary":"Oblong Oval with Greenish Windows seen near Lansin","Weather Factors":"Unknown","Longitude":"-84.549335"}