{"Region":"Washington","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-12012008-0009","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Longitude":"-122.439441","Country":"United States","trends":["There have been 29 other sightings in Tacoma","There were no other sightings in Tacoma on or around August 9th 2008"],"Date of the Event":"08/09/2008 08:10 UTC","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsI was standing at my sliding glass door (which faces south west) smoking a cigarett and I happend to look up and see a elongated triangular shape flying due north at very low level and very low speed. I would estimate the speed at 30-35 mph and the altitude at approximatly 150 feet. I could not take my eyes off of this object and had a cell phone that I could of taken pictures with but I did not think of it at the time. The craft had a concave on the very front of the thickest part of the elongated triangle and the strange thing about it was the fact that it was flying with the thick part of the wedge forward and the tip of the triangle aft. I must also note that the sky was grey that evening. The very tip of the aft section of the craft was bending up and down like a pair of diving flipers. I stepted out of the doorway and started to walk down my little walkway that runs alongside of my house (left and faceing East)to get a closer look at the craft, when the caft itself seemed to notice that I was looking at it, upon which the craft imediatly slid sideways on the horizontal (towards me ) without turning left or right and rotating up on its side where the complete shape of the craft changed. This startled me and I stopped walking towards the craft, because this black aura started to surrond the entire craft like it was angry that I was looking at it. The way the craft looked at this time and how it behaved just blew my mind. It was now a big black circle surronded by a thin white line with like a blended thick set of wings with small cocaves at the tips of those wings and the big black cicle in the center was blacker than any black I have ever seen and was emminating an extra black aura all around the circle aimed right at me. When I had stopped walking towards the craft it had stopped moving towards me. The craft rotated back down as it started to pass by me and once agian the entire shap of the craft changed, it was now like two offset spheres, but the spheres were not completly round because the bottom portion was curved and the rest was a circle. The craft still was giving off an aura and I went to the end of my walkway to the chian link fence so that I could continue to watch the craft for as long as possible as it headed North and went ot of sight. This sighting has been on my mind every day since it happened and has troubled me ever since. The biggest impresion the craft has left on me is that we are not alone on this planet,that there is another entity here with us. I have never written to any about anything in my whole life, but I do need to talk with someone about this because I don't fell like the people around me believe me and this sighting has effected me in a strange way. The one thing that I fogot to mention is that this craft was so close to me and it never made a SOUND! Gary Morse"],"Case Number":"14178","Object Shape":"Circle, Disc, Sphere, Triangle, Other","Date Submitted":"08/09/2008 08:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.260757,+-122.439441(14178)&iwloc=A&hl=en\"> mufon case (14178) map </A>","Summary":"Object jet black changing shape three different times with a black aura coming off object.","Latitude":"47.260757","City":"Tacoma","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14178.html.txt","/var/www/straped/mufon/org/14178.html"],"Disposition":"Insufficient Data"}