{"Weather Factors":"None","Country":"United States","Viewing Distance":"Unknown","Latitude":"43.100214","Region":"New York","City":"Niagara Falls","divs":["Sighting DetailsI was coming home from bowling on a league from my work.I was driving north on niagara falls blvd it was a dark overcast night.I was a few miles from my house which at the time was 1254 Pearce rd. Town of Wheatfield N.y.The traffic at the time was very light,i noticed a blur like light on the drivers side of my car in the sky.I thought because it was overcast that it may be the moon.However,it seemed kind of low in the sky.As i turned right onto a road i lost sight of the light.I drove a ways and turned left onto pearce rd. the street i lived on.I did not see anything in the sky untill i pulled up in front of my house and stopped in the middle of the street as suddenly the light appeared in the sky directly in front of my car.I was stunned for a second then i became curious and stepped out of my car.I walked in front of my car as the light was small as i had first seen it.I knew it was in a different position and wondered how it got to above my street.for some reason i went to my car and blinked my headlights on and off a few times.Then i returned to the front of my car.the object grew in diameter very quickly and i fell back against my car hood as it appearred to be comming directly toward me.The object stopped and i could see it was cylindrical with a definite edge around it.just inside the edge it had three tear drop shaped objects revolving \"counter clockwise\" within themselves,in a \"clockwise direction and they moved together in sequence as they spun around.The center of the object had what i would describe as a smokey center like fog or smoke rotating and moving around slowly.I could hear no sound or see anything else.I ran next door to my neighbors Mr. and Mrs. James Henderson and knocked on their door awaking them.they came to their door and i asked Jim if he had binocculars,he returned with a telescope which i tried to steady on the top of his car but i was shaking too much and could not see anything else.shortly after the object reverted back to the size it was when i first seen it.Then like a light being turned off it disappeared.When i settled down i called the niagara county sheriffs office and reported it.I also called nigara falls air force base and reported what i had seen.I'm not sure of the exact date and time but the report appeared in the Tonawanda News on the front page shortly after.Also about two weeks later i received a phone call from a man who said he worked at Speer Carbin in Lewiston N.y.he claimed to be an engineer and said he was a investigator for NICAP and asked if he could interview me.i agreed and he came to my residence.I drew the object for him and told him my story,he had me sign a paper stating that i had no objection to my account someday appearing in a book as he decribed it. Thats all i have to offer,i hope there is some information that you find helpful. Sincerely Ronald Waliszewski."],"Longitude":"-79.035009","Object Shape":"Circle","Sighting Duration":"00:06:00","Date of the Event":"11/01/1968 02:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/14179.html.txt","/var/www/straped/mufon/org/14179.html"],"Log Number":"US-12012008-0010","Case Number":"14179","map":"<A HREF = \"http://maps.google.com/maps?q=43.100214,+-79.035009(14179)&iwloc=A&hl=en\"> mufon case (14179) map </A>","Object Flight Path":"Stationary,Straight-line path","Date Submitted":"11/01/1968 02:00 UTC","Summary":"Returning home from work I spotted a blur like object in the sky,I pulled in front of my home and the object was in front of my car in the sky.","Object Features":"Other","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around November 1st 1968"],"Source":"MUFON","Disposition":"Unknown"}