{"Latitude":"36.122406","Source":"MUFON","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around June 30th 1964","This sighting has never been favorited.",""],"Country":"United States","Longitude":"-115.167326","Object Flight Path":"Stationary","Summary":"Disc landed in vacant lot beside my apartment and sat for some time.","Object Features":"Dome","Date Submitted":"06/30/1964 12:00 UTC","Viewing Distance":"20 Feet or Less","Case Number":"14174","files":["/var/www/straped/mufon/html2text/14174.html.txt","/var/www/straped/mufon/org/14174.html"],"Tags":"City","City":"Las Vegas","Region":"Nevada","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.122406,+-115.167326(14174)&iwloc=A&hl=en\"> mufon case (14174) map </A>","divs":["Sighting DetailsIn 1964 I was 7 mos pregnant. I got up from bed because I remembered I hadn't taken my water pill. I noticed it was bright outside as I stood before the kitchen sink and I presumed there was a full moon. Suddenly the room started shaking. I held onto the counter and it was over in seconds. Again, I presumed I had just experienced an earthquake. I started back to bed when I noticed noise, a humming sound I couldn't ignore or locate. I decided it was coming from outside and went to the front door and opened it. Suddenly there were bright lights in my eyes and I couldn't see. I had to shield my eyes. I presumed there had been an accident on the hill above but there were no sounds to match an accident. When I could see again, there in front of me sat a flying saucer. Red, white and green lights blinked off and on in rhythm and the humming continued. I watched it for some time, walked toward it but became fearful and went through other mechinations I won't go into. I've written this before but no one seems interested so I'm going to stop. I saw it when I was 20 and now I'm almost 65. There could have been missing time but I'm not sure. On the off chance I might be able to learn something new I would ask that you refer me to someone near Prescott, AZ who would be willing to hypnotize me to find out. I am not a good subject and I tried once but became so fearful before each session that I quit. The hypnotist said I had a \"mental block.\" Do you know hypnotists who specialize in subjects like me? The hypnotist I went to said he didn't believe in flying saucers and usually attributed such incidents to some kind of childhood trauma. Since he thought I was a nut case from square one I wasn't comfortable. I quit after the third session. All I want is a referral from someone I can trust."],"Log Number":"US-12012008-0006","Date of the Event":"06/30/1964 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Shape":"Disc"}