{"Latitude":"45.731076","Case Number":"14182","Source":"MUFON","Summary":"Star like object bouncing all over SSW sky. Lighting up nearby clouds.","Date of the Event":"11/29/2008 05:17 UTC","Object Flight Path":"Other","Disposition":"IFO","Weather Factors":"None","Object Features":"None","Region":"Minnesota","Viewing Distance":"Unknown","Object Shape":"Star-like","divs":["Sighting DetailsI woke up at 5:15 on Saturday, November 29 and looked out the bedroom windows that faced south. I saw a bright white light that was very large, it appeared to have a halo around it in the SSW sky at about 1000. The light dimmed and started to fall. I thought I observed the death of a star. However the object started bouncing all over the sky. It looked like a lure might appear at the end of a fishing pole if a person was jigging. The movements were too jerky and unpredicatable to be any sort of aircraft that I am familiar with. I don't live anywhere near an airport. I couldn't hear any sound as I was inside and the windows were closed. It had to be very high up in the sky. I thought I was seeing things so I closed my eyes again. I rubbed my eyes. I even got up and went to the bathroom and it was still there when I came back. I watched it for over 25 minutes. It did move westward but very slowly. It seemed as if it had some sort of headlight because as it was swinging and bouncing around, I could see that it lit up some wispy clouds that were in the sky. I could also see a red glow, like there might be a tail light, but I never did actually see a red light. I woke up two nights later, on Monday, Dec.1 at about the same time and saw the same \"bouncing star\". It didn't move as much this time."],"map":"<A HREF = \"http://maps.google.com/maps?q=45.731076,+-94.470003(14182)&iwloc=A&hl=en\"> mufon case (14182) map </A>","trends":["There have been no other sightings in Holdingford","This sighting has never been favorited."],"Log Number":"US-12012008-0013","Longitude":"-94.470003","Date Submitted":"11/29/2008 05:17 UTC","files":["/var/www/straped/mufon/html2text/14182.html.txt","/var/www/straped/mufon/org/14182.html"],"City":"Holdingford","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City"}