{"Longitude":"104.917445","City":"Phnom Penh","Sighting Duration":"Undisclosed","Region":"Phnom Penh","trends":["There have been no other sightings in Phnom Penh","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/14186.html.txt","/var/www/straped/mufon/more/14186_submitter_file1__IMG_3108.JPG","/var/www/straped/mufon/more/14186_submitter_file2__IMG_3116.JPG","/var/www/straped/mufon/org/14186.html"],"Case Number":"14186","Date of the Event":"05/23/2008 12:00 UTC","divs":["Sighting DetailsThese photos were fowarded to me by a colleague from work, who in turn received them from his nephew, who is an aid worker for World Vision in Thailand. The first photo shows a disc like object in the sky, rather large when in contrast to the clouds, which it seems to be illuminating. I would have thought nothing about the image, as there are various factors that could have been involved as to how it appeared, etc. But, as i looked closer, I noticed the darker pixels on the bottom of the supposed object, forming what could be a wedge. Also, the pixels are darker in the center, forming a small circle in the middle of the supposed object. I recall seeing that shape before, and surfed around You Tube until I found it. It has similar features to the NASA STS75 supposed UFO video. A few moments later, another shot was taken, with no object in the sky, but the clouds still a bit illuminated. I understand an airport is located nearby, which might be an explanation. There was also a report of an explosion of an unidentified aircraft over Viet Nam on or around May 27th, 2008, a few days after these photos were taken. As previously stated, I am a bit of a skeptic when it comes to UFO sightings over populous areas, especially in the vicinty of airports. But the shape of the object caught my attention, and I had to pass it along to the experts. Witnesses are: Ms. Heather Ellison (photographer) Ms. Samat Mark Helper (no phone #) Hope to hear from you soon, Jeff Woodward"],"Country":"Cambodia","Disposition":"Unresolved","Object Shape":"Disc","Object Flight Path":"Other","Summary":"Disc Shape appearing after illuminating clouds/wasn't visible with eye","Latitude":"11.558831","Date Submitted":"05/23/2008 12:00 UTC","Weather Factors":"Light","Viewing Distance":"Unknown","Log Number":"TH-12022008-0003","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=11.558831,+104.917445(14186)&iwloc=A&hl=en\"> mufon case (14186) map </A>","Tags":"City","Source":"MUFON"}