{"Summary":"Blinking, red,blue,green,white,purple,orange.","Object Features":"Unknown","Case Number":"14189","Source":"MUFON","Date Submitted":"11/26/2008 03:30 UTC","City":"Strawberry","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.967572,+-91.321243(14189)&iwloc=A&hl=en\"> mufon case (14189) map </A>","Region":"Arkansas","Country":"United States","Latitude":"35.967572","divs":["Sighting Details1. Where were you and what were you doing at the time?i was riding in the car on a paper route with my grandmother and sister we pulled over so i could releve myself 2. What made you first notice the object? i first seen it in the sky siting there blinking 3. What did you think the object was when you first noticed it? i thought its was a plane and i watched it for a while 4. Describe the object and its actions and motions.its seemed like it wasa disc but i couldn't tell it was blinking, red,blue,green,white,purple,ornge 5. Describe your feelings, reactions and actions, during and after sighting the object. well at first i was thinking it was cool and i alwaysed wanted to see one but thin after i sit there for awhile i started to feel depressed all of a sudden and i got in the car and we started back on the road i never took my eyes off it for about 13 min 6. How did you lose sight of the object?it lowered behind the trees Note: i have seen this same object three times sence then Nov 26,2008 3:30am - 3:45am Nov 30,2008 10:30pm - 10:55pm Dec 1,2008 11:00pm - 11:20pm Dec 1,2008 12:30pm - 12:40pm"],"Longitude":"-91.321243","trends":["There have been no other sightings in Strawberry","This sighting has never been favorited."],"Date of the Event":"11/26/2008 03:30 UTC","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Object Flight Path":"Hovering then path","Disposition":"Unresolved","Log Number":"US-12022008-0006","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14189.html.txt","/var/www/straped/mufon/org/14189.html"]}