{"Object Flight Path":"Straight-line path","Date of the Event":"12/01/2008 12:00 UTC","Disposition":"Insufficient Data","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=29.900174,+-81.310948(14180)&iwloc=A&hl=en\"> mufon case (14180) map </A>","Object Shape":"Triangle","Latitude":"29.900174","Date Submitted":"12/01/2008 12:00 UTC","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around December 1st 2008"],"Weather Factors":"Unknown","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/14180.html.txt","/var/www/straped/mufon/org/14180.html"],"Log Number":"US-12012008-0011","Country":"United States","City":"St Augustine","Source":"MUFON","Case Number":"14180","Longitude":"-81.310948","Summary":"Triangle flew low over the house, very distinct from airplanes that were also in the air...","Object Features":"Unknown","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsTook my kids out to show them Venus, Jupiter, and the Moons proximity to each other in the sky (I am am amateur astronomer). By the time we got out there they were too low on the horizon to view with the treeline where we were viewing from, but on the way out a triangle flew over top of us. It was characteristic of a plane at first aside from the fact that it was, first off, very low... i'd say 500-1000 ft. in the sky. It had 3 white lights projecting straight down making a perfect triangle. It was travelling at about the same speed I would expect to see a plane travelling at. No noise. It may have been making noise but we didn't hear it. The two lights that were where the wings would have been if it were a plane were solid white and the light at where the nose would have been was fading in and out fairly rapidly. It wasn't a flashing though... it was a slightly slower fade both in and out. Otherwise, than the fading the nose light was identical to the wing lights. It flew straight overhead and out of sight with no change in speed or direction. I wish I'd had a camera, but honestly I was so taken by it that even if I did I may not have taken a pic. Was pretty weird... deff not a plane. My lucky day I guess =)"],"Tags":"City"}