{"trends":["There have been 3 other sightings in Clio","There were no other sightings in Clio on or around August 28th 1987"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","City":"Clio","Latitude":"43.177526","Log Number":"","Date Submitted":"08/28/1987 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.177526,+-83.734127(1419)&iwloc=A&hl=en\"> mufon case (1419) map </A>","Disposition":"Unresolved","Object Shape":"Square, Rectagular","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/1419.html.txt","/var/www/straped/mufon/org/1419.html"],"Summary":"Rectangular UFO - CE1 in Clio, Michigan","divs":["Sighting DetailsTyped FI Report- ______, who is a custodian at _____, finished her shift at 3:30pm and went home. School was scheduled to open on Sept. 1, 1987, therefore thejanitorial crew was trying to get all the classroom floors sealed on Friday,August 28, 1987. At 6:30 pm, ____, suddenly decided that she would return tothe school to help the crew finish the floors. It was almost 7:00 pm when shereached he intersection of ____ and ____ Road. She noticed that the lights werestill off at a nearby restaurant. The restaurant had had a fire a few daysbefore. She arrived at the school at 7:00 pm. The janitorial crew finished theclassroom floors shortly before 9:00 pm. _____ said good-bye to everyone andheaded for her home on _____. As she drove near the restaurant she noted thelights were now on. This startled her because the fire had been caused by afaulty wire in the kitchen of the new restaurant. Something else drew herattention, causing her to look up. ____ had already slowed to make the turnonto _____ Road. She was very startled to see a dark object hovering over allfour lanes of the highway. She stated that the rectangular object had brightgreen lights on each of its corners. The object was much darker than the sky,which was covered with clouds. The green color of the lights reminded her oftraffic lights, as they blinked off and on. There are no traffic lights at theintersection, nor are there any street lights. ____ said that she was veryexcited but did not feel frightened or threatened by what she was seeing. Shedid however get a strange feeling that they knew she had seen them. She couldnot say why she felt that way. As she drove under the object, she decided notto make the left turn onto ____ road. She continued east on ____ Rd., droveunder the object, looked into the rearview mirror but could not see anything. She drove for approx. one quarter of a mile, turned left into a store parkinglot, looked back west but could not see the object. She then drove west on ___Rd. and turned north on ____ arriving at her home at 9:30 p.m. The early eveningaire was humid, therefore _____ was driving with the windows down. The carsair conditioner had broken prior to the sighting. She stated that she did nothear any sound as she approached and drove under the object. She did not callanyone because she did not want the people to think that she was \"nuts\". Afterreading the Flint Journal on Dec. 5th, she decided that she would give us acall, having saved our telephone number from the article. She finally called uson Dec. 16, 1987, making an appointment to see us after the holidays. She wasable to meet with us on Jan. 19, 1988. Present at the inteview were JudyKarns-trainee, new Co-Section Director for Genesee and Lapeer Counties, andGeorge and Shirley Coyne-Co-State Directors for Michigan. _____ seemed ratherembarrassed as she explained what she had seen. She did not try to embellishthe sighting. She merely stated what she had seen on August 28, 1987. Wechecked ____s background and found that she is a good employe, hard working,honest and well liked by all. Her family thought that she was teasing themabout her sighting until they noticed how very excited she was. The Clio PD wascontacted. The officer we spoke with was very helpful. He checked the logbooks one week prior to the August 28 sighting and one week after the sighting. No other sightings had been reported. The weather check revealed that theevening was totally cloudy, with a temp of 69 degrees. The wind was north at 13mph. The evening was humid due to the heavy rains during the day. It is ourconclusion that the witness did sight some unknown object. There are no trafficlights or street lights in this area of ____ Rd. There was nothing inside thecar that could have caused a reflection. The witness does wear glasses for hernearsighted vision, however she does not go anywhere without her glasses. Therewere no stars in the cloudy sky."],"Date of the Event":"08/28/1987 09:10 UTC","Country":"United States","Viewing Distance":"Unknown","Region":"Michigan","Case Number":"1419","Tags":"City","Sighting Duration":"00:05:00","Longitude":"-83.734127"}