{"Weather Factors":"Unknown","Latitude":"40.719293","Case Number":"14190","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 10th 1971"],"Object Features":"None","Viewing Distance":"21-100 Feet, 101-500 Feet","Log Number":"US-12022008-0007","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.719293,+-74.002133(14190)&iwloc=A&hl=en\"> mufon case (14190) map </A>","Object Shape":"Disc","Summary":"Glowing saucer hovering in sky in Queens NY late 1960's early 1970's.","City":"New York","Longitude":"-74.002133","Region":"New York","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/14190.html.txt","/var/www/straped/mufon/org/14190.html"],"Sighting Duration":"Undisclosed","Date Submitted":"07/10/1971 12:00 UTC","divs":["Sighting DetailsWhile visiting relatives during the summer in the late 1960's or early 1970's, several members of my family witnessed a large glowing sphere in the sky on multiple occasions. I was about 8-10 years old at the time. First, while walking her dog by the Clearview expressway in Bayside Queens, my cousin saw the disc hovering over the street lights and she came running home screaming. None of us believed her. It happened the next day to her as well. The third day, when we came home from picking up pizza for dinner and stepped out of the car, we saw for ourselves. The disc seemed very large, and was hovering over the street lights. It was disc-shaped and had an overall glow. along the outer rim, there were smaller lights that glowed slightly stronger. The disc hocered for a minute or so, then seemed to bounce very slowly from side to side; a very low bounce. Then it darted very quickly frim side ti side and then shot off at an extremely fast speed and was gone. The srtangest thing about this was that my aunt told us not to talk about it, adn I had forgotten about the incident until about 4-5 years ago. My cousin that first saw the object is the only one still alive, and I asked her about it. She remembers as I do, we just don't speak about it much. I remember being extremely frightened."],"Date of the Event":"07/10/1971 12:00 UTC","Tags":"City"}