{"Longitude":"-111.089601","Country":"United States","divs":["Sighting DetailsDriving south on Craycroft at 22nd street looked up and saw what my Uncle and I thought were balloons. Upon inspecting them for a few minutes decided that they were not balloons. stopped at a shell station to get out of truck and both my uncle Patrick and I observed a cluster of three \"balloons\" and one \"balloon\" off to one side about 50feet. these things were not going with the flow of the wind. Other people observed us looking at these objects and started to look as well. We then saw the solitary \"balloon\" join up with the others to become one. After joining together they had what I would call a new shape, and a white light appeared on the right side of the cluster then a reddish laser type light on the left side. As soon as that happened to whole object blinked out and was gone. During this event my friend Frank; who had reported a light on Friday the 28th of November, moving quickly across the sky, lives to the west of this event by maybe a mile, I called him to get on his roof and see if he could see it as well. He could not see it. Something seems to be getting started in Tucson. We will be on our roofs for the next couple of days to see if this is a trend, and we'll keep you posted."],"trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=34.051158,+-111.089601(14198)&iwloc=A&hl=en\"> mufon case (14198) map </A>","Case Number":"14198","Disposition":"Unknown","Source":"MUFON","Date of the Event":"12/02/2008 06:15 UTC","Object Flight Path":"Stationary","Log Number":"US-12032008-0002","Summary":"Thought at first it was black or dark colored balloons, joined up then blinked out.","Region":"Arizona","Object Features":"Other","files":["/var/www/straped/mufon/html2text/14198.html.txt","/var/www/straped/mufon/org/14198.html"],"Latitude":"34.051158","Object Shape":"Triangle, Other","Sighting Duration":"Undisclosed","Date Submitted":"12/02/2008 06:15 UTC","Tags":"City","City":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}