{"Region":"Pennsylvania","Object Features":"Unknown","Case Number":"14191","Country":"United States","Tags":"City","Date Submitted":"12/01/2008 08:00 UTC","files":["/var/www/straped/mufon/html2text/14191.html.txt","/var/www/straped/mufon/org/14191.html"],"Object Flight Path":"Path with directional change","Longitude":"-75.633485","Summary":"My fiance, Debra Robinson & I sighted a UFO.","Latitude":"41.471957","Object Shape":"Star-like","Source":"MUFON","Sighting Duration":"01:00:00","City":"Dickson City","divs":["sighting details my fiance debra robinson & i were travelling in her toyota corolla on the by-pass in olyphant, pennsylvania. we came to a red light at the intersection, when we noticed a bright light in the sky. it appeared below the moon, which was crescent-shaped at the time. at first we thought it was venus, but then it began moving. it moved towards us, then receded. it movet up and down, then left to right. we noticed what appeared to be a black helicopter hovering in the sky across the road. it appeared to be observing this object. we then traveled to our destination, wegman's supermarket in dickson city, pennsylvania. we drove across the same section of road that i sighted two diamond-shaped ufo's in 2002. when we reached our destination, at wegman's supermarket, we got out of the car, and i began taking pictures, 10 in all, of this object with my cell phone camera. the object appears as a small pinpoint of light on the camera's captured images, with the limited capabilities of this camera, even at full zoom range. the object remained visible for about an hour, moving towards us, then receeding, moving up and down, left to right, as it did at the stop-light intersection. the sky then began clouding, and it soon rained. the object was then not visible throught the dense cloud cover. my fiance and i then travelled to our next destination, borders bookstore, near the viewmont mall, in dickson city, pennsylvania. we remained there until 10:30 pm. on our return trip to our home in jessup, pennsylvania, we were travelling down route 6 towards the town of eynon when we noticed a strange light in the sky. at first we thought it was an airplane, but at times it remained motionless, then moved very slowly. the object remained visible to us until we reacehed the town of peckville, when we lost sight of it. these are my sixth and seventh ufo sighting experiences, four i've had with my fiance debra. six were in pennsylvania, one in florida. my fiance and i are searching for answers to these anpmalous ufo experiences, and the ufo phenomenon. sincerely, [cms\\tg\\pid]"],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.471957,+-75.633485(14191)&iwloc=A&hl=en\"> mufon case (14191) map </A>","Date of the Event":"12/01/2008 08:00 UTC","Weather Factors":"Unknown","trends":["There has been one other sighting in Dickson City","There were no other sightings in Dickson City on or around December 1st 2008"],"Log Number":"US-12022008-0008"}