{"map":"<A HREF = \"http://maps.google.com/maps?q=45.018969,+-93.448389(14203)&iwloc=A&hl=en\"> mufon case (14203) map </A>","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/14203.html.txt","/var/www/straped/mufon/more/14203_submitter_file1__ufo2007.jpg","/var/www/straped/mufon/more/14203_submitter_file2__ufo2002.jpg","/var/www/straped/mufon/more/14203_submitter_file3__ufo2003.jpg","/var/www/straped/mufon/more/14203_submitter_file4__ufo2004.jpg","/var/www/straped/mufon/more/14203_submitter_file5__ufo2023.jpg","/var/www/straped/mufon/org/14203.html"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"02/20/2008 09:28 UTC","Date of the Event":"02/20/2008 09:28 UTC","Latitude":"45.018969","Weather Factors":"Unknown","Summary":"Yellow shape-changer, disc in weird blue sky disc, then curtains! Then other things","Tags":"City","City":"Plymouth","Log Number":"US-12032008-0007","trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around February 20th 2008","This sighting has never been favorited.",""],"divs":["sighting detailsi got an olympus e-510 for a gift and started to take pictures of everything, and then forgot that i had taken some weird pictures. i just went through the memory card and found several things. any explanations are appreciated, because i'm not knowledgeable about the ufo thing, but i can't explain these either. the first pictures were taken at 9:52 - 9:54 on february 20, 2008. i was on my way to bed and saw lights and snapped through the upstairs bedroom window. these are yellow\\gold shape changing things. then i went downstairs and onto my deck and took the next three pictures - one of a disc (moon?) against a lighter sky, and then two pictures of curtains or garments or lace, except that i cannot find anything in my house that would have gotten in the way of the pictures. are these tracks of something? this happened the same night about 5 minutes after the above pictures were taken. june 28, 2008, i took 2 pictures of something, in the evening i believe, which must be the moon with light arcing over it. finally, i am sending three pictures of v-shaped contrails which i am sure are normal, but i can't figure out if the planes started at the same spot or ended at the same spot! these are morning pictures, taken from my deck."],"Region":"Minnesota","Sighting Duration":"Undisclosed","Object Shape":"Boomerang, Bullet, Missile, Chevron, Disc, Fireball, Sphere, Other, Unknown","Country":"United States","Longitude":"-93.448389","Disposition":"IFO","Source":"MUFON","Case Number":"14203"}