{"Tags":"City","Object Features":"Unknown","Date of the Event":"12/03/2008 05:55 UTC","Source":"MUFON","Country":"United States","Date Submitted":"12/03/2008 05:55 UTC","divs":["Sighting DetailsI was headed to work at 5:55 am and as I approached the corner of Rt. 413 and 202 to make a right, I noticed a car that was headed south in my path driving very slowly and turn right to a stop at the corner of Rt. 202 and 413. The driver had the window turned down and had his head sticking out the window, looking up. I followed his line of sight and discovered a craft about 3 to 4 inches in size hovering about 45 to 60 degrees above the treetops shaped like a crescent, but wider. It was changing colors from pink, green, blue and yellow from end to end and appeared to be \"steaming\" as if hot on this very cold morning. With the traffic behind me, I proceeded to complete a right turn and headed away from the craft, and minutes later noted that it was to my left above the trees as I headed south on Rt. 202 about 3 miles to Doylestown. I followed the road into State street and as I was driving noticed that the craft was now smaller about an inch in size and is now hovering between the buldings with a clear view of State street. I parked my vehicle as I always did next to the curb outside of the Bagel Barrel, stopped the car and ran in to get Pat Murphy, the owner, Craig, and another assistant at the shop to look at the sighting. All three gentlement concurred with me that it was not a plane, helicopter or star. We determined the position of the space station and this object was much brighter and larger by 3 times the size of the station. Pat indicated that it was definitely hovering and stated that it was changing colors as he was watching it. We ran in and out of the store to get coffee, (they were baking bagels) and ran out again two or three times to see where the object was. The men summoned two more men who were frequent patrons at the store and they watched the sighting together at the curb. I made the call on my cell to the state director, Mr. Ventre, who asked me to file this report. I drove away from the shop at about 6:35 am to get to work on time. I noted that the object at that time seemed to have disappeared since the sky was now brightening. Pat noted that there was another object further away near the first object."],"Longitude":"-75.123564","Object Shape":"Boomerang","Viewing Distance":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14204.html.txt","/var/www/straped/mufon/org/14204.html"],"Latitude":"40.311136","Case Number":"14204","Summary":"none","Weather Factors":"None","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around December 3rd 2008"],"Region":"Pennsylvania","Object Flight Path":"Hovering then path,Path then hovering","City":"Doylestown","map":"<A HREF = \"http://maps.google.com/maps?q=40.311136,+-75.123564(14204)&iwloc=A&hl=en\"> mufon case (14204) map </A>","Log Number":"US-12032008-0008","Sighting Duration":"Undisclosed"}