{"Disposition":"Unknown","Longitude":"-107.871389","files":["/var/www/straped/mufon/html2text/14214.html.txt","/var/www/straped/mufon/org/14214.html"],"Latitude":"48.355556","Case Number":"14214","Weather Factors":"Unknown","City":"Malta","Source":"MUFON","Tags":"City","Country":"United States","Date of the Event":"09/04/2002 12:00 UTC","Sighting Duration":"Undisclosed","Summary":"Diamond shaped light hovering motionless and silent for several minutes before streaking across sky.","trends":["There has been one other sighting in Malta","There were no other sightings in Malta on or around September 4th 2002"],"Log Number":"US-12042008-0002","Viewing Distance":"501 Feet - 1 Mile","Region":"Montana","Object Flight Path":"Stationary","Object Shape":"Diamond","Date Submitted":"09/04/2002 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.355556,+-107.871389(14214)&iwloc=A&hl=en\"> mufon case (14214) map </A>","Object Features":"Unknown","divs":["Sighting DetailsI climb trees for a living. A few years back I worked with a crew of 4 other men on the border of Canada and Montana clearing trees on Federal Property. We spent a few nights that summer in a little town called Malta, MT camping behind a little motel next to a bridge and a railroad track. One night after dinner on the campfire, Andrew, a co-worker and somebody you could trust your first born with, and I stayed up awhile chatting about work and various other things. I layed down on old picnic table bench staring up at the endless sky, while Andrew paced about doing the same, when suddenly he stopped talking and asked me if that was a flock of ducks. Baffled, I rose up and could see around the tree in the direction he was looking only to see a very bright white diamond shaped light, hovering about 2,000 feet. His comment about ducks seemed very strange to me when I first focused in on it, because it was very obviously not ducks. Then he said, \"I don't think that's man-made\". We watched this thing silently hover, motionless in the night sky. I could see the difference in distances between the stars, the ground, and this extremely bright light only lit itself, nothing below or around it lit up. We both commented again on how we have no idea what that is. And just like that*snaps fingers*, the thing beamed across the sky like a laser in a westernly direction. Gone in an instant flash. We stood there dumbfounded for a few minutes, mulled over a few possibilities, then oddly decided it was time for sleep. Later that night at about 4a.m. both of us woke up from very disturbing dreams in the camper in a cold sweat at the same exact time. We never did discuss what we had dreamt about, but it is almost like we never need to, because we already know. Andrew is 10 years older than me, he has a family, and was raised in the mormon church his entire life. I highly respected him as a co-worker and as a friend. And after that light disappeared streaking across the sky without a sound, it shook the inner core of his belief system. I have not spoken with him in a few years, but he would be willing to collaborate more to this story. The event was the first of several UFO sightings in my life, and I hope to have many more."]}