{"Viewing Distance":"Unknown","Country":"United States","Tags":"City","Region":"New Mexico","Object Shape":"Oval, Triangle","trends":["There have been 5 other sightings in Silver City","There were no other sightings in Silver City on or around September 6th 2008"],"Date Submitted":"09/06/2008 09:00 UTC","files":["/var/www/straped/mufon/html2text/14212.html.txt","/var/www/straped/mufon/org/14212.html"],"divs":["Sighting DetailsI had come home from work 8pm and had been feeding my horses at the barn, went into the house, as I came back out of the house to go back to the barn a very bright light towards the south caught my eye- it was about the height planes fly but was much bigger and was moving slowly, lights not at all like a plane... I ran in the house to get binoculars--- as i focused it looked triangular, large, lights going around it red-green or blue- yellow.. it went straight up, then down and gradually further and further away--- as it vanished into the distance it appeared more oval shaped with the lights pulsating around the outside- very bright... there was no noise at all. I felt frightened because it really was not like anything I had ever ever seen before, and it just did not seem normal. I tried to justify what it was and could only think it was a satelite being repositioned or something...I have no idea what a satelite looks like....but the way the lights rotated around it, and seemed to pulsate, it just seemed to be not man made. I watched it for about 20minutes as it got smaller and smaller heading west. about a month later another incident happened which I will submit another report about. I have since moved my bed away from my north facing windows, and get kinda frightened being outside at night. I am outside a lot since I have horses etc. there really is something unusual out there. maybe I live too close to area 54 (or whatever its called in Nevada...)... I had not really been a true believer in UFO's until these two happenings..."],"Summary":"Bright, pulsating lights circling around craft - red, blue, green, yellow","Source":"MUFON","Log Number":"US-12032008-0015","Object Flight Path":"Straight-line path,Path with directional change","City":"Silver City","map":"<A HREF = \"http://maps.google.com/maps?q=32.770075,+-108.280326(14212)&iwloc=A&hl=en\"> mufon case (14212) map </A>","Latitude":"32.770075","Longitude":"-108.280326","Sighting Duration":"00:20:00","Date of the Event":"09/06/2008 09:00 UTC","Case Number":"14212","Object Features":"Unknown","Disposition":"Unknown","Weather Factors":"None"}