{"divs":["Sighting DetailsIt was dust and I was looking out the sliding glass door at the sun set. It was almost dark when I looked to my left and saw that a craft had landed about 20 or so yards away. The occupents had come out and were scooping up dirt and putting it in containers. I must have looked afraid when I heard in my head as one of them looked up say to me, do not be afraid, we hare just collecting soil samples. I remember replying back, OK. The aliens looked very much like other peoples sightings, they were small, gray, had long arms and big dark tear drop shaped eyes. Then I remember taking a mental picture of my surroundings, almost like I was filming. I first looked to my left and remember seeing the clock up above the stove in the kitchen and noticed the position of the hands. then looked at the sliding glass door and noticed it faced looking toward the west then at my right where my mother lay asleep on a chouch which also faced west. There was a table next to the couch that was on. Behind me was the front door which faced east. My father, brother and sister were not home. When I looked out the sliding glass door again the craft took off. I did not say anything to my family nor to anyone. A couple of years later I was watching a News cast about UFO sightings and remember thinking to my self. \"So that's what I saw when we were living at the Edgemere Apartments\". I still said nothing for over 40 years because I did not think I would be believed. Now that so many people have come forward I am hoping my story will be looked into further. But it is still vivid in my mind and know it to be an actuall sighting because I was only four years old at the time and know that at four years of age I did not know how to tell time nor direction until I was taught. My story can be varified. The street name and the apartments are still there."],"files":["/var/www/straped/mufon/html2text/14227.html.txt","/var/www/straped/mufon/org/14227.html"],"Sighting Duration":"00:10:00","Summary":"A sighting of a space craft and it's occupants.","Case Number":"14227","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Date Submitted":"08/15/1962 08:00 UTC","Object Shape":"Disc","Region":"Texas","Source":"MUFON","Longitude":"-106.485611","Disposition":"Unknown","City":"El Paso","Latitude":"31.76755","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.76755,+-106.485611(14227)&iwloc=A&hl=en\"> mufon case (14227) map </A>","Log Number":"US-12042008-0011","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around August 15th 1962"],"Country":"United States","Object Flight Path":"Stationary","Weather Factors":"Unknown","Date of the Event":"08/15/1962 08:00 UTC"}