{"Object Features":"None","Longitude":"-85.659276","Object Shape":"Triangle","Summary":"Triangle in sky hovered, moved overhead then disappeared from sight.","divs":["Sighting DetailsI was driving home on a residential street in a suburban neighborhood. My 16-year old daughter was in the car with me. She noticed a bright light in the sky ahead of us and asked if it was the North Star. I looked for a few moments, then told her that no star was that bright. I then racked my brain to see if any planets were visible this time of year. The light was approximately 250-300 feet above ground. As we neared closer, we could see that rather than one bright light, it was actually two white lights and two red lights that were blinking intermittently. I said to her, \"Must be an airplane.\" As we neared even closer, I wondered out loud to her, \"But airplanes don't hover.\" The lights were remaining still in one spot directly in front of us. We could see, too, as we neared, that the lights were lower than first appeared, or perhaps had moved closer to the ground. The lights were not moving at all, other than blinking. It seemed odd and also apparent to me, that at my snail pace of 30mph, I was actually \"catching up\" with whatever it was. I told my daughter that we would find out what it was in a few seconds, because we're going to pass right under it. The object was still hovering in one spot. What happened next is unimaginable and outlandish. We passed under the object, which took 2-3 seconds at my drive of 30mph. As we passed underneath, we could see that the object was triangular with round corners, the body was metallic, and corner of the triangle had a brightly colored light. One light was green. One light was red. I believe, but can't be positive, that the third light was white. Directly connecting the large corner lights were smaller red and white lights that blinked in a row. The front of the triangle (the longer side) had an amazing glow from it, as if from interior lights. We passed under in absolute shock. As we passed it, we both turned to each other and shouted. \"That was a UFO!\" My daughter said. I quickly pulled into a side street and turned my car around, in an attempt to catch back up to the object. By the time I had pulled in, backed up and turned around the object was almost gone from sight. It was now moving at a ridiculous speed away from us. I sped up, but within seconds the lights were completely gone from sight. Had my daughter not been in the car with me and witnessed what I had seen, I would have thought I had lost my mind."],"Source":"MUFON","Region":"Michigan","Country":"United States","Disposition":"Unknown","Date Submitted":"12/02/2008 12:00 UTC","City":"Grand Rapids","map":"<A HREF = \"http://maps.google.com/maps?q=42.97065,+-85.659276(14226)&iwloc=A&hl=en\"> mufon case (14226) map </A>","files":["/var/www/straped/mufon/html2text/14226.html.txt","/var/www/straped/mufon/more/14226_submitter_file1__UFOillustration.jpg","/var/www/straped/mufon/org/14226.html"],"Object Flight Path":"Stationary,Hovering then path","Log Number":"US-12042008-0010","Latitude":"42.97065","trends":["There have been 45 other sightings in Grand Rapids","There were no other sightings in Grand Rapids on or around December 2nd 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Date of the Event":"12/02/2008 12:00 UTC","Case Number":"14226","Tags":"City","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet"}