{"Object Shape":"Undisclosed","Date of the Event":"12/04/2008 05:00 UTC","Date Submitted":"12/04/2008 05:00 UTC","Object Features":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"36.858576","Summary":"Loud boom followed by two glowing lights under water half mile off shore","Case Number":"14222","files":["/var/www/straped/mufon/html2text/14222.html.txt","/var/www/straped/mufon/org/14222.html"],"Log Number":"US-12042008-0007","Longitude":"-75.976215","Weather Factors":"None","City":"Virginia Beach","map":"<A HREF = \"http://maps.google.com/maps?q=36.858576,+-75.976215(14222)&iwloc=A&hl=en\"> mufon case (14222) map </A>","Object Flight Path":"Undisclosed","Region":"Virginia","Country":"United States","divs":["sighting detailsi was sleeping with my window open, i heard a double boom and bright light which woke me up. sitting in bed i looked out on the ocean and saw two large glowing underwater lights about a half mile off shore. my bedroom is a ~140 ft above sea level. two bright blue-white glowing dots 100 yards\\meters apart and 75 yards\\meters appeared to be illuminating the surface from underwater. i did not see or hear anything in the sky. the large glowing dots underwater sat still for nearly 10 minutes and then headed due east at more than 100 knots (or more) off into the distance\\infinity. i only saw the two large glowing dots on the calm water. the dots looked like the illumination point was underwater? 5 minute later i saw two fishing boats crossing the same are and based on realitive size of boat to underwater illuminated dots. the surface was calm the object was deep enough to not disturb the water surface when moving. please e-mail me if other people saw it. no video but will put my video camera by the window if it happens again."],"Viewing Distance":"Unknown","Disposition":"Insufficient Data","Tags":"City","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around December 4th 2008"]}