{"files":["/var/www/straped/mufon/html2text/14234.html.txt","/var/www/straped/mufon/org/14234.html"],"Object Flight Path":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Object appears and disappears in less than a second, was not visible to naked eye.","Longitude":"-121.7827","Latitude":"36.25251","Tags":"City","Case Number":"14234","Object Features":"Unknown","Disposition":"IFO","City":"Big Sur","trends":["There have been 2 other sightings in Big Sur","There were no other sightings in Big Sur on or around August 11th 2008","This sighting has never been favorited.",""],"Region":"California","Country":"United States","Object Shape":"Bullet, Missile, Cigar, Cylinder","map":"<A HREF = \"http://maps.google.com/maps?q=36.25251,+-121.7827(14234)&iwloc=A&hl=en\"> mufon case (14234) map </A>","Log Number":"US-12052008-0004","Date Submitted":"08/11/2008 12:00 UTC","Date of the Event":"08/11/2008 12:00 UTC","divs":["sighting detailsi was using a digital camera w\\video feature to try to capture some of the beauty of the drive south on highway 101 through the big sur area. the sun was sparkling on the water, then trees and a speed limit sign obscured the view and i stopped recording. i did not see the object at the time, nor did my husband. months later, while reviewing the footage using quicktime, i noticed something odd. advancing 'frame' by 'frame', i saw a cylindrical object appear & disappear. i thought it was odd, and tried to move my finger as slowly as possible to see where\\when the object came into the frame & where\\when it exits. i don't have quicktime pro, so i can't edit the footage (terribly sorry). i tried to use imovie, to edit the footage but it advances past that frame. so, the best description i can provide is this weird cylindrical object appears & disappears. it's at approximately 21 seconds into the footage. my curiosity aroused, i found your site. i'm sure you have more sophisticated ways of analyzing the footage than me. i am including a 'grabbed' screenshot that shows the object."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}