{"Log Number":"US-12052008-0009","trends":["There have been 3 other sightings in Gold Canyon","There were no other sightings in Gold Canyon on or around November 17th 2008"],"Region":"Arizona","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.364814,+-111.443097(14239)&iwloc=A&hl=en\"> mufon case (14239) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"11/17/2008 09:20 UTC","Source":"MUFON","Summary":"Orange/Pink lights flashing on then off in succession in lines.","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"33.364814","Disposition":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14239.html.txt","/var/www/straped/mufon/org/14239.html"],"Object Shape":"Chevron, Triangle","Longitude":"-111.443097","Tags":"City","Viewing Distance":"Over One Mile","City":"Gold Canyon","divs":["sighting details at approx. 9:20pm i was heading out of doors from my residence to the basha's store to buy groceries when these odd lights attracted my attention. they were over the superstition wilderness area, approx. 1 - 1.5 miles south east of the kings ranch rd. and alameda intersection, south-east of superstition mntn. these lights were seen approx. 1\\2 mile in altitude. they would flash on for about 3 seconds in duration very bright and somewhat large like a landing light from a commercial aircraft, very pinkish-orange in color, maybe even like a flare. not a directed beam but an orb in shape. in succession there was one, then another, then another about 1 second apart from one another and about 100 feet apart, up to 4 or 5 at a time. as the third or fourth one would illuminate the first would turn off, then the next and so on, in a line formation from my point of view. no sound of a jet was heard from my vacinity in the neighborhood. only distant traffic and barking dogs, no planes or helicopters were heard by me, as well as the sound of fireworks not evident. no other flashing or steady aircraft marker lights were observed. i observed this for about for about 20 minutes in the area then it just stopped. it might have been occurring longer but i was indoors and only noticed it when i came outside at 9:20pm. the color and intensity of the light is what caught my attention. i have witnessed these same colored lights previously traversing up and down the south side of superstition mntn in the past, an event lasting for at least 45 minutes one night in winter\\spring of 2007 and very odd, though a singular light, not mulitple. i witnessed this particular event with an avid, somewhat gabby self proclaimed ufo reporter by the name of taylor, drives a forest green jeep cherokee last name unknown, from the a.j. laundromat parking lot. this also occured at approx the same time as this observation referred above."],"Case Number":"14239","Date of the Event":"11/17/2008 09:20 UTC"}