{"Summary":"Two flying object side by side with one blinking light each.","files":["/var/www/straped/mufon/html2text/14233.html.txt","/var/www/straped/mufon/org/14233.html"],"Longitude":"-73.827203","Disposition":"IFO","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"14233","Tags":"City","Viewing Distance":"Unknown","City":"New York","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.705695,+-73.827203(14233)&iwloc=A&hl=en\"> mufon case (14233) map </A>","Date Submitted":"12/05/2008 05:30 UTC","Log Number":"US-12052008-0003","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWe were in Kew Garden, Queens NY at around 5:30ish at a stop light when my boyfriend told me to look up and mind you i was on the phone so i stop talking and i said wait i'm looking at something. I could not believe my eyes because these two object were right next to each other floating. So, my thought automatically realized that it was not a plane nor a helicopter because it would of continue moving forward and if it would been a plane they have distance between each other. These two object were just floating in the sky side by side or almost kinda like facing each other blinking there lights. Like when you are in your car and you want to signal someone with your headlights. It went on and off. First one object signal with it's light and it was only ONE light very bright almost like a star but bright and the other object flash it's light back like if they were talking to each other. I just could not believe my eyes because the object were steady floating and just blinking their lights back and forth like about 4 times and all of sudden one disappeared. I was just stunned by it and speechless...but i still continue my conversation but said nothing. My boyfriend and I just looked at each other. The other object just stayed there floating without blinking it's light. When the light turned green and we started moving the other object disappeared too. I hope you can understand my description."],"Date of the Event":"12/05/2008 05:30 UTC","Latitude":"40.705695","Country":"United States","Weather Factors":"Unknown","Object Shape":"Star-like","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around December 5th 2008"]}