{"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.334684,+-81.652461(14243)&iwloc=A&hl=en\"> mufon case (14243) map </A>","Object Features":"Undisclosed","Object Shape":"Other","Country":"United States","Case Number":"14243","Object Flight Path":"Undisclosed","Tags":"City","Summary":"Bright light moved across sky, stopped, reversed quickly, accelerated back to original position, then exploded.","files":["/var/www/straped/mufon/html2text/14243.html.txt","/var/www/straped/mufon/org/14243.html"],"Source":"MUFON","Weather Factors":"Unknown","City":"Jacksonville","Log Number":"US-12052008-0013","Date Submitted":"07/15/1960 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"30.334684","Viewing Distance":"Unknown","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around July 15th 1960"],"Disposition":"Insufficient Data","Date of the Event":"07/15/1960 12:00 UTC","Longitude":"-81.652461","divs":["Sighting DetailsMy friend and I were tent camping in my backyard. We noticed a solid white light moving from north to south. At first we thought it was a high flying airplane but thought it strange that it had no visible position lights and there was no sound. We watched the object for approximately thirty seconds as it smoothly tracked across the sky, then it abruptly stopped. It stayed motionless for about five seconds then reversed itself at tremendous speed,covering about one quarter of its previous distance in about one second. It abruptly stopped again, remaining motionless for about three seconds. It then accelerated back to its original position in no more than a second and stopped. After approximately two seconds it exploded in a bright flash. Pieces of flaming debris could be seen radiating outward from the explosion. There was absolutely NO SOUND associated with the incident. My estimate of the time and date is easily a year off of the exact date. I could have been between 12 and 14 years old. I'm thinking I was probably around 13. I don't recall telling anyone of the incident. In later life I became a private pilot. As I reflect back on the incident and apply my knowledge of aviation, I realize that there was no way to judge the altitude or speed of the object. I do estimate however that the object was several miles high as evidenced by the lack of any sound during the explosion. Applying my limited knowledge to the incident today I can imagine that the object could have traveled at thousands of miles per hour when it made its abrupt maneuvers."]}