{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.500073,+-110.921215(14241)&iwloc=A&hl=en\"> mufon case (14241) map </A>","Longitude":"-110.921215","City":"Catalina","Object Shape":"Square, Rectagular","Date of the Event":"12/04/2008 06:59 UTC","Object Features":"Undisclosed","Disposition":"Unknown","trends":["There have been no other sightings in Catalina","This sighting has never been favorited."],"Summary":"Spotted brownish, multi-interconnected boxy shaped vehicle(s) in the night sky.","Latitude":"32.500073","Case Number":"14241","Country":"United States","Region":"Arizona","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/14241.html.txt","/var/www/straped/mufon/more/14241_submitter_file1__DSC_1567b.JPG","/var/www/straped/mufon/more/14241_submitter_file2__DSC_1568b.JPG","/var/www/straped/mufon/org/14241.html"],"Log Number":"US-12052008-0011","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI heard the sheriff's airplane overhead, and went out to see what they were flying around. They were circling Catalina, Arizona in a wide clockwise pattern, and had just passed my place heading west, then to the north when I spotted a large object to the west high in the clear sky, at roughly a 30-degree angle from me. It was moving northward fast, silently, and at a constant speed, having the behavior of an orbiting satellite, in this case it would have been a polar orbit. At first I concurred it was a satellite, then realized I should be seeing a dot of light moving through space, and not a large, dark brown colored object. I concurred that if it was in earth orbit this time of night, it had to be huge to be reflecting sunlight. If it was not in orbit, it was creating its own light(ing) in the night sky. I rushed inside to get my Nikon D-80 camera, which already had the Nikkor 70 to 300mm VR zoom (Vibration Reduction) lens on it, removed the lens cover, and double checked to make sure the camera was on its most sensitive setting (when in the most sensitive setting, it can see infrared too). Returning outside, the object was now far north-northwest of here, and the sheriff's airplane was now heading in that direction too (speculating, perhaps they observed it too, and were giving chase). I took three free-handed pictures, two of which I'm sending to you. The lights are clearly not of an airplane, aircraft and law enforcement aircraft marker lights are different. Also I was only able to see the lights from it, I could no longer see the actual vehicle, as I did before. In each picture you will see to the bottom right of the brightest light group, other lights too that I didn't notice until I had these images on my computer screen. One a gray-red-brown, the other different shades of blue with white. Also note their angle change between the two pictures. Even though I had Vibration Reduction enabled on my lens, please allow for camera shake, due to the shutter being open about a second. My camera was set up to where it would not take a picture unless it was focused on something. After a friend with a doctorate in physics looked at the emailed pictures, he was convinced I took pictures of a triangular shaped type of UFO that's been spotted around the world lately. What I initially saw was not triangular shaped, but appeared boxy, like a small collection of large, interconnected boxes. They were too far away to see exact details though, but obviously much further away than the sheriff's airplane. I don't know what to tell you, other than what I observed."],"Tags":"City","Source":"MUFON","Date Submitted":"12/04/2008 06:59 UTC","Weather Factors":"Unknown"}