{"Object Flight Path":"Path with directional change","trends":["There have been 34 other sightings in Medford","There was one other sighting in Medford on or around December 5th 2008"],"Log Number":"US-12052008-0018","Viewing Distance":"Unknown","Latitude":"42.332615","Weather Factors":"Unknown","Case Number":"14250","Date Submitted":"12/05/2008 03:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy family went to Medford because my husband had an appointment at the employment department and we were going to pick up a few groceries when he was done. We had just had a sighting earlier in the day so I brought my video camera along this time. We were parked on Oakdale, the cross street was W. 6th, We were playing a memory story game and watching the sky to see if we could see anything. About 20 minutes of waiting my youngest daughter spotted 2 bright spheres to the north of us. They were about 25-30 degrees up in the sky. I tried to get a photo of them and was not able to find them with the camera, so I grabbed the video camera and sighted in one of them, it was moving to the north and getting smaller, staying about the same spot just getting smaller. I went to sight in the other one and couldn't find it where it was first sighted as it had moved to the west south west. There were two people that stopped to see what we were looking at and getting video of so I showed them, one just came out of the employment department and was getting into his vehicle and came over and the other was walking past us and he stopped to look. Most people just kept driving by as they were trying to see what we were looking at. The second object moved to the west and then started moving to the south. I did not have my tripod with me so the video is really shaky, so I tried to keep from zooming in all the way to help with the shake. We left before the second object was out of sight, I tried to locate it as we were driving away and could not find it."],"Longitude":"-122.868145","Tags":"City","Summary":"2 bright spheres over Medford, Oregon.","City":"Medford","Region":"Oregon","Country":"United States","Source":"MUFON","Object Shape":"Sphere, Star-like","Date of the Event":"12/05/2008 03:15 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14250.html.txt","/var/www/straped/mufon/org/14250.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.332615,+-122.868145(14250)&iwloc=A&hl=en\"> mufon case (14250) map </A>","Disposition":"Unknown"}