{"Case Number":"14257","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14257.html.txt","/var/www/straped/mufon/more/14257_submitter_file1__UFO_0001.jpg","/var/www/straped/mufon/more/14257_submitter_file2__UFO_0005.jpg","/var/www/straped/mufon/more/14257_submitter_file3__UFO_0006.JPG","/var/www/straped/mufon/org/14257.html"],"Longitude":"-85.3069","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12062008-0007","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=35.05408,+-85.3069(14257)&iwloc=A&hl=en\"> mufon case (14257) map </A>","Object Features":"None","Latitude":"35.05408","Weather Factors":"Unknown","Object Shape":"Unknown","Source":"MUFON","Summary":"3 bright lights, 1 dimmer on northern edge, strung out horizontal to a ridge line.","Region":"Tennessee","City":"Chattanooga","Date of the Event":"12/05/2008 12:05 UTC","Tags":"City","Country":"United States","trends":["There have been 18 other sightings in Chattanooga","There were no other sightings in Chattanooga on or around December 5th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path","Date Submitted":"12/05/2008 12:05 UTC","divs":["Sighting DetailsI was getting things ready in my car to begin my shift of work, when I noticed some unusual bright lights in the sky to my east. I watched them for about 20 minutes until they suddenly went straight up at an extremely high rate of speed and disappeared. The lights remained in an almost level plane until they were gone from view. I have lived in this location for 4 years and I am very familiar with the surrounding terrain and I have never seen these lights before. The light consisted of two very bright, one on either end, a somewhat dimmer one in the middle and a very dim one on the northern end of the string. I could make out no definite shape, nor could I hear any sounds. I have seen aircraft on numerous occasions fly across this ridge, but never like this. If this was a solid object it would have been very large, at least two hundred yards from north to south. I did obtain video for a few minutes until the battery quit on my recorder."]}