{"Country":"United States","Tags":"City","Latitude":"46.220416","Date of the Event":"12/05/2008 08:55 UTC","Weather Factors":"None","Longitude":"-119.131324","files":["/var/www/straped/mufon/html2text/14254.html.txt","/var/www/straped/mufon/org/14254.html"],"trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around December 5th 2008"],"Sighting Duration":"Undisclosed","Case Number":"14254","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=46.220416,+-119.131324(14254)&iwloc=A&hl=en\"> mufon case (14254) map </A>","Date Submitted":"12/05/2008 08:55 UTC","Region":"Washington","Summary":"Saw two lights move across local sky; apparently disintegrate; one loud explosion heard.","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"Unknown","City":"Kennewick","divs":["Sighting DetailsMy wife and I were taking a walk around the neighborhood at around 9 PM Friday night, Dec 5, 2008. We were standing at the corner of Ely and Imnaha Avenues in Kennewick, Washington, when we saw two lighted objects in sky directly overhead, perhaps 1000 feet altitude; rather saw 2 objects of which only a bright white light on each was distinctly visible and possibly a blinking red light that was obscured by the brighter white light on each. I estimate 1000 feet altitude because of the appearance of the 'headlamps' seemed like aircraft on a landing pattern, or as close as an aircraft approaching a runway. The two lights moved slowly and uniformly, seemed to be together as if they were fore and aft lights of a blimp, but then their relative positions changed such as to suggest two separate objects. SILENT RUNNING: No sound detected whatsover during the transit of the objects. Objects flew from west to east, turned south, one object halted and remained stationary while the other continued south very slowly. The southerly object suddenly appeared to break apart into smaller separate and weaker lights which quickly dimmed and extinguished. The remaining object began to move northerly. At that time, another passerby encountered us, and we discussed what we'd each been seeing. Then, the remaining object also broke apart similarly to the first object, and after several seconds a distinctly loud report was heard both by myself, my wife and the passerby. I looked at my cell phone a couple times during this event to gage the time: We had been watching the lights for several minutes when I first checked the time (at 8:55 PM), and after the loud explosion at about 9:05 PM."],"Source":"MUFON","Log Number":"US-12062008-0004","Object Shape":"Other"}