{"Latitude":"40.719623","Tags":"City","Object Shape":"Disc","Weather Factors":"Unknown","Case Number":"14259","Source":"MUFON","Sighting Duration":"00:02:00","Disposition":"Insufficient Data","City":"New York","Object Flight Path":"Undisclosed","Log Number":"US-12062008-0009","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.719623,+-74.004593(14259)&iwloc=A&hl=en\"> mufon case (14259) map </A>","divs":["Sighting DetailsI was on an annual trip to New York with university, me and a friend decided to walk from the Meat packing district, into the Financial district to shoot some images, we saw a man feeding birds and began to shoot as many images as we could without ever really checking the view finder. I got back and scanned my images, I was amazed to find this image with an unusual disc like shape in the top left corner. I developed the film and scanned it whilst I was in America and owned a 40mb tiff file, but, when we went through customs at JFK I got stopped because of the amount of expensive photography equipment in my bag, they thought I bought most of it in NY. They asked too look at my external hard drive and I gave them permission. They came back to me about an hour later and seized all of my equipment, telling me my images were 'suspicious' A few days later and I get a letter telling me my photographic equipment is on its way home but none of my work from the trip is. The image i did manage to get was taken using a friends phone, I obviously had to bring it into photoshop in an attempt to bring out as much detail as I could, to do this i had to turn the image black and white to bump the contrast and sharpen the detail. I hope you can help me out with this one, I've been though a lot just to get this image on here."],"trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around November 19th 2008","This sighting has never been favorited.",""],"Date Submitted":"11/19/2008 04:15 UTC","files":["/var/www/straped/mufon/html2text/14259.html.txt","/var/www/straped/mufon/more/14259_submitter_file1__image023.jpg","/var/www/straped/mufon/org/14259.html"],"Object Features":"Undisclosed","Longitude":"-74.004593","Country":"United States","Date of the Event":"11/19/2008 04:15 UTC","Summary":"I was photographing a man feeding birds, I didnt notice the object at the time.","Region":"New York"}