{"City":"Chrisney","map":"<A HREF = \"http://maps.google.com/maps?q=38.014773,+-87.036386(14251)&iwloc=A&hl=en\"> mufon case (14251) map </A>","Region":"Indiana","Log Number":"US-12062008-0001","trends":["There have been no other sightings in Chrisney","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City","Country":"United States","Case Number":"14251","files":["/var/www/straped/mufon/html2text/14251.html.txt","/var/www/straped/mufon/org/14251.html"],"Disposition":"Unknown","Date of the Event":"11/13/2008 06:15 UTC","Sighting Duration":"00:15:00","Object Features":"Unknown","divs":["sighting details my girlfriend and i were coming home from the store when we saw a red\\orange like light in the sky. we had turned off 231 onto 70 between newtonville and chrisney when we spotted it, we decided to follow it and see what it was. as we drew closer to the light we noticed that it was not moving. we drove about two miles and it was right overhead in a clear starry sky.then as we watched it we noticed another one that looked like a real bright star. then the one above us just faded out.so we pulled over on a side road to watch the other one.we sat still watching it for about a minute and watched as it too faded out. we sat for a couple more minutes to see if they would reapear then we went home.about two weeks before that one came over my house about two miles west of this location. it was moving south, stopped for a few seconds and then it went east. and faded out.about a year and a half my son and i had been seeing these kind of lights aproximitly three miles west of these locations. all i can really say about what i felt like at the time is i was excited to see it for i have seen these lights several times and i always make it a point to look for them when i am out in the yard or out driving around. my son and i always ask each other if we have seen anymore of the lights when we see ot talk to each other. i was glad my girlfriend was with me so that i had a witness that i had seen them. my son and i had been telling her about them."],"Latitude":"38.014773","Source":"MUFON","Object Shape":"Star-like","Date Submitted":"11/13/2008 06:15 UTC","Summary":"They looked like stars only red orande color. There were two. Neither moved in any way. As we came closer to them they seemed to almost fade away then just vanished. This is not the only time we have seen them.","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Longitude":"-87.036386"}