{"files":["/var/www/straped/mufon/html2text/14263.html.txt","/var/www/straped/mufon/org/14263.html"],"Region":"Pennsylvania","Weather Factors":"Light","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.524151,+-78.387196(14263)&iwloc=A&hl=en\"> mufon case (14263) map </A>","trends":["There have been 20 other sightings in Altoona","There was one other sighting in Altoona on or around June 23rd 2008"],"Sighting Duration":"Undisclosed","Case Number":"14263","Source":"MUFON","Log Number":"US-12062008-0013","City":"Altoona","Disposition":"Hoax","Date Submitted":"06/23/2008 02:10 UTC","Object Shape":"Unknown","Date of the Event":"06/23/2008 02:10 UTC","Tags":"City","Viewing Distance":"21-100 Feet, 101-500 Feet","Summary":"Two helicopters were chasing after a very fast blurred object..","divs":["Sighting DetailsI was then living at my house in Lakemont. We were actually moving our possesions into the moving van when I went inside to get a drink. I walked outside to my porch, and looked into the sky to see what all the comotion was about. I saw a very fast moving, shining object. Then, immediately thereafter two black(I assumed military)helicopters flew across the sky. I could not get my camera, or camcorder becuase it was already packed away.I thought the object was a spaceship when I first saw it, because I believe in UFO`s and Aliens. It appeared to be somehow dragging along the sky, it was going well over 75 m.p.h . I honestly was not surprised, except for the helicopters.I lost sight of he object after it flew out of sight. It was daytime. It was bigger than the helicopters. My radio went kind of staticy when it went by changes stations,dimmed,and paused,and became louder. Immediately after it went by my dogs freaked out. I became very dizzy (AFTER, BUT BEFORE THE HELICOPTERS)and my vision blackened. I almost fell over but caught myself. My vision and dizzy symptons still occur, when I get up to fast."],"Longitude":"-78.387196","Latitude":"40.524151","Object Features":"Unknown","Object Flight Path":"Path with directional change"}