{"Source":"MUFON","Case Number":"14261","Log Number":"US-12062008-0011","map":"<A HREF = \"http://maps.google.com/maps?q=38.400009,+-77.729553(14261)&iwloc=A&hl=en\"> mufon case (14261) map </A>","trends":["There have been no other sightings in Richardsville","This sighting has never been favorited."],"Tags":"City","Longitude":"-77.729553","Weather Factors":"Unknown","Latitude":"38.400009","Summary":"Several types of UFO's seen over Richardsville and Summerduck, Virginia nightly.","Region":"Virginia","Date of the Event":"11/30/2008 12:00 UTC","Object Features":"Undisclosed","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/14261.html.txt","/var/www/straped/mufon/org/14261.html"],"Country":"United States","Viewing Distance":"21-100 Feet","divs":["sighting detailshello mufon, the richardsville and summerduck virginia area is a current hotspot flap of ufo activity over the past several months. i go out and view the stuff several nights every week. i have seen a luminace mothership, the length of a football field with red lights down it's side that emits its own white light from its skin. there is a red and blue ufo that repeatedly follows the same flight pattern down the rapihannock and rapidan rivers over and over through the night; and dozens of what i call 10 - 15 feet long dragfly ufo crafts that have search beams and fly directly over the woods or open fields. i have seen two of them fairly close. one almost flew directly above me while traveling about 50 feet above the ground. they know my truck and one of them even followed me home one night. the dragonfly crafts show up in numbers every night. the dragonfly craft turn on and off a yellowish\\white search beam while traveling through the woods and fields of the area. another night, one was about to fly directly over me and saw me and shut off its light beam and disappeared completely from view. i have seen them just sit motionless in the sky. i have seen the dragonfly crafts send beams of blue light from one to another while still in the sky ...a possible means of recharging their electrical systems? all of the above crafts are silent. i was out in my truck from 7pm to 11pm last night and 4 airplanes flew over the sky during that time and they had conventional flashing lights and made the normal airplane sound. these other crafts are silent do not make sounds like helicopters and airplanes do and their flashing lights are much different as well. sincerely, dave"],"Object Shape":"Cigar","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","City":"Richardsville","Date Submitted":"11/30/2008 12:00 UTC"}