{"Source":"MUFON","Latitude":"34.00679","Country":"United States","Date Submitted":"07/31/1980 09:00 UTC","Region":"South Carolina","Log Number":"US-12062008-0014","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around July 31st 1980"],"Weather Factors":"None","Object Features":"None","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"A friend and I sighted two glowing irridescent green balls flying side by side above street on which we were riding.","divs":["Sighting Details around late august of 1980 at approximately 9 p.m. a friend of mine and i had just left my cousin's apartment and i had just pulled my car onto forest drive, the boulevard by her building, heading east, located a couple of miles from downtown columbia, s.c., when my friend directed my attention into the early evening late summer sky just after dark above as seen through the automobile's windshield. flying some hundreds of feet above our vehicle (and flying directly above and in line with the street on which we were driving) were two very luminous bright green spheres traveling in perfect unison one with the other. they flew at exactly the same height and speed throughout the sighting and never varied. these orbs were a very beautiful shade of green and appeared almost irridescent and translucent as they softly glowed in the night sky. they weren't huge but their size would be difficult to calculate, appearing somewhat akin in size to a full moon well above the horizon, since their altitude was unknown (they could have been larger than they appeared if their height was thousands of feet rather than hundreds - which they may have been). they left no trail behind them. the speed of the craft was considerably faster than the 35 or 40 mph we were cruising and so we were able to view the ufos for only about maybe 30 seconds to a minute or so. we kept them continuously in sight for the entire viewing and they stayed in perfect formation one with the other. we watched them until they disappeared over the treetops in the distance looking down the road ahead of us. it was somehow exhilarating to observe these beautiful forms which we could instantly tell were not manmade. Several years later (late 1980's in the fall) I was with the same cousin whom I had visited the night of the first sighting. We were across the congaree river in cayce, s.c., maybe five miles from the location of the first sighting and were outside my vehicle standing by the river and facing across it toward the city of columbia. we had just left the home of one of my cousin's friends and decided to take a look at the city from the riverbank. this was probably around 11-11:30 p.m. in the evening. all of a sudden a single green orb, appearing identical in size, shape and color to the first pair sighted, suddenly streaked across the night sky heading from west to east (same approximate direction that the first ufos were travelling). it appeared to be flying at about the same altitude as those spotted during the first sighting. my cousin and i observed it for maybe 20 to 30 seconds when it disappeared beyond the distant horizon of trees and buildings probably a couple miles distant on the opposite side of the river. amazingly enough, several years after this second sighting incident, around 1997 or 1998 during the summer months, there was yet a third incident reported by the same friend involved in the first sighting. this time we were both staying at a beach house on folly beach near charleston, s.c. it was about 3 a.m. in the morning, he said, when he left his bedroom and walked out onto the deck to take a look at the ocean. it was a clear night (as were the nights of the other two sightings). i was sound asleep in an adjacent upstairs bedroom at the time. he said that suddenly another green orb (seemingly identical to the other ones sighted previously) came into view up in the sky directly overhead (altitude unknown)and proceeded approximately from north (toward charleston) to south, following the shoreline. he watched it until it disappeared beyond the buildings toward the center of folly beach. as previously, there was no sound emitted by the craft and no trail left behind. no alcohol or drugs was being used when any of these sightings occurred and all witnesses were sober at the time of the sightings."],"Object Flight Path":"Straight-line path","Longitude":"-81.029904","map":"<A HREF = \"http://maps.google.com/maps?q=34.00679,+-81.029904(14264)&iwloc=A&hl=en\"> mufon case (14264) map </A>","files":["/var/www/straped/mufon/html2text/14264.html.txt","/var/www/straped/mufon/org/14264.html"],"Date of the Event":"07/31/1980 09:00 UTC","Case Number":"14264","City":"Columbia"}