{"Date Submitted":"12/07/2008 01:00 UTC","Disposition":"Unknown","Longitude":"-97.14247","City":"Waco","Region":"Texas","divs":["Sighting DetailsMy 14 yr old son and I were driving home from a HS football game in Dallas. We were south bound on I-35 between West and Elmott when I noticed an odd light in the sky. It was almost due south according to the compass in my truck. It was about a hand width above the horizon. It was a spot of light that was irregular in shape and to the naked eye appeared to be changing both shape and color. It cycled through the pastel colors (light blue, light green, light yellow, light purple and light pink). I brought it to my son's attention to see if he could see the same thing. After watching it for a few miles he described it much as I did above. As we were passing through Elmott I estimated that it was directly above James Conally Airport. At one point I thought it might be a sheriff's chopper with a spotlight. I figured we would be passing it on our left as we travelled further south. We did not. It was either moving away from us or it was stationary and much further away than I had estimated. As we approached the north side of Waco I decided we could get a better look if I hopped on Loop 340 which circles Waco to the West and South. It also takes us out of the city lights. As we rounded the loop headed toward Robinson it became apparent that it was much further away than I had thought. It was however still to the south but it did seem slightly lower to the horizon (about two fingers at arms length). All the while it continued to cycle randomly through the pastels and seemed to continuosly change shape to the naked eye. It never appeared to be round or symetrical in any way. We turned off on FM3400 and followed it to the south until we reached Downsville road approx 4-5 miles from the loop. As it became apparent that we werent getting any closer I decided to pull over so we could get a better look. Standing still made no difference. It still changed shape and color. The sky was clear and full of stars and a half moon. Nothing else in the sky came close in appearance. I would say it was 2 to 4 times brighter than the next brightest star. We watched it for about 5 minutes. It never really appeared to move. It just twisted and turned and changed color. From time to time I thought I could see faint light beams radiating out from it but I couldn't be sure. We then decided to go home and get my small spotting scope out. Sure enough we still had a good view of it from our back yard. Again it appeared staionary from that vantage. Through the scope it looked somewhat different. it appeared to have a solid shape but irregular like a rough tear drop shape on a 45 degree slant. You could still see the color changes clearly but it was really tough to focus and hold it in frame. I decided to take some pictures so I got my Sony DSC-H1 and a tripod and took multiple pictures on multiple settings. I also took a couple of short MPG's which show the color changes very well. Most of the pictures are fuzzy but there are a few that are very interesting. They look stringy or like squiggles I assumed that was from the vibration from me pushing the shutter button. I had recalled seeing a few stills on the news from the Stephenville sightings earlier this year. I pulled them up on my computer to show my son. Actually it was a video on You Tube by David Caron. Both my son and I agree that they are a perfect match. Anyway, we quit watching it and came inside because it was getting cold. It was still in the same location doing its thing at about 2:30 a.m. Can you guys let me know if it is a known object? I don't see anything on the star chart that should be there."],"Object Features":"None","Log Number":"US-12072008-0004","Date of the Event":"12/07/2008 01:00 UTC","Weather Factors":"None","Object Shape":"Other","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Sighting Duration":"01:30:00","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14272.html.txt","/var/www/straped/mufon/more/14272_submitter_file1__winter08001.JPG","/var/www/straped/mufon/more/14272_submitter_file2__winter08003.JPG","/var/www/straped/mufon/org/14272.html"],"Summary":"Color and shape changing object in south sky (not moving).","Case Number":"14272","Latitude":"31.551643","Object Flight Path":"Stationary","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around December 7th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=31.551643,+-97.14247(14272)&iwloc=A&hl=en\"> mufon case (14272) map </A>"}