{"files":["/var/www/straped/mufon/html2text/14279.html.txt","/var/www/straped/mufon/org/14279.html"],"Object Flight Path":"Unknown","Region":"North Carolina","Summary":"Abduction between 2;10am and 6:am have been going thru this all my life every year","Date of the Event":"11/30/2008 02:10 UTC","City":"Kinston","Sighting Duration":"03:30:00","Object Features":"Unknown","Longitude":"-77.578085","Source":"MUFON","Weather Factors":"None","Latitude":"35.264744","Case Number":"14279","Date Submitted":"11/30/2008 02:10 UTC","Log Number":"US-12072008-0011","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=35.264744,+-77.578085(14279)&iwloc=A&hl=en\"> mufon case (14279) map </A>","divs":["Sighting DetailsI went to bed on Nov. 30th 2008 @ 2:10. Fell asleep and was woken by a bright light coming thru the window which woke me up but I couldn't move or speak, next thing I knew I was on a stretcher but ususally it is a hard table I'm that I am on. The Short Grey was there, which lets me know he wants to hurt me. Then the Tall Grey appears and dismises the Short one with a wave of his hand. He then rubs my forehead and lets me know I'm ok. They communicate with me Telepathy. I am scanned by a machine that looks like a upside down L, usually that is all they do, but this time the short one came in and gave me an injection in my inner Rt. upper arm!! It hurt really bad! Then I was taken to what I call the waiting room to go home, still on a stretcher. Then a Bright Redheaded Woman come in and takes my hand in hers (but she only has four claws instead of a hand like we have) and says \"come with me\" I get up and go with her. I'm already scared to death because of the injection and the fact that I'd never see a woman there. This Woman had Bright Red Long hair, with what appeared to be a crown on her head. She was white skin with very beautiful Dark Deep Deep Blue Slanted upward eyes.She has a small nose and a round mouth and actually talks like a human and her mouth moves! She is dressed in a Shimmering Silver Gown with a dark purple hooded robe over it. She has on a Dark Deep Blue diamond shaped stone that glows brillantly and bright. She had a very kind and trusting voice. I was amazed at this lady, I don't know if she was a queen or princess or what. I still partly afraid though cause I don't know what she wants with me. I saw no feet but her gown did drag the floor. She lead me to a room with children of all ages in it. From small to what I would consider to be teenagers. They all came running up to me as if they knew me and all looked like 2 people i know and myself. All of them!! They were trying to touch me and most did. Then we went into another room which had embroys and fetuses. There were hundreds so it seemed, in containers with clear liquid around them. they had tubes and machines coming from them, they also had something over there eyes cause they were in bright lights. They looke human but had no visible sex organs. Then she says \"come on\" and we leave. We walk down the hall to what appears to be a large picture window ina house. She tells me \"to look thru it\" & I did. What I saw I believe was the future. There was Bloody Wars in US and other countries just really graphic, and I was crying I don't want to see anymore and turned away. She yelled \"look!\" so I did, what I saw this time was death, how people were dying, some sickness some suicide others murdered. Some I knew, some I've seen before and some I don't know. I finally told her I'd seen enough and refused to look back in the window. She keep saying \"We're not through\" over and over again. I kept saying \"NO, No\"! Then I was back in my bed and for awhile I couldnot move and speak, but as soon as I could I asked my husband where did the bright light go and where did the greys and that woman go. He said he didn't see anything as usual. I got up at 6am, tired and drained of energy. When I went to put my clothes on I noticed Whelp marks on both sides of my abdomen, so my husband took pictures of them and a red area on my inner rt. arm. As the day went on the whelp on my abdomen got redder and looked like some kind of scratches! By night they were really red. Pictures were taken of all areas that day and at night I had one appear on each upper arm, pictures were taken of them also. I had nightmares off and on that night and more pics. were taken on the 12-1-2008. I had nightmares that night also. I have never seen that woman before or shown anything or walked on that craft!! Yes, I am scared to death but I know my life has to go on!! Just pray they don't come back!!"],"trends":["There have been 3 other sightings in Kinston","There were no other sightings in Kinston on or around November 30th 2008","This sighting has never been favorited.",""],"Object Shape":"Unknown","Country":"United States","Disposition":"Unknown","Tags":"City"}