{"City":"Stephenville","Longitude":"-98.192433","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14275.html.txt","/var/www/straped/mufon/org/14275.html"],"Source":"MUFON","Country":"United States","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around December 6th 2008"],"Tags":"City","Weather Factors":"Unknown","Disposition":"Unknown","Case Number":"14275","Object Flight Path":"Undisclosed","Log Number":"US-12072008-0007","Latitude":"32.222006","Date Submitted":"12/06/2008 12:00 UTC","Summary":"Bright light flashing colors near Stephenville, Texas.","Object Shape":"Star-like, Other","Sighting Duration":"Undisclosed","Region":"Texas","divs":["Sighting DetailsI live in Stephenville,Texas... I still believe that about 90% of reported cases of UFO sightings are either wishful thinking, mistaken stars sightings, planes or weater baloon sightings... HOWEVER... On this night, I heard someone outside talking about a star... So I went out to see what she was talking about. I observed a bright light in the southern sky that appeared to be spinning or changing colors. Flickering to brighter and then almost fade out entirely. There was not a pattern to the colors. It would mostly be a white or bright light and would appear to flicker and change colors and shape. I watched it for a long time, probably 45 minutes or so, but was too cold and went inside. I came back 10 minutes later, and it was GONE! I have seen MANY flickering stars in my life... BUT This was NOT a star, planet, plane or weather baloon. It is unidentifiably anything I've EVER seen. Chalk this up as an unknown... But I will be more open minded from now on! I will now WATCH for these things, and report back. Thanks, Starwatcher"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.222006,+-98.192433(14275)&iwloc=A&hl=en\"> mufon case (14275) map </A>","Object Features":"Undisclosed","Date of the Event":"12/06/2008 12:00 UTC"}