{"Sighting Duration":"03:00:00","Case Number":"14277","Object Flight Path":"Straight-line path","Country":"United States","Weather Factors":"None","divs":["Sighting DetailsI was house-sitting for a friend near Santa Fe, and when returning to the house one evening, I spotted a very bright, slow moving white light with multiple non-blinking red and green lights below the white light. The object was moving in a southwesterly direction (heading approx. 240 degrees). By the time I could get pulled over and get out my binoculars, the object was too far away to discern any particular shape. At first I thought it was a helicopter, but it was close enough that I would have heard it, and there was absolutely no sound. A helicopter passed to the north of this location at about twice the distance, and it could be heard quite clearly. After watching the object for about twenty minutes, I proceeded on to the house, and continued periodically watching the object for the next two hours. From this particular location, there is a good view between the nearby hills to the southwest, and the object seemed to be following the same course for the duration of the sighting. From what I could tell, it also maintained the same altitude throughout the viewing period. The view was eventually blocked by distant mountains. My reaction was, \"Wow - I'm a field inestigator, and I finally got to see one for myself!\" (Actually, it's not the first - just never one so close up)."],"files":["/var/www/straped/mufon/html2text/14277.html.txt","/var/www/straped/mufon/org/14277.html"],"Tags":"City","Date of the Event":"11/15/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.581736,+-105.88499(14277)&iwloc=A&hl=en\"> mufon case (14277) map </A>","Region":"New Mexico","Viewing Distance":"Over One Mile","Longitude":"-105.88499","Disposition":"IFO","Summary":"Very large, bright white light moving slowly across the sky.","Date Submitted":"11/15/2008 09:00 UTC","Source":"MUFON","City":"Santa Fe","Object Features":"Unknown","Latitude":"35.581736","Log Number":"US-12072008-0009","trends":["There have been 20 other sightings in Santa Fe","There were no other sightings in Santa Fe on or around November 15th 2008"],"Object Shape":"Sphere"}