{"Country":"United States","Date Submitted":"05/05/1988 11:00 UTC","Object Flight Path":"Unknown","Viewing Distance":"Over One Mile","Case Number":"1427","Summary":"Rotating Lights seen near Gaines, Michigan","Sighting Duration":"00:30:00","Longitude":"-83.820584","divs":["Sighting DetailsWitness 1s narrative: At appox. 11:00 pm on May 5th, as I was preparing for bedmy mother asked me to look at some lights in the sky. I first viewed theobjects thru a small bedroom window. To get a better look we both stepped outon the porch facing west. At first I thought they were being generated from ahigh-power searchlight, but there was no visible beam to support the lights. There were three lights moving in a counter-clockwise direction. They seemed tobe playing a game of tag-the 3 followed each other until they seemed to blendinto one much brighter light. The meeting lasted about one second then thegame would continue. The sky was clear that night - stars were veryvisible...but the 3 objects seemed to be contained within the parameter of thecloud (the cloud was a part of the sky that looked lighter). They never leftthe outline of the cloud, their movement was very rapid but with no realconsistency of speed. The distance the 3 kept between themselves varied. Aplane (not sure the size of the plane) approached from the west to the east. Incomparison to the objects, the plane was much smaller and moved much lower - itflew way beneath the lights. By 11:30 on of the lights was no longer visibleand the remaining two were dimmer and slower - they still chased each other butdidnt meet together. I got the feeling they were searching for the 3rd light. The objects didnt seem to affect anything on the ground; there was no unusualsound, smell, or feeling. I stopped watching at 11:30."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/1427.html.txt","/var/www/straped/mufon/org/1427.html"],"Log Number":"","Object Features":"Undisclosed","Latitude":"42.961851","Date of the Event":"05/05/1988 11:00 UTC","Region":"Michigan","Source":"MUFON","trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around May 5th 1988"],"Object Shape":"Oval","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.961851,+-83.820584(1427)&iwloc=A&hl=en\"> mufon case (1427) map </A>","City":"Swartz Creek"}