{"Date Submitted":"10/16/1983 06:00 UTC","Summary":"Several bright lights in V formation.","trends":["There have been no other sightings in Minier","This sighting has never been favorited."],"Source":"MUFON","Object Flight Path":"Stationary","City":"Minier","Object Features":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.43365,+-89.313146(14274)&iwloc=A&hl=en\"> mufon case (14274) map </A>","divs":["Sighting DetailsTwilight in central Illinois south of Peoria.Was returning to work on a Sunday evening when in slightly cloudy conditions I saw a formation of several bright lights which I thought wre the landing lights of an airplane since there was a nearby small private airfield. I began to notice that lights were hovering and not moving.After a few seconds they vanished.I said nothing about it for fear of ridicule but heard on radio 2 days later that it was reported by several thousand people over several states.Air Force stated it was a Russian satellite breaking up.Not sure of the year but knew it was prior to birth of my child in Nov. 1984.Ive been curious over the years as to the exact date of the sighting and if anything further came of the sighting. In answer to your questions I was driving at about 50 miles per hour and casually glanced at the sky because my wife was flying a small airplane at that time but I found out later she was nowhere in the area.Unfortunately the sighting was like a scene in a Speilberg movie.I remember being puzzled that I could not see the body of what I thought initially was my wife's plane due to what appeared to be whispy clouds that were part of the formation.I believe there were at least 4 lights in a v shaped formation.What made me begin to think that this was something unusual was the fact that I could see what appeared to be small black objects being ejected from the formation towards the ground almost as if something were being sown.The view was unobstructed since it was over a reaped farm field and there were no nearby trees or buildings.When the objects suddenly vanished I began to think that this might have been a UFO.I never discussed this with anyone since I have a somewhat off beat sense of humor and was well known for reading science fiction for entertainment.(and no I do not wear an aluminum foil hat to ward off radio transmissions from Mars.I hold a doctorate and have had 10 years of advanced education beyond college).The first time I mentioned it in public years later in Illinois the person I was doing business with sneared at me and left the office never to return.(a wealthy and rich attorney I might add)I was hoping that you might furnish me with the exact date so I might research the incident further since it was so widely reported.Thank you P.S. the only reason I am reporting this is that I am now retired, living in a different state and no longer dependent on the public for my income."],"Tags":"City","Case Number":"14274","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-89.313146","Log Number":"US-12072008-0006","Country":"United States","Region":"Illinois","Object Shape":"Other","Weather Factors":"Unknown","Disposition":"Unresolved","Date of the Event":"10/16/1983 06:00 UTC","files":["/var/www/straped/mufon/html2text/14274.html.txt","/var/www/straped/mufon/org/14274.html"],"Latitude":"40.43365"}