{"City":"Sikeston","Object Flight Path":"Straight-line path","Longitude":"-89.587858","Sighting Duration":"Undisclosed","Disposition":"Unknown","Latitude":"36.876719","Date of the Event":"02/20/1988 09:00 UTC","files":["/var/www/straped/mufon/html2text/14287.html.txt","/var/www/straped/mufon/org/14287.html"],"Weather Factors":"None","Viewing Distance":"101-500 Feet","Log Number":"US-12072008-0018","Object Features":"None","Summary":"Observed and followed triangle craft for an hour.","Object Shape":"Cylinder, Triangle","Case Number":"14287","Country":"United States","divs":["Sighting DetailsMe and some friends were hanging out on the tailgates of our trucks. We were sitting just right on the edge of town near the local powerplant. I had just happened to look up in the sky over town and saw this light grey metalic object coming toward us. It was so low that the only reason I was able to see it was because the street lights in town were casting light on it. As it kept getting closer I could tell that it was enormous and was in the shape of a triangle. I got the attention of my friends and pointed it out to them. My first thoughts is that it must be some kind of blimp or balloon. As it came closer I knew that it wasn't a blimp or balloon, because it didn't have any propellars or flames. Now, it is right in front of us and it is passing directly over the powerplant. I don't know why, but I expected sirens or something to go off at the powerplant as it was passing over. I also expected to see a lot of people coming out of the town chasing after it but there were none. I was shocked. As huge as this thing is I just knew it should've been getting everyones attention. Now, as it is passing over the powerplant, the lights from the powerplant are casting a lot of light on this thing. Now it is very well lit up by all the surrounding lights from town and the powerplant. It is definetly grey metalic, no windows, tubular, triangle, no vents, no propellars, no jets, no exhaust of any kind and no markings of any kind. Then to top it all off, it makes no noise whatsoever. It is just slowly floating by overhead. As it is passing, I notice that it is hollow inside the triangle, because I can see the stars through the middle of it. It takes it about 15 minutes to come from out of town and pass over the powerplant. Now, we get in our vehicles and start to follow it on the back roads. once it gets entirely out of town and away from any buildings or houses a bright white light comes on at each connecting corner. Very bright. Now that we are driving beside it and it is over a field do we realize just how big this thing really is. It is easily larger than a football field! Each light is shining as bright as what you would see from ALL of the lights combined from a football stadium. We are just driving along real slow trying to follow it the best we can. The best I can figure, we followed it for about an hour. Although I can remember the sighting in every detail this many years later, I can still not remember how it left or where it went. I have an uncle that worked with the New Madrid County Sheriffs office that saw the same craft approximately 2 weeks later. He contacted all local airports and none picked it up on radar. This craft was not the T.R.3B that our government currently uses. I am prior military and know what craft we have to include the Aurora. I have had other sightings and experiences as well. If you contact me I will gladly share them as well. Thank You and god Bless, Reverend James Collier"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.876719,+-89.587858(14287)&iwloc=A&hl=en\"> mufon case (14287) map </A>","Region":"Missouri","Tags":"City","Source":"MUFON","trends":["There has been one other sighting in Sikeston","There were no other sightings in Sikeston on or around February 20th 1988"],"Date Submitted":"02/20/1988 09:00 UTC"}