{"Summary":"A rough greyish circular object slowly tumbling about 30 deg across the sky.","Date Submitted":"09/30/1999 07:15 UTC","files":["/var/www/straped/mufon/html2text/14292.html.txt","/var/www/straped/mufon/org/14292.html"],"Tags":"City","Object Shape":"Circle, Sphere","Viewing Distance":"Unknown","Longitude":"-72.677893","Case Number":"14292","Sighting Duration":"00:00:10","Disposition":"Unknown","Country":"United States","Latitude":"41.766661","divs":["Sighting Details I was driving home by myself across I 291 eastbound North of Hartford CT. at about 715AM coming home from a night part time job when I looked up into the sky and above the horizon and at about 30 deg was a circular slightly bumpy greyish slowly tumbling object with some type of smoke around the object as it moved very slowly horizontally across the sky from left to right. There was no sun, I think the sun was behind some clouds near the horizon but it still was fairly bright out. It was about the size of a quarter to a half dollar in the sky from my perspective. The outside looked like a grey bumpy rock as it tumbled and moved very slowly horizontally with some smokish matter coming off the object. Besides the object itself which I had never seen the likes of before, was that it was tumbling or rotating very very slowly and hardly moving at all from left to right. At this speed it should have been falling from the sky. It was neither moving up or down but just in a horizontal line left to right. I only saw it for maybe 5-10 secs because I didn't think to pull the car over for a longer look because of my speed ,approx 55mph and my safety on the highway. When I got home I told my wife about it and called the airpot tower at Bradley Field in Windsor Locks, CT and asked if they had seen anything unusual on their radar around that time and they said they hadn't. I didn't tell them what I saw . I have never forgot this incident and think about it often. I only wish I had a camera with me. I lost sight of the object becuase I was turning on a highway curve away from the view of the object. My feelings and reaction was of surprise and question due to the color , the tumbling movement and the smoke like material coming off the object and why it wasn't falling out of the sky due to its slow motion horizontal movement. I only saw this once but it left a forever impression on my mind. I will send you a sketch if you want, let me know."],"Object Features":"None","Object Flight Path":"Straight-line path","City":"Hartford","Date of the Event":"09/30/1999 07:15 UTC","Weather Factors":"None","Region":"Connecticut","Log Number":"US-12072008-0022","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around September 30th 1999"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.766661,+-72.677893(14292)&iwloc=A&hl=en\"> mufon case (14292) map </A>","Source":"MUFON"}