{"trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around January 5th 2006"],"Source":"MUFON","Latitude":"40.58083","Country":"United States","City":"Sandy","map":"<A HREF = \"http://maps.google.com/maps?q=40.58083,+-111.853632(14295)&iwloc=A&hl=en\"> mufon case (14295) map </A>","Object Features":"None","divs":["Sighting DetailsThis is something I saw about three years ago. It seemed highly unusual to me and I tried to figure out exactly what it was, but did not succeed. I don't know that it was a UFO, but I am reporting it here because it has a lot of similarities to the recent report from 2008-11-13 \"Facing Tooele\" From an elevated point on the east side of the Salt Lake valley I was smoking a cigarette and looking west. I saw a flash above me in my peripheral vision which caused me to immediately look up. Something luminous and blue shot down from directly above me towards the valley. I initially thought that this object would hit the valley and possibly one of the planes I could see in the sky. Instead, the object disappeared behind the mountains making me believe that it had hit Tooele. I now realize that the object may have been much further away than it appeared, but if so it must have been very large. It drew a perfectly straight luminous blue line down from the sky that would have appeared about the width of my pinky finger held at arms length. I reported the object to a group that tracks re-entry of space debris, and I was told there was nothing that would have fallen in that area at that time. I recorded the exact time and date, but I have misplaced that information (at least for now). It may have been a shooting star or a meteorite, but I haven't really found any reported sightings of those things that match what I saw. I found it odd that the 2008-11-13 report was the closest description I've ever found to what I saw, and it seems to have happened at the same angle and at the same place. Seeing this thing was quite a strange surprise. It made me smile."],"Object Shape":"Flash, Other","files":["/var/www/straped/mufon/html2text/14295.html.txt","/var/www/straped/mufon/org/14295.html"],"Disposition":"Unknown","Case Number":"14295","Date Submitted":"01/05/2006 11:00 UTC","Viewing Distance":"Unknown","Log Number":"US-12082008-0003","Summary":"Luminous object flies so fast towards the ground that it appears like a blue line from the sky to behind a mountain range. RE: Facing Tooele.","Region":"Utah","Date of the Event":"01/05/2006 11:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"None","Longitude":"-111.853632"}