{"Tags":"City","Case Number":"14290","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","divs":["Sighting DetailsI live in the city of Fayetteville, AR. At around 6:35 pm, CDT, Dec. 7, 2008, I took my dog outside to pee. After just a few seconds, I noticed a bright white light at about 20-30 degrees in the west northwest. It proceeded to move rapidly to almost directly overhead. As it reached 50-60 degrees high, it appeared to be a tight, small triangle of bright white lights, perhaps as bright as Venus - brighter than Jupiter (both of which are low in the southwest). There were no flashing lights, no colored lights, as you would expect from a low-flying jet. No sound. The object moved much faster than the sighting I'd had of Skylab on November 19, when it moved directly over NW Arkansas and was visible. Skylab (with the Shuttle attached) took three minutes to go from horizon to horizon. This object took between 30 and 60 seconds to travel from 20-30 degrees in the WNW, past the meridian, to about 70 degrees in the east southeast, where the moon was. I would estimate it was moving twice as fast as Skylab appeared. It was approaching the moon, which is a day or two past half full and very bright. It appeared to change course slightly, jogging toward the south, as it moved overhead. As it approached the moon, it dimmed, finally becoming a single point of light, then disappeared about 5 degrees from the moon. It never reappeared. I watched for several minutes for it to emerge from the moon's light on the path it was on, but nothing. I waiting for over five minutes, and never saw anything else. I have been a stargazer for more than 25 years and am very aware of the stars, planets and moon phases on a normal basis. This object was moving faster than anything I've ever observed. It did not have any colored lights, which I would expect from a low-flying jet (since it was moving so fast). I observed the conjunction of the moon, Venus and Jupiter last week, and am aware of the positions of those planets and their relative brightness. This object was perhaps as bright as Venus, but certainly brighter than Jupiter. Any other reports of this object?"],"Date Submitted":"12/07/2008 06:35 UTC","Date of the Event":"12/07/2008 06:35 UTC","Region":"Arkansas","Country":"United States","files":["/var/www/straped/mufon/html2text/14290.html.txt","/var/www/straped/mufon/org/14290.html"],"Source":"MUFON","Weather Factors":"Unknown","Summary":"Bright white light moving rapidly - appeared to be a triangle of three white lights at it approached overhead.","Disposition":"Unknown","Log Number":"US-12072008-0021","map":"<A HREF = \"http://maps.google.com/maps?q=36.06657,+-94.151426(14290)&iwloc=A&hl=en\"> mufon case (14290) map </A>","Longitude":"-94.151426","City":"Fayetteville","Sighting Duration":"Undisclosed","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around December 7th 2008"],"Object Shape":"Triangle","Object Features":"Unknown","Latitude":"36.06657"}