{"Object Shape":"Other","Date of the Event":"10/31/1988 08:00 UTC","Date Submitted":"10/31/1988 08:00 UTC","Viewing Distance":"Unknown","Source":"MUFON","divs":["Sighting DetailsIn late 1988 or early 1989 this event took place in Southern California in the town of Newbury Park right next to Thousand Oaks, CA. Hiking down from the Santa Monica Mountains in Point Mugu State Park, it was dark and when we cleared the oak trees while nearing Potrero Road at the edge of the park, my wife and I noticed a strange vertical shaft of light high in the sky. It appeared to be over Thousand Oaks to the North East of us, perhaps a mile or two away. We thought it was a beam of light from a searchlight but then noticed that it did not move nor did the shaft of light reach all the way to the ground. We could not tell whether the source of light was from below or from above. The intensity of the light was constant, there was no pulsating nor was there any noticable movement. The light seemed to have mostly bright white and a mix of blue and green streams. An unusual characteristic of this shaft of light is that it was not uniform from top to bottom but rather appeared as if it were a twisted ribbon of light. It was not unlike a high velocity jet exhaust where it varies from bright to dark to bright to dark and continues to repeat. A similar effect can be seen when stretching a ribbon tight and winding several twists to it. There was no sound coming from the light. We observed it for about 10 minutes or more while we continued to hike from the park to my house which was right across the street from the park entrance. I ran into the house to get my binoculars and when I returned outside the light was gone. Looking all around in every direction I could not locate it again. About a month or two later while watching one of the network evening TV newscasts there was a story about an unusual shaft of light that several people had seen. There was even video of it and I recognized it right away. This news story took place in Japan (I think) and appeared to be seen out beyond a sports playing field. This time it appeared to be resting on the ground while someone was seen running over to investigate it when it disappeared."],"Latitude":"34.134922","Log Number":"US-12082008-0009","files":["/var/www/straped/mufon/html2text/14301.html.txt","/var/www/straped/mufon/org/14301.html"],"Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.134922,+-118.987794(14301)&iwloc=A&hl=en\"> mufon case (14301) map </A>","Summary":"Vertical shaft of light suspended high in the air. Did not reach the ground and did not move or pulsate.","Region":"California","Country":"United States","Longitude":"-118.987794","Case Number":"14301","Object Flight Path":"Stationary","trends":["There have been 17 other sightings in Thousand Oaks","There were no other sightings in Thousand Oaks on or around October 31st 1988"],"Object Features":"None","City":"Thousand Oaks","Weather Factors":"None","Disposition":"Unknown"}