{"Sighting Duration":"Undisclosed","Source":"MUFON","City":"North Huntingdon","Log Number":"US-12082008-0008","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.331708,+-79.726431(14300)&iwloc=A&hl=en\"> mufon case (14300) map </A>","Object Shape":"Boomerang, Triangle","Tags":"City","Date of the Event":"11/28/2002 10:00 UTC","Country":"United States","trends":["There have been 3 other sightings in North Huntingdon","There were no other sightings in North Huntingdon on or around November 28th 2002"],"Longitude":"-79.726431","Object Flight Path":"Hovering then path","Region":"Pennsylvania","Weather Factors":"Unknown","Case Number":"14300","Latitude":"40.331708","files":["/var/www/straped/mufon/html2text/14300.html.txt","/var/www/straped/mufon/org/14300.html"],"Object Features":"Undisclosed","divs":["Sighting DetailsThis was 6 years ago, so I am not exactly sure of the dates. I know it was between late November and early January. I was returning from a late meal with a friend between 2200 and 0100 on Route 30 traveling from North Versailles to North Huntingdon, heading home with my friend, now my wife. As my friend and I were approaching the traffic light at Malts Lane, I saw a triangle shaped object with steady green lights at the corners, just hovering in the area above or just behind the former Chesterfields resturant. I pointed out the object to my friend. The traffic light was red, so we stopped there just staring in amazement. The traffic light had just turned green, but we still sat there watching it hover, trying to figure out what it was. About a minute later, the object took off like a jet, heading north from our position. I had looked in the past online, and tried to find somewhere to report our experience, but was unable find anywhere. The other day we were watching a special on your investigation in Bucks county PA. On the program, one of the drawings depicted exactly what the object we saw looked like. My wife actually jumped up in excitement upon seeing the rendering of the object we saw. It was electrical seeing that someone else had seen the same object that we had."],"Disposition":"Insufficient Data","Summary":"Object was hovering over Chesterfields restaurant for 2 min. when we saw it. It took off like a jet and was gone.","Date Submitted":"11/28/2002 10:00 UTC"}