{"City":"Salt Lake City","Log Number":"US-12082008-0011","Source":"MUFON","Country":"United States","Region":"Utah","Date of the Event":"11/30/1987 11:00 UTC","Object Flight Path":"Stationary","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around November 30th 1987"],"Object Shape":"Triangle","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.765609,+-111.888787(14303)&iwloc=A&hl=en\"> mufon case (14303) map </A>","Summary":"Equilateral black triangle with 3 circular lights, 1 in each corner.","Tags":"City","Sighting Duration":"00:00:10","Case Number":"14303","Object Features":"None","Disposition":"Unknown","divs":["Sighting DetailsThere's been 2 other times in my life that I think I may have seen a UFO but this is the only one that seems like it might have been real. My \"bro\" (Aaron S.) and I were walking south on 3450 West in our neighborhood sometime in the mid 1980's. I was somewhere between 10-13 years old. Walking past West Lake Jr. High School as we did several times a week at night because it was between his house and mine. There was a fence to the right of us and Aaron was on my right side and we were on the west side of the street. The sky was very dark but there was the usual house lights and lighting from the Jr. High School. The street 3500 S. to the south of us has a McDonalds on the North West corner which was directly in front of us. We were casually walking along talking when I looked up above the McDonald's and saw some lights above it that were never there before, for a second I thought maybe McDonalds had constructed some new parking lot lights. I couldn't believe my eyes and I stared intently at it and wondered if what I was seeing was real. I had to look away to make sure it wasn't just my imagination or my eyes playing tricks on me. So I looked down at the sidewalk in front of Aaron then returned my gaze to the object which remained hovering silently above McDonald's I was afraid to tell Aaron immediately thinking for some reason if I said anything that it would vanish. It was a large solid black triangle larger than the McDonald's restaurant and appeared to be hovering directly over it maybe 100 or 200 feet but it could have been a little further away perhaps across the street. The object had 3 somewhat large circular lights in each corner of the equilateral triangle which was pitch black, blacker than the sky. The lights were very evenly lit and looked almost exactly the same as what I've seen on UFO investigation shows and SciFi shows except there was no circle in the center as I've seen on several shows. So, I look back at Aaron's face to tell him about the object and perhaps my peripheral vision caught something moving and I looked back and it was gone. So doubt entered my mind and I said nothing to Aaron or anyone. I had a feeling it was monitoring me. It seemed silly at the time and continues to seem silly that a UFO would be hovering above a McDonald's of all places in the middle of the Salt Lake suburbs. I do have a somewhat active imagination but I always know what's real and what's not. I know I saw something in the sky that night. That area is a high traffic area for Commercial Jets coming into the Salt Lake Airport but I don't remember seeing any planes that night and I can always hear and see the jets moving. Which of course was completely different from what I saw. I could be wrong but I am also fairly certain that this happened long before I had seen any Unsolved Mysteries TV shows with the black triangle which is where I believe I first saw a depiction of a Black Triangle. When I saw the show I said to myself \"that's what I saw\" and then I started telling a few close friends about my experience including Aaron who says he saw nothing that night. And most other people laugh at the thought of advanced technology floating over McDonald's. Which I don't blame them. So, I laugh along with them. But, still wonder about what I saw."],"files":["/var/www/straped/mufon/html2text/14303.html.txt","/var/www/straped/mufon/org/14303.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"40.765609","Date Submitted":"11/30/1987 11:00 UTC","Longitude":"-111.888787"}