{"Object Features":"Unknown","Log Number":"US-12082008-0014","Date Submitted":"04/16/2008 12:00 UTC","Viewing Distance":"Over One Mile","Case Number":"14306","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn April 16th, 2008 I was driving east across Harrison st. bridge into Lafayette from West Lafayette. My friend and I both noticed a large single light in the sky. It was in the east, but not far away, it looked like it was just a couple thousand feet up and over Lafayette. It caught both of our attention but nothing was said. Until it began to move and pulsate. At that moment, we both said at the same time, \"that's not a plane\". (Purdue University is in West Lafayette and has a small airport. It is not uncommon to see small aircraft about to land. That is not what this was) The large pulsating light then turned into 3 lights in a triangle. The lights were stationary and in a triangle formation for about 10 - 20 sec. Then they pulsated and turned into a horizontal line of 5 or 6 lights that appeared in a sequence. (I'm not sure if the lights actually moved or if the line appeared as the triangle went out.) This line of lights was totally stationary, not falling, and lasted for another 10 - 20 sec. Before the lights were gone, we were over the bridge and able to pull over and get out of the truck. There was no sound. The next day I heard people talking about a \"sonic boom\" in Kokomo, which is an hour away, but that was really all I heard until UFO Hunter's aired in Nov. from Kokomo! Some of the sightings are very similar to what I saw. I am not aware of anyone else in the Lafayette area seeing this on the night of the 16th, and I feel somehow this is important since we are an hour away from Kokomo. That is what has compelled me to submit this report, and makes me wish I would have done it a long time ago. P.S. they were NOT flares."],"Longitude":"-86.873607","Latitude":"40.422002","files":["/var/www/straped/mufon/html2text/14306.html.txt","/var/www/straped/mufon/org/14306.html"],"Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.422002,+-86.873607(14306)&iwloc=A&hl=en\"> mufon case (14306) map </A>","Date of the Event":"04/16/2008 12:00 UTC","City":"Lafayette","Summary":"Saw yellow/orange lights in eastern sky, Not far. Triangle of lights that began to move as a triangle and then lights appeared in a staight horizontal line.","Weather Factors":"None","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Country":"United States","trends":["There have been 30 other sightings in Lafayette","There was one other sighting in Lafayette on or around April 16th 2008"],"Source":"MUFON","Tags":"City","Region":"Indiana"}