{"Viewing Distance":"Over One Mile","divs":["sighting detailsbelow is the article on the komo-tv website www.komo-tv.com the high-quality photos of these spectacular cloud formations did not come through on this cut-and-paste. please check out the komo-tv site or email me at rebeccaphb@yahoo.com and i will send you an email at a designated eddress with the photos embedded. i witnessed four ufo disc-like cloud formations from approximately 3:30-5:00 pm pst on friday, december 5, 2008 at elliott bay park on the seattle waterfront. these rare large, layered \"lenticular clouds\" did not move; they hovered in the same shape\\position for three days. others saw and photographed this phenomenon from friday 12\\5 thru monday, 12\\8\\08. they were evidently seen by a number of thousands of people throughout western washington on these days. in my opinion, they could possibly be et motherships using a cloud camouflage to send a signal to those receptive to prepare for something imminent. this seems to support some channeled transmissions purportedly from the galactic federation sent to me by associates, which i had previously mentally shelved until i had some evidence. this may provide some evidence that these messages are authentic. please contact me if i can be of any further service. rec december 5-8, 2008 western washington state aaarch mount rainier puts on a holiday light show: ufo-like cloud formations give \"peak\\peek(?)\" experience by scott sistek-komo-tv reporter our little dry streak is about to come to an end. but if you looked at mt. rainier today, you would have known that already. take a look at some of these incredible clouds captured over mt. rainier today. the one above was taken by tim thompson. the one below, by david embrey: those are called \"lenticular\" (vehicular?) clouds. they're caused when the air flow is just right so when it flows over mt. rainier, the air gets pushed upward where it cools and condenses into clouds. depending on how smooth the flow is, you can get some rare, amazing clouds formations as we've seen so far today. here is more information on what causes them from an earlier blog entry. it's usually a sign of rain within 24 hours because typically the moist flow that precedes a storm around here is the perfect set up for these clouds. here are some other ones submitted into younews (feel free to submit your own!) from younews contributor: corgis4ever in monroe, wa: orca86 from orting, wa: user samich in sammamish, wa: \"emcleod3\" of gig harbor: kazw37 from orting, wa: and these two by \"fi-bll-fe\" in fife, wa: and these next three are from peter murray of vashon island, wa: and finally, one by user \"knitterbread\" of sumner, wa\" note: the first major ufo sighting in america of the mid-twentieth century was in 1947 near mt. rainier."],"Source":"MUFON","Object Shape":"Disc","Case Number":"14314","Disposition":"IFO","City":"Washington","Region":"Washington","Country":"United States","Longitude":"-77.033736","Tags":"City","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around December 5th 2008"],"Log Number":"US-12092008-0002","Sighting Duration":"Undisclosed","Date Submitted":"12/05/2008 03:30 UTC","Summary":"Massive UFO Cloud Formations Linger Over Mt. Rainier 12/5-8/08","map":"<A HREF = \"http://maps.google.com/maps?q=38.900232,+-77.033736(14314)&iwloc=A&hl=en\"> mufon case (14314) map </A>","Latitude":"38.900232","Object Features":"Patterned Surface","Object Flight Path":"Other","Weather Factors":"Unknown","Date of the Event":"12/05/2008 03:30 UTC","files":["/var/www/straped/mufon/html2text/14314.html.txt","/var/www/straped/mufon/org/14314.html"]}