{"Country":"United States","Date Submitted":"12/06/2008 09:45 UTC","Tags":"City","Case Number":"14319","Summary":"Driving home from work and saw triangle shaped lights in sky not moving.","Sighting Duration":"Undisclosed","Region":"Kansas","Longitude":"-96.567269","Date of the Event":"12/06/2008 09:45 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.191338,+-96.567269(14319)&iwloc=A&hl=en\"> mufon case (14319) map </A>","files":["/var/www/straped/mufon/html2text/14319.html.txt","/var/www/straped/mufon/org/14319.html"],"Source":"MUFON","Latitude":"39.191338","Disposition":"Unknown","Object Shape":"Triangle","Object Features":"Other","divs":["Sighting DetailsI was driving home from work with my mom - she picked me up that day. We weren't talking so the car was pretty much silent. I was staring out the window at two lights and wasn't thinking about it really for about a minute; then I was confused because at first i thought they were part of an airplane - but they weren't moving at all. It was just hovering there, so I asked my mom what she thought because it scared me a bit - and she didn't know either - and she was trying to focus on driving so she didn't get a good look at it - i could tell it scared her too though. But I stared at it - i couldn't look away. It was too close to the ground to be any kind of airplane and too high up from it to be a tower or building. It was a triangle. Picture a normal triangle with equal legs and the base being smaller. The points of the base where the legs meet had the brightest lights - white lights being about the same brightness of car headlights or brighter. The 'tail' light was smaller - and less bright. You almost couldn't make it out. The rest of it was just the triangle - darker than the sky was so you could tell it wasn't an airplane or anything. Also if you've ever seen the road on a hot day - that weird hazy fog that comes off of it in the summer - thats what was around the thing I saw - that same haze - only more of it than on a road. I know we weren't the only ones who saw it because while driving we saw people on their porches or in their yards looking at it too - one of them was filming and pointing. I watched it as we were driving, and then at a stop light I saw that it WAS moving, but very VERY slowly - about the same speed as somebody walking. Our planes can't do that but I wouldn't call it a 'hover' quite because it was moving but it almost was a hover. I couldn't see it anymore because after that light turned green we had to drive away. If anybody else saw this can you email me about it?"],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-12092008-0007","City":"Manhattan","Object Flight Path":"Stationary,Hovering then path,Other","trends":["There have been 5 other sightings in Manhattan","There were no other sightings in Manhattan on or around December 6th 2008"]}