{"Region":"Virginia","Case Number":"14310","Date Submitted":"12/08/2008 12:00 UTC","trends":["There have been 2 other sightings in Poquoson","There were no other sightings in Poquoson on or around December 8th 2008"],"City":"Poquoson","Disposition":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["sighting detailslocation: yorktown, va time: 8:40pm date: 12\\8\\2008 weather: partly cloudy to clear i exited my garage with my dog to go for a walk. i noticed a light above my head. i was facing north; the semi full moon was west \\ north west in the sky to my left and above. my first thought was that the light was a flare. the light, after catching my attention took off \\ flew to my right \\ east at a speed that i can only describe as faster than i have ever seen anything go. the flight path seemed level and controlled. there was no sound made by the object. i estimate the size of the object, relative to the moon and holding my thumb up to the sky, to be larger than the moon and 50% larger than my thumb. the object was large enough to grab my attention and surprise me. it appeared to be traveling at a speed much faster than an aircraft. i can only describe the speed as amazing. it is my belief that the object was low in the sky relative to aircraft flying at altitude. the object as well was above the altitude of an aircraft on approach for landing. the object appeared as a blue to blue \\ teal sphere or circle with a pronounced outer circle or halo. there were no trails, blur or flashing. the object seemed clear and defined. i lost sight of the object when ti flew east and was obscured by a line of trees. the entire sighting lasted 2-3 seconds, but i must say, that i am still smiling with amazement and wonder over what the heck did i see? really, a very unique experience."],"Tags":"City","Date of the Event":"12/08/2008 12:00 UTC","Summary":"Witnessed a fast moving blue / Teal sphere with a halo streak from overhead east accross the horizon.","Country":"United States","Object Shape":"Circle, Sphere","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=37.122366,+-76.345777(14310)&iwloc=A&hl=en\"> mufon case (14310) map </A>","Object Features":"Unknown","Latitude":"37.122366","Weather Factors":"None","Longitude":"-76.345777","files":["/var/www/straped/mufon/html2text/14310.html.txt","/var/www/straped/mufon/org/14310.html"],"Log Number":"US-12082008-0018"}