{"Summary":"VERY low, looked like aeroplane, but was NOT moving; dark gray.","Tags":"City","Longitude":"-74.531694","Weather Factors":"None","Sighting Duration":"00:01:00","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Date Submitted":"09/11/2008 06:10 UTC","City":"South Brunswick","Object Flight Path":"Stationary","Country":"United States","Object Shape":"Other","Source":"MUFON","Region":"New Jersey","Log Number":"US-12102008-0002","files":["/var/www/straped/mufon/html2text/14326.html.txt","/var/www/straped/mufon/org/14326.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.38069,+-74.531694(14326)&iwloc=A&hl=en\"> mufon case (14326) map </A>","Date of the Event":"09/11/2008 06:10 UTC","Case Number":"14326","trends":["There have been no other sightings in South Brunswick","This sighting has never been favorited."],"Latitude":"40.38069","Object Features":"Wings, Other","divs":["Sighting DetailsWe were comming home from picking my husband up from work. When we neared the high voltage power lines directly over the farm market on highway 27, a light caught my eye. I looked up and saw what I thought was an aeroplane, but noticed immediately that it was NOT moving. It wasn't hovering; it was STILL. It was dark, matte gray, almost black. I said, \"Guys, what is that plane doing?\" to my sons who were sitting in the back of the van. \"Wow, thats really weird. Is it going to crash?\" they said. My husband, who is legally blind even saw it. Its like it just didn't make any sense.It couldn't have been any higher than the power lines- that would be, what? 150 feet? And it stood out really clearly from the sky;, no wavy heat patterns or anything. There was a lot of rush hour traffic, but I tried to roll the window down as fast as I could to get a better look, and my husband said \"It sounds like a jet, but it doesn't look like one..\" My children and I noticed a black thing (they said it looked like a ladder to them) hanging out of the back of the \"plane\".I couldn't understand why people weren't seeming to pay any attention to it. It was very big, and very low, and stationary. It was just weird, almost surreal. We didn't really talk about it at all after that night until today. We even all drew pictures of how we remembered it, and it was all the same, except my husband and one son remember something that looked something like big engines way towards the back; I dont remember that. Also, right afterwards, as soon as we got home and out of the car, we heard LOTS of helicopters, and saw 2 or 3 of them. It was the oddest thing I can ever recall seeing. Oh, and the \"plane\" only had one light on it, and that was a very bright white light near the tip of what would have been the right \"wing\". We talked about that when we were home, as we thought it odd, as most planes have a white light on the nose of the fuselage, and a green and red light on the wings. This only had the one light. There was nothing else visible or discernible on the whole thing. Not windows or insignia or anything."]}