{"Longitude":"-70.99706","Region":"Massachusetts","Object Shape":"Blimp, Disc, Oval","Country":"United States","Case Number":"14325","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=42.258537,+-70.99706(14325)&iwloc=A&hl=en\"> mufon case (14325) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Summary":"Observed three objects in triangle formation. Electric blue in color. Moving East over the coast line.","Date of the Event":"08/07/1968 01:10 UTC","trends":["There have been 7 other sightings in Quincy","There were no other sightings in Quincy on or around August 7th 1968","This sighting has never been favorited.",""],"Date Submitted":"08/07/1968 01:10 UTC","Disposition":"Unknown","Log Number":"US-12102008-0001","divs":["Sighting Details I was staying at a hotel on the beach in Scituate, MA. My room was on the third floor of the hotel. It was a Friday night in August and a warm night. The sky was clear and the wind was between 0 and 5mph. I had the window and screen pulled down from the top to catch the breeze. I couldn't sleep and it was a little after 1 AM while laying in bed when I cought sight of a very bright object slowly comming into view. I stood up to see better and noticed that there were not one but three objects that appeared to be oval in shape and shining with an electric blue color that radiated from within the objects. The area outside the hotel was dead quiet but I could hear no sound at all from the objects. They were individual objects and not one because I could see stars in between them as they moved. There were no visible signs of windows. Their speed was between 50 to 75 mph. The distance from my view point had to be between one thousand and three thousand feet at about a 30 degree angle. All considered, I would estimate their size to be between 150 to 300 feet in diameter. Although they appeared oval they may have been circular because of the angle of sight? My first impression was one of amazement and I thought to myself, \" Am I the only one seeing this at this time of the morning.\" It was about five minutes since I first noticed the objects and now their speed was increasing as they continued a course due East. As I stood there observing I remembered I had my camera with me and quickly dressed. I was down to the first floor in no time and went out to the patio near the beach but there was no sign of the objects anywhere. The sight I observed is forever imbedded in my mind! I did a painting with details close to what I did remember attached with this report."],"Tags":"City","Object Features":"None","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Quincy","Latitude":"42.258537","files":["/var/www/straped/mufon/html2text/14325.html.txt","/var/www/straped/mufon/more/14325_submitter_file1__UFO-1.JPG","/var/www/straped/mufon/org/14325.html"]}