{"City":"Bainbridge Island","divs":["Sighting Detailsi was sitting in my living room watching t.v and something very bright caught my attention outside my window. As i went outside to get a closer look it revealed itself as an airplane that had its lights pointed at my direction very briefly. So i watched the airplane until im convinced its an airplane and as im watching it i started to look around the sky and i noticed a very faint blinking almost directly above me. I tried to follow it for as long as i could which was about 30 seconds but it disappeared in the clouds. now there were a few things that were interesting about this light. Particularly the strobe of the light when it would blink. It looked identical to a buoy when it blinks,(starts out faint and within a second or two it fully lights up and then dissipates.) Lights on airplanes don't flash in this manner. when you see a blinking light on an aircraft in the sky its a very constant flash and almost instantaneous (on , off within a second.)There also appeared to be about a 2 second interval between each flash but i dont think that means anything significant or maybe it does.. The other piece of evidence that leads me to believe that this blinking red light was a UFO because of the appearance in altitude and speed that this object had and i compared it to my previous sighting which was an airplane and still in view and appeared pretty far away. it appeared to have just recently taken off and was climbing towards cruising altitude. It was traveling from the SW towards the NW then heading North. The red blinking light appeared soon after the plane had reached about the halfway point in my field of vision (halfway meaning from where i had originally seen the light from my living room to where it would travel out of view on the opposite side ) so this leaves about another 30 seconds until they both go out of view) The red blinking light traveled out of view in about 15 seconds BEFORE THE AIRPLANE (keep in mind this object did not appear in my field of vision when i first saw the airplane )giving the appearance that it was traveling at an enormous speed but it was also extremely high in altitude compared to the airplane and the clouds. when the red flash would dissipate, the object became invisible it had no other visible parts or lights other than this faint red flash. so basically when the first object i noticed reached the halfway point in my field of vision, a second object came into view where the first object was originally seen. Before the first object (airplane) could travel out of my field of vision the second object (bright red flash) traveled out of my field of view about 10-20 seconds before the first object did. so the red blinking flash had 3 times if not 4 times the speed of the airplane that combined with the altitude made it appear to be traveling in our orbit Ive seen satellites and space shuttles and neither of them have signal lights that broadcasts their presence for anybody who looks in the sky at the right moment would see it. when you see satellites and space shuttles with the human eye they appear as very tiny solid object with a small reflection from the sun. no signal lights or anything this bright and visible for that matter. the only way to see satellites and shuttles is to be very lucky or would know their orbit they take and be able to track them accordingly. I tried to grab my phone to take a picture but when i came back it was gone. but the plane was still traveling out of view."],"Object Shape":"Unknown","Viewing Distance":"Unknown","Case Number":"14327","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14327.html.txt","/var/www/straped/mufon/org/14327.html"],"Summary":"High altitude red light blinking.","Date of the Event":"12/09/2008 10:25 UTC","Weather Factors":"Unknown","Disposition":"Insufficient Data","Tags":"City","Country":"United States","Longitude":"-122.513215","map":"<A HREF = \"http://maps.google.com/maps?q=47.628468,+-122.513215(14327)&iwloc=A&hl=en\"> mufon case (14327) map </A>","Object Flight Path":"Undisclosed","Log Number":"US-12102008-0003","trends":["There have been 2 other sightings in Bainbridge Island","There were no other sightings in Bainbridge Island on or around December 9th 2008"],"Date Submitted":"12/09/2008 10:25 UTC","Region":"Washington","Source":"MUFON","Latitude":"47.628468","Object Features":"Undisclosed"}