{"Weather Factors":"Unknown","Disposition":"Unresolved","Object Features":"Undisclosed","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.759734,+-83.544421(1433)&iwloc=A&hl=en\"> mufon case (1433) map </A>","Sighting Duration":"01:00:00","Country":"United States","trends":["There have been no other sightings in Hubbard Lake","This sighting has never been favorited."],"Longitude":"-83.544421","Region":"Michigan","Case Number":"1433","Source":"MUFON","Object Shape":"Boomerang","Date of the Event":"07/28/1987 10:00 UTC","Tags":"City","Summary":"5 Students Witness Strange Lights and V-Shaped Obj","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/1433.html.txt","/var/www/straped/mufon/org/1433.html"],"Latitude":"44.759734","divs":["Sighting DetailsWitness 1: ___ and ___ were sitting by the fire when I left to get somefirewood. When I returned they were both looking at a \"cloud\" and some strangelights. They called me over and I looked up toward the north and saw whatappeared to be a helicopter spotlight going through smoke, but there was nonoise. When I looked over to the east I saw a \"cloud\" that looked like a \"V\"laying on its side. We all looked back at the expanding and contracting bothup and down, and to the side. This \"cloud\" never really moved a great distanceor changed form at all. When we looked back for the \"cloud\" it was gone, itleft without a trace. Soon after it left the lights dimmed gradually until theywere gone.Witness 2: We were sitting by the campfire and I got up and walked to the lakeand a bright light caught my eye and I looked up and saw a black V shapedobject. Thats whenI noticed the lights horizontally over the lake. At thispoint I called ____s attention to the black object near the end of the lights. Then we told ____ when he came back from getting some wood for the fire. We saton the dock and watched the lights expand and contract then we looked at theobject andit had moved a little bit, then we looked away and looked back and itwas gone.Witness 3: Me and my friends were sitting at the camp fire at approximately11:15 to 11:30 on July 28, 1987 when ____ happened to notice a black cloudshaped like a sideways triangle. We all went to stand on the dock for a betterview. We then began to see a light horizontally across the sky over the lake. Lights then started to move up and down through the beam. We then look over tosee the cloud and it was gone. We couldnt see it anywhere. We look back atthe lights, some of them were moving back and forth - sideways, expanding thenretreating back. This lasting maybe 20 minutes. After that happened it seemedto be fading away to the north end of the lake until it gradually disappeared. We didnt really think about it being a UFO until after. We were trying tothink of logical things but we didnt hear any noises and there werent anyother noises to distract us from hearing others."],"City":"Hubbard Lake","Date Submitted":"07/28/1987 10:00 UTC","Log Number":""}