{"Date Submitted":"09/12/1967 10:00 UTC","Object Shape":"Other","trends":["There have been no other sightings in Hot Springs","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=37.999399,+-79.831587(14336)&iwloc=A&hl=en\"> mufon case (14336) map </A>","Longitude":"-79.831587","Country":"United States","divs":["Sighting DetailsMyself, my father and 2 other hunters were making brunch after a morning of hunting on the Upper Cowpasture river in Northern Va. We had run out of film and one of our group was driving out to buy some. It was a sunny morning with very few clouds. We noticed a large, dark object up the river about 5 miles moving slowly amongst the trees. It was spherical at the top. I immediately noticed that the edges were convoluted, and there were projections on top and the underside. I remember the feeling of 'recognition' - this is a 'UFO'. Or, a large balloon with the same shape. We were in a state of unbelief. The object was 'right there' and definitely a machine. The machine was moving too slow for the eye to follow. It moved without seeming to. In retrospect, we all agreed that the manner of movement of the object was one of the most unusual aspects of the experience. The sun glinted on the top surface which seemed to have a flat - 'black force field' around it. The details of the machine were visible, through the blur. I remember that I thought,I should estimate the size of the object in terms of 'football' fields. I decided that it was almost 500 yards across. It would've taken an object the size of a golf ball to cover it, in my out stretched hand. Then it vanished, over a ridge. We queried the ranger at his station at the only access to that stretch of the river. We thought that there might be some scientific experiment that involved a giant 'black balloon.' He told us that nobody had passed his station all year. He said that he would investigate as there were a number of sightings in that area, at that time. When we spoke with him again, he said that he had found nothing except some strange impressions in a meadow. (This area between Va. and West Va., is one of the most remote parts of the U.S..) In the 30 plus years since that encounter, whenever I met up with any of the other witnesses, I queried them if they had any explanation for what we saw. These stolid, Baptist folk wouldn't even use the word 'UFO'. They said 'It was not of this earth!' My father quietly agreed with me, that the only thing it could have been was an ET machine - a UFO. All of us experienced 'time lapses' when we were in that area. My father experienced a 6 hour lapse while driving up there which disturbed him even more than the sighting - for what it's worth. After examining the online videos to find the object I saw, I'm thinking that the object I saw was not 'top shaped'. There are too many videos of saucer shaped objects exactly like what I saw. (Nov 4 2004 Mexico City is one) So, I've concluded that there was 'something' extended below the craft that gave the 'top shaped' impression, due to the blurring effect of the strange 'flat black' glow around the object. The flat black 'blur' around the object decreased the sun's reflection off it. But we all agreed, that there was not doubt of the solidity of the object. No one reported anything to any authority. We've told very few people, not even family members due to the credibility issue. However, now I have decided to actively pursue the political angle, demanding the Gov. to disclose what they know. R. Conner"],"Log Number":"US-12102008-0008","Sighting Duration":"Undisclosed","Object Features":"Appendage(s), Louvres","Date of the Event":"09/12/1967 10:00 UTC","Object Flight Path":"Path with directional change","Tags":"City","Region":"Virginia","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14336.html.txt","/var/www/straped/mufon/org/14336.html"],"Latitude":"37.999399","Source":"MUFON","Weather Factors":"Unknown","Case Number":"14336","City":"Hot Springs","Summary":"4 people watched a large upside-down top shaped machine over a river."}