{"Region":"California","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:18:00","City":"Encinitas","Case Number":"14344","Weather Factors":"Unknown","Log Number":"US-12102008-0016","Disposition":"Unknown","Date of the Event":"08/28/2007 02:15 UTC","Object Shape":"Sphere","divs":["Sighting DetailsThe night of the last lunar eclipse I decided to go outside and watch. Around 2:10AM I stood outside my home in my backyard looking at the moon. I was watching the moon and saw that it was kind of a muddy color but there was nothing extraordinary about it during the eclipse. After about five minutes I decided to go back inside and go to sleep. I was about to go inside when I noticed two bright reddish orange lights flying in tandem. I thought it might be a plane also observing the lunar eclipse. I realized it wasn't a plane as there was no noise or the usual blinking running lights planes are required to have. When the lights separated and started to do aerobatics I knew that I was watching something unusual. They continued to fly in an easterly direction with one of the lights hovering and the other flying around it. They were both at the moon's five o'clock. The lights were probably moving at about one hundred miles per hour and were several hundred feet above the ground. Needless to say I could not take my eyes off of them. They then joined up again and started to fly east to west in tandem. The lights then separated and flew off in opposite directions into the night sky and quickly disappeared. My home is regularly overflown by many aircraft and helicopters which I observe on a regular basis. I live about fifteen miles north of Miramar Air Station which is now used by the Marines. I do not know what the objects were, but I do know that they were not airplanes or helicopters. When I went upstairs I woke up my wife and we both went outside to see if I could spot the lights again but they were gone and didn't return. Several months later on Jan. 1 there was a similar incident in San Diego involving three lights which were filmed. When I watched the film the lights looked very similar to what I saw."],"Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.042677,+-117.285312(14344)&iwloc=A&hl=en\"> mufon case (14344) map </A>","Summary":"Observed two silent reddish orange spheres flying in tandem west to east.","Longitude":"-117.285312","trends":["There have been 13 other sightings in Encinitas","There were no other sightings in Encinitas on or around August 28th 2007"],"Latitude":"33.042677","files":["/var/www/straped/mufon/html2text/14344.html.txt","/var/www/straped/mufon/org/14344.html"],"Tags":"City","Date Submitted":"08/28/2007 02:15 UTC","Country":"United States"}