{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/14340.html.txt","/var/www/straped/mufon/org/14340.html"],"Date of the Event":"11/25/2008 07:15 UTC","Longitude":"-77.403871","Source":"MUFON","Region":"Maryland","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"IFO","City":"Frederick","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.415979,+-77.403871(14340)&iwloc=A&hl=en\"> mufon case (14340) map </A>","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around November 25th 2008"],"Case Number":"14340","Summary":"I saw a teardrop shaped light, back dropped by a mountain, as it shot towards the ground at about a 45 degree angle. .","Object Features":"None","Log Number":"US-12102008-0012","Latitude":"39.415979","Sighting Duration":"Undisclosed","Object Shape":"Teardrop","divs":["sighting detailsi live in a rural neighborhood at an elevation of about 500', with the blue ridge mountains about 1 1\\2 miles west at about 1400'. on 11-25-08 at about 7:15 pm i was shutting my backyard gate in the dark, facing west towards the mountains. as i looked up, i saw a lighted object rapidly descending at about a 45 degree angle with the mountain range as a back drop. i saw it for only about three seconds before it dropped out of sight behind a neighbor's two-story house. i first thought that i must have seen a meteor. the lighted object was oblong in shape, wider at the end headed downward, like an elongated teardrop. the length was about 3\\4 of a tennis ball held at an extended arm's distance, with a tail of more diffused light extending further out. the width was about a third of the length. the color reminded me of a halloween glow-stick, so it had a florescent look. my estimation is that the lighted object was in the valley, about 1\\2 to 1 mile from my house. the only sound i noted was that of distant barking dogs, off towards the base of the mountain. i am frequently outside, day and night, caring for horses and have a familiarity with the sights and sounds of the area. i have never seen anything like this before. note: i would like an investigator to call me."],"Date Submitted":"11/25/2008 07:15 UTC"}