{"divs":["Sighting Detailsi tried to report this several months ago but my computer crashed so i just put it off but after seeing your show.i was working at alocal college and was walking back in the bld. when first i seen a flare droping from a f jet i could here the jet leaving the area then i saw the row of lights maybe amile im not sure the lights seemed pretty large in the sky.then the lights slowly turned off one by one.i could see the remnants of the flare that was droped by the jet and could here the sound of the jet dissapering in the background then another row of lights just like the first as i looked at them they to turned off i was searching the sky looking for them and wateing to here a sound but nothing. it took me a minute to realize what i had just seen.i thought that did not just happen.then i realized it really was a ufo or ufos and i wonderd why the jet was running the other way.this is not made up this really happend and isure would lik to know what i saw.every time iwalk outside im looking up. i get a really strange feeling at night when i go outside and cant help but look for them."],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.33502","Tags":"City","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.33502,+-82.977572(14348)&iwloc=A&hl=en\"> mufon case (14348) map </A>","Object Flight Path":"Straight-line path","Date Submitted":"05/19/2008 08:30 UTC","Disposition":"Insufficient Data","trends":["There have been 7 other sightings in Chillicothe","There were no other sightings in Chillicothe on or around May 19th 2008","This sighting has been favorited 1 time.",""],"City":"Chillicothe","Date of the Event":"05/19/2008 08:30 UTC","Case Number":"14348","Object Shape":"Boomerang","Longitude":"-82.977572","files":["/var/www/straped/mufon/html2text/14348.html.txt","/var/www/straped/mufon/org/14348.html"],"Object Features":"Unknown","Region":"Ohio","Summary":"Sort of like Phoenix lites.","Weather Factors":"None","Log Number":"US-12102008-0020"}