{"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Longitude":"-81.509205","Summary":"Extremely bright light very high in sky that made no noise and making rapid movements","Country":"United States","Tags":"City","City":"Akron","Object Features":"Unknown","Date Submitted":"12/10/2008 12:00 UTC","Log Number":"US-12102008-0019","Case Number":"14347","divs":["sighting detailswe live less than 5 minutes from the akron-canton airport and an army airfield base, as well as about 10 minutes from the boeing akron airdock for the goodyear blimp, so we are very accustomed to seeing many types of aircraft in the sky around our home. furthermore my father in law is an jet mechanic, so he and my husband both know and are able to recognize many types of aircraft in the sky. several times during the summer and now again tonight we noticed a very bright white light high in the sky moving erratically and making zig zag patterns or drawing geometric shapes in the sky. the movements the light was making were not anything that we know to be possible by any type of known aircraft. these movements were fast...and the light was able to dart from one spot in the sky to another in a fraction of a second...we would be watching it and it would disappear and almost simultaneously reappear in a different spot and continue the pattern movements and then it would just shoot off and disappear completely. we have seen this light about 6 times since august 2008 and it never lasts more than 2 minutes. we've not been able to capture it on film, but are now keeping our video camera by the door in case we see it again. when we saw it this evening, 12\\10\\08 it was aproximately 9:48 p.m. and we saw the light for about 45 seconds."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.082925,+-81.509205(14347)&iwloc=A&hl=en\"> mufon case (14347) map </A>","Weather Factors":"Unknown","Date of the Event":"12/10/2008 12:00 UTC","Region":"Ohio","Viewing Distance":"Unknown","Latitude":"41.082925","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around December 10th 2008"],"Object Flight Path":"Path with directional change,Other","files":["/var/www/straped/mufon/html2text/14347.html.txt","/var/www/straped/mufon/org/14347.html"],"Object Shape":"Sphere, Unknown","Source":"MUFON"}