{"Longitude":"-110.925069","Source":"MUFON","Date of the Event":"12/09/2008 12:00 UTC","Disposition":"Insufficient Data","Object Shape":"Unknown","City":"Tucson","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around December 9th 2008"],"divs":["Sighting DetailsI can't explain the time lapse from 10pm-6am but both my boyfriend and I do not remember going to bed last night. We had a few cocktails after work at home -which is usual. We put in a movie to watch and we both remember the opening credits but nothing else. I woke around 6 am, the clock said it was 8:30 am but it was still dark. I got up from bed with a bad stomach ache and stepped to the floor, instead of my carpet I stepped on a piece of my artwork a heavy painting was at the foot of my bed with my boyfriend's belt coiled on top. I accidently stepped on it and asked him what it was doing on the floor? He said I have no idea. Then I go to my kitchen and the back door is unlocked, my purse in the window with money hanging out, none taken. We always lock the door, not a great area we live in. Our heater was on in the kitchen, all the lights were on, the couch had been ruffled, also in the bathroom, things were out of place, the closet door was open. We both had stomach aches and we're so dehydrated we drank a gallon of water in 15 mins. between the two of us. Was there anything weird happening in Tucson last night??? I have a friend who referred us to your website. I guess the most odd thing was the painting because it's heavy and over a glass table and you would need to be very careful handling it. Also we are very energy saving in the fact that we do not leave lights on or a heater going or even doors open. Maybe you know something we don't? We considered the fact we could have been dosed but we did not share our drinks or food. So weird..thanks for listening."],"Latitude":"32.224643","Object Flight Path":"Undisclosed","Log Number":"US-12112008-0001","files":["/var/www/straped/mufon/html2text/14351.html.txt","/var/www/straped/mufon/org/14351.html"],"Date Submitted":"12/09/2008 12:00 UTC","Case Number":"14351","Object Features":"Undisclosed","Region":"Arizona","Weather Factors":"Unknown","Viewing Distance":"Unknown","Summary":"Loss of time/no memory.","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.224643,+-110.925069(14351)&iwloc=A&hl=en\"> mufon case (14351) map </A>","Sighting Duration":"Undisclosed","Tags":"City"}