{"trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around December 10th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.537233,+-119.807663(14361)&iwloc=A&hl=en\"> mufon case (14361) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"39.537233","files":["/var/www/straped/mufon/html2text/14361.html.txt","/var/www/straped/mufon/more/14361_submitter_file1__shot3.jpg","/var/www/straped/mufon/more/14361_submitter_file2__shot3spots.jpg","/var/www/straped/mufon/more/14361_submitter_file3__shot1.jpg","/var/www/straped/mufon/org/14361.html"],"Date of the Event":"12/10/2008 12:00 UTC","Summary":"Multi colored squiggle line UFO over Reno for days.","Country":"United States","divs":["Sighting DetailsFor several nights now I've noticed a brilliant multi colored sparkling light over the Washoe valley. To the unaided eye it appeared to have several colors flashing. So I took photos and blew them up to a good size. Just to make certain that what I was seeing was true I also took photos of stars around this light. The photos of the sparkling object showed a multi colored squiggle, changing shapes every time I took a new shot. The photos also showed the stars around and behind that were perfectly round and normal. My house is situated north west of Reno and I'm looking south east. I can't tell exactly where this thing is but I really had to blow the pic up. This object has been over the valley for several days now. It has the same appearance of objects that were photographed over Texas early 2008. One of the photos I've attached shows the 2 stars in the background to compare with."],"Longitude":"-119.807663","Disposition":"Hoax","Case Number":"14361","Object Flight Path":"Undisclosed","City":"Reno","Sighting Duration":"Undisclosed","Log Number":"US-12112008-0011","Object Features":"Undisclosed","Tags":"City","Object Shape":"Star-like","Date Submitted":"12/10/2008 12:00 UTC","Weather Factors":"None","Region":"Nevada"}