{"Country":"United States","Object Shape":"Cigar, Cylinder","Object Features":"Undisclosed","divs":["sighting detailsmy friend and i were outside putting up christmas lights on my front porch. in the sky there were a few puffy, white clouds and there was a light breeze. the temperature was approximately forty degrees fahrenheit. an object in the northern sky at about sixty degrees caught our attention. it was a bright, silver, cigar-shaped object that was about 1\\2\" long at arm's length. it had no lights, no wings and there was absolutely no contrail. it was moving very rapidly on its longitudinal axis on a horizontal plane. it moved in complete silence. from the moment it came into our view until it disappeared into a cloud, approximately six to eight seconds elapsed. quite a bit of air traffic is visible in the sky over this area at any given time. no matter at what altitude aircraft are observed, there is always the sound of their engines, either at the moment of sighting or within seconds thereafter. the object we saw was low enough to have left a significantly audible engine noise in its wake, but there was no sound from it at all. i believe that what we saw was not an airplane or helicopter, nor was it a balloon or dirigible."],"Source":"MUFON","trends":["There has been one other sighting in Heiskell","There were no other sightings in Heiskell on or around December 4th 2008"],"Disposition":"Unknown","Case Number":"14363","Weather Factors":"Unknown","Longitude":"-84.04919","Object Flight Path":"Straight-line path","Region":"Tennessee","Viewing Distance":"Unknown","City":"Heiskell","files":["/var/www/straped/mufon/html2text/14363.html.txt","/var/www/straped/mufon/org/14363.html"],"Log Number":"US-12112008-0006","map":"<A HREF = \"http://maps.google.com/maps?q=36.09107,+-84.04919(14363)&iwloc=A&hl=en\"> mufon case (14363) map </A>","Date of the Event":"12/04/2008 10:30 UTC","Tags":"City","Summary":"Silver cigar-shaped object seen moving rapidly from north to south in the morning sky.","Date Submitted":"12/04/2008 10:30 UTC","Latitude":"36.09107","Sighting Duration":"00:00:10"}