{"Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Summary":"Triangle sighting with missing time.","Object Shape":"Fireball, Triangle","Date Submitted":"12/10/2008 09:40 UTC","Country":"United States","Case Number":"14366","files":["/var/www/straped/mufon/html2text/14366.html.txt","/var/www/straped/mufon/org/14366.html"],"City":"Norman","divs":["Sighting Details My wife and I are living in Oklahoma right now, about two hours South of Oklahoma City, but we are in the process of moving to the East coast to open a business. Having spent the last two weeks in Virginia, we were on the last leg of our trip back home, having just exited I40 onto I35 south. Once we passed through Norman, I realized I had taken the wrong road home, as we live further west than I35 would take us. We found a small highway, Highway 9 that would take us further west to the highway we actually wanted to be on (Hwy 44) without backtracking. The highway was busy, and people were speeding. I was just trying to maintain the posted speed limit, and avoid being run over, when my wife said 'What is that?' I looked where she was pointing, outside her window, and I saw an extremely odd sight. For my wife not to be able to identify a series of lights is no small thing, since she is an Army brat and has lived near military bases her entire life. The road sort of bent to the left and that's when all the high strangeness began... At first, It looked like a line of whitish lights with orange lights sort of bookending them in a row, but as I kept looking, the craft sort of turned and showed its bottom to us. It was a triangular craft, with orange lights on the corners, and a bluish white light in the center. Because of the location and the ambient light in the area, we could see it pretty clearly. I remember seeing the center light pulse once, getting slightly brighter. It moved very slowly, around 300 ft off the ground. I remember seeing a military style helicopter between us and the craft, and there was plenty of other air traffic. In fact, as I turned around to look again at the windshield, there appeared on the horizon five or six roundish orange orbs, but they were only there for a second. In your instructions, you ask us to desribe how you lost sight of the object, but I have to say, those details are a little fuzzy. I've asked my wife and she says the same. One second, we were looking at this object, the next we were looking at these orbs out the windshield and then it was over. Or so we thought... Now here is the weirdest part of all. We had been on the road since 7am, having stayed with a friend overnight in Knoxville, TN. All the time we spend on the road, I spend those miles contemplating our arrival time. I am always checking the clock, which is easily seen with a glance. The last time I looked at the clock, it was 9:40 exactly. I had a pretty firm estimation that we would be pulling into our driveway at 11. As we turned the corner, saw this craft and realized what it was we saw, the clock read 10:28. My wife has chronic back pain, and she watches the clock for a completely different reason; to make sure she is spacing her pain meds out properly. She had estimated that she would be home before she needed to take them again. The last time she looked at the clock was also 9:40, because she was doing her own clock watching. Somewhere we both lost exactly 48 minutes. We were travelling with our dog, who, as we came around the corner, was sitting with his back to us, calmly staring up into the sky. He never stargazes, or even looks up. As we turned that corner, we noticed that for a couple minutes, we were the only car on the road, when just seconds earlier, there was pretty heavy traffic. We were all questions all the way home, and we thought we should share our experience. Thanks for all you do!"],"Log Number":"US-12112008-0009","Disposition":"Unknown","Date of the Event":"12/10/2008 09:40 UTC","Region":"Oklahoma","Latitude":"35.230757","Weather Factors":"Unknown","Longitude":"-97.434838","trends":["There have been 22 other sightings in Norman","There were no other sightings in Norman on or around December 10th 2008"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"None","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=35.230757,+-97.434838(14366)&iwloc=A&hl=en\"> mufon case (14366) map </A>"}