{"Object Shape":"Star-like","Log Number":"US-12112008-0008","Date of the Event":"12/08/2008 12:00 UTC","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14365.html.txt","/var/www/straped/mufon/org/14365.html"],"divs":["Sighting DetailsI live out near Leon Springs, NW of San Antonio, Texas, out I-10. I had been working outside and was taking a brake. It was completely dark by this time. I have always sky and star gazed, and that night I was checking out the latest separation between Jupiter and Venus. As I continued scanning the sky, I saw a very bright (larger than Venus) light in the sort of north, north western sky. At first I thought it was an airplane approaching with its landing lights on, but I didn't see the port or starboard lights. There were no flashing lights at all. I could see the motion of the object as it moved very slowly across the sky, left to right (heading SE?). At this point I started to think it was a satellite that was reflecting a lot of sun light because of its height in the atmosphere. After about 3 or so minutes, the object had only crossed about halfway across the sky. Way slower than any satellite I had seen before, but assumed the object must have been more or less approaching me, so I thought nothing of it. At about that time the object began to fade. I attributed this to the object entering a hazy area of the sky, light or dust interference, I didn't know. Then the light became dimmer and dimmer, and within a very sort time disappeared. That shouldn't have happened. As I thought of explanations for this I came to only one seemingly valid conclusion. The object could only have been climbing and left the atmosphere. The light wasn't dimming and getting smaller because of haze; it was getting smaller and fading because it was getting farther away. This immediately bothered me, and this is why. I have more than the average persons experience with military aircraft, NASA, and astronomy. I am not claiming to be an expert on these matters; however I'm not a hayseed either. I like to understand what I see, and I like to have explanations for what I don't understand. I am usually able to explain most of what I see, and although I am satisfied with my explanation of this incident, I still want to know what it was that I saw. That is what bothers me. I have not been able to answer that question. No one else, that I know of, saw what I saw. It wasn't that obvious, but that doesn't help. I have done some internet research and have found no answers, or possible explanations, such as recent launches by anyone, such as missile firings, or anything else that might answer my questions. I guess it could have been something from White Sands Missile Range in New Mexico, but that seems to be a little far fetched; far away and not a reasonable answer. It was to large to have been anything smaller than a commercial aircraft. So... There you go. That's my UFO story. I would very much appreciate a response from ya'll, even if it's just to say, \"Huh\". Sincerely, [CMS - Name Removed] Educator"],"trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around December 8th 2008"],"Date Submitted":"12/08/2008 12:00 UTC","City":"San Antonio","Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"29.433532","Viewing Distance":"Unknown","Region":"Texas","Disposition":"Unknown","Case Number":"14365","map":"<A HREF = \"http://maps.google.com/maps?q=29.433532,+-98.492568(14365)&iwloc=A&hl=en\"> mufon case (14365) map </A>","Longitude":"-98.492568","Sighting Duration":"Undisclosed","Summary":"Satellite appearance - approached slowly for 3 to 4 minutes, then left the atmosphere.","Object Flight Path":"Undisclosed","Country":"United States"}