{"Summary":"Nose and wing lights one in center two flashing red.","files":["/var/www/straped/mufon/html2text/14362.html.txt","/var/www/straped/mufon/org/14362.html"],"Source":"MUFON","City":"Fort Worth","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around December 11th 2008"],"Date Submitted":"12/11/2008 12:20 UTC","divs":["sighting detailson my way home from work with my rider we seen what we thought was a helicopter at first but it was moving rather oddly and looked like it was out of phase in time. we were both wondering if there had been a wreck on the hwy (377) or something at it was the police helicopter from fort worth. it would stop in air the move real slow as like it was gliding. i could swear i was seeing a thin light blue beam every once and awhile from it.when we got closer and it passed over the highway in front about 1\\4 of a mile in the air away from us we could see the outline of a definite triangle craft not a helicopter. the space shuttle was piggy backed in today at cardwell joint airbase and we both discussed maybe it was a patrol plane (it was the size of a f-16 but it would stop a stay motionless with no sound the just glide along a little farther towards benbrook lake. last year about this time many of us seen the same craft minus the flashing red lights over bourland field about 3 miles futher south west down 377. i wrote you then amd told you i was as close as 300 feet or so that time seen it plain as day in a high fog covered sky making 180 degree turns sitting motionless in the air no wiper blade wash in the high fog above it no sound then it glided back towards benbrook lake as well. told people at work they kidded me about seeing little green men then a few wekks later they were all the talk of stephenville so they kidders shut up and starte asking me what i had seen. so if it goes like that again you be sending someone down here with a few night vision video cameras to stephenville to see if someone can get the video proof of what's flying over our lands. thanks for your time that's all i saw might not mean much but that's what i saw."],"Log Number":"US-12112008-0012","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:04:30","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=32.726929,+-97.31483(14362)&iwloc=A&hl=en\"> mufon case (14362) map </A>","Date of the Event":"12/11/2008 12:20 UTC","Tags":"City","Disposition":"Unknown","Weather Factors":"None","Case Number":"14362","Region":"Texas","Object Features":"Dome","Country":"United States","Latitude":"32.726929","Longitude":"-97.31483"}