{"Tags":"City","divs":["Sighting DetailsIn october of 2002, my wife and I were visiting her sister and boyfriend, now husband at his apartment. The apartment was in Glendale about 10 miles west of I-17 and 75th Ave. Everyone had gone to sleep for the night except my brother in-law and I, we were still up playing SOCOM U.S. Navy Seals on the Playstation 2. It was very late, somewhere around 3 a.m. when we decided to step outfront to have a cigerette. We were standing out there just to the left of the stairwell, in the grass smoking and talking when I just happened to glance up at the sky. I turned to my brother in-law and said \"what is that\"? Directly above us blotting out almost the entire night sky was a giant wing typed craft, like across between a triangle and a boomerang. I can still remember his exact words were \"I have no f-ing idea\". We did not utter another word, as the craft passed and was infront of us now it was as wide as my entire horizon in front of me, which I estimate to be about a mile. We watched as it slowly made its way west and out of our view. We did not speak of it again after that, we just went back inside and continued our game. It wasn't for a little over a year before I brought it up to him again, it felt like I just remembered \"the incident\" a year later, like I hadnt thought of it before right then, and to this day he still offers very little conjecture about what \"it\" was we saw. All I can say is that whether it was military or other worldly, this boomerang shaped craft was completely silent and emitted no light, and it was huge."],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/14368.html.txt","/var/www/straped/mufon/org/14368.html"],"City":"Glendale","Object Shape":"Boomerang, Triangle","Latitude":"33.548352","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","Date Submitted":"10/10/2002 02:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.548352,+-112.184647(14368)&iwloc=A&hl=en\"> mufon case (14368) map </A>","Sighting Duration":"00:02:00","Country":"United States","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around October 10th 2002"],"Source":"MUFON","Object Flight Path":"Straight-line path","Case Number":"14368","Region":"Arizona","Summary":"Giant wing shaped craft.","Disposition":"Unknown","Log Number":"US-12112008-0011","Date of the Event":"10/10/2002 02:45 UTC","Longitude":"-112.184647"}