{"Disposition":"Hoax","Log Number":"US-12112008-0010","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"12/10/2008 01:21 UTC","Longitude":"-94.877968","Sighting Duration":"01:08:01","divs":["Sighting DetailsI was walking my dog, Rosie when all of a sudden I saw an unidentified flying object. It spoke to me and said look at the blue light in German, which is funny because I speak English but took German back in high school. The blue light was tingly and effervescent. I first noticed it because it was so big and blue (that's what she said). I said What the Eff cuz I didn't know what it was but I thought it was a UFO. It was blue and lightey and it moved back and forth really fast like. And it made me eat onions on my hoagie hut hoagie which I hate because then I taste onions for the rest of the day but I love onions just not in the middle of the day when I have to taste them the rest of the day that sucks. I really didn't want to eat the onions but they were delicious. stupid aliens!! I don't know how I lose sight of the object, maybe it was when I passed out from all the jack daniels I had just drank before coming out to walk my dog, before noticing that I wasn't walking a dog at all, but it was actually a blender that I was making jack slushies with."],"Weather Factors":"Unknown","Region":"Minnesota","Country":"United States","Summary":"It looked like a bottle of jack on crack","trends":["There have been 4 other sightings in Bemidji","There were no other sightings in Bemidji on or around December 10th 2008"],"Object Flight Path":"Undisclosed","Date of the Event":"12/10/2008 01:21 UTC","Object Shape":"Boomerang, Disc, Fireball","Latitude":"47.475321","City":"Bemidji","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14367.html.txt","/var/www/straped/mufon/org/14367.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.475321,+-94.877968(14367)&iwloc=A&hl=en\"> mufon case (14367) map </A>","Case Number":"14367"}