{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"06/30/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.911203,+-77.549989(14379)&iwloc=A&hl=en\"> mufon case (14379) map </A>","Summary":"Looking west, I saw a brilliant red light moving north and making no noise.","Region":"Pennsylvania","Date of the Event":"06/30/2008 12:00 UTC","trends":["There has been one other sighting in Fayetteville","There were no other sightings in Fayetteville on or around June 30th 2008"],"files":["/var/www/straped/mufon/html2text/14379.html.txt","/var/www/straped/mufon/org/14379.html"],"Tags":"City","Object Features":"None","Log Number":"US-12122008-0006","Object Shape":"Unknown","Case Number":"14379","Object Flight Path":"Straight-line path","Weather Factors":"None","City":"Fayetteville","Disposition":"Insufficient Data","Country":"United States","divs":["Sighting DetailsI was outside my home walking my dog in the yard. My house is next to the mountains and Michaux State Forest. It was a clear night, no moon, and the stars were clear and numerous. Looking West, I saw a very brilliant red light moving to the North. The object seemed fairly close to me, and at about the altitude of a low flying private aircraft. The red light was very bright, quite a bit brighter than I would even expect from landing lights at that distance. My first thought was that an aircraft moving left to right in my view should display a green marker light. A red light should either not be visible, or be dimmer. I also noted that I could hear no engine noises of any kind. The object moved in a straight line, and quickly passed out of sight behind the mountain. I looked around and could see no other traffic in the sky. I cannot say if the light was the whole of the object, or was attached to something larger that was not lit. The sighting was fairly brief, and I did not think in time to see if stars were occluded near the light. I was and continue to be curious about what I saw. I have a digital camera, but knew when I saw the red light that there would be no time to get it. I wish I had noted the date and time of this event, but at the time, had no thought of sharing my experience. I have felt compelled to submit this report after seeing the recent UFO program on the History Channel about mass sightings in PA. I pay attention to the stars and air traffic. I have seen other odd things that have attracted my attention, but this is the least explainable. Bright landing lights in the distance can appear strange unless you wait them out until the aircraft come closer."],"Source":"MUFON","Longitude":"-77.549989","Latitude":"39.911203","Sighting Duration":"Undisclosed"}