{"Object Shape":"Disc","Weather Factors":"Unknown","Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14374.html.txt","/var/www/straped/mufon/org/14374.html"],"Date of the Event":"12/11/2008 06:20 UTC","Longitude":"-114.735361","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.071682,+-114.735361(14374)&iwloc=A&hl=en\"> mufon case (14374) map </A>","Source":"MUFON","Date Submitted":"12/11/2008 06:20 UTC","Case Number":"14374","Region":"Idaho","Summary":"While traveling home from work, I seen approaching above in the sky above. Believed at first, possibly an airplane, However, as the object became closer and lower in altitude, I realized it had no wings and was disc shaped.","City":"Boise, Kuna, Namp","Log Number":"US-12122008-0001","trends":["There have been no other sightings in Boise, Kuna, Namp","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsThe time was approximately 6:20 p.m MST. I was traveling home from work on ten mile road. I was at a four-way stop intersection, looked up, and seen lights in the sky approaching from the distance. My first thought was that the object was an airplane. However as the slowly and soundlessly approached closer, I could then see it had no wings and was circular in shape. I felt shocked, there was no noise, it came to low altitude, silently glided above, then tilted, and I could see the bottom of the object, greyish, metalic in color, lights along its circular edges, and a center light on the bottom. There was also one arm,, how to say,, something that extended from the top or side portion of the object,,, it tilted slowly, as I stated previously, while tilting it then turned south eastward. Difficult to explain. Do not know what the object was,, felt really shocked,, it was completely silent. When it tilted, I could clearly see the surface was not smooth on the bottom, had a odd pattern that much reminded me of a maze design or something,, really odd. As I continued to drive home,, felt really stunned, trying to make logic and sense of what I had just seen,, trying to determine if it was a satellite taking geographical photographs, or a little satellite,, don't know. Anynomous"],"Viewing Distance":"101-500 Feet","Latitude":"44.071682"}