{"map":"<A HREF = \"http://maps.google.com/maps?q=27.201238,+-80.251796(14377)&iwloc=A&hl=en\"> mufon case (14377) map </A>","City":"Stuart","Tags":"City","divs":["Sighting DetailsMy girlfriend and I were driving over a bridge in Stuart FL heading to her house in port st lucie. We were decending down the bridge. As we got to the stop light. I noticed A red auborn light sitting in the sky. I have lived here for 14 years in the same samll town. So I knew right away it was odd. My first words were, \"What the hell is that\"? She said \"I dont know\" As we came up closer to it it was on the east side of US1 Federal hwy. It was as high in the air as a small hotel wich it happend to be next to a small hotel. Mabey 100 to 200 feet up. It was not moving so I said \"oh its got to be a tower\". Then as we pass it she says to me. \"No there is no tower\". So as we pass buy it two more lights come on. They were wite. We could see that it was infact not a tower, it was completly silent, and it was hovering over us not more then 200 feet up and it was a triangle. Thats when we pulled over and got out on the side of the road. As soon as we stoped. It started to move as if it knew we saw it, as if it was retreating. We watched it move form its place as it started to move away. It moved in the oddest way. It was slow. Way to slow to be anything normal. At the same time though it was so far away sooooo fast. We watched it slowly come out in the middel of US1. Then we noticed that 3 more lights on one side of the triangle came on, and one in the middle, and it started to go southeast across US1 going over trees. I can only describe its movement as very shakey but slow and sturdy at the same time. At that point we wanted to chase it. She kept screaming my name. \"Chris get in the car\" !! I was so fixed I could not look away. Finnaly I heard her and we made a U-turn and started heading south. Mind you we were not that far from the birdge we just came off of. We were not even at the second light from the bridge. So it took us mabey 30 seconds to get where it was headed. We thought ok well it went over the trees. Lets drive over the bridge agian. We will see it from that hight. We would have. The bridge it a very high bridge. As soon as we got to the begining of the bridge it was already gone. I mean we were with in 2 mabey 4 feet form seeing this thing over the trees when we were on the bridge. Wich if it was a plane helicopter or anything like that. Reguardless of what it looked like we there is no disscusion that we would have see it once we were on the bridge. It was gone. We drove over the bridge and back over agian. We never saw it. I have seen many ufos. Close to 13 or 14 in my life. My girl friend did not even belive. She was in shock. I was in awe. I must tell you guys it felt like what ever this thing was it knew we saw it and ran after we saw it. She said to me I belive now. And that she noticed that her whole life she has never seen anything like that, and that it only seems to happen when she is around me."],"Longitude":"-80.251796","files":["/var/www/straped/mufon/html2text/14377.html.txt","/var/www/straped/mufon/org/14377.html"],"Latitude":"27.201238","Country":"United States","Log Number":"US-12122008-0004","Summary":"It was a triangle that had lights on each point and on one side had 3 separate lights.","Object Features":"Unknown","trends":["There have been 17 other sightings in Stuart","There were no other sightings in Stuart on or around November 23rd 2008"],"Region":"Florida","Date Submitted":"11/23/2008 10:00 UTC","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Date of the Event":"11/23/2008 10:00 UTC","Weather Factors":"None","Viewing Distance":"20 Feet or Less","Object Shape":"Triangle","Case Number":"14377","Disposition":"Insufficient Data"}