{"Object Shape":"Cylinder, Other","Summary":"Previously reported sighting Oct 2008 in Freestone County but I have attached what we were able to capture on digital.","Region":"Texas","Date of the Event":"10/20/2008 06:30 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=31.727093,+-96.157048(14372)&iwloc=A&hl=en\"> mufon case (14372) map </A>","City":"Fairfield","Longitude":"-96.157048","trends":["There have been 8 other sightings in Fairfield","There were 5 other sightings in Fairfield on or around October 20th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI previously reported this sighting but made a mistake about the date, I originally thought it happened on October 21, 2008 but realized that this sighting actually happened on October, 20th. I apologize in advance for the picture (in fact you may not be able to see much and I am not good with altering the shot, I am hoping you can do what is necessary). What we observed with the naked eye and what we caught on digital camera look like different things. The picture is taken at sunset and we were looking at three very long cylinder, phone pole looking lines (almost like jet trails). They caught our attention because they did not begin to break up as jet trails do and as we took a closer look, they seemed to be highly reflective and almost shiny. They were suspended in a perfect line across the sky just above the tree line. In the picture the cylinders look more like round white orbs (not sure why). You can see all three of them in the lower left area of the picture beginning just above the trees. We went back inside after looking at them for a long time because it had gotten dark, when we looked again later, we could not see them. We have had several other strange sightings since (the last one on Dec. 7th)but caught nothing else on film. I wish we had professional equipment! I have spoken to a regional MUFON investigator twice and he has been very helpful."],"Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Log Number":"US-12112008-0015","files":["/var/www/straped/mufon/html2text/14372.html.txt","/var/www/straped/mufon/more/14372_submitter_file1__HPIM1615.JPG","/var/www/straped/mufon/org/14372.html"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"14372","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"31.727093","Source":"MUFON","Date Submitted":"10/20/2008 06:30 UTC"}