{"Sighting Duration":"Undisclosed","Region":"Florida","Object Shape":"Star-like","Date of the Event":"12/12/2008 09:15 UTC","Tags":"City","Weather Factors":"None","Latitude":"30.173254","Summary":"Sparkling star.","map":"<A HREF = \"http://maps.google.com/maps?q=30.173254,+-81.705054(14383)&iwloc=A&hl=en\"> mufon case (14383) map </A>","Country":"United States","Case Number":"14383","Date Submitted":"12/12/2008 09:15 UTC","trends":["There have been 8 other sightings in Orange Park","There were no other sightings in Orange Park on or around December 12th 2008"],"Log Number":"US-12122008-0010","Source":"MUFON","Longitude":"-81.705054","divs":["Sighting DetailsMy husband and I went out to look at the moon because tonight it is supposed to be the brightest all year. Found out about this on the computer. The moon is really bright, the light seems to illuminate from it. I was looking at the moon and saw this star that was flickering and since I have seen this before, I knew what it was. I went to get the binoculars and when I looked at it, all I could say was Oh, wow! It had these red and green lights on it that seemed to flicker or pulsate. I gave the binoculars to my husband so he could see it, and he was as astonished as I was. You could even see the red lights flashing on it with just the naked eye. I looked around the sky and saw another object that had the red and green lights on it as well, but a lot smaller then the first object. There were a couple of planes that were flying around these objects. Don't know if they were out there because of the moon or if they were checking out the strange objects. They were both stationary, but seemed to move very slowly. Looking at them through the binoculars, they looked like they were kinda bobing around. We had to come in because it is very cold out side tonight. I just looked out side and they are still there. This isn't the first time I have seen this, but every time I do, it is very exciting, sometimes when I have seen them, I feel a little uneasy, but didn't feel that way tonight. I would really like to know what it is out there. I feel I'm looking at a UFO, but I'm not sure if it is or not. Has anyone else ever seen an object as we have seen? What can MUFON, tell me about it? Is this considered to be a UFO?"],"files":["/var/www/straped/mufon/html2text/14383.html.txt","/var/www/straped/mufon/org/14383.html"],"City":"Orange Park","Disposition":"Unknown","Object Features":"Unknown","Object Flight Path":"Stationary","Viewing Distance":"Unknown"}