{"Date Submitted":"12/12/2008 08:20 UTC","trends":["There have been 7 other sightings in Brazil","There were no other sightings in Brazil on or around December 12th 2008"],"Date of the Event":"12/12/2008 08:20 UTC","City":"Brazil","divs":["Sighting DetailsMy husband and I were driving on I-70 west, coming home from Brazil to Terre Haute. We were about half-way there when I noticed a reddish light just above the treeline, on the left side of the road. It looked like a dim, oval star, kind of flat, and I thought to myself that it looked somewhat like the planet Mars, but larger and a little brighter (and misshapen). I noticed it because I'd been looking at the sky a few minutes before and hadn't seen anything like it. I didn't say anything to my husband at first, but I kept watching. It stayed in the same place, and after maybe five minutes I lost track of it as we passed under a bridge in a more densely wooded area. A few minutes later I saw it again, this time on the right side of the road, still slightly above the treeline, just hovering. As we reached a bend in the road and headed into a clearing, I got a better view and finally asked my husband if he saw it too, and he did. As we watched it looked like it was flashing, but not like a strobe, rather, the light was steady but looked like it faded off and on, from rust-red to orange-yellow. We went through a list of what it could be, from a microwave tower to a plane, none of which matched what we were seeing. After a few more minutes of watching it, we ran into more trees for a just a moment, and when we cleared them it had disappeared. By this time we'd reached Terre Haute. As far as our feelings, I definitely felt curious, and a little excited. My husband seemed a little apprehensive."],"Case Number":"14381","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Region":"Indiana","Weather Factors":"None","Log Number":"US-12122008-0008","Latitude":"39.530242","map":"<A HREF = \"http://maps.google.com/maps?q=39.530242,+-87.122415(14381)&iwloc=A&hl=en\"> mufon case (14381) map </A>","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Flash, Oval, Star-like","files":["/var/www/straped/mufon/html2text/14381.html.txt","/var/www/straped/mufon/org/14381.html"],"Object Flight Path":"Stationary","Disposition":"Unknown","Longitude":"-87.122415","Summary":"Strange reddish light, stationary above treeline.","Tags":"City"}