{"Summary":"A line of white appeared in the sky, and it flashed rectangular bands of rainbow energy near our car.","Date of the Event":"12/07/2008 05:10 UTC","Date Submitted":"12/07/2008 05:10 UTC","Object Features":"Undisclosed","Object Shape":"Bullet, Missile","map":"<A HREF = \"http://maps.google.com/maps?q=41.487559,+-71.51442(14390)&iwloc=A&hl=en\"> mufon case (14390) map </A>","Log Number":"US-12132008-0004","Region":"Rhode Island","trends":["There have been 66 other sightings in South Kingstown","There were no other sightings in South Kingstown on or around December 7th 2008"],"Weather Factors":"Unknown","divs":["sighting details my brother and i were driving south bound on rt 1 near kingston ri at around 5:10-5:15 p.m, to visit our mother and sister. i was looking west out the window at the sky, when i noticed 3 blinking, bobbing lights like stars in a triangular formation in the sky. they were blinking white, green and pink. at first i ignored it and turned away. but when i looked again, between them was a line of white light between them. as i continued to look on trying to figure out what i was looking at, a series of rectangular bands of shimmering rainbow energy\\light began glowing between the power lines only 15 to the right of the car. these bands appeared and disappeared 3 times as we drove down the road before i iost sight of the lights in the sky. i couldn't believe what i was seeing. i yelled to my brother to look at the lights to my brother but he couldn't see the power lines as they were blocked by the roof of the car, and we were rounding a big curve in the road. i was very excited, and felt like i was being shown something very special. for the past month i have seen similar lights in the sky. one outside of my window in my apartment, which i showed to roomates, and also similar lights at my brothers apartment, though i have never seen rainbow bands of light like i did that night."],"Tags":"City","Viewing Distance":"Unknown","Country":"United States","Case Number":"14390","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14390.html.txt","/var/www/straped/mufon/org/14390.html"],"Longitude":"-71.51442","Latitude":"41.487559","Source":"MUFON","City":"South Kingstown","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}