{"map":"<A HREF = \"http://maps.google.com/maps?q=39.959205,+-75.160579(14398)&iwloc=A&hl=en\"> mufon case (14398) map </A>","Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","City":"Philadelphia","Log Number":"US-12132008-0012","Sighting Duration":"Undisclosed","Summary":"Rotating Colored Lights","Object Flight Path":"Stationary","divs":["Sighting DetailsAt 9PM my girlfriend Ronna, noticed a bright flickering light in the sky from our aptartment window. I went to look and noticed not only was it flickering but appeared to change color and speed that the colors changed. I grabbed a pair of low power binocs and my cell phone to use the electronic compass feature. Looking through the binocs, it was clear enough to make out 3 distinct colors of red, green and white, whcih seem to be on the corners of what appeared to be a triangular shape. The lights were changing color from tip to tip of the triangle. On my compass the heading was 37 degrees NE, just below \"Orion's Belt\". The activity seemed to become static. A plane flew just beneath it and the flickering pattern began again and very fast. I observed other lights and stars in the sky to base it as the brightest light in the sky. it is now 9:40PM and it still remains in the same position in the sky and still active. (note : about 2 weeks back we both experienced the same exact thing 2 miles from here, directly opposite in compass position in the skies over what would be Montgomery County, PA. but viewed with the naked eye during peak Philly air traffic) KG"],"Date Submitted":"12/13/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14398.html.txt","/var/www/straped/mufon/org/14398.html"],"trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around December 13th 2008"],"Longitude":"-75.160579","Case Number":"14398","Object Shape":"Triangle","Region":"Pennsylvania","Date of the Event":"12/13/2008 12:00 UTC","Latitude":"39.959205","Disposition":"IFO"}