{"Country":"Puerto Rico","divs":["Sighting DetailsA similar experience of the oval spheres in the room of a lady, who reported a simmilar case like mine. I am a Mufon member an I have been reluctant to mention something so incredible & amazing like this that marks to the redeculous. During the past several months I have noticed while awake in my bed that the wall in front of me shows a small bean of light which present not a reflection from a light or other object, this spot appears when I start thinking of it or it present by itself, this spot of life measure around half an inch and has moved to diferent side in the wall. What could this be? A soul of one of my ancestors I do not have a clue? If any one of the persons posting messages at Mufon site & have had a similar experience please; send a E-mail reflecting your point of view or similar experience. In the past I have had more than ten experiences with UFO including one when I was around 18 years old when I believe was abducted or visited from an allien. I have seen more than 8 eight different types of craft including a small moving clouds within a hundred to two hundred feet away."],"Source":"MUFON","Object Features":"Undisclosed","Latitude":"18.234122","Weather Factors":"Unknown","Date Submitted":"12/10/2008 12:00 UTC","Region":"","City":"Caguas","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=18.234122,+-66.048499(14399)&iwloc=A&hl=en\"> mufon case (14399) map </A>","Disposition":"Unresolved","Summary":"Spot of blinking light in my room for many months.","Longitude":"-66.048499","Object Shape":"Other","Sighting Duration":"Undisclosed","Date of the Event":"12/10/2008 12:00 UTC","Viewing Distance":"Unknown","Log Number":"PR-12132008-0013","files":["/var/www/straped/mufon/html2text/14399.html.txt","/var/www/straped/mufon/org/14399.html"],"trends":["There have been 3 other sightings in Caguas","There were no other sightings in Caguas on or around December 10th 2008"],"Case Number":"14399","Object Flight Path":"Undisclosed"}