{"City":"Show Low","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There have been 2 other sightings in Show Low","There were no other sightings in Show Low on or around September 20th 2008"],"Date Submitted":"09/20/2008 01:30 UTC","Source":"MUFON","Latitude":"34.274912","Summary":"Multi colored slowly pulsating lights app.100' aloft.","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"None","divs":["Sighting DetailsAs I was asleep in a camper type trailer atop a hill NE of Showlow, I was awakened by very bright lights coming into one of the windows. I sat up and after re-orienting myself, I looked out to the NE and saw several very large, intense, multi-colored, slowly pulsating lights. We were atop a hill and the lights were app. 100' off the ground and did not move. After a couple minutes, the colored lights went out and a single bright white orb appeared immediatley to the left of where the colored lights had been. This white light remained stationary for about 30 seconds and then began to move to the left and then at a faster pace, began to come in the direction of the trailer. At this point, I hurried to the rear of the camper, awoke my girlfriend and grabbed my handgun as I was certain of a contact with something or somebody. We both returned to the window and at this point the show was over. Everthing was totally dark. I was never able to make out the shape of any type of vehicle and can't make a guess as to how far away these lights were. And at no time did I hear anything out of the ordinary. I am a retired law enforcement officer and don't mind saying my legs were shaking and my knees got weak both during and for several hours after this episode."],"Case Number":"14392","Log Number":"US-12132008-0006","Sighting Duration":"00:02:45","Tags":"City","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=34.274912,+-110.002817(14392)&iwloc=A&hl=en\"> mufon case (14392) map </A>","Region":"Arizona","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14392.html.txt","/var/www/straped/mufon/org/14392.html"],"Longitude":"-110.002817","Date of the Event":"09/20/2008 01:30 UTC","Object Features":"Unknown"}