{"Object Features":"Appendage(s), Other","trends":["There have been 4 other sightings in Weed","There were no other sightings in Weed on or around September 29th 2007","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Summary":"Day sighting, landed or hovering over rural dirt road. Extremely shiny, bright tubular metal object, cloaked itself.","map":"<A HREF = \"http://maps.google.com/maps?q=41.43026,+-122.377577(14395)&iwloc=A&hl=en\"> mufon case (14395) map </A>","Tags":"City","Date Submitted":"09/29/2007 11:45 UTC","files":["/var/www/straped/mufon/html2text/14395.html.txt","/var/www/straped/mufon/more/14395_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/14395_submitter_file2__MillerMtnUFO.jpg","/var/www/straped/mufon/more/14395_submitter_file3__Landingpositionview1.jpg","/var/www/straped/mufon/more/14395_submitter_file4__Landingpositionview2.jpg","/var/www/straped/mufon/more/14395_submitter_file5__Landingpositionview3.jpg","/var/www/straped/mufon/org/14395.html"],"Longitude":"-122.377577","Log Number":"US-12132008-0009","City":"Weed","Country":"United States","divs":["Sighting DetailsMy husband and I were deer hunting on Miller mountain. It had snowed abit the night before up on the top, which made us happy because we could now spot fresh deer tracks in the new snow. All of the top dirt roads are dead ends and about 1-2 miles long. The snow clouds had cleared and we had a sunny sky with puffy clouds. We decided to take one of the \"back side\" western facing roads that takes you along the steepest part of the mountain, pretty much straight up and down and heavily forested. We were happy that morning to notice that there hadn't been any other vehicles up on the top back roads yet that day, because there were no tire tracks in the fresh snow. We proceeded to take our time along this road with my husband driving. We came over a rise about half way to the end and my husband said \"What's that?\". I was looking out of my side window for deer tracks and turned my head forward to look out the windshield ahead. I noticed a \"very shiny and brite\" metal object maybe 8'- 10' wide, in the road ahead apx. 50 to 75 yards away. Looking at it, the first words out of my mouth were \"Oh, there's a pickup ahead of us.\" It looked like a new, extremely shiny chrome pickup rollbar with two lights on top ... but I could not see a \"pickup\", only what I thought was a roll bar. Then my husband said \"No, there are no pickup tire tracks in the snow ahead of us and we are on a dead end road.\" As I leaned down to get the binoculars and come back up to look it was gone. I said \"Well, let's go to the end just to see\". We drove to the end and indeed, there were no fresh tire tracks in the snow at the end either. We talked about what we had seen, and came to the conclusion that no pickup could have gone over the edge of the cliff or gone up the side of the mountain ... it had to have been a UFO. I asked him what he saw as I was getting the binoculars off the pickup floor, he said \"it just kinda floated up abit off the road and disappeared.\" We did not see it again, nor did we stop and get out of the pickup where it had cloaked itself."],"Region":"California","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Latitude":"41.43026","Object Shape":"Other","Case Number":"14395","Disposition":"Unknown","Date of the Event":"09/29/2007 11:45 UTC","Source":"MUFON","Weather Factors":"None"}