{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Cigar, Star-like, Triangle","Object Features":"Unknown","Case Number":"14393","Source":"MUFON","Tags":"City","Disposition":"Insufficient Data","Summary":"30-40 moving star-like objects","trends":["There have been 2 other sightings in Marysville","There were no other sightings in Marysville on or around December 12th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/14393.html.txt","/var/www/straped/mufon/org/14393.html"],"Date of the Event":"12/12/2008 09:00 UTC","divs":["Sighting DetailsThis was witnessed by myself(Sandra), my son and his girlfriend. We live in forested, mountainous terrain. On the partly cloudy moonlit night of dec.12, at 9.p.m,my son was walking our dog when he looked up and saw 30-40 flying lights in the sky all goin east to west.He ran inside to get me and his girlfriend outside,and we also saw 1(one) large triangle and a long cigar like object hovering pretty far up, all of these object made no sound whatsoever, these craft had amber lights. My son's girlfriend saw one split apart and joined again.There was another one erratically shooting straight up in the sky.About 5 minutes later 2 planes making the distinct jet engine sound had flown over and circled a larger object but the object stopped moving when the planes had shown up.This lasted for around 15-20 minutes untill all the action had stopped,all the craft had flown out of view,every now and then a similar object would fly over the same direction east to west. Our feelings were of awe, curiosity and amazement, this is not the first time we have witnessed strange objects in the sky."],"Weather Factors":"Unknown","Latitude":"39.145725","Date Submitted":"12/12/2008 09:00 UTC","City":"Marysville","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Region":"California","Longitude":"-121.591355","Log Number":"US-12132008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=39.145725,+-121.591355(14393)&iwloc=A&hl=en\"> mufon case (14393) map </A>"}