{"City":"Chico","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Latitude":"39.730594","Region":"California","divs":["Sighting DetailsI was in Chico Calif..In the heat of summer the farmers did their tractor work in the cool of the evening. I read in the Chico Enterprise of farmers seeing these strange lights drifting all over the properties. I decided to go out and look see. It was a little after midnight and I was on the old highway going to Gridley when I stopped and watchad what looked like a streetlight moving slowly over an orchard. I found a rural road leeding in that direction and made my way in that direction. I came upon a small bridge over a creek. Got out of the car and observed several orbs a mile or so away slowly moving around. I got out of my car and sat on my hood for awhile when suddenly a huge light about the size of a large room just lit up. I got off the hood and walked one way than another, but I couldn't see any shape except for that huge light. It wasn't really bright..just a glowing orb. After a while I got in my car and drove home. I told my brother about it the next day and he wouldn't believe me..so I took him out the next night night about the same time. As we got on the new highway(99). We saw 2 orbs floating down a hill onto the valley floor. One continued down towards where I was the night before..the other one came towards the old highway and the light went out. I told my brother it landed and I could see by the outline of the hill just about where it went down. I drove back and onto the old highway. I msde a U turn and pulled off the road.We got out of the car and leaned against it..I noticed what looked like smoke all around the base of a power tower..I walked away on one side and than the other side..I could see for a couple miles..but not into the smoke..(they don't use smudge pots in July) I reached into my car to retrieve a flashlight when the hairs went up on my head and something warned me not to pick up the light. I told my brother to get in the car..we were leaving. We got back to the little bridge I was on last night and sat on the hood..It wasn't long before they were back and moving slowly in the distance. Suddenly two what looked like headlights came on off to out left and I told my brother there were someone else there..I decided to push the car off the bridge without the lights or motor so as not to give us away..Suddenly the two lights seperated and now I became concerned..I drove down into the orchard away from the bridge..I backed the car off the road so my lights could be seen from a distance and blinked my lights..nothing so we went on home. When I got back to the bay area I found the only group I could find that studied UFO'S..NICAP was run by Paul Cerny in palo alto. I joined and did some investigating work with him. He asked me to pick up a Mr J Allen Hynec at the S.F airport for his talk at the college in Santa Clara.."],"Summary":"5 or 6 hovering lg oval Light/ the size of a lg room less than 100 ft away.","Case Number":"14396","map":"<A HREF = \"http://maps.google.com/maps?q=39.730594,+-121.831278(14396)&iwloc=A&hl=en\"> mufon case (14396) map </A>","Tags":"City","Log Number":"UM-12132008-0010","Object Flight Path":"Undisclosed","Date of the Event":"07/12/1967 12:00 UTC","Longitude":"-121.831278","Viewing Distance":"Unknown","Source":"MUFON","trends":["There have been 24 other sightings in Chico","There were no other sightings in Chico on or around July 12th 1967"],"Weather Factors":"Unknown","Country":"United States","Object Features":"Undisclosed","Date Submitted":"07/12/1967 12:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/14396.html.txt","/var/www/straped/mufon/org/14396.html"]}