{"Date Submitted":"07/31/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14397.html.txt","/var/www/straped/mufon/org/14397.html"],"Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsi was t an outdoor music event when i took my break from the stage and went to lay on the hood of my car when i noticed it. the sphere was at a good height and at first i thought it was a plane or helicopter but noticed no movement. i then figured maybe it was the space station of shuttle, but no shuttle flights were up. i then thought maybe it was a satellite, but i dont think you can see any satellites from the ground at nearing sundown. i ask 3 other friends if they say it too but we all could not figure what it was. then i looked around and noticed other people had noticed it too. there were about 500 people at this event in a residential area. i cant be certain on date or time but we did notice this object just floating there not moving in synchronic orbit above us. i couldnt tell you the height but i would guess above 5000 ft. a few minutes later it seem to just disappear. i didnt see when or how but i just look back up and it was gone. a silver spherical object is the way i would describe it. i was not scared but confused at first then in awe. it was a sunday about 2 hours from sundown."],"Disposition":"Unknown","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around July 31st 2008"],"Country":"United States","Summary":"A silvery dot floating stationary at high altitude.","Sighting Duration":"Undisclosed","Weather Factors":"None","Case Number":"14397","Log Number":"US-12132008-0011","map":"<A HREF = \"http://maps.google.com/maps?q=42.336597,+-83.042114(14397)&iwloc=A&hl=en\"> mufon case (14397) map </A>","Object Shape":"Sphere","Tags":"City","Date of the Event":"07/31/2008 12:00 UTC","Source":"MUFON","Region":"Michigan","Latitude":"42.336597","Longitude":"-83.042114","City":"Detroit","Object Features":"None"}