{"Date Submitted":"12/12/2008 03:30 UTC","Disposition":"IFO","Summary":"Two purplish/white 1/2 dollar sized ping poning up and down inside room.","Case Number":"14403","Viewing Distance":"20 Feet or Less","Tags":"City","Object Shape":"Circle, Flash, Sphere","Date of the Event":"12/12/2008 03:30 UTC","files":["/var/www/straped/mufon/html2text/14403.html.txt","/var/www/straped/mufon/org/14403.html"],"Log Number":"US-12142008-0001","Sighting Duration":"00:03:00","Latitude":"33.846404","map":"<A HREF = \"http://maps.google.com/maps?q=33.846404,+-118.046731(14403)&iwloc=A&hl=en\"> mufon case (14403) map </A>","Object Features":"Other","trends":["There have been 3 other sightings in La Palma","There were no other sightings in La Palma on or around December 12th 2008"],"divs":["sighting details i woke up to turn over and opened my eyes,and saw 2 balls of light swinging up and down,then side to side.i just stared at these 2 things moving slowly.i thought someone was outside w\\a purple flashlight trying to see thru the closed blinds!so i was ready to hop out of bed to get a closer look,and 1 shot a white beam of light in my eyes!so i jumped out of bed and the 2 balls of light were gone.i immediatly ran into my backyard to get the person that shot that light into my eyes and there was no-one there!i went back into my room to find a source of light but couldn't. what size can a ufo be? :iv'e also had a missing time experiance.my mom was going to take me to dmv and said she'd be here at 8am,and to have all my paperwork ready.the next thing i knew was hearing the auto-garage door open.i was in a freeze position,then realized it was the next day allready.when she came in i said are you ready to go? she said yes!but what happened to the night?i put on my clothes to go,got my papers out but was perplex that i had just talked with her 12 hrs ago,and now it's the next day[this happened 2 years ago]i also had missing objects dissapear then reappear in same spot i looked for days.i never believe in ufos and other things paranormal,but since i called the cops 44x in 9 months,they said that i was missplacing these objects,and it was mt imagination.i was doing it myself but forgetting!?by coinscienece i turned on the am to listen to the news one night,and art bell was on the topic of 'poltergiest',i got my dictionary and looked it up and was completley blown away with the definition,noisy,mischivious,tapping.rapping,weird sounds,voices,lights turned off that i kept on.hearing the doorknob jiggle,slidebolt open,then saw 3 separate apperitions,2 girls,1 guy,in day time and night time.ghosts? after hearing that show i went to the library and check out every book on ufos and poltergiests,until i read every book.eps.by linda moulon howe's[glimpes of other realities vol 1+2]and jerome clarks ufo encyclopedia.i am a member of mufon id#12765.after reading all books i purchaced a pc to research more about this strange phenomemon.this dates back to 3-2004,before i heard art bell,and my pc is less than 1 years old.is this stuff real? all i can say is i'm not a skeptic any more!please feel free to email me at posted address.in all sincerness and honesty i submit this report to be fact!thank you,from,<<>>12-13-08"],"Longitude":"-118.046731","Weather Factors":"None, Does Not Apply","City":"La Palma","Object Flight Path":"Straight-line path,Path with directional change","Country":"United States","Region":"California","Source":"MUFON"}