{"Country":"United States","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Junction City","There were no other sightings in Junction City on or around December 12th 2008","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting Detailswhile sitting around our usual fire in the backyard,my wife suddenly grab me and says LOOK LOOK. I ask where. she says BETWEEN THE TREEES. I then began to focus on what looke like to me a ball of amber light. She said it appeared from no where, glowing really brightly. I could see a black line making a motion in the ball of light. It look like a band of lights where moving from left to right in the center of the object. I guess that is what made the black apear to be moving, or the entire object was rotating. Next it started to make all color, red, white, purple, orange, rainbow colors. Then it started to flash one color. it would flash red,then white. im really thinking plane at that point. Next it would turn back to the amber light with the motion in it again. the amber color was like something was on fire in the sky, it had a lot of motion in it. u could really see all the colors it was making. Next i tell my wife to go get the video camera. while she is looking for keys so she can get the camera out of the truck, i watch the object make serpentine motions over the trees. i could tell it was at least 200 yards away becaude i would loose site of it behind a tree. then it would reappear on the other side of the tree. at some point i could see it over the tree also. so i basically stayed in the same area. it takes her close to 5 minutes to bring me back the camera, and it is still there. I try to video it through the trees, but i couldnt finde it in the camera. so we watch it for a few more minutes, while trying to figure out what to do. We decide to get in the truck and drive to the object. there is a cut out over a sewer lake there, so the skies is clear at least to the trees the object was dipping behind. So we drive there in less than 2 minutes. the cut out is on the street behind our street. We pull up to the fence around the sewer pond and beging to watch the object. i see a red light and a white light. i tell my wife it's a plane. that's a air plane doing search manuver. she starts argueing with me that it is round lights that are rotating in a circle. I tell here again that it is a plane searching for something. it is taking me forever to get it in the view of the camera. im not really trying that hard because it looks like a planes seriously. Im not paying attention to that this thing just stopped and hovered in one place. Im only thinking i can get it on video now that it stopped moving. it paused for a few seconds, like it had noticed that we was there. it then took off headed north. The moon was still low in the sky so i aimed for it. I brought the moon into view. that's when i go it on tape. To the naked eye it looked like a plane going across the sky . through the camera i could see that a red light was behind a white light, but could not see a structure. i knew then that it wasnt a plane by the position of the red light to the white one. we was there 3 or 4 minutes before i got it into the camera's field of view. i have about 10 seconds of the object on video before it got out of site behind the tree. We decide to get back in the truck and see if we can get another look when it goes across the area where it wasnt any tree. we didnt see it again. If it would have keep the same speed that it took off at, we should have been able to see it. i veiwed the video and was thinking piece of crap.... i tell my wife, man we had it.. i just couldnt get the distance right on the camera. I go home and download it to my cpu using sony vegas 5.0 program. next it comes to me how i watched a guy do a frame by frame on some shuttle explosion video. I try the frame by frame on my video. all i can say is WOW. I CANT BELIEVE IT i know some of the light effects is motion blurr. what looked like single lights to the naked eyes was several lights. sometimes as many as 9 rainbow like each a different color. they made triangle patterns, X patterns, They made Spiral patterns, Helix patterns. I know that the shaking on my hands could not have made all those effects to the lights, plus i was filming leaning on a fence. Plus u could see multiple effects on a single frame. There was quite a bit of patern changing in the ten good seconds of video. At one point it looks like a saturn shape ufo. but then it kinda looks like four diamonds shape lights. i have the original video. all the motion in the video is by my movements, this thing took off on a level plane. it looked to be slowly speeding up slowly and rising. like a plane to the naked eye. i used a sony handycam dcr-trv 280"],"Object Flight Path":"Undisclosed","Case Number":"14401","Region":"Arkansas","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14401.html.txt","/var/www/straped/mufon/more/14401_submitter_file1__spiralscolored.jpg","/var/www/straped/mufon/more/14401_submitter_file2__helixondiming.jpg","/var/www/straped/mufon/more/14401_submitter_file3__rainbowrowoflights.jpg","/var/www/straped/mufon/more/14401_submitter_file4__14402_submitter_file2__multicolors1.jpg","/var/www/straped/mufon/org/14401.html"],"Latitude":"33.02275","Viewing Distance":"Unknown","Object Shape":"Saturn-like","Longitude":"-92.716324","Date Submitted":"12/12/2008 05:55 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.02275,+-92.716324(14401)&iwloc=A&hl=en\"> mufon case (14401) map </A>","Date of the Event":"12/12/2008 05:55 UTC","Source":"MUFON","City":"Junction City","Summary":"Round multicolored lights UFO video.... need video editing aplication to see true effects.","Log Number":"US-12132008-0015"}