{"Disposition":"Insufficient Data","Longitude":"-83.667883","Tags":"City","Region":"Michigan","Latitude":"41.510126","Case Number":"14408","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Summary":"I was taking the dog outside and saw a pinwheel shaped/ fireball object appear from nowhere over my house.","Date of the Event":"07/20/1994 12:00 UTC","Object Shape":"Fireball, Sphere","Date Submitted":"07/20/1994 12:00 UTC","divs":["sighting detailsi was taking the dog outside on an absolutely clear summer night. while waiting for my dog, i was looking around in the sky at all the stars when all of a sudden, over top of my house and my neighbor's house appeared what i call a combination fireball\\pinwheel shaped object. it was a perfectly round shape ball of fire in the middle with small flame tips around the edge. it is hard to say how big the object was or how high the object was over my house,probably because it was at night. but it seemed very close and possibly 4 ft. in diameter from where i was standing. it came out of nowhere (not falling out of sky) as though it was traveling from an east-west straight line direction. as quickly as it appeared, within a few seconds, it disappeared. when i say disappeared, i mean it completely vanished. it did not explode away or make any sound what so ever. have no idea what this was or if any one else has ever seen any object like this in the sky before. i can tell you one thing, it definitely startled me when i saw this thing! haven't really told too many people about this over the years except for a few family members. i would like to find some ufo photos to see if there is anything close to what i saw."],"trends":["There have been 3 other sightings in Toledo, Ohio","There were no other sightings in Toledo, Ohio on or around July 20th 1994"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.510126,+-83.667883(14408)&iwloc=A&hl=en\"> mufon case (14408) map </A>","City":"Toledo, Ohio","Viewing Distance":"Unknown","Log Number":"US-12142008-0006","files":["/var/www/straped/mufon/html2text/14408.html.txt","/var/www/straped/mufon/org/14408.html"]}