{"Longitude":"-86.71575","Date of the Event":"12/12/2008 08:20 UTC","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Unknown","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around December 12th 2008"],"Object Features":"Unknown","Disposition":"Unresolved","Viewing Distance":"Over One Mile","divs":["Sighting DetailsMy family and I had just turned south bound off of 400 S to Johnson Road toward LaPorte when coming from Michigan City. Upon making the turn, My wife, two sons and I all noticed an extremely bright series of 3 lights that was West of Johnson Road moving east. When we all locked our gaze on it, my wife commented (she is not a believer in UFOs), \"there is one of your UFOs\". I responed, \"I don't think so that is either a plane landing at the Michigan City Airport or a tower light (from the nearby summit farm)\". But it was still a courious enough event to keep us all watching to see if this was the case. As I watched the lights, they were all bright white (extremely bright and BIG). There was a series of three, and although I can not say definatively the craft could have been triangular as the two outer lights seemed somewhat smaller than the center, indicating that that light was closer than the other two. I had originally assumed because of the size and brightness the lights were close to the ground, but I quickly realized that this craft was way upthere but gigantic! There were two planes in the same air space to judge by. As it moved from west to east, it suddenly switched directions and headed south and up. It disappeared before our eyes. We never saw it again. I assumed that maybe it had gone into some clouds, but as we continued driving toward where the object was there were no clouds, at all. My son who is 12 was in the back seat simply said, \"I think UFOs are real!\" In addition, I have never seen a plane landing at the Michigan City airport cross over Johnson Road, and even if that was a possibility the quick south bound turn and speedy disappearence remove that as a possiblity. It was not the tower that I suspected, because there is no way that I could have seen that tower from our position. It is not elevated enough and we were over 5 miles away and if it was it would have been West of position. I have no explaination for what we saw, but I had told a friend about it and he inturn told another mutual friend, who's son and his friends had seen a similar object in LaPorte about 3 hours before we saw this. He and his friends also said they thought the object was triangular, and they were more below the object. They also said the object was MASSIVE and although it looked low flying it was not."],"Country":"United States","Region":"Indiana","City":"La Porte","Summary":"Extremely big and Bright Lights in the sky.","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14412.html.txt","/var/www/straped/mufon/org/14412.html"],"Log Number":"US-12152008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=41.616507,+-86.71575(14412)&iwloc=A&hl=en\"> mufon case (14412) map </A>","Object Flight Path":"Straight-line path,Path with directional change","Date Submitted":"12/12/2008 08:20 UTC","Tags":"City","Latitude":"41.616507","Case Number":"14412"}