{"divs":["Sighting DetailsDVD \"Overboard\" Goldie Hawn, Kurt Russell. Go to time mark display 1:32:48. First one appears at upper right in the sky. Also 1:32:48, second and third appear (1)upper left, (1) center, just above the water. Third @ 1:32:49, (1)upper left and (1) upper right. fourth,1:32:50, (1) upper left.End In case your remote time \"Display\" button varies from mine: it is the scene where Goldie is leaving Kurt. She is on the yaught wearing a red and white striped top with an open jacket. The sightings occurr over the harbor she is looking at. Also, DVD \"Beach Party\" Frankie Avalon, Annette Funicello. Opening sequence, time display= 00:01:59, right after the plane lands you will see a perfect UFO come into frame. This one appears to be almost too perfect to be real, but who knows? This is the one that got me started at searching the skies in movies. There are so many scratches, debris, pinholes and scene change markers in these older films that it is very difficult, at first, to seperate what is normal and what is not. However, once you begin to tell the minute differences, there are some very real UFO's. Some of the sightings are very obviously not simple film anomalies. I haven't really found a lot in the newer films but I haven't searched that many of them as yet. I believe their technology has advance in the last 30-50 years, much like ours has, but probably at a much more rapid rate. I believe the only time they can be seen now is when they are having trouble or when they want to be seen. HB"],"Date of the Event":"Unknown","Country":"United States","Source":"MUFON","Summary":"Movie sighting of probes?","files":["/var/www/straped/mufon/html2text/14413.html.txt","/var/www/straped/mufon/org/14413.html"],"Date Submitted":"12/15/2008 01:20 UTC","Case Number":"14413","Region":"California","Viewing Distance":"Unknown","Tags":"City","Object Features":"Undisclosed","Object Shape":"Oval","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-119.408752","Latitude":"36.785261","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.785261,+-119.408752(14413)&iwloc=A&hl=en\"> mufon case (14413) map </A>","trends":[],"Log Number":"US-12152008-0002","Disposition":"Hoax","Weather Factors":"Unknown"}