{"Case Number":"14414","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.050044,+-84.496826(14414)&iwloc=A&hl=en\"> mufon case (14414) map </A>","files":["/var/www/straped/mufon/html2text/14414.html.txt","/var/www/straped/mufon/more/14414_submitter_file1__DSC00448.JPG","/var/www/straped/mufon/more/14414_submitter_file2__DSC00452.JPG","/var/www/straped/mufon/more/14414_submitter_file3__DSC00450.JPG","/var/www/straped/mufon/org/14414.html"],"Object Flight Path":"Path with directional change","Longitude":"-84.496826","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around December 14th 2008","This sighting has never been favorited.",""],"Date of the Event":"12/14/2008 06:07 UTC","Sighting Duration":"Undisclosed","Date Submitted":"12/14/2008 06:07 UTC","Region":"Kentucky","Object Shape":"Boomerang, Cigar, Sphere, Star-like","Latitude":"38.050044","City":"Lexington","Disposition":"IFO","Weather Factors":"Windy","Object Features":"None","Viewing Distance":"101-500 Feet, Unknown","divs":["Sighting Details I walked outside to smoke a cigerette when I look up and noticed a very bright star in the sky. Then the object dimmed itself to where I thought it disapeared only to watch it dart across the sky rapidly and reappear very bright. I ran inside and got my girlfriend and her digital camera. The object wasn't a star because there was heavy cloud cover and it blotted out the other stars when the clouds passed but not this thing. Two planes flew underneath it as well. Anyway as we watched perplexed it went through a series of dimming itself and then glowing very brightly. It floated from left to right across the sky and then raised and lowered it's altitude. I snapped six photographs of it and when I blew them up I was shocked. Each shot seems to show a different shape. One has an orange and red orb in it, one has a white cylinder and the others have a white rod with a red glow on the end. I really don't know what this was but it really has us puzzled. As we watched in amazement after about fifteen minutes it just dimmed itself out and vanished. I tried to take other pictures on this same night of several bright stars in the sky but the camera wouldn't capture them but it got this thing. Anybody have any idea what this thing is?"],"Log Number":"US-12152008-0003","Summary":"Starlike object gives dazzling light show for me and my girlfriend.","Tags":"City"}