{"trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around May 19th 2008"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.78116,+-122.412536(14415)&iwloc=A&hl=en\"> mufon case (14415) map </A>","Summary":"Orange craft slowly flew over with no sound and was pulsating, then dimmed and shot red plasma beams of light.","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Dome","Latitude":"37.78116","Log Number":"US-12152008-0004","divs":["Sighting DetailsThis isn't the first time I have seen ships from another world...I was riding my bike home from my storage witch was a good five miles. It was just after dusk and I was tired from the ride. I open the gate to bring in my bike and as I looked up between the two tall trees at the other end of my parents yard I saw an orange flickering light. Now after my ride my eyes were a little watery so I kept my focus on the light and was thinking that it may be a small airline jet. After a minute or two went bye I regained my vision and notice the craft descending towards our house. At first it was about a good two miles away at an altitude of about 1500 feet and traveling about 140 to 220 mph. I knew this wasn't right because our house sits directly under the landing flight path for San Francisco, San Jose, and Oakland airports. This was coming opposite from the normal paths that the jumbo jets take. Also Stanford Hospital is very close by which uses medivac helicopters and it wasn't that either. My history on the knowledge of aircrafts is great because I used to wash and wax jets and helicopters at Santa Barbara airport(that's another story!). So as I walked through the yard staring at the craft it came closer and was reducing it speed to about 50 mph. Now the craft is hovering almost directly above our property. Just to my left my parents(non-believers)were watching TV in the family room and asking what was I doing. I told my Dad to get off his ass and tell me what I am looking at.He was in the Army and the used to work for IBM and once in awhile due business at Moffett Field AFbase. So he came out then my mother and they couldn't explain it. I told him to go get the binoculars and he did so. Now the craft was as close as it was going to get which was about 700-800 feet above going about 20-30mph if that. I could describe it as a sound sphere like object that the upper half hald an orange glow that would brighten then dimm. Then when my dad came back it started to darken yet brighten up again, but this time it's lights were displaying like something you see in vegas where the lights start at one point then fan out taking shape of an umbrella and would repeat this for about 5 minutues. Now about 15 miutes have gone bye and after my father looked through the binoculars, I grab them to take a look see. When I looked it was at a stand still for a couple minutes and then from the bottom side facing away from me it started shooting out red beams of light,4 total but 2 at a time, one set above the other. The night sky was clear and a jumbo jet airliner was flying by in the distance on it's normal descent path. Then it started to fade into the dark sky, never making a sound,yet I could still see it's silhouette for about another minute then that was it. The direction it came from was the Pacific Ocean and the Santa Cruz Mountains,then curved towards our home between Stanford Hospital and Interstate 280( Where Stanford Linear Accelerator,Sandhill Rd. Turn off.)above Menlo Park(Sharon Heights),then went in the direction towards the bay north east. The whole time I felt that this was cool that my parents saw this so now they cane believe my other stories. But when it shot those red lazer looking lights I got a little nervous."],"City":"San Francisco","Sighting Duration":"00:20:00","Case Number":"14415","Country":"United States","files":["/var/www/straped/mufon/html2text/14415.html.txt","/var/www/straped/mufon/org/14415.html"],"Longitude":"-122.412536","Disposition":"Unknown","Date of the Event":"05/19/2008 07:15 UTC","Date Submitted":"05/19/2008 07:15 UTC","Weather Factors":"None","Region":"California","Object Flight Path":"Path then hovering","Source":"MUFON"}