{"Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was driving on I-40 between Tucumcari and Albquerque on my Vegas. As I was admiring the dust sky, I noticed a long narrow storm cloud about 50 miles in front of me. At the bottom of the cloud I saw 2 lights resembling the head lights of an airplaine. Just then, the two lights moved horizontally towards each other forming 1 large light about the size of a silver dollar. The 2 lights reappeared moving a few inches to the south just as 2 more lights moved a few inches to the north leaving the large light in the middle. They remained still for a moment before the 2 lights on the left shot off south and the 2 lights on the right shot off north faster than my eyes could follow. Shortly after the large central light shot strait up through the cloud above and dissapearred just as fast. The strangiest thing is the large central light left a perfect hole in the storm cloud. I didn't noticed I had slowed down during this time but as I looked around the highway it seemed every car and truck was moving just as slow and straining to see out their windows as well. After driving about 30 minutes I was now closer to Albquerque and closer the the storm cloud. I could see the cloud had become more narrow and the hole remained as if there was no condisation in that area of the cloud. I can not explain how large this object was if it seemed to be the size of a silver dollar at 50 miles away or why when moving through the cloud, there was no disturbance in the cloud, and what would vaporize the air in such a dark storm cloud to leave a perfect hole."],"City":"Btw Tucumcari and Albuque","Tags":"City","Weather Factors":"None","Region":"New Mexico","Sighting Duration":"Undisclosed","Latitude":"34.97529","Longitude":"-105.030324","trends":["There have been no other sightings in Btw Tucumcari and Albuque","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/14424.html.txt","/var/www/straped/mufon/org/14424.html"],"Log Number":"US-12152008-0012","Object Flight Path":"Stationary,Straight-line path","Country":"United States","Date of the Event":"12/14/2008 04:30 UTC","Summary":"2 small lights come together into 1 very large light then separated into 4 small lights on both sides of the large light.","Object Features":"Unknown","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=34.97529,+-105.030324(14424)&iwloc=A&hl=en\"> mufon case (14424) map </A>","Date Submitted":"12/14/2008 04:30 UTC","Disposition":"Insufficient Data","Case Number":"14424","Source":"MUFON"}