{"City":"Aguada","trends":["There has been one other sighting in Aguada","There were no other sightings in Aguada on or around June 11th 2008","This sighting has never been favorited.",""],"Date of the Event":"06/11/2008 02:52 UTC","Tags":"City","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=18.379391,+-67.188236(14427)&iwloc=A&hl=en\"> mufon case (14427) map </A>","Country":"Puerto Rico","Summary":"I recorded on my cellphone what appeared to be a saucer shape UFO in the very dark wooded area at night, about 2:52am while in the balcony in Aguada, PR.","Case Number":"14427","Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:00:15","Weather Factors":"Unknown","Latitude":"18.379391","Date Submitted":"06/11/2008 02:52 UTC","Viewing Distance":"Unknown","Log Number":"PR-12152008-0015","Object Shape":"Disc","Region":"","Object Flight Path":"Stationary","Longitude":"-67.188236","divs":["Sighting DetailsEnclosed herein is a recording of a UFO for your observation and analysis to supprement the UFO sighting and subsequent alien abduction story I sent Mr. James Carrion on November 13, 2008. On June 11, 2008, at approximately 2:52am, I was alone in the living room when I suddenly got a feeling that I should go outside onto the balcony and there it was again. My camcorder was not in the immediate area, but luckily I had my cellphone with me. It appeared to be a saucer shape craft, similar to the one I've seen previously, with lights around it. It was hovering motionless. Please listen to the sound it made mixed the crickets chirping in the background. The sound is similar to the strange humming sound I've heard before. It was over the wooded mountains near the other house I had to move to in Aguada, Puerto Rico. The reason why I send it to you now was because it was recorded with my cellphone. We didn't know how to transfer the recording into my computer or burn it on a DVD disk. A friend finally transferred the information on a disk and then into my computer. I recorded the object for approximately 15 seconds before I feared to be alone in balcony and in the dark. Thank you for your attention."],"files":["/var/www/straped/mufon/html2text/14427.html.txt","/var/www/straped/mufon/org/14427.html"]}