{"Country":"United States","Sighting Duration":"Undisclosed","Latitude":"41.540899","Summary":"Red, Green & Blue Lights Rotating Quite Fast.","Disposition":"Unresolved","Log Number":"AU-12152008-0016","Longitude":"-87.252665","Date Submitted":"12/07/2008 10:15 UTC","divs":["Sighting DetailsI was staying in a cabin with a friend for the night 2 kilometeres out of St Mary's in Tasmania, Australia. I was out on the balcony having a cigarette and a cup of coffee (the property has amazing views and is high up in terms of sea level etc)and I was pointing out to my friend from China where the \"Saucepan\" constellation (Southern Hemisphere) is in the night sky. About 2 minutes after he went back inside I was amazed to see a circular shaped object with the colours blue, red and green pulsating and rotating quite fast in the middle of the object. It was (from my view) moving slowly along the bottom of the \"Saucepan\" constellation in a straight line. It then shot up at a 90 degree angle and stopped just as quickly. It then started a 'Saw-Tooth' type of flight for maybe 8 seconds then it moved at astonishing speed into the clouds where it dissapeared for good. I stood there for quite awhile looking up, partly in amazement and confusion, as to just what it was that I had just witnessed. In the morning I asked the owner of the rental cabins had he or his partner ever seen strange lights in the sky (they have both lived there for 9 years). He replied they both had seen objects moving at incredible speed but with only 2 different colours as opposed to my 3. They have a powerful telescope which is able to take pictures of the night sky but the conversation ended there. I don't know what it was that I saw and whether it was natural, man made or something else. But to me it just felt that it was under intelligent control. The way that it paused then moved in a controlled fashion and also the mind boggling speeds it was reaching makes me believe that it was not nature at work."],"Object Shape":"Circle, Oval","Region":"Indiana","Weather Factors":"None","City":"Hobart","Case Number":"14428","map":"<A HREF = \"http://maps.google.com/maps?q=41.540899,+-87.252665(14428)&iwloc=A&hl=en\"> mufon case (14428) map </A>","Viewing Distance":"Over One Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14428.html.txt","/var/www/straped/mufon/org/14428.html"],"Object Features":"Unknown","trends":["There have been 6 other sightings in Hobart","There were no other sightings in Hobart on or around December 7th 2008"],"Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Date of the Event":"12/07/2008 10:15 UTC"}