{"Log Number":"US-12162008-0001","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.424384,+-111.828862(14429)&iwloc=A&hl=en\"> mufon case (14429) map </A>","Longitude":"-111.828862","Object Shape":"Other","Date of the Event":"02/28/1985 12:00 UTC","Object Flight Path":"Stationary,Hovering then path","divs":["Sighting DetailsWe lived from 1979 till 1996 on Hannibal St. Mesa, Arizona. At approximately 9:00 PM in March 1985 I was walking my dog Mindy east on Hannibal St. Mesa, Arizona towards the Superstition Mountains. Back then there were very few homes or lights from Power Road to the Superstitions. It was very dark and I looked up into the sky and saw a V shaped object with 5 lights on it. One in the front and 2 or possibly 3 on each side. I worked at McDonnel Douglas Helicopter Company at the time and I thought at first glance it was 5 of our helicopters just hovering in the sky. They had bright lights like big planes lights, but they did not move. I watched for about 20 minutes and I realized our helicopters could not do that for that long. I asked some of our Engineers the next day about that. I thought to myself, oh good a UFO. Then thought I wonder what they are like. At that the object started to move towards us. My dog looked up and started barking. With them moving towards us, I started to walk faster back towards my house. (I guessed they could read minds because when I thought this was not a good thing and I kept looking back, they seemed to stop, then they just shot off what looked like in different directions. It happened in a nano second and then they were gone. I came home and told my husband. I listened to the news and checked the newspaper the next day, but never heard a thing about this sighting. I wanted to report this, but I didn't know who to call.. I tried reporting many years later to Mufon, but I guess it didn't go through. I was not that good on the computer at the time and had no idea how to send things. I'm sure I messed up the report. Since then I have seen them 2 more times and my hubby 1 time at our home in Queen Creek. If you want those dates I will fill in a report. Sorry no photos, I had no camera with me at the time. Seems like it is always in cooler weather they appear like in March for me. I know the people who saw the Phoenix lights are right, they do exist. Wendy"],"Region":"Arizona","Latitude":"33.424384","Viewing Distance":"Over One Mile","Tags":"City","City":"Mesa","files":["/var/www/straped/mufon/html2text/14429.html.txt","/var/www/straped/mufon/org/14429.html"],"Weather Factors":"Unknown","Case Number":"14429","Disposition":"Unknown","Date Submitted":"02/28/1985 12:00 UTC","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around February 28th 1985"],"Summary":"Exactly like the Phoenix Lights a V shape"}