{"Object Shape":"Disc","trends":["There have been no other sightings in Spring Valley","This sighting has never been favorited."],"Log Number":"US-12152008-0010","Object Flight Path":"Hovering then path","Tags":"City","Region":"New York","Latitude":"41.113151","files":["/var/www/straped/mufon/html2text/14422.html.txt","/var/www/straped/mufon/org/14422.html"],"Case Number":"14422","map":"<A HREF = \"http://maps.google.com/maps?q=41.113151,+-74.043752(14422)&iwloc=A&hl=en\"> mufon case (14422) map </A>","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Date of the Event":"08/23/1984 07:00 UTC","Source":"MUFON","Country":"United States","Summary":"It was hovering over my house, 89a Pomona Rd. Suffern ,N.Y. 10901","Weather Factors":"Unknown","divs":["Sighting DetailsThe event began at the end of the dirt road that I lived off of. My driveway was circular and we backed up to the woods, where we usually go for walks. It was early evening from what I remember. Me and my boyfriend , at the time, were walking down the block coming from the pool in the country club. My dog was with us and as we approached the beginning of my driveway we noticed a light glowing in the woods. The dog began barking and we didn't hear any noise. We thought it was someone walking their dog in the woods, however, we didn't hear any leaves cracking as if someone was walking around. We started to call out and I even said \"ET go home, I don't have any Reeces Pieces\", Lol. The dog ran into the woods barking like crazy and came running out with his tail between his legs, he looked very scared. Still we didn't hear any noise and we started to get scared so we walked down the end of the driveway towards the house. It looked like a flashlight glowing down. As I stood by the front door something made me look up as the second I looked up I saw a million little lights at the same time the object took off, quietly, no noise and went up towards my neighbors house. I thought I was imagining it and I ran inside as my mother was cleaning the dishes. I told her what I saw and she thought I was crazy and tyold me to go to bed. I knew I saw something, I even felt a burst of energy as I looked up. The next morning our neighbor, who was my mom's friend, called and told my mother she wasn't going to believe what she saw the night before. She went on to say she was sitting on her back porch crocheting and she looked up and saw a huge flying object just hovering over her house. She said it didn't make any noise but had a lot of small lights, I guess it was circular from what I remember. This proved to my mom that I wasn't imaging it!!! I will never forget this experience. Please let me know if others saw the same thing I did."],"Date Submitted":"08/23/1984 07:00 UTC","Longitude":"-74.043752","City":"Spring Valley","Disposition":"Unresolved","Object Features":"Unknown"}