{"Object Features":"None","Case Number":"14435","files":["/var/www/straped/mufon/html2text/14435.html.txt","/var/www/straped/mufon/org/14435.html"],"divs":["sighting detailsi was out side looking toward the east when i saw the first one.it took about an hour and a half to ascend not parallel with the stars and it was larger than the stars,a good distance away,it almost seemed to be disguising itself as one,but it was more brilliant \"definitely not a star\"then i noticed two more that were not pulsating different colors,but i could definitely see them moving,it is possible the middle one was the space station,i don't think so but it may be possible,i know planes and one even passed under it!!i know my stars and planets very well.i could not stop staring at them to the point that my neck started locking up,then they became obscured by clouds.i suggest you monitor that region as i can only hope they return tonight in a clear sky.points i missed:i was at a hotel in raleigh, nc visiting a friend who thinks i'm nuts,but i looked out the window and couldn't even break myself away to get a cigarette.i thought at first it was a ufo but my friend kept me a little skeptical but only for a few minutes then my mind was positive.the biggest one was pulsating blue,red,and other colors that blurred together but it was mainly blue,it was slowly ascending but making strange like \"hops\"?laterally. the smaller ones where making forward motions in different directions but none of the strange lateral \"hops\" and were moving much slower. as far as my feelings go, i was thrilled\\beside myself with elation hoping someone else credible had witnessed this phenomena. to me it confirmed long held beliefs. i did not feel threatened in any way. unfortunately, i did not have a camera with me."],"Summary":"Multi-colored pulsating moving in \"unnatural\" motion, ascending slowly.","Date Submitted":"12/13/2008 10:30 UTC","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around December 13th 2008"],"Tags":"City","Longitude":"-78.629154","Weather Factors":"Unknown","City":"Raleigh","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Log Number":"US-12162008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=35.776916,+-78.629154(14435)&iwloc=A&hl=en\"> mufon case (14435) map </A>","Date of the Event":"12/13/2008 10:30 UTC","Region":"North Carolina","Latitude":"35.776916","Disposition":"Insufficient Data","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Country":"United States"}