{"Date of the Event":"01/09/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14430.html.txt","/var/www/straped/mufon/org/14430.html"],"Object Flight Path":"Hovering then path","Object Features":"Unknown","Log Number":"US-12162008-0002","divs":["Sighting DetailsThis may sound strange coming in so late after all this happened. But I decided I might as well get it out there now before I forget most of the details. I had a similar experience to this, but not the same day, it was actually just one day later on January 9th, a Wednesday. Everything I say is 100% truth, I have no reason to lie about this. Anyways, this all occurred somewhere between the hours of 10pm and 12am. I'm not exactly sure on the time, but I was coming home from church. The reason it was so late is because some of us had hung out for a while that night. I think it was more around 10 though The location was right outside of Tye, TX, a small town just a few miles outside of Abilene, which is about a 3 hour drive West of DFW. I was driving on 707(a road that goes straight through Tye and eventually hits Abilene) just making my way back from church, I made a stop at the Flying-J on 707 to get a drink and snack to play games for a few hours with, and as I was leaving I saw a bright white light in the sky in the direction straight ahead of where I was. It looked almost like a flashlight would if it were 15 feet in front of you, best way to describe it. It was probably about a mile or two away from where I was when I first saw it. Keep in mind this road is straight for several miles after it goes through Tye. So I continued driving towards it because that is where I needed to go. The closer I got to it it seemed as if it was just in a fixed spot and wasn't moving at all. I took a video of me driving towards it, which I will talk about in a second, and I actually pulled up next to it. I stopped parallel to this \"thing\" and watched it for several minutes. It hovered there making no sound whatsoever. I even shut off the car to see if I could hear anything and couldn't. This object was floating, or hovering, only about 200 feet off the ground if that and was only about 100 feet away from me. It was stopped slightly over a house and just sat there for about 2-3 minutes. It had several lights on the bottom that would flash blue, red, and green, but not like any aircraft I have ever seen before. It made a strange pattern. It started out coming from the bright light at the front and continued down the bottom straight but towards the end it broke out into two different lines making a triangular shape. The craft didn't really have a defined shape to it, all I could see was a very faint silhouette and it almost appeared as if you could see through it. Like I said before, it hovered there for just a few minutes, making no sound at all, and when I stepped out of my car to get a better look it took off. At first, it was slow, but then it went pretty fast. I continued to watch it fly straight ahead until I could no longer see it. It did make a small, but not like what I have heard from airplanes, sound when it took off at first. After the initial sound, it didn't continue to make any noise. For some reason though, I had my phone sitting in my lap the whole time and didn't take anymore video footage, I guess I was just too dumbfounded to do anything. It was by far the scariest, weirdest, and mind-boggling thing that I have ever witnessed. Immediately following this event, and called my mom telling her that I think I just saw a UFO and she just laughed and told me to come home. I got home, showed her the video and she was just skeptical about the whole thing. Also, one detail that I clearly remember is that absolutely no one else was driving down the road while I was on it. It was rather odd because there is usually someone on it no matter what time of day it is. Anyways, about the video, I kept it until my phone broke about 2 months later and lost the video for good, so I have no more physical evidence of this. That following Monday morning I was woke up early and told to come watch the news, it was about the Stephenville sighting the day before I had my sighting. All I had to say to my mom was I told you I saw something. She finally believed me after that and wanted me to report it to ABC, but I didn't want to because I just didn't want to be out there on TV(if it got that far) or anything of the sort, so I kept it between me, her, and a few friends. I only told a few people that I knew which included 2 teachers and some friends and classmates of mine during a small class, and they all believed every word I said and even I was surprised by it. They all told me that they all had no reason not to trust me. Now for those of you who look up the locations, yes, there Dyess Air Force Base is just a few miles from that location where this occurred. I know what I saw, and it was no aircraft I have ever seen before. I may not know a lot about aircraft but I know that Dyess did not have one of these, or at least open to the public. I have lived near that airbase for a total of about 7 years so I know what the aircraft they do have looks like. I have seen several airplanes that they have that have a bright light on the front of the plane, but nothing compared to what I saw. Now I'm not claiming this was a government experiment or an alien craft or anything, I just know what I saw was a UFO and I still can't explain what I saw. For those of you who would like some information about me, my name is Bryce Lachance and I am currently 18 but was 17 when this happened."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"Something I saw a day after the Stephenville incident, but didn't hear about till about 5 days later.","Latitude":"32.457624","Source":"MUFON","Longitude":"-99.871481","City":"Tye","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.457624,+-99.871481(14430)&iwloc=A&hl=en\"> mufon case (14430) map </A>","trends":["There have been no other sightings in Tye","This sighting has never been favorited."],"Tags":"City","Date Submitted":"01/09/2008 12:00 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Region":"Texas","Object Shape":"Diamond, Triangle, Unknown","Weather Factors":"Unknown","Case Number":"14430"}