{"Case Number":"14439","Latitude":"47.619537","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsI watch the sky frequently, especially at night, so I have a pretty good feeling for the flight patterns, shapes and sounds of the various domestic and military craft that crowd my Seattle-area skies. At first glance I thought this was an airplane, but after I watched it I don't think it was one of ours this time, since there was a lot askew. Tonight I watched three very large bright white lights in formation hover above Lake Washington and travel very slowly northeast, which was not the prevailing flight pattern I had been watching today. While I watched with 10x50 binoculars, there was a red light towards the right of the craft that flashed intermittently, but I was never able to see any green light, even though the craft was relatively close, not more than 10 miles away, and I should have been seeing the front side and back if it were a plane during those 3 minutes. There was no sound at all. It was almost as if the lights were flying in formation to mimic a plane, was the feeling I got. Anyways, I kept waiting for the white lights to break apart, as I've seen in videos and while they never did during my watch, the snail-pace speed and the behavior of this UFO was unlike the airplanes I have been watching and filming. I also realized that I had not been able to get a good look at any of the planes tonight due to the cloud cover, while this craft was seen clearly. I have seen about five different UFOs since December of last year, but this is the first time I reported one. In April of last year I saw three of them hover and then take off, and this was over Lake Washington as well."],"Log Number":"US-12172008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=47.619537,+-122.196349(14439)&iwloc=A&hl=en\"> mufon case (14439) map </A>","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14439.html.txt","/var/www/straped/mufon/org/14439.html"],"Disposition":"Insufficient Data","Date of the Event":"12/16/2008 06:45 UTC","Tags":"City","Object Features":"Undisclosed","Summary":"Series of lights hover, travel slowly northeast disappearing over trees.","Date Submitted":"12/16/2008 06:45 UTC","City":"Bellevue","Country":"United States","Object Flight Path":"Undisclosed","Object Shape":"Disc, Other","Longitude":"-122.196349","Region":"Washington","trends":["There have been 10 other sightings in Bellevue","There were no other sightings in Bellevue on or around December 16th 2008"],"Sighting Duration":"Undisclosed"}