{"Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"11/15/1977 12:00 UTC","Date Submitted":"11/15/1977 12:00 UTC","Summary":"Huge triangular UFO over Belleville, Illinois 1977.","Object Shape":"Triangle","Longitude":"-89.980314","Object Features":"Unknown","divs":["Sighting DetailsTHIS WAS A LONG TIME AGO AND AS HUNDREDS OF PEOPLE SAW IT I WAS HOPING TO GET MORE INFO ON IT. THERE WAS A TRAVEL ADVISORY WHICH I AS A TEENAGER IGNORED. I ALSO TOOK THE BACKROADS HOME FROM DROPPING OFF MY GIRLFRIEND. I TURNED OFF HIGHWAY 158 BETWEEN BELLEVILLE ILLINOIS AND MILLSTADT. I HAVE NEVER KNOWN THE NAME OF THIS ROAD. IT CONNECTS 158 WITH THE NEWLY CALLED FRANK SCOTT PARKWAY. THE SKY WAS CLEAR .SNOW ALL OVER THE GROUND. THERE WAS A FULL MOON. I SAW THIS HUGE OBJECT MOTIONLESS IN THE SKY. IT LOOKED TRIANGULAR FROM MY VANTAGE POINT. I GOT OUT OF MY CAR AND SAT ON THE HOOD WATCHING IT. I FOCUSED ON THE LIGHTS SINCE I HAD NO CAMERA. IT WAS SuRROUNDED ON ITS EDGE BY FLASHING COLORED LIGHTS. THEY CHANGED COLOR VERY QUICKLY. AT THE TIME I REMEMBERED THE SEQUENCE BUT NOW I DO NOT RECALL. 2 AIRFORCE JETS CAME AFTER IT AND AS THEY APPROACHED THE OBJECT WENT SLOWLY UP AND OUT OF SIGHT. THE JETS DID NOT FOLLOW OBJECT UP IN THE SKY THEY TURNED AROUND AND RETURNED TO SCOTT AIR FORCE BASE NEARBY. IT WAS IN THE BELLEVILLE NEWS DEMOCRAT AS HUNDREDS CALLED IN . THE AIR FORCE DENIED HAVING ANY PLANES IN THE SKY THAT NIGHT. WHO KNOWS MORE??????? P.S I AM NOT SURE OF THE MONTH. PRETTY SURE IT WAS 1977 BUT COULD HAVE been 1976 0r 1978. I NOTICED IT BECAUSE THERE WAS SO MUCH SNOWFALL THAT I COULD NOT SEE THE ROAD, I WAS HUNCHED OVER MY STEERING WHEEL UP CLOSE TO THE WINDSHIELD WHEN I NOTICED THE FLASHING LIGHTS. THE FULL MOON AND SNOWFALL MADE THE SKY QUITE BRIGHT. I IMMEDIATELY THOUGHT IT WAS A UFO BECAUSE IT WAS SO LARGE, MOTIONLESS AND MADE NO SOUND THAT I COULD HEAR. I REALLY DO NOT KNOW HOW BIG IT WAS. AT THE TIME I THOUGHT IT WAS THE SIZE OF A FOOTBALL FIELD. I WAS STILL FOR 6-8 MINUTES UNTIL THE AIRFORCE ARRIVED."],"Log Number":"US-12162008-0003","Latitude":"38.52135","Object Flight Path":"Stationary","Disposition":"Unknown","Weather Factors":"Unknown","Case Number":"14431","files":["/var/www/straped/mufon/html2text/14431.html.txt","/var/www/straped/mufon/org/14431.html"],"Viewing Distance":"Unknown","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=38.52135,+-89.980314(14431)&iwloc=A&hl=en\"> mufon case (14431) map </A>","trends":["There have been 15 other sightings in Belleville","There were no other sightings in Belleville on or around November 15th 1977"],"City":"Belleville","Country":"United States","Tags":"City"}