{"Weather Factors":"Unknown","Case Number":"14447","Tags":"City","Disposition":"Unknown","Viewing Distance":"Unknown","Date Submitted":"12/17/2008 04:32 UTC","Sighting Duration":"Undisclosed","Object Features":"None, Unknown","trends":["There have been 5 other sightings in King of Prussia","There were no other sightings in King of Prussia on or around December 17th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.102316,+-75.377492(14447)&iwloc=A&hl=en\"> mufon case (14447) map </A>","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Country":"United States","Summary":"Looked out my office building window saw a huge glowing teardrop shape craft ran outside toop picture.","divs":["Sighting DetailsOn December 12, 2008 at 4:32 PM EST, I looked out my office building window and saw a fast moving teardrop shape object flying across the sky at a high rate of speed. The sun was already dipped below the horizon, and there were clouds in the sky. I noticed it flying through the clouds at first. I immediately ran down the steps and out into the parking lot of my office building on South Warner Road, King of Prussia, PA. I was pretty much jumping down stairs to get this shot. I was able to take the shot and continued to view it traveling into the distance and disapear. It was pretty big. The light poles you see in the photo are about 20-25ft high, and the lamps are pretty huge. There was nothing like it in the sky. Man this thing was amazing to see in person. I heard no sound to indicate a normal explanation for this fast moving craft. It wasn't small, and stood out like a sore thumb. I am not sure if there are any other witnesses, but I did show my colleagues at the office what I cought on my camera immediately after it happened. I imagine someone had to see it other than me, but I didn't even stop for a second...I wanted to get a pic as quickly as possible. I was facing westwardly when this picture was taken."],"Date of the Event":"12/17/2008 04:32 UTC","City":"King of Prussia","Latitude":"40.102316","Longitude":"-75.377492","Log Number":"US-12172008-0008","Source":"MUFON","Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/14447.html.txt","/var/www/straped/mufon/more/14447_submitter_file1__IMG000831.jpg","/var/www/straped/mufon/org/14447.html"]}