{"Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"12/17/2008 06:47 UTC","divs":["Sighting DetailsAt approximately 6:47 PM (CST) traveling south on LIABLE ROAD in highland indiana, in the Western sky an object passed beneath a small aircraft and proceeded on a western heading. 6:53 Object stopped. Remained stationary for approximately 35 minutes of active observation. Of which 7 minutes has been videotaped. At 7:50 PM, observer returned outside to check sky and object had disappered from view. It was cloudy in the west and object was only thing in the sky. Never dipped below horizon and maintained stationary position above treeline. from time of observation object maintained a white balance and briefly changed colors to orange. However, observer cannot comment on whether this was light pollution due to heavly lighted area. Upon first noticing object thought of X-files episode \"deep Throat.\" As object and plane were on what appeared to be collision course. Object avoided plane and passed below it. Curiousity prevailed as I have witnessed such events before, but never for this length of time nor have seen object remain like this. Lost sight of object after camera ran out of battery and observer returned inside to charge up camcorder. Returned to observation at 7:50 and object had disappeared."],"Date Submitted":"12/17/2008 06:47 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.553647,+-87.451984(14444)&iwloc=A&hl=en\"> mufon case (14444) map </A>","Summary":"Object passed beneath aircraft, heading SSW, object moving quickly, and then remained stationary.","Latitude":"41.553647","trends":["There have been 3 other sightings in Highland","There were no other sightings in Highland on or around December 17th 2008"],"Viewing Distance":"Unknown","Longitude":"-87.451984","Weather Factors":"Unknown","Region":"Indiana","Tags":"City","City":"Highland","files":["/var/www/straped/mufon/html2text/14444.html.txt","/var/www/straped/mufon/org/14444.html"],"Object Shape":"Star-like","Source":"MUFON","Object Flight Path":"Undisclosed","Log Number":"US-12172008-0005","Disposition":"Insufficient Data","Case Number":"14444"}