{"Summary":"Three pale pink bars travelling very slowly at roughly 100 feet and 25 mph - then accelerating rapidly into the sky.","City":"Midland","trends":["There have been 10 other sightings in Midland","There were no other sightings in Midland on or around September 30th 1977"],"Disposition":"Unknown","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/14446.html.txt","/var/www/straped/mufon/org/14446.html"],"Log Number":"US-12172008-0007","Longitude":"-84.243612","Source":"MUFON","Object Shape":"Other","divs":["Sighting DetailsHi. I have often thought of reporting this over the year's but really didn't think it would amount to anything since I had no proof - video, audio or physical. At the time this was taking place, a nuclear power facility was being constructed in Midland within 5 miles of my home and the sighting took place within a half mile of the cooling pond planned for the facility. Later, due to the facility sinking into the ground far further than planned, the plant had to be scrapped almost causing the collapse of consumers power - the public power facility. I was driving my 1976 Subaru from my house on Poseyville Road in Midland while accompanied by a neighbor girl, *NAME OMITTED FOR CONFIDENTIALITY* who lived literally next door. As a 17 year old boy, I was pretty much in the mode most 17 year olds are in... I was looking to get closer with Charise as she was attractive and we seemed to get along fairly well. We were just two high school students simply going for a drive on what was probably a weekday evening. I remember that we went about 2 miles down Poseyville Road from my house and turned left (east) onto Gordonville road - just talking, with me trying too hard to be cool. Next we turned right (south) onto Sasse Road and shortly after, one of the strangest things in my life occurred. I don't remember seeing or sensing anything until after we'd been driving roughly a quarter mile down Sasse road. We were travelling quite slow at the time - perhaps 25-30 mph. Suddenly an object started to appear in the top right corner of the drivers window... actually it was more of a light, and I don't recall ever seeing an outside edge or shape of the object that emitted the light that was very clear to us. Whatever the object was, it was fairly low in the sky - perhaps 100 feet off the ground. As it appeared, I pointed to it and my passenger and I were both immediately amazed... it wasn't like anything we had seen before. The sky was quite dark, but it wasn't long after nightfall and the object's \"bottom lighting\" stood out from what must have been a dark colored bottom of the flying vehicle. Once it was clear that the object was completely past us (it was only travelling maybe 10-15 mph faster than we were - and I had slowed down dramatically) the only thing that was clear were three pale pink \"bars.\" The three bars ran aside each other - side by side - with the center bar being a simple rectangle of a pinkish hue - and the other two being rectangles of the exact same dimensions, except with an additional \"leg\" or small square of light sticking off from the rectangle opposite each other facing away from each other. It looked like a letter L - next to a letter I - next to a backward L with the bottoms of the letters at the front of the \"craft\" or at least at the leading edge given the direction they were travelling. If I absolutely had to give a guess as to their size, I would say the each bar was roughly 50 foot long and 8 wide - seperated by perhaps a 3-4 foot space filled only with darkness, I seem to recall that you couldn't see anything through the dark space, indicating that there was something there - but you just couldn't see it. We both saw the same thing and compared notes later in amazement... they had come from behind us - which would have put them directly over Dow Chemical companies large chemical plant, the nuclear plant in construction and certainly they'd travelled over the cooling pond for the proposed plant - although we only saw the lights over our heads on Sasse Road. We both either felt, heard or somehow sensed a slight buzzing or vibrating sensation when the lights were nearest us. I tend to think of it more as a feeling and less of a vibration as I believe we thought the \"craft\" was silent... but there was defininately some type of sensation accompanying the sighting. Although there were three bars \"flying\" parrallel to each other - neither of us suspected for even a moment that there was more than one device in the sky near us - the bars of light all appeared to be locked into one main body, not waivering at all or changing dimensions in any way. We drove along at roughly 15-20 mph for some time with the craft in sight almost hovering above us but moving forward just barely faster than we were - and just above us not changing speed or hieght. After perhaps a half mile or mile of this, the craft seemed to change angle slightly- as our perspective on the lights changed... with the bars becoming \"thinner.\" It also seemed to raise its angle upward at the same time. Then it took off in the strangest manner, disappearing into the sky very quickly and leaving no trace of any kind. When it \"decided to take off\" we could certainly tell. It took enough time for us to see the small changes, but when it accelerated it was like its speed increased exponentially - starting off more slowly but very rapidly accelerating off into the distance. I don't remember hearing as much as sensing a change in the frequency of the vibration we both \"felt\" related to the craft and likely its propulsion system. The pitch and frequency became very high (in sound terms - approaching 4-6khz whereas when the craft was travelling more slowly the frequency we felt was more in the 150hz range). I haven't talked to a lot of people about this and I rarely saw my passenger again after that - but I've always wondered if she reported it and wanted to confirm her tale should she have decided to tell it. I've never heard of anyone seeing a UFO with the kind or color of lighting this apparent craft had... I would assume that its overall shape was round at front and the rest of it shaped like a rectangle - or at least, that was the impression I had - despite the lights being laid out in a rectangular pattern with two squares sticking out the sides. I'm almost 50 now and enough information is out there that this might actually fit into some other story helping to confirm something down the road. Thats why I felt it was important to tell. I've seen a few lights in the sky before, but this was not the same and was surely something incredibly unusual. There is no question that this was some time of mechanical device which appeared to be under intelligent control. It seemed to actually be inspecting us as surely it could have speeded off well before it elected to - and I am glad I had the chance to experience this. Any official investigator can contact me via email at the address I left above if you have any questions about this. This took place over 30 years ago and we still haven't released any military craft that could possibly maintain the height and speed this vehicle maintained without generating excessive noise, rushes of air or other sure signs that it is a man made device. I'd be willing to bet that whatever propelled this ship through our skies - it wasn't a technology that we have perfected on earth at this time - and surely not at that time. It takes a lot of fortitude to step up and tell stories like this and one can't help but think of what others will think - but who really cares what someone thinks of me at this point! Its more important that someone knows the truth of it and it can then be added to the volume of other similar encounters that could lead us to a better understanding somewhere down the road."],"Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Case Number":"14446","Latitude":"43.619842","Date Submitted":"09/30/1977 08:00 UTC","Region":"Michigan","Date of the Event":"09/30/1977 08:00 UTC","Sighting Duration":"00:03:00","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=43.619842,+-84.243612(14446)&iwloc=A&hl=en\"> mufon case (14446) map </A>","Tags":"City"}