{"divs":["Sighting DetailsI was camping near linville falls near wiseman's view. From my campsite I could see table rock in front through the trees. I saw what I thought was a helicopter come from the right and hover above the mountain. It stopped and hovered. I was watching for the brown mountain lights. I have seen them many time but never in the sky above the mountain. I went to Wisemans view to get a better look accross the mountain. There in the barren trees on top of the mountain I could see a white light flashing. This I recognized as a brown mountain light. In the sky to the right above the mountain I could see the object flashing red lights like a helicopter. The lights would flash red and white.The one in the sky would move up and down and appear to move farther away at times then return to the same spot. The light on the mountain seemed to coincide its flashing with the red light flashing. Sometimes they would flare at opposite times resembling communication. I dissmissed the possibility of a helicopter due to lack of noise and the movement of the object. I watched for some time and very faintly I could see other lights in the sky behind the first. They would appear then fade out. It was an overcast night and I could not see any stars. This lasted for an hour or more. It finnally faded out and i went back to camp where I could still see the light on the mountain. I will go back with a video camera next time and hopefully capture an event like this on film."],"Viewing Distance":"Unknown","Summary":"Lights flashing above the mountain.","Sighting Duration":"Undisclosed","Log Number":"US-12172008-0010","Latitude":"35.959294","map":"<A HREF = \"http://maps.google.com/maps?q=35.959294,+-81.94289(14449)&iwloc=A&hl=en\"> mufon case (14449) map </A>","Object Shape":"Circle, Flash, Saturn-like, Sphere, Star-like","City":"Linville Falls","Object Flight Path":"Stationary,Path then hovering","Date Submitted":"12/13/2008 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Case Number":"14449","trends":["There have been no other sightings in Linville Falls","This sighting has never been favorited."],"Longitude":"-81.94289","Tags":"City","Date of the Event":"12/13/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14449.html.txt","/var/www/straped/mufon/org/14449.html"],"Country":"United States","Disposition":"IFO","Region":"North Carolina","Source":"MUFON"}