{"Date Submitted":"12/17/2008 04:05 UTC","Object Shape":"Flash","Sighting Duration":"Undisclosed","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.245664,+-74.845997(14440)&iwloc=A&hl=en\"> mufon case (14440) map </A>","Latitude":"40.245664","divs":["Sighting DetailsI was in my computer room at my house and was about to go back upstairs when the foyer lit up and I looked outside. At first it was a bright red color that lit up the sky. It was like an enormous firework had been set off. At first i thought it was a fire engine but I didn't hear any noise at all. It then switched to being Blue and then to Green. It lit up the sky pretty well. It was like when a flare is shot up into the sky. I could see all the houses in the neighborhood exceptionally well. All this lasted only approx. 10 seconds or so and then it stopped and the night was black again. This was at around 4:05 am so it was quite dark. When I first saw it happening I thought it couldn't be real. It was almost a sort of panic that ran through me. I ran up to my room and looked out the window to see if I could see or hear anything else but I couldn't. I looked it up online and the closest explanation I found for it was that it was a meteor entering the atmosphere. But the strange thing was that it didn't move at all. It just flashed in one spot and disappeared."],"City":"Yardley","Disposition":"Hoax","Source":"MUFON","Region":"Pennsylvania","trends":["There have been 2 other sightings in Yardley","There were no other sightings in Yardley on or around December 17th 2008"],"Summary":"Bright flashing, alternating lights that lit up the sky.","Case Number":"14440","Weather Factors":"Snow","files":["/var/www/straped/mufon/html2text/14440.html.txt","/var/www/straped/mufon/org/14440.html"],"Longitude":"-74.845997","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Date of the Event":"12/17/2008 04:05 UTC","Log Number":"US-12172008-0002"}