{"trends":["There have been no other sightings in Duquoin","This sighting has never been favorited."],"Summary":"Arrowhead-shaped object with 15 white lights along the side.","Object Shape":"Triangle","Object Features":"Undisclosed","Longitude":"-89.221164","Country":"United States","Date Submitted":"12/31/1972 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Case Number":"14442","map":"<A HREF = \"http://maps.google.com/maps?q=38.071815,+-89.221164(14442)&iwloc=A&hl=en\"> mufon case (14442) map </A>","files":["/var/www/straped/mufon/html2text/14442.html.txt","/var/www/straped/mufon/org/14442.html"],"Log Number":"US-12172008-0004","Disposition":"Unknown","City":"Duquoin","Tags":"City","divs":["Sighting DetailsIt was a cold, clear winter night in Southern Illinois. I was a Junior in highschool so I know the year was 1973. I walked out the back door of my parent's house and was fumbling with a vacuum cleaner as I was placing it in the car. As I turned around, I noticed this HUGE, arrowhead-shaped object the size of my neighbor's house, hovering over that house. It was approximately the same length as the residence, one story high and was perhaps 25 feet over their roof line. It was silent and had 15 white lights along the side. I was horrified, dropped the vacuum and ran into the house. I could not breath, I could not speak, I was terrified. I could not get my disinterrested father to come see the craft and I was certainly not going back outside, so I ran to the kitchen window and continued to scream for someone to come and see this thing. From this vantage point I could see around the slightly curved front nose to the other side and could see the lights appeared to wrap all the way around. I could not count them. After approximately two minutes or so, the craft banked to the east and vanished. When it banked, I was able to see underneath and could see that the back of the ship was more arrow-shaped than triangular. It was black and appeared to be metalic. Over the next several weeks , I canvassed all my neighbors and no one saw anything. They thought I was crazy but I knew what I saw and how terrified I continued to be following the sighting. Two years later at a party, I was approached by a former neighbor named (available upon request) who asked me if I had seen anything in the sky one night back in January, 1973. She too saw the object which made me feel somewhat better. The object I saw back in January of 1973 was incredibly similar to the one you investigated in Lebanon and Milstadt Illinois. I can tell you exactly how big the dimensions were. I could have thrown a rock and hit the thing. I can still recall how terrified I was that night. Although my parent's house has seen been torn down, the neighbor's house remains and I could show you precisely the spot in which I was standing when that thing scared the be-jesus out of me. Perhaps this could give you a better idea of the exact size of the craft. There was one other incident I recall in 1976 (I was going to college, so that is how I remember the date). It also occurred in Southern Illinois on the Royalton blacktop outside of Elkville, IL. approximately 7 miles from DuQuoin. It was in the summer around the 4th of July, 1976. I was driving to work, heading East on the Royalton blacktop when I saw a red ball arc up from the woods to my left (north). I didn't pay any attention as I assumed it was fireworks from the 4th. Suddenly, the red ball ran parallel to the treetops and then shot across the field in front of my car, perhaps 100 yards ahead, 200 feet from the ground and circled back. I just lost it!! This thing circled back and began following me, gaining on me at a high rate of speed. I was doing 75 mph on a rural highway and was totally in a panic. I knew there was a 90 degree turn just ahead in the road and I was too afraid to consider slowing down as this thing was gaining on me fast. Suddenly, it erratically shot back to the south across the top of the treeline and was gone. I pulled off the road and cried for about 5 minutes as I was visibly shaken. The object was a red, gaseous orb with what appeared to be a solid core of some type. It was no more than 5-6 feet across andd travelling at a very high rate of speed. Fortunately, I am happy to report, these are my only UFO sitings and both occured in Southern Illinois, 90 miles from St. Louis, 45 miles from Hwy 64. This has haunted me since 1973. I know what I saw but could not find anyone to corroborate my story. When I saw your special on the Discovery channel and the sitings in Southern Illinois, I was thrilled to know I wasn't the only one to see these things. People in the area have jokingly said it might have something to do with the Cahokia Indian Mounds. That is as plausible an explanation as any one I might have! I just don't know, but I am happy to get this off my chest. It is quite cathartic. Thank you for your time. Sincerely, Frances Wiggins, DC 17515A Tangi Lakes Drive Hammond, LA 70401 Phone: (985)634-4006"],"Date of the Event":"12/31/1972 12:00 UTC","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"38.071815","Region":"Illinois","Weather Factors":"Unknown"}