{"Sighting Duration":"00:00:00","Summary":"While flying around Lake Ozark, we took a picture of clouds and a storm and cought a triangle object in the picture.","Object Features":"None","Object Flight Path":"Unknown","City":"Versailles","Longitude":"-92.841027","Region":"Missouri","Date of the Event":"06/10/2007 05:30 UTC","Viewing Distance":"Over One Mile","Log Number":"US-12182008-0005","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.431414,+-92.841027(14454)&iwloc=A&hl=en\"> mufon case (14454) map </A>","files":["/var/www/straped/mufon/html2text/14454.html.txt","/var/www/straped/mufon/org/14454.html"],"Object Shape":"Triangle","trends":["There have been 2 other sightings in Versailles","There were no other sightings in Versailles on or around June 10th 2007"],"Disposition":"Unknown","Date Submitted":"06/10/2007 05:30 UTC","Case Number":"14454","Latitude":"38.431414","divs":["Sighting DetailsWhile trying to fly from Lake Ozark to Union, Missouri in a small plane, we had to navigate around thunder showers that had lightning in them. After visability deteriated, we turned back towards the Lake Ozark area that was clear of the storms. My passenger was facinated with the clouds and colors, and as the sun was starting to set he started taking pictures, perhaps around 5:30 PM. My passenger just recently opened the pictures, he had forgotten about them actualy, and I had to go back in my flight log to get the date when the pictures were taken. His favorite picture was one with storm clouds all around with a clear sky behind. There is orange colors casting off some of the clouds, and is very beautiful. When he decided to enlarge this one particular photo and make copies to send to people, he noticed what looks like a smudge. As he zoomed in on the smudge, it took up an appearance of a perfect triangle. It appears to be on the other side of the storm clouds that create the illusion that we are flying in a cave. The air was unstable, very moist, and we were watching thunder showers appear and disapear in a matter of minutes. There was considerable lightning strikes that, although were several miles from the aircraft, made my passenger nervouse. As I was turning the aircraft to dodge water shafts and cloud colunms, my passenger started taking the pictures at random. We only have the one photograph, I do not know if he scrutinized the rest of the photos. Before I got the call to check out the smudge, my passenger had sent me this link to report such events. I have had your MUFON site on my computor since...12-2-08, as I had told him the story of what happend to my uncle and his brother in law in the Canyon of the Gunnison, Colorado while on a fishing trip. That is a story I should have past along to you, but for now here is just a photo. It's interesting, but I am not sure what it is. I did some calculations with respect to the aircrafts possition which I believe was 250 to 260 degrees. My passenger was taking pictures from the right side of the aircraft and forward. I estamate the camera was looking perhaps 280 to 300 degrees. In that direction, some 150 miles distant, is Whiteman Airbase. That is where B-1 bombers are kept. Or is it B-2 bombers that are shapped like a triangle? Thanks, Bob"],"Weather Factors":"Lightning, Medium, Light","Country":"United States","Source":"MUFON"}