{"files":["/var/www/straped/mufon/html2text/1445.html.txt","/var/www/straped/mufon/org/1445.html"],"Disposition":"Unresolved","Object Features":"Window(s)","Weather Factors":"Unknown","Date of the Event":"09/30/1957 10:00 UTC","Log Number":"","City":"Allen Park","Summary":"Occupants in Navy Uniforms seen in Allen Park, Mic","Case Number":"1445","Source":"MUFON","trends":["There have been 3 other sightings in Allen Park","There were no other sightings in Allen Park on or around September 30th 1957"],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.264978,+-83.203808(1445)&iwloc=A&hl=en\"> mufon case (1445) map </A>","Region":"Michigan","Date Submitted":"09/30/1957 10:00 UTC","Longitude":"-83.203808","Object Flight Path":"Unknown","divs":["Sighting DetailsSummary of the witness narrative included within a letter to Dr. Hynek datedApril 12, 1973:My sister and I saw a flying saucer in October of 1957 on a Thursday eveningabout 10:00 oclock in Allen Park, Mich. I was driving east and stopped for ared light. I glanced up and saw this round, reddish orange saucer object about30 feet in diameter going west andit was about 15 or 20 feet above the treetops. I told my sister to look at it and asked if she thought we should turnaround and follow it, so we did. We followed it about a block or two and thenthe saucer headed south-west and then took off very fast. My sister said shecould see two figures dressed in what looked like to her, white navy uniforms. She said one was standing at what she thought was an architects drawing boardand the other one walked toward him and around him and then walked toward thewindow. The saucer was too high up for her to notice the faces. I did not seethe figures because I was trying to watch the traffic as well as thesaucer....My sister and I have good reputations. We teach school and do notdrink alcoholic beverages and , and do not have hallucinations and do not telllies or make up stories....."],"Latitude":"42.264978","Sighting Duration":"00:00:59","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Unknown"}