{"Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Insufficient Data","Object Features":"None, Unknown","Tags":"City","Source":"MUFON","Object Flight Path":"Stationary,Other,Unknown","City":"Logansport","Sighting Duration":"00:00:10","divs":["Sighting Details I cannot remember the Exact date, I am close if not correct Dec 11 or 12th 2:02 A.M. -Weather -cloudy? (no stars visible) Ok first of all I have No Idea what this \"thing\" \"was\" that I saw, Just seeing it made me feel confused,Because it was 2 A.M.!! I was on my 15 min cigarette break at work, and where I work u are not allowed to smoke on campus so u have to drive out off grounds so Im driving to the smoking area which is just a few turns,curves and a little stretch of road, While I was driving.. to my right there is a big field with tree lines pretty far back.While driving On the tree line was this round orange glow, I was like?? Sun? Moon? and like questioning my thinking like duh no its not the sun!! its 2a.m. and I was thinking it was just the moon..and in the back of my mind thinking I never saw an orange moon in Dec or yet as much one that low that big this time in the morning..So I got to the smoking area.and from there this object\" I thought was the moon . or had myself convinced was the moon was not visible. I parked, had my cigarette break usually 15mins. Drove back down that very same road.still kind of intrigued and fascinated by the color of this object, which I dismissed as a \"moon\"On the way back T object was no longer there. I went inside and told my co-workers about what I saw and that it was probrably just the moon. (The very next night) I went on my cigarette break @ 2- A.M. it was a clear night. I looked out into the field and tree line to see if I could see anything similar to what I had seen the previous night.I didn't..... What I did see .... I looked \"UP\" and out my cardoor window and I seen the Moon ! It was a clear bright night and there were stars.the moon was defnately not orange, Nor was it anywhere close to where the object I seen the night before was. And it was bigger than the moon was.. So I guess I just wanna know if anyone knows what I may have seen or..if it could be anything of significance. Thank You for Listening."],"Date Submitted":"12/12/2008 02:02 UTC","Summary":"Visual of a round very illuminated orange glow 2 a.m.","Region":"Indiana","Log Number":"US-12182008-0004","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around December 12th 2008"],"Object Shape":"Circle, Fireball, Sphere, Other, Unknown","files":["/var/www/straped/mufon/html2text/14453.html.txt","/var/www/straped/mufon/org/14453.html"],"Case Number":"14453","Country":"United States","Latitude":"40.742202","Date of the Event":"12/12/2008 02:02 UTC","Longitude":"-86.399745","map":"<A HREF = \"http://maps.google.com/maps?q=40.742202,+-86.399745(14453)&iwloc=A&hl=en\"> mufon case (14453) map </A>"}