{"Object Shape":"Star-like","Date of the Event":"12/17/2008 12:00 UTC","trends":["There have been 3 other sightings in Hephzibah","There were no other sightings in Hephzibah on or around December 17th 2008"],"Object Features":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.323631,+-82.095186(14451)&iwloc=A&hl=en\"> mufon case (14451) map </A>","Summary":"Husband and I seen 3 amber lights one larger hovering, while we were in our outdoor spa, then I seen later very long line of star like planes(?)","divs":["Sighting DetailsMy husband and I were sitting in our spa last nite, he was sitting in the seat direction facing the sky. He saw 3 red lights one larger hovering (he did NOT say anything to me, because we read in the newspaper there were training excercises being conducted in our area. He went in the house and I took his seat and was looking out into the sky and I seen 3 AMBER colored lights flying oddly (like hovering) one larger than the other. Then there appeared other objects in the sky that resembled Flickering stars flying darting in the sky, at times as many as 6 or 7 appeared darting, dont know where they came from. It was a nice show of lights, and I thought the same thing as my husband. He came out for a minute and I told him what I witnessed and he said he seen the same thing, and it was probable an airforce exercise, he went inside. I stayed to witness more star-like things racing across the sky. Then I heard coming from the direction of our airport what sounded like a large airplane, I looked in the diredtion of the noise and seen what resembled a row of stars flickering on and off following one another, It seemed to go on for a minute or two. It sounded like all the flickerings made one NOISE. I called the police dept and they did not know anything, I called the number in the newspaper that reported the exercise, and they said the training was over long ago. Called Our Fort Gordon and the person there is suppose to get back with me. Thanks for listening, ilene"],"Source":"MUFON","Disposition":"Unknown","City":"Hephzibah","Log Number":"US-12182008-0002","Object Flight Path":"Hovering then path,Path with directional change","Case Number":"14451","Date Submitted":"12/17/2008 12:00 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/14451.html.txt","/var/www/straped/mufon/org/14451.html"],"Country":"United States","Longitude":"-82.095186","Latitude":"33.323631","Sighting Duration":"Undisclosed","Region":"Georgia","Weather Factors":"Unknown"}