{"Country":"United States","Object Shape":"Other","Latitude":"33.479216","map":"<A HREF = \"http://maps.google.com/maps?q=33.479216,+-82.00436(14460)&iwloc=A&hl=en\"> mufon case (14460) map </A>","divs":["Sighting Detailsat approx 6;37pm on Wednesday night I pulled into a filling station and began pumping fuel into my car. I noticed several peculiar looking amber lights in the southern sky about 30 degrees above the horizon. That placed the lights above the Fort Gordon Military Reservation. The lights were obvious even through a barren tree and power lines partiall obscured the field of vision. At first I thought the lights may have been fireworks or perhaps flares but the color of the lights were unusually pure color and did not \"flicker\" as do illumination or anti-missile flares. The first lights exhibited short-range movenment and fadded away within 4 to 5 seconds, They all dissappeared within a second of each other. Then about 4 seconds later another 3 lights appeared (also Amber in color) equadistant from each other in a horizontal plane but exhibited variable relative motion so I do not think they were connected to each other. Then a fourth amber light appeared and crossed in front of the other three in a left to right motion. There may have been a slight \"trail\" behind this light. After approx 5 seconds each light fadded away, also within 1 or 2 seconds of each other. I suspect that these lights were in fact conventional objects in that they appeared to be incandescent in nature, even though they were of a very pure color with no sparks. It is entirely conveivable it was a re-entry of a satellite viewed as it approached the observer."],"Date of the Event":"12/17/2008 06:37 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"00:00:30","Longitude":"-82.00436","Summary":"Short duration amber colored lights.","Date Submitted":"12/17/2008 06:37 UTC","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Case Number":"14460","trends":["There have been 20 other sightings in Augusta","There was one other sighting in Augusta on or around December 17th 2008","This sighting has never been favorited.",""],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/14460.html.txt","/var/www/straped/mufon/more/14460_submitter_file1__pict1.jpg","/var/www/straped/mufon/org/14460.html"],"Region":"Georgia","Disposition":"Unknown","City":"Augusta","Log Number":"US-12192008-0001","Object Flight Path":"Other"}