{"map":"<A HREF = \"http://maps.google.com/maps?q=51.441642,+5.469722(14468)&iwloc=A&hl=en\"> mufon case (14468) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsAt 17.35 pm on the 19th december 2008, after dark, 7 bright orange ufo's flew over Waalre, the village I live in. They flew in an distinct formation. They made absolutely no sound. Were bright orange and circular. From my distance they looked the size of a green pee. I have two eye witnesses that saw them also at another location in Waalre! There were no flickering lights or noise to be heard as is the case when you see regular aircraft. I saw them for about 3 minutes until they passed over my house. When I checked on google later that night, I found that there are more reports of orange ufo's all over the world. Is there really something going on? I have made two foto's via the camera on my phone. I will now check to see the quality of them on my pc. When I first noticed them, I saw them through my kitchen window downstairs. When I raced up to my upstairs window I saw that there were more following. After I opened my window I heard no sound! At firs when I saw the first object, I thought it might be mars because it is also orange. Then I thought it might be a plane, but there were no flickering lights and no noise!!!! They flew in a formation, that they stayed in very accurately. Flying straight on from Veldhoven towards Maastricht. Steady flight. Not slow, not fast, but steady. At a constant spead. Bright orange circular objects. To bright to see the posible actual structure that made the bright light. I was in amazement and excited enough to call my parents, who then saw them also from their backyard. I am still amazed! I lost sight of the objects after they flew over my house."],"Source":"MUFON","Object Shape":"Circle","Summary":"7 orange UFOs fly over Waalre in formation.","files":["/var/www/straped/mufon/html2text/14468.html.txt","/var/www/straped/mufon/org/14468.html"],"Object Flight Path":"Straight-line path","Country":"The Netherlands","Log Number":"NL-12202008-0003","Region":"Noord-Brabant","Sighting Duration":"00:03:00","Date of the Event":"12/19/2008 05:35 UTC","Weather Factors":"None","trends":["There have been no other sightings in Eindhoven","This sighting has never been favorited."],"Longitude":"5.469722","Object Features":"None","Viewing Distance":"Over One Mile","Date Submitted":"12/19/2008 05:35 UTC","City":"Eindhoven","Latitude":"51.441642","Tags":"City","Case Number":"14468"}