{"Case Number":"14465","Sighting Duration":"00:09:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=21.269704,+-157.786438(14465)&iwloc=A&hl=en\"> mufon case (14465) map </A>","Date of the Event":"12/15/2008 12:57 UTC","Region":"Hawaii","Source":"MUFON","Object Shape":"Square, Rectagular, Star-like, Triangle","Summary":"UFO changes form or multiplies.","Longitude":"-157.786438","City":"Honolulu","Log Number":"US-12192008-0006","Country":"United States","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Date Submitted":"12/15/2008 12:57 UTC","divs":["sighting detailshonolulu hawaii over looking kahala. was using my new camcorder i got for x-mas to zoom in on the city and then appeared some star like lights. it started off as two lights and they were moving in unison together. i was not sure what it was so i just followed it with my camera. the lights were so far away that i could not see them with the naked eye. i could only see them through the view finder. as it moved behind a building i went ahead and started to record. the two lights turned into three. then the three turned into four. all lights were traveling at a constant speed with one another so that made me feel like it was one piece instead of each light being separate. the distance of the craft was pretty far away. a rough guess would be that the craft was about 700-1500 ft long. i used this as a reference by noticing it went behind haunama bay which is very far away. i have pictures and videos that i uploaded to youtube because when i try uploading it on here, it kept giving me error messages. http:\\\\www.youtube.com\\watch?v=fjb2xvqq3ss http:\\\\www.youtube.com\\watch?v=lt8tydazqhq&feature=channel http:\\\\www.youtube.com\\watch?v=cgmq1rkylym&feature=channel http:\\\\www.youtube.com\\watch?v=2emtzq5dvis&feature=channel"],"files":["/var/www/straped/mufon/html2text/14465.html.txt","/var/www/straped/mufon/org/14465.html"],"Object Features":"Undisclosed","Disposition":"Unresolved","trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around December 15th 2008"],"Weather Factors":"Unknown","Latitude":"21.269704"}