{"Viewing Distance":"Unknown","Longitude":"76.860565","Country":"India","trends":["There have been no other sightings in Panchkula","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/14473.html.txt","/var/www/straped/mufon/org/14473.html"],"Date Submitted":"06/23/2007 08:18 UTC","Tags":"City","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"IN-12212008-0002","Object Flight Path":"Undisclosed","Summary":"Noticed helicopter shaped.( not clear tho)...moving in a very bizaree way leaving behind different colours of tail. Slow movement!","Date of the Event":"06/23/2007 08:18 UTC","Weather Factors":"Unknown","Case Number":"14473","map":"<A HREF = \"http://maps.google.com/maps?q=30.694209,+76.860565(14473)&iwloc=A&hl=en\"> mufon case (14473) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsAlright 23rd June, 2007 Incident Location: Panchkula, Sector- 12, Haryana ( Chdandigarh) INDIA. I was walking with my friend. We saw a helicopter sort of thing. Taking the glimpse of it ....I said its UFO.. I was joking at that time. I guess law of physics quantum works. So yea, It was a UFO. Its shaped- Looked like a Helicopter moving in a very bizarre way leaving behind different colours of tail. We thought for a second some one is burning crackers up in the air to celebrate something. But to our great surprise we realize it was a UFO, coz many other people also sighted it. But the one we noticed was totally different. It was flying at the range of approx. 200 kms up in the air and making an angel of 45 % ( my eye and that UFO) from the place where I was ! We didn't lose the sight of it. It was there all the time pacing slowing leaving behind its beautiful different colour tail. Apparently we did lose the sight if it as we were walking and when we tried to trace it in the air later, there was no sign of it. I guess it didn't move fast. rather more slow than a helicopter speed ! But basically to give you an India of new sort of ship. However I did try to click the picture of it unfortunately the mobile I possed at that time was of low clarity and since it was dark , one could hardly make out what was in that photo."],"Latitude":"30.694209","Object Shape":"Other","Region":"Haryana","Source":"MUFON","City":"Panchkula"}