{"trends":["There has been one other sighting in Georgetown","There were no other sightings in Georgetown on or around December 18th 2007","This sighting has never been favorited.",""],"Region":"Alabama","Date Submitted":"12/18/2007 08:00 UTC","City":"Georgetown","Longitude":"-87.72604","Object Shape":"Blimp, Circle, Oval, Star-like, Other","Latitude":"31.29889","Source":"MUFON","Weather Factors":"None","Log Number":"US-12202008-0005","Date of the Event":"12/18/2007 08:00 UTC","Object Features":"Unknown","divs":["Sighting DetailsIt was approximately 8 PM. I walked outside and looked up at the stars. To the east of our house I saw what looked like a very large, bright star. At first I thought it was a planet, but then realized it was much larger and brighter than anything I had seen before. I kept staring at it wondering what it was and I noticed that there seemed to be different colored lights blinking in it also. There was green, red, and blue that I could see. It clearly wasn't a plane because after approximately 10 minutes it had not really moved. I then called my daughter and mom out to see what they thought of it. My mom was the first to notice that it seemed to be moving, although because of the distance it was very slight. As we watched it, we noticed that it would move slightly in all direction, stopping after each move. But by my view, it never appeared to move more than a couple of inches on the sky and stayed in one specific area. I told my daughter to go get the camera because it had 48x zoom and I have used it in the past to get pictures of birds that were too far away to tell what they were with the naked eye. One I found it in the camera lens on max zoom I realized that it looked more like a ball or oval shape and was hovering then moving very quickly back and forth as if it were ploting points on a map. I took several pictures with the camera on \"action\" mode. We then stopped to view the pictures on the screen and the camera had captured an object moving that left streaks of multi-colored light behind it. We all took turns looking at it through the camera and taking pictures. There were approximately 70 pictures made of the this. Eventually we noticed a plane flying toward it coming from the oposite direction. This UFO was in the east upper horizon of the sky but below all the stars. Once the place was almost overhead us but slightly to the west. The UFO flew up and back, hesitated for a few seconds and then disappeared."],"files":["/var/www/straped/mufon/html2text/14471.html.txt","/var/www/straped/mufon/more/14471_submitter_file1__UFO12-18-2008009.jpg","/var/www/straped/mufon/more/14471_submitter_file2__UFO12-18-2008051.jpg","/var/www/straped/mufon/more/14471_submitter_file3__UFO12-18-2008069.jpg","/var/www/straped/mufon/org/14471.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.29889,+-87.72604(14471)&iwloc=A&hl=en\"> mufon case (14471) map </A>","Summary":"At first glance looked like a big star but had blinking different colored lights.","Tags":"City","Viewing Distance":"Unknown","Case Number":"14471","Object Flight Path":"Stationary,Path with directional change","Disposition":"Unknown","Country":"United States","Sighting Duration":"Undisclosed"}