{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Florida","Case Number":"14470","files":["/var/www/straped/mufon/html2text/14470.html.txt","/var/www/straped/mufon/org/14470.html"],"Latitude":"28.294326","Source":"MUFON","Disposition":"IFO","Date Submitted":"12/12/2008 09:05 UTC","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around December 12th 2008"],"Date of the Event":"12/12/2008 09:05 UTC","Log Number":"US-12202008-0004","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=28.294326,+-81.405331(14470)&iwloc=A&hl=en\"> mufon case (14470) map </A>","Summary":"A small ball of light, no unlike a star, moved across the sky, east to west, until it disappeared.","Country":"United States","Object Features":"None","Longitude":"-81.405331","Weather Factors":"None","Object Shape":"Sphere, Star-like","Tags":"City","City":"Kissimmee","divs":["Sighting DetailsThough I don't know what I saw, I am not discounting the great possibility that it was a shooting star that I witnessed December 12th just after 9pm while waiting for the firework show to start at the Epcot Center. The sky was clear, the stars were bright and the Epcot lights were dimmed or off in preparation for the fireworks display. It was very cold that night and there was a biting breeze that blew occasionally off the water. While sitting on a bench in the viking country of Epcot, I witnessed what appeared to be something like a star or ball of light that seemed to appear out of nowhere, moving away from me, east to west in a slightly arching line, quickly across the sky, for a few short seconds before disappearing. It seemed a good distance away and it didn't seem to cover much sky before vanishing. My family was not paying attention to the sky when I tried to point it out to them and it happened too quickly anyway so I was the only witness. I've seen plenty of shooting stars before and this did seem to have similar characteristics but I thought it might be helpful to report this to you just in case it could be something more. I felt excited to have witnessed such a thing but wondered if it was a piece of nature I saw or something other-worldly. I was not afraid and did not feel threated. I only had a sense of wonderment and curiosity. As I said before, it appeared out of nowhere almost as quickly as it disappeared into the darkness of the night sky."]}