{"Log Number":"","Summary":"Blimplike Object seen near Springfield, Michigan","divs":["Sighting DetailsField Investigators Narrative:On Saturday, Aug. 25, 1973, in Battle Creek, Michigan, Mrs. ___ was driving heraunt, Mrs. ___, along Dickman Road approaching the city of Springfield (adjacentto Battle Creek). As the car approached 20th street, Mrs. ___ slowed for atraffic light. The time was about 6:00 p.m. Mrs. ___ saw what she firstthought was a balloon high to her right and stationary in the air, apparentlyover a business place on Dickman Road. At first she thought it was anadvertising gimmick and looked for a sign or lettering. There was none. \"Itlooked like a small dirigible or baby blimp\", she said. \"There was no gondolavisible but I saw what appeared to be two fins near the rear. These werewhite.\" The rest of the object seemed to be a self-luminous yellow color. \"Theobject remained fixed and we drove away from it,\" she said. \"I continued tolook back on it until it was obstructed from my view. On our return over thesame route it was gone (later)\". She described the object as \"an elongatedyellow object stationary in the air, with a \"nose\" larger in proportion to therest of the object. A drawing is included in her report. Mrs. ___ didntreport the sighting until after hearing a publicized sighting report on Aug. 28,in an attempt to substantiate the claims of the nine witnesses of that latersighting. The FI notes that the above report was not publicized."],"Date of the Event":"08/25/1973 06:00 UTC","Country":"United States","Region":"Michigan","Source":"MUFON","City":"Springfield","Weather Factors":"Unknown","trends":["There have been no other sightings in Springfield","This sighting has never been favorited."],"Disposition":"Unresolved","Object Flight Path":"Stationary","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Blimp","Case Number":"1447","files":["/var/www/straped/mufon/html2text/1447.html.txt","/var/www/straped/mufon/org/1447.html"],"Longitude":"-85.239161","Date Submitted":"08/25/1973 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.32643,+-85.239161(1447)&iwloc=A&hl=en\"> mufon case (1447) map </A>","Object Features":"Other","Sighting Duration":"00:05:00","Latitude":"42.32643"}