{"Longitude":"-122.417266","Disposition":"Hoax","Object Features":"Undisclosed","City":"San Francisco","Viewing Distance":"Over One Mile","Tags":"City","Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=37.77895,+-122.417266(14479)&iwloc=A&hl=en\"> mufon case (14479) map </A>","Log Number":"US-12212008-0008","Weather Factors":"Unknown","Region":"California","Country":"United States","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around December 13th 2008"],"Object Shape":"Bullet, Missile","Summary":"a bright light shoot down from the sky diagonally","Source":"MUFON","Case Number":"14479","Latitude":"37.77895","Date Submitted":"12/13/2008 11:15 UTC","Date of the Event":"12/13/2008 11:15 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsOn december 13th, 2008 at around 11:15 pm (pacific coast time) in san francisco California, i was drinving with my girlfriend and my two friends sitting in the backseat. i was driving of the freeway and we were all pretty quiet listening to music with low volume. i was driving of the freeway looking at the road ahead of me. All of a sudden i saw an extremely bright light in the sky ahead of me all of a sudden shooting down diagonally extremely fast like around 20-30 degrees off of the horizon from where i was. to me it seemed like it was a white dot of light that all of a sudden popped out of the sky and immediately shot down towards the ground. i could not see where excatly it landed or anything because it shot down and went behind this hill hill in the distance. When i first saw it my first insticnt was that it was like maybe firework but i quickly realized that it could not be because fireworks go up, then i thought maybe it was some sort of missle but i dont think that i would not have seem something as bright as that coming from higher up in the sky because i just saw it pop out of nowhere. then i started to think. after around 30 seconds i said \"wait hold on.. did u guys see that???\" and immediatelly my girlfriend said \"yeah, what was it?\" then i said \"i dont know what did you see\" and according to her she saw a bright white line coming from the sky diagonally but she says she only saw it with her perifiral vision. i assume that it was a bright dot that was moving so fast that it seemed like a line coming down diaginally in a perfecly straight line. i knew that it could not be lightning because when i got out of the car i looked up at the sky and saw that it was a very clear night without a cloud in sight. also it could not have been lightning becuase it was way to bright. and also lightning comes down straight to the ground but this came down diagonally and in a straight line. I know that it was not a shooting star either becuase i have seen many and this was way brighter and bigger than a star and faster. after that we were all pretty scared and confused."],"files":["/var/www/straped/mufon/html2text/14479.html.txt","/var/www/straped/mufon/org/14479.html"]}