{"Log Number":"US-12222008-0002","divs":["sighting detailsthere has recently been a severe winter storm in the portland, or area - snow, then freezing rain, then more snow. there was no precipitation at the time of the event, but it was overcast. i was in my bedroom browsing online. my computer is near a west-facing window. around 9:20 i saw a series of about 3 flashes of bright white light off in the distance, appearing to originate on the ground near the willamette river. right after i saw that, the sky in that area went dark and i heard a distinct sharp and short electric buzz - i realized a transformer had blown. a few minutes after that, i saw a bright flashing light from overhead - it totally lit up the sky over our neighborhood and towards the north (directly south of portland). this light pulsed regularly and changed colors randomly from red to blue to white to a strange green for approximately 3 minutes, then went out. my son went outside during the event to see if another transformer was blowing out, but the source of the lights appeared to be in the clouds. we couldn't hear any emergency vehicles or helicopter\\airplane that could explain the pulsing lights. the location of the lights remained stationary during the entire event."],"files":["/var/www/straped/mufon/html2text/14484.html.txt","/var/www/straped/mufon/org/14484.html"],"Date Submitted":"12/21/2008 09:30 UTC","trends":["There have been 10 other sightings in Milwaukie","There were no other sightings in Milwaukie on or around December 21st 2008"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Oregon","map":"<A HREF = \"http://maps.google.com/maps?q=45.45593,+-122.630261(14484)&iwloc=A&hl=en\"> mufon case (14484) map </A>","Weather Factors":"Unknown","Summary":"Stationary flashing lights in cloudy sky - white, blue, red, green.","Disposition":"IFO","Longitude":"-122.630261","Case Number":"14484","Country":"United States","Date of the Event":"12/21/2008 09:30 UTC","Tags":"City","Object Shape":"Unknown","Latitude":"45.45593","Source":"MUFON","City":"Milwaukie","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}