{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.102726,+-74.846641(14488)&iwloc=A&hl=en\"> mufon case (14488) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Date of the Event":"12/21/2008 05:55 UTC","Object Features":"Undisclosed","Region":"Pennsylvania","Source":"MUFON","Object Shape":"Star-like","divs":["Sighting DetailsMy family and I were sitting in a dark church parking lot waiting for 6:00 pm mass. We were say 10 or 15 minutes early and were the only car in the lot so we waited for more cars to show up and then go in. The eastern sky view was over the Delaware River and there is virtually nothing in the background (no city lights ...) Then it looked like a shooting star the size of a jet airliner, however it was a neon green. It streaked across the sky in a downward trajectory and then burnt out. In the far distance (south - down river towards Philadelphia) it looked as though a military hellicopter with a bright light spotted the incident and came towards us to investigate. I say it was a military hellicopter because it was a very slow moving, large object with a very, very bright light. It wasn't a bright star because it did kind of sit still, but then moved. Jets appear to move steady through the sky. We all saw the second light sit still, then move in our direction. Anyway, other cars arrived and we went to church. Just wonder if anyone reported the came commet (UFO)?"],"City":"Bristol","Summary":"Bright neon green shooting star the size of a jet airliner.","Date Submitted":"12/21/2008 05:55 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/14488.html.txt","/var/www/straped/mufon/org/14488.html"],"Country":"United States","Case Number":"14488","Log Number":"US-12222008-0006","trends":["There have been 2 other sightings in Bristol","There were no other sightings in Bristol on or around December 21st 2008"],"Disposition":"Unknown","Latitude":"40.102726","Longitude":"-74.846641","Weather Factors":"Unknown"}