{"files":["/var/www/straped/mufon/html2text/14499.html.txt","/var/www/straped/mufon/more/14499_submitter_file2__alien2.bmp.1","/var/www/straped/mufon/more/14499_submitter_file3__alien3.bmp.1","/var/www/straped/mufon/org/14499.html"],"Disposition":"Insufficient Data","Log Number":"US-12232008-0003","Date Submitted":"09/30/2008 12:00 UTC","Viewing Distance":"21-100 Feet","Country":"United States","Summary":"Alien hidding behind a tree!","Object Features":"Other","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Unknown","Source":"MUFON","Date of the Event":"09/30/2008 12:00 UTC","City":"cms/tg","Weather Factors":"Does Not Apply","Tags":"City","Longitude":"-85.594654","Case Number":"14499","Object Shape":"Other, Unknown","divs":["Sighting Details One night in October of 08' I went out looking around a certain place that I have visited a few times prior to this. I have gone to this place by myself and have caught some strange sounds also on film. I'm not recommending that anyone else should do that but always bring somebody else with you, for safety! This is a video capture from my video. What you are seeing is what I would call for a lack of a better word an alien?!? Or just unknown?! At the time of the incident I did have a friend with me. We were just walking around the place I had my video camera and flashlight he just had a flashlight. Now I did not see this nor did he after reviewing the tape on the computer I noticed this \"unknow\" move behind the tree when I panned left to right with the video. On the video you can clearly see this thing move from behing the tree and then back. It almost looks like it has a self glow to it, if you will. Notice the shape of the eyes and there position. Also the head shape! These are real and nothing fake about them!!! It did freak me out a little after I reviewd the tape but it was exciting to actualy think this could possible be an alien. I do believe that God in his infinite wisdom and creativity that we are not the only intellegent beings in this vast universe. So, I am attaching a couple of pics from the video here. Hope all of you enjoy this if not well your entitled to it I guess lol. Thank you mufon for the website and to all of you out there searching and posting ufo sightings to here keep it up!"],"trends":["there have been no other sightings in cms\\tg","This sighting has never been favorited."],"Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.554356,+-85.594654(14499)&iwloc=A&hl=en\"> mufon case (14499) map </A>","Latitude":"40.554356"}