{"Longitude":"-80.835927","Disposition":"Insufficient Data","Country":"United States","Object Shape":"Star-like, Other","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Summary":"Bright multicolored objects.","map":"<A HREF = \"http://maps.google.com/maps?q=35.236547,+-80.835927(14495)&iwloc=A&hl=en\"> mufon case (14495) map </A>","City":"Charlotte","Tags":"City","Object Features":"Unknown","Date Submitted":"12/22/2008 08:45 UTC","Date of the Event":"12/22/2008 08:45 UTC","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around December 22nd 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Region":"North Carolina","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was going out to my car to retrieve Christmas gifts when I noticed two very intense bright multicolored lights to the southeast low on the horizon just above the tree tops in the distance. At first I thought that they were airplanes, and immediately realized that they were not moving. At this point I realized that there were no airplanes in the general vicinity. I then thought that they were stars. The objects were in close proximity to each other and were the brightest lights in the sky. The lights were not flashing like the strobe, navigation, or beacon lights on an aircraft. The were changing colors repeatedly from blue to orange to gold to red to pure white. I realized that these were not airplanes, they were to low on the horizon and were not in the flight path of either airport. Additionally, I realized that the objects were approximately 1 to 1.5 miles from my location. I decided to get a photograph of the object. I was trying to get my camera out of my truck when I noticed that the object on the right (the smaller object) began to move away from the larger object. The object began moving to the west at a very slow rate of speed. The object moved a short distance and stopped and began to generate a tremendous amount of bright red light. The larger object the began to get brighter and larger in the sky at the same time and was emiting large amounts of bright multicolored light. As I was trying to photograph the object, the smaller object felw off at a hight rate of speed to the west. It did not move away slowly, it moved from a dead stop to the speed of a shooting star. As I was trying to photograph the object, it began to intensify in color. I was able to obtain one photograph of the object due to the shutter speed and lack of ambiant light, there was approximately a 30 second exposure. As I was attempting to obtain a second photograph, the object began to move. The object moved in the same direction as the smaller object had moved. The object decreased in size and turned a pale blue. I lost sight of the object as it traveled behind trees across the street. I then realized that I was hearing and seeing aircraft in the area."],"Case Number":"14495","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Log Number":"US-12222008-0013","files":["/var/www/straped/mufon/html2text/14495.html.txt","/var/www/straped/mufon/org/14495.html"],"Latitude":"35.236547"}