{"Disposition":"IFO","Object Shape":"Unknown","Object Flight Path":"Path with directional change","City":"Los Angeles","Sighting Duration":"Undisclosed","Case Number":"14493","Longitude":"-118.294782","Date of the Event":"12/21/2008 06:35 UTC","Latitude":"33.7947","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around December 21st 2008"],"Region":"California","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/14493.html.txt","/var/www/straped/mufon/org/14493.html"],"Viewing Distance":"21-100 Feet, 101-500 Feet","Date Submitted":"12/21/2008 06:35 UTC","divs":["Sighting DetailsMe and another person left the house and were driving east bound on Anaheim street. We saw bright blue object flying very fast up and down above us in the sky. It was flying over the houses that are next to the road. So we have pulled over to watch it. It was flying up and down really fast, than left to right, it kept disappearing and coming back. It changed color couple of times, from blue to green. We didn't have a chance to record it or grab a camera. THis object was moving very fast and in a matter of minutes disappeared completely. There is no way this was a helicopter, this object was moving very fast, I have never seen anything like that. When I first saw it, person next to me pointed it out, I couldn't believe my eyes. I couldn't understand what it might be. I had an explanation in my head. I thought that it might have been one of those flying toys that kids play with these days. But it was way too fast. changing directions in a matter of split seconds. We even drove to a near by park to see if we can find some kids playing with anything, but it was dark in there, there was no one at the park. This object disappeared so fast. I don't know how it went away, all of a sudden it was gone. I am sorry but no pictures or video was taken. Even if I was fast enough to grab a cell phone, I am not sure if I would be able to record anything, it was moving way too fast to even follow with my eyes. It kept changing colors, and disappearing."],"Weather Factors":"Unknown","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.7947,+-118.294782(14493)&iwloc=A&hl=en\"> mufon case (14493) map </A>","Log Number":"US-12222008-0011","Summary":"UFO flying in the sky - blue and green color"}