{"Country":"United States","Date of the Event":"07/16/1960 12:00 UTC","Region":"California","Case Number":"14496","Weather Factors":"None","Latitude":"40.31178","trends":["There have been 2 other sightings in Westwood","There were no other sightings in Westwood on or around July 16th 1960"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14496.html.txt","/var/www/straped/mufon/org/14496.html"],"Object Shape":"Circle","Longitude":"-121.000533","Date Submitted":"07/16/1960 12:00 UTC","Object Features":"Patterned Surface","City":"Westwood","Object Flight Path":"Stationary","divs":["Sighting DetailsI have never researched this because I don't have an exact date. I must leave a 2 year cushion. But sometime, probably during the summer months of 1960 or 1961 at midday, I was driving east on Sunset Blvd on the north side of the UCLA campus. I came to the stop light at Hilgard Ave. Everyone at the light was craning their necks out their car windows and looking up at the sky. I was driving a convertible, so I had an unobstructed view. I looked up to see a circular mother ship stopped dead in the sky, hovering over UCLA. It filled the sky and my field of vision so it had to be over a 1000 ft. in diameter at a height of several thousand feet. I cannot report any structural details, but I almost detected concentric circles on the underside of the craft, but I am not sure. My instinct was to pull over and get a good look at it, but the light turned green and there was no parking lane on Sunset Blvd., so I drove away in frustration. The experience was immediately dropped from my conscious mind, and I did not equate it with UFO's until years later. In those days I did not take UFO's seriously. I think I recall musing that there was no hope of communicating with them, and so there was no real urgency. Their agenda was none of my business and beyond my comprehension, and there was no one to report the incident to. My guess is, it was monitoring some nulear activity on the UCLA campus. The sighting remains vivid in my memory like where I was at Kennedy's death announcement. A mental milestone. If you can search by location and approximate time period I would greatly appreciate corroberation of this sighting."],"Log Number":"US-12222008-0014","Tags":"City","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Summary":"A circular mother ship parked over the UCLA campus at a stop light at Sunset Blvd. and Hilgard Ave. 1000 ft in diameter.","map":"<A HREF = \"http://maps.google.com/maps?q=40.31178,+-121.000533(14496)&iwloc=A&hl=en\"> mufon case (14496) map </A>"}