{"Summary":"Saw two hot dog like objects in the sky. Bun part highly reflective center was black.","Longitude":"-81.653521","Date of the Event":"12/18/2008 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.339384,+-81.653521(14503)&iwloc=A&hl=en\"> mufon case (14503) map </A>","Region":"Florida","Tags":"City","Date Submitted":"12/18/2008 03:30 UTC","Weather Factors":"None","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around December 18th 2008"],"Country":"United States","City":"Jacksonville","Source":"MUFON","Case Number":"14503","Object Shape":"Other","Sighting Duration":"Undisclosed","divs":["sighting detailslocation unf campus 1 unf drive jacksonville florida we had just punched out of work and left the building. i looked up and saw a shiny chrome like object moving kind of slow and steady, like it wasn't in a hurry. i asked my coworkers what they thought it was. they said it was an airplane. i looked harder at it. it had no wings left, no vapor trail. next i listened, there wasn't any sound. i looked for rotors like a helicopter, it had none. the shape was perfect. no lumps, bumps or protrusions . the only way i can discribe it: it looked like a big floating hot dog. the top and bottom (the bun) was highly reflective like chrome. the center (hot dog) was black in color. it was moving southward. as i was observing this i caught sight of a second one traveling northward. i hadn't seen it before. it was moving at the same speed and altitude. neither one seemed in a hurry. it wasn't a jetliner (no wings) it wasn't a helicopter although it was about the size of a chinook. (color was chrome like and the shape was too smooth. it wasn't a blimp(too long and not fat like a blimp) i have lived in jacksonville around 17 years. with 3 military bases here you see all kinds of aircraft. throw in the blimps and it is a pretty good number of aircraft. i watched the southern one till it disappeared behind a building. the whole thing lasted about 5 minutes. my coworkers went on to their cars while i stood there watching. the incident has bugged me for several days. i looked on your websight to see if anyone else reported it. nothing there. but today i started going back in your list of past sightings. surprisingly i found an almost identical event on 2\\3\\07 almost in the very same area where i work. this encouraged me to write you and give you the details of my sighting. i am not saying i saw a \"flying saucer\", for the life of me i cannot figure out what i did see."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14503.html.txt","/var/www/straped/mufon/org/14503.html"],"Latitude":"30.339384","Log Number":"US-12232008-0007","Object Flight Path":"Straight-line path"}