{"Object Features":"Other","Log Number":"US-12232008-0010","divs":["Sighting DetailsAt 11:35 PM I walked my two daughters to their cars outside my house after a party and we stood talking for a few minutes while Rachel got in her car. Rachel, age 30, saw a very large shooting star to the West, then a brightly lit \"cloud\" above the same area to the West of our location at approximately 60 degrees from the horizon. She pointed to the cloud and followed it heading North and said that it did not look like a normal cloud because it was glowing an amber color. The full moon was out, the cloud ceiling was low and it was windy. The scattered clouds were moving very fast. It was easy to see the sky, stars, moon, and clouds. At that point, at approximately 11:40 PM, Maria and I both saw a large black round disk-shaped object that appeared to be on it side (top or bottom facing us). The size was larger than a dessert plate held at arm's length. It was moving slowly from Southeast to Northwest along the bottom of the cloud ceiling, and moving slower than the clouds, which were clipping along at a fast pace. It was very windy. The full moon shone brightly and I assume that is the only reason we could see the object. There were no visible lights on the object. Maria, age 32, saw this at the same time I did, but Rachel did not, even though she was looking in the same area. After a few seconds, the object changed to a gray color, then just vanished. The total time of the sighting was approximately 10-15 seconds. I then said outloud \"We want to see evidence of any persons not of this world\" and all of us looked in the same direction where the black object had been and I was pointing. Right after I said this a shooting star appeared in that same spot. We were all very excited at seeing this but commented that it must be a shooting star and just a coincidence that it happened right when I asked for a sign. Then we saw lots of shooting stars all around the sky (probably a meteor shower). Rachel left for home. Maria got in her Suburban to leave, and I headed into the house from the porch, but when I turned back to say goodbye I noticed a bunch (maybe 10) of tiny twinkling lights or orbs floating and moving around approximately 12\" above the center of the hood of her vehicle, which appeared for approximately 4 seconds, then disappeared. I was looking at this area trying to figure out what the tiny lights were when I noticed a reflection of a rectangular light on the car hood. The light blinked on and off off. Maria got out of the car and the light appeared again. I soon figured out that it was blinking on and off every 25 seconds, so we knew it had to be something mechanical. Being square was odd, though. So she turned off her car and I turned off all the lights in and outside the house in order to see if we could identify the source of the light. It continued to blink on and off, being an amber color, white, or blue at different times. There were two spots close together where the lights appeared. We could not locate the source. We tried blocking the lights out with our hands, and checked the trees moving in the wind that might be blocking or unblocking lights. The one light continued to blink off and on at regular intervals of 25 seconds. The only reflection of light on the hood that we could identify was the moon, which was in a different location from the blinking lights. Then I realized something and said \"OMG\" - and Maria finished my sentence with \"It's something we can't see and it's above us.\" I ran inside and grabbed my video camera which I had charged up the night before and it went dead after 3 seconds. Maria got her Sony digital camera out of the car and video-taped and took photos of the car and in the sky above us. Note: The photos came out very dark and smudgy. I got the night vision monocular out but could see nothing. I then saw a tiny orb appear inside Maria's vehicle, then disappear. I fully expected to see a ship hoovering right above us! We could feel the presence of something. Then, 45 minutes afterwe first noticed them, the lights stopped at approximately 1:35 AM."],"Country":"United States","Date Submitted":"12/13/2008 11:40 UTC","files":["/var/www/straped/mufon/html2text/14506.html.txt","/var/www/straped/mufon/more/14506_submitter_file1__Sighting121308.jpg","/var/www/straped/mufon/org/14506.html"],"City":"Independence","Object Flight Path":"Straight-line path","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around December 13th 2008","This sighting has never been favorited.",""],"Latitude":"39.097226","Date of the Event":"12/13/2008 11:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.097226,+-94.405997(14506)&iwloc=A&hl=en\"> mufon case (14506) map </A>","Tags":"City","Weather Factors":"Windy","Object Shape":"Circle","Summary":"Giant black UFO and unexplained lights over Independence, MO.","Sighting Duration":"Undisclosed","Longitude":"-94.405997","Region":"Missouri","Source":"MUFON","Case Number":"14506","Viewing Distance":"Unknown","Disposition":"Unknown"}