{"files":["/var/www/straped/mufon/html2text/14502.html.txt","/var/www/straped/mufon/org/14502.html"],"Object Flight Path":"Straight-line path","Date Submitted":"12/22/2008 05:46 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.33113,+-72.634301(14502)&iwloc=A&hl=en\"> mufon case (14502) map </A>","trends":["There have been 9 other sightings in Northampton","There were no other sightings in Northampton on or around December 22nd 2008"],"Latitude":"42.33113","Object Features":"None","City":"Northampton","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/22/2008 05:46 UTC","Case Number":"14502","Tags":"City","Longitude":"-72.634301","Object Shape":"Sphere","Disposition":"Unresolved","Region":"Massachusetts","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsI noticed an glowing orange light in the sky (dark night) whilst driving home with my daughter, it was to my right side so i asked my daughter if she could see what it was. She thought it may be a shooting star. I wondered if it was a comet initially. I made a right turn & parked so i could look at it. It was moving very slowly, no sound, as it moved across the sky i noticed a kind of cone shaped dim light around the front of it, i can only describe it as the kind of effect that a search light gives in the sky, a faint glow. The cone shape at one point tilted direction. It passed over the sky from right to left. As it travelled further it was getting lower & looked as if it was heading for the ground, it went out of our line of vision. i fully expected an explosion but nothing happened. We both just watched as it travelled, at one point i thought to get my phone out to take a video, but i wouldn't have had time to capture it. We couldn't work out what it could have been, i still have no explanation. I did feel that we had seen something very strange, and i still would like to know if there had been any other reports."],"Country":"United States","Summary":"Orange glowing sphere with a cone shaped glow.","Log Number":"GB-12232008-0006"}