{"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/14500.html.txt","/var/www/straped/mufon/org/14500.html"],"Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.959544,+-124.011451(14500)&iwloc=A&hl=en\"> mufon case (14500) map </A>","Tags":"City","City":"Lincoln City","Longitude":"-124.011451","Viewing Distance":"Unknown","Date of the Event":"06/30/2006 12:00 UTC","Country":"United States","trends":["There have been 4 other sightings in Lincoln City","There were no other sightings in Lincoln City on or around June 30th 2006"],"Case Number":"14500","Weather Factors":"Unknown","Latitude":"44.959544","Log Number":"US-12232008-0004","Region":"Oregon","Summary":"2 small triangles flew extremely fast overhead.","Object Features":"Unknown","Object Shape":"Triangle","divs":["sighting detailsmy wife and i have 4 kids, a house and a dog. we are pretty average folks overall. so, imagine our suprise when we saw 2 ufo's moving incredibly fast one night. on vacation in lincoln city, oregon, we were walking on the beach up to the casino at about 10pm. we hadn't been drinking, weren't tired and were looking forward to a late evening of entertainment without the kids. we walked up the stairs from the beach and were looking at the stars. i was pointing out a satellite to her and explaining it when 2 triangles flew directly overhead. the triangles each consisted of 3 solid dots of white light that would be covered by a nickle or quarter at arms length. they were four inches apart at the same perspective. these 2 objects moved extremely fast and silently in a south to north direction, following the coast-line. i would say we tracked them across 1\\2 of the sky in about 2-3 seconds. beach fog covered the southern and northern horizons. when we saw them we both looked at each other in stunned amazement and my wife said, \"was that a...\", and i said, \"oh my god! i think that was a ufo\". then she got very scared. i reassured her that everything was ok and asked her exactly what she saw. she desribed the objects exactly as i had seen them. what amazes me about thes objects is the speed. they were so small and silent that they had to be at quite a distance, yet they moved accros the sky like a house fly in front of my face. we went inside stunned, excited and more than a little shook up. i am a star gazer of sorts, have seen hundreds of shooting stars and this was no shooting star or meteor breaking up. thanks."],"Date Submitted":"06/30/2006 12:00 UTC"}