{"Sighting Duration":"Undisclosed","Log Number":"US-12232008-0009","Region":"California","Source":"MUFON","City":"Del Mar","Longitude":"-117.261065","Case Number":"14505","Latitude":"32.966139","Date Submitted":"12/22/2008 06:00 UTC","Object Features":"Unknown","trends":["There have been 2 other sightings in Del Mar","There were no other sightings in Del Mar on or around December 22nd 2008"],"files":["/var/www/straped/mufon/html2text/14505.html.txt","/var/www/straped/mufon/org/14505.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/22/2008 06:00 UTC","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Weather Factors":"Windy, Rain","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=32.966139,+-117.261065(14505)&iwloc=A&hl=en\"> mufon case (14505) map </A>","divs":["sighting detailsi was driving west on the 56 freeway after picking up my son from penosquitos around 6pm when i saw what looked like a very bright shooting star to my right (just north of the freeway). it must have been a flare because it was just too bright to be a shooting star. i then saw 4 or 5 planes flying in the immediate area, which i thought was strange. i have never seen so many planes in one area before flying so close. i assumed that maybe it was a military exercise from the miramar base. then, to the south of the freeway i saw a very bright and large triangle shaped object in the night sky that was lit up with two round very bright lights at the bottom of the triangle. it seemed to be hovering and the lights would go out and then come back on. i was not sure if the clouds were obscuring the lights to make it look like they went off or not. my 4 year old son said he also saw it and confirmed that it was a triangle shape. we went home and told my wife. she wanted to see and so we then headed onto the 5 south freeway from del mar and headed south. we then saw the same object to the west seemingly over the ocean with its lights sometimes going off and then back on. it seemed to be moving south but i was not sure if it was just because it was very far out. my wife noticed many planes in the same general area and we even had one plane fly very low from south to north-west over us while we were on the freeway. it appeared to be military and not civilian based on the shape and the lights. it was so low we could see the underbelly of the fuselage at night and many details. we even noticed other cars pulled over to the side of the freeway with some people looking at this object and this activity in the sky. thousands of san diegans must have seen this last night around 6 pm to 7 pm. we then went to dinner. not sure what all this was; i assume military but it did not look like anything i ahve ever seen before and i have lived in san diego since 1997 and worked\\lived near miramar since 2004."],"Summary":"Lighted triangle with two round lights at bottom hovering over Del Mar and Pacific Ocean last night around 6pm.","Country":"United States","Tags":"City"}