{"Disposition":"Insufficient Data","Weather Factors":"None","Date Submitted":"07/20/1978 11:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"North Carolina","Longitude":"-80.88813","map":"<A HREF = \"http://maps.google.com/maps?q=35.700692,+-80.88813(14519)&iwloc=A&hl=en\"> mufon case (14519) map </A>","Source":"MUFON","Case Number":"14519","divs":["Sighting DetailsMy girlfriend and I were coming home from a date to Troutman N.C. around 11:30 pm. As we rounded a curve heading toward her home you can see out over a large area of sky. I noticed this ring of 7 lights, each light was equal distance from each other in a circle. It was odd enough that it caught my eye as no normal. I pointed it out to my date and she also saw the object. When we arrived at her house the object was still above us and we got out of the car and stood and looked at it. As we watched it did a very strange thing. The seven individual lights in a ring separated and went out in every direction. It is like if you think of a compass one light went south, one, southwest, one west, one northwest, one north and so on. They went in straight lines and one came straight over our heads. We watched, there was NO sound, No blinking, Nothing like an airplane. It just went straight at a constant speed. Each one went out from the ring at a constant speed in all different directions. I don't know what it was, never had seen anything like it before or since. My wife and I talk about this sighting often and we both still remember it in detail 30 years later. Have never told this story to anyone offical, just a few friends. My wife agrees with all the above statements."],"Tags":"City","Summary":"Circle of 7 individual white lights at approx. 3 to 5 thousand feet then lights separate and go in 7 different directions, no sound, no blinking","Log Number":"US-12242008-0009","Object Flight Path":"Hovering then path,Straight-line path","Date of the Event":"07/20/1978 11:30 UTC","Object Features":"None","Latitude":"35.700692","files":["/var/www/straped/mufon/html2text/14519.html.txt","/var/www/straped/mufon/org/14519.html"],"Object Shape":"Circle","City":"Troutman","Sighting Duration":"00:10:00","Country":"United States","trends":["There have been no other sightings in Troutman","This sighting has never been favorited."]}