{"Country":"United States","Source":"MUFON","Object Shape":"Fireball, Sphere, Star-like","Date Submitted":"12/24/2008 05:55 UTC","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"00:05:00","Summary":"Orange flickering ball of light observed changing brightness and shape in pre-dawn sky.","Latitude":"33.854144","divs":["Sighting Details At approximately 5:55am while having a conversation on the phone in my room with my window facing West, I looked up and out the window to see an orange light gently coasting along. At first it appeared to be a solitary star or planet. However, the sky was overcast and the object was clearly visable, closer to me than the ceiling of clouds which were at the moment producing a very light rain. The object was to the west of my residence at an est. alt. of 8-12 thousand feet, depending on its distance which was hard to judge do to the unknown size. The only factor which helped to aid in range estimation was the cloud cover. I would estimate the distance from myself to the object at appx. five thousand meters, it's position was about 50 degrees above the horizon relative my position. The object moved at a slow and waivering pace, sometimes cruising along with very noticable movement, and at other times coming to an appearant stop, then once again moving along. Durring the sighting no other objects were visable in the sky. The sighting lasted appx. 5 minutes. Durring that time, the object moved from south to north, covering an estimated distance of 1.5 miles before making a gentle bank and gaining in altitude while heading west by north west. Throughout the time I had the object under observation its appearance altered continuously, but remained recognisably similar. Its brightness and realative size increased and decreased in pulsing fashion, yet no pattern of frequency of the rate in which it did this was noticed. At one point it apeared to seperate into two joined spheres momentarily, before merging together again. Upon fusing back together it gained brightness and appeared to possibly drip a little bit, as if molten metal were collecting at its underside. Yet at no time did i observe any potion of the object seperate fully from itself. After heading north for appx 3 and a half minutes it slowly gained altitude and began to shroud itself in the cloud layer while banking left to head west. Its brightness dimmed I can only assume due to obscuration. i continued to track the object for a little over another minute as it was intermittantly lost in the clouds until it finally disappeared all together. The object made no sound that i could hear, and had it been a passenger aircraft, which i had observed many times at that appx. range and alt. i would have been able to hear engine noise. Had it been a civilian aircraft at all it would have had some variant of marking lights, all of which were absent. It was definately not the landing lights of an aircraft either. It appeared much as a flame would in its flickering glow. It was not a military jet becuase it moved to slow, also no noise. It was not a planet or star becuase it was below the cloud cover and moving. It was not a comet or meteor becuase its movements were eratic, changing direction, and gaining altitude. I cannot for any purposes identify it as something i am familiar with as a trained observer having spent over 7 years in the military and having the ability to identify numerous types of aircraft both civilian and military, as well as pyrotecnichs. Also I have a sound fundamental understanding of astronomy and weather phenomenon.This event happened on Dec. 24 2008 between 0555hrs and 0600hrs."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.854144,+-118.039161(14516)&iwloc=A&hl=en\"> mufon case (14516) map </A>","Object Features":"Other, Unknown","Date of the Event":"12/24/2008 05:55 UTC","files":["/var/www/straped/mufon/html2text/14516.html.txt","/var/www/straped/mufon/org/14516.html"],"Region":"California","City":"La Palma","Disposition":"Unknown","Longitude":"-118.039161","trends":["There have been 3 other sightings in La Palma","There were no other sightings in La Palma on or around December 24th 2008"],"Case Number":"14516","Object Flight Path":"Path with directional change","Log Number":"US-12242008-0006","Viewing Distance":"Over One Mile"}