{"Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/14518.html.txt","/var/www/straped/mufon/more/14518_submitter_file1__584-dec21-08.jpg","/var/www/straped/mufon/org/14518.html"],"Object Features":"Dome, Wings","Log Number":"US-12242008-0008","Date Submitted":"12/21/2008 03:43 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.130689,+-99.162122(14518)&iwloc=A&hl=en\"> mufon case (14518) map </A>","City":"Cross Plains","trends":["There have been 6 other sightings in Cross Plains","There were no other sightings in Cross Plains on or around December 21st 2008","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","Latitude":"32.130689","Longitude":"-99.162122","Tags":"City","divs":["Sighting DetailsI have already sent this report to Steve Hudgeons of MUFON in Texas. I am reporting it here, for your records. On Sunday, Dec. 21, 2008 at approximately 3:43 a.m., I took my dogs outside, in the back yard of our farm house, and as I am always looking at the sky, I saw an object SSW of my location. It was 60 degrees above the horizon, at an elevation of at least 5,000 ft. (my best guess). It was probably somewhere over, or just south of the small town of Cross Plains. The object was blinking white and red lights in rapid succession. There was also a hint of green color. At first I thought it was simply a brilliant star, or Venus but that observation changed. I carry my digital camera with me, just in case. I snapped several photos but only one came out. I apparently snapped the photos when the object would momentarily go dark. However, as you can see by the one image I managed to capture, that the object is clearly discernible. To the naked eye, the object was elongated, like a disk or triangle. The craft(?) stayed in the same spot in the sky for the 20 minutes I viewed it, then it vanished into the fast moving clouds, though it momentarily lit up a cloud as it was enveloped. The object made no noise. As for how I felt, well, as long as they are \"up there\" and not chasing me into the house like one did last month, I felt fine, still do. I also have another sighting and photograph from last night, Dec. 23, which I will send in another report."],"Summary":"Star-like at first, blinking white and red lights in rapid succession, then saw elongation.","Country":"United States","Region":"Texas","Disposition":"Unknown","Object Shape":"Disc, Star-like, Triangle","Case Number":"14518","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"12/21/2008 03:43 UTC"}