{"Longitude":"43.137131","City":"Mosul","Disposition":"Unresolved","Summary":"White \"perfect\" triangle above my head in picture.","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Country":"Iraq","Date Submitted":"11/30/2006 12:00 UTC","trends":["There has been one other sighting in Mosul","There were no other sightings in Mosul on or around November 30th 2006"],"divs":["Sighting DetailsI am a former \"Force Reconnaissance\" Marine and currently a security contractor in Iraq. A little over a year ago, I had some pictures taken of me on an Abrams tank. I brought all of the pictures that I had taken on that tour back home to show my wife. As I was going through the pictures at home, I noticed that there was an object above my head in the Tank picture. It was white and was a perfect triangle. I have no idea how high it was, due to the fact that I have no idea how large the object was, so I could not estimate distance and size. The only think that I can say in reference to size and distance, is that the object was about half the size of my head, up in the sky. Also, there were three pictures taken while I was on the tank and in every picture, the object was in the same position in each picture. Anyways, I analyzed the picture and it was no glitch in the camera at all. The camera was a \"new\" Pentax Optio V20 8.0 Megapixel. Now, I know every single aircraft in this AO up here in northern Iraq, and absolutely Nothing is even remotely close to the shape of the object on the picture. There are, of course some weird looking UAV's up here and none of them look like that object in any way. This was a perfect, white triangle. There were no fuzzy apparitions in the picture, etc.... Also, take in mind, my background that I stated in the first sentence. One of my specialties is Reconnaissance and Surveillance. I have made a living off of observation. Now, of course this really pisses me off, but I spoke with my wife about the picture the next day and she made fun of me about the picture, so I brought her up to the computer to show her. I am NOT lying, but ALL of my pictures that I had during my last time in Iraq were missing off of my computer!!! I am not crazy or lying in any way. I am at a loss of words on how that could of happened. I have no idea. I am pretty sure no one \"snuck\" into my house and deleted them, but who knows. I am not going to delete them though. On top of that, I am a skeptic about the whole UFO situation and personally think that almost everyone that claims to have seen a UFO is some \"Hick\" or a person that has had an uneventful life and needs something interesting to keep themselves going through life. I have had a very eventful life and \"been there, done that\". I don't need something interesting to keep me going. I know what I saw and it was NOTHING that the US or any other country in this world has for aircraft...at least as far as I know, but if we had an aircraft that looked like that out here, I Would Know about it. Now, one of my friends who was also there taking pics is currently recovering from battlefield injuries in the states. When he recovers and comes back, I will try to see if he has the pic on his computer that I can get, to send you. I am pretty sure he also took a pic with his camera when I was on the Abrams tank. If he does have it, then I will have proof that I was not seeing things or am crazy."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.335571,+43.137131(14522)&iwloc=A&hl=en\"> mufon case (14522) map </A>","Date of the Event":"11/30/2006 12:00 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/14522.html.txt","/var/www/straped/mufon/org/14522.html"],"Weather Factors":"Unknown","Log Number":"IQ-12252008-0001","Region":"Ninawa","Source":"MUFON","Case Number":"14522","Viewing Distance":"Unknown","Latitude":"36.335571"}