{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.56229,+-97.546388(14525)&iwloc=A&hl=en\"> mufon case (14525) map </A>","Longitude":"-97.546388","Country":"United States","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14525.html.txt","/var/www/straped/mufon/org/14525.html"],"Date of the Event":"08/31/1976 12:00 UTC","Case Number":"14525","Date Submitted":"08/31/1976 12:00 UTC","Log Number":"US-12252008-0004","trends":["there have been no other sightings in round rock\\hutto","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Summary":"Army activity on a commercial farm north of Round Rock.","Latitude":"30.56229","Object Shape":"Unknown","Disposition":"Hoax","City":"Round Rock/Hutto","Weather Factors":"Unknown","divs":["Sighting DetailsAbout 10 p.m. someone came to our door to ask if we owned property near by. We owned 20 acres. They asked us to search it for a down flying object. We searched and found nothing on our place. Later as we and dozens of other locals prowled the country roads, talking on C.B. radios the word came to us that the local airports as well as Bergstrom AFB denied any down aircraft. Early in the morning a friend who worked at the Round Rock paper tried to gain access to the property, which was a commercial egg prouducing business. He was met by the military who threatened him with weapons and told him to go away. He later told me he saw army trucks leaving the property with tarps over loads. His name is C. L. [CMS - see witness notes for name] I have not spoken to him in decades about this. I believe his is still alive however. I realize this is an old event, and lacking in real evidence. However, I've always wanted to know more about the incident. I'v seen one other unexplained event. Just a light that crossed the sky, horizontal to the horizon, then made a 90 degree turn and sent straight up. It happened east of Round Rock, about 1985 ? My son and I both saw it,, from different locations. Thank you for your site. [CMS-Witness name removed]"],"Tags":"City","Source":"MUFON"}