{"files":["/var/www/straped/mufon/html2text/14520.html.txt","/var/www/straped/mufon/more/14520_submitter_file1__584-dec21-08.jpg","/var/www/straped/mufon/more/14520_submitter_file2__597-3lights.jpg","/var/www/straped/mufon/org/14520.html"],"Summary":"3 lights below dark clouds, then moved east and I took picture before it disappeared.","Object Features":"Unknown","City":"Cross Plains","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Flight Path":"Stationary,Path then hovering","Case Number":"14520","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.127749,+-99.155462(14520)&iwloc=A&hl=en\"> mufon case (14520) map </A>","Disposition":"Unknown","divs":["Sighting DetailsThis is my second report. Tuesday, Dec. 23, 2008, 9:55 p.m.- Observed object earlier in the evening, as I came home from the grocery store in Cisco. As I drove home headed SW on Hwy 206, a bright object was located in the SW, approx. 60 degrees above horizon, near where Venus would be. However, there was a dark bank of high clouds above and behind the object, so Venus was not visible until well after I got home at 6:50 p.m.. I was soon briefly able to see both Venus and the object, then lower clouds moved in and both Venus and the object disappeared. I called my husband who is 45 miles north of me and he could see it too, though he could not make out what it looked like. To me, I could see 3 lights blinking together, on and off. Total viewing time of first sighting: 25 minutes. Later that evening at 9:55 p.m., I took my dogs outside and the object was again observed at approx. 80 degrees above horizon, due south. In 3 hours it had moved to the east. I could make out 3 distinct white lights together in a horizontal position. The object had 3 lights that seemed to flash together, with a brighter or lesser degree of intensity. The object was static and I observed it long enough to snap one picture, then the object blinked out to total darkness and was gone, yet I could still see the stars that were behind the object at the time. A few minutes later, clouds moved across that area of sky and I gave up searching. Total time of observation for the second sighting was about 3 minutes. I am located approximately 50 miles east of Dyess AFB, and approx. 95 miles west of Air Force Plant 4 (formerly Carswell AFB). I noticed that the photo from my first report did not upload, so I will try again. The 1st photo shows the object I witnessed on Dec. 21, 2008 and the 2nd photo is for Dec. 23, 2008"],"Latitude":"32.127749","Date of the Event":"12/23/2008 09:55 UTC","Object Shape":"Star-like, Triangle","Region":"Texas","Date Submitted":"12/23/2008 09:55 UTC","Longitude":"-99.155462","Source":"MUFON","trends":["There have been 6 other sightings in Cross Plains","There was one other sighting in Cross Plains on or around December 23rd 2008","This sighting has never been favorited.",""],"Log Number":"US-12242008-0010","Country":"United States","Tags":"City"}