{"Case Number":"14538","Tags":"City","trends":["There have been 4 other sightings in Mesquite","There were no other sightings in Mesquite on or around June 29th 1973"],"Summary":"Saw UFO with light shining on ground, watched for several hours.","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=36.807271,+-114.06591(14538)&iwloc=A&hl=en\"> mufon case (14538) map </A>","City":"Mesquite","Log Number":"US-12262008-0009","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","divs":["Sighting DetailsStopped on side of highway to cool truck after climbing steep pass on I-15 which was a two lane road in 1973. Saw bright light on ground across road. Thought it would be an RV. Walked across highway to see if I could get water for truck. Realized light was from the sky. Looked up, saw triangle shaped craft with light coming from it. Ran back to truck, very frightened. Started driving towards next town. Had telepathic communication that told me not to be afraid. Fear immediately left, sense of calm and excitement, both physical and emotional occurred. Drove into small town of Mesquite, on Utah-Nevada border. Pulled young kids who were working at the all night gas station out into parking lot and showed them the light. They said they saw them all the time, they were not interested in it, they'd been seeing these for years. Too common, no big deal. Went to all night cafe, stopped people in parking lot and they watched it as well. Light would move from left to right across the sky then back again in seconds. Then it would come down towards us and take on a triangular shape as it got closer. Then it would shoot up until it was just a bright light. Really felt like it was communicating with us, showing off, making sure we saw it. Then we watched it go directly up and out of view. Years later I realize the time did not match the events. Saw light about 1130 pm, it left about 0230 am, only have events for about an hour and a half. Have had one other experience while camping alone in Washington state."],"files":["/var/www/straped/mufon/html2text/14538.html.txt","/var/www/straped/mufon/org/14538.html"],"Source":"MUFON","Object Shape":"Circle, Diamond, Triangle","Longitude":"-114.06591","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Date Submitted":"06/29/1973 12:00 UTC","Latitude":"36.807271","Date of the Event":"06/29/1973 12:00 UTC","Viewing Distance":"Unknown","Object Features":"Unknown","Country":"United States","Weather Factors":"Unknown"}