{"Object Shape":"Unknown","Region":"Missouri","Date of the Event":"12/24/2008 12:00 UTC","Disposition":"IFO","Tags":"City","Date Submitted":"12/24/2008 12:00 UTC","Longitude":"-92.329372","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.959835,+-92.329372(14534)&iwloc=A&hl=en\"> mufon case (14534) map </A>","divs":["Sighting Detailsi was at my friends house outside smoking a cigarette. i looked up and noticed this really really bright light.i honestly didnt think it could be anything i knew about, it was not moving, it stayed in the same spot for a couple of hours. if i was looking at the light i could see airplanes in my field of vision, so i know it wasnt a plane. it wasnt that high up in the sky either. i have seen this light for about the last 2 months in different parts of the sky above my town columbia missouri. there are about 80,000 people in this town so its fairly large. i have seen this light about 8-10 times, and am actually used to it. usually there is the really really bright yellowish orange light and a smaller yellow light at either 10 o clock or 6 o clock about 6 inches above it, or below it. on the 24th of dec 2008 i observed only the large yellowish orange light. the first time i saw it i kept waiting for it to fly over, as it seemed it would have to. but it always stays stationary. after seeing it the first time, i looked online to see if anyone had reported anything over columbia missouri. there were 3 reports describing what i saw, however one of the witnesses said he saw the light zoom off. i havent had the chance to see that yet, it is winter and freezing so i can usually stay outside for a half hour max. when i see these lights in the sky i get excited and, this is silly but i try to project positive thoughts to it them, friendly vibes. but i always end up angry at the fact that we are sooooooo in the dark about life from other planets, i also wonder what they are doing, or if it is alien technology reverse engineered by the usaf. but overall i am excited and hope there is a great change taking place in my lifetime."],"City":"Columbia","Object Flight Path":"Stationary","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around December 24th 2008"],"Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"38.959835","Log Number":"US-12262008-0005","files":["/var/www/straped/mufon/html2text/14534.html.txt","/var/www/straped/mufon/org/14534.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"It was a very very bright yellowish orange light.","Case Number":"14534"}