{"Weather Factors":"Unknown","Date Submitted":"06/30/1977 12:00 UTC","Object Shape":"Disc","Longitude":"-81.011667","City":"Edgemoor","trends":["There have been no other sightings in Edgemoor","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/14533.html.txt","/var/www/straped/mufon/org/14533.html"],"Tags":"City","Log Number":"US-12262008-0004","Source":"MUFON","Country":"United States","Date of the Event":"06/30/1977 12:00 UTC","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.805556,+-81.011667(14533)&iwloc=A&hl=en\"> mufon case (14533) map </A>","Region":"South Carolina","divs":["Sighting Details it was in the summer of july, we didn't have air condition we used a window fan at nite to circulate air thru the house,the fan sometimes would get off balance and would vibrate very loud and i would get up and shake it one way or another to make it stop, and that nite in july 1977 it started viberating very loud so i got up to stop it from making the noise i looked up and there was a disc shaped object sitting dead still in the air above my father inlaws house just above the trees, i watched for about 30 minutes or so and then about that time my fatherinlaw drove up he had been at the vfw playing pocker, he got out of his car and he saw this disc first thing he did was grab his heart, the thing sceared him to death so he started for the back door of his house and keep looking up at this disc, well i watched for awhile longer and finaly layed back down, but could not sleep so i got back up and the disc was gone,the next day when i got home from work i went up to my father inlaws house and said paul what was that out there last nite, he was shocked to know that i also seen it, he said he thought he was loosing his mind, but i said no i seen it my self and watched it for a long time.it was kinda yellowish looking color and about 50x50 round.and kinda glowed."],"Latitude":"34.805556","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Case Number":"14533","Object Features":"Dome","Summary":"Saucer shaped object hovered above tree tops.","Object Flight Path":"Stationary,Hovering then path"}