{"Viewing Distance":"Unknown","Disposition":"Hoax","Tags":"City","Date Submitted":"12/05/2008 09:15 UTC","trends":["There have been 9 other sightings in Grand Haven","There were no other sightings in Grand Haven on or around December 5th 2008","This sighting has never been favorited.",""],"Summary":"Strange lights near Lake MI. Grand Haven 8pm to 12pm.","Region":"Michigan","Log Number":"US-12262008-0015","divs":["sighting detailsin response to the other grand haven report,i also witnessed the same thing i believe.i witnessed some very strange lights \"orange redish colored\" lights and a object with white, blue, and green continus lights not flashing in the south\\southwest sky over lake michgan.the orange colored lights moved real fast in \"v\"-\"w\" movements. and also like the other grand haven report the objects did dives.like the other man said, like \"bomber dives\" very fast and abrupt dives and allmost pattern like movements. the lights also would vanish and then re-apper a few moments later. it became pretty clear it was like nothing i had ever seen in the sky above the lake in grand haven.kind of strange that there have been these reports in the same area in ottawa county near lake michigan. and they all sound very simular in nature. this just reasures me that i am not the only one to witness these lights in the sky. the \"dive bomb\" statement is very accurate, as well as the strange pattern like movements. nice to see im not the only one to witness. thanks to everyone for posting your sightsings, please post more if you see anything. thanks, theanonymusguy"],"Case Number":"14544","Longitude":"-86.226366","Country":"United States","Object Features":"Undisclosed","City":"Grand Haven","Object Flight Path":"Undisclosed","Object Shape":"Circle, Fireball, Triangle","Date of the Event":"12/05/2008 09:15 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.068173,+-86.226366(14544)&iwloc=A&hl=en\"> mufon case (14544) map </A>","Latitude":"43.068173","Sighting Duration":"01:00:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14544.html.txt","/var/www/straped/mufon/org/14544.html"]}