{"Log Number":"US-12262008-0016","Date of the Event":"11/30/1969 07:00 UTC","Region":"Arizona","Country":"United States","Tags":"City","Object Features":"None","divs":["sighting details seemed close; couple hundred feet elevation. absolutely silent and no other light pattern or color other than the circulating white light pattern. no fuselage visible at all. i was young, maybe 12 or 13. i have seen blimps, balloons and all variety of planes and jets as arizona was a climate for all types of flight machines. also i had attended air shows. it was a time for modern air-ship development of which i was a young fan. when you are 12 and say \"i just saw a ufo\". adults say, \"yes dear, that's nice\". the best example i can think of was the spacecraft in the hit tv show in the 60's 'lost in space'. i will never forget the circulating lights. even then, i was aware of navigation lights on aircraft of which this was entirely unorthodox. there was little stealth as if to state \" here we are just cruising directly over the fastest growing city in america and we don't care if you notice or what you think\". the place i was standing was at an irrigation canal at earl rd. & just east of 181st st. in scottsdale. i don't think a sketch would help much, my description is the best i can do almost forty years later. i can see it in my minds eye right now. just think close and very large. hold your arms up and make a circle with your thumbs and index fingers touching, now spread out the circle separating your two halves of the circle (elbows bent at 90 degrees) until you are holding a basketball hoop. huge. very bright. slow. silent. close. this is one of three i have never reported. i wish i had more info, but at 12 yrs old i was not yet a great witness. i have just now purchased the only camera i have ever owned. i have seen all the lousy jittery, unclear, hand-held, laymen photos of some dancing light that could be anything. i am now prepared to take high resolution, firm base mounted digital photographs at a moments notice. i keep the battery in my camera charged and i study the settings and i practice grabbing the camera to take calm\\still photos at the right settings with other object in the view finder for reference. this is something i never hear anything about; being prepared to take the good quality motion or still photographic evidence. a free standing, hand held camera to a light in the sky results in a blurry, dancing light with absolutely no context and is virtually useless and may even discredit tan otherwise credible sighting. spread the word-i am. no, we are not alone! no aggressive action has ever taken place even though we are obviously inept towards any uninvited intervention or communion. my first words ever on the subject of extra terrestrial encounters. or as some believe may be the case; intra-terrestrial (aka uso's). are we just about to learn that we have neighbors right here on mother earth regardless of who got here first? i hope so, for they have not hurt us, but whom are we hurting?"],"Date Submitted":"11/30/1969 07:00 UTC","Summary":"Scottsdale, AZ. Slow, silent E - W passing directly overhead. Large phi-phenomenon clockwise white lights.","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=33.49785,+-111.922382(14545)&iwloc=A&hl=en\"> mufon case (14545) map </A>","files":["/var/www/straped/mufon/html2text/14545.html.txt","/var/www/straped/mufon/org/14545.html"],"Weather Factors":"Does Not Apply","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Case Number":"14545","Source":"MUFON","Latitude":"33.49785","City":"Scottsdale","Longitude":"-111.922382","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around November 30th 1969"],"Disposition":"Unknown","Object Shape":"Circle"}