{"Disposition":"Unresolved","Date of the Event":"12/26/2008 07:45 UTC","Log Number":"GB-12262008-0013","map":"<A HREF = \"http://maps.google.com/maps?q=53.266064,+-1.351435(14542)&iwloc=A&hl=en\"> mufon case (14542) map </A>","Case Number":"14542","Longitude":"-1.351435","Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsWe were visiting relatives on Boxing Day. A member of my family was stood at the back door when she observed 5 bright lights travelling across the night sky. We quickly went to look ourselves and also witnessed the lights. The lights were steady and did not flash. They were yellowish and appeared to be moving in a rough formation travelling quite slowly. As the lights reached the sky above the house they seemed to dim then disappear. Further lights then followed taking a similar trajectory although no longer in any formation. The last of the lights also appeared to change colour to dark less visable red and then back to yellow again. I was shocked by what i saw as i am quite familiar with civilian and military aircraft as i work on a variety of MoD sites and airports and I am used to seeing aircraft lights at night. These lights were like nothing i have ever seen before and did not have the characteristics of aircraft lights. The lights seemed to be large in comparison with normal aircraft lights. There was no sound audiable as they passed."],"Summary":"Lights in formation observed passing over neighbourhood.","Region":"England","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/14542.html.txt","/var/www/straped/mufon/more/14542_submitter_file2__081226_193106.jpg","/var/www/straped/mufon/more/14542_submitter_file3__081226_192610.jpg","/var/www/straped/mufon/org/14542.html"],"Weather Factors":"None","Object Features":"Unknown","City":"Staveley","Sighting Duration":"00:05:00","Latitude":"53.266064","trends":["There have been no other sightings in Staveley","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"12/26/2008 07:45 UTC","Object Flight Path":"Straight-line path","Country":"United Kingdom"}