{"map":"<A HREF = \"http://maps.google.com/maps?q=40.722823,+-74.004513(14548)&iwloc=A&hl=en\"> mufon case (14548) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsThis starlike anomoly has been appearing regularly according to my mother for atleast a month or more. Her condominium is on the top floor of her building which provides a clear view over the horizon. Most people would not look out their windows and see an unobstructed view like this due to surrounding buildings. Due to the heavy chemtrail spraying there is a kind of fog or mist when you look at the sky through a skewed view and this made it somewhat difficult to view the object with binoculars and possibly see some shape outside of the luminous center. Simply put it appeared as a superbright star emitting light rather than the moon or other planet which reflects light and the intensity gave the impression that it wasn't as distant as an actual star in the night sky. It remained absolutely motionless without flickering and didn't emit any other colored lights. It's position on the horizon was Southwest from our position which was in the Howard Beach area and its vertical position was close to that of the moon. We gazed at it for about 5 minutes in intervals for about an hour. Later we returned to the balcony and the starlike object was gone. I'm wondering if anyone else has reported this since it was very distinct in the night sky when compared to visible stars. I can't see it clearly from my home since the roof is not high enough but my mother will be keeping an eye out for it's re-appearance this week. If I can get a good time lapse photograph of the object I'll be sure to foward it to you. Reese A. Edginton"],"Longitude":"-74.004513","Log Number":"US-12262008-0019","Sighting Duration":"Undisclosed","Latitude":"40.722823","Source":"MUFON","Date of the Event":"12/25/2008 12:00 UTC","Case Number":"14548","Viewing Distance":"Unknown","City":"New York","Disposition":"IFO","Date Submitted":"12/25/2008 12:00 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around December 25th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/14548.html.txt","/var/www/straped/mufon/org/14548.html"],"Summary":"Very bright and larger than the North Star, stationary.","Object Flight Path":"Undisclosed","Tags":"City","Region":"New York","Object Features":"Undisclosed","Object Shape":"Star-like"}