{"Region":"Minnesota","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Source":"MUFON","Summary":"Very illuminated light green oval shaped.","Case Number":"14549","Date Submitted":"07/19/2008 03:15 UTC","files":["/var/www/straped/mufon/html2text/14549.html.txt","/var/www/straped/mufon/org/14549.html"],"Latitude":"46.794612","Sighting Duration":"00:01:30","trends":["There have been 16 other sightings in Duluth","There were no other sightings in Duluth on or around July 19th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.794612,+-92.093845(14549)&iwloc=A&hl=en\"> mufon case (14549) map </A>","Date of the Event":"07/19/2008 03:15 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsObserved with Steiner Predator 8x30 binoculars from balchony of hotel room at Bluefin Bay Resort in Tofte MN. Awoke my fiancee to see. Object traveled level to the horizen over Lake Superior at a steady rate of speed heading north from the south. Conditions were very clear with no clouds, temp was 58 degrees, no wind at that time. Object was approximately 3000 ft altitude and approximately 3-4 miles away from shoreline. I was puzzled and curious by this foreign craft and was thankful to have my binoculars handy. Looking through my binoculars I became astonished that the entire body of this thing was glowing a light green! with no other lights or protusions. Just a oval shaped glowing craft! I struggled to pull the binoculars from my face to awake my fiancee who was half asleep and very groggy. She seemed puzzled by the craft, then stubbled back into bed. (I am a trained observer so my estimate may not be correct) I grew up next to the Minnesota National Guard and St. Paul Airport and have had an interest in aviation my entire life. This was not any conventional or Military aircraft as far as I am aware. I have researched material on weather ballons and other natural and uncommon atmoshperic conditions. This was not a weather ballon, reflections, atmospheric anomalies, etc. As far as I am concerned this was a U.F.O. My fiancee says that she seen a bright green moving light and that it didn't look like a airplane, jet, or satellite."],"Longitude":"-92.093845","City":"Duluth","Object Shape":"Oval","Log Number":"US-12262008-0020","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Tags":"City"}