{"City":"Ely","Date Submitted":"12/24/2008 04:16 UTC","Disposition":"Unresolved","divs":["Sighting DetailsMy name's Donald J Browne. I've taken photos of UFOs near Ely Cathedral, Cambridge, England. I was there for the Xmas Eve Carol Service. The photos were part of a steetlamp experiment that was inspired by Miceal Ledwith and Klaus Heinneman's book The Orb Project. I was fascinated by Miceal's theory on Orbs as fluorescing beings and had similar observations myself. I wanted to take the experiment into a different direction - that of shooting straight into fluorescing streetlamps. I have been astounded by some of the results. But the biggest discovery was before I shot the photos. I was aiming the camera at the streetlamp when I saw the UFO materialise. I didn't even have my finger on the button to activate the infra-red or flash. Like looking at the UFO in a live movie, I noticed something interesting. If I tilted the camera left or right, up or down very slightly, perhaps no more than 5 to 10 degrees, the Orbs came into view or vanished, or demonstrated a partial materialisation as can be seen in the selection of photos. The UFOs were perfectly still! If I moved the camera slightly left or right, I got the phenomena I've documented above. When I moved the camera back to its original angle, they were there again in clear view. I know it sounds unbelievable, but the photos I shot are the proof."],"trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around December 24th 2008","This sighting has never been favorited.",""],"Date of the Event":"12/24/2008 04:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.257289,+-114.8795(14553)&iwloc=A&hl=en\"> mufon case (14553) map </A>","Object Shape":"Sphere, Teardrop","Weather Factors":"Unknown","Case Number":"14553","Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","Longitude":"-114.8795","Country":"United States","Log Number":"GB-12272008-0001","Latitude":"39.257289","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14553.html.txt","/var/www/straped/mufon/org/14553.html"],"Sighting Duration":"Undisclosed","Region":"Nevada","Summary":"Multiple UFO photos taken on Xmas Eve near Ely Cathedral, Cambridge, England."}