{"files":["/var/www/straped/mufon/html2text/14559.html.txt","/var/www/straped/mufon/org/14559.html"],"Object Shape":"Star-like, Other","Latitude":"29.23505","Case Number":"14559","Object Features":"None","Longitude":"-98.650838","Summary":"Unusual lights that converted to red lights in Somerset, Texas.","Region":"Texas","trends":["There have been 2 other sightings in Somerset","There were no other sightings in Somerset on or around December 25th 2008","This sighting has never been favorited.",""],"City":"Somerset","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Weather Factors":"None","Date of the Event":"12/25/2008 07:30 UTC","Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"12/25/2008 07:30 UTC","Log Number":"US-12272008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=29.23505,+-98.650838(14559)&iwloc=A&hl=en\"> mufon case (14559) map </A>","Source":"MUFON","Disposition":"Unknown","divs":["Sighting DetailsIt was aprox. 7:30pm on Dec 25, 2008 on a very clear night. I had been talking with my brother outside for awhile when I turn to look up at him that is when I noticed an unusual bright white light. I stated to him \"Oh look here comes a satilite.\" He then turned to look and stated \"Oh yes, I see it.\" As we both were continue to look at it, he then said with concern \"That's no satilite.\" You can tell it was some great distance away but could not help notice that it was coming closer. It wasnt coming closer as if to fly over but to pass by. As it was getting closer you can tell it was getting brighter but the light was changing too, the white light got so intense that it got bigger but now the light was a goldish bright color that it was an intensly twinkling and sparkling, it was like it was building up when suddenly the lights flared up then went out. I then said \"It disappeared!\" My brother then said \"Yelp, its gone.\" No sooner that he said that when the lights came back but they were red. We knew this was no satillite, plane, helicopter or star. The light was too bright, sparkley, intense. No beams shining down or anything like that. NO SOUND, you heard nothing. If it was a plane or helicopter you would be able to hear it even at a great distance. Not knowing what it was we both stood still just watching it, not wanting to take our eyes off it just to see which direction it will go. It was moving at a slow pace. When the lights came back on we notice that there were three (3) red lights and each light was shaped as a circle close together but not touching but in a shaped of a V pointing towards the direction it was going. Still moving the same pace. But these red lights were bigger but not brigher then the white goldish lights before. Trees that were in the line of site had gotten in the way. I move side ways to get a better view when now there were six (6) red lights. A little smaller only because they were moving away from us. I could not tell if the same V shape was there other then the lights now look together. I can not tell you directions if it was north south east or west. My brother could give those types of directions but if I have to guess I'll say they were coming from the southeast to the northwest. How high or how far, I do not know. We stayed outside watching this till we could not see them anymore. The whole event lasted about 10 mins or less. During this event I was shocked and surprised to the point that I would catch myself not breathing. I was very excited to have witnessed this. I will be going back to his property in hopes to see it again and maybe get a picture or two. I welcome MUFON to contact me if more info is needed."]}