{"Sighting Duration":"Undisclosed","Case Number":"14557","Date of the Event":"09/02/2008 01:30 UTC","Object Shape":"Other","Latitude":"42.101236","Source":"MUFON","Date Submitted":"09/02/2008 01:30 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14557.html.txt","/var/www/straped/mufon/org/14557.html"],"Country":"United States","Summary":"A spotlight coming from an invisible source that was located in a place impossible for a spotlight to be.","Log Number":"US-12272008-0005","Longitude":"-86.474917","Tags":"City","City":"St Joseph","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Region":"Michigan","divs":["Sighting DetailsI went to visit my aunt and uncle in Oatis, Indiana from August 27th to September 2nd. My main reason for the trip was to visit my grandmother in her Long Term Care facility. I live in Tennessee and do not get up there very often as of late. I caught a Cub's game and visited with my Family for 4 days. My aunt and uncle own a lake house on lake Michigan about 20 miles South of St. Josephs on the beach. It is a beautiful place and extremely relaxing at night. The beach house is never the main reason I visit, but a nice bonus when my Family offers it up for a few days of oasis. This visit my aunt allowed my girlfriend and I to stay there for two days, Sept. 1st and Sept Second. We arrived early on Sept 1st and unpacked, went down to the beach and enjoyed the sun, later took in some shopping and had dinner. We noticed everyone packed up early afternoon and left there vacation homes due to the holiday weekend ending. We had planned to be back to Tennessee on Tuesday night so we had the beach to ourselves that Monday Night. The beach is basically a sand dune with a hundred feet of sand to the water. The water this night was calmer than usual and the night sky was clear and bright, yet without a moon. That afternoon I dug a pit for a fire and set it up knowing it would be hard to do that night with the wind, wasted time seeing that that night was extremely calm with tiny waves. People whom know this area, know that it can be very violent at night with huge waves and a brisk wind. We lucked out this night. We had smores, a bottle of wine, fully prepared to spend an evening on the beach. We finished the wine and the smores and snuggled up by the fire. There was not a light to be seen for miles North and South along the beach. The only hint of light was St joseph's dull glow in the distance, 20 miles or so up the beach. The later it was, the colder it was, and the more we fully covered up. I am telling you this because I think what happens next is a result of two things: Being fully covered up in the sand and directly behind a fire facing Lake Michigan. We fell asleep and had to have been asleep for an hour or so. Still fully covered by a blanket, I woke up and shook my girlfriend waking her up, so we could make the trip up the dune and to bed. As I uncovered my head, Lying on my back, I rolled on my stomach and looked straight north up the beach. Not more than 50 yards from me was a bright light, and I mean bright, a spotlight, like one you see shining at a carnival. I know what you are thinking, wow, that is not unusual, well let me finish. This light was stationary, pivoting from a stationary point directly over the shoreline, shining in the empty vacation homes and up and down the beach. Within seconds, My girlfriend rolled over and we both stayed covered and gazing North at this light. This light was coming out of NOTHING, roughly 30 feet to 50 feet in the air, I could see the abrubt beginning and end of the light source. It reminded me of a flud light above a garage, only brighter and with no building. The light never moved location, only direction it was pointed in, from the edge of the water towards land. The stability of the source frightened me because that ruled out any of the five hundred things my mind was feverishly trying to catagorize this as. Not a boat because I would be able to see the boat and the water was 2 feet deep under the location of the light. I do not remember what I said to my girlfriend, I just know she was just as shocked to be witnessing this as I was. It was calm and clear that night, no noise, only the gentle swish of the water rolling onto the shore. This light was close enough to us for me to throw a football and hit it square, extremely close. As the light pivoted up the beach away from us, still from the same 50 yard location, we could see more clearly the fact that it was coming out of nothing, clear sky!!!! The light was very defined as for its boundries, I mean as it went up the dune, a very defined circle of light was cast on the beach and the dunes. At this point I ran out of explanations, some things do not need analyzing for you to know something is wrong. Still facing the light and peaking out of the blanket, we found ourselves looking directly into the light, as it moved south along the beach towards us. The light disappeared as soon as it hit the spot we were laying. It was not blinding, which shocked me. We jumped up and could see nothing. Although no moonlight was present, the stars were plenty of light for us to have seen anything in the location of the light. We saw nothing, Gone, thin air. My girlfriend said, and I quote, \"it went into cloakmode.\" Usually I would laugh at something like that but it strangely seemed appropriate. I am a big guy, I mean I work out regularly and am scared of no one, yet something in me kept telling me to put the fire out and get upstairs, so I did. This has been driving me crazy. I am glad to get it off my chest!"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.101236,+-86.474917(14557)&iwloc=A&hl=en\"> mufon case (14557) map </A>","trends":["There have been 4 other sightings in St Joseph","There were no other sightings in St Joseph on or around September 2nd 2008"],"Object Features":"Undisclosed"}