{"Source":"MUFON","Country":"United States","Summary":"Fast, silent, circle shaped with dim red lights zooming across night sky.","Disposition":"Unknown","Tags":"City","Log Number":"US-12262008-0022","Date Submitted":"06/21/2008 12:15 UTC","Object Features":"Undisclosed","Case Number":"14551","Latitude":"33.642732","City":"Costa Mesa","Longitude":"-117.916609","divs":["sighting detailson the night of january 20th, 2008 near the coast in south orange county, ca- i returned home after seeing a movie at the local theatre. i went up on top of the building in which i formerly worked, lied out on a sleeping bag and gazed into the sky for a short while. i was positioned such that my feet pointed towards the ocean when i noticed a moving object in the sky from the corner of my eye. i would say that when i first noticed the object in the sky it was approximately 60 degrees above the horizon from the north, and traveling almost at i locked my eyes onto it, and would describe it as being a dark gray circle\\disc shape with several dim red lights triangular in shape (isosceles, 80,80,20 degrees) pointing inward. it could have been octogonally shaped, but i only consider this as a possibility because of the arrangement of the lights. it took only 2 to 3 seconds before the object had flown completely out of sight in the sky. i remember watching it move at a constant velocity, from where i first noticed it all the way across what was nearly the zenith of my view of the sky, down to the horizon to my left at the south. the object made no sound whatsoever. i had a hard time determining the object's size, because i had no reference for its altitude. i would estimate it to have been 50% the size of the moon at its highest point in the sky on any ordinary night. i think one of the most peculiar things about this event was that the size of the object did not seem to change much as it moved out of my perspective, so i believe that this object must have been flying at a good measure above the earth's atmosphere. i cannot imagine this to have been an event observed of any military craft. i am positive this was not a satellite- i have seen satellites before, and they are small and star-like in appearance. this was much different, and much more awe-inspiring."],"Date of the Event":"06/21/2008 12:15 UTC","Object Shape":"Circle, Disc, Other","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around June 21st 2008","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Sighting Duration":"00:00:04","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.642732,+-117.916609(14551)&iwloc=A&hl=en\"> mufon case (14551) map </A>","Region":"California","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14551.html.txt","/var/www/straped/mufon/more/14551_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/14551.html"]}