{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Longitude":"-108.545849","Country":"United States","Case Number":"14561","Region":"Colorado","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=39.07257,+-108.545849(14561)&iwloc=A&hl=en\"> mufon case (14561) map </A>","trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around October 10th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was in the parking lot of Mesa Mall in Grand Junction, Colorado on approx. Oct. 10, 2008 at approx. 3:00 p.m. I was taking pictures of the beautiful fall foliage and snapped the attached photo. The picture is facing south. The hills in the background are the Colorado National Monument, the building hidden in the backdrop is McDonalds restaurant. I didn't notice the object in the sky (in the photo) until I set the picture as my desktop wallpaper for my computer (You may need to see an enlarged version of the picture to see the object in the sky.)Again, I didn't see the object in the sky when I snapped the photo, and I didn't hear any noise in the skies at the time the picture was taken. This is the only picture I have of this object. I don't believe in UFO's and I'm sure I'm wasting my time sending this to you as I'm sure it can be explained as a terrestrial object (bird, plane, etc.) But, my friends insisted and persisted that I send it to you so you can make a professional judgment of the matter. This is why I waited so long to send it to you. Again, I'm skeptical of it's 'other worldly' origin and I'm sure it can be explained as 'this worldly'. I apologize for wasting your valuable time with this photo, please forgive me, my friends were very persuasive."],"Log Number":"US-12272008-0009","Object Features":"Unknown","City":"Grand Junction","Sighting Duration":"00:01:00","Latitude":"39.07257","Summary":"Picture of UFO (?) at Mesa Mall","Date Submitted":"10/10/2008 03:00 UTC","Object Flight Path":"Unknown","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/14561.html.txt","/var/www/straped/mufon/more/14561_submitter_file1__100_0693.jpg","/var/www/straped/mufon/org/14561.html"],"Date of the Event":"10/10/2008 03:00 UTC"}