{"Longitude":"-112.069927","divs":["Sighting DetailsAs we walked outside to smoke, a friend of mine and i around 3:30 am i noticed a brighter then usual star...flashing in the eastern sky. Right away my respond was pointing to it and saying hey Kyle u see that...and as i finished my sentenced the thing exploded with a big boom and making all dogs as far as i can hear start barking. the boom also was heard indoors as well because my sister came out to find out what the loud explosion was. While she was in route to come outside we watched the big fire ball it created in the sky, and releasing a craft with flashing lights or light (not sure how many lights there were on the launched craft) towards the southwest direction and climbing upwards slowly fading away until it was no longer visible,..while the main object remained in the spot it was and remained burning in the night sky for the rest of the time looking like a really bright star,...only it was looking as if it was on fire still hours after it blew up exploded,....launched whatever it did. As i am wrighting this the sky is getting brighter and soon it will be fully lit,..but the object is still looking like a stationary fireball which soon is gonna be hard 2 see if at all."],"files":["/var/www/straped/mufon/html2text/14569.html.txt","/var/www/straped/mufon/org/14569.html"],"Region":"Arizona","Country":"United States","Case Number":"14569","Object Features":"Undisclosed","Viewing Distance":"20 Feet or Less","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Other","Log Number":"US-12282008-0007","Date of the Event":"12/28/2008 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.450357,+-112.069927(14569)&iwloc=A&hl=en\"> mufon case (14569) map </A>","Object Shape":"Bullet, Missile, Circle, Fireball, Flash, Oval, Star-like, Other, Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around December 28th 2008"],"Weather Factors":"Unknown","City":"Phoenix","Summary":"Star-like object seen exploding making a BIG BOOM over North Phoenix Dec 28, 2008, 3:30.","Tags":"City","Source":"MUFON","Latitude":"33.450357","Date Submitted":"12/28/2008 03:30 UTC"}