{"files":["/var/www/straped/mufon/html2text/14563.html.txt","/var/www/straped/mufon/org/14563.html"],"Tags":"City","Region":"Utah","Viewing Distance":"Over 1 Mile, Unknown","Weather Factors":"Unknown","Summary":"Unknown object shot a beam of light and then disappeared.","divs":["Sighting DetailsI was on my way to work at about 6:15am on the morning of Dec. 18, 2008. I had just entered I-15 in Layton heading south when I saw something flashing out of the corner of my right eye. I drive a large box truck to work and it has large mirrors just like a semi would have. My initial reaction for a split second was that there was an emergency vehicle behind me, but when I looked in the right-side mirror there was nothing close behind me. Then just above and left of the mirror, in the top right corner of the windshield I noticed an object in the distance. It was in the sky to the southwest of Layton and at first appeared to be about 15 miles away. In my mind I knew that this would put it in the area of the Salt Lake Int'l Airport. From my point of view it looked like a ball of light, one side green and one side red. I immediately thought it was an airplane that was too far away for me to see clearly. My office window at work faces the airport's flight path and is only about 2 miles directly south of the airport, so I see planes very close all day long. Anyway, I looked away for just enough time for me to think to myself that the lights weren't flashing at all. I looked back over and noticed that the object had not moved whatsoever. Then, almost immediately an extremely bright beam of light shot out from the object and did about a 5 second scan across the cloud cover before ALL of it just disappeared in an instant. Just vanished. When the beam shot out I also noticed that the object DID appear to be a green and red \"ball\" of light and not two seperate lights as I'd first assumed. The thing is is that when the beam lit up the clouds I realized that it was closer than I'd first estimated. This time it seemed to be only about 5 miles maximum from where I was. The beam itself also looked very odd. It was extremely bright and lit up the clouds enough that I could see everything it scanned perfectly. It happened pretty fast, but it definitely sent chills down my spine. It was like nothing I'd ever seen before and the fact that it disapperared right in front of my eyes absolutely astounds me. I kept looking for it throughout my entire drive and then some more when I got to work, but nothing. One thing I did notice was that all of the planes I could see remained visible even after they had broken through the cloud cover, and they were even farther away than whatever it was that I saw. I also noticed that every plane I saw in the sky that morning had two things in common that the other object didn't have. First, all of the other planes had flashing lights and secondly, all of the planes lights were distinctly seperated from one another. Meaning I could see space between the lights. I did consider the possibility of a helicopter, but I thought why would a helicopter be flying over the Great Salt Lake? Especially at 6 in the morning. And why would it be scanning the sky instead of the ground or lake? As I said before, I litterally watch planes take off and land from my office ALL DAY LONG. I've had this office for about two years and not one time have I EVER seen ANYTHING using ANY sort of spotlight. Never. I checked in the paper, online, the news and even checked your site for an explanation. I felt (and still feel) like there is no way that I could've been the only person to see this. It was far too bright and far too peculiar. I'm not saying that what I saw was an \"alien spacecraft\". Howeveer, I am saying that what I saw was by all definitions an Unidentified Flying Object. It gave me a sense of shock and excitement that turned to awe and wonder after I had some time to wrap my head around it. It was very exciting and I feel like I have to share it. I initially shared it with my boss and some co-workers immediately after it happened without really thinking what I would sound like. I was met with jokes and strange looks like I was crazy. Bottom line is I don't care. I know what I saw."],"Country":"United States","Longitude":"-111.969683","City":"Layton","Log Number":"US-12282008-0001","Date of the Event":"12/18/2008 06:15 UTC","Object Flight Path":"Stationary","Latitude":"41.063922","Date Submitted":"12/18/2008 06:15 UTC","Source":"MUFON","Disposition":"Insufficient Data","Object Features":"Unknown","Case Number":"14563","map":"<A HREF = \"http://maps.google.com/maps?q=41.063922,+-111.969683(14563)&iwloc=A&hl=en\"> mufon case (14563) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Layton","There were no other sightings in Layton on or around December 18th 2008"],"Object Shape":"Sphere, Unknown"}