{"Date Submitted":"12/11/2008 06:30 UTC","divs":["Sighting DetailsIt was shortly after nightfall, when I had to take the dogs out to do their business. During this time I generally watch the stars to look at the constellations and such when I noticed a very bright light coming from northern San Antonio and moving southward at a very slow speed considering the altitude in which this object appeared to be flying. At first they did seemed to look like airplane landing lights due to the intensity of the white colored light, but the direction and sheer altitude made this very unlikely. The craft itself was not visible through the bright light and as the object went overhead I could see that this craft did not have the traditional red and green lights which are mandated by the FAA, if the craft did have the lights in question, they were not on, not so likely next to a major airport. After about 10 minutes the light went dimmed and eventually disappeared as if it started to travel upward. After that moment, it was gone. It was like nothing I have ever seen before. I have seen satellite many, many times. This was not one of those times"],"Tags":"City","files":["/var/www/straped/mufon/html2text/14577.html.txt","/var/www/straped/mufon/org/14577.html"],"Case Number":"14577","Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"Undisclosed","Summary":"Bright circular light.","Viewing Distance":"Over One Mile","Region":"Texas","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=29.433542,+-98.492448(14577)&iwloc=A&hl=en\"> mufon case (14577) map </A>","Disposition":"IFO","Latitude":"29.433542","City":"San Antonio","Log Number":"US-12282008-0015","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around December 11th 2008"],"Country":"United States","Longitude":"-98.492448","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"12/11/2008 06:30 UTC"}