{"Latitude":"34.051668","Region":"Arizona","Summary":"While flying a Delta Flight #1663 at about 31,000 to 32,000 feet altitute.","divs":["Sighting DetailsEvent occurred between 10:00 p.m. and 11:00 p.m. while flying over the state of Arizona between 31,000 to 32,000 feet altitute. I was flying from Atlanta, Georgia to Ontario, California. I had the urge to look out the window because I wanted to see if there were any visible ground structures which would indicate to me that we were not too far away from our destination. I first I saw the lights at quite some distance below, but thought that we were flying low enough to be able to see structures on the ground, but what caught my attention was the patterns of the lights was something I had never seen before (the appearance was like electrical discharges). After I followed the lights below, I activated the flight map on the computer screen and it indicated that we were flying at an altitute between 31,000 to 32,000 which immediately indicated to me that we were to high above the ground to be able to view any structures on the ground. I stopped looking out the window and just sat back and tried to make sense of what I just had seen. Within ten to fifteen minutes later I decided to look out the window again and that is when I saw the three semi-domes flying at almost our same altitute close enough to where I was able to see details of the aircraft. I saw what appeared to be semi-dome shaped objects. Due to the darkness I was only able to see the areas that were illuminated. There were a total of three (a smaller one in the front, a larger one in the center, and a smaller one in the rear). Our plane was travelling to the West and the objects were travelling towards the East. They appeared to be following each other. They were travelling to the right side of the Delta aircraft at a distance where I was able to see details of the semi-dome shaped object. The illuminated area seemed to be composed of some sort of glass or see through type of material, which were composed of several one piece panels (five or six individual panels from top to bottom). What appeared to me to be the strangest thing was that there was some sort of a light or electrical impulse (similar to the ones used in monitors at hospitals to monitor heart rates) which would travel counter clock wise continously across the center of what appeared to be glass panels. I looked at these objects for quite some time trying to comprehend what I was observing. I am an aircraft aficionado and I've watched just about every documentary on the Discovery Channel and National Geographic aircrafts and I've never seen an aircraft similar to what I saw that evening. Due to the darkness I was not able to observe if the bottom of the objects (or base) were connected to each other or if they were all independent from each other."],"trends":["there has been one other sighting in cms\\tg","there were no other sightings in cms\\tg on or around december 15th 2008"],"Sighting Duration":"Undisclosed","Date Submitted":"12/15/2008 12:00 UTC","Object Features":"Undisclosed","Longitude":"-111.089901","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14583.html.txt","/var/www/straped/mufon/org/14583.html"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Unknown","Log Number":"US-12282008-0021","Date of the Event":"12/15/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.051668,+-111.089901(14583)&iwloc=A&hl=en\"> mufon case (14583) map </A>","City":"cms/tg","Tags":"City","Source":"MUFON","Case Number":"14583","Country":"United States"}