{"Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Waynesboro","There were no other sightings in Waynesboro on or around December 28th 2008"],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/14584.html.txt","/var/www/straped/mufon/org/14584.html"],"Summary":"Saw bright light/movement of no known aircraft.","divs":["sighting detailsi went outside at about 8:10 pm to give a friend a ride home as i was standing out waiting, i observed a bright light in the sky that seemed \"out of place\". as i continued to watch it, i realized that it was not an airplane or helicopter since it appeared to be stationary. it was also too bright to be a star or planet. the light was white. my friend came out & as he started to get in the car, i asked him to look and say what he thought it was. he said he didn't know, but that he'd seen it before. he said we should drive toward it because he wanted to know what it was &\\or what was going on. at this point, i became quite anxious and definitely did not want to do that! as we drove (not towards it!), we continued to observe the \"object\" & noticed that it was about 20-30 miles away, but that it also seemed to have slightly descended. right after this, my friend said that it was \"beaming light down\", but i couldn't look away from the road at that point. when i could look again, it had apparently stopped. several seconds later, it developed a \"tail\" for a split-second,then streaked away at an impossible angle & speed, then was gone. the time it took for it to vanish, from \"tail\" to disappearance was a second or less. at the time, i didn't want to tell anyone anything for fear of ridicule, but it was just too much to keep to myself, so as soon as i got home about 20 minutes later, i told my husband, who urged me to report this, so i found this website. this is all true & i'm still shaken up."],"Case Number":"14584","Weather Factors":"Unknown","Latitude":"39.762827","Object Shape":"Unknown","Date Submitted":"12/28/2008 08:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.762827,+-77.568229(14584)&iwloc=A&hl=en\"> mufon case (14584) map </A>","Object Flight Path":"Stationary,Other","Tags":"City","Log Number":"US-12282008-0022","Region":"Pennsylvania","Country":"United States","City":"Waynesboro","Longitude":"-77.568229","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"12/28/2008 08:10 UTC","Object Features":"Unknown"}