{"Object Features":"Unknown","trends":["There have been 5 other sightings in Chesterton","There were no other sightings in Chesterton on or around December 18th 2008"],"Longitude":"-87.062679","Tags":"City","Latitude":"41.616674","Log Number":"US-12292008-0002","Country":"United States","Date of the Event":"12/18/2008 12:00 UTC","City":"Chesterton","Sighting Duration":"Undisclosed","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.616674,+-87.062679(14589)&iwloc=A&hl=en\"> mufon case (14589) map </A>","Source":"MUFON","Case Number":"14589","Weather Factors":"Unknown","Region":"Indiana","Object Shape":"Star-like","divs":["Sighting DetailsI had notice a very bright object in the sky in late November, approximately Nov. 26th. in the sky above Northwest Indiana. There was a smaller, much dimmer object close to the bright object as well. I noticed it and was a taken aback a bit because the object was so large and bright. I had taken classes in astronomy at Purdue with a telescope with high magnification before, I have seen the planets upclose, and I had never seen an object so large,bright, and close as the one I am describing. I mentioned to my boyfriend the following night on the way to Kokomo,IN for a family Thanksgiving get together that I saw the bright object and the near by dim object in the sky. He saw it also,and the hour and half drive from Porter County to Kokomo, Indiana, I watched the object. I thought the object was maybe the ISS or satellite of some kind so I wrote it off. On Thanksgiving night, my boyfriend and I drove from Kokomo, IN back to NW Indiana and then to Charlotte, MI to drop off my son with his grandmother. While on the drive, sitting in the passenger seat I noticed the objects again, and could see them all the way to Charlotte, MI. Again, VERY VERY bright light, but not really all that interesting. IT hadn't moved or anything in a strange manner, but it did get dimmer and brighter rather quickly,eratically,and drastically, not like a star,rhythmically. After arriving home, I saw the lights, one dim and one VERY bright from my porch. For the next few nights both my boyfriend and I saw these two lights, not changing, but were odd. My brother called me the next day from workand asked me if I had seen weird bright lights in the sky. I had told my brother the sequence of events now being described and he said that they were visible from his work, in Cedar Lake, IN. Night after night for almost two weeks my boyfriend, brother, and I saw these lights in southwest sky. They didn't move like stars which shift in position each night slightly, it was almost as if the lights stayed stationary every night at the same time. I wouldgo out about eight o'clock to see the lights and they would be in the same spot, but the rest of the stars would not. For example, the lights were close to Orion's belt at first but then as Orion's belt shifted, the lights never moved. Finally, having an insomniac moment on or around Dec. 18th, about 4 am, I decided because I couldn't sleep, I would stare at the lights out my bedroom window. We just moved into the area and had not put up blinds yet so I could lie in my bed and see the lights. However, what I thought would be a boring bright light that would put me to sleep, turned out to be something else all together. I watched the bright object for about twenty minutes when the light started to move back and forth, like it was jumping back and forth. The object turned green, then blue and finally red. The object got dimmer to where it almost was invisible, and then got so bright I had to rub my eyes. I woke up my boyfriend to make sure I wasn't crazy and he went to another room to see what the lights were doing. He noticed too that the lights moved eratically, almost jumping and then the bright object turned a violet color and split into three separate objects. One of the \"offspring\" from the parent object came back to the center, fused with another \"offspring\" and became bright again. The third seemed to stay distant to the two fused objects and was MUCH dimmer. After we witnessed this, the object dimmed completely and could not be seen. There was no wind that night and the object could be clearly seen from my window away from the trees. I thought the object was very strange at first because it was SO bright and low in the sky. After seeing this strange split, I felt an eerie sense that this was not an object like a star or planet. Again, night after night we could see the lights right above the evergreen trees just in the front of our house. until tonight, Dec. 28th. The lights moved down the street above the middle school, approximately three blocks from my house and I took a video of it. I thought it was odd that after almost a month of being in the same position, it had finally moved. What was even more odd to me was the fact that I could see the object with no problem from the park near my house through the video camera, but I had to zoom in to see the other stars, and planets like Venus. Also, I checked the NASA ISS position, and it is not visible from my house for more than six minutes, but I video taped this object for more than six minutes. I'm not a skeptic, but I am a biochemist and I wondered if any one on your team could tell me what the lights were, whether there has been a satellite in orbit for the last month, or whether this was truly unidentifiable. I plan to film the object again if it is in the sky tomorrow night. Thanks!!! P.S. I do have the video of the object but am unable to locate the cord to download the video off of my camera at the moment. I can give you video as soon as I find the cord though."],"files":["/var/www/straped/mufon/html2text/14589.html.txt","/var/www/straped/mufon/org/14589.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Strange, very bright light in the southwest sky over Indiana.","Date Submitted":"12/18/2008 12:00 UTC"}