{"Object Features":"Undisclosed","Object Shape":"Disc","Source":"MUFON","Latitude":"40.715753","Country":"United States","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"Round loking from bottom, bright, off white, gray tint.","Log Number":"US-12292008-0011","divs":["Sighting Details+walking with girl, ( hand & hand) looking at stars. watched shooting star, we though but in a matter ove couple seconds it went from pin point of light ,to maybe couple of hundred feet across . right over us. we were so scard we though it was going to hit us. but just as fast as it came, it stoped and went back up and disapired. told my parents when i got back home. they told me never tell any one. they would say i was crazy. also my brother had encounter with one when in service, and was sworn to be quite, and had to sign statement. under thret of court marshal or prison. he was in marines stationed in florida. on air bass his job was in flight tower, taking weather readings, sending up baloons. this was about 1948. in latter years i tryed to get him to report it. but he became number 2 in state, in corrictions dept. ast, atorney genneral.he told me that it would not do him any good for job. he told me whole story before he passed away. please believe me i am not a kook. i am about ready to pass on soon. so though i would tell someone. Frank Bodmer (will be 70 dec. 30 )"],"files":["/var/www/straped/mufon/html2text/14598.html.txt","/var/www/straped/mufon/org/14598.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.715753,+-73.998533(14598)&iwloc=A&hl=en\"> mufon case (14598) map </A>","Tags":"City","Sighting Duration":"Undisclosed","City":"New York","Weather Factors":"Unknown","Region":"New York","Case Number":"14598","Date Submitted":"06/30/1950 12:00 UTC","Date of the Event":"06/30/1950 12:00 UTC","Disposition":"Insufficient Data","Longitude":"-73.998533","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 30th 1950"]}