{"divs":["Sighting DetailsThe other man that reported a sighting from Mission Viejo, CA may be on to something. His photo's look to be the same that I witnessed. This event is why I am on this site. I walked outside for the last time that night at about 2am and noticd an abnormal bright light in the sky toward the south and took a moment to look at it. After about two minutes the light seemed to change shape and colors very quickly. It seemed to be about 3-5 miles away and about 4-6 thousand feet frm the ground. I know that atmospheric gasses can cuase this illusion on a star so I took the time to really focus on it, and did see that it did change size and shape. To make certain this was not a star, I then proped myslf against a solid wall and looked at it through a tree to see any movement. Much to my suprise it did move from right to left and up and down. Very subtle movements though, besides the natural movement of the earth of course. I could only watch it for an hour and had to go in and sleep. The lights flickering on and off made it to look as though it had a triangular shape. If it was a star, it's not there tonight. Loren"],"Date of the Event":"12/28/2008 02:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"California","Disposition":"IFO","City":"Mission Viejo","Summary":"Bright lights, red, green and blue.","Longitude":"-117.668645","Case Number":"14594","files":["/var/www/straped/mufon/html2text/14594.html.txt","/var/www/straped/mufon/org/14594.html"],"Object Shape":"Triangle, Other","Date Submitted":"12/28/2008 02:00 UTC","Source":"MUFON","Latitude":"33.602813","map":"<A HREF = \"http://maps.google.com/maps?q=33.602813,+-117.668645(14594)&iwloc=A&hl=en\"> mufon case (14594) map </A>","Tags":"City","Object Features":"None","Country":"United States","trends":["There have been 10 other sightings in Mission Viejo","There was one other sighting in Mission Viejo on or around December 28th 2008"],"Log Number":"US-12292008-0007"}