{"Longitude":"-117.663895","City":"Mission Viejo","Viewing Distance":"Unknown","Log Number":"US-12292008-0004","Tags":"City","Country":"United States","Latitude":"33.604913","Date of the Event":"12/28/2008 12:00 UTC","Object Features":"Unknown","Summary":"Light in the sky, hovering/moving slowly. I documented well with photos and video.","files":["/var/www/straped/mufon/html2text/14591.html.txt","/var/www/straped/mufon/more/14591_submitter_file1__100_0972.JPG","/var/www/straped/mufon/more/14591_submitter_file2__100_0973.JPG","/var/www/straped/mufon/more/14591_submitter_file3__100_0974.JPG","/var/www/straped/mufon/org/14591.html"],"Date Submitted":"12/28/2008 12:00 UTC","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.604913,+-117.663895(14591)&iwloc=A&hl=en\"> mufon case (14591) map </A>","Case Number":"14591","Object Shape":"Circle, Diamond, Disc, Star-like","Source":"MUFON","divs":["sighting detailsi am a sky watcher, everytime i get a chance i hope to see something up there and for years have never seen anything. right now if i look out my window the object is still there. but i came in to recharge my cameras and report this to mufon.. anyone in the oc area should be able to see this right now in the south west sky.... i dont think this was a satellite. definately not a plane, helicopter or star either. constantly changes position and i filmed it for a solid hour. i have over 100 still photos as well all with points of reference. i really want to pass on this footage to someone who can analyze the date\\time with military and\\or satellite position records. guys! contact me i think i have found something. my video shows constant movement, changing in color and shape and pulsing bright lights. in the still photographs you can see the position changing in corolation to the stars in the foreground. this is phenominal footage and i took pictures of me taking video and i took video of me taking pictures. i tried to document well so that sceptics would not think im a scammer or anything. i shot the video in high definition and with a camera that has a 40x's zoom. my digitial still camera is 12.1 megapixel.. i am attaching photos in sequential order taken only 1 or 2 seconds apart from eachother. this is the real deal ok im so excited im going back outside. someone please contact me for my footage. thanks"],"Region":"California","trends":["There have been 10 other sightings in Mission Viejo","There was one other sighting in Mission Viejo on or around December 28th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path,Path then hovering","Sighting Duration":"Undisclosed","Weather Factors":"None"}