{"files":["/var/www/straped/mufon/html2text/14601.html.txt","/var/www/straped/mufon/org/14601.html"],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around December 20th 2008"],"Latitude":"29.761373","Country":"United States","Case Number":"14601","Object Shape":"Bullet, Missile","Log Number":"US-12292008-0014","City":"Houston","Date Submitted":"12/20/2008 07:35 UTC","Object Flight Path":"Straight-line path","Region":"Texas","Object Features":"Unknown","Source":"MUFON","Longitude":"-95.36382","Tags":"City","Date of the Event":"12/20/2008 07:35 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsmy sighting took place on december 20th,2008 at around 7:35-7:40pm. it was a rather warm night and i had my top down on my audi convertible. i was parked in a parking lot in the middle of the galleria shopping area in uptown houston. i had a date that night and we were suppossed to meet at 7:30. she called to say she was running late and to make it 7:45. i parked in the lot to kill time. while listening to the radio i just happened to glance up to the sky. it was a relatively clear night with some lingering clouds in the area. however, i looked up just in time to see this bright white object jetting across the sky. this was the fastest thing i had ever seen and the sighting lasted about 4-6 seconds. the object was fairly low, but high above the skyline of buildings in the area. it came out of nowhere and quickly disapeared from sight as it entered a group of darker clouds. i thought i would be able to see the light from the object through the thin clouds, but it simply vanished. the white color was almost like a solid color. it was not like lights from a plane or a street lights or anything that i can say i've seen before. it was a solid light. no flashing. i have seen several falling stars and meteorites, but this object had no tail. i thought it odd that if it were a falling star, it wasn't really falling, it was flying in a level trajectory. it wasn't breaking apart into the atmosphere either. i also thought if it was a meteorite it surely would have crashed in a very populated area,yet no sounds or visuals to confirm that. in the short time i witnessed this object i can honestly say i don't know what it was, but in my opinion this was an object that was under some kind of navigational control. the impression i had was it was a flying, solid object flying on it's own power. the object was shaped like an excedrin tablet\\capsule and again a solid white illumination. this incident happened for only seconds, but i think i saw something extraordinary and it has been on my mind ever since."],"Summary":"Witnessed a bright white object traveling at tremendous speed in the Galleria area of Uptown Houston. Amazing speed as object came out of nowhere. Lost track of the object as it entered cloud cover.","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=29.761373,+-95.36382(14601)&iwloc=A&hl=en\"> mufon case (14601) map </A>"}