{"Object Flight Path":"Path with directional change","Tags":"City","Log Number":"US-12292008-0020","map":"<A HREF = \"http://maps.google.com/maps?q=42.214662,+-83.15954(14607)&iwloc=A&hl=en\"> mufon case (14607) map </A>","Date Submitted":"12/28/2008 08:15 UTC","Sighting Duration":"Undisclosed","Latitude":"42.214662","Disposition":"Unknown","Date of the Event":"12/28/2008 08:15 UTC","files":["/var/www/straped/mufon/html2text/14607.html.txt","/var/www/straped/mufon/org/14607.html"],"Region":"Michigan","Case Number":"14607","Object Shape":"Circle, Sphere, Unknown","Object Features":"Unknown","City":"Southgate/Wyandotte","Viewing Distance":"Unknown","trends":["there have been no other sightings in southgate\\wyandotte","This sighting has never been favorited."],"Weather Factors":"None","Summary":"Bright, orange lights over Southgate/Wyandotte, MI.","divs":["Sighting Details After leaving dinner with my Fiancee we pulled onto Fort street, between Pennsylvania and Eureka roads, on the border of Southgate and Wyandotte, MI, heading north to go home. It was approx. 8:15pm on Sunday, December 28th, 2008. I then spotted out of the windshield of our vehicle to the northeast, four bright, solid orange points of light high in the sky in a type of vee formation. They were slowly travelling easterly(toward Canada). I first assumed that they were helicopters from Selfridge AFB but, they started to loop around each other(as if tumbling) and go in different directions relative to each other but generally staying close together. I then pulled the vehicle over and got out of the car. I listened for any noise of engines or the such. It was totally quiet. There were no noises to be heard. We then proceeded to watch the four lights as they progressed eastward, continually looping and turning around each other until one by one they faded out of sight. They never changed color nor did they blink at all. This went on for approx. 3-5 minutes. When they faded out we I got back into the car and we headed home. I have seen alot of meteors, space debris, shooting stars, ect. in my life but I have never seen anything like this. It was quite fascinating. I'm not saying that this was definately a UFO or not, but we still seen these lights in the sky that I could not explain and I wanted to pass this along to you. Thank you, Scott Pruit Aircraft Technician Ford Motor Company"],"Country":"US","Source":"MUFON","Longitude":"-83.15954"}