{"divs":["Sighting Details I was walking back from my mail box and I notice a bright object that was very low. It was in the South West and was much brighter than any star I have seen before. The object was very bright white light all around and there were pulsing Blue and red lights coming from the center. On the bottom ends were red pulsing lights on the right and let side. The object also appeared to hover and move side to side. Also it would go from very bright to dim then bright again. I estimated that it was near the North Carolina State line area which would put it near a small Town called Como , NC. My wife also viewed the object for a short while and notice the pulsing lights as well coming from the center of the object. I view the object for about 15 minutes until I could no longer see it due to the trees. Try to take pictures of the object, but the digital camera stated not recognize file format. It may had been nothing but a Star, but never seen one move that fast in the short time viewing. Larry Green"],"Object Flight Path":"Stationary,Hovering then path,Path then hovering","Case Number":"14609","Disposition":"IFO","Sighting Duration":"Undisclosed","Log Number":"US-12292008-0022","Viewing Distance":"Over One Mile","Region":"Virginia","Source":"MUFON","Tags":"City","Latitude":"36.684651","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.684651,+-76.913091(14609)&iwloc=A&hl=en\"> mufon case (14609) map </A>","Longitude":"-76.913091","Object Shape":"Flash, Star-like","Date Submitted":"12/29/2008 07:45 UTC","Summary":"View it above tree top and in a few minutes it was below the tree level.","trends":["There have been 2 other sightings in Franklin","There were no other sightings in Franklin on or around December 29th 2008"],"Country":"United States","City":"Franklin","Date of the Event":"12/29/2008 07:45 UTC","files":["/var/www/straped/mufon/html2text/14609.html.txt","/var/www/straped/mufon/org/14609.html"],"Object Features":"Unknown"}