{"Log Number":"US-12292008-0018","Disposition":"Unknown","trends":["there have been no other sightings in cms\\tg","This sighting has never been favorited."],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-154.489862","Object Features":"Unknown","Region":"Alaska","Object Flight Path":"Hovering then path,Straight-line path,Other","Date of the Event":"12/29/2008 12:00 UTC","Tags":"City","Summary":"Mostly stationary (looked like a red pulsar), with times of wobble and \"random\" movement.","Weather Factors":"Light","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Case Number":"14605","Date Submitted":"12/29/2008 12:00 UTC","Source":"MUFON","divs":["Sighting Detailsmy wife woke up (with the baby) alittle before 5 AM and wispered excitedely to me..'there's a ufo outside'. {outside the window, faceing west, with the 'star' at SW) I saw the object and saw the flashing red, but i was sure that it was just a red pulsar. I watched for a while (20 minutes) and saw no movement. my wife reported that it had sattelites around it, I still couldnt see anything real strange. I went to go get binoculars but still couldn't see much more. She, my wife, says that its closer to the upper transmission line. (it was between two power lines) I couldn't tell so in my mind i drew a 90 degree cross through it and both of the powerlines, making two right tringles with the power lines. I would say then that the 'star' was 40 % closer to the upper line and before i knew it, it was more at a 20% point. now this meant that it was traveling from west to east and I decided that it's movement couldnt be explained by the earth's rotation, I guessed that I had to believe my wife that it dipped down and back up again. I then see it move around, about as much distance as a silver dollar held at arm's length, back and forth and up and down. It held still again and i went downstairs to get my camera. When i got back it was now 4-6 inches (at arm's length) west. I tested my camera but i couldn;t find the tripod. The camera (purchased in 2000) couldn't get much more than a white dot so i didn't record much. over an hour or so more (2+ hours total) it slowly traveled west (in line with the power line, pretty much in parallel travel with it) with some stops and variant movements (again mostly l and r but also circles, up and down) as it fades into the distant western horizon, and behind a tree, I decide to go back to sleep feeling confident that I would (could) see no more, (believe me if it were above 0 deg F i would have gone outside) final assesment: Not a star! other assements: it would be easy to say that it was behaving non-chalont (sp?) like it didn't want to be noticed.... the stationary times, the very slow travel west,, but the erattic movements were like it was trying to regain controll (of the ship). ps .. at last: what my wife says was that there were white lights coming off of it and orbiting around it, i did think i saw small specks of light come off it but wvery time i tried to look again i couldnt see them for long..."],"Latitude":"63.596313","files":["/var/www/straped/mufon/html2text/14605.html.txt","/var/www/straped/mufon/org/14605.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=63.596313,+-154.489862(14605)&iwloc=A&hl=en\"> mufon case (14605) map </A>","City":"cms/tg"}