{"Sighting Duration":"Undisclosed","City":"London","Source":"MUFON","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around September 30th 1998"],"Viewing Distance":"Unknown","Case Number":"14608","Date Submitted":"09/30/1998 12:00 UTC","Country":"United Kingdom","Disposition":"Unresolved","Object Shape":"Sphere","Longitude":"-0.125995","Region":"England","Latitude":"51.516269","divs":["Sighting DetailsNo doubt you are getting loads of mail after the show, so I'll keep this quite brief. I live in Southchurch, Essex, England and one October night about 10 years ago I was in my garden looking at the stars. I didn't see a craft, I saw a whole planet go by. I know it sounds crazy, but this thing was just like you see earth from space except that it had reds and oranges on it as well as blue and green. If I hold my arm in front of me and balance a football on my hand, that was about the size of it, yet it was far away above the rooftops. It was totally silent and had a short finite trail behind it. It followed an arc across the sky. I have rooftops surrounding my house and it appeared, it seemed, above my next door neighbours roof and carried on in an arc till it disappeared behind the roofs in the next street. Given the angle it was travelling I totally expected to hear it crash. The whole sighting lasted just a few seconds, during which I was too amazed and stunned to say anything. Just as it disappeared, I managed to say something and my partner turned and just caught sight of the trail. I have just heard a very similar description on Coast to Coast and that has given me the impetus to contact you. Sue x"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"GB-12292008-0021","Date of the Event":"09/30/1998 12:00 UTC","files":["/var/www/straped/mufon/html2text/14608.html.txt","/var/www/straped/mufon/org/14608.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.516269,+-0.125995(14608)&iwloc=A&hl=en\"> mufon case (14608) map </A>","Summary":"Planet like earth following a silent arc.","Object Flight Path":"Undisclosed","Tags":"City"}