{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.849857,+-86.395344(14604)&iwloc=A&hl=en\"> mufon case (14604) map </A>","Summary":"Side length longer than across rear. Thick, large circular object on bottom. Lighted corners and middle.","files":["/var/www/straped/mufon/html2text/14604.html.txt","/var/www/straped/mufon/org/14604.html"],"Weather Factors":"Unknown","City":"Brownsburg","Object Features":"Patterned Surface","Log Number":"US-12292008-0017","Region":"Indiana","Object Shape":"Triangle","Country":"United States","Date of the Event":"12/17/2005 02:30 UTC","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-86.395344","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around December 17th 2005","This sighting has never been favorited.",""],"Tags":"City","Latitude":"39.849857","Date Submitted":"12/17/2005 02:30 UTC","divs":["Sighting Details The following occurred on Dec. 17th of 05. I started my work day early in the a.m. hours back then. This particular night was clear, cold and a little snow on the ground.I was taking my two german shepherds out back to lock them inside my fenced yard. They entered the yard and my big shepherd turned towards me and whined while looking up. I was just starting to latch the gate and looked up to see what he was whining about and seen a large, triangular craft just barely moving above me.I felt that I could hit it with a rock. It was that close. It was so huge that it seemed like it was closer than it was.The sky was lit up perfectly that night from the reflection of the lights from Indianapolis,( I lived about 17 miles out west of Indy)and this thing was just floating silently above me.I got a good look at it. It looked thick, like a giant airliner, and was very long. The length from corner to corner at the rear was shorter than the length from the rear to front.I can't even guess as to how big it was. There was a large, thick circular object on the bottom with one light in the middle of it.It had areas of different depth to it also. The under belly had different depths to it also. Mostly around the outer edges but some on the inner part of it too.It was so huge and close that I could have held one of my trash can lids at arms length and still be able to see most of it.I don't remember light colors that were on it, but there were not very many. At least four minutes passed when by then both dogs were acting up but not barking. I looked back at them and to finish latching the gate. I looked back up but didn't see it until I looked over towards the east, which would have been the N.W. side of Indianapolis and there it was. The craft had suddenly traveled 15 to 20 miles and was higher in the sky. It then banked to the left and up and was gone in a flash. It was almost as if it just disappeared after it traveled a short distance because it was gone so fast.Although I have forgotten certain details, the size and quietness of this craft has never left me. I never felt anything but awe and how eerie it was to be so close, traveling slow and silent as if it was floating. I did not feel any energy or anything of the kind coming from it.I did not hear anything from the sudden burst of speed it had to of used when I had to search for it after looking away to latch my gate. This was the second time I had seen one of these. The other was when I was traveling east on I-70 coming through Nebraska way back in 91. I drove over the road truck driving then and several of us that were traveling in a convoy seen it to the south. We were all running fast until one of them yelled through the c.b. radio real excitedly for us to look south. We all stopped and watched for about 5 or 6 min. until it went out of site.It was traveling about the height of what helicopters travel and was real far away but still looked huge."],"Case Number":"14604"}