{"Date of the Event":"10/10/1970 02:15 UTC","Country":"United States","divs":["Sighting DetailsThe first one uh the first one acted like you go under a streetlight real fast,you see flourescent kind of streetlights, you know the blue one? If you was togo underneath them at about say a hundred miles an hour, hundred fifty miles anhour, but have somebody turn it on when you got a hundred feet from it, thatswhat it looked like. Because it wasnt there, and all of a sudden they bothwent overhead. It happened in about four seconds. They were real bright in themiddle, and a darker ring around the outside of that, and then around theoutside of that again it was like a, oh, milky. But the whole thing wasirridescent. It was about three shades of green, there was a green, blueishgreen to it. The whole thing. And it was distinct. And if Id seen the one, itwouldve scared me, I know it scared the hell out of me, because it looked likeit was damn near goin to hit the car, and I think they were, what it was,whatever it was, they were using the road for a guide, and didnt see me. Icant understand how come they didnt see me, cause I had my lights on, youknow. But if youd of been, if you was only twenty-five off the ground, thenthat would have made them about, say ten feet in diameter, but if it was fiftyfoot or a hundred foot off the ground that would have made them probablytwenty-five foot in diameter. The first one was the lowest. Give me the effectit damn near hit the car,you know. The second one was a lot higher, and back,in back of that one. It was probably about a hundred feet (high), it lookedlike it was about ten feet in diameter. I looked in the mirror, couldnt seenothing. The top of it wasnt lit up, just the bottom. He states the objects were thesame shape and moving at the same rate of speed and states they were disks, ofoval cross-sections, indicating an approximate ratio of four in diameter, one inheight. The witness mentioned interference with his car radio. \"Yeah, there wassomething like you go under a power line. A single power line. But it wasntas bad, because any power line Ive ever went under starts affecting my radioprobably about a block away. Ill start getting a little tiny crackle, thecloser you get the more it gets. And itll do the same thing, beyond it. Theone in Saginaw cuts your car radio right out. This is the way this did, but itjust did it for an instant, just a little zip, that was it. And whether I gotanything from the second one or not, i wasnt paying attention.\"The witness states, \"They went right over my head, right over my head. This onewent directly over the car.\" He also states that when looking through his carwindow that the objects were larger in comparison to his rearview mirror whichis seven or eight inches wide. He states, \"A lot wider than that. Like I sayit looked like it was about twenty-five feet in diameter when it passed over mycar at approximately 50 foot. Because if it was any lower than that, if therewas any heat at all, it wouldve melted my car.\"He reports that the objects came into sight when about one hundred feetseperated them from his approaching vehicle, and that the closing, and observingtime, was for some four seconds. The closing speed was at least 150 miles perhour, in his estimation."],"Case Number":"1461","City":"Caro","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.491132,+-83.396897(1461)&iwloc=A&hl=en\"> mufon case (1461) map </A>","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Log Number":"","Disposition":"Unresolved","Object Shape":"Disc","Longitude":"-83.396897","trends":["There has been one other sighting in Caro","There were no other sightings in Caro on or around October 10th 1970"],"Source":"MUFON","Viewing Distance":"21-100 Feet","Summary":"CE-2 With Vehicle Radio Interference in Bay City,","Latitude":"43.491132","files":["/var/www/straped/mufon/html2text/1461.html.txt","/var/www/straped/mufon/org/1461.html"],"Region":"Michigan","Date Submitted":"10/10/1970 02:15 UTC","Object Features":"Undisclosed","Sighting Duration":"00:00:59"}