{"Object Features":"Unknown","Longitude":"-85.966658","Summary":"Three solid orange lights with intermitent sound.","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.354218,+-85.966658(14610)&iwloc=A&hl=en\"> mufon case (14610) map </A>","Latitude":"39.354218","Weather Factors":"Unknown","Date Submitted":"07/30/2008 03:00 UTC","City":"Edinburgh","files":["/var/www/straped/mufon/html2text/14610.html.txt","/var/www/straped/mufon/org/14610.html"],"Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","divs":["Sighting Detailsaround the end of July or the beginning of August in 2008 I stepped out onto my back deck to let my new puppy out to go to the bathroom. It was a very quiet night and the sky was clear. The only sounds were crickets and the sound of semi tractors traveling down interstate 65 which is about 4 miles from my house. As I looked up I noticed what at first I thought was an airplane traveling from southeast to the northwest. I saw three solid orangish lights in a triangular shape. The lights did not blink or change shape or color. The object was low enough that during the day you could easily identify what type of plane it was if it were a plane. The object traveled relatively slow overhead. I would expect if the object were a plane it would traveled overhead in a matter of seconds however the object took 3 or more minutes to pass. The sound of the object made a sound similar to a jet engine except it was intermittent. it nade a swoosh sound like a jet engine for about 2 or 3 seconds then it died down to where you could hear nothing but the crickets. Then about 2 or 3 seconds later the jet sound came back. This continued until the object was completly out of sight. I have been in the military for 20 years and live just outside a National Guard training post. I have seen all types of aircraft, various types of jets and helicopters and this was nothing like I had ever seen before. I just sttod there and stared at the object. i didn't want to go in and try to find a camera or wake my wife because I was afraid the object would have passed before I made it outside."],"Sighting Duration":"00:03:00","Object Shape":"Triangle","Disposition":"Unknown","Region":"Indiana","trends":["There has been one other sighting in Edinburgh","There were no other sightings in Edinburgh on or around July 30th 2008"],"Case Number":"14610","Log Number":"US-12292008-0023","Date of the Event":"07/30/2008 03:00 UTC","Source":"MUFON"}