{"Weather Factors":"Unknown","Log Number":"CA-12302008-0005","trends":["There have been no other sightings in Didsbury","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.661095,+-114.136281(14619)&iwloc=A&hl=en\"> mufon case (14619) map </A>","divs":["Sighting DetailsDriving East on Secondary HWY> 582 East of Hwy. 2 between Hwy. 2 and 21. I noticed 3 lights in the sky above the towers on the hills south of Three Hills,Ab. they seemed to be stationary. At first I thought they were balloons or Gliders but then it occurred to me that it might be a UFO taking place as I pulled over to grab my camera they started to fade out just as I reached out the window a nd took a snap. Like they were reading me knowing I was there. Yes there were a few minutes there where I thought that it was quite strange they would be so bright on a summers day and not moving. When I first looked at the picture I did not see anything for a couple of days, then one night I looked at the picture with the computer screen tilted away from me. There are 2 spots above the farmhouse and to the right of the tower if you zoom in. Now drag the picture right and above the trees you will see a 3rd light, as if it had started to move right when I snapped the picture. When I stuck my arm out the window too shoot the photo I was seeing 3 lights fading out. Like i said when this occurred I didn't think anyone would believe me,I even sent one to Coast to Coast. But no reply. No wonder it is very hard to see, and they are just dots of light. But htere was something I could sense about the event."],"Viewing Distance":"Over One Mile","Date Submitted":"07/10/2007 12:00 UTC","Disposition":"Unresolved","Summary":"Stationary intense white light sphere shaped.","Source":"MUFON","Object Shape":"Sphere","Object Flight Path":"Stationary","Region":"Alberta","Longitude":"-114.136281","City":"Didsbury","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"51.661095","Country":"Canada","Date of the Event":"07/10/2007 12:00 UTC","Case Number":"14619","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14619.html.txt","/var/www/straped/mufon/more/14619_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/14619.html"]}