{"Case Number":"14612","files":["/var/www/straped/mufon/html2text/14612.html.txt","/var/www/straped/mufon/more/14612_submitter_file1__SightingLocationClose_1.jpg","/var/www/straped/mufon/more/14612_submitter_file2__SightingLocationFar_1.jpg","/var/www/straped/mufon/more/14612_submitter_file3__ViewFromBehindTruck.jpg","/var/www/straped/mufon/more/14612_submitter_file4__ViewFromFrontOfTruck.jpg","/var/www/straped/mufon/more/14612_submitter_file5__WallToTruck.JPG","/var/www/straped/mufon/org/14612.html"],"Summary":"Bright sphere, high speed, low to the ground.","Weather Factors":"None, Does Not Apply","Disposition":"Unknown","Region":"Georgia","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=34.376902,+-84.932099(14612)&iwloc=A&hl=en\"> mufon case (14612) map </A>","Longitude":"-84.932099","Tags":"City","Country":"United States","City":"Adairsville","Source":"MUFON","Sighting Duration":"00:00:03","trends":["There have been 2 other sightings in Adairsville","There were no other sightings in Adairsville on or around December 29th 2008","This sighting has never been favorited.",""],"Object Shape":"Sphere","divs":["Sighting DetailsA friend and myself were traveling down Old Dixie Hwy. toward Hwy 41 (due west). At 9:18 PM my friend asked me the time and I looked at the clock as we debated on if we were going to the gym the next morning. We traveled approximately 0.5 miles when suddenly over the roof of the vehicle we saw a very bright fast moving sphere. It didn't seem to be very high, and living close to a small airport, I can usually recognize rough height and distance of crafts in the sky. However, this situation is a bit different, as the bright light didn't seem to be more than 50~70 ft. above the ground and I have never witnessed anything moving so quickly. There wasn't a noise, not a trail following the light, just a fast moving bright orb heading due west. Then it disappeared over the adjacent treeline. The total time we saw the object was appoximately 2~3 seconds. It was traveling too low and much too fast to be a small airplane, as there is an airport approximately 3 miles due north of the sighting. I have never been freightened of anything I have seen in the sky before, but I turned to my friend and he said \"What the hell was that!\" I said \"I don't know,\" so to feed our curiousity we drove straight toward the direction of the object, turned south onto Hwy 41 drove 0.5 miles and circled back to the origin and didn't see the object again. I asked my friend \"Ok, that object was clearly in the sky, correct?\" He replied \"Yes.\" I said \"Can you identify that object?\" He replied \"No.\" I said \"I want to report this, and hopefully someone else saw the same thing. As I type this, hairs are standing up on my neck, as I can't explain what I just witnessed."],"Date of the Event":"12/29/2008 09:19 UTC","Date Submitted":"12/29/2008 09:19 UTC","Latitude":"34.376902","Object Flight Path":"Straight-line path","Object Features":"None","Log Number":"US-12292008-0025"}