{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14624.html.txt","/var/www/straped/mufon/org/14624.html"],"Log Number":"US-12302008-0010","Source":"MUFON","City":"Stockton","Object Flight Path":"Hovering then path","Summary":"Star like object flashing ligh in the sky","Date Submitted":"12/28/2008 12:00 UTC","Date of the Event":"12/28/2008 12:00 UTC","Weather Factors":"Unknown","Region":"California","trends":["There have been 25 other sightings in Stockton","There was one other sighting in Stockton on or around December 28th 2008"],"Viewing Distance":"Over One Mile","Longitude":"-121.28808","Case Number":"14624","Object Shape":"Circle, Flash, Star-like","divs":["Sighting DetailsAS I was riding to my brother house in Brentwood California, a town in between stockton and Antioch. I could not stop my eyes from looking out the window. 7 airplanes flying parallel to each other around diablo mountains. while other planes were circulating the mountain at the same time. After arriving to his house I found a dark spot to look at the sky and listen to the night sky santing to find out what kind of planes they are, and as one zoomed by I could hear a sound of somthing likesomthing resembeling bomber planes. After helping my brother the next day, driving home aproximetly at eight PM. The same scenerio appeared. This time more like 9 planes flying parallel to each other. circulating what seemed to be the Modesto or Merced area. At a point somthing resembeling a bright star showed up in the area sorrounded by those planes this object was frozen in the air. After about what it seemed like a minute the object dimmed its light of. and I could see it dimmed now litterly standing in the sky and not moving. I am possitive that it was not a plane. After reaching Sacramento, Those airplanes were flying over sacramento, and circulate certain areas. After about a hour they had vanished."],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.961502,+-121.28808(14624)&iwloc=A&hl=en\"> mufon case (14624) map </A>","Tags":"City","Latitude":"37.961502","Object Features":"Undisclosed","Country":"United States"}