{"Log Number":"US-12302008-0008","Date Submitted":"11/30/1967 10:00 UTC","City":"Parsippany-Troy Hills","Tags":"City","Object Shape":"Star-like","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.857877,+-74.425987(14622)&iwloc=A&hl=en\"> mufon case (14622) map </A>","divs":["Sighting DetailsIf I recall correctly, at approximately 9 - 10 PM in late spring of 1968 it appeared as if a star moved. We came home from an event and while my wife put our daughter to bed I stayed on the front lawn star gazing. I saw a three star formation and thought it was either the big or little dipper. In a matter of a minute or two the star in the center began to move. I went into the house and told my wife, \"You've got to see this.\" We went outside and the star had moved from where I last saw it to a new position. Incredibly, in about 20 minutes it had moved in a half circle from a center position to a frontal position on the left (west). I have no idea what it was but a star doesn't move and at the distance it couldn't have been a craft of any kind. I cannot fathom a guess as to how many millions of light years away it was but nothing that I'm aware of could move that fast. I reported this several years ago to some agency but was laughed at. I know it happened because my ex-wife saw it with me. I stayed up till dawn waiting to see if it would move any further but it didn't. I'm not crazy and if I knew who to report it to back in 1968 (it could have been 1969) I would have done so. Thank you for your time."],"Weather Factors":"None","Viewing Distance":"Unknown","Latitude":"40.857877","Longitude":"-74.425987","Object Features":"Unknown","Case Number":"14622","Summary":"It appeared as if a star moved.","trends":["There have been 2 other sightings in Parsippany-Troy Hills","There were no other sightings in Parsippany-Troy Hills on or around November 30th 1967"],"files":["/var/www/straped/mufon/html2text/14622.html.txt","/var/www/straped/mufon/org/14622.html"],"Region":"New Jersey","Source":"MUFON","Object Flight Path":"Other","Disposition":"Unknown","Date of the Event":"11/30/1967 10:00 UTC","Country":"United States"}