{"Log Number":"US-12302008-0006","City":"Houston","Longitude":"-95.36185","map":"<A HREF = \"http://maps.google.com/maps?q=29.766183,+-95.36185(14620)&iwloc=A&hl=en\"> mufon case (14620) map </A>","Date of the Event":"12/29/2008 06:10 UTC","Source":"MUFON","Disposition":"Unknown","Object Features":"None","Tags":"City","Region":"Texas","Object Shape":"Square, Rectagular","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around December 29th 2008"],"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date Submitted":"12/29/2008 06:10 UTC","Country":"United States","Summary":"Driving to pick up the kids and UFO appeared out of nowhere over the freeway.","divs":["Sighting DetailsI was on my to pick up my sisters kids driving along interstate 45 (Gulf Freeway) heading north when an object appeared over the freeway. At first I though it was a helicopter since it had a blue and red light on it and remained stationary. As I got closer i realized the this was no helicopter. Once again I tried to write it off as an airplane since the area I was in was located to a major airport. It never moved. It sat there hovering approximately 300 feet over the freeway and as I drove closer I realized the object was a rectangular shape with only the two lights on it, being that there was no direct light hitting it I could not make out the color, only the shape. The object was in the same direction as the freeway, long ways, and the lights on it were located on the south side of it. The red on the back left and the blue on the back right. Not blinking, not severly bright. At this time I asked my step-son if he saw what I was seeing? He said yeah, what is that? We didn't know what it was? My next instinct was it had to be a UFO! As we drove under it there was no sound no movement! It just hovered there. As I passed the object I kept looking in my mirrors and turning back to look and it still hovered there. As I made exited the freeway, just after passing the object so i could take some photos with my phone, I looked back again it was gone! No sound, no slow drive away, just gone! I couldn't have been the only one to see this thing as I live in a major city and it was right over one of the most heavily traveled freeways in the city? Did anyone else see this object?"],"Latitude":"29.766183","Weather Factors":"None","Case Number":"14620","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/14620.html.txt","/var/www/straped/mufon/org/14620.html"]}