{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Missouri","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Tags":"City","Object Shape":"Unknown","Date Submitted":"12/30/2008 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"14632","Longitude":"-93.284539","Object Features":"Unknown","City":"Springfield","divs":["sighting detailsabout 8 pm i was at my kitchen sink when i noticed lights outside my window-- across the road in a field. at first i thought the were car lights then all of a sudden they flew up over the tree line. then i realized whatever it was had to be one object. then it flew back and forth repeatedly over the path it had came as though it was searching for something and i saw it had a strobe light on the top and a light on the bottom, so there were two lights on the front like \"headlights\", then the strobe and the bottom light. then all of a sudden another set of lights came up over the tree line as the other seemed to be landing. then the first lights shot back up as the other set flew away. the first set of lights seemed to then follow along. i could see them no more after about 45 minutes of watching. then i was back at my sink about 15 minutes later and saw them again above the tree line \"searching\" again. i don't think they were helecoptors because the moved differently than a helecopter would. then they just blinked away into the night toward the east and poof they were gone. i dont have a camera or i would have got proof. but i was really freaked out. whatever they were they were very bright and the strobe was white then blinked orange\\red and the other lights were not blinking but very bright white lights."],"Log Number":"US-12312008-0003","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.215967,+-93.284539(14632)&iwloc=A&hl=en\"> mufon case (14632) map </A>","Disposition":"Hoax","Latitude":"37.215967","Date of the Event":"12/30/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14632.html.txt","/var/www/straped/mufon/org/14632.html"],"Source":"MUFON","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around December 30th 2008"],"Weather Factors":"Unknown","Summary":"2 strange bright blinking lights flying over and around the trees."}