{"Case Number":"14636","Date Submitted":"12/29/2008 12:00 UTC","Longitude":"-117.927017","trends":["There have been 16 other sightings in Newport Beach","There were no other sightings in Newport Beach on or around December 29th 2008"],"Object Shape":"Diamond, Star-like","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Newport Beach","map":"<A HREF = \"http://maps.google.com/maps?q=33.62491,+-117.927017(14636)&iwloc=A&hl=en\"> mufon case (14636) map </A>","Country":"United States","Sighting Duration":"Undisclosed","Region":"California","Source":"MUFON","Date of the Event":"12/29/2008 12:00 UTC","Summary":"Starlike UFO over my house.","Disposition":"Hoax","Log Number":"US-12312008-0007","divs":["Sighting DetailsDecember 29 It was around 10:10 at night and I was coming home from working the night shift. As I got out of my SUV I looked up in the sky and saw a brillant white light craft. It was spinning in the sky and would go up and down. As it went faster and faster, I noticed there were waves in the sky moving away from it and the sky looked like the rainbow effect you see when gas hits a rain puddle. It was unbelievablie beautiful. I watched it for quite some time and could see little blue sparks and gold flecks of light coming out. Then it appeared to explode into color and vanish. I was completely shocked by what I saw and had to just sit there for a few minutes and catch my breath. The next thing I knew, it appeared again. My dog Chief started barking because he was freaked out. This time it looked the same, but after a while, it seemed to change appearance and grow and it looked like a giant rainbow light jellyfish in the sky. It was so pretty. After I watched it for a long time, it finally vanished again. I don't know what that was that I saw, but it wasn't anything I'd ever seen in my life."],"Tags":"City","files":["/var/www/straped/mufon/html2text/14636.html.txt","/var/www/straped/mufon/org/14636.html"],"Latitude":"33.62491","Object Flight Path":"Undisclosed"}