{"Case Number":"14634","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Wisconsin","Viewing Distance":"21-100 Feet, 101-500 Feet","divs":["sighting detailsin november, my sister and another cousin of mine and my grandmother were coming back from madison. we noticed there were cops at every turn around spot in the middle of the highway. like litterally 20, and they were all facing the opposite side. on the horizon i noticed what looked like a large ball of light with tiny blue lights surrounding the outside flashing instantaniously. it was just hovering there moving around here and there but basically just in one area. it was really low too. i don't know if the cops were there for this reason or not, they could have been doing something else, but they were facing the direction of the craft, i found it kind of odd. especially when this ball of light just dissapeared after sitting there for about 15 minutes, all the cops took off in the other direction with their lights on but no sirens. then after the last of the cops were gone there was this huge flash of bluish\\white light everywhere. everyone was like what the hell? we even stopped at a gas station to see if the people there knew anything about it, they didn't, but they also seen the cops and the flash of light, which was about 2 to 3 miles from where we experienced the flash of light. i'm really, really confused about this. it was the craziest thing thats ever happened to me. my cousins and grandma were all in shock too. i'm not scared or anything like that, i just wish i knew what the heck was going on. one thing i do know though, is that these police had to have witnessed this event! i've seen several ufo's outside the town of platteville, wi, where i live. the way they appear and hover and stay for a couple hours make me feel almost inevitably as if they are just watching us."],"files":["/var/www/straped/mufon/html2text/14634.html.txt","/var/www/straped/mufon/org/14634.html"],"Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Latitude":"42.960274","Tags":"City","Source":"MUFON","Summary":"Witnessed a UFO and upon dissapearing there was a ball of light, many witnesses, there were many cops in the area that had to of seen this event.","map":"<A HREF = \"http://maps.google.com/maps?q=42.960274,+-90.130124(14634)&iwloc=A&hl=en\"> mufon case (14634) map </A>","Log Number":"US-12312008-0005","Weather Factors":"None","Object Shape":"Circle, Disc","trends":["There has been one other sighting in Dodgeville","There were no other sightings in Dodgeville on or around November 7th 2008"],"Date Submitted":"11/07/2008 11:35 UTC","City":"Dodgeville","Longitude":"-90.130124","Date of the Event":"11/07/2008 11:35 UTC","Object Features":"Unknown"}