{"Tags":"City","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around September 15th 1984"],"Latitude":"26.649428","Log Number":"US-12312008-0009","Country":"United States","Date Submitted":"09/15/1984 09:30 UTC","Weather Factors":"None","Date of the Event":"09/15/1984 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.649428,+-81.870848(14638)&iwloc=A&hl=en\"> mufon case (14638) map </A>","Sighting Duration":"00:01:15","Longitude":"-81.870848","files":["/var/www/straped/mufon/html2text/14638.html.txt","/var/www/straped/mufon/org/14638.html"],"Disposition":"Insufficient Data","Source":"MUFON","Summary":"Fleet of saucers came over my house.","Case Number":"14638","City":"Fort Myers","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Region":"Florida","Object Features":"None","Object Shape":"Disc","divs":["sighting detailsthis happened sept- dec of 1983 or 84, i was living in labelle, fl at the time, and i have never told anyone about this before----i was in my back yard at night observing the night sky ( i like astronomy--therefore, with my education in it, i knew they were not stars or planets) listening to the high school band playing at a football game. a v-shaped fleet of saucers ( two rows on each side of the v) flew over my head they were moving quite fast, and in a straight line-----there was no sound---nothing, but they were glowing. the v shape was then followed by two smaller round balls of light about 2-to-3 seconds after the main formation came over. total sighting was probably 1-1 1\\2 minutes. i am a firm believer in other forms of intelligent life in the universe, and when i saw this fleet, it was amazing! i thought to myself, come back! don't go!---that was when the two smaller spheres zipped by. i followed them by sight as long as i could until they disappeared out of range. i'm pretty sure of the months and years because my father passed away in 1983, and my mother and i moved into another residence soon afterwards, the dates, i'm not sure of----i know it was getting chilly out, so our winter weather in fl was just starting to show up. my boyfriend played in the high school band, and i was waiting for him to come over after the game. i never did a follow-up about the sighting, or anything else, because i figured people would think i was crazy. i would love to know if anyone else saw this that night."]}