{"Disposition":"Unknown","Latitude":"39.164868","Object Shape":"Disc, Oval, Sphere","Case Number":"14641","map":"<A HREF = \"http://maps.google.com/maps?q=39.164868,+-75.518728(14641)&iwloc=A&hl=en\"> mufon case (14641) map </A>","Country":"United States","trends":["There have been 7 other sightings in Dover","There were no other sightings in Dover on or around May 10th 1994"],"files":["/var/www/straped/mufon/html2text/14641.html.txt","/var/www/straped/mufon/org/14641.html"],"Longitude":"-75.518728","Object Features":"Other","City":"Dover","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Tags":"City","divs":["Sighting DetailsIn the spring of 1994, my husband and children and I were on our way home from an evening church service. It was just about dusk and the sky was cloudy with a spritzing of rain. The temperature was in the upper 60's or low 70's. We were dropping off a church visitor who lived in a small town in Maryland which very closely borders our own home in Harrington, DE. We were on Knife Box Road on the Maryland side near several power lines and a power staion. We witnessed a fleet of UFO's flying in and out of the clouds. They appeared to be flying in an orderly fashion with one group flying towards another group and back and forth. They were irridescent in colors of green, yellow, and maybe white. Motion within motion comes to mind when I do my best to recall how I could describe how they moved. They glided through the sky at speeds that is not possible for man made vessels. We were instantly fearful of being noticed or followed and what ultimately happened next in our lives substantiated our fears. The next three months of our lives presented us with paranormal encounters that would send most into a mental breakdown and maybe even death. Being grounded in faith we survived. At least physically. However, the havoc it played on our family ultimately contributed to our demise as a family unit. Today, I am a private investigator. Investigating and recording the facts is my profession. To pretend I am an expert and authority on the subject of UFO's and abductions would be a huge error of arrogance. But to deny that the information we have to contribute is insignificant would be an even greater mistake. So few are willing to admit to these strange happenings, but being grounded in faith, and blessed with an intense love for truth, makes me an excellent candidate for having suffered these encounters for the purpose of informing others. As a result of these encounters, I am writing a book titled, \"Divide and Conquer.\" Those who have encountered and studied these phenomonon know there is \"nothing new under the sun.\" But with careful examination of the evidence of many, we can become wise to the world we are living in and our eyes may be enlightened to the oppositions that are among us."],"Date of the Event":"05/10/1994 12:00 UTC","Summary":"My husband and I witnessed a fleet of disc shaped UFOs on Knife Box Road on the Maryland side near Denton, MD. They appeared to be flying in formation. They appeared to be motion within motion and were very clearly iluminated with flourescent lights.","Log Number":"US-12312008-0012","Region":"Delaware","Date Submitted":"05/10/1994 12:00 UTC","Object Flight Path":"Hovering then path,Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON"}