{"Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=18.458835,+-66.267668(14645)&iwloc=A&hl=en\"> mufon case (14645) map </A>","Longitude":"-66.267668","files":["/var/www/straped/mufon/html2text/14645.html.txt","/var/www/straped/mufon/org/14645.html"],"Log Number":"PR-12312008-0016","Country":"Puerto Rico","Sighting Duration":"Undisclosed","Region":"","trends":["There have been no other sightings in Dorado","This sighting has been favorited 1 time."],"Weather Factors":"Unknown","Latitude":"18.458835","Date Submitted":"03/01/1983 12:00 UTC","Date of the Event":"03/01/1983 12:00 UTC","Object Features":"Unknown","divs":["Sighting DetailsThis event happened around 25 years ago. I've told friends and family but they remain skeptical at best. First, let me say non of the people involved are reliable witnesses. Why? We were 18 years old and a little bit drunk after a night of dancing at the disco (el coqui) of the Cerromar Beach Hotel. Also, we saw no UFO, just the aliens. The reason I'm telling this story is because I watched the show on the Discovery Channel about Chris Bledsoe and for the first time somebody has described the aliens exactly as we remember them. For what is worth, this is my story. My best friend and I had been drinking at the disco of the Cerromar Beach Hotel until close time (4am). Instead of going directly to our car, we decided to walk around the grounds of the resort and wait until we were in better shape to drive. Not even 10 minutes after, we were walking down a slope and suddenly, out of the bushes (40 to 50 feet in front of us), came two figures right into our path. These figures were of normal height but dressed, from head to toe, in what seemed to be a silver suit out of a sci-fi movie from the 50's. \"That is one of the multiple reasons our story is so hard to believe.\" Except for the red eyes (which I don't particularly remember) and the height, they were EXACTLY the same as the image of the alien rendered in the Discovery show. My friend and I looked at each other to make sure we were both seeing the same apparition and then looked back at the \"aliens\". Finally, we looked back at each other and my friend, in drunken stupor yelled - \"Aliens, lets kill them!\". Yes, it wasn't the most friendly of greetings but to our limited defense, we were two drunken 18 year olds graduating from a Military Academy during the 80's, which wasn't one of the most peaceful times in our history. After screaming our welcoming statement, we went on pursuit of the aliens to perform the first interplanetary lynching by an ignorant and drunken mob. I guess they were as perplexed as we were since they just looked at us and didn't move until we were about 10 feet (more or less) from them. Suddenly, they reacted and started running. They took off trough the same bushes they came with us right behind. At this time, I was on the lead about 5 feet from the last individual. I could almost grab him with my arm. In fact, that is exactly what I was trying to do. After coming out of the bushes on the other side, they made a left. On the other side of the bushes there was an open field with at least a 50 meter clearing. Me and my friend still right behind, lost the figures from view for no more than 1 second. After coming to the other side the aliens where gone. There is no way in hell you could suddenly loose somebody running that close. But when we entered that field, they had just disappeared. We looked around but found no trace of them. And we had been left with a mystery in our hands. Up to this day, my friend doesn't discuss the event with anybody for fear of being ridiculed, I don't blame him. He even gets exasperated when I bring it up. I guess I was exited when I watch the show and finally saw somebody that had seen the same aliens we saw and not the \"normal\" gray ones with big heads and big black eyes aliens. Something about missing time, we finally got to our car about 6 - 6:30am (daytime). I have no idea if we really missed and hour or two, or simply got distracted given the events. But when we encountered the aliens it was night and when we arrived at the car it was day. Something else, don't ask me why (because I don't know), but I'm sure they were aliens. I know this story don't amount to much, but I wanted to thank Chris Bledsoe for coming forward with his story. I know it has helped me, or at least made me feel less crazy."],"City":"Dorado","Case Number":"14645","Source":"MUFON","Summary":"Brief contact with 2 aliens.","Object Shape":"Unknown","Object Flight Path":"Other","Viewing Distance":"20 Feet or Less"}