{"Log Number":"US-12312008-0015","City":"Branson","Date Submitted":"10/23/2008 02:12 UTC","files":["/var/www/straped/mufon/html2text/14644.html.txt","/var/www/straped/mufon/org/14644.html"],"divs":["Sighting DetailsI was driving west with my mother on Highway 465, approximately five miles northwest of Branson, Mo. Nearest intersection: Hwy 465 and Hwy 76. I glanced towards the northwest at a 45 degree angle and noticed an object suddenly appearing. I didn't think it could be an airplane because it just suddenly was there, with a clear sky. It was highly reflective and traveling from the northeast to southwest. I would estimate it being 2000 feet up and disc shaped-thirty-five to forty feet in diameter. I watched it for ten seconds before it became darker and began \"peeling\" layers off it's outer rim counterclockwise. Looked like three feet was systematically being stripped away. This happened for five seconds before it, growing smaller, disappeared completely. I still wonder if this behavior was a \"cloaking\", or if the object was folding in upon itself. For three weeks afterward I experience \"distorted\" time. That is, one week felt like five! Highway 465 is seldom used and was nearly vacant when we where traveling on it that Thursday afternoon. This is not the first sighting around Branson area I've had. Three weeks later, after slowly recovering from my time distortion, I read about the Stephenville, Texas sighting, also on October 23, and I wonder if what I saw, somehow related?"],"Disposition":"Unknown","Object Shape":"Disc","Tags":"City","Country":"United States","Date of the Event":"10/23/2008 02:12 UTC","Object Flight Path":"Straight-line path","Object Features":"Dome","Weather Factors":"None","Latitude":"36.650183","Longitude":"-93.217424","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.650183,+-93.217424(14644)&iwloc=A&hl=en\"> mufon case (14644) map </A>","Source":"MUFON","Case Number":"14644","Region":"Missouri","Summary":"Disc moved from N.E. to S.W. changed color and shape became smaller then disappeared.","trends":["There have been 13 other sightings in Branson","There were no other sightings in Branson on or around October 23rd 2008"],"Sighting Duration":"Undisclosed"}