{"Tags":"City","Country":"United States","Disposition":"IFO","Viewing Distance":"Unknown","Latitude":"32.226953","Date of the Event":"12/29/2008 08:00 UTC","Date Submitted":"12/29/2008 08:00 UTC","Region":"Arizona","Longitude":"-110.922499","Case Number":"14642","Log Number":"US-12312008-0013","City":"Tucson","Object Features":"Unknown","Source":"MUFON","Summary":"Multiple pulsing color changing lights around sky.","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=32.226953,+-110.922499(14642)&iwloc=A&hl=en\"> mufon case (14642) map </A>","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/14642.html.txt","/var/www/straped/mufon/org/14642.html"],"Weather Factors":"None","divs":["Sighting DetailsThe first night my mom was letting our dogs out the back door looking towards our horses when she saw a pulsing and color changing light in the NW sky towards Phoenix, just above our tree. She thought it was a very close plane, but then noticed it never moved. After getting out the binoculars and looking closer she saw a second one in the same area. I came over and looked at them through the binoculars and could see red, white or blue, green and yellow lights pulsing and changing on the first one. I tried to take a picture with my digital camera and nothing came out,though I could see it on the screen. We watched for 20 minutes or so and then stopped and got ready for bed. We were stumped as to what it could be. About 10 minutes later my mom checked the back door making sure it was locked and they were gone. The next night about 7:30 pm we looked to see if we could see them again and saw the same thing but higher. Again we looked at it through binoculars and could just see changing lights in a circular shape, but I noticed the red lights seemed to move around the circle of color changing light that was white, blue and yellow. But the binoculars are not great so the object was blurry. My mom started looking in the sky further and saw a total of 6. I looked at them too, the other 5 were smaller and located around the night sky. The first one was in the same area only higher. My husband, who is a truck driver, was 100+ miles to the north and west saw the bigger one and saw the color changing. We were on the phone for about 5 minutes looking at it and trying to figure out what it was. The time we were looking at it and discussing it seemed to take half an hour, but it was only a few minutes. Again we were stumped as to what they were. I suppose it could have been satellites, but I never noticed anything like them before out here. I have seen lights that seem to pulse or blink, but not like this. I looked in the news reports and there was nothing reported about them."],"Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around December 29th 2008"]}