{"Case Number":"14648","map":"<A HREF = \"http://maps.google.com/maps?q=35.174241,+-84.653547(14648)&iwloc=A&hl=en\"> mufon case (14648) map </A>","Object Features":"Unknown","trends":["There have been no other sightings in Benton","This sighting has never been favorited."],"Object Shape":"Cigar, Disc, Oval","Date of the Event":"12/31/2008 01:45 UTC","Tags":"City","Summary":"There were two disc shaped , bright, objects that appeared in the sky. They hovered for a bit and one zipped off to the south and the other went west. There were two smaller ones that appeared in the same spot and then went west.","Source":"MUFON","City":"Benton","Log Number":"US-12312008-0018","Disposition":"Unknown","Latitude":"35.174241","Weather Factors":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14648.html.txt","/var/www/straped/mufon/org/14648.html"],"Region":"Tennessee","Country":"United States","Date Submitted":"12/31/2008 01:45 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was sitting on my back porch at approximately 1:45 pm on Dec. 31, 2008.I observed two large objects in the sky moving from north to south very slowly. At first I thought they were two aircraft but while watching them they stopped for approximately ten seconds and didn't move. One of the objects appeared to be a little larger than the other one. The objects appeared to be disc shaped and were very bright , don't know if it was a reflection from the sun or if it was the color. These objects came from over the top of my house and then out into the open. They appeared to be maybe six or seven thousand feet up , they were very big.After they had sat there for about ten seconds, the larger one started to move south very slowly then after moving maybe a quarter of a mile, it zipped away unbleievably fast toward the south. There was no sound that I could hear. It was gone in the matter of a second. The other shape moved the same direction as the first for about the same distance and then zipped to the west, southwest at the same incredible speed. I grabbed the phone to call my brother who lives in the next county up to tell him what I had seen. I was on the phone approximately one minute with him. After hanging the phone up I sat there for another minute and looked back up into the sky and there were two smaller starlike abjects in the same spot as the others. They were very bright and shiny and a lot smaller than the other two objects were. They sat there for about ten to fifteen seconds and then zipped away to the west, southwest. They didn't really move they zipped, I don't know how else to describe how quickly they moved. There is nothing I know of on this earth that can move that quickly with no sound at all. That is the last I saw of them.I did not have time to get video of this event. Thank you for listening"],"Longitude":"-84.653547","Object Flight Path":"Path then hovering"}