{"Summary":"My father and I saw a UFO hovering in mid-air while driving on the Long Island Expressway at 7:40AM, on 10/24/08, in Queens, NY.","Date Submitted":"10/24/2008 07:40 UTC","Disposition":"Insufficient Data","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering,Other","Date of the Event":"10/24/2008 07:40 UTC","divs":["sighting detailson october 24th, 2008, at about 7:40am, my father and i were driving westbound on the long island expressway on our way to work. we were in the queens, ny area of the expressway. at this time, the sun was already out, and the sky was completely viewable. we were at about exit 19, which is the queens blvd. exit. airplanes typically travel above this area, sometimes fairly low to the ground, since both la guardia airport and kennedy airport are located near by. i looked up into the air in front of our car and remember seeing a dark-gray (almost black), chrome looking object\\craft no more than 40-50 stories in the air. it was hovering mid-air, very slowly traveling east as we were traveling west. it was also simultaneously rotating slowly as it floated. we were probably going about 30-40mph, so we were going towards the object relatively quickly. the only way for me to describe its shape is that it sort of looked like a 3-dimensional \"m\". the object had very pointy features, and had 2 or 3 legs that protruded downward from what i can remember. i realized that it was not a plane and asked my father, \"what is that?\" he too, looked up, slowing down the car a little bit so he could get a good view. he didn't know what the object was either. by the time 30 seconds had passed, our car had already passed under the object, and it was behind us. it still remained in the sky, and i watched it for as long as a i could through our car's sun roof. i did not have a chance to capture a picture of the object (not even with my cell phone) which is something i deeply regret. however, we did notice other drivers breaking in front of us as well, so i only hope that others witnessed this same object. i have attached a 2-dimensional sketch of what the object looked like. once again, it occurred on october 24th, 2008, at about 7:40am, in queens, new york."],"Weather Factors":"Unknown","Sighting Duration":"00:01:00","Longitude":"-73.856609","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 24th 2008","This sighting has never been favorited.",""],"City":"New York","Source":"MUFON","Object Features":"Appendage(s), Other","Log Number":"US-12312008-0011","Region":"New York","Object Shape":"Diamond, Other, Unknown","Case Number":"14640","Latitude":"40.73955","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/14640.html.txt","/var/www/straped/mufon/more/14640_submitter_file1__UFOSighting.jpg","/var/www/straped/mufon/org/14640.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.73955,+-73.856609(14640)&iwloc=A&hl=en\"> mufon case (14640) map </A>","Tags":"City"}