{"Log Number":"US-12312008-0021","Date of the Event":"12/31/2008 05:35 UTC","Case Number":"14650","trends":["There have been 2 other sightings in Libertyville","There were no other sightings in Libertyville on or around December 31st 2008"],"Summary":"Fixed triangular light formation. No apparent movement. Azimuth of 205. Elev. 25. Seen longer than 20 mins.","Object Flight Path":"Undisclosed","Longitude":"-87.94458","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14650.html.txt","/var/www/straped/mufon/org/14650.html"],"City":"Libertyville","Country":"United States","Object Shape":"Triangle","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.288549,+-87.94458(14650)&iwloc=A&hl=en\"> mufon case (14650) map </A>","Date Submitted":"12/31/2008 05:35 UTC","divs":["Sighting DetailsI went out on my patio for a smoke at about 1730 hrs. Patio in on south side of my house in the St. Mary Woods section of Libertyville Township.Temperature was about 20 F. Night was clear. Moon was partial and easily seen. It looked like the triangular formation I had seen this past October at an azimuth of 170, elev 30. I observed the formation for about 10 minutes and asked my wife to come out to look at the formation. She came out after putting on her coat. I pointed out to her where to look. She saw nothing unusual about a \" large \" star.It's now 1800. I'm going out again to see if it's still there. I don't drink and don't discount any other reports on this phenomenon even though iit's New Year's eve. It's still up there. A commercial flight passed under and to the south of the formation ( probably from O'Hare.) The formation was triangular with not less than three bright lights . Altitude of the formation could not be determined Distance from the observer could not be determined.No sound or other anamoly was noted. Size of the formation could not be accurately estimated.It was not a weather balloon, lenticular cloud formation, migrating bird group,sunset reflection, or any other BS explanation. I am a retired US Army Artillery Officer and a graduate Architect. My location is 1 mile west of I-94 and 1000 ft south of IL Rte 176"],"Region":"Illinois","Disposition":"IFO","Source":"MUFON","Weather Factors":"None","Latitude":"42.288549","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}