{"Case Number":"14653","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi was driving on belfast road at around 8 o'clock at night on 12\\31\\2008. i noticed a very bright light travelling west to east and it was very close to the tree line. at first i thought it was an airplane but the light was so bright and solid, not flashing like an airplane does. because i am a little bit of a nerd i stopped my car and rolled down the window and i couldnt hear any engine noise. at that point i started to think that it was something more than an airplane. i started driving again when the light changed directions and started heading south. . . almost where i was. i got very nervous about what this light was and decided to hightail it to my boyfriends house. when i got to his house which is less than a 1\\4 mile from where i saw the light it was nowhere in the sky. very strange. . ."],"Source":"MUFON","Date of the Event":"12/31/2008 08:00 UTC","files":["/var/www/straped/mufon/html2text/14653.html.txt","/var/www/straped/mufon/more/14653_submitter_file1__MapRosieHumphries14653.jpg","/var/www/straped/mufon/more/14653_submitter_file2__AerialMapRosieHumphries14653.jpg","/var/www/straped/mufon/org/14653.html"],"Longitude":"-84.287982","Object Flight Path":"Path with directional change","Summary":"I was driving and saw a very bright light in the sky but it was very close to the tree line, no noise, just a bright light. changed directions and so did I!","map":"<A HREF = \"http://maps.google.com/maps?q=39.181948,+-84.287982(14653)&iwloc=A&hl=en\"> mufon case (14653) map </A>","Disposition":"Unknown","Region":"Ohio","City":"Milford","Tags":"City","trends":["There have been 6 other sightings in Milford","There were no other sightings in Milford on or around December 31st 2008","This sighting has never been favorited.",""],"Log Number":"US-12312008-0024","Object Features":"None","Object Shape":"Circle","Latitude":"39.181948","Date Submitted":"12/31/2008 08:00 UTC","Country":"United States"}