{"Date Submitted":"10/17/2006 12:00 UTC","Case Number":"14652","Disposition":"Unknown","City":"Joliet","Object Features":"Unknown","Date of the Event":"10/17/2006 12:00 UTC","Object Shape":"Diamond","Log Number":"US-12312008-0023","trends":["There have been 12 other sightings in Joliet","There were no other sightings in Joliet on or around October 17th 2006"],"Source":"MUFON","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/14652.html.txt","/var/www/straped/mufon/org/14652.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.531921,+-88.076645(14652)&iwloc=A&hl=en\"> mufon case (14652) map </A>","divs":["Sighting DetailsI saw your show on Discovery today. This happened two years ago and this is the first time I am reporting it. My story is not as amazing as the story I saw today, but I did see a UFO and had two other people with me when I saw it. I was at home. A light hung in the sky for a long period of time. Then began to move closer. The object was a diamond shape with red and white lights. It moved \"floated\" across my back yard with no sound. The object was aprox. 10 to 15 foot in lenght. The object came within 100 foot of me. I was excited. I kept asking my brother if he sees it. We followed \"ran\" after the obect for three blocks and we lost sight of the object. When we, my brother and I, came back to the house we were still looking toward the sky talking about what we just saw. We then saw a red streak go across the sky and it was gone. If you would like more information please feel free to call me. I did see this object. It's funny, I find myself looking at the night sky differently now then I did before this event. Thank you for your time."],"Latitude":"41.531921","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Weather Factors":"Unknown","Region":"Illinois","Longitude":"-88.076645","Summary":"I saw a diamond shape object flying \"floating\" in the air."}