{"Case Number":"14651","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=52.371306,+4.902038(14651)&iwloc=A&hl=en\"> mufon case (14651) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Longitude":"4.902038","Date of the Event":"12/31/2008 11:15 UTC","Summary":"At least three red sphere like objects moving slowly through the sky.","Region":"Noord-Holland","Object Features":"Undisclosed","Latitude":"52.371306","Log Number":"NL-12312008-0022","Source":"MUFON","Country":"The Netherlands","City":"Amsterdam","divs":["Sighting DetailsIt is the last day of the year, the time is 0:15. As I'm sitting inside watching the fireworks outside I see to my left in the sky a red spherical object moving slowly upwards in an arch. As I see it I thought it was a flare or some kind of projectile, but as I keep watching the thing keeps moving upwards slowly. It did not slow down or speed up. It did not have smoke behind it. It did not flicker. As I keep watching it it moves higher and to the north slowly (eventually disappearing from sight). Then I watch again to the left and I see another one coming and going the same way. And one more. This one had the same distance to the second one as the second one had to the first. When I realised the first one wasn't fireworks I started to run for my camera, but the crappy thing was completely unable to make a decent night time photograph. My small binoculars also were unable to discern specifics. All three of these objects traversed half of the visible sky. About 15 minutes later another one (or one of the same) comes this time from the north west side going straight and when about in one line with me goes north again. At this point the sky becomes so filled with smoke from all the fireworks the objects become harder to see when they are far away. At 0:45 again I was able to spot one coming and going the same way followed by another a few minutes after. Over the next 30 minutes I saw about five more. Some coming from the west others from north-west. Two of them were going almost side by side. Interestingly I had the idea before the sighting what this party would look like from the sky and how possible observers would experience it. The first picture shows two coming up from the west, but unfortunately I moved my hand. The second shows one going up coming from the west."],"Tags":"City","files":["/var/www/straped/mufon/html2text/14651.html.txt","/var/www/straped/mufon/more/14651_submitter_file1__HPIM0227.JPG","/var/www/straped/mufon/more/14651_submitter_file2__HPIM0221_crop.JPG","/var/www/straped/mufon/org/14651.html"],"trends":["There have been 8 other sightings in Amsterdam","There were no other sightings in Amsterdam on or around December 31st 2008","This sighting has never been favorited.",""],"Date Submitted":"12/31/2008 11:15 UTC","Object Shape":"Sphere","Weather Factors":"Unknown"}