{"Log Number":"US-01012009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=30.23021,+-92.018043(14665)&iwloc=A&hl=en\"> mufon case (14665) map </A>","Viewing Distance":"Over One Mile","Latitude":"30.23021","Longitude":"-92.018043","files":["/var/www/straped/mufon/html2text/14665.html.txt","/var/www/straped/mufon/org/14665.html"],"Summary":"8 objects moving as a group across sky.","Disposition":"Unknown","trends":["There have been 7 other sightings in Lafayette","There were no other sightings in Lafayette on or around December 31st 2008"],"Tags":"City","City":"Lafayette","Region":"Louisiana","Object Features":"Unknown","divs":["Sighting DetailsAt midnight on New Year's Eve of 2008, we went outside our home in Sunset, Louisiana to see the local fireworks display. As we looked to the southwest, we saw a cluster of 3-4 lights moving across the sky towards the northwest. They looked more like planets than stars and were orangish-red in color. Following behind were 4 more single lights following as a tail. They moved in a steady stream. We knew they couldn't be airplanes because they didn't blink and they were too close together. We thought they could possibly be military helicopters but we couldn't hear any sound from them. We were hoping they would travel directly over us so we could get a better sighting, but they were still at a distance. We tried to take photos, but our camera couldn't zoom close enough to get a good picture due to the darkness and street lights. Never before had we seen anything quite like it, and we were excited to get a better look. Therefore we decided to get in the car and see if we could follow where the lights were headed, because we were losing sight of them due to the treeline. We drove along the interstate where the horizon was most open for viewing, but we never saw the lights again."],"Date Submitted":"12/31/2008 12:05 UTC","Date of the Event":"12/31/2008 12:05 UTC","Object Flight Path":"Straight-line path","Case Number":"14665","Source":"MUFON","Object Shape":"Star-like","Weather Factors":"None","Sighting Duration":"Undisclosed","Country":"United States"}