{"trends":["There has been one other sighting in La Oliva","There were no other sightings in La Oliva on or around January 1st 2001"],"Latitude":"28.633312","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/14661.html.txt","/var/www/straped/mufon/org/14661.html"],"Region":"Canarias","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=28.633312,+-13.902712(14661)&iwloc=A&hl=en\"> mufon case (14661) map </A>","Log Number":"ES-01012009-0007","Case Number":"14661","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Country":"Spain","Date Submitted":"01/01/0001 05:30 UTC","Sighting Duration":"01:00:00","Date of the Event":"01/01/2001 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsI went outside at 5.30am to let the cat out and noticed 2 oval misty white lights in the sky to the west side of Escanfraga mountain.At first the lights were very bright so I called my husband who stood watching with me.The cloud cover was high and thin and these lights were behind the clouds zig-zagging around together.They definately were not planes, we have an airport 45 minutes away, nor were they anything we have ever seen before.It was impossible to judge the hight as it was dark but they looked very big and changed direction in a flash.They looked like search-lights without the beam and not as bright,nor were there any other lights around them, just stars and the light cloud cover.We were amazed but thrilled as we are avid UFO believers and have seen several odd things in the sky here but never anything like this.We hope they were real and cant think of anything else they could have been.We eventually went up to our roof terrace and watched from there for another 15 minutes or so.The lights seemed to be playing with eatch other moving together then apart and becoming a single one at times.They started to fade and eventually after observing them for a good hour they disappeared.I took some photos and have something on one of them but cant be sure whether I have captured a photo of something and what I have is not a star as these can be seen in the photo. We are definately going to watch for them again tomorrow morning at the same time and will get in touch with you if we see anything.I hope this information is useful to you. Barbara"],"Disposition":"Unresolved","Tags":"City","Longitude":"-13.902712","Object Features":"None","City":"La Oliva","Summary":"2 glowing dics shaped lights randomly flying together over my house."}