{"Region":"California","files":["/var/www/straped/mufon/html2text/14666.html.txt","/var/www/straped/mufon/org/14666.html"],"Object Flight Path":"Stationary,Straight-line path,Path then hovering","Log Number":"US-01012009-0012","Weather Factors":"Fog","Date Submitted":"12/31/2008 11:58 UTC","Tags":"City","Object Features":"None, Unknown","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-116.955087","trends":["There have been 41 other sightings in El Cajon","There were 2 other sightings in El Cajon on or around December 31st 2008"],"Case Number":"14666","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Sphere, Star-like, Unknown","Date of the Event":"12/31/2008 11:58 UTC","divs":["Sighting DetailsIn san diego, califonia, New Years Eve. About 2 mins before the new year, i stepped outside onto my patio to smoke a cigarette, it was a very clear sky. and i was facing roughly West. Immediatly i noticed off to the West a VERY Bright red ligh in the sky, so far away i thought maybe a satellite or a flare... it was that bright.. looked like the intensity of a red laser light. When i first saw it, i lined it up with the stars around it, so i could judge if it was moving. didnt seem like it, for the first minute. then it started moving, barely noticeable. It took it about 10 mins, before it was to the left of me, and almost overhead. It was moving East South East, from my guess. I went outside in the parking lot so i could continue to track it. there were about 5 other witnesses, the light would change intensity, rarely. when it was directly south of me, and right over this palm tree i was using to judge its movment, it stopped. stood there for probably a solid 5 mintutes. Then it totally dimmed and then disappeared. Ive looked online, i havent seen anyone mention it.. there had to be alot of eyes in the skies at midnight.. HAVE YOU HEARD ANYTHING?? can you get back to me with links if you have.. I mean if it was a satellite it would be constantly moving, right? Curiously, Ralph Dalessandro ralphdalessandro@gmail.com any photo i would of taken would of looked like a laser light dot on the sky. didnt bother with still photos. By the way, i was totally sober"],"Disposition":"IFO","City":"El Cajon","Source":"MUFON","Latitude":"32.801043","Summary":"Variable speed, variable brightness red light, so far, looked like a star/satellite.","map":"<A HREF = \"http://maps.google.com/maps?q=32.801043,+-116.955087(14666)&iwloc=A&hl=en\"> mufon case (14666) map </A>"}