{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14660.html.txt","/var/www/straped/mufon/org/14660.html"],"Disposition":"Unresolved","Summary":"4 objects above Stockholm move in identical pattern 7 minues apart including a 90 degree turn.","divs":["sighting detailslooking to the west of my location i noticed 4 objects apear over the crest of a hill. they apeared one at a time at 7 minute intervals heading in an easterly direction. each object came to a halt and then changed direction 90 degrees clockwise (from a westerly heading to a southerly heading). as each object aproached this point in the sky, it also stopped and changed direction 90 degrees. each object then proceeded to slowly move in a southerly direction towards the station in kallhall. when it was still above the skyline, it seemed to disapear. the 3 following objects then did exactly the same when they got to this point. each object was identical and had a red glow with a slight yellow\\orange tint. the light it was emitting was a static soft glow, it did not flash, pulse, or seem to increace\\decrease in brightness. from my vantage point each object looked about the same size as a 6 wheel lorry, but was spherical or eggshaped. i could not see any outline of the object as the light that was emitted was a soft glow. over the 30 minute duration of my seeing these objects in the sky, their speed changed vastly from very slow to extremly fast. i could not hear any noise coming from the direction of the object."],"Longitude":"18.07314","Viewing Distance":"Unknown","City":"Stockholm","trends":["There have been 4 other sightings in Stockholm","There were no other sightings in Stockholm on or around December 31st 2008"],"Sighting Duration":"00:30:00","Object Shape":"Disc, Egg","Region":"Stockholm County","Date Submitted":"12/31/2008 11:50 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","Tags":"City","Latitude":"59.33746","Country":"Kingdom of Sweden","Date of the Event":"12/31/2008 11:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=59.33746,+18.07314(14660)&iwloc=A&hl=en\"> mufon case (14660) map </A>","Log Number":"SE-01012009-0006","Object Features":"Undisclosed","Case Number":"14660"}