{"Latitude":"39.170815","Summary":"Three red lights in a line that changed to a rough triangle and then to a straight line.","Viewing Distance":"Unknown","Date Submitted":"12/31/2008 07:57 UTC","Date of the Event":"12/31/2008 07:57 UTC","files":["/var/www/straped/mufon/html2text/14667.html.txt","/var/www/straped/mufon/org/14667.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.170815,+-86.519386(14667)&iwloc=A&hl=en\"> mufon case (14667) map </A>","divs":["Sighting DetailsI was looking at the night sky outside my apartmen as I do every evening looking at the stars. As I turned to look towards the North East direction to see if I could spot the Ursa Major constellation, I noticed some lights moving in very fast from NE going towards SW. I am used to looking at the night sky and can easily make out an aircraft with its blinking red blue and white lights or helicopters which are not uncommon over the city of Bloomington on some nights. These three red lights, probably the sixe of a quarter (coin)were in a straight line and from where I was standing on the ground outside my apartment, appeared strung out with the distance between the first and the last light being about a yard. All three lights were circular and were dull red in color, and the edges of the lights were fuzzy as if the light was diffusing around them. I watched them come over to the spot where I was standing and there was no noise or sound of any kind. Just as I turned towards South West to keep them in view, the light in the middle moved to a side, making the three lights appear in a triangular formation. The next second the light in the middle moved back into position in the straight line and the last one, the third from the front, moved a little to the right (the right of their flight path) and then moved back into a straight line position. The absence of noise we associate with a flying object such as an aircraft or helicopter was spooky, and the lights disappeared into the haze of city lights. The whole event lasted about 8 seconds. The lights moved really fast, as if they were gliding without any resitence and the absence of any noise was striking. As soon as I lost sight of them I called my wife to tell her about the lights I also tried to contact the Bloomington Herald Times but their offices were closed and I was not sure if I could, or should contact the local airport to find out if they had any reports of the lights or similar lights from others or if their radar caught something. There were three other reguloar aircraft in the sky at the time when I lost sight of the three red lights. The red lights moved towards SW and one aircract was moving from NW towards South and another in the opposite direction. There was also another aircraft moving on the North Eastern horizon when I first saw the lights. I am a trained journalist and I am absolutely certain that what I saw was not a conventional aircraft or a helicopter."],"City":"Bloomington","Object Features":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Case Number":"14667","Longitude":"-86.519386","trends":["There have been 12 other sightings in Bloomington","There were no other sightings in Bloomington on or around December 31st 2008"],"Disposition":"Insufficient Data","Tags":"City","Region":"Indiana","Log Number":"US-01012009-0013","Source":"MUFON","Object Shape":"Other","Country":"United States"}