{"Object Features":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsThis event took place somewhere in a area bounded by Pensacola Fl, Gulf Breeze FL, Gulf Shores AL, Fairhope Al, Brewton FL and Milton Fl. I was a fledging Naval Aviator at the controls of a T34-C on a training flight with an instructor in the back seat. Incidentally, I went on to fly thousands of hours in carrier-based jets and civilian aircraft. This was the only time in all of my flying (civilian or military) that I saw anything I considered \"unidentified\" and \"flying.\" This event took place in daytime VFR flight conditions on top of a broken layer of clouds with excellent visibility. The image of this event remains clear in my memory. Other specifics are a little sketchy... We were in straight and level flight somewhere between 4,000 and 8,000 feet MSL when I spotted a silver sphere ahead of us. It appeared to be moving in the opposite direction of our flight path (if moving at all) and maintaining its altitude. We took the object down the left side of the aircraft. I kept sight of it until it was behind my airplane and out of sight. Our speed was probably around 200 KTS. The object if moving could not have been going too fast. I estimate our separation at 500 feet laterally and 200 feet above vertically. The incident was really uneventful. I was afraid to say anything, to make any kind of issue of it as I was but a young officer and could afford little if any ridicule or extra \"visibility.\" I did mention the \"traffic\" to the instructor who acknowledged he had sight. Neither of us spoke of it again. I think he said at the time, \"I wonder what that was?\" Had I been on a solo flight, I would have maneuvered the aircraft and conducted my own investigation as the object was so intriguing and unusual. For a second, I thought maybe the object was a balloon, but we operated in well-known, well defined areas and knew of all obstacles and obstructions to flight - and it did maintain its altitude. The incident to me was just bizarre. It made me feel curious and interested. Why report this now? I have seen a TV show by or about MUFON and see that I am not the only person who has seen something like an unexplained \"orb.\" So, hey, why not put in my two cents? Who knows, maybe it will help someone put together a bigger and more comprehensive picture of these types of sightings?"],"Object Flight Path":"Undisclosed","Tags":"City","City":"Pensacola/Gulf Breeze/Mil","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Country":"United States","Case Number":"14674","Weather Factors":"Unknown","Date Submitted":"07/01/1988 12:00 UTC","trends":["there have been no other sightings in pensacola\\gulf breeze\\mil","This sighting has never been favorited."],"Object Shape":"Sphere","Region":"Florida","Latitude":"27.669057","Log Number":"US-01012009-0020","Summary":"Silver, metallic-looking, sphere, 24-48 inch diameter, smooth. (CMS/sg)","Date of the Event":"07/01/1988 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.669057,+-81.507114(14674)&iwloc=A&hl=en\"> mufon case (14674) map </A>","files":["/var/www/straped/mufon/html2text/14674.html.txt","/var/www/straped/mufon/org/14674.html"],"Longitude":"-81.507114"}