{"Object Features":"Undisclosed","Object Shape":"Triangle","Country":"Canada","files":["/var/www/straped/mufon/html2text/14677.html.txt","/var/www/straped/mufon/org/14677.html"],"Case Number":"14677","Weather Factors":"Unknown","Tags":"City","Disposition":"Unresolved","Longitude":"-85.313954","Date Submitted":"03/27/2006 09:40 UTC","Sighting Duration":"Undisclosed","trends":[],"Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.262625,+-85.313954(14677)&iwloc=A&hl=en\"> mufon case (14677) map </A>","Object Flight Path":"Undisclosed","Log Number":"CA-01012009-0022","Latitude":"51.262625","Date of the Event":"03/27/2006 09:40 UTC","City":"Undisclosed","divs":["Sighting DetailsI went into the backyard to take my dog out. I was walking around near the back fence when I looked up at the sky, it was dark out so all I could see were stars. As I continued looking up, I saw what appeared to be a satelite moving to a new location, so I stood there watching. I also thought it could have been a plane I guess, but then relized it was blocking out the other, so I looked closer realizing there were three lights on the object at each corner of what seemed like a triangular shape. The object was black in colour, but that too could have been because it was night. The object was following the street called Hwy 2, right behind the house, it was approximately 200' off the ground and emitting absolutely no noise whatsoever. I watched it for as long as I could, it wasn't moving fast at all, maybe 15-30mph. I noticed no windows or other lights of any kind, and the sky was completely clear that night. I know it wasn't a plane, helicopter or anything else man made. It didn't scare me, I just wish I had a video camera to have tried to capture it. I don't care if anyone believes me, I know my girlfriend didn't, but what I would like to know, is there anyway of getting radar reports of that night to verify that something indeed was there, because I know there was. Thanks Paul"],"Summary":"At first sight I thought I saw a moving satelite, but it blocked out the other stars.","Region":"Ontario"}