{"Disposition":"Unresolved","City":"Bandar Seri Begawan","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=4.890278,+114.942222(14671)&iwloc=A&hl=en\"> mufon case (14671) map </A>","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was going for my photo assignment during the new year eve, heading towards a resort hotel to cover the fireworks display. I position myself at a Tungku Beach facing the hotel from far so that I can frame the fireworks and the hotel all in one frame. When i was there and the fireworks started I started firing shots with my camera using a cable release connected to my Canon EOS 5D digital camera + Canon 70-200MM F2.8 IS (L) lens and a Manfrotto tripod stand. The firework started exactly 12.00AM (+0800GMT) at The Empire Hotel and Country Club. The fireworks lasted for about 20-30 minutes. Without checking my LCD screen on my camera as most of the shots were burst frames, I left the area. When i was processing the RAW images (not jpeg files) captured from the camera i realise there was one shot which had something appearing on the left side of the screen so I zoomed in to see what it was. I was shocked! In the image, the object seemed to be hovering above the water and it looks as if it's not too far away from us. Strangely...the object wasn't being seen with my naked eye when I was there. Thousands of people gathered around the same area to view the fireworks. If i were to see it with my eyes, probably the others would have saw it too however it wasn't visible as it was quite dark from our view. Or maybe... our eye were drawn towards where the fireworks were so I didn't notice it as it seems like the object positioned itself at a darker area (can be seen in the photo). * I have attached the JPEG and the RAW version of the file for your investigation. Please credit my name if you were going to use it for any purpose. * All original data are embedded in the exif of the images. Feel free to check it. The time stamp in the exif is not right, kindly ignore that as the camera time wasn't set properly."],"Latitude":"4.890278","Date of the Event":"01/01/2009 12:15 UTC","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14671.html.txt","/var/www/straped/mufon/more/14671_submitter_file2__empirehotelandcountryclub_0001.JPG","/var/www/straped/mufon/org/14671.html"],"Object Shape":"Disc","Log Number":"BN-01012009-0017","trends":["There have been no other sightings in Bandar Seri Begawan","This sighting has never been favorited."],"Viewing Distance":"Unknown","Case Number":"14671","Weather Factors":"Unknown","Country":"Brunei Darussalam","Sighting Duration":"00:00:08","Longitude":"114.942222","Date Submitted":"01/01/2009 12:15 UTC","Region":"Brunei-Muara","Summary":"A stange object appeared in the night sky during a firework photo assignment on new near eve covering for the newspaper (Borneo Bulletin)."}