{"divs":["Sighting Detailsmy friend Kim and I were riving on hwy 13 out of warrensburg, Mo. and about two miles out of town we both spotted a huge round object with flashig white lights following us to the right side of the vehicle. I yelled at my friend to stop the car and reluctently, she pulled over to the right side of the road. I am a proffesional photographer, so I had to see this thing and try to get a picture! When kim stopped the car. it stopped in mid air and just hovered still, there was no noise at all, it just stood still and flashed its white lights on and off about every 3 seconds. It was about 500 feet in the air and was about the size of a building. Because it flashed on and off it was hard to get a clear photo of it but I did get photos of the object. Kim was scared out of her mind and I was getting a little scared myself. We got in the car and pulled off down the highway, I looked behind me and saw it was still thewre standing still and flashing. While we were there we also saw another object that lookedlike a big ball of fire with a bright trail of light and it suddenly dissapeared. I will send photos after finding out how to copyright them or after you calling me."],"Disposition":"Unknown","Date Submitted":"12/31/2008 06:30 UTC","Object Shape":"Circle, Fireball, Flash","City":"Warrensburg","Date of the Event":"12/31/2008 06:30 UTC","files":["/var/www/straped/mufon/html2text/14679.html.txt","/var/www/straped/mufon/more/14679_submitter_file1__DSC_3666.JPG","/var/www/straped/mufon/more/14679_submitter_file2__DSC_3668.JPG","/var/www/straped/mufon/more/14679_submitter_file3__DSC_3669.JPG","/var/www/straped/mufon/more/14679_submitter_file4__DSC_3672.JPG","/var/www/straped/mufon/more/14679_submitter_file5__DSC_3696.JPG","/var/www/straped/mufon/org/14679.html"],"Sighting Duration":"Undisclosed","Longitude":"-93.73084","Object Flight Path":"Path then hovering","Case Number":"14679","Summary":"My friend and I were driving on Hwy 13 out of Warrensburg and saw a UFO.","Latitude":"38.767069","trends":["There have been 7 other sightings in Warrensburg","There were no other sightings in Warrensburg on or around December 31st 2008","This sighting has never been favorited.",""],"Weather Factors":"None","Object Features":"Appendage(s)","Viewing Distance":"21-100 Feet","Country":"United States","Source":"MUFON","Log Number":"US-01012009-0024","map":"<A HREF = \"http://maps.google.com/maps?q=38.767069,+-93.73084(14679)&iwloc=A&hl=en\"> mufon case (14679) map </A>","Region":"Missouri","Tags":"City"}