{"Disposition":"IFO","Region":"Georgia","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.769802,+-84.970223(14686)&iwloc=A&hl=en\"> mufon case (14686) map </A>","Viewing Distance":"Unknown","Longitude":"-84.970223","Date of the Event":"12/29/2008 09:10 UTC","Country":"United States","Source":"MUFON","City":"Dalton","files":["/var/www/straped/mufon/html2text/14686.html.txt","/var/www/straped/mufon/more/14686_submitter_file1__1light.JPG","/var/www/straped/mufon/more/14686_submitter_file2__1blob.JPG","/var/www/straped/mufon/org/14686.html"],"Weather Factors":"None, Does Not Apply","Object Shape":"Star-like","Log Number":"US-01022009-0002","Case Number":"14686","Latitude":"34.769802","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","divs":["sighting detailsi have seen these balls of light off and on for a couple of years now near the house. i've attempted to get photos\\video before but this is the first time anything decent came out of it. the objects appear to flash colors. i can't make out any definite shape, they just look like round blinking balls of light. i've considered iridium flares or space debris but given the movement, or lack thereof, and duration i am uncertain. sometimes there will be only one in the sky, sometimes there will be 3 or 4 with distance between them but perfectly aligned. sometimes they will flash for an hour or more and then just disappear, sometimes it's less. usually there isn't much movement at all. i had a hard time finding it through my video camera, as the viewing screen does not work, therefore it produced some sudden up and down movements caused by my adjusting it and attempt at zooming. i did leave the recorder set up on a tripod for a bit checking it every once in a while and readjusting. it was readjusted at 1:46 and left alone. the object appears to be moving slowly behind the branches, to the right and then it goes off screen. the quick appearance of some of the light in the corner at 2:04 leaves me a bit skeptical of the sturdiness of the tripod though. as i went back to see if i needed to readjust, i noticed that the battery had died on the recorder. so i went back inside to view the pictures and the video that had been captured. the object was still in the sky when i went in. as mentioned earlier, the lights have been popping up from time to time for a while. i figured i'd submit what i have and see what they could possibly be."],"Tags":"City","Summary":"Ball of light not moving appearing to flash blue,red,green,white/yellow.","trends":["There have been 4 other sightings in Dalton","There were no other sightings in Dalton on or around December 29th 2008","This sighting has never been favorited.",""],"Date Submitted":"12/29/2008 09:10 UTC"}