{"Summary":"Being taken from my bedroom.","divs":["Sighting DetailsI was 16 and I am now 29. I came home from a friends house in the summer of 1995. It was like any other night. I went into my room and turned on the television and started to watch tv. It was 10:30 pm est because my digital clock was right beside my tv. I was not sleeping, was not laying down just sitting on my waterbed and the brightest light I have ever seen appeared outside my bedroom window. It was so bright my room was totally whited out from it. All I could hear was this pulsing sound vmm...vmm...vmm...vmm, over and over. The next thing I know I can't move. I was't sleeping or tired or on any medicine. I was fully awake! I was then levitated out of my room through my wall into the whiteness that was outside. Instantly I was taken down a dark hallway, I was on my back being pulled on some type of cart. There was something pulling me but I couldn't see what it was. I was taken into another room and was injected with a clear liquid into my right arm that made me feel very disoriented. The next memory I have is being levitated back through my wall and onto my bed. I jumped up and it was 3:30 am on my clock. I was gone for 5 hours. Everyone was asleep. No-one saw the light. I asked my brothers and my mother and they never saw or heard anything. I remember this so vividly. I told everybody and the only ones who believe me were my older brother and my mother who is now deceased as she died this past May 21st 2008. I know what I saw was real, was not under any drugs or alcohol or under sleep paralysis. I have never seen a light so bright and that sound haunts me to this day. I will never forget it. I never saw what was pulling me down the hallway, just the back of whatever it was as it was a dark hallway. I want to know what I was injected with. I do not fear ridicule as peoples close-mindedness is their own weakness. I am a man of logic and math. I never layed down to go to sleep nor have I ever sleptwalked or had any delusions. I just want to know why me!"],"Log Number":"US-01022009-0001","Disposition":"Unknown","Date Submitted":"06/30/1995 10:30 UTC","Case Number":"14685","Date of the Event":"06/30/1995 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.804947,+-81.377297(14685)&iwloc=A&hl=en\"> mufon case (14685) map </A>","Latitude":"40.804947","Tags":"City","City":"Canton","Region":"Ohio","Viewing Distance":"21-100 Feet","Object Features":"Unknown","Object Shape":"Unknown","trends":["There have been 13 other sightings in Canton","There were no other sightings in Canton on or around June 30th 1995"],"Weather Factors":"Unknown","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/14685.html.txt","/var/www/straped/mufon/org/14685.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","Longitude":"-81.377297"}