{"Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy wife, daughter and i went for a walk on Christmas Day, we walked to Tithe Road in Plympton, Plymouth and saw 1 x orangey light moving fairly fast through the sky below cloud level at about 17:05. The light was moving on a straight course from east(ish) to west(ish). Thought it was odd, not a plane and assumed it must of been a helicopter, although i was not entirely convinced. We carried on our walk and some time later (17:15) when we had reached the bottom of Great Woodford Drive in Plympton, Plymouth, just before the Unicorn Public House, we then saw a total of 5 orange coloured lights moving across the sky from East(ish) to West(ish). The first one was some way ahead of the others and they seemed to be on the same course as each other. They seemed to be just below cloud level as at some point the first one disappeared behind the cloud. Eventually all of the lights went behind the clouds and we carried on walking. They moved at a fair speed as if aircraft, but the light was like a round spotlight moving through the sky and unlike any aircraft lights that i have seen (too big). We could not hear any sound but the main road did have traffic."],"Summary":"Witnessed a total of 6 x orange coloured lights.","map":"<A HREF = \"http://maps.google.com/maps?q=50.379756,+-4.12774(14692)&iwloc=A&hl=en\"> mufon case (14692) map </A>","trends":["There have been 3 other sightings in Plymouth","There were no other sightings in Plymouth on or around December 25th 2008"],"Date Submitted":"12/25/2008 05:05 UTC","Log Number":"GB-01022009-0008","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","City":"Plymouth","Region":"England","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/14692.html.txt","/var/www/straped/mufon/org/14692.html"],"Viewing Distance":"Unknown","Case Number":"14692","Object Features":"Unknown","Longitude":"-4.12774","Date of the Event":"12/25/2008 05:05 UTC","Latitude":"50.379756","Source":"MUFON","Object Shape":"Circle, Fireball","Sighting Duration":"Undisclosed"}