{"Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/14696.html.txt","/var/www/straped/mufon/org/14696.html"],"Summary":"A red orange non symmetrical, non flickering light moving in the sky.","Weather Factors":"Unknown","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.456207,+-112.064577(14696)&iwloc=A&hl=en\"> mufon case (14696) map </A>","Viewing Distance":"Unknown","Longitude":"-112.064577","divs":["Sighting DetailsIt was new years eve. I was the designated driver and had nothing to drink. While at a party in a backyard pool area, i noticed a glowing red orange light. I pointed to the sky and asked loudly what the object was. Others began to notice and chime in with the same question. I suggested a flare, because that seems to be the first explanation the news gives these days. At the point of the initial observation the object was approximately in between the size of a dime and the size of a quarter if held at arms length. One person then remarked that they thought it was a plane on fire. The color of the object was not consistent and varied from a red color to and orange color. It did not flicker like a fire would so i did not immediately think it was a fire. five to seven of the party goers left the covering of the porch and moved out into the yard to get a better look. All the while people are commenting in disbelief. My friend, who is in school to be a pilot, remarked that he had never seen anything like this before. Who ever initially made the comment about the plane made a comment later about how it could not be a plane on fire because it would have gone down by this point in time. The object appeared to be on a curved trajectory as it was larger and brighter at the beginning and then appeared to turn slightly and and head away from us. The light changed shape and size as the object turned. Eventually the light became the size of a set of lights on an airplane, yet had a distinctively red color and did not blink like an airplane. the object became so distant at the end of the sighting that only 2 or 3 of us could see it tracking through the sky, then it was gone from view. The entire duration of the sighting was approximately 5 min. approximately 10-20 people witnessed the event. Unfortunately no one at the party was able to video or take photos."],"Log Number":"US-01022009-0012","Date of the Event":"12/31/2008 12:30 UTC","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around December 31st 2008"],"Latitude":"33.456207","Tags":"City","Source":"MUFON","City":"Phoenix","Object Flight Path":"Path with directional change","Object Features":"None","Disposition":"Hoax","Date Submitted":"12/31/2008 12:30 UTC","Case Number":"14696"}