{"Date of the Event":"07/20/1964 12:00 UTC","Summary":"Elongated triangle traveling east to west very high in the night sky.","Date Submitted":"07/20/1964 12:00 UTC","Case Number":"14705","Object Features":"Undisclosed","Country":"Canada","Longitude":"-114.050132","map":"<A HREF = \"http://maps.google.com/maps?q=51.04657,+-114.050132(14705)&iwloc=A&hl=en\"> mufon case (14705) map </A>","divs":["Sighting Details My family was camping on the Bow river outside Calgary alberta for the weekend. It was late in the evening and we were sitting by the fire and I happened to look up at the sky and saw a long shiny triangle shaped object crossing the sky at what seemed a slow rate of speed. The object seemed to stop and go again and rapidly changed course seeming to stop and jog sideways and then go forward again. I pointed it out to my father and he said it was a weather balloon but I said if it was it was going against the wind because the wider end was on the eastern side and the narrow end was on the western side and it was traveling east to west. It was also high enough in the sky to reflect sunlight and the sun had gone down an hour or so prior to the sighting and it was dark enough to see the stars clearly. The object shone as bright as a very bright star or planet and was very large or I would have thought it was just an aircraft. As I said it was high enough to reflect sunlight. It was clearly visible as a triangular object that was elongated to the point of seeming like a stretched out teardrop and went from one side of the sky to the other in about one hour or so. Thank you wade nickerson"],"Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around July 20th 1964"],"Disposition":"Unresolved","City":"Calgary","Object Shape":"Triangle","Latitude":"51.04657","files":["/var/www/straped/mufon/html2text/14705.html.txt","/var/www/straped/mufon/org/14705.html"],"Log Number":"CA-01022009-0020","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Region":"Alberta"}