{"Tags":"City","Region":"New York","Object Flight Path":"Other","Date of the Event":"12/30/2008 06:00 UTC","Viewing Distance":"Unknown","Summary":"Bright flash of light blue light in the sky.","Country":"United States","Weather Factors":"Does Not Apply","City":"Geneseo","Object Shape":"Other","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.802396,+-77.809717(14702)&iwloc=A&hl=en\"> mufon case (14702) map </A>","trends":["There have been 3 other sightings in Geneseo","There were no other sightings in Geneseo on or around December 30th 2008"],"Latitude":"42.802396","Date Submitted":"12/30/2008 06:00 UTC","divs":["Sighting DetailsI was leaving the home of my parents with my three children around 6:15 PM on December 30, 2008. It was a clear cold night in the low teens. The sky was clear because you could see the stars as well as the planes flying over head. There was no precipitation in the air. As we stepped outside my parent's home, the entire sky lit up for approximately 5 to 10 seconds, but it seemed much longer. The sky because a bright and brilliant blue. The shade was a very light powedery color blue much like the color of a robin's egg. I remember noticing a couple of vapor trails in the sky and thinking to myself...where is the sound? Part of me was thinking that something had quickly flown over head because of the trails that I noticed and I was also expecting an impact shock. But there was none of either. The experience was jarring enough to scare all of my children causing them to run back inside the home. Around the same time, my wife was driving home from work and noriced a large bright white light on the horizon that seemed to hover. It was as large as the moon. The moon was just finishing the new phase so it could not have been that. The light appeared to originate from the same approximate direction as the source of the bright blue flash. She lost sight of the object as she turned around the corner. A friend of mine noted a power flicker around the same time in the village of Mt. Morris approximately 10 miles away. Around 11:00 PM, the power failed at the home for approximately five minutes."],"Disposition":"IFO","Case Number":"14702","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14702.html.txt","/var/www/straped/mufon/org/14702.html"],"Longitude":"-77.809717","Log Number":"US-01022009-0018","Sighting Duration":"Undisclosed"}