{"Tags":"City","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.157702,+-95.986975(14703)&iwloc=A&hl=en\"> mufon case (14703) map </A>","Summary":"Witnessed stationary, triangular object in the Tulsa night sky.","Log Number":"US-01022009-0018","trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around December 6th 2008"],"Case Number":"14703","Object Flight Path":"Stationary,Hovering then path","City":"Tulsa","Object Shape":"Triangle","Longitude":"-95.986975","Object Features":"Unknown","Weather Factors":"Unknown","Date Submitted":"12/06/2008 12:01 UTC","Date of the Event":"12/06/2008 12:01 UTC","Sighting Duration":"Undisclosed","Region":"Oklahoma","divs":["Sighting DetailsMy husband and I were on our way back home from a night at his family's house. We were taking our normal route home on hwy 169 south. It was approximately midnight when we noticed a light off in the distance. Apparently we both noticed it at the same time, but did not know that until later. I saw it and said nothing. My husband noticed it and watched it for awhile before asking me if I saw it as well. Once we realized we were seeing the same thing, we immediately looked for a rational reason to explain the odd light. *Let me make a quick note. My husband is a staunch skeptic and I want to believe with the right evidence. This is important since it was my husband who actually commented first about the object instead of myself. I had noticed the object and simply not said anything because typically he shrugs off things such as this. Initially a plane was the obvious answer, but we noticed as we got closer to the object, it did not seem to be moving. We were drawing closer in the car going approximately 65mph and it was staying perfectly stationary. We then reasoned, perhaps it was a tower with a light to warn planes approaching, but then we realized that was not possible. We confirmed that by driving the same route the next night and there is no light in the same area. Again, we ran through every reasonable scenario in our head and came up with nothing that matched what we saw. The object was triangular in shape with six points of light underneath it. Five of the lights were white with the one in the center on the underneath side being red. Since we were traveling on the highway at a decent speed, we were upon the object quicker than I anticipated. I finally got over the shock of what I was seeing and reached for my cell phone camera. I took one very horrid picture that is not worth passing on. It was distant and extremely blurred since we were traveling quickly. About this time the highway veers towards the east, away from the object. We planned on taking the next exit off and backtracking. As I turned towards the back of the car to keep my eye on it, it seemed to simply dissappear. I could not say whether it accelerate so quickly that my eyes could not take in the experience quickly enough, or if it truly vanished into thin air, but it was no longer in view at all within a second. Let me note here that my husband believes it took off towards the West. We continued to talk about the event the rest of the way home. It seemed to go by so quickly and yet in slow motion at the same time. To this day, we have found no one else that has reported seeing an object on that evening and have no answers about what it could have been."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14703.html.txt","/var/www/straped/mufon/org/14703.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Latitude":"36.157702"}