{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14709.html.txt","/var/www/straped/mufon/org/14709.html"],"Source":"MUFON","Date Submitted":"08/12/2007 12:00 UTC","divs":["Sighting DetailsMy son, husband and I were in the back yard looking for meteors. This one round,about the size of a softball or cabbage, bright yellow glowing, (with a strobing light) object came through the NE corner of our backyard, silently flew through the yard diagonally and turned west at the corner of our house and flew beside our home. It was only 8-10 feet off of the ground. We were so dumbfounded that we all just stood there and didn't say anything for a bit. Sadly and regrettably, we didn't follow it. I would have thought I was nuts if my husband and son hadn't seenit too. It was definitely not a meteor....it was too low....it flew slowly and was low too the ground and the light blinked ot strobed slowly and methodically...not eratically. My son was 14 , my husband is co-manager of a local grocery and I am a church secretary.This was at 414 S. Race St. We have since moved, but still own the property at present.We were afraid to say anything sooner, even now , fearly others will think we are nuts."],"Longitude":"-84.584122","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","City":"Van Wert","Country":"United States","Date of the Event":"08/12/2007 12:00 UTC","trends":["There have been no other sightings in Van Wert","This sighting has never been favorited."],"Summary":"My son, husband and I were in the back yard looking for meteors. This one round, about the size of a softball or cabbage, bright yellow glowing, (with a strobing light) object came through the NE corner of our backyard, silently flew through the yard diag","Region":"Ohio","Object Flight Path":"Path with directional change","Tags":"City","Latitude":"40.869493","Object Shape":"Circle, Sphere","Case Number":"14709","map":"<A HREF = \"http://maps.google.com/maps?q=40.869493,+-84.584122(14709)&iwloc=A&hl=en\"> mufon case (14709) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-01032009-0001"}