{"map":"<A HREF = \"http://maps.google.com/maps?q=44.027706,+-88.534824(14718)&iwloc=A&hl=en\"> mufon case (14718) map </A>","Disposition":"Insufficient Data","Summary":"3 bright red solid circles, motionless at about 20 degree angle from horizon , at a 45 degree angle.","Object Shape":"Circle","City":"Oshkosh","Date of the Event":"12/19/2008 08:05 UTC","Log Number":"US-01032009-0010","Date Submitted":"12/19/2008 08:05 UTC","Source":"MUFON","trends":["There have been 10 other sightings in Oshkosh","There were no other sightings in Oshkosh on or around December 19th 2008"],"files":["/var/www/straped/mufon/html2text/14718.html.txt","/var/www/straped/mufon/org/14718.html"],"Country":"United States","Tags":"City","Sighting Duration":"00:00:15","Object Features":"None","divs":["Sighting DetailsWhile taking our scheduled smoke break at the manufacturing plant where I work, I and two co-workers always sit in a row facing west in an open overhead doorway. I think we all spotted it at the same time, and I was the first to say, \" what in the hell is that?\" It only lasted for a few seconds, but it was unmistakable what we saw: 3 extremely bright red lights at about a 45 degree from each other in a straight line. I would estimate the distance from us at about one mile or less. The size of the solid red lights would be about the same as if you held an eraser on the end of a pencil at arms length. The lights did not pulsate or move in any direction, but vanished as if turning out a light at a switch. One of the other guys said that it was probably a plane, being that our plant is next to the local airport. Planes have one red, one green and one pulsating strobe light on them. I've been around airplanes all my life, living close to the airport myself and also in the U.S. Air Force. Trust me, this was not a plane, nor helicopter. I only wish it would have lasted longer for observation purposes. I'm not sure what we saw, but it was kind of spooky. The most spooky thing about it was the fact that the lights just blinked out (gone) in a nano-second. No sound was heard either. I would estimate that the lights were at about a 20 degree angle from the horizon."],"Viewing Distance":"501 Feet - 1 Mile","Region":"Wisconsin","Longitude":"-88.534824","Latitude":"44.027706","Weather Factors":"Unknown","Object Flight Path":"Stationary","Case Number":"14718"}