{"divs":["Sighting DetailsDuring my morning routine I drink my coffee and smoke acigarette or two on my rear deck at home. I always watch the sky for shooting stars and satellites and generally admire the stars. On clear nights here in western maine we have an outstanding view of the stars. At first it appeared to be a star in the distance rapdily flashing white and trailing what looked like 2 orange tentacles of light. I watched it for a few minutes and then saw it move and thought, what the heck is that. It would move occasionally in rounded sweeping movements and I saw it move in a 90 degree movement downward and to a sudden stop. The best description I can give is that with the naked eye it moves alot like a kite would up up the sky. I took a couple pictures but it was too dark and the object is too distant. It appears like it is up over Quebec somewhere. When I got my binoculars to look at it I was astonished. At many points it looks like a 2 disc craft with a central core connecting the two discs, mostly green halo surround the entire craft and rapidly flashing white light around the top disc with random bright reds flashing in the white area, on the bottom disc it is mostly orange and green lights, no red flashing in this area. When it moves (watching with binoculars) it spins rapidly almost like looking at a laser pointer being moved around a white screen. Looping and spinning almost like my hands were shaking. So I stabilized the binocs and sure enough, it was not me. It rapidly circles when it moves then suddenly stops. I just went out to look and watch again for a few minutes before writing this line and it is still there even though the sky is brightening for dawn. One thing to note is there is an extraordinary number of shooting stars this morning, I have personally seen 16 so far. This object is not a plane, if fact one flew by in the general sky area, not too closely, I watched it approach and fly by and I have to believe they had to see this object, it is certainly bright enough and large enough. It is now somewhat lower on the northern horizon and more difficult to see. I did wake my wife at 5:30 to come out and look with me to confirm I am not crazy. She also sees it and because it is cold outside she went into the bedroom and watched from the window. I did too for a short time but the screen makes it less clear to see details. I am exhilarated by this experience and wanted to share it with somebody who would not think I am insane. One hour now and it is still there but into the trees now that it is so much lower on the horizon."],"Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/14712.html.txt","/var/www/straped/mufon/org/14712.html"],"Region":"Maine","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date of the Event":"01/03/2009 05:30 UTC","Summary":"Hovering and moving in NW sky right now, been watching for 30+ minutes.","Date Submitted":"01/03/2009 05:30 UTC","Object Shape":"Other","trends":["There have been 4 other sightings in Sanford","There were no other sightings in Sanford on or around January 3rd 2009"],"Sighting Duration":"Undisclosed","Disposition":"IFO","Object Features":"Other","Country":"United States","Log Number":"US-01032009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=43.439249,+-70.774225(14712)&iwloc=A&hl=en\"> mufon case (14712) map </A>","Source":"MUFON","City":"Sanford","Case Number":"14712","Longitude":"-70.774225","Tags":"City","Latitude":"43.439249","Viewing Distance":"Over One Mile"}