{"Log Number":"US-01032009-0008","Object Flight Path":"Straight-line path,Other","divs":["Sighting DetailsIt was new years and i wanted to get some pictures of fireworks for my 8 yr old duaghter Tai.i had turned of the porch light so i could get better pictures of the fireworks,but it was hard for me to see the switch on my camera,as i was messing with the switch the firewporks stoped poping ang i looked up, when i did i noticed three orange orbs flying slowly in a northen direction there was no sound i relized what i was seeing and screamed for my wife and duaghter they came and i remembered that i had a video setting on the camera thats when i started video taping i have 4 different vidoes from that night.we counted thirteen flying orbs the never stoped they just kind of slowly flew they started on one side of the sky and went completly across it, i then called my mom,and friend corey blanchard.corey was in town and was able to see one from the side and said they looked to be 3000 to 5000 feet high,but that would mean that the size of those things was huge ,i thought they was about 500 to 1000 feet high,my wife got in touch wife my mother and sister inlaw they also seen them,they started to slowly stop coming they would start on one harizon and fly to the other as they stop showing up i went inside and started watching my videos but my nefwew stayed up at my moms house who lives north of me and got some vidoe also and a still picture of them making a tryangle.it was the most amazing thing i have ever saw.i have one really good one of two over the lights in the subdivision. the camera i was useing is not a video taping unit its a digetal camera with video option"],"files":["/var/www/straped/mufon/html2text/14716.html.txt","/var/www/straped/mufon/org/14716.html"],"Sighting Duration":"Undisclosed","Region":"Louisiana","Case Number":"14716","Object Features":"Undisclosed","Summary":"A round orb that was orange and glowing, it was glowing, kind of like a throbbing.","map":"<A HREF = \"http://maps.google.com/maps?q=29.60401,+-90.718105(14716)&iwloc=A&hl=en\"> mufon case (14716) map </A>","Source":"MUFON","trends":["There have been 8 other sightings in Houma","There were no other sightings in Houma on or around January 1st 2009","This sighting has never been favorited.",""],"Date of the Event":"01/01/2009 12:04 UTC","City":"Houma","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"01/01/2009 12:04 UTC","Tags":"City","Latitude":"29.60401","Object Shape":"Sphere","Longitude":"-90.718105","Disposition":"Unknown","Weather Factors":"Unknown"}