{"Sighting Duration":"00:05:00","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around January 3rd 2009"],"Date Submitted":"01/03/2009 05:01 UTC","Case Number":"14713","Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/14713.html.txt","/var/www/straped/mufon/org/14713.html"],"Summary":"Tiny star-like, steady, slow moving and changed direction, then dissapeared.","Latitude":"40.232325","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.232325,+-74.935643(14713)&iwloc=A&hl=en\"> mufon case (14713) map </A>","Region":"Pennsylvania","Tags":"City","divs":["Sighting DetailsI was rudely awakened by my cat around 3 am and I couldn't get back to sleep. Just before 5 am, I remembered that the Quadrantids meteor shower would be taking place so I decided to go out for a smoke and see if I could see any meteors. I stood outside, facing north, taking notice of how the constellations had \"moved\" since before I had gone to bed. The big dipper was pretty much right over my head. Then I realized that one of the stars was moving. It was very small (as if you looked up at the stars and picked the dimmest one you could find) and it moved from just to the left of the North Star in a due south direction. It was very slow and did not make a sound. As I stood there watching it, I glanced down for a second to re-adjust my stance as I was standing on uneven ground and when I looked back up it had changed direction and was now moving due east. I watched it for a few more minutes and it disappeared in the \"handle\" of the big dipper. My initial thought was a meteor, but I have seen meteors before and just as I was losing sight of this object is when I started to see the actual meteors. I counted 15 in all. There was no comparison in that this was very tiny, steady and had no tail...plus you cant watch a meteor for that length of time. My next thought was satellite- and although I had never seen one, I went back inside, turned on my computer and went to NASA's SkyWatch to find that lo and behold the ISS would be visible, but not until 6:14 am. Went back outside at 6:13 and watched the ISS arc across the sky. The ISS was markedly brighter and faster than what I saw. The fact that this thing was so tiny suggested an altitude that was entirely to high for a plane."],"Source":"MUFON","City":"Newtown","Object Flight Path":"Path with directional change","Object Shape":"Star-like","Date of the Event":"01/03/2009 05:01 UTC","Longitude":"-74.935643","Log Number":"US-01032009-0005","Weather Factors":"Unknown"}