{"divs":["Sighting DetailsIT was back in 1983 me and my brother in law were on a river at night catfishing we headed back to the boat ramp after fishing the lines, and the boat was loaded with cat fish, It was A dark night No moon no clowds we took our last sharp curve and headed down a stright away and to our left in the top of the pine trees we saw an orange lite, We slowed down or the motor shut off I can't remember but this lite came across the tops of the trees real slow.It seem to take forever to bust out of the trees It look just like a comet with a tail it was as big as a VW car, but it moved so slow and so stright across the river to the other side of the tree tops and not a sound, Nothing. It was 150 ft across that river and it took at least 8 sec' for it to cross.Big an long 50ft from front to the back of the tail, it was just the shape of a comet but right at tree top hight and was moving in a stright line, not at an angle. I looked back at my brother in law to ask what that was? all he said was I don't know. and he went to pulling the rope to get the motor started, we never said a word about it to each other and I still am not sure what this was. can anyone shed some lite on this for me. stacy p. brown"],"Date Submitted":"02/13/1982 09:12 UTC","Date of the Event":"02/13/1982 09:12 UTC","Longitude":"-84.488792","Disposition":"Insufficient Data","Summary":"This took place in the winter time, not a lot of people on the river. So we had it to our selfs or so we thought!","Country":"United States","Tags":"City","City":"Sopchoppy","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/14728.html.txt","/var/www/straped/mufon/org/14728.html"],"Sighting Duration":"01:15:19","Object Shape":"Fireball, Teardrop","Case Number":"14728","Latitude":"30.059925","Source":"MUFON","Log Number":"US-01042009-0005","Object Flight Path":"Straight-line path","Region":"Florida","trends":["There have been no other sightings in Sopchoppy","This sighting has never been favorited."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.059925,+-84.488792(14728)&iwloc=A&hl=en\"> mufon case (14728) map </A>","Object Features":"Unknown"}