{"Object Shape":"Star-like","divs":["Sighting DetailsI went outside in my back yard to have a cigarette and saw a very bright \"star\" in the sky almost due west of me. As I was watching it, it appeared to move back and forth in an unusual way. I became intrigued and continued to watch it to make sure that it: wasn't an airplane or helicopter, wasn't a satellite or star, and was truly moving strangely [the eyes can play tricks on you if you stare at something too long]. After another 5-10 minutes I could tell that it was definitely not an airplane or a helicopter. I had my wife come out to double-check me to see if it was truly moving. She confirmed that it was. The distance? Very hard to tell. At one point I watched an airplane fly directly in front of it. Due to this fact, I would surmise that it was out over the ocean. More about the movement: it moved left and right, up and down and, apparently, farther away and closer [it would grow fainter then brighter]. It would stay in one place for awhile and then move in an intermittent and abrupt manner. Sometimes it would oscillate back and forth or up and down, and sometimes it would zip in one direction and stay there. It seemed to be heading in a general northwest direction [out over the ocean]. My wife probably best described the movement, \"It was like a bug.\" It also seemed to sparkle with different colors, red and maybe blue, but this was difficult to confirm. After approximately 51 minutes, I lost sight of the object as it finally moved low on the horizon and behind a tree. My feelings and reactions? Well, I am a scientist by training [I have a graduate degree in chemistry] so, while being very intrigued, I tried to be as objective in my observations as possible. All I can say for sure is that it was a \"flying\" object that I couldn't identify. I did take pictures and a short video with my camera but realistically they are of no use. It just appears as a point of light on a black background."],"Tags":"City","Date Submitted":"01/03/2009 07:33 UTC","City":"Fremont","Country":"United States","files":["/var/www/straped/mufon/html2text/14725.html.txt","/var/www/straped/mufon/org/14725.html"],"Weather Factors":"None","Longitude":"-121.979392","Date of the Event":"01/03/2009 07:33 UTC","Disposition":"IFO","Object Flight Path":"Other","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around January 3rd 2009"],"Object Features":"Unknown","Region":"California","Latitude":"37.55417","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.55417,+-121.979392(14725)&iwloc=A&hl=en\"> mufon case (14725) map </A>","Log Number":"US-01042009-0002","Summary":"Moving light in the sky.","Case Number":"14725","Sighting Duration":"Undisclosed","Viewing Distance":"Over 1 Mile, Unknown"}