{"Log Number":"US-01042009-0006","Source":"MUFON","Country":"United States","Region":"Washington","Latitude":"38.898892","files":["/var/www/straped/mufon/html2text/14729.html.txt","/var/www/straped/mufon/org/14729.html"],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-77.029226","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around August 10th 2003"],"divs":["Sighting DetailsOk, Ive told the story a few times, so I can still remember how it happened. I was on a wildland fire hand crew, way up near the Canadian border in Washington state. The thing I remember most about the area was that is was very steep and heavily wooded. For me personally, the woods there had an air about them that made me feel a little spooked in a peculiar sort of way. I enjoyed it quite a bit. We were there for maybe four or five days, Not too sure about that, but the whole time, I felt that way. Anyway, we were on the night shift the first night out on the line. It was a long dozer trail that ran sidehill up and down and all over the country. The trail had been freshly cut, and the soil was made of grey pumice, and there were a lot of big rocks just underneath the soil, and therefore littered about the trail, which made it very treacherous to walk at night, especially since we hadn't seen the place in the daylight. After a long walk, the division supervisor, or whatever his title was, assigned us to spread out along the trail, 100 feet apart from each other, and hold the line. Holding line is just making sure no fire crosses the fireline. Well, there was no more fire where we were, so we spread out, moved a few times to adjust our spacing, and the call came down the line to take a rest. Our crews position was just a precautionary measure, and another crew would space out beyond our location to secure more fireline. We faced the green (the unburned area), as is the practice, and waited. We all had our backs to the ridgeline, which probably rose about 300 feet above our heads, and were all facing the valley below. I could make out the outline and some detail of the ridgeline above and to the right of me in the moonlight. After about 30 minutes, another crew passed behind us on the trail and continued down the line, just as we had done. I noticed that most of them were wearing glowsticks in their hardhats, a safety measure to make it easier to locate one another. Well, about 5 minutes later, I glanced up to the ridgeline into the burn area to see if I could see any glow of the fire, (which a firefighter often does) and saw some strange lights. My first thought was that the other crew had somehow made it all the way up to the ridgetop, and that I could see the glowsticks in their hats, but they were behaving in an erratic manner. Then I thought that it must be fire, but I could see no orange glow, which is unmistakable in the night to any firefighter. No sparks, no flame. It lacked the hue and color quality of the light of any fire. My last thought was that it must be another crew with glowsticks in their hats up there, but by then, more had appeared, perhaps a dozen, and they all had moved into a direct line of sight, where I could clearly track their movements. I was standing up, viewing at a distance of perhaps 500 yards, and about 60 degrees up. I would judge each one to be about the size of a volleyball. They were swooping among the tree tops just below the leeward ridge top. Their movements seemed conscious, as they were interacting kinetically with each other and the trees. they would change directions at probably 20 mph and follow strange twisted paths, kind of like they were dancing. They stayed close together, within a distance of probably 30 yards apart, and all the while changing hues from yellow to green to blue and red. The light seemed to morph a little and had the flicker of plasma, and I knew then that these were not the movements of people, and if they were, they were up climbing the trees and swinging on ropes! If they had been on the ground, the hill would have to be taller, and I would have been able to see the taller trees behind. Later viewing in the daytime confirmed this, that the objects were in the treetops. I watched the whole thing for the better part of an hour, and wasn't too excited about it at the time, but kept it in the back of my mind. I did notice when they became fewer, and then I finally looked up again and they were all gone. An interesting note, I remember it started to get light early, around 5:30 am, and we were still in the same spot. The morning sky was very grey and structured. at around 6:00 am, I thought it unusual to see a lightning storm come from behind the ridgetop above us. I saw the first lightning in the area where I saw the balls of light, though I did not witness any downstrikes, just cloud to cloud. It is quite unusual to have a lightning storm at that time of day, especially in a cool climate. Later investigation in the area over the next few days revealed that there was no active fire in the vicinity of the sighting at the time, and that the area was in fact still green. The day after the incident, while taking a break, I spoke up about what I saw, and found that three others had viewed the same thing. We spoke about it for perhaps 1 minute, and that was all that was said. I still know two of them. I do not know if anyone else on our crew saw the lights. SO in conclusion, I Dont know what they were. I put them in my strange file. They may have been atmospheric electrical phenomenon, but the way they were moving was so lifelike, I do not know, And I dont know what to make of the fact that a lightning storm appeared in the same spot, 5 hours after they were gone. Take it for what it is, whatever that is!"],"Tags":"City","Object Features":"None","Case Number":"14729","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.898892,+-77.029226(14729)&iwloc=A&hl=en\"> mufon case (14729) map </A>","Weather Factors":"Unknown","City":"Washington","Sighting Duration":"Undisclosed","Object Shape":"Fireball, Sphere","Summary":"Multicolored plasma balls.","Date Submitted":"08/10/2003 12:00 UTC","Date of the Event":"08/10/2003 12:00 UTC","Disposition":"Unknown"}