{"Region":"Mississippi","City":"Gulfport","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/14738.html.txt","/var/www/straped/mufon/org/14738.html"],"divs":["Sighting DetailsIn october of 1974 on a staurday a car was pointed out to me by an airman who earlier told me the reason half of our base...Kessler AFB was sealed off...was that a ufo had landed 60 miles away from our base. The car he showed me had marks on the roof as well as the hood. He told me it had virginia plates on it. It was just dusk so I didnt see alot that night. Early the next day An Airman Brewer pointed out the same car. It was a civilian car parked in the base motor poll which is a violation of federal law. He wanted me to try to figure out what the owner was like by looking at the car from the base shuttle bus. It had plates showing the year 1993 and an inspection decal indicating the next inspection was due in 7 of 92. Brewer asked me if we could renew our plates for more then 1 year at a time and I tiold him we could not at that time. I told him I saw the car the night before and he said that wasnt possible. Also the car in the sunday morning had a frost swerl traced in the hood of the car which wasnt possible as the lowest temp the night before was in the 50s. In 1978 an airman on our base which was then Barksdale AFB told me his first sgt was involved in an incident at the pentagon which was refered to by the media in 1972 as \"the alien in the pentagon\" story. That same year I picked up a crew off of one of our bombers. The copilot and navigator were talking about some large electromagneticaly aerospace craft when the pilot told them to shut up as I..the bus driver looked like 1 of the men involved in the sale of a fleet of these craft to the government. I thought they were joking with me so I forgot this for the time. Odd incidents kept following me around so I got out of the air force in 1980. As I was leaving, my first sgt informed me that the pentigon had banned me from ever leaving the country. In 1991 I walked out to my silver renault encore I noticed some one had make a swerl on the hood during the below freezing night before. The car in 1974 it turned out was my car from 1991 with 2 year tags on it. I have alot more info to tell."],"trends":["There have been 8 other sightings in Gulfport","There were no other sightings in Gulfport on or around October 10th 1974"],"Object Features":"Undisclosed","Date Submitted":"10/10/1974 12:00 UTC","Log Number":"US-01042009-0015","Sighting Duration":"Undisclosed","Latitude":"30.37027","Case Number":"14738","Object Flight Path":"Undisclosed","Summary":"Car from future.","Weather Factors":"Unknown","Longitude":"-89.086526","Date of the Event":"10/10/1974 12:00 UTC","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.37027,+-89.086526(14738)&iwloc=A&hl=en\"> mufon case (14738) map </A>","Disposition":"Insufficient Data","Tags":"City"}