{"Tags":"City","Date of the Event":"11/30/1999 12:00 UTC","Object Shape":"Boomerang, Triangle","files":["/var/www/straped/mufon/html2text/14732.html.txt","/var/www/straped/mufon/org/14732.html"],"Latitude":"36.058402","Log Number":"US-01042009-0009","Case Number":"14732","Sighting Duration":"Undisclosed","Summary":"Triangular (boomerang) HUGE & silent , appeared to have exhaust ports.","Weather Factors":"Unknown","Object Features":"Wings, Other","Source":"MUFON","Longitude":"-90.497329","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.058402,+-90.497329(14732)&iwloc=A&hl=en\"> mufon case (14732) map </A>","Viewing Distance":"Unknown","trends":["There has been one other sighting in Paragould","There were no other sightings in Paragould on or around November 30th 1999"],"Date Submitted":"11/30/1999 12:00 UTC","divs":["Sighting DetailsLate winter, one of the warmer nights we had had, my step-son stepped outside with our dog and soon shouted \"come here, quick! You have got to see this!\" As I ran outside, I observed my step-son and our dog looking up towards the northeastern sky. As I looked in the direction in which they were looking, I observed a huge craft, unlike any other craft I have seen in all of my time. It was an elongated boomerang shape, light manila in color, this craft appeared to have approximately 5 exhaust ports glowing a light orange-yellow in color....this craft made NO SOUND WHATSOEVER..it was heading in a SSW direction and was soon out of sight. I believe this was a SUnday, very few people out and about. I am a firm beleiver this was the same craft observed by police officers in (Galesburg?)The same one in Illinois that has aired on the history channel. As i first noticed the craft, it was unlike anything I had ever seen before...as i am a ten year veteran of the Army and Navy, an aircraft buff of sorts,,pretty well versed on the latest jet aircraft in the US arsenal. I knew immediately after seeing this craft, it was something special, unlike ANYTHING i had ever seen before. It headed on a SSW direction headed directly for the next town south of us Jonesboro, AR) and then was out of sight. This craft appeared to be at least 300 ft cross, maybe 120 ft from front to back and made no sound slicing through the air,,,,none! Seconds later it was out of sight..My step son and I knew that we had seen something very unique."],"Country":"United States","Disposition":"Unknown","City":"Paragould","Region":"Arkansas"}