{"Latitude":"41.705191","Disposition":"Unknown","Case Number":"14730","Date Submitted":"05/31/0001 12:00 UTC","Tags":"City","Viewing Distance":"101-500 Feet","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.705191,+-71.412997(14730)&iwloc=A&hl=en\"> mufon case (14730) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 11 other sightings in Warwick","There were no other sightings in Warwick on or around May 29th 0001"],"Region":"Rhode Island","Country":"United States","files":["/var/www/straped/mufon/html2text/14730.html.txt","/var/www/straped/mufon/org/14730.html"],"Date of the Event":"05/31/0001 12:00 UTC","Object Features":"None","Log Number":"US-01042009-0007","Object Flight Path":"Hovering then path","Object Shape":"Circle, Triangle","Summary":"3 orange orbs turned into a triangle.","divs":["Sighting Detailswalking down the street with a friend and saw 3 orange orbs ,almost turned in to a triangle instantly.it hovered for quite awhile and seperated again I would say 10 minutes , then they seperated for a distance and hovered again we were in shock since we live near an airport and have seen all types of aircraft over the years.It stayed motionless and soundless although its distance was that of a plane landing at green airport (prov airport)It was not far from the airport so someone there had to have seen it. the three orange balls of it moved in an odd pattern after that and formed a line and moved up ward until they became smaller and dissapeared after about five minutes the hair on my neck was standing up and we were speechless ,i am a sceptic no more. we went to my friends house and called the airport to report it and they laughed at us! they said we saw stars etc. I wish we had a camera because they were so low it would be Impossible not to accept as ufo or military ,I belive it was the former I will never foget it as long as l ive! stars and aircraft do not move like that amd they are not orange orbs."],"City":"Warwick","Longitude":"-71.412997"}