{"Source":"MUFON","Longitude":"-98.89988","Object Features":"Wings","Case Number":"14731","Viewing Distance":"Unknown","Log Number":"US-01042009-0008","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around September 30th 2003"],"Country":"United States","divs":["sighting detailsmy wife and i were sitting on our back patio looking at the stars when a boomerang object came into view from the south east. it was very low to the ground , probably 200 to 300 feet. there was no sound and no lights. the object moved to the north west. there was a kind of heat wave around the object. my wife and i did not say a word to each other. we just looked back and forth wondering if each of us was seeing what we were seeing. even though it was dark, the sky was clear and you could easily see the object. i stated it was a perfect 90 degree angle.i would say if a jet liner was low enough to the ground that the wing span looked about 6 inches across,that is how low it was.it took about 1 to 2 minutes to go across the sky and moved off the the nw. the object looked black against the night sky. about 2 weeks later we were again sitting on the patio and an object came into view from the south moving very fast and very high in the sky. it had a yellow\\golden color and it was the same shape as the first object we saw.it went across the sky very quickly. but, about 2 weeks after that, we saw the same object with the same color coming from the south west higher thanthe last object and this time moving so fast i could just tell it was the same shape. it only took a a few seconds for it to fly over. there is a picture from kaufman county texas that has an object that shape we saw."],"Date Submitted":"09/30/2003 12:00 UTC","Tags":"City","City":"Breckenridge","files":["/var/www/straped/mufon/html2text/14731.html.txt","/var/www/straped/mufon/org/14731.html"],"Region":"Texas","Date of the Event":"09/30/2003 12:00 UTC","Object Shape":"Boomerang","Disposition":"Unknown","Latitude":"32.758327","map":"<A HREF = \"http://maps.google.com/maps?q=32.758327,+-98.89988(14731)&iwloc=A&hl=en\"> mufon case (14731) map </A>","Weather Factors":"None","Sighting Duration":"00:02:00","Summary":"90 degree boomerang shape, no lights, no sound, dead slow, very low, wife saw also.","Object Flight Path":"Straight-line path"}