{"Date Submitted":"10/17/2005 04:30 UTC","divs":["Sighting Details I was at a restaurant In the Clementon NJ. Area doing a delivery. It was warm and I was very hot from the delivery, I decided to take a smoke break. It was late in the afternoon, I would say about 4:30 pm. I remember I was upset it was so late in the day and I was still working. While standing on the delivery area at the side of the restaurant I was enjoying the view, there is a little lake behind the restaurant. On the horizon as I was looking I saw quite a few contrails. As I recall there were 5 of them all travailing in the same direction, I started to follow the contrails and saw they were converging. I then saw the three of the 5 jets creating the contrails, as I continued to follow the contrails, directly above me between clouds I saw a jet. I would call it a fighter jet, not commercial. It was a lot lower then the other 3 that were still quite high and the 4th was behind the clouds. That is when I saw it. Just in front of the jet was an object. The jet was right on its tail. From the size of the jet it was no more then 5 lengths behind the object. They then go behind clouds. It is very cloudy and I stood there waiting to see it come out from the clouds. I then determined it would not be visible again for several more seconds. I ran into the restaurant and got several people to come out and look. They stayed in cloud cover and I never saw again. Now to describe the object. It was very light pink in color. It crossed my mind when I saw it that if it were to be as light a blue as it was pink, it would not be visible. It would blend in with the sky. Its shape was very odd. I thought of it as an hour glass shape laying on its side with the ends pointed and the center not as narrow. It flew point to point on the horizon. I guess it could have been described as two tear drop shapes joined at the curve as compared to the points. It had a very strange texture. It seemed more organic then metal. What did I think I was seeing, a military jet chasing something. I assumed it was a UFO. It was only visible for I would say 5 seconds before it went behind the clouds. Of course I became quite excited. I had trouble comprehending what I saw."],"Country":"United States","Source":"MUFON","Date of the Event":"10/17/2005 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.811503,+-74.982944(14740)&iwloc=A&hl=en\"> mufon case (14740) map </A>","Case Number":"14740","Longitude":"-74.982944","Object Shape":"Other","Latitude":"39.811503","files":["/var/www/straped/mufon/html2text/14740.html.txt","/var/www/straped/mufon/org/14740.html"],"Log Number":"US-01042009-0017","City":"Clementon","Object Features":"Patterned Surface","Region":"New Jersey","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Summary":"Pink object chased by jets over New Jersey.","trends":["There has been one other sighting in Clementon","There were no other sightings in Clementon on or around October 17th 2005"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Tags":"City","Disposition":"Unknown"}