{"Date Submitted":"11/30/0002 08:30 UTC","divs":["Sighting DetailsThe first time I witnessed this Unidentified Flying Object was in July of 2008. I was outside walking my dog. The time was somewhere between 8PM and 9PM. I looked up in the sky to look at the stars and I noticed a strange object. The object had five lights in the shape of a boomerang. It was hovering over a nearby house in our development. When I first saw the object, I wasn't sure what it was. I didn't think it was a plane because it wasn't flashing or moving. It was just hovering over the house. I watched the object hover for about ten minutes. The object hadn't moved an inch. I then walked into my garage to let my dog in the house. Once the dog was in the house I went back out onto the driveway to look at the object again. When I looked up to where the object was just a minute ago, it was suddenly gone. I looked all around the sky for the object and it was nowhere to be found. I was feeling a little spooked at this moment and I went back into the house. About two minutes later I went into my backyard to clean up the pool area and when I looked up in the sky I saw the object again hovering. I watched the object for about 30 minutes this time. The object didn't move and the lights didn't flash at all; it just hovered. I would have taken a picture of the object but my daughter is the only one with the camera, and I never know where to find it. I then went back into the house because I became bored of watching this object doing nothing. After that I didn't see the object again until August. I was again outside walking my dog and I looked up in the sky like I do everynight to look at the stars, and the object was there again hovering over the same house. I ran back into the house to get my son and he came outside with me and I showed him the strange object. He had no idea what the object was, and he knew it wasn't a plane. It was again just hovering there, not moving. We watched it for about ten minutes and then went back into the house. I saw it a few more times in October and November doing the same thing, just hovering in the sky not moving and not flashing. I hadn't seen the object in about a month until just a week ago I saw the object hovering in the sky while I was walking my dog. I ran in to get my daughter who was home at the time and a minute later when we got outside the object was gone. The object seems to be extremely fast for it to disappear that quickly. I then saw it again last night while I was walking my dog and I quickly went into the house to get my husband. He came outside with me and I pointed to the sky where the object was before I went into the house, and it was suddenly gone. My husband and I were searching the sky to find the object but it was nowhere to be found, again. It seems as though each time I try to show someone the object it disappears in a flash. Each time the object appears it is around 8 or 9PM. It is truly the strangest thing I have ever witnessed. I wish I could figure out what this object is because it is truly something out of the ordinary."],"Object Shape":"Boomerang","Latitude":"39.957825","map":"<A HREF = \"http://maps.google.com/maps?q=39.957825,+-75.154079(14749)&iwloc=A&hl=en\"> mufon case (14749) map </A>","Weather Factors":"Unknown","Longitude":"-75.154079","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around November 30th 2002"],"Object Flight Path":"Stationary","City":"Philadelphia","Region":"Pennsylvania","Log Number":"US-01042009-0026","files":["/var/www/straped/mufon/html2text/14749.html.txt","/var/www/straped/mufon/org/14749.html"],"Case Number":"14749","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Date of the Event":"11/30/2002 12:00 UTC","Country":"United States","Summary":"Five bright lights in the shape of a boomerang hovers over a nearby house almost every night for about twenty minutes.","Object Features":"Unknown","Disposition":"Unknown"}