{"Longitude":"-81.588456","Weather Factors":"None","Case Number":"14752","City":"Cambridge","Sighting Duration":"00:30:30","Tags":"City","Disposition":"Unknown","Date Submitted":"09/15/2007 09:45 UTC","Log Number":"US-01042009-0029","Object Shape":"Cigar, Cylinder","files":["/var/www/straped/mufon/html2text/14752.html.txt","/var/www/straped/mufon/org/14752.html"],"Country":"United States","Summary":"Large silent hovering cigar shaped with 2 large lights at front, blinking when moving steady lit when hovering.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.031183,+-81.588456(14752)&iwloc=A&hl=en\"> mufon case (14752) map </A>","Viewing Distance":"101-500 Feet","Object Features":"None, Other, Unknown","Region":"Ohio","Latitude":"40.031183","divs":["Sighting DetailsI was out feeding horses on my tractor at about 9:45 pm on about September 15th of 2007, my tractor had a faulty headlight switch at the time, which caused the headlights to blink on and off until I wiggled the switch to keep them lit. I was proceeding south on my dirt road from the barn toward pastures when I was fiddling with the lights to get them working. I then noticed two large bright lights to my right ( due south west from me ) They were blinking steady and were stationary above the tree line. I stopped the tractor and shut off the head lights to see what it was, and the lights on the object stopped blinking and remained lit steady.I did not have any idea what it was as I have never seen any thing like it before, I watched it for a few minutes when it started moving towards the north very slowly. When it moved forward the lights started blinking slowly on and off again, then it would stop and the lights would remain lit steady. There was no noise, totally silent and it seemed to be 100ft to 500 ft away, and just above the tree tops. It would hover silently with these two large bright lights spaced apart like a cars headlights, very large in diameter and very bright and then would move slowly with the two lights blinking on and off until it stopped and hovered again and the lights again would stay lit steady until it moved again. It did this as it slowly moved due north until it was no longer visible due to the trees blocking my view. As it passed it blocked out the stars behind it and appeared to be a long cylinder probably at least as long as a Jumbo Jet. I called to my wife and 2 kids to come look but they were afraid to come out of the house. I too was a little afraid for unknown reasons ( I do not scare too easy ) But all I could do was sit and watch. This event lasted about 30 minutes from start to finish, and the unidentified object traveled about 2 to 3 miles before I could no longer see it."],"trends":["There have been 2 other sightings in Cambridge","There were no other sightings in Cambridge on or around September 15th 2007"],"Source":"MUFON","Date of the Event":"09/15/2007 09:45 UTC"}