{"Date Submitted":"01/04/2009 06:00 UTC","Object Shape":"Diamond, Star-like","Region":"Connecticut","Log Number":"US-01052009-0001","City":"Middletown","map":"<A HREF = \"http://maps.google.com/maps?q=41.571241,+-72.646419(14759)&iwloc=A&hl=en\"> mufon case (14759) map </A>","Case Number":"14759","divs":["Sighting DetailsIt started around 6pm and myself and children were eating dinner, where we sit, we have a huge window and sliding glass doors. I happened to look outside and this extremely bright light caught my attention, it was almost as if it were a beautiful brilliant diamond sparkling. My chldren looked at it, and we couldn't figure it out, and then all of a sudden it completely disappears!! We were amazed and continued eating dinner and then it appeared again only to disappear after a few seconds, it seemed as if it was hovering and it wasn't too far up in the sky and it certainly wasn't a star. So this continued to happen and then we started freaking out because we have been trying for the life of us to figure out where these strange human size large & small footprints are coming from, we only have seen them twice and its when it snows. We thought maybe a black bear but the way the tracks are its impossible, we tried thinking of every creature that walks on two feet besides a human or something else, its almost as if the creature whatever it is only either has one leg, or it takes extremely long steps directly in front of each other, because there is no side by side tracks like a human would have, we even tried to follow our dog around to see if she were doing any funny things in the snow and it was impossible, I also spray painted where the tracks are so we can track them, until the snow melts of course. What are these tracks that come from one side of the woods across our backyard into the other side of the woods in the exact same pattern each time it snowed?? We are at a loss and kind of nervous, so seeing these lights didn't make it any better, but it gets better. So after this has been going on for a few hours and is still ongoing as I type this to you at 12am, there have been numerous planes of some sort flying around the area of the light and then it seems as if when the planes get closer the lights disappear.....we even thought we something flash, like a flash of light as if something shot at one another. I kid you not, this is still occurring right now and i can see this strange behavior from my back window. Did anyone else see this????"],"trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around January 4th 2009"],"Weather Factors":"None, Does Not Apply","Disposition":"IFO","Object Features":"Unknown","Latitude":"41.571241","Tags":"City","Country":"United States","Object Flight Path":"Stationary,Other","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-72.646419","files":["/var/www/straped/mufon/html2text/14759.html.txt","/var/www/straped/mufon/org/14759.html"],"Summary":"Saw a bright light in the sky around 6pm and it keeps dissappearing, and there have been planes flying near the site all night.","Date of the Event":"01/04/2009 06:00 UTC"}