{"Log Number":"US-01042009-0033","files":["/var/www/straped/mufon/html2text/14758.html.txt","/var/www/straped/mufon/org/14758.html"],"Tags":"City","Summary":"Two hovering craft over house at high altitude.","Longitude":"-86.154514","Object Shape":"Triangle","Disposition":"Insufficient Data","Case Number":"14758","Source":"MUFON","Object Flight Path":"Undisclosed","divs":["sighting detailsthere were six people total who viewed the aircraft\\objects. i am unsure who observed the objects initially but it was me, my wife and son a couple of neighbor boys and my neighbor directly accross the street. we live on a cul de sac and were outside being social on a warm september evening. two unknown aircraft were hovering for close to 40 minutes at a high altitude without really moving, just sitting in place. i did not have any reference point for distance but they were almost directly over head and a little bit difficult to see, so i am assuming they were pretty high in the sky. one was easier to see than the other as if it were either a smaller craft accompanying the larger craft or at a higher altitude making it appear smaller. the distance made it impossible to make out details but it had a definite triangle shape. we watched until it became to dark to see anymore... it was not like anything any of us had seen before in regards to it's behavior... just sitting there, all other aircraft fly by where as this just seemed to hover."],"Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.775906,+-86.154514(14758)&iwloc=A&hl=en\"> mufon case (14758) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"11/01/2008 06:15 UTC","Object Features":"Undisclosed","Latitude":"39.775906","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around November 1st 2008"],"City":"Indianapolis","Date Submitted":"11/01/2008 06:15 UTC","Viewing Distance":"Unknown","Region":"Indiana"}