{"Summary":"seven witnesses, unrealistic bright brilliant Orange color. slow moving , low, no sound.","Country":"Tanzania","files":["/var/www/straped/mufon/html2text/14765.html.txt","/var/www/straped/mufon/org/14765.html"],"Region":"Tanga","Source":"MUFON","City":"Tanga","Sighting Duration":"Undisclosed","Log Number":"TZ-01052009-0007","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting Detailsmy wife and I arrived at the coast with our friends and children. as we were sitting out on the low hanging veranda sipping coffee and taking in the smells of the ocean..it was exactly 8:40pm, my wife taps me on the shoulder and asks what kind of lights are those? as I look in the direction she is pointing...not high in the sky as the veranda hangs low... we see two intense bright orange round lights like asending up thru a few palm trees... we figured they were approx 150meters away.. I turned to my wife and said (this is as the lights are still raising) probably the Tides lodge trying out some fireworks prior to New Years... then the two seperate lights,(which were not far apart from each other as I could see both thru the binnoculars) stopped above the tree tops..(we estimated 100 meters above) what astounded myself and the others was the brilliant color..glowing..almost felt like looking at the coals of a very large bonfire..when only the coals remain..and you fan them with a wind..Intense color, not an ordinary orange. We saw no other color at all..only intense brilliant orange.. remember this is a crystal clear night without any cloud and their was also no wind to speak of and no waves crashing on the beach..it is an isolated spot south of the city of Tanga. Anyway, we watch these two lights and as they hoover momentarily I grab my binnoculars..completely forgot about the camera and I had one too! As we watch these two objects hoovering Im looking at them thru the binnoculars..I have to refocus as these objects are too close..middle focus on the glasses. I do not see anything other than the brilliant orange and let me tell you it was hard to even look thru the binnocs as the light was intense. back and fourth use. they probably hoovered for 20 seconds then began coming towards us..not directly but headed south south west at a very slow speed. as they came over the house we were all amazed as we saw no reflection on the ground and no sound overhead..we could only see the brilliant orange..like looking at two orange full moons on a crystal clear dark night up on the top of a mountain...they passed over and continued in the same plane..not going up or down...as we watched one just vanashed and the other continued along until I could no longer see it in the binnoculars. next day I asked people at the lodge if they had seen anything..no one had. they said people start their dinners at 8pm so no one was outside or at the bar.. in the afternoon I asked the house boy whom lives 100 meters west of the beach house if he had seen anything..he responds with excitment..O yes!! and without me saying anything he tells me in the swahili language that he and his wife ran into their house after seeing the first of THREE orange lights..I said, three? he says yes, there was one ahead of the last two. he too said he heard no sound and was dazzled by the brillance of the color orange. I and my wife and friends had had no drinks except tea and coffee, we are not beleivers in UFO's but what we saw on the 26th December 2008 was in all our opinion something completely out of the ordinary for each of us. The first amazing attribute was its color..was an intense brilliant dazzleing orange that none of us have ever seen in the sky. was so bright I was sure there would have been some kind of reflection and so low and slow you would have expected some type of sound...Nothing!! Even looking thru the binnoculars I could only make out the brillance of orange..nothing else. As we all walked back into the beach house I thought about my camera..too late! Next time! To answer your questions: 1. we were renting a beachouse 40 kilometers south of Tanga city. a place called \"PANGANI\" not commercialized at all. We had just arrived that afternoon after a six hour drive from where we live in the city of Arusha, Tanzania. at the time we were just sitting on a chair with our legs up on the short wall sipping cups of tea and coffee..the kids and our other friends were also sitting around the outside dinning room table that is under the veranda too. 2. as my wife was sipping her tea the brilliant orange coming up thru the palm trees cought her attention and thats when she tapped me on my shoulder and said \"LOOK\" 3. The object was definately orange and round in shape. size a bit difficult but we'd guess probably the same size as when you look at a full moon on a clear night. At first we thought it was a fireworks shooting up that was going to explode.. than when it hoovered and did not expolde we were all amazed..than the color told us this was something unusual. 4. the object was glowing bright brillant orange color, was round and not like a disk.. was exactly like the sun looks..and moving like that too.. like a ball moving thru the air...its motions were slow with no sound or shadow on ground and if I might say...when it flew more or less overhead..It was in focus and I was not wearing my glasses which I need for distance.. these two objects as bright as they were and as low as they were should have had some sound and reflective light on the ground ? Again the motion was parallel to the ground when they began moving in our direction. its actions were not threatning and I or our group was not afraid at any time..we all were just bewildered at the brilliance of these two objects. While it moved it stayed in a straight parallel path neither raising nor decending and never deviating from its trajectory. 5. describe my feelings during and after: we were not frightened and neither shocked at the event. just very bewildered and amazed at the intense color. our actions were to follow it out to the parking area from the veranda as it was moving otherwise due to the low hanging veranda we would not have been able to continue to watch it. my action during the event was to call our other friends and kids to see it and also to grab my binnoculars which were close at hand sitting on the veranda wall. Feelings after the event: this was not a normal event.. we tried to figure out what we saw but we could only come to the conclusion it was a UFO. I my self wanted to figure it out so I have talked to many people since trying to make sense of the event. one of those people told me to look on the internet as some people report these events..so thats why im writting to you. I have never done this before. after the event we all had a nice sleep and no one was worred or scared this object might return etc.. 6. how did we lose sight of the object: I lost sight thru the binnoculars, one just vanashed as we watched. the other continued in its same trajectory util I could no longer see it thru the binnoculars. the whole event lasted between 3-4 minutes."],"Viewing Distance":"Unknown","Date Submitted":"12/26/2008 08:40 UTC","Longitude":"39.098759","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-5.069489,+39.098759(14765)&iwloc=A&hl=en\"> mufon case (14765) map </A>","Case Number":"14765","Disposition":"Unresolved","Object Shape":"Circle","Weather Factors":"None","trends":["There have been no other sightings in Tanga","This sighting has never been favorited."],"Latitude":"-5.069489","Date of the Event":"12/26/2008 08:40 UTC"}