{"Case Number":"14764","Summary":"Clearification/Explanation of Original Report from Submitted Octagonal Alien Piece","map":"<A HREF = \"http://maps.google.com/maps?q=39.051365,+-76.632111(14764)&iwloc=A&hl=en\"> mufon case (14764) map </A>","Disposition":"Hoax","Latitude":"39.051365","Object Shape":"Flash, Unknown","Object Flight Path":"Undisclosed","City":"Undisclosed","Region":"Maryland","Log Number":"US-01052009-0006","Date of the Event":"06/24/2008 12:00 UTC","trends":[],"Longitude":"-76.632111","Date Submitted":"06/24/2008 12:00 UTC","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/14764.html.txt","/var/www/straped/mufon/org/14764.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","divs":["Sighting DetailsLast summer on June 2008, I've experienced some abnormal activities and told some of my friends about it. I thought they were opened minded enough to understand me because we have eached experienced something individually in the past and shared about it, but the most recent paranormal experience was on 6-24-2008 which happened to me and I ended up making a fool of myself and reported to MUFON what I should of not reported. Because of that strong bond of trust I had with these two clown friends of mine, one of my \"old\" friends decided to play me with the story I told him, he then added to it and I included it in my report... I then ended up reporting to MUFON that there was an actual tangible Alien piece in my posetion from my friend's encounter which I perceived to be the same experience as mine. This guy, named \"Alex\" gave it to me in exchange for a free PC repair on his laptop, which was rather simple. Anyway, he gave me this piece that look convincingly real, but was actually from a show called \"Smallville\" which I never watched. Right after I told \"Steve\" that MUFON was at my house, he came out with the truth. He said that Alex bought this thing on EBAY and used it to trick me into fixing his computer for free. Well, after I found out the truth of it all, I kept his computer ;) Nevertheless, I did tell my story about the blue light experiences I've had at my address and also about the separate times where I've had some kind of telepathic contact in my sleep with something that was not really from this world- that part was legit. Everything is true in the previous story except for the Alien Octagonal piece. Considering that I had this episode twice (clunking noises in my head which made me feel relaxed) at two separate times, I bought into the hoax... My apologies to MUFON for not reporting this event properly. I really don't know what happened after the \"clunking\" noise in my head... I just know it happened and that it was not a normal thing and my dogs really did go bizerk. I am sorry I let us become a laughing stalk on the internet about this. Let this be a lesson to anyone reporting to this site: \"Any witness to a UFO siting should report their own event and any additional information from another witnesses about the same event should be reported separately by the individual adding the details.\" According to Steve, Alex paid off Steve with a $1,200 professional snap shot zoom camera with all lenses in order to let me go through with this lie. I then reported good information mixed with bad information to MUFON. Mufon came to my house and investigated, I then told Steve and the Steve felt bad and finally tod ld me the truth about the hoax of that Alien Piece. So after making a fool of myself on the MUFON site, I decided to go ahead and clear the record once and for all about this because MUFON will not correct the orginal story and they will not follow through with the investigation they did at my house- they took samples of dirt where grass no longer grows, samples of dried up twigs, and abnormal tree sap from my back yard. I have never heard the results from MUFON simply because of the lie told by my so called \"friends\". Sorry MUFON. So I guess they figured that if my there is a flaw in my story, then they figued that the whole report was a lie. Apparently, partial, but whatever. \"I FINALLY GOT THIS OFF MY CHEST WITH THE TRUTH ABOUT THIS ALIEN PIECE\" SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, SORRY, I did not stick to my own story."]}