{"Disposition":"Unknown","Date Submitted":"11/11/2005 05:30 UTC","Object Features":"Unknown","Case Number":"14778","Source":"MUFON","Weather Factors":"None","City":"Fremont","Country":"United States","divs":["Sighting DetailsI came back from my morning run in Fremont CA. at about 5:30 in the morning on the morning of Nov. 11th 2005. I was facing W-SW when I finished my run, and turned to my right to end up facing NW. I immediately noticed two stars in the constellation Cassiopeia that were very bright. The stars were separated by a distance equal to the width of my thumb at arms length. They were as bright as Venus, and equal to each other in magnitude. I knew the stars were out of place, and thought I was witnessing some strange double supernova. The sky was crystal clear without a hint of clouds. I was thinking about looking them up and finding out what was going on when, as I was looking at them, they both faded simultaneously to the point of invisibility in about 4 seconds. I never took my eyes off of them through the whole event. I would say that I had been looking at them for about 30 seconds. They didn't belong there in the first place. I could not make sense of what I was seeing, and still can't. The stars were stationary the whole time. At first I thought I might be looking at a couple of geosynchronous satellites that were rotating through a position of reflecting to non-reflecting, but the position was too far north of the Celestial Equator. I don't think we can place geosynchronous satellites in orbits that far off of the Celestial Equator can we? I don't know what I saw, but I definitely saw it. I have asked several astronomy buffs, and some of my friends that work with satellites. No answer. This seems to count as a UFO however high it was flying, and I just needed to let someone know other than my circle of friends."],"Sighting Duration":"00:00:30","files":["/var/www/straped/mufon/html2text/14778.html.txt","/var/www/straped/mufon/org/14778.html"],"Object Flight Path":"Stationary","Longitude":"-121.980292","Region":"California","Log Number":"US-01052009-0017","Object Shape":"Star-like","Summary":"Two stars faded from Magnitude of Venus to invisible in ~4 seconds","Date of the Event":"11/11/2005 05:30 UTC","Latitude":"37.55566","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.55566,+-121.980292(14778)&iwloc=A&hl=en\"> mufon case (14778) map </A>","Tags":"City","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around November 11th 2005","This sighting has never been favorited.",""]}