{"Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/14770.html.txt","/var/www/straped/mufon/org/14770.html"],"Longitude":"-79.809213","Weather Factors":"Unknown","Tags":"City","Object Shape":"Flash, Triangle","Date of the Event":"01/03/2009 10:08 UTC","Viewing Distance":"Unknown","Case Number":"14770","City":"White Oak","Country":"United States","Latitude":"40.33757","trends":["There have been no other sightings in White Oak","This sighting has never been favorited."],"divs":["Sighting DetailsI was driving west on Lincoln Way towards the intersection with 48 talking on my phone when I just happend to look to my right and noticed a bright string of lights in an obtuse triangle shaped formation motionless above the Giant Eagle parking lot. I kept looking back at the road and the object. I was thinking \"What the hell? No! No way! It can't be!\". I'm a real bad judge of height and size but I could tell that the thing was huge and close to the ground. The object was dark, It blended in with the night. As I was looking at it more lights started to appear on the edges of it and it was like the whole of the edges lit up with a flash and then went back to just the lights or maybe it was like light was reflecting off of the edge of it. I started to feel slightly nervous with a sinking feeling in my stomach. I told my friend that I had to go because of something, when she asked what I didn't know what to tell her so I just said \"Something! I don't know, I'll call you back!\" I hung up and then had to take my eyes off of it to slow down for the red light and not hit the car in front of me. When I stoped and looked back it was just gone. I then got out of my car at the light and asked the people in the car next to me If they saw it too. They looked nervous and one of the passengers in the back (an older woman) nodded. The light turned green and they sped away. I got back in my car and and made a right at the intersection and parked in the small parking lot for a Toco Bell restaurant. I called my friend and told her about it and and we talked about what I should do. I made a decision to call the local cops and report it. After about 10 minutes an officer showed up and I tried to tell him about what I saw . He dind't really ask me that many questions. He said that there wasn't really that much he could do because there obviously wasn't anything there anymore. He told me I should call Coast To Coast or go on the internet and report it to a ufo group."],"Date Submitted":"01/03/2009 10:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.33757,+-79.809213(14770)&iwloc=A&hl=en\"> mufon case (14770) map </A>","Log Number":"US-01052009-0012","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Object Features":"None","Source":"MUFON","Summary":"Large, dark triangle shaped ship with bright lights turning on."}