{"Source":"MUFON","Log Number":"JP-01052009-0013","Latitude":"26.212401","Date Submitted":"07/31/1945 12:00 UTC","Object Flight Path":"Undisclosed","Country":"Japan","map":"<A HREF = \"http://maps.google.com/maps?q=26.212401,+127.680932(14771)&iwloc=A&hl=en\"> mufon case (14771) map </A>","Object Shape":"Unknown","City":"Chimu, Okinawa","Tags":"City","Region":"Okinawa Prefecture","Date of the Event":"07/31/1945 12:00 UTC","Case Number":"14771","Summary":"1945 Radar contact leading to a interception vector that resulted in no visual","divs":["Sighting DetailsFrom the recently published biography, The Guadalcanal AIR WAR Col. Jefferson DeBlanc's Story Jefferson J. DeBlanc Pelican Publishing Company copyright 2008 DeBlanc passed away in 2007. DeBlanc was a US Marine Corps fighter \"Ace\" and a Medal of Honor recipient for valor in air combat over Guadalcanal. DeBlanc narrates an interesting incident of being guided by ground radar to a radar contact, a \"blip,\" as he flew morning patrol. According to what he'd written earlier on page 153 this incident would have occurred in the vicinity of Okinawa where he was then stationed: \"Finally we were ordered off Ie Shima island to Okinawa, first to Kadena Airfield then to Chimu. We remained here until the war ended.\" The incident. Chapter 26 The Atomic Bomb \"During the first sixteen days of August, there was a nightmare of vectors to \"blips\" on the radar screen which didn't make sense in 1945. I was on morning flight with my division and was to report as usual on station for the two-hour picket patrol over a destroyer at the seven o'clock location. I suddenly received a frantic call from Control to buster (aviation terminology for \"full speed\") to a target at 25,000 feet. We were just climbing through 5,000 feet and I had to drop the full belly tank in order to climb rapidly to intercept the enemy. The vector was perfect and I arrived at 25,000 feet in seconds, but there was no enemy. The radar operators said my target was just a mile ahead. I charged the guns and rockets, looked ahead, but saw nothing. Just then the radar operators said the target was pulling away at high speed and asked me to advance speed to intercept. The blip was off the radar screen in seconds. Nothing we had in those days could travel the full length of a radar screen at that velocity. I laughed and told the operator to stop watching flies on his screen. I even suggested that he check for a leaky capacitor in the horizontal circuit of his scope. This was my first and last encounter with UFOs. After August 16, we were not plagued with any more sightings of this nature. All vectors were normal and within the range and velocity of World War II aircraft.\" Page 163-4"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/14771.html.txt","/var/www/straped/mufon/org/14771.html"],"Longitude":"127.680932","Weather Factors":"Unknown","trends":["There have been no other sightings in Chimu, Okinawa","This sighting has never been favorited."]}