{"Weather Factors":"None","trends":["There have been 5 other sightings in Madison","There were no other sightings in Madison on or around January 5th 2009"],"City":"Madison","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-01062009-0001","Source":"MUFON","divs":["Sighting DetailsParents called and told me to go outside and look up. The Dog had alerted them to a formation of 5 Red Lights in the sky while he was out doing his business. The group of Red Lights were also in formation and when I saw them, but they dropped from 5 to 3 to 1 very quickly each shooting off in a separate direction. I have video of 2 of them together which I hope to upload and it is EXACTLY like what Event ID 14785 described. They were floating like nothing I've ever seen. It looked like the lights of each craft were vertical with one light on top and one light below almost like a vertical bar with lights just at the tips. Point of reference, I grew up 500 yards from a Heli-pad and live 2 miles from the Morristown, NJ airport. I see normal air traffic all day and night everyday. These were not planes or helicopters or like anything I've ever seen. Watched one zig zag away with the solid red light occasionally going dark and then popping up elsewhere all lit up again. Lights did not flash in typical aircraft fashion and they really did just \"Float\" and not move in typical straight lines. The event ended with one craft coming back over me and changing to all white lights. It shifted direction very quickly and jumped around a bit before going dark and heading West over Giralda Farms. Called the Madison,NJ PD and they said they had some reports of \"something\" by the airport but had nothing else to say. Parents called the Morris Township Police who said they had received many calls. Township Police spoke to the Morristown Police who said they looked into it and said it was just someone playing a \"prank with flares\". Maybe it was somehow man made but it was still an incredibly exciting thing to watch. ps Spoke to a friend shortly after and after telling my story he said his brother in law was at a party in late Nov in Bernardsville,NJ and saw the exact same thing."],"Date of the Event":"01/05/2009 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.759823,+-74.417097(14787)&iwloc=A&hl=en\"> mufon case (14787) map </A>","Country":"United States","Region":"New Jersey","Longitude":"-74.417097","Case Number":"14787","Tags":"City","Object Features":"Unknown","Disposition":"IFO","Date Submitted":"01/05/2009 08:30 UTC","files":["/var/www/straped/mufon/html2text/14787.html.txt","/var/www/straped/mufon/org/14787.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cigar, Star-like","Summary":"5 Red UFO's seen over Madison same as Event ID 14785 Morristown<NJ","Sighting Duration":"Undisclosed","Latitude":"40.759823"}