{"Date of the Event":"12/22/2008 08:38 UTC","Latitude":"38.123105","Summary":"Craft hovering above trees about 60 feet in air with solid white lights on top and blue and red strobes on top.","Weather Factors":"Unknown","Region":"Illinois","divs":["Sighting DetailsI will do my best to describe this. Language and punctuation are not my favorite. Where to begin? I was leaving a friends house in Schuline Il. I turned left heading north on chester road toward Sparta. The sparta country club is on your left right before town. As i was driving approaching the club. I glanced toward one of the holes. About sixty feet in the air and not even 150feet from the road. there was a craft plain as day hovering motionless and silent. It was a triangle 60 to eighty feet long per side.and fifteen feet tall. the craft itself was grey maybe charcoal hard to distinguish. Once i realized what i saw i slowed down to about 15 20 mph. Staring amazed how close it was . It had lights top and bottom. On the bottom there was white solid lights 3 of them. Slightly in from each corner.On top there was a red light a third of the way in on one side. opposite of that a third of the way in from the other side. there was a blue light. Both of them strobing toward the sky. Center of the strobes there was a white solid beam. The beam traveled very high in the sky but there was a end in sight. The beam tapered slightly larger going up. Almost like a tree upside down. At this point i slow to a crawl. As I am about strait across from it. The beam and the strobes on top shut off. At this point I got scared and drove home very fast. I watched it with my head turned backwards as i drove away. My house is only a few blocks away.Untill i was out of sight of it the thing did not move. There is not many things that scare me. And i will be honest I am concerned. But that is not it I have another case. TWO days later leaving the same friends house. around the same time. I still had the incident in the front of my mind. I decided to go the back way into town on country club road. A mile down from his house i was driving home. and there was no cars behind me. I continue on and about 2miles from his house out of nowhere. a light apears behind me.it was confusing because there was no vehicles behind me. It was a single bright light. I thought must be a four wheeler or dirt bike.As I keep going i start to get annoyed thinking somebody is messing with me. the light is paceing me following about a hundred feet back. There is a number of hills on the road. So I approach one of the hills and when I left the objects sight going down the hill I punched it sped up as fast as my truck would go. Thinking i would put some distance on the light.When I came up out of the hill to my suprise the light was the same exact distance behind me as before. Now the light has my full attention. So i floored my truck thinking i will out run this thing once and for all. The faster I went the closer it got. Now I am running from this thing and it is maybe thirty feet off of my bumper. Keeping a perfect pace. nowthis is a rural back road with hills and curves not very wide. and I am running 90 or so and this thing aint losing a inch,and i can flat drive. I am staring in my mirrors and driving crazy looking at this light now i see it is 4to6 feet diameterfocused light. And here is what is really weird. behind the light there was a red almost pin like light appeared. Kind of swirling back and forth up and down with almost a tracer effect. But completely in control.It would disapear behind the light and appear on the other side. Almost like a eye looking at you. Now this crazy ride lasted about 3 or 4 miles. At about the end of the road. There is a underpass or (vieduct?)This is kind of off the subject. But if you have ever watched In the Heat of the Night the movie and see the car chase under the underpass right before the fight in the turn style train house. that train house used to sit right on the same turn as the underpass.well at that excact underpass right before it. The light dissapeared as quick as it came. Not making a turn or slowing down. Just dissapeared. Now i dont what this crazy stuff is but it cant be for any good. These are actually not the only times i have seen what I think are ufo's. I have seen two ohter unexplainable sightings just no where near this level of stuff."],"Country":"United States","Object Features":"None","Case Number":"14786","Tags":"City","Longitude":"-89.701766","Object Shape":"Sphere, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=38.123105,+-89.701766(14786)&iwloc=A&hl=en\"> mufon case (14786) map </A>","Viewing Distance":"21-100 Feet, 101-500 Feet","City":"Sparta","Disposition":"Insufficient Data","Log Number":"US-01052009-0025","Object Flight Path":"Stationary,Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14786.html.txt","/var/www/straped/mufon/org/14786.html"],"Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Sparta","This sighting has never been favorited."],"Date Submitted":"12/22/2008 08:38 UTC"}