{"Date of the Event":"01/04/2009 10:05 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14798.html.txt","/var/www/straped/mufon/org/14798.html"],"Disposition":"Unknown","Region":"Illinois","Latitude":"41.582527","divs":["Sighting DetailsOn January 4, 2009 at approximately 10:05 p.m. I saw an object in the sky from my window in my home. I live in Tinley Park, Illinois. I was sitting in the living room reading at the time. I saw the object flying in the same location on 2 different times. The first time I saw the object I was by myself in my living room looking out of the window. The second time I saw the object I called a family member and the family member saw the object as well. The first time I saw the object It looked rather odd and thats what made me notice it. When I first saw it-I remember saying to myself,\"WOW-This can't be.\" It went away but came back several min. later and I called my family member in the room. When I saw it the second time it came again from behind a cloud. I noticed the white light first-it was so clear and large. As the object glided more close is when I was able to see the red and green lights on its sides. It appeared to have a white large flashing light in the middle (the light was very large-almost consuming the whole aircraft) with red and green lights on the sides of it. The white light was flashing brightly and the red and green lights were flashing. I originally felt that it was a air plane or helicopter. But I never seen an airplane or helicopter with a rather large white light and 2 red and green lights on the side and it was flying rather low and It wasnt making any noises. It appeared to be gliding. It was flying so low that I was able to see it very clearly. It was rather fascinating to see. The object finally glided over my home and I didnt see it anymore. It was an amazing site to see. Im usually a skeptic but this was rather unusual and something I will never forget."],"Case Number":"14798","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.582527,+-87.778794(14798)&iwloc=A&hl=en\"> mufon case (14798) map </A>","City":"Tinley Park","Date Submitted":"01/04/2009 10:05 UTC","Longitude":"-87.778794","Sighting Duration":"Undisclosed","Summary":"I saw an object with a large white light with 2 lights red and green in the sky","Source":"MUFON","Tags":"City","Log Number":"US-01062009-0012","trends":["There have been 15 other sightings in Tinley Park","There were no other sightings in Tinley Park on or around January 4th 2009"],"Object Shape":"Oval"}