{"files":["/var/www/straped/mufon/html2text/14793.html.txt","/var/www/straped/mufon/org/14793.html"],"City":"Attleboro","Weather Factors":"Unknown","Latitude":"41.947444","Source":"MUFON","Tags":"City","Log Number":"US-01062009-0007","Object Features":"None","Summary":"Silver metallic object hovering in the East observed travelling S down I95.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Region":"Massachusetts","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was approximately 11:27am and I travelling South down Interstate 195 when I noticed an object hovering over the treeline in the distance to the East. Conditions were cloudy with what appeared to be high altitude cirrus clouds. Initially I believed what I was observing to possibly be an airplane as TF Green airport is very close to this location. From what I was able to observe for approximately 3-4 mins I did not see any discernable wings or \"tail\" on the object. The object also did not appear to get smaller ( as if moving away) or bigger ( as if moving towards ) it appeared to stay the same size and remained stationary. Upon further observation, I observed a disk shape to the object and it appeared to be gun-metal gray in color. It appeared to be lighter in color on the top and darker on the bottom as if it were concave and shadowed on the bottom. I lost sight of the object as the road began to turn in the opposite direction. After this observation I began thinking that perhaps I had observed an air plane. Shortly after, I did observe an airplane at approximately the same distance ( 12 miles or so from the initial observation) and I was able to see wings and also that the air plane was moving away from me. The object that I initially observed appeared nothing like the airplane that I saw 10 mins later down the road. What I saw appeared to be a silver metallic disk shaped object hovering over the woods to the East of Interstate 95. The object appeared to not move at all."],"Object Shape":"Disc","Object Flight Path":"Stationary","Country":"United States","Case Number":"14793","trends":["There have been 8 other sightings in Attleboro","There were no other sightings in Attleboro on or around January 6th 2009"],"Date of the Event":"01/06/2009 11:27 UTC","Date Submitted":"01/06/2009 11:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.947444,+-71.282198(14793)&iwloc=A&hl=en\"> mufon case (14793) map </A>","Longitude":"-71.282198","Disposition":"IFO"}