{"Region":"Florida","Disposition":"Unknown","divs":["Sighting DetailsI was outside my house about 7:30 pm enjoying the night sky when I looked to the west and saw a very large white light circular shape. The light was extremely close to the ground about 2000 ft. and 10 miles away to the west over the everglades. I watch for about 5 minutes and the object never moved. I first thought he was a helicopter with a search light however a helicopter happen to fly in front of the object and clearly was much smaller then what I was seeing. The helicopter was much closer to me so if the object was a helicopter then it would have appeared smaller do to the fact it was further west then the helicopter. I also saw a red light much higher to the north west that also never moved for the 5 minutes but had to be 20,00 ft. and 3x the distance from the object. I went into my house to get my wife and see came out and observed the sight with me. her first thought was it was a planet (Venus) but was in the wrong positon to be venus and clearly to low on the horizion. After watching for another 10minutes and the object never moving my neighbors came by walking and I pointed out the light to them. They were amazed as I was how large and it wasc and never moved position.I decided to get my binoculars to view the object, when I returned the object(light) had moved to the north and west and began to drop in altitude and move away. after 5 minutes I could no longer observe it."],"Object Flight Path":"Hovering then path","trends":["There have been 2 other sightings in Margate","There were no other sightings in Margate on or around January 6th 2009"],"Object Shape":"Circle, Sphere","Longitude":"-80.202306","Object Features":"None, Unknown","Source":"MUFON","Weather Factors":"None","Date Submitted":"01/06/2009 07:30 UTC","City":"Margate","Case Number":"14792","map":"<A HREF = \"http://maps.google.com/maps?q=26.252456,+-80.202306(14792)&iwloc=A&hl=en\"> mufon case (14792) map </A>","Log Number":"US-01062009-0006","Viewing Distance":"Over One Mile","Latitude":"26.252456","Country":"United States","Tags":"City","Sighting Duration":"00:40:00","Summary":"Large oval shape object very bright in western sky on the horizon 15degree","Date of the Event":"01/06/2009 07:30 UTC","files":["/var/www/straped/mufon/html2text/14792.html.txt","/var/www/straped/mufon/org/14792.html"]}