{"trends":["There have been 7 other sightings in Batavia","There were no other sightings in Batavia on or around January 6th 2009","This sighting has never been favorited.",""],"Latitude":"43.005006","Date Submitted":"01/06/2009 06:30 UTC","Case Number":"14799","Date of the Event":"01/06/2009 06:30 UTC","Longitude":"-78.177637","files":["/var/www/straped/mufon/html2text/14799.html.txt","/var/www/straped/mufon/more/14799_submitter_file1__case14799-b.JPG","/var/www/straped/mufon/more/14799_submitter_file2__case14799-c.JPG","/var/www/straped/mufon/org/14799.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.005006,+-78.177637(14799)&iwloc=A&hl=en\"> mufon case (14799) map </A>","Log Number":"US-01062009-0013","Object Flight Path":"Straight-line path","Disposition":"IFO","Weather Factors":"Snow, Light","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"New York","Tags":"City","City":"Batavia","divs":["Sighting DetailsTook my dog out to see a dog friend of his that was in a vehicle in my driveway ( his owner was in my house ). As I opened the door to the van fast moving lights caught my eye and I looked up. Across the street from my house is an empty field with a treeline at the farthest end of it which faces my house. There were two very bright round looking balls of light flying at a very high rate of speed, one directly in front of the other. I looked as hard as I could to see what details I could see which was difficult because they were moving so fast. I saw no blinking lights at all and looked for these intensely because there is a lot of air traffic in this area and wanted to be certain of what I was seeing. Also there was absolutely no noise being made by these lights which I am almost always able to hear on planes( sometimes the planes noise is heard before the plane is in sight and sometimes long after the plane has been seen ). But I heard no noise from these lights at any time before, during, or after they were in my field of vision. It happened so quickly and they were only witin my sight for 20 seconds or so. I was trying to make some kind of sense of what they could be especially when I first saw them.At first I thought maybe they were flares of something \" fired \" by someone but it became clear that these objects were flying under their own power. For the time I was able to see them, they stayed in their configuration one in front of the other until I couldn't see them anymore.I can't say how far away the were because I am terrible with measuring in this way, however I could show someone. I went into my house and told my significant other and our friend what I had seen and described to them exactly what I had seen. The sky tonight is very gray and overcast with light snow falling. There are no stars or moon out tonight. When I take my dog out I always look at the sky and have become very familiar with how it normally looks and what is usual to be in it. These objects were not usual. I feel as though I have witnessed something not typical."],"Country":"United States","Viewing Distance":"101-500 Feet","Summary":"Sky very gray. looked across street to field and saw 2 bright balls of lite flying one in front of other very fast, no noise, no blinking lites.","Object Shape":"Circle, Fireball","Source":"MUFON"}