{"trends":["There have been no other sightings in Moxee","This sighting has never been favorited."],"Case Number":"14794","Viewing Distance":"101-500 Feet","Latitude":"46.563403","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Region":"Washington","Date Submitted":"09/05/1979 12:00 UTC","Disposition":"Insufficient Data","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=46.563403,+-120.398767(14794)&iwloc=A&hl=en\"> mufon case (14794) map </A>","City":"Moxee","Country":"United States","Tags":"City","Summary":"Object on highway 24","Date of the Event":"09/05/1979 12:00 UTC","Source":"MUFON","Log Number":"US-01062009-0008","divs":["Sighting Details(This event was remembered as two separate events in my mind and were only remembered after over 10 years. There seemed to be significant \"lost-time\" related to it. And my friend Bob doesn't remember it at all. At some time later, I was asked if I believed in UFOs and I answered I had seen three. The first was when I was around 5 year old and don't remember seeing it, but remember being called into the house, on a night when me and my siblings were sleeping outside, by my older sister because she had heard a report on the radio about a UFO in the Yakima area. The second time, and third times were remembered separately, but happened on the same road at the same time.) My friend Bob and I had recently moved from Yakima to Pasco Wasington and were returning to Yakima to pick up the remainder of our possessions. It was late and we were trying to get back to Yakima as soon as we could. We took the old highway instead of the newer road because we felt we would have less chance of getting a ticket. We made it past the \"Silver Dollar Cafe\" and proceeded to travel down the road at a high pace. On highway 24 there is a long stretch of road that travels straight for nearly 10 miles at the bottom of a long valley surrounded by treeless rounded hills on both sides. (I had traveled this road many times traveling from Yakima to see my father who lived in Othello, after the my parents divorce.) Because of this straight road, I felt that I could put the pedal to the metal and remember going 90 MPH. I was driving my 1960 Continental \"boat.\" I remember thinking that if something happened and I was forced off the road, all I needed to do was keep the wheels straight and I would be ok. I felt safe in this \"boat.\" The first part of this two-part memory was related to seeing a \"object\" in the air in front of me, just off the road. It appeared out of nowhere and my first thought was that it was a helicopter, but the lights weren't right. I sped up in order to get closer look, but the object stayed in the same relative position; just off the road about 100 feet to 100 yards ahead. (It's hard to say how far without knowing it's size.) The object was a \"cigar\" shape with light around the middle. The lights seemed to be traveling around the center of the object , from left to right, instead of flashing like a plane or chopper would. The lights weren't the same as an aircraft. More like \"chasing\" Christmas lights of many colors. I can remember leaning forward and peering throught the windshield in order to get a better look and asking my friend Bob, \"Can you see that?\" I don't remember his response. Suddenly, the object appeared to vanish although, I seemed to think that it instantly disappeared over the ridge to the north. That's what my first memory consisted of. The second memory happened in the same place at the same time, but \"felt\" separate from the first event. In this memory, I can remember traveling at a high rate of speed, 90 Plus, when suddenly my headlights went off. That's when I felt that if I just kept the steering wheel straight and didn't over correct, we would be ok. When the lights went out, I remember applying the breaks, not radically, but deliberately. I breaked, and then somemore, when the headlight suddenly came back on. At that time, I let off the breaks and must of decided to go on. When I did, the lights again went off. I then dedided that it would be best that I got off the road because without lights, another car may slam into me. I didn't want that, so when the lights came back on, I looked for a place to get off the road. When I did, I noticed a \"field access\" road to the north of the road that entered a alfa-alfa field. My lights went off again, then just as we got to the field the lights came back on in time for me to drive into the field. The lights worked perfectly after that. I remember Bob and I getting out of the car and feeling the immediately need to \"pee.\" I can't really say, how long we were in the field, but seem to remember getting into Yakima much later that the hour or less it should have taken us to get there. I have wanted to report this incident for many years, but decided to report it after seeing a History Channel show on MUFON. I know it is a long time after the event, but wanted to add it to your database of sightings. Perhaps there were other siteings at that same time that would colaberate my report."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14794.html.txt","/var/www/straped/mufon/org/14794.html"],"Longitude":"-120.398767"}