{"Latitude":"32.386828","Source":"MUFON","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=32.386828,+-83.35461(14806)&iwloc=A&hl=en\"> mufon case (14806) map </A>","divs":["Sighting DetailsJanuary 6th, 2009. 10:25pm. My friends and I were driving on a back road outside of Cochran, Georgia. We pulled over to stop and have a cigarette break between two open fields of cotton, with a wooded area further up ahead of us beyond the road, and we were admiring the clouds. The weather forecast had indicated a front moving in from the northwest, and the clouds were moving very quickly across the night sky. We were catching quick glimpses of the stars behind the clouds as they passed by and conversing about the coming week of school for us. As we were watching, suddenly an orb appeared from the direction the clouds were moving towards, and began to slowly move against the wind, in the opposite direction of the cloud movement. It was rather slow, but gradually moved across the sky just above the clouds. We followed it as it moved from just above the horizon in the distance, until it was right above us. As we were watching this, we were all excited and bewildered. We thought it may be a type of plane from the local Air Force base in Warner Robins, a mere 30 minute drive by car. But we concluded it certainly was NOT a plane of any kind, and one of my friends [who is involved with aviation] assured us it was certainly not anything he'd ever seen before. We watched the light as it moved, and then I noticed that there were more of these spherical lights approaching. And sure enough, more and more lights, which were bigger than stars and kind of pulsating, moved in the opposite direction of the clouds in our direction, and then overhead and past us. We watched, waiting for another break in the low cloud cover to give us a better glimpse of them all, and one of my other friends noticed the lights were moving closely together, in what appeared to be a perfect triangle. We got to see this better when the clouds broke for a moment, and we saw what appeared to be more than one perfect triangular shapes of light. We all were pointing out a separate triangle in the sky and were amazed at the quickness these appeared from the orbs we'd just seen. Each one had a lighted orb making up the corner, forming a perfect triangular shape. And they moved together, still moving against the wind and the clouds. I thought about this rationally and couldn't come up with an explanation, as I could plainly see the stars in their unmoving state, while these objects were moving quite readily across the night sky. And then when the clouds broke and we all could make out the shapes, we noticed they blocked out the stars above them as they passed by. They were massive objects, perhaps even forming into a single giant formation or craft or something. But we all watched as we saw the constellation of Orion slowly black out as this thing passed above us. At this point we were all pretty much amazed, and kind of freaked out that we were witnessing this as it happened. Suddenly there was a small flash of what appeared to be orange light through the clouds behind the object we could make out in the cloud break. As we watched it, the lights pulsed and then quickly moved off into the approaching cloud cover. They moved much faster than they did before. We all heard a low hum followed by a type of high-pitched whining noise as this happened; and when the clouds cleared again within 30 seconds, there was nothing at all but the few stars we could see to the horizon. Immediately after this happened there was a massive gust of wind that was much stronger than the previous wind we'd been experiencing. It died down within a minute or so back to what it was like before. We waited to see if we could see anything else, but there was just the quickening cloud cover and the stars as a backdrop to a fleeting experience. We continued to smoke, and after a few minutes of not seeing anything else decided to get back in the car and head back to the dorms of our school. Needless to say we all saw something, and we believe it may have definitely been some type of UFO. But we all witnessed it and upon thinking carefully and rationally about it can't come to a adequate explanation to explain what we saw."],"City":"Cochran","Date of the Event":"01/06/2009 10:25 UTC","Date Submitted":"01/06/2009 10:25 UTC","Longitude":"-83.35461","Summary":"Witnessed multiple orbs of light, that either merged into or form the shape of a large triangular craft","Tags":"City","Country":"United States","Object Features":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Weather Factors":"Windy, Medium","trends":["There have been no other sightings in Cochran","This sighting has never been favorited."],"Log Number":"US-01072009-0002","Case Number":"14806","Viewing Distance":"Unknown","Object Shape":"Flash, Sphere, Triangle, Unknown","Region":"Georgia","files":["/var/www/straped/mufon/html2text/14806.html.txt","/var/www/straped/mufon/org/14806.html"],"Sighting Duration":"Undisclosed"}