{"Date Submitted":"08/31/1988 03:30 UTC","Longitude":"-94.223369","Latitude":"43.075236","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/14802.html.txt","/var/www/straped/mufon/org/14802.html"],"Case Number":"14802","Disposition":"Unknown","Country":"United States","Summary":"Hovering silver sphere low in sky","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Algona","There were no other sightings in Algona on or around August 31st 1988"],"Weather Factors":"None","Tags":"City","Object Shape":"Circle","Date of the Event":"08/31/1988 03:30 UTC","Object Flight Path":"Stationary","City":"Algona","Region":"Iowa","Log Number":"US-01062009-0016","divs":["sighting detailsit's been ages since a sighting i witnessed but i felt i needed to pass it along. back in 1988 on the outskirts of my home town (titonka, ia), i, along with a friend saw a hovering silver sphere low in the sky over an open field near a tree. we were driving west 3 miles from town and it was to our left. we stopped and both witnessed the object for maybe a couple minutes...it was silent and motionless--it then either shot horizontally in the distance away from us (but not up) or it shrunk in upon itself. it looked similar to a mylar balloon but balloons don't float in mid air then speed away in a clean smooth line. distance from us was approx. 250-300 yards. we both agreed it wasn't just something easily dismissed however my friend denies the possibility of a ufo. i believe it was. this account happened before the widespread sightings of silver spheres in recent years, so influences from tv or news are not a factor in what we saw. given the distance from the road and the height from the ground along with its relationship to the tree, i wouldn't say the object was much larger than a small car, if that. time of sighting was around 3:30pm in september\\october. clear visibility."],"Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=43.075236,+-94.223369(14802)&iwloc=A&hl=en\"> mufon case (14802) map </A>"}