{"map":"<A HREF = \"http://maps.google.com/maps?q=41.392176,+-81.433536(14805)&iwloc=A&hl=en\"> mufon case (14805) map </A>","Latitude":"41.392176","Disposition":"Insufficient Data","Source":"MUFON","Country":"United States","divs":["Sighting Details On the above date I was driving west on Hawthorne Pkwy in the Cleveland Metroparks South Chagrin reservation. As I approached Harper Ridge picnic area, I noticed a very bright, white light in the west-south west sky. I had originally seen and reported this same type of light back in June of 2008 but during that incident the light dimmed and within ten seconds or so was gone and did not return. I thought to myself that it would be weird if this light went out like the light in '08 and just to see what would happen I shined the spotlight of the patrol car I was driving at the light. When I turned off the spotlight, the light in the sky dimmed and went out. I immediately turned around and drove into Harper Ridge, parked and grabbed my video camera, cell phone and binoculars. For approximately the next ten to twelve minutes the light in the sky randomly dimmed, went out completely and came back on, all while remaining motionless. When the light would go out it would come back on in the same place. At times the light was so bright that it lit up the clouds surrounding it(like the moon on a cloudy night), although these \"flares\" seemed to be the exception rather than the rule; The light mostly stayed the brightness of a bright star. Whenever it dimmed and went out there were no other lights in that area either flashing or steady. Through binoculars the light appeared to have a definite center and did not look like a spotlight or diffused light from below. After about ten to twelve minutes I decided to drive to a nearby golf course that provides a clearer view of the sky. While driving to the course, the light was out of my view and by the time I got there(about 5 mins), the light was gone. I stayed at the course for about another 30 mins but the light did not return. I called my wife and my sister to have them witness this event while I was at Harper Ridge but neither could see the object from where they were. I was able to capture about two and a half minutes of video of this object. In the videos, the light is visible above and to the right of lights from the city of Solon. Even though the sky was not very cloudy and was bright that night, in the videos the sky is just black. Also, the light starts to dim toward the end of both videos(after the first it stayed out for about 30-45 seconds then came back; after the second I drove to the golf course) but neither video catches the light coming back on. Just a note of caution, if the audio comes through you may hear some coarse language from me. If you're offended by that you may want to lower the volume on your computer."],"Tags":"City","Region":"Ohio","Case Number":"14805","Object Features":"None","Weather Factors":"Unknown","Date of the Event":"01/03/2009 07:30 UTC","Summary":"Bright light in sky slowly dimming","Object Shape":"Circle, Star-like","files":["/var/www/straped/mufon/html2text/14805.html.txt","/var/www/straped/mufon/org/14805.html"],"Object Flight Path":"Stationary","City":"Solon","Longitude":"-81.433536","trends":["There have been 4 other sightings in Solon","There were no other sightings in Solon on or around January 3rd 2009","This sighting has never been favorited.",""],"Date Submitted":"01/03/2009 07:30 UTC","Log Number":"US-01072009-0001","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile"}