{"Disposition":"IFO","Object Flight Path":"Stationary","divs":["Sighting DetailsI was taking the N train (an elevated subway train) from Queens into Manhattan when I saw a shiny silver oval-shaped object hovering over inner queens. I noticed it when I looked out of the left side window of the train as we were passing 36th avenue stop. I got up and stared at the object until it was ultimately obscured by a bld when we turned into Queensboro Plaza. The train went underground, and I went to work not paying it too much mind as there are often blimps around Shea Stadium. A half hour later at work, I happened to look out the window at work (I work on the 50th floor of a bld in midtown) when I saw that same object hovering in the direction of New Jersey. I looked away briefly to say something to the person next to me and it was gone when I looked back. Shortly afterwards a helicopter flew from behind a bld seemingly much closer to me. If there was something that was not supposed to be there, perhaps the pilot saw it too, and perhaps he or she is reading this now. I might have dismissed this had I not seen the same object again on the other side of Manhattan. Also odd is that any blimps in this area would be blue, have a Met Life or similar advertisement on it I would think. This was bright silver. Note, it was VERY cold for this area that day, in the low 20s if I recall. Not sure if that helps rule out blimps. I keep hearing more and more about sightings in this area. Hope this helps piece together the puzzle."],"Tags":"City","Log Number":"US-01072009-0004","Weather Factors":"Unknown","Country":"United States","City":"New York","Latitude":"40.763452","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around December 30th 2008"],"files":["/var/www/straped/mufon/html2text/14808.html.txt","/var/www/straped/mufon/org/14808.html"],"Case Number":"14808","Object Shape":"Blimp, Cigar, Disc, Oval","Summary":"Shiny oval-shaped object over Queens, New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.763452,+-73.924034(14808)&iwloc=A&hl=en\"> mufon case (14808) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/30/2008 09:15 UTC","Object Features":"None","Region":"New York","Date of the Event":"12/30/2008 09:15 UTC","Sighting Duration":"Undisclosed","Longitude":"-73.924034"}