{"map":"<A HREF = \"http://maps.google.com/maps?q=41.444816,+-74.015696(14817)&iwloc=A&hl=en\"> mufon case (14817) map </A>","Latitude":"41.444816","Summary":"During fireworks and lightning looked up to see a HUGE saucer shaped object sitting almost on top of local \"mountain.\"","Date Submitted":"07/04/1965 12:00 UTC","Disposition":"Unknown","Longitude":"-74.015696","Object Features":"Dome, Window(s)","divs":["Sighting DetailsIn the village of Cornwall-on-Hudson, NY there was a July fourth celebration at the farm of a local citizen every year. In 1965 I was 13 years old and was in the pageant that year at the farm along with a few friends of mine. After the pageant was over, we settled down next to, and a little under, a wagon which was there because it had started to thunder and lightning as we waited for the fireworks to begin. The fireworks did start. Suddenly, there was a tremendous flash of lightning at the same time a firework went off in the sky. I looked up and saw an absolutely HUGE saucer shaped object sitting right over the \" mountain \" which we were next to. If this is really classified as a mountain it's not a large one, since we, as kids, used to climb it frequently, although it is pretty high and gives a nice view of the local Hudson Valley. The mountain is called Round Top. After seeing the object my friends and I all, almost at the same time decided it was time to leave the area although we really didn't dicuss what we had just seen. Come to think of it, this topic was never dicussed amongst us in any of the remaining years we were together. At the age of 13 I was pretty un-nerved by what I had seen and had to walk home alone, needless to say I ran most of the way. When I got home I told my Mom and Dad what I had seen but they didn't believe me even though they frequently said they would love to see a UFO. ( There were a lot of sightings in the area at this time though I don't remember hearing too much about them at that time.) As to the object that I saw this night.......... it was HUGE but I have know way of describing in writing just how big it was. It was hanging there not moving at all. There was what I thought to be a window which I assumed wrapped all the way around the saucer which was opaque. There were no panes in the window or any kind of divisions. There were no beings prresent in the windows. But there was an orange strobe-type light which went around the inside of the window in a rotating or pulsing fashion. After I looked up and saw the craft, I looked at it briefly, turned my head away, looked back up and it was gone. I did not hear anyone at the farm discuss seeing this object either on that night or ever."],"Log Number":"US-01072009-0013","trends":["There have been no other sightings in Cornwall-on-Hudson","This sighting has never been favorited."],"Object Flight Path":"Stationary","Weather Factors":"Lightning, Light","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/14817.html.txt","/var/www/straped/mufon/more/14817_submitter_file1__14817drawing.jpg","/var/www/straped/mufon/org/14817.html"],"City":"Cornwall-on-Hudson","Viewing Distance":"Unknown","Region":"New York","Object Shape":"Disc","Date of the Event":"07/04/1965 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"14817","Tags":"City"}