{"Case Number":"14813","Weather Factors":"None","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI walk every morning, seven days a week, like clock-work from 6 30a.m. til 7 07a.m. It is winter and lately the mornings have been exceptionally dreary, dismal, dawn is slow in coming. This morning was clear, no clouds and light was beginning to herald in the east but the sky was still dark, pinpoint stars above. I was walking west on the right side of a three small ponds. I look'd up and saw a Saturn like disc. At first, I thought it was either Saturn or Venus or perhaps Jupiter, but I didn't think the timing of the cycle was right but sometime positions seem to change over night, but truth told, you just are not observant of the slowly shift until one day you notice and it is a significant shift. Not the case, the opaque light begin to move forward directly toward me, I noticed it at 3 o clock in the sky. I stopp'd, began to observe. It was moving lazy but not like an airplane. There was no accompanying noise. I watch'd it. Then I heard a noise and so I thought, \"Aha, it is an airplane.\" It had no blinking lights. Just look'd like Saturn or Venus moving in the sky. Then I saw the culprit, the REAL AIRPLANE. I had an airplane to compare the moving object with. The UFO was moving lazily yet more smooth than the airplane, as if, it were in a different sort of atmosphere. I watch'd it move over me at 12 o clock, then head toward the S.E. and as it left, It became smaller and but not dimmer. Truth, I feel as if \"there are mysteries that are Being Reveal'd.\" My study this morning was from 1 Corinthians 2--\"no, we speak of God's secret wisdom among the mature,but not the wisdom of this age or of the rulers of this age, who are coming to nothing.\" In Greek, the word mystery is translated Musteriom--and we as \"modern minded people\" think of mystery as something unknown-but the truth of the Greek work, Musterium-closer interpretation is \"sacred secrets.\" So I felt--as if there are things TO KNOW THAT ARE RECEIVED WHEN YOU RECEIVE ON A DEEPER LEVEL. Quite simple, really."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.556553,+-97.14253(14813)&iwloc=A&hl=en\"> mufon case (14813) map </A>","trends":["There have been 16 other sightings in Waco","There were no other sightings in Waco on or around January 7th 2009"],"City":"Waco","files":["/var/www/straped/mufon/html2text/14813.html.txt","/var/www/straped/mufon/org/14813.html"],"Date of the Event":"01/07/2009 06:46 UTC","Longitude":"-97.14253","Country":"United States","Date Submitted":"01/07/2009 06:46 UTC","Summary":"Another Sighting, approximately same time.","Source":"MUFON","Disposition":"Hoax","Log Number":"US-01072009-0009","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"31.556553","Tags":"City","Object Features":"None","Region":"Texas","Object Shape":"Disc, Saturn-like"}