{"Summary":"Five bright lights in a tri-angle then L shape.","map":"<A HREF = \"http://maps.google.com/maps?q=40.802937,+-74.476674(14811)&iwloc=A&hl=en\"> mufon case (14811) map </A>","Source":"MUFON","Date of the Event":"01/05/2009 08:38 UTC","Latitude":"40.802937","files":["/var/www/straped/mufon/html2text/14811.html.txt","/var/www/straped/mufon/org/14811.html"],"Viewing Distance":"Unknown","divs":["sighting detailsat 20:35 my wife went outside to have a smoke, she came right back inside to tell me about the strange lights outside. we live very close to the local airport, so weird lights in the sky don't realy phase me, but the look in my wife's eyes made me rush to see. i look up to the ne sky to see five very bright lights, keep in mind that i have an unobstructed view of the horizon around my home. no cell towers, no chimeny stacks, nothing. to see five red lights in the sky in such a configuration saw startling to say the least. the lights were in a backwards l formation, 1 high, 4 across. the lower 2 inside lights started to oscilate back and from each other. at one point a helicopter of unknown owership headed twords the lights, at that point they started to leave the area, heading in an east direction. people say the lights look like they were falling but technicaly if they were going away from you they would apear as if they were dropping. this was the local newspaper's take of the incident http:\\\\www.dailyrecord.com\\apps\\pbcs.dll\\article?aid=200990105023"],"Region":"New Jersey","Object Flight Path":"Hovering then path","Tags":"City","Disposition":"IFO","Country":"United States","Case Number":"14811","City":"Morristown","Weather Factors":"None","Log Number":"US-01072009-0007","Object Shape":"Unknown","Longitude":"-74.476674","Date Submitted":"01/05/2009 08:38 UTC","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Morristown","There were 3 other sightings in Morristown on or around January 5th 2009"],"Object Features":"None"}