{"Tags":"City","Case Number":"14812","Summary":"Dark shadow like an oblong bubble that turned into 2 lights as it speed away.","Weather Factors":"Unknown","Object Features":"Unknown","Country":"United States","Date of the Event":"12/26/2008 10:30 UTC","Disposition":"IFO","Latitude":"33.741404","files":["/var/www/straped/mufon/html2text/14812.html.txt","/var/www/straped/mufon/org/14812.html"],"Object Shape":"Unknown","Longitude":"-116.40507","City":"Rancho Mirage","Sighting Duration":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.741404,+-116.40507(14812)&iwloc=A&hl=en\"> mufon case (14812) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 4 other sightings in Rancho Mirage","There were no other sightings in Rancho Mirage on or around December 26th 2008"],"divs":["sighting detailsmy 2 daughters and i were on the golf course looking up at the stars when my eldest and i saw this shadow come from the east towards the mountains heading westerly. it was at a high altitude. the shadow was more like a heat bubble (vapor bubble)that slightly distorted the stars. imagine a convex glass paper weight being drawn across newspaper print. the stars were distorted. it was obviously a defraction of the light. the shadow raced across the sky from our left (we were facing south) to overhead. there was one than another in sequence. they momentarily paused and shot to the west. as the shadow moved towards the mountains we saw two distinct small spheres of light that were pertectly parallel and traveling at the same speed, exceptionally fast. there was no noise and they covered a significant amount of distance in seconds. from the shadow over head to out of sight over the mountains and beyond took approximatley 3 seconds. there were no blinking lights, like an aircraft just two distinct small round lights as it passed. it was if these spheres were pushing through the atmoshpere like a boat\\submarine pushes throuhgh water. i was not sure what the object was, but it sure moved fast. i don't know if this means anything but that night there was a low level earth quake in the desert."],"Log Number":"US-01072009-0008","Object Flight Path":"Straight-line path","Date Submitted":"12/26/2008 10:30 UTC"}