{"Viewing Distance":"101-500 Feet","Latitude":"42.876112","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Pavilion","There were no other sightings in Pavilion on or around November 30th 1985","This sighting has never been favorited.",""],"Region":"New York","Object Features":"None","City":"Pavilion","Date of the Event":"11/30/1985 12:00 UTC","divs":["Sighting DetailsI think it was 1985, in December, my daughter and I were going home having just finished grocery shopping. While driving along I thought I saw something amiss out of the peripheral vision on my right side. I kept trying to get a better look at what this was but it was difficult to do while driving. I asked my daughter if she saw anything? She said she did but didn't know what it was.I saw orange lights which were very large but couldn't tell what, if anything, they were attached to. I knew something odd was \"up\" and decided to pull the car over to the side of the road. As I moved to get out of the car, my daughter said something like \" don't get out mom you don't know what that thing is.\" I got out. As I looked up all I could see was an enormous dark \"thing\" gliding over the tops of the trees. It was absolutely silent. Then I noticed orange lights on it and it took me a minute to realize that there were three of them (lights).Once I focused on the lights, I was able to make out the shape of this thing and saw that it was a triangle or arrowhead shape. It was so large and moving so slow that I was able to watch this object as it just glided over top of us. The orange lights seemed to be at, or near. the point of each corner of the triangle. They glowed and pulsed. After I could no longer see this object, we drove home. Told my husband at the time but he was fairly skeptical."],"Disposition":"Insufficient Data","Log Number":"US-01072009-0014","map":"<A HREF = \"http://maps.google.com/maps?q=42.876112,+-78.022883(14818)&iwloc=A&hl=en\"> mufon case (14818) map </A>","Weather Factors":"None","Source":"MUFON","Object Shape":"Triangle","Longitude":"-78.022883","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"14818","files":["/var/www/straped/mufon/html2text/14818.html.txt","/var/www/straped/mufon/more/14818_submitter_file1__14818drawing.jpg","/var/www/straped/mufon/org/14818.html"],"Date Submitted":"11/30/1985 12:00 UTC","Tags":"City","Summary":"Driving home saw something out of the corner of my eye off to the left in the sky. Got out of car and saw a HUGE triangle shaped object move very slowly and quietly just over the treetops."}