{"Summary":"Weird ligths flashing following pattern like surrounding this valley.","Source":"MUFON","Object Shape":"Flash, Triangle","Sighting Duration":"02:00:00","Log Number":"US-01072009-0015","Latitude":"33.766687","Longitude":"-116.359177","Weather Factors":"Unknown","divs":["Sighting DetailsJanuary,05 2009...Normally when I'm home,I go to smoke at the patio of my aparment;so like always sit on my chair and look at the sky.When I saw this weird flashing light coming east towards west...So I follow it for a couple minutes;it was like floating not like the versions that I know about crazy manuvering,so I turn my sigth back to see another ligth doing the same.Flashing red and white ligth,I came inside to ask my roommate to go outside and check the ligths;to my sorprise more ligths were on view.We spend some minutes looking aroud and there were some coming back west towards east by San Jacinto Mountains.I spend about 1:00 looking at this fenomenon;so I decided to call NBC news to report this ligths.Next morning around 10:30AM I so a triangular object following same pattern. Tuesday nigth at work explain to a couple of coworkers what I saw,so I came outside of the restaurant about 18:35PM and looking to the sky to found out the ligths were on;so I ask my coworkers to see them.They think the ligths are planes.This event is been happening for 3 days now. I reported to news and police deparment and they said nobody has report nothing so we will check on it.I have no cameras to photograph them.I hope somebody else will come forward with reports or pictures or videos of this event.Thank you. Sincerelly."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.766687,+-116.359177(14819)&iwloc=A&hl=en\"> mufon case (14819) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/05/2009 10:30 UTC","City":"Palm Desert","Object Features":"Unknown","Case Number":"14819","Date Submitted":"01/05/2009 10:30 UTC","Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/14819.html.txt","/var/www/straped/mufon/org/14819.html"],"Disposition":"IFO","trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around January 5th 2009"],"Country":"United States"}