{"divs":["Sighting DetailsIt was the summer of 1982. I was 14, living in Eliot, Maine - a small town across the river from Portsmouth, New Hampshire. Our house was empty, as we were moving to Alaska that week, and the movers had already taken our belongings. It was dusk, and I was upstairs in my room, laying in my sleeping bag, listening to the radio, and looking out of the window which no longer had curtains. Suddenly I saw a black, geometric object zig-zagging rapidly in the air above the treeline of the woods behind my house. Its distance from me at this point was about 1.5 football field lengths away. The zig-zag motion reminded me of an air hockey puck, with seemingly instantaneous changes in direction. Even weirder was that it seemed to disappear and reappear during its trajectory - seeming to 'skip over' parts of it's travel. It was zig-zagging, but its general direction of travel was towards me. The object kept its height in the air constant, about 5 feet above the trees. I got up and kneeled at the window to get a better look, but could no longer see it. The way it moved made the sight seem unreal, and I stayed kneeling by the window for a few minutes to try to see the object again, but did not. I could not comprehend what I had seen. As I started to look away from the window to go back to laying down, out of the corner of my eye, I noticed the object right outside the window, perfectly still, and silent. It was at the height of my window on the second story, and only 20 feet away. It looked like it was made of metal, a dull gun-metal black, with no windows, lights, doors or seams of any kind, but it did have a few small protrusions which looked like instrumentation - giving me the impression the object was some sort of machinery, rather than just a geometric shape. It was the approximate size of an automobile. It's shape was a sort of trapezoid - a square or rectangle 'front' and a larger square or rectangle in the back, so the craft tapered from the back to the front. I had absolutely no fear of the object - only curiosity as to what it was I was looking at. I got to observe it for about 4 seconds, then it left in an instant. It left so fast, that I could just barely tell that it left in a direction, rather than just disappearing. The object left in the opposite direction it came from. And though the craft seemed to have a front and a back, it did not turn around before reversing its direction. There was no electromagnetic interference or missing time, as evidenced by the music on the radio. When the song on the radio ended, the dj came on saying that he was getting inundated with calls about some object seen in the air. I called the radio station as well, and told the dj that I too had seen the object, but that was as much as I told him. I have never heard any other ufo report describing a craft shaped like this. My whole life, I rarely thought about this experience. Not until recently, when I saw a show on ufo's describing the same flight characteristic, did I really start to think about my experience, and realize that what I saw was a ufo. I am an engineer now, and so understand that this craft displayed flight characteristics which defy our understanding of physics. It had no wings or control surfaces of any sort, and was entirely silent. It didn't need to move to stay aloft. It seemed unaffected by gravity or inertia. It had the ability to change speed and direction instantaneously, and it had sit motionless in the air. Supposedly, there were a lot of people who saw this craft and called that radio station that night. I'm hoping that there are records of this event somewhere. Military bases are nearby. There were no helicopters or other aircraft in the area. Weather was clear, light levels were still adequate to get a good look at the craft. There were no smells or sounds, nor any pictures or video taken that I know of."],"Latitude":"43.153143","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"14815","Viewing Distance":"Unknown","Object Shape":"Other","Country":"United States","Object Flight Path":"Undisclosed","Region":"Maine","trends":["There has been one other sighting in Eliot","There were no other sightings in Eliot on or around June 12th 1982","This sighting has never been favorited.",""],"Longitude":"-70.800054","City":"Eliot","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.153143,+-70.800054(14815)&iwloc=A&hl=en\"> mufon case (14815) map </A>","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14815.html.txt","/var/www/straped/mufon/org/14815.html"],"Summary":"UFO close up outside my window.","Log Number":"US-01072009-0011","Object Features":"Undisclosed","Date Submitted":"06/12/1982 12:00 UTC","Date of the Event":"06/12/1982 12:00 UTC","Weather Factors":"Unknown"}