{"Date Submitted":"06/11/2008 07:10 UTC","divs":["Sighting DetailsPhoto taken from moving car on June 11, 2008 at 7:10 a.m., while on our way to Abilene (home to Dyess AFB), for a doctor's appointment. We (my husband and I) were driving west 1-20 and I was in the passenger seat. I noticed a cumulonimbus cloud top with an odd feature, similar to a pyramid, so I pulled out my camera (Sony Cybershot) and took a picture, then stuck the camera back in my purse. I didn't download the picture until a month later. I recently decided to go through all of last year's photos and delete ones I don't want to keep. That's when I noticed this photo, that I took through the car window. The landscape and clouds are blurry but I noticed the buzzard soaring in the sky was in fairly good focus, due to the fact that he too, was moving along in the direction we had been heading. It was while I was looking at the buzzard, that I noticed some tiny white specks, much higher up and behind the bird (top center of frame). I zoomed in on the specks. Two specks became 4 and then OMG, there are dozens of them, some in triangle formations, others in line with each other and they are all over the sky. I can't tell for sure if they are balloons, or what? I have not cropped or changed the photo in any way and at the time I had just washed the car windows, so it isn't debris. I'll leave it to you, to be the judge on what these might be. 1. Where were you and what were you doing at the time? Riding as a passenger, going to a doctor's appointment in Abilene. 2. What made you first notice the object? I didn't notice the objects until today, after I began looking at the photo. 3. What did you think the object was when you first noticed it? First thought came to mind was \"balloons\" but I've seen balloons in the air before and though they could be, I feel that they aren't. As for the other questions, I can't describe what I never saw until now and my first reaction when I did finally look at the photo today, was, \"OMG!\""],"map":"<A HREF = \"http://maps.google.com/maps?q=32.452786,+-99.723844(14810)&iwloc=A&hl=en\"> mufon case (14810) map </A>","Disposition":"Unknown","Viewing Distance":"Unknown","Case Number":"14810","Latitude":"32.452786","Tags":"City","files":["/var/www/straped/mufon/html2text/14810.html.txt","/var/www/straped/mufon/more/14810_submitter_file1__DSC00279.JPG","/var/www/straped/mufon/org/14810.html"],"trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around June 11th 2008","This sighting has never been favorited.",""],"Region":"Texas","Sighting Duration":"Undisclosed","Object Features":"Unknown","City":"Abilene","Country":"United States","Date of the Event":"06/11/2008 07:10 UTC","Weather Factors":"None","Object Shape":"Oval, Sphere, Star-like, Teardrop, Triangle","Log Number":"US-01072009-0006","Source":"MUFON","Longitude":"-99.723844","Object Flight Path":"Unknown","Summary":"Daytime photo of fleet of objects in sky."}