{"Date Submitted":"08/03/1972 09:00 UTC","Case Number":"1482","divs":["sighting detailsseveral \"unidentified flying objects\" were spotted in the skies of novi lastweek by citizens in the walled lake portion of the city. in all, four peopletold novi police they had seen unusual flying objects in the sky that had to be\"something more\" than just shooting stars. the sightings occurred wednesday, august 3. \"i was out in my yard about 9 p.m.hanging up the wash when i heard a peculiar noise up in the air. i probablywouldnt even have looked up if it hadnt been for that noise. it was a strangehumming sound, almost a drone. when i looked up to see what it was i saw anoval object. i thought it was unusual because air planes have red and greenlights on them and this thing had only white lights and made that funny whirringsound. i know i wasnt drunk. i, a tee-totalling baptist who never touches adrop. for a minute there i had to remind myself of that.\"she also called her daughter-in-law who lives next door out to see the object,but it had already gone by the time she got there. \"if it hadnt been for thesecond one, i dont think i could have convinced her of what i saw,\" said thefirst witness. \"my mother-in-law called me outside with a real funny tone inher voice,\" recalls the daughter-in-law. \"i was kidding her, telling her shedbeen seeing things. while we were talking i was watching three very brightstars up in the sky when all of a sudden one of them took off and flew veryrapidly from west to east. then i got as excited as she was.\"shortly thereafter the two women, who had been joined by ______, 39 y\\o male,spotted a third object. \"from what my mother-in-law told me this one was verysimilar to the first in appearance,\" said the daughter-in-law. \"it was about asfar away as an airplane and was circular with a ring of white lights around it.i still wasnt sure that i was imagining things until that third one came rightover the house. then i realized that i was seeing something very, very weird.\"also seeing the third object was a 15 y\\o neighbor boy. it was after the thirdincident that _____went into her home to call the novi police. while she wasmaking the call, around 9:30 p.m., the three people outside saw yet anotherstrange object. they described it as being extremely bright, like a huge whitelight. it traveled all the way across the sky from west to east, thedaughter-in-law reported, stopped suddenly in mid-air, and made a right angleturn to the north before disappearing out over walled lake. the group reportedseeing one more object before the police arrived. like the second and fourthones it was reported as being very bright and shot across the sky with greatspeed. the daughter-in-law denied the possibility that what she had seen wereshooting stars. \"that possibility crossed my mind,\" she said, \"and i stillthink its a possibility with one or two of the things we saw. but there werealso two objects that just couldnt be confused with shooting stars. two ofthose things we saw were very definitely circular in shape and had a ring oflights around them. those same two circular objects also made that strangebuzzing sound. police officers called to the scene saw none of the objects. \"the people wereextremely excited,\" said one novi policeman, \"and their descriptions comparefavorably with other reported sightings of ufos. its entirely possible thatthey did see something."],"Disposition":"Unresolved","Object Flight Path":"Unknown","Latitude":"42.48059","Date of the Event":"08/03/1972 09:00 UTC","files":["/var/www/straped/mufon/html2text/1482.html.txt","/var/www/straped/mufon/org/1482.html"],"Log Number":"","Tags":"City","City":"Novi","Summary":"MA-1 in Novi, MI - Walled Lake area - Oval Shaped","Object Features":"Undisclosed","Longitude":"-83.475491","Region":"Michigan","Sighting Duration":"00:30:00","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Object Shape":"Oval","trends":["There have been 8 other sightings in Novi","There were no other sightings in Novi on or around August 3rd 1972"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.48059,+-83.475491(1482)&iwloc=A&hl=en\"> mufon case (1482) map </A>"}