{"Case Number":"14821","Object Flight Path":"Stationary","Disposition":"Unknown","Object Features":"Unknown","Country":"United States","Date of the Event":"09/22/2004 09:00 UTC","Viewing Distance":"101-500 Feet","Date Submitted":"09/22/2004 09:00 UTC","Latitude":"43.593161","divs":["Sighting DetailsAround 9pm I was headed out of Burns to Burns junction on highway 78 in late september 2004. As i approached the small town of Crane I noticed a light in the sky that was changing colors rapidly. I was thinking of a logical explanation for this thing, helicopter, plane etc. As i got closer it just dissapeared. I was sure that someone else had to see it as it was just above Crane. I continued on and about 3 miles before the alvord desert turnoff i saw it again in between to of the peaks of the small mountian or \"folley farm\" people call it. It was about a mile away I would eventually drive underneath it. As I headed toward the road made a sweeping left turn when i came around it it was gone. I remember feeling very alone out there because there was absoloutley no other traffic. A little scared and very confused i kept on heading to Burns junction,checking my mirrors and the sky carefully. I was around mm 83 within view of the lighs a B.J. when i out of the corner of my eye i noticed a beam of light hit the desert floor to my left and within milseconds it seemed to turn to daylight i looked up and about a 100yds away maybe 200yds up a huge redish on the outside white in the center object just hovered there and dissapeared in the blink of an eye. All the hairs on the back of my head stood straight up, that was the last time i saw it. I will never know what it was but i definetly will never forget. I know othe people had to see this when it was around Crane, so far i have found just one."],"Object Shape":"Sphere, Star-like","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","trends":["There have been 8 other sightings in Burns","There were no other sightings in Burns on or around September 22nd 2004"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.593161,+-119.045873(14821)&iwloc=A&hl=en\"> mufon case (14821) map </A>","Summary":"Round bright ball that changed colors - Crane to Burns Junction.","Longitude":"-119.045873","City":"Burns","Log Number":"US-01072009-0017","Region":"Oregon","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14821.html.txt","/var/www/straped/mufon/org/14821.html"]}