{"Region":"England","Object Shape":"Sphere","Object Features":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"08/23/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/14823.html.txt","/var/www/straped/mufon/org/14823.html"],"Tags":"City","Country":"United Kingdom","Summary":"UFO witnessed by 2 people in Southampton while leaving docks on cruise ship.","trends":["There have been 7 other sightings in Southampton","There was one other sighting in Southampton on or around August 23rd 2008"],"Log Number":"GB-01082009-0002","Object Flight Path":"Path with directional change","Source":"MUFON","City":"Southampton","map":"<A HREF = \"http://maps.google.com/maps?q=50.91359,+-1.398331(14823)&iwloc=A&hl=en\"> mufon case (14823) map </A>","Latitude":"50.91359","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-1.398331","Date of the Event":"08/23/2008 12:00 UTC","Disposition":"Unresolved","divs":["sighting detailson saturday august 23, 2008, my partner and i departed aboard the pride of bilbao (a ferry\\cruise ship), destined for northern spain. as we left the dock at southapmton, we stood at the back of the boat to watch the port dissapear behind us. it was dark at the time and we left at about 8:30pm, a little later than scheduled. as we stood there, i noticed a white ball of light in the sky moving about over the town itself. i pointed it out to my girlfriend and she confirmed that she could also see it. after about 30 seconds, the ball sped up and started whizzing back and forth, up and down around the town. by this point we were a bit freaked out. we tried to take photos, but it was too far away and too small to pick anything up. some time into the sighting, a passenger plane also flew across the towm. the ball proceeded to follow the plane and then appeared to loop around it a couple of times. again, we both witnessed this. as the boat got further out to see, we lost the object and were left standing at the back of the ship, utterly gobsmacked. the sighting lasted about 10 minutes."],"Case Number":"14823"}