{"map":"<A HREF = \"http://maps.google.com/maps?q=40.307018,+-89.597633(14820)&iwloc=A&hl=en\"> mufon case (14820) map </A>","City":"San Jose","Country":"United States","Latitude":"40.307018","files":["/var/www/straped/mufon/html2text/14820.html.txt","/var/www/straped/mufon/org/14820.html"],"Longitude":"-89.597633","Case Number":"14820","Object Flight Path":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting DetailsLetting my dogs in at 11:20 stood on back porch. Crisp, clear night, cold abit windy. At first I thought it was the farmer that owns the fields. Had white lights in back, white , what I thought were flood lights on top and white and red lights in front. The farmer doesn't own a vehicle like that. Then I thought that it was a police car maybe chasing someone in the field it being New years eve. It started on the right even with my yard about 100yds from the porch. Slowly moved past me down past the neighbors yard turned north seemed to bounce a little and went up a hill over the top turning north west. My husband came out of the restroom and I told him the cops were chasing someone in the field. The next morning my husband and I were discussing it and remembered the farmer runs a hot wire because he runs cattle there. We called him and told him what I saw and out he came to check the fence. He called back later and said the fence was fine and no tire tracks. Now I called the police department and the chief of police said no one was out in the field that night. My husband and I talked about it again and I realized there was no exhaust, and no sound. Not the first time we've seen many strange things in this field. I've reported quite a few and this is just one more to add to the growing list. Considering that the fence was fine and there were no tire tracks I assume it was floating off the ground and the bounce i saw it do was to avoid the fence."],"Date Submitted":"12/31/2008 12:00 UTC","Source":"MUFON","Sighting Duration":"11:20:00","Region":"Illinois","trends":["There have been 4 other sightings in San Jose","There were no other sightings in San Jose on or around December 31st 2008"],"Date of the Event":"12/31/2008 12:00 UTC","Object Shape":"Other","Log Number":"US-01072009-0016","Object Features":"Undisclosed","Summary":"Saw in field out back what I thought was a patrol car but no tire tracks.","Viewing Distance":"Unknown","Weather Factors":"Unknown"}