{"Object Features":"None","Summary":"Bright green flash behind clouds.","Object Shape":"Flash","trends":["There have been no other sightings in Leonia","This sighting has never been favorited."],"Longitude":"-73.988194","map":"<A HREF = \"http://maps.google.com/maps?q=40.861489,+-73.988194(14827)&iwloc=A&hl=en\"> mufon case (14827) map </A>","Tags":"City","Region":"New Jersey","Disposition":"IFO","divs":["Sighting DetailsI was standing in a high school parking lot with some friends a couple of years ago at night. We were all sitting around having a cigarette when suddenly there was a bright green flash off in the distance in the sky. It moved a little bit but whatever was making the flash couldn't be seen because it was behind clouds. It was starting to rain so my friends dismissed it as lightning but it was very close and there was no thunder. It also moved behind the clouds. I don't know what it was but it definitely had some sort of bright lime green round shape to it. What makes this so odd is that we live very close to New York city in a very densely populated ares of New Jersey so light pollution makes most things, including planes and stars in the sky almost impossible to see. The cloud cover was also relatively thick so in order for something to be as bright was it was says something about how intense the light was. A strange experience that seemed to freak everyone out initially but was eventually dismissed as some sort of strange lightning. I do know such a thing as colored lightning exists but that there was no lightning that night, that it was in the the sky behind the clouds, and that it was silent makes me think it was not lightning. Attached is an image I made of what i think it looked like."],"Country":"United States","files":["/var/www/straped/mufon/html2text/14827.html.txt","/var/www/straped/mufon/more/14827_submitter_file1__cloud-11.jpg","/var/www/straped/mufon/org/14827.html"],"Sighting Duration":"Undisclosed","Log Number":"US-01082009-0006","Date Submitted":"05/31/2007 12:00 UTC","Case Number":"14827","Latitude":"40.861489","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Date of the Event":"05/31/2007 12:00 UTC","Weather Factors":"Lightning, Light","City":"Leonia"}