{"Case Number":"14837","Viewing Distance":"Over One Mile","Latitude":"36.16752","Region":"Tennessee","Object Features":"Unknown","Source":"MUFON","Longitude":"-86.782643","Date of the Event":"01/08/2009 07:30 UTC","Log Number":"US-01082009-0016","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=36.16752,+-86.782643(14837)&iwloc=A&hl=en\"> mufon case (14837) map </A>","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around January 8th 2009"],"City":"Nashville","divs":["Sighting Detailsat 7:30 pm husband went outside to get something out of a vehicle and saw an extremely bright light far below the stars in the western sky above the treeline. he called me and our 3 kids out to see (the show Kath and Kim had just started)as it was zigzagging and moving. at first we thought it was a really BIG, extremely bright star really low in the sky. the moon was in the opposite direction to our backs from the object, and was towards the New Johnsonville area. as it is cold outside, we eventually came in to look out our upstairs window. It would occasionally move towards us, and then away, and at one point separated into 3 bright white lights, and then went back to one and started having rotating red lights on it. everyone watching would complain of their vision messing up while watching this, as it would go blurry and the surroundings would disappear it seemed, so we would have to look away to refocus. this event lasted right at 1 hour, and at the last 3 minutes moved out of range of seeing through the upstairs window where it could only be seen from the front yard outside, then it disappeared behind the treeline very rapidly and was gone. seeing things in the sky here has about become a common occurrence so we were not surprised at what we saw, or that there was something unusual in the sky here. We have saw the same thing on more than this occasion, along with other types before. There were at most times 3 witnesses to the event, and 5 saw it total in it's one hour time."],"Object Shape":"Star-like","Summary":"Extremely bright zigzagging light with rotating red lights.","Country":"United States","Sighting Duration":"01:00:00","Tags":"City","files":["/var/www/straped/mufon/html2text/14837.html.txt","/var/www/straped/mufon/org/14837.html"],"Date Submitted":"01/08/2009 07:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","Disposition":"Unknown"}