{"Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"01/08/2009 09:05 UTC","Region":"Mississippi","trends":["There have been no other sightings in Florence","This sighting has never been favorited."],"Case Number":"14839","Disposition":"Unknown","Country":"United States","City":"Florence","Summary":"Triangler shaped object with three bright white lights in each point , 3 smaller white lights between.","Longitude":"-90.131197","Source":"MUFON","Log Number":"US-01082009-0018","Latitude":"32.153484","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.153484,+-90.131197(14839)&iwloc=A&hl=en\"> mufon case (14839) map </A>","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/08/2009 09:05 UTC","Object Shape":"Triangle","Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/14839.html.txt","/var/www/straped/mufon/org/14839.html"],"divs":["Sighting DetailsThursday January 8 2009 my husband and I were visiting our daughter in Florence Ms. when my husband spotted a bright light in the sky. He called for us to come see the unusual light hovering somewhere between the stars and tree line. I dismissed it as a bright star or planet. This sighting was at about 7 p.m.. Later on our way home my husband still staring into the sky spotted a bright light again. This appeared to be three bright white looking lights moving toward us. This time I dismissed the sighting as an airplane or jet, but as the lights moved closer I became aware that this was nothing I had ever seen before. Three bright lights in each corner of a large triangled shape object illuminated white , three smaller white lights positioned between the largers lights were also easily viewed, and in the center appeared to be many even smaller red twinkling lights. My husband stopped the car in amazement yelling the entire time, OH MY GOD, OH MY GOD. My husband stepped out of the car at this time pointing and still yelling. At this time the object that appeared to be directed from one point now started moving in a diferent direction, toward us. Gliding,with no sound heard. Again nothing i had ever seen before. At this time I started yelling but not in amazement as my husband, but in fear. Afraid of something I would not ever be able to explain."]}