{"Summary":"White to silvery white cigar shaped object.","Case Number":"14831","Object Shape":"Cigar","Longitude":"-108.543449","Latitude":"39.06984","Date of the Event":"01/04/2009 03:00 UTC","Log Number":"US-01082009-0010","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14831.html.txt","/var/www/straped/mufon/org/14831.html"],"City":"Grand Junction","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.06984,+-108.543449(14831)&iwloc=A&hl=en\"> mufon case (14831) map </A>","Viewing Distance":"Unknown","Sighting Duration":"00:00:20","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was walking my dog in a local park and talking with an individual that I had seen there on several occasions. It was a crystal clear day and I was looking at the Grand Mesa to the east which rises up to 11,000+ feet from the valley which is about 4500 feet in altitude. I noticed a white cigar shaped object moving quickly from left to right toward the north face of the Mesa. It appeared to be no more than 200 feet AGL as it approached the edge. It followed the contour up and over the top remaining no more than 200-400 feet AGL. It's hard to say exactly how high it was because the distance was probably 15 to 20 miles. I looked at my watches second hand as it crested the top and continued moving rapidly to the south. It took exactly 15 seconds to travel from one end of the Mesa to the furthest point visible on the southern end. I later estimated the distance at about 40 miles. My math says that it would have to be traveling in excess of 9000 mph to cover the distance in that amount of time. There was no noise, no contrail, no after-burners. I watch military jets fly in and out of our airport all the time. I've never seen anything like this. Your guess is as good as mine."],"Source":"MUFON","trends":["There have been 24 other sightings in Grand Junction","There were no other sightings in Grand Junction on or around January 4th 2009"],"Tags":"City","Country":"United States","Weather Factors":"Unknown","Disposition":"Unresolved","Date Submitted":"01/04/2009 03:00 UTC"}