{"Object Shape":"Circle, Sphere","Date Submitted":"12/25/2008 12:00 UTC","Object Features":"Undisclosed","Country":"United Kingdom","Region":"Scotland","map":"<A HREF = \"http://maps.google.com/maps?q=55.962762,+-3.187217(14830)&iwloc=A&hl=en\"> mufon case (14830) map </A>","City":"Edinburgh","Weather Factors":"Unknown","Case Number":"14830","Latitude":"55.962762","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Disposition":"Unresolved","Log Number":"GB-01082009-0009","Date of the Event":"12/25/2008 12:00 UTC","Tags":"City","divs":["sighting detailson no less than 7 occasions between 18th of december and 4th of january various friends and i have witnessed an unidentified flying object at the various times in the evening over south queensferry near edinburgh,scotland friends have taken pictures which are even more surprising because the craft which appears to be ball shaped actually changes shape under magnification and clearly is an arc shaped. my friends and i who have witnessed this ufo are all professional people in the age range of 38 -60 and were not under the influence of alcohol or drugs on any of tjhe dates we witnessed the ufo. the craft travelled on either a east to west trajectory or a west to east trajectory at heights between 1000 to 2500 feet. it gives no sound, travels at very unusual speeds ranging from dead slow slow, hovering, move a distance then hover then incredibly in the blink of an eye it just dissapears - we came to notice the craft because we do not smoke in the house for the sake of our children - at first you think what exactly is this you are seeing and then you immediately seek to get witnesses - on every sighting we have studied the craft for easily 4\\5 minutes at a time. my friend {pid} has taken pictures of the ufo - nigel is one of the most intelligent guys i know and even he was totally mystified but fully in agreement that we have been witnessing some sort of craft. clearly a ufo and so frustrating as you know what you have seen and yet you wonder if anyone will take you seriously."],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Longitude":"-3.187217","Summary":"Multiple friend and I saw myserious unidentified craft on no less than 7 occasions between 18th December 2008 and 4th January 2009.","trends":["There have been 6 other sightings in Edinburgh","There were no other sightings in Edinburgh on or around December 25th 2008"],"files":["/var/www/straped/mufon/html2text/14830.html.txt","/var/www/straped/mufon/org/14830.html"]}