{"Disposition":"Unknown","City":"Knoxville","Object Shape":"Disc","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-01082009-0012","Case Number":"14833","Source":"MUFON","divs":["Sighting DetailsAround 9:30 last night 01-07-09 I saw an object over the river in Knoxville . I called my girlfriend who was here with me and she saw it too . We live down by the river in a high rise apartment building on the six floor and I have a clear view of the river and the downtown skyline . What susprised me was where the lights were . You never see planes coming up the river, helicopters every now and then but not planes. When I first spotted it, it was past the stadium on the far side moving west to east at about 500 feet . The Gay and Henley Street bridges are about a mile from here and the stadium is about two miles away . At that distance it looked to be about an inch to an inch and a half long between the outer lights. Comercial aircraft coming out of or into McGee Tyson airport are going north or south. Island Home airport, which is behind the apartment building is about a mile and a half from here. Planes coming into that small airport come or go east to west. And they are small private planes. And they don't fly up and down the river in town. The object or disc was moving extreamly slow and it had red, green and white lights strobing or flashing. It passed to the right of the building maybe by 300 feet but there was no sound coming from it. When helicopters or small planes fly by you can hear the rotors and the engine from the planes. And the comercial jets or military jet you can hear them. This was totally silent . The time we had it in view was about 2 minutes or so. Just wish I had of thought of my camera ."],"Object Features":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around January 7th 2008"],"Date of the Event":"01/07/2008 09:30 UTC","Weather Factors":"Unknown","Latitude":"35.965558","Tags":"City","files":["/var/www/straped/mufon/html2text/14833.html.txt","/var/www/straped/mufon/org/14833.html"],"Sighting Duration":"00:02:00","Summary":"Object over Tn River in Knoxville.","map":"<A HREF = \"http://maps.google.com/maps?q=35.965558,+-83.916909(14833)&iwloc=A&hl=en\"> mufon case (14833) map </A>","Region":"Tennessee","Date Submitted":"01/07/2008 09:30 UTC","Longitude":"-83.916909"}