{"map":"<A HREF = \"http://maps.google.com/maps?q=31.248063,+-92.139524(14834)&iwloc=A&hl=en\"> mufon case (14834) map </A>","Object Shape":"Fireball","Sighting Duration":"00:02:00","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14834.html.txt","/var/www/straped/mufon/org/14834.html"],"Summary":"Red/orange glowing sphere travelling W to E low at approx 400 kts then splitting.","Country":"United States","Tags":"City","Case Number":"14834","divs":["Sighting DetailsI am a First Officer with a Regional US airline. On our approach to Fayetteville, our traffic to follow was an American Eagle EMB-145 who reported seeing what he believed was a large flare 200ft below him crossing his flight path, and flying level at what he assumed was 300 kts. Approach had no radar signature, and the Amer.Eagle flight lost sight of it. I saw nothing, and landed. 45 min later we arrived at the hotel, and I went to the balcony to have a smoke before bed. We did not drink as we had an early departure. On the balcony I witnessed a glowing object travelling West to East at close to 400 kts. As I continued to watch, it entered a cloud, and illuminated it bright orange. It exited to cloud and split (without sound) into two objects of the same color-yet the the mass appeared to be identicle which puzzled me. How could something split into two without losing 50% of its mass? One object continued its same level trajectory, while the other climbed at a rate of what I assumed to be approx 10-20,000 ft per minute at a 45 degree angle. I quickly lost sight of both objects, and throughout the experience there was no sound. At first sight, I believed it to be military- However, this was not an MOA (Military Operations Area), and secondly, there were travelling at close to 400 kts. (Below 10,000ft aircraft must stay below 250 kts) I lost sight of the object when the one flying level was obstructed by the hotel, and when I turned attention back to the one climbing, it was gone."],"Latitude":"31.248063","Region":"Louisiana","Longitude":"-92.139524","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"07/10/2005 10:00 UTC","City":"Fayeteville [cms/no such","trends":["there have been no other sightings in fayeteville [cms\\no such","This sighting has never been favorited."],"Log Number":"US-01082009-0013","Viewing Distance":"Unknown","Disposition":"Unknown","Date of the Event":"07/10/2005 10:00 UTC","Source":"MUFON"}