{"Disposition":"Unknown","City":"Windsor","Longitude":"-69.580556","Region":"Maine","divs":["Sighting DetailsNow that I have a computer I can tell my story! In 1999 I lived in Windsor Maine east of Augusta Maine. I went out my back door to smoke a cig. the day was cloudless blue sky. Jets from Europe fly over at that time of day, so I noticed its con trail. Im a trained weather observer when I was in the Navy so I know altiudes and types of jets. As I observer jet at 11 oclock high I noticed a flach out of the corner of my eye at 1 oclock. I turned to look and to my amazement this huge disc was just sitting up there. I know that it was above jet because its con trail went under disc. The disc was so large you could put 6 jet in its disc. hard to say how high above jet disc was. On size of disc on the order of I estimate 1500ft in diameter. jet flew under and went on its way. I watch dics shoot straight up counting one thousand one one thousand two one thousand three and it disapeared into space. As I was counting the disc was getting smaller and smaller so I know It went stright up and out of sight. What I saw was real, the sun was glaring a reflection off of this disc. I assume the pilots were quite upset to see this disc, they could not miss seeing disc. I now live in Hobe Sound, Fl. and im 60 years of age my cell phone number is still out of Maine as you have it on the report. This still raises the hair on the back of my neck. Now this jet was commerial airliner 4 engine so you guess size of disc? Ron T."],"files":["/var/www/straped/mufon/html2text/14841.html.txt","/var/www/straped/mufon/org/14841.html"],"Log Number":"US-01092009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=44.310556,+-69.580556(14841)&iwloc=A&hl=en\"> mufon case (14841) map </A>","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/19/1999 11:30 UTC","Case Number":"14841","Tags":"City","Weather Factors":"None","Object Shape":"Disc","Country":"United States","Latitude":"44.310556","trends":["There have been no other sightings in Windsor","This sighting has never been favorited."],"Object Features":"Other","Summary":"Giant disc 1000+ feet around above 39000ft above jet coming in from Europe.","Object Flight Path":"Hovering then path","Date Submitted":"09/19/1999 11:30 UTC"}