{"Sighting Duration":"00:02:00","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14845.html.txt","/var/www/straped/mufon/org/14845.html"],"Source":"MUFON","Log Number":"US-01092009-0005","Date of the Event":"07/30/1972 01:00 UTC","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around July 30th 1972"],"Longitude":"-75.156389","Region":"Pennsylvania","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Philadelphia","map":"<A HREF = \"http://maps.google.com/maps?q=39.958255,+-75.156389(14845)&iwloc=A&hl=en\"> mufon case (14845) map </A>","Disposition":"Insufficient Data","Tags":"City","Country":"United States","Summary":"Erratic, quick moving, pulsating, green disc appeared near Phila one summer in the early to mid 70s.","Date Submitted":"07/30/1972 01:00 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsi know this was a l-o-n-g time ago, but... when i was a kid (13ish) i saw an iridescent flashing\\pulsating green disc shaped object in the summer sky between philadelphia (port richmond area) and the north camden\\pennsauken area of nj. the object seemed to move effortlessly and at odd angles (up\\down, back\\forth, hover, etc). after only a few minutes minutes, it traveled north (very quickly) and out of sight. from my vantage point, looking eastward from my second floor bedroom window, it seemed to be roughly following the delaware river. several days later i heard my sister's friend (a neighbor [16ish] from across the street) telling the story of her sighting to her friends. they seemed skeptical. but i not only corroborated her story, i also added details about it's movement, location, the time of day, etc. we determined that we must have seen the same thing on the same evening. i know this is not a 'hot' sighting but i thought i'd add my information just in case others reported something similar."],"Case Number":"14845","Weather Factors":"None","Latitude":"39.958255","Object Shape":"Disc"}