{"Object Features":"Window(s), Patterned Surface","Date Submitted":"01/05/2009 04:50 UTC","Country":"United States","Latitude":"41.881514","Region":"Illinois","Source":"MUFON","Summary":"Possible recurrence of sighting from June 2008.","Disposition":"Unresolved","Sighting Duration":"Undisclosed","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around January 5th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"14851","divs":["Sighting DetailsJune 12th of 2008 I saw a v-shaped object in Chicago at Belmont Ave. I believe the object I saw ay January 5, 2009 is the same or similar object I saw in 2008. I was going to work at 4:50 a.m. and was east bound on I-90. I had just past the Cumberland exit when I looked up and saw something partially visible in the morning sky. There was a lot of clouds, but through an open patch I could see three traffic color green lights and one white light just hanging there. At first I just stared then I realized it wasn't moving. I would estimate the height at about 750 feet. I stared at it and wondered if I should pull off and snap a picture with my camera phone, but decided it was too dark and probably would not come out well. I continued to watch it and noticed there were divisions between the lights, something I believed was there in 2008. I could see what looked like light grey metal separating the lights, and a design that reminded me of mother of pearl coloring, shaped like frothy waves going up the metal divisions. They appeared to me to be three dimensional. I looked to the east and could see several planes flashing in the distance coming toward O'Hare Airport. I once again realized there was no flashing of these lights, they were not moving in any way, just hanging behind the clouds. I watched until I was too far east to see them any longer. This took place in Cook County."],"Date of the Event":"01/05/2009 04:50 UTC","files":["/var/www/straped/mufon/html2text/14851.html.txt","/var/www/straped/mufon/org/14851.html"],"Tags":"City","City":"Chicago","map":"<A HREF = \"http://maps.google.com/maps?q=41.881514,+-87.625998(14851)&iwloc=A&hl=en\"> mufon case (14851) map </A>","Weather Factors":"Unknown","Longitude":"-87.625998","Object Shape":"Unknown","Log Number":"US-01092009-0011","Object Flight Path":"Stationary"}