{"Object Flight Path":"Undisclosed","Log Number":"US-01092009-0012","Summary":"Again we see a UFO last year at this time we saw something -- we reported to you- craft standing still- helcopters surrounding it,","divs":["Sighting DetailsWe got a call from my daughters boyfriend who was out on his apt balcony smoking with friend few miles away and saw bright lit up object with pulsating green-red and blue lights, the helicopters would go towards it with a spotlight and would turn back not getting to close and approach fron the other side- then there was about 4 choppers taking turns- with big spotlights, when they would turn around from it, we would see the spotlights, it continued for an hour or so then we went inside and came back out and it had moved up higher in the sky, we were looking at it with a rifle telecope its lights were brilliant and bright and could not really make out a shape cause of the brightness - but looked like a prism. Last we saw it was higher and you could still see the lights but smaller--the choppers stopped - I think it was at a higher altitude they could not reach it. last time this year we saw something as well - but this time it was all of us; me, my husband and three kiddos plus the other people on that apt balcony. It was somewhere over 249 and the Sam Houston tollway or 290 area- far NW houston."],"Disposition":"Hoax","Object Features":"Undisclosed","Latitude":"29.769613","Date of the Event":"01/08/2009 08:10 UTC","Longitude":"-95.36425","Source":"MUFON","Object Shape":"Star-like, Triangle","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.769613,+-95.36425(14852)&iwloc=A&hl=en\"> mufon case (14852) map </A>","Date Submitted":"01/08/2009 08:10 UTC","City":"Houston","Tags":"City","Case Number":"14852","files":["/var/www/straped/mufon/html2text/14852.html.txt","/var/www/straped/mufon/org/14852.html"],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around January 8th 2009"],"Sighting Duration":"Undisclosed","Region":"Texas","Country":"United States"}