{"trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around January 9th 2009","This sighting has never been favorited.",""],"Case Number":"14857","Weather Factors":"None","City":"Portland","Object Flight Path":"Hovering then path","Country":"United States","divs":["Sighting DetailsI was working inside the house, when my girlfriend called me outside, exclaiming \"Hurry!\". I rushed out, and saw an orange flickering light, about the size of a dime at arms length. When I first saw it, my stomach dropped. It seemed highly out of place, as I could see airplanes in the distance (the airport is about 5 miles away). The planes flew in a typical manner, while the object floated for about 30 seconds, heading south (against the wind). It would stop for a minute or so, and then move in the same direction. Total duration of the sighting lasted about 3 minutes. I figured it was a lantern of some sort, as it was flickering like a candle. Both my girlfriend and I feel confused as to what it was. I ran inside the house to grab the camera, and took a photo. The object seemed still before it simply \"turned off\". The light just went out completely. About a minute after it went away, two planes flew in the direction of where the object had been previously, and started circling in the area."],"Date Submitted":"01/09/2009 10:00 UTC","files":["/var/www/straped/mufon/html2text/14857.html.txt","/var/www/straped/mufon/more/14857_submitter_file1__UFOportland.jpg","/var/www/straped/mufon/org/14857.html"],"Object Features":"None","Log Number":"US-01102009-0001","Region":"Oregon","Object Shape":"Circle, Fireball, Star-like","Source":"MUFON","Longitude":"-122.669417","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Summary":"Almost like a lantern of sorts.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.526472,+-122.669417(14857)&iwloc=A&hl=en\"> mufon case (14857) map </A>","Date of the Event":"01/09/2009 10:00 UTC","Disposition":"Unknown","Latitude":"45.526472"}