{"Object Features":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14855.html.txt","/var/www/straped/mufon/org/14855.html"],"Source":"MUFON","Case Number":"14855","Date of the Event":"12/31/2008 09:10 UTC","Tags":"City","Country":"United States","Longitude":"-81.162224","Log Number":"US-01092009-0015","Object Shape":"Square, Rectagular","Summary":"Slow floating rectangle.","Region":"South Carolina","Date Submitted":"12/31/2008 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.837981,+-81.162224(14855)&iwloc=A&hl=en\"> mufon case (14855) map </A>","Sighting Duration":"00:25:00","City":"Not sure - CMS/sg","divs":["Sighting DetailsI was flying home from Jfk-Mia on Delta airlines, the night of December 31st, 2008,I was seated on seat 31e(window seat on MD-88 jet)we were flying somewhere between South Carolina and state of Florida, when all a sudden I had this urge to look outside my window and, I saw this black rectangle slowly pass over our jet,it seemed as if it was floating(it was clear sky with a couple of clouds and a half moon)this object had no wings potruding from its sides,it was so black and from my angle of view which was looking at it from underneath it, appeared to be long and tall.It seemed to be floating maybe at about 500ft above us. It only had three lights at the front you could see it had white light that seemed as wide as this object this light did not seem to have any reflection on any of the surrounding clouds like regular jet lights do then,there was a red light under the object at a mid point between the front and back of it, the light was strobing very slow,also it was such a rich red color that you couldn't see where light bulb was, like on commercial jets( I fly for a living and we are train to observe a lot of things,)this light did not reflected on its surroundings either,like it was been absorbed by the very blackness of this object.the third light covered the whole back of this craft it was as wide and tall as the object it self,very rich red in color, no reflection, no flashing, just a beautiful red color against this black object I lost sight of it after what seemed to be a very long time and then the lights went off all of a sudden . This craft seemed to be floating in a west-northwest direction moving very slow, our jet was flying at about 30,000ft altitude,and this object was at about another 500-1000ft altitude above us,also the cabin lights inside our jet were turned off to allow the passangers to sleep after the services were completed by the working flight crew,which,made it easier to see outside the windows as there would be no glare from lights inside the jet's cabin.I am very sure of what I've seen. I told my family about it when I arrived in Miami but, they thought I was joking.I wonder if anybody else saw this object on December 31st, 2008 at around the same time ?"],"trends":["there have been no other sightings in not sure - cms\\sg","This sighting has never been favorited."],"Object Flight Path":"Other","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Latitude":"33.837981"}