{"Date Submitted":"01/04/2009 03:15 UTC","Tags":"City","Country":"United States","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around January 4th 2009"],"Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply","divs":["Sighting DetailsSo I was outside having a smoke when I cought a bit of reflicted lite. Like you might see off of an airplane. I watch the sky every day so I have become very good at picking out the real from not real. If you wanna look at it like that. Plane or not plane. As I continued to focus on this tiny bit of light more and more began moving around one another like a flock of birds. Some would break off and do a sharp movement in any direction then back to the group. They were headed directly overhead in a west by north west direction from Aroura to Denver. Then out of my line of sight. Not like they vanished still in broad daylight just out of my view. I was extatic! I am still not positive on the total of craft I believe no less than 30 that I could group up but no more than 50. This was my first real life encounter with this style craft. However I had see hundreds in a report not to long ago from Mexico. Mexican military were folowing in jets hundreds of these smaller craft that moved in the same way. I was the only one there at the time which sucks. However it was broad day light any I will never not believe what I saw. No photos."],"Case Number":"14865","Disposition":"IFO","Object Features":"Undisclosed","Object Shape":"Oval, Sphere","Region":"Colorado","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Latitude":"39.743294","map":"<A HREF = \"http://maps.google.com/maps?q=39.743294,+-104.979383(14865)&iwloc=A&hl=en\"> mufon case (14865) map </A>","Summary":"Multiple craft flying in formation at least 30 no more than 50 craft small like the ones in Mexico.","Log Number":"US-01102009-0009","files":["/var/www/straped/mufon/html2text/14865.html.txt","/var/www/straped/mufon/org/14865.html"],"Longitude":"-104.979383","City":"Denver","Date of the Event":"01/04/2009 03:15 UTC"}