{"Tags":"City","Source":"MUFON","Date Submitted":"01/09/2009 06:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.561412,+-73.049146(14867)&iwloc=A&hl=en\"> mufon case (14867) map </A>","Log Number":"US-01102009-0011","Latitude":"41.561412","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/14867.html.txt","/var/www/straped/mufon/org/14867.html"],"Disposition":"IFO","City":"Waterbury","Object Shape":"Circle","Summary":"White light flying across early morning sky.","Country":"United States","Sighting Duration":"00:03:00","divs":["Sighting DetailsI always lay on the bed petting my cats while I look out the window. In fact, it is always at the same time....right around 6:40am during my work week. ,The view is phenomenal as I can see a wide area of the Naugatuck Valley and beyond. The morning light was just starting to appear from the west but to the east there was still a hint of darkness. No direct sunlight over the horizon yet. I am always searching the skies for planes etc and my eye caught sight of a white light coming from the SW, heading SE. I kept my eye on it knowing that it is very unusual to see a plane at that time. I got my binoculars to get a closer look. It appeared to be a solid white light, quite bright, in fact. I saw absolutely no red lights, no blinking lights, just a solid white light. I am not very good at estimating distance from the ground. This is what I know however. I watch a lot of planes flying. My house is located under the landing pattern where jets are flying into BDL so they are flying lower than 35,000 feet and I am used to seeing them at that height. So I am amateurishly estimating that this object flew between 10,000-20,000 feet. I tracked the object until it came close to the west and I lost it completely in the morning light. Speed of object.....it wasn't flying fast like a jet.... slower. I can only describe what I saw.....but it wasn't a plane.....it couldn't have been a satellite as it was low on the horizon and usually satellites are pinhead small in the sky. This object was a big, glowing white light. Thank you."],"Region":"Connecticut","trends":["There have been 15 other sightings in Waterbury","There were no other sightings in Waterbury on or around January 9th 2009"],"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Case Number":"14867","Object Features":"None","Date of the Event":"01/09/2009 06:40 UTC","Longitude":"-73.049146"}