{"files":["/var/www/straped/mufon/html2text/14866.html.txt","/var/www/straped/mufon/org/14866.html"],"Country":"United States","Source":"MUFON","Summary":"Multiple orange lights floating. Appear instantly and faded away as they were moving.","Object Features":"Undisclosed","divs":["Sighting DetailsOn December 31st, 2009, 8:10pm I was walking in our neighborhood with my son watching sparatic fireworks. North view, East to West I noticed 10-15 lights orange in color. The lights did not blink, move fast or any type of action. There was two groups the first group had about 15-20 lights. I first thought of parachuters; There is a small airport not to far from us. However, I ruled that out when I noticed small craft flying in the same area. The small craft flying in our area is not unusual. The small air craft was closer than the lights to the ground, I noticed a few planes pass over the objects in the sky. Another reason the lights caught my attention, The small craft were moving at a faster rate than the lights. The first group of lights had appeared and the front part of the group was a triangular formation, the front part of the formation started to fade after about five minutes. When the first group started to fade a second group appeared. The new group of lights were about 30-40 lights, traveling the same path and same speed. I had stopped just to observe and called my wife to get our camera to film north of our house. She was not quick enough. There was a neighbor in his yard outside and I pointed out the lights to him. He stood there with me and watched the lights. We noted the time at about 8:14pm for the second group. The lights traveled east to west and after 5 or 10 minutes faded. I have seen meteor showers before and this was not a meteor shower. There is a constant flow of small craft in our area and this was not small craft.***"],"Date of the Event":"12/31/2008 08:10 UTC","City":"Spring","Case Number":"14866","Weather Factors":"Unknown","Latitude":"30.155491","Longitude":"-95.45828","Region":"Texas","Object Shape":"Star-like, Triangle","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 18 other sightings in Spring","There was one other sighting in Spring on or around December 31st 2008"],"Date Submitted":"12/31/2008 08:10 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.155491,+-95.45828(14866)&iwloc=A&hl=en\"> mufon case (14866) map </A>","Log Number":"US-01102009-0010","Viewing Distance":"20 Feet or Less"}