{"divs":["Sighting DetailsWhen I was 6 or 7' coming from a friends house in montague I was on the main road leading into montague going south to my home when I saw 3 dime sized objects flying overhead heading east.At the age I was I didn,t think anythink about it .To get to my home I crossed two wheat fields seperated by a line of trees.these fields are now all houses.At home I shared a bedroom with my two brothers.My oldest brother had his own bed. I shared one bed with my middle brother.When I went to bed I saw round like lights on my bedroom wall.It scared me that I started to cry and I ended up sleeping between my parents.Thats why I think I was 6 or 7 younger I won,t be out and older I would stay in my own bed.In my parents room I saw the lights again.I can,t remember any thing else about that night.Our driveway was dirt and in the morning when I went outside I thought someone broke a green bottle on the driveway in back of our house but it was small green stones.One odd thing that happened was when my dog and I were at a gravel pit a small one back in the woods behind our house about two miles in I think I got scared for some reason. My dog and I were exploring the gravel pit at the time I turned around and saw rounded mounds of dirt that wasn,t there before.The only way to discribe them is a show I saw on the discovery channel about giant ant hills they looked like that.I can,t remember anything else about that day.At 17 I joined the navy stayed in for 10 years got married have two boys and have a normal life.Sometimes when going to work passing under a street light it will go out when i,am passed it the light will come back on Thats my story thank you.P.S.I,am going to retire this june and one of the things on my list to do is go for a hypnosis to find out what happened in my childhood."],"Date Submitted":"07/10/1954 12:00 UTC","Object Flight Path":"Straight-line path","Log Number":"CA-01102009-0005","Viewing Distance":"Unknown","Date of the Event":"07/10/1954 12:00 UTC","files":["/var/www/straped/mufon/html2text/14861.html.txt","/var/www/straped/mufon/org/14861.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"14861","map":"<A HREF = \"http://maps.google.com/maps?q=46.163551,+-62.64938(14861)&iwloc=A&hl=en\"> mufon case (14861) map </A>","trends":["There have been no other sightings in Montague","This sighting has never been favorited."],"Country":"Canada","Longitude":"-62.64938","Weather Factors":"None","Latitude":"46.163551","City":"Montague","Object Shape":"Circle","Disposition":"Unresolved","Object Features":"Undisclosed","Region":"Prince Edward Island","Summary":"I saw 3 dime sized in sky.","Tags":"City"}