{"Object Flight Path":"Undisclosed","City":"Hollywood","Summary":"Flashing triangle that scared me out of my wits.","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Country":"United States","Date of the Event":"01/11/2009 12:00 UTC","Latitude":"26.012901","Object Shape":"Disc, Flash","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.012901,+-80.14459(14878)&iwloc=A&hl=en\"> mufon case (14878) map </A>","Date Submitted":"01/11/2009 12:00 UTC","Region":"Florida","Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-01112009-0004","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around January 11th 2009"],"Case Number":"14878","files":["/var/www/straped/mufon/html2text/14878.html.txt","/var/www/straped/mufon/org/14878.html"],"Longitude":"-80.14459","divs":["Sighting DetailsI am not a UFO person. I do not believe in UFOs or aliens or all that abduction nonsense but what I recently saw scared the hell out of me. I woke up at about 4 am and decided to go to the local 24hr drugstore to get some snacks. I usually don't go out this late but my neighborhood is pretty safe and quiet so I didn't think much of it. I was walking down the street, which is fully lit with streetlamps and security lights so I wasn't thinking about anything weird happening when I saw it. It was a huge, disc like object hovering in the sky with multiple lights flashing. I ignored it immediately, thinking it was a plane and just kept going on my way. A few seconds later, I look up and see this thing flying back and forth, making turns that I know no plane can make and still I'm not thinking anything unusual. I keep walking toward the store when I see a parked police car on the corner. The officer is outside his car looking up at this thing that is just all over the place, making maneuvers that seem impossible and flashing brightly colored lights before hovering at a dead stop. The officer and I stop and stare in amazement at this thing, whatever it was in the sky before it suddenly took this dramatic vertical takeoff until we could no longer see it. This was one of the weirdest things I'd ever seen, and I'm still trying to shake this off. Again, I do not believe in UFOs and there's a part of me that wants to believe this was a plane but I don't know."],"Disposition":"Insufficient Data"}