{"Source":"MUFON","Date of the Event":"01/10/2009 03:20 UTC","Country":"United States","City":"North Las Vegas","Latitude":"36.204439","Sighting Duration":"02:20:00","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.204439,+-115.115971(14877)&iwloc=A&hl=en\"> mufon case (14877) map </A>","Object Features":"Undisclosed","Disposition":"Unknown","Region":"Nevada","Date Submitted":"01/10/2009 03:20 UTC","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around January 10th 2009"],"Tags":"City","Weather Factors":"Unknown","Case Number":"14877","Log Number":"US-01112009-0003","Viewing Distance":"Unknown","Summary":"Driving to work a star like object changing sizes then vanished and appeared several times during the whole event.","files":["/var/www/straped/mufon/html2text/14877.html.txt","/var/www/straped/mufon/org/14877.html"],"divs":["Sighting DetailsAt approximatley 2-3pm while driving to work from the north west on highway 95 I noticed a very bright star like object hovering and changing shapes and very bright! I have been observing these objects for the past 2yrs and have recoreded these events I know what they are and I feel its time to talk about it I have many times tryed to make contact by useing a very bright light to signal them sometime they respond....there is so much activity here I dont know why we dont have somebody from MUFON down here? I know where they will appear but I dont know why.I see them all the time I have a back groung in police trainning and have worked in the security field for 17yrs with basic FBI,,DOJ clearances.. my wife who doesnt want to believe in this has been a wittness to some of my recordings of these events I hope to here from somebody soon I have talked to mark in reno... but thats all thank you for your time and consideration I have alot to talk about regarding our alien brothers..I cant attach any photos they are all on my video cam and cell phone. the sightings are happening all the time now... big bright star like crafts are appearing all the time."],"Object Flight Path":"Undisclosed","Longitude":"-115.115971"}