{"City":"Sheffield","Object Features":"Unknown","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Log Number":"GB-01102009-0014","Sighting Duration":"00:01:30","Longitude":"-1.462885","map":"<A HREF = \"http://maps.google.com/maps?q=53.382439,+-1.462885(14870)&iwloc=A&hl=en\"> mufon case (14870) map </A>","files":["/var/www/straped/mufon/html2text/14870.html.txt","/var/www/straped/mufon/org/14870.html"],"Date of the Event":"01/10/2009 06:05 UTC","Object Shape":"Fireball","Source":"MUFON","Region":"England","Case Number":"14870","Weather Factors":"Does Not Apply","Date Submitted":"01/10/2009 06:05 UTC","Tags":"City","Latitude":"53.382439","Summary":"Silent, illuminated orange object passed overhead travelling south south west to north north east.","Disposition":"Unresolved","Country":"United Kingdom","divs":["Sighting DetailsThe object was viewed at c. 6.05 pm on by my wife and I. We were walking our dog near the junction of Folds Lane and Dalewood Road in the Beauchief district of Sheffield, England, when we saw a bright, orange illuminated object pass overhead. It appeared to be silent, and was travelling below the cloud base on a south south west to north north east heading. It wasn't possible to estimate speed but it appeared to be moving quickly at a uniform rate. It left no con-trail that we could see, although it was dark. The object passed out of our line of sight behind trees. Weather conditions: cold (c. -2 degrees centigrade), clear, relatively low wispy clouds. There was nothing specific that attracted our attention to the sky, we both seemed to notice the object at the same time. We didn't know what the object was, but in the way that it moved it didn't resemble a fixed or rotary wing aircraft. We simply observed it until it passed out of sight. My reason for reporting this sighting is that this is the second time we have observed an object fitting this description in recent weeks. The first sighting took place mid-afternoon on Christmas Day in the same area of Sheffield as my wife and I returned home after walking the dog. On this occasion we were walking on Dalewood Road, roughly east to west. The object appeared bright against the grey sky to the north west. It appeared to move slowly southward, rising slightly as it did so. It then appeared to move slowly back and forth. At this point it passed out of sight behind trees as we walked, but in the seconds that it took to regain a clear line of sight, it had disappeared completely. Weather conditions at the time were grey and overcast."],"trends":["There have been 11 other sightings in Sheffield","There were no other sightings in Sheffield on or around January 10th 2009"]}