{"Summary":"Black object sighted midflight between Fort Lauderdale and Salt Lake City.","Object Features":"Appendage(s)","Date of the Event":"06/24/2006 03:00 UTC","Sighting Duration":"Undisclosed","City":"Salt Lake City","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around June 24th 2006"],"Date Submitted":"06/24/2006 03:00 UTC","Object Flight Path":"Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/14879.html.txt","/var/www/straped/mufon/org/14879.html"],"Longitude":"-111.887227","Region":"Utah","Latitude":"40.764459","Disposition":"Unknown","divs":["sighting detailsthis happened at some point in june in the year 2006. my family and i were going home from a cruise in the caribbean. during the flight from fort lauderdale to salt lake city i looked out my window and noticed a black object when i looked down to see the landscape. it looked like one of the seeds you get stuck on you clothes while walking through tall grass (http:\\\\en.wikipedia.org\\wiki\\poa) but it had several longer spike like protrusions coming off the back of it about the same length as the main part of the object, as far as i could see there were no lights or windows on it, just a reflectionless black hull. it didn't seem to be changing altitude or distance to the plane. i told the passenger next to me, they looked and did not notice it. the closest man made vehicle i know of to what this looked like is the f-117 nighthawk stealth fighter but the object was too different to be an f-117. it stayed with us for quite a while, i eventually stopped watching and every once in a while i'd take a look and there it was right in the same place as last time but the last time i looked i didn't see it anymore. wish i could have gotten a closer look but it didn't happen and i didn't have binoculars or anything to give me a better view."],"Viewing Distance":"Unknown","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.764459,+-111.887227(14879)&iwloc=A&hl=en\"> mufon case (14879) map </A>","Object Shape":"Triangle","Log Number":"US-01112009-0005","Source":"MUFON","Case Number":"14879"}