{"Latitude":"43.809453","trends":[],"Date Submitted":"06/08/2008 12:00 UTC","Log Number":"US-01112009-0011","Viewing Distance":"Unknown","Object Shape":"Circle, Oval","City":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14885.html.txt","/var/www/straped/mufon/org/14885.html"],"Summary":"3 white circular objects flying closely together.","Longitude":"-120.544901","Object Features":"Undisclosed","Tags":"City","Country":"United States","Source":"MUFON","divs":["Sighting DetailsWhile flying back from Las Vegas to Portland, Oregon on an Alaska Airlines flight I witnessed 3 white circular discs flying in a perfect unison. We were almost to Portland and were flying over the mountains; I would say we were between central Oregon and Mt. Hood area. It was sunny and not a cloud in the sky. I was looking out the window directly below staring at the green forested mountains. What I saw stood out because they were white and really contrasted with the green mountains. It was 3 white circular shaped discs flying in a perfect unison. We were flying north and these were traveling so much faster (like 2-3 times faster than us) going in the opposite direction. I only saw them for about 10 seconds as they passed and were no longer in sight. They flew one in front of the other. They were so close together that it was almost hard to see 3 objects but I could. It was nothing I have ever seen in my life. The first feeling I had was this is not manmade. It was just too perfect. I could clearly see no wings from a jet and there was no trail that a jet would leave. We had not began our descent yet so we must have been at least 30-35,000 feet. These objects were far below; maybe 10-15,000 feet? I didn't think of asking the flight crew after we landed. I was so shocked and just talked with my husband about it. To this day I can not get this sighting out of my mind. I also reported it to the National UFO Reporting Center."],"Case Number":"14885","Date of the Event":"06/08/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.809453,+-120.544901(14885)&iwloc=A&hl=en\"> mufon case (14885) map </A>","Region":"Oregon","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Weather Factors":"Unknown"}