{"trends":["There have been 4 other sightings in Mentor","There were no other sightings in Mentor on or around May 18th 2008"],"files":["/var/www/straped/mufon/html2text/14883.html.txt","/var/www/straped/mufon/org/14883.html"],"Date of the Event":"05/18/2008 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.675997,+-81.334882(14883)&iwloc=A&hl=en\"> mufon case (14883) map </A>","Date Submitted":"05/18/2008 01:15 UTC","Viewing Distance":"Unknown","Latitude":"41.675997","Log Number":"US-01112009-0009","Disposition":"Insufficient Data","Tags":"City","Source":"MUFON","divs":["Sighting DetailsPeople I have been watching these ufo activities all summer long over here in Eastlake, Ohio. The crafts leave lake erie around 12:30am and go onto land and disperse into different directions. North to South and even south east. I saw 2 crafts the shape of a hexagon traveling together back to the lake lake slowly decending at lower altitude. I have seen different styles of unknown origin, comming back to the lake at night also. I work in the aerospace business and these are not ours. On July 15,08 A craft flew in to left of me and fastly and floated and hovered in mid-air in my view. I knew what it was. It was non-hostile and I felt the heat comming off the craft. It changed from a limelight color to a light blue and then a bright white. It was watching me and it was curious of me. It was about 500ft.high. and non hostile. The duration of the activity was about 5 minutes. Then the craft whiteness slowly disipated down and I could see the make of the craft.It was was lightly transparent triangle with 2 huge white bulbs on the back end of the craft. Then the craft moved in mid-air once to build up power but not once but 3 times to build up power.Then it shot off as a purplelish red ball of light. The craft then took off pretty fast because with a wobble. It headed towards route 306 at a fast clip. I say it traveled from my head to 306 in 2 seconds which it about 1 mile away."],"Object Features":"Undisclosed","Sighting Duration":"01:07:14","Weather Factors":"Unknown","City":"Mentor","Summary":"People they are visaully showing themselves to us!","Object Flight Path":"Undisclosed","Longitude":"-81.334882","Region":"Ohio","Country":"United States","Case Number":"14883","Object Shape":"Fireball, Star-like, Triangle"}