{"Summary":"2 bright orange lights-2 separate objects.","Tags":"City","Weather Factors":"None","Object Shape":"Disc, Fireball","Object Features":"Unknown","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around January 11th 2009"],"Log Number":"US-01112009-0012","Date of the Event":"01/11/2009 12:02 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.78344,+-122.418196(14886)&iwloc=A&hl=en\"> mufon case (14886) map </A>","files":["/var/www/straped/mufon/html2text/14886.html.txt","/var/www/straped/mufon/org/14886.html"],"Sighting Duration":"Undisclosed","Longitude":"-122.418196","Date Submitted":"01/11/2009 12:02 UTC","divs":["sighting detailswe were walking home just after midnight from grabbing some food and i saw a very bright orange light. and i turned to my boyfriend and said check that out, i dont think its a plane because planes have red or white lights and this was much closer. as we stared we noticed that the orange light was very bright and pulsed and heading northwest to southeast, towards us. the first one stopped, stood still for a few seconds and then heading west. there was a second one behind it, just as bright orange as the first. it was coming from the same direction. it then stopped in place. did a quick square flight pattern, and headed west(was gone pretty quickly once heading west). the duration was about 2 min and there was absolutely no sound whatsoever associated w\\ the ufo's, but yet they were close enough that if it was a plane,helicopter, we would have heard some sort of engine sound associated with it. my boyfriend is very skeptical, but he said it was like nothing he has ever seen before. the color was just such a bright rich orange color and the flight pattern was very akward. i have no idea what it was, i just know it was a first that i have seen something like this."],"Source":"MUFON","Latitude":"37.78344","Viewing Distance":"Over One Mile","City":"San Francisco","Case Number":"14886","Region":"California","Country":"United States","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}