{"Summary":"I saw a whitish grey round object, seemed very high, moving across the sky in a straight path.","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.997634,+-118.464678(14887)&iwloc=A&hl=en\"> mufon case (14887) map </A>","Date of the Event":"01/11/2009 02:45 UTC","Longitude":"-118.464678","files":["/var/www/straped/mufon/html2text/14887.html.txt","/var/www/straped/mufon/org/14887.html"],"Region":"California","Latitude":"33.997634","Disposition":"IFO","divs":["Sighting Detailsi was at Venice beach, lying in the sand on my back. I was just looking up at the sky when i noticed a round, circular object moving pretty quickly through the sky at what seemed a very high altitude. It was moving the opposite way the wind was going. It went in a very straight line it seemed at first, then i noticed it was arcing slightly more out to sea. The object seemed to be following along the coastline, going from north to south. It just seemed so high, and looked big from where I was. So to be that large from my position, it must have been very large. So that is what was curious. What is so large, just round, would fly through the sky...way to big to be a balloon drifting. That is what I first thought it had to be. But it was way to big to be a balloon. Just perfectly round it seemed. And it must have been going at a pretty good speed too. Not real real fast. Maybe as fast as an airplane would look at the same height. But this was no airplane. The large whitish gray, very round, shape was very very plain to see. A huge round object, not a balloon!! I watched it until I could no longer see it. It went down the coast a bit then headed out towards sea. Very clear sunny day...just a few super thin wispy clouds left by some airplanes were the only clouds. It just disappeard from view eventually. I think it was really something strange...not a usual flying machine!!"],"Source":"MUFON","Weather Factors":"None","Tags":"City","City":"Los Angeles","Date Submitted":"01/11/2009 02:45 UTC","Object Flight Path":"Path with directional change","Country":"United States","Case Number":"14887","Log Number":"US-01112009-0013","Sighting Duration":"00:06:00","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around January 11th 2009"],"Object Shape":"Circle, Disc, Sphere","Viewing Distance":"Over One Mile"}