{"trends":["There has been one other sighting in Montesano","There were no other sightings in Montesano on or around January 11th 2009"],"Longitude":"-123.602663","divs":["sighting detailsi was home watching tv. to my left is a large window about 6 feet wide and 4 feet high. the drapes were partly closed. it looks towards the ssw. there is complete darkness near my house. a few hundred yard away is a cliff that is from about 100 to 250 feet high. my attention was taken by something that has left me completely awestruck. i saw what i can best describe as if someone took a 10-story building with scaffolding on the outside of it, and the scaffolding had rows or striated lights aimed at the building, and the whole thing went over my home from behind my field of view and then out of view. i was too amzed to move and then i decided to call {pid}. i have been the animal control officer in aberdeen, wa for 15 years. i knew him when he was an aberdeen officer. i knew he investigated ufo's. i looked up his number but i got it wrong. it took about 10 minutes for me to get hold of him. i have lived here for 13 years. i know exactly what i can see and what is usual around my home. this was beyond anything i have ever seen. i don't know what shape it was because it filled the window. i couldn't see the edges of it it was so large. it took from 1 1\\2 to 2 seconds to go out of view."],"Date Submitted":"01/11/2009 05:15 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.981206,+-123.602663(14888)&iwloc=A&hl=en\"> mufon case (14888) map </A>","Latitude":"46.981206","Source":"MUFON","Disposition":"Unknown","Region":"Washington","Date of the Event":"01/11/2009 05:15 UTC","Tags":"City","Log Number":"US-01112009-0014","files":["/var/www/straped/mufon/html2text/14888.html.txt","/var/www/straped/mufon/org/14888.html"],"City":"Montesano","Weather Factors":"Unknown","Summary":"Massive lit-up structure flew over my home","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Case Number":"14888","Object Features":"Undisclosed","Country":"United States","Object Shape":"Other"}