{"Latitude":"48.763703","Source":"MUFON","Region":"Washington","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Oval, Sphere","City":"Bellingham","Disposition":"Insufficient Data","Summary":"Observed and photographed sphere from jet window.","files":["/var/www/straped/mufon/html2text/14882.html.txt","/var/www/straped/mufon/more/14882_submitter_file1__ufo2.jpg","/var/www/straped/mufon/more/14882_submitter_file2__ufo2neg.jpg","/var/www/straped/mufon/org/14882.html"],"Object Flight Path":"Unknown","Date of the Event":"05/19/2008 04:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=48.763703,+-122.478975(14882)&iwloc=A&hl=en\"> mufon case (14882) map </A>","Object Features":"None","Viewing Distance":"Unknown","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around May 19th 2008","This sighting has been favorited 1 time.",""],"Log Number":"US-01112009-0008","Date Submitted":"05/19/2008 04:05 UTC","Country":"United States","Tags":"City","Case Number":"14882","divs":["Sighting DetailsI was flying on Alaska Airlines from Petersburg Alaska to Seattle Washington on June 19th 2008. It was a few minutes after 4 pm and the sound of the jets engines slowing for decent woke me up. I glanced out my window near the back of the jet and saw what at first I thought was a reflection or glare on the window. I observed it for a minute or two, changing my viewing position to be sure it was not glare or some kind of reflection. I then took out my camera (Sony DSC-S85) that I keep on hand at all times and took a few photos. One photo is regular and one is negative art. The light did not change in any way while I observed it. It appeared to be 1000 to 3000 feet below me? We were flying through clouds and the light would dim and brighten based on how much cloud cover there was between my eye and the object. We had just begun decent when I saw it so we had to be at around 30,000 feet still. I would guess that would put it around the Canadian border or Bellingham Washington area. I then put the photos on my laptop right away to analyze them better. After I put my laptop away I looked out again and it was gone. I told one of the pilots that I had photographed a strange object on the flight and he just laughed at me."],"Longitude":"-122.478975"}