{"files":["/var/www/straped/mufon/html2text/14897.html.txt","/var/www/straped/mufon/org/14897.html"],"City":"Ames","Disposition":"Insufficient Data","divs":["sighting detailsthis report being entered by iowa chief investigator, beverly trout. witness phoned trout during his sighting. while driving westbound on hwy 30, witness saw very bright star-like light\\object south of him, brighter than venus or jupiter. as he drove west, he checked to see if his van was moving past the object. it was, so he was reassured that it was not a planet or star. he pulled over to observe, called investigator trout. then turned off at next turn-off onto 230th street on outskirts of west ames, iowa. drove south about 2 miles, and seemed to get closer to object, and when it stayed in same position, he turned around to head back north to hwy. 30. on the way he stopped at house, hoping someone else could view the object, but nobody was home. when he got back to hwy 30, he saw that object had moved to the west, and when he reached home and finally stopped watching it, object was estimated as just as bright, but was now at 20-25 degrees up from wsw horizon. witness is uncertain as to object's distance or altitude, but by extending and holding hands apart says apparent size of object was 1\\4 inch, and if he includes the streaks\\rays he saw surrounding object, the measurement is 2 1\\2 inches."],"Region":"Iowa","Longitude":"-93.617652","Sighting Duration":"00:36:00","Weather Factors":"None","Summary":"Light/Object brighter than Venus or Jupiter hovering, then changed direction and moved away.","Log Number":"US-01122009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=42.03197,+-93.617652(14897)&iwloc=A&hl=en\"> mufon case (14897) map </A>","Tags":"City","Date of the Event":"12/28/2008 07:17 UTC","Object Flight Path":"Hovering then path","Case Number":"14897","Date Submitted":"12/28/2008 07:17 UTC","Country":"United States","trends":["There have been 9 other sightings in Ames","There were no other sightings in Ames on or around December 28th 2008"],"Object Shape":"Saturn-like, Unknown","Latitude":"42.03197","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown"}