{"Country":"United States","Weather Factors":"Windy","Tags":"City","City":"West Hills","map":"<A HREF = \"http://maps.google.com/maps?q=34.200402,+-118.641161(14894)&iwloc=A&hl=en\"> mufon case (14894) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in West Hills","There were no other sightings in West Hills on or around November 14th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/14894.html.txt","/var/www/straped/mufon/org/14894.html"],"Longitude":"-118.641161","Case Number":"14894","Log Number":"US-01122009-0006","Latitude":"34.200402","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Disposition":"Unknown","Region":"California","Source":"MUFON","Object Features":"Patterned Surface","divs":["Sighting DetailsMe and my girlfriend were leaving her house to go to dinner just after 8:00pm at Woodlake Ave. and Saticoy Blvd. Both of us were seated in my convertible with the top down. I remember there were terrible brush fires just to the north of us near Santa Clarita and the smell of smoke was heavy in the air. Before I started my car to back out of her driveway I noticed a unusualy large object in the north east sky that caught my attention. I have always been an airplane buff, I spent hours as a kid listening to my aircraft radio, always at the end of some runway, always one eye toward the sky, built untold plastic models. So I know planes and can spot and classify military aircraft on sight. I have been to untold air shows and really enjoy the most exotic of aircraft and what I saw that Friday evening frightened the hell out of me. I pointed it out to my girlfriend and she asked what it was, I replied, \"Looks like a friggin' UFO to me babe!\" Just between hers and her neighbors house low in the northeastern sky from up here in the foothills an absolutely enormous V shaped craft was lazily headed due north, it's lack of forward speed almost suggested a lighter than air vehicle if it was a reasonably sized craft, but I knew what I was seeing was either a distorted sense of scale, or this \"V\" had to be several hundreds of feet across MINIMUM! There were numerous red lights visible from the lower rear three quarters degree view we had, so we were at it's \"8 o clock low\" from it's vantage. As far as the number of lights I cannot say for certain, I am now uncertain if they lined the forward leading edge perimeter, or were line abreast, across the bottom surface, (ventral) at right angle to the center line on the V. There was a reddish glow emeinating or reflecting off of the bottom, almost a shimmering, with some intricate fine detail barely visible underneath through the reddish glow I first attributed to reflection from the nearby forrest fire. There were no visible means of propulsion evident. I cannot stress the lumberingly slow movement of this object away from us and when it passed behind a neighbors leafless tree I quickly sped 30 feet out of the driveway to gain a better onobstructed vantage again, away from the tree, no more than 5 seconds, it was gone! I could not see any possible obstruction that could have prevented visual re acquisition. It just vanished! My girlfriend remembers being very aware then of numerous private and light commercial traffic in the sky, as there is always in the vicinity of the Van Nuys airport. I had this impression as well but feel it was a result of such intense target fixation observing the object then having no stimulus directly forward tends to widen your perception from the tunnel vison we experienced. We humans are preditors by nature with both eyes fixed forward for expanded depth perception, keyed to movement. I wish I could say I photographed my sighting, but there are seldom good cameras when you need them around. I did make a crude animated .gif file the very next day to try and record the event to the best of my and my gf's recolection. I didn't come forward earlier because I have always scoffed and outwardly derided people who have claimed to have witnessed things like I now have. I didn't want to be,\"One of those people\" but I am now. I'm not going to pilgramage out to Roswell or anything or claim abduction stories, but I will share what I saw, and know to be seen by at least me and my girlfriend. Thank god she was there to back me up! Lastly, this was above a major population area of more than 1.8 million in the valley alone, within easy visual range of one of the busiest private avaition airports in the world, Van Nuys airport. It doesn't add up?"],"Object Shape":"Chevron","Summary":"Very large V shaped with red lights visible underneath in san fernando valley","Date of the Event":"11/14/2008 08:15 UTC","Sighting Duration":"Undisclosed","Date Submitted":"11/14/2008 08:15 UTC"}