{"Date of the Event":"06/11/1959 10:20 UTC","Viewing Distance":"Unknown","Summary":"Had an encounter with an ET.","Country":"United States","Sighting Duration":"Undisclosed","Region":"California","files":["/var/www/straped/mufon/html2text/14895.html.txt","/var/www/straped/mufon/org/14895.html"],"Date Submitted":"06/11/1959 10:20 UTC","Longitude":"-117.291712","Case Number":"14895","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.542773,+-117.291712(14895)&iwloc=A&hl=en\"> mufon case (14895) map </A>","Log Number":"US-01122009-0007","Disposition":"Insufficient Data","Latitude":"34.542773","Object Flight Path":"Undisclosed","Tags":"City","divs":["Sighting Detailsl am a 61 yr old male and l have never seen a ufo or was ever really interested in them. what l want to tell you is that in Nov. l had a heart attack and almost died. During that time in the hospital l had what l thought where bad dreams or nightmares. But those dreams kept getting longer and more detailed. this is the facts of that day in 1959. On the morning of june 11, 1959, while visiting my older sister in Victorville ca. a kid that l had become pals with invited me to go jack rabbit hunting in the desert. we had an old jalopy that was the kids uncles. we both had 22 rifles and jugs of water and pbnj sandwiches for the day. We headed out towards the dump near Travis afb. we shot at and missed a few rabbits. we started to look at the items in the dump, the majority of the stuff was discarded air force stuff like old helmets and oxygen masks and what l thought was jet parts. At about 10:00 we stopped and had some water and a sandwich. suddenly a man appeared from nowhere he was just standing there in front of us about 10 feet away. there was nothing for him to be hiding behind or jump out from. this is what he looked like He was very tall, about 7 ft and almost skinny very slender and he had long reddish blonde hair, and a beard that was the same color. his complextion was fair, like that of a person who didnt go out in the sun. He was smiling at us he had big white teeth, and the bluest eyes that l have ever seen. And he shimmered or his clothes did. Tim and l were sitting there frozen to the ground. and then he spoke he said Hello. Tim and l both said hello back. Now l want you to know that for almost 50 yrs all that l had remembered was the hunting trip and the dump and going home, but after my near death expereince the memories expanded."],"Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around June 11th 1959"],"City":"Victorville"}