{"Date Submitted":"10/10/2001 11:10 UTC","Longitude":"-1.60969","Viewing Distance":"501 Feet - 1 Mile","Latitude":"54.981262","Case Number":"14904","Date of the Event":"10/10/2001 11:10 UTC","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other","Weather Factors":"Medium","Disposition":"IFO","Object Features":"Unknown","divs":["Sighting DetailsAt 23.10 hrs, on the above date, I alighted from the car which was bringing me home from the factory where I had just finished a late shift.A fellow passenger,who lived on a nearby estate,also got out of the car. Having wished him good night, we parted company and I made my way home. As I did so, I looked eastward into the evening sky and saw three diffuse blue lights hanging stationary in the sky in a triangular formation behind a thin cloud layer. As I got closer to home,and away from the glare of the street lights, I could make them out more clearly.Intrigued,I went directly into the garden for a better look.The garden is bordered by an 8ft hedge which blocks out most of the street lighting. I watched the stationary lights for approximately 30 seconds before entering the house and going to the east facing bedroom, where my wife was watching TV. As we watched, the lights began moving in random directions, independent of one another. Suddenly, a fourth light split away from the southerly light and moved across to the northerly light, taking about four seconds to do so. It then went back to its original position, passing just above and in front of the easterly light,which looked dimmer than the rest. At one point three of the lights converged then split apart again. They made sudden directional changes and accelerated and decelerated in a simialr fashion. By now, I had gotten my Praktica W14x25 binoculars and was watching the lights from the open bedroom window. I trained them on one of the moving lights and noticed that as it passed through thinner cloud cover its diffuse glow intensified, giving me the impression that it was an internally lit light source behind the cloud and not, as I had suspected,the product of a ground based light source being shone onto the cloud face, such as a lazer or searchlight. I rejected the latter scenario as there were no attendant searchlight beams.The former theory is possible, but for the fact that the light which travelled across a thinner cloud cover should have dimmed, and not brightened,because there would be fewer water droplets to reflect it. Moving into the garden again,my wife still watching from the window,I continued my observation of the aerial manouvres through the binoculars. Suddenly, the lights simultaneously blinked out and never returned. It was some time before I actually fell asleep that night. Various scenarios kept presenting themselves to my mind. I had already rejected the ground based light source theory. The event took place close to Newcastle Airport.Could they have been coventional aircraft? I quickly ruled out this theory, too, because,the observed lights were not accompanied by engine sounds and were electric blue in colour.At no time did I notice standard navigation lights. Furthermore, their erratic manouvres,when seemingly in close proximity to one another,would have constituded a 'near miss - something a commercial pilot is trained to avoid at all costs."],"Region":"England","Source":"MUFON","Log Number":"GB-01132009-0003","City":"Newcastle Upon Tyne","Tags":"City","trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around October 10th 2001"],"Summary":"Three stationary blue lights in triangular formation, and a fourth light travelling back and forth between two of the stationary lights.","map":"<A HREF = \"http://maps.google.com/maps?q=54.981262,+-1.60969(14904)&iwloc=A&hl=en\"> mufon case (14904) map </A>","files":["/var/www/straped/mufon/html2text/14904.html.txt","/var/www/straped/mufon/org/14904.html"],"Object Flight Path":"Stationary,Path with directional change","Country":"United Kingdom"}