{"Longitude":"-97.089567","Region":"Oklahoma","Date Submitted":"01/13/2009 12:12 UTC","Object Shape":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"14905","map":"<A HREF = \"http://maps.google.com/maps?q=35.009512,+-97.089567(14905)&iwloc=A&hl=en\"> mufon case (14905) map </A>","Tags":"City","Date of the Event":"Unknown","divs":["Sighting DetailsCase listed below is most likely a XUFO RC device. I have two myself and that is what the witness has described here. Further, witness claims to have been at the park participating in RC airplane activity, perhaps someone else was flying their XUFO RC. YOu can query XUFO's on YOUTUBE and see for yourself. Even the red light on bottom is the same. XUFO's can fly upward of 100m. Case Number: 14892 Log Number: US-01122009-0004 Submitted Date: Mon, 12 Jan 2009 07:12:50 GMT Event Date: Fri, 09 Jan 2009 22:30:00 GMT Status: Submitted City: McKinney Region: Texas Country: US Longitude: -96.61499786376953 Latitude: 33.198001861572266 Shape: Saturn-like Duration: 00:00:01 Distance: Unknown Description: My wife and I were at the park. The wind was high and we were walking the dogs. We go to the park a lot mostly so I can fly my RC airplanes but the wind was too strong. After walking the dogs we were about to leave and I decided to take some radom pictures of the sky. In the first picture you can see the object. The next picture was taken just a second later as I moved the camera only slightly to take another picture. The object did not appear in the second shot. We did not see or hear anthing. The strange thing about this shot is that of a report I filed earlier last year we were standing in the opening between the trees in the picture and a star like object came from the south to the same position and stoped. It stayed in that same spot for about 15 min then faded away. If the report can be checked I think it was at about the same time of day. Attachments Click to View Attachment 1 Click to View Attachment 2"],"Object Flight Path":"Undisclosed","Log Number":"US-01132009-0003","files":["/var/www/straped/mufon/html2text/14905.html.txt","/var/www/straped/mufon/org/14905.html"],"trends":[],"Source":"MUFON","Viewing Distance":"Unknown","Summary":"Misidentification of case number 14892...hoax","City":"Undisclosed","Object Features":"Undisclosed","Latitude":"35.009512","Disposition":"IFO","Weather Factors":"Unknown","Country":"United States"}