{"Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14900.html.txt","/var/www/straped/mufon/more/14900_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/14900.html"],"Case Number":"14900","Longitude":"-117.918978","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"33.875072","Summary":"Circular UFO with lights.","Date of the Event":"01/12/2009 12:00 UTC","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"00:05:00","Log Number":"US-01122009-0012","Date Submitted":"01/12/2009 12:00 UTC","Object Flight Path":"Hovering then path","Object Shape":"Circle, Disc","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=33.875072,+-117.918978(14900)&iwloc=A&hl=en\"> mufon case (14900) map </A>","divs":["Sighting DetailsI went outside the night because my brother said there was a UFO. So I went outside and then they showed me the weird thing in the sky. At first I didn't believe it but then I came to realize that it couldn't have been a plane because it wasn't moving and the lights were in a crescent shape which meant that it might have been circular and on the top of it was a red light flashing. There were at least 8-10 lights in the crescent on the bottom and the lights went in a flashing order from first to last but very fast. Then I went into my house to get the vc but by the time I came out it was gone. The Picture I included is a representation of the sighting. The sky was much more lighter and there were not as many stars. The lights flashed from the bottom left first dot to the bottom right and disappeared for a while \" I suppose while it went around the other side\" and did this for the time that we watched it. During this time the red dot at the top also flashed. The picture is also a close up. The distance was much farther and the dots were much smaller. This is what I got so far and if you have any questions just ask."],"City":"Fullerton","Region":"California","Tags":"City","trends":["There have been 14 other sightings in Fullerton","There were no other sightings in Fullerton on or around January 12th 2009","This sighting has never been favorited.",""]}