{"files":["/var/www/straped/mufon/html2text/14906.html.txt","/var/www/straped/mufon/org/14906.html"],"Object Shape":"Unknown","Case Number":"14906","Tags":"City","Object Features":"Unknown","Date Submitted":"01/04/2009 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Longitude":"-121.267447","Summary":"Large bright light changed colors and direction very fast.","Latitude":"38.134577","Viewing Distance":"Over One Mile","Country":"United States","divs":["Sighting DetailsiT HAS BEEN MY CUSTOM FOR THE PAST SIX MONTHS TO TAKE MY DOGS FOR A RUN EARLY IN THE MORNINGS. USUALLY I GO OUT TO ALPINE ROAD AND TURN SOUTH TO WHERE HANDEL RD. INTERSECTS. ON THE MORNING OF JANUARY 4TH I WAS DRIVING ON HARNEY TOWARD ALPINE WHEN I SAW AHEAD APPROX. 2 MILES A LARGE WHITE LIGHT. I THOUGHT AT FIRST IT WAS A PLANE'S LANDING LIGHTS, BUT THEN THE COLOR PATTERN STARTED. IT TURNED RED-VIOLET, THEN A BRIGHT BLUE-GREEN AND BACK TO WHITE, SO I KNEW IT WAS NOT A PLANE. IT SEEMED TO BE STATIONED OVER THE P G & E SUBSTATION THAT IS EAST OF HWY 88 ON KETTLEMAN. I LOST SIGHT OF IT BECAUSE OF TREES, AS I TURNED ON ALPINE RD. BUT WHEN I COULD SEE IT AGAIN, IT SEEMED TO STILL BE IN THE SAME AREA OF THE SKY. BECAUSE OF THE CHANGE IN MY POSITION, IT, TOO, SEEMED TO BE A LITTLE SOUTH OF WHERE IT HAD BEEN. nOW IT TURNED BACK TO WHITE AND MOVED, VERY FAST UP WARD MAYBE 15 DEGREES. iT AGAIN BEGAN IT'S DAMCING MOVEMENT AND TURNED RED VIOLET, THEN BLUE-GREEN AND BACK TO WHITE. wHEN IT TURNED TO WHITE IT MOVED FAR UP, MAYBE 45 DEGREES AND ZIP, IT WAS GONE. tHIS ALL HAPPENED OVER A TIME OF ABOUT 2 HOURS. I FIRST SAW IT ABOUT 12:30, AtHIS IS ONE OF THE MORE SPECTACULAR OBJECTS I HAVE ND WHEN IT VANISHED IT AS 2:45 am THIS WAS ONE OF THE MORE SPECTACULAR OBJECTS I HAVE SEEN AND I ENJOYED THE SHOW WHILE IT LASTED."],"Region":"California","Sighting Duration":"Undisclosed","Log Number":"US-01132009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=38.134577,+-121.267447(14906)&iwloc=A&hl=en\"> mufon case (14906) map </A>","trends":["There have been 20 other sightings in Lodi","There were no other sightings in Lodi on or around January 4th 2009"],"Weather Factors":"Unknown","City":"Lodi","Date of the Event":"01/04/2009 12:00 UTC","Disposition":"Insufficient Data","Source":"MUFON"}