{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/14914.html.txt","/var/www/straped/mufon/org/14914.html"],"Viewing Distance":"Over One Mile","Source":"MUFON","Object Features":"Unknown","Summary":"A crescent-shaped string of lights in the sky.","Log Number":"US-01142009-0001","Disposition":"IFO","Date of the Event":"01/12/2009 06:30 UTC","Date Submitted":"01/12/2009 06:30 UTC","Latitude":"33.664327","map":"<A HREF = \"http://maps.google.com/maps?q=33.664327,+-117.989526(14914)&iwloc=A&hl=en\"> mufon case (14914) map </A>","Tags":"City","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around January 12th 2009"],"Country":"United States","Case Number":"14914","Object Shape":"Disc","City":"Huntington Beach","Object Flight Path":"Straight-line path","Region":"California","Longitude":"-117.989526","divs":["Sighting DetailsI left my office around 6:30 PM. As I approached the intersection of Skylab and Springdale in Huntington Beach, I noticed an unusual \"string\" of lights above the trees toward the east. I couldn't see any kind of shape because it was quite dark, and whatever it was appeared to be a few miles away, possibly over the neighboring city of Fountain Valley. At first I thought it may be a street light obscured by a tall tree or even a plane or helicopter--maybe even a blimp. But Orange County has busy skies, and I compared this string of lights to other objects in the sky that were obviously planes and helicopters. It was definitely neither. As I turned right on Springdale, I noticed whatever it was was also heading south at what appeared to be a pretty low altitude. I wasn't afraid (probably because it wasn't that close). I was intrigued and almost mesmerized by this mysterious object. As I kept one eye on the road and one on the object, I noticed that it had several lights (8 to 12, as I recall) arranged in something of a crescent-shape. One light was not lit, and this unlit light seemed to pass to the left. Although I couldn't see the object, just the lights, this light activity made the object appear to be rotating in a clock-wise direction. At the same time, the object moved slowly and very smoothly, parallel to the ground in a southbound direction. Going 45 MPH, I was able to keep up with it for about 2 miles until I had to turn off at my destination. I really thought my imagination was playing tricks on me until a co-worker showed me the MUFON web site today and showed me similar accounts of what I saw around the same time. Now I'm starting to wonder if it really was something."],"Sighting Duration":"Undisclosed"}