{"Longitude":"-80.667558","City":"Belle Glade","map":"<A HREF = \"http://maps.google.com/maps?q=26.68451,+-80.667558(14913)&iwloc=A&hl=en\"> mufon case (14913) map </A>","Tags":"City","Object Features":"Unknown","Log Number":"US-01132009-0011","Region":"Florida","files":["/var/www/straped/mufon/html2text/14913.html.txt","/var/www/straped/mufon/more/14913_submitter_file1__ufo_14913.jpg","/var/www/straped/mufon/org/14913.html"],"Case Number":"14913","Country":"United States","Date of the Event":"11/30/2000 02:00 UTC","Summary":"Red, blue and yellow, are not only the primary colors.","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"11/30/2000 02:00 UTC","Object Shape":"Bullet, Missile, Cigar, Oval","trends":["There have been no other sightings in Belle Glade","This sighting has never been favorited."],"Latitude":"26.68451","divs":["Sighting Details It was about 2001-2002 a co-worker and I were travelling back from Belle Glades on (state road 98) Southern Blvd heading east bound, when we saw something bright in the sky, we thought to see a falling star. the object was on the right side of the truck. It was red, blue and yellow oval in shape, we observe it for about 7-8 seconds when suddenly we saw two fighter jets and a hellicopter come from behind us, the object that was on my right driver side door window (north) and about 500 feet in the air suddenly flew a mile or so (north,northeast) in front of us, my eyes followed as I saw the object moved to my left hand side windshild in my company truck, as the jets and helo adjust direction, the object flew (south, southeast) to our right of my windshield again the jets turned the helo followed, the odject flew back to the left hand side windshield (northeast) and flew straight up to the heavens. When I first saw the this object I had no reaction, but I always remember what happen that morning and how much scared, disbelive and excited I felt. I still seek an answer, funny thing is on a ufo show couple years later, someone painted a picture of the same object I saw, and they did NOT live anywhere near me."],"Weather Factors":"Does Not Apply","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unknown","Sighting Duration":"Undisclosed"}