{"Tags":"City","Latitude":"30.054511","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=30.054511,+-83.172378(14919)&iwloc=A&hl=en\"> mufon case (14919) map </A>","Summary":"Was awaken from sound sleep to find five(5) figures standing at the foot of my bed. I was inside a force field. Very cold.","Disposition":"Unknown","Weather Factors":"Unknown","Log Number":"US-01142009-0006","files":["/var/www/straped/mufon/html2text/14919.html.txt","/var/www/straped/mufon/org/14919.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["sighting detailsi had gone to beed at app. 11:pm. some tine in the wee hours i was awoke to find five figures standing at the foot of my bed. i was startled needless to say. but at the same time i felt reassured that nothing harmful would happen to me. the tallest was app. 7' tall, the next was 6'-61\\2'tall, the next was 5'-51\\2'tall, the next was 4'-4 1\\2' tall the next was 3'tall. they all had on monks roabs with hood i could not make out any features. they were not minicing, just standing there observing me. i was aware of a force field around my bed, clear opaque, blue opaque, and green opaque, the force field moved in wavy lines upward to the ceiling of my bedroom, between me and my visitors. i recall that my covers were neetly folded under my arms, with my arns laying atop the covers. (i never sleep this way,even in the summer, i have to cover my arms.) i was flat of my back, and i never sleep this way i sleep on my side....... it was extreamly cold.... inside the forcefield.. my arms felt like they would freeze off if i did not get them under the cover. but i could not move... i struggled and struggled until i finally got my arms underneath me... and some of the covers over my shoulders... the last thing i am aware of is the male figure saying \"she's strong isn\"t she?\" ans a female voice saying \"yes she is.\" and i was asleep again. the memory was very vivid in my memory the next morning. and i have not forgotten it since. i strongly feel it was a true experience, not a dream. i do not think i could have felt the extream cold i did in a dream. this was real. i have been an experiencer of these kind of events all my life. and to boot i think it has been going on for five generations, my grandmother, mother, myself my son and daudhter, and my 4 grandchildren. this is for jackrabbit hunters in victorville oro., 6\\11\\1959 grande calif. i have seen them also. contact me. {pid}"],"Longitude":"-83.172378","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around December 31st 1988"],"City":"Mayo","Viewing Distance":"Unknown","Object Shape":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","Case Number":"14919","Object Features":"Undisclosed","Date of the Event":"12/31/1988 03:10 UTC","Date Submitted":"12/31/1988 03:10 UTC"}