{"trends":["There have been 23 other sightings in Beaverton","There were no other sightings in Beaverton on or around July 21st 1968"],"Disposition":"Unknown","Country":"United States","Date of the Event":"07/21/1968 10:00 UTC","Object Shape":"Disc","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=45.494742,+-122.80113(14912)&iwloc=A&hl=en\"> mufon case (14912) map </A>","Weather Factors":"Unknown","City":"Beaverton","Region":"Oregon","Date Submitted":"07/21/1968 10:00 UTC","Summary":"Silent disc/saucer direct slow flight overhead.","Source":"MUFON","Log Number":"US-01132009-0010","Sighting Duration":"00:00:15","Tags":"City","files":["/var/www/straped/mufon/html2text/14912.html.txt","/var/www/straped/mufon/org/14912.html"],"Latitude":"45.494742","Longitude":"-122.80113","Object Features":"None","Case Number":"14912","Viewing Distance":"101-500 Feet","divs":["sighting detailsas a 10 yr. old boy, living in beaverton, oregon, i would frequently sleep in the backyard during the summer, with my brother (a year older than i), and frequently some other neighbor friend(s). this particular evening, there were three of us staring at the sky, looking for meteors, and talking and joking. suddenly we observed perhaps a quarter mile away, at perhaps 150-200ft. above the ground, an array of lights slowly moving (20mph or so)right at us! soon afterward, it became obvious that this was a saucer shaped craft. i ran inside the house, and screamed for my father to get outside now! he reacted quickly, we all ran back out, and were able to see the craft go directly overhead, and then the neighbors trees obscured the sighting. the craft had multiple white lights in the front, with a red and a blue light at the edges illuminating the round shape. i recall feelings of fear, yet excitement. seeing the photos at the following website http:\\\\www.ufoevidence.org\\photographs\\section\\recent\\photo416.htm i got a rush of energy, as i found almost exactly what i saw 41yrs. ago. this is a 15 second episode in my life that will not be forgotten."]}