{"Source":"MUFON","trends":["There have been 14 other sightings in Lawrenceville","There were no other sightings in Lawrenceville on or around January 14th 2009"],"Latitude":"33.963005","Object Features":"Unknown","Country":"United States","Tags":"City","Summary":"Venus-like object sighted...but in SW sky, Moving across wind, stops, then moved again.","divs":["sighting detailsnoticed stationary venus-like object aprox 20degrees off horizon in sw\\s sky. object moved like 4degrees further westward. stopped. looked for beacon and directional lights; none visible. watched object for aprox 5 more minutes as it remained motionless. object again moved aprox. 4degrees further westward. again stopped. noticed position of fisrt tree, second tree, and third tree. ground referenced used as sky was partially overcast but many stars visible; on-and-off. checked time and watch compass. noted it as 10:20pm and n-s reference. object still stationary at swxs position. still no beacon or directional light visisble. from intial point of sighting ( first tree as reference ) object relocated 6 times within a total viewing period of aprox 20 - 30 minutes. decided to go for camera and in less than 2 minutes object no longer visible in sky. no trail vivible, no plane sound, object vector flat. misc, would have believed it to be plane except: 1. no beacon or directional lights visible. 2. object moved, stopped, stayed motionless for 2 to 5 minutes. moved again. stopped again. remaining motionless again for about 10 minutes. moved again. stopped again. remained motionless for like another 5 minutes. 3. planes at night can often appear to be motionless relative to their path of flight. when this happens it is the same until angle of view saturates... object's vector was flat. object moved, stopped, stayed. repeated several times. vector not towards me or at angles towards me. 4. unable to reference object against anything of known size. a. unable to say altitude of object. b. unable to say size of object. appeared much larger than any satelite i have seen to date. could have easily been a very bright venus except for different quality of light than a star. plus location and movement."],"Region":"Georgia","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.963005,+-83.983092(14917)&iwloc=A&hl=en\"> mufon case (14917) map </A>","files":["/var/www/straped/mufon/html2text/14917.html.txt","/var/www/straped/mufon/org/14917.html"],"Weather Factors":"Windy, Medium, Light, Unknown","Log Number":"US-01142009-0004","Date Submitted":"01/14/2009 10:22 UTC","Date of the Event":"01/14/2009 10:22 UTC","City":"Lawrenceville","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Longitude":"-83.983092","Disposition":"IFO","Case Number":"14917","Object Shape":"Star-like","Sighting Duration":"00:20:00"}