{"Disposition":"IFO","City":"Albuquerque","Object Flight Path":"Undisclosed","Date of the Event":"02/02/2008 06:25 UTC","Country":"United States","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around February 2nd 2008"],"Latitude":"35.090151","Viewing Distance":"Unknown","Region":"New Mexico","Object Shape":"Triangle","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14925.html.txt","/var/www/straped/mufon/org/14925.html"],"Tags":"City","Log Number":"US-01142009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=35.090151,+-106.641527(14925)&iwloc=A&hl=en\"> mufon case (14925) map </A>","Sighting Duration":"00:00:20","Date Submitted":"02/02/2008 06:25 UTC","Longitude":"-106.641527","divs":["Sighting DetailsDriving to work in Albuquerque, traveling west on Academy from the intersection of Academy and Wyoming. Dark out. Noticed this object flying from NE to SW. This is totally wrong for any kind of approach pattern for the airport. Actually 180 degrees out of what is normal or possible. Best guess 500-1000 feet altittude. Moved at twice the speed of the choppers from Kirtland but way to slow for anything that big at that altitude. Could not see the craft's shape due to darkness and light pollution. Did see 3 bright white lights pointing straight down. One in the lead and two trailing to form a triangle. Huge diameter on these lights. Best guess 4- 6 feet in diameter. Very bright. In the center, a red light. No sound. I almost hit the curb a couple of times. I have studied aircraft most of my adult life, can identify most military air craft and have never seen anthing like this. It wasn't right. Nothing in the media about it. Hmm. They are testing the Ossprey here, but this was not it either. I see them all the time. I saw an artist's rendering on your program on the History Channel that was the spitting image of what I saw. It did not change direction and disappeared into the SW valley of Albuquerque as I had to turn north to go to work. I have studied ufos for about 15 years and was excited to have seen this. It did not scare me, just wonder and amazement."],"Summary":"See below.","Case Number":"14925","Source":"MUFON","Weather Factors":"Unknown"}