{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/14924.html.txt","/var/www/straped/mufon/org/14924.html"],"Date of the Event":"12/31/2007 08:57 UTC","Date Submitted":"12/31/2007 08:57 UTC","Case Number":"14924","Log Number":"US-01142009-0010","Tags":"City","divs":["sighting detailsat 8:57am time approximate i [cms\\pid\\tg] a security guard with [cms\\pid\\tg] while at the menlo park veteren's home notice on my security monitor a disc shaped object changing shape with a blue glowing ring located around it. i also took notice of the ground under it(glowing blue as well) i shot 1:00min of very clear footage(which i still have) on my cam phone as well as a picture taken not too long after the craft vanished(of what appears to be a face in the rocks by our american flag) *all of the footage is clear as day. the whole event took place over a time of 15mins* and was witnessed by myself as well as another security guard and residents within the va home. i have no in my life encountered anything like this. it made no noise,it was metallic(you can see in vid2 on my phone) the top reflects light(gleaming) key points: 1st: noticed the object on security cams located at my security desk 2nd: the object was hovering by a vehicle parked in the parking lot directly outside and to the left. the object had a blue ring around it(as seen in the video's) and changed shape(got bigger then reduced it's size) *at one point i personally witnessed the aforementioned object flatten itself out completely. 3rd: i lost site of the object when it glowed very brightly then was gone(just gone) as if it vanished. *enclosed are the vid's taken off phone and the pic* you may contact me if you like regarding this matter...as of now i'm a believer..."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.523355,+-74.403225(14924)&iwloc=A&hl=en\"> mufon case (14924) map </A>","Object Features":"Undisclosed","Longitude":"-74.403225","Source":"MUFON","Region":"New Jersey","Summary":"Disc Shaped object with blue glowing ring around it(changing shape) taken at Menlo Park Veteren's Hom 12/31/07.","Object Shape":"Disc","Viewing Distance":"Unknown","trends":["There have been 6 other sightings in Edison","There were no other sightings in Edison on or around December 31st 2007","This sighting has never been favorited.",""],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","City":"Edison","Latitude":"40.523355"}