{"trends":["There has been one other sighting in Barnesville","There were no other sightings in Barnesville on or around November 5th 2008","This sighting has never been favorited.",""],"Region":"Georgia","City":"Barnesville","Case Number":"14920","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.054571,+-84.15575(14920)&iwloc=A&hl=en\"> mufon case (14920) map </A>","Date Submitted":"11/05/2008 08:36 UTC","Longitude":"-84.15575","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Summary":"Object seen in daylight traveled horizon to horizon less than 1 min no sound no jetstream.","Latitude":"33.054571","Log Number":"US-01142009-0007","Date of the Event":"11/05/2008 08:36 UTC","Tags":"City","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/14920.html.txt","/var/www/straped/mufon/more/14920_submitter_file1__336549135_1153452722_0.jpg","/var/www/straped/mufon/more/14920_submitter_file2__336549135_1153452722_0.jpg","/var/www/straped/mufon/more/14920_submitter_file3__336549695_1153454783_0.jpg","/var/www/straped/mufon/org/14920.html"],"Viewing Distance":"Unknown","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["sighting details isawi was standing in my back yard cleaning gutters wheni saw theobject above treetops on eastern horizon .i watched it cross to western horizon and out of view in less than 1 minute its color is difficult to describe it was the color of a sunrise or sunset sort of pinkish orange it was metal but looked warm it was higher than most jets but was o lot bigger approx 1\\2 inch in the sky whereas jets usually seem about 1\\8 inch or smaller it crossed the sky faster than any jet i have ever seen even when they used to break the sound barrier also it was silent with no jetstream noted. i snapped about 6 pics with my camera phone which i happened to hae with me at the time. i emailed the pics to my computer and can barely see it on the screen except with a magnifying glass. to enlarge the pics causes the object to become pixillated. i watched the object intil it disappeared from view headed in a northwestt direction. i was amazed at the spped the object was travelling and that it made no sound. no one believed me when i told them about it later that day. i felt sure that what i saw was a ufo when i first saw it. it travelled across te sky in astraight line faster than anything i have ever seen in the sky"]}