{"files":["/var/www/straped/mufon/html2text/14928.html.txt","/var/www/straped/mufon/org/14928.html"],"divs":["Sighting DetailsI was amongst a group of revellers walking back to our room when I spotted \"Mars\" in the sky. The sky was very clear with the moon as a small crescent and Jupiter lighting up the Western sky. In the crowd of people were my fiance, my eleven year-old son and a group of other people that we did not know. I then realized that Mars could not be in the sky at that position and the red light source was brighter than even Jupiter. Someone suggested that it was a helicopter, but there was no starboad green light and no strobe. There was also no sound from the object. The object remained stationary for about four minutes then started to move slowly in our direction. When the object was almost directly over our head it stopped once again. We could not make out the form of the object but at this point it was even brighter than when we first saw the object. After about a minute the object started to fade out and then blinked out of sight. The \"fade\" took about ten seconds to happen and we presume that the object went straight up. The following day I was in the bar and met five people from Montreal. They also saw the object and were very excited to hear my story. They stayed up later than we did and reported that the object \"came back\" at about 1:15. They described the object as coming in from the West slowly and stopping above them, just out to sea. It remained stationary for about five minutes then gradually accellerated away towards the East and vanished."],"Date Submitted":"01/01/2009 01:12 UTC","Tags":"City","Longitude":"-76.257222","Object Shape":"Star-like","Weather Factors":"Unknown","Region":"Holguin","Date of the Event":"01/01/2009 01:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=20.888611,+-76.257222(14928)&iwloc=A&hl=en\"> mufon case (14928) map </A>","Disposition":"Unresolved","Summary":"New Years Eve sighting of Mars like moving star.","Sighting Duration":"Undisclosed","Log Number":"CU-01152009-0003","City":"Holguin","Object Flight Path":"Undisclosed","Country":"Cuba","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"20.888611","Object Features":"Undisclosed","Case Number":"14928","trends":["There have been no other sightings in Holguin","This sighting has never been favorited."]}