{"Summary":"Multicolored ball in northern Indiana.","Region":"Indiana","Date of the Event":"01/13/2009 08:20 UTC","Weather Factors":"Unknown","Tags":"City","Longitude":"-86.352616","trends":["There have been 15 other sightings in Logansport","There were no other sightings in Logansport on or around January 13th 2009"],"Source":"MUFON","Latitude":"40.761094","Case Number":"14922","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/14922.html.txt","/var/www/straped/mufon/org/14922.html"],"Object Features":"Undisclosed","Date Submitted":"01/13/2009 08:20 UTC","Sighting Duration":"Undisclosed","Country":"United States","City":"Logansport","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-01142009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.761094,+-86.352616(14922)&iwloc=A&hl=en\"> mufon case (14922) map </A>","Object Shape":"Sphere","divs":["Sighting Detailshi I was wondering if you know anything about a light seen in northern Indiana from 820 to 925 ish last night. I didn't get off work till 820 and work in kokomo the light followed me all the way home and at one put when 2 fighter jets flew towards it but underneath it it took off like 5 times faster than it was travel for the last 20 mins. it jumped ahead of me maybe 5 miles hard to say because it was parallel with me and not real close. It must have stop moving because i never lost sight of it. I was close to home and was worried I wouldn't be able to take pictures of it, but then it started to come towards Logansport it crossed the front of my car while I was still headed in the same direction I had been for last 20 mins. So it went from my left side to in front of me way ahead still on left to directly in the front of my car to slightly right in all. I then turn putting it back on my left side for about a min. Then i turned on my road that follows the river and it was in front of me again. It appeared to be sitting above the wooded area in between the Logansport State Hospital and Gergotown a town of about 150 people but it was on the opposite side of the river the town is on. I took maybe 30 pictures of this light which change colors from white to blue to green yellow red orange. My father also saw this light. With high powered binoculars the light looked to pulse and the colors seemed to move to gather not solid colors which appears in the pictures. It was below the clouds are around the clouds. It lit up the clouds around it. I thought maybe something was burning up coming into the atmosphere but after it not moving for at least 10 -15 i decided that wasn't it. On my way home i couldn't see any stars and this was low so i thought it was a tower light and was why i kept looking at it waiting for me to pass the tower i made it all the way to galveston before I realized it was moving with me. I thought maybe it was a re-fueler with it runway lights on sense grissom is right there and they fly all the time until the jets which looked like warthogs flew underneath it and it took off. The speed it took off at is not surprising of the jets i seen at the base except for it doing it with no after burner flair and so low to the ground. Also it stop for 10-15 at least by my house also when it went over the town as i drove threw them galveston and walton it seem to slow down because i had to slow down to 35 mph and it never passed at one put fell back being me a little so the only jet i have seen that could do this is a raptor but looking at this thing threw binoculars it was not a raptor it was a perfect ball. the light admitted looked brighter in middle and towards bottom but not all the way down the top and bottom were same brightness. I have seen jets from raptor to c10 at night and it was nothing i have seen before. It was 3 degrees outside so im not sure hwo long i was outside watching this thing thats why i say 10 -15 it sat there. I went inside to get on MSN and tell my friend to go out and look to see if he could see it from his house. It took maybe 3 mins to convince him I wasnt messing with him. He said he didn't see anything so I went back out to look it was gone. Only regret i didn't see it leave, but it did leave after not moving for 10 -15 mins it was gone no where in the sky to be found. I took about 30 pictures some are a little shacking because it was cold I have an 5 mega pixel cannon with telescopic lens its a good camera and there good pictures. Please do not post my pictures anywhere with out my permission. Im not sure if I want to even tell anyone about this in real life. they probably think i a nut and i live in a small town. I tagged them with my on line handle and a blog I run because that i ll have to tag with just in case. Again do not post these please. {CMS} sorry about spelling and grammer mistakes thank you for your time"],"Viewing Distance":"Unknown"}