{"Latitude":"41.602275","files":["/var/www/straped/mufon/html2text/14933.html.txt","/var/www/straped/mufon/org/14933.html"],"divs":["Sighting DetailsStanding on front porch looking for the moon it was supposed to be clear that night when i look north and saw 5 red lights some were blinking with 3 in a triangular shape in the front with an shapeless orange light that seemed to be leading (not like the red which were points of light. sort of a blob shape to the light. Not round ) 2 red points of light horizontal in alignment in the back. the last light was blinking. [( *^..) crude shape but you should get the idea] moved together in a east to west direction. thought it was helicopter but this had no sound and no white or blue lights. so i thought maybe its military but still no sound. oh well, its a nice silent reeeeallllllly slow helicopter the Air Force has, i thought. i thought this until i heard about Morristown same red lights but Morristown didn't have the orange light. and the lights i saw stayed together. i really cant tell you the altitude but i know it was way under the cloud level. possibly within the standard helicopter altitude. if this is true it was larger than a standard helicopter from the orange light to the last red point of light which was blinking. i lost sight of it when it was so far west of my house it blended in with the city lights. I have included a very crude .bmp file to illustrate what i saw."],"trends":["There have been 9 other sightings in Euclid","There were no other sightings in Euclid on or around November 5th 2008","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Disposition":"Insufficient Data","Weather Factors":"None","Object Flight Path":"Straight-line path","Object Shape":"Other","Date Submitted":"11/05/2008 12:00 UTC","Object Features":"Unknown","Longitude":"-81.521407","Tags":"City","Case Number":"14933","Summary":"5 red lights, 3 in a triangular shape, 2 red points of light horizontal in alignment.","City":"Euclid","Log Number":"US-01152009-0008","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.602275,+-81.521407(14933)&iwloc=A&hl=en\"> mufon case (14933) map </A>","Source":"MUFON","Date of the Event":"11/05/2008 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States"}