{"Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/14936.html.txt","/var/www/straped/mufon/more/14936_submitter_file1__ObjectOverAtown.JPG","/var/www/straped/mufon/more/14936_submitter_file2__PPLbuilding.JPG","/var/www/straped/mufon/more/14936_submitter_file4__FRONTSIDEWALKLOOKINGNW.jpg","/var/www/straped/mufon/more/14936_submitter_file5__NORTHVALLEYFROMBACKYARD.jpg","/var/www/straped/mufon/org/14936.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"11/19/2008 07:35 UTC","Weather Factors":"None","Country":"United States","Date of the Event":"11/19/2008 07:35 UTC","Longitude":"-75.488293","Log Number":"US-01152009-0011","Tags":"City","Case Number":"14936","Object Shape":"Unknown","Disposition":"Unknown","Region":"Pennsylvania","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around November 19th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.61054,+-75.488293(14936)&iwloc=A&hl=en\"> mufon case (14936) map </A>","Summary":"Low flying object over Allentown, PA.","Latitude":"40.61054","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was a Wed. night and I was watching Jeopardy when I noticed out of the corner of my eye, out my front picture window, a large \"plane\" flying really low and I thought it was going to crash into the large apartment building down the street from my home. I live on the hill at the top of the street and the building sits a few blocks away directly in front of my house. I called my son to see if he could see it...he lives down the block... but it was too low and he couldn't see it. As I watched it I realized how slow it was moving and I didn't know what \"it\" was. I wasn't afraid because I was trying to wrap my brain around what I was watching...I just kept trying to refocus my eyes and convince myself it was just a plane. My son yelled for me to get my camera... I was just staring at it. I ran and got my camera, came back out and started taking pictures but because it was night time, the exposure was too long. It was moving very slowly and didn't make a sound. It had three white lights in the front. I live in Allentown city so there are landmarks like the PPL building in the picture that you can use to gauge how low it was and how large it was...although the object is shaky (from the long exposure). I watched it move slowly past me...it took a few minutes to approach my house and pass it. I realized it was moving too slow to be a plane and a helicopter would make some noise...this made none. I told my son to run out back to see if he could see it as it was passing... I ran out back and realized he wouldn't be able to because now it was actually moving along behind the trees that run along that stretch of road. I told him to get in his car and come pick me up so I could show him, as I watched it float out of my view. We went looking for it and tried to figure out where it went, but it had just disappeared."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Allentown"}