{"Log Number":"US-01152009-0006","Weather Factors":"Unknown","divs":["Sighting Details I was in my room playing playstation and heard what i thought was a helicopter. Every once and a while there is a helicopter that hovers throughout my neighborhood. So I looked out my window and saw 4 bright red lights with strobing white lights. So I went down stairs to show my mom out my livingroom window. She was amazed by the fomation that the lights were flying in, and the way they moved. They moved up and down in a diagonal zig-zag pattern. After a couple of minutes possibly arround five, they disappeard behind trees. So I went outside and saw the helicopter that I originaly was looking out for. For about two hours after that there was an uncoutable amount of helicopters all over the place. I know that there is a flight pattern arround the area of my house but this was no airplane or helicopter i have ever seen. I submitted this because I saw the video on historychannel.com (Morristown lights) Morristown Nj. What I saw looked just like that. As soon as I saw it I amediately got chills and goosebumps going down my body. It was really freaky."],"Summary":"4 bright red lights.","Viewing Distance":"Unknown","City":"Bensalem","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/14931.html.txt","/var/www/straped/mufon/org/14931.html"],"Source":"MUFON","Date of the Event":"01/02/2009 07:30 UTC","Case Number":"14931","Object Flight Path":"Stationary,Path with directional change","Sighting Duration":"00:05:00","Tags":"City","Date Submitted":"01/02/2009 07:30 UTC","Longitude":"-74.925868","Region":"Pennsylvania","Disposition":"Insufficient Data","Latitude":"40.101412","Object Features":"Undisclosed","Country":"United States","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around January 2nd 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.101412,+-74.925868(14931)&iwloc=A&hl=en\"> mufon case (14931) map </A>"}