{"Country":"United States","Disposition":"Unknown","City":"Park Rapids","Viewing Distance":"Unknown","Case Number":"14948","Date Submitted":"08/29/2008 03:45 UTC","Latitude":"46.922181","Object Shape":"Triangle, Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Region":"Minnesota","Date of the Event":"08/29/2008 03:45 UTC","Longitude":"-95.058632","Weather Factors":"Unknown","Tags":"City","Object Features":"Unknown","Summary":"Ver y black, six large red lights, possibly triangular.","trends":["There have been no other sightings in Park Rapids","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/14948.html.txt","/var/www/straped/mufon/org/14948.html"],"Source":"MUFON","divs":["Sighting DetailsI spent the evening with a Local Astronomer in Town named {pid} I had just purchased a nice pair of Binoculars for Sky Observation. He was to help me get back into Amateur Astronomy.We spent the evening looking at the Planet Jupiter, and looking at pictures he had taken of Deep Space Objects.So, i was excited to do my own observing. I got home about 12:30 A.m. I went to Bed. I got up at about 3:30 A.M.. I noticed out the window the Constellation Orion was in the Southeastern horizon. I grabbed my Binoculars to observe the potential objects in Orions Belt. I sat on a bench in my backyard to do the observation. As I was observing Orion a bright Red light came into my field of vision. I let the binoculars down. I observed 6 large red lights moving east toward our backyard tree line. My first impression was that it was a formation of 3 jets, and I was observing their Afterburners.As I sat there in awe, I thought there is no sound.I lifted my binoculars and got maybe a 3 sec. look at the red lights. They seemed to have a spiral type configuration to them? Then it was gone over the tree tops. I just sat there saying to myself \"WHAT THE {pd} WAS THAT\"!!!! I didn't even get up to find another observation perspective-which seems strange to me.I could not get to sleep that night. In the morning I called both our local Airport and Sheriffs office-nobody saw a thing. I know I saw something, but at times question myself. Weird"],"Log Number":"US-01162009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=46.922181,+-95.058632(14948)&iwloc=A&hl=en\"> mufon case (14948) map </A>"}