{"Latitude":"34.491101","Object Shape":"Bullet, Missile, Fireball, Unknown","divs":["sighting detailsas a dealer in a early morning sun. swap meet, was heading to the john, flickering light in darkness, made me look up+ at first thought it to be a fireworks item- fired from a fishing boat in the havasu lake. - then realized it was a meteorite fire ball, heading over the city to the se.+ it was totally silent+ after it quickly stopped burning + kept heading down + away towards the desert, i realized it was a burning large craft, with balls of rolling white hot metal things coming of of it in front + rolling back into the red-yellow fire in the middle of it. it was possibly 2000 feet up? + moving at jet plane speed? + appeared the size of a big airliner?. as i watched it just burned out + dissapearsd into the darkness in a dim red glow, + was gone. other swap meeters saw it too+ descibed exactly what i [thought] i saw! i lestened for a swish or some sound to catch up, no sound at all! it appeared to be going to crash in the desert about 5 miles from town. never a report to me as to what it was\\??- in view about 10-15 sec. possibly space junk, or a craft on fire+ headed to surly hit the desert to the se. too slow for a meteorite.????"],"Longitude":"-114.320825","Date Submitted":"01/10/2007 06:20 UTC","Log Number":"US-01162009-0003","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around January 10th 2007"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.491101,+-114.320825(14943)&iwloc=A&hl=en\"> mufon case (14943) map </A>","City":"Lake Havasu City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14943.html.txt","/var/www/straped/mufon/org/14943.html"],"Case Number":"14943","Disposition":"Unknown","Date of the Event":"01/10/2007 06:20 UTC","Country":"United States","Summary":"Large burning vehicle-slowly headed SE+quietly falling to the desert beyond.","Region":"Arizona","Object Features":"Undisclosed","Sighting Duration":"00:00:10","Object Flight Path":"Undisclosed"}