{"Longitude":"-70.924661","Object Flight Path":"Undisclosed","Case Number":"14945","Tags":"City","Object Features":"Undisclosed","Date Submitted":"09/16/2006 10:30 UTC","Source":"MUFON","trends":["There have been 2 other sightings in Peabody","There were no other sightings in Peabody on or around September 16th 2006","This sighting has never been favorited.",""],"Disposition":"Unknown","divs":["sighting detailswe were sitting around the fire at my friends house on conant st. (satilights cruz by in a strate line).these looked like they where chasing each other.they went by and before i could look down i saw this triangle come over the house.i yeld to my friends look what the hell is that?it looked like there were sparks shooting in twords the center of it.the sparks stoped and you could see the black underside the tipps remande litt it rotated slowly as it flew by slowly.if i held a coin out in front of me to the length of my arm it would be bigger than a half dollar.it was pretty close five other people saw it with me know one seemed to be to excited about it (i was).as it moved down conant st.it seemed to change shape an undistiguishing shape.i took three pic's only one shows anything but i didn't have my reading glasses with me so i couldn't adjust my cellphone camera properly the pic is very pixellated.i spoke to stanton freidmann about it and emailed the pic to him. p.s. mr friedmann is great guy.very easy to talk too.that's the second ufo iv'e seen the first was in 05 a silver\\gray orb in same town but no camera at the time.two other witnesses."],"Summary":"Saw two satelites chasing each other while looking at that the triangle flew over the house real low.","Country":"United States","files":["/var/www/straped/mufon/html2text/14945.html.txt","/var/www/straped/mufon/org/14945.html"],"Object Shape":"Triangle","Region":"Massachusetts","Log Number":"US-01162009-0005","Viewing Distance":"Unknown","Date of the Event":"09/16/2006 10:30 UTC","Weather Factors":"Unknown","Latitude":"42.529733","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.529733,+-70.924661(14945)&iwloc=A&hl=en\"> mufon case (14945) map </A>","City":"Peabody"}