{"Tags":"City","City":"Jessup","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/14946.html.txt","/var/www/straped/mufon/org/14946.html"],"Date Submitted":"07/21/1997 09:20 UTC","Object Shape":"Flash","trends":["There have been 2 other sightings in Jessup","There were no other sightings in Jessup on or around July 21st 1997"],"Region":"Pennsylvania","Country":"United States","Log Number":"US-01162009-0006","Longitude":"-75.557451","Weather Factors":"Unknown","Summary":"UFO travelling west over Olyphant, PA exploded into light as it went thru the door in Olyphant.","divs":["sighting detailsthe secret of olyphant, the greatest, the most incredible, the most shocking, and the most censored theory\\story in world history. i was on my roof in olyphant pa. about 9pm on or around july 20, 1997 and i saw a light in the sky about 40.000 feet above the churches in olyphant. the ufo was travelling west, in a straight line at a speed faster than an airplane but slower than a shooting star. the object passed over olyphant and exploded into a flash of light and it disappeared. i learned later that is exactly what occurs when a ufo goes thru a portal or door. at the time i was probably just looking at the stars and cooling off and at first i thought it was just a light but i became perplexed when it exploded. i have done extensive research on the town of olyphant the most mysterious town in world history. here is a small summary. olyphant means the secret of the gods and many of the answers to the great questions such as the secret of the pyramids and the ufos can be found in olyphant. everything in the universe is made from pyramids of light and you do not die but live forever. the town of olyphant has a hidden worid that no one knew about. the town is designed after ancient egypt but no one knew it. for instance there is a sphinx in olyphant 5mi long and no one knew it. our researchers have discovered a door or portal in olyphant that is being used by ufos. our researchers just last week have discovered a giant egyptian crop circle in olyphant of an egyptian scarab beetle that confirms our theory that we are immortal. i have to go. my story and theory has appeared in several newspapers and headlines locally. for more information go to www.google.com and punch in the secret of olyphant, then go to mysteries of olyphant. learn how god created us and why we do not die but live forever, also gt broadcast, see olyphants great pyramid and the giant sphinx and the churches orion star connection also www.thorthebarbarian.com other worlds adventures olyphant and another world, olyphant and orion, secret knowledge from another world. who created olyphant? my e-mail is {pid} thank you."],"Viewing Distance":"Unknown","Sighting Duration":"00:00:39","map":"<A HREF = \"http://maps.google.com/maps?q=41.470502,+-75.557451(14946)&iwloc=A&hl=en\"> mufon case (14946) map </A>","Latitude":"41.470502","Source":"MUFON","Object Flight Path":"Undisclosed","Case Number":"14946","Disposition":"Unknown","Date of the Event":"07/21/1997 09:20 UTC"}