{"Log Number":"US-01152009-0015","divs":["Sighting Details At approximately 2255 hours I stepped onto my back porch to have a cigarette. As I always do on clear nights, I began looking at the stars. I was facing East, and something caught my eye to my left. I immediately thought it would be a \"falling star\" but then saw what appeared to be five small, orange lights traveling at the same speed and in a formation. The object was silent and moving at a high rate of speed and appeared to be lower in altitude than normal air traffic. In addition, the object was traveling in a different direction than usual air traffic. The object came from a NNW traveling SSW, whereas normal air traffic usually goes in a Easterly or Westerly direction. The object appeared to be solid, yet it seemed to be transparent at the same time. The orange colored lights were continuous and did not strobe. The object appeared to be in a \"delta type formation\" but, one of the lights however, seemed to be out of place on the object, unless the object would have been banking or was at an odd angle. I continued watching the object as the tree in my front yard blocked the view over the roof, but when the object emerged in the clear of the tree again, I noticed it began to fade in brightness and then disappeared completely. The object made no sound whatsoever, which I found odd from the beginning. The temperature outside was -6 degrees, and the skies were clear. I know from my time in the military, that sound travels easier in cold air and the craft left no contrails despite the temperature."],"Tags":"City","Object Features":"None","Case Number":"14940","City":"Heath","trends":["There have been 3 other sightings in Heath","There were no other sightings in Heath on or around January 15th 2009"],"Longitude":"-82.444599","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/14940.html.txt","/var/www/straped/mufon/org/14940.html"],"Object Flight Path":"Other","Latitude":"40.022842","Disposition":"Unknown","Summary":"Delta or Boomerang shaped object.","Object Shape":"Boomerang, Triangle","Region":"Ohio","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.022842,+-82.444599(14940)&iwloc=A&hl=en\"> mufon case (14940) map </A>","Date of the Event":"01/15/2009 10:57 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"01/15/2009 10:57 UTC"}