{"map":"<A HREF = \"http://maps.google.com/maps?q=40.718173,+-73.997773(14950)&iwloc=A&hl=en\"> mufon case (14950) map </A>","Region":"New York","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"08/11/2004 08:30 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 11th 2004","This sighting has never been favorited.",""],"Log Number":"US-01162009-0010","Latitude":"40.718173","Object Flight Path":"Undisclosed","Tags":"City","Longitude":"-73.997773","Object Features":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/14950.html.txt","/var/www/straped/mufon/more/14950_submitter_file1__scn0001.jpg","/var/www/straped/mufon/org/14950.html"],"Source":"MUFON","Case Number":"14950","Date of the Event":"08/11/2004 08:30 UTC","City":"New York","divs":["sighting detailsi was selling movies walking toward a neighborhood barber shop on st.johns place between buffalo&rochester in brooklyn,n.y.on my way to serve some customers. so i was lighting a cigarette and it just caught my eye. a gigantic football,walnut type craft it was just streaking across the sky i mean it was really moving. i stopped what i was doing. due to the fact that i study u.f.o.'s in depth to an extent so i payed close attention to what was before me!!??! long story short i closely scrutinized the shape as best i could the moon wasn't predominant this night. i managed to make out the approximate shape of the object and i managed to be sure that it wasn't the average run-of-the-mill aeronautic objects that occupy our airspace everyday.i mean this thing was really moving i mean really,really moving.the few seconds that it would take to clear the space it cleared for a regular plane or secret experiment to clear it did it in a 1\\3 of the time maybe less,maybe an eighth of the time.either way this isn't the first time i've seen something that shouldn't usually be in the sky off&on since i was seventeen. i wouldn't have paid it half a mind if it wasn't going so [cms\\pd\\tg] fast it cleared a patch of sky the size of a large parking lot in no-time at all i mean fast!i didn't really loose sight of the object i had to get going to where i had to be and it was just going to where it (or they) were on their way to where they were going it was just moving so fast it didn't make any sense to be going so fast so low. it wasn't a plane of any raptor or other fighter. the military flies over brooklyn sometime on their way to where ever it is they're going so i know what fighters look and sound like!!! bingo that's the main thing that let me know that it wasn't something that belongs in the skies everyday or that is in the skies everyday. it made no sound at all!!!!!??! not one peep no vapor trail no heat line no wings nothing but two red lights and incredible speed and mainly no sound i didn't hear it before i saw it or while it was going by or after it went by due to the way sound travels when a high speed object is moving. simply two red lights,funny shape ,no wings ,no sound at all ,no sound at all that almost scared me a little the size of it and the fact it made no sound!!"],"Summary":"On the way home from work I saw two red lights simultaneously, parallel. Flying faster than fighters. Could just barely make the shape out cross between football tear drop huge3 footballfieldseasyNotreallythat highup3-5,000ft.tops.juststreakigacrossthesky","Disposition":"Unknown","Object Shape":"Blimp","Country":"United States"}