{"Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"While sky watching out of our bedroom window, I witnessed a cylinder shaped craft which had a green, red aura surrounding it.","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Region":"New Hampshire","City":"New Ipswich","Object Shape":"Cylinder","Date Submitted":"07/25/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.748142,+-71.854243(14959)&iwloc=A&hl=en\"> mufon case (14959) map </A>","Disposition":"Unknown","Tags":"City","Latitude":"42.748142","Longitude":"-71.854243","trends":["There have been no other sightings in New Ipswich","This sighting has never been favorited."],"divs":["Sighting DetailsMe and my girlfriend were sky watching from our bedroom window (we live on a high elevation and have a wonderful view of the horizon looking South towards Ashby MA).I was laying on the bed looking out the window watching the sky (between 10:00pm-11:30pm), when all of the sudden a green light or aura, with a inner red aura lit up the clouds not to far above the tree line(the reason I say \"Aura\" is because the light seemed to completely surround the craft). Inside this Green-red aura was a Cylinder shape craft standing up vertically, but immediately changed it's orientation from vertical to horizontal and at this point I saw that there was some sort of exhaust coming out of the back of it. The color of the craft appeared to be a copper color, but I'm not sure, it could be that the red aura was shining on the craft, making it appear that color. As soon as I saw this I yelled and my girlfriend who was in the same room right next to me looked out, but she only managed to see the green Aura because it happened so fast (3-4 seconds). It appeared that craft turned on these lights so it could perform it's transition from vertical to horizontal positioning, but that's just a theory.I grew up near an airport and we sky watch regularly from this exact spot and find it very easy to identify planes and stars and planets.This was neither. I will forward sketches as soon as I have access to a scanner."],"Case Number":"14959","Date of the Event":"07/25/2008 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-01172009-0005","files":["/var/www/straped/mufon/html2text/14959.html.txt","/var/www/straped/mufon/org/14959.html"],"Viewing Distance":"Unknown"}