{"Date of the Event":"01/16/2009 09:30 UTC","Longitude":"-84.079455","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/14955.html.txt","/var/www/straped/mufon/org/14955.html"],"Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsI live in EastBernstadt Ky. and on three seperate nights I have seen a large orb in the sky. The first sighting was on Jan.12,2009 at around 9pm. My father asked me to come and look at something in the sky, I thought maybe it was going to be a plane or helicopter but when I saw the object I could see that something was not right, I had never seen anything like it and I am 26 years old. My father is 78 years old and said he has never seen anything like it before. The object was bright orange and seemed to be stationary in the sky off to the northwest, there was no sound from the orb. I got my digital camera which has 10x zoom on it and began filming the orb. The orb changed colors from orange to red to green to white and back to orange several times, and even appered to rapidly change shape on a number of occasions. The second sighting I had was on Jan. 15, 2009 at around 8:30pm. I was sitting at my computer and my father came in and said in a joking manner \"your alien is back\", I asked if he was serious and he replied yes only it is closer this time. I went and looked out the living room window and sure enough there was the exact same object only closer to my home and seemed to be directly above the local power substation on Hwy.490. As I had previously done I got my digital camera and went onto the front porch and began filming the orb and captured the same results as the first night, color and shape change. the object remained stationary for approximatly 2 hours before moving off to the north west. My third sighting is my most vivid and well noted. I was at my friends home in london on the evening of Jan.16, 2009 at around 9pm. I noticed the object back in the northwest once again. My friend filmed the object and we watched as it once again changed color and shape. The orb was a good distance from us I would estimate around a mile from our position. we watched for several hours as this object slowly made it's way across the night sky before dissapering behind the horizon. I will admit that I am a huge ufo skeptic however I have seen something that I can not explain nor can anyone else who has seen it. I have several credible witnesses including my friend who is a Sgt. in the U.S army., his wife, her sister, her cousin, my friends uncle and aunt as well as my father and mother. I am not writing this as a hoax or prank or wanting any kind of fame I simply would like to know what I am seeing and should I be concerned."],"Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Date Submitted":"01/16/2009 09:30 UTC","Latitude":"37.134047","City":"London","Object Features":"None","Disposition":"IFO","trends":["There have been 4 other sightings in London","There were no other sightings in London on or around January 16th 2009"],"Object Shape":"Oval, Sphere, Star-like","Sighting Duration":"03:00:00","Summary":"Large unknown orange orb over East Bernstadt, Ky. Saw object three separate nights.","Log Number":"US-01172009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=37.134047,+-84.079455(14955)&iwloc=A&hl=en\"> mufon case (14955) map </A>","Object Flight Path":"Stationary,Path then hovering","Case Number":"14955"}