{"Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Triangle","Tags":"City","Summary":"See detailed description.","Country":"United States","Weather Factors":"None","Date Submitted":"11/10/2008 02:45 UTC","Longitude":"-89.869722","map":"<A HREF = \"http://maps.google.com/maps?q=35.349394,+-89.869722(14968)&iwloc=A&hl=en\"> mufon case (14968) map </A>","Object Flight Path":"Undisclosed","Log Number":"US-01172009-0013","files":["/var/www/straped/mufon/html2text/14968.html.txt","/var/www/straped/mufon/org/14968.html"],"Disposition":"Unknown","Latitude":"35.349394","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was asleep in bed, it was approximately 2:45 - 3:00a.m. I woke up (wide awake) for some odd reason and couldn't get back to sleep. So I decided to go outside on the patio (back yard) to have a smoke. It was a warm night for November and found myself making mental notes about my surroundings..... peaceful... quiet.... no planes flying overhead.... moon very bright.... then I heard a low aircraft-humming sound but could not see anything because of the bright moonlight. As I continued to look up a large object became sillouetted against the moonlight. My first thought is, of course, it's an airplane, but it was flying at such a slow speed I was able to examine it quite thoroughly. As I began looking at it I steadily got a heavy, threatened feeling run through me. It was like nothing I'd seen before: it didn't have any wings (like an airplane does), it was one solid smooth-edged triangle. I then walked further into the backyard so as to get a different perspective of the situation. What struck me dumbfounded was it didn't have any lights on it.... anywhere.... just a smooth dark gray or black triangle. That's when the left brain kicked in and I foolishly concluded that it was something from the Millington Navy Base... a military test or something. To this day I could kick myself in the butt for not staying up to see where it went; unfortunately, I went back to bed. If asked today, I would say it was not an airplane. The basis for this conclusion is the fact that my daughter had a sighting of her own two streets over and a few days before mine. Coincidence?"],"trends":["There have been no other sightings in Millington","This sighting has never been favorited."],"Case Number":"14968","City":"Millington","Date of the Event":"11/10/2008 02:45 UTC","Region":"Tennessee"}