{"map":"<A HREF = \"http://maps.google.com/maps?q=41.082573,+-85.133381(14975)&iwloc=A&hl=en\"> mufon case (14975) map </A>","Tags":"City","Summary":"Bright round light hovered 45+ minutes in the same spot, definately not a plane.","Sighting Duration":"00:45:00","Disposition":"IFO","Source":"MUFON","divs":["Sighting DetailsAt 8:40 pm on 1-14-09, I was talking to my husband on the phone. He drives truck and was 180 miles away in Michigan. I got up to look out and see if it was snowing and noticed in the sky a large round light - my first thought was it was a plane and was concerned because it was very low & the light was very bright & round. I kept watching it as I was talking and it just stayed in one spot (hovered). I saw a red flashing light a ways away and decided that was an airplane and it looked like it was going to crash into the bright light, but it went under it and kept on going, but then later came back. I saw 2 or 3 lights that blinked that seem to move past it. I couldn't quit watching it because of it staying in one place and I was convinced it was not an airplance, star, meator, blimp, weather balloon. At that time I never considered a UFO. I had watched the \"light\" about 10 min and said something to my husband about the funny light in the sky. Before I could go on, he said he had been watching a bright light in the sky for about 30 minutes. He described it as I was seeing it, large, close,bright and never moving - there were no other visible stars in the sky and he thought it was really odd because it definitely wasn't an airplane. So I continued to explain to him what I was seeing & we felt it could be the same thing, but how 180 miles apart? At the time I was sseing it he wasn't and had lost sight of it about 20 min before talking to me, but he said it stayed in 1 place at least 30 min when he was watching it. I got the binoculars and what I could see I described as looking at a disco ball. Round, bright and it looked like the sides were faceted. I probably watched it about 45 min and it did not move. I marked it's location by the point on the top of a house. Towards the end of my watching it, it appeared to possible be turning around because the coloring changed - there were portions of blue and red on it. It was late, I was tired and decided I was being silly watching this \"light\". I went back to watching a movie and came back about 20 minutes later and it was gone. I could however, see a red circle farther towards the west,(as if it was moving in that direction - towards Wells County. I feel my husband and I possibly witnessed the same thing only we were 180 miles apart. How could that be? Things I do know: there was not one visible star in the sky that night, the wind was fairly calm, I have always watched the stars and have never in 58 years seen anything like this, it hovered in one spot 45+ minutes (not sure how long it was there before I saw it), it was round and as I said it looked like a disco ball, it was not an airplane or helicopter,I never considered a UFO as I have never believed or disbelieved but I can't explain the feeling I have that is could be a UFO. I have researched on line other possibilities - weather balloon, meators, a new star, but can't come up with anything. I would have thought there would have been some more sightings since it was in one spot so long? I never considered reporting this but after researching felt it might be a good idea, even if there is a logical explanation - which I hope is the case."],"Date of the Event":"01/14/2009 08:40 UTC","Longitude":"-85.133381","Case Number":"14975","Region":"Indiana","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/14975.html.txt","/var/www/straped/mufon/org/14975.html"],"Country":"United States","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around January 14th 2009"],"Object Flight Path":"Stationary,Hovering then path","Log Number":"US-01182009-0004","Latitude":"41.082573","Weather Factors":"None","Date Submitted":"01/14/2009 08:40 UTC","City":"Fort Wayne","Viewing Distance":"Unknown","Object Features":"Patterned Surface"}