{"Object Shape":"Other, Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/14974.html.txt","/var/www/straped/mufon/org/14974.html"],"Country":"United States","City":"Arab","Weather Factors":"None","Source":"MUFON","Date Submitted":"12/23/1993 11:30 UTC","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:10:00","Region":"Alabama","Log Number":"US-01182009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=34.31815,+-86.495822(14974)&iwloc=A&hl=en\"> mufon case (14974) map </A>","Tags":"City","Summary":"Myself and my cousin witnessed an object come from the north hover silently and move back to the north on the same bearing.","Longitude":"-86.495822","Date of the Event":"12/23/1993 11:30 UTC","Latitude":"34.31815","divs":["Sighting Details A few days before Christmas on my senior year in high school my couisin and I had just visited with a friend when we decided to take a ride on some of the dirt roads close to our neighborhood. At one point we reached a 3 way intersection where the dirt road we were traveling on intersected a paved road. Across the paved road was a house sitting on about a 1-acre lot. My cousin was driving and I was in the passengers seat as we were turning around to go back down the dirt road I saw an object come over the tree line behind the house. At first I thought it was an airplane as it was a single bright light but as I watched it split into two seperate lights. As we got the truck turned around I continued to watch the object as it again split this time into four seperate lights. This object had come from the north and was moving alongside us as we drove back down the dirt road. I pointed the object out to my cousin as we continued to travel south along the dirt road and as we both looked at the object again it now appeare to have six to eight lights. The lights were different colors some were red others were blue and the rest were white. At this point we became a little frightened so we sped down the dirt road until we reached my cousins house where we watched the object from outside the vehicle. As we stood in his yard the object was almost directly on top of us and it was now stationary. The first though I had that suggested it wasnt just an airplane or a helicopter was that it was now hovering and made no noise. We watched it for a few more minutes before it began to move again. The object never rotated or anything it simply moved back to the north in the exact same direction it came from. I cannot say for sure what I saw but it was silent and could hover and change directions without turning around. I have visited the site several times to try to logically explain this but as of now I have no idea what it could have been."],"Object Features":"Unknown","Case Number":"14974","trends":["There has been one other sighting in Arab","There were no other sightings in Arab on or around December 23rd 1993"]}