{"Object Shape":"Star-like, Triangle, Other","Summary":"Strange lights moving in the northern sky.","Region":"Texas","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/14982.html.txt","/var/www/straped/mufon/more/14982_submitter_file1__Lights1a.jpg","/var/www/straped/mufon/more/14982_submitter_file2__Lights1b.jpg","/var/www/straped/mufon/more/14982_submitter_file3__Lights1c.jpg","/var/www/straped/mufon/more/14982_submitter_file4__14983_submitter_file1__Lights1d.jpg","/var/www/straped/mufon/more/14982_submitter_file5__14983_submitter_file2__itwashere.jpg","/var/www/straped/mufon/org/14982.html"],"Country":"United States","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"01/16/2009 07:00 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","Source":"MUFON","Tags":"City","Longitude":"-106.477331","Latitude":"31.76357","Viewing Distance":"Over One Mile","Date of the Event":"01/16/2009 07:00 UTC","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around January 16th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsIt was around 7:00 pm, I was leaning on the hood of my truck the sun had gone down about 35 minutes earlier and I was enjoying a smoke. I was facing north and looking at what I thought was Orians Belt but was amazed as to the size and brightness of the stars. I realized that Orians Belt would have been much smaller and to the southwest at the time. I saw three very bright lights at first I thought they were stars but they did not blink. They were brighter and larger then the brightest star that was visable (ARCTURUS)which was slightly more to the west of what I was seeing. I also saw a jetliner traviling ftom west to east and about 300 miles anhour at about 3500 ft altitude. The lights I saw where higher and farthe away then the jet. the jet had flashing red and blue lights with one white strobe. When the jet reached the general location of the star on the bottom, the bottom star began to move to the west and at the same time the star on the top and the one in the center of the formation began to move in a synchronous motion the star on top moving to the west and the one in the center moving east while maintianing the same distance apart. When the two upper most stars stopped they formed a perfect triangle with the star on the bottom. After they all stopped moving the star on the bottom of the trianlg began moving up towards the center of the other two stars also while moving up the lower star began to fade as if it were going behind something. About two seconds after the center sar vanished the others made a slight flicker and then vanished into the night. Abought that night, there were other stars out that night but none as bright and \"no stars were visiblbe inside the triangle\". About me: I am 47 college grad currently in the computer field and have 26 years prior military service ranging from Cav Scout to Power Generation and I have served in combat. I know these lights were not flares, they were not helicopters or military aircraft. Fort Bliss and Bigs Airfield are about two mile to my west. Whight Sands testing range is 62 miles to the north by northwest and Holoman AFB is ruffly 75 to the north. Has anyone else reported this or seen this. I have gathered my video camera with night vision and am going to try and catch it on tape as this was not the first time I have seen strange light around here. I have diagramed in ms paint 4 files showing what I saw and also will upload a topagrafical map of the location of what I saw."],"City":"El Paso","map":"<A HREF = \"http://maps.google.com/maps?q=31.76357,+-106.477331(14982)&iwloc=A&hl=en\"> mufon case (14982) map </A>","Log Number":"US-01182009-0011","Case Number":"14982","Disposition":"Unknown"}