{"divs":["Sighting Details First event.I went up on our roof-deck to look up at the stars, but on the way up I noticed something glowing to the south of us, just above the water over Newport Beach, or Costa Mesa. It seemed to be bagel or doughnut shaped, and it was discharging some sort of super hot material straight down into the water, almost like molten metal. It did this for about 5-10 minutes, and then appeared to fall into the ocean after, or just simply faded away. I don't know where it went. The only thing I can compare this to, is the event that happened in Washington state, where almost the exact same thing occurred, but a fisherman's boat was struck in that account. Second event. Just as soon as the first craft disappeared, a second multi-colored thing, (it had red, orange, green, & white lights) was flying north. The flight area area would be from the northern tip of Santa Catalina Island to Long Beach, or Rancho Palos Verdes. It hovered for about 5-8 minuutes, then slowly descended toward the ocean until it seemed to go into to the water. I face Southwest when looking to the sea. A map of Long Beach down to Newport Beach would be more helpful in pinpointing these sightings."],"Longitude":"-119.408332","Region":"California","Disposition":"IFO","Case Number":"14980","Latitude":"36.785221","Weather Factors":"None","Date Submitted":"01/17/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.785221,+-119.408332(14980)&iwloc=A&hl=en\"> mufon case (14980) map </A>","Object Features":"Other, Unknown","Viewing Distance":"Unknown","Log Number":"US-01182009-0009","files":["/var/www/straped/mufon/html2text/14980.html.txt","/var/www/straped/mufon/org/14980.html"],"trends":[],"Object Shape":"Sphere, Other, Unknown","Object Flight Path":"Hovering then path,Path then hovering,Other,Unknown","Date of the Event":"01/17/2009 12:00 UTC","Summary":"2 different sightings minutes apart between 8-8:30 PM.","City":"Undisclosed","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Country":"United States"}