{"Date of the Event":"01/18/2009 12:00 UTC","Date Submitted":"01/18/2009 12:00 UTC","trends":[],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","divs":["Sighting DetailsMy family went to eat and while I was home I received a frantic call urging me to look outside. My husband instructed me to look outside the second story bedroom window. I looked out and say a bright object. I ran outside to look closer. My immediate reaction was it looked like a moon between clouds then I looked around and the sky was clear. Then I was thinking it was an advertising blimp. But then I realized it was none of these I rushed to my garage and retrieved my telescope without the base. By now my family had returned and we were all looking at it. After several attempts I got it completely focused in my scope and could not believe my eyes. It was no craft of any sort it was and eye shaped orb that seemed to look like a contact lens being squeezed and inside the orb was a red light sort bouncing and moving. directly on the left of the orb was a bright light looking similar to a star in the scope. it was not directly up it was directly above the horizon line. My family (4 adults) all saw it after dinner and stopped and got out of the car to observe it. They all said it stopped on a dime and moved fast. We are all overwhelmed by what we saw."],"Object Shape":"Blimp, Oval","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.780841,+-119.412862(14999)&iwloc=A&hl=en\"> mufon case (14999) map </A>","files":["/var/www/straped/mufon/html2text/14999.html.txt","/var/www/straped/mufon/org/14999.html"],"Summary":"Eye shaped orb color of a harvest moon with a red light in the center and a bright light just outside of it.","Sighting Duration":"Undisclosed","Disposition":"IFO","Case Number":"14999","Latitude":"36.780841","Object Features":"None","Log Number":"US-01192009-0004","City":"Undisclosed","Longitude":"-119.412862","Country":"United States","Region":"California","Source":"MUFON","Object Flight Path":"Hovering then path"}