{"Summary":"Fast maneuvering red point of light","Object Flight Path":"Straight-line path","Case Number":"1499","Date Submitted":"07/15/1969 10:30 UTC","Region":"Florida","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.900545,+-81.263674(1499)&iwloc=A&hl=en\"> mufon case (1499) map </A>","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/1499.html.txt","/var/www/straped/mufon/org/1499.html"],"Log Number":"","divs":["sighting detailsnotation from georgia director of mufon regarding the creditials of the pw inthis case; michael d. hitt, the primary witness (pw) in this case is a 45 yoa georgiapolice veteran with 20+ years of service as a full time sworn and certifiedgeorgia peace officer. he is currently serving as a patrol officer with a majormetro atlanta area agency and has 20 years of service in that department. pwalso holds a degree in criminal justice. furthermore, the pw has past servicein the u.s. army as a forward observer in the artillery, serving in korea; laterin the military police, served as an nco, and with additional service on thestaff of a historical unit of the u.s. army. pw is also now a publishedhistorian, specializing in the history of the north fulton county and roswellgeorgia area and the civil war era. pw is currently an ssd\\fi with mufongawhile concurrently serving as the historian and archivist of the georgia chapterof mufon. the most recent published work of pw is georgias aerial phenomenon1947-1987, which he completed while working closely with jan aldrich andproject 1947. to further document the credentials of this pw, a descriptive linkregarding this book can be found at <<>>tom sheets, sd mufonga"],"Date of the Event":"07/15/1969 10:30 UTC","City":"Deltona","Disposition":"Unresolved","Sighting Duration":"00:05:00","Tags":"City","Latitude":"28.900545","Viewing Distance":"Over One Mile","Longitude":"-81.263674","Object Shape":"Undisclosed","Source":"MUFON","trends":["There have been 5 other sightings in Deltona","There were no other sightings in Deltona on or around July 15th 1969"]}