{"Log Number":"US-01192009-0001","Date Submitted":"01/20/2009 01:35 UTC","Object Features":"None","City":"River Forest","files":["/var/www/straped/mufon/html2text/14995.html.txt","/var/www/straped/mufon/org/14995.html"],"Source":"MUFON","divs":["Sighting DetailsI was sitting at my T.V. watching an Einstein show on the History Channel, when my cat was looking out the window and started meowing. I looked out the window, and was completely frightened. There was a triangle of orange lights, with sporadically placed orange lights throughout. I live near O'Hare, so I see planes all the time. They are about a third the size of what I saw, and planes have red and blue lights that blink in a repeated pattern and in the same spot on the plane. The object was about 3x the size, had no red or blue lights, and was off the normal flight path for planes. The object didn't make a noise, like planes sometimes do, and flew at a slightly faster pace. At first I thought it was some bright stars, maybe a meteor shower, but they were synchronized, and flew in a straight line together. It first flew in a north-north-west direction, and then curved north, or more east, without turning or altering it's shape in any way. I felt my heart jump out of my chest, and afterwards I found myself hyperventilating, and simply shocked. I couldn't, and still don't believe my eyes fully. After curving it's path, It flew out of sight in the houses and trees. I stayed at my window for atleast 20-30 minutes watching for if it came back. It never did. I saw another plane, however, just minutes later, and compared the two. Again, they were nothing alike. I am reporting this the same night. Please, take this account into consideration."],"Region":"Illinois","Sighting Duration":"00:00:25","Longitude":"-87.810868","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Latitude":"41.904579","Summary":"Triangle of yellow and orange lights.","trends":["There have been 2 other sightings in River Forest","There were no other sightings in River Forest on or around January 20th 2009","This sighting has never been favorited.",""],"Case Number":"14995","Object Flight Path":"Path with directional change","Object Shape":"Teardrop, Triangle","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.904579,+-87.810868(14995)&iwloc=A&hl=en\"> mufon case (14995) map </A>","Tags":"City","Date of the Event":"01/20/2009 01:35 UTC","Country":"United States"}