{"Object Flight Path":"Straight-line path,Path with directional change","Tags":"City","trends":["There have been 2 other sightings in Simpsonville","There were no other sightings in Simpsonville on or around October 31st 2008"],"Date Submitted":"10/31/2008 07:00 UTC","City":"Simpsonville","Latitude":"34.737064","Object Features":"Wings","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2008 07:00 UTC","Source":"MUFON","Weather Factors":"None","Longitude":"-82.254283","Region":"South Carolina","Log Number":"US-01182009-0021","map":"<A HREF = \"http://maps.google.com/maps?q=34.737064,+-82.254283(14994)&iwloc=A&hl=en\"> mufon case (14994) map </A>","files":["/var/www/straped/mufon/html2text/14994.html.txt","/var/www/straped/mufon/org/14994.html"],"Case Number":"14994","Summary":"Flyover by UFO on Halloween 2008.","divs":["Sighting DetailsAround dusk, on Halloween 2008, while waiting at a stoplight[W. Georgia@Rocky Creek Road] I saw a white light aproaching in the sky. It passed from the front to the left of my vehicle at about 200 feet altitude and maybe .25 miles distance. As it passed by my driver side window I could make out the silhouette of a jet fighter. The stoplight changed, and when i got up to speed, the object came in view on my left, passed in front, then over the horizon. I them made a left turn for the final .25 miles of my drive home passed on my left, going maybe 50 mph at 100 feed altitude and 300 feet away. It overflew my house disappearing over some trees. Then 5 seconds reappearing and retracing it steps, going out of view behind me. I pulled in my drive way when it flies over my house and out of sight. I am out of my vehicle now as it does two more fly overs, where I am realizing this is no ordianary plane. The speed is just too slow and the sound was just wind, or ground effect sound. Also, the form seemed not fixed, maybe not fully solid. I also felt it was aware of my awareness of it. The only light from the object was white and visible when aproaching head on. The object looked like a jet fighter, maybbe 40 ft long with wings swept forward 60 degrees and downward 45 degrees. I remember thinking the landing gear must be 10 feet tall. When it did it's 180 degree turns, it was like a car on ice. When it left it just flew out of sight. It was then i noticed I was thinking of getting my rifle, but I feel it left as I was thinking of getting my rifle. This was a first for me, and will be the must memorable Hallweens!"],"Disposition":"Insufficient Data","Object Shape":"Other"}