{"Date Submitted":"01/15/2009 10:02 UTC","Region":"Iowa","Country":"United States","files":["/var/www/straped/mufon/html2text/15001.html.txt","/var/www/straped/mufon/org/15001.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.523644,+-90.577637(15001)&iwloc=A&hl=en\"> mufon case (15001) map </A>","Latitude":"41.523644","Longitude":"-90.577637","Case Number":"15001","Log Number":"US-01192009-0006","Source":"MUFON","City":"Davenport","Weather Factors":"Unknown","Sighting Duration":"00:01:02","trends":["There have been 8 other sightings in Davenport","There were no other sightings in Davenport on or around January 15th 2009"],"Object Features":"None","Date of the Event":"01/15/2009 10:02 UTC","Disposition":"Insufficient Data","divs":["Sighting DetailsWas driving a Triaxle truck I bought in Utah back to PA and was on I80 around 10 pm or so around Davenport, Iowa. I qas a little road weary from driving so long in subzero (-22) weather with bad road conditions so the time and place are approximate. Heading eastbound on I80, a bright, LED stop-light green colored sphere-like light caught my right eye out the upper portion of my passenger window. It was zooming ahead of me fast like something in a sci-fi movie. As the roads were treacherous (vehicles all over the side of the road from wrecks), I glanced back at the road for a moment and lost sight of it. Seconds later, the CB radio came on with a trucker in the area exclaiming \"What the f@#$ was that?\" I asked back, \"What did YOU see?\" He said, \"A green flash going through the sky!\" About 3 or 4 other CBers responded that they were glad somebody else saw it because they weren't going to say anything thinking they were going crazy from driving too long or something. I estimate the diameter of the light of a quarter at arms length. I've seen a white comet-like light with a tail that stopped & disappeared on I76 in western PA and 3 other family members have seen 3 other \"unknown\" objects since June, 2007 in PA... My fiance is really into this UFO thing now and is going to build a near-infrared webcam to try and film them in daylight like on YouTube. (There are alot of hoax videos on Youtube but alot of real ones too--like the NASA ones--do a search!) We think they consider us \"Planet Zoo\" and observe us like we do isolated tribes in the jungle... or, on the wilder side, they could be from our distant, more evolved future? Both would explain their lack of involvement.... :O"],"Viewing Distance":"20 Feet or Less","Object Flight Path":"Straight-line path","Object Shape":"Sphere","Tags":"City","Summary":"Bright green sphere seen by I80 near Davenport, Iowa as I was eastbound."}