{"Latitude":"34.065007","files":["/var/www/straped/mufon/html2text/15008.html.txt","/var/www/straped/mufon/org/15008.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsLast night when driving to work, less than 2 minutes after getting on the main road I travel on to get to work, I happened to look up off to my left and saw this large oval shaped object that was in the sky. I drove a little slower to get a better view of this object, and it became clear that this object was moving very slowly. I heard no sounds from this object at all. Now at this point, I am positive that this wasn't a plane, light tower or a chopper. What was very strange about this large object with a flashing red light in the sky was that it seemed to almost follow me down the main road all the way to work, covering a 2 mile distance. I wondered how this object in the night sky, could have covered so much ground, yet appeared to travel very slowly. Looking this object directly with my driver side window down, the light from this moving object was very obvious and bright, still off to my left, slightly northward. At this point, my heart was racing ....it was surely fantastic. I was thinking, \"What in the world was I looking at? \" Strangely enough, this light appeared visible even as I neared my work. Unfortunately, I had to go to work as I was already late. Amazing experience ...never seen anything like it."],"Date of the Event":"01/19/2009 12:00 UTC","Summary":"Large Disc / Oval shaped object with red flashing light","Longitude":"-117.746295","Object Features":"Undisclosed","Tags":"City","Log Number":"US-01202009-0003","Object Flight Path":"Undisclosed","trends":["There have been 16 other sightings in Pomona","There were no other sightings in Pomona on or around January 19th 2009"],"City":"Pomona","Region":"California","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"01/19/2009 12:00 UTC","Disposition":"IFO","Source":"MUFON","Viewing Distance":"Unknown","Object Shape":"Flash, Oval","Case Number":"15008","map":"<A HREF = \"http://maps.google.com/maps?q=34.065007,+-117.746295(15008)&iwloc=A&hl=en\"> mufon case (15008) map </A>"}