{"Case Number":"15015","Date Submitted":"01/20/2009 06:55 UTC","Object Flight Path":"Stationary","Longitude":"-98.332628","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around January 20th 2009"],"Date of the Event":"01/20/2009 06:55 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/15015.html.txt","/var/www/straped/mufon/org/15015.html"],"Object Features":"Unknown","Latitude":"32.087043","Object Shape":"Unknown","Summary":"2 sets of 3 lights.","Weather Factors":"Unknown","Region":"Texas","divs":["sighting detailsat exactly 6:55 pm\\central time(issues with jvm on hln channel was just ending) i walked outside my front door which is facing east and looked south towards dublin because my dog was howling. all the neighbors dogs were also howling. there was still a little bit of red from the setting sun. a mile above ground and 2 foot ball field lengths apart were two sets of lights. they were stationary objects and seemed to be right above dublin. from my view they were west of the light tower on hwy 377. each had 3 lights. they flashed from 3 down to only 2 lights, then down to 1 light. then both sets disapeared for 30 seconds then came back on with one light each. then from one light, a 2nd light emmerged, then from the second light a 3rd light emmerged. then both disappeared. i waited for 15 minutes and nothing returned. i did however get grainy video of 2 aircraft(these appeared to be slow moving airplanes or choppers) flying not very far apart away from the objects going north east towards ft. worth. the 2 aircraft circled over stephenville and then back around to dublin. i also caught view of another low flying airplane with red lights flying to the west. it flew very low and was heading south towards dublin. i noticed because it was very low for a commercial aircraft."],"Sighting Duration":"Undisclosed","Log Number":"US-01202009-0010","Viewing Distance":"Over One Mile","City":"Dublin","Source":"MUFON","Disposition":"IFO","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.087043,+-98.332628(15015)&iwloc=A&hl=en\"> mufon case (15015) map </A>"}