{"Region":"Louisiana","trends":["There have been 12 other sightings in Westlake","There were no other sightings in Westlake on or around January 20th 2009"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=30.24469,+-93.2426(15026)&iwloc=A&hl=en\"> mufon case (15026) map </A>","Tags":"City","Longitude":"-93.2426","Case Number":"15026","Source":"MUFON","Date of the Event":"01/20/2009 09:00 UTC","Date Submitted":"01/20/2009 09:00 UTC","Log Number":"US-01212009-0002","files":["/var/www/straped/mufon/html2text/15026.html.txt","/var/www/straped/mufon/org/15026.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Disposition":"Insufficient Data","Summary":"More sightings in Westlake, Louisiana.","Latitude":"30.24469","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","divs":["sighting detailssince june 2008, i have witnessed approximately twenty unusual sightings in the area of westlake, louisiana (calcasieu parish\\county). unusual sightings to date include larger than normal appearing\\disappearing daytime and nighttime starlike objects that are sometimes stationary or moving rapidly and always just blink out of sight in an instant. other sightings include stationary round ball like objects (silver & gray) that do not move in the wind and then blink out of sight instantly. (one accelerated from a dead stop to a speed barely visible to the eye). a couple of sightings appeared to be similar to nighttime aircraft with landing lights on and more than a dozen strobes, except the craft remained motionless in the sky for several minutes and then moved very slowly with no sound present. all sightings were observed during clear skies. the latest sighting follows: on 01\\20\\09, i went outside at 9:00pm to throw some grapefruit rinds on my garden compost pile. as i looked due west, i observed a large stationary flame yellow round object about 30 degrees above the horizon. the object had a smoky appearance to it in the totally clear sky and appeared to be about ten times larger than venus. as i dumped the grapefruit rinds on the compost pile the neighbors dog started a ruckus, so i went back inside to let him calm down. about ten minutes later, i went back outside to look at the stationary object in the sky and it was gone."],"City":"Westlake"}