{"divs":["Sighting DetailsOn Saturday, July 7, 2001, I was very tired so I decided to go to bed early. At10:00 pm I called my friend who I talk to every night to say I was going to bed. She was not in her apartment so I left a message on her recorder and coveredthe bird who is about five feet from the door wall. The door wall blinds wereshut. At 10:05 pm, as usual, I looked out to check the weather, goings-on ifany and mostly the sky. I love to look at the clouds, stars and sky in general. There are flood lights on the patio. At this time I saw two lights, red andblue, in the sky to the East of me (my left). Thinking that it was a plane, Iwatched it. But it moved very fast and the red and blue lights went on and off. It seemed as though the object was spinning. It went four spins in the fourseconds that it was in my view. I saw it from left to right (East to West). Itgot to a tree in my vision and disappeared. When I couldnt see it, I looked tothe right of the tree foliage for it but it was gone. I could not make out thesize or shape of the object but I heard no plane. It was silent. It seemed tobe about six hundred feet in the air. According to the distance, apart from thelights, I figured it to be about the size of a plane. It was parallel with FordRoad or just south of it. It went from East to West in a straight line. Thered and blue lights were larger than that of a plane and very vivid in color.Primary witness had second sighting a few nights (3 days) later when, \"I lookedout the door wall in like manor and saw what looked like a plane with many whitelights and they were flashing very rapidly. It moved South to North very fast. This was later in the evening than the first sighting - about 11:45 pm. I saw itcoming from the South and it looked as if it were a ball covered with lightsthat flashed rapidly. Then it was out of my vision to the north in just a fewseconds."],"Country":"United States","Summary":"Red/Blue Blinking lights seen in Westland, Michiga","files":["/var/www/straped/mufon/html2text/1502.html.txt","/var/www/straped/mufon/org/1502.html"],"Date of the Event":"07/07/2001 10:05 UTC","Log Number":"","Longitude":"-83.400211","Case Number":"1502","City":"Westland","Date Submitted":"07/07/2001 10:05 UTC","Tags":"City","trends":["There have been 17 other sightings in Westland","There were no other sightings in Westland on or around July 7th 2001"],"Object Flight Path":"Straight-line path,Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Object Shape":"Undisclosed","Weather Factors":"Unknown","Latitude":"42.324204","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.324204,+-83.400211(1502)&iwloc=A&hl=en\"> mufon case (1502) map </A>","Sighting Duration":"00:00:59","Region":"Michigan"}