{"Disposition":"IFO","Tags":"City","Region":"Alaska","trends":["There have been 6 other sightings in Wasilla","There were no other sightings in Wasilla on or around January 20th 2009"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=61.587429,+-149.430204(15024)&iwloc=A&hl=en\"> mufon case (15024) map </A>","City":"Wasilla","Object Features":"Undisclosed","Summary":"Triangle, low on horizon, changed orientation.","files":["/var/www/straped/mufon/html2text/15024.html.txt","/var/www/straped/mufon/org/15024.html"],"Country":"United States","Date Submitted":"01/20/2009 07:15 UTC","divs":["Sighting DetailsI saw three lights low on the horizon, looking north off of my balcony near Wasilla, Alaska at around 7:15pm Alaska time on Jan. 20th, 2009. I frequently go outside at night to watch the stars and I noticed this set of lights, which weren't supposed to be there. The lights changed in intensity and changed position as if they were attached to something. When I first saw them, they were a perfect triangle. They moved to form an elongated triangle pointing east, then reoriented again. I didn't hear any noises. What seemed to be the \"center\" light was brighter than the other two. The center light was brightest when oriented head on, forming almost a straight line, then turned again, becoming a smaller looking triangle. It didn't move quickly enough to be distinct, if that makes any sense. But they definitely moved quickly enough as to change the arrangement of the lights within 10-15 seconds. I called my girlfriend out to see them, but all we could see was the center light. Then, they began to move again and the triangle was visible. I called her back out and she saw it, too. She said it was creepy. At first, I thought they might be helicopters flying in formation. There were no other blinking lights, but they did \"twinkle\" like stars, which is what made it seem so strange. I am not an avid ufo enthusiast, but I do like to watch the stars. This is the first time I have seen anything like this. I do remember watching something on the Science channel about triangular lights which behaved exactly like these did about a month prior to this event. I don't think that influenced what I saw, but it definitely made me watch them closer. After about 15 minutes of watching (it was fairly chilly), I came inside to check if there had been any reports. I didn't really know where to look, though, and I found this site through a google search on how to report sightings. When I went back outside to continue watching, the lights were gone, as far as I could tell."],"Longitude":"-149.430204","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Log Number":"US-01202009-0018","Latitude":"61.587429","Date of the Event":"01/20/2009 07:15 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Case Number":"15024","Source":"MUFON"}