{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15022.html.txt","/var/www/straped/mufon/org/15022.html"],"Tags":"City","City":"Morrisonville","Date of the Event":"01/20/2009 06:40 UTC","Region":"Illinois","Country":"United States","Date Submitted":"01/20/2009 06:40 UTC","Summary":"Saw a ball of moving light near Morrisonville, Illinois.","Disposition":"Insufficient Data","Case Number":"15022","trends":["There have been no other sightings in Morrisonville","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.42005,+-89.455649(15022)&iwloc=A&hl=en\"> mufon case (15022) map </A>","Latitude":"39.42005","Object Features":"None","Longitude":"-89.455649","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Star-like","divs":["Sighting DetailsDriving NE on rt 48 just about 3 miles southwest of Morrisonville, I saw an object to my left just ahead of me over a field, almost true north of me. It was twilight, not quite daylight. The object appeared as a ball of light about the size of a pencil eraser. It appeared to be somewhere around 1000 feet high. At first I thought it was a star. I really didn't think much about it. But as I drove NE, the object appeared to get bigger and to be traveling straight east at a slow rate of speed. The further I drove, the closer it got to me. I thought that it would be over Morrisonville just about the time I was going through the town. The light was a solid amber light and as it got closer, I thought I saw a dark egg shaped structure beneath it. The light was on top. The light was solid and did not blink at all. Anyway, after observing it for a few miles, it just seemed to disappear. On moment there. The next moment nothing. Gone. It just vanished. I didn't see it speed off. It just disappeared. It blinked out just before I got to Morrisonville. It was disappointing to me because I was curious what it was and I thought I would get a close up view of it over Morrisonville. I wasn't alarmed at all, I was just curious. I drove by the spot on my way home this evening during daylight hours. When I approached the area where I had spotted it this morning, I looked all around for a microwave tower thinking that maybe I had observed one of them this morning. These towers have a solid light halfway up and a blinking light on the top. Even though I didn't observe any tower structure underneath it this morning, I thought that maybe I could have still possibly seen a tower. But after scanning the area on my way home, I found that there was no towers anywhere around. So, I don't know what I saw!"],"Log Number":"US-01202009-0016","Viewing Distance":"Over One Mile","Weather Factors":"Unknown"}