{"Tags":"City","Case Number":"15021","Object Shape":"Circle, Flash","map":"<A HREF = \"http://maps.google.com/maps?q=33.931871,+-117.975648(15021)&iwloc=A&hl=en\"> mufon case (15021) map </A>","trends":["There have been 27 other sightings in Whittier","There was one other sighting in Whittier on or around January 20th 2009"],"City":"Whittier","Date Submitted":"01/20/2009 07:01 UTC","Latitude":"33.931871","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Weather Factors":"None","Longitude":"-117.975648","Disposition":"IFO","Region":"California","Log Number":"US-01202009-0015","files":["/var/www/straped/mufon/html2text/15021.html.txt","/var/www/straped/mufon/org/15021.html"],"Object Features":"Undisclosed","Summary":"multied colored and spinning","Viewing Distance":"Unknown","Country":"United States","divs":["sighting details a short while ago i was siting out side enjoying the night as i so offten do, i saw a pair of lights apear to come out of no where to the west. at first i thought it was a plane but then i notced the lights were the wrong colors and the the object was not moving. i kept my eyes on the object forabout 45 sec's then i call my brother and sister out side to confirm what i was seeing. my sister then pointed out that it was spinning, and it was. shortly after its lights dimmed and then seem to slowly move to the west towards los angels.the time it was last seen was 7:03 pm pst. so the whole event lasted two maybe three minutes. we live in an dark, hill side area so our vison was great. there has been sightings around this area befor but not for a while. and the great thing is that they have been seen my muliple people and both at night and day times... our location: la habra heights, harbor blvd.\\fullerton rd. object aprox. location: west of my locaton. object seem to in the whittier area... photos and a short video were taken but it just looks like a dot in the sky. nothing worth posting."],"Date of the Event":"01/20/2009 07:01 UTC"}