{"Viewing Distance":"501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/15031.html.txt","/var/www/straped/mufon/org/15031.html"],"Summary":"Witnessed a triangular craft change into a rectangle and then split into 2 crafts.","Longitude":"-124.147516","Latitude":"40.607287","Object Shape":"Triangle","Case Number":"15031","Date Submitted":"01/20/2009 09:30 UTC","Country":"United States","Date of the Event":"01/20/2009 09:30 UTC","Log Number":"US-01212009-0007","divs":["sighting details1. i was outside my house, i just stepped outside for a smoke with a friend, its was 9:30 pm and the sky was clear. 2. i looked up because i heard a large plane flying over, like a normal large passenger plane, which is normal, they fly overhead all the time, but there was also a large (3xs bigger than the jet) triangular craft following close behind. i say it was triangular because it had a white light on each tip of the triangle, and one large blinking red light in the center. 3. i thought maybe it was a stealth bomber because of its shape. 4. as i watched the craft, it seemed to slow down, then it twisted\\spun slowly on its side and changed from the triangular shape (based on the 3 white lights i mentioned above) into a rectangular shape (now it had 4 white lights and the red blinking light disappeared). it remained a rectangular shape for a few seconds (maybe 15 seconds), slowly twisting the entire time, and then it \"split\" or separated into 2 separate crafts. 5. i was excited. 6. the objects remained moving east from me until i lost sight of it over a mountain range."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.607287,+-124.147516(15031)&iwloc=A&hl=en\"> mufon case (15031) map </A>","Source":"MUFON","City":"Fortuna","trends":["There have been 2 other sightings in Fortuna","There were no other sightings in Fortuna on or around January 20th 2009"],"Object Flight Path":"Path with directional change","Weather Factors":"None","Tags":"City","Disposition":"Unknown","Region":"California"}