{"Disposition":"Unknown","Case Number":"15038","Tags":"City","Country":"United States","Latitude":"41.05919","Summary":"Saw two lights, thought they were a tower, went to check on it, started moving.","Date Submitted":"01/21/2009 08:30 UTC","Source":"MUFON","Object Features":"Wings","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Stamford","Log Number":"US-01212009-0013","map":"<A HREF = \"http://maps.google.com/maps?q=41.05919,+-73.534534(15038)&iwloc=A&hl=en\"> mufon case (15038) map </A>","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was driving home - my neighborhood is really dark at night - and I saw these lights standing still in the sky. They were never there before and I was wondering if it was a tower of some sort because they were perfectly still. I drove closer to see if they were in fact motionless to make sure it wasn't a plane, and sure enough the lights didn't move. I stopped to gaze at it and the lights became more detailed and began to move towards my car, at that moment I turned off my lights out of fear. After a couple of seconds I turned my lights back on and started to drive at a speed of about 25-30 m.p.h. The lights flew right above me still heading towards me, but as a car approached the back of my vehicle, the lights started to turn and flew in the direction i was going rather than towards me almost as if they were backing off. As it flew over my car, I was staring at it and could make out the faint outline of the body of the craft and it looked as if it was an airplane but not quite put together the same way. I was more anxious and in complete disbelief that this was happening to me, I just really wanted to find out what his was. I first thought it was a helicopter because of how slow it was moving but the positioning of the lights threw that idea out the window. All of this happened in an instance, the thoughts running through my head, and as the craft turned it started to pick up speed and flew into the night. The thing that made me believe that what i was seeing was unidentified, not of alien nature, was the speed of the craft. The lights were motionless and then started moving towards me and then flew over head, very low I must add, too low for the planes normally flying around my neighborhood. I tried to take a video from my car but couldn't make out the lights from my phone's camera. One last thing, the lights had an amber glow to them, and I could hear no engine of any kind. REALLY FREAKY!"],"files":["/var/www/straped/mufon/html2text/15038.html.txt","/var/www/straped/mufon/org/15038.html"],"Longitude":"-73.534534","Region":"Connecticut","trends":["There have been 10 other sightings in Stamford","There were no other sightings in Stamford on or around January 21st 2009"],"Object Shape":"Other","Date of the Event":"01/21/2009 08:30 UTC","Sighting Duration":"Undisclosed"}