{"Object Features":"Undisclosed","Case Number":"1503","Sighting Duration":"00:10:00","Disposition":"Unresolved","Log Number":"","Summary":"MA-1 - Large Disc seen in Ann Arbor, Michigan","City":"Ann Arbor","Weather Factors":"Unknown","Longitude":"-83.737038","Date Submitted":"09/30/1965 12:00 UTC","files":["/var/www/straped/mufon/html2text/1503.html.txt","/var/www/straped/mufon/org/1503.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.286806,+-83.737038(1503)&iwloc=A&hl=en\"> mufon case (1503) map </A>","Region":"Michigan","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around September 30th 1965"],"Object Shape":"Disc","Country":"United States","divs":["Sighting DetailsOn the date in question, Mr.____ and his daughter saw a large (150 wide) discabove North Territorial Road in Ann Arbor, Mich. in October 1965 (1966?)On the date in question, the father and his daughter had stopped in the drivewayof Mr.____s fathers house at (address deleted) when the father first becameaware of the object, he thought it was an airliner. Then he noticed it washovering. Could it be a helicopter? No, he thought, because it seemed to be700 to 800 feet above the road, but he could hear no noise. He was stunned. Heand his daughter watched the object for eight to ten minutes, after which itslowly went off to the North-west.To the father, it seemed to be a 150 foot wide disc with white lights allaround, \"like the cabin lights on an airliner.\"The father discussed the sighting with his daughter, but decided to mention itonly to close friends, as the \"marsh gas\" business discouraged him from making areport. However, the \"marsh gas\" furor took place in 1966, which would placethe father a year off.During the Saline flap of December 1972, the father mentioned this sighting tosome of his employees, from one of whom I learned of the sighting."],"Latitude":"42.286806","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","Date of the Event":"09/30/1965 12:00 UTC","Viewing Distance":"Unknown"}