{"Date of the Event":"01/21/2009 09:28 UTC","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/15041.html.txt","/var/www/straped/mufon/org/15041.html"],"Object Features":"None","Log Number":"US-01212009-0016","trends":["There have been 2 other sightings in Blue Bell","There were no other sightings in Blue Bell on or around January 21st 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.162091,+-75.264379(15041)&iwloc=A&hl=en\"> mufon case (15041) map </A>","Country":"United States","City":"Blue Bell","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Date Submitted":"01/21/2009 09:28 UTC","Tags":"City","Weather Factors":"Unknown","Longitude":"-75.264379","Latitude":"40.162091","Object Shape":"Circle, Fireball, Flash, Oval, Square, Rectagular","divs":["Sighting Detailsat aprox. 930 pm, as i was driving home from work, i made a left turn on cathcart road in blue bell pa. i immediately noticed a flashing red light directly ahead of me. the light seemed to be the size of a dime on the horizion which is much much larger than any other light i've ever seen in the sky. at first i thought it looked unusual but believed i would recognize a familiar shape when i got closer. the closer i got i realized the one large blinking red light was actually two lights. i made a right turn on morris road at which point the object began to move parallel to me. i was amazed at how large these lights were and the absence of any other light sources other than the two extremely large red flashes. at this point i couldn't believe what i was seeing. it passed within a few hundred yards of me. it appeared to be shuffling across the sky. moving forward, then slightly backward, then forward ect. it moved towards lansdale and over the horizion, still clearly visible the whole time. it did not make a sound but passed right overhead. i do not know what this object was, but i can say that i am positive that it was not an airplane, helicopter, blimp or anything else that i have ever seen before. i really hope someone else saw this because it was the strangest thing i've ever encountered"],"Disposition":"Insufficient Data","Object Flight Path":"Hovering then path,Other","Case Number":"15041","Summary":"Saw two pulsating red lights blinking in sequence much larger than aircraft."}