{"Sighting Duration":"Undisclosed","Disposition":"Hoax","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around November 5th 2008"],"Log Number":"US-01222009-0006","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/15047.html.txt","/var/www/straped/mufon/org/15047.html"],"Object Flight Path":"Undisclosed","Tags":"City","Source":"MUFON","Summary":"White ball of light surrounded by 3 helicopters over the Hollywood Hills near Sunset & La Brea.","map":"<A HREF = \"http://maps.google.com/maps?q=34.054624,+-118.235735(15047)&iwloc=A&hl=en\"> mufon case (15047) map </A>","Country":"United States","Longitude":"-118.235735","Date Submitted":"11/05/2008 10:00 UTC","Object Features":"Undisclosed","Region":"California","Date of the Event":"11/05/2008 10:00 UTC","Latitude":"34.054624","Object Shape":"Star-like","Viewing Distance":"Unknown","City":"Los Angeles","Case Number":"15047","divs":["sighting detailsnov. 5th 2008 it was the night of nov. 5th 2008 in los angeles ca, 90046 area code (hollywood). the day after the elections there were mixed feelings in l.a. because of the prop. 8 results (gay\\lesbian marriage ban passed). there was a demonstration of gays & lesbians on sunset blvd. around 9pm that night. they march down the street started quite a ways down in west hollywood at sunset and la cienega blvd and were moving east towards my neighborhood. before they ever got close, however, i was standing on my balcony and noticed three helicopters hovering in place directly north of me (nowhere near the protest march) they seemed to be triangulated on a fixed point in the sky over the hollywood hills. i started to focus on the fixed point they were all surrounding and saw a bright white ball of light in the center of the three chopper triangle formation. the light looked smaller in comparison to the choppers, but very bright. this ball of light then moved up and down vertically very quickly a few times and then took off very fast toward the east in an erratic way that left a momentary squiggly trail of light. then it was gone. the whole event probably lasted no more than 1 or 2 minutes. the helicopters dispersed 5 to 10 minutes afterword and the protest march didn't make it to my neighborhood for another 30 - 40 minutes after that. didn't see any news coverage of the march from an overhead vantage point. due to the distance between myself and the 3 helicopters and the darkness, i was unable to see any markings identifying them as lapd, news or otherwise. my balcony has a western exposure with a 180 〬 degree view from north to south on the 4th floor which overlooks much of hollywood. thats about it."]}