{"Weather Factors":"None","divs":["Sighting DetailsI was outside and looked out immediately at this bright huge light. It was low, like where the commercial planes fly. Maybe abit higher. I ran to get my mom and tell her to look at it. It was so bright and big it was like the size of 5 north stars but it looked like ahuge beam of light. For a moment a green meteor type tail of light was coming off of it. looked about an inch long. So I thought maybe I was staring to hard at it and looked away and it still had that beam very thin light coming off it from the top. I watched from time to time about every 15 mins. After about 45 mins it looked like it had gotten dimmer. I was waiting to put my daughter to bed and showed her it and when I looked at it again it had gotten even dimmer. I don't know why I didn't jump in the car to begin with but I did finally. I went out of the neighborhood in the direction it was going and looked to the right. I was alone and driving so no no one else was with me to see that just about 30 seconds down the road this thing was just sitting there and didn't move, just sat there. What I saw were the lights going around it on its sides not facing me the lights were facing to the sides in red and i think green and white. but this wasnt a plane. I saw it, it was huge and just sitting there as if it wanted to just sit. Very weird. It was getting dimmer and the brighter area of white now orange shaded in color was at the top and bottom of it in a circle shape (the lights). I tried to get a better view and drove up and turned around about 1-2 minutes later. It was gone. I turned down the rode called my mom told her to look out the window and see if she could see it and i said it was gone and she said she didn't see it. I wouldn't normally report something like this but I want to know what it was and if anyone else had seen it. I wouldn't believe it if no one else reported it to the police. My mom and I aren't the type to call or report these things but even she said call the police department and see if they kknow anything. So I know she was abit nervous and she and I both know that for that length of time no way was it a plane or helicopter. We did see planes and helicopter around its proximity and they were nowhere near the size nor color. Please contact me and let me know if any1 has seen this or if infact you have an answer of what it was. Thank You"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.17441,+-86.776913(15042)&iwloc=A&hl=en\"> mufon case (15042) map </A>","Latitude":"36.17441","files":["/var/www/straped/mufon/html2text/15042.html.txt","/var/www/straped/mufon/org/15042.html"],"Log Number":"US-01222009-0001","Disposition":"Insufficient Data","Longitude":"-86.776913","Source":"MUFON","Object Features":"Patterned Surface","Date of the Event":"01/21/2009 07:30 UTC","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Object Shape":"Circle, Saturn-like, Sphere, Star-like, Unknown","trends":["There have been 72 other sightings in Nashville","There were 2 other sightings in Nashville on or around January 21st 2009"],"Summary":"Round like a ball-lights went around sides red and green not quite all the way round.","Case Number":"15042","Date Submitted":"01/21/2009 07:30 UTC","City":"Nashville","Tags":"City","Country":"United States","Region":"Tennessee"}