{"Latitude":"40.182354","Summary":"UFO sited in the sky, outside my home for approx 10 minutes.","Region":"Pennsylvania","Date Submitted":"10/15/2008 11:30 UTC","Log Number":"US-01212009-0015","divs":["Sighting Details At approx 11:30 PM, late summer or early fall of 2008, I was looking out the kitchen window waiting for my wife to return from work, at which time I noticed something very unusual, in the sky. It was a display of red lights, in an irregular rectangular arrangement with no noticable solid form or mass. There was no aircraft attached to it. It hoovered for a while and also moved very slowly. I went outside to get a better look and then it moved to the back of my house and disappeared. Shortly after, my wife returned from work and asked me what was wrong, as I appeared, to her, to be distressed. I told her, \"I just saw the wierdest thing\", and proceded to tell her my observations. At her urging, I called the local police department to report what I had seen. I also asked them if anyone else had called tonight with a similar observation. They replied, \"No.\" I recently watched a TV documentary regarding UFO's sighted in the Bucks County area (which is where I live). This gave some credability to my story. Today, the Trend newspaper, front page article features a story on Bucks UFO sightings, which further validates my experience."],"Weather Factors":"Unknown","Disposition":"Unknown","Source":"MUFON","trends":["There have been 15 other sightings in Langhorne","There were no other sightings in Langhorne on or around October 15th 2008"],"Case Number":"15040","Date of the Event":"10/15/2008 11:30 UTC","Object Features":"None","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/15040.html.txt","/var/www/straped/mufon/org/15040.html"],"Tags":"City","Object Shape":"Square, Rectagular, Other","City":"Langhorne","map":"<A HREF = \"http://maps.google.com/maps?q=40.182354,+-74.916926(15040)&iwloc=A&hl=en\"> mufon case (15040) map </A>","Longitude":"-74.916926","Sighting Duration":"Undisclosed"}