{"Latitude":"40.103932","map":"<A HREF = \"http://maps.google.com/maps?q=40.103932,+-74.923608(15051)&iwloc=A&hl=en\"> mufon case (15051) map </A>","Weather Factors":"Unknown","City":"Bensalem","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Pennsylvania","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"12/17/2008 10:15 UTC","Object Flight Path":"Stationary","Longitude":"-74.923608","Object Shape":"Triangle","Case Number":"15051","Object Features":"Unknown","Log Number":"US-01222009-0010","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around December 17th 2008"],"Date Submitted":"12/17/2008 10:15 UTC","Summary":"I was driving home from work and saw two hovering triangles near the Philly Race Park on Street Road.","divs":["Sighting DetailsThe incident occurred as I was driving one evening on a small street that intersects with Street Road in Bensalem, PA. As I approached the busy Street Road intersection, I was astonished to see two silent triangle-shaped objects hovering in the sky near Philly Race Park. One was closer and more visible, the second further in the distance. The objects were dark but their outline was clearly discernable - they weren't helicopters, stars, planes, or blimps. I could not account for what these objects were - they were just hovering. The objects resembled the triangles of the Belgium wave in the 80's (Yes - I admittedly have a passing interest, and I'm familiar with the major incidents but wouldn't call myself a \"true believer\".) However, I was also amazed that none of the other traffic going east on Street Road was reacting to this. (Thinking back, it was probably because the objects were large and further than they appeared as you approached the intersection and could not see them if you were traveling actually on Street Road. It was difficult to tell, since there was no reference point, the objects proximity and size - if they were smaller and closer or larger and further away.) Because of this, and because I have an interest in this phenomenon, I convinced myself this was a trick of the light, my imagination - or something. I kept driving, but never entirely wrote the incident off, and can't say I fully convinced myself that this was an optical illusion or something I misidentified. It stayed with me. Now, I'm reading that there are several incidents in Bucks County around this same time and felt compelled to report this incident. I can not claim that I saw UFOs before, other than this incident. I don't know what these hovering triangles were or if it is explainable but I simply can't account for them. The time and dates are approximate - guesses, to be honest, at this point. Please respect my wishes to remain anonymous."],"Country":"United States","files":["/var/www/straped/mufon/html2text/15051.html.txt","/var/www/straped/mufon/org/15051.html"]}