{"files":["/var/www/straped/mufon/html2text/15053.html.txt","/var/www/straped/mufon/more/15053_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/15053.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.836332,+-104.813453(15053)&iwloc=A&hl=en\"> mufon case (15053) map </A>","Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"01/21/2009 08:30 UTC","Sighting Duration":"Undisclosed","Latitude":"38.836332","Date of the Event":"01/21/2009 08:30 UTC","Log Number":"US-01222009-0012","Disposition":"Unresolved","City":"Colorado Springs","Summary":"Row of lights in the sky turning on and off next to Cheyenne Mountain and Norad.","Longitude":"-104.813453","Object Shape":"Unknown","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around January 21st 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Region":"Colorado","Source":"MUFON","Case Number":"15053","Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["sighting detailsi was driving south on i-25 passing the fillmore exit when my friend julian noticed some lights in the sky next to norad and pointed them out to my girlfriend and i. the lights went out almost as soon as we looked, but by that point we were curious and kept our attention directed towards the mountain. we also noticed that there were no commercial planes flying in that area, nothing in the air at that time. about 40 to 45 seconds later, the lights came back on, all simultaneously, and in a horizontal row. there were three lights, to the left of the mountain and about 3\\4ths of the height of the mountain. they stayed perfectly still, and went off a few seconds later, all simultaneous. we have lived in colorado springs all of our lives, and there are three air bases here and a major airport, and we have never seen anything this big, especially with no visible faa lights, so we knew we were seeing something odd. i have also witnessed the military base dropping and firing flares, but these were much brighter, did not have the distinctive smoke trail, and stayed stationary in perfect unison. we kept driving south on the highway to see if we'd see it again, and just as we'd hoped the lights went on again. we were extremely excited, and i called my father who was on the east side of town to go outside and look, though he saw nothing. at this time, the lights were the same place and height in the sky, but it looked as if the craft had shifted or if we were getting closer because one of the lights was slightly lower than the other two lights. they were in the same place in the sky, just slightly angled, like points of a triangle. the lights stayed on for approx. one second and then went out. we continued driving south to see if we could see it again, even going so far as driving to about 100 yards away from the access road to norad, yet we never saw anything. we did notice though that aircraft flight continued around and above the mountain after that. we continued home in hopes of seeing something on the local news, yet saw nothing even mentioned."],"Country":"United States"}