{"Date Submitted":"01/17/2009 12:00 UTC","Log Number":"GB-01222009-0011","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Region":"England","Weather Factors":"None","Longitude":"-2.173314","trends":["There have been 8 other sightings in Stoke-on-Trent","There were no other sightings in Stoke-on-Trent on or around January 17th 2009"],"files":["/var/www/straped/mufon/html2text/15052.html.txt","/var/www/straped/mufon/org/15052.html"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=53.003668,+-2.173314(15052)&iwloc=A&hl=en\"> mufon case (15052) map </A>","Object Features":"None","Case Number":"15052","Tags":"City","Country":"United Kingdom","divs":["sighting detailsi let my dog out into our back garden at eleven-o-clock and at about five past she had not come back in so i went to look where she was and she was still at the top of the garden, so as she did not seem ready to come in at that time, being a keen astronomer i decided to a bit of sky gazing. it was quite frosty with a mainly clear sky and just a few small clouds. after looking for about 5 minutes, i noticed to my left due west, a orange object which appeared to be glowing,my first thoughts were, that being close to the aircraft routes to manchester airport that this may be an aircraft on fire, but as it started to move across my horizon left to right, west to east it was getting bigger and taking the shape of a glowing orb.i have never in all my years of watching the skies seen anything like it,in the excitement of seeing the object, i called my wife to come and see it and she could not believe it either. as the orb passed in front of us at an angle of about 45 degrees it was seen to glow from orange in the centre to red on the outer fringes,the outer edges not seeming to be very sharply outlined but appearing slightly gaseous.it passed behind a small cloud and was still visible through the cloud and as it passed further to our right eastwards it still kept its shape and form.when it was at its highest above us it was about the size of my little finger nail, when held at arms length. the transaction of this object took about 5 minutes from west to east. there did not seem to be any variation in the objects trajectory up or down it was passing at a steady constant speed until out of site. when telling m y sister the next day she said that herself and husband had seen three of these objects on 1\\1\\09 at 1am travelling east to west over there house in another part of our town and also other people in the staffordshire moorlands saw them on the new years eve. i contacted bbc radio stoke two days after and reported the sighting but they have not got back to me. hoping this is of interest to you yours sincerely"],"City":"Stoke-on-Trent","Source":"MUFON","Latitude":"53.003668","Object Flight Path":"Straight-line path","Summary":"Orange orb.","Date of the Event":"01/17/2009 12:00 UTC"}