{"Source":"MUFON","Date Submitted":"01/21/2009 09:59 UTC","Object Flight Path":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","City":"Holyoke","Weather Factors":"Unknown","Tags":"City","Region":"Massachusetts","Object Shape":"Circle, Triangle","Latitude":"42.209419","Case Number":"15057","files":["/var/www/straped/mufon/html2text/15057.html.txt","/var/www/straped/mufon/org/15057.html"],"Longitude":"-72.607801","trends":["There have been 3 other sightings in Holyoke","There were no other sightings in Holyoke on or around January 21st 2009"],"Date of the Event":"01/21/2009 09:59 UTC","divs":["sighting detailsmy name is {pid} i am a retired police officer, on the above date my wife and my 15 year old son went to bring my older son back to westfield state college.when they returned home, they were walking from the parking lot to the building where we live, when my 15 year old son observed a huge light in the sky right above the building next to the one we live in.it appeared to be circular for about a minute.he got scared and called my wife to see it and at that moment it appeared liked it got sucked up and became a triangular shape and had no sound it seemed to dissapear up in the sky as fast as turning off a light.when this was occurring my wife called me very excited and asked me to hurry up and go to the porch, i asked her why and she told me just to hurry up and see the light by the other building.by the time i went to the porch it had vanished.when they both came into the house both looked visibly shaken and both of them trying to tell me what happened at the same time.they both showed me how they had goosebumps and couldn't stop talking about it. in my experience as a police officer when i investigated accidents or crime scenes and talked to witnesses or victims their behavior and demeanor will coraborate their story.i can honestly say that after talking to both of them they are both convinced to have seen something they had never seen before. {cms\\jat\\pid}"],"Object Features":"Undisclosed","Sighting Duration":"00:01:15","map":"<A HREF = \"http://maps.google.com/maps?q=42.209419,+-72.607801(15057)&iwloc=A&hl=en\"> mufon case (15057) map </A>","Disposition":"Unknown","Summary":"Huge bright light over building.","Log Number":"US-01222009-0016"}