{"Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-82.808786","Object Flight Path":"Stationary,Path with directional change","Log Number":"US-01222009-0009","files":["/var/www/straped/mufon/html2text/15050.html.txt","/var/www/straped/mufon/org/15050.html"],"City":"New Albany","divs":["sighting detailsit was around 7:30pm on jan. 21st 2009 when i looked out of my 3rd story apartment building window, and saw the usual airplane.since we live about 15 minutes from one,i see them quite often,however, below the airplane apeared to be another blinking craft of some sort.it didn't look like itwas moving,because the airplane that was much higher,went out of my view.i watched it for about a minute,because i thought that it was odd to not be moving,yet have blinking lights.as i watched it, it sped up toward my direction, going west.it had looked like it made a 45 degree angle turn all of a sudden in my direction.i became very nervous,and almost panicked as i watched it move slowly about 100 yrds from my window.i saw what looked like a triangular shaped craft with black on top\\sides of it.i saw the whole bottom as it went over my apartment building.it had 3 lights,one on each point and the bottom seemed to be dark but almost cloudy-like.i immediately was scared and called my mom to calm me down.my husband who normally would be home at that time,was in a meeting.when he returned home we both saw several blinking lights,but could not make out if it was a triangular shape craft or helicopters.i know what i saw,and it needs to be known that these crafts are out there.what they are, i do not know."],"Date Submitted":"01/21/2009 07:30 UTC","Summary":"Very dark in color, had 3 lights in which one or more would blink, triangular shaped. The size of a large bus maybe.","Object Features":"Unknown","trends":["There have been 11 other sightings in New Albany","There were no other sightings in New Albany on or around January 21st 2009"],"Latitude":"40.081174","Case Number":"15050","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Date of the Event":"01/21/2009 07:30 UTC","Object Shape":"Triangle","Region":"Ohio","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.081174,+-82.808786(15050)&iwloc=A&hl=en\"> mufon case (15050) map </A>","Country":"United States"}