{"Object Shape":"Circle, Star-like","Date of the Event":"01/21/2009 06:45 UTC","Disposition":"Unknown","trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around January 21st 2009"],"Tags":"City","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/15063.html.txt","/var/www/straped/mufon/org/15063.html"],"Latitude":"30.427339","Date Submitted":"01/21/2009 06:45 UTC","Summary":"Two different sightings at different times on same night.","Object Features":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-87.211925","Country":"United States","Log Number":"US-01222009-0022","map":"<A HREF = \"http://maps.google.com/maps?q=30.427339,+-87.211925(15063)&iwloc=A&hl=en\"> mufon case (15063) map </A>","City":"Pensacola","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Florida","Case Number":"15063","divs":["Sighting DetailsI returned home from shopping and let our three dogs outside at approximately 645pm. I brought them back inside and realized that I had left some items in the car. I went back outside and noticed a very bright light in the WSW above a nearby treeline. I kept looking at it trying to figure out what it might be. I live across the street from a Navy helicopter training field, so I am very familiar with their sights and sounds, but it would have been too late for them to be flying anyway. It wasn't a plane- it had no blinking lights and did not move like one. It had fringes of red on the left and right sides and what appeared to be \"moonbeams\" eminating from it. It moved very slowly towards the south. I called my neighbors (to my west) on the phone and asked them to step outside and see if they witness what I was seeing. We stood in their front yard and watched it move away to the south. We watched it for approximately 10 minutes and they went back inside (since the temperature was around 30 degrees). I came back inside my home and thought about what I was seeing. I went back outside and it was still there, but lower in the sky. I went over to my neighbors (to my east), and they stepped outside into the street and also saw it. We watched it for a few minutes, and they went back inside their home. My neighbor (to the east) went online to see if there were any stars that were supposed to be visible, and I told them I would talk to them later to find out. I went back home at this point. At about 730pm, I went back outside to see if the light was still in the sky, but it had disappeared. I walked back over to my neighbors (to the east) to see if she had found out anything on the internet, and as I knocked on their door, I turned towards the SWS, looking over the helicopter training field towards Perdido Bay. I saw three orangish-red pulsating orbs. Two of them were close together, and the third was further to the west. At this point, I noticed that the orbs were fading out slowly, then would reappear in a different spot. They did this independently of each other. My neighbors came to their door and as we stood in their driveway, we all witnessed the orbs fading out then reappearing, moving westerly. They started appearing closer together. One would fade out, and then the other two would fade out. The whole episode lasted approximately two minutes before the orbs disappeared completely. We noticed that air traffic in the area picked up considerably during both episodes- more than usual. There was a distinct difference between the bright light and orbs versus the planes and helicpters that started appearing. My neighbor did say that Scorpius would have been the brightest star in the western sky, but when we came out to look for it, it was no longer there- with no explanation where it disappeared. The bright white light was no star. The three pulsating orbs were not stars. I'm not sure what we all saw last night."]}