{"Date of the Event":"01/21/2009 08:52 UTC","divs":["Sighting DetailsI was driving east on I-10 near mile marker 43 when I saw a large green light flash by me on the right side. It was running parallel to the Interstate heading east at a slight downward angle approximately 300 yards from the highway. I was driving 65 mph and it passed me like I was sitting still, probably traveling close to 200 mph. I watched it for several seconds before I lost sight of it behind some trees. My first thought was that it might be a meteor but I've never seen a meteor that looked like that. It was very large, very close to me and had no tail behind it. The intensity and color of the light remained the same the entire time. It was about the same color as a green traffic light. After traveling a few more miles I noticed a small airport in the direction the light was headed but I did not see any planes on the runway, and I do not think it was a plane because I did not see any of the other lights that an airplane would normally have on it. It was also only a couple hundred feet off of the ground and very close to some houses when I first noticed it. It probably was just a meteor or some other natural phenomenon but I thought I would report it anyway. What is really odd about this incident is the fact that I just joined MUFON a week ago and this is the first UFO I've ever seen. I thought that was kind of weird."],"Log Number":"US-01222009-0023","City":"Lake Charles","Weather Factors":"Unknown","Longitude":"-93.212706","Object Flight Path":"Straight-line path","Object Shape":"Fireball","Tags":"City","Source":"MUFON","Object Features":"Unknown","Region":"Louisiana","Latitude":"30.227595","files":["/var/www/straped/mufon/html2text/15064.html.txt","/var/www/straped/mufon/org/15064.html"],"Date Submitted":"01/21/2009 08:52 UTC","Case Number":"15064","Disposition":"Insufficient Data","Country":"United States","Summary":"Large green light flying through night sky.","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around January 21st 2009"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.227595,+-93.212706(15064)&iwloc=A&hl=en\"> mufon case (15064) map </A>"}