{"Summary":"I was in my back yard looking at my trees I turned around I could see a disc shape craft hovering over my house about 1000 ft. above my house the craft started to move slowly. I try to take a pic with my camera phone, it took off.","files":["/var/www/straped/mufon/html2text/15060.html.txt","/var/www/straped/mufon/org/15060.html"],"Viewing Distance":"Unknown","divs":["Sighting Detailson Monday September 12, 2009 these sightings happen between four forty nine PM and four fifty three PM I just got home from work I walked to the end of my house to look at a tree. the reason I was looking at my tree, I had a big limb fell onto my neighbor house a week before. I was looking to see how I should cut the tree down without hitting her house . then I started to look at my other trees, because they needed trimming too . I was in by backyard next too my storage building looking up at my trees with my back turn to my house . then I started too turn around and look up over my house. I don't know why I turn around and look up over my house. when I turn around and look up I could see a saucer shape craft up over my house hovering. I could not hear no sound from the craft .The craft was a dark color but it look black to me the craft looked about 1000 feet maybe less above my house. then I start walking toward my house, then the craft started too move slowly, then I reach to my side to get my camera phone I was trying to set my camera phone up to take a picture of the craft then the craft took off real fast. I could see it moving but it was to far away for me to take a picture. then I put my camera phone away then I went back looking at my trees again. then I turn around again it was back over my house again about the same spot hovering. where I saw it the first time. then I started walking toward my house then it started moving slowly again it was moving toward my other neighbor tree. when it got over the tree it vanish. I did not see it leave the second time. I could see around the tree limbs because there was no leaves on the tree, but I did not try to take a picture the second time but after it left the second time. I went in the house and got my digital camera but the UFO never return I was abducted in a church yard in 1997. I been having ufo sighting for 12 years know. when i have a ufo sighting, it does not scare me are bother me I learn how to live with the sightings"],"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Tennessee","Disposition":"Hoax","trends":["There have been 10 other sightings in Loudon","There were no other sightings in Loudon on or around January 12th 2009"],"City":"Loudon","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=35.737814,+-84.326641(15060)&iwloc=A&hl=en\"> mufon case (15060) map </A>","Longitude":"-84.326641","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"01/12/2009 04:50 UTC","Log Number":"US-01222009-0019","Case Number":"15060","Tags":"City","Country":"United States","Date Submitted":"01/12/2009 04:50 UTC","Object Features":"Undisclosed","Latitude":"35.737814"}