{"City":"Gray","Source":"MUFON","Disposition":"Unknown","Tags":"City","Date Submitted":"01/22/2008 10:00 UTC","Latitude":"36.419826","files":["/var/www/straped/mufon/html2text/15069.html.txt","/var/www/straped/mufon/org/15069.html"],"Weather Factors":"None","trends":["There have been no other sightings in Gray","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsAt approx 10 pm this evening i was outside checking my neighbors heat pump. I happened to look up at the stars (no clouds) and noticed what appeared to be 3 sets of lights headed in my direction. Two of the aircraft had 4 white lights in a boomerang fashion with two red strobes in between. These two appeared to be very close, one in front of the other. Much closer than i would expect aircraft to be operating at night. The third aircraft displayed just 3 white lights in a triangular formation. It was located off to the right of the other two. I called my girlfriend out to see them and i remarked how crazy i thought the pilots were for being so close to one another at night. It was then as they passed right over our heads, from west to east, that we both noticed they made no sound at all. No jet noise, no prop engine, nothing. I am a 15 year veteran of the US navy and i have been around numerous aircraft. These objects were less than 2k feet and didnt make a sound. We live in a very quiet neighborhood so we would have heard some kind of engine noise. They continued east and just prior to them passing out of view due to tree cover we observed a red light rise from the 3rd aircraft (the one with just 3 white lights). The red light rose up from it and then disappeared."],"Object Shape":"Boomerang, Triangle, Unknown","Object Features":"None, Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.419826,+-82.476535(15069)&iwloc=A&hl=en\"> mufon case (15069) map </A>","Date of the Event":"01/22/2008 10:00 UTC","Region":"Tennessee","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Summary":"A triangular set of lights with what appeared to be 2 aircraft to the left.","Log Number":"US-01222009-0028","Longitude":"-82.476535","Case Number":"15069"}