{"Weather Factors":"None","Viewing Distance":"Over One Mile","Region":"Ohio","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15077.html.txt","/var/www/straped/mufon/org/15077.html"],"divs":["Sighting Detailsmy freind and i were driving on back road from trenton ohio towards middletown one night around10 or 11 oclock.we happen to see a large fire ball falling from the sky.we stopped the truck and got out and watched it.this thing looked like it was maybe 20 or 30 miles away.it was a large ball of fire with a long fire tale behind it.it had alot of different colors behind the tail and then tailed out to regular fire color.this thing was huge.it came in at an angle of west to east.ilived in franklin ohio at the time and it looked like it could of landed near there,of course i know i could of been off by many miles but that is what it looked like to us.as soon as it went down we were standing in shock.and in afew seconds heard a jet like sound coming souyh to north towards the direction of were it went down.inever heard a jet sound like this,very fast and quiet with no lights.the direction this thing landed near even if i was wrom by 20 miles or so was near right pat air force base.they had to of known about this thing. the next day it was all over the wlw radio station seen as far away as 400 miles in 3 different states.the radio station called norad live on the radio to ask what it was people saw.they claimed nothing fell from the sky that night.i am 50 years old and this is the first and ony time i have seen something like this.now i know first hand our goverment dont tell us the truth.listening to all the callers that morning i didnt hear anyone say they heard the jet.i did."],"Summary":"Watched large fire ball come down from sky for about two minutes.","Object Features":"None","Date Submitted":"11/30/2000 12:00 UTC","Object Flight Path":"Straight-line path","Tags":"City","Date of the Event":"11/30/2000 12:00 UTC","Longitude":"-84.189477","Object Shape":"Fireball","Latitude":"39.760858","Case Number":"15077","Log Number":"US-01232009-0007","City":"Dayton","trends":["There have been 40 other sightings in Dayton","There was one other sighting in Dayton on or around November 30th 2000"],"Country":"United States","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.760858,+-84.189477(15077)&iwloc=A&hl=en\"> mufon case (15077) map </A>","Sighting Duration":"Undisclosed"}