{"Longitude":"-84.320797","Log Number":"US-01232009-0004","Tags":"City","Region":"Georgia","Date of the Event":"01/21/2009 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.869492,+-84.320797(15074)&iwloc=A&hl=en\"> mufon case (15074) map </A>","trends":["There have been 4 other sightings in Blue Ridge","There were no other sightings in Blue Ridge on or around January 21st 2009"],"Date Submitted":"01/21/2009 08:00 UTC","Case Number":"15074","Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/15074.html.txt","/var/www/straped/mufon/org/15074.html"],"divs":["sighting detailsi was sitting in my room on the second floor of the house & i was on my computer, when i received a phone call from my uncle about something, well i don't get good cell service @ my house so i proceeded to my bedroom deck where there is better service. as i was talking, i was facing the river & out of the corner of my eye i noticed something flickering. i began to watch it and thought @ first that it was a star because of its glowing nature. then i realized, it then had three distinct colors that i could see with the naked eye. red, green, and a yellowish looking color, and it looked as if it was moving towards my direction. i went back inside and grabbed my binoculars and then it became clear that it was not a star, nor a plane, and it looked as if it was some big ball or circle that went into a point @ the top, but the interesting thing is that it looked like it was changing very fast from a point or like some triangle back to a round circle or actually completing back the bottome part of the circle to make a whole circle. i was pretty amazed and confused on what it could be. i went & grabbed my parents to let them take a look @ the object and they as well couldn't figure it out & were amazed as well that they have never seen anything like that. i took my dad's telescope and the pair of binoculars and got in my car and drove to my dad's church that has an amazing view of the sky. i picked my uncle up on the way as it was only about 2 minutes down there road to the church. we both set the telescope up & it was extrodinary, & unexplainable to both of us. we stay there about 2 1\\2 hours & watched the object. it stayed still pretty much the whole time exept when i was on my deck @ the house, when it looked as if it was coming closer. after two & half hours later it started to move towards the left of our position, then with extrodinary speed, went the opposite direction, & it kind of remind me when someone sees a shooting star, i followed only for a split second and it was gone."],"Object Features":"Other, Unknown","Latitude":"34.869492","Weather Factors":"None","Object Shape":"Circle, Flash, Triangle","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Blue Ridge","Summary":"Circular with extremely bright lights coming off of it. It looked as if I was looking @ an array of colors from the spectrum that were pulsating. While the colors were pulsating a green, red, yellowish looking color was was going around this object fast."}