{"Region":"New Jersey","Longitude":"-74.286293","Object Shape":"Boomerang, Disc","Summary":"Two UFOs wittnessed by me and my girlfriend.","Case Number":"15070","Weather Factors":"Unknown","Log Number":"US-01222009-0029","Viewing Distance":"501 Feet - 1 Mile, Unknown","Latitude":"40.232632","files":["/var/www/straped/mufon/html2text/15070.html.txt","/var/www/straped/mufon/org/15070.html"],"Sighting Duration":"00:20:00","Source":"MUFON","Disposition":"Unknown","City":"Freehold Township","Tags":"City","Date Submitted":"01/20/2009 12:00 UTC","divs":["Sighting DetailsMe and my Girlfriend were sitting in a very dark secluded are looking up at the stars and constellations. I noticed one object high in the sky which was unusually bright and at a high altitude. I was looking at it to figure if it was a star and after about a minute it started to move around in rapid back and forth and up and down motion. Off in the horizon my girlfriend had noticed a round disk that was hovering the moved violently around like it was confused and then darted off at a very high rate of speed. After a few minutes the Object that I had noticed had moved closer. What had looked like one one light turned into three and had the shape of a boomerang. After a minute it had climbed back up to very high altitude. I watched it move around for a little while at this high altitude to watch it then fad away. I have to say after noticing this I was a little scared but at the same time confused of what it was and feel maybe I was seeing things. I feel very strongly on the fact that they were not planes. I do live in a highly air trafficked area one of which include Mc Gwire Air Force base so I do know a plane when I see one and I know all the markings and lights that they are supposed to have on. Both objects did have any of these markings nor lights to identify them as an aircraft. Maybe I am seeing things which I hope I am not or it is something that can be explained to what me and my girlfriend have noticed."],"Date of the Event":"01/20/2009 12:00 UTC","trends":["There have been 4 other sightings in Freehold Township","There were no other sightings in Freehold Township on or around January 20th 2009"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.232632,+-74.286293(15070)&iwloc=A&hl=en\"> mufon case (15070) map </A>","Country":"United States","Object Flight Path":"Hovering then path"}