{"Region":"Meta","Tags":"City","trends":["There have been no other sightings in Villavicencio","This sighting has never been favorited."],"Summary":"Fotografia de un avistamiento de 15 OVNIS en diferentes posiciones tomada en los llanos de Colombia solo se vieron al descargar archivos en el PC.","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Country":"Colombia","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=4.15,+-73.633333(15080)&iwloc=A&hl=en\"> mufon case (15080) map </A>","divs":["Sighting DetailsEL PASADO PRIMERO DE ENERO DE 2009 EN HORAS DE LA TARDE TUVE UN AVISTAMIENTO DE 15 OVNIS EN UNA ZONA DE SABANA EN LOS LLANOS DE COLOMBIA. DE IZQUIERDA A DERECHA DE LA FOTO SE VEN LOS OBJETOS SOBREVOLANDO EL AREA DONDE ME ENCONTRABA. LA FORMA ES VARIADA CREO QUE HAY DOS TIPOS DE OBJETOS UNOS CON FORMA OVALADA Y OTROS CIRCULAR. HAY UNO DE ELLOS SOBREVOLANDO MUY BAJO YO DIRIRA QUE A MENOS DE 60 METROS. ALGUNOS DE ESTOS OBJETOS EXPIDEN UN GAS O HUMO EN LA PARTE SUPERIOR. AL MOMENTO DE TOMAR LA FOTO NO LOS VI, PERO VARIOS DIAS DESPUES AL DESCARGAR LAS FOTOS AL PC SE OBSERVAN. ALGUNOS INCLUSIVE SE VEN EN FORMACION SECUENCIAL ASCENDENTE. AL MOMENTO DE TOMAR LA FOTO LO QUE PRETENDIA ERA APROVECHAR EL PAISAJE TIPICO DEL LLANO, EL GANADO Y LOS ARBOLES PARA QUE UN AMIGO SALIERA REGISTRADO CON SU CAR AUDIO. UNA VEZ VI LA FOTO DE INMEDIATO ME DI CUENTA QUE ERAN OVNIS. ACTUALMENTE ESTOY EN PROCESO DE REGISTRO DE DERECHOS DE AUTOR DE LA FOTO, UNA VEZ SURTA ESE TRAMITE CON GUSTO SE LAS ESTARE ENVIANDO. CREO QUE ESTE ES UN APORTE IMPORTANTE PARA LA CIENCIA QUE AFIRMA UNA VEZ MAS LA EXISTENCIA DE ESTOS OBJETOS."],"Log Number":"CO-01232009-0010","Weather Factors":"Light","files":["/var/www/straped/mufon/html2text/15080.html.txt","/var/www/straped/mufon/org/15080.html"],"Latitude":"4.15","Longitude":"-73.633333","City":"Villavicencio","Object Shape":"Circle, Oval","Object Features":"Undisclosed","Date of the Event":"01/01/2009 03:52 UTC","Case Number":"15080","Object Flight Path":"Undisclosed","Date Submitted":"01/01/2009 03:52 UTC"}