{"Longitude":"-79.807145","Latitude":"35.712025","Case Number":"15088","divs":["sighting details my roommate woke me up about four months ago to show me a star in the sky that wasn't moving, but it was strobing different colors. we see this 'strobing star' in the skys of thomasville\\archdale often. it would be in the same area in the sky, or slightly off. last night we went out to uhwarrie national forrest to hang out and build a fire. we were out there from 5:20-8:00. about 6:40, my roomate sees the 'ufo star' that we often see. seeing as how we are out in the woods, we could see the stars much better. the star was strobing a lot, different colors, red, orange, yellow, and white most of the time. i was actually scared and frightenened for a little while when this thing started slowly moving up and down, and zig-zagging. usually this little ufo star thing just stays in one place. at one point it appeared to be coming closer, and looked triangular with maybe a dome on top. it was more blue\\purple then, then later turning green and red. later on it started moving up or away and slowly started looking like a star again, and quit moving. i have never seen anything like this in my life. i had my backpack with me and got out my compass twice. it was more towards the east at first, then after we noticed it had moved quite a bit, it was due southeast."],"files":["/var/www/straped/mufon/html2text/15088.html.txt","/var/www/straped/mufon/org/15088.html"],"Region":"North Carolina","Object Features":"Undisclosed","Tags":"City","City":"Asheboro","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.712025,+-79.807145(15088)&iwloc=A&hl=en\"> mufon case (15088) map </A>","Date Submitted":"01/22/2009 12:00 UTC","Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Asheboro","There were no other sightings in Asheboro on or around January 22nd 2009"],"Object Shape":"Circle, Flash, Star-like, Triangle","Date of the Event":"01/22/2009 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","Log Number":"US-01232009-0016","Summary":"Strobing different colors and moving, then it goes back to looking like a star.","Disposition":"IFO","Sighting Duration":"Undisclosed"}