{"Longitude":"-70.283961","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"43.672546","Country":"United States","Disposition":"IFO","Object Shape":"Square, Rectagular, Star-like","Summary":"We noticed a bright star movng in the sky across left and right and up and down.","Sighting Duration":"01:00:00","Region":"Maine","Date of the Event":"06/01/2004 10:30 UTC","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","trends":["there have been no other sightings in portland\\westbrook","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.672546,+-70.283961(15085)&iwloc=A&hl=en\"> mufon case (15085) map </A>","files":["/var/www/straped/mufon/html2text/15085.html.txt","/var/www/straped/mufon/org/15085.html"],"Log Number":"US-01232009-0013","City":"Portland/Westbrook","Date Submitted":"06/01/2004 10:30 UTC","divs":["Sighting DetailsIt was few years ago. I remember it was a warm night. It was about 10:30 p.m., the sky was very clear. The stars were shining diamonds against the cerulean blue sky. I can't remember exactly which summer month we were in, but we could not see the moon. My father, Cousin Ryan, and I were sitting on the dock enjoying the night and the calm water of Little Sebago. My Dad and i were sitting on the bench of the dock, while my cousin was laying on the dock on his side. We were sitting out their for about 10 or 15 minutes when i noticed a very unusual star. I thought it was a plane, but a plane in the sky does not look like a star, it was to far away. Then i thought OK maybe it is a satellite, but i have never seen anything like this before. It looked just like a star, but it moved over to the right, Up, Then down, up half way, to the left, and back up, then down half way and then just shoot across the sky, and covered great distance. That is when i was like OK im not crazy, i am seeing this, so i pointed it out to my cousin and my father. We were just amazed by what we were seeing, trying to pinpoint what it was or what it could be. We watched for probably about 15 or 20 minutes, maybe longer. I believe whatever we were watching was about northwest, then my dad spots another star of the same behavior directly west. This one was only moving up, down, left, right, and not shooting across the sky, but i have to tell you this is only the TIP of the ice berg... The bench on the dock is facing west. The left and front of the dock is facing open water, but to the right is the opening to the cove of the third lake of Little Sebago. At about 2 o clock of the dock across the cove is a [dam]. behind us next to the dock is a willow tree right at the opening of the cove. im not good with distance or height, but i would say the willow tree is about 35 feet tall. After noticing the second moving star, we were just baffled and utterly confused. About 5 more minutes go by and then...I heard this weird noise. Out of my 21 years on this earth, I can NOT describe this sound easily. The sound was like a small fan i suppose. I said, \"Do you hear that, that sound\" about7 seconds later, i noticed that they could hear it too, and before they could say anything there it was! It was not above the willow tree but beside it, more over the water, but right beside us! This craft was moving about 3 m.p.h! just floating in the air! going beside us so slow. I felt mesmerized totally focused. The memory that i have of that night is clear as day, but that moment, that exact moment, the memory that i have is like a dream... This thing, craft, ufo, whatever you have it was as big as a suv or van. It was rectangle. It was yellow with some wide black stripes across it diagonally. it had what looked like big black tires around it with bright lights in them. We were hypnotized by it and just speechless like we had no control of our bodies. We just watched it floating in the air, continuing with the bends of the shore, and it was gone around the bend. Then all of a sudden we just relaxed and started to breath again. Once in a life time i tell you, but there is still more to go... After regaining our sanity. we looked once more to the sky. Both stars were still there. Then we heard it. The military jets flying up into the sky. two of them. the star moving in the north west was doing the normal, but a little different this time. it was like every time it finished its routine, it powered up, But this time before it shot across the sky it got so bright i had to squint my eyes. Then it just took off. it was gone, just gone. the other one was gone as well. I wonder what the guys in the jets thought when they were forced to go back? I am not crazy, but i tell you i will not beleive your story. All the other stories out there sound like crazy people stories. Well that is how i felt for a few years untill i met a guy named jason. His story was similar, but he was in nevada. his encounter was triangle. Then this year on the history channel there was this story with the same kind of sighting like mine. I dont understand...those ufos looked like a star...They were in outerspace...they could see at least half of the world...Why would one come to visit us in windham maine of all places on little sebago lake, on our little dock? Why?"],"Case Number":"15085"}