{"Date Submitted":"01/22/2009 05:15 UTC","City":"Bensalem","Source":"MUFON","divs":["Sighting Detailsi was traveling north on 95 close to woodhaven rd, as i approached woodhaven i noticed 3 objects slightly west and north of my position. as i traveled north i noticed the objects already in close quaters starting to move very close but with little to no forward movement. they were 5 to 8 hundred feet agl and as i began to parallel to them they seemed to be the size of small aircraft from front to back. they did not have typical helicopter profiles such as a black hawk with armory with its rear rotar inclosed in the airframe but seemed to have small winglets and seemed to be delta in shape. the profile appeared to be similar to the radar reflecting shape of the stealth fighter, however i know they cannot hover or have very little forward movement. i was attempting to contact the control tower via the jet center at the airport where i had previously tied down my plane. i spoke with one of the attendents and to ad to my excetiment he had just observed the same unusual sighting where he was located on the field. i never did contact the control tower but im very interedted in what they may have had in their airspace which was directly on the left crosswind for runway 24. if you can find out anything more about this i would really appriciate a return message....... thanks mark"],"Tags":"City","trends":["There have been 10 other sightings in Bensalem","There were no other sightings in Bensalem on or around January 22nd 2009"],"Sighting Duration":"Undisclosed","Summary":"I'm a private pilot and saw 3 small hovering objects near N.E. Phila airport.","map":"<A HREF = \"http://maps.google.com/maps?q=40.107992,+-74.929278(15095)&iwloc=A&hl=en\"> mufon case (15095) map </A>","Latitude":"40.107992","Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"01/22/2009 05:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"15095","Longitude":"-74.929278","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/15095.html.txt","/var/www/straped/mufon/org/15095.html"],"Country":"United States","Object Features":"Other","Object Flight Path":"Stationary,Hovering then path","Region":"Pennsylvania","Log Number":"US-01232009-0023"}