{"map":"<A HREF = \"http://maps.google.com/maps?q=40.337528,+-75.919385(15094)&iwloc=A&hl=en\"> mufon case (15094) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI was walking my dog around 6am, and when I was walking towards the cul de sac, that has a corn field sitting beyond it, I noticed a very bright, white light. I thought it was a star or planet at first, but it was too close to the ground and bright. This light was stationary at the time. I walked down to my home and then turned back around to look at the street. There was a air craft flying, it had a triangular shape. There where 2 white lights at the back end, and I believe a blue light at the point. I was a bit surprised, but I dismissed it as perhaps just the lights were triangular and I couldn't see the space of the aircraft itself. About 2 days later, I went outside on my deck around 7pm. I was standing out there a few moments when I looked up and saw the same aircraft flying above me. I live in a very rural area and often see planes flying by, but this one was lower than most I see. This time I was able to look underneath and distinctly saw that this was a triangle shaped craft, not just had triangle lighting."],"Latitude":"40.337528","Region":"Pennsylvania","Longitude":"-75.919385","Source":"MUFON","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around January 12th 2009"],"Date Submitted":"01/12/2009 06:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Triangle, Other","files":["/var/www/straped/mufon/html2text/15094.html.txt","/var/www/straped/mufon/org/15094.html"],"Tags":"City","Disposition":"Insufficient Data","Date of the Event":"01/12/2009 06:00 UTC","Country":"United States","Viewing Distance":"Unknown","Case Number":"15094","Object Features":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-01232009-0022","Summary":"Bright white light hovering at first, then started moving, triangle shaped aircraft.","City":"Reading"}