{"map":"<A HREF = \"http://maps.google.com/maps?q=19.442348,+-99.127408(15097)&iwloc=A&hl=en\"> mufon case (15097) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsI was on a business trip to Mexico City on April 04,2008, seating on a Back seats , row 29,(I have my ticket to proof) on right side of plane , window side. While approaching Mexico City valley area , we were flying North to South about 25 minutes privious to arrival we were to land and suddently I saw a shinning metal type of shpere through the right side, and I had my camara but while attempting to get either photo or movie, it tend to disappear (like if knowing that I was to record the event), I tried to call other friends, but they were on front on first class and attendents did not let me cross walking and If i told them I did not wanted them to think me as crazy. Well, we landed and I tried to look to the window while taxing to our gate, and there it was again, over Mexico City Aiport Radar, and again I picked my camera and it vanised, on a next try I just changed from movie to photo and I thought I did not got it, but I captured, I saw how it flew in an undescriptible speed. I knew it was not an airplane or a meteorologic type of ballon. I commented the incident to my friends, that was my boss and a technical guy from the company, I told them exactly what happened and when we got to hotel, I could unload a picture and saw nothing, but while I zoomed,,,I could capture the round point! I got it, without knowing that I did. I was kind of scared, but I thought in my inner feeling that that thing knewed that I was watching it. its important to state, that that thing followed our flight and while I ovserved it over Mexico City Airport radar (you can locat it in front of Mex City Airport at Penon de los Banos hill on googl earth) it flew high over Radar area, east to west direction then stop a while that was when accidentaly I captured image without knowing exactly I did, and then vanished to the West side in an upward extreamly quick move. I compared it to videos found on Internet, and the object is similar to the other UFOs over Mexico City during the past years... I am a very fan of Astronomy and this is first time I had a view like this, I can state that I can distinguish a plane, and other objects in air, but this was a very good experience. Note: If you can download phote, you need to zoom it three or four times, try to look for a point in the upper right quadrant, to the center."],"City":"Mexico City","Case Number":"15097","Tags":"City","Object Shape":"Circle, Sphere","Source":"MUFON","Country":"Mexico","Object Features":"Unknown","Latitude":"19.442348","Region":"Distrito Federal","Longitude":"-99.127408","Object Flight Path":"Path with directional change","trends":["There have been 23 other sightings in Mexico City","There were no other sightings in Mexico City on or around April 4th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/15097.html.txt","/var/www/straped/mufon/more/15097_submitter_file1__UFOoverMexCityAirportneedtozoomphototoobservit.JPG","/var/www/straped/mufon/org/15097.html"],"Viewing Distance":"Unknown","Date of the Event":"04/04/2008 10:30 UTC","Date Submitted":"04/04/2008 10:30 UTC","Summary":"Shining metalic look small sphere type.","Weather Factors":"Unknown","Sighting Duration":"00:25:00","Log Number":"MX-01242009-0002"}