{"Log Number":"US-01242009-0007","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Fireball, Triangle","Longitude":"-94.571257","Latitude":"39.102456","Region":"Missouri","Case Number":"15102","Date Submitted":"01/17/2009 12:00 UTC","Summary":"6--8 large dark yellow/orange lights forming a triangle shape over Westport in KC around 10:00pm. Flying low but no noise.","Disposition":"Unknown","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around January 17th 2009"],"files":["/var/www/straped/mufon/html2text/15102.html.txt","/var/www/straped/mufon/org/15102.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.102456,+-94.571257(15102)&iwloc=A&hl=en\"> mufon case (15102) map </A>","City":"Kansas City","divs":["sighting detailswe were coming out of a restaurant at approx. 10:00pm and getting in the car when our 7 year old son wanted to know what the big yellow lights were in the sky. he was looking up through the sunroof of our 2nd row seats in the car. we kept saying they were just the lights of westport without looking. he was being insistant so we looked up and saw the lights. we started to drive in the car but then pulled over and got out of the car to get a better look at them because we had never seen anything like them and wanted to know what they were. i expected to hear the sounds of a helicopter or something that would help explain it but we didn't hear anything. they were flying too low and were too large to not be making any noise. they had large, dark yellow lights that were not blinking but pulsating with different colors of yellow and orange - almost like the colors in a fire and how it changes colors. i can't be sure of how many there were because of the trees and buildings surrounding us, but we saw at least 6 in the shape of a triangle. they were flying in a east\\southeast direction. two of the lights quickly went back towards the north east and went out of sight. the others kept going in the same direction and then just faded out within 1-2 seconds while they were still close to us. the other two came back still moving at the faster speed and then disappeared in the same location as where the other ones disappeared. my husband, two kids and i all witnessed this event on broadway and about 43rd street. the next day we checked to see if others reported the same thing but not find any other reports until we visited your website. our accounts of the events are slightly different but similar enough to the report on 1-18-2009 and at approximately the same time that we must have seen the same thing. my son was the only one to see it directly overhead. he said he could see the object and described it as a hexagon shape and circular shape at the same time with lines along the bottom, something sticking up diagonally on top towards the back of it and the light being at the front."],"Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"01/17/2009 12:00 UTC","Country":"United States","Tags":"City"}