{"Object Shape":"Circle, Flash, Star-like","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.755,+-105.490556(15107)&iwloc=A&hl=en\"> mufon case (15107) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"01/15/2009 03:00 UTC","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/15107.html.txt","/var/www/straped/mufon/org/15107.html"],"Date of the Event":"01/15/2009 03:00 UTC","Case Number":"15107","divs":["Sighting DetailsI work at North Antelope Rochelle Mine in Campbell County as a production tech(a coal miner). We mine above ground. I had just gotten a load of dirt and was heading the dump to dump my load. The that I was dumping on that morning was at about a 45 degree angle. I was heading east up the dump ramp when I noticed 5 to 6 lights blinking off to the east sky. It was clear that morning not a single cloud in the sky. The thing that got my attention was there was no real pattern to the lights and the where really close to each other. I have seen planes at nighttime and these where not planes the movement was to fast for a plane or helicopter. I thought it might be something on my windshield so turned mt haul truck to the south and rolled down my driver side window to make sure I was seeing what I was seeing. So with the window rolled down I stiil saw the lights off in the distance. So i procceded to call another truck driver who was behind me if he saw the lights too. But he said he did not. I backed up to the berm and dumped my load of dirt. Heading west leaving the dump I turned my truck around to the east and the lights where gone. That morning when I got home I told my wife about what I saw. I dont think she belived me. End of story or so thought. Now a week later Jan.23rd 2009 I was watching UFO Hunters a series I record on my DVR player. They had a part of that episode where thay had a new sighting for 2009. The had video footage of the sighting in Morristown New Jersey. They showed the video and I was in shock. It totally freaked me out. I yelled for my wife and told her to come here and watch this footage. I told her this what I saw on the morning of Jan. 15th. It was the same excact lights I saw on Jan. 15th. The only difference was the lights I saw where white and not red like the ones in the video. I am still in shock to see something like what I saw out at the mine and then to see the same thing cauhgt on video."],"Region":"Wyoming","Longitude":"-105.490556","Log Number":"US-01242009-0012","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Latitude":"43.755","Object Flight Path":"Other","Object Features":"Unknown","Country":"United States","Summary":"Saw someting in the early morning sky that was not normal.","trends":["There have been no other sightings in Wright","This sighting has never been favorited."],"City":"Wright"}