{"trends":["There have been 11 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around January 9th 2009","This sighting has never been favorited.",""],"Date Submitted":"01/09/2009 05:10 UTC","files":["/var/www/straped/mufon/html2text/15100.html.txt","/var/www/straped/mufon/more/15100_submitter_file1__ufoandmikey160.jpg","/var/www/straped/mufon/more/15100_submitter_file2__ufoandmikey158.jpg","/var/www/straped/mufon/more/15100_submitter_file3__ufoandmikey161.jpg","/var/www/straped/mufon/org/15100.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.957725,+-75.156149(15100)&iwloc=A&hl=en\"> mufon case (15100) map </A>","Disposition":"Unknown","Country":"United States","Log Number":"US-01242009-0005","Weather Factors":"Unknown","Summary":"Lights in a row and then pulled apart into four different pieces and kind of hung in the sky. We have pics.","Latitude":"39.957725","Region":"New Jersey","Object Features":"Unknown","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Circle","divs":["sighting detailsit was 1700 est on the night of 01\\09\\09 as i walked out the front door i noticed a strange bank of lights off in the distance. they seemed to be in a horizonal row strobing in a bright yellow and white light.i went back in the house to get my camera and told my wife \"i think i see a ufo get the camera\". when i got back out side, maybe a min. or so, the row of lights had started to separate into four sections. three of them hovered off to one side as the lone light stayed still. the main light i could see that it kind of rotated half a turn, like it was turning up on end. the other three stayed together in a triangel shape. i have pics. of the three together. the lights went from a bright yellow\\white to a yellow and red with an outline of a glowing green. this was no airplane there was no noise, although i could not tell how far away they were, but they did look big. as i took as many pics. as i could they seemed to have just dissapeared in the night sky. we thought it was over, and thats when the helicopters came flying over heading toward where we had seen the lights. the helicopters made a few passes around the marshland and that was the last we seen. the two helicopters that came over the first time, one had the lights on the other was blacked out, no lights on at all. i would like to have someone see the pics. we took and see for themselves. this was very strange and i know these lights were not from any aircraft we have flying around. they hovered in the same area and the main one appeared to just sit there as the other lights moved off. my wife and i are sure we saw a ufo and the pics. back up what i have been saying. i am not very good good at writing down what i saw, but i know what we saw was very strange and i have never seen lights like this or aircraft that could do what they were doing. my wife is going to send in her account of this night after we get some king of a reply. you would have to see the pics. and see for yourself. thanks and we will wait to here from you."],"Case Number":"15100","Date of the Event":"01/09/2009 05:10 UTC","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"Philadelphia","Longitude":"-75.156149"}