{"files":["/var/www/straped/mufon/html2text/15103.html.txt","/var/www/straped/mufon/org/15103.html"],"Country":"United States","City":"Salt Lake City","Region":"Utah","Viewing Distance":"101-500 Feet","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","Longitude":"-111.886697","Source":"MUFON","Object Features":"Dome, Unknown","Disposition":"Unknown","Date of the Event":"04/30/1973 09:00 UTC","Object Flight Path":"Stationary","Object Shape":"Circle","Log Number":"US-01242009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.762559,+-111.886697(15103)&iwloc=A&hl=en\"> mufon case (15103) map </A>","Case Number":"15103","Summary":"Round with bright white lights surrounding and shinning down, size of a large plane.","Latitude":"40.762559","divs":["Sighting DetailsI was with 4 friends sitting on the grass on top of a hill at a baseball field watching a game at a distance. It was night and dark and it just appeared out of nowhere this huge round UFO about 100 ft directly above us with lights shinning down. It was not moving just hovering. We just stared for a few minutes then got up and started running toward the exit of the park down a street because we were frightened. After a minute we all stopped and said is it still there? Lets go back to see, when we went back it was gone. This all took place in about 5-10 minutes. I was young, a teenager, so I didn't know how to report the sighting, but now I'm curious if anyone saw this UFO at the ball game since there were many people there. A couple of years later my parents saw a different sort of UFO in the Nevada desert. It was oval and the size of a football field. There were small UFOs coming out of the big UFO. They were very close too so they could see every detail. My Dad wanted to take pictures so he stopped and started to get out of the car but my mom started screaming hysterically. My Dad obeyed and sped off on the road. They have detailed drawings and wrote all the details down as soon as they got home."],"Date Submitted":"04/30/1973 09:00 UTC","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around April 30th 1973"]}