{"Object Flight Path":"Undisclosed","Sighting Duration":"00:00:20","City":"Providence","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/15105.html.txt","/var/www/straped/mufon/org/15105.html"],"Log Number":"US-01242009-0010","map":"<A HREF = \"http://maps.google.com/maps?q=41.827549,+-71.404504(15105)&iwloc=A&hl=en\"> mufon case (15105) map </A>","Latitude":"41.827549","Viewing Distance":"Unknown","Longitude":"-71.404504","Summary":"It was green iridecent in color and moved from over treetop to earth slow then fast .","Date of the Event":"01/23/2009 12:00 UTC","Date Submitted":"01/23/2009 12:00 UTC","Tags":"City","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Oval","Case Number":"15105","divs":["sighting detailsi was going to a resturant called twist on the east side of providence and as i pulled up and parked ii was facing east. it was dark (21:00 hrs) i looked up at the level of the visor in the car (no lights in car were on) and i observed above tree top level (not in front of trees) a greenish iridecent glowing thing (egg shapped). it moved slow from way above tree top level to then a fast pace then slow and vanished. it appeared to move at a 70 degree angle. it was glowing in center, appeared to move, had a strange irridecent stuff on outside area of it. it had a size of that of about a quarter of what one would see if it you looked at a full moon high in the horizon. i did not think much about this until i mentioned this to my attorny and friend that lives in jamestown. his wife observed the same thing and me. i do know exactly where i was parked last night and am going to take a picture from that vantage point in the daylight hours. i will also take a few of the spot i was parked in also. also, i do not drink, smoke nor do any drugs, nor was i on any otc or prescrition medications. please get back to me with info on what it was??? contact me via my cell phone {pid} and via email: {pid} {cms\\jat\\pid} text moved to narrative"],"trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around January 23rd 2009"],"Region":"Rhode Island","Country":"United States"}