{"Date of the Event":"01/23/2009 08:15 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.568887,+-95.282547(15111)&iwloc=A&hl=en\"> mufon case (15111) map </A>","Region":"Texas","divs":["Sighting DetailsI was in my backyard, taking out the trash. I glanced up at the sky, and noticed a dim orange light. It appeared to pulsate slightly and it seemed to be far away, maybe a mile away. I was looking west at it, and it looked like it was moving north. As I watched it, it grew brighter and flashed three times. The bright light was white closer to the center and was tinged with orange. it became dim orange again and soon drifted out of veiw behind a house. I live close to an airport so i thought it could've been an airplane, but airplanes have several lights that stay on or flash and I saw one light only. I went back into my house to tell my family what I saw. they were skeptical. I went back outside and saw it again, and it appeared to be a good distance away from where I saw it last, maybe a mile. It moved in the same direction as it did before,but did not flash like it did previously. I watched it until it was out of veiw again. it came back, dim at first, flashing like it did the first time, dimming again. it followed the same path and i lost sight of it again behind a house. I stayed outside for a while, but it didn't come back."],"Weather Factors":"None","Summary":"Dim red light moving horizontally flashed bright a few times, went dim, dissaped, reappeared in different part of sky.","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unknown","Source":"MUFON","Latitude":"29.568887","Object Shape":"Flash, Star-like","Case Number":"15111","Sighting Duration":"Undisclosed","Log Number":"US-01242009-0015","Object Features":"None","Date Submitted":"01/23/2009 08:15 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/15111.html.txt","/var/www/straped/mufon/org/15111.html"],"City":"Pearland","trends":["There have been 5 other sightings in Pearland","There were no other sightings in Pearland on or around January 23rd 2009"],"Longitude":"-95.282547"}