{"Source":"MUFON","Sighting Duration":"00:04:00","Region":"England","Disposition":"Unresolved","Tags":"City","Case Number":"15120","Object Shape":"Egg, Other","Date of the Event":"01/24/2009 10:00 UTC","Object Flight Path":"Straight-line path","Summary":"Bright orange light at distance, resembling a jellyfish when overhead.","Weather Factors":"Windy","Viewing Distance":"Unknown","Date Submitted":"01/24/2009 10:00 UTC","Longitude":"1.401661","City":"Deal","Log Number":"GB-01252009-0002","divs":["Sighting DetailsMy girlfriend and I were in the upstairs bedroom of her house in Deal, Kent, UK. We decided to smoke a cigarette, as we have children to consider we smoke by an open window. After the first few puffs I noticed what i thought was a very bright orange star very low in the sky, such that it was slightly obscured by a tree in the foreground. I pointed it out to my girlfriend, who also saw, then commented on the fact that it was moving up in the sky. We watched it and dicussed the fact that it didnt look like a jet or a star (we could see and hear a jet in the sky to the right of the object, identifyable by red and green nav lights and white strobe). The object moved swiftly and in a perfectly smooth and straight path that appeared to be an upwards direction in the sky, until we realised it was getting larger. It proceded to pass directly overhead, at which point we could make out its shape slightly better. My girlfriend descibes it best as the fatter half of an egg at the leading edge with an orange aura, the back half was slightly unclear, and kind of looked like tentacles streaming behind it (Trying to put some proportion to it - If the half egg shape part of the object was an inch long, the streaming tenticle part was also an inch). As the object went directly over head, we raced downstairs and out of the front door to observe from the front of the house as it passed over (I'd like to note that it was completely silent, we could hear and see a passenger jet in the distance at the time, but this thing was eerily silent). It continued at a constant speed towards the town of Ramsgate, so in roughly a north easterly direction, it then gradually faded and disappeared as it went into the distance. In terms of altitude, its very hard to tell without knowing the size of the object, however there was what i assume was a passenger jet in the sky at the time. The jet was heading away from the UK so would have been in the climb. The object was certainly lower than that, deffinitely < 40,000ft. My girlfriend compared it's altitude to light aircraft that ofter fly over her house, so I'm guessing thats around 8000ft. I'm an aircraft engineer in the Royal Airforce, I've worked on Chinook and Puma helicopters, C-17 transport aircraft, and currently i work on Tornado aircraft. In my 11 years of working in aviation I have never seen anything like this, including during operations in Iraq and Afghanistan (that got me to thinking, and the colour of the craft reminds me now of the orange flames of the oil pipelines in Iraq). Thoughts and feelings: During the sighting i would say disbelief. My mind was working overtime on finding an explaination, nothing i know of fits. I discussed with my girlfriend all possibilities i could think of. I didnt feel afraid at all, I was busy trying to find a rational explaination in my mind. I'm somewhat sceptical about visitors due to the physics behind travel, however I do feel that other life forms are existant away from Earth. At the altitude im estimating, the object was moving at similar speed to the jets that fly around my place at RAF Marham in Norfolk, but completely silently. I'm kicking myself at the moment as I had a camcorder sitting on the bed behind me, but it had no film in it! My phone memory was full and wouldnt let me take video of photographs. I travel back to Norfolk tomorrow, when i get back and on to my computer (on a crappy laptop at the moment)I will sketch a picture and send it on to you, if you would be interested of course. Also interestingly, I noticed a report of an orange object in Norway, a few hours after my sighting in the UK. This is pretty much the direction of travel my girlfriend and I agreed it was travelling."],"files":["/var/www/straped/mufon/html2text/15120.html.txt","/var/www/straped/mufon/org/15120.html"],"Object Features":"Appendage(s)","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=51.222491,+1.401661(15120)&iwloc=A&hl=en\"> mufon case (15120) map </A>","trends":["There have been no other sightings in Deal","This sighting has never been favorited."],"Latitude":"51.222491"}