{"City":"Levittown","divs":["Sighting DetailsIt was the last saturday night in February of 1979 at about 10:30pm and to this day it was the strangest thing that I've ever seen or has ever happened to me. I was driving from levittown to trenton NJ traveling north on Rt 13 with my sister we were on our way to meet up with a cousin we had planned on going out for some saturday night fun. Three UFO's (Bright Green luminous Orbs)were flying in triangular formation from the direction of southwest to northeast. They were very large orbs and with no sound at all, at a very slow speed about 500 ft above the ground. Together they suddenly had a burst of speed and then vanished into a lake that I had been riding along side of. I was friegtend but in my amazement I had pulled over to watch and see just what was going on.I knew that this was some sort of alien encounter and I needed to understand more. My sister was very friegtend and was pleading that we leave there immediatly. After the orbs vanished into the lake all was quiet and normal in the lake and then after about a little more than a minute these three pillars of huge lightening type green sparks emerged verticaly from the lake and rose into the sky probably up to another 500 ft or more then as with the speed of light or a (warp speed)the three pillars of sparks traveled in the direction of southwest which is the same direction they came from. If I blinked I would have missed it the speed was that fast. faster than anything of this world. I probably may have dismissed it as some sort of imaginary figmentation but my sister was with me, she was very afraid and she did not want me to stop but she was there and saw it too. Now I'm not saying that I saw little green men but I did see 3 big green silent orbs darting to and fro and hovering in the sky just above my head. Afterward I called the police, I called the newspaper, I called the local radio station to ask if anyone reported what I had seen but the response was the same by all three it was \"NO\" ...No one reported or saw anything. To this day I am still baffeld,amazed,and wondering. I'm glad to have had the chance to witness this extraordinary event, it was truly a once in a lifetime experience and it has opened up my mind to the possibilities or even realities of alien worlds. I am convinced that whatever it is that I saw that night February 24th 1979 Definately was NOT of This World."],"Tags":"City","Log Number":"US-01252009-0003","files":["/var/www/straped/mufon/html2text/15121.html.txt","/var/www/straped/mufon/more/15121_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/15121_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/15121_submitter_file3__ufo2-24-79._15121.JPG","/var/www/straped/mufon/org/15121.html"],"Sighting Duration":"00:10:00","Summary":"3 luminous green orbs silent moving SW to NE / vanish then flash.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Latitude":"40.15755","Weather Factors":"Unknown","Source":"MUFON","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around February 24th 1979","This sighting has never been favorited.",""],"Region":"Pennsylvania","Date Submitted":"02/24/1979 10:30 UTC","Case Number":"15121","Object Shape":"Flash, Oval, Sphere","Date of the Event":"02/24/1979 10:30 UTC","Longitude":"-74.825575","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.15755,+-74.825575(15121)&iwloc=A&hl=en\"> mufon case (15121) map </A>","Country":"United States","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}