{"Summary":"Multiple spheres playing hide-and-seek in the clouds.","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","trends":["There have been 28 other sightings in Santa Cruz","There were no other sightings in Santa Cruz on or around November 4th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Other","Object Features":"None","Longitude":"-122.028816","Date of the Event":"11/04/2007 10:13 UTC","Latitude":"36.978417","files":["/var/www/straped/mufon/html2text/15123.html.txt","/var/www/straped/mufon/more/15123_submitter_file1__dsc_1512_all.jpg","/var/www/straped/mufon/more/15123_submitter_file2__dsc_1513_all.jpg","/var/www/straped/mufon/more/15123_submitter_file3__dsc_1514_all.jpg","/var/www/straped/mufon/org/15123.html"],"Weather Factors":"Unknown","Log Number":"US-01252009-0005","Date Submitted":"11/04/2007 10:13 UTC","City":"Santa Cruz","Case Number":"15123","divs":["Sighting DetailsHere are the best of about 10 photos I took with my Nikon D-70 Digital SLR from my backyard. After several exposures in auto-mode (which focused on the clouds only), I switched the camera to manual and could see the objects more clearly. (three included photos) This is the leading-edge of a storm front that was coming. Cloud ceiling was about one kilometer. As I watched the clouds getting nearer, I noticed a bunch of white spheres flittering about, in and out of the leading edge of the clouds. I ran into the house and grabbed my camera which is equipped with a 70-300mm telephoto lens and captured these images. The orbs were at different altitudes and traveling at different speeds, making impossible maneuvers for any conventional aircraft to accomplish. They were lining-up in front of the cloud's edge before getting a \"running start\" when entering the clouds, gaining speed very fast in a short distance. Then emerge slowly through the top of the clouds and back over the front edge. And then go through the process again. I observed this for about 5 minutes and then they entered the clouds and didn't emerge. Altitude was much to high for our seagulls and I can distinguish birds from animate objects. These were definitely round and didn't have wings. Judging from the altitude, I would guess their size to be between 2-3 meters in diameter."],"Region":"California","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.978417,+-122.028816(15123)&iwloc=A&hl=en\"> mufon case (15123) map </A>","Object Shape":"Sphere","Country":"United States"}