{"Case Number":"15136","City":"Cedar Key","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Cedar Key","There were no other sightings in Cedar Key on or around November 30th 1977"],"divs":["Sighting Detailsmy son dad had picked up for a visit and my aunt uncle three cousins and my daughter and i decided to go to cedar key fl for dinner. we took the short cut across country my uncle knew instead of the long way down us.19 from chiefland fl. to cedar key. the trip there was uneventful and we were all in good spirits. we had dinner and were on our way back home. the sun had gone down while we had dinner, it was approximately 830 to 930 when we finally finished dinner and got back to the car. every one was enjoying themselves. on our way home we were joking around and suddenly the lights on the dash of the car blinked out and the engine of the car stopped. my uncle was perplexed as to what had happoned, you see he is a machanic and took very good care of his car. it seemed as suddenly as the lights and the engine had gone off they came back on again. i jokingly told my aunt that this is what happoned when you had an encounter with aliens. your car lights go off and the engine stops. she replied \" dont say that\" we continued on home. at the time it seemed we had returned in a timely fashon. but over the years i began to realize that instead there was a possability that we had returned maybe an hour later than we were supposed to.( missing time, I'm not sure) but it did register that we should have returned at least an hour earlier than we did. no one mentioned it and neither did i. but it has always stuck in the back of my mind. we got home and did not even turn on the tv, we all got ready and went to bed after saying our goodnights. as we had to be at work the next morning. i drove a silage truck and my uncle was a machanic on the same job, we rode back and forth to work together. no one seemed to have any adverse effects, from the incident. only good memories of going out to dinner and having a good time.."],"Sighting Duration":"Undisclosed","Date of the Event":"11/30/1977 12:00 UTC","Region":"Florida","Date Submitted":"11/30/1977 12:00 UTC","Source":"MUFON","Disposition":"Insufficient Data","Tags":"City","Summary":"The car lights engine suddenly shut off , and then started up again as mysteriously as it had shut off.","Weather Factors":"Unknown","Log Number":"US-01262009-0004","files":["/var/www/straped/mufon/html2text/15136.html.txt","/var/www/straped/mufon/org/15136.html"],"Latitude":"29.138578","Object Shape":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.138578,+-83.035121(15136)&iwloc=A&hl=en\"> mufon case (15136) map </A>","Viewing Distance":"Unknown","Longitude":"-83.035121"}