{"Summary":"Very bright light in the west horizon.","files":["/var/www/straped/mufon/html2text/15130.html.txt","/var/www/straped/mufon/more/15130_submitter_file1__elvadonight1-16-09005.jpg","/var/www/straped/mufon/more/15130_submitter_file2__AlienFace1-16-09.JPG","/var/www/straped/mufon/more/15130_submitter_file2__AlienFace1-16-09.JPG.1","/var/www/straped/mufon/org/15130.html"],"Case Number":"15130","Object Flight Path":"Stationary","City":"Chama","Date of the Event":"01/16/2009 08:20 UTC","Source":"MUFON","Weather Factors":"Unknown","Object Features":"Undisclosed","Log Number":"US-01252009-0012","Viewing Distance":"Unknown","Country":"United States","Latitude":"36.903068","Tags":"City","Disposition":"Insufficient Data","Longitude":"-106.579479","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.903068,+-106.579479(15130)&iwloc=A&hl=en\"> mufon case (15130) map </A>","divs":["sighting detailsmy husband told me to look out the window at the satalite. i looked and said no its a star. the time was 7pm we joked back and for about an hour and i then dressed in my winter gear to go outside and take a photo of it. he joked and said it's a ufo and they have come to get you. i said ya right. i used a canon mark 3, twenty one megapixel camera on a tripod to taken this shot. i did not take this serious at all. i sat outside in complete darkness outside for about thirty minutes. i took two photos of the bright light and the remainder of my photos of the night sky. by the time i finished taking photos the bright light was gone. i downloaded my photos the next day. i zoomed into the bright light to see it and i saw a face of an alien being right next to the bright light. pretty scary. the bright light is not a star but something else. it look like it has three diminsions. the colors around it are orange-red and yellow\\gold. two black rays are radiating from both top and bottom. there no was sound comming from this area and this bright light seemed to stay in place for at least an hour and twenty minutes."],"Region":"New Mexico","Object Shape":"Star-like","Date Submitted":"01/16/2009 08:20 UTC","trends":["There have been 2 other sightings in Chama","There were no other sightings in Chama on or around January 16th 2009","This sighting has never been favorited.",""]}