{"files":["/var/www/straped/mufon/html2text/1513.html.txt","/var/www/straped/mufon/org/1513.html"],"Case Number":"1513","trends":["There have been 18 other sightings in Ann Arbor","There were no other sightings in Ann Arbor on or around October 31st 1969"],"Tags":"City","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Longitude":"-83.738038","Object Flight Path":"Stationary","Latitude":"42.290026","Source":"MUFON","Summary":"CE3-Saucer Shaped Object seen in Ann Arbor","Country":"United States","Date Submitted":"10/31/1969 11:00 UTC","Sighting Duration":"00:00:59","Object Features":"Window(s)","City":"Ann Arbor","map":"<A HREF = \"http://maps.google.com/maps?q=42.290026,+-83.738038(1513)&iwloc=A&hl=en\"> mufon case (1513) map </A>","divs":["Sighting DetailsWitness 1 Narrative - My wife and I had just left a concert at Chrysler Arenaand were pulling on the expressway when we sighted the object. I recall seeinga bright clear area in the center of the object where the figures were standingand also a light above the object. There were also two or three colored lightscoming from the lower portion of the object. There was some movement of thefigures on the craft. Suddenly it vanished from sight.Witness 2 narrative - It was a clear, cold November night and we had justentered the expressway (US 23) from Ann Arbor, Michigan to return to Toledo,Ohio. I think it was about 11:00 pm. I dont know what made me look up, butthrough the front windshield we, my husband and I, could see a saucer-shapedobject. It wasnt very high up and directly in front of us. There was a row ofwindows around the middle which seemed to be lighted from the inside. Thesaucer never seemed to move, even though we were moving, but stayed the samedistance from the car. As we watched, three figures came forward from somewherein the back, and appeared to look out the row of windows. Then the object wasgone. We didnt see it leave, it just disappeared."],"Object Shape":"Unknown","Weather Factors":"Unknown","Log Number":"","Region":"Michigan","Date of the Event":"10/31/1969 11:00 UTC"}