{"Latitude":"40.131772","Weather Factors":"Unknown","Country":"United States","Date of the Event":"01/21/2009 10:07 UTC","files":["/var/www/straped/mufon/html2text/15139.html.txt","/var/www/straped/mufon/org/15139.html"],"Longitude":"-75.459632","Object Shape":"Diamond, Star-like","Viewing Distance":"Unknown","City":"Oaks","Object Flight Path":"Undisclosed","Date Submitted":"01/21/2009 10:07 UTC","Log Number":"US-01262009-0007","divs":["Sighting DetailsI was driving home from a Flyers game heading west on Rt. 422 just past the Trooper Rd. exit and before the Oaks exit on the straight part before \"St. Gabe's Curve\" at approximately 10:07 pm with my 14 year old daughter. The sky was clear and ahead of me in the sky was this very bright, LOW, pulsating or flickering object. At first I thought it was the front headlights of a plane, but it was WAY lower and brighter than anything else in the sky including other planes and lower than I have ever seen a plane at night in that area. After a few seconds, I realized that it didn't seem to be moving like a plane and that I couldn't see the \"plane's\" red or green colored wing lights which I would have seen if it had been heading to Phila. airport. So I said outloud to my daughter, \"is that a really bright star ahead of us?\". Since I was driving, and there were cars ahead of us I needed to focus on the road and only occasionally glance up. I asked her to look at it as we were approaching the \"St. Gabe's curve\" and the object would be closest to us out my driver's window to the left at that point. It seemed rather stationary and it was hard to judge the distance away that it was in the sky or what town it was directly over. The closer that we came to it, it appeared to me to be sort of diamond shaped and pulsating or blinking continuously. I think some of the cars ahead of me saw it too as they put on their brakes and slowed down for no other reason such as a deer crossing or road hazard. My daughter told me that it looked like it had a smaller more faint light on the side of it, but that all of the lights were a golden color, not white. She thought it was the space station. I have seen the space station pass by at night and I knew that this was not the space station as it didn't move and it was MUCH bigger. We continued on our way home, with the light eventually getting behind us and out of our line of vision.. I can't get the vision of it out of my head. I am convinced that I saw a UFO. Since that night, I heard on the radio and tv the day after my sighting, that there have been a higher than usual number of sightings in the county just north of me (Bucks) and I started to feel like I wasn't crazy. Then I saw the video of the strange object over the inauguration ceremony and I wondered if that had anything to do with what I saw. I sent in a post to the Philly Examiner as I read online at that site that the night before in Silverdale, PA someone took a picture of what looked an awful lot like what I saw. I kick myself for not pulling over and taking a picture of what I saw as I did have my camera with me since we were coming from the game. I hope someone can validate for me just what it was that I saw."],"trends":["There have been 3 other sightings in Oaks","There were no other sightings in Oaks on or around January 21st 2009"],"Case Number":"15139","Source":"MUFON","Region":"Pennsylvania","Disposition":"Unknown","Tags":"City","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.131772,+-75.459632(15139)&iwloc=A&hl=en\"> mufon case (15139) map </A>","Object Features":"Undisclosed","Summary":"A large, bright, pulsating light was seen at a very low altitude."}