{"files":["/var/www/straped/mufon/html2text/15134.html.txt","/var/www/straped/mufon/org/15134.html"],"Object Shape":"Other, Unknown","Latitude":"40.57629","map":"<A HREF = \"http://maps.google.com/maps?q=40.57629,+-111.854962(15134)&iwloc=A&hl=en\"> mufon case (15134) map </A>","Country":"United States","Longitude":"-111.854962","trends":["There have been 13 other sightings in Sandy","There were no other sightings in Sandy on or around January 7th 2009"],"Log Number":"US-01262009-0002","Summary":"Moon disappears, reappears and disappears again. Not an eclipse.","divs":["Sighting DetailsImmediately after this happened I wrote this account of the event: --- At about 3:45 AM on January 7th 2009 I went out my back door to smoke. I admired how bright the moon was. As I watched the moon I realized that it was an odd shape. It became clear that the moon was being covered in part by a sharply defined very black area. No light whatsoever appeared from behind this area. The moon grew smaller and smaller until it completely disappeared. It seemed very bizarre that such a bright moon had vanished completely. There were still a few thin horizontal clouds that were illuminated. Then the moon began to emerge from the bottom of the black area again, visible only where it intersected with the illuminated cloud. I could see that the moon was also disappearing behind another black patch directly below the first. I grabbed my camera and took several pictures until such time as the moon completely disappeared again behind this second black patch. This had happened by about 4:00 AM. Shortly after the horizontal clouds dissipated and the moon did not return again. There is a mountain in this area, but the moon disappeared twice in an area of the sky much higher than this mountain. I will take a picture from the same angle when the sun comes up to illustrate where the mountain ridge actually is from this perspective. - 4:24 AM January 7th 2009 --- The pictures I took of this have already been forwarded to Mr. Jones of Mufon in Utah."],"City":"Sandy","Weather Factors":"Unknown","Date Submitted":"01/07/2009 03:45 UTC","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"01/07/2009 03:45 UTC","Region":"Utah","Object Features":"Unknown","Disposition":"IFO","Tags":"City","Source":"MUFON","Case Number":"15134"}