{"Object Flight Path":"Stationary","Summary":"Hovering, star with blinking lights.","Log Number":"US-01262009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=39.961465,+-75.160329(15138)&iwloc=A&hl=en\"> mufon case (15138) map </A>","Object Shape":"Star-like","Date of the Event":"01/25/2009 11:30 UTC","Country":"United States","Disposition":"IFO","Date Submitted":"01/25/2009 11:30 UTC","City":"Philadelphia","Latitude":"39.961465","Weather Factors":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There was one other sighting in Philadelphia on or around January 25th 2009"],"Tags":"City","Region":"Pennsylvania","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsI've seen a similar object several times over the past year or so in the same general area while I'm at home and usually after I've turned off the TV and gone upstairs to go to bed. It's always been later in the evening that I've noticed the strange, hovering lights. Because of the recent news of sightings in Bucks County, PA (which is the next county over), I looked at the sky again last night which was mostly clear. In the distance was something that looked like a star at first glance, but it didn't stay still like a star, it sort of stayed steady, but then would drop a bit or move around a bit, but not much. It also seemed to have colored blinking lights. It seems to stay in the same place for a long time and I'm usually so tired I go to bed without investigating farther. I can't tell if it's close or far, but I do know that it's about the size of a brighter star from my vantage point. I've seen this before on many occasions. I even hold my head steady on the window so that my eyes aren't fooling me with a perceived motion of the object. I need to get a video camera ready with a tripod (but then my husband would think I'm crazy!). I am curious to know if anyone else is seeing this in our area and if anyone else can take a look. Like I said, I see it often, but I'm not really into these kinds of things so I ignore it and put it out of my mind. What's strange is I've seen it so often and usually in approximately the same place. The movement of it really has me concerned. I don't remember how I first noticed it because it's been a while - maybe when I let the dogs out at night I may have thought it strange because it wasn't moving like a plane."],"Longitude":"-75.160329","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"15138","files":["/var/www/straped/mufon/html2text/15138.html.txt","/var/www/straped/mufon/org/15138.html"]}