{"Summary":"Roaring rocket like grey metallic flying object came out of nowhere, hovered, clicked and left very quickly. Flashing lights accompanied aircraft on either side but stayed high in the sky.","Source":"MUFON","Date of the Event":"07/18/1946 12:00 UTC","Log Number":"US-01262009-0010","Viewing Distance":"101-500 Feet","Latitude":"43.037006","Longitude":"-75.725519","Weather Factors":"Unknown","divs":["Sighting DetailsIt was a bright summer mid day and I was playing in my yard, in a very rural, country area in NY about fifty miles north of NYC. I was about ten years old. All of a sudden I heard a very loud roar coming from the sky. I looked up and saw flashing lights that were moving on either side of what I at first presumed to be an airplane. The flashing lights, (about six to eight separate shapes on each side), stayed higher in the sky than the flying object. The spaceship, (I'll call it that), came closer to the ground and to me. The noise was so loud I couldn't believe my mother didn't come running out of the house to see what was going on! When the spaceship got directly over me it came down so low I fell to the ground. It was gun metal grey and shaped very much like a rocket. It had a band or a wide piece of metal with holes in it, around the middle that turned and went click with each turn. I had the very clear impression that it was taking pictures of me. It hovered over me as this was going on and it didn't move. Then with a whoosh it took off and just disappeared it a matter of seconds over the hill. I just lay on the grass stunned for a minute or so trying to figure out what I had seen. I ran in the house and told my mom I just saw a very strange airplane that didn't have any wings, that it came down very low and was very loud. My mom was busy canning tomatoes and told me she heard it but she didn't have time for me and told me to go back out and play. It wasn't until I got older and heard about UFO sightings that I finally realized what I had seen. It scared me then and it scares me now because I have believed all of my life that \"they\" have pictures of me. I am now seventy two years old and I would love to see some sort of resolution. So many sightings, so much written and catalogued. I would like to know what have we seen? Have we really had visitors from other solar systems? Will we ever know? I would like to know before I die. This is the first time I have reported this sighting, but I remember it as if it happened yesterday."],"Case Number":"15142","files":["/var/www/straped/mufon/html2text/15142.html.txt","/var/www/straped/mufon/org/15142.html"],"trends":["There have been no other sightings in Lincoln","This sighting has never been favorited."],"Disposition":"Unknown","City":"Lincoln","Tags":"City","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=43.037006,+-75.725519(15142)&iwloc=A&hl=en\"> mufon case (15142) map </A>","Date Submitted":"07/18/1946 12:00 UTC","Object Shape":"Bullet, Missile","Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"12:00:00","Country":"United States","Object Features":"Patterned Surface, Other"}