{"City":"Corpus Christi","Summary":"Flashing white light bobbing up and down and sideways....lights strobing.","Object Features":"Unknown","divs":["Sighting DetailsMy wife and I were out walking our dogs for the evening I was looking at the sky as I always do, when I noticed a light blinking at about 30 to 40 degrees above the horizion. I stoped and fixed my vision on it to watch for movement, it seemed to stay in one place as if hovering bobbing up and down and sideways, in a few moments my wife came up beside me and we watched it togather. She returned the dogs back home and came back in about 10 min. she stated that she could not see it until she was standing where I was, we moved from side to side and noticed that when we moved a few feet side to side we couldn't see it. We watched it for about an hour and at that time I decided to phone the police, 2 officers came out and said that they were going to look to see if they could findout what it was. The night was overcast so I've ruled out a star.....We do have a Naval air station it's for flight training and they don't go out on Sundays. I went out this evening and it is there again same place so I'm a little bit puzzled by this none the less I again contacted the police, the officer that came out stated that the to officers that came out on the 25 and wittnessed this couldn't fine anything. Thankyou and please if you have any questions contact me."],"Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=27.807263,+-97.391361(15148)&iwloc=A&hl=en\"> mufon case (15148) map </A>","Country":"United States","Longitude":"-97.391361","Log Number":"US-01272009-0002","Viewing Distance":"Unknown","Date Submitted":"01/25/2009 10:50 UTC","Date of the Event":"01/25/2009 10:50 UTC","Weather Factors":"Unknown","Case Number":"15148","files":["/var/www/straped/mufon/html2text/15148.html.txt","/var/www/straped/mufon/org/15148.html"],"Source":"MUFON","trends":["There have been 26 other sightings in Corpus Christi","There were no other sightings in Corpus Christi on or around January 25th 2009"],"Latitude":"27.807263","Disposition":"IFO","Object Flight Path":"Stationary","Tags":"City","Sighting Duration":"03:00:00","Object Shape":"Sphere"}