{"Object Features":"Undisclosed","Tags":"City","Date of the Event":"06/30/1964 02:30 UTC","Summary":"I was laying in bed with my husband, and witnessed something in the shape of a sort of spider, on a tripod.","Sighting Duration":"Undisclosed","Object Shape":"Other","Region":"Massachusetts","divs":["sighting detailsi was laying in bed with my husband, and witnessed something in the shape of a sort of spider, on a tripod. it was after i got done watching tv around 2:30am est, and i went to bed in our upstairs bedroom. as i got into bed, as soon as i shut my eyes, i heard my cat jumping at the door to come back in for the night. upon opening my eyes, i saw this thing, hovering in the air, at the foot of our bed. it was black in color,with an oval shaped body,and billowy legs. it was attached to a black tripod, that was circular at the base. it measured approximately 2 to 2 1\\2 feet in width, and 2 to 2 1\\2 feet tall. i could see it quite clearly because my daughter slept with her ceiling light on , and the light from her room shown into our room, and made it quite visible. i just layed there in shock, i couldn't move. my eyes stayed fixed on it, till finally it started gliding across the length of our bed very slowly. then it went thru the wall that the head of our bed was against. as it was going thru the wall, i could see it until the very tips of its legs were gone. my heart was pounding so hard, i thought it was going to beat thru my chest, yet i couldn't move until it was gone. i proceeded to get up to let the cat in, then i quickly got back into bed, and pulled the blankets up over my head. the next morning, i told my husband and other people about what happened to me that previous nite. they all laughed at me, and they insisted that i must have been dreaming. but i know what i saw, andi know that i was wide awake when this all happened. it took me 45 years to get the courage to tell my story again, because of all the ridicule i faced the first time i told it. what i'm looking for now is to find another person who might have seen this thing."],"Weather Factors":"Unknown","Longitude":"-71.802296","Source":"MUFON","City":"Fitchburg","Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-01262009-0009","files":["/var/www/straped/mufon/html2text/15141.html.txt","/var/www/straped/mufon/org/15141.html"],"Latitude":"42.583423","map":"<A HREF = \"http://maps.google.com/maps?q=42.583423,+-71.802296(15141)&iwloc=A&hl=en\"> mufon case (15141) map </A>","Case Number":"15141","trends":["There have been 8 other sightings in Fitchburg","There were no other sightings in Fitchburg on or around June 30th 1964"],"Viewing Distance":"Unknown","Date Submitted":"06/30/1964 02:30 UTC","Disposition":"IFO"}