{"Latitude":"42.894557","Object Flight Path":"Undisclosed","Object Shape":"Circle","City":"Buffalo","Longitude":"-78.868919","Country":"United States","Region":"New York","Date of the Event":"01/26/2009 09:05 UTC","Date Submitted":"01/26/2009 09:05 UTC","files":["/var/www/straped/mufon/html2text/15145.html.txt","/var/www/straped/mufon/org/15145.html"],"Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"00:05:00","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around January 26th 2009"],"Case Number":"15145","divs":["Sighting Detailswent out for a smoke. saw small plane rise through the clouds.(could tell itwas plane by it's lights) could also hear propeller. as the plane went out of sight icould see this redish ball of pulsating light come right under ware the plane went into the clouds. as the sound of plane faded the redish ball(that i 1st thought was another plane) did NOT have any sound at all. it started to turn in the direction of plane. than i thaught the plane must of just missed this ball.after i realised what i just saw i homed in on red flashing ball closer. they we'r too close to each other. lost plane lights in clouds but red ball was at cloud celeing and just\"floating about\" no stright lines, no set altatuide.objet then moving faster to the east northeast getting faster until it stopped pulsing and was gone. it was no star,plane,metor,swamp gas,reflection two weeks ago two C-130s northbound to niagra falls we'r over flying a simaler object. the'r were alot of jets around that night and this object and it was as big as C-130s i could hear the turboprops racing to cover object. hope you all the best. good luck Mr. D. buffalo ny"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.894557,+-78.868919(15145)&iwloc=A&hl=en\"> mufon case (15145) map </A>","Weather Factors":"Unknown","Summary":"Redish ball , w/odd blinking light. NOT an airplane!","Disposition":"Insufficient Data","Tags":"City","Log Number":"US-01262009-0013"}