{"Log Number":"US-01262009-0014","Object Flight Path":"Hovering then path","Region":"Montana","Tags":"City","Date Submitted":"11/29/2008 08:00 UTC","Date of the Event":"11/29/2008 08:00 UTC","trends":["There have been no other sightings in Red Lodge","This sighting has never been favorited."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/15146.html.txt","/var/www/straped/mufon/org/15146.html"],"divs":["sighting detailsi was looking at the stars and in front of me in the night sky was a bright light bigger than a star or planet that really twinkled a lot. too much for a star. i thought it was maybe a plane at first beacuase i could see red and blue lights. but it didn't move steadly across the sky like a plane would. it moved somewhat slowly, very little distance up and down. i got my binocualrs to see it better and there definetly was a red light on the left and the right side seemed to turn-there was a blue lght but it looked like it might be longer-cylindar in shape and there seemed to be four blue lights in a row but it was difficult to tell for sure. i watched it for 10-15 minutes and then went to the bathroom. i had been looking at it from sliding glass doors and when i came back it had moved to the right the distance of the width of one of the doors-3 feet. i watched it some more and it slowly would move more to the right. eventually it started to appear smaller. there were no clouds to obscure it. as i watched it kept getting smaller, like it was moving farther away and then disappeared. it looked just like the pictures on the ufo hunters show of the bright lights with colored lights. exactly like that. there might have been another one to the left of that one but i wasn't really watching that. there is no doubt that it was a ufo to me. i live out in the country and not a lot around so the nights are very clear and you can see the stars clearly and this wasn't a star. stars don't move three feet in a matter of a few minutes. also, on july 4, 1976 in boise idaho a friend and i saw three lights in a triangle shape that moved in unison. they looked like they would come closer and then back away-also moved sideways. i have heard that idaho seems to have a lot of ufo sightings\\esperiences."],"Summary":"Bright light in the sky at night. Twinkled too much for a star. Red light on left and blue on right. Moved around slowly then 3 feet quickly.","Disposition":"Unknown","City":"Red Lodge","Country":"United States","Weather Factors":"Unknown","Latitude":"45.185778","Case Number":"15146","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=45.185778,+-109.246821(15146)&iwloc=A&hl=en\"> mufon case (15146) map </A>","Longitude":"-109.246821","Object Features":"Unknown","Source":"MUFON","Sighting Duration":"00:25:00"}