{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.690137,+-73.856609(15155)&iwloc=A&hl=en\"> mufon case (15155) map </A>","Case Number":"15155","Sighting Duration":"Undisclosed","Log Number":"US-01272009-0009","Weather Factors":"Unknown","Region":"New York","Object Features":"Undisclosed","Summary":"Object unknown.","Date Submitted":"01/26/2009 03:05 UTC","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 26th 2009"],"Date of the Event":"01/26/2009 03:05 UTC","Source":"MUFON","Country":"United States","Disposition":"IFO","divs":["Sighting DetailsAt about 3 pm I walked outside to smoke a cigarette and happened to be looking towards some appartment houses and I noticed an undefined blimp like object with undefined shapes. It was extremly shiny metal object with a part black rounded undefined side or rear. The object came down on a low angle of descent with no noise and disappeared behind some homes. The weathet conditions were sunny with some very thin cirrus clouds. I tourned and walked the other way and tought it was just some balloon. Then I tought that has to be a big balloon, relative to the distance and size of the object. I turned again and to my supprise the object started to lift slowly from behind the homes. I knew then that since the object came down then after 30-45 seconds it was lifting up straight at increasing speed and since it was slightly windy it did not deviate from it's trajectory it could not have been a baloon or small blimp. as the object was ascending it kept increasing in speed actually going beyond a thin cloud, then when the clod moved the object was a little shiny spec in the sky untill it disappeared. No noise of any sort was noticed from the object, no noticeble lights were seen, no shaking from the object was noticed and no course changes. The descend and ascent were dea center perfect! I do not know what this object was and I checked for any other reports in the area with the local police and nothing was reported. I was wondering if you could shed some light on this phenomena, I do not think it was any known aircraft or blimp or ballons they just do not land and go straight up again at incredible speed. We are not close to any weather stations or labs or governament installations that I know of. Thank you. Jerry"],"Object Flight Path":"Undisclosed","City":"New York","files":["/var/www/straped/mufon/html2text/15155.html.txt","/var/www/straped/mufon/org/15155.html"],"Tags":"City","Object Shape":"Blimp, Unknown","Latitude":"40.690137","Longitude":"-73.856609"}