{"Date Submitted":"01/09/2009 08:30 UTC","Summary":"Passed over our car, dropping fast; bright light went out suddenly.","divs":["Sighting DetailsWe were traveling south on Rte 422 from Oaks to King of Prussia area when what we thought was an airplane (but no \"normal\" airplane lights like they are supposed to have)about to crass crossed over head of our car, low, quiet, with one very bright white light shining. It angled down towards the ground like going to land. I could just see the outline (teardrop shaped) of the top of the vessel. My husband was watching it also, I was driving but could not help but notice it and watch it. It passed over our head, dipped at an angle towards the ground, then just disappeared from our sight. We both saw the light go out, but no noise, no crash, no thud,no fire, no lights come back out, and just like that it disappeared into the dark night sky. It was around what the call \"St Gabe's curve\" on Route 422, because there is a \"Saint Gabriel's boy's school\" there right off 422. We drove around that area the next day but there are many fields and private areas and no evidence could be seen to us from driving around in our car. There were other cars on Route 422 at the time of the incident, but we did not stop, nor did anyone else. There was no place to pull over. We wereon our way to meet our son-in-law's Aunt near Philadelphia. We told her the whole story when we got there."],"City":"Oaks","Case Number":"15152","Country":"United States","Region":"Pennsylvania","Latitude":"40.137512","map":"<A HREF = \"http://maps.google.com/maps?q=40.137512,+-75.456502(15152)&iwloc=A&hl=en\"> mufon case (15152) map </A>","Date of the Event":"01/09/2009 08:30 UTC","Longitude":"-75.456502","trends":["There have been 3 other sightings in Oaks","There were no other sightings in Oaks on or around January 9th 2009"],"Object Features":"Dome, Window(s), Unknown","Log Number":"US-01272009-0006","Object Shape":"Teardrop","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/15152.html.txt","/var/www/straped/mufon/org/15152.html"],"Disposition":"Insufficient Data","Tags":"City","Weather Factors":"Unknown"}