{"Latitude":"28.039465","Viewing Distance":"501 Feet - 1 Mile","Summary":"Unidentified lights, changing configuration three","Log Number":"","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around January 15th 2002"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.039465,+-81.949804(1515)&iwloc=A&hl=en\"> mufon case (1515) map </A>","Tags":"City","Sighting Duration":"00:10:00","Date of the Event":"01/15/2002 08:00 UTC","Object Features":"Undisclosed","Longitude":"-81.949804","Object Shape":"Triangle","Source":"MUFON","City":"Lakeland","Date Submitted":"01/15/2002 08:00 UTC","Disposition":"Unresolved","Country":"United States","divs":["sighting detailsat approximately 20:00, on 01\\15\\02 witness was traveling south on bartow rd.(route98). he was in the left hand lane to turn left onto north crystal lakeroad. the signal light was red and he was waiting. all of a sudden he noticeda bright light catch his eye to his left side. it appeared to be comingdirectly towards him over some houses to his left side, maybe 200 yards away. atfirst he thought it was a plane going to crash. this red \"light\" was comingdown at about a 45 degree angle. he rolled down his window, but didnt hear anynoise which surprised him. the he thought it maybe was a comet, but there was abright red\\orange light that was surrounded by white light. the signal lightturned green and the witness made the left turn trying to keep his eyes on theroad & light. after making the left turn he noticed that the light\\object hadchanged into three points of light (white\\green) and that made it look like atriangle. it was still decending at a 45 deg. angle and almost stopped. thewitness then pulled off the road to get a better look. the object\\light was nowtraveling in the same direction that the witness was which was east. hecontinued to drive east and noticed several other people out watching, pulledover to the side of the road. he didnt stop to talk to them as he was lategetting home. the last he saw of the object it was a single light moving veryfast high in the sky. he lost sight of the object... he was stunned."],"Case Number":"1515","files":["/var/www/straped/mufon/html2text/1515.html.txt","/var/www/straped/mufon/org/1515.html"]}