{"Longitude":"-98.977875","Object Shape":"Unknown","Object Features":"None","Tags":"City","Date Submitted":"05/31/1965 12:00 UTC","divs":["Sighting DetailsOK, these are not MY stories . . . they are ones I have been hearing of my whole life. The first is the UFO siting: My parents moved back to Atkinson from Omaha in about 1964 and owned a cafe on the corner of highways 20 and 11. One afternoon or early evening, my Dad's cousin, and his friends from the baseball team came running into the cafe all excited. They had all just watched a UFO come down over the baseball field and hoverd there! Don't know how long, just that it happened and apparently a lot of people saw it. The next one is also about a siting and a POSSIBLE abduction. Please keep in mind that I don't know the whole story, only what I remember hearing: There is a family north of town who had a UFO land in their back yard or field behind their house. They watched it land out their window. There was talk of their electricity bill being way larger than normal the next billing and they think the UFO was using their power. The rest is that the mother had a severe emmotional break down after this and would not talk about it. There is a possability that either she, or one of the other family members was taken and it upset her greatly (As it would me!). I surmise that she may have watched it happen and was powerless to stop it? The third event was my Father's personal experience: While working for a friend of his, on their cattle ranch or feed yard, they came upon a mutilated cow while out checking fences or cattle one day. My Dad said it was the most prescise surgery he had ever seen, and NO BLOOD. The last event was told to me personally by our church youth groups' teacher during a hay-rack ride one evening: My teacher and her, then husband, were coming from an event in town and happened upon a black helicopter taking off from one of their pastures. It stopped and hovered, he stopped the pickup and was going to get out his rifle and shoot at them. She said not to because they could obviously see them as well and they didn't know what kind of \"power\" they had. So, they waited and the helicopter finally left. This last weekend I talked to her about it and she said that it flew over them and shone a spotlight on the pickup. She also said there had been many mutilated cows on their land during that time. My parents tell me that there have been numerous mutilated cattle, and one horse, events in our area, with some black helicopters involved in some of them. My Uncle also knows of a man who apparently caught someone in the act and they rolled him up in barbed wire and told him that if he told anyone who they were they would kill him and his family. SO, my guess is that these are some sick PEOPLE from our area who are involved in some scarry stuff! Please give this case to Mr. Richard Webb of Omaha, NE. Thank You!"],"Sighting Duration":"Undisclosed","Country":"United States","Summary":"UFO hovered over baseball field in Atkinson while a game was in progress.","Viewing Distance":"Unknown","Case Number":"15168","Date of the Event":"05/31/1965 12:00 UTC","Log Number":"US-01282009-0006","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.533058,+-98.977875(15168)&iwloc=A&hl=en\"> mufon case (15168) map </A>","trends":["There have been no other sightings in Atkinson","This sighting has never been favorited."],"Latitude":"42.533058","City":"Atkinson","files":["/var/www/straped/mufon/html2text/15168.html.txt","/var/www/straped/mufon/org/15168.html"],"Disposition":"Unknown","Source":"MUFON","Region":"Nebraska"}