{"map":"<A HREF = \"http://maps.google.com/maps?q=36.861486,+-75.970975(15166)&iwloc=A&hl=en\"> mufon case (15166) map </A>","Sighting Duration":"Undisclosed","City":"Virginia Beach","Weather Factors":"Unknown","Latitude":"36.861486","Summary":"I was exiting Kroger grocery store in afternoon. Glanced skyward noticed metallic-looking sphere. Looked on 2 occasions to confirm what I was seeing. Upon unlocking my truck, look up third time, object had vanished! Perfectly clear sky!","Country":"United States","Tags":"City","Object Shape":"Sphere","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around"],"Date Submitted":"01/28/2009 12:38 UTC","Case Number":"15166","Object Flight Path":"Stationary","Log Number":"US-01282009-0006","Object Features":"Unknown","Viewing Distance":"Unknown","Longitude":"-75.970975","Date of the Event":"Unknown","files":["/var/www/straped/mufon/html2text/15166.html.txt","/var/www/straped/mufon/org/15166.html"],"divs":["Sighting DetailsThe eerie thing about my sighting was just how uneventful it was. I was leaving the local grocery store after work when I happened to glance skyward. I had looked back down, to where my truck was located, when it occurred to me that I had just seen something unusual in the, otherwise clear, sky. I looked up again and it was still there. A stationary, metallic-looking, spherical object. I never saw it move. I could not begin to guess at the height or size as there was nothing else in the sky to compare it to. I would say that it did seem to be as high as I am accustomed to seeing aircraft flying. The oddest feeling came over me when, on the third look toward the sky, it was nowhere to be found. It was then that I ralized there was something special about the object I had just seen. The shape and the fact it was not moving was very odd but when it litterally vanished in a split second, I was absolutely shocked. I do not recall the date and I estimate the time of the sighting to be somewhere between 5:00 and 7:00 pm, simply because of the time I leave work and the distance to the grocery store. I had always believed there must be something other than \"us\" out there, but after that day, I can honestly say I have seen something unearthly! That sums up the extent of my sighting."],"Region":"Virginia","Disposition":"Unknown","Source":"MUFON"}