{"Disposition":"Unresolved","Viewing Distance":"Over One Mile","Latitude":"38.835832","Date Submitted":"11/02/2006 02:00 UTC","Region":"Colorado","Object Flight Path":"Path with directional change","Tags":"City","Longitude":"-104.818303","map":"<A HREF = \"http://maps.google.com/maps?q=38.835832,+-104.818303(15160)&iwloc=A&hl=en\"> mufon case (15160) map </A>","Log Number":"US-01272009-0013","Case Number":"15160","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around November 2nd 2006"],"Object Shape":"Oval","Source":"MUFON","Object Features":"None","Date of the Event":"11/02/2006 02:00 UTC","Weather Factors":"Unknown","City":"Colorado Springs","Country":"United States","Summary":"Three objects, two doing circular patterns and one object flying in between them.","Sighting Duration":"Undisclosed","divs":["Sighting Details While outside in the front yard my wife and I noticed a lear jet doing a let turn over our house approx. 1200 ft. in alt. thats when I noticed a refection off to my right at approx 5000 to 8000 ft. in alt. and approx. 3 to 5 miles distant. The sky was cloudless and clear visabilty. There were three objects flying patterns toward the south east of my location, at first I thought it was seaguls but after observing them the sun was reflecting of the bottom of the objects as they manuvered indicating a metalic structure. The objects were oval in shape approx 50ft. in size, they were two toned with a silver bottom and light blue or sky blue on top. Two objects were doing circular patters a rather wide pattern and one object doing a complete circular pattern around the other two objects and at times that one object would fly in between the two that were doing the circular patterns. While observing the objects they seem to disappear from view and then reappear. I noticed that the objects were flipping on to their sides as if using the sky blue color of their top to blend into the sky or back gound. and as they reappeared the sun would reflect off of their silver color bottom and became visable. While the objects were doing their manuvers one object would at times go to the north rather quickly and then disappear and the reappear and then it stopped and flew to the south to join the others. After about 15 mins of observation the three objects formed up into a lazy \"V\" pattern and quickly departed south toward New Mexico. During the time of observation there were no aircraft other than the lear jet that flew over us. The city airport is approx 4 miles from our location."],"files":["/var/www/straped/mufon/html2text/15160.html.txt","/var/www/straped/mufon/org/15160.html"]}