{"Case Number":"15161","files":["/var/www/straped/mufon/html2text/15161.html.txt","/var/www/straped/mufon/org/15161.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.120148,+-88.19789(15161)&iwloc=A&hl=en\"> mufon case (15161) map </A>","Tags":"City","Disposition":"Unknown","Country":"United States","trends":["There have been 3 other sightings in Urbana","There were no other sightings in Urbana on or around January 27th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Longitude":"-88.19789","divs":["Sighting DetailsI was taking a few landscape pictures for some research on Native American sites that I want to investigate in the spring. so I pulled off the road and snapped a few pictures of a farmers field that I believe may have some potential as a future reference site on a book I want to write in the future. After a few shots, I turned to get back into my truck and something very very bright caught my attention out of the corner of my eye, so I turned and looked. I saw a round,oval white light in the field where I had just taken a picture. I still had the camera in my hand and snapped another picture almost in the exact local of the previous picture. I had no sooner taken the picture, (mabe 2-3 seconds at most), and the object I had photographed flew straight up at an amazing speed, so fast that by the time I brought the camera back to my face for another picture, it had vanished. I stayed there for quite awhile after that hoping to see it again, but never did see anything else. I went home as fast as I could to download it onto my computer. It took me forever to do, because I'm not very computer savy and needed to download the program that would let me view the pictures. Once I did get the pictures onto my computer, my son and I started to view them with the magnifying glass to enlarge them. what we saw, amazed both of us. In the first picture, you could see there were objects in the sky off in the distance, one being rectangular in shape. The second picture shows several objects in the sky, only this time closer than the first. one seemed to even have some kind of trail behind it. On the third picture, (the one with the bright object), you can see there are other objects above it. In the first two pictures I took, I saw nothing as I took them, (only later when I looked at them on my computer did I see the things in the sky). However I do know that before the third picture, I did see something physically emitting a very bright white light near the ground, at which time I took the picture. then it just went up so fast, it just vanished from sight. I have no idea what I saw, but I know it was something I have never seen before in my life. I still cant get over how fast this thing was. I have been feeling like I'm running on adrenaline since seeing the object. It's now 1:30 am of the 28th, and I still can't get to bed. please feel free to contact me about this sighting, as I am at a loss to explain what I saw. Your help and insight would be greatly appreciated. I just want to know I'm not going crazy. Mabe someone else has seen something similar to this, and I would love to talk to them if possible. The other question you asked is : what did I think the object was when I saw it. I can honestly say in my 51 years, I've never seen anything like it, so I do remember I kept thinking,\"what the heck is that, what could that possibly be."],"Sighting Duration":"00:03:00","Latitude":"40.120148","Log Number":"US-01282009-0001","Date Submitted":"01/27/2009 11:38 UTC","Object Flight Path":"Undisclosed","Summary":"I had taken my new camera out to get landscape pics, after a few pics, I was turning to get back into my truck, and a bright white light caught my attention, which I took a photo of as soon as I took the picture it went straight up at an incredible speed.","Object Shape":"Circle, Oval, Sphere, Square, Rectagular","Date of the Event":"01/27/2009 11:38 UTC","City":"Urbana","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Region":"Illinois"}