{"Date of the Event":"01/12/2009 08:59 UTC","Weather Factors":"Unknown","Latitude":"35.963068","Region":"Tennessee","Date Submitted":"01/12/2009 08:59 UTC","divs":["Sighting DetailsI was driving to my mother's house when I noticed an incredibly bright \"star\" that was moving directly over the direction of her neighborhood. At first I thought it was a plane or helicopter but soon realized it was moving way to slow for it to be as close as it appeared. My mother's neighborhood is near an airport so it is common to see tons of airplanes everyday. This was different. When I got to my mother's house I ran in and grabbed my sister. We rushed outside with our cameras and got into my car to follow the slow moving craft. Before we left the neighborhood we took a picture over a neighbors house. It was moving furthur west so we drove to the road that is the least lit by street lights so that we could get a better look at the object. We followed the object for about 30mins. We pulled into a county park where we took a few other pictures. The camera's are not super so the pictures are not amazing. The camera we used was a Kodak Easy Share C513. When we took the pictures we noticed that the bright object was actually multicolored, flashing many different colors of lights however, to the naked eye you could not tell. I think it is because the flashing is happening so quickly in the night sky that we only grasp that there is light and see white (my theory only lol). Well anyway as we are taking pictures the object begins to move back towards town, knoxville, and as it gets closer the few small street lights begin turning off one pair at a time. There was no sound to the object and it hovered in the same \"level\" in the sky, below the clouds. We got a bit spooked out and decided to drive home. You could still see the object in the back window as we drove home and then suddenly it dissapered, like it had never been there."],"Tags":"City","Longitude":"-83.912729","Log Number":"US-01282009-0007","Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","City":"Knoxville","Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.963068,+-83.912729(15169)&iwloc=A&hl=en\"> mufon case (15169) map </A>","Case Number":"15169","Object Flight Path":"Path with directional change","Country":"United States","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around January 12th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/15169.html.txt","/var/www/straped/mufon/more/15169_submitter_file1__100_0880.jpg","/var/www/straped/mufon/more/15169_submitter_file2__100_0885.jpg","/var/www/straped/mufon/more/15169_submitter_file3__100_0884.jpg","/var/www/straped/mufon/org/15169.html"],"Summary":"Extremely bright and slow moving. It was stark white and blinding."}