{"Latitude":"38.559577","Viewing Distance":"Unknown","City":"Washington","Country":"United States","Date Submitted":"01/28/2009 10:45 UTC","trends":["There have been 2 other sightings in Washington","There were no other sightings in Washington on or around January 28th 2009"],"Tags":"City","Object Flight Path":"Unknown","Longitude":"-91.010068","files":["/var/www/straped/mufon/html2text/15179.html.txt","/var/www/straped/mufon/org/15179.html"],"Object Shape":"Fireball, Flash","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.559577,+-91.010068(15179)&iwloc=A&hl=en\"> mufon case (15179) map </A>","Log Number":"US-01292009-0003","Weather Factors":"Unknown","Sighting Duration":"00:00:20","Disposition":"Unknown","divs":["Sighting DetailsI was driving home south when I saw a bright flash of light outside of my left window. I looked left and up towards the sky and noticed that the sky was brighter than before. It was similar to a flash of lightning but more subdued; not quite as white more blueish. I then caught a glimpse of something in my peripheral vision and looked further to the left. I saw what I think was a solid blue ball that then seperated into two pieces. One piece was smaller that went down. The other piece was bigger and went up. Both where blue in color and spread apart like a wishbone on its side. I don't remember hearing any explosions though I did have the radio on. This lasted only a few seconds and then they either disappeared or travelled out of my line of sight. I think they where just above the treeline but it was dark and I can't actually remember if that part of road had any trees. The vehicle I was in was travelling around 45-55 mph. I thought at the time it was strange and could possibly be a meteor or something but afterwards that it could have been fireworks. I only saw those objects once, however and did not notice any more flashes of light that night."],"Date of the Event":"01/28/2009 10:45 UTC","Source":"MUFON","Case Number":"15179","Summary":"Bright flash of light with blue fireballs.","Object Features":"Unknown"}