{"Disposition":"IFO","Date Submitted":"01/28/2009 07:10 UTC","Source":"MUFON","Date of the Event":"01/28/2009 07:10 UTC","Tags":"City","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Summary":"Green light in west part of Dallas skyline flickering, pulsing lasting about 6 sec.","divs":["Sighting DetailsOn Wednesday, January 28, 2009 at 7:10am I witnessed a greenish light in the western part of the Dallas skyline that flickered and pulsed for about 6 seconds it was the color of a palish neon green. I noticed this light and pointed it out to my co-worker and asked him \"What the hell is that?\", he looked and said, \"I don't know\". I said the color looks to be similar to that of an exploding transformer, my co-worker stated that's too big to be a transformer. It took up a very large portion of the western sky. After several minutes a service vehicle arrived at the dock. I asked him (service man) if he saw anything weird in the sky and he responded ,\"you mean that light?\" I said, \"yea\", where were you at when you saw it?\", he said, \"I was coming north bound I35 approaching the Commerce Street exit and saw it to my left.\" This would place the occurance totally out of the down town area where I observed the light. I googled for any logically explanation as to what this was, I did not find anything, I had not heard it in the news either. This may be nothing but I have never seen anything like this in my life to that scale. It reseambled a sort-of... Aurora Borealis, as seen on TV, but it was smaller than the entire sky. I know you are probably busy with all kinds of reports and things, but I would appreciate a call if you find out anything. I'd like to know what it was. Thanks, Joe"],"Longitude":"-96.767543","Object Features":"Undisclosed","Weather Factors":"Fog, Rain, Light","Log Number":"US-01282009-0013","City":"Dallas","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.804155,+-96.767543(15175)&iwloc=A&hl=en\"> mufon case (15175) map </A>","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around January 28th 2009"],"Object Shape":"Flash","Sighting Duration":"00:00:06","Case Number":"15175","files":["/var/www/straped/mufon/html2text/15175.html.txt","/var/www/straped/mufon/org/15175.html"],"Latitude":"32.804155"}