{"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.322072,+-80.092746(15184)&iwloc=A&hl=en\"> mufon case (15184) map </A>","Region":"Florida","Disposition":"Unknown","Source":"MUFON","Case Number":"15184","Summary":"1) I noticed objects in the sky, over the ocean.","Weather Factors":"Windy","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","Log Number":"US-01292009-0007","files":["/var/www/straped/mufon/html2text/15184.html.txt","/var/www/straped/mufon/org/15184.html"],"Tags":"City","Longitude":"-80.092746","Sighting Duration":"Undisclosed","Date of the Event":"01/09/2009 11:15 UTC","Latitude":"26.322072","divs":["Sighting DetailsI was doing repairs on a house,in deerfield beach. The house was located on a private beach,directly off the ocean. I was working on the eastern side of the house, about twenty yards away from the ocean.I was only on the job site approximitly fifteen minutes. I noticed two objects in the sky,apx. one mile out into the ocean. The objects were about two hundred feet in the air. When i first saw the objects,i had no idea what they could be.They were black spherical objects.They must have been at least one hundred feet in diameter. The objects were stationary,in fifteen to twenty five mile an hour, western winds. The objects appeared to be,about fifty feet apart.The southern most object was about,twenty five feet higher, than the object to my left of it. After seing these ufos for about fifteen minutes, i noticed a man walking through the back yard. He was there working,as i was. I pointed out the objects to him,he could only see the lower object to our right,as the other object was coverd by clouds. He was also shocked,as to what it could be. I told him there was a second object, slightly visible to the right,but he couldnt see it. I told him i was aware of thier presence now,for about half an hour. He said, hed never seen anything like it before,and had no idea what it could be. He was only in the backyard,for about fifteen minutes,fixing a sprinkler head,and he left. Then i decided to call my dad,and tell him what i was seing. He was jealous,wishing he was there to see them as well. As i was describing the situation to him, the object on the left started to move. The object was moving in a circular motion,as well as side to side,and up and down. I got really excited,seing the acrobatics of this mysterious,unworldly object. The object didnt move very far,but it was obviously putting on a show. Me and my father, briefly continued to speculate about the origin of this object,and then he had to get back to his prior engagments. Shortly after our phone conversation, the object returned to its stationary position,as i returned to my duties. About twenty minutes later, i recieved a call from a coworker. As i proceded to tell him about the highlight of my day,the object again began to move around,in the same fashion. We were both excited. He told me i should alert the coast guard. I told him i didnt have the coast guard, on speed dial,so he suggested i call 911. I did call 911,i wasnt sure how theyd respond. As i was telling the dispatcher about the objects,the object on the left,started moving again... I was telling her my location,and that theyd been there for about an hour and a half now. She said she would dispatch someone to the area,to take a look. About a minute after i got off the phone with her, the object on the left dropped into the ocean. It didnt seem to be moving any faster,than if it was free falling. At this time the object on the right was no longer in sight. I was looking around to see if i could see anything,and i couldnt see a thing. About thirty seconds later,i noticed to objects much further away,from where the two objects were. They crossed paths a couple times,and vanished. I was thinking, maybe they were our fighter jets, coming in to see what the objects were,then they vanished. Now i think, they were infact the same objects, and for what ever reason they were getting out of dodge. So now iam looking around, not seing anything at all. So i went ahead to continue working,which hadnt been very efficent so far. As i was starting to pack up my tools for the day,i noticed the objects were back in the same formation. They were further north,and motionless. At this time,i didnt want to leave but,i had to get back to the shop. They were there as i lefted,and i also noticed them on a1a,as i was leaving.That was my experience on january ninth 09..."],"trends":["There have been 7 other sightings in Deerfield Beach","There were no other sightings in Deerfield Beach on or around January 9th 2009"],"Date Submitted":"01/09/2009 11:15 UTC","Country":"United States","Object Shape":"Circle, Sphere","Object Flight Path":"Stationary,Hovering then path","City":"Deerfield Beach"}