{"Log Number":"US-01292009-0008","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/15/2008 01:30 UTC","Date Submitted":"09/15/2008 01:30 UTC","Object Features":"None","Source":"MUFON","Sighting Duration":"00:45:00","files":["/var/www/straped/mufon/html2text/15185.html.txt","/var/www/straped/mufon/org/15185.html"],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=41.826109,+-71.409774(15185)&iwloc=A&hl=en\"> mufon case (15185) map </A>","Summary":"2 objects at first appeared to be clouds. Moved side by side. Appeared to go up high and back from the direction they came.","Object Shape":"Other","Weather Factors":"None","Region":"Rhode Island","City":"Providence","Country":"United States","divs":["Sighting DetailsI was at work taking break outside with a coworker. We were just sitting there and I happened to see two objets coming over a small building. I asked my friend what he thought they were. At first they appeared to be small clouds. But they were low. Definitely under control. He said they had to be some kind of ufo. So, we ran down to the parking lot and got binoculars out of my car. Looking through the binoculars they appeared to be clusters of light. Not bright lights. No flashing. No noise. Just dim light. My friend ran in and got the other guys to come out and take a look. We took turns looking through the binoculars and all saw the same thing. The objects stopped over the main parking lot then moved over the building where we work and appeared to get much smaller. As if they were going straight up. They got so small that they blended in with the stars. They then went back the way they came. We lost sight of them as they went far enought where we couldn't see them anymore. My feelings at the time were excitement. I have never seen any kind of ufo before. I've listened to Coast to Coast AM for years and heard all the stories and was glad to see something myself. There were 5 of us that saw it and can't explain it."],"Tags":"City","Longitude":"-71.409774","Latitude":"41.826109","trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around September 15th 2008"],"Case Number":"15185"}