{"files":["/var/www/straped/mufon/html2text/15188.html.txt","/var/www/straped/mufon/org/15188.html"],"Date of the Event":"01/26/2009 10:30 UTC","Longitude":"-80.07011","Viewing Distance":"501 Feet - 1 Mile","City":"Delray Beach","Country":"United States","Latitude":"26.464632","Disposition":"Unknown","Region":"Florida","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=26.464632,+-80.07011(15188)&iwloc=A&hl=en\"> mufon case (15188) map </A>","Source":"MUFON","Sighting Duration":"01:00:00","Weather Factors":"None","divs":["Sighting DetailsI was dropping off some material,at 310 a1a,and noticed and object hovering above the ocean. The object was less than a quarter mile out,and about one hundred feet in the air. It was round,black,and about the size of a suv. When i first saw it i thought,this cant be happining again. But it sure was. I continued unloading the truck,and checking to see if it was still there,and it was. The object was barely moving at all,and it was pretty windy,on the ocean. I went across the street to point out this object,to some people who were walking down a1a. They figured it was a kite or a ballon,tied to a boat that was out there. So i didnt want to persist, it was anything other than what they were claiming it to be.So i went back across the street,and continued working. The object continued to crawl north east,against a twenty plus western wind. So i figured id call 911,and get a police officer,to take a look at it. I called it in,and they said theyd send someone right out. It took about a half hour for a delray beach police officer to arrive. When he did i asked him if he had binoculars,as i requested from the dispather. He didnt have binoculars,but he could see the object. He speculated it could be a kite our ballon tied to a boat that was out there. I pointed out to him that it was north east of the boat,and we had a pretty strong western wind. He agreed,it must not be either of those objects. He radioed,to the life guard towers, to take a look with thier binoculars. Any one with binoculars wouldve got a really good look at the object. So he got in his car,to head north, to speak with the lifeguards, about what they could see. I was at this location for another half hour or so as the object,went out of sight. I went about my day wishing a brought my binoculars with me."],"Date Submitted":"01/26/2009 10:30 UTC","Log Number":"US-01292009-0011","Object Flight Path":"Straight-line path","Object Shape":"Sphere","trends":["There have been 35 other sightings in Delray Beach","There were no other sightings in Delray Beach on or around January 26th 2009"],"Case Number":"15188","Tags":"City","Summary":"4) I was across the street from the ocean and noticed a black round object hovering."}