{"Date of the Event":"01/29/2009 05:11 UTC","Summary":"Two UFO's over New york City at rush hour.","Case Number":"15189","Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"New York","Date Submitted":"01/29/2009 05:11 UTC","Object Shape":"Fireball, Star-like","Tags":"City","Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around January 29th 2009"],"Latitude":"40.720453","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.720453,+-74.004863(15189)&iwloc=A&hl=en\"> mufon case (15189) map </A>","divs":["Sighting DetailsI'm not too sure if what I saw were actually UFO's, but I figured I'd get a record down reqardless, just in case someone else happened to see what I saw. I was returning home from school around 5pm, got out of the 157th street subway on Broadway, was looking South straight down Broadway and ahead of me saw what resembled most closely to a rocket spewing its fiery exhust as it climbed into the atmosphere. The spew was conical at the top and seemed to have two parallel trails that were very long in relation to the object that was doing the spewing. I figrued at first it might be a plane releasing its exhaust. However, those are usually white and have thin trail lines that dissapear gradually as the plane moves. This did not. It had a firery yellow and red spewing color, had very thick trails, and the object did not seem to climb very fast into the atmosphere, it climbed very slowly. Also a plane happened to pass my view in front of the UFO, and from that perspective could see the UFO was very much further into the distance and was much larger then a plane. After only 2 min of watching this object, the spew almost immediately all dissapeared into the atmosphere, then reapeared at about half the original volume, then almost immediately quickly vansihed into the atmosphere, at that point whatever was spewing exhaust into the atmosphere was beyond my view. This is puzzling to me because, usually exhaust dissipates into the atmosphere gradiently from the trailing end first. The spew from this object dissintigrated all together and left no residue. Also to my south western view from that location, close to the crescent moon I was seeing the setting light blue sky was a small glowing object that almost looked like a star. Which I alos found puzzling considering, 1 it's NYC, we dont see stars here, 2 it was not dark out yet, the sky was still blue, 3 it was the only non-moviwing glowing body in the sky. Also it was not completely white in color like a normal star would appear, rather it had a bluish overtone around it. It was not moving at all, and stayed visible, yet at the time just figured it was a celestial body I didn't happen to know was visible to the naked eye that day. Or maybee it was actually a UFO. I dont know, but at least it's on paper now. Thanks for reading. GREG"],"Log Number":"US-01292009-0012","Longitude":"-74.004863","Region":"New York","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15189.html.txt","/var/www/straped/mufon/org/15189.html"],"Disposition":"Insufficient Data","Object Flight Path":"Undisclosed"}