{"Latitude":"48.736134","Date of the Event":"11/30/1956 12:00 UTC","Viewing Distance":"101-500 Feet","Summary":"Round or egg shaped object flying with and around front of plane making several approaches to it.","Longitude":"1.370889","City":"Dreux","Region":"Centre","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15181.html.txt","/var/www/straped/mufon/more/15181_submitter_file1__Lunsfordstills1.jpg","/var/www/straped/mufon/org/15181.html"],"Tags":"City","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Country":"France","Date Submitted":"11/30/1956 12:00 UTC","trends":["There have been no other sightings in Dreux","This sighting has never been favorited."],"Object Shape":"Egg, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=48.736134,+1.370889(15181)&iwloc=A&hl=en\"> mufon case (15181) map </A>","Case Number":"15181","Disposition":"Unresolved","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsMy father's acquantance from a U.S. Air Force squadron in the same Group as my Dad's ( I believe it was the 32th Troop Carrier Squadron ) sent him a short dvd ( converted from 8mm movie footage ) shot in 1957 of a flight of c-119 cargo planes in formation. The camera is pointing out the port side of one plane at two other planes. As a non C-119 is framed ( two separate shots in the same sequence ) an oval object (which is at all times changing it's relative position in a smooth way which seems to indicate it is flying and maneuvering with the plane ) appears first to the lower right of the frame and subsequently moves to positions in front of, below and above the cockpit of the framed plane. The object seems illuminated by the same light and shadow as the planes and none of its movements suggest that it is connected to the interior of the camera or host plane. I believe the original movie footage is available for analysis but will need to get permission from owner. I have read extensively about UFOs and recognized the unique nature of this footage as soon as it was viewed. At first I believed that a plane out of the frame was trailing some sort of objects by a wire ( for measurements of some kind ) but I think the objects movements appear to be too \"adaptive\" and less haphazard than they would be simply trailing the plane. There may be reflections that establish the scale of the object which is my main purpose in submitting this report. It appears to me that the object is positioned at the same distance from the camera that the non C-119 plane is... which would make it almost the diameter of the framed planes fuselage. I have attached a graphic made from sequential frames from this film (going from left to right ) Please let me know of you would like to examine the film footage. Thanks, {pid}"],"Log Number":"FR-01292009-0004"}