{"Weather Factors":"Unknown","Summary":"Accidental photograph taken at Machu Picchu in which an unknown object appeared.","Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=-13.163957,+-72.545993(15192)&iwloc=A&hl=en\"> mufon case (15192) map </A>","Sighting Duration":"Undisclosed","Region":"Cusco","City":"Machu Picchu","Tags":"City","trends":["There have been no other sightings in Machu Picchu","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/15192.html.txt","/var/www/straped/mufon/more/15192_submitter_file1__P5030013.JPG","/var/www/straped/mufon/org/15192.html"],"Date of the Event":"05/28/2008 06:30 UTC","Country":"Peru","Log Number":"PE-01292009-0015","Date Submitted":"05/28/2008 06:30 UTC","Latitude":"-13.163957","Object Shape":"Disc","Longitude":"-72.545993","divs":["sighting detailsi am sending a photo which a girl i raised as a daughter took late last spring while she was visiting peru. photo date: may 28th, 2008 machu picchu archeological site, peru time was between 6:00 a.m. and 6:30 a.m. http:\\\\www.ufocasebook.com\\2009\\machupicchu2008.html they had gone up there for the dawn when the photo was taken. she was photographing the valley with the dawn light coming into it across the mountain ranges. she was unaware of the object in the photo until i pointed it out. she then e mailed it to me and i blew it up in my irfanview and realized it did not look like a condor, but was still too obscure to say it wasn't a black plane. whatever it is, why is it inside or emitting a condensed cloud of some sort? i would like to send it to jeff sainio to get his take on it, but do not have his e mail address. i would be grateful if you'd forward it to him. in fact you can share it with mufon or anyone you think may benefit from it. since we don't know what the object is, as it could be a plane or something else - a condor? we would like someone who can \"read\" such a photo to take a look at it. i have attached to this e mail the attachment she sent to me, as it is without the inset in it. there is also some sort of rounded semi-visible shape directly where the inset was placed by ufocasebook. it would look like a classic saucer shape with a dark center. it looks like it could be due to the terrain below in the valley or it is a ufo just out of the visible spectrum which the camera also picked up. i do not know if there is a way to analyse the photo for infrared. please find the attached photo."],"Case Number":"15192","Disposition":"Unresolved"}