{"Case Number":"15197","Object Shape":"Circle, Fireball, Star-like","Disposition":"IFO","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Summary":"Fast moving color changing fireball over Whittier, CA.","Source":"MUFON","Weather Factors":"None","Tags":"City","Object Flight Path":"Straight-line path","Object Features":"Unknown","Latitude":"33.988319","map":"<A HREF = \"http://maps.google.com/maps?q=33.988319,+-118.031174(15197)&iwloc=A&hl=en\"> mufon case (15197) map </A>","Longitude":"-118.031174","Date of the Event":"01/29/2009 08:20 UTC","City":"Whittier","Log Number":"US-01302009-0002","Region":"California","divs":["Sighting DetailsAt approximately 8:20 pm January 29,2009 my wife and I were taking a walk with our daughter when my wife saw a bright white light appear in the sky out of nowhere from the Northwest. The light was as bright as the evening star. We were walking near the corner of Citrustree and Santa Gertrudes in East Whittier. It then disappeared, but then reappeared very faint. It continued to travel at a high rate of speed getting larger as it came closer to us. The light traveled in a Southeast direction, but change color from white to orange to red then back to white. Each color lasting for for a few seconds. There were no trademark flashing lights like aircraft, and it was not in the typical flight pattern of this area. We have lived here in Whittier, CA our whole life right under the LAX final approach pattern and it looked nothing like an aircraft. It was traveling much too fast to be an airplane or helicopter. There was no sound. After watching this for about 3 to 4 minutes the the Fireball vanished into thin air. We continued to watch the area for another few minutes and nothing could be seen."],"files":["/var/www/straped/mufon/html2text/15197.html.txt","/var/www/straped/mufon/org/15197.html"],"Country":"United States","trends":["There have been 27 other sightings in Whittier","There were no other sightings in Whittier on or around January 29th 2009"],"Date Submitted":"01/29/2009 08:20 UTC"}