{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15196.html.txt","/var/www/straped/mufon/org/15196.html"],"Region":"Texas","Log Number":"US-01302009-0001","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.450096,+-99.729614(15196)&iwloc=A&hl=en\"> mufon case (15196) map </A>","Tags":"City","Source":"MUFON","Longitude":"-99.729614","City":"Abilene","Date of the Event":"01/29/2009 06:45 UTC","Country":"United States","Object Flight Path":"Straight-line path","trends":["There have been 63 other sightings in Abilene","There was one other sighting in Abilene on or around January 29th 2009"],"Object Shape":"Unknown","divs":["Sighting DetailsAs I was heading home from my work in Albany to just outside of Moran where I live, approx 5 miles outside of Moran I saw two red lights that I first thought looked like flares. I could distinctly see it was two lights, then they disappeared and then reappeared approx 2-3 minutes later. There were two red lights flashing on and off similar to a red light passing behind a picket fence. They were traveling in an easterly direction, moving slowly and steadily with the lights flashing on and off while traveling in a slow steady straight movement. I watched the lights trying to determine what they were and then approx 30 seconds to a minute later the two lights turned into a row of approx 15 non-blinking lights. I only saw this row of lights for approx 2-3 seconds and then the lights disappeared. I am not saying this was a space ship, it was just something I had never seen before. We do have many military planes fly across our home often and we are located approx 50 miles from Dyes Airforce Base in Abiline, but I have never seen anything like this before and was unsure of where to report this sighting. I wish I would have had my video camera with me but I did not so I have no pictures of what I witnessed. If you do find out what these lights were, could you please contact me as it has really peaked my curiosity."],"Latitude":"32.450096","Date Submitted":"01/29/2009 06:45 UTC","Summary":"I saw two alternating red lights that turned into a straight string on approx.15 red lights moving in the night sky.","Object Features":"Unknown","Case Number":"15196","Weather Factors":"None"}