{"Date of the Event":"11/15/2008 12:00 UTC","Latitude":"39.830929","Object Features":"Other","Viewing Distance":"Unknown","Disposition":"IFO","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-01302009-0013","trends":["There have been 5 other sightings in Gettysburg","There were no other sightings in Gettysburg on or around November 15th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Unknown","divs":["Sighting DetailsI didn't see this object until I went through all my photos on my computer. I thought it was quite strange. It didn't look like a chopper or a plane or a blimp. Helicopters have a skinny boom. This thing has no boom. Where a boom should be it is fat and transparent. I am former Army and have lived on military bases over seas for years. I know what helicopters look like. There was no sound of a chopper either.Gettysburg was as quiet as it always is.Not only that I thought Gettysburg was a no fly zone or am I wrong? The first photo is the actual photo the second photo is a photo I enlarged of the object in the first photo. I have another photo that I can show of a different object in the same location but I couldn't enlarge it enough to really get a good look. I can send that one to you to if you like. If you can figure out what it is please email me back and let me know. Thank you very much. Elizabeth Rettig Stafford Va"],"files":["/var/www/straped/mufon/html2text/15209.html.txt","/var/www/straped/mufon/more/15209_submitter_file1__Gettysburg200864932.jpg","/var/www/straped/mufon/more/15209_submitter_file2__Gettysburg20086499999.jpg","/var/www/straped/mufon/org/15209.html"],"Summary":"Strange object and shape. Some what transparent in the middle.","Date Submitted":"11/15/2008 12:00 UTC","Case Number":"15209","Object Shape":"Other","Country":"United States","Region":"Pennsylvania","City":"Gettysburg","Longitude":"-77.231096","map":"<A HREF = \"http://maps.google.com/maps?q=39.830929,+-77.231096(15209)&iwloc=A&hl=en\"> mufon case (15209) map </A>","Source":"MUFON"}