{"Summary":"Silent triangle over country house.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/15200.html.txt","/var/www/straped/mufon/more/15200_submitter_file1__ufo2.jpg","/var/www/straped/mufon/org/15200.html"],"City":"Malaga","Country":"Spain","map":"<A HREF = \"http://maps.google.com/maps?q=36.723608,+-4.412896(15200)&iwloc=A&hl=en\"> mufon case (15200) map </A>","Object Features":"Undisclosed","Object Shape":"Triangle","divs":["Sighting DetailsI had just got back from work and was watering the plants in the garden just before dusk. The sky was clear and it was warm. As I was watering I became aware of a strange silence. There was no bird song or any other sounds I would hear on a usual evening. The silence was strange because it was not silence exactly, and the only way I can describe it is that it was anti-sound. So I looked up from the plants and saw a large triangular object sort of sliding in a curve about 200 feet above the house. It it must have been 30 to 50 meters across. It was gun metal grey and had 4 lights on the underside. A large orange one in the center and 3 white ones on the corners. The corners were rounded When I realised it was not a low flying conventional aircraft I dropped the hose and ran inside to get my mobile phone to photograph it. I was gone for literally 10 seconds but when I returned it was no longer above the house. It had travelled to what looked like about a mile away towards the horizon and was disappearing fast. Then, when it was just a small dot in the distance it shot off at an 11 o'clock angle into the sky at impossible speed and was gone. Unfortunately I didn't manage to take a photo, and people don't believe me. But I know what I saw. (It looked very similar to the attached picture)."],"trends":["There have been 3 other sightings in Malaga","There were no other sightings in Malaga on or around November 30th 2002","This sighting has never been favorited.",""],"Case Number":"15200","Log Number":"ES-01302009-0005","Date of the Event":"11/30/2002 12:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:01:00","Latitude":"36.723608","Tags":"City","Object Flight Path":"Undisclosed","Region":"Andalucía","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-4.412896","Date Submitted":"11/30/0002 07:15 UTC"}