{"Object Features":"None","Weather Factors":"Unknown","Case Number":"15202","files":["/var/www/straped/mufon/html2text/15202.html.txt","/var/www/straped/mufon/org/15202.html"],"Object Shape":"Circle","Sighting Duration":"00:00:10","Object Flight Path":"Straight-line path","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around January 30th 2009"],"Tags":"City","Latitude":"39.838053","map":"<A HREF = \"http://maps.google.com/maps?q=39.838053,+-105.029045(15202)&iwloc=A&hl=en\"> mufon case (15202) map </A>","Date of the Event":"01/30/2009 03:05 UTC","City":"Westminster","Disposition":"Unresolved","Date Submitted":"01/30/2009 03:05 UTC","Source":"MUFON","Region":"Colorado","divs":["Sighting Details Went out for a cigarette during my lunch break at work, walmart@ 136 St. in Westminster, accompanied by 2 coworkers. As we made our way into the parking lot I saw a bright green light, which was lit the whole time it was in sight, headed at a 90 degree angle for the ground. The entire incident only took about 10 seconds and I instantly looked back and forth at my coworkers, one of which was doing the same exact thing I was. He and I made eye contact and he told me \"Yea, I saw that thing too.\" The craft was definitely round looking, but it moved so fast and was out of sight that I would have a hard time giving any other specifics. It did not look like anything I've ever seen before and I have already checked the local news to see if anything had crashed, which nothing was reported. The constant green color of the craft, which encompassed the entire body of the craft, like the thing was emitting this light itself was very bright and never blinked. Flash of green light, headed to earth at a 90 degree angle, 10 seconds and gone. 2 eyewitnesses. Thats it."],"Country":"United States","Longitude":"-105.029045","Summary":"Bright green light, headed in a 90 degree angle straight for the ground...fast.","Viewing Distance":"Over One Mile","Log Number":"US-01302009-0007"}