{"Latitude":"40.344348","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.344348,+-75.921195(15212)&iwloc=A&hl=en\"> mufon case (15212) map </A>","Summary":"Green ball of light illuminated through cloud cover","Region":"Pennsylvania","Disposition":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around January 8th 2009"],"Date of the Event":"01/08/2009 06:15 UTC","Log Number":"US-01302009-0016","Source":"MUFON","Case Number":"15212","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/15212.html.txt","/var/www/straped/mufon/org/15212.html"],"Date Submitted":"01/08/2009 06:15 UTC","Country":"United States","Tags":"City","City":"Reading","Longitude":"-75.921195","divs":["Sighting DetailsI work at the Reading Airport and have been in aviation for 22 years. On the morning of event I was outside our facility to step out for a smoke with my coffee. It was still dark and about an hour before sunrise. I was staring up at the sky to the south-east and normally see air traffic climbing out of Philly (60 miles away)in that sector of the sky. Cloud cover was broken and covered much of the sky. I then noticed a green light about 60 degrees above horizon decending straight down to the 20 degree position when it vanished. It was at the approach end of runway 31. Total elapsed time was 10-12 seconds. There was no air traffic at the airport.I could not detect any shape and only saw the bright green light glowing through the clouds. The light was circular about the size of my finger nail from arms length. The green color was like a florecent neon color. The clouds gave it a hazy aura. I am not saying this was extraterestrial but I have 8,000 flight hours in the Navy as a Flight Engineer and know what aircraft look like at night from a distance. Perhaps a flare on a parachute but I never saw a green arial flare. I'm curious if anyone else had reported it or if anyone has seen a green ball of light in the sky before."]}