{"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.716687,+-121.364422(15213)&iwloc=A&hl=en\"> mufon case (15213) map </A>","divs":["Sighting Details On 11-16-08 up until present day there has been multiple crafts in the sky every night. They come out when it's dark and there out until sunrise. The first night I saw the craft I was looking throught the garage door window when I saw what I thought was a plane with it's landing lights coming down. There was blue and red flashing and I realized it wasn't a plane when it was staying in the same position for over ten minutes. The one I just described is the lowest one there is and there are well over 20 crafts scattered all over the sky at a higher altitude that I can see with my binocualrs. The crafts flash blue and red, green, amber, yellow, and the most beautiful color purple that I have ever seen. It appears to move from town to town also. Around 6:00 I will look towards the town of Folsom with the binoculars and I can see the craft and the colors on it. Then around seven I can see it above the near town of Citrus Heights and around 7:30 or 8PM it's in front of me in my town of Antelope where it moves a little more but it stays with us for the remainder of the night. Also, the latter in the evening it get's the more they move around like if they were dancing up and down and side to side. There's also one more craft that is different then the others because this one I thought was a planet until it starts to dance around like the others or dashes way out of view when a plane or helicopter comes towards it's direction. This one move's more around when it first comes out unlike the other ones that dance around later in the evening. There's a video clip of the last one that I described. I don't know how to copy and paste but if you go to google and type in Sacramento news 10 UFO you can see the news chopper and it's crew chasing the object. The news station did a follow up to the story and it was explained away as a light sign being towed by plane which is an out right lie. It hovers in the same spot for over an hour until it starts slowly moving toward the next towm. Ever since it's been said it was sign I havent' heard another about it. It was all over the morning news radio and everyone was talking about it every where. Know, I haven't heard a word about it any where for since the news story. I'm a little uncomfortable with all of this going on right above my house. I also neve lose any sight of them unless I go to bed or it'd raining or cloudy. Even when there's rain or clouds there always a break in the clouds for a few seconds and you can see that they are still there. I also believe this has been going on well before the first night I saw them."],"Object Features":"Unknown","Summary":"Multiple crafts in the sky every night since 11-16-08.","Date of the Event":"01/29/2009 06:00 UTC","Tags":"City","Disposition":"IFO","Viewing Distance":"Unknown","City":"Antelope","Weather Factors":"None","Log Number":"US-01302009-0017","Date Submitted":"01/29/2009 06:00 UTC","Country":"United States","Latitude":"38.716687","trends":["There have been 5 other sightings in Antelope","There were no other sightings in Antelope on or around January 29th 2009"],"Object Flight Path":"Hovering then path","Sighting Duration":"11:00:00","Longitude":"-121.364422","Case Number":"15213","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/15213.html.txt","/var/www/straped/mufon/org/15213.html"],"Source":"MUFON"}