{"Object Features":"None","Date of the Event":"12/26/2008 12:00 UTC","Region":"Pennsylvania","Country":"United States","Object Flight Path":"Unknown","Latitude":"40.364273","map":"<A HREF = \"http://maps.google.com/maps?q=40.364273,+-74.951278(15216)&iwloc=A&hl=en\"> mufon case (15216) map </A>","Disposition":"Insufficient Data","Date Submitted":"12/26/2008 12:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15216.html.txt","/var/www/straped/mufon/org/15216.html"],"City":"New Hope","Object Shape":"Disc, Sphere","Tags":"City","Longitude":"-74.951278","Summary":"On Dec. 26, 3 of us in car saw bright orb in sky for about 15 secs, which then expanded, then vanished.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThree of us were returning home to New Hope on I 95 on the evening of Dec. 26, 2008 (I'm guessing it was around 7:00 pm) following a shopping trip at Oxford Valley Mall, when suddenly I noticed a bright, perfectly round light in the sky through the upper left side of the windshield. I thought, \"What on earth is that? It's too high up to be a ground-bound electric light and it's too bright to be an airplane.\" It made me think of a giant football field light only it was 'way up there in the sky. To my astonishment, the orb then suddenly expanded and completely vanished without a trace. I was dumbfounded--I didn't know if my mind was playing tricks on me or what. But at exactly the same moment that I yelled out, the other 2 occupants of the car also started shouting, \"WHAT WAS THAT! Did you see that??? Did you just see a bright light explode and disappear????\" The other 2 in the described seeing exactly the same light that I saw. I commented that I didn't think it could be an airplane exploding because I thought a plane would look like a 'gasoline explosion' with orange-burning parts falling away from it. This was pure bright white light, and it was a perfect circle, even as it expanded and then disappeared. We also noticed that the car ahead of us slowed to a dead stop midway on the exit ramp, as if its driver too had seen something that distracted him from driving. I was tempted to jump out of the car and ask the driver if he had seen the same thing but I didn't. Remember that 'UFO' simply means \"Unidentified Flying Object,\" nothing more--the term 'UFO' in itself does not mean 'alien spacecraft.' All 3 of us, including my husband who is a Satellite Engineer, believe that what we saw was a meteor. As my husband explained, \"They are called 'METEOROIDS' when they're in outer space; they are called 'METEORS' when people can see them [because they have hit the earth's oxygen-filled atmosphere and burn brightly enough to see]; and they are called 'METEORITES' when they hit the ground. We believe that what we saw on Dec. 26, 2008, in Bucks County, was a METEOR."],"Log Number":"US-01302009-0020","Weather Factors":"Unknown","trends":["There has been one other sighting in New Hope","There were no other sightings in New Hope on or around December 26th 2008"],"Viewing Distance":"Unknown","Case Number":"15216"}