{"Object Shape":"Circle, Sphere","Object Flight Path":"Undisclosed","Country":"United States","Case Number":"15227","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 30th 2009"],"Latitude":"25.798409","files":["/var/www/straped/mufon/html2text/15227.html.txt","/var/www/straped/mufon/org/15227.html"],"City":"Miami","map":"<A HREF = \"http://maps.google.com/maps?q=25.798409,+-80.225359(15227)&iwloc=A&hl=en\"> mufon case (15227) map </A>","Viewing Distance":"Unknown","Region":"Florida","Tags":"City","Object Features":"Undisclosed","Date of the Event":"01/30/2009 01:10 UTC","Longitude":"-80.225359","Source":"MUFON","Disposition":"Insufficient Data","Summary":"A questionable meteor.","divs":["Sighting DetailsJust after 1 AM, after leaving work at the Kendall Wal-Mart (Store 1680), I sat on a bench outside the store to wait for my ride home. The air was thick with smoke and the sky was in a complete haze. Later, I was told that this was the result of fires in Broward County drifting Southward. So thick was the haze that stars were not visible it was reflecting the ambiant street lights. At the time I was speaking with my wife over my cell phone and was staring out over the store's parking lot. Then, suddenly, through the trees, roughly South-South East of my position, I saw a solid orange dot appear and swing down a few feet in an arc like motion and disappeared as suddenly as it appeared. Except for the arcing motion, I'd almost guess it was a shooting star except that it was appeared in FRONT of the haze in the sky, rather than through it. Also the shape of it was puzzling as well. I've seen shooting stars before but... This looked like a hard orange dot. No lens flare, no shimmering, nothing of that sort. It was just a hard orange dot. Not sure how else to describe it. As if you used a hole punch on a piece of orange paper, I guess. The sighting lasted only a second and the object never reappeared. It could've been a shooting star but the peculiarness of it, I thought warranted reporting, if nothing else to see if anyone else saw it too."],"Weather Factors":"Unknown","Log Number":"US-01312009-0008","Sighting Duration":"Undisclosed","Date Submitted":"01/30/2009 01:10 UTC"}