{"Longitude":"-98.970654","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/15221.html.txt","/var/www/straped/mufon/org/15221.html"],"trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around January 30th 2009"],"Log Number":"US-01312009-0002","Date Submitted":"01/30/2009 07:20 UTC","Tags":"City","Object Flight Path":"Straight-line path","Region":"Texas","Sighting Duration":"Undisclosed","Date of the Event":"01/30/2009 07:20 UTC","Weather Factors":"None","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.390606,+-98.970654(15221)&iwloc=A&hl=en\"> mufon case (15221) map </A>","Latitude":"32.390606","Disposition":"Unknown","divs":["Sighting DetailsJan. 30, 2009, 7:20 p.m.: I was driving south on Hwy 206. I had just left Cisco (about 4-5 miles south of), after having dinner with my husband at a local cafe. To my left out the driver's side window, I noticed a red \"flash\". I took my eyes briefly off the road and saw what appeared to be 3 or 4 red lights in a row. These lights were larger than stars or planets but smaller than an aspirin. They flashed (blinked) intermittently and independently. At first I thought it was an airplane but I did not see a green nav light, however I did briefly see a small white light that flashed a couple of times, very quickly. I had to look back at the road, then as I turned my head left again to look, the lights disappeared. They suddenly showed up further north, opposite the direction I was headed. I could not pull over and stop, as there was a lot of traffic on the road tonight, the shoulder is very narrow and I had a vehicle riding my bumper. By the time I got home, I was almost 10 miles further south and the lights were gone. The lights were in a line (North to Nouth), moving from the South to the North. They appeared to be 30 degrees above the eastern horizon, possibly over Dublin. I estimate the elevation to have been between 2500 to 3500 ft. I could not tell if the object(s) made noise and I'm sorry I could not take a photo, as my hands were busy with the steering wheel and I had to contend with a tailgater."],"Object Features":"Unknown","Object Shape":"Flash, Oval, Sphere, Other","City":"Cisco","Case Number":"15221","Summary":"I think I saw the same red lights that someone else near Stephenville saw, at about the same time, in opposite direction."}