{"map":"<A HREF = \"http://maps.google.com/maps?q=32.225496,+-98.193523(15220)&iwloc=A&hl=en\"> mufon case (15220) map </A>","Object Features":"Undisclosed","Region":"Texas","Log Number":"US-01312009-0001","City":"Stephenville","Object Flight Path":"Undisclosed","Disposition":"Unknown","Date Submitted":"01/30/2009 07:15 UTC","Case Number":"15220","Tags":"City","trends":["There have been 74 other sightings in Stephenville","There was one other sighting in Stephenville on or around January 30th 2009"],"Weather Factors":"Unknown","Longitude":"-98.193523","Country":"United States","Latitude":"32.225496","divs":["sighting detailsa stephenville area resident was shown this evening on kwtx news 10 cbs waco, texas. here is that residents account that he gave to kwtx-tv as posted on the news 10 website: (reported by matt collins) at about 7:15pm this evening on the horizon in the north west, there they were 3 hovering bright red lights. nothing like i have ever seen. they would sporadically appear and disappear in different locations in the same part of the sky. i waited for about five minutes and finally another light, of the same brightness and intensity, appeared in the same location, only this time it was moving across the horizon. just like the other lights before it, this one disappeared the same way. me and my sister both witnessed the lights over stephenville. the reason i know these were not airplanes or jets is because just off to the north of the ufo's was the path that airliners and other jets arrive at dfw, so i had an almost side by side comparison of the two different crafts as a point of reference to make my judgment call. the whole story can be viewed at: http:\\\\www.kwtx.com\\iwitness\\headlines\\38721747.html"],"files":["/var/www/straped/mufon/html2text/15220.html.txt","/var/www/straped/mufon/org/15220.html"],"Summary":"UFO reported by area resident on KWTX-TV News 10 Waco, Texas.","Viewing Distance":"Unknown","Object Shape":"Other","Sighting Duration":"00:00:00","Date of the Event":"01/30/2009 07:15 UTC","Source":"MUFON"}