{"Longitude":"-105.357176","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/15223.html.txt","/var/www/straped/mufon/more/15223_submitter_file1__US-01312009-0004Romeromaplocation.jpg","/var/www/straped/mufon/org/15223.html"],"trends":["There have been 2 other sightings in Sierra Blanca","There were no other sightings in Sierra Blanca on or around September 16th 2008","This sighting has never been favorited.",""],"Date Submitted":"09/16/2008 03:00 UTC","divs":["Sighting DetailsOn September 16 2008 my wife and I were headed to El Paso from San Antonio on I-10 west.At around 3:00 PM just west of Sierra Blanca my wife noticed an object in the sky on her side. She said it appeared to be triangular in shape, rotating and going in and out of the cloud's as if following us.I stopped, got out and started recording it.At first I saw what appeared to be a small white cloud but after zooming in and out a few times it did appear to be an object Pyramid in shape and rotating. We continued to record for a while then left.The recording looks blurry when viewed on TV but it does appear to be a Pyramid shaped object that is rotating. During the entire recording the clouds are moving slowly from west to east and changing shape while the object stay's in the same place. A few weeks later we were watching your TV show, the episode were a farmer discovers a Pyramid shape UFO on his field and as soon as he starts up his tractor the UFO pops up in the air, starts to rotate and hover around before shooting off into the sky. When my wife first saw it,she said it was very similar to what she had seen and added that the door on the side was the same, something she had not mentioned before.I then told her the thing was to far to tell if it had any doors on it. She then explained that yes it was very far when I started recording, but that at the beganing when I was driving, the object was following close enough that she could make out a door."],"Disposition":"Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.174573,+-105.357176(15223)&iwloc=A&hl=en\"> mufon case (15223) map </A>","City":"Sierra Blanca","Object Features":"Other","Sighting Duration":"Undisclosed","Region":"Texas","Country":"United States","Case Number":"15223","Log Number":"US-01312009-0004","Latitude":"31.174573","Date of the Event":"09/16/2008 03:00 UTC","Object Shape":"Triangle, Other","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Summary":"Recorded pyramid shaped object. UFO ?"}