{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Disposition":"Insufficient Data","divs":["Sighting DetailsFirst of all I find it hard to believe that this event did not shake me up more than it did. Twenty three years later it still has not hit me. I had a daylight sighting at Rose Valley Lake ten miles north of Williamsport, Pa. It was about mid May 1986. I was with a fried driving up to the lake to kill time before we went out. We stopped at the lake to watch some fisherman and take in the nice day. We were parked facing south with the sun setting to our west. We were noticing the high amount of air traffic and how well the visibility was that late day. I was locked in on a smaller commercial jet flying lower than the others heading west to east. Now at this time the sun was nearly blocked by the small mountain to the west. The sky was very clear and it had only a few scattered feather like clouds. Thats when the show began. We must have both seen the disk appear at the same time. We both said at the same time something like, \"look at that\" or \"what is that\". I seen a disk simular in size to the jet. At the time I only new of the new mudic CD disk to compare it to. It is still the best decription until today. It was round and about the same width and length of the jet. It was perfect looking. It was gluiding like behind the jet. It had no exhaust, or vibration like the jet. No sound. It was closing in on the jet at a slow pace. It seemed a long time but it probably was less than a half minute and it just vanishes. We remark again at the same time at its vanishing. After a short time it pops up again at the front right of the jet. It seemed to travel at the same speed of the jet to its front right. The pilots must have seen it. It does this for a short time and suddenly takes off directly from the earth at an obvious unearthly speed. It was like it did that on prupose to show off. I vividly remember this event and me actually waiving to this disk at one point to let them know I see them. I had a feeling they knew we were watching. This sighting left no dout in my mind they do not belong here. To me now it is why are they here. I have keep this quite for the past twenty of the almost twenty three years. The only reason I am telling this story now is out of guilt. I always felt bad that one of those pilots might have been brave enough to report it. I could have been the ground witness to support their sighting. I tried to use any resources available at that time but it was very limited. It is so strange to have absolute knowlege of something and not be able to share it. I have been around this country and lived next to Air Force bases. I have been to my brothers work when he was doing welding inspections on F-16's. I know the skies. If you would ask for a UFO show to leave you no dout, this was it."],"files":["/var/www/straped/mufon/html2text/15239.html.txt","/var/www/straped/mufon/org/15239.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.24964,+-76.991879(15239)&iwloc=A&hl=en\"> mufon case (15239) map </A>","Object Features":"Other","Date of the Event":"04/30/1986 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Summary":"A perfect sun sitting observation.","Object Shape":"Disc","Date Submitted":"04/30/1986 12:00 UTC","Tags":"City","Latitude":"41.24964","City":"Williamsport","Region":"Pennsylvania","Source":"MUFON","Case Number":"15239","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-02012009-0002","trends":["There have been 13 other sightings in Williamsport","There was one other sighting in Williamsport on or around April 30th 1986"],"Longitude":"-76.991879"}