{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"15237","Date Submitted":"03/15/1974 12:00 UTC","Longitude":"-111.087911","Weather Factors":"Unknown","Date of the Event":"03/15/1974 12:00 UTC","Source":"MUFON","Region":"Arizona","Log Number":"US-01312009-0017","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=34.058678,+-111.087911(15237)&iwloc=A&hl=en\"> mufon case (15237) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/15237.html.txt","/var/www/straped/mufon/org/15237.html"],"City":"CMS/sg n/a","trends":["there have been no other sightings in cms\\sg n\\a","This sighting has never been favorited."],"Object Features":"Unknown","Country":"United States","Tags":"City","Summary":"Circular white lights moving rapidly beside and behind my car as I was driving.","divs":["Sighting DetailsI was leaving Colorado (moving back to California from Colorado) and driving alone with most of my belongings in my '67 Chevelle. I was somewhere in Arizona (not much arround for miles) , it was late in the evening, and I was wanting to find a town where I could spend the night. I noticed a circular white light facing me out the passenger window. I could not determine the distance, but as I would look in the rearview mirror, it would appear behind me in a matter of seconds. It moved to an area distant from my passenger window and back behind my car at least two to three times. There were no other cars behind or ahead of me..on this two-lane highway. My first thought (upon seeing the light (singular) beside me, was that it may have been a train, as it remained steady, not going up or down. But it seemed like the light was facing me. Once I saw it in my rearview mirror (in seconds)...I ruled out a train. During the experience...I did think it could be somekind of ufo...I was a bit uncomfortable during this experience. After the sighting...I recall just being very tired and wanting to get to the next town. The light just stopped after a matter of a few minutes. Later that same night (I'm not sure how far I traveled) , I noticed my engine dying. I was NOT out of gas, and I was able to arrive at the outskirst of a town (I do not recall the name of the town), but I remember pulling off the road to park near a service station to rest and await sunrise. I thought it was a very fortunate coincidence that my car died where it did. I was very tired and decided to sleep for a while while sitting in the front seat next to this service station. (My back seat was loaded with belongings). I'm sure I slept for a while. I don't remember further details, but I recall replacing one of the electrical components in my Chevelle the next day. I don't recall which one. Please note, I may have posted this account previously, as I typed this account on a ufo-related website within the last two years."],"Disposition":"Unknown","Latitude":"34.058678"}