{"Tags":"City","Region":"North Carolina","trends":["There have been no other sightings in Hudson","This sighting has never been favorited."],"Latitude":"35.848464","Date of the Event":"02/01/2009 05:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.848464,+-81.495927(15240)&iwloc=A&hl=en\"> mufon case (15240) map </A>","Summary":"Witnessed several star-like objects at high angle moving in non-aircraft like manners.","Object Shape":"Star-like","Source":"MUFON","City":"Hudson","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-81.495927","Case Number":"15240","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had stepped outside to smoke, and looked up where i had seen something the night before. After my eyes adjusted to the darkenss, about 5 minutes, I was able to view the stars through the trees. I quickly located one of the 'moving' stars, and began to watch it. As it started its path up (moving from western sky towards vertical my relative location) I noticed there were two others flanking it slightly behind, in a standard 3 flight formation. The two side lights moved to parallel, they began to move off at 90 degrees (one north, the other south). They quickly faded from view, while the center one seemed to stop, and remain stationary for some time. Having seen something similar the night before, i was more relieved then concerned, as it reinforced the sighting i had the previous night. I am able to state that the objects did move, as i have several bare branch trees to use as points of reference, and could see the lights moving in relation to the trees. I did not report last nights sighting, as i was unsure if i had really witnessed this,or was suffering from fatigue. I currently take wellbutrin, but do nto feel that this has any bearing, as i take 150 mg once per day, to help with a stop smoking program. I will report any other sightings here, and i am willing to correspond with MUFON via email, but due to my job with the state, i am unwilling to participate in any in-person meetings that could effect my job or family. Iwill also attmept to secure other witnesses. Due to the low light levels available, i have not been able to secure any photographs."],"Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Date Submitted":"02/01/2009 05:30 UTC","Country":"United States","Log Number":"US-02012009-0003","files":["/var/www/straped/mufon/html2text/15240.html.txt","/var/www/straped/mufon/org/15240.html"]}