{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.843298,+-82.404833(15247)&iwloc=A&hl=en\"> mufon case (15247) map </A>","trends":["There have been no other sightings in La Crosse","This sighting has never been favorited."],"Object Features":"Unknown","Source":"MUFON","Longitude":"-82.404833","Region":"Florida","Summary":"Very bright flashing red white blue hovered low in sky in flight path.","Sighting Duration":"Undisclosed","Latitude":"29.843298","Weather Factors":"Unknown","Disposition":"Insufficient Data","City":"La Crosse","Date of the Event":"02/01/2009 10:09 UTC","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI went outside to check on my animals and of course look up, I am an avid meteor shower watcher. I know all the flight patterns of the commercial planes as we live in a country area with little light pollution and a great view of almost the entire sky. I immediately saw an object that was the brightest thing in the sky. It was 3 or 4 times larger than anything else. The object was round and pulsing red white and blue. First saw it at exactly 10:09 pm I watched it as it was stationary for appox 5 minutes when I went inside for less than a minute and brought out a pair of binoculars. I watched the object for a few more minutes when it started getting larger and flashed brighter than it made a 90 degree turn to the left contrary to local air traffic. It was low to the horizon tree top level. It sped up got brighter still flashing and headed out in an east south east direction until it dropped behind the trees and i lost contact. The time was 10:18 PM EST when I lost sight. I watched ofr 5 more minutes but it was gone. The speed it was traveling was much faster than normal aircraft, but it looked like it was mush lower in the sky and I am not that good at estimating air speed but it was much faster than any aircraft could travel. When I first saw it I just knew it was not a normal object, as I am well versed in the Sky at my house, being a meteor counter and just enjoy the night sky I can tell the time of night by the position of the constellations, and know the flight patterns of the commercial airlines fairly well. When I see something out of the norm I will watch it and see what I can. I had no \"feelings\" of dread or surprise etc I calmly watched and made good mental note of what happened. This was a good end to the Superbowl as it happened just as it was over. It was not a rocket, weather balloon nor swamp gas, just an unknown fast moving flashing object that deviated from the norm."],"Object Shape":"Circle, Saturn-like, Star-like","files":["/var/www/straped/mufon/html2text/15247.html.txt","/var/www/straped/mufon/org/15247.html"],"Case Number":"15247","Date Submitted":"02/01/2009 10:09 UTC","Log Number":"US-02012009-0009","Country":"United States","Object Flight Path":"Hovering then path"}