{"Date Submitted":"01/31/2009 07:45 UTC","Date of the Event":"01/31/2009 07:45 UTC","Sighting Duration":"00:00:08","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around January 31st 2009"],"Case Number":"15244","Log Number":"US-02012009-0007","files":["/var/www/straped/mufon/html2text/15244.html.txt","/var/www/straped/mufon/org/15244.html"],"Tags":"City","Latitude":"37.77965","Object Flight Path":"Other","Region":"California","divs":["Sighting DetailsWalking down the street I noticed what looked like a faint star moving through the constelation of Orion. It looked very high up and I thought it was maybe a jet flying from west to east. Then I thought it looked more like a satalite because at that altitude jets appear to fly slower, they don't cover as much space, this was moving pretty fast, and I was thinking how rare it is to see a satalite through the light polution of the city (San Francisco). I watched the object for aboutg 5 or 6 seconds then all of the sudden it changed directions at 90 degrees, and was going to the north. After about 2 seconds it disappeared. This turn was sudden, unlike anything flying that I am familiar with. The only other explanation is that I had some object moving across the cornea of my eye, but I doubt this as it doesn't behave like \"floaters\" we can sometimes see in our eye. I was a bit shaken by the experience. The object was as faint as a faint star, looked more like white light than blue. There were no other colors and it was constant, not blinking or oscillating in intensity."],"Source":"MUFON","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Object Features":"Unknown","Object Shape":"Star-like","Longitude":"-122.410696","City":"San Francisco","Summary":"Thought it was a satellite until it made a 90 degree instant turn.","map":"<A HREF = \"http://maps.google.com/maps?q=37.77965,+-122.410696(15244)&iwloc=A&hl=en\"> mufon case (15244) map </A>"}