{"Source":"MUFON","Case Number":"15243","Region":"Oregon","Tags":"City","files":["/var/www/straped/mufon/html2text/15243.html.txt","/var/www/straped/mufon/org/15243.html"],"Disposition":"Unknown","divs":["Sighting DetailsWhile driving home my nephew and I witnessed a pencil shaped object pass across the road ahead of us at a descending angle. My first thought was that is not an airplane. The 2 lane road is tree lined so we only saw the object for a second or two as it passed from west to east about 4 or 5 hundred yards ahead of us. It was moving at a descending angle, so it looked like it might crash into the hills nearby but the trees obscured our view. It looked like it was at a low elevation below 1500 feet and at that angle and speed would not clear the hills to the east. The sky was clear. The object was a bright blue pencil shaped cylinder with red light at the ends. The length of the object was about 40 feet . We were slowing down to turn up our lane at that time so we went home and dumped off our groceries and let the dog out. We then drove back to the road to investigate further. I was actually looking to see if the there was a crash in the woods to the east but we saw and heard nothing and went home scratching our heads.."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=42.436984,+-123.167158(15243)&iwloc=A&hl=en\"> mufon case (15243) map </A>","Country":"United States","Object Shape":"Cylinder","Sighting Duration":"00:00:02","Summary":"A bright blue pencil shaped object with bright red light on the ends passed quickly overhead while driving home.","trends":["There have been 4 other sightings in Rogue River","There were no other sightings in Rogue River on or around January 10th 2009"],"Weather Factors":"Unknown","City":"Rogue River","Object Flight Path":"Straight-line path","Date Submitted":"01/10/2009 07:50 UTC","Log Number":"US-02012009-0006","Longitude":"-123.167158","Latitude":"42.436984","Date of the Event":"01/10/2009 07:50 UTC"}