{"Weather Factors":"Unknown","Longitude":"-75.161539","Date Submitted":"02/01/2009 06:19 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.958025,+-75.161539(15248)&iwloc=A&hl=en\"> mufon case (15248) map </A>","Tags":"City","Date of the Event":"02/01/2009 06:19 UTC","Latitude":"39.958025","Country":"United States","Sighting Duration":"00:00:15","Object Shape":"Star-like","Source":"MUFON","Summary":"Bright star like white light to left of moon moving horizontally, then slowly vanished.","Case Number":"15248","Object Features":"None","Disposition":"Insufficient Data","divs":["Sighting DetailsI was done food shopping at Whole Foods in North Wales and about to put my groceries in the trunk of my car. As I was putting my key into the trunk and opening the trunk, I glanced up at the night sky to admire the crescent moon. I also noticed a very bright 'star-like' object moving horizontally towards the moon from the left side of them moon. At first I ignored it and thought it was an air plane and proceeded to put a bag of groceries into my trunk. Then it struck me to look up again because something seemed too peculiar about it to be an air plane. So, I looked back up and noticed the object still moving towards the moon horizontally, but it started to become dimmer and dimmer until it seemed to completely vanish before it reached the moon. It went from bright white star-like, to dimmer, to a dark-orange sphere before disappearing. I thought maybe it was passing over the moon and that is why I couldn't see it.(But, it diappeared BEFORE it crossed the moon.) So, I continued to observe for a few minutes but the object never re-appeared. It just simply disappeared or whatever light was on was turned off. I thought maybe it was a shooting star - but I don't think it was as it was way too bright and looked mechanical and moved horizontally and it was actually moving quite fast for a plane."],"Object Flight Path":"Straight-line path","City":"Philadelphia","Log Number":"US-02012009-0010","Viewing Distance":"Unknown","Region":"Pennsylvania","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around February 1st 2009"],"files":["/var/www/straped/mufon/html2text/15248.html.txt","/var/www/straped/mufon/org/15248.html"]}