{"Object Features":"Unknown","Sighting Duration":"00:02:30","divs":["Sighting DetailsWas in the back yard. Looking out to the southeast, I see a bright light far off in the distance, pretty high, almost 45 degrees up. It appears to be moving upward, and toward the south, maybe south-east. At first it looked kind-of like a plane, but there were no flashing lights, and it looked just a little bit orange-ish. Something about the light just looked different from the lights of a plane. As it rose up higher, moving away from me, a few seconds after I started watching it it just became dimmer and dimmer as it moved away, until I couldn't see it anymore. Not sure if it's because the light it emitted got dimmer, or the object was just moving away really fast. The whole sighting lasted about 30 seconds or so. After seeing this, I of course began watching the sky even more closely, and I spotted another light that looked exactly like it to the north of me. The same thing happened as I started watching it, and it got dimmer as it rose up in the air. It was the same color, no flashing lights, and may have very well been moving in the same direction as the other one, from my perspective. This one was lower to the horizon, maybe only 25 degrees up from the horizon. At this point I'm pretty sure that what I saw was something moving out from somewhere, and dimming itself as it rose up. It didn't look like it was moving away at super-speed, unless it was really far away. It was definitely moving faster than other aircraft in the area that I see flying around. I continued to watch the sky for awhile after that to see if they would pop back up somewhere along the trajectory they seemed to be traveling, or if I could spot any more of them, but I did not. I could tell by the intensity of the light being emitted, and the lack of atmospheric distortion that these things were not extremely high up like a satellite, and more at the level that other aircraft fly at, or at least the second one was. I think the first one I saw may have been pretty high up, though. The first one I spotted I almost mis-took for a really bright star or a planet at first glance (as the planets were very bright this evening), of course until I did a double-take and realized it was traveling."],"Longitude":"-104.872533","Date Submitted":"01/30/2009 06:45 UTC","files":["/var/www/straped/mufon/html2text/15252.html.txt","/var/www/straped/mufon/org/15252.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.587035,+-104.872533(15252)&iwloc=A&hl=en\"> mufon case (15252) map </A>","Source":"MUFON","Country":"United States","Object Flight Path":"Straight-line path","Tags":"City","Object Shape":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"01/30/2009 06:45 UTC","Weather Factors":"None","Summary":"Bright white/orangish objects rising up and away.","Region":"Colorado","Latitude":"39.587035","City":"Centennial","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around January 30th 2009"],"Log Number":"US-02022009-0001","Case Number":"15252"}