{"Summary":"Has shown up often in last week. Tonight it disappeared around 10:00 PM. Then reappeared around 1:50 AM. Object moves erratically.","divs":["Sighting DetailsWe first noticed this object last Saturday night. We observed it (and took pictures) for at least an hour. It would sort of drift to the right, then move more rapidly to the left - but all in one smooth motion. We saw it come closer to us and then pull away - then come closer again. We have observed it two or three times this week. It will be there hovering...then disappear for a couple of hours...then re-appear in the same general (though not exact) location. Tonight, the object seemed somwewhat closer than usual. We watched it for a while and eventually it moved sort of up and off into the distance, zigzagging a great deal. Then, about 45 minutes ago (approx. 1:40 - 1:50 AM), I notied it was back. This time it was much larger (therefore probably much closer) than in previous sightings. It looked like an oval (dark in the center) with lights like fireworks shooting all around the craft. The lights would be distinctly green, then distinctly red, then distinctly white, blending into a mixture of all three colors. I'm not a good judge of distance, it we could clearly see the shape of the craft surrounded by these \"fireworks\" lights. As I look out the window just now, the object seems to have pulled away quite a bit. It's about half the size as it appeared about a half hour ago. Of course (I just saw your questions to the side here), at first we thought it was a planet - not a star. It has never twinkled. Then we thought it was perhaps a satellite. But as we watched the odd maneuverability of this thing, we realized it seemed to be moving with a purpose - as opposed to a satellite making its way across the sky \"on course\". This is an intriguing situation and I was wondering if anyone else in the area has seen this object as well. The pictures we took were on my husband's phone the first night we spotted it. We didn't take any pictures tonight. Will be happy to furnish the pics as soon as we download them."],"Country":"United States","Log Number":"US-02022009-0008","Region":"California","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around February 1st 2009"],"Case Number":"15259","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.156132,+-118.444577(15259)&iwloc=A&hl=en\"> mufon case (15259) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","City":"Los Angeles","files":["/var/www/straped/mufon/html2text/15259.html.txt","/var/www/straped/mufon/org/15259.html"],"Object Features":"Undisclosed","Date Submitted":"02/01/2009 02:05 UTC","Disposition":"Unknown","Longitude":"-118.444577","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"34.156132","Object Shape":"Oval","Date of the Event":"02/01/2009 02:05 UTC"}