{"Sighting Duration":"Undisclosed","Date Submitted":"09/22/2008 11:20 UTC","Object Flight Path":"Undisclosed","City":"Centennial","Object Shape":"Star-like","Disposition":"Unresolved","Date of the Event":"09/22/2008 11:20 UTC","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.585895,+-104.876063(15255)&iwloc=A&hl=en\"> mufon case (15255) map </A>","Log Number":"US-02022009-0004","Viewing Distance":"Unknown","Tags":"City","Summary":"Pair of UFOs traveling together.","files":["/var/www/straped/mufon/html2text/15255.html.txt","/var/www/straped/mufon/org/15255.html"],"Longitude":"-104.876063","Region":"Colorado","divs":["Sighting DetailsWas in back yard with binoculars, this time looking to the North. I could barely notice two lights with my naked eye traveling together at the same speed. Through the binoculars, I could see them very clearly. Once again, these were pretty far away, but not as far away as the last sighting. They may have even been somewhere between Denver and Fort Collins probably 45 to 50 degrees up from horizon. They were North-West of me, and I followed them with the binocs as they moved into my southern view. At first, they traveled in perfect unison to eachother, the following one a little higher than the leading one. The following one then seemed to jump further forward, and stop, while the other one kept going. It then zipped forward ahead and became the leading one. They continued, then slowed, and stopped. I then realized that this little region they stopped in was pretty active. In addition to the two points (which were now slowly fading away) there were some more little points of light I could barely see even through the binoculars swarming around. The original leading one I realized was still moving just slowly still to my right, and faded from sight. At this point, I was moving more to my left to get a better view, in case they went behind a close-by tree in my yard, and tripped the motion sensor on the halogen light in the yard. This made it difficult to locate the area of activity again, and I never did see any more of them for the night."],"Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 16 other sightings in Centennial","There was one other sighting in Centennial on or around September 22nd 2008"],"Case Number":"15255","Latitude":"39.585895"}