{"City":"Mission","map":"<A HREF = \"http://maps.google.com/maps?q=26.217137,+-98.319603(15250)&iwloc=A&hl=en\"> mufon case (15250) map </A>","Tags":"City","Date of the Event":"01/11/2009 07:00 UTC","Disposition":"Unknown","divs":["Sighting DetailsThe first night I witnessed the object was on the night of january 11 2009, I was at work at the sharyland water plant number 1 on the corner of shary road and 5 mile road. around approximately 9:00 PM I observed a light which I first thought to be a star, it had the shimmering effect you see in stars which are low on the horizon, until it began to move. I have been an amateur astronomer since I was 8 years old. I also have 11 years of active duty experience, I have lived near both military air bases and commercial airports and have observed just about every type of commercial and military aircraft including helicopters. I do not believe this was any type of conventional aircraft. the object was at a position to my south, I am guessing distance at around 5 to 10 miles. The object would maneuver and then hover and brighten dramatically, again I have seen the police and customs helicopters at work in the areas,and this was not a helicopter. The object originally moved from east to west, then returned to an easterly heading and I lost sight of it behind a line of trees to my south east. I have included the video clips I caught with my camcorder, these dates span from Jan 11,12,13. I was working at the plant on all these nights. and the sighting times varied from 07:00 pm to around the time when my shift ended at midnight. I was fairly calm throughout the sightings,as I have been a paranormal investigator for the past 6 years."],"Country":"United States","files":["/var/www/straped/mufon/html2text/15250.html.txt","/var/www/straped/mufon/org/15250.html"],"trends":["There have been 5 other sightings in Mission","There were no other sightings in Mission on or around January 11th 2009","This sighting has never been favorited.",""],"Region":"Texas","Case Number":"15250","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Shape":"Sphere","Log Number":"US-02012009-0012","Summary":"Strange light that would hover and brighten dramatically.","Object Features":"Unknown","Date Submitted":"01/11/2009 07:00 UTC","Latitude":"26.217137","Source":"MUFON","Object Flight Path":"Path then hovering","Longitude":"-98.319603"}