{"Longitude":"-72.938837","Date Submitted":"08/31/1978 12:00 UTC","Object Shape":"Oval","Case Number":"15265","Viewing Distance":"Unknown","Date of the Event":"08/31/1978 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 3 other sightings in West Haven","There were no other sightings in West Haven on or around August 31st 1978"],"divs":["Sighting DetailsAt approximately 8:00 pm, one night of fine weather, me, the other kids and many neighbors were outside. (I lived in a busy neighborhood) Bright lights appeared above in the distance just past the tree and house line. A huge, very slow moving object came closer in our direction. One by one we outside noticed it. Then people ran into houses and told neighbors and family to come see. Many people came out and joined the street to see it. Everybody watched it drawing closer, many thought it was a blimp at first. As it passed directly over us it was absolutely silent and by the multicolored lights moving around it's side we could see it was a wide oval, almost round. The lights did change color and seem to flow around its perimeter (like a blimp, but it's shape was not a blimp). The lights were yellow, red, blue, and white. They seemed to change places randomly and in both directions . That's when everyone became amazed. I'll never forget the reactions of people. It moved so slowly that I had time to run home 400 yrds and tell my mother, (who would'nt come look.) and make it back to join the crowd and watch it more. It drifted away. The next day there were reports all over the news and in the New Haven paper. Sighted for miles, by many. No real explanation was given."],"Sighting Duration":"Undisclosed","City":"West Haven","Summary":"Slow moving, huge oval shaped object passes right above crowd.","map":"<A HREF = \"http://maps.google.com/maps?q=41.280003,+-72.938837(15265)&iwloc=A&hl=en\"> mufon case (15265) map </A>","Disposition":"Unknown","Object Features":"Undisclosed","Latitude":"41.280003","files":["/var/www/straped/mufon/html2text/15265.html.txt","/var/www/straped/mufon/org/15265.html"],"Region":"Connecticut","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-02022009-0013","Source":"MUFON","Country":"United States"}