{"Region":"California","files":["/var/www/straped/mufon/html2text/15267.html.txt","/var/www/straped/mufon/org/15267.html"],"Summary":"A bluish-green capsule crossed the sky in about 6 seconds heading due west.","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.190234,+-118.372436(15267)&iwloc=A&hl=en\"> mufon case (15267) map </A>","Date Submitted":"01/31/2009 10:15 UTC","Object Flight Path":"Straight-line path","City":"Los Angeles","Date of the Event":"01/31/2009 10:15 UTC","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Latitude":"34.190234","Object Shape":"Cylinder, Square, Rectagular","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around January 31st 2009"],"Source":"MUFON","Longitude":"-118.372436","Tags":"City","Log Number":"US-02022009-0015","Disposition":"IFO","divs":["Sighting DetailsI saw something weird in the sky the other night. On January 31, 2009 I was driving a car and heading west on Magnolia Blvd. near Irvine Ave. at about 10:15 PM Something came from right over me and streaked straight down across the sky in front of me and disappeared past the horizon. It was illuminated and I noticed the movement as it came into view through the top of th windsheild. My windows were open, but I heard no sound. I know the woman in the car next to me saw it too, but her windows were up and we did not communicate with each other. It was light bluish-green (more on the green side) and seemed like it was not too far up. It was clearly capsule-shaped, (rectangular with rounded edges like a Tic Tac mint) never blurred or faded, but seemed to be glowing from above. It did not seem like it was in space. It looked clear or crisp like it was just over the valley. It was much faster than a plane, but not as fast as a shooting star or meteor, at least none that I have seen before. I was so sure that it was a close object that I was expecting a big crash or explosion or something on the horizon after I couldn't see it anymore. I debated whether or not to call the police, but I did not. I have been looking on the news and online for the past couple of days to see if anyone else saw anything, but I have seen anything anywhere. I thought I should report it to someone and found your site online."],"Sighting Duration":"Undisclosed","Case Number":"15267"}