{"Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=40.814462,+-96.673019(15263)&iwloc=A&hl=en\"> mufon case (15263) map </A>","divs":["sighting detailstaking the dog out for a walk, i will always look up in the sky to view the heavens. this night i saw something a little different. we were in the backyard of my home and just happened to look up toward the south and saw a flaming object coming toward earth at a 45 degree angle. it was heading westward. the color was red\\yellow and i think mostly from the fire that was surrounding it. there was also a short tail of fire following. my first thought was a meteor, as i saw details on the surface of the object that appeared to be circles or craters. it was coming in at a very high rate of speed and i was only able to view it for a few seconds before it went out of sight behind some trees. the height from the earth was lower than a jetliner, i'd guess about 20,000 feet. the size was very large, i would compare it to about half the size of the moon (although the flames surrounding it could have made it look larger). i would say at the way it was heading it would have crashed about 50-100 miles away. it was close enough that i was waiting to feel or hear an impact, but did not. a side note, the next morning i noticed some army helicopters flying over toward the area i viewed the sighting. it is a rare thing (only once i've noticed in ten years) to see these fly over our place. i've seen many things in the sky and many shooting stars, but nothing ever this close and vivid. have you any other reports of this?"],"Date of the Event":"01/28/2009 08:30 UTC","Date Submitted":"01/28/2009 08:30 UTC","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around January 28th 2009"],"Country":"United States","Viewing Distance":"Unknown","Longitude":"-96.673019","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/15263.html.txt","/var/www/straped/mufon/org/15263.html"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Log Number":"US-02022009-0011","Region":"Nebraska","Object Features":"Patterned Surface","Latitude":"40.814462","Source":"MUFON","Summary":"Flaming fireball from the sky.","Case Number":"15263","City":"Lincoln"}