{"Source":"MUFON","Latitude":"39.032498","Region":"Kansas","City":"Shawnee","Viewing Distance":"101-500 Feet","Case Number":"15264","Date Submitted":"02/01/2009 12:00 UTC","Weather Factors":"None","Date of the Event":"02/01/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/15264.html.txt","/var/www/straped/mufon/org/15264.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.032498,+-94.709406(15264)&iwloc=A&hl=en\"> mufon case (15264) map </A>","Log Number":"US-02022009-0012","Object Features":"Other","Object Shape":"Circle, Cylinder, Diamond, Sphere, Square, Rectagular, Star-like, Other","Country":"United States","trends":["There have been 6 other sightings in Shawnee","There were no other sightings in Shawnee on or around February 1st 2009"],"Tags":"City","Longitude":"-94.709406","Sighting Duration":"Undisclosed","Summary":"sighted at Shawnee Mission chased object half way to Lawrence","divs":["sighting detailsi was having study\\prayer group and a friend who provides my transportation and i were driving like we usually do along k-7 homeward from the meeting. on my side (the passenger) i noticed the moon and made comment about a large star 12 degrees above the horizon and about 7-8 degrees to the left of the moon. i began thinking to myself that must be either saturn or venus. it was too large to be saturn and it would have been last month and december for that... i spoke out loud, \"that must be venus.\" then i thought that can't be right. so this time when i look the object was closer towards the moon maintaining altitude at about 4-5 degrees away. \"that's not a planet\" i said, \"it's moving!\" it looked far too large to be a helicopter and too far away or we would have heard it. the driver's eye's opened wide dropjawed. i turned to look at it again and it had picked up pace. now k-7 was veering right and the moon us and the object were getting close to conjunction when suddenly the object zigzagged left and right across the road and over again the moon drivers side by now the object was on the right hand side of the moon about 10 degrees all the while maintaining platform altitude. k-7 was still veering away so we turned onto 63rd and genoa following the object. we made our way into a small subdivision passing 67th and turned into 67th terrace heading straight at it. unfortunately, that was a culdesac so we parked and got out for a clearer view. now the object remained motionless for ten minutes after the first five my driver friend called our hosts that evening to come out and see it and to bring a telescope or some binoculars. just before they arrived the object permeated slightly or pulsed off and on and drifted slightly side to side and downward when it did so. now the object was only about 6-7 degrees above horizon 10-11 degrees to the right of the moon and froze there for another ten minutes after our hosts had arrived. my driver and i were quite excited about all this so our male host peered at the object...he said, \"that's no star that i've ever seen and he handed them to me. the object shrank on the lens and lost it's shining starlike aura. it appeared perfectly sphere like but was surrounded perfectly by a band of stark red very cutlike. it was chilly and i couldn't get a stable view as i would have liked trembling. our hosts counterpart couldn't even locate the object using the binoculars my driver did but her eyesight with glasses was poor. so both parties decide to drive to the object. they got in their truck we in our car and headed along 75th until that ran out and we then made our way onto 85th the object motionless the entire time. at some point before 75th my driver friend called her son excitedly explaining some details. later that evening her son said he was called at 9:20pm. so, we're following our hosts truck when the object maintaining altitude began losing us moving away above the road. our hosts with not as keen eyesight as mine lost the object and parked we beckoned them to follow us. we drove faster along k-10 now and the object smaller now and further away once again stopped. there were a few misturns along the way it took some work to make it to the inject through rural neighborhoods. now we were just leaving from desoto kansas on 95th and gaining quickly half way to lawrence kansas. after a few minutes 95th began to veer left away from the object a gigantic huge bright shining orb about a half mile or 2\\3rd's mile away about 300 yards in diameter twice the width of the quarter crescent moon. appearing about 30 degrees above the horizon since we were positioned underneath it more and 25 degrees away from the moon still and to the right. we all stopped and parked getting out of our vehicles. suddenly the bright white shining light turned off and what remained was a ring composed of lit multicolored square panels that flashed off and on with various different colors perhaps even rotating...the flashes made that somewhat confusing though. it held that shape for only 5 seconds or less and then the flashes stopped and suddenly the object was square shaped or perhaps looked square front light white left side red to yellow pulsing blue light right and green light tail. the object moved along the horizon away from the moon dissappearing over olathe. at that point anyone would pass it for a plane."],"Disposition":"Unknown"}