{"Object Shape":"Other","Date Submitted":"07/31/1998 12:00 UTC","Region":"England","Date of the Event":"07/31/1998 12:00 UTC","Latitude":"51.513429","Longitude":"-0.124495","Log Number":"GB-02032009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=51.513429,+-0.124495(15278)&iwloc=A&hl=en\"> mufon case (15278) map </A>","files":["/var/www/straped/mufon/html2text/15278.html.txt","/var/www/straped/mufon/org/15278.html"],"City":"London","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet","Object Features":"None","Weather Factors":"Unknown","divs":["Sighting DetailsI was watching a movie with my husband when my 6 year old daughter started screaming. I went to see what happened and she said her room was shaking and everything was rattling on the shelves and making noises. She also said later that she felt herself spinning and felt dizzy and nauseas. I assumed she'd had a bad dream and tried to calm her down. She asked if she could sleep in my bedroom and i,of course said yes. We were lying on my bed in the dark chatting, when suddenly through the tiny crack in the curtain, a really small thin laser,very thin but really bright light hit me in my left eye (it did not hurt at all but i now have a small spot on my eyeld since)I immediately thought 'what on arth was that, as i do not have any lights outside my windows, being on the 4rth floor of an apartment block and overlooking the garden. I ran to look out of the window and could not beleive my eyes. Directly in front overhead was the brightest ball of light ive ever seen, it was snow white. It was as bright as the moon but much larger and much lower, did not make a sound or did not move at all.I ran to tell my husband as i was very excited but he seemed very odd and did not even take a look. I ran back to my room where my daughter still was, and remember observing it for about 3 minutes. Next thing i remember it was almost morning and the sun was almost up. I remember the object turned a glowing yellow color and simply disappeared. I realised then it was 6am. I only had one thought in my mind and it was' i watched it for 5 hrs. I do not recall my husband coming to bed and i do not remember if i went to work or anything really around several weeks after that. Neither of us could remember anything else. In fact i forgot about it for several weeks until something jogged my memory at work and i remembered the incident. It was very strange because my husband loved photography and we had a camcorder and several cameras in the house. It did not even occur to me to take a picture and i know i definitly would have wanted to."],"Country":"United Kingdom","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around July 31st 1998"],"Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Case Number":"15278","Summary":"Observed a huge glowy white ball shape, like a very large moon, outside my window overhead at 1am, what seemed like 5 minutes later, I realized it was 6am.","Source":"MUFON"}