{"Disposition":"IFO","City":"Andover","Longitude":"-93.29134","Sighting Duration":"Undisclosed","Case Number":"15274","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.233298,+-93.29134(15274)&iwloc=A&hl=en\"> mufon case (15274) map </A>","Log Number":"US-02022009-0022","Object Shape":"Star-like","Region":"Minnesota","Date Submitted":"01/30/2009 07:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/15274.html.txt","/var/www/straped/mufon/org/15274.html"],"Object Features":"Unknown","divs":["Sighting DetailsI was out on the padio haveing a cup of coffie and a cigeret as i do every morning, we dont smoke in the house.Then I saw a flash in the sky and looked up right away thinking it was a shooting star,but it was just a bright light setting there, then it started to pull away untill it was out of sight, not sideways like a plane, put straight out tword space. I sat there wandering what I just saw,was it a star dissapering in the lightining of the morning sky? no that takes quite a few mins this only took a few seconds, And I could still see all the other stars that werent as pright as that one was.ok was it a nova? well maybe but it just seemed closer than a star as I watched it pull away.Well last resort was it a UFO? I dont know maybe. I sat there and lit another smoke and pondered over the options and I have no idea what I saw that morning. So was there a nova on the 29 or 30th of Jan. at 7am or did I see a UFO, it was no plane or a star, let me know if theres a missing star sence that morning."],"Summary":"I saw a flash and looked up and saw a light and watched it slowly pull straight away till out of sight.","trends":["There have been 2 other sightings in Andover","There was one other sighting in Andover on or around January 30th 2009"],"Tags":"City","Source":"MUFON","Object Flight Path":"Hovering then path,Path then hovering","Weather Factors":"None","Date of the Event":"01/30/2009 07:00 UTC","Latitude":"45.233298"}