{"Tags":"City","divs":["sighting detailsjanuary 13, 2009. brian and chris {pid} and two friends were driving home from a meeting at florida international university at 1:00 am. they were heading west on s.w. 72nd street (sunset drive). chris, who was driving noticed the object first. he said that it was so massive that it occupied 1\\4 of the sky. he saw what appeared to be blue stars blinking around the edge of the object and pulled the car over and the men got out to look at the object. it was moving from southeast to northwest. chris said it was rectangular or oval shaped. brian described the object as floating at a slanted angle the thickness of a house. he said that he could not see the stars through the object and described it as \"camouflaged\" but with flickering blue lights around it. he felt panicky when he saw the object, but on recovering sent a text message to a friend in homestead (about 20 miles south). chris said the object was \"as large as a football field\". brian said it was \"as long as dolphin mall\". both said that the object made no sound and moved slowly across the sky. brian had had a previous sighting, also in miami on 152nd avenue between s.w. 72nd st.and s.w. 56th street. it was of three orange lights, all the size of the full moon in a triangular formation. it kept moving north. the others in the car were shocked and confused and brian suffered a panic attack. mary margaret zimmer fl asd, fi"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/15277.html.txt","/var/www/straped/mufon/org/15277.html"],"Weather Factors":"None","City":"Miami","map":"<A HREF = \"http://maps.google.com/maps?q=25.792929,+-80.219739(15277)&iwloc=A&hl=en\"> mufon case (15277) map </A>","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around January 13th 2009"],"Disposition":"Unknown","Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path","Log Number":"US-02022009-0025","Longitude":"-80.219739","Summary":"Large rectangle with blue lights over Miami, FL.","Latitude":"25.792929","Case Number":"15277","Sighting Duration":"00:10:00","Date Submitted":"01/13/2009 01:00 UTC","Date of the Event":"01/13/2009 01:00 UTC"}