{"City":"Morgan Mill","files":["/var/www/straped/mufon/html2text/15270.html.txt","/var/www/straped/mufon/org/15270.html"],"Viewing Distance":"Over One Mile","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"It was a metallic flash with a long metallic flash underneath.","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"02/01/2009 12:45 UTC","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=32.390992,+-98.159984(15270)&iwloc=A&hl=en\"> mufon case (15270) map </A>","Source":"MUFON","divs":["sighting details on sunday february 2, 2009 at around 12:30 pm, my 29 year old son and i were traveling north on us hwy 281 approximately 3 and 1\\2 miles from morgan mill, texas. toward the north at about 30 degrees (that is just an estimate) i saw a bright flash of an object and almost at the same time, there was a long flash underneath the object. i asked my son if he had seen it. he said,\"yes, what was that?\" i slowed down and kept looking in the direction of the object. the northern horizon was a dark blue caused by a difference in temperature, i guess. we lost sight of the thing and then spotted it at a greater distance going in a nne direction. when we reached a safe place to stop, we stopped. i took out my binoculars and scanned the area where we had spotted the object, but couldn't see it. after scanning the area for several seconds, i did spot an object in the far distance that was long, flat cigar shaped. it was so far that my binoculars couldn't make it out very well. my son tried to spot it but it was gone. the original object had moved out of our vision far faster than a weather balloon. i do not think that it was a jet because it had no vapor trail. there were two jets crossing the same air space and they had long vapor trails."],"Case Number":"15270","Region":"Texas","Longitude":"-98.159984","Latitude":"32.390992","Date of the Event":"02/01/2009 12:45 UTC","Country":"United States","trends":["There has been one other sighting in Morgan Mill","There were no other sightings in Morgan Mill on or around February 1st 2009"],"Log Number":"US-02022009-0018","Object Features":"Unknown"}