{"files":["/var/www/straped/mufon/html2text/15280.html.txt","/var/www/straped/mufon/org/15280.html"],"Date Submitted":"02/02/2009 09:10 UTC","Country":"United States","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Weather Factors":"None","Log Number":"US-02032009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=38.873682,+-121.133888(15280)&iwloc=A&hl=en\"> mufon case (15280) map </A>","Tags":"City","divs":["Sighting DetailsAt about 2100 tonight I stepped out on my porche and noticed a light due west of me how many miles I am not sure could have been anywhere from five to ten miles away at probably 1000 ft. It was bright yellow seeming to stand in one spot. I watched this for about ten minutes and then I asked my mother to come outside to see this. That is when I remember to get my video camera. I was able to get some footage of this event before it blinked out. This is not like any plane I had ever seen before at first I thought it looked alot like military illumination that I have seen many many times being an ex sailor who was with the Marines for quite a few years. But then it would suddenly flash a really bright red then go back to a yellow light. Now my video isn't very good not really used to using the darn thing and lost it a couple of times while trying to zoom in on it but the video plainly shows it blinking bright red then it just blinks out and it was gone after about ten minutes. From my vantage point it looked star like but again I was a long ways from the object. If you like I will send in the video for you to look at and analyze. Please feel free to call me I am home most of the time. I would attache the video if I knew how but it is on one of those small tapes that you have to plug into your television or vcr. I know when an airplane is approaching you it can appear to stay in one spot, but this thing was there almost twenty minutes total then it blinked out."],"Date of the Event":"02/02/2009 09:10 UTC","Sighting Duration":"00:10:00","Case Number":"15280","trends":["There have been 2 other sightings in Newcastle","There were no other sightings in Newcastle on or around February 2nd 2009"],"Source":"MUFON","Region":"California","Longitude":"-121.133888","Object Shape":"Star-like","Summary":"Bright orange yellow flashing red at times.","Disposition":"IFO","Latitude":"38.873682","City":"Newcastle","Object Features":"Unknown"}