{"Disposition":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/15293.html.txt","/var/www/straped/mufon/org/15293.html"],"Longitude":"-105.956995","Latitude":"32.901072","Viewing Distance":"Unknown","Weather Factors":"None","Summary":"Directly overhead, clear sky, 16, (4 groups of 4,) yellow-orange tiny spheres.","Object Shape":"Sphere","Tags":"City","Date of the Event":"08/10/1997 08:25 UTC","Date Submitted":"08/10/1997 08:25 UTC","Country":"United States","Source":"MUFON","Object Features":"None","trends":["There have been 16 other sightings in Alamogordo","There were no other sightings in Alamogordo on or around August 10th 1997"],"Sighting Duration":"00:10:00","City":"Alamogordo","divs":["Sighting DetailsThe sky was perfectly clear, visibility about 50 miles that morning; air temp. about 82 deg. F. My mother and I were hanging out clothes to dry in the backyard of our home and we both looked straight up (directly overhead) (for no apparent reason) and saw the 16 yellow-orange tiny spheres, for the most part grouped as 4 groups of 4 spheres each. These objects would separate from each other in group formation, then come together again. We (my mother and I) watched this spectacle for approx. 10 mins. and quite literally, could NOT believe what we were seeing! For about the last 3 mins. they were visible, I was observing them through 7X binoculars and there was NO difference in size or appearance from the naked eye view of them, so I knew they had to be at a very great altitude. At approx. 0835 MDT the \"formation\" slowly drifted to the north-east and simply disappeared; not rapidly, but just as if they simply \"faded slowly out\" of our sight. We were truly astounded by what we had witnessed and never told anyone else about the incident, but my mother and I still can recall that clear, calm Sunday morning here in southern NM when we certainly DID see and observe something, the likes of which we had never seen before or after! We never heard of any reports of anyone else seeing what we did that Sunday morning, August 10, 1997."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.901072,+-105.956995(15293)&iwloc=A&hl=en\"> mufon case (15293) map </A>","Log Number":"US-02032009-0016","Case Number":"15293"}