{"files":["/var/www/straped/mufon/html2text/15295.html.txt","/var/www/straped/mufon/org/15295.html"],"Case Number":"15295","Log Number":"US-02032009-0018","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","trends":["There have been 2 other sightings in Robstown","There were no other sightings in Robstown on or around February 1st 2009"],"Object Features":"None","Country":"United States","Object Shape":"Bullet, Missile, Cigar","Date Submitted":"02/01/2009 07:17 UTC","Tags":"City","Latitude":"27.790303","divs":["Sighting DetailsI left Robstown Texas at about 7 PM heading north on US 77. Then 77 fed onto I37 from Corpus Christi to San Antonio. I was driving along and noticed a dark object moving about the same speed as I was. It seemed to increase in number from 1 up to 4 from time to time. I took notice of the next mile marker which was 42. I then rolled my window down to see if perhaps there was something on my window creating the affect, plus to listen for noise. The spot(s) were still there, but I heard no noise other than my car and general traffic noise. The spot(s) were dark and the best I could describe the shape was from a cigar shape to a disc (flat)shape. I flashed my lights on and off to signal I had seen them... and anytime a car passed me, I pointed my arm out the window towards the spots... hoping someone else would look in that direction. I watched the spots for about 6 miles... then they dissappeared. I made mental note of the time, 7:17PM and the next mile pole, which was 48. The spots did not reappear. Feel free to contact me at {pid} or my phone number above. {pid}"],"City":"Robstown","Date of the Event":"02/01/2009 07:17 UTC","Summary":"Viewed 1-4 dark objects emitting no light nor sound for about 6 minutes.","Region":"Texas","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-97.668884","map":"<A HREF = \"http://maps.google.com/maps?q=27.790303,+-97.668884(15295)&iwloc=A&hl=en\"> mufon case (15295) map </A>","Viewing Distance":"101-500 Feet","Disposition":"Unknown"}