{"Object Features":"Undisclosed","divs":["Sighting DetailsI walked onto my back porch to smoke a cigarette, and as I sat down I noticed what looked at first to be an extremely bright star, or an aircraft of some sort. As I watched it I noticed it was changing colors from blue to red to orange to green.... then it went completely bright white, then would start with the series of colors again. I stood up and walked to the edge of my porch to watch it more intently and noticed that it looked like it was going from wide to thin , wide to thin, almost like it was rotating. It never moved closer or further away. It stayed in the same spot almost hovering. I watched it for about 20 minutes, while calling a friend on the phone, and calling my son & husband out to see it. Finally, i walked inside to get my son's telescope, and when I came back out it was gone. This was a duration of less than a minute. As i was standing outside looking to see where it had gone I noticed something that looked exactly like what I had seen before, but in a completely different direction, and further away this time. A plane or jet could not have traveled this distance in this short amount of time. It was putting on the same light show that the first object I had seen was. Then, I called a friend again to tell them what I had seen, and about 7 minutes into the phone call a bright light streaked over my house. It was like a shooting star, but it was one long string of light and much brighter than any shooting star I've ever seen. It zipped across the span of the sky in a second or less. It was faster than the anything I've ever seen, so fast like I said , that it was just a streak of very bright light, like a lazer beam. I finally went back into the house about an hour after all of this began, and the second object I had seen further off in the distance was still there, putting off a brilliant light show, never moving from that spot. I have never been interested in UFO's or payed much attention to claims of sightings, but I know I've never had any kind of experience like this before, and I hope I don't ever again. I just wanted to tell this story in the hopes that someone else will have reported it also. I can't have been the only one to see it. It was there for too long. Anyway, thanks for listening."],"Object Flight Path":"Undisclosed","Date of the Event":"02/02/2009 08:15 UTC","Case Number":"15291","Summary":"[tg] It looked like a bright star, but changed colors constantly, stayed in the same spot but almost looked to be rotating.","Weather Factors":"Unknown","Log Number":"US-02032009-0014","Object Shape":"Circle, Sphere, Star-like","Longitude":"-86.452237","map":"<A HREF = \"http://maps.google.com/maps?q=32.470474,+-86.452237(15291)&iwloc=A&hl=en\"> mufon case (15291) map </A>","Viewing Distance":"Unknown","Date Submitted":"02/02/2009 08:15 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15291.html.txt","/var/www/straped/mufon/org/15291.html"],"Source":"MUFON","Disposition":"Unknown","Country":"United States","trends":["There have been 3 other sightings in Prattville","There were no other sightings in Prattville on or around February 2nd 2009"],"Tags":"City","Latitude":"32.470474","City":"Prattville","Region":"Alabama"}