{"Summary":"Silent hovering craft directly above (aprox. 150 ft).","Sighting Duration":"Undisclosed","Object Features":"None","Longitude":"-122.641644","Tags":"City","Viewing Distance":"101-500 Feet","City":"Oak Harbor","divs":["Sighting Details4 friends and I slept out in the field behind my house. we were all about 12 years old at the time. something that made no sound, \"floated\" over from the far end of the field and hovered directly above us. we were all in sleeping bags at the time and looking straight up. I remeber asking \"do you see that?\" and everyone agreeing that they were in fact staring at somthing that we could not explain. I have often wondered why we were not at all scared. seems strange. anyway, the next thing I know I'm waking up, still in the same place. not sure why or how long i've been sleeping, but the object is still there and ALL of us had fallen asleep and woke up again at the same time. (is it just me or does that seem kind of strange??) We continued to look at the object for a short time (few minutes?) then the object began to \"float\" off, continuing in the same direction that it was headed when it stopped to hover over us. when it had traveled about 100 yards away it stoped and hovered briefly, and then abruptly \"shot\" up and disappeared completely. The next morning, I mentioned the encounter to my mom and she just kind of laughed and thought i was joking. one of the strange things about this encounter, is that us kids never again talked about what we had seen. It has been a lot of years since this happened and although I know what took place that night, because we never talked about it, I have always had a 1% reservation about what I remembered. I have wondered \"did i just dream this??\" \"did it REALY happen??\". I recently became a member of facebook, the online comunity and was contacted by one of the other people that was there that night.(I have long since lost contact with everyone that was there) It was interesting that he made it a point of asking me what I remembered from that night. I now have no reservations about whether this realy happened. Over the years, one of the things that has gone unanswered, regarding this night, was whether or not there was any \"loss of time\". When my friend contacted me, he was able to provide an answer: yes, he had glanced at his watch prior to falling asleep and then again after we all woke up. According to what he is telling me, he believes that we lost about an hour. this is about all of the info that I can provide, regarding this episode at this time and hope that perhaps you guys could provide me with some feedback regarding this. I'm wondering if you have had any other sightings from this area? Does any part of my description of events match what others have seen? any information you could provide would be great. now that i am in contact with one of the other four who were there, I believe that with a little bit of effort, I can probobly still locate at least one more of the people who were there that night. It will be interesting to see what he says, if i can find him. two more things really quick before i go: My grandmother had an encounter in the california desert, at verry close range, as well. I have wondered if these two encounters are not some how conected?? I also have something just under the skin of my right fore arm that I have also wondered if it may have been \"put\" there. It is my hope to convey my sincerity regarding everything that I have told you. THIS REALY HAPPENED. thank you."],"Country":"United States","Date Submitted":"11/30/1979 12:00 UTC","Object Shape":"Square, Rectagular","Disposition":"Insufficient Data","Case Number":"15290","Latitude":"48.301976","Log Number":"US-02032009-0013","Weather Factors":"Unknown","Date of the Event":"11/30/1979 12:00 UTC","files":["/var/www/straped/mufon/html2text/15290.html.txt","/var/www/straped/mufon/more/15290_submitter_file1__Nolan0214090001.jpg","/var/www/straped/mufon/more/15290_submitter_file2__Nolan0214090002.jpg","/var/www/straped/mufon/more/15290_submitter_file3__Nolan0214090003.jpg","/var/www/straped/mufon/org/15290.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.301976,+-122.641644(15290)&iwloc=A&hl=en\"> mufon case (15290) map </A>","Source":"MUFON","trends":["There have been 8 other sightings in Oak Harbor","There were no other sightings in Oak Harbor on or around November 30th 1979","This sighting has never been favorited.",""],"Region":"Washington","Object Flight Path":"Hovering then path,Path then hovering"}