{"files":["/var/www/straped/mufon/html2text/15294.html.txt","/var/www/straped/mufon/org/15294.html"],"Log Number":"US-02032009-0017","Source":"MUFON","Summary":"Flashing strobing very passive and slow moving strange articulations.","Date of the Event":"02/02/2009 12:00 UTC","Case Number":"15294","Country":"United States","Object Shape":"Triangle","City":"Mesa","Object Features":"Appendage(s)","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.424594,+-111.829612(15294)&iwloc=A&hl=en\"> mufon case (15294) map </A>","Longitude":"-111.829612","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Date Submitted":"02/02/2009 12:00 UTC","Tags":"City","Weather Factors":"None","Disposition":"Insufficient Data","divs":["Sighting Detailsi went out back to smoke a cigarette and sat in my patio chair, it was an extremely clear night and i was looking at all the stars and activity in the sky. one star, i presumed was a star; was awful strange looking to me, like it had appendatures with lights running up and down it. i thought to myself this must be the space station or something like that. i was joking around and talking to it and asking it to move and it did. from my point of view in relation to the sky looked like it moved about one inch. i'm sure i seen some kinda pulses come off of it several times....maybe orbs. anyhow, i went back inside and watched a movie pretty much dismissing it. a couple a hours later i came back out and it was still up there, flashing different colors up and down its spines. i went out and looked at it several more times the last time being about three am. i wanted to go to the shop and get my telescope and probably should have; i just kept thinking ...this is the skylab or a sattelite or something or if i go to get me telescope it will probably disappear. the last time i looked at at three in the morning it had moved to the western part of the sky, as i'm facing south it put it right in between my tree branches; it got really vibrant, the light's were really strobing out. i enjoyed watching it and laughed a little..figured if i was seeing it so were other people. i don't know what it was for sure but the one time it moved that's for sure..it was a definite movement the rest of the time it seemed like it just floated along. i went to bed. i will watch for it again tonight."],"Sighting Duration":"Undisclosed","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around February 2nd 2009"],"Latitude":"33.424594"}