{"Disposition":"Unknown","Date Submitted":"01/03/2009 02:10 UTC","City":"Mesa","divs":["Sighting Details I had just arrived home from work, and had just gotten out of my truck to go inside when I looked up in the sky, and saw a strange looking silver color disc shaped object moving across the sky making no noise of any kind. I am not sure how high in the sky the object was or how big it was due to it being in the sky directly above me with nothing to reference it to. It did seem to be very high in the sky though. It was moving at what seemed to be the same speed that a normal jet liner would travel with the exception that is seemed to be moving forward and then it would leap or jerk ahead. Then it would resume it's normal pace and repeat this leaping, jurking maneuver several times. I observed this object for about 30 seconds and then it just disappeared while it was heading in a north west direction. We have aircraft traveling over head all the time making their final approach to Sky Harbor Airport in Phoenix, So I'm very familiar with all the different types of jet aircraft that are in the skies over Mesa, Arizona. I also was in the US Navy for several years and I was stationed aboard an aircraft carrier, so I am very familiar with military jet aircraft as well. It really made me stop and wonder what it was that I was looking at, and one thing I know for sure, it was not an aircraft that I've ever seen before. I don't know if this is of any significance or not, but I felt that I needed to report the sighting. Thanks for you time, Martin Fernandez"],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 73 other sightings in Mesa","There were no other sightings in Mesa on or around January 3rd 2009"],"Region":"Arizona","Longitude":"-111.823932","Date of the Event":"01/03/2009 02:10 UTC","Summary":"I saw a disc shaped opject moving from the south east ,to the north west.","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Latitude":"33.421274","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=33.421274,+-111.823932(15296)&iwloc=A&hl=en\"> mufon case (15296) map </A>","Tags":"City","Case Number":"15296","Object Features":"Other","files":["/var/www/straped/mufon/html2text/15296.html.txt","/var/www/straped/mufon/org/15296.html"],"Log Number":"US-02032009-0019"}