{"Object Flight Path":"Undisclosed","Object Shape":"Boomerang","Tags":"City","Viewing Distance":"Unknown","Summary":"Driving home at night and saw three boomerangs in the sky.","Latitude":"39.660115","Longitude":"-75.09212","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15309.html.txt","/var/www/straped/mufon/more/15309_submitter_file1__P1010689.JPG","/var/www/straped/mufon/more/15309_submitter_file3__P1010688.JPG","/var/www/straped/mufon/org/15309.html"],"Date Submitted":"01/10/2009 07:15 UTC","Region":"New Jersey","divs":["Sighting DetailsMy mother and I had just had a normal day, seeing relatives and shopping and such. When it was time to go home we decided to take a quiet stretch of road near all the orchards. It was just a little past dinnertime. (Around 6:30) At first I noticed nothing. But my mother said- \" Those can't be the water tower lights.\" That's when I noticed them. I thought they could be some kind of normal airplane doing a scout of the sky, being just ten days before the inauguration. Where we were going we had to drive right under where it was then. Driving closer we saw through the trees it was in the same exact spot, and it wasn't just one, but three! All three in a V-like formation, the one at the top had five lights, one just a bit lower and to the right had three, and the one to the lower left had two! All different aircraft! We stopped in a convienience store parking lot to just watch these things. They hovered there for a while. When we saw two normal easily identified airplanes fly past, we knew these things were mysteries. My mother and I were just amused watching these things. Slowly the things started moving forward, slow as a blimp would, (But we knew it wasn't a blimp because we could see the strange outline.) and we decided to just leave."],"Weather Factors":"Unknown","City":"Clayton","Sighting Duration":"00:20:00","Log Number":"US-02042009-0008","Country":"United States","Case Number":"15309","Date of the Event":"01/10/2009 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.660115,+-75.09212(15309)&iwloc=A&hl=en\"> mufon case (15309) map </A>","Disposition":"Unknown","Object Features":"Undisclosed","trends":["There has been one other sighting in Clayton","There were no other sightings in Clayton on or around January 10th 2009","This sighting has never been favorited.",""]}