{"Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was exiting my house at approximately 9:00-9:15pm. I looked into the western to northwestern sky and noticed a VERY bright, Orange and Reddish in color object. It just seem to be suspended there in the sky. At first I just passed it off as a planet and went back inside. About 1 minute later I came back out to get into my vehicle and noticed it was still there. I began driving to my girlfriends house, just so happened to be in the same direction as the object. While I was in route to my girlfriends residence I began to observe the object more closely. I then became aware that there was no way it was a planet or a star. It was to big. For example if u held a dime or penny out arms length and looked at it in the sky thats about how big it was. It was also way to bright. I also do dabble in astronomy and know my stars, planets and constellations well. Ive also been in law enforcement for 7 years or more. I have been trained to observe things and situations. As I kept observing the object for the next 5 minutes or so. It then shrank and then totally vanished. Approximately 3 to 5 seconds later it reappeared a lot farther away in the same direction. I seen it do this 2 more times in about 5 more minutes before I lost sight of it. It had to have been traveling at incredible speed to blink out and then reappear that far away. I was amazed by this!!! Ive have seen a similar object about 3 to 4 years before. When I was working for a sheriffs department we were receiving phone calls about strange objects in the sky. Me and another officer went to check it out. When we were in route to a certain town I observed 4 VERY bright, orange reddish objects suspended over the town. They were in a perfect line, perfectly spaced. While we were driving we lost sight of the town and the objects. When the town came back into view the objects were gone."],"Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Jefferson City","There were no other sightings in Jefferson City on or around January 29th 2009"],"Case Number":"15304","Sighting Duration":"00:15:00","Date of the Event":"01/29/2009 12:00 UTC","Longitude":"-92.164316","City":"Jefferson City","Object Features":"Unknown","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/15304.html.txt","/var/www/straped/mufon/org/15304.html"],"Summary":"Very bright, orange red in color.","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.582622,+-92.164316(15304)&iwloc=A&hl=en\"> mufon case (15304) map </A>","Date Submitted":"01/29/2009 12:00 UTC","Log Number":"US-02042009-0004","Latitude":"38.582622","Weather Factors":"Unknown","Disposition":"Unknown","Region":"Missouri","Country":"United States"}