{"divs":["Sighting DetailsAt 7 PM I looked out my window to see if any repair crews were outside to repair a downed power line. No crews were there, but I noticed a very large object in the southern sky traveling from east to west. I went outside to try and get a better look. It was very slow and flying very low (500' - 1000'). I thought it might be a blimp, but it had no markings as most blimps do. The shape appeared to be like an over inflated football. The bottom half appeared to be illuminated with a white light. There was a small solid green marker light at each end, and a flashing red light at the top center. There were other aircraft visible at the same time. I could see what appeared to be a helicopter traveling west and south of it. Another helicopter traveling west and north of it. It was later trailed by a prop driven plane. If it was a blimp, then why didn't it have a gondola? If it was extraterrestrial, then why did it have the marker lights? I watched it for about 15 minutes until it traveled west and out of site behind a tree line. It appeared to be traveling parallel and just north of the interstate 10 freeway in Fontana, CA. After losing site of the object, I came back into the house and looked on the internet trying to find a description of where marker lights are supposed to be located on blimps. No luck finding any description there. This object was very visible, and should have been seen by many people. I just want to know what it was, and if anyone else had seen it on February 3, 2009."],"Longitude":"-117.428648","Log Number":"US-02042009-0007","Date of the Event":"02/03/2009 07:00 UTC","Country":"United States","Disposition":"IFO","Tags":"City","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.098994,+-117.428648(15308)&iwloc=A&hl=en\"> mufon case (15308) map </A>","Region":"California","trends":["There have been 16 other sightings in Fontana","There were no other sightings in Fontana on or around February 3rd 2009"],"Object Shape":"Blimp","Latitude":"34.098994","Summary":"It was not like any other blimp that I have ever seen.","files":["/var/www/straped/mufon/html2text/15308.html.txt","/var/www/straped/mufon/org/15308.html"],"Date Submitted":"02/03/2009 07:00 UTC","City":"Fontana","Case Number":"15308"}