{"City":"Buffalo","Object Flight Path":"Straight-line path","Source":"MUFON","Viewing Distance":"101-500 Feet","Latitude":"42.891047","Object Features":"None","Object Shape":"Triangle","Disposition":"Unknown","Weather Factors":"Does Not Apply","divs":["Sighting DetailsMe my son and my neighbor and his nephew were in my neighbor's backyard viewing the stars towards the south. My neighbors nephew saw it first, It came right over the trees with no noise.It was about 1200 to 1500 feet across. It had bright white lights at each tip of the triangle and had five rectangular white lights that were going from left to right in a strobe fashion. There was also green and red lights at each point around the five rectangualr strobes. You could tell it was solid because you could not see any stars through it. The craft was going very slowly right over our houses. I had my digitial camera the the time, I set it to take video but the camera would not turn on. I also had just put in brand new batteries in the camera. We all knew right away that this was not a craft from our earth. We were all dumbfounded and excited and scared at the same time. There was no noise at all it just cruised real slow over our houses and kept going to the north. Afetr we lost sight of the object my camera began to work perfectly? we watched it until it no longer was visible. After the sighting we stood outside trying to think of what it could of possibly been. We quickly came to the same thought that this was a ufo sighting and deffiantly not anything a human is capable of making or will ever be able to make in the near future."],"trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around July 15th 2007","This sighting has never been favorited.",""],"Tags":"City","files":["/var/www/straped/mufon/html2text/15305.html.txt","/var/www/straped/mufon/more/15305_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/15305_submitter_file2__6686_6010741714.jpeg","/var/www/straped/mufon/more/15305_submitter_file3__darkstar_01s.jpeg","/var/www/straped/mufon/more/15305_submitter_file4__dragon-drone.jpeg","/var/www/straped/mufon/org/15305.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.891047,+-78.876949(15305)&iwloc=A&hl=en\"> mufon case (15305) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-02042009-0004","Longitude":"-78.876949","Case Number":"15305","Country":"United States","Region":"New York","Summary":"Perfect triangle shape 1500 feet across 5 rectangular white strobe lights in middle of craft white lights at all three tips with green and red lights near the strobe lights.","Date of the Event":"07/15/2007 03:15 UTC","Date Submitted":"07/15/2007 03:15 UTC"}