{"Latitude":"32.40596","trends":["There have been 4 other sightings in Clyde","There were no other sightings in Clyde on or around January 29th 2009"],"Summary":"While traviling east on I-20 my husband and I saw a series of lights that blinked on then off and rapidly moved out of sight.","Disposition":"IFO","Region":"Texas","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy husband and I were driving home, eastbound Interstate 20, from Abilene, TX. We had just passed Clyde, TX and I noticed a light out of the passenger side window. I looked up and saw a row of round, symmetrical orange lights (resembling the caution light in a traffic signal light). At first there were approximately three lights then slowly, a couple more lights blinked on, then rapidly a couple more lights blinked on. The aircraft was not really visible escept for a faint outline. It appeared to be a large body that reminded me of the aircraft used by the military to take troops in and out of war zones when in battle(maybe called banana boats or something similar to that). Again, it was just an impression of that shape, not exactly because it was not clearly visible. The object was moving quickly and it made the right edges of each circle look blurred as if it might be fire. The lights began to blink off slowly at first from the right end of the row, going left, then in rapid succession they all blinked off, just like they did when they were blinking on in the opposite direction from left to right. The only thing visible after this was a blinking whitish light at what seemed to be the front of the aircraft. I watched it for maybe a minute as it moved east and was no longer visible. My husband was driving and he saw it at the same time I did, but he kept driving, just taking glances at it. We wwere both amazed as we realized we were seeing something that we did not recognize as any aircraft lights we had seen before. I told my family about it when we got home and we watched the 10:00 pm news and did not see any mention of it. The Abilene Reporter News did not have anything about it either the next day. However, when I got to work the next day, an associate made a statement to me saying that I would not believe what he saw last night. I started to get excited when he said that he was outside at Lake Cisco in Cisco, Tx (approximately 25-30 miles from where we had seen the lights) around dusk when he saw some lights and that the craft looked like it might have had fire coming from it. We talked about the shapes,color, blinking and movement and it was apparent that we had seen the same thing. The associate looked around the internet that day and could not find anyone else who had reported a similar sighting at that time."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/15310.html.txt","/var/www/straped/mufon/org/15310.html"],"Date Submitted":"01/29/2009 12:00 UTC","Date of the Event":"01/29/2009 12:00 UTC","Viewing Distance":"Unknown","City":"Clyde","map":"<A HREF = \"http://maps.google.com/maps?q=32.40596,+-99.493691(15310)&iwloc=A&hl=en\"> mufon case (15310) map </A>","Case Number":"15310","Log Number":"US-02042009-0009","Object Features":"Undisclosed","Longitude":"-99.493691","Tags":"City","Object Shape":"Blimp, Cigar, Other","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}