{"Log Number":"","Weather Factors":"Unknown","Sighting Duration":"00:00:59","Object Features":"Undisclosed","divs":["Sighting Details1. I was driving compass E (nominal S) on US 101 about 10:00 am, Thurs, Jan 10. I was somewhere near the Patterson Exit, near the Santa Barbara - Goletaborder.2. I was already admiring the clear blue sky.3. I had no clue what Iwas looking at when I first noticed it.4. I was puzzled why the pilots wouldneed to fly such advanced craft in a v, why the lead group were flying in aclump, why they were being so brazen as to fly in broad daylight over a busyhighway.5. Assuming they were 150 ft in diameter (wild guess), they were flyingstraight at about 500 mph at around 10-12,000 ft altitude. The lead clump of5(est.) were leading the second group (in the v) by about 20 craft length, maybe1000 yards. The echeloning group were spaced about 5 craft lengths apart, maybe250 yards. These estimates are based on a diameter of 150 feet. But the shipscould have been much smaller or larger. They were about 5-10B0 from vertical, compass north from my car, flying right above and parallel tothe mountain ridge above the town.6. As I was driving well over 60 mph, I had tokeep my eyes mainly on the road. I could only glance at the sky and drivesafely. When I glanced back, they had disappeared. I dont know how, but itmust have been impressively fast, as to do so would have required X-15-likespeed, a cloaking capability, or both."],"Disposition":"Unresolved","Tags":"City","Latitude":"34.42347","Country":"United States","Summary":"5 silvery discs flying in v lead by 5 more in clus","files":["/var/www/straped/mufon/html2text/1531.html.txt","/var/www/straped/mufon/org/1531.html"],"City":"Santa Barbara","Viewing Distance":"Over One Mile","trends":["There have been 20 other sightings in Santa Barbara","There were no other sightings in Santa Barbara on or around January 10th 2002"],"Longitude":"-119.69051","Date Submitted":"01/10/2002 10:00 UTC","Object Shape":"Disc","Object Flight Path":"Straight-line path","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.42347,+-119.69051(1531)&iwloc=A&hl=en\"> mufon case (1531) map </A>","Region":"California","Date of the Event":"01/10/2002 10:00 UTC","Case Number":"1531"}