{"divs":["Sighting Detailsmy wife and i was talking on the phone while she drove home from work. a few minutes before 7 pm my wife told me she see something in the sky. she sees three very bright lights in the sky. she was on the main street leading to our house, which is also higest point in town. she tells me to hurry out side and see if i can get a glimps at the lights. she says that there are 3 huge white lights in the sky .she lost sight of them when she made the corner of our road. when she made it to the house she asked me if i had seen anything, and i replied no. so we procrastinated for a while looking into the sky. out of the east i see a plane, i thought at the time. out of the north i see another plane, commercial liner. we was focused on the commercial plane when we notice the first obtect wasnt a plane. while approaching it looked a plane with the landing light on there for we didnt think anything of it. when it got completely over head we could see that there was a triangle formation of red lights. 1, 2, 3 of them. the flew right over the commercial plane. the 3 objects was giving off some much lighe around them that we could actually see the air plane and its vapor trail. it was like daylight when they passed over the plane. the flew in a straight line at a rate a bit slower than the plane. we tried to follow it to get pics but was unable... camcorders sux at night. so we lost sight of them. we looked for awhile then gave up. we got back to the house and as soon as we got out of the car we spotted 3 more red triangles of lights. this time they were in a triangle pattern. they where coming from the southeast, and appeared to be heading to the direction the first group went. it was about 7:30 pm then. we take this seriouse because after the sighting the jets started patroling the skys. there is an airforce base about and hr and a half from here. and we always notice the jets are coming from that directions. the base is barksdale in shreveport la. and im sure the commerial plane is out of the airport there. so if anyone wants to do some follow up. im sure someone on the plane noticed lights outside illuminating the entire plane."],"trends":["There have been 9 other sightings in Junction City","There were no other sightings in Junction City on or around February 4th 2009"],"City":"Junction City","Object Shape":"Triangle","Country":"United States","Disposition":"Unknown","Log Number":"US-02042009-0016","Tags":"City","Latitude":"33.02395","Object Flight Path":"Undisclosed","Case Number":"15317","Longitude":"-92.718024","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"02/04/2009 07:02 UTC","Source":"MUFON","Region":"Arkansas","files":["/var/www/straped/mufon/html2text/15317.html.txt","/var/www/straped/mufon/org/15317.html"],"Viewing Distance":"Unknown","Date of the Event":"02/04/2009 07:02 UTC","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.02395,+-92.718024(15317)&iwloc=A&hl=en\"> mufon case (15317) map </A>","Summary":"6 triangle shape objects."}