{"Weather Factors":"Does Not Apply","Object Shape":"Undisclosed","City":"Roswell","map":"<A HREF = \"http://maps.google.com/maps?q=34.027915,+-84.354193(15318)&iwloc=A&hl=en\"> mufon case (15318) map </A>","trends":["There have been 7 other sightings in Roswell","There were no other sightings in Roswell on or around October 30th 1999"],"Case Number":"15318","Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/15318.html.txt","/var/www/straped/mufon/org/15318.html"],"Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","Summary":"Triangle.","Object Features":"Undisclosed","divs":["Sighting DetailsThis isn't a joke and I have lived with it for a very long time. Since the time I saw this craft I have learned so much about . . . evrything that it almost relegates my sighting to nothing. However - it is my greatest desire to be hypnotisised and have someone get all of the . . .info . . .out of my head. I am tired of what I have seen and what I have since learned. As far as the sighting. You will find many other peopl have had the same sighting as myself. It Was nearly or more than a decade ago. I was heading west on lower Roswell rd away from Azalea it was after timber Ridge road and up a hill I passed the affluent neighborhood of - oh heck - I can't remember it now. It has all sorts of nice homes. After Lower roswell rises from the river it makes a sharp turn to the left, It then turns sharply to the right. kind of like a long angle iron. I was on a pizza delivery and came up lower Roswell RD and turned left with the RD I could see that,very far ahead of me above the trees in the distance, where the rd turned left that there was a triangular black craft hovering above the trees where the RD turned west again. I have to say that I was shocked but I had a job to do. I kept heading towaRD IT. this turn shoulod be easy to find on a map it's one large Z. When I was nearly under it - you want to know what the lihgt arrangement was. OKay I was so scared that all I recall remember was that there was one very bright light at each one of the 3 corners. I do seem to rememmber that there was an accumulation of lights at the center but I t honestly say that the one in the center was red but I have this feeling that it was. I was headed straight for this object and then of course the road changed and I turned to the right - and so I made a right turn - at this point the stationary aircraft moved along side of my car and kept pace with me until we approached the nearby lights and then it veered south or left. I have seen this same aircraft twice since then and other sightings. I am an accountant and not a crackpot. But I want others to have my knowledge as it has felt as a weight on my soul."],"Date Submitted":"10/30/1999 09:45 UTC","Longitude":"-84.354193","Latitude":"34.027915","Region":"Georgia","Log Number":"US-02052009-0001","Date of the Event":"10/30/1999 09:45 UTC","Disposition":"Insufficient Data"}