{"trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around February 3rd 2009"],"Case Number":"15311","Summary":"Fire-shaped light out over Pacific Ocean near Santa Catalina Island.","map":"<A HREF = \"http://maps.google.com/maps?q=33.430033,+-117.610012(15311)&iwloc=A&hl=en\"> mufon case (15311) map </A>","Longitude":"-117.610012","Date of the Event":"02/03/2009 12:30 UTC","Sighting Duration":"Undisclosed","Object Shape":"Fireball","Log Number":"US-02042009-0010","Object Features":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Object Flight Path":"Stationary","Region":"California","City":"San Clemente","files":["/var/www/straped/mufon/html2text/15311.html.txt","/var/www/straped/mufon/org/15311.html"],"Weather Factors":"Unknown","divs":["Sighting DetailsI had just gotten off of work after midnight and was taking home a co-worker when looking out over the ocean we both noticed an unusual bright orange light several miles off the coast. Being curious, instead of going straight home we decided to see if we could get a better view of it by driving along San Clemente, California up in the hills parallel to the coastline. We noticed the light stayed constant and bright as we drove south parallel along the coast. We finally stopped down by a beach parking lot where we had a clear view out to sea. We could not understand what this object could be nor could we make out what this light was. We asked ourselves what could be out there this late at night on the ocean waters, perhaps a fishing boat with bright lights? Do any boats go out this late with bright lights to fish for something? If it was a boat fishing why would the light vary in intensity and with that particular color (orange)? Could it be a boat on fire? The light was firelike in intensity and color as if it was on fire. Even though it was dark, I figured it must have been a few miles south of Santa Catalina Island and a few miles west off San Clemente. We stayed there for several minutes watching this light glow and change in its shape. At one point the light dimmed to a point and then returned to its large intensity. We decided to leave and go home still puzzled. We must have watched it for around 15 minutes from point of seeing it to end."],"Latitude":"33.430033","Country":"United States","Date Submitted":"02/03/2009 12:30 UTC","Disposition":"IFO","Tags":"City"}