{"Object Shape":"Triangle","Longitude":"-95.535962","Case Number":"15314","Log Number":"US-02042009-0013","divs":["sighting detailsufo: large black triangle sighting size: estimated size was 3-4 times larger than southwest airlines jet. altitude: estimated 2,000 ft. to 3,000 ft. agl duration: 30 seconds. direction: vehicle was traveling east. speed: 150 to 200 mph date: feb. 04, 2009 time: 12:26 am weather: clear skies, stars, and excellent unlimited visibility. location: missouri city texas 77459 \\ just south of houston. sighting: viewed with gen3 night vision scope. description: it is important to note that the vehicle had 5 large ir lights on the right side of the wings. 2 lights located near the front of the leading edge, and 3 additional ir lights along the far edge of the right wing. these light were not visible to the naked eye, they were ir like military and very visible through the scope. as the vehicle flew over head the back round star field was blocked from view as it passed over. location: latitude: n29 35.4897' \\ longitude: w95 34.5314' large black vehicle flew over headed east at through hobby airport controlled air space without any typical visible marking or strobe light. normal heavy southwest airline air traffic was present at the time on final approach to hobby airport. sighting lasted about 30 seconds and was viewed with gen 3 night vision scope. vehicle speed estimated at 150+ mph no typical aircraft marking light or anti collision strobe light. the 5 ir lights on the right side were visible through the scope only."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Source":"MUFON","City":"Missouri City","Latitude":"29.621587","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/15314.html.txt","/var/www/straped/mufon/org/15314.html"],"Weather Factors":"Unknown","Date of the Event":"02/04/2009 12:26 UTC","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Missouri City","There were no other sightings in Missouri City on or around February 4th 2009"],"Country":"United States","Object Features":"Wings","Tags":"City","Date Submitted":"02/04/2009 12:26 UTC","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.621587,+-95.535962(15314)&iwloc=A&hl=en\"> mufon case (15314) map </A>","Summary":"Black triangle fly over with 5 IR lights on the right side wings."}