{"Date of the Event":"02/02/2009 10:45 UTC","City":"Gallatin","Region":"Tennessee","Longitude":"-86.44666","Object Shape":"Other","Case Number":"15313","Viewing Distance":"Unknown","Object Flight Path":"Unknown","files":["/var/www/straped/mufon/html2text/15313.html.txt","/var/www/straped/mufon/more/15313_submitter_file1__strangecloudinthesky2.jpg","/var/www/straped/mufon/more/15313_submitter_file2__strangecloudinthesky1.jpg","/var/www/straped/mufon/more/15313_submitter_file3__strangeeyeintheclouds.jpg","/var/www/straped/mufon/org/15313.html"],"Disposition":"IFO","Summary":"Strange object or cloud in the sky.","Weather Factors":"None","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.388381,+-86.44666(15313)&iwloc=A&hl=en\"> mufon case (15313) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Date Submitted":"02/02/2009 10:45 UTC","Latitude":"36.388381","trends":["There have been 3 other sightings in Gallatin","There were no other sightings in Gallatin on or around February 2nd 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy wife and I were traveling south from Gallatin, Tn. on Hwy 109; we noticed a strange cloud or object to the southeast. We thought it was a break in the clouds because it was overcast. What was so unusual was that the phenomenon was shaped like an eye and the upper edge was a rainbow color. It was pale blue in the center, but you could not see any clouds moveing behind it. Also, there were never any heavy clouds moving in front either. The only clouds that moved in front of this phenomenon were perpendicular and very thin. It seemed that the pencil thin clouds were pulled form the overcast sky and moved over the eye area and than dispersed. We watched this happen approximately seven times. We were hoping that by contacting MUFON your organization might help us understand what we saw. Just a note; as we were traveling on HWY 109, there was a car pulled over and a genterman was taking pictures. We took four pictures using our Verizon camera phone. I'm sending three with this report and the light at the top of the picture is glare from the windshield. Thanks for any information.................Mike"],"Log Number":"US-02042009-0012"}