{"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Case Number":"15312","Country":"United States","Latitude":"41.01807","Log Number":"US-02042009-0011","City":"Ottumwa","files":["/var/www/straped/mufon/html2text/15312.html.txt","/var/www/straped/mufon/org/15312.html"],"Object Flight Path":"Hovering then path,Path with directional change","Summary":"Pulsing white and amber sphere hovering and darting over town.","Source":"MUFON","Object Shape":"Sphere","Date Submitted":"02/02/2009 09:10 UTC","Region":"Iowa","Sighting Duration":"Undisclosed","Object Features":"Unknown","Longitude":"-92.415463","Weather Factors":"Light","map":"<A HREF = \"http://maps.google.com/maps?q=41.01807,+-92.415463(15312)&iwloc=A&hl=en\"> mufon case (15312) map </A>","Date of the Event":"02/02/2009 09:10 UTC","divs":["Sighting DetailsOttumwa , Iowa 9:00 pm 2-3-09 My friend was on his way driving to pick me up . On his way he notices a bright light hovering above the high school football field. He picks me up and tells me to check out something and we go over the hill on iowa avenue and he says \"look\" i see it right over what i can say is either the field itself or over the center of town. It is a bright white light and sitting there , i think is this a helicopter coming dead on at first. I roll down the window and no sound and so sign of red or blue lights ? So we turn the corner and shortly after the thing begins to Pulse and turns from white to a amber color with a white streak to the left and is gone! We are looking in the same area and then look and see it way off to the south west of town but dimmer . It is in the direction of the mall , now we begin to trip out !!! Now this is where we are not sure it is the same thing or another craft . So we head towards its direction and this thing moves to the north west and then hovers over from what i can tell is the tree line and descends in a fielded area where mostly corn fields should be . I have portions of this footage on my digital camera and him on his cell phone during half the chase. Unfortunately i did not record the footage from when we first saw this thing at it's brightest. I will say it was as intense as the moon but smaller hard to say what size it was. It clearly was not a conventional air craft , planet , and performed excessive speeds. This was not a Chopper a Plane or Venus this was a moving object that traveled in 4 directions and changed color and defied what we know."],"trends":["There have been 8 other sightings in Ottumwa","There were no other sightings in Ottumwa on or around February 2nd 2009"]}