{"Latitude":"39.955025","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around February 4th 2009"],"Viewing Distance":"Unknown","Longitude":"-75.156819","map":"<A HREF = \"http://maps.google.com/maps?q=39.955025,+-75.156819(15322)&iwloc=A&hl=en\"> mufon case (15322) map </A>","Tags":"City","Source":"MUFON","divs":["Sighting DetailsWe were upstairs and my son was doing his homework and I was helping him. We have big windows and only half is covered by a shade. The top half of the window is uncovered. He looked up and yelled, UFO!! We both started to look out the window and then called my friend who has seen it before and has been looking for it again. As we looked we realized that there was more than one. There were three at first and then two more came and then two more came, there was up to seven but always two. They kept on flying in a large circle, they stayed around for a long time. Some breaking off and going thier own way, but always two flying in a circle for the enitre time. My son took pictures of them. One of pictures came out well. The others just look like lights in the sky. There were three large lights and then blinking lights, red and blue on the sides. Seemed to be two different types, one looked like a boomerang and the other more of an octagon. My son and friend went outside to look at them, there was no sound. It seemed as though they would stop and hover for less than a minute and then start to move again. I fell asleep before before they were gone, my friend went back downstairs and my son stayed up taking pictures of them and I am not sure what time he finally went to sleep but they were still there. They were not there this morning that we saw. I cannot attach the picture, it is on his phone and he doesnt know how to forward it to email. I will try to do that later when we are home."],"Disposition":"Insufficient Data","Region":"Pennsylvania","Object Flight Path":"Hovering then path,Path then hovering,Other","Date of the Event":"02/04/2009 12:00 UTC","Log Number":"US-02052009-0005","files":["/var/www/straped/mufon/html2text/15322.html.txt","/var/www/straped/mufon/org/15322.html"],"City":"Philadelphia","Date Submitted":"02/04/2009 12:00 UTC","Object Shape":"Boomerang, Other","Object Features":"Undisclosed","Case Number":"15322","Summary":"Up to seven at one time out the window of our home. My friend, myself and son saw them."}