{"Date of the Event":"02/02/2009 12:00 UTC","Tags":"City","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around February 2nd 2009"],"Source":"MUFON","Disposition":"Unresolved","Date Submitted":"02/02/2009 12:00 UTC","Viewing Distance":"Unknown","Summary":"Still big bright yellow light.","Object Flight Path":"Undisclosed","Longitude":"-79.375494","Case Number":"15328","Region":"Ontario","divs":["sighting detailsi was walking my dogs up hill on what turned out to be a dead end street in the silverthorn and rogers area of the city. when i realized it was a dead end, we turned back. the sky was clear and i was looking at the stars. i'm not sure but i think it was venus, the biggest star in the sky. not far from it i saw another bright light. it radiated a yellow light and appeared to twinkle. as i walked with my dogs in the direction of the light (west), i kept my focus steady on this light to see if it perhaps was a plane. i waited to see if it moved, if red lights appeared. there was nothing but the bright yellow light and i realized that there was no motion other than the twinkling-i can't be 100% sure but i watched this light for about 5minutes maybe a little more and there was no movement. i kept my focus steady, walked about half -3\\4 of a block staring at this light and still no motion. one of my dogs pulled and i litterally turned away for a few seconds, 3 seconds- no more than that- and when i turned back to look at it, it was gone. there was absolutely nothing obstucting my view in any direction, most of the houses in the area are bungalos, two story and the sky was clear. there is no way it could have been a plane or sattelite to have just disappeared so suddenly. there were no clouds. there was nothing that could have covered my view of it. it just disappeared. i continued my walk, looking up at the sky for at least another 25 minutes. it was just gone."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.657456,+-79.375494(15328)&iwloc=A&hl=en\"> mufon case (15328) map </A>","Country":"Canada","Object Shape":"Star-like","Log Number":"CA-02052009-0011","City":"Toronto","Weather Factors":"Unknown","Latitude":"43.657456","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/15328.html.txt","/var/www/straped/mufon/org/15328.html"]}