{"Date Submitted":"11/17/2008 12:00 UTC","Source":"MUFON","Sighting Duration":"01:00:00","Log Number":"US-02052009-0004","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","Summary":"Brownish red innertube shape with black ball in middle flat colors no lights.","Object Features":"Dome","Country":"United States","Region":"Alaska","divs":["sighting detailsmy son and i watched it for a half hour and took photos but they weren't the greatest but as we had them developed we noticed that there were 2 flying saucers instead of the one that we were looking at. if you need to know more than contact us at {pid} my son was on the computer and decided to take a break and as he looked out the window of our 2 story townhouse he yelled at me saying there was a ufo so i got up hoping he wasnt lying ,,,, cus i was sleeping at about 11:00 am and i looked out the window only to see a circular shaped flying saucer the color of a rustic brownish red fence the shape of an innertube with a black basketball in the middle all flat colored. not shiny. and no lights. just hovering in the sky not making any sound and not moving. for about 15 minutes. then i told my son to get the camera , but by the time we got it it was out of good range. but we caught 2 objects instead of just 1. and we didnt even know it till the film was developed. but i will go to my grave knowing that they do exist no matter what our government wants us to realize. and so will my son. but even moreso when i lived in sandiego about 20 years ago i saw a triangular ship with no lights about a quarter mile in size flying and hovering over san diego at about 1:00 in the morning. and before thqat i saw a blinking light at the age of 31 in the high desert going from star to star in the blink of an eye in the high desert of san diego and that was 24 years ago. i'm an optician with an associates degree not that that matters but i know that alien life does exist. and our govmts r to proud to admit that they might not be able to control there own destiny's {cms\\jat\\pid} text moved to narrative"],"Tags":"City","Case Number":"15321","Disposition":"Unknown","Longitude":"-149.896078","files":["/var/www/straped/mufon/html2text/15321.html.txt","/var/www/straped/mufon/more/15321_submitter_file1__Case153211.jpg","/var/www/straped/mufon/more/15321_submitter_file2__PICT1984case153212.jpg","/var/www/straped/mufon/more/15321_submitter_file3__case153213.jpg","/var/www/straped/mufon/more/15321_submitter_file4__PICT1986cae153214.jpg","/var/www/straped/mufon/more/15321_submitter_file5__PICT1987case153215.jpg","/var/www/straped/mufon/org/15321.html"],"trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around November 17th 2008","This sighting has never been favorited.",""],"Weather Factors":"Does Not Apply","City":"Anchorage","Object Shape":"Circle, Sphere","Date of the Event":"11/17/2008 12:00 UTC","Latitude":"61.219156","map":"<A HREF = \"http://maps.google.com/maps?q=61.219156,+-149.896078(15321)&iwloc=A&hl=en\"> mufon case (15321) map </A>"}