{"Summary":"At night 100ft over our yard were 5 craft glowing in center hovering they were aprox 15 to 20 ft. tip to tip that observed us and flew away very fast.","Object Features":"None","Log Number":"US-02052009-0003","Source":"MUFON","Date of the Event":"08/16/2004 11:00 UTC","Case Number":"15320","Region":"Oklahoma","Object Shape":"Diamond","map":"<A HREF = \"http://maps.google.com/maps?q=34.93773,+-95.760803(15320)&iwloc=A&hl=en\"> mufon case (15320) map </A>","Longitude":"-95.760803","Disposition":"Unknown","Date Submitted":"08/16/2004 11:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","divs":["Sighting Detailsi paul got in pool floating on my back torches were lit around pool area that blocked my view in direction of objects.patricia aprox 5min latter came out and reclined in lounge chiar just outside of torches and began pionting at the northeastern sky saying look look what are those birds . She said paul those arent birds look quick.in a hurry i estinguished the torch preventing my view of same area .When i witnessed 5 objects backing away at an angle of accent that would have kept them behind the light of the torch had it still been lit at that very moment they were aprox 1000ft high made an acute angle turn toward the southeast while simalltaniusly leveling altitude four of the ojects flew in a diomond formation while one separate darted around as if to scurry in the sky the lone oject shot past the other four at aspeed so fast it seemed to disapeer into a paralell diminsion in a milli second the four in formation did the same.there was never any sound at all none.patricia witnessed them at an altitude of 100ft in full view an drew a scetch of the objects i believe she had a close encounter as well as my self for even a longer period of time only i myself was not privi to it until she brought the objects to my attention. i think i had been oseverved for a while pryor to being informed we did report this sighting on an internet ufo site that i dont remember the name of.we were certain bacause of the speed and agillity of these objects combined with thier abillity to hover without sound that they were not man made ."],"Tags":"City","Latitude":"34.93773","trends":["There have been 6 other sightings in McAlester","There were no other sightings in McAlester on or around August 16th 2004"],"Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"United States","City":"McAlester","files":["/var/www/straped/mufon/html2text/15320.html.txt","/var/www/straped/mufon/org/15320.html"],"Weather Factors":"None"}