{"Longitude":"-94.035198","Log Number":"US-02052009-0013","City":"Texarkana","Sighting Duration":"Undisclosed","divs":["Sighting DetailsView attached Quick Time Movie for a complete description. Movie was taken at the location of the incident. NOTE: Where the UFO sat, it is had not grown over!! 1) Driving down the road, about 10am on a clear sunny Saturday 2) It was large and sitting just off of the road 3) Didn't know, but it sunk in and we (there were 2 of us) realized it was a 'flying saucer' 4) It was hovering just off the ground, appeared to be spinning, slowly, not hidden by trees but in open, plain sight about25 meters off the road 5) Shock, awe, scared 6) Drove away like hell Its taken over 40 years for me to come out with this. I am a retired military officer, Top Secret Clearance which I held at about this time, as I was working for the Federal Government then as a civilian. I am also a retired IT consultant, consulting to Fortune 200 companies. This has gnawed at me all of my life and its time to open up and talk about it. The attached QT movie is quite detailed as I remember this like it was yesterday. Please contact me if you are unable or have any difficulty in viewing it. I have reviewed it and it is OK. Thank you."],"Region":"Arkansas","Case Number":"15330","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.444412,+-94.035198(15330)&iwloc=A&hl=en\"> mufon case (15330) map </A>","Object Flight Path":"Stationary","Object Shape":"Disc","Disposition":"Unknown","Source":"MUFON","Summary":"Driving into town to buy auto parts and UFO was sitting on the side of the road.","Tags":"City","Viewing Distance":"21-100 Feet","Date Submitted":"09/15/1965 10:00 UTC","files":["/var/www/straped/mufon/html2text/15330.html.txt","/var/www/straped/mufon/org/15330.html"],"Latitude":"33.444412","Weather Factors":"None","Object Features":"None","Date of the Event":"09/15/1965 10:00 UTC","trends":["There have been 4 other sightings in Texarkana","There were no other sightings in Texarkana on or around September 15th 1965","This sighting has never been favorited.",""]}