{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in Delaware","There were no other sightings in Delaware on or around February 4th 2009"],"Longitude":"-83.061115","Region":"Ohio","files":["/var/www/straped/mufon/html2text/15341.html.txt","/var/www/straped/mufon/org/15341.html"],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI walked out to my porch to have a cigarette. While lighting it, i saw something out of the corner of my eye. I looked quickly and there was an extremely bright \"something\" in the sky not far above my house. My first reaction was \"Oh, my God\" and i felt stunned. My German Shephard was with me and she stopped, looked up and followed it with her eyes. She then ran to the corner of the garage as it was going in that direction. I lost sight of it when it went beyond my line of vision behind the garage, but I was so stunned I didn't move to follow it as my Shephard did. My first thought was that it was a plane on fire, heading toward the earth to crash and somewhere in my mind I remember thinking it was funny because there wasn't any noise. It was moving very fast and headed toward the ground. Please know this was not something far up in the sky like an extremely bright star, it was not far above my house. I was so stunned when it first happened, I couldn't move. When I regained my composure, I ran back in the house and told my husband. We live in the country and about a quarter of a mile in front of our property, and behind the neighbor's house across the street, is a very large, probably 30 or so acre, field. I honestly expected to see police cars, etc. soon and we kept looking out the window. The \"something\" was moving very fast and looked like it was headed for the ground, so, even though I didn't hear any noise, I felt it must have hit no further than that field. Apparently no one else saw it. There were no police cars, or anyone else, that came. I fully expected to hear local news reports about a meteor sighting but there were not any reports of that either. I will say that I think this must have been a meteor. But it is one of the reasons I am writing to you. What does a meteor look like when it has burned through the atmosphere and gets very close to earth? If it was a meteor, should there be signs of it in the field where it looked like it must have hit? Thank you for the opportunity to write to you. I have never written anything like this before, but I have never seen anything like this before. If you feel there is a logical answer for what I saw, I would love to know it. Thank you again, Becca"],"Latitude":"40.300262","Disposition":"Insufficient Data","Case Number":"15341","Date Submitted":"02/04/2009 09:30 UTC","Viewing Distance":"Unknown","Summary":"very bright, not far above my house, bright yellow with blue rim at top","Tags":"City","Source":"MUFON","City":"Delaware","Date of the Event":"02/04/2009 09:30 UTC","Object Features":"Unknown","Country":"United States","Object Shape":"Fireball, Flash","Log Number":"US-02062009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=40.300262,+-83.061115(15341)&iwloc=A&hl=en\"> mufon case (15341) map </A>"}