{"Case Number":"15342","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.243327,+-97.746866(15342)&iwloc=A&hl=en\"> mufon case (15342) map </A>","trends":["There have been 8 other sightings in Glen Rose","There were no other sightings in Glen Rose on or around February 4th 2009"],"Country":"United States","Latitude":"32.243327","Summary":"3 objects in a horizontal plane.","Date of the Event":"02/04/2009 07:31 UTC","Object Shape":"Circle","Disposition":"Unknown","Log Number":"US-02062009-0010","Source":"MUFON","Longitude":"-97.746866","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","Date Submitted":"02/04/2009 07:31 UTC","divs":["sighting detailson thursday, feb.5, 2009 my family and i were returning from a consultation with our tax preparer. we had two more stops before returning home. we stopped at the grocery store and bought a few items and then needed fuel. after fueling our vehicle, we proceded home. our track home began by getting back on us 67 west in glen rose. this highway is the one to stephenville. approximately 3 tenths of a mile down the road, i noticed a very bright yellowish,white object in the sky very low in the horizon but high enough to see over the trees and power lines. probably 22 or so degrees up from my vantage point and i asked my wife if she saw it and she said no. we kept going and i saw more of them through the trees and told her there they are again, there are multiple objects. i sped up a bit to clear a hotel building here in town and when we cleared it, my wife and i both saw two objects of the same nature as the first sighting a mile or so back and then they disappeared. they were approximately 310 degrees west from our vantage point. i called the girl involved in the sighting reported on by wb-33 tv a few nights ago to tell her about it and found out this morning a co-worker had seen the same objects at exactly the same time from a different location but in the same county a mile or so west of our position. these objects looked just like the object filmed by matt collins involved in the walnut springs sighting reported on by wb-33 tv from the d\\fw metroplex. walnut springs is just 12 miles south of glen rose. we headed out west of glen rose and pulled over to watch for other objects and saw nothing. we proceded home and discussed the incident with our children as this is the same area my son and his friend witnessed the same type object back in october of 2008."],"files":["/var/www/straped/mufon/html2text/15342.html.txt","/var/www/straped/mufon/org/15342.html"],"Viewing Distance":"Over One Mile","Weather Factors":"None","City":"Glen Rose","Region":"Texas"}