{"Viewing Distance":"Unknown","Tags":"City","Region":"New Jersey","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15348.html.txt","/var/www/straped/mufon/org/15348.html"],"Country":"United States","Date of the Event":"12/28/2008 12:00 UTC","Latitude":"40.670172","map":"<A HREF = \"http://maps.google.com/maps?q=40.670172,+-74.208451(15348)&iwloc=A&hl=en\"> mufon case (15348) map </A>","Summary":"awakend by noise.. jumped out of bed to see UFO in sky","Object Flight Path":"Hovering then path","Object Shape":"Square, Rectagular","divs":["Sighting DetailsI Was dispatched to pick up aa load od beer at a warehouse in Jersey. I was early so I had to spend the night. I parked My tractor trailor out sode the building as directed by the security guard. I stayed up till about 10pm reading and then decided to call it a night. It was really windy and rained on and off. Soon after I fell asleep. At around 4:55 am I began having a vivid dream. I was In a white room. I was sitting in a chair against the wall near the center of the room, to my left sat another man but he seemed to bein a daze. Around three feet in front of me was a stainless steel table. to the left end of the table sat a woman who just stared at me. I tryed talking to the man next to me but he was unresposive. as for the lady in the end she just stared at me and seemed to be taking notes. Im not sure because I couldnt see her hands but she would look at me the look down to her lap as if she were writing. A few seconds after I tryed to ask her question two men in black suits showed up. I stud up and they both grabed me the werent very big about 6'2'' and average weight. I was pushed up against the table and the kept grabing a my neck asking \" What is this\" What is this\" \"Why do you smell like gas\" I kept fighting the whole time and finally found my self in my bunk. I couldnt move but could hear a loud noise like a stun gun and my bunk was flashing a bright whight light. I fought to get up. when I finally broke free I jumped out of my bed and looked out the sky light in the truck. When I first looked I wasnt sure what I was looking at, but after really focusing I saw a giant black box just floating along. it didnt have any lights on but the bottom of it could be seen because of all the security lights in all the warehouses in the area."],"Longitude":"-74.208451","Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-02062009-0013","Object Features":"Patterned Surface, Other","City":"Elizabeth","trends":["There have been 8 other sightings in Elizabeth","There were no other sightings in Elizabeth on or around December 28th 2008"],"Date Submitted":"12/28/2008 12:00 UTC","Case Number":"15348"}