{"map":"<A HREF = \"http://maps.google.com/maps?q=-18.178909,+-63.87521(15347)&iwloc=A&hl=en\"> mufon case (15347) map </A>","Longitude":"-63.87521","trends":["There have been no other sightings in Samaipata","This sighting has never been favorited."],"Latitude":"-18.178909","Country":"Bolivia","Date of the Event":"11/11/1993 12:00 UTC","files":["/var/www/straped/mufon/html2text/15347.html.txt","/var/www/straped/mufon/org/15347.html"],"Object Features":"Undisclosed","divs":["sighting detailsi dont speak english but i am going to try to do an explication. my {pid} and my and girlfriend went to samaipata ruins in bolivia, near to santa cruz de la sierra city , our last vacation of hight school. nobady knows tha we were there...no relative etc..the point is tha we was singing walking down from the ruins on the way to conect the road, and we saw some wrong , litle man no human walking on one of the part of the way near the river...check google earth...them we walk infront of the alien , he saw me y saw him\\oher , 2 minutes, mi girl friend ask me what is it ? and i say i dont know,then apear three 3 more aliens up in the montain near to the otrher was in fron of us...one of they has a lithg that make a diferent light of the lite that we know in our world... my girlfrind run afraid, i run afraid too following her,,we run to the river, clean our pants becouse i dont know how, but we made piss and popo without knolege... we walk up the montain in front the other side of the river and wacht a two or three litgh across the motain faster, very faster one side to the other side and then we wacht the principal sfere making itselft bigest doing the form of a stair on the air , one time and one time more.many times ..them we decide to left the place, we was hungry, thirty, wed pants, and go back to samaipata town... all the time we was on second part of the motain we lisen matalic noise, i go back to samapata ruins for one year more trying to contac the ovni or ufos and i dont saw they more, but the last day that i went 1995 , a student group disapear infront of my noise..we was sleeping in the house keeper ruins...i an my brother luis. they students came at the midle of the nigth saying that they saw them ...make the camp and they disapear when we wake up. you are looking for them ....they visit samaipata ruins ... i dont saw more ovnys in my live...no aliens etc.... this is the razon because i tell you the real history. if you want to contact they, i think if somebody travel to samaipata , in a short period oct-dic you will see them."],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","City":"Samaipata","Source":"MUFON","Disposition":"Unresolved","Tags":"City","Region":"Santa Cruz","Weather Factors":"Unknown","Date Submitted":"11/11/1993 12:00 UTC","Viewing Distance":"20 Feet or Less","Case Number":"15347","Summary":"Real team UFO working doing an exploration, in ruins of Samaipata, contac us, we afraid.","Log Number":"BO-02062009-0012"}