{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/15353.html.txt","/var/www/straped/mufon/more/15353_submitter_file1__Picture005.jpg","/var/www/straped/mufon/more/15353_submitter_file2__Picture007.jpg","/var/www/straped/mufon/more/15353_submitter_file3__Picture009.jpg","/var/www/straped/mufon/org/15353.html"],"Case Number":"15353","divs":["Sighting DetailsI was working today on Potomac Street in the Evanston part of Cincinnati about 2:40 PM EDT. As I was preparing to get into my my car, I decided to take one last look at the building and take in the day because it was Spring like and the sky was clear and blue. To the left side of the house going west to east saw a contrail of a jet. The jet was flying east. It was one of those weird looking contrails and I was watching it break up. Then I noticed three or for white objects that look almost like balloons fly out of the contrail perpendicular and northward. I thought what the hell are those? They were too high for birds but I wasn't sure. I thought they might have been balloons let go but they were traveling fast and were too high. I watched them for a few seconds, then I remember I had a camera. I got the camera of the front seat and set the lens to 5x and started to take pictures. They looked like dots or blurry pearls. I watched through the tree branches and then over towards 1-71. I took pictures of them. They had an almost random formation though some traveled in lines. I counted 27 but there might have been more. A few of them were a red colors and it might have been a reflective color. They were far away to get any detail. I was thinking if they were balloons, they'd be traveling the same direction but some of them were veering to one another and not in the same direction if they were balloons in the wind. I watched them until they were gone and then watched some more. Then one more came flying behind them 30 seconds later looking like it was trying to do catch up. I check my cell phone time and it was 1445 HR. My feeling about this was that it really was cool. I had seen strange things in the past but nothing like this. There were so many of them. They didn't disappear if I looked at them. They were like white pearls. It really was neat. I was wondering if anyone else saw them and if they were heading in the direction of Wright Paterson in Dayton. The objects looked playful."],"Date Submitted":"02/06/2009 02:45 UTC","Disposition":"Unknown","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around February 6th 2009","This sighting has never been favorited.",""],"Region":"Ohio","Object Flight Path":"Straight-line path","Date of the Event":"02/06/2009 02:45 UTC","Viewing Distance":"Over One Mile","Latitude":"39.105278","Log Number":"US-02062009-0018","Sighting Duration":"Undisclosed","Weather Factors":"None","City":"Cincinnati","map":"<A HREF = \"http://maps.google.com/maps?q=39.105278,+-84.51088(15353)&iwloc=A&hl=en\"> mufon case (15353) map </A>","Tags":"City","Object Shape":"Circle","Country":"United States","Longitude":"-84.51088","Summary":"White objects flying out of contrail over Cincinnati.","Source":"MUFON"}