{"Tags":"City","files":["/var/www/straped/mufon/html2text/15355.html.txt","/var/www/straped/mufon/org/15355.html"],"Weather Factors":"Unknown","Summary":"1st: Lights hovering over tree tops. 2nd: amoeba like shapes in sky.","Longitude":"-93.372798","Object Features":"None","Object Shape":"Circle, Other","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.238394,+-93.372798(15355)&iwloc=A&hl=en\"> mufon case (15355) map </A>","Log Number":"US-02062009-0020","Date Submitted":"07/31/1984 11:30 UTC","Country":"United States","Latitude":"30.238394","City":"Sulphur","trends":["There have been 2 other sightings in Sulphur","There were no other sightings in Sulphur on or around July 31st 1984"],"Case Number":"15355","Region":"Louisiana","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Stationary,Other","divs":["Sighting DetailsFirst Incident: At the time of the sighting, I was a 20 year old nursing student who got off work at 11:00 pm from a local hospital. On my way home, I had to drive across a highway overpass. As I got to the top of the overpass, I saw in the distance a half circle of lights (evenly spaced, not blinking, white) stationary over some trees in the distance. As I drove closer to the objects, I could continue to see them every once in a while through the trees. The lights remained stationary over the treetops. As I got even with the lights, (they were on the right side of the road, not very far from the main road)I could see them clearly. I thought about taking the road on the right to see them closer, but I became scared. I drove to my home, which happened to be about a mile away. As I got out of the car, a helicopter flew over me headed in the direction of the lights. I never told anyone about the incident for years. Years later, I saw a picture of a ufo that was identical to the lights I had seen that night. Second Incident: I am now 44 years old and I just recently dreamed of an incident that I must have supressed for years. I woke from the dream and remembered what happened. It was such an extraordinary event for me, I have no idea why I didn't remember it. At the time of the incident, I was in college. I came home one evening after work, and as I walked towards my house, I looked up and saw lots of amoeba like objects in the sky moving around, changing shapes, and darting across the sky. The objects were in various sizes and shapes. I remember standing there for the longest time watching this light show and trying to figure out what in the world I was seeing. I remember walking from my front yard to the back yard to see the objects better.It was almost like watching a cartoon show in the sky. They looked almost like cartoon like drawings in the sky. I believe that some of these objects even had squiggly outer edges, and they moved through the sky like they were alive. (just like amoebae)I could only see the white outline of the objects, there didn't appear to be anything in the middle. I'm not sure what I saw that night, but I know that it was nothing like I've ever seen. I remember making the decision that I couldn't stay out there all night, as it was a pretty chilly evening. I went inside, and to my best recollection, haven't thought about this incident in about twenty-five years."],"Date of the Event":"07/31/1984 11:30 UTC","Viewing Distance":"101-500 Feet, Unknown"}