{"Tags":"City","City":"Philadelphia","Region":"Pennsylvania","Source":"MUFON","Summary":"5 objects hovering, flying in formation and very close to each other.","Latitude":"40.068629","Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Features":"Wings","divs":["sighting detailson the night of 2\\5\\09 at approx 2320 hrs i noticed 5 objects that were hovering in the sky around the academy rd exit. i was driving up 95 north from philadelphia. these objects started to move very slowing . i followed them all the way up 95 to the new hope exit. they were also flying in formation and flying very close to each other at times. they were not helecopters some had a boomarang shape, other did not. people were pulling over and slowing down to try to figure out what the hell they were looking at. i called a co- worker on my cell phone who was driving up 95 as well and asked him if he saw these things. he said he did and had no idea what they were. while i was talking to him my cell phone went dead in a area i never lose cell. by the time i got to the new hope exit i pulled over and watched these objects start to circle the area. very very strange. they were not high in the sky and i could barely hear them. by 12:30 am they were gone very quickly. please get in touch with me {pid} {cms\\jat\\pid} text moved to narrative"],"Object Shape":"Boomerang","Date of the Event":"02/05/2009 11:25 UTC","files":["/var/www/straped/mufon/html2text/15378.html.txt","/var/www/straped/mufon/org/15378.html"],"Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-75.002697","Disposition":"Insufficient Data","Date Submitted":"02/05/2009 11:25 UTC","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around February 5th 2009"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.068629,+-75.002697(15378)&iwloc=A&hl=en\"> mufon case (15378) map </A>","Log Number":"US-02072009-0017","Case Number":"15378"}