{"Case Number":"15379","files":["/var/www/straped/mufon/html2text/15379.html.txt","/var/www/straped/mufon/org/15379.html"],"Sighting Duration":"00:42:00","Country":"United States","Object Features":"Unknown","City":"Denver","Weather Factors":"None","Object Shape":"Star-like","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around February 16th 2009"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.741644,+-104.979983(15379)&iwloc=A&hl=en\"> mufon case (15379) map </A>","Latitude":"39.741644","Tags":"City","Date Submitted":"02/16/2009 08:20 UTC","Log Number":"US-02072009-0018","Object Flight Path":"Stationary,Other","divs":["Sighting DetailsMe and my brother were sitting in my back yard just enjoying the warm weather, there was not a cloud in the sky I looked toward the mountains (West) and noticed a Really bright light in the sky at first I thought it to be Venus but as I scanned the sky I found Venus, By this time my brother noticed the light and said to me \"Hey check out that light it's moving\" startled I turned back to the light and sure enough it was moving. At that moment I thought ok this must be a helicopter after about 30 seconds of really watching it. It started to move in circles and making sharp course corrections, I'm a private pilot so watching it maneuver like the way it was threw the helicopter idea out the window, I also made sure it was not just on the mountain (IE. a snow cat on a ski run). I went inside to get my night vision scope to maybe discern strobes, Me and my brother took turns for about a half hour watching it with our naked eye and the night scope we found there were no strobes just the light itself would seem to dim then get very bright. We watched in amazement until about 20:40 MST when the movement stopped then slowly started to descend and then the light just \"Blinked\" out. I say blinked because it did not fade just one second it was there and the next it was gone. My brother and I stood there until about 21:00 MST waiting to see if it would return but did not."],"Longitude":"-104.979983","Disposition":"Unknown","Viewing Distance":"Over One Mile","Region":"Colorado","Summary":"Bright odd moving light in the western sky.","Date of the Event":"02/16/2009 08:20 UTC"}