{"Tags":"City","Object Features":"Patterned Surface, Appendage(s)","Object Shape":"Triangle","Disposition":"Unknown","divs":["Sighting Detailsi was driving west on i-64 around the 104-98 mile marker .when i saw a bright light coming from behind me,but it was up in the sky not on the ground ,so i knew it wasnt a car or truck with there lights on bright.It whent over head of my truck ,it caused all my light to cut off for about 3-4 seconds it also made the light on the sides of the road go out also,there was atruck in from of me his lights also went out,and also the truck and car i was meeting,lost all power .after the object whent over me i could see that it was real big twice as wide as the interstate,and as long as it was wide.it also made the truck loose even engine power ,my truck coasted down to 55 mph before the lights and engine gained back power.i picked up my cb mic and asked the driver in front of me what the heck it was he replied i dont know but i hope it doesnt do it again . i asked him was that a ufo and he said \"it sure wasnt an airplane it was too big to have been one of them.After the object flew over us it headed in a westerly direction ,then made a hard right towards the north ,thats when i got a good look at it from the side it whent between me and the moon,and within seconds it gone as fast as lightning. It seemed to shine brighter about a second before it went into warp speed or whatever you call it.."],"Summary":"It was real big about 1/2 mile wide 3/4 mile long at least had blue-red-green-yellow lights on bottom,also some clear lights.","Source":"MUFON","Longitude":"-84.495966","files":["/var/www/straped/mufon/html2text/15387.html.txt","/var/www/straped/mufon/more/15387_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/15387.html"],"Country":"United States","Region":"Kentucky","Date of the Event":"02/08/2009 03:30 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Latitude":"38.049994","Case Number":"15387","Date Submitted":"02/08/2009 03:30 UTC","City":"Lexington","Log Number":"US-02082009-0006","Weather Factors":"Windy, Light","map":"<A HREF = \"http://maps.google.com/maps?q=38.049994,+-84.495966(15387)&iwloc=A&hl=en\"> mufon case (15387) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around February 8th 2009","This sighting has never been favorited.",""]}