{"Object Features":"None","Sighting Duration":"Undisclosed","Date of the Event":"02/07/2009 09:00 UTC","Object Flight Path":"Stationary","divs":["Sighting DetailsAt 9:00 last night I went to my back yard to straighten it up for the mowing service. I noticed it was a clear night so I looked at the moon and the stars in the sky. I saw a very bright light in the sky over my neighbors house. I would say about 500-1000 feet in the air. I thought it was an airplane coming this way so I didnt think anymore of it. I went back inside the house to get my 8yr old daughter to help with the yard and thats when I noticed the light had not moved and it was not making any noise. I then got my binoculars and looked at it and just saw more light. I brought my wife outside to look at it with the binoculars and she could not make much out of it either. My daughter said she saw it blink and I saw a red light on the bottom for a brief second and then go off. About 10 minutes into watching it now I noticed that the light had moved a little. It was going below the horizon. It took about 30 minutes for it to leave my sight below the other houses. I saw passenger airliners fly in that direction and I wondered if anyone saw the same light and what they thought of it. I kept thinking to myself that if it was a star or other celestial object, it should have been more stationary. If it was an aircraft, it should have made noise and had blinking lights on it. If you could picture the brightest star in the sky and multiply that by 100, you could get an idea of what we saw. I've seen numerous shooting stars, satellites, planets, and comets, but I've never seen anything like this before. I'm going outside tonight at the same time to see if I can see it again. If I do, I'll have my video camera ready."],"map":"<A HREF = \"http://maps.google.com/maps?q=29.768493,+-95.36573(15386)&iwloc=A&hl=en\"> mufon case (15386) map </A>","Latitude":"29.768493","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/15386.html.txt","/var/www/straped/mufon/org/15386.html"],"trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around February 7th 2009"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-95.36573","Summary":"Bright light in the sky that was stationary.","Case Number":"15386","Log Number":"US-02082009-0005","Object Shape":"Star-like","Country":"United States","Date Submitted":"02/07/2009 09:00 UTC","Tags":"City","City":"Houston","Disposition":"IFO","Region":"Texas"}