{"Longitude":"-90.021111","Date of the Event":"02/08/2009 06:27 UTC","Date Submitted":"02/08/2009 06:27 UTC","Summary":"Bright white object that seemed to break apart, rejoin and change shape hovered over cornfield next to Far Oaks golf course.","Tags":"City","Disposition":"Unknown","Object Features":"Dome, Other","divs":["sighting detailsat 6:27 a.m. cst i went out on my back deck. it was dawn and a large, airplane like craft hovered, low, over a cornfield next to far oaks golf course in caseyville, il. i noticed the object because it was eye level. the craft was bright white and stationary like a star, but could not have been a star because it was too low and too large. the craft was hovering very low and looked rather large to be a small personal airplane. then the craft ascended slowly and seemed to break apart-- it looked like 2 airplanes flying side by side on an angle. the wings of the 2 craft almost touched. then the craft came back together and i went in the house to get binoculars. when i came back outside the craft had moved behind trees and was too far away to get a good description of it. the entire time the craft \\ crafts were bright white like a star. at 6:50 a.m. i heard what sounded like a military helicopter in the direction the craft disapeared. lately i have seen several military helicopters in our neighborhood in the evening. i feel confident it was most likely military even though i did not see it. i was alone during this sighting and was not afraid. i am not sure how to describe the shape of the craft. airplane - like, star - like and chevron - like all seem to apply. this is the interesting thing. last year on january 17, 2008, i reported a triangle shaped craft right here at far oaks to mufon. i saw the craft on january 16, 2008. if you read my report from that night, i noted that two planes seemed to be flying too close together. i assumed they were two personal aircraft and at the time was more focused on the black triangle flying around the neighborhood. i did speak with someone from mufon after this sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.642436,+-90.021111(15383)&iwloc=A&hl=en\"> mufon case (15383) map </A>","Source":"MUFON","Latitude":"38.642436","trends":["There have been 4 other sightings in Caseyville","There were no other sightings in Caseyville on or around February 8th 2009"],"Country":"United States","Case Number":"15383","City":"Caseyville","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Chevron, Cross, Star-like, Other, Unknown","Weather Factors":"None","Region":"Illinois","Log Number":"US-02082009-0002","files":["/var/www/straped/mufon/html2text/15383.html.txt","/var/www/straped/mufon/org/15383.html"],"Sighting Duration":"Undisclosed"}