{"Longitude":"-75.158449","files":["/var/www/straped/mufon/html2text/15384.html.txt","/var/www/straped/mufon/org/15384.html"],"Source":"MUFON","Object Flight Path":"Undisclosed","Region":"Pennsylvania","divs":["Sighting DetailsIn back porch, porch lit up with flashing colored lights. I looked out screen door and backyard and shed near house were lit up like daylight, but the lights were colors continuously flashing - red, green, blue, red, green, blue. Looked up in the sky, and saw nothing, it was silent outside. Initial thought was that it was some type of emergency vehicle driving into our neighborhood, so I went through my house and out my front door - nothing. Not even 5 minutes later, my teenage son and his 2 friends came into the house yelling and asking if I saw that...they proceeded to tell me that while driving to our house they saw the whole sky light up with colored lights. While yelling about the lights they saw, one of their cell phones rang and it was one of the teen's mom calling from the house they just left asking if they saw anything while driving. I have no explanation, know what we all saw, hence my search on the internet. I had no idea there were sightings in this area, etc., until reading about the conference you just held at BCCC. Hope my information helps you in your research."],"City":"Philadelphia","Latitude":"39.955045","Object Features":"None","Tags":"City","Country":"United States","Disposition":"Insufficient Data","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.955045,+-75.158449(15384)&iwloc=A&hl=en\"> mufon case (15384) map </A>","Object Shape":"Unknown","Log Number":"US-02082009-0003","Sighting Duration":"Undisclosed","Case Number":"15384","Viewing Distance":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around February 3rd 2009"],"Summary":"Flashing colored lights - red, green, blue - lit up backyard.","Date Submitted":"02/03/2009 07:45 UTC","Date of the Event":"02/03/2009 07:45 UTC"}