{"trends":["There have been 74 other sightings in Stephenville","There was one other sighting in Stephenville on or around January 30th 2009"],"Weather Factors":"Unknown","Date Submitted":"01/30/2009 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.230236,+-98.200143(15385)&iwloc=A&hl=en\"> mufon case (15385) map </A>","Object Shape":"Undisclosed","Summary":"2 bright lights moving SSW of Stephenville Tx.","Longitude":"-98.200143","Object Features":"Undisclosed","Tags":"City","Region":"Texas","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","City":"Stephenville","files":["/var/www/straped/mufon/html2text/15385.html.txt","/var/www/straped/mufon/org/15385.html"],"Source":"MUFON","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsmy wife and i were coming back from ft worth on hwy 377 on jan 30 2009. 1\\2 mile north of stephenville city limit we witnessed 2 bright lights that appeared to be heading in a direction ssw just to the west of the city of dublin tx. the lights were quite bright with a very slight yellow to amber tint. the sky was clear and the time on my car clock was 7:00 pm exactly. unfortunately i did not pull over as there was not an appropriate shoulder to do so. but as i slowed, for 1-1\\2 to 2 minutes, my wife and i witnessed the 2 lights that were the same distance apart. (i did not have a good reference to establish distance apart or distance away from us). i estimated the altitude at 1000 to 1500 ft. the light on our right became 2 then 3 lights while the light on our left remained static. if you can imagine the following 'o' as lights: o o becoming o oo and then o ooo then o o. the lights were brighter than a small plane and did not flash or beacon. unfortunately hwy 377 entering stephenville drops off a rise that hid the lights from our view as the lights dropped below the tree tops."],"Country":"United States","Date of the Event":"01/30/2009 07:00 UTC","Log Number":"US-02082009-0004","Case Number":"15385","Latitude":"32.230236"}