{"Log Number":"US-02082009-0007","Latitude":"32.278809","Case Number":"15388","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.278809,+-98.546837(15388)&iwloc=A&hl=en\"> mufon case (15388) map </A>","Summary":"Unidentified lights, unusual sequence, then disappear.","City":"Desdemona","Weather Factors":"None","Source":"MUFON","Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","trends":["There have been no other sightings in Desdemona","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/15388.html.txt","/var/www/straped/mufon/org/15388.html"],"divs":["Sighting DetailsI live in Stephenville, TX; however, due to a grass fire I was out at our property near Desdemona, TX (actually north of Desdemona proper...and approx 30 minutes west of Stephenville). I was standing on the porch of our cabin, surveying the land, and something in the southeast corner of our property in the sky caught my eye. It was an unusual pattern of lights that appeared, and was unlike anything I have ever seen, then it disappeared. I was still watching the sky and further east of the original sighting a string of 5 or so lights lit up in a sequence..in a straight line formation then disappeared. This happened shortly before 7:30. It was so bizarre that after I witnessed these lights, I thought to grab my cell phone to see what time it was. It was exactly 7:30 on my phone when I checked it. I am 36 years old and never in my life have I seen lights in the night sky appear, disappear and behave in such a manner. This was not an airplane...no question... Shortly after that, I texted my husband in a few text messages. I have since taken a photo of my text history for proof..."],"Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Date Submitted":"02/05/2009 07:30 UTC","Region":"Texas","Date of the Event":"02/05/2009 07:30 UTC","Longitude":"-98.546837"}