{"Viewing Distance":"Unknown","Summary":"10-12 rectangular objects appeared overhead. Resembled a flock of circling sea gulls.","Log Number":"US-02072009-0020","files":["/var/www/straped/mufon/html2text/15381.html.txt","/var/www/straped/mufon/org/15381.html"],"Disposition":"Insufficient Data","Case Number":"15381","divs":["sighting detailsi was out walking my daughters dog who was staying with me at 6:30 a.m. on 10\\20\\07. i glanced up directly overhead and noticed how bright and clear the stars appeared. suddenly, there appeared at about 80 degrees elevation above the western horizon 10-12 glowing rectangular (or filament\\string shaped objects). the objects orbited back and forth around each other resembling a flock of feeding sea gulls that glowed as the entire group moved slowly from east to west. after about 20 seconds when the grouping had reached an elevation of about 60 degrees above the western horizon, the entire group vanished. i thought maybe at first that these objects were meteors or possibly some space junk burning up. however, they were orbiting back against each other contrary to the motion of the entire group of objects and this motion frightened me. also, these objects produced no discernible noise at all. i am familiar with almost every type of aircraft and these things did not resemble an aircaft of any kind. i'd rather not see something like this again."],"Sighting Duration":"Undisclosed","Country":"United States","City":"Muskegon","Source":"MUFON","Date of the Event":"10/20/2007 06:30 UTC","Object Features":"Undisclosed","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Latitude":"43.239921","map":"<A HREF = \"http://maps.google.com/maps?q=43.239921,+-86.242702(15381)&iwloc=A&hl=en\"> mufon case (15381) map </A>","trends":["There have been 11 other sightings in Muskegon","There were no other sightings in Muskegon on or around October 20th 2007"],"Object Flight Path":"Undisclosed","Tags":"City","Region":"Michigan","Longitude":"-86.242702","Date Submitted":"10/20/2007 06:30 UTC"}