{"Sighting Duration":"Undisclosed","Log Number":"US-02082009-0014","Weather Factors":"Unknown","Object Features":"None","Case Number":"15395","Country":"United States","Tags":"City","Object Shape":"Other, Unknown","trends":["There have been 13 other sightings in De Leon","There was one other sighting in De Leon on or around February 5th 2009"],"Date of the Event":"02/05/2009 07:30 UTC","files":["/var/www/straped/mufon/html2text/15395.html.txt","/var/www/straped/mufon/org/15395.html"],"divs":["Sighting DetailsI was traveling on Hwy 6 from Gorman, TX toward Deleon on my way to Goldwaith, TX. I first saw a light that I thought was a shooting star or a fireworks rocket. I was supprised because the light appeared and did not go away. Then to the side some distance between another light, then again the same equal distance another light, than a fourth light, but before the fourth light appeared the first disappeared. Then before the fifth appeared the second light disappeared,and so on. After the sixth or seventh light appeared the lights quit and eventually all went away. This lasted about 20 to 30 sec. There was a short period, maybe 10 sec before the next series of lights started to appear over another area to the left of the first group of lights. All was very simular to the first group. Then a third group to the right of the second group began to appear, but this time at least 7 or 8 lights all in a row appeared before any went away. Next a forth group began to appear to the left of the third group. This time the lights had a double appearence, instead of one light there were two very close together then two more and two more and so on, but the first two disappeared before the fourth double light appeared. Then back to the far left several miles in distance the fifth and final group appeared. There were six or seven lights in this group, the major difference of the fifth group was they were going away from me instead of across my vision. I kept trying to make out an object, but all I ever saw were amber lights. I was excied to see such a sight. I did not tell anyone about this for three days."],"Source":"MUFON","Summary":"Series of amber lights appearing and then dissipating/lights were always spaced equal distance between each other.","Region":"Texas","Object Flight Path":"Stationary","City":"De Leon","Viewing Distance":"Over One Mile","Date Submitted":"02/05/2009 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.118934,+-98.532332(15395)&iwloc=A&hl=en\"> mufon case (15395) map </A>","Latitude":"32.118934","Longitude":"-98.532332","Disposition":"Unknown"}