{"City":"Undisclosed","Object Features":"Unknown","Summary":"Aliens live in our Earth's atmosphere.","trends":[""],"Case Number":"15390","map":"<A HREF = \"http://maps.google.com/maps?q=40.068264,+-74.400901(15390)&iwloc=A&hl=en\"> mufon case (15390) map </A>","Longitude":"-74.400901","Date of the Event":"02/09/2009 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsIf you have read my article \"Aliens live in our Earth's atmosphere\" and saw my drawings of Aliens spacecrafts, you will understand at once that we deal with extraterrestrial beings. In addition to that I have every day visual contact with them. Normally they stay in one place in the sky, but as soon as I look at AFO it starts to move in my direction with the accelerated speed from 0 to 100 miles an more per second,no matter how far it is located from me, but if I wave my hand to them they begin to zigzag in my direction and stop right over my head. Another words they communicate with me by using so called \"body language\"(zigzag movement), that they happy to see me again, like a dog wiggle his tail to show that he is happy. Sometimes when I look at AFOs, they by their movement describe in the sky letter S, the first letter of my Last name, from here follows that they can read my mind at such distance or intercept my communications on internet. I know that what I discovered in my article is beyond human's imagination, that is why I offer people my assistance to locate AFOs in the sky first time, after that everyone can spot them without my help. Sincerely Ilya"],"Sighting Duration":"Undisclosed","Latitude":"40.068264","Date Submitted":"02/09/2009 12:00 UTC","Weather Factors":"Unknown","Country":"United States","Region":"New Jersey","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-02082009-0009","files":["/var/www/straped/mufon/html2text/15390.html.txt","/var/www/straped/mufon/more/15390_submitter_file1__AliensCraft.JPG","/var/www/straped/mufon/more/15390_submitter_file1__AliensCraft.JPG.1","/var/www/straped/mufon/more/15390_submitter_file1__AliensCraft.JPG.2","/var/www/straped/mufon/org/15390.html"],"Object Shape":"Unknown"}