{"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"02/07/2009 12:00 UTC","Object Shape":"Disc","City":"Wetumka","Region":"Oklahoma","Date Submitted":"02/07/2009 12:00 UTC","Country":"United States","Latitude":"35.237588","Disposition":"Insufficient Data","divs":["Sighting DetailsRound with blue tinted lights rotating slowly and a light blue cross on the under side. I Left the town of Wetumka,OK heading to Tulsa at around eleven pm. I was about 2 miles north of Wetumka on hwy 75 when my truck died as if it had no juice. I rolled to a stop and tried restarting my truck with no luck. I popped the hood and took a look, everything seemed fine. I got back in the truck and tried to start it again, it fired right off. I got back on the road and made it about a half mile where the hwy dropped down in a valley, when I got into the valley my truck died again. I pulled over for the second time and I decided to let the truck set for a few minutes thinking it would start back up if it set for awhile. I got out of the truck to have a smoke. When I got to the back of the truck I noticed the sky kind of glowing over the hill I just came down, I thought it was another vehicle coming down the hwy. But the vehicle never came, then the light stopped. Then approximately 100 yards east over the hill I saw the glow again. I felt kind of strange at this point. I couldn't take my eyes off the glow, I watched it as it grew closer to the horizon. When the light broke over the hill an object slid over the trees to the bottom of the valley and stopped. The lights were not as bright now but they were a dull blue. After a brief stop the object moved about 200 feet in the air, it had a large blue glowing cross underneath.then it began to move slowly east and with in a few seconds the object shot across the sky in a flash. It was the most amazing and unbelievable thing I have ever seen or experienced. I returned to my truck witch amazingly started on the first turn of the key and has not since died or acted up in any way. Thank you for listening."],"Case Number":"15402","Summary":"Unmistakably bizarre and heart thumping excitement.","Longitude":"-96.241673","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-02092009-0001","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.237588,+-96.241673(15402)&iwloc=A&hl=en\"> mufon case (15402) map </A>","files":["/var/www/straped/mufon/html2text/15402.html.txt","/var/www/straped/mufon/org/15402.html"],"Object Features":"Undisclosed","trends":["There have been no other sightings in Wetumka","This sighting has never been favorited."],"Object Flight Path":"Undisclosed"}