{"files":["/var/www/straped/mufon/html2text/15401.html.txt","/var/www/straped/mufon/more/15401_submitter_file1__MVC-002F.JPG","/var/www/straped/mufon/org/15401.html"],"Object Shape":"Star-like","Country":"United States","Tags":"City","Viewing Distance":"Unknown","Longitude":"-93.24562","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","City":"Westlake","Source":"MUFON","Date of the Event":"12/01/2008 07:35 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"12/01/2008 07:35 UTC","divs":["sighting detailsi had this photo on an \"unformatted\" floppy from my old sony mavica (set at 10x) and finally figured out how to get it off the disk. you probably can not tell too much from the photo, but the picture was taken at 7:35 pm on december 01, 2008 in westlake, louisiana. the red star like object first appeared to the sw maybe 20 degrees above the horizon and was traveling slowly to the north. after observing the object traveling north for 10 minutes, it was then located due west, still 20 degrees above the horizon. at this point, the object started traveling due west (away from me) and it went over the western horizon 10 minutes later. at first, i thought the \"red star\" was mars; that is until i noticed that is was moving. (in addition, the \"red star\" appeared to be larger and redder than a star or planet). p.s when this object is enlarged on my photo viewer, it looks very much like the object observed as follows: on 01\\20\\09, i went outside at 9:00pm to throw some grapefruit rinds on my garden compost pile. as i looked due west, i observed a large stationary flame yellow round object about 30 degrees above the horizon. the object had a smoky appearance to it in the totally clear sky and appeared to be about ten times larger than venus. as i dumped the grapefruit rinds on the compost pile the neighbors dog started a ruckus, so i went back inside to let him calm down. about ten minutes later, i went back outside to look at the stationary object in the sky and it was gone."],"Summary":"Slowly moving red starlike object moving across the sky for 20 minutes.","trends":["There have been 12 other sightings in Westlake","There were no other sightings in Westlake on or around December 1st 2008","This sighting has never been favorited.",""],"Disposition":"Unknown","Latitude":"30.24893","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=30.24893,+-93.24562(15401)&iwloc=A&hl=en\"> mufon case (15401) map </A>","Case Number":"15401","Log Number":"US-02082009-0020"}