{"Date of the Event":"02/08/2009 09:35 UTC","Source":"MUFON","Longitude":"-85.477321","Country":"United States","Summary":"Appeared to be bright star-like object moving towards the west.","Disposition":"Insufficient Data","Object Features":"Unknown","Object Shape":"Circle, Star-like","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/15400.html.txt","/var/www/straped/mufon/org/15400.html"],"Latitude":"39.338722","Date Submitted":"02/08/2009 09:35 UTC","City":"Greensburg","Weather Factors":"None, Does Not Apply","Region":"Indiana","Viewing Distance":"Over One Mile","Log Number":"US-02082009-0019","Object Flight Path":"Stationary,Straight-line path","Tags":"City","Case Number":"15400","trends":["There have been 13 other sightings in Greensburg","There were no other sightings in Greensburg on or around February 8th 2009"],"divs":["Sighting Details I was in my home in Ripley Co. and overheard on my police scanner (at approx. 9:30 or 9:35 pm) of a call reference to person reporting a blue flash in the western sky. I immediately grabbed my binoculars and went outside on my deck and saw this bright white star-like object to the west at maybe 10,000-20,000 ft. approximately. I watched it through binoculars(8X30mm) as it seemed stationary for about 5 minutes and still very bright, even with the full moon. I realized it was moving because when first viewed it was above my neighbor's house right next door then decended below it out of sight so I went towards the back of my home to regain sight of it. As it moved towards the west slowly (horizontally) it would dim somewhat to a pinkish hue. The futher away it moved it became smaller, dimmer and eventually decended below a treeline approximately 10-15 miles away. Also, this object did not display any aviation lights. Duration of this event was about 10-15 min. The odd thing about this (besides the object itself) was while I was out side I heard several cats whining and dogs barking in the distance like something was bothering them. After some hesitation, I called our Sheriff's Dept. at around 10:27pm to try to confirm this and they indicated a report of a blue flash in a town about 15 miles north of my location."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.338722,+-85.477321(15400)&iwloc=A&hl=en\"> mufon case (15400) map </A>"}