{"Log Number":"US-02092009-0011","Date of the Event":"02/07/2009 12:00 UTC","Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","divs":["Sighting DetailsWalking on Waikiki beach I noticed a bright star-like light low in the Western sky. It appeared to be stationary, but was noticeably bright and steady with no flickering. I stopped to chat with a new aquaintence who was sitting on the beach. After some interesting conversation about Hawaii and the state of the economy, I mentioned to my her that I had been seeing this light recurr during the past several weeks. It starts about 8PM local and disappears before 10PM. She remarked that it was \"just Venus\". So I teased her into a bet that it would not be there after we talked for a while. After an hour or so, I checked that part of the sky and it was gone. As I pointed out to her that it must not have been Venus. She remarked, \"It must be back in Waikiki again!\" Curiously, I laughed and asked her what she meant. She told me of an event that occured about a year ago where her and a group of friends were up on their condo's top floor. She said it was around 3AM and as they were talking, she noticed an object that was lower than their roof top recreational area, just floating in between some buildings. It was only several blocks away. As they looked down on it, she estimate it to be about 30ft across. It had an arced shape like you get when you place your index fingers together and touch your thumbs together, as she demonstrated the design with her hands. She said it had a small dome on top, was dull grey, totally silent, and just floated in between other high-rise buildings, finally disappearing between some buildings. She said they watched for another 30 minutes, thinking it would fly up or out the Waikiki area, but it was not seen again."],"Latitude":"21.315704","Summary":"Spot-light like.","Date Submitted":"02/07/2009 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15413.html.txt","/var/www/straped/mufon/org/15413.html"],"Region":"Hawaii","Case Number":"15413","City":"Honolulu","Country":"United States","Object Features":"Undisclosed","trends":["There have been 17 other sightings in Honolulu","There was one other sighting in Honolulu on or around February 7th 2009"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=21.315704,+-157.856143(15413)&iwloc=A&hl=en\"> mufon case (15413) map </A>","Longitude":"-157.856143","Object Shape":"Star-like","Disposition":"IFO"}