{"Object Features":"Louvres","map":"<A HREF = \"http://maps.google.com/maps?q=35.154417,+-114.566768(15412)&iwloc=A&hl=en\"> mufon case (15412) map </A>","Sighting Duration":"Undisclosed","Case Number":"15412","Region":"Arizona","City":"Bullhead City","Disposition":"Unknown","Date Submitted":"10/29/2008 10:30 UTC","Source":"MUFON","Latitude":"35.154417","Summary":"No lights, black triangle, no sound, flew straight path, north to south. WOW!","Longitude":"-114.566768","Date of the Event":"10/29/2008 10:30 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsBefore bed I go outside and lay on a lounge chair with binoculars. Look around night sky at stars and satellights for relaxation. I saw one part of the north sky flicker like the stars were disturbed. I put my binoculars in that area and found a B-2 Stealth bomber I thought. I was darker than the background sky so I could easily see the shape. I looked for the telltale zigzag rear cut of the wing but it was straight! Then I noticed it had no lights on, I thought that's illegal. Then I could see six elongated ports glowing a soft grey or bluish color underneath the leading edge of the plane, three on each side. It then sank in that I'm seeing something I'm not supposed to. I got a little scared my breathing quieted and I watched it go across the entire night sky. It came from the angle of Las Vegas heading towards Phoenix in a perfect straight line and never made a sound. I always see jet planes go by at high altitude and you can still hear them and see a condensation trail. This was twice as big in my binoculars and twice as fast as satellights. It was not a perfect triangle, it was slightly wider than long. And the corners were rounded slightly. And there was no sound, that was the weird part, it looked like a toy. Toward the end where I couldn't no longer keep my view of it I found myself saying, \" thank you, thank you\" which was kind of funny. Like I was thanking them for letting me see them go by. Told my wife and kid but they don't care. But I do, what an honor!! Brian"],"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Object Shape":"Triangle","Country":"United States","Log Number":"US-02092009-0010","files":["/var/www/straped/mufon/html2text/15412.html.txt","/var/www/straped/mufon/org/15412.html"],"trends":["There have been 11 other sightings in Bullhead City","There were no other sightings in Bullhead City on or around October 29th 2008"],"Tags":"City"}