{"Region":"Ontario","Object Flight Path":"Undisclosed","Object Shape":"Other","Case Number":"15415","files":["/var/www/straped/mufon/html2text/15415.html.txt","/var/www/straped/mufon/org/15415.html"],"Date of the Event":"11/30/2007 12:00 UTC","divs":["Sighting Detailsbasically my roomie was on his cell outside around 10pm and twice told me i should come see this,this was over a 45min. period.so after the second time i went out,there was lots of other soldiers watching.we are all aircraft techs.watched for several minutes.tried to notice pattern of its blinking lights,which were red.noticed blue flame out the bottom,no pattern.no movement,no sound.borden has no aircraft,next city that would is toronto,1 hour car drive away.bordens near a great lake,20min drive to wasaga beach.as attached video shows,those who captured the ufo's,was over a great lake as the sound of the waves and seeing the shore in the video.possibly the same lake near borden,im not sure the name of it possibly superior or huron.the video appeared within 2 months of me seeing the ufo.when we seen the video me and my roomie were like\"thats exactly what we saw!\" then almost a year later we were talking amonst a bunch of us describing it and some were like \"bullshit\" then others sitting near by were like \"no man hes serious,we were out behind the shacks also\",they seen them too!there are several aviation companies in toronto,its a major airport too so who knows,secret project? possibly.but if ufo are hydrogen powered it would make sense why the video and my sighting were over one of the great lakes.possibly hovering long enough to fill up with water? however the way they took off on the video would easily exceed tolerable g forces for humans,possibly 10-25g's the way they just bolted!originally i thought it was a helicopter,but they dont have light that flash like that and theres no downward exhaust.i was quite inquisitive watching intently and trying to soak up as much info i could and trying to burn the image into my mind.there is no light pollution out there.you can see more stars than ive ever seen,so clear."],"Weather Factors":"Unknown","Log Number":"CA-02102009-0001","Tags":"City","Longitude":"-75.672884","Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"No noise, flashing lites to the sides,no pattern, bottom random lite like blue flame, exactly like attatched video clip.","Country":"Canada","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.333891,+-75.672884(15415)&iwloc=A&hl=en\"> mufon case (15415) map </A>","Latitude":"45.333891","trends":["There have been no other sightings in Gloucester","This sighting has never been favorited."],"Disposition":"Unresolved","City":"Gloucester","Date Submitted":"11/30/2007 12:00 UTC","Sighting Duration":"Undisclosed"}