{"Object Shape":"Other","Weather Factors":"Unknown","Summary":"Many bright white lights. Like a building in sky. When clouds over it the sky was red in west. Not sun rise.","divs":["sighting detailsdelivering news papers w\\partner.before we saw the lights both of us felt high static electricity. both our scalps and arms ithched. we were up on a mountain when we saw the lights. i was scared and drove away.my partner is a bio\\chemist so she was curious. as we continued our route we saw a large akward deer (just one didn't walk right)going back and forth.me terrified her rational i.e.helicopters from air base.possibly va hospitol we drove back.(6 min @ most)the lights were still visable (the static still continuing) we could see the va,the red lights from cell tower?yet the bright lights were still visable from moon roof.scared and excited we left and called another carrier to see if she was in the area. as i spoke to her that itching reaccured and each street light went out as we spoke.my car did not stall but my lights went dim.i saw a red sky above us.as thou sun rising or bright moon. then when the light left one by one lights turned on.same way they went out.as i hung up phone my partner returned to the car.she put a paper on a porch. an owl (grey one color)flew out of thin air and landed on the porch roof of the house we delivered.what strange is it was staring at us and flew directly in front of my head lights.we watched for @ least 2 min. we were waiting to see if it was hunting or what.we left first. the static feeling followed us through the next 20 min of our route.the sky would light up.at another condo the spot lights on the four corners would turn off one by one then when the static lifted the came on the same way they went out. this has never happened in the four years we delivered papers. when we got home the sun was just rising in the east.yet i saw the same red in the west.after that night i developed 4 huge boils on my skin.one on my thigh,one in the center of my chest,one near my lip, the last was on my side between my hip and breast. besides the one on my chest all were on my right side.my dog who is prone to allergies itched so terrible i made an appointment @ tufts dermotolgy.(not putting events together.by the next week me and the dog cleared up.we returned next week to the same location. we could see the lights of the va hospital and cell tower but not those bright lights. my partner will not go on record.she does concur on the matter.we both agree it was strange the whole night. we do not know what we saw.it was unidentifiable.we tried to take picture but the lights were to bright and the cell camera would not work."],"Longitude":"-72.671667","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.335556,+-72.671667(15420)&iwloc=A&hl=en\"> mufon case (15420) map </A>","Viewing Distance":"501 Feet - 1 Mile, Unknown","City":"Northampton","Tags":"City","Date of the Event":"02/01/2009 04:09 UTC","Object Flight Path":"Hovering then path","Case Number":"15420","Object Features":"Window(s)","Region":"Massachusetts","Log Number":"US-02102009-0006","files":["/var/www/straped/mufon/html2text/15420.html.txt","/var/www/straped/mufon/org/15420.html"],"Sighting Duration":"Undisclosed","Date Submitted":"02/01/2009 04:09 UTC","trends":["There have been 9 other sightings in Northampton","There were no other sightings in Northampton on or around February 1st 2009"],"Latitude":"42.335556","Source":"MUFON","Disposition":"Unknown"}