{"Region":"California","Date of the Event":"01/18/2009 08:30 UTC","Source":"MUFON","Log Number":"US-02112009-0011","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15437.html.txt","/var/www/straped/mufon/org/15437.html"],"Latitude":"34.23003","Viewing Distance":"21-100 Feet","Object Features":"None","City":"Los Angeles","Country":"United States","Case Number":"15437","Longitude":"-118.374886","divs":["sighting detailsit was sunday night @ 8:30 pm i had just finished dinner and went out back for my after dinner cigarret and i had noticed the clouds were strange. by strange i mean they were really low and wispy. as i was looking up i noticed three bright lights just sitting there in the sky. they were not very high about the hight of the tree tops. i thought they were strange but would not really have given them much thought until they moved. it was at this time i had realized that the three lights were connected. the object began to rotate in a clockwise position while remaining in one place. the object itself was very large at least the size of my house. after it rotated one time it began to move silently. when it began to move i shouted for my partner who was still inside. it slowly moved over my house and that is where he saw the object. it was moving south south\\west . he saw the lights and figured it was just some sort of aircraft from edwards airforce base. if this is some kind of expieramental aircraft then we are way more advanced then anyone knows. this object was large, it was black , and it moved with no sound. the following day i did recall a slight hum like an electrical sound but very slight. we watched the object fly away and as it was moving it did not move in any way that an airplane or hellicopter would. i live next to the burbank airport so i am used to airplanes and this was no airplane. i have been on the net for weeks hoping someone else had seen what i saw. i have yet to see anything. this event has disturbed me because i have always been a skeptick. i have no answers to what i have seen. ."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.23003,+-118.374886(15437)&iwloc=A&hl=en\"> mufon case (15437) map </A>","Weather Factors":"Unknown","Summary":"I saw a giant black triangle aircraft hovering over my back yard.","Disposition":"Insufficient Data","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around January 18th 2009"],"Object Shape":"Triangle","Date Submitted":"01/18/2009 08:30 UTC"}