{"Date Submitted":"02/02/2009 09:20 UTC","Date of the Event":"02/02/2009 09:20 UTC","Source":"MUFON","Object Features":"Undisclosed","City":"Nashville","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around February 2nd 2009"],"Object Shape":"Fireball, Other","Summary":"Green sparkling fireball heading south west.","Country":"United States","divs":["Sighting Detailsfirst, i am not the best typist in the world. I was at my computer at home and out of my periphials i saw this green fireball about 1000 to 2000 feet in altitude shoot towards the south west. After that i called a friend that lived down the road who i assumed lived right under where the fire ball would have been. I was like i think i just saw a ufo. and he asked if i saw the big green light too.he had seen it from about a mile away from where i was. he was not at his home and had a clear view of what i saw. so after talking to him about it i let it go. About 3 days later i had been talking to friends and these 3 guys came up to me who i had been friends with asked if i saw the green fireball too. and i said yes of course, they then proceeded to tell me that they saw it too from 2 miles the other direction i am from my other friend. Now i do not know what this is, but i have been interested in the paranormal and ufos my whole life and was just wondering if anyone else had seen this that night. and i know it sounds stupid like a green fireball. but i gave my friend no hint of what i saw and he started talking about it before i did about what he saw. so if anyone saw it please speak up because i am really curious."],"Tags":"City","Region":"Tennessee","Case Number":"15436","Weather Factors":"Unknown","Disposition":"Hoax","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.1697,+-86.781493(15436)&iwloc=A&hl=en\"> mufon case (15436) map </A>","Sighting Duration":"00:00:04","Log Number":"US-02112009-0010","Latitude":"36.1697","files":["/var/www/straped/mufon/html2text/15436.html.txt","/var/www/straped/mufon/org/15436.html"],"Viewing Distance":"Unknown","Longitude":"-86.781493"}