{"Log Number":"US-02112009-0004","files":["/var/www/straped/mufon/html2text/15430.html.txt","/var/www/straped/mufon/org/15430.html"],"trends":["There have been 4 other sightings in Port Arthur","There were no other sightings in Port Arthur on or around September 25th 2005"],"Region":"Texas","Disposition":"Hoax","Object Features":"Dome, Insignia, Wings","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"09/25/2005 12:00 UTC","divs":["Sighting DetailsI HAVE TO SPEAK TO SOMEONE IMMEDIATELY I HAVE A DETAILED PHOTO OF AN UNKNOWN AIRCRAFT FLYING NEXT TO MY PLANE ENROUTE TO KOREA. I HAVE HAD THIS PHOTO FOR SOME TIME AND SHOWED THE PHOTO TO AN AIR FORCE AIRMAN AND HE TOOK THE COPY OF THE PHOTO AND WOULD NOT RETURN IT. I HAVE ALSO BEEN IN DIRECT CONTACT WITH AND ENITY WHO NOT ONLY PRESENTED HIMSELF TO ME BUT ALSO HAS VISITED ME IN DREAMS AND SHOWS ME THINGS THAT WILL HAPPEN IN THE FUTURE. THIS PHOTO IS AN DAYTIME PHOTO OF AN UNIDENTIFIED OBJECT THAT APPEARED ON THE PHOTO AFTER DEVELOPMENT OF THE FILM. BECAUSE OF THE NATURE OF WIERD OCCURANCES AND THE AIRMAN DIRECTLY TELLING ME TO NOT SHOW THE PICTURE TO ANYONE I HAVE DECIDED TO COME FORWARD BECAUSE HE DID NOT KEEP HIS WORD ON RETURNING THE PHOTO. HE SAID THAT HE WOULD MAKE THE IMAGE BIGGER USING SOPHISTICATED MILITARY EQUIPMENT AND RETURN IT. THE PHOTO ALSO SHOWS 2 EBE BECAUSE OF THE REFLECTION OF THE WINDOW FROM THE PLANE THEY APPEARED. WHEN I STUDIED THE CRAFT ALONG WITH THE IMAGES IN THE PHOTO IHAVE FOR MANY YEARS BEEN IN FEAR OF MY LIFE. I WAS IN THE ARMY FOR 10YEARS AND WAS CERTIFIED AS AN ARMOR CREW MEMBER. I STUDIED VEHICLE IDENTIFICATION IN FORT KNOX, KY. I WILL ONLY SHOW SOMEONE FACE TO FACE THE PHOTO. IF YOU ARE TRYING TO FIND THE MOST SOLID INFORMATION, THIS PHOTO GET ALOT OF ATTENTION. THE EBE THAT VISITED ME WAS ABOUT 4' 0\" AND HE WORE A BLACK SKIN TIGHT SUIT. ALSO HAD ALMOND SHAPED EYE'S. EVER SINCE THIS VISITATION. MY CLOCKS IN MY HOUSE AND CAR WOULD ALWAYS MAKE A STATIC SOUND AND THE CLOCKS IN MY HOUSE WOULD FLASH 11:11, AND 4:44 AS WELL AS MY WATCHES. THE CLOCKS WOULD BE UNPLUGGED AND WOULD STILL MAKE THE NOISES AND FLASH 11:11. I HAVE BEEN VISITED BY THESE THINGS FOR SOME TIME NOW BUT WAS AFRAID OF WHAT PEOPLE WOULD THINK OF ME. PLEASE HELP ME DISCLOSE THIS PHOTO AS WELL AS THE INFORMATION THAT I HAVE ON WHAT I HAVE SEEN AND LEARNED. THIS IS NOT AN HOAX I AM FOR REAL. I WAS AN STAFF SERGEANT IN THE ARMY, A TANK COMMANDER SERVED 2 TOURS IN IRAQ, AN ARMY RECRUITER. I AM NO LONGER AFRAID TO TELL THE TRUTH! IF YOU ARE SERIOUS ABOUT FINDING THE TRUTH CALL ME OR WRITE ME AND I WILL GET YOU THIS INFORMATION. I WILL ALSO SUBMIT TO AN POLYGRAPH. I BELIEVE I ALSO KNOW WHY THEY ARE VISITING MORE NOW! GOD BLESS, AND I HOPE TO HEAR FROM YOU SOON! BY THE WAY THE REASON I TOOK THE PHOTO OUTSIDE THE PLANES WINDOW IS BECAUSE THE CLOUD OUTSIDE THE WINDOW LOOKED LIKE A MANS FACE AS YOU WILL SEE IN THE PHOTO. THEN I DISCOVERED THE UFO AFTER DEVELOPMENT."],"City":"Port Arthur","Tags":"City","Sighting Duration":"03:00:00","Summary":"UFO/EBE Photo.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.88495,+-93.939947(15430)&iwloc=A&hl=en\"> mufon case (15430) map </A>","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","Country":"United States","Date Submitted":"09/25/2005 12:00 UTC","Latitude":"29.88495","Case Number":"15430","Longitude":"-93.939947","Object Shape":"Blimp, Cigar, Circle, Cross, Disc, Unknown"}