{"Date of the Event":"12/11/2001 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.527719,+-89.569313(1543)&iwloc=A&hl=en\"> mufon case (1543) map </A>","Case Number":"1543","Sighting Duration":"00:10:00","Object Flight Path":"Other","Date Submitted":"12/11/2001 07:00 UTC","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Object Shape":"Undisclosed","Region":"Wisconsin","Summary":"Witnesses saw orange flashes, white lights manueve","City":"Stevens Point","files":["/var/www/straped/mufon/html2text/1543.html.txt","/var/www/straped/mufon/org/1543.html"],"Log Number":"","divs":["Sighting Details The witness was on a breadk from her job as an inventory controller at a companywarehouse in Stevens Point, WI. She was standing in a small shelter near thesouth side of the building, which provided an excellent view of the southwesternsky. Her attention was caught by an orange flash low in the southwestern sky.Her initial reaction was concern that the flash might have been from an airplanecrash. However as she watched, the flash quickly faded and she noted otherlights in about the same elevation and direction. These appeared to bestationary or maneuvering. She also saw a second pair of sustained orangeflashes (flares) appearing in the region in which the lights were maneuvering. The two flashes lasted for about 3 seconds.As the plane crash concern lessened in her mind, she now found the light showinteresting and impressive (her literal words: \"cooler than fireworks\").In a few minutes, she was joined by the second witness, who had also come out totake a break. The second witness also saw the lights, but was frightened bythem - feeling that they might be associated with war. The lights were describedas being white and twinkling. They appeared to be fast moving, and weredescribed as being difficult to count. The prime witness estimated that therewere about 5 or 6 lights. She also noted that there were no red or green lightsassociated with them, as might be expected on aircraft. The lights motion wasgenerally such that one would seem to vanish from one spot and reappear in adifferent spot, about four inches away at arms length. The two witnesseswatched the light show for about 10 minutes. They then pointed them out toanother employee nearby.One light then headed quickly from the SSW sky to the southern sky where itvanished. The other lights also disappeared, with no observable departure."],"trends":["There have been 17 other sightings in Stevens Point","There was one other sighting in Stevens Point on or around December 11th 2001"],"Country":"United States","Longitude":"-89.569313","Latitude":"44.527719","Weather Factors":"Unknown","Object Features":"Undisclosed"}