{"map":"<A HREF = \"http://maps.google.com/maps?q=28.395056,+-80.739698(15444)&iwloc=A&hl=en\"> mufon case (15444) map </A>","divs":["Sighting DetailsI was driving home form a convention I had attended in Orlando, FL and was driving alone and on a dark two lane highway (SR 520) at approx. 11 pm at night with no other traffic on the road and no street lights. It was an extremely clear and cold evening. I looked up at the sky and all of a sudden one of the \"stars\" that I was gazing at suddenly split in two and the two objects seemed to eject themselves in two separate directions(kind of like watching fireworks). And then I looked directly above me (thru the car windshield) and a small blue object in the sky (which I assumed was another \"star\" in the sky) went from being a small blue spec in the sky to a larger white object that got brighter and brighter, until I began to think it was an airplane. However, it didn't move from where I originally saw it. It just got bigger and bigger and seemed to be getting closer and closer, but then it started to get smaller and smaller until it looked exactly like what I had seen in the 1st place. And I wouldn't have thought anything of it, except that it happened again two more times with the same object. It did it one more time and then I gave up staring at it. Also, because I was getting closer to I-95 South, where there were other cars on the road and street lights again. If I hadn't been alone in my car, I would have stopped on the side of the road to watch for more. There was definitely something going on up there! If you have questions, please contact me by email at suntreerealtor@msn.com and please do not call me on the phone. At least not for an initial contact info. Thanks! Gail Crowley in Melbourne, FL P.S. if you had similar reports like mine recently, especially taking place in my area (east coast - central FL), then I'd really appreciate knowing about it. Thanks again! P.P.S. no photos. Sorry!!"],"Date of the Event":"02/05/2009 12:00 UTC","Log Number":"US-02122009-0001","Object Features":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Region":"Florida","Disposition":"Unknown","Latitude":"28.395056","trends":["There have been 5 other sightings in Cocoa","There were no other sightings in Cocoa on or around February 5th 2009"],"Date Submitted":"02/05/2009 12:00 UTC","Viewing Distance":"Unknown","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/15444.html.txt","/var/www/straped/mufon/org/15444.html"],"Summary":"One object split into two and one \"star\" getting bright and fading 3 times.","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"15444","Longitude":"-80.739698","City":"Cocoa"}