{"files":["/var/www/straped/mufon/html2text/15440.html.txt","/var/www/straped/mufon/org/15440.html"],"Summary":"A hovering, metalic, Saturn shaped, object.","Longitude":"-96.941364","City":"Irving","Disposition":"Unknown","trends":["There have been 18 other sightings in Irving","There were no other sightings in Irving on or around June 30th 1957"],"Latitude":"32.817108","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=32.817108,+-96.941364(15440)&iwloc=A&hl=en\"> mufon case (15440) map </A>","Date Submitted":"06/30/1957 12:00 UTC","Country":"United States","Object Features":"Patterned Surface","Weather Factors":"None","Log Number":"US-02112009-0014","Object Shape":"Saturn-like","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Date of the Event":"06/30/1957 12:00 UTC","Tags":"City","Object Flight Path":"Hovering then path","Source":"MUFON","Case Number":"15440","divs":["Sighting DetailsI grew up at 228 W 6th St in Irving Texas. I was 7 years old during the summer of '57. Our house was not air conditioned and I often slept with my head and pillow in the window to be cooler. A slightly older cousin was spending the night and we were both in bed with the lights off. I had a wonderful first grade teacher that got me interested in astronomy with her teaching, so I would often gaze up at the stars at night ...sometimes for long periods of time ...until I got sleepy. This night the Saturn shaped object slowly came into my view as it came over my house and stopped. I started yelling at my cousin who was already asleep to come look but he was a too slow getting up to see it. The object elevated up and to the right slightly ...then zipped away. My Mom and Dad had a garage apartment right outside of my room and an older cousin and her husband were staying there at that time. As I was calming down a bit they pulled into the driveway and I yelled and asked them if they had seen the flying saucer that was right above the house. Her husband told me no ...but they had been hearing things on the radio about a UFO sighting in the area ...I remember thinking ...how neat-o ...and I had just seen it! I asked my Dad a few years ago when did my cousin and her husband live in the apartment and he told me for a few months in late 1957. Fast forward 50 years and I am talking to my cousin whom I hadn't seen in a few years and he aks me if I still remembered the summer of the UFO ...yep ...like it was yesterday! My description of it: ...a hovering metalic object ..Saturn shaped ...a globe with a ring around it ...no sound. I wanted to share this after all of these years ...Thnak You."]}