{"files":["/var/www/straped/mufon/html2text/15442.html.txt","/var/www/straped/mufon/org/15442.html"],"Date Submitted":"02/11/2009 07:23 UTC","Log Number":"US-02112009-0016","Summary":"It fell like a shooting star and then swung back up in a pendulum motion (or like a yo-yo). It was bright neon green and as big as my thumbnail.","City":"Huntington Beach","Latitude":"33.662147","Longitude":"-117.994896","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.662147,+-117.994896(15442)&iwloc=A&hl=en\"> mufon case (15442) map </A>","Region":"California","Disposition":"Unknown","divs":["Sighting DetailsI was by myself at the bus stop near Garden Grove waiting for my bus ride home. I was staring in the general direction and I believed that I was witnessing a shooting star. I was looking Northwest towards Bolsa Chica and Huntington Beach. It was leaving a trail when it was coming down. Suddenly, it swung back upwards after almost hitting the ground! It happened at 7:23 pm exactly and lasted for about a minute, then trajected it's way back up to the top of the sky from where it began. I felt like it was peeking at me through some trees and it made me feel a tad awkward because it kept swaying back and forth. I tried not to stare at it for too long because I felt uncomfortable when I realized it wasn't a shooting star. It was beautiful and magnificent, nonetheless, bright-neon green-and an awesome sight of light to see!! I just didn't want to stare at it for too long. God I wish I would have had a video camera to have taped it for everyone who did not see it! Just 5 minutes later, a helicopter was flying in that same area. This did not affect my cellphone communications or my cellphone clock."],"Object Features":"Dome","Date of the Event":"02/11/2009 07:23 UTC","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around February 11th 2009"],"Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Disc","Case Number":"15442","Source":"MUFON","Weather Factors":"None, Does Not Apply","Sighting Duration":"Undisclosed"}