{"Disposition":"Unknown","divs":["sighting detailslocation: walmart parking lot @ i-20 and cooper time: 11:20 a.m. (taken from my receipt) date: 12\\31\\08 as i was walking out to my car with my groceries looking at the clear blue sky i noticed a large reddish brown roofless 2-story shaped \"house\" tilted to the right hovering in the sky. as i put my groceries in my car, returned the cart, started my car and pulled out i continued to observe the object. it was in a northwest direction over cooper st.\\room store about 3\\4 of a mile away over i-20. i am unsure of how high up it was because the walmart is on a hill so 500 to 700 feet up is only a guestimate. the reason i say roofless is because there appeared to be \"eaves\" coming from the two top corners that extended out from the object at an angle about a quarter of the length of each side like the eaves of a roof except it was flat on top. it appeared to be a solid object, reddish brown with the center being lighter, and to have some texture to it. it looked old to me. when a car in the opposite direction was approaching a little fast in the parking lot i took my eyes away for about 2 to 4 seconds and when i looked back it was gone, however, in its place there was a dull silver cigar-shaped object that was reflecting the sun. as i turned onto bardin st. to make a u-turn back onto cooper st. i lost site of it. back on cooper st. going north over i-20 bridge, where the view down w i-20 is excellent, it had disappeared. i observed it from start to end about 1 minute and 30 seconds. my initial reaction was not really registering it as anything except an object in the sky as my mind was on getting my errands done but the more i observed it the more i realized i was looking at something that was anything but normal. my first thought was that maybe it was an old plane with the cloth-covered wings but quickly ruled that out because of color, size and shape and it did not appear to be moving. my next thought was maybe some bizarre blimp that was possibly having trouble. having seen many types of planes, blimps, helicopters, etc. because of my proximity to arlington airport and being in the flight path of dfw, plus searching the web for the last 33 days, i can now honestly say that i have found nothing that comes close to identifying it. so despite my initial trepidation at reporting this, i'm hoping that because of all the traffic and people out that day, maybe someone else saw this object and can tell me what it was. thank you."],"Region":"Texas","Latitude":"32.743337","Summary":"Large reddish brown roofless \"2-story house\" shape tilted to right hovering in sky NW direction over I-20.","Object Shape":"Cigar, Square, Rectagular","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around December 31st 2008"],"City":"Arlington","Tags":"City","files":["/var/www/straped/mufon/html2text/15452.html.txt","/var/www/straped/mufon/org/15452.html"],"Country":"United States","Longitude":"-97.105976","Date Submitted":"12/31/2008 11:20 UTC","Object Features":"Patterned Surface, Appendage(s)","Sighting Duration":"00:01:30","Date of the Event":"12/31/2008 11:20 UTC","Log Number":"US-02122009-0009","Case Number":"15452","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=32.743337,+-97.105976(15452)&iwloc=A&hl=en\"> mufon case (15452) map </A>","Weather Factors":"None"}