{"Sighting Duration":"11:46:00","Source":"MUFON","Longitude":"-94.345193","Summary":"Was doing a paranormal (amateur) investigation, took picture with being.","Object Shape":"Other","Country":"United States","City":"Jefferson","Date of the Event":"02/08/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.757363,+-94.345193(15450)&iwloc=A&hl=en\"> mufon case (15450) map </A>","Object Features":"Undisclosed","Log Number":"US-02122009-0007","Disposition":"Hoax","Viewing Distance":"Unknown","Region":"Texas","Weather Factors":"Unknown","trends":["There have been 2 other sightings in Jefferson","There were no other sightings in Jefferson on or around February 8th 2009","This sighting has never been favorited.",""],"Date Submitted":"02/08/2009 12:00 UTC","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI know this isnt the normal (whats' normal) but, I went to stay at a haunted bed and breakfast and took several photo's with anomolies in them. I captured a really great pic of a mans face in the window of our cottage. We were really impressed with the photo. As I studied the pic I noticed something unusual. Right below the face in the window itself is an entity of some sort. If you look closely you can clearly see something else in the photo with the mans face. I did some work on the picture and discovered that the entity is solid, 3d, and really there. The ghost face was very impressive but the other thing that is there is much more impressive. The reason I am sending this to you is, upon studiyng the picture I wondered, \"could I have captured an alien in the same picture, in the same window with a mans face. What are the odds, billion to one? All I know is, there is a creature there and looks like a grey. If somebody could please review my pics and give me opinion that would be great. I have attached the pics (one cropped, one full size) they are the original pic with no modifications at all (the cropped pic may have some). Again, I know this is not the norm but, my gosh, it's strange. I had no idea until yesterday it was there. By the way, I also captured some ghost images on the same trip but, the creature in the window below the mans face is astonishing. The man appears to be staring out the window at the top right corner. Right below, actually appearing to be solid, in front of the shutters but behind the glass. It is the window to the far right of the cottage. Let me know what you think, Sincerely, Michael Monk"],"Tags":"City","files":["/var/www/straped/mufon/html2text/15450.html.txt","/var/www/straped/mufon/more/15450_submitter_file1__cropalien.jpg","/var/www/straped/mufon/more/15450_submitter_file1__cropalien.jpg.1","/var/www/straped/mufon/more/15450_submitter_file1__cropalien.jpg.2","/var/www/straped/mufon/more/15450_submitter_file2__mansface1.jpg","/var/www/straped/mufon/org/15450.html"],"Case Number":"15450","Latitude":"32.757363"}