{"Object Shape":"Circle, Fireball, Flash, Oval, Saturn-like, Sphere, Star-like","Region":"Oklahoma","files":["/var/www/straped/mufon/html2text/15467.html.txt","/var/www/straped/mufon/org/15467.html"],"Country":"United States","Date Submitted":"02/05/2009 09:06 UTC","Latitude":"35.988401","City":"Drumright","Source":"MUFON","Longitude":"-96.601129","Case Number":"15467","map":"<A HREF = \"http://maps.google.com/maps?q=35.988401,+-96.601129(15467)&iwloc=A&hl=en\"> mufon case (15467) map </A>","trends":["There have been no other sightings in Drumright","This sighting has never been favorited."],"Log Number":"US-02132009-0001","Summary":"10 min. of great video, you have to see this one!","Date of the Event":"02/05/2009 09:06 UTC","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsDEAR MUFON, TO START WITH, MY BROTHER AND I WERE SITTING ON THE BACK PORCH HAVING A SMOKE. I HAD WENT IN THE HOUSE FOR A COUPLE MIN. WHEN MY BROTHER DAN YELLED AT ME TO COME BACK OUT ON THE PORCH TO SEE THIS WEIRD LIGHT JUST OVER THE TREES TO THE WEST OF US. AT FIRST I THOUGHT IT PROBABLY WAS A BRIGHT STAR, BUT AS WE STUDIED IT I COULD CLEARLY SEE DIFFRENT SHAPE CHANGES AND DIFFRENT LIGHT FLASHES WITH DIFFRENT COLORED LIGHTS AT TIME. IT DID'NT TAKE LONG FOR BOTH OF US TO REALIZE WHAT WE WERE LOOKING AT WAS A UFO. I WENT INTO THE HOUSE AND GOT MY CAMERA AND PROCEEDED INTO THE YARD AND THEN INTO THE STREET WHERE THE OBJECT WAS'NT BLOCKED BY TREES. THE UFO WAS MOVING VERY SLOWLY TO THE NORTH FROM WHERE WE FIRST SAW IT, I STARTED MY VIDEO AND AS I WAS FILMING THE OBJECT IT CHANGED COARSE AND HEADED DIRECTLY WEST AT A STRAIGHT ANGLE. I VIDEO TAPED THE OBJECT FOR ABOUT 10 MIN. THAT WAS MORE THAN ENOUGH TIME TO GET THE BEST UFO SHOW I THINK I'VE EVER SEEN OF A NIGHT SIGHTING. THE UFO STARTED AS A VERY SMALL SUPER BRIGHT LIGHT THAN IT WOULD EXPAND TO DIFFRENT SIZES OF SPHERES, SOMETIMES LOOKING LIKE A BALL WITH A DARK STRIPE IN THE MIDDLE AND TIMES IT APPEARED TO GET MUCH LARGER AND LOOKED LIKE THE MOON, THEN IN AN INSTANCE IT VANISH BACK INTO THE SUPER BRIGHT LIGHT, THEN, WHILE DOING ALL THESE THINGS IT WOULD BURST INTO BEAUTIFUL HUGE ORBS OF LIGHT, SOMETIMES ORANGE, SOMETIMES GREEN AND RED. AFTER FILMING THIS FOR ABOUT 10 MIN. I KNEW I HAD ENOUGH FOOTAGE, THIS BABY HAD DONE IT ALL, WHAT A LIGHT SHOW THIS WAS!!! AFTER TURNING OFF THE CAMERA I CONTINUED WATCHING THE OBJECT CONTINUE WESTWARD OVER CUSHING OK. AND STILL GOING WEST AT A VERY SLOW SPEED FOR ABOUT ANOTHER 10 MIN. THEN I RETURNED TO THE HOUSE TO VIEW THE FOOTAGE VIA CAMERA TO T.V. THE WHOLE FAMILY COULD'NT BELIEVE THEIR EYES, THE VIDEO IS SPECTACULAR, AND WITH NO DOUGHT IN OUR MINDS THAT WE WERE LOOKING AT A UFO. GUYS YOU HAVE GOT TO SEE THIS VIDEO. NOW THE BAD NEWS, I BARELY KNOW HOW TO SEND AN EMAIL SO I DO NOT KNOW HOW TO DOWNLOAD MY SD CARD VIDEO AND THEN SEND IT AS AN ATTACHMENT. IF SOMEONE WANTS TO CALL ME AND GIVE MY WIFE INSTRUCTIONS ON HOW TO DO THIS, THAT WOULD BE GREAT! SINCERELY, TOM"],"Object Flight Path":"Undisclosed","Disposition":"IFO","Object Features":"Undisclosed"}