{"Region":"Ohio","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.383559,+-81.903964(15460)&iwloc=A&hl=en\"> mufon case (15460) map </A>","Date Submitted":"10/01/1973 03:30 UTC","Country":"United States","City":"Olmsted Falls","Source":"MUFON","Object Features":"None","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/15460.html.txt","/var/www/straped/mufon/more/15460_submitter_file1__ufoplaindlr.jpg","/var/www/straped/mufon/more/15460_submitter_file2__ufophotopd.jpg","/var/www/straped/mufon/more/15460_submitter_file3__ufopress.jpg","/var/www/straped/mufon/org/15460.html"],"Case Number":"15460","Tags":"City","Log Number":"US-02122009-0017","Viewing Distance":"20 Feet or Less","Weather Factors":"None","Latitude":"41.383559","Summary":"I watched the UFO pass over my car and land in the field, after dropping my sister off at her house.","Disposition":"Unknown","trends":["There have been 3 other sightings in Olmsted Falls","There were no other sightings in Olmsted Falls on or around October 1st 1973","This sighting has never been favorited.",""],"divs":["Sighting DetailsSo I left and went to my house in Cleveland, Ohio, and got my roommate, at that time, and we left together to go and speak to Channel 3 news. The date was October 1, 1973. The news channel people and me and my roommate were walking towards the landing site, in the field, when suddenly someone stopped us. They stopped filming the story and everyone had to leave. We were told to not come back to the area, that it was now a restricted area. A couple of days later, a General from Phoenix, Arizona arrived at my door. I asked him what he wanted. He had a uniform on with stars on the shoulders. He asked me if I was the woman who had seen the UFO. I told him that I was. He asked me to answer some questions about the sighting. I told him I was pretty exhausted from answering questions from the news channels here in Cleveland, and that I didn't want to. He told me I had to answer the questions. I told him that I was a United States citizen, and that I had rights, and that I didn't have to answer his questions. The General told me that I was right. I was a United States citizen, and he said that we are your government, and we own you. He told me I would either answer his questions here or in Phoenix, Arizona, at the air force base there. I asked him what I would do with my 4 year old daughter, pointing to her in the background. He said they had a place to put her until we got back to Cleveland. I told him I would answer his questions the next day. He arrived and I answered his questions, but he answered none of mine. Now the odd part of all of this, to me, was that I had only a few years earlier, realized that I began my drive home to Cleveland, Ohio, from Olmsted Falls, Ohio. It was about a 20-25 minute drive back home. but when I arrived at my mother's house, it was already morning time, with mom having her coffee already. This would have made it 9 or 10 in the morning! What happened to these hours between 3:30 AM - 9 or 10 AM? I am submitting newspaper clippings from The Plain Dealer, and the Press, newspapers articles. The Cleveland Press went out of business since then. I would a field investigator to talk with me about this sighting."],"Object Flight Path":"Straight-line path","Longitude":"-81.903964","Date of the Event":"10/01/1973 03:30 UTC"}