{"Object Features":"Unknown","Disposition":"IFO","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15461.html.txt","/var/www/straped/mufon/org/15461.html"],"Longitude":"-86.148374","trends":["There have been 126 other sightings in Indianapolis","There were 4 other sightings in Indianapolis on or around February 12th 2009"],"Weather Factors":"None","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=39.777816,+-86.148374(15461)&iwloc=A&hl=en\"> mufon case (15461) map </A>","Country":"United States","divs":["Sighting Details I live on the west side of Indianapolis. My neighbor called my attention to the sky south of our building, and there is something in the sky....not another thing to be seen excepting an occasional airplane (we're near the airport)....and this thing seems very bright. And it doesn't move. She said she watched it all the way home from Bargersville, and said it hasn't move yet. It's in the western sky, just visible above the roof of the building next door (we live in an apartment complex...the buildings are close to each other). I couldn't see anything but a bright light, but with field glasses, the following was visible: The best way I can describe it is that it's a ring of light with little circular-appearing bud-like objects on the outer perimeter, with more of them seeming to be on the upper and right side of the ring, and none on the southern half of the circle. At first the little \"buds\" were at the top....let's say at 11 and 1 o'clock. They now (half an hour later) appear to have \"stems\" with \"buds\" at the ends....might this indicate a changing of positions? It's 8:58 p.m. and it's gone now."],"City":"Indianapolis","Log Number":"US-02122009-0018","Date of the Event":"02/12/2009 08:10 UTC","Case Number":"15461","Region":"Indiana","Date Submitted":"02/12/2009 08:10 UTC","Summary":"A ring with what look like buds on the outer perimeter, Indianapolis.","Latitude":"39.777816"}