{"Weather Factors":"Unknown","Latitude":"39.774836","trends":["There have been 126 other sightings in Indianapolis","There were 4 other sightings in Indianapolis on or around February 12th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","Region":"Indiana","Tags":"City","files":["/var/www/straped/mufon/html2text/15464.html.txt","/var/www/straped/mufon/more/15464_submitter_file2__DSC00144.JPG","/var/www/straped/mufon/more/15464_submitter_file3__DSC00166.JPG","/var/www/straped/mufon/org/15464.html"],"City":"Indianapolis","Date of the Event":"02/12/2009 08:30 UTC","Source":"MUFON","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.774836,+-86.155754(15464)&iwloc=A&hl=en\"> mufon case (15464) map </A>","Summary":"Object was stationary very bright seemed to change colors. At first seemed liked helicopter. But was moving too slow.","divs":["Sighting DetailsI was letting my dogs out through the sliding door facing South around 8:30pm. It was a clear night. I looked at what looked like a very bright star directly above the house behind me. I was thinking to myself, I don't remember seeing a star at there before. Then my kids came over and looked at it. My five year old said, maybe it's a star. My second thought was maybe it's a helicopter. But it was so bright, and it was not moving. I got my camera, just in case. When I looked at this thing through my camera, it seemed to be changing colors. As we kept watching this thing after a half an hour we noticed it began moving further away east very slowly. I have pictures of the object. It appears to change shapes and colors. After an hour it finally dissapeared. I also took a video with my digital camera. I don't know if it was anything, but I figured I would report it in case someone else saw something. The pictures I submitted are difficult to see. The only way you can see the colors and shapes is if you zoom into the pictures. I used a sony cybershot 8.1 megapixels. I was on my back deck facing south, with clear view of the sky. The first is the video, I tried to keep as steady as I could, any movement is my hand not the object. The second is just a picture of the object. When I zoomed to this one, I saw a face. Kind of like when you look at the moon. It was pretty cool. In the third picture an airplane passed by. The plane is the long shape, and the object is round and bright. I have more pics if needed. Thanks."],"Longitude":"-86.155754","Log Number":"US-02122009-0021","Viewing Distance":"Unknown","Case Number":"15464","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Circle, Star-like","Object Features":"Undisclosed","Date Submitted":"02/12/2009 08:30 UTC"}