{"Log Number":"US-02132009-0006","Summary":"Bright light floated in sky in backyard for over an hour then slowly came down in woods and possibly landed.","City":"Durham","Date Submitted":"02/12/2009 08:05 UTC","divs":["Sighting DetailsI happen to look out the back window for some reason and saw what looked like a bright light from a plane moving above the tree tops in the sky. But then it slowed to a stop and hovered there and slowly moved in a circular pattern in the sky while slowly moving down or away. The light never changed brightness. I asked my fiance to look and she took a breif look at it and went back to watching TV. I continued to tell her how the object continued to float around the same area in the sky. I opened the window to get a clear view and when the object moved lower in view below the tree tops and became more difficult to see. I went outside at 8:30pm in the back yard and continued to watch it slowly move down or away, I also took a few pictures. At first I though it was moving away but the brightness of the light did not change. I saw planes flying all around and it seemed like the object was huge and should have been visible to the planes. The object continued to move down in my view into the tree tops so I tried to shine a light out at the object to get it's attention but it seemed to have no response to the light. It was around 9pm by this time when the object disappeared behind the trees but I soon saw it again lower near the forest floor which is when I realized the object may be much closer and much smaller than I initially thought. I looked out using binoculars and saw a yellow light that pulsated and then went out. It came back on and went out a few more times. I made a mental note of where exactly the light was in relation to two trees and my viewpoint out the back window so I could look out again in the morning to see what it was. I also took a few pictures. I looked out another window and it appeared to be on constantly but may have been blocked through the first window by vegetation or was facing another direction. At that point I started to wonder if the light was from someones house. Around 6am this morning I looked outside and I still saw the yellow light in the same spot which still made me suspect it is somehow someones light. This morning around 8am I looked outside in the same spot using binoculars and I could only see the forest floor. I thought last night I may have been looking at someones backyard but now it seems I wasn't. I will attach a few pictures I took last night and the same spot this morning. The night pictures are not great since I had to set my camera to \"starry night\" which takes a 15 second exposure. I tried to keep the shot as still as possible but I was not using a tripod. I took a few pictures of the light in the woods by holding the camera down against the window sill to help stabilize it. I have more photos than the ones attached. I would like to remain anonymous for as far as my name and address since this happened in our backyard and we don't want people trying to run around in the woods behind our house. Please feel free to contact me by email for the rest of the pictures, just a few, and for any questions you may have."],"Object Shape":"Star-like","Object Flight Path":"Hovering then path,Path then hovering","Latitude":"35.999833","Longitude":"-78.896419","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around February 12th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","Weather Factors":"None","Object Features":"Undisclosed","Sighting Duration":"04:00:00","Region":"North Carolina","files":["/var/www/straped/mufon/html2text/15472.html.txt","/var/www/straped/mufon/more/15472_submitter_file1__lightlowerinskyP1010003.JPG","/var/www/straped/mufon/more/15472_submitter_file2__lightinwoodsbetweentwotreesagainP1010015.JPG","/var/www/straped/mufon/more/15472_submitter_file3__recreateP1010015viewduringdayP1010034.JPG","/var/www/straped/mufon/org/15472.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.999833,+-78.896419(15472)&iwloc=A&hl=en\"> mufon case (15472) map </A>","Case Number":"15472","Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"02/12/2009 08:05 UTC","Source":"MUFON"}