{"Date Submitted":"02/20/2009 12:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy husband came home from a meeting and was getting out of the truck in our driveway around 8pm last evening. He noticed a bright star-like object (brighter than Venus) in the western sky right above the trees. He called me out to see it and I return inside the house to get a camera. My Nikon D-60 never gives me any trouble but last night, it just wouldn't work right. It keep zooming in and out on it's own. I did get some shots finally, but the object only looks a very bright star (almost as big as the moon sometimes). (NOTE: The date the camera is a day later...I suppose we set it wrong when we first got it.) This could have been the International Space Station, not sure. I don't know where it is in the night sky now. (If anyone knows where the ISS is located now, please let me know!) I went back outside after the pics I downloaded weren't showing much and it was gone. The object was very bright whatever it was! We will look again tonight about the same time to see if it's there again. That is all to report."],"Latitude":"32.511551","Summary":"Bright star like object seen in the west at 8pm Central Time.","Case Number":"15473","Object Shape":"Star-like","Date of the Event":"02/20/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/15473.html.txt","/var/www/straped/mufon/more/15473_submitter_file1__brightstar1.jpg","/var/www/straped/mufon/more/15473_submitter_file2__brightstar2.jpg","/var/www/straped/mufon/more/15473_submitter_file3__star3.jpg","/var/www/straped/mufon/org/15473.html"],"Log Number":"US-02132009-0007","Longitude":"-92.117021","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.511551,+-92.117021(15473)&iwloc=A&hl=en\"> mufon case (15473) map </A>","Sighting Duration":"Undisclosed","City":"Monroe","Region":"Louisiana","Object Features":"Undisclosed","trends":["There have been 6 other sightings in Monroe","There were no other sightings in Monroe on or around February 20th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Tags":"City","Disposition":"IFO"}