{"Latitude":"44.989275","Date Submitted":"08/15/1997 06:30 UTC","Disposition":"Insufficient Data","Log Number":"US-02132009-0014","Case Number":"15480","Longitude":"-93.259756","Summary":"We were driving north out of Minneapolis when I noticed what I thought was a hovering helicopter but as we got closer I realized it was something different.","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around August 15th 1997"],"City":"Minneapolis","Country":"United States","Region":"Minnesota","Object Shape":"Triangle","Source":"MUFON","Object Flight Path":"Stationary","Sighting Duration":"01:00:00","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMe and my father drove out to Utah to pick up my nephew. On the day of my sighting we were driving north out of Minneapolis as the sun was going down. On the right side of the interstate I noticed what appeared to be a helicopter hovering near a radio tower. I saw only what looked like a spotlight. I also saw an ambulance driving south on the frontage road with it's lights on so I figured it had something to do with the helicopter with it's spotlight on. As we got closer I suddenly saw that the object was not a helicopter but a triangular object. It was hovering by the radio tower and it was at least a hundred feet in length from corner to corner. It also had lights on each othe corner althouhg I don't remember what color they were. My nephew was asleep and my father was too busy driving in the heavy traffic to notice. I didn't say anything to my father about it because I guess I was in awe not understanding what I was seeing. I wasn't really scared but I felt funny about it. I later thought that if I had told my father about it he would have pulled over to get a closr look and I don't think I would be comfortable with that. I know other people driving that evening had to have seen the same thing as I. Later down the road maybe thirty minutes later I looked back in the distance and could still see it hovering above the tree line miles away. I told my father about an hour later and he just laughed at me. I seriously saw a large black triangle with lights on each corner that day and and do not doubt others that have seen the same."],"files":["/var/www/straped/mufon/html2text/15480.html.txt","/var/www/straped/mufon/org/15480.html"],"Object Features":"Unknown","Date of the Event":"08/15/1997 06:30 UTC","Weather Factors":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.989275,+-93.259756(15480)&iwloc=A&hl=en\"> mufon case (15480) map </A>"}