{"Log Number":"","divs":["Sighting Details:While in Lakes Wales on an investigation of a sighting I-1-740 I was informed ofneighbors who also had a sighting. After finish said investigation I visitedneighbors.This is their account:Last night while my wife was out I received a call from a neighbor to inform methat the lights we have seen in the past were back in the sky. I looked out andsure ennough there were the same bright lights. First there were four of themjust sitting there, not dropping like they would if they were on parachutes. Ididnt watch them all the time. They look like powerful electric lights justhanging there together. Then there were three of them stationary and fairly lowin the sky. A couple of years ago we saw the same thing. The light just sitthere and they come on and then seem to just shut off without notice. Theydont go up like flares or rocket launches and you dont see contrails. Theydont make any sounds they just hang there. They dont appear to be very faraway. My wife was off playing cards, so I decided to use her camera even thoughI dont understand it. I didnt think I was able to capture anything on film,but I tried anyway. I took one photo from inside the house and then wentoutside to take the second. I was surprised when I saw that they did come out. We do have a bombing range south of us, but these lights were east of us. Wenever see anything in the paper about them even though people have witnessedthem several times."],"Case Number":"1548","Country":"United States","Latitude":"27.905083","City":"Lake Wales","map":"<A HREF = \"http://maps.google.com/maps?q=27.905083,+-81.58085(1548)&iwloc=A&hl=en\"> mufon case (1548) map </A>","Object Flight Path":"Stationary","Date of the Event":"02/04/2002 08:00 UTC","Object Shape":"Sphere","Disposition":"Unresolved","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Lake Wales","There was one other sighting in Lake Wales on or around February 4th 2002"],"Weather Factors":"Unknown","Tags":"City","Viewing Distance":"101-500 Feet","Region":"Florida","Source":"MUFON","Longitude":"-81.58085","Date Submitted":"02/04/2002 08:00 UTC","Summary":"Unidentified Suspicious Lights over Polk Cty. FL","Sighting Duration":"00:30:00","files":["/var/www/straped/mufon/html2text/1548.html.txt","/var/www/straped/mufon/org/1548.html"]}