{"Viewing Distance":"Over One Mile","Weather Factors":"Windy, Lightning, Light","Log Number":"US-02142009-0001","Date of the Event":"02/13/2009 11:15 UTC","Country":"United States","Latitude":"32.35436","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around February 13th 2009"],"Disposition":"IFO","Case Number":"15482","Summary":"No shape, just flashing red, white lights. Descended straight down quickly and stopped short, hovered & then began descending very slowly into trees. Northwest from my home.","Object Shape":"Unknown","Tags":"City","City":"Tyler","Longitude":"-95.298022","files":["/var/www/straped/mufon/html2text/15482.html.txt","/var/www/straped/mufon/org/15482.html"],"Object Features":"Unknown","Region":"Texas","divs":["sighting detailsthis happened at my home in flint, tx off lake palestine. i first noticed a separate star looking oddity that i've reported here before - i actually see that one quite often - it kind of looks as though it's spinning and changes colors. it looks as though the light rotates when it moves. while i was watching television and noticed this spinning star thing - i began watching it move during a commercial and suddenly to the left of this star came what i initially though was a plane going down - i couldn't make out a shape b\\c it was dark outside, but the lights were red and white like a plane and flashed like i'd expect a plane to do. but it stopped short - it was going down fast and just stopped and then hovered - long enough for me to watch it for at least a minute and decide to get my camera. i got the camera but it's an old one and i couldn't capture it due to zoom being so low. in any case, it slowly, slowly lowered behind the trees northwest of my home. i've seen some strange things living out here and i don't know what any of it is - i don't have feelings about this anymore (at first i was scared) because i don't know what it is. i know some things i've been able to explain away, but this was one i could not. after i lost sight of it and it lowered into the trees i figured it couldn't hurt to report it here."],"Object Flight Path":"Path then hovering","Date Submitted":"02/13/2009 11:15 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.35436,+-95.298022(15482)&iwloc=A&hl=en\"> mufon case (15482) map </A>","Sighting Duration":"Undisclosed"}