{"Disposition":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"02/14/2009 09:35 UTC","Tags":"City","divs":["sighting detailsmy fiance and i were driving on the road at approx. 9:35 pm. it was dark, slightly hazy, and therefore no stars were visible. at the intersection of rts 15 and 896 (immediately south of the summit bridge) we stopped at a stoplight. we were looking approx. due east waiting for the traffic light to change when we looked up and saw what we thought was a plane. as it moved toward us, however, we noticed that there were no position or navigation lights (strobes or red\\green) on the object that are required on all aircraft flying at night. instead, the object had a single orange-ish light that pulsated, that seemed to be rotating. we were unable to discern any shape. it moved at about the speed a plane would along a straight path, with no erratic movement. we watched for about another minute more (we had pulled the car over to the shoulder to continue watching) and and at the end of that minute the object was no longer visible, though at the speed it was going it should have still been within our sights. it could have climbed up into the haze\\clouds. regardless, we lost sight of it. there are several airports nearby. my fiance is a pilot and confirmed he is unaware of any sort of aircraft that has this sort of orange seemingly rotating light, and confirmed that any nighttime flying craft should have strobes or red\\green lights, which this object did not have."],"Sighting Duration":"00:02:00","Object Shape":"Star-like, Other","Latitude":"39.449556","Source":"MUFON","Summary":"Orange-colored rotating light (in night sky).","Case Number":"15492","Longitude":"-75.716321","Object Flight Path":"Undisclosed","Date of the Event":"02/14/2009 09:35 UTC","trends":["There have been 2 other sightings in Middletown","There were no other sightings in Middletown on or around February 14th 2009"],"Region":"Delaware","files":["/var/www/straped/mufon/html2text/15492.html.txt","/var/www/straped/mufon/org/15492.html"],"Country":"United States","Log Number":"US-02142009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=39.449556,+-75.716321(15492)&iwloc=A&hl=en\"> mufon case (15492) map </A>","Weather Factors":"Unknown","City":"Middletown"}