{"Country":"United States","Source":"MUFON","City":"Royston","Tags":"City","Object Shape":"Flash","Object Flight Path":"Undisclosed","Longitude":"-83.110148","Object Features":"Undisclosed","Log Number":"US-02152009-0001","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Royston","There were no other sightings in Royston on or around February 14th 2009"],"Latitude":"34.28705","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date Submitted":"02/14/2009 11:40 UTC","Region":"Georgia","Case Number":"15493","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/15493.html.txt","/var/www/straped/mufon/org/15493.html"],"Date of the Event":"02/14/2009 11:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.28705,+-83.110148(15493)&iwloc=A&hl=en\"> mufon case (15493) map </A>","divs":["Sighting DetailsI have been going outside in the back patio of my house to smoke. I do not smoke in the house. There really isn't much to see but I began to see blinking red lights in one direction. Its hard to pinpoint how far,but It seemed to be coming from around the other end of the property,in the back of my house. They are always there only at night. I decided today that I would investigate and find out just where those lights might be coming from. There are very many trees here, mainly oak and some pines. Anyway, the lights,vivid red have been blinking for several months. Then today in the day time, I rode around my block and look for something, like christmes lights, or any other lights that appeared to be simular in appearance. I couldnt find anything. Tonight about 11:40 pm,I went out of my back door and saw the red blinking lights dart about about from their usual place and go higher into the sky,but not too high. There is only one red light darting here and there, left and right,up and down. I dont know what it is, and Im the only one that goes out to smoke at night. This is a sparsely populated area and I am concerned and curious at this time. I have been going out side to smoke for several months now and those lights have always been in the same area. Tonight for the first time,they changed and moved away and up and down.They are still back there as I write this narritive. I do not have a camara or film to take pictures of the blinking red lights. I am sorry for that and I will remedy that in the very near future."],"Summary":"Have seen red blinking lights many times, over a 4 month peroid."}