{"Date of the Event":"02/15/2009 11:35 UTC","Case Number":"15491","Region":"California","Summary":"3 UFOs high up to the north of the city, two to start, then all three, then one left.","Object Flight Path":"Path with directional change,Path then hovering","Latitude":"34.056834","Log Number":"US-02142009-0010","City":"Los Angeles","Date Submitted":"02/15/2009 11:35 UTC","divs":["Sighting Details1 mile south of Downtown Los Angeles. Periodically, while standing on a sidewalk I would look up at planes and hawks passing overhead. Also, as usual were very high altitude planes leaving quantrails. Airliners pass low overhead on their downwind leg for LAX. Then, to the north, 30 degrees up from the city lines horizon, I caught sight of a star like object way up high, then perhaps immediately, two. The sky had many clouds, but they were well apart from each other today. The two stars came close together but were on different courses. Then, one changed direction. Their speeds from this vantage point was slow but steadily moving. The brighter. no.1 was coming my way south coming closer overhead now about 35 degrees up. Still well downrange. The lesser was fading out moving north. Periodic. The brighter now seemed to be hovering, motion not apparent, too slow or stopped. Now I was ruling out aircraft. But over several minutes I concluded it was moving my way. I had called a friend over, he saw it too. Then a third object, same but brighter with a metallic shape attached to a star appeared from the south heading north. 15 degrees west of right overhead. Faster than the first two, still fairly slow. Brighter. Like a low satellite at night. My friend saw this too. I purposely did not mention the metallic look just forward on the star, he did, confirming my see. Then, UFO 2, the lesser, had remanifested to make three at the same time. Friend confirmed this too. UFO 3 approached 2, number one still crawled now heading east, much higher now. Not brighter. UFO 2 faded out again to the north, 3 went on to the same direction, fading off in the distance. Just no. 1 was left 80 degrees up now straight in front of me, passing off the the right and fading out. Sunlight was very bright throughout, these star UFOS were not reflective or flashy but constantly bright like a planet. Speed of no. 1 had changed from slow to very slow, direction had changed but so slowly as not to be noticed except over time. Hovering at that altitude rules out helicopter. No quantrails on these. Speeds too slow on no. 1 and 2 to be aircraft at that altitude, though 3 could have been very high plane. But I dont think so. My first sighting of such ever. I have taken one report before that I had not seen, had looked for years, but until today, saw nothing I could call unexplained. I see satellites regularly at night, these resembled such except for daytime visibility, apparent interaction, and changes of direction and speed of the first two. Balloons are apparent too sometimes in the bright sun, but tend to flash as they turn in the light, and are too low compared to these three. These were very much comparable to the star UFOs I see on youtube clips, but were much slower. My friend has agreed to write up his version of what he saw seperately. Brian"],"Weather Factors":"Unknown","Source":"MUFON","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=34.056834,+-118.236795(15491)&iwloc=A&hl=en\"> mufon case (15491) map </A>","Viewing Distance":"Over One Mile","Longitude":"-118.236795","Object Features":"Unknown","Object Shape":"Star-like, Other","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15491.html.txt","/var/www/straped/mufon/org/15491.html"],"Tags":"City","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 15th 2009"]}