{"trends":["There has been one other sighting in Bedford","There were no other sightings in Bedford on or around February 8th 2009"],"Date of the Event":"02/08/2009 08:30 UTC","files":["/var/www/straped/mufon/html2text/15501.html.txt","/var/www/straped/mufon/org/15501.html"],"Weather Factors":"Unknown","Longitude":"-78.502767","Case Number":"15501","Tags":"City","Object Features":"Unknown","Log Number":"US-02152009-0009","Region":"Pennsylvania","Date Submitted":"02/08/2009 08:30 UTC","Source":"MUFON","Object Shape":"Circle, Diamond, Star-like","Country":"United States","City":"Bedford","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Summary":"super bright starlike object seen while driving","divs":["Sighting DetailsWe were returning home from my parents house i99 towards bedford,pa to get on i70. I watched from the passenger window of the car at first thinking it was a planet that was visible. It wasnt one color the more you looked at it it appeared to be multi colored sorta rainbow like. it seemed to follow along the road and seemed stationary till i realised we pulled ahead of the light. At that point I had to look back over my shoulder to keep a fix on it. It was very very bright and even tho you couldnt see any other stars in the sky it stuck out almost looked like an airplane tower but there are none in that area. I watched it dim till it disappeared then gradually get brighter again it was hazy not cloudy and there were no other obstructions to block it. It did this on two different occasions. I watched this object for about 15 constant mins. Till finally the trees blocked it out. We got home around 9-930 that nite and the sky was clear you could see all the stars but I could not find what I was looking at earlier. And we are not really that far geographically from where I seen this object earlier. I looked online to see if there were any planets visible that nite and the only one was venus but it would have been crescent shaped and this wasnt it was starlike. I dont know what it was a saw but it was very intense more then any other star or planet i have ever seen in the nite sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.024582,+-78.502767(15501)&iwloc=A&hl=en\"> mufon case (15501) map </A>","Latitude":"40.024582","Object Flight Path":"Path then hovering","Disposition":"Insufficient Data"}