{"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Insufficient Data","City":"Undisclosed","Log Number":"US-02162009-0001","divs":["Sighting DetailsMy best friend and I were hauling hay (the small square bails). Due to the heat we would work at night and rest during the day. We had worked for a few hours and decided to take a short break. We were laying on the hood of his truck when I noticed a light going across the sky (deep sky, space). I said \"Look, a falling star!\". We both watched waiting for it to burn out but it never did. It disappeared over the Southern horizon (estimated). We kept watching the sky for something again when we noticed it had reappeared from the Northern horizon again. I began counting... 1001, 1002, 1003... it was gone again over the Southern horizon. Wow! That was fast. I assumed we were seeing something in orbit that had a good reflection. We were now watching the Northern horizon... several seconds later it appeared... 1001, 1002... it stopped dead in the middle of the sky. It just blended in with all the other stars. After several seconds, it made a series of zigzags going back and forth across the area in the middle of the sky, cris-crossing at times a previous path. All at the same speed it had originally traveled only stopping at starting without any affect on it's speed. It stopped in the middle of the sky once again... for several seconds... then went back the way it had came from the Northern horizon... 1001, 1002... it was gone. We never saw it again! But I still remember all the details so well! I have always wanted to calculate the speed the it was traveling but never have. The cover of Popular Mechanics this month is about UFOs. I am a very analytical person. Straight A's in school, no drinking, no drugs, very logical! If I had not seen this myself, I would be skeptical also, but I did see it, and know exactly what I saw! Seems that the person writing the article has never actually seen anything like this. What I saw was no weather balloon, reflection from another object, or some other craft from Earth. I know that the technology for this didn't exist in 1975, doesn't exist today, and will likely not exist in another 100 years on Earth. To be able to travel that speed, cover thousands of miles starting and stopping with no acceleration or deceleration, is technology out in our distant future."],"files":["/var/www/straped/mufon/html2text/15508.html.txt","/var/www/straped/mufon/org/15508.html"],"Longitude":"-97.090217","Summary":"Bright light in space traveling horizon to horizon in approx 4 seconds","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Object Shape":"Other","Date of the Event":"05/31/1975 12:00 UTC","Region":"Oklahoma","Date Submitted":"05/31/1975 12:00 UTC","Latitude":"35.015952","map":"<A HREF = \"http://maps.google.com/maps?q=35.015952,+-97.090217(15508)&iwloc=A&hl=en\"> mufon case (15508) map </A>","Country":"United States","Case Number":"15508","trends":[],"Tags":"City"}