{"Longitude":"-94.875695","Object Shape":"Circle, Disc","Weather Factors":"Unknown","divs":["Sighting DetailsI was about 14-15 years old when this happened. I stayed overnight with a friend and we were lying awake and talking, I had been noticing an engine - like sound that I thought was a train in the distance. It was a slow rythmic intermittent sound. It was deep and low almost quiet and I never would have thought about it, but for some reason it hit me that it was closer than the train tracks. I got up to look out of the window after several minutes of hearing it and I saw a solid circle of light above the trees over a nearby park. I think it was yellow light (Im colorblind) but travelling along the circle of light I could see a long patch of green light running the length of the circle. The green light seemed to go along with the sound of the engine. Every time the light passed on my side, I could hear the engine and feel it vibrate the floor and windows. I could feel it in my body too. I could not see the actual shape of the ship because the night was very dark. If had to put a shape to it, Id say it was a disk like shape from the lights it had. The park was only half a block away and this thing was alot larger that any helicopter I have ever seen. It covered almost the entire park. I told my friend to get up when he asked what I was doing and he saw it too. We stood there at the window together, excited to see such a thing. It had individual red, yellow and blue lights in a group at its top that took turns blinking and I think white lights on the bottom of the ship. The ship sat above the trees over Lyons Park for about a minute or so, then the green light began to move faster around the yellow ring and the engine noise sped up. When the engine became a constant hum, the ship took off to the North East, then switched sharply to the North West. The ship moved so fast that it went from looming huge in the window to a pinpoint of light in the sky in about a second and a half at most. It left a trail (kind of like a sci fi movie) of light behind it that faded in a few seconds. We were excited while it was there, but I remember feeling panicked after it left. And for some reason, the next thing we both remember is being in the kitchen afraid they were coming for us. We both remember jumping out of the second floor window to go to the convenience store, but we never went to the convenience store. I remember running into the badminton net and falling over and laughing histerically after leaving the house. I do not remember how we got to the kitchen that night, or how we got back into the house. But we did not go to the convenience store. Ive never felt like I was abducted, but everything was normal that night until I saw that ship. We didnt talk about it for a long time, but we do occassionally bring it up to each other, just to remind ourselves that it DID happen. Ive never reported this to anyone other than friends before, but I have always wanted to. I am going to join MUFON tonight, feel free to contact me through my email if I need to clarify anything."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","City":"Bonner Springs","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Object Features":"Unknown","Latitude":"39.066076","map":"<A HREF = \"http://maps.google.com/maps?q=39.066076,+-94.875695(15505)&iwloc=A&hl=en\"> mufon case (15505) map </A>","Case Number":"15505","Tags":"City","Source":"MUFON","trends":["There have been 4 other sightings in Bonner Springs","There were no other sightings in Bonner Springs on or around June 12th 1986"],"Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-02152009-0013","Summary":"[cms/tg] A ship hovered over the park for several minutes before we realized it and stayed while we watched, then it left quickly","Region":"Kansas","Date Submitted":"06/12/1986 10:30 UTC","files":["/var/www/straped/mufon/html2text/15505.html.txt","/var/www/straped/mufon/org/15505.html"],"Date of the Event":"06/12/1986 10:30 UTC"}