{"Country":"United States","City":"Undisclosed","Object Features":"Unknown","Summary":"Sighting occured at dusk with clear sky and no obstruction","Region":"Minnesota","Weather Factors":"None","Date of the Event":"06/30/1958 12:00 UTC","Date Submitted":"06/30/1958 12:00 UTC","Case Number":"15502","Latitude":"46.735953","Tags":"City","divs":["Sighting DetailsOn a summers night in July of 1958 my brother and I were outside playing in our yard. I was 12 years years old and he was ll at that time. It was a clear evening and the sun had set below the horizon. Our house was located on the east side of a paved road. To the west of us across the highway was located a plowed field about 300 feet wide and a quarter of a mile long. The length of the field ran parallel with the highway. On the other side of the field the terrain was raised and was a pasture for the farmer that lived on that side of the road. A very few trees grew in that pasture so we could see to the west of us and had a good view facing west across the highway viewing the sky at about a 15 degree angle with little obstruction. Since the sun had set below the treeline and the sky was not yet black, we had a very good view of the event. We observed a spherical to cylindrical orange to red object that seemed to float overhead that was approximately 1,000 feet in the air that appeared to come from the northeast at a speed of approximately 20-30 mph. The object was totally silent. The object appeared almost straight overhead of our position and moved to the southwest over the neighbor's field and pasture before finally disappearing over the treeline. The sky was perfectly clear and their was no wind. We had an unobstructed view of this object for approximately 30+ seconds. We went into our house and reported what we had seen to our parents. I remember this event like it was yesterday. I can see the object in my mind as it floats across the sky and I can see my brother and I standing their watching the object. I remember the conditions of the day and the absolute quiet of the evening. I went to a family gathering this past summer and mentioned this event and my brother mentioned he too remembered this event and described the event as if I was reporting it. I am level headed and am skeptical of many things. I served in Vietnam as military policeman and am used to hostile situations. This is my story. My brother is a witness."],"Object Shape":"Cylinder, Sphere","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=46.735953,+-94.67838(15502)&iwloc=A&hl=en\"> mufon case (15502) map </A>","files":["/var/www/straped/mufon/html2text/15502.html.txt","/var/www/straped/mufon/org/15502.html"],"Object Flight Path":"Straight-line path","trends":[],"Longitude":"-94.67838","Source":"MUFON","Log Number":"US-02152009-0010","Disposition":"Unknown"}