{"divs":["Sighting DetailsWas heading south on Indiana SR 52, having just gone through the stoplight at CR300 and SR 52 intersect, several businesses are located to the east side of parallel with SR 52. When a brilliant blue flash horizontal to the ground appeared right over the road in front of me, lighting up the entire area with the intensity of a welder arc, but a magnitude of of a camera flash -almost plasma like. The flash lasted about 3 to 4 seconds and looked not unlike a flame often found painted on custom cars, the flame was estimated to be between 75 to a hundred yards in length, with a width of about 25 to 30 yards, it was traveling west to east, its appearance was instant and size was constant. Weather conditions in the Lafayette IN area were extreme at the time, with high winds from the west, with sustained winds estimated at 25 to 35 mph, with gust up to 60 mph, a severe storm cell was going through with heavy rain blinding at times, but the worst of the storm was to the north of my location, being on the edge of the storm. The flash was estimated to be about 50 to 70 feet in elevation from the ground. There were multiple vehicles in and about the area heading in both directions on SR 52, with a van and a car directly under the area where the flash occurred. Was not intimidated by the incident, but am concerned by it. As an avid outdoorsman having spent much time in the field have never seen an anomaly such as this. The object or flash disappeared as rapidly as it appeared."],"Date of the Event":"02/11/2009 04:31 UTC","Viewing Distance":"101-500 Feet","trends":["There have been 30 other sightings in Lafayette","There were no other sightings in Lafayette on or around February 11th 2009"],"Summary":"Brilliant Blue Flash, horizontal to the ground on state road 52 south, Lafayette IN, with the intensity of a camera flash.","Case Number":"15512","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Region":"Indiana","Source":"MUFON","Object Shape":"Cigar, Flash","Object Features":"None","City":"Lafayette","Log Number":"US-02162009-0005","files":["/var/www/straped/mufon/html2text/15512.html.txt","/var/www/straped/mufon/org/15512.html"],"Date Submitted":"02/11/2009 04:31 UTC","Tags":"City","Latitude":"40.421382","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.421382,+-86.871827(15512)&iwloc=A&hl=en\"> mufon case (15512) map </A>","Longitude":"-86.871827"}