{"Object Features":"Unknown","Date of the Event":"02/04/2009 01:50 UTC","Log Number":"US-02162009-0012","Date Submitted":"02/04/2009 01:50 UTC","Case Number":"15519","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15519.html.txt","/var/www/straped/mufon/org/15519.html"],"Sighting Duration":"Undisclosed","Object Shape":"Teardrop, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.595639,+-84.581065(15519)&iwloc=A&hl=en\"> mufon case (15519) map </A>","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 3 other sightings in Quincy","There were no other sightings in Quincy on or around February 4th 2009"],"Country":"United States","Summary":"Wedge shaped object appeared and then disappeared","Longitude":"-84.581065","Latitude":"30.595639","Region":"Florida","divs":["sighting detailsi was driving back to my home in tallahassee, traveling east on i-10 on 02\\04\\09 having just picked up my car from a repair shop in quincy, fl. the receipt from the shop is timed at 1:34:59 pm. i had been on the road maybe 10 minutes. it was fairly cold out and the sky was a beautiful blue and clear of clouds. something in the sky ahead and a bit north of the interstate caught my attention. i immediately took my foot off the accelerator and focused my attention on this object. at arms length, it was the size of my pinkie fingernail, white in color and shaped sort of like a wedge but with curved edges. there were no wings or exhaust and it seemed to be fairly low - maybe 500 feet. i watched it steadily travel north for about 10 seconds trying to figure out what i was looking at. it then just disappeared, vanished. a few seconds later, it appeared again, just a bit north of where it vanished. it stayed visible for maybe 2 seconds and disappeared again, and did not reappear. i know it was not a plane, helicopter, bird, kite, or balloon. the only possibility i have thought of is an iridium flare. is it possible to see one during the day? and do they vanish and then reappear?"],"City":"Quincy","Object Flight Path":"Straight-line path"}