{"files":["/var/www/straped/mufon/html2text/15510.html.txt","/var/www/straped/mufon/org/15510.html"],"Weather Factors":"Unknown","trends":["There have been 8 other sightings in Salinas","There were no other sightings in Salinas on or around February 14th 2009"],"Country":"United States","Summary":"driving to the gym when i looked up and i saw 'see through' metallic objects fluttering inteh skyn going left and right and disappearing and reappering and finally disappering","Log Number":"US-02162009-0003","Date Submitted":"02/14/2009 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsValentine's day 2009 at 0900, i was driving to the gym when i looked up at a stoplight. i saw what looked like 30 or 40 mettalic and see-through fluttering wings. they looked liked a flock of birds but they were not. these were metallic and kept going left and right. they were in formation, like one was a leader and the rest following. they also disappeared and reappeared. it was a sunny morning with some clouds. i stared at the fluttering objects for a good 15 seconds before it finally disappeared. they were probably about a hundred feet up in the air. again, these were not birds; they reminded me of a cross between crystals and something of a metallic nature. when the disappeared, it wasn't all at once, it was gradual disappearce within a spand of 2-3 seconds. i was in awe but at the same time felt starnge. btw, i don't drink or do drugs; i'm a health professional and instructor. no one knows about this, including my husband,even though i tell him everything. and i don't really know why i did not tell him about the incident i experienced."],"Date of the Event":"02/14/2009 12:00 UTC","City":"Salinas","Latitude":"36.683997","Object Flight Path":"Path with directional change","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.683997,+-121.653271(15510)&iwloc=A&hl=en\"> mufon case (15510) map </A>","Longitude":"-121.653271","Region":"California","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"IFO","Object Features":"Wings, Other, Unknown","Case Number":"15510"}