{"Date Submitted":"02/15/2009 11:05 UTC","divs":["Sighting DetailsI went outside my house at 11:20PM to get something out of my car. I always look up at the night sky as a hobby and right above me, while I was facing north, I saw a very large amber colored skinny oval object moving silently from west to east. I am used to seeing these objects out here and I know they are UFO's, I watch each one regardless. This one looked to be about 1,000 feet up and judging from the height I would guess it was about as large as a house. I backed up to the street and watched it continue east until it faded away. Total time seemed like 5 minutes. When I was about to walk back inside, I saw another object following the same path as the first one that was a brilliant white triangle shape and was much larger than the first one, about twice the size. It moved very slow. Too slow for any known aircraft to stay in the air. It was not a helicopter. It made no sound. It stayed on the same course as the first object and i felt like i watched it for about 3 minutes or so. I looked down to hook my car keys on my belt loop instead of holding them and when I looked back up it was gone. I stayed outside for about another 5 minutes looking at the sky for anything else but didn't see anything. When I went back inside my house and looked at the clock, an hour and a half had passed as it was already 12:37AM. I know I was outside for no more than 15 minutes. I have never seen a triangular UFO out here. I did once in Kentucky years ago when I was 13 in 1993. I had a experience there, but never out here. I seem to have had a loss in time which I will have to investigate."],"map":"<A HREF = \"http://maps.google.com/maps?q=34.613634,+-112.311381(15511)&iwloc=A&hl=en\"> mufon case (15511) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Oval, Triangle","City":"Prescott Valley","Summary":"Amber oval UFO crossing sky followed by a white triangle","Disposition":"Unknown","Region":"Arizona","Date of the Event":"02/15/2009 11:05 UTC","Log Number":"US-02162009-0004","Longitude":"-112.311381","Country":"United States","Case Number":"15511","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Prescott Valley","There were no other sightings in Prescott Valley on or around February 15th 2009"],"Object Features":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15511.html.txt","/var/www/straped/mufon/org/15511.html"],"Latitude":"34.613634"}