{"Sighting Duration":"00:15:00","divs":["Sighting DetailsI saw 10 bright lights in the sky in two formations of 5 lights each plus a few dim scattered lights. All were moving from south to north very slowly and without noise. There was a partial moon off to my left somewhere and the lights were in a clear path. I could see the light moving relative to the stars above but there was no blocking of starlight. The lights were all distinct. No object could be seen, just moving lights. The formation shapes follow. * * * * * * 2 formations moving to the north. * * * * The ten lights were white and some varied very slightly in brightness but all were as bright as Jupiter or Venus when those planets are at their brightest. The few dim white lights were almost unseen except when I looked away and saw them at the edge of my direct line of sight. There were 3 to 6 of the dim lights. All lights stayed at the same positions relative to each other and moved slowly to the north until they went into a south moving cloud formation. It almost seemed like two aircraft carriers lined up with fighter escorts that stayed put relative to the each other and the two capital ships. From the point of one formation to the back covered about 20 degrees of my line of sight. Today, 2-16-09, I used a drafting adjustable triangle held about a foot from my face and adjusted the angle until it appeared to line up with the leading light to the back lights, as I recalled them. I locked the adjustable triangle and read approximately 20 degrees of azimuth for one formation of five. Both formations were identical. Elevation was about 60 degrees and ascertained with the same drafting tool. I saw the lights through my bedroom window and screen, then just the screen, then just the open air without any changes in the scene above. There was a severe wind blowing from the north and my home faces south. My bedroom window faces west."],"Object Shape":"Star-like","Longitude":"-75.48861","Weather Factors":"Unknown","Region":"Pennsylvania","Summary":"Saw 10 bright lights in sky in formations of 5 each plus a few dim lights moving from south to north very slowly without noise.","City":"Emmaus","trends":["There have been 9 other sightings in Emmaus","There were no other sightings in Emmaus on or around February 13th 2009"],"Tags":"City","Case Number":"15521","Object Features":"Undisclosed","Viewing Distance":"Unknown","Latitude":"40.542212","Object Flight Path":"Undisclosed","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15521.html.txt","/var/www/straped/mufon/org/15521.html"],"Country":"United States","Date Submitted":"02/13/2009 03:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.542212,+-75.48861(15521)&iwloc=A&hl=en\"> mufon case (15521) map </A>","Date of the Event":"02/13/2009 03:45 UTC","Log Number":"US-02162009-0014"}