{"Log Number":"US-02162009-0019","Object Shape":"Oval","Date of the Event":"01/26/2009 05:14 UTC","Summary":"Silver, oval shaped flying object that was flashing in the sky then vanished.","divs":["Sighting DetailsME and my room mate were driving down highway 183 south from Breckenridge, we were about to cross the county line into Eastland county. When we both noticed an object in the sky that we thought was a plane. What caught our eye at first was that it was flashing a white light, like a strobe light, but slower in intervals. We watched it for a minute at the most then on it's last flash it tilted upward then vanished. I slapped my room mate on the arm and asked him if he saw the same thing. He agreed. It was one of the few that we have seen. Mostly we see them at night but this was special because it was blantley during the day light hours. There was no sound, we waited for the 'boom' incase it was an f-16 going super sonic but none. We looked in the sky further to see if it had gone to another location in the sky but it had not appeared again. The motions of the object was smooth, floating but moving very fast towards the south. It wasn't far up in the sky couldn't have been more than 1500 feet up. We spoke about it for a few minutes, both of us were shocked but not surprised that we had finally saw one during the day. Then we started talking about the other ufo's we had seen. And we thought we should report it and most likely will not be the last report we make. Thanks for your time. J & R"],"Longitude":"-98.89699","City":"Breckenridge","Weather Factors":"None","Object Flight Path":"Straight-line path","Date Submitted":"01/26/2009 05:14 UTC","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around January 26th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.760617,+-98.89699(15526)&iwloc=A&hl=en\"> mufon case (15526) map </A>","Latitude":"32.760617","Object Features":"None","Tags":"City","Disposition":"Unknown","Sighting Duration":"00:01:30","Case Number":"15526","Region":"Texas","files":["/var/www/straped/mufon/html2text/15526.html.txt","/var/www/straped/mufon/org/15526.html"]}