{"Object Flight Path":"Path with directional change","Date Submitted":"02/15/2009 06:15 UTC","City":"Espanola","Log Number":"US-02162009-0022","Tags":"City","Country":"United States","Summary":"Very bright light in the sky, when we looked at it through binoculars, we can see a metallic object. First saw UFO day after the full moon. So pretty easy to see. We have been watching it for 6 days now. Always appears at 6:15.","divs":["Sighting DetailsWe have been watching a UFO for 6 days in a row now. We first saw it last Tuesday as a really bright light in the western sky over our mountains. It starts out high in the sky at around 6:15. It slowly moves closer to the horizon, occasionally adjusting it's altitude every once in a while. The first night it was the only light in the sky because there were alot of clouds and very bright. My husband went outside at maybe around 7:00pm, He immediatly thought it was a UFO. We looked at it through binoculars and could see a metallic craft. We watched it until it went behind the hill in our view, around 8:21. It was pretty easy to see because it was the day after a full moon. After it went behind the hill, we got in our car and drove into town. We could still see it, we drove toward it until it turned out it's light and it was gone. Every night since then, it has reappeared faithfully at 6:15. It is very easy to see because it's still pretty light at that time. We watch it with binoculars until 8:21. The first few nights, it slowly moved down, but the last few nights it has been moving all over the place when it gets close to the horizon. It goes side to side up and down and does a wierd little circular movement as it moves sideways. We did take some pictures but our camera isn't that good. Have tried to get better pictures by friends who have good cameras, but they are not wanting to believe our story, so we haven't found anyone to take any good pictures. I have been keeping a detailed journal for every night we have been watching it since it started. My husband reported it to our local newspaper, but he felt they didn't take him seriously, he also called the police the first night, but again felt they didn't take him seriously. We can see it with binoculars, it has been there six nights in a row that we know about. We feel it is kinda crazy that it's right there in plain sight for such a long time and no one really seems all that interested. I have watched it for a total of 12+ hours now."],"Source":"MUFON","Disposition":"Unknown","Object Shape":"Cigar, Sphere","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.005945,+-106.064928(15529)&iwloc=A&hl=en\"> mufon case (15529) map </A>","Object Features":"Window(s)","Latitude":"36.005945","Case Number":"15529","Viewing Distance":"Over One Mile","Date of the Event":"02/15/2009 06:15 UTC","Weather Factors":"Light","trends":["There has been one other sighting in Espanola","There were no other sightings in Espanola on or around February 15th 2009"],"Longitude":"-106.064928","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/15529.html.txt","/var/www/straped/mufon/org/15529.html"]}