{"Log Number":"US-02162009-0025","Object Shape":"Star-like","Viewing Distance":"Unknown","Longitude":"-71.796663","Country":"United States","Weather Factors":"Unknown","Case Number":"15532","Disposition":"IFO","Object Flight Path":"Stationary","divs":["Sighting DetailsI was leaving my brother's house in Whitinsville, Mass. As I approached my vehicle to place my belongings in the back seat, my attention was drawn to the sky to my right by a VERY bright star. I'm a city-dweller, so I just assumed the stars are brighter in this rural area. But it was still much, much brighter than anything else in the sky. I finished placing my belongings in the back seat, and when I looked back up at the object, it was dimming. I watched and within 30 seconds, it became very bright again. I went to ask my brother to come out a take a look, which he did. His first reaction was, \"It's a star.\" I told him to wait, and sure enough, it dimmed to the brightness of a normal star. Then it got very bright again. I estimate the cycle of bright to dim to bright as being about 1 minute in duration. We watched it for about 10 minutes until we got too cold. We observed planes fly well above this object. We heard no noise. My brother says the object was in the north sky. It did not appear to move at all. I think it was quite strange and wanted to let you know about it. As I was leaving, I asked my brother to try to take some pictures. I will forward them if he took some."],"Summary":"fixed light in sky, very bright, then dim, then bright, repeating","Date Submitted":"02/16/2009 06:45 UTC","City":"Worcester","Object Features":"None","files":["/var/www/straped/mufon/html2text/15532.html.txt","/var/www/straped/mufon/org/15532.html"],"Region":"Massachusetts","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.272573,+-71.796663(15532)&iwloc=A&hl=en\"> mufon case (15532) map </A>","Date of the Event":"02/16/2009 06:45 UTC","Latitude":"42.272573","trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around February 16th 2009"],"Tags":"City","Source":"MUFON"}