{"Date Submitted":"02/16/2009 07:41 UTC","Sighting Duration":"00:01:45","Tags":"City","City":"Bridgeport","trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around February 16th 2009"],"Case Number":"15531","Latitude":"41.194948","Longitude":"-73.188217","Date of the Event":"02/16/2009 07:41 UTC","Object Shape":"Circle, Oval, Sphere","Object Flight Path":"Straight-line path","Log Number":"US-02162009-0024","map":"<A HREF = \"http://maps.google.com/maps?q=41.194948,+-73.188217(15531)&iwloc=A&hl=en\"> mufon case (15531) map </A>","Region":"Connecticut","Object Features":"Unknown","Country":"United States","Source":"MUFON","Weather Factors":"None","Summary":"BRIGHT Orange, non-blinking light moving NW to NE across sky...","Disposition":"IFO","Viewing Distance":"Over One Mile","divs":["sighting detailsi just saw a not-blinking bright orange light move across the sky from almost horizon-to-horizon... i was pointing at it to my brother... i saw 2 aircraft with normal blinking lights in the sky at the same time... just another cover-up, lol... but *i* saw this one!!! home, watching my bro go home... it didn't blink, and was orange... most planes are blinking red\\ green\\white... i thought it was a plane, but it didn't blink. it moved in a straight line, at a constant speed... i was wondering if it was a satilite, at first, but now i'm thinking it was going way too fast for that (i could be wrong?) i saw it, when i went outside to watch my brother leave my house to go home. i live in a 'bad' neighborhood. as i was standing in my driveway, it was a clear night and i could finally see some stars, so i looked, and saw this bright orange non-blinking light moving across the sky. my brother was just into his car and was warming up his engine, i guess, but i pointed up at it, not knowing if he saw me or not (it's dark here, atm...) i also looked around the sky at that time and saw *2* other 'normal' aircraft with blinking lights, in 2 different directions... i called him a little while later and asked him if he saw what i was pointing at, and he said, 'no', he was doing other things at the time... i lost sight when it was behind one of my neighbors houses... the whole view lasted about 45 seconds? no blinking, bright orange light... thx, peeps.... be well 8)"],"files":["/var/www/straped/mufon/html2text/15531.html.txt","/var/www/straped/mufon/org/15531.html"]}