{"map":"<A HREF = \"http://maps.google.com/maps?q=41.685781,+-86.241847(15533)&iwloc=A&hl=en\"> mufon case (15533) map </A>","trends":["There have been 38 other sightings in South Bend","There was one other sighting in South Bend on or around February 16th 2009"],"Log Number":"US-02162009-0026","Source":"MUFON","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Object Features":"Appendage(s)","Sighting Duration":"Undisclosed","Longitude":"-86.241847","Summary":"Saw an unusal large object with several white lights hovering in the sky.","Latitude":"41.685781","divs":["Sighting DetailsWhile waiting to turn left off roosevelt road onto 31, I looked to my right and saw what I thought at first to be a tower in the distance.. northeast. I saw what appeared to be 3 or 4 bright white lights but i could not make out the shape of the object. I realised that the towers in the area had red lights and it struck me as weird that I had never seen anything in that part of the sky before. It was quite big and and odd, probably a half mile or so away. I turned right onto 31 south in an attempt to see it more clearly. As I got closer looking to my left I saw it was a rectangular shape and I thought i saw something underneath it as well. But, I was driving and could not take my eyes off the road long enough to sharpen my focus. As I turned left onto miller road, It began to move slowly down and away from me. I began to lose my visual because of trees,etc. .When I looked back again it was gone. I pulled over and searched the sky and saw nothing. I did this 2 more times as I slowly drove miller road. The night was clear and as it darkened I saw a fair amount of stars, including a planet. I have never seen anything like the object. The lights seemed peculiar to me as well. They did not blink. And they were quite bright. And I was aware of no sound coming from it. MJ"],"Region":"Indiana","Date Submitted":"02/16/2009 07:30 UTC","Case Number":"15533","Date of the Event":"02/16/2009 07:30 UTC","Object Shape":"Square, Rectagular, Unknown","Viewing Distance":"501 Feet - 1 Mile","City":"South Bend","files":["/var/www/straped/mufon/html2text/15533.html.txt","/var/www/straped/mufon/org/15533.html"],"Country":"United States","Weather Factors":"Unknown","Disposition":"Unknown"}