{"Latitude":"39.278428","Summary":"Dull orange ball of light moving relatively slow about 30` above the horizon","Date of the Event":"02/16/2009 08:15 UTC","Viewing Distance":"Over One Mile","Longitude":"-84.262516","Tags":"City","Disposition":"IFO","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","divs":["sighting detailsi went outside tonight at about 7:45pm to look at the sky since it was very clear. i saw a number of planes and sattelites. all the planes had some combination of red and green lights with strobes and the sattelites were just faint little points of lights (like small stars) moving in one direction. at about 8:15 pm i saw a dull orange sphere of light as i was facing south, the object was moving west to east at about 30 degrees above the horizon. it appeared to be uniform in color and moving at a relatively slow speed. it's size was about a 1\\4 of a fingernail at arms length. i observed for a bout 2 min before it went out of view behind some trees. i saw 3 other aircraft fly that same general path and they were all identifiable as aircraft having red\\green lights with strobes. this one was obviously different. i have never seen a ufo before and certainly not one that i would consider extraterestrial and i'm not sure this one classifies as such but it was different than all other aircraft that i witnessed tonight and i truly don't know what it was. the only reason i am reporting this is because it matches a report from somebody near the east coast. i didn't have my camera, so no pics, sorry."],"City":"Loveland-Madeira Corridor","files":["/var/www/straped/mufon/html2text/15537.html.txt","/var/www/straped/mufon/org/15537.html"],"Source":"MUFON","Region":"Ohio","Sighting Duration":"Undisclosed","trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around February 16th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.278428,+-84.262516(15537)&iwloc=A&hl=en\"> mufon case (15537) map </A>","Case Number":"15537","Country":"United States","Object Features":"Unknown","Log Number":"US-02162009-0030","Date Submitted":"02/16/2009 08:15 UTC","Object Shape":"Sphere, Star-like"}