{"Object Shape":"Triangle","City":"Honolulu","Object Flight Path":"Undisclosed","Date Submitted":"02/08/2009 12:00 UTC","Country":"United States","Tags":"City","Source":"MUFON","Object Features":"Undisclosed","Summary":"Waikiki -UfO over Diamond Head","Latitude":"21.310754","map":"<A HREF = \"http://maps.google.com/maps?q=21.310754,+-157.849633(15539)&iwloc=A&hl=en\"> mufon case (15539) map </A>","Weather Factors":"Unknown","Region":"Hawaii","Case Number":"15539","Viewing Distance":"Unknown","Date of the Event":"02/08/2009 12:00 UTC","Disposition":"Unresolved","Longitude":"-157.849633","divs":["Sighting Details1. The UFO was a dark blob shaped like a Sony Playstation controller. 2. I was looking out from a hotel room overlooking Waikiki and noticed an object hovering over or just past Diamond Head. Diamond head was in the distance and the object's distance was difficult to determine. Diamond Head: 21.262181, -157.806759 Looking from 21.281657, -157.838323 3. I was assuming it was a Chinook helicopter because I saw them fly over Aloha Stadium just before the Pro Bowl kickoff. 4. The dark video game console controller-shaped object hovered over Diamond Head with two objecs either tehtered or staying to different sides of the object. It hovered over Diamond head for about a minute then moved out over the Pacific. It disappeared in the distance while looking toward this direction: 21.248582, -157.859373. it moved slowly at first but must have picked up speed because in the distance it became a small dot at about 45 degrees from our vantage point in a few minutes. 5. It didn't look identifiable but I felt it was close enough where I'd be able to identify anything I was familiar with. I could have at least narrowed it down to helicopter, fix wing aircraft, etc. I Went for the camera after it had started moving West. It floated straight out into the Pacific. It seemed to stay stationary as it became smaller. I realized that I captured it on film and more shots wouldn't be amy better since detail would be worse. Someone on the beach was pointing at it shortly after noticing it over Diamond head. I took images with a 7.1 megapixel camera with a 4X optical and 16X digital zoom. The first two shots are at zero magnification . The rest of the shots were on full zoom (and the object had moved fairly far from it's hover point). If I had the camera ready earlier I believe I would have had a better picture. 6. I lost site when it became a small dot at about 45 degrees from my vantage point. It became too small to distinguish. If it was a Chinook helicopter, it appeared as it went to the edge of space."],"trends":["There have been 17 other sightings in Honolulu","There was one other sighting in Honolulu on or around February 8th 2009","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15539.html.txt","/var/www/straped/mufon/more/15539_submitter_file1__IMG_0562.JPG","/var/www/straped/mufon/more/15539_submitter_file2__IMG_0563.JPG","/var/www/straped/mufon/more/15539_submitter_file3__IMG_0564.JPG","/var/www/straped/mufon/org/15539.html"],"Log Number":"US-02172009-0001"}