{"Object Features":"None, Unknown","Date of the Event":"02/12/2009 09:00 UTC","Date Submitted":"02/12/2009 09:00 UTC","Longitude":"-86.418398","Summary":"Stationary light in sky changing colors which then moved very quickly http://www.youtube.com/watch?v=TRC-60lPVUc","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.436415,+-86.418398(15530)&iwloc=A&hl=en\"> mufon case (15530) map </A>","Sighting Duration":"00:30:00","trends":["There have been 7 other sightings in Martinsville","There were no other sightings in Martinsville on or around February 12th 2009"],"Disposition":"Unknown","divs":["sighting detailswe were at home and i went out on the garage stoop to have a cigarette. i had seen a strange light in the sky for more than an hour, but assumed it was an airplane as we are in the flight pattern of indianapolis airport flights. after i went back out and noticed it was still in the same location, i thought maybe i should look closer. i came into the house to get my hd camcorder and returned outside where my wife joined me. we proceeded to film the object and within a minute of starting to film, the object shot off further into the southern\\southwestern sky at a very high rate of speed (i.e. in the blink of an eye). we both observed this behavior through the viewfinder of the camera. the object then slowly started coming closer to us again as you will see in the film. during this time, it changes from a fiery object into a dim diamond. when we saw the object shoot off at a high rate of speed, we knew we were not looking at an identifiable terrestrial craft. this caused us to come a bit concerned, but we did not feel threatened. after i came into the house to find a tripod, i returned outdoors and the object had disappeared completely. please take a look at the video. it is not clear to me what images might be created from chromatic aberrations or other digital video artifacts, but it is *very* clear that the object moved at an extremely high rate of speed. i do have the original footage recorded at 1080p. http:\\\\www.youtube.com\\watch?v=trc-60lpvuc best, l"],"Weather Factors":"None","City":"Martinsville","Latitude":"39.436415","files":["/var/www/straped/mufon/html2text/15530.html.txt","/var/www/straped/mufon/org/15530.html"],"Log Number":"US-02162009-0023","Tags":"City","Object Shape":"Diamond, Fireball","Case Number":"15530","Region":"Indiana"}