{"Tags":"City","Case Number":"15540","Country":"United States","Date Submitted":"02/14/2009 10:14 UTC","Object Flight Path":"Undisclosed","Region":"Tennessee","Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/15540.html.txt","/var/www/straped/mufon/org/15540.html"],"Sighting Duration":"Undisclosed","Summary":"Large dull blue/green object traveling north.","Latitude":"35.961908","Object Features":"Undisclosed","Source":"MUFON","Date of the Event":"02/14/2009 10:14 UTC","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around February 14th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.961908,+-83.916659(15540)&iwloc=A&hl=en\"> mufon case (15540) map </A>","Longitude":"-83.916659","Disposition":"Insufficient Data","divs":["sighting detailsi was traveling north and noticed object to my left and above me as it passed heading north towards kentucky then disappeared behind ridge.i also noticed a plane heading east and as object passed the plane it seemed to be at a lower altitude and much larger than the plane. the object was a dull blue\\green color,not as bright as a meteor or fireball but it was leaving a vapor trail of the same color but it didn't appear to be smoke or fire and object didn't appear to be on fire either,just a dull glow. the object was traveling at a very high rate and in a straight line and within about 7 to 10 seconds was out of sight.it wasn't dropping out of the sky but was on a parallel course to the ground as it passed me and sustained the same altitude or though it seems.i didn't see it breaking up or any falling debris as it passed by. i knew about the sat. collisions from a few days ago and thought that might be what it was but it seemed to be too large for it to be wreckage.there was no contrails of smoke that lingered after wards either. not sure what it was."],"Viewing Distance":"Unknown","Log Number":"US-02172009-0002","Weather Factors":"Medium","City":"Knoxville"}