{"Weather Factors":"Unknown","Region":"Pennsylvania","Log Number":"US-02172009-0007","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Longitude":"-75.181291","Disposition":"Unknown","divs":["sighting detailsi can't recall the exact date of the event. i know it was springtime\\early summer and i'm almost positive i was between 6 and 8 years old. probably closer to 8, so around 1990-1991. my brother and i were outside in the yard and noticed what at first just looked like 2 early evening stars until we saw them move closer together. one of them was still, almost like it had been there and waited for the other to get there. and not only were there no stars in the sky yet, but the objects were perfectly round and the light was pure white and uniform in clarity and brightness. no flickering, no fading. after a minute or two or three of not really thinking twice about it, we noticed the lights directly over us\\our yard. we jumped on bikes and rode through the neighborhood to see where the lights would go. the lights followed and stopped directly above us in the middle of a cul-de-sac. after a couple minutes of watching, we could hear planes and within about 30 seconds we saw the planes come up over the tree line in the direction of the lights. and i can't remember how many planes. i believe as few as 3 and as many as 5. once most or all of the planes were in plain sight(a few seconds), the lights took off. from hovering still to a speed at least 1.5 times the speed of the planes in the blink of an eye(though maybe closer to 2 or 3 times the speed of the planes). like the objects defied any kind of law of acceleration or aerodynamics. the objescts disappeared behind a treeline adjacent to where the planes had come from and that was the last we saw. i wish i had reported this earlier, but am glad i found somewhere to do it now. i'm also very curious as to whether anyone in my area saw the same or similar lights that day\\evening. thanks so much for your time and i apologize for a somewhat clowdy recollection of what happened. -tim ruckel"],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/15545.html.txt","/var/www/straped/mufon/org/15545.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.999539,+-75.181291(15545)&iwloc=A&hl=en\"> mufon case (15545) map </A>","Summary":"2 lights in the sky seemed to be following our activity.","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"15545","trends":["There have been 3 other sightings in East Stroudsburg","There were no other sightings in East Stroudsburg on or around April 30th 1990"],"Tags":"City","Date Submitted":"04/30/1990 12:00 UTC","Latitude":"40.999539","City":"East Stroudsburg","Source":"MUFON","Object Features":"Unknown","Date of the Event":"04/30/1990 12:00 UTC","Object Shape":"Circle, Star-like"}