{"files":["/var/www/straped/mufon/html2text/15546.html.txt","/var/www/straped/mufon/org/15546.html"],"Object Flight Path":"Stationary,Straight-line path","Object Shape":"Sphere, Star-like","Object Features":"Undisclosed","Longitude":"-101.849006","map":"<A HREF = \"http://maps.google.com/maps?q=33.582983,+-101.849006(15546)&iwloc=A&hl=en\"> mufon case (15546) map </A>","Disposition":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"09/27/2008 07:45 UTC","Sighting Duration":"Undisclosed","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around September 27th 2008"],"divs":["Sighting DetailsAround 7:45 pm CST, my husband and I exited a Hasting's here in Lubbock. As we were walking to our vehicle, I looked up in the sky towards the East and saw a very bright spherical object about 50 degrees up. It was reminiscent of a very bright star or planet at first, but as we looked closer, we could actually see an object reflecting light very brightly. This was late summer, so it was just dusk outside, not yet dark. Other people in the parking lot noticed the bright object as well. We watched it for a few minutes, and decided to go home, which was only about 3 minutes drive away. As we parked in our driveway, we were facing North, so I had a clear view of it out the passenger window. The sky was darkening a little, but the object was still very bright. It seemed to be moving to the left ever so slightly. I decided to be able to estimate how big it was and just how far up it was, I would call my mother in Clovis, NM and see if she could see it as well. Clovis, NM is NW of Lubbock, and approximately 95 miles away. My mother stepped outside into her backyard and looked toward the East, but slightly southernly, and could see the object in the sky as well. As the night sky darkened we all watched as the object faded and then disappeared. The event ended about 8:06 pm CST."],"Tags":"City","City":"Lubbock","Case Number":"15546","Latitude":"33.582983","Country":"United States","Date of the Event":"09/27/2008 07:45 UTC","Weather Factors":"None","Summary":"Very bright reflective sphere shaped object.","Log Number":"US-02172009-0008","Source":"MUFON","Region":"Texas"}