{"divs":["sighting detailsmy wife and i were returning home from the indianapolis area on 2\\\\7\\09. we exited i-465 onto us 31 north around 9 pm. heading north a bright light caught my eye to the west and a little behind my peripheral vision. as i continued to try to watch this light my first thought was that it was a passenger jet with landing lights on turning back to the airport. but it never turned. after about 10 minutes or so i told my wife to watch this light. this light appeared to be maybe 5 to 10 miles to the west and from my advantage at about 30 to 35 degrees from the horizon. as we continued north we observed this light move to the west at quite a distance to where the light was only a pinpoint of light or disappear completely. then after a couple of minutes it would come back to its original position. this happened numerous times. the farther north we went the light kept its same orientation. if it were a star, the light would continually fall farther behind us. as we approached the south side of kokomo the light disappeared completely. we never saw it again as we continued into miami county."],"Source":"MUFON","Summary":"Bright light in western sky.","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/15547.html.txt","/var/www/straped/mufon/org/15547.html"],"Disposition":"Insufficient Data","Longitude":"-86.063451","Object Features":"Unknown","City":"Peru","Log Number":"US-02172009-0009","Object Shape":"Star-like","Tags":"City","Date of the Event":"02/07/2009 09:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"40.761143","map":"<A HREF = \"http://maps.google.com/maps?q=40.761143,+-86.063451(15547)&iwloc=A&hl=en\"> mufon case (15547) map </A>","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around February 7th 2009"],"Date Submitted":"02/07/2009 09:00 UTC","Weather Factors":"None","Region":"Indiana","Object Flight Path":"Stationary,Straight-line path","Case Number":"15547"}