{"Log Number":"US-02172009-0019","Case Number":"15557","Weather Factors":"None","Object Features":"Unknown","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsI was on my way home from a trip to Nashville, TN with a friend who was driving. I was looking at my friend, and as I looked at her to the west, behind her through the drivers window this light started to form way up in the heavens, and this light caught my eye, and it started making a zig zag until it touched the lower hemishere and while I was looking at it, it was this bright yellow, amber light in the center of the whole core of this object and red flashing fire or energy was coming off this. It looked hot and intense and I knew it wasn't lightning, as lightning doesn't go in this perfect form of a zig zag, and the color was not consistent with lightning and this red flashing off this was not consistent with lightning. Then I asked my friend to take the temp reading outside the car, and she did and it was 26 Degrees, too cool for lightning. And it disapeared as suddenly as it began. It was nothing I have ever experienced before and I did report this to the Daviess County Sheriff's office. This experience did really upset me, as I was unable to explain this phenomina in my own mind."],"City":"Owensboro","Summary":"Bright yellow zig zag light in middle, with red flash of fire or energy coming off its core from the western night sky on the Willaim Natcher parkway heading north to Owensboro, Ky.","Sighting Duration":"00:00:07","Latitude":"37.773647","Region":"Kentucky","Date Submitted":"02/15/2009 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.773647,+-87.103168(15557)&iwloc=A&hl=en\"> mufon case (15557) map </A>","Source":"MUFON","Country":"United States","Longitude":"-87.103168","Object Flight Path":"Path with directional change","trends":["There have been 9 other sightings in Owensboro","There were no other sightings in Owensboro on or around February 15th 2009"],"Disposition":"Unknown","Object Shape":"Chevron, Fireball, Flash","files":["/var/www/straped/mufon/html2text/15557.html.txt","/var/www/straped/mufon/org/15557.html"],"Date of the Event":"02/15/2009 08:15 UTC"}