{"Disposition":"Insufficient Data","Object Features":"Unknown","Longitude":"-92.454643","Latitude":"45.452181","Date of the Event":"10/03/2008 08:20 UTC","Region":"Wisconsin","trends":["There have been no other sightings in Balsam Lake","This sighting has never been favorited."],"divs":["Sighting Details My friend and I were at my house on I think Oct 3rd. It was about 8:20 pm and we were looking at the stars. We were getting tired so we were heading in. We were going down my driveway to the house when we saw a yellow glowing oval object to the south. It came up from behind the trees but like when something comes over the horizon, so not directly behind them. We stopped and watched it rise up. When I put my arm up it was about the size of my pinkie nail. It came up about a thumb length and just stayed there for about a minute. then it began to flash. It did this for about a half a minute. Then it completely disappeared for about 10 seconds then it came back but not as the glowing object but as flashing lights. The lights were red, blue,green,yellow,and white.It stayed in the same place for about half a minute the started to move to the left or east of our position. It moved very slowing at first them went very fast and went the same distance in half the time. At first we saw it we thought it was a hot air balloon or some sort of fireworks. We were very interested and a little cautious. I thought about getting my camera but didn't want to miss it. Then we got a little scared because when it got to the point when it was almost straight east of us we looked back at the place in the sky that it came form and saw another one it came up in the same fashion but took less time to flash and turn into the flashing lights. The one that was flashing turned into the flashing lights and went in the opposite direction of the first one and disappeared. While the second one was coming up and flashing another two came up in the same way and went off in opposite directions. When they were all gone we went in the house and called my science teacher. He didn't know what it might be and told us to contact the local authorities. I called the none emergency center and reported the incident. They told me that they would send a person out the next day. They never came or called back. Well that is my UFO account."],"Log Number":"US-02172009-0018","map":"<A HREF = \"http://maps.google.com/maps?q=45.452181,+-92.454643(15556)&iwloc=A&hl=en\"> mufon case (15556) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"Oval in shape bright yellow almost white flashed a few times.","City":"Balsam Lake","Weather Factors":"Unknown","Sighting Duration":"00:15:01","Object Shape":"Flash, Oval","files":["/var/www/straped/mufon/html2text/15556.html.txt","/var/www/straped/mufon/org/15556.html"],"Country":"United States","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"15556","Source":"MUFON","Date Submitted":"10/03/2008 08:20 UTC"}