{"Object Shape":"Circle, Disc","Date Submitted":"09/19/1979 01:00 UTC","Region":"Oklahoma","Weather Factors":"Unknown","City":"Hobart","Viewing Distance":"Unknown","trends":["There have been no other sightings in Hobart","This sighting has never been favorited."],"divs":["Sighting DetailsWhen I was thirteen we lived out five miles south-west of Hobart. On a saturday night I missed my ride home so me and a friend descided waik to my house so we started to waik about 12.30 am i live in hobart okl the house south west of town ok we started walking about a mile and ahale my friend needed a cigatette so he knocked on these people house that lived a half mile outside of town. I stayed up the road dogs were barking but not at me and i could hear a strange noise in the sky so i was looking around and i couldnt see nothing so my friend got back with his cigerette and we started walking on down the road so now we are about two and ahale mile out of town on a dirt road. So im am looking up in the sky it is dark very dark away a distance i can see a red light in the sky i goes right it goes left and then all of the sudden it is right in front of us bout thirty feet in front of us it is hoovern right about tree level we both come to a stop i say to my self it is not from this world my freind takes off runnin and iam froze standing still i look down the road he is running i look back up iam right in the middle of this round UFO iam looking staright up in it it lights me up i cant run im still froze i do not know if scared that i cant move but im looking right in it in the center but if lights me up so i start to pray and i said a prayer thats when i was able to run so till this day i do not know how long i was under that light but i believe this thing had ubducted me cause i have had two other inconters ive believe they have done somthing to me. So i ask please please for some help so i do not think iam crazy. iam not a educated man but i do know a plane a helicopter or a balloon. PS HObART is NORTH OF ALTUS OKLAHOMA IT HAS A AIR BASE so what i have seen was not of this world please respond to (Item placed under field investigator special notes***)"],"Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-02172009-0012","files":["/var/www/straped/mufon/html2text/15550.html.txt","/var/www/straped/mufon/org/15550.html"],"Latitude":"35.029501","Object Flight Path":"Undisclosed","Longitude":"-99.093132","map":"<A HREF = \"http://maps.google.com/maps?q=35.029501,+-99.093132(15550)&iwloc=A&hl=en\"> mufon case (15550) map </A>","Case Number":"15550","Object Features":"Undisclosed","Country":"United States","Tags":"City","Date of the Event":"09/19/1979 01:00 UTC","Disposition":"Unknown","Summary":"Scared fast round and not of this world."}