{"Longitude":"-93.268827","Disposition":"Unknown","Log Number":"US-02182009-0001","Tags":"City","divs":["Sighting DetailsI was on Facebook, my daughter playing Nintendo DS. Ran out of cigarettes, needed to go to the store. Went outside to start my car to warm it up, in the SSW sky I noticed right away a HUGE BALL of light, yellowish orange in color, round, about the size of a grapefruit in the sky, but I could tell it was miles and miles away. I stared at it for about 15-20 seconds. It did not move. It was a clear night out, I saw the moon, stars, and even Venus. I didn't know what to think about it, I'm naturally humorous, so I was thinking to myself maybe the nuke is coming, or finally a meteor is going to hit the earth. I didn't know. I came inside and told my daughter to get ready to go, and got on Facebook again and asked people to go outside and look in the sky towards the south, but to keep in mind that I'm in Minnesota, so look accordingly. People went outside and looked. My sister Siobhan came back to her computer and typed that it was Venus, I said no, I saw Venus..it's not venus. I asked couldn't they see that HUGE BALL of light in the sky? They all said I was paranoid and silly. I went outside to get into the car, and it was gone. How can something that HUGE in the sky just disappear with no trace and no witnesses other that myself? I am not crazy, nor on any medications. I saw what I saw, and that's it. I googled HUGE BALL of light in Minnesota sky, and come up with nothing. Also got on the NASA site, and they had nothing to look at...no search bar. Looked at other UFO sites to see if anyone had seen this...no results. So here I sit...boggled to no end. What was that? Do you know? My Mom also had been searching for information, but kept coming up with UFO sightings in the world that had similar descriptions of what I saw on the same day. So I contacted you all. Would love a response from you letting me know if anyone else saw this thing, and if so, has anyone figured out what it was? I have never really been a UFO person, so this is a little odd for me."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.294964,+-93.268827(15564)&iwloc=A&hl=en\"> mufon case (15564) map </A>","Object Shape":"Sphere","City":"Faribault","Region":"Minnesota","Sighting Duration":"00:00:20","Date of the Event":"02/05/2009 07:15 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/15564.html.txt","/var/www/straped/mufon/org/15564.html"],"Summary":"Yellowish orangish HUGE BALL of light. Dusty/Hazy outter edges.","Case Number":"15564","Object Flight Path":"Stationary","Weather Factors":"None","Latitude":"44.294964","Country":"United States","trends":["There have been 3 other sightings in Faribault","There were no other sightings in Faribault on or around February 5th 2009"],"Date Submitted":"02/05/2009 07:15 UTC","Viewing Distance":"Over One Mile","Source":"MUFON"}