{"divs":["Sighting DetailsI was going to Mc Donalds late at night. They close at 1100 pm and it was only 1045 but yet they were already closed. I stopped at the stop sign at Whittier Blvd and Chestnut street which is one street away from my home and saw a UFO in the sky. This is not the first time I have seen this craft. If is the second time and I have seen it again just two nights ago. I don't believe in UFO's. In person the UFO is red and has round windows with lights on in them. Just like if someone has left a lamp on with a shade pulled at home. I dont know why it does not show up like that in pictures? It shows up as a lighted disk shaped object. I stopped my car and rolled down the window to get a picture with my cell phone. I took one and it did not take off or anything. I did. I left to find another fast food restaurant to get something to eat. I was not afraid. I was not even interested to be honest. It's just the second time I have seen this object and I cant explain it. I have been leary to tell anyone about it for fear they would think I was crazy? The first time I saw it, it was leaning against a tree next door. That sounds even worse I know, but its true! It was about three months ago and when I first moved in here. There is a large tree next door and the craft was stopped there leaning on the tree as if using the branches to conceil it or something? It was about the same time at night and it didn't go away until I went inside to get a camera. When I came back it was gone. The same craft was here two nights ago. I went to let my cat outside at aout 315 am and I saw it in the eastern sky just sitting there. I took a few more pictures with my home camera and my cell phone too but they look black and dont show much"],"Object Shape":"Disc","Date of the Event":"02/03/2009 10:45 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","City":"La Habra","Country":"United States","Object Features":"Undisclosed","Date Submitted":"02/03/2009 10:45 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/15574.html.txt","/var/www/straped/mufon/more/15574_submitter_file1__02-03-09_2253.jpg","/var/www/straped/mufon/org/15574.html"],"Sighting Duration":"Undisclosed","Log Number":"US-02182009-0011","Source":"MUFON","trends":["There have been 4 other sightings in La Habra","There were no other sightings in La Habra on or around February 3rd 2009","This sighting has never been favorited.",""],"Latitude":"33.937698","Region":"California","Summary":"Second time I saw a UFO near my house.","map":"<A HREF = \"http://maps.google.com/maps?q=33.937698,+-117.938633(15574)&iwloc=A&hl=en\"> mufon case (15574) map </A>","Longitude":"-117.938633","Case Number":"15574"}