{"Viewing Distance":"Unknown","Case Number":"15573","Object Shape":"Cylinder, Sphere, Triangle, Other","Weather Factors":"None","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.947128,+-97.53862(15573)&iwloc=A&hl=en\"> mufon case (15573) map </A>","Object Flight Path":"Path with directional change","Longitude":"-97.53862","Region":"Texas","Log Number":"US-02182009-0010","Disposition":"Unknown","Date of the Event":"02/18/2009 02:00 UTC","Summary":"Multiple white objects dematerializing and rematerializing.","Tags":"City","Latitude":"30.947128","trends":["There have been no other sightings in Salado","This sighting has never been favorited."],"City":"Salado","Date Submitted":"02/18/2009 02:00 UTC","divs":["Sighting Details As I was driving over Stillhouse Creek dam near Salado,TX , a glint caught my attention. Directly ahead of me about 20 to 30 degrees above the horizon I noticed several white objects moving toward me at an angle. They were grouped pretty tightly and not in any kind of formation. I started to run through what they could be, jets, birds? Then it got real weird. They dissapeared and then reappeared whithin a second or two.At this point they were almost above me and I pulled over as soon as I crossed the dam.I got out and looked above me to the east.They seemed to just appear suddenly.It looked like about 7 objects white, and at times round but then angular and more elongated. As they moved they would glint in the sunlight.I was wearing polerized sunglasses and when I lifted them to look they wernt there and then when I put them back on there they were.This could have been just the glare from the sun but I thought I would mention it.They moved slowly and changed direction often and quickly, at times they just dematerialized and then reappeared again.After five minutes or so they dissapeared and I didnt see them anymore.I did notice two jets flying close together right were I had just seen the objects, they were smaller and lower than airliners, like a Leer type jet maybe.Also there were two Chinook helicopters in the area around the lake at the same time.I am near Fort Hood and seeing helicopters is common but I thought it was worth a mention.I got in my truck and headed down the road bewildered by what I had just seen. About one mile or so later I spotted these things again, but on the west side of the road and heading east.I followed them with my eyes until they seemed to dissapear again.As soon as I could I pulled into a church parking lot and got out. I scanned the cloudless sky for them but saw nothing.And then suddenly there they were coming toward and over me.I got a really good look at them.They seemed to change in number, some appearing and some dissapearing randomly, also they seemed to change shape and not be very defineable.Most seemed to move together in unison but some would do there own thing moving at angles and in circles.At one point they seemed to be descending rapidly and then they continued on to the northeast and just vaporized in seconds. I have tried to rationalize what I saw but what could just dissapear and then reappear.I feel these were not material objects, it felt like I was seeing something unreal if that makes any sense. Either I am totally nuts or I saw something bizzare.If there is an explaination for these things I wish I knew."],"Object Features":"Other","files":["/var/www/straped/mufon/html2text/15573.html.txt","/var/www/straped/mufon/org/15573.html"],"Source":"MUFON"}