{"Longitude":"-91.303743","map":"<A HREF = \"http://maps.google.com/maps?q=36.080348,+-91.303743(15579)&iwloc=A&hl=en\"> mufon case (15579) map </A>","divs":["Sighting DetailsI used to work in a different county than where i live now, (i won't say where i worked or what county yet), but my job consisted of driving around the county all night checking on things. One night when i was stopped at one of my stopping points, i noticed these unusally brite lights in the sky, there were two of them. At first i thought nothing of it except that they were strangly brite and moved very little, if any. Well, i began seeing these things every night. I noticed they would come out over a tree line at about the same time every night, (between 2:30 and 3:00 am). They would always be the same distance from me, (between 1 and 2 miles). At first, for several weeks, i couldn't tell anything about these (craft) except for their really brite lights. Then one night as i was approaching the area where they always were, i came upon a four way intersection where one corner had one of those really brite street lights. Well, being used to this from driving the same area every night, I knew that tipping mt hat would keep the street light out of my eyes,(as this helps to see the intersection more clearly). But when i passed through the intersection and lifted my head back up i was still being blinded by a extremly brite light. I quickly hit my breaks and pointed my search light toward the (craft),(as my job required one on my truck). When i did this, the (craft) turned its light off. There, not 100 feet from me, and no more than 30 to 40 feet high, was a flying (craft). This craft was no more than 12 to 14 feet tall, and 5 to 7 feet wide at both ends. I say, at both ends, because it was in the perfect shape of an hourglass. It just sat there a few seconds then took off paralell to the road. I took off and sped up and we stayed side by side for about a mile untill it shot across the road and met back up with the other (craft). Once there, it turned its light back on. Just to see what would happen i again turned my search light on the object. When i did, it would turn its light out again. Every night after that they would still come out at the same time and every time i would spotlight them they would turn their lights off. As soon as i turned mine off they would turn theirs back on. This went on every night all summer long. One night i seen them take turns flying through a violent thunderstorm. One would wait motionless untill the other came out, they would flash their lights at each other like they were communicating, then the other would fly in. One would always wait on the other to come out before entering the storm. I wish now i would have contacted someone with the proper equipment to videotape these (craft), but at the time i was afraid of ridecule. Not to mention i was still having a hard time believing what i had seen that one night and was still seeing every night after that. I know of one other person who seen one of these objects. It was at the 4th of july fireworks display. They said that one flew over the display and before they could tell me the shape of it, i said, let me guess, it was in the shape of an hourglass. Their eyes became wider as they ask if i had seen it to. I informed them that i hadn't just then but i had been watching them every night for some time. They asked what they were and i said, you tell me. I know this story sounds to wierd to be true, but i know what i saw and would take a polygraph test for anyone at anytime to prove it. I finally decided to get this off my chest and let people believe what they may. I'm stepping forward know because i've recently been watching, UFO HUNTERS on the HISTORY channel. They taught me that theirs alot of other people out there thats seen strange objects also, and for that i would really like to thank the gentleman. I'm planning a trip back to the sightings this summer, (as its not very far from where i live). With any luck, since they were indeed there all summer, maybe they will be back. If so, then hopefully we can prove to the world that there is something strange in our skies, especially at night. Oh, before i go it might interest you to know that i DO NOT believe in life from other planets, but there is strange (craft) out there. One last thing i would like to note. Just like we've all heard before, these (craft) were completely silent. Even as close as i was to the object that night, i heard nothing. Not even when it accelerated away."],"Case Number":"15579","Region":"Arkansas","Latitude":"36.080348","Disposition":"Unknown","Weather Factors":"Does Not Apply","Viewing Distance":"21-100 Feet","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","City":"Smithville","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/15579.html.txt","/var/www/straped/mufon/org/15579.html"],"Object Shape":"Other","Tags":"City","trends":["There have been no other sightings in Smithville","This sighting has never been favorited."],"Log Number":"US-02182009-0016","Sighting Duration":"00:00:00","Country":"United States","Date Submitted":"11/30/2000 03:00 UTC","Date of the Event":"11/30/2000 03:00 UTC","Summary":"Close encounter of the second kind."}