{"Object Flight Path":"Hovering then path","Country":"United States","Object Shape":"Circle, Other","Longitude":"-117.89034","Date Submitted":"02/17/2009 01:14 UTC","Disposition":"Unknown","Latitude":"34.090009","divs":["Sighting Detailsi was outside of my house in the front yard and i have been seeing this object once in a while thinking,may be it was a star or meteor but when i noticed yesterday that it was moving then i relized that it was not a star or meteorite since it was moving slow like a ship of sometype.It is located above the western horizon and not always in the same place.i was able to take some photos and find them very strange maybe you can enhance them bigger as i did and see some strange shapes and colors.one picture in particular shows this disc shape object and the others show these weired strings of color.i felt very excited to see such unusual objects and when i took the photos with the flash i could swear they were flashng back.I even tried to communicate with them telepathecally to see if they could hear me but wasnt sure if they could.today i again saw the object and i again tried to record some pictures with my phone camcorder but something jam in my phone which i found strange since i havent had too much trouble with my phone before.i am sending you these pictures because i want to know if this is a true UFO which i feel it is and if you feel that it is something else let me know because i really dont know what else it could be.please contact me if you have any questions and also if you know anybody in california tell them to look into the western sky and they too will see this object since it has been coming around alot.let me know if you want anymore photos since i only can send 3 per your website."],"Sighting Duration":"Undisclosed","City":"Covina","Tags":"City","Object Features":"Unknown","Region":"California","Weather Factors":"Unknown","Source":"MUFON","Summary":"Disc shape and had blue and red flashes of light.","Date of the Event":"02/17/2009 01:14 UTC","trends":["There have been 6 other sightings in Covina","There were no other sightings in Covina on or around February 17th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=34.090009,+-117.89034(15581)&iwloc=A&hl=en\"> mufon case (15581) map </A>","files":["/var/www/straped/mufon/html2text/15581.html.txt","/var/www/straped/mufon/more/15581_submitter_file1__019.JPG","/var/www/straped/mufon/more/15581_submitter_file2__041.JPG","/var/www/straped/mufon/more/15581_submitter_file3__046.JPG","/var/www/straped/mufon/org/15581.html"],"Viewing Distance":"Unknown","Case Number":"15581","Log Number":"US-02182009-0018"}