{"City":"Simi Valley","Source":"MUFON","divs":["Sighting DetailsI just drove home from work. When I got out of my car I looked up at the night sky. I always see stars and bright objects so I started to get in the habit of looking up before I enter my home. Take note that I never saw anything before that I would consider a UFO. Anyways, I looked up a couple of times as I walked to my home. I then noticed a bright object far up in the sky, too far to tell the shape of it, which shot across the night sky going in a direction away from me. It had a long bright exhaust that seemed to blast out and disappear as fast as the object was visible. It lasted about one second. In fact, if it weren't for the bright exhaust I probably wouldn't have noticed it. The exhaust didn't gradually stretch out or gradually disappear. It was like a quick lightning flash behind this object. When the object left, the exhaust left, which was only one second. Don't believe it to be a shooting star because it didn't seem to gradually get farther away in the distance. It seemed to have shot off so fast that it disappeared from sight. And it didn't seem to be something I saw in space. Looked to be in the sky but high up. It went in a straight direction, level with the ground. Now I heard about military crafts that can fly at classified high speeds. Perhaps this is a government vehicle? Well I continued to look up at the sky for a few minutes after I saw this. Didn't notice anything else so I went into my home. As for how I felt, I was excited but disappointed that it happened so fast that I couldn't get a camera to take a picture. I would swear on a bible that what I described is true."],"Region":"California","Summary":"UFO blasts across sky like shooting star, with bright exhaust behind it.","Object Features":"Unknown","Log Number":"US-02192009-0001","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around February 18th 2009"],"Longitude":"-118.779572","Date Submitted":"02/18/2009 07:00 UTC","Disposition":"IFO","Date of the Event":"02/18/2009 07:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.270947,+-118.779572(15585)&iwloc=A&hl=en\"> mufon case (15585) map </A>","Latitude":"34.270947","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/15585.html.txt","/var/www/straped/mufon/org/15585.html"],"Weather Factors":"None","Viewing Distance":"Unknown","Tags":"City","Object Shape":"Unknown","Case Number":"15585","Sighting Duration":"00:00:01"}