{"Source":"MUFON","Latitude":"43.020237","Viewing Distance":"101-500 Feet","City":"Flint","Object Shape":"Other","Weather Factors":"Unknown","Object Features":"Wings","Case Number":"1558","trends":["There have been 40 other sightings in Flint","There was one other sighting in Flint on or around June 20th 1985"],"divs":["Sighting DetailsSummarized from FI report:Witnesses were watching television in the living room of the home they share inFlint, Michigan. Wit.1 suddenly had a strong urge to look outside. He walkedto the front door and looked southwest. He was amazed to see a black helicopteror stingray shaped object hovering some 500 ft. away. He said to Wit.2, \"lookat this\". Wit.2 walked over and looked outside and could also see the blackoblong object hovering in the night sky. They decided to go outdoors so theycould get a better look. The two estimated that the object was 30 ft. long andabout 15 ft. wide. It was hovering some 1000 ft. from the ground but veryslowly descending, stopping at approx. 750 ft. to hover again. The object madea very slow turn, facing north, northeast, and was now facing toward thewitnesses. They became excited, drawing attention of two neighbors. The objectmoved closer to the witnesses. They could see that the object was flat on thebottom, \"shaped like a stingray\" because the stubby little wings swept backward. The object made a very slow turn to the southeast, then turned slowly back tothe north, northeast, once again facing the witnesses. It then made a U turn,that the witnesses described as a 135 degree turn to the left and faced west. The object then turned slowly and moved away toward the southwest, in thegeneral direction of Bishop Airport and the US 23 expressway. The object put onan aerial display that lasted for approx. 15 minutes. They viewed this objectthrough a 50X telescope. It was noted there were 8 or 9 red lights and 3bluish-green lights beneath the crafts black body. One of the blue-green lightsgave off a blue-greenish beam of light that was erratic. The object gave offheat which reminded the witnesses of heat lightning. There was an odor in theair that reminded them of static electricity. No sound was ever heard. Whenthe object disappeared, it moved to approx. 1000 ft. elevation at a 45 WSWapproach, 55 SSW and moved away slowly."],"Country":"United States","Summary":"Stingray shaped object hovers near Flint, Michigan","Date of the Event":"06/20/1985 10:35 UTC","Date Submitted":"06/20/1985 10:35 UTC","Region":"Michigan","Longitude":"-83.681296","files":["/var/www/straped/mufon/html2text/1558.html.txt","/var/www/straped/mufon/org/1558.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.020237,+-83.681296(1558)&iwloc=A&hl=en\"> mufon case (1558) map </A>","Sighting Duration":"00:30:00","Log Number":"","Object Flight Path":"Unknown","Disposition":"Unresolved","Tags":"City"}