{"Longitude":"-96.637952","Disposition":"IFO","Latitude":"33.204646","Source":"MUFON","Log Number":"US-02192009-0006","Object Flight Path":"Stationary,Path with directional change","Summary":"Aereal phenomenon; 4 definitive UFOs, bright flash, and a dissapearing star.","Tags":"City","Date of the Event":"10/15/2007 03:40 UTC","Date Submitted":"10/15/2007 03:40 UTC","trends":["There have been 30 other sightings in McKinney","There were no other sightings in McKinney on or around October 15th 2007"],"City":"McKinney","divs":["Sighting DetailsMyself, and a friend had stepped outside for a cigarette while visiting my grandparents at their country home. There were meteor showers that night, and conditions were excellent for star gazing. I noticed two high altitude crafts traveling from north to south very slowly. I pointed them out to my friend and we both continued to watch them. We ruled out that they were not planes ( public or commercial ) due to the lack of blinking emergency lights that you can see at night. They were so distantly upward and bright that I began to think they must be satelites. It was just too strange though. They were about a half inch apart in the sky, one following the other, and zig-zagged completely in sync with eachother in their southward heading. I then consulted with my friend and we ruled out satelites as being what we were observing. They definatly must be piloted aircraft we thought. Now my father is a pilot, and I had co-piloted with him on many occasions at dusk, and night. I was quite used to spotting air traffic and could tell these were unique given there precise cordination. We watched the two crafts for close to ten minutes when suddenly they both faded upward, as if dissapearing into the distance, but in space. We both stood there looking upward stunned and dumb-founded. I concluded at that point we must have wittnessed some form of military expieramental aircraft. Wow! (the nearest military instillation being Ft. Hood some 80 miles away). We both continued to watch the sky hoping for another glimpse. Suddenly there is a brilliant flash, very much like a camera flash going off on the other side of a stadium. This was near where the first two craft had vanished. I had never seen, heard, or been educated about anything like this flash before. Perhaps an explosion? So now we were set on observing the sky. This is where it gets freaky. I was in no way prepared for what we see next. My grandmother's home is the flightpath of incoming and outgoing DFW traffic. There was a northbound 747 passenger airline. We could not help but to track it too since it was in the same vicinity of sky we were already watching. Suddenly there was a very large, and bright star-like orb directly tailing the plane. My stomach literaly sank. I feared that this thing was going to harm the airliner. It followed the plane for nearly five minutes, matching the planes airspeed and appeared to be at just a slightly higher altitude. It then sped up to the plane at intense speed and vanished over the tail section of the plane. At this very moment another one of these objects appears from the same spot as where the object we had just seen vanished, first appeared. It shot directly over our heads, causing me to fall backwards. It simply vanished overhead. I was in a state of shock. These things had interacted with a passanger jet and now with us. About an hour later, at sunrise, my friend says he watched a star I had also observed, just after I had gone inside to wake up my family and scan the news channels for any coverage, vanish. In his own words it was as if a light was just switched off. The star was brilliantly bright, producing the same amount of light as the morning star. I went outside, it was still twilight ; the star, gone. I am a first responder in the state of California, a volunteer Cival Air Patrolman, and another observer of the real unknown. I've expierianced near post dramatic stress symptoms since the sighting. I believe that at this time, on this planet, we ( humans ) do not possess the flight computer tecknology, propulsion, or ability to create the appearance these things had. Hope this helps somehow, and good look to those still hoping to have the truth revealed."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.204646,+-96.637952(15590)&iwloc=A&hl=en\"> mufon case (15590) map </A>","Region":"Texas","Case Number":"15590","Sighting Duration":"Undisclosed","Object Features":"Unknown","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/15590.html.txt","/var/www/straped/mufon/org/15590.html"],"Weather Factors":"Unknown","Object Shape":"Circle, Fireball, Flash, Saturn-like, Star-like"}