{"Date Submitted":"08/31/1991 12:00 UTC","trends":["There has been one other sighting in Newberry","There were no other sightings in Newberry on or around August 31st 1991"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.358188,+-85.502139(15591)&iwloc=A&hl=en\"> mufon case (15591) map </A>","Tags":"City","Object Features":"None","Date of the Event":"08/31/1991 12:00 UTC","divs":["Sighting DetailsI was camping at Muskallonge Lake State Park on the shores of Lake Superior. It was Labor Day weekend, 1991. I remember the year because my son was 14 years old at the time, however, I don't remember the exact day of the weekend. We walked from our campground over the sand dunes and down to the beach at approximately 11:00 pm because we wanted to see the northern lights. As we were sitting there talking, we looked out over the horizon of the lake and saw what looked like lighted sails on a sailboat. The colors were bright yellow and orange. It was so far in the distance that I thought it was sailboats (there were 3 or 4), but, my friend said, \"Sails are not a solid light like that.\" We began watching them and it appeared that they were moving closer....coming towards shore, but they were still very far off in the distance. As they appeared to move closer, I started getting a little nervous feeling and told my friend, \"Let's go.\" Then, before our eyes, they turned white, turned into circles and shot straight up and disappeared. This has always stayed extremely vivid through the years, but I have shared it with few people. I have tried googling the info to see if anyone else saw the same thing that weekend, but couldn't find anything. I would be very curious if anyone else saw the same thing on and over Lake Superior around that time or anytime since."],"Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Other","Region":"Michigan","Viewing Distance":"Unknown","City":"Newberry","Case Number":"15591","Log Number":"US-02192009-0007","Object Shape":"Circle, Triangle","Longitude":"-85.502139","Latitude":"46.358188","files":["/var/www/straped/mufon/html2text/15591.html.txt","/var/www/straped/mufon/org/15591.html"],"Weather Factors":"Unknown","Country":"United States","Summary":"Bright triangle shapes appeared to be sailboats in the distance on Lake Superior, then turned into circles and shot up into sky."}