{"files":["/var/www/straped/mufon/html2text/15596.html.txt","/var/www/straped/mufon/org/15596.html"],"Disposition":"Unknown","Date Submitted":"02/18/2009 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Cylinder, Diamond, Square, Rectagular","Region":"Missouri","Source":"MUFON","Summary":"Appeared in the western sky aprox. 15-20 degrees above horizon.","Longitude":"-92.660446","Latitude":"36.951999","Date of the Event":"02/18/2009 12:00 UTC","divs":["Sighting DetailsI took my dog outside and noticed a glowing object in the western sky between the trees. I walked to the top of my driveway where there is a clearing to get a better look. There were no clouds in the sky, it was a clear night with a good view of the stars. I live quite a few miles out of town so it was very dark out. At first I thought that it was a planet. It appeared to be a vertical bright white light, cylindrical in shape, with a red light on the top and bottom of the object. There were two triangular blue wing-like outlines on each side of the object. The object would dim almost to the point of darkness and then glow really bright as if it were made of neon lights. The object seemed to lose altitude slowly and then rise several degrees as if it were a kite in the breeze. I observed the object for over an hour off and on, between tending for the dog, looking for my 35mm camera with a telephoto lens (which I couldn't find) calling friends to see if they could see it, and trying to stay warm. (it was about twenty degrees out) I even drove toward several miles down the road toward it to see if it got bigger or smaller, but it remained the same size. I finally gave up, going back into the house. I did peek out several times during the next half hour, and then it was gone. I tried to take a picture with my digital camera, but to no avail. I am an artist with a knack for detail so I made up a computer sketch to show what it looked like. The colors are not accurate, the true colors on the object were neon-like and very bright. I really would like to believe that it was a planet, but I don't know how a planet could look like that."],"Viewing Distance":"Unknown","City":"Ava","map":"<A HREF = \"http://maps.google.com/maps?q=36.951999,+-92.660446(15596)&iwloc=A&hl=en\"> mufon case (15596) map </A>","Case Number":"15596","Tags":"City","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Ava","This sighting has never been favorited."],"Object Features":"Undisclosed","Country":"United States","Log Number":"US-02192009-0012","Sighting Duration":"Undisclosed"}