{"Source":"MUFON","Viewing Distance":"Unknown","Disposition":"IFO","Region":"California","Country":"United States","Log Number":"US-02202009-0001","trends":["There have been no other sightings in Palos Verdes Estates","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","City":"Palos Verdes Estates","Case Number":"15609","divs":["Sighting DetailsMy brother came knocking frantically at my door saying he could see something strange out in the sky. We ran to the outside porch, from which we can see all of Los Angeles and the Santa Monica Bay. Directly over Redondo Beach and the bordering areas of Palos Verdes Estates was a bright blue saucer-shaped object traveling incredibly quickly up and down, in loops, and back and forth, in a seemingly frantic mode. My brother thought it was a helicopter or plane, as we normally see these things, but its lights were incredibly bright, it made no noise, it was close, and it seemed to make movements otherwise believed to be aerially impossible. Three of us saw this; my brother, myself, and my girlfriend. Only my girlfriend was skeptical enough, in the end, to believe it was something man-made. She speculates that a local well-off individual has a new toy they were trying out. It seemed to be something more than that to my brother and I. We lost sight of the object when it disappeared into the woods near Haggerty's, less than 100 yards from the Pacific Ocean."],"Latitude":"33.800571","map":"<A HREF = \"http://maps.google.com/maps?q=33.800571,+-118.390074(15609)&iwloc=A&hl=en\"> mufon case (15609) map </A>","Weather Factors":"Unknown","Longitude":"-118.390074","Summary":"Bright blue lights travelling quickly from neighborhood streets up into the atmosphere.","Sighting Duration":"Undisclosed","Date Submitted":"02/19/2009 08:39 UTC","files":["/var/www/straped/mufon/html2text/15609.html.txt","/var/www/straped/mufon/org/15609.html"],"Tags":"City","Object Features":"Undisclosed","Object Shape":"Circle","Date of the Event":"02/19/2009 08:39 UTC"}