{"Log Number":"US-02192009-0018","Object Features":"Patterned Surface","trends":["There have been 3 other sightings in Burlington","There were no other sightings in Burlington on or around July 23rd 2007"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/15605.html.txt","/var/www/straped/mufon/org/15605.html"],"Date Submitted":"07/23/2007 06:07 UTC","Region":"Iowa","Country":"United States","Longitude":"-91.112573","Tags":"City","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"15605","map":"<A HREF = \"http://maps.google.com/maps?q=40.816666,+-91.112573(15605)&iwloc=A&hl=en\"> mufon case (15605) map </A>","Date of the Event":"07/23/2007 06:07 UTC","Object Shape":"Egg","Latitude":"40.816666","City":"Burlington","divs":["Sighting Details I was traveling in the car on the way to Perkins Restaurant for coffee, going north on Roosevelt Avenue near the high school, and I glanced up at the sky at 6:07 a. m. I noticed a brilliant blue light in the southeast. As it came nearer, I could see an oval-shaped craft about 50 feet long and 40 feet wide with a blue light on the bottom and cruising about 400-500 feet above the ground. It had no identifying marks, no wings, and no propellers, and no means of propulsion such as rockets or jets. I thought it must be some sort of an anti-gravity device, and I realized it must be a UFO, since I have seen one before. I only got a glimpse of it for about four seconds, and it shot off fast in a northwest direction. It descended slightly, and I could see a dark gray checkered top. Then it curved west and took off in the direction of the Iowa Army Ammunition Plant. My state of mind before the event was calm, but afterwards I was very interested and excited. I lost sight of the object since it went over the horizon. There was no sound."],"Object Flight Path":"Hovering then path,Path with directional change","Summary":"Egg-shaped object, blue underneath, black checkered on top"}