{"Date of the Event":"08/20/2000 10:30 UTC","files":["/var/www/straped/mufon/html2text/15619.html.txt","/var/www/straped/mufon/org/15619.html"],"Date Submitted":"08/20/2000 10:30 UTC","Longitude":"-74.217649","Sighting Duration":"00:05:00","trends":["There has been one other sighting in Maybrook","There were no other sightings in Maybrook on or around August 20th 2000"],"Tags":"City","Case Number":"15619","Object Features":"None","Log Number":"US-02202009-0010","map":"<A HREF = \"http://maps.google.com/maps?q=41.483983,+-74.217649(15619)&iwloc=A&hl=en\"> mufon case (15619) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"20 Feet or Less","Latitude":"41.483983","Object Shape":"Other","Summary":"UFO flies over my house.","divs":["Sighting DetailsMy sister and I, who were 10 and 13, respectively, were in my second floor bedroom in my house. We were looking out the window towards the north east. We saw a light in the sky in the distance. At the time we thought nothing of it because Stewart International Airport is in that direction and 747 planes take off and fly a route which goes over my house. A few planes had already passed before. This time was different. As the light approached it was much lower than the usual planes which by the time they are flying over the house, they are a few thousand feet in the air. This craft flew over the tree line slowly and then proceeded to fly over the roof of my house. I estimate it to have been about ten to fifteen feet above the roof. The craft was about thirty feet in diameter and was black. It had eight bright white lights on each of it's eight corners. The craft was an octagon shape. It rumbled very loudly. It did not shake the house nor did it produce wind as with a helicopter. I estimate it's speed at about five miles per hour. As it flew over the roof, my sister and I ran to the back of the house to watch it come over the roof but it never came. It was gone. Immediately we ran down stairs to my mother. We asked her if she had just heard the very loud rumbling noise. There is no way she could not have heard it. She claimed that she hadn't heard anything. The last remembered time I noted was about 10:30PM. This was as the craft approached the house. I never checked the time after the event, which would have been vital had I known what \"missing time\" was. I believe though that my sister and I experienced \"missing time\". My theory is that the reason we did not see the craft come over the roof of the house from the back window is because it had passed and gone long before we ever ran to the back of the house to view it. Additionally, my mother did not hear the craft, this is because a long time had passed since the craft actually flew over. These two things make me believe that several minutes or more had passed and the both of us (sister and me) didn't even notice, hence \"missing time\"."],"Source":"MUFON","Region":"New York","Country":"United States","Weather Factors":"None, Does Not Apply","Disposition":"Insufficient Data","City":"Maybrook"}