{"Case Number":"15612","Object Features":"Undisclosed","Longitude":"-0.748229","files":["/var/www/straped/mufon/html2text/15612.html.txt","/var/www/straped/mufon/org/15612.html"],"Region":"England","Summary":"Unusual event.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.628611,+-0.748229(15612)&iwloc=A&hl=en\"> mufon case (15612) map </A>","Date of the Event":"02/19/2009 08:50 UTC","Date Submitted":"02/19/2009 08:50 UTC","Disposition":"Unresolved","Weather Factors":"Unknown","Log Number":"GB-02202009-0004","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in High Wycombe","There were no other sightings in High Wycombe on or around February 19th 2009"],"Viewing Distance":"Unknown","Country":"United Kingdom","Object Shape":"Unknown","Object Flight Path":"Undisclosed","divs":["sighting detailslast evening 19\\2\\09 at 8:50 i was indoors watching television, with the sound turned up quite high. over the top of this i heard a very loud engine noise. thinking it might be a police helicopter on patrol overhead i went to the front door, which looks west. directly in front of me at 40 degrees elevation, i saw a red flashing light heading north. this light exhibited a completely irregular sequence of random blinks. the engine noise was now not as loud as i had initially experienced it, and appeared to be that of a single craft (no beat effect or audible interaction). immediately behind the random red light, at a distance of what i now estimate to be ten helicopter lengths, i saw a tight cluster of lights. comprising a red blinking beacon, white anti-collision strobe, and steady green starboard navigation lamp. the procession continued north at about 40 miles per hour. i deduce, from the volume of noise experienced, that a helicopter passed to the south of my house, heading east-west. then immediately turned in an arc toward the north. based on daily observation of numerous helicopter and aircraft types routing into and out of the nearby military and civilian airports, the engine note was not one familiar to me. (the police usually deploy a eurocopter). but from visual and audible clues i estimate that the machine was at 150 feet, half the normal operating height in this area, due to a number of tall transmitter towers. if all the lights were on a single helicopter it would have had to have been chinook-sized, and about 50 yards from me. however, the sound was not that produced by this particular type, nor did i experience downwash. if the lights were on two separate craft then they were flying in a perilously low and close formation above a densely populated area. this 4i observation may or may not be of significance. (4i = insufficient information impedes identification). but i thought i would report it to you, as there have been incidents in wales, birmingham, and brighton. where constabulary aircraft have encountered\\pursued\\recorded anomalous aerial phenomena."],"City":"High Wycombe","Source":"MUFON","Latitude":"51.628611"}