{"files":["/var/www/straped/mufon/html2text/15611.html.txt","/var/www/straped/mufon/org/15611.html"],"Longitude":"-97.738701","Latitude":"30.268683","Date of the Event":"02/15/2009 04:04 UTC","Object Features":"Undisclosed","trends":["There have been 188 other sightings in Austin","There were 2 other sightings in Austin on or around February 15th 2009"],"Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.268683,+-97.738701(15611)&iwloc=A&hl=en\"> mufon case (15611) map </A>","Weather Factors":"Unknown","Case Number":"15611","Region":"Texas","Log Number":"US-02202009-0003","Object Shape":"Other","Disposition":"Unknown","Object Flight Path":"Undisclosed","Summary":"One of many.","City":"Austin","Date Submitted":"02/15/2009 04:04 UTC","Source":"MUFON","divs":["sighting detailsif you haven't heard of the \"fireball(s)\" that streaked over austin around noon on sunday, 2\\15, then it's your lucky day. i was sleeping late on sunday when my bed lurched far enough above my bedroom floor to wake me up. i sat upright and called for my wife. she was downstairs in the kitchen when the \"lurch\" occurred and had lost her footing. we have two dogs and they both freaked out when the \"lurch\" occurred and jumped over a 6ft fence and i've only found one of them. all was quiet until around 4:00pm when continuous sonic-booms echoed over north central austin. i thought i was hearing fireworks which is not unusual in my neck of the woods as some new shopping center is celebrating a grand opening weekly -- but the frequency and intensity of the reports -- not to mention the fact that they were happening in the clear light of day, struck me as odd. you can go to www.news8austin.com and watch the video for yourself. cnn has already purged it from their files which is odd as as they were the first to pick up the video and report it globally. if you see a pug that answers to babette, please let me know."],"Sighting Duration":"Undisclosed","Tags":"City"}