{"Date Submitted":"02/19/2009 12:00 UTC","Date of the Event":"02/19/2009 12:00 UTC","Summary":"UFOs over Ottawa or ties with Barack Obama visit?","Viewing Distance":"Unknown","Region":"Ontario","Object Flight Path":"Undisclosed","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around February 19th 2009"],"Object Shape":"Flash, Star-like, Triangle","Case Number":"15616","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-75.687993","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=45.43117,+-75.687993(15616)&iwloc=A&hl=en\"> mufon case (15616) map </A>","Country":"Canada","Source":"MUFON","Latitude":"45.43117","files":["/var/www/straped/mufon/html2text/15616.html.txt","/var/www/straped/mufon/org/15616.html"],"Weather Factors":"Unknown","City":"Ottawa","divs":["Sighting DetailsPrior to this date i have noticed lately an odd presence in our Canadian skies particularly that over the Ottawa Valley. I was taking a stretch outside having a cigarette in my small rural town with very few lights to mask the skies with. Since i was young i always had a stark interest in the skies above, especially at night, where its prime viewing where i live as its the highest point in the Ottawa valley. I was walking along the street which has no street lights of any kind and i noticed a moderately bright light Oscillating and changing colour.. red,green,gold,blue pulsating. To catch a better viewing angle there is a hill within a local park within walking distance of my house known as mckendry park. i stopped by my house picked up a pair of binoculars and thus proceeded to the point of interest. at first i was skeptical of even traveling to this place as it gives off some very eerie vibes and to make my paranoid self even worse there was clearly some sort of craft in the sky which i am supposed to believe is the work of pure science fiction the sort of stuff you see on the 6 o'clock news that your father has to mock in the close minded sense he lives in. I myself am respectably open minded seeker type so to speak, i attempt to wrap my mind around a lot of things people just disregard which is a waste of a life in all honesty especially in the times we live in now. I give my apologies in advance to those who just want some hard evidence and not a retrospective gonzo piece. I was standing on the top of a beast of a hill that was constructed to my understanding for kids to slide down in the winter its about a 50% grade. The sky was full of what looked like police cherries toned down except for one. i counted twenty-three and stopped so i could study the one that was the most intense, some of them were in a staggered line formation (i do have some military knowledge) i tried to work out possibilities in my head as to what they could be but really couldn't focus as i was always looking around at my environment not just the sky. i have read quite a few UFO accounts but i never felt that i would be writing one of these \"ever\" The lights were to the north-east and west just above Ottawa. i could gauge that some were higher altitude than others due to light intensity. I figured it was probably military presence as Barack Obama was in Ottawa the 19th. but this was not the first time i witnessed these lights, though not in this great number, during the month of February on a clear night one can look out their window if they're in the proximity of a suitable location and see what i have seen to some extent. for reference of time, first contact about 2:20am, on the hill roughly 3:15 due to the extremity of climate that i live in i was only there for about 30 minutes it was about -20 that night. I hope to see more accounts of activity over Ottawa possibly on the news, though that usually turns out to be bad press so i doubt anytime soon though its a shame really i witnessed something amazing yet the only evidence is my word and i stand by it."],"Log Number":"CA-02202009-0008"}