{"Weather Factors":"None","Date Submitted":"02/20/2009 08:00 UTC","Country":"United States","Object Flight Path":"Stationary,Path with directional change","Longitude":"-117.920368","Date of the Event":"02/20/2009 08:00 UTC","Object Shape":"Circle","Object Features":"Unknown","City":"Fullerton","Case Number":"15629","Source":"MUFON","Latitude":"33.874892","Summary":"Circle UFO with red blinking light and white blinking/running lights around it.","divs":["sighting detailsmy daughter was sitting on the couch when she noticed a bright light out of the corner of her eye blinking outside the window. when she approached the window to get a closer look, she noticed that the light was actually a series of white running\\blinking lights which were moving in a circular motion around a single red light. she then called me to the window and we both ran outside to get a clearer look. it was moving in an easterly direction at a relatively slow speed for several minutes we then called out for my daughter's boyfriend to come look. he ran out to his car to get his binoculars. over several more minutes we stood in awe passing the binoculars to each other, when suddenly it changed direction in a manner similar to that of an olympic swimmer, i.e. kind of flipping over while reversing direction. the lights continued to \"run\" in a circular motion while it moved first closer to us then moved further away at the same speed although it seemed to be moving much further away at the same time several hours later we're still talking about it and comparing notes on what we saw. no doubt it was unidentifiable as an aircraft!!!"],"trends":["There have been 14 other sightings in Fullerton","There were no other sightings in Fullerton on or around February 20th 2009"],"Disposition":"IFO","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/15629.html.txt","/var/www/straped/mufon/org/15629.html"],"Log Number":"US-02212009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=33.874892,+-117.920368(15629)&iwloc=A&hl=en\"> mufon case (15629) map </A>","Region":"California","Tags":"City"}