{"Sighting Duration":"Undisclosed","Date of the Event":"06/26/1999 12:00 UTC","files":["/var/www/straped/mufon/html2text/15622.html.txt","/var/www/straped/mufon/org/15622.html"],"City":"Casar","Object Features":"Undisclosed","Longitude":"-81.617316","Region":"North Carolina","Source":"MUFON","divs":["Sighting DetailsI was working at a summer camp in 1999 in Casar NC. At this camp, there were many UFO sighting reported the previous summer, and some over the next two years as well. One day in June, my job required me to stay at the camp while all the staff and campers were out. As I sat on the front step of the tool shed, 3 blacked out Chinook helicopters buzzed the camp heading south, flying no more than 100 ft off the ground. All 3 passed right over my head, so close I could see the pilot's faces. Besides scaring me a great deal, I thought it was incredibly odd, as there are no airfields of any kind near there. Over the next many weeks that summer, myself and two co workers would sit on the front porch of the camp lodge late at night, looking east, and watch orange lights rise up, turn 90 degrees and once again head south. No helicopter noise, and they had to be at least 3-5 miles away. Each night was the same occurence, and the lights would continue for at least 30 minutes each time. They were so far away we didn't feel scared. Casar is a perfect place for black ops, as it has a population of 398 and is very sparse and yet close enough to fly to from many metro areas. Many fellow staff people the summer before reported UFO sightings in the area as well, and the presence of the night stalkers there the following summer makes for an interesting connection."],"Weather Factors":"Unknown","Tags":"City","Latitude":"35.512352","Date Submitted":"06/26/1999 12:00 UTC","Object Shape":"Sphere, Other","Summary":"Night stalker helicopters near consistent sightings","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Casar","There were no other sightings in Casar on or around June 26th 1999"],"Log Number":"US-02202009-0013","Case Number":"15622","Country":"United States","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=35.512352,+-81.617316(15622)&iwloc=A&hl=en\"> mufon case (15622) map </A>","Viewing Distance":"Unknown"}