{"divs":["sighting detailsmy 9 yr old saw a stationary \"weird bright object\" in the clear dark western sky around 7 p.m. tonight (2-20-09). we were driving south from aurora, il to oswego, il and my 9 yr old watched it for the entire 15 minute ride. i thought it might be a bright planet. when we stopped in oswego my 9 yr old, 5 yr old and i got out of the car and looked at the bright object. it was a glowing bright yellowish color and looked as though it might have rings around it. it was extremely large and stationary. i thought it was much larger than when i saw jupiter at it's brightest several years ago. i went inside and checked on www.earthsky.org to see if maybe saturn or another planet was visible tonight. well, saturn will be in march but it will be dim. venus is visible but it is dim and we saw it tonight. there were no reports of other planets being visible. so then i saw the ufo examiner website and saw the photo at the top of the page http:\\\\www.examiner.com\\x-2363-ufo-examiner~y2009m1d26-bright-lights-in-the-sky. the object we saw looked just like the photo but not as flat. my 9 yr old and i looked outside just before 9 p.m. to see it again but couldn't see it from the house. so at 9 p.m. we took a quick walk outside to try to find it and take a photo. the sky was clear full of stars and venus, but we did not see the object at all. it was gone. the sky clouded over when we checked again at 9:34 p.m. and the stars are no longer visible. we're planning to check again tomorrow but snow coming into the area might keep the sky cloudy."],"Region":"Illinois","Weather Factors":"None","Log Number":"US-02202009-0019","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15628.html.txt","/var/www/straped/mufon/org/15628.html"],"Object Features":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.682807,+-88.35146(15628)&iwloc=A&hl=en\"> mufon case (15628) map </A>","Object Shape":"Circle, Saturn-like, Sphere","Date Submitted":"02/20/2009 07:00 UTC","Latitude":"41.682807","Source":"MUFON","City":"Oswego","Longitude":"-88.35146","Object Flight Path":"Hovering then path","Summary":"My 2 kids and I saw glowing, bright, large, stationary Saturn-like object in the clear, dark, western sky tonight around 7 P.M., by 9 P.M. it was gone.","Country":"United States","Disposition":"Unknown","Case Number":"15628","Date of the Event":"02/20/2009 07:00 UTC","Tags":"City","trends":["There have been 6 other sightings in Oswego","There were no other sightings in Oswego on or around February 20th 2009"]}