{"City":"Wikieup","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date Submitted":"02/11/2009 07:00 UTC","Tags":"City","Date of the Event":"02/11/2009 07:00 UTC","Region":"Arizona","Country":"United States","files":["/var/www/straped/mufon/html2text/15624.html.txt","/var/www/straped/mufon/org/15624.html"],"trends":["There have been 2 other sightings in Wikieup","There were no other sightings in Wikieup on or around February 11th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.710574,+-113.602381(15624)&iwloc=A&hl=en\"> mufon case (15624) map </A>","Object Shape":"Circle, Sphere","Object Features":"Unknown","Case Number":"15624","Weather Factors":"None","Latitude":"34.710574","Longitude":"-113.602381","Log Number":"US-02202009-0015","divs":["Sighting DetailsOn Febuary 11, 2009, while driving south on US interstate 93 around 130 miles north of Phoenix I saw three orange spheres. They would stay in mid air and disapear. I was driving and noticed them though my winsheild. It was dark out and the moon had not yet risen. It was around 8:00pm to 8:20pm. I had pulled over on the side of the road to see if I could get a better look at the objects. At this point I knew I was not seeing any plane. I had an intense feeling that I was vieving something not of this world. I noticed an orange light much larger than any star in the sky and then one more. Finnally there were three objects that where in the sky. There was no sound or no flashing lights on the objects. A few seconds watching ten and they were all gone. I stayed parked on the side of the road to see if they would come back and about 5 minutes later they reapeared. This continued for almost 3 hours. I continued to watch the objects. They stayed almost in the same spot of the sky as I watched. They would dissaprear and reaprear 5 to ten miuntes later. About 3 hours later I noticed them in another part of the sky. This time there apeared to be more and more objects. If i could give an estimate I would say there were about 30 of them in a cluster for about 20 seconds then they were all gone. I decided that I needed to continue my drive back to phoenix as I did not see them again for over a half an hour. As I got into cell phone rang I picked up my phone to call my family in New Mexico to tell them of what I had seen. I noticed the date on my phone was January 5, 2007 and the time was 4:19am. I called my family and my phone kept changing time and turning on and off. It took almost 3 more hours till my phone worked correctly. I did check the time when I got home to Tempe and It was 11:50pm. I am still amazed at what I had seen."],"Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","Summary":"Three orange spheres.","Sighting Duration":"02:15:00"}