{"Disposition":"Unresolved","Date Submitted":"02/20/2009 09:15 UTC","Object Shape":"Circle, Star-like","Viewing Distance":"101-500 Feet","Log Number":"US-02202009-0018","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/15627.html.txt","/var/www/straped/mufon/more/15627_submitter_file1__feb20thUFO.jpg","/var/www/straped/mufon/org/15627.html"],"Object Flight Path":"Stationary,Path with directional change","Latitude":"38.900812","Date of the Event":"02/20/2009 09:15 UTC","Region":"Maryland","Case Number":"15627","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was sitting in chat when I noticed from my window which is directly behind my computer a strange light that caught my attention because it was so bright that it caused me to look up and I know with out a doubt this was no earthly this was the first time I did not question it at all not even from the start because it was not normal first one light appeared that was white and shined like a planet and was the size of maybe a baseball and it blinked once then another light phased in right next to it and then they both blinked and then one light blinked which was the one on the right then the both of them blinked then one again then it morphed into one light and got smaller until it completely vanished both lights were the size of a baseball and were able to morph to one light as it vanished it made an S route to the sky and it appeared slightly tilted the whole time as well....usually I feel very skeptic but this time I felt excited and ecstatic I felt positive and like there would be more to come."],"Object Features":"Unknown","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.900812,+-77.032996(15627)&iwloc=A&hl=en\"> mufon case (15627) map </A>","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around February 20th 2009","This sighting has never been favorited.",""],"City":"Washington","Summary":"Lights over Maryland State.","Source":"MUFON","Longitude":"-77.032996"}