{"divs":["sighting detailsi was taking a date to the beach at night on rt. 70 towards long beach island, nj sometime in the fall or winter of '87\\'88 - i think it was about nov. it was cold and the shore was a ghost town with no one on the dark two lane road through the pine barrens. growing up in the usaf i had been around all kinds of planes and was used to seeing them with quite a bit of knowledge. while talking to my date i was watching the c141 sized objects in a line just over the tree tops and they were slowly catching up to me. i was doing 55mph. i thought nothing of it being used to seeing military planes all around the area. when the first one reached just outside my window about 180 yards away i realized they were going too slow and would fall out of the sky so i asked her to roll down her window and there was no noise at all as they all started to pass us. she became terrified and they slowly made a large turn over the pine barrens and i just lost them. i witnessed them for about 25 min. i saw no objects since then the road was unlit. the lights looked similar to a jet and were a large spacing the size of a c141. after about half an hour we were on the deserted beach and suddenly the sky lit up with military action. jets were everwhere flying low and over the ocean and forest inland. they were so low that we ducked one time. i knew they were looking for something. then they just disappeared and stopped. the next day my mother told me that a small military jet went down in manahawkin bay and that was right by where i was. the pilot was rescued by a fishing boat. my father knew nothing since he had already retired years before. what did i see? facts: c141 sized but no noise and flew 60mph very low - can't happen military action just afterwards - why? plane down in area - coincidence? i've told very few people over the years and often wondered what i saw."],"Summary":"4 airline sized objects just over treetops flying 60mph, no sound, 1/5 mile apart in a line, no sound, near Ft. Dix/McGuire AFB, half hourl later military action everywhere in sky looking for something flying over ocean and Pine Barrens.","Case Number":"15631","Country":"United States","Latitude":"40.726389","map":"<A HREF = \"http://maps.google.com/maps?q=40.726389,+-74.894444(15631)&iwloc=A&hl=en\"> mufon case (15631) map </A>","Log Number":"US-02212009-0003","Object Flight Path":"Undisclosed","Date Submitted":"11/15/1987 12:00 UTC","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Lebanon","Object Shape":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/15631.html.txt","/var/www/straped/mufon/org/15631.html"],"trends":["There have been no other sightings in Lebanon","This sighting has never been favorited."],"Longitude":"-74.894444","Date of the Event":"11/15/1987 12:00 UTC","Tags":"City","Disposition":"Unknown","Object Features":"Undisclosed"}