{"Object Features":"Unknown","Case Number":"15635","files":["/var/www/straped/mufon/html2text/15635.html.txt","/var/www/straped/mufon/org/15635.html"],"Region":"California","Country":"United States","Sighting Duration":"00:15:00","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.005989,+-118.154373(15635)&iwloc=A&hl=en\"> mufon case (15635) map </A>","Date Submitted":"02/20/2009 08:05 UTC","Longitude":"-118.154373","Object Shape":"Disc","Log Number":"US-02212009-0007","City":"Commerce","Weather Factors":"None","Source":"MUFON","trends":["There has been one other sighting in Commerce","There were no other sightings in Commerce on or around February 20th 2009"],"Date of the Event":"02/20/2009 08:05 UTC","Object Flight Path":"Straight-line path","Summary":"UFO Sighted flying South over the 5 Freeway in Commerce, CA.","Disposition":"IFO","divs":["Sighting DetailsOn Friday, February 20, 2009 at about 8pm, I was driving South on the 5 freeway in slow, steady traffic; going maybe about 10 miles an hour. I was passing the city of Commerce, approximately passing the Commerce Casino. Above the freeway maybe about 200-300 feet in the air I spotted the UFO flying slow and steady heading South along the freeway. It was disc shaped and had a pattern of lights lining the circumference of the craft. The lights were changing patterns as it slowly rotated. As the UFO was rotating it was also moving South along the freeway. Many other people should have been able to see it. When I first spotted it, it was almost directly above me. I watched it as it moved South for as long as I could until it become too far for me to see. The entire sighting lasted an approximate 10-15 minutes. This was my first sighting, but I have been long interested in the UFO phenomenon. When I spotted it, I immediately knew that it was a UFO without a doubt in my mind. It was close enough for me to see in detail. MI was in complete shock for the duration of the event, both in awe and wonder. As it moved further out of my line of sight, I found myself wanting to keep up with it and continue to see it. In short I was shocked and amazed, and I am certain there were many other people who saw it too."],"Viewing Distance":"Over One Mile","Latitude":"34.005989"}