{"Sighting Duration":"00:01:02","files":["/var/www/straped/mufon/html2text/15639.html.txt","/var/www/straped/mufon/org/15639.html"],"Object Shape":"Undisclosed","divs":["sighting details for about 1 minute i saw a completely white ufo. it looked metallic, and it was two orbs connected with a white pole in the middle. i was riding in my car home from a doctor's appointment, and i looked oout of the window and saw it. i don't know if anyone else saw it, but it seemed very distinct to me. at first i thought it was a plane, but i soon realized that there were no markings on the plane at all. it was just purely white. i then thought it was a bird, but it was soon going all too fast to be a bird. my mom was driving me home, but i failed to tell her before it left. it seemed to \"flicker\" as if it just was and then wasn't there, and it was going extremely fast and was not acting like any human thing i've ever seen. it resembles the isaac\\caret ufo, but only loosely, as there wasn't any markings on it. it was very odd, and seemed to be struggling about 30 seconds into the sighting. then, the ufo just seemed to dissapear. nothing else, it was just there, and then it wasn't. i started to get freaked out as i am an xenophobic, and i couldn't build up the strength to visit this website until now. thank you for listening."],"City":"Fairfield","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.254438,+-122.030006(15639)&iwloc=A&hl=en\"> mufon case (15639) map </A>","Latitude":"38.254438","Log Number":"US-02212009-0011","Longitude":"-122.030006","Source":"MUFON","Summary":"Fly-by over Fairfield Hills.","Object Features":"Undisclosed","Date of the Event":"08/20/2008 02:48 UTC","Disposition":"Insufficient Data","trends":["There have been 15 other sightings in Fairfield","There were no other sightings in Fairfield on or around August 20th 2008"],"Date Submitted":"08/20/2008 02:48 UTC","Region":"California","Viewing Distance":"Unknown","Case Number":"15639"}