{"trends":["There have been 11 other sightings in New Albany","There was one other sighting in New Albany on or around February 20th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/15630.html.txt","/var/www/straped/mufon/more/15630_submitter_file1__stars.jpg","/var/www/straped/mufon/org/15630.html"],"Disposition":"Insufficient Data","Date Submitted":"02/20/2009 07:30 UTC","Tags":"City","Date of the Event":"02/20/2009 07:30 UTC","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsStar-like circles bright in the night sky at 7:30.I was looking up at the starts to the south west direction when i focused in on 2 stars that were brighter than the rest around.They seemed to glow brighter and resembled a circle like shape more than the star-like.Suddenly the 2 stars very quickly switched positions and became even brighter.I felt as though they had gotten lower, and i didn't want to be out there alone anymore so i ran back inside.Very creepy if you ask me.But then again, i've seen a lot of creepy things lately*sigh*.I wish i knew why. Honestly i knew \"they\" were out there, and i wanted to see if they would come closer so i could get a better look.However i wasn't really ready for that and the realization frightened me.My husband made sure i wasn't gone but for 5 minutes,he seemed a little worried.after all that i have seen lately.I know this sounds crazy, but i assure you i'm very much sane,and i plan to prove that these things are out there,one way or another."],"Summary":"I took a walk outside and was watching the stars, when 2 stars brighter than the rest suddenly switched places with each other. I wasn't expecting to see that and I felt I had seen enough so I ran inside, a little frightened.","Latitude":"40.083814","Log Number":"US-02212009-0002","Object Features":"Undisclosed","Case Number":"15630","Country":"United States","Longitude":"-82.805736","Region":"Ohio","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.083814,+-82.805736(15630)&iwloc=A&hl=en\"> mufon case (15630) map </A>","Weather Factors":"Unknown","Source":"MUFON","City":"New Albany"}