{"Object Features":"Undisclosed","City":"La Habra Heights","Date of the Event":"02/02/2009 03:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in La Habra Heights","There were no other sightings in La Habra Heights on or around February 2nd 2009"],"Log Number":"US-02212009-0009","Date Submitted":"02/02/2009 03:00 UTC","Object Shape":"Circle","divs":["sighting detailsthe recent sightings in oc- north oc have prompted me to repost what i posted on feb 2nd as the description of the craft matches what i saw early am on feb 2nd...the proximity to these sightings is very close to mine- the recent sightings are within sister cities just to the sw of me...i have included a valid email this time, so you folks can follow up w\\me...last time my post was deleted and labled \"hoax\"- it was not...i'm assuming it was because email address was invalid. got up for glass of water in early am- looked out kitchen window and saw a horizontal group of lights close together and moving at same time in sw direction....estimated to be headed toward huntington beach or cypress. add 2\\21: the actual location would have been fullerton. low in sky. lights indicated a somewhat circular shape and were not quite flashing but would get brighter and then appear to become more pronounced. the way they gave off light was not like lights from a plane in the sense that they did not flash but merely got brighter at times. lights, perhaps 6-8, were white mostly and there was red light on one side and perhaps a green light on other side. was not a plane- this was lateral in the sense of the position of lights- moved collectively and slowly, deliberately toward hb area. this was viewed in north orange county. i watched for approxiamately 5 minutes as craft disappeared. time was 3-3:04am. this was not a plane or helicopter- grouping of lights indicated a laterally wide or perhaps oval shape. no sound."],"files":["/var/www/straped/mufon/html2text/15637.html.txt","/var/www/straped/mufon/org/15637.html"],"Viewing Distance":"Unknown","Summary":"Repost from Feb 2nd: North Orange County.","Country":"United States","Weather Factors":"Unknown","Latitude":"33.96146","map":"<A HREF = \"http://maps.google.com/maps?q=33.96146,+-117.950339(15637)&iwloc=A&hl=en\"> mufon case (15637) map </A>","Region":"California","Tags":"City","Case Number":"15637","Longitude":"-117.950339","Source":"MUFON","Disposition":"IFO","Object Flight Path":"Undisclosed"}