{"Country":"United States","files":["/var/www/straped/mufon/html2text/15644.html.txt","/var/www/straped/mufon/more/15644_submitter_file3__104_25230.JPG","/var/www/straped/mufon/org/15644.html"],"Source":"MUFON","Region":"Florida","Weather Factors":"None","Object Flight Path":"Hovering then path","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"02/19/2009 08:22 UTC","Disposition":"Unknown","Longitude":"-84.207222","Summary":"Morph object, changing shape, size, color & brightness, also sound.","divs":["Sighting DetailsI was at a secluded wilderness area, on a private hunting club with two other witnesses.Location, St. Marks Florida, north east of highway 98 along the st. marks river. At 8:22 PM, Feb.19th, 2009, we had just finished dinner when we walked outside and noticed a very bright object hovering at about 45 degrees, above the tree tops. At first I thought it may have been the bright runway lights on a commercial airliner going into Tallahassee Regional Airport, but realized that was at least 25 miles away. This object remained almost stationary for a few min. then started moving slowly to the south. I was unable to determine how far away this object was due to the object changing in size, brightness, color and density. I want back to my camper, picked up my digital camera, and jumped on my 4-wheeler. I was determined to find a clear point of view and get some still pictures, and at present location the trees were obstructing my view. The two other witnesses remained at camp and kept a visual while I took the nearest logging road, which obstructed my view for a few minuets but was able to see this bright object threw the trees shortly thereafter. I saw that it was moving slowly south to south west, and followed for aprox. 3 miles until I was able to get a clear view and take a few photos, which did not turn out well due to the delay and flash. I then turned the camera on video, and shot apox. 4 video's ranging from 1-2 min each. after about 30 min. the object remaining on a south to southwest path, lost visual due to the trees, so I returned to camp. There I met up with the other two witnesses, and told them of the event. I was then informed that they had continued to witness the object over the entire duration of my absence, but in a north to northwest directons. It was pointed out to me once again but only visable for a couple more minuets before completely dissapearing. We then determined that there was infact two objects and I had taken after the second one while the were watching the first one. When I uploaded the video, I was surprised to find that once I turned the 4-wheeler motor off, that the audio picked up some sort of signal from the object during filming which I was unaware until the volume was turned up. Each time the object morphed, it would give off a strange sound which can be heard on the video. I inhanced the photo's but was only able to blow up what looked like a globe with a cloudish texture, unlike anything I had ever seen. The video's were not zoomed in as close as the pictures, but clearly showed a solid object changing from a small solid bright mass to a large semi solid, less radiated mass. This is the 3rd sighting that I am aware of in the last 4 year."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.159167,+-84.207222(15644)&iwloc=A&hl=en\"> mufon case (15644) map </A>","Object Features":"Unknown","City":"St Marks","Case Number":"15644","Date of the Event":"02/19/2009 08:22 UTC","Object Shape":"Circle","Latitude":"30.159167","Viewing Distance":"Unknown","trends":["There have been no other sightings in St Marks","This sighting has never been favorited."],"Log Number":"US-02212009-0016"}