{"Date of the Event":"04/30/1967 12:00 UTC","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around April 30th 1967","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/15642.html.txt","/var/www/straped/mufon/more/15642_submitter_file1__scan0001.jpg","/var/www/straped/mufon/more/15642_submitter_file2__scan0002.jpg","/var/www/straped/mufon/org/15642.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.449895,+-79.987176(15642)&iwloc=A&hl=en\"> mufon case (15642) map </A>","Sighting Duration":"00:15:00","Date Submitted":"04/30/1967 12:00 UTC","Summary":"I was in 2nd grade and saw a jetson type craft and and little gray man talked to me.","Weather Factors":"Unknown","Object Shape":"Disc, Sphere","Viewing Distance":"20 Feet or Less","Country":"United States","Log Number":"US-02212009-0014","Case Number":"15642","Tags":"City","Source":"MUFON","divs":["Sighting DetailsI was in 2nd grade. I don't know if it was the spring or the fall, but it was during recess and the weather was warm enough to play outside. My classmate and I walked to the side of the school(Peebles Elementary, North Allegheny School district) during recess. All of the other children were in the main play area at the back of the school. Our school janitor, Mr. Swann, appeared and waved us over toward the basement area of the school. There was an entryway into the furnace room of the school. Mr. Swann told us to come over and see what was in the furnace room. Inside, there was a small \"jetson-like\" disc. It would have been about the size of a volkswagon beetle. It had seating for two. I don't have a clear memory of the vehicle except that it was a silver grey metallic color, very smooth. I can't clearly remember the roof of the craft but I think it was clear or missing entirely. I vaguely remember a panel of controls and something like blue vinyl seats. My friend said \"Mr. Swann caught the flying saucer in the baseball field of the school.\" I remember her sliding down against the wall and falling asleep. Then a small grey man appeared from behind the furnace. I remember laughing because my girlfriend fell asleep, and then being amazed at the little man. He was about the same size as me. I was not afraid of him at all. He talked to me in my head and through feelings and thoughts. He never moved his mouth. He had skin the color and shading like ashes from a cigarette. I don't recall any clothing or any sexual characteristics about him. He had large black eyes, but they were kind and sincere. He had no nose, maybe just a couple small holes, and his mouth was just sort of a line. It did not open. I dont remember any ears. He had long arms for the size of his body and I think only 4 fingers on each hand, which seemed very long. He kept his arms to his sides. He had two legs and his feet seemed different somehow from ours, I simply cannot remember exactly what they were like. His body was childlike, not muscular at all. He said to me in my head, \"We are here, to remind you, who you are.\" I still, to this day, have no idea what he meant! (I am now 49) Somehow, I was able to know how the flying saucer worked. It had something to do with a force of energy which pushed out at the bottom of the craft, along with a corresponding force which sucked in. It makes me think of what a hover craft is like only with much more force and no sound. This was what was broken on the craft and the janitor had taken it inside to hide it while the entity was repairing it. There was another little man somewhere in the room who was injured from the \"crash.\" I have no recollection of him except for the sensing that he was there and that he was hurt. My mother recalls me coming home from school and talking about Mr. Swann and the flying saucer, (Mom was concerned about me being escorted into the basement of the school by the janitor, but after asking me several questions was satisfied that nothing inappropriate had occured). But I never mentioned the little man. Something tells me I wasn't supposed to remember the man until later in life. Because, I did not remember the man until I was 29. My school friend only remembers the craft, and described it as having no bolts or rivets (she grew up with a dad who flew a small plane and would know those terms to describe a plane). She has no recollection of a \"little man\" but then again, she had fallen asleep when he appeared! I've told this story to friends and family only, for fear of being ridiculed. My children are in this school, and it's been remodeled. I have never asked anyone at the school about the craft or dear Mr. Swann. He's got to be in his 80's now. I sure wish I knew what the little man was referring to when he said they were here to remind me who I was!"],"City":"Pittsburgh","Object Features":"Dome","Region":"Pennsylvania","Latitude":"40.449895","Object Flight Path":"Undisclosed","Longitude":"-79.987176"}