{"Region":"Arkansas","Summary":"UFO viewed over Fort Smith, AR in 2003: no more than 400 feet off the ground the vessel was huge about 2 city blocks wide at time of sighting.","Date Submitted":"09/20/2003 12:00 UTC","Longitude":"-94.348268","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"09/20/2003 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.436756,+-94.348268(15647)&iwloc=A&hl=en\"> mufon case (15647) map </A>","Disposition":"Unknown","Case Number":"15647","trends":["There has been one other sighting in Van Buren","There were no other sightings in Van Buren on or around September 20th 2003","This sighting has never been favorited.",""],"Log Number":"US-02222009-0001","Object Shape":"Triangle","Country":"United States","divs":["sighting detailsmy mom ruth and i were in shock as i heard the low rumble of this vessel appeared out of what seemed like a wormhole in the time of evening sky. it slowly went forward towards the arkansas-oklahoma border in the evening sky, the ship was very visible even at the altitude of no more than 400 yards this vessel was huge about 2 city blocks wide. it was like it came out of a wormhole or something as i stood on the porch and looked up and and over my right shoulder. wow there it was i called out to my mom in the next room and at age 70 she was as much in shock as i was eek!..ohh my god i said to her there it is i told you guys as i had told my family many times at night i had seen strange vessels cruising the skies. i hurriedly walked out to the street corner for a clearer view as it went over my head towards the northwest. as it went out of my view the evening suddenly the sky went from evening to almost dark, and felt very eerie as the night went to a lighter shade dusk lighter than the left top photo sample. i have tried not to tell too many people about this even, so i feel i must speak out via the www. this even has really traumatized me in many ways as i hardly sleep nowadays. let me just tell you my life has completely changed after viewing this event, i also have had two other encounters with alien visitations, and it had taken me years just to try and recall those events, so what i always knew existed in my heart has become very real to me not only in the visual sighting, but subconsciously as well.... i just left my elderly mother standing there as i ran from the porch to the corner of n 8th and q street, i stood there in awe under the street light as it went over my head, and yes i was very afraid at first but for some reason i had to get a closer look at the event. something else very unusual occurred to me several days later this sighting, i began to itch profusely on my skin, and did not know why i began to itch, just did not pay much attention to it at first but this until several weeks later it got worse. maybe, possibly i was exposed to some kind of radiation or something i'm sure what an i hope not, however; i'm still feeling the effect of the exposure from this event. i sent a report about this to art bell at a radio program called coastocoast.com featuring mr. george noory, and i've received no response from them to this date feb.07 a few days later a strange thing happen to my computer hard drive when i tried to boot up to windows and i simply could not, i later found my hard drive had be completely erased by something or someone. all my e-mail's has been deleted as well, shortly after i reported the sighting. so if anyone can help me possibly help me better understand what has happened to that evening, and since the sighting of this vessel. you can e-mail me if you can with any helpful information that you may have and thank you very for your interaction, a web-site rendering of the ufo event can be seen at this url: http:\\\\www.personalized-pc.com\\agent\\ufo_vessel_sighting_over_fort_smith_arkansas_sept05.html sincerely your james in fort smith, ar"],"Object Features":"Window(s), Patterned Surface","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Tags":"City","City":"Van Buren","Latitude":"35.436756","files":["/var/www/straped/mufon/html2text/15647.html.txt","/var/www/straped/mufon/more/15647_submitter_file1__rendering_vessel_sighted_over_fort_smith_arkansas.jpg","/var/www/straped/mufon/org/15647.html"]}