{"trends":["There has been one other sighting in Blanchard","There were no other sightings in Blanchard on or around February 21st 2009"],"Log Number":"US-02212009-0015","Country":"United States","Case Number":"15643","Viewing Distance":"Over One Mile","Disposition":"Unknown","Tags":"City","Date of the Event":"02/21/2009 12:00 UTC","Source":"MUFON","Summary":"Huge black object with lights across the back traveling south to north.","Region":"Oklahoma","Object Features":"None","files":["/var/www/straped/mufon/html2text/15643.html.txt","/var/www/straped/mufon/org/15643.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.142344,+-97.648874(15643)&iwloc=A&hl=en\"> mufon case (15643) map </A>","Latitude":"35.142344","divs":["Sighting DetailsI am reporting this for my husband who is pretty much an unbeliever (meaning he has not personally seen anything he could not identify until tonight) but now he is not so sure, after what he witnessed. He was leaving our side road which leads to the highway from our house going to work. He had just called a friend he works with and was almost to the highway, coming to a stop at the stop sign when he saw a HUGE black object traveling over Hwy 9. Hwy 9 & I-44 intersect about a half mile from here. The area has those turnpike lights along the highway so the area is fairly well lit up. He immediately got off the phone with his friend & tried calling me as he had only gotten a mile from home. But his cell phone wouldn't work for some reason. He sat at the stop sign & watched it until it went over the trees which was over Hwy 9 by now. His discription was, at first thought, it was a low flying commercial airplane but he could not see any wings anywhere on it. It had 5 or 6 lights across the back, red & amber colored, in a straight line. The lights were flashing in a sequence of four then would pause and resume. It did not make any noise at all. He said it was about 1000-2000 ft in altitude, flying or gliding at a slow speed & it was HUGE. It was traveling south to north over the Bridgecreek area. He said from the time he first saw it, the sighting only lasted about 2-3 minutes. We live in the general area where the couple had a sighting back in early Jan. He is not what you would call a believer in UFO's but he said this was definately something he could not identify. If anyone else saw this thing tonight, I hope you report it on here."],"Object Shape":"Square, Rectagular","Longitude":"-97.648874","Date Submitted":"02/21/2009 12:00 UTC","Object Flight Path":"Straight-line path","City":"Blanchard","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}