{"Source":"MUFON","divs":["Sighting DetailsI was up one night watching my favorite anime,Inuyasha. A commercial break came on and I had to use the restroom. I remember walking through the hallway of my house and stopping to take a look out the night sky. I looked a little over to the left and I saw a red blinking light. At first, I thought it was a airplane or a satellite but as it got closer, it looked like a metallic ball with a red light orbiting it. It came within at least 7 feet of my window (I was on the top floor) and it was hovering at least 9 to 10 feet off the ground. I was wondering what the heck this was. I opened my window to get a better look but soon as I did it zipped off into the sky. As soon as I saw this, I freaked out. I was wondering the next day if that was a dream or not. I looked into the subject of UFO's and found many people see them. I did not believe about those things until I saw that UFO that night. Ever since I have been looking up stories about UFO's and other things. I told my friends about what I saw and they said I watch too many Science-Fiction movies. I know what I saw that night and I believe there is more to the Universe than we think."],"Object Features":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/15652.html.txt","/var/www/straped/mufon/org/15652.html"],"Country":"United States","Date Submitted":"04/07/2007 11:02 UTC","Sighting Duration":"Undisclosed","Region":"Georgia","Latitude":"33.946212","Longitude":"-84.334647","Weather Factors":"None","trends":["There has been one other sighting in Dunwoody","There were no other sightings in Dunwoody on or around April 7th 2007"],"Case Number":"15652","Object Shape":"Circle, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.946212,+-84.334647(15652)&iwloc=A&hl=en\"> mufon case (15652) map </A>","Date of the Event":"04/07/2007 11:02 UTC","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","City":"Dunwoody","Viewing Distance":"Unknown","Log Number":"US-02222009-0006","Summary":"A metallic sphere with a red blip orbiting."}