{"Longitude":"-83.732597","Latitude":"43.183256","Object Flight Path":"Unknown","trends":["There have been 3 other sightings in Clio","There were no other sightings in Clio on or around July 27th 1987"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.183256,+-83.732597(1565)&iwloc=A&hl=en\"> mufon case (1565) map </A>","Weather Factors":"Unknown","Region":"Michigan","Summary":"Stingray Shaped Object seen near Clio, Michigan","Country":"United States","divs":["Sighting DetailsWitness states (On Form 1) that he was sitting at his desk at work when helooked up at what he first thought was a plane. He states he was not frightenedand the object then flew rapidly to the southwest out of sight.The following is from the FI report:On July 26, 1987 a security guard reported for work at 6:00 pm, his usual shifttime. He works at a new car dealership where he has been employed for twentyodd years. At midnight he sat down at his desk, which is located just insidethe front door, on the north side of the building. From this vantage point hecould see the entrance drive and the north parking lot. He noticed that the skywas filled with big fluffy white clouds that kept seperating at they moved tothe northeast. Suddenly a dark object burst from the big white clouds, movingin a straight line with the building. He was amazed because the object remindedhim of a big stingray as he sat watching its approach toward him. He estimatedthat the object was some thirty feet across and fifteen feet high. He suddenlyrealized that the object was slowing as it descended. Jumping up he ran acrossthe showroom to the south exit, unlocked the door and stepped out into thefenced storage lot. The object moved over the top of the building, glidingslowly and silently over the guard. He gauged the altitude of the object by atree line which is some fifty feet from a chainlink fence. The craft had tobank sharply to the right to avoid colliding with the trees. As it banked tothe right the craft ascended at the same time it went up to an altitude ofapprox. 100 ft. The craft then crossed over I-75. After reaching the west sideof the expressway, it stopped and hovered about 300 ft. away from the witness.It continued to hover for four or five minutes. It suddenly took off at aterrific rate of speed, moving to the southwest. He said the craft was darkgrey, thirty feet wide, thirty feet long and was sporting 2 very large, orangishred, glowing lights on its rear. When the object banked, stopped and hovered,the body looked fat at the front and tapered toward the tail, like a helicopter.There was no sound, no wings, no rotors, no windows, no other lights. He said,\"maybe it was a new plane that the Air Force is trying out.\" At 5:58 am theobject was sighted again. It came from the southwest, moving toward thenortheast at a high rate of speed. Once again it started to slow, banked leftover the same tree line, crossed over the expressway (I-75) stopped, hoveredover the same vacant field for 11 minutes before it took off real fast to thenortheast."],"Date Submitted":"07/27/1987 12:11 UTC","Log Number":"","files":["/var/www/straped/mufon/html2text/1565.html.txt","/var/www/straped/mufon/org/1565.html"],"Source":"MUFON","Disposition":"Unresolved","City":"Clio","Date of the Event":"07/27/1987 12:11 UTC","Sighting Duration":"00:10:00","Tags":"City","Viewing Distance":"21-100 Feet","Object Shape":"Other","Case Number":"1565"}