{"Latitude":"39.952425","Object Shape":"Sphere","Viewing Distance":"101-500 Feet","divs":["Sighting Details I was laying on a towel at the beach with my wife when i called her attention to a large Horizon Blue Cross Blimp traveling South along the coastline. I noticed a much smaller luminus orbe following under and behind about 20 to 30 feet behind and 5 to 10 feet below the blimp. My wife who was sitting in a beach chair facing the water at the time ask if i knew what that was. I explained that it was the first time i had seen anything like that. I began to describe what i was seeing and askrd her to confirm that she was seeing the same thing that i was. She confirmed that she was watching the same object that i was. We compared notes and both felt that compared to the large blimp which i had seen many of at the local navy base, that the orbe was about 6 feet in diameter. It was brighter than it's suroundings but no too bright. Somewhat like a large lightbulb. It followed the blimp for about 2-3 minutes. I no sooner said to my wife \"i wonder if the blimp knows it's being followed by that thing, when the blimp veered off to the East and out to sea. The orbe matched the blims slow turn and maintained it's distance from the blimp. Then it suddenly manuvered right then left across an under, and quickly away, straight out to sea. Seconds later it was no longer visible. I once again compared notes with my wife in which se confirmed every manuver. We had't spoken of it untill today when i happened upon UFO Hunters on the History Channel and a identical orbe was seen following a airplane near an airport. They described it as a luminus orbe. I quickley called my wife over to watch the show and it reminded us of what we has seen that day at the beach."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.952425,+-74.065884(15659)&iwloc=A&hl=en\"> mufon case (15659) map </A>","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/15659.html.txt","/var/www/straped/mufon/org/15659.html"],"Date Submitted":"09/20/2008 02:30 UTC","Case Number":"15659","Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Log Number":"US-02222009-0013","City":"Seaside Heights","Country":"United States","Region":"New Jersey","Object Features":"None","Longitude":"-74.065884","Summary":"Luminus orbe following a blimp along the coast.","trends":["There have been 3 other sightings in Seaside Heights","There were no other sightings in Seaside Heights on or around September 20th 2008"],"Tags":"City","Date of the Event":"09/20/2008 02:30 UTC"}