{"Sighting Duration":"00:00:05","Log Number":"US-02222009-0010","Date of the Event":"05/30/1978 09:00 UTC","divs":["Sighting DetailsThis sighting was over 30 years ago, but I think it should be documented. I was outside my house on the northeast corner of 6th and Reed Streets,in Philadelphia,Pa. talking with my Uncle Leon, and neighbor Moe{both now deceased}. It was early evening we were standing there shooting the breeze,when all of a sudden a ball of light streak almost right above our heads, it was very large,bigger than the size of a tank,and less than a quarter of a block away, facing south on sixth,it seemed like directly over Gerritt Street, which is the next little street south of Reed Street,at a very very low altitude, flying parallel to the ground, from west to east,my guess is at less than a thousand feet high. The whole incident for me lasted about 5 seconds. This ball of light changed colors faster than my mind could register, red, green, blue, silver, yellow, in no order.It flew so low that, when it passed to the east of sixth street,I couldn't see it for the houses blocked my view, and they are only three stories high. The next day when I went to work I read in the newspaper that many people had seen it and called into the authorities, and that the ball of light, landed or crashed into the Atlantic Ocean about a mile from Resorts International Casino Hotel. Which is about 48 miles from where I sighted it. What is a coincidence or not is that the incident happened very close to the Grand Opening of Resorts Casino in Atlantic City. Either the day of or the day after, not sure, I also went to the Main Library in Philadelphia to look up this incident in the newspaper archives, but didn't have much time and was unsuccessful finding the article. Also I was asked to report this sighting by Ken Pfiefer one of your field agents. Peace! Charles"],"City":"Philadelphia","map":"<A HREF = \"http://maps.google.com/maps?q=39.958025,+-75.157259(15656)&iwloc=A&hl=en\"> mufon case (15656) map </A>","Tags":"City","Object Shape":"Sphere","Date Submitted":"05/30/1978 09:00 UTC","Summary":"Ball of light streak at very low altitude.","Longitude":"-75.157259","Weather Factors":"None","Source":"MUFON","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around May 30th 1978"],"Viewing Distance":"Unknown","Latitude":"39.958025","Region":"Pennsylvania","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/15656.html.txt","/var/www/straped/mufon/org/15656.html"],"Object Features":"Undisclosed","Case Number":"15656","Disposition":"IFO","Country":"United States"}