{"Source":"MUFON","trends":["There have been 8 other sightings in Warren","There were no other sightings in Warren on or around June 15th 1982"],"Log Number":"US-02222009-0012","Date Submitted":"06/15/1982 09:00 UTC","Case Number":"15658","Object Features":"Window(s), Patterned Surface","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/15658.html.txt","/var/www/straped/mufon/org/15658.html"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","Date of the Event":"06/15/1982 09:00 UTC","Object Shape":"Other","Region":"Ohio","Object Flight Path":"Hovering then path,Path with directional change","Summary":"A very large flying wing black craft hovering just above trees.","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.245577,+-80.811537(15658)&iwloc=A&hl=en\"> mufon case (15658) map </A>","divs":["Sighting DetailsWhile driving through a main intersection in the city of Warren, with my wife and 2 young daughters, we saw a bright white spotlight shinning on an abandoned building to the left side of the street. The spotlight was moving around randomly and then crossed over to the right side of the street. At first I thought it was from a helicopter and out of curiosity I stopped the car and pulled over to the curb. After the spotlight was turned off, I could see a very large flying wing hovering just above the trees on a side street to my left. Once my eyes became adjusted to the light, I could see that the craft had no vertical surfaces and had orange lights around the perimeter of the wing. I could see a large window area in the center area with a grid like window muttins like an old B-52 WWII bomber and a consol with a silohete of a person moving around inside. There was incandecent lighting in the cockpit area. The structure was flat black with a rough surface like graphite with rivets clearly visible on seams. I could see the spotlight on the bottom center in a ball like socket. The craft was silent and made no sounds. After about 5 or six munutes, it started to slowly turn towards the north and fly off in that direction.It took about 3 minutes to pass overhead and I would estimate the size to be about 300 to 400 feet with a thickness or height of about 15 to 20 feet. I tried to follow the craft in my car but got stopped in traffic. I thought it would be on the news but nothing was ever said about the craft. I thought it might be an experimental lighter than air craft. I have reported this to different agencies over the years but never got a response. This was not just a light in the sky, this was something close and very visible. I served as a radar techician in the Army and I know how to identify aircraft. All though this occured quite a while ago, I can still see it it my mind."],"Longitude":"-80.811537","Latitude":"41.245577","City":"Warren"}