{"Date of the Event":"02/22/2009 06:10 UTC","Date Submitted":"02/22/2009 06:10 UTC","City":"Molena","Object Features":"Unknown","Region":"Georgia","Case Number":"15663","Latitude":"33.012072","Object Shape":"Circle, Star-like","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02222009-0017","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.012072,+-84.500201(15663)&iwloc=A&hl=en\"> mufon case (15663) map </A>","Summary":"Bright light that seems as if it can move to avoid being pin pointed.","divs":["Sighting DetailsI have noticed this light for some time its there ever single night ,as i tryed to vidoe, it seems to move now im not saying its a ufo but it does seem to be a bit strange. its there at dusk and moves off after a wile. It could be a star but one night i came out to watch it, and it changed to gold then blue then back to white and twinkled .I have some video of it and im taking more every night now .it could be that its a star as im not to up on them .but i couldnt say. {1} i was out side my home at the creek when i desided to video the light. {2} i have seen this object for many years just figured it was a star. {3} a little brite for the evening and night sky. {4} a bright white light in the same spot every night it is the first thing to show in the night sky. its to the south, south west,very bright .if you mark where you are standing it seems to move up down left and right .only once have i seem it change colors.if its in a non obstructed veiw it will move ever so slightly to another place. {5} i thought if i tell someone they will think im nuts.but i have ,my friend and he to said wow what is that? it does move. {6} it makes its way behide the trees or it will just start to fade."],"files":["/var/www/straped/mufon/html2text/15663.html.txt","/var/www/straped/mufon/org/15663.html"],"Longitude":"-84.500201","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Molena","This sighting has never been favorited."],"Disposition":"IFO","Object Flight Path":"Stationary,Path with directional change","Tags":"City","Source":"MUFON"}