{"Date Submitted":"02/19/2009 07:28 UTC","Case Number":"15662","Object Shape":"Circle","Tags":"City","divs":["Sighting DetailsI was making a pizza delivery to Woodcock Cove at 7:28 PM when I saw a second light in the western sky just to the left of Venus (but the same size - bigger than a star) as I headed south. I quickly realized the orientation of the two lights (unknown and Venus) were changing. I stopped the car briefly to make it out. I confirmed this new light - the same size as Venus but with a slight bluish tint was moving. I turned east unto Woodcock Cove so the light was now moving slowly but at a constant speed directly towards me. I stopped the car and got out to make my delivery keeping my eye on the bluish tint light. I realized it was much lower than I originally thought and while the light was the same size as Venus now lower and to the right of it, this light was fairly close to me distance-wise. I also noticed that stars would vanish behind the light like they were being swallowed up. As I stared to make sense of it, the light cleared the neighboring tree branches giving me a totally unobstructed view. I could see the outline of a circular object that appeared to be roughly the size of a dinner plate with this light on the front edge. Stars along the edges helped to make it distinctly stand out. At this point, the light stopped moving and this object hovered stationary for approximately ten to fifteen seconds. The bluish tint disappeared and it glowed solid white now - neither I nor it moving. The customer came to the door and I took my eyes off of it to make the delivery. The process took no more than 75 seconds, probably closer to a minute. When I was done with that, I looked up again. The light and circular outline were gone. I quickly checked both the direction it had come from and the direction it was going, but it had disappeared. I ran to the middle of the cove and did a full circle slowly to see if maybe it had simply changed directions but it was no where to be seen. My sense of it was that it was pretty close to the ground - within 50 yards maybe. Hard to say for sure with the lack of light, but that was my sense of it. It made no sound at any time. While I wish there had been more light to more clearly distinguish distance, I played a lot of football and soccer growing up and I feel quite comfortable that this object was 50 yards or less up in the night sky making no sound. It was moving east and stopped when I stopped to stare up at it. I should point out that this address is at the top of a hill, that the object had just cleared the top of the hill before getting to me. Perhaps my distance perception is inaccurate given the apparent smallness of the object. All I know absolutely for sure is that it was above the trees and below the stars. I check the sky regularly during deliveries. I want to know when clouds are rolling in so that I don't get drenched without having taken proper percaution. Venus is huge in the night sky right now so I stare at it four or five times a night. My initial thought was this was a second satellite (we have a total of five planets we can see this year). I then noticed the second light was moving after I stopped because the objects orientation was changing while I was moving, I couldn't tell if both were moving or just one and which one at that. By stopping, I could immediately tell that the new light to the south of Venus was moving. Once I saw the circular outline, my first thought was that it was nearly the same size as a helicopter appears to be when it is doing searches, but this was circular and silent. Once it stopped and I could stare at it while stationary for several seconds, I realized it appeared to be very close to me - above the trees but not by much. When the light became brighter, the thought crossed my mind that it was staring back at me. I watched it move about six to eight inches in the sky over a ten to fifteen second period, but it was gone from view roughly a minute later. Either the light went out and I missed the circular outline, or it moved much quicker once I stopped watching it. The only odd thing afterwards was that I developed a dull headache in my forehead within five minutes of viewing this unidentified flying object."],"Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=35.16219,+-89.771445(15662)&iwloc=A&hl=en\"> mufon case (15662) map </A>","Weather Factors":"None","Summary":"Could see outline of circular object with a light on the front going from west to east.","Log Number":"US-02222009-0016","Latitude":"35.16219","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around February 19th 2009"],"Region":"Tennessee","Country":"United States","Disposition":"Unknown","Longitude":"-89.771445","Date of the Event":"02/19/2009 07:28 UTC","Source":"MUFON","City":"Memphis","files":["/var/www/straped/mufon/html2text/15662.html.txt","/var/www/straped/mufon/org/15662.html"],"Object Features":"Unknown"}