{"Case Number":"15666","Source":"MUFON","Object Flight Path":"Stationary,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=33.540902,+-112.179067(15666)&iwloc=A&hl=en\"> mufon case (15666) map </A>","Object Features":"Unknown","Summary":"This moved left, right and even did several u turns over a 30 minute span.","Latitude":"33.540902","Log Number":"US-02222009-0020","Region":"Arizona","Tags":"City","Date Submitted":"02/21/2009 09:00 UTC","Sighting Duration":"00:30:00","City":"Glendale","Longitude":"-112.179067","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around February 21st 2009"],"files":["/var/www/straped/mufon/html2text/15666.html.txt","/var/www/straped/mufon/org/15666.html"],"Disposition":"Unknown","Viewing Distance":"Over One Mile","divs":["sighting detailssaturday night 2\\21\\09 at 9pm i went outside to have a cigarette and thought i saw a satellite so i started watching it move in a slow, straight line just like we always try to spot satellites. then it started moving in spurts, extremely fast and it would stop completely then turn off in one direction or another. several times it even looped up and back down as if making a u-turn. i was amazed and watched it for a half hour. it seemed to be staying in the same general area so i knew it was not a satellite. tonite(sunday feb 22, 2009 at 8:17pm i went outside to look for it again and there was something that looked like it had an orangish glow in the same area doing really super fast, jerky movements that no plane i know of can do, then stopping, then turning one way or the other. i called my husband out to verify it but he couldn't see that far as he wears glasses. this time (sunday feb 22, 2009)i watched it from 8:17pm until 8:58pm when he made me come back inside. several times it would look like there was very, very bright light emanating from it and then it would stop but you could still see the object. it appeared more of a golden\\orange color to me and was directly overhead of me as i got a stiff neck just watching it for so long. the movements were very fast and jerky. it would shoot off one way, then stop and then turn and shoot off another way moving about 1\\2\" or more each time, obviously it was moving more distance but it was so high up that's the only way i could measure it with my eyes. i tried to take video but it was too far away to show up. it was very high up and there were no planes that crossed anywhere near it while i was watching it."],"Weather Factors":"None","Date of the Event":"02/21/2009 09:00 UTC","Object Shape":"Star-like","Country":"United States"}