{"files":["/var/www/straped/mufon/html2text/15669.html.txt","/var/www/straped/mufon/org/15669.html"],"Summary":"Coming off the turnpike at West Palm Beach we turned right.","Object Shape":"Disc","Disposition":"Unknown","Longitude":"-80.045105","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.723442,+-80.045105(15669)&iwloc=A&hl=en\"> mufon case (15669) map </A>","Date Submitted":"04/22/1975 10:00 UTC","Weather Factors":"None","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around April 22nd 1975"],"City":"West Palm Beach","Tags":"City","Log Number":"US-02232009-0002","Viewing Distance":"20 Feet or Less","Region":"Florida","Case Number":"15669","Object Flight Path":"Path then hovering","divs":["Sighting DetailsMy husband, Sam Davis and my 5 yr. old daughter were returning to Miami after a visit to Sam's daughter in West Palm Beach. We got off the turnpike and headed toward hwy.441. Directly in front of the car we saw a bright light hovering about 40 feet above the road. We turned left onto 441 and the light followed our car for five minutes or so before it reached a clearing. The object then shifted into a disk shape. The lights around the center were alternating blue and white and seemed to going counter-clockwise. We pulled over and observed the craft for at least fifteen minutes. It let down a silvery, luminous rope or beam of light. After a couple of minutes an \"astronaut\" was let down. All we were able to see of this creature was that it was very, very tall and had on a suit of some sort. The craft which made no noise slowly headed toward our car and passed over it at a distance above us of about 10 feet. I pulled myself halfway out of the window to get a better look at the underbelly which resembled the bottom of a turtle. When the ufo crossed the street it changed into a ball of light once again then changed into a starlike object, zigzagged accross the road and then went straight up at an astronomical rate of speed and disappeared. I know this sounds fantastic, but my ex-husband and I were not drinking and are of sound mind. We were never able to forget or stop talking about this extraordinary event, From now on we will never be able to look at the stars in the same way. The heavens are filled with a distant mystery. We now know that UFOs, though not identified, are very real."],"Object Features":"Patterned Surface","Latitude":"26.723442","Source":"MUFON","Sighting Duration":"00:25:00","Date of the Event":"04/22/1975 10:00 UTC"}