{"Date Submitted":"02/22/2009 07:50 UTC","Country":"United States","Log Number":"US-02222009-0018","Case Number":"15664","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Latitude":"41.645556","Summary":"Five bright white lights in shape of triangle with blue and red lights.","divs":["Sighting DetailsWhile driving back home, I noticed 3 extremely bright lights in the distance, one was a bit higher than the other two. My boyfriend thought it might be a plane landing, however,as we drove further south, it flew to our east, about 200 feet over head, over the woods, it hovered there, moving extremely slow when we noticed a triangle shape, an actual object, with 5 extremely bright white lights, almost like bright spot lights, with a solid red light in the center and blue lights. Bright white lights did not flash, but stayed constant, no lights blinked. All on the UNDERBELLY of the object. We did not see wings or a tail of a plane, especially with it being that close. There was no noise like a landing plane would make and it seemed to just hang in the sky. We noticed a definite shape. It was surrounded by low clouds. Unfortuntely we couldn't stop because we were going 65MPH on the highway. I was shaken up by it because it was not moving and the lights were so HUGE and BRIGHT, so bright they were beaming down onto the trees below. We got to a further stretch of highway and every single street light was out on the road, which we have never seen in the 100s of times we drive on that road in a year."],"Sighting Duration":"Undisclosed","Region":"Rhode Island","files":["/var/www/straped/mufon/html2text/15664.html.txt","/var/www/straped/mufon/org/15664.html"],"Tags":"City","Date of the Event":"02/22/2009 07:50 UTC","Source":"MUFON","trends":["There has been one other sighting in East Greenwich","There were no other sightings in East Greenwich on or around February 22nd 2009"],"Disposition":"IFO","Longitude":"-71.4775","map":"<A HREF = \"http://maps.google.com/maps?q=41.645556,+-71.4775(15664)&iwloc=A&hl=en\"> mufon case (15664) map </A>","Object Features":"Undisclosed","City":"East Greenwich","Object Shape":"Triangle","Viewing Distance":"Unknown"}