{"Date Submitted":"02/22/2009 11:37 UTC","Log Number":"US-02232009-0008","Longitude":"-71.250326","divs":["Sighting DetailsI was leaving my girlfriend's apartment late Sunday night at 11:37 P.M. the time should be within a minute or two according to the clock in the car. When I walked out of the hallway and onto the second story deck I caught a quick glance of an object moving in the distant sky. It was on a north by north west heading. The object moved in a straight line away from me and out of sight behind the tree line with in a matter of five to ten seconds. It had three bright lights, one red in the center and two white lights one on each side of the red light. I didn't hear any sound but it was quite windy that night so it may have masked it; in fact I wouldn't have even looked in that direction for more than a second if it wasn't for the wind blowing so hard into my face. I wasn't able to determine an exact shape of the object but if you were to play connect the dots with the lights it would have formed a triangle with the red light slightly above the two white lights; they were very bright. The lights on the Newport Bridge, which you can see from the road looking south west, were dim in comparison. It really didn't even register right away at what I could possibly be looking at until the next day. I was more concerned with not getting blown off the deck and making my way down icy stairs without breaking my neck."],"Latitude":"41.602324","Region":"Rhode Island","Sighting Duration":"00:00:10","City":"Portsmouth","Summary":"A configuration of three bright lights seen from Portsmouth, RI.","Object Flight Path":"Straight-line path","Country":"United States","Disposition":"IFO","Object Features":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.602324,+-71.250326(15676)&iwloc=A&hl=en\"> mufon case (15676) map </A>","Source":"MUFON","Object Shape":"Triangle, Unknown","Weather Factors":"Windy, Does Not Apply","Date of the Event":"02/22/2009 11:37 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/15676.html.txt","/var/www/straped/mufon/org/15676.html"],"Case Number":"15676","trends":["There have been 5 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around February 22nd 2009"]}