{"Date of the Event":"10/17/2008 12:00 UTC","Weather Factors":"Unknown","City":"Wilmington","map":"<A HREF = \"http://maps.google.com/maps?q=34.234936,+-77.94134(15677)&iwloc=A&hl=en\"> mufon case (15677) map </A>","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/15677.html.txt","/var/www/straped/mufon/org/15677.html"],"Log Number":"US-02232009-0009","Date Submitted":"10/17/2008 12:00 UTC","Region":"North Carolina","Summary":"huge circular around the size of a football stadium","Case Number":"15677","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Longitude":"-77.94134","Country":"United States","Source":"MUFON","divs":["Sighting Detailsme and my kids were moving to north carolina on our way to willmington on a main highway around 630 700 30 min outside willmington nc. I was looking at this really big bright star and told my daughter Wow look at the size of that star... Its awefully low to be a star though... She looked and made a joke \"maybe its a ufo' while looking at it and getting closer to it.. the light went out... and then all the sudden other lights started coming on..from right to left one at a time yellow red green... It was huge!!!!! I am a believer in these things and saw one before with my neighbor fly threw out neighborhood and over my house and then just poof disapeared. That was a smaller triangle shaped that was metalic and kindof shiney but not polished... But I was pulling a large uhaul and had my 2 kids with me and the size of it just shook me.... I thought of pulling over for a second until I saw the size and we were practically under it... and I just wanted to get out of there and not act to scared.... My daughter couldnt speak she was stunned... She used to kid me about me believing in them .... She doesnt anymore... I checked and there were no reports of this huge thing and Im not sure obout the time....but there were plenty of other cars on the highway and no one seem to stop. at least not in front of me... My daughter and I couldnt had been the only person who saw this thing.... It was massive... I wish I would had stopped but something inside told me to keep going... dont stop...."],"Latitude":"34.234936","Object Flight Path":"Undisclosed","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around October 17th 2008"]}