{"Longitude":"-116.874135","Latitude":"32.719899","Object Features":"Undisclosed","Tags":"City","Date Submitted":"02/24/2009 01:18 UTC","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/15690.html.txt","/var/www/straped/mufon/org/15690.html"],"City":"Jamul","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Jamul","There were no other sightings in Jamul on or around February 24th 2009"],"Summary":"Three red/orange lights in a shape of triangle. Moving slowly","Case Number":"15690","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.719899,+-116.874135(15690)&iwloc=A&hl=en\"> mufon case (15690) map </A>","Region":"California","Date of the Event":"02/24/2009 01:18 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","divs":["sighting detailsi was driving back home with my friend from vijeas casino in san diego county when we saw these three red\\orange lights in a shape of triangle, i looked at my friend and told him is that a ufo and he said naw that's probably some lights in the mountain, but as we were driving towards the lights we realized there is no mountain anywhere near the object, we where astonished of what we were witnessing, so be stopped by this turnout before getting to freeway 8w approximately 1:15 am and we saw this 3 red\\orange lights moving slowly in triangular shape closer and closer, we try to take a picture with the cellphone but it was too dark to take a pic with it, and we were just amazed of what we were seeing...as the object getting closer it was getting bigger and you could see it rotating slowly as well... around 1:30 am the object started to disappear. first, one light disappeared, after 15sec the second light did, and it wasn't just instant, but slowly dimming, and after 15sec the third and final one disappeared. and my friend and i where just amazed of the sight we just had, it was nothing that we ever saw on the sky it looked nothing like the stars or plans or helicopters or flairs or any earthly thing it was a ufo. we called 911 at 1:32 and we reported it and asked if anyone else reported it they said no but they took the name and phone number and said they will call us and let us know if anything was reported."],"Weather Factors":"Unknown","Log Number":"US-02242009-0005"}