{"divs":["Sighting DetailsI have reported several sights in the Eastland County, Cisco, TX area. Here is another sighting for this evening, Tuesday, Feb, 24, 2009. I was in my pickup, driving south on Hwy 183. I was approx. 3 miles out from Cisco, coming in from Breckenridge. I happened to notice through my truck window, a grouping of very bright lights in the sky, approx. 30 degrees up from the southern horizon, which would put the object(s)at an elevation of about 800 to 1000 ft., just east and south of Cisco, south of I-20. I noticed one particularly bright white light, with several smaller amber lights clustered around the white light. There appeared to be at least 5 amber lights. I ruled out a normal aircraft, as I've never seen a plane, jet or helicopter with that particular configuration of lights. I could not tell exactly how far the lights were from me but they appeared to be close to I-20, so maybe 5 miles away when first spotted. I managed to get a really sharp, detailed look at the lights, then I drove past some trees to my left, which briefly obscured the lights. It took only a second or so, to pass the trees but by the time I had a clear and unobstructed view of the object(s), it was gone. I looked at my clock radio, which showed 7:15 p.m. I made good time and drove on through Cisco and headed south on Hwy 206. As I crossed over I-20, I again noticed amber lights in the distant SSE. The lights appeared to flash on and off. This was at 7:28 p.m. When I looked up from the clock, the lights were gone. I headed on south on 206 for 5-7 miles and again saw amber lights in the sky, at approx. 20 degrees above the horizon and again, SSE. They were heading due south. The lights seem to have traveled a good distance in a matter of minutes. As I drove past the cutoff to Nimrod on 206 and headed SW, I noticed the lights had again vanished. I made it to my destination and did not see the lights again. The lights would appear, flash quickly several times and disappear, only to reappear further south, then disappear again. The lights appeared to be headed for, or near Rising Star, TX. Total viewing time, approx. 15 seconds. I was driving and did not have time to take a photo but am including a depiction of what I saw. I might also note that train tracks run North and parallel to I-20, just east of Cisco, then travel through northern edge of Cisco, in route to Abilene and the lights were observed hovering over woods and fields."],"City":"Cisco","Object Features":"Unknown","Longitude":"-98.976164","Case Number":"15709","Weather Factors":"None","Tags":"City","files":["/var/www/straped/mufon/html2text/15709.html.txt","/var/www/straped/mufon/more/15709_submitter_file1__2-24-09-ciscotx.jpg","/var/www/straped/mufon/org/15709.html"],"Summary":"Group of unknown amber lights in sky, southeast of Cisco, TX.","Object Flight Path":"Hovering then path,Other","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around February 24th 2009","This sighting has never been favorited.",""],"Latitude":"32.392376","Country":"United States","Region":"Texas","Date Submitted":"02/24/2009 07:15 UTC","Disposition":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"02/24/2009 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.392376,+-98.976164(15709)&iwloc=A&hl=en\"> mufon case (15709) map </A>","Log Number":"US-02242009-0023","Source":"MUFON","Object Shape":"Egg, Oval, Sphere"}