{"Summary":"A bright light sighted south towards Phoenix","Weather Factors":"Unknown","City":"Prescott","Log Number":"US-02242009-0016","Tags":"City","Disposition":"Unknown","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around February 23rd 2009"],"Object Shape":"Disc, Sphere","Longitude":"-112.462782","Viewing Distance":"Over One Mile","Object Flight Path":"Path then hovering","Case Number":"15702","Date of the Event":"02/23/2009 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"34.548224","Object Features":"Unknown","Region":"Arizona","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.548224,+-112.462782(15702)&iwloc=A&hl=en\"> mufon case (15702) map </A>","Date Submitted":"02/23/2009 12:00 UTC","divs":["Sighting DetailsLast evening I walked out on my deck and immediately heard a military jet overhead with afterburners on. I can't remember ever seeing a military jet here in Prescott and I have lived here 2 years. I am a pilot and I used to live near Ellington Field for many years and I am familiar with most military jets. After looking up at the jet I looked south in the direction he was heading and saw a very bright white light.( as far as how big the light was I would have to say from my perspective about the size of an eraser on a pencil) It is difficult to say how far away it was but it had to be at least 10 miles away. As I watched it dissapear only to reappear again either at a lower altitude or a further distance (hard to tell which) and after a few seconds disappeared again and by this time the jet must have been very close to it as I could no longer see the aircraft but could still hear it. The time was pretty close to sunset because I could see the aircraft's strobes fairly easily and what appeared to be the strobes from another aircraft approaching the light from my right which would have been approaching from the southwest towards the object. I wonder if anyone else saw this. I thought of grabbing a video camera but I did not have time."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/15702.html.txt","/var/www/straped/mufon/org/15702.html"]}