{"Region":"Florida","Latitude":"29.285813","Date Submitted":"02/24/2009 08:45 UTC","files":["/var/www/straped/mufon/html2text/15707.html.txt","/var/www/straped/mufon/org/15707.html"],"Disposition":"Insufficient Data","Object Flight Path":"Other","Source":"MUFON","City":"Ormond Beach","Viewing Distance":"Unknown","Longitude":"-81.055889","map":"<A HREF = \"http://maps.google.com/maps?q=29.285813,+-81.055889(15707)&iwloc=A&hl=en\"> mufon case (15707) map </A>","divs":["Sighting DetailsAt 8:45pm EST,I was sitting at home. I had just finished doing some decorative painting (one of my hobbies) when my friend and co-worker called me to report a very bright star -like light that has not moved position in two hours. She lives approximately 20 miles south from me. She told me that this was an amazing light that was jumping all over when she looked at it with her binoculars. I went outside with my binoculars. With my naked eyes, I could see what she was describing. It was a very, very bright, light low (approximately 30 degrees from horizon) in the northwest sky. This was an incredibly clear night, the sky filled with stars. I looked through my binoculars. It was an amazing sight. This light appeared to look like a fat, short, snake - like object that was dancing and moving about in circles, figure 8 motions, very fast. I was talking on the phone at the same time to my friend, describing what I saw. As we were speaking, 2 more snake-like objects came into view and began to dance (for lack of a better description), moving in circles and darting up to each other. After approximately 5 minutes, the other 2 dancing, snake - like bright shapes disappeared, leaving one moving snake in the sky. The bright snake disappeared briefly from my view, than re-appeared then after 5 minutes it was gone. The light show ended around 9:15 pm. I could only say to my friend while I was watching \"Oh, my God, this is amazing \" over and over. This sight made me happy. I had had such a gloomy day at work, overworked and underpaid. Gives me hope, validates my belief that we are not alone. What I experienced at work is so insignificant compared to this."],"Weather Factors":"Unknown","Object Shape":"Star-like, Other","trends":["There have been 2 other sightings in Ormond Beach","There were no other sightings in Ormond Beach on or around February 24th 2009"],"Date of the Event":"02/24/2009 08:45 UTC","Summary":"Appeared like a very bright star in the northwestern sky.","Case Number":"15707","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-02242009-0021","Object Features":"Unknown","Tags":"City"}