{"Country":"United States","Latitude":"32.095974","Date Submitted":"02/24/2009 07:00 UTC","Case Number":"15706","Date of the Event":"02/24/2009 07:00 UTC","Log Number":"US-02242009-0020","Object Features":"None","Summary":"3 bright blinking orange lights merged into two seperate large circular shape.","Sighting Duration":"Undisclosed","Region":"Texas","Object Flight Path":"Hovering then path,Path with directional change","Weather Factors":"Unknown","divs":["Sighting DetailsI was sitting in our sunroom I loked out the window and saw a very bright orange light and then another just like it appeared right next to it. I told my husband to hurry and lets go outside. When we got out we looked toward the South and one light blinked off then another bliked on then another blinked on and then they split apart and merged. The one on the left was the biggest it looked like eight of the orange bright lights. The other was about six and they both looked circular in shape but in a straight line as well. We were transfixed by the largest and we watched it slowly lower to the ground ,my husband said \"its landing\". After the lights merged they were not blinking they were just on and very bright.We live in a very rural area and we have never seen anything like what we saw tonight.My husband was kind of scared. It was the most unbelievable experience. I have heard of people seeing lights in this area but the shape of these things was just like a round bright flying saucer. We estimate it was about 1 mile from our farm. Anyway, I called the local sherriff but they said no one else had reported anything tonight."],"City":"Rising Star","map":"<A HREF = \"http://maps.google.com/maps?q=32.095974,+-98.963671(15706)&iwloc=A&hl=en\"> mufon case (15706) map </A>","Tags":"City","trends":["There have been 7 other sightings in Rising Star","There were no other sightings in Rising Star on or around February 24th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Sphere","Longitude":"-98.963671","files":["/var/www/straped/mufon/html2text/15706.html.txt","/var/www/straped/mufon/org/15706.html"],"Source":"MUFON","Disposition":"Unknown"}