{"City":"Sturgeon Bay","files":["/var/www/straped/mufon/html2text/15717.html.txt","/var/www/straped/mufon/org/15717.html"],"Tags":"City","Object Shape":"Other","Date of the Event":"02/24/2009 08:16 UTC","trends":["There has been one other sighting in Sturgeon Bay","There were no other sightings in Sturgeon Bay on or around February 24th 2009"],"Longitude":"-87.377042","Log Number":"US-02252009-0007","Region":"Wisconsin","Object Features":"None","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Straight-line path,Path then hovering,Other","Country":"United States","divs":["Sighting DetailsMy Daughter and I had just dropped off her friend at the Y, as we started to leave there was a pair of bright lights one red one white, they moved very smoothly, and at the same speed, slow, at that point I parked the car, we got out with cameras in hand, as our cameras warmed up, the two lights became one! the bottom light slowly and very smoothly moved up to the other light all the time moving away and getting smaller, we took a few pics, but the object was very small and blinking slowly red, not sure if we got anything, I have to look at the pics and footage to see if we got it, As we were photographing 2 cars stopped and also saw the objects merge into one. Wow! the way it moved, it was too smooth... it, they did not make any sound at all, also it did stop 2 times, then resumed at the same smooth speed as before. No wind. My daughter had her flash on, we did not see anything but the lights. Not a blimp. My Daughter was stunned. It was not a helicopter, not a plane, just 2 lights moving slow and smooth over our heads. It was freaky."],"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Case Number":"15717","map":"<A HREF = \"http://maps.google.com/maps?q=44.834164,+-87.377042(15717)&iwloc=A&hl=en\"> mufon case (15717) map </A>","Latitude":"44.834164","Date Submitted":"02/24/2009 08:16 UTC","Weather Factors":"Unknown","Summary":"Two lights close overhead and moving south, 2 lights become one! 1 red, 1 white joined and blinked red."}