{"Viewing Distance":"Unknown","Case Number":"15711","map":"<A HREF = \"http://maps.google.com/maps?q=49.607353,+-119.676882(15711)&iwloc=A&hl=en\"> mufon case (15711) map </A>","Summary":"Circular object defined only by the white light emitted from the underside of the object.","Object Shape":"Circle","Date of the Event":"11/21/2007 09:10 UTC","Tags":"City","Date Submitted":"11/21/2007 09:10 UTC","files":["/var/www/straped/mufon/html2text/15711.html.txt","/var/www/straped/mufon/org/15711.html"],"Latitude":"49.607353","Country":"Canada","Region":"British Columbia","Longitude":"-119.676882","Object Features":"Undisclosed","Disposition":"Unresolved","Log Number":"CA-02252009-0001","City":"Summerland","Source":"MUFON","divs":["Sighting DetailsIt was shortly after 9pm local time (pmt) when I went out on to my balcony to have a coffey and relax from a long days work, I shut the padio door and sat down on the chair I have on the third floor facing directly north. The balcony on which i saw the object has a wide view of the mountains to the west as well as the mountains to the east and of course a birds eye view of the valley North of me. No less then one minute after sitting down and looking up in to the clear night sky ( which is something i do often) a circular object no more then 1000ft directly above my location, streaked north across the sky line and continued directly North untill it was out of sight. The object I saw had no disernable shape to it, allthough from what I made out it was a circular shape. The object was simply a circular light on the bottom of the craft, approximetly 100ft across, it made absolutely no sound at all and was travelling no less then eight hundred miles an hour. My reason for saying that speed was no less then 800 mph is that the view I have of the valley directlyNorth of me is 20 to 30 kilometers and then it fades in to the night, also there was a lake directly along the path of the objects course. From the time I saw the object and to the moment it dissapeared in the distance it was no more then 8 seconds. The light the object emitted was the Brightest Most White light I had ever seen in my life, If I had to compare it to anything it would have to be the moon on the clearest night possible, and even then the moon would not compare to the brightness emitted by the craft. Also on closing the objects light source was directed undeniably twoards the ground and I saw no light emitting from the side or the top allthough there was no shape, I saw that the light and craft was definable by the human eye. So this sighting was either American Military in design or it was Extra terestial... This experience not only opened my eyes, But helped me to understand that day in age I am living is more remarkable then even the most wide eyed man could have imagined."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Summerland","This sighting has never been favorited."]}