{"Tags":"City","divs":["sighting details on february 9, 2009, the irish sun online edition featured a report from greece. an official greek aviation authority report, apparently leaked to the local news media, describes a very strange object seen by pilots of 3 different airliners in the early morning hours of november 11, 2007. it was also seen by aviation personnel on the ground, including those at the athens airport control tower. i did not witness this event. the following are excerpts from the article used under fair use: the report says the captain of olympic airways flight 266 from athens to london spotted an extremely unusual object moving erratically to the west of athens. the object was star-like in appearance however much brighter and larger with a constantly shifting shape. meanwhile the captains of olympic airways flights 730 to kos and 700 to rhodes reported the same thing. air force chiefs confirmed they too were visually monitoring the object from their radar station at the top of parintha mountain near athens. and staff there observed that it was travelling at incredible speed and did not fit the description of any terrestrial craft. two f-16s were then sent up to intercept the ufo {at about 3:20am}, while the various control towers monitored the object from earth. the object then shot off at incredible speed skyward and the jets failed to indentify anything. both staff at the athens airport and the parintha mountain air force radar unit later confirmed they clearly observed the object, but their radars picked up nothing. end report on february 6th, photos of 2 pages of the irish sun were submitted to mufon. it was a front page story of interaction with unknown craft, dated february 5. the irish sun is the #1 newspaper in ireland. for a transcription of that article, as well as a very interesting nautical case from ireland reported to mufon in 2006, go to http:\\\\alienvisitorevidence.blogspot.com"],"Latitude":"37.975336","City":"Athens","Object Shape":"Star-like","Date of the Event":"11/11/2007 12:00 UTC","Object Flight Path":"Undisclosed","trends":["There have been 6 other sightings in Athens","There were no other sightings in Athens on or around November 11th 2007"],"Region":"Attica","Log Number":"GR-02252009-0006","Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"Leaked report of very strange object over Greece - Reported by the Irish Sun.","files":["/var/www/straped/mufon/html2text/15716.html.txt","/var/www/straped/mufon/org/15716.html"],"Case Number":"15716","map":"<A HREF = \"http://maps.google.com/maps?q=37.975336,+23.73615(15716)&iwloc=A&hl=en\"> mufon case (15716) map </A>","Country":"Greece","Source":"MUFON","Longitude":"23.73615","Date Submitted":"11/11/2007 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Disposition":"Unresolved"}