{"map":"<A HREF = \"http://maps.google.com/maps?q=39.421892,+-76.353442(15715)&iwloc=A&hl=en\"> mufon case (15715) map </A>","City":"Joppatowne","Longitude":"-76.353442","trends":["There have been 2 other sightings in Joppatowne","There were no other sightings in Joppatowne on or around February 24th 2009"],"Log Number":"US-02252009-0005","Viewing Distance":"Unknown","Summary":"Saw a large fiery object.","Object Shape":"Fireball","Source":"MUFON","Object Features":"Unknown","Date of the Event":"02/24/2009 12:00 UTC","Disposition":"IFO","Weather Factors":"Unknown","Region":"Maryland","Sighting Duration":"Undisclosed","Tags":"City","divs":["sighting detailsi live in joppa md and last night at approx. 9:05-9:15 i saw this huge 'very bright' object gliding through the sky, making no noise, coming out of the southeast and heading north. it was on such an angle that i thought it was going to land\\crash a mile from me, although it was very hard to gauge how high it was. i have never seen anything like it. i know the comet was around last night but i've seen comets and shooting stars, and this thing was much too close to the ground to be either. then i read that some military helicopters have 30 million power lights on to search, but it couldn't of been that because it was too large of a light and, again, made no noise. i lost sight of the object behind some pine trees behind my house, and i regret now not getting off my porch to get a better look at where it was headed etc.....i find it very hard to believe that i was the only one to see this. i was expecting it to be on the local news this a.m. but was not. i have emailed the local station, but they'll probably delete and move on. i was out on covered porch smoking a cigar at the time. i noticed it out of the corner of my eye. when i first saw i thought meteor but wow, if it was, it was going to hit soon."],"Case Number":"15715","files":["/var/www/straped/mufon/html2text/15715.html.txt","/var/www/straped/mufon/org/15715.html"],"Object Flight Path":"Straight-line path","Country":"United States","Date Submitted":"02/24/2009 12:00 UTC","Latitude":"39.421892"}