{"trends":["There have been 2 other sightings in Wadsworth","There was one other sighting in Wadsworth on or around February 25th 2009"],"Weather Factors":"None","Disposition":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path","Longitude":"-87.923965","Log Number":"US-02252009-0017","City":"Wadsworth","Viewing Distance":"Over One Mile","Region":"Illinois","divs":["Sighting DetailsI would just like to start out by saying ive been watch air traffic for as long as I can remmeber due to the fact my father is a huge aviation buff.Im not ready to jump to any conclusions but felt I should fill out a report due to how odd I felt this was. aprox 6:20 pm I was sitting at my computer fliping around on the net just enjoying myself.Then I decided id pop up you tube and put on some music. After the music started playing I walked over to the kitchen table got a cigarette out of my pack and headed out the back door. I stepped out side and immediately north of me between two houses I could see what I thought to be a really bright planet due to the fact it remained perfectly still. My attention soon shifted to stars and other air traffic out that night which there was alot of. A minute or two later I looked back at the object which was still and noticed in a perfect line it started hovering over to the left not moving up or a down at all and then for maybe one second it stopped and reversed direction. at which point I really started to question what I was looking at. It just didnt seem to look right. It continued to move to the right, paused and became BRIGHT very bright so bright I thought it must have been moving close to me and it should be over head any second and became concerned as to what this really was. the light then dimmed after a mintue and I did notice a tiny green light to the left of it which im not sure if it was blinking or not. then it started drifting to the right until it was behind houses and I couldnt see it any more. a bit after the first sighting I had that night I did go out about 15 to 20 mins later to search the sky and saw a tiny light moving east from the west the size of a small star which was fading from green to blue then it lit up very bright which tripled its size I mean this thing got alot bigger then returned to its original size and continued at the the same speed until it was over the horizon out of sight."],"Date Submitted":"02/25/2009 06:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.428632,+-87.923965(15727)&iwloc=A&hl=en\"> mufon case (15727) map </A>","files":["/var/www/straped/mufon/html2text/15727.html.txt","/var/www/straped/mufon/org/15727.html"],"Date of the Event":"02/25/2009 06:50 UTC","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Unknown","Tags":"City","Summary":"1 to 2 in distance away the object was still then moved side to bright and moved out of viewside and became very.","Case Number":"15727","Latitude":"42.428632","Country":"United States"}