{"Date of the Event":"11/20/2005 09:45 UTC","City":"Sandy Springs","trends":["There have been 4 other sightings in Sandy Springs","There were no other sightings in Sandy Springs on or around November 20th 2005"],"Summary":"Black triangle over River Valley Rd.","map":"<A HREF = \"http://maps.google.com/maps?q=33.924269,+-84.378538(15728)&iwloc=A&hl=en\"> mufon case (15728) map </A>","Disposition":"Insufficient Data","Latitude":"33.924269","Source":"MUFON","Date Submitted":"11/20/2005 09:45 UTC","Longitude":"-84.378538","Log Number":"US-02252009-0018","Region":"Georgia","files":["/var/www/straped/mufon/html2text/15728.html.txt","/var/www/straped/mufon/org/15728.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Object Shape":"Triangle","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Case Number":"15728","divs":["Sighting DetailsI MUST FIRST BEGIN BY FINISHING an earlier report I bgan some time ago. I reported a triangle ship I viewed over lower Roswell Rd it was on Oct 31st around 2000 - yes I know that this is Halloween that it is why I didn't mention it the first time. Later that same night I was on Columns drive which parallels the Chattahoochee River and I had a delievery up to river heights. I was headed up the steep incline up to the Apt complex and noticed that to my left was the same floating ship I had noticed earlier in the evening. As I woulnd my way to the apt. I needed to go to the ship proceeded to fly over the apts. I had a delievery to make and so I couldn't go after it as it went behind the building I was delivering to. I called out to some people walking that evening that if they wanted to see a UFO they should look behind the building. THat was the last I saw of it. Now to the next sighting years later of the same style of craft. I was headed what I think is east on River valley rd, THe time was 9:45 Because I looked at the cars clock. River valley RD also parallels that same river but at a greater distance but in the same general region. I saw 3 lights in a row flying low over the trees, I thought that it was a plane and was headed into the ground and that it would take me with it. I gave my poor volvo all it had but in a few secondds the middle light lifted up and I saw that these 3 lights although they looked to be in a row were actually on 3 diffenrent points of a triangular aircraft. It slowly turned left or to it's right and floated over the subdivision to my left I followed it and raced through the streets following it. It never went fast. It appeared to just be floating at a slow pace. THe road went down and so I go a clear view of the various lights under it. ONe in each corner and some in the vey center. It lifted it's nose and just continued away to where I could no longer follow it. The next UFO I saw was the only one I feel might have really had aliens as pilots, I was on a very sombe trip with my brother and his two sons to the funeral of our neice who had recently died. The road is US 77 it runs from Talledega to Gadseden where the funeral was. It can be a scenic road as the road runs over bridges and levees that have expanses of water to both sides. THis was in about 2006. anyway the craft was built like a hamburger with thin buns and the filling was two levels of likghts that were rectangular in nature. It looked like it might have been some swanky restaurant except I knew of know hight tech restaurant built in the lakes by 77. It moved slowly parallel to the road but we lost it when we again hit land and my brother Darrell would not stop the car to look at it. THe last UFO I have seen was what I call the most boring UFO I have ever seen. It was just a ball of white light. I was on the phone about 3 years ago with a friend. It was about 2am and the summer heat was horrid and my cells reception indoors was horrid. So I went outside to smoke and was laying on the trunk of my car looking up at the sky while talking to my friend Elaine. Who lives in LIttleton CO. She can verify this story because I hung up on her. I was the only person on the street when this ball drifted overhead. THe clouds were thick and I think that is what it was about. IT seemed to want a look at me from various angles and heights. It drifted in over the parking lot and when it got oevr me it just stopped. It then rose in heght and the lowered. I told Elaine what I was looking at and she thought it was a gag. I swore that I wasn't kidding her and then while I am looking at this floating ball she's telling me that there is no such thing as UFO's. After a brief squabble I hang up on her. THe ball however seemed to be going from left to right of me and looking at me from various angles and such. My only guess at the time was that it must be some kind of AF viewing device and they were testing it in thick clouds to see how it did. The whole think too about 3-5 minutes. BUt it was not a really bright ball it was actually only visible. IT was white or slightly green in color. I don't remember how it disappeared thoughh. I'm sorry. It just wasn't there anymore. Now you hae all of my UFO stories. If there is anything I can help you with that would be fine. On recent discussions with a person who lives on the river I asked him if he had seen any lights over the river. He said no but that the AF does testing of it's Stealth aircaft over the river at odd times. He was so normal and certain when he said this that I didn't think to question him. When I deliever to him again I will ask. Also you have to be sober and not on any kind of drugs to deliver for the major deliverychains with a perfect driving record. ONe other thing is that a friend of mine - Caroline - has spotted the Triangle ships many times and may be available for contact."]}