{"Tags":"City","Summary":"Spotted UFO hovering above energy equiptment , same time I spotted it , it spotted me moved to hover in front of me. I drove right under it.","Latitude":"45.067899","Country":"United States","Date of the Event":"02/14/2005 06:42 UTC","files":["/var/www/straped/mufon/html2text/15724.html.txt","/var/www/straped/mufon/org/15724.html"],"Longitude":"-122.800092","Sighting Duration":"Undisclosed","Date Submitted":"02/14/2005 06:42 UTC","Source":"MUFON","Object Features":"Window(s), Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.067899,+-122.800092(15724)&iwloc=A&hl=en\"> mufon case (15724) map </A>","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Mt Angel","This sighting has never been favorited."],"Disposition":"Unknown","Object Shape":"Chevron, Triangle","Object Flight Path":"Hovering then path,Path with directional change","City":"Mt Angel","Case Number":"15724","divs":["Sighting DetailsI worked in the town of Woodburn.My shift ended at 6:30 p.m. and as usual I headed straight for home. After leaving Woodburn, and driving on the highway towards the small town of Mt.Angel it dawn's on me I haven't seen any other traffic on the highway, which is highly unusual since it is a week day and I'm sure I'm not the only one to get off work at that hour. Anyway I'm enjoying the quiet drive home and about 2 or 3 minutes into this drive kind of in front and slightly to the left of me, I spot a beautiful star. It was quite a bit larger than most stars and unlike most stars, this one not only was larger but it had colors in it. So I kept watch on this star until corners, trees or the direction of the road changed, obstructing the view. after some obstructions when I knew I should have been able to view it again, it was gone. The whole trip my mind was either on that star or the fact I still hadn't seen any other traffic. Anyway, it only takes me about 15 minutes to get to Mt.Angel.Coming into Mt.Angel everyone knows to slow to 25 miles an hour as it's a very small town and the local police are usally sitting at the entry way, more than willing to give any speed violaters a ticket.I never speed through town anyway.Funny, this particular night the police wern't there.Nobody was there. I mean in the whole town. You always see cars moving, people walking on the sidewalks, people sitting outside the deli eating and visiting you can even see the cashier through the windows,but not this evening. It was as if the whole town was home asleep, or the people were hiding.All the lights were on in the stores,just no people present.Anyway it only takes 2 to 3 minutes to get through town.So I get to the end,and about to start excellerating to head down Mt.Angel-Silverton highway,when off to my left,hovering above some large electrical power system,is this black what I believed to be chevron shaped air-bourn vehecle.I was a little shocked but,not afraid.I think I surprised it at the same time,I'm sure they hadn't planned for me to show up.(continued on anouther report.)(more discription and movement.)"],"Log Number":"US-02252009-0014","Region":"Oregon","Weather Factors":"Rain, Light"}