{"Log Number":"US-02252009-0012","trends":["There have been 6 other sightings in Odessa","There were no other sightings in Odessa on or around February 25th 2009"],"Date Submitted":"02/25/2009 02:30 UTC","files":["/var/www/straped/mufon/html2text/15722.html.txt","/var/www/straped/mufon/org/15722.html"],"Country":"United States","Source":"MUFON","Case Number":"15722","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Shape":"Star-like, Unknown","Disposition":"Unknown","Region":"Texas","Summary":"Bright light making erratic movements.","Viewing Distance":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Longitude":"-102.362293","City":"Odessa","Latitude":"31.850862","Date of the Event":"02/25/2009 02:30 UTC","divs":["Sighting DetailsAs im standing in my backyard having a smoke, im watching the skies as i do anytime im outside. Its a perfectly clear night. A bit cool, but it was beautiful aside from that. I noticed a bright light in the sky. My initial thought is that its mars, because it kinda has a very light reddish glow to it. After about 20 seconds of looking at it, i notice that its flashing slightly. Not the entire object, the main light that caught my attention never wavered. It almost seemed like the bright solid light of a plane with the flashing lights on the wing. So as im watching this thing its sitting in the same position, so i start thinking its a plane. If a plane is flying strait at you, it sometimes gives the appearance of hovering. After about 30 seconds of seeming to sit still, i notice it moving. Slowly at first, in a strait line. Then it triples in speed instantly. It flies fast like this for about 5 seconds and then stops totally. At this point i realise, this is no plane. I run inside to get my camera and when i come back outside to film it, the thing wont show on my camera at all. Then i notice its in the same spot, but its not near as bright. As i watch it for another few minutes it stays mostly stationary. But everynow and then it would fly around in a circle, or it would take off really fast in one direction, then another, and then settle back into a stationary position. After a few more minutes the object just faded into nothing. The whole experience took only around 6-7 minutes. Whatever this thing was it was way to far away to see any kind of shape, or size, or anything of that sort. And i noticed as the whole episode was going on every dog in the neightborhood was barking. and i also heard some strange noises outside my fence. Kind of like a weird scratching and then what sounded kinda like sickly moans"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.850862,+-102.362293(15722)&iwloc=A&hl=en\"> mufon case (15722) map </A>"}