{"Case Number":"15726","Date of the Event":"02/25/2009 12:00 UTC","Latitude":"32.810675","Longitude":"-96.767903","files":["/var/www/straped/mufon/html2text/15726.html.txt","/var/www/straped/mufon/org/15726.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.810675,+-96.767903(15726)&iwloc=A&hl=en\"> mufon case (15726) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Texas","Source":"MUFON","Object Features":"Undisclosed","Country":"United States","divs":["Sighting DetailsMe and my brother were out for a stroll walking to a nearby Jack In The Box when we saw two unusual bright orange lights in the sky. They were in a perfect straight vertical line and were sitting still for about 5 minutes. As we kept watching, the one on the top started moving upward and then moving towards us. Not to long after, the bottom one started to move as well. The only difference is that the bottom one seemed to have released something in the sky that blinked red. We were lucky enough to catch photos of the strange event. We were really skeptical about it all at first, but then we came back home and were so intrigued about what had happened so we got on top of our roof and watched the sky to see if anything similar would occur again. We were eating our jalapeno poppers that we had brought back from Jack In The Box and were starting to be doubtful that anything unusual would happen again. Just as we were finishing eating I had pointed out to my brother that I saw two lights that were similar to the ones we saw an hour earlier. This time it was three lights. At first there were two, but as the one on the top starting moving away another one had appeared out of no where next to the one on the bottom. It has released ANOTHER red blinking object. Could this possibly be ufo's or secret military actions?"],"Tags":"City","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around February 25th 2009"],"Date Submitted":"02/25/2009 12:00 UTC","City":"Dallas","Log Number":"US-02252009-0016","Object Shape":"Triangle","Summary":"Two bright orange lights sitting still in the sky in a straight line vertically.","Weather Factors":"Windy","Disposition":"Unknown"}