{"Date of the Event":"11/30/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.786461,+-119.409912(15730)&iwloc=A&hl=en\"> mufon case (15730) map </A>","trends":["There have been no other sightings in ?","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Latitude":"36.786461","Sighting Duration":"Undisclosed","Log Number":"US-02262009-0001","Longitude":"-119.409912","City":"?","Region":"California","Object Shape":"Undisclosed","Tags":"City","Date Submitted":"11/30/2008 12:00 UTC","divs":["Sighting Details Confessions Facts and Information about the aliens 1. They are ant like creatures 2. They live here 3. They have people devoted to helping them 4. They are advance 5. It's a controlled Society 6. They have video tapes of abducted people 7. The have a type of camera that they can see through metal so they can see inside certain places 8. If you see a weird situation, in order for you to remember it, you need to be in the moment.---What do I mean?--- They have a machine that will control your mind and body if you let it. You need to not let your mind wonder and just make your mind concentrate on what is happening, don't deviate. 9. They dress in old people costumes and pretend to be tourist in all the countries of the world. Usually, one to two middle human people will accompany because \"they are tourist and can't speak the language\". They have to have the human guides because they are not able to speak with the suites on. 10. They mentally communicate with each other, they can't speak orally. 11. Nearly all of them feel that they don't want to interfere with the human society. 12. They want humans to advance their own society with no help from them I know so much about them and I'm tired of keeping other creatures secrets and that's why I'm telling everybody and anybody who wants to know. Believe it or not, I don't really care. For my former friends, I'm sorry for betraying but you gave me no choice, you left me behind."],"Case Number":"15730","Viewing Distance":"Unknown","Summary":"Facts and Information About Aliens","files":["/var/www/straped/mufon/html2text/15730.html.txt","/var/www/straped/mufon/org/15730.html"],"Country":"United States","Disposition":"Hoax"}