{"Weather Factors":"Unknown","City":"Washington","Longitude":"-77.032546","files":["/var/www/straped/mufon/html2text/15735.html.txt","/var/www/straped/mufon/org/15735.html"],"Date Submitted":"07/26/2002 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.896652,+-77.032546(15735)&iwloc=A&hl=en\"> mufon case (15735) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Sighting Duration":"00:00:25","Tags":"City","Summary":"Blue light pulsating, slow and extremely quiet, low to the ground.","Source":"MUFON","Case Number":"15735","Object Features":"Undisclosed","Disposition":"Insufficient Data","divs":["sighting detailsit was extremely late, and i was sitting behind my father in our vehicle. we were driving home from maine in july. i was 12 years old, and prepared to get home and unpack. while driving we turn off of st.charles park way onto the small strip of road called kintore. from kintore we take a left turn onto university drive. as soon as we turned onto university drive i looked up from my passenger side window. i saw a large light blue light pulsating. i dont exactly remember if the light changed to a red\\orange. my father is a aviation contractor is retired airforce, and he too said that this quiet light was strange. the light slowly moved its way past the treetops and out of our line of sight. we turned onto greystone circle, where my house was located. we got out of the car and payed no mind to the strange light we just experienced. i remember walking up the hill to my front door. suddenly two low f-16's flew right above my house in the dirrection the craft was going in alarming speed. later, maybe two days ago, they report was in the newspaper and we realized what exactly we saw. i understand others have come forward and explained much more exciting details of this event, but i believe that every little bit helps. i've heard on the news that there had been many eye witness's in the area who saw this ufo. it baffels me that their has not been a investigation, or atleast i havent know of one. thank you"],"Latitude":"38.896652","Log Number":"US-02262009-0006","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around July 26th 2002"],"Date of the Event":"07/26/2002 12:00 UTC","Region":"Maryland","Country":"United States"}