{"Latitude":"36.421439","Object Flight Path":"Hovering then path,Path with directional change","Date Submitted":"03/02/2006 12:00 UTC","files":["/var/www/straped/mufon/html2text/15744.html.txt","/var/www/straped/mufon/org/15744.html"],"Sighting Duration":"10:15:28","Longitude":"-115.38246","Date of the Event":"03/02/2006 12:00 UTC","Tags":"City","Source":"MUFON","City":"Corn Creek","Country":"United States","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-02262009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=36.421439,+-115.38246(15744)&iwloc=A&hl=en\"> mufon case (15744) map </A>","Disposition":"Unknown","Object Features":"Unknown","Region":"Nevada","trends":["There have been no other sightings in Corn Creek","This sighting has never been favorited."],"divs":["Sighting DetailsI use to live in a place called corn creek nevada witch is about 45 miles north of the las vegas strip on the 95 freeway. Corn creek is out in the middle of the nevada desert so the skys are always clear. On or about the night of march 2 2006 at around 10:15pm i heard my dogs barking like there was someone on my proprty. As i went out to see what was going on my dogs stoped barking. there were know cricket sounds and it was like everything went silent and the air was heavy and smelled like iron and sulphur. as my dogs began to wimper i looked up in the sky and what ever it was was there. it was about as big as two football fields and cloaked to mimic the sky. imagine looking up and seeing all of the stars in the sky and then watching all of the stars move as this thing moved you could see that the stars were in there places. As it moved there was no sound. it would stop and the stars in it would move across the valley from one mountain ridge to the other witch had to have been several miles apart. Then it would stop and 20 of them would flash white lights like stars then it would move agean and the patterns would change and flash 12 then 10 then 12 as it moved away from me it felt like the the air changed and the desert sounds began to return. the feeling i had as i watched this thing move away from me was like nothing i had ever felt befor. I tryed to use my cell phone and regardless of my repeated attempts it would not connect untill it was what looked like around 5 miles from me and then i got a signal. I called my mother and told her what i had seen and what i was looking at as it was moving away. She told me to followed it if i could so i tryed but could not catch it. It was heading north towards the military base on the 95 freeway. I had decided to drive back to my house in town to try and make sense on what i had just witnessed i left my three dogs at the corn creek house with my friend who was house sitting for me. the next day she had called me to tell me that there was something wrong with one of my dogs. i asked her to expalin what was going on and she had told me that it seems as though one of my dogs had caught it self on a part of the fence that surrounded my house but it looked strange to her and i needed to come take a look. as i got to the house only two of my dogs came to me. The one that had the issue was hiding in the house under the bed. i tryed to get her to come out but she was not the same dog at all. finally i got her to come come out and what i saw could not be explained.. she had a triangle mark on her left side right behind her front leg along with three ovel shaped marks that were down to the bone were you can see the dogs ribs the marks were carttarised and there was no blood. i took her to the vet and the marks could not be explained. she was stiched up and i took her home she was never the same after that. the dog use to be very friendly and soone turned mean when ever the night came the dog would hide were ever she could and would not come out untill the morning the strange thing is everytime the night would come she would act lathargic and unsure of were she was. i had to put the dog down because she stared snapping at my kids and attacking the other two dogs. its been years now and i have started comming down with diffrent health issues that make no sense to me my kidness are starting to have issues and my spleen is not right. i also have an issue with one of my lungs. also i have a case of bad aruthritous in my joints along with un-explained headachs."],"Summary":"The sky moved.","Object Shape":"Unknown","Weather Factors":"Unknown","Case Number":"15744"}