{"Country":"United States","Longitude":"-74.798395","Date Submitted":"01/21/2009 11:00 UTC","trends":["There have been 3 other sightings in Hammonton","There were no other sightings in Hammonton on or around January 21st 2009","This sighting has never been favorited.",""],"Object Shape":"Circle","Viewing Distance":"Unknown","Latitude":"39.643306","Disposition":"Unknown","City":"Hammonton","files":["/var/www/straped/mufon/html2text/15741.html.txt","/var/www/straped/mufon/more/15741_submitter_file1__Perna_UFO.jpg","/var/www/straped/mufon/org/15741.html"],"Object Features":"Unknown","Weather Factors":"None","Log Number":"US-02262009-0012","Summary":"3 UFOs flying south to north...viewed for 5 minutes.","Sighting Duration":"00:05:00","Region":"New Jersey","divs":["sighting detailsthis is an account of my wife's grandfathers experience (him telling the story in first person): after watching a movie, i got up as i usually do every night and went over to lock the kitchen door. as i looked out the window, i saw three (3) objects in the sky (please see attached file of a drawing). i watched them for at least five (5) minutes moving from south to north (i was looking towards the southeast) and the objects traveled not like a plane, rather they traveled almost with no effort, very calm and smooth and very slow. the three (3) objects had a circluar shape with three (3) lights on each one. two (2) of the lights were a very bright white light and the other was a pinkish\\red. the objects had an amber glow\\tint around them. if you held your hand, arms length away, the space between each object was from my thumb to my pinky. as i was holding out my hand, if i brought my hand over the object to try to block it out, i could still see the amberish glow residing around the object."],"Date of the Event":"01/21/2009 11:00 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.643306,+-74.798395(15741)&iwloc=A&hl=en\"> mufon case (15741) map </A>","Tags":"City","Case Number":"15741"}