{"Longitude":"-117.907334","City":"Anaheim","Object Flight Path":"Stationary","Object Features":"Unknown","trends":["There have been 55 other sightings in Anaheim","There were no other sightings in Anaheim on or around May 29th 2006","This sighting has never been favorited.",""],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.839313,+-117.907334(15749)&iwloc=A&hl=en\"> mufon case (15749) map </A>","Viewing Distance":"Unknown","Date Submitted":"05/29/2006 04:32 UTC","Case Number":"15749","Disposition":"IFO","Latitude":"33.839313","divs":["sighting detailsmy family and i were taking pictures of a parade at disneyland. i caught with my camera a group of luminous sphere like objects in formation . there were 16 of them. i saw spheres alone, but most were in groups of 2 spheres together. one of the groups had 4 spheres. i noticed that almost all of the groups seem to be diagonally oriented in relation to my position. i told by somebody that saw the picture that these could have been balloons. i disagree. i was taking many pictures, one after the other, and the picture i took seconds after this one has nothing in it. they were gone. balloons can't move that fast. balloons don't orient themselves diagonally. i remember that day very well. if you look at both pictures. there was no wind and it was a very hot day. i ran the picture through several image filter. in my software these things register as 3d objects. please let me know if you need any further information thanks {cms\\jat\\pid} text moved to narrative"],"Region":"California","Summary":"16 luminous sphere like UFOs in groups of 1, 2 and 4. Daylight event.","Log Number":"US-02262009-0020","Country":"United States","files":["/var/www/straped/mufon/html2text/15749.html.txt","/var/www/straped/mufon/more/15749_submitter_file1__MiscFamilyPicts282.jpg","/var/www/straped/mufon/more/15749_submitter_file2__MiscFamilyPicts283.jpg","/var/www/straped/mufon/org/15749.html"],"Tags":"City","Date of the Event":"05/29/2006 04:32 UTC","Source":"MUFON","Object Shape":"Sphere, Other","Sighting Duration":"00:00:05"}