{"Region":"Michigan","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cylinder","trends":["There have been 2 other sightings in Harbor Springs","There were no other sightings in Harbor Springs on or around July 20th 2003","This sighting has never been favorited.",""],"Case Number":"15743","Log Number":"US-02262009-0014","divs":["Sighting DetailsIn the third week of July, 2003 I was walking my dog as I usually did after returning home from work. At that time we lived approximately seven miles north of the Little Traverse Bay of Lake Michigan and about three miles north of Nub's Nob ski resort. On that evening at 7:30pm the weather was warm with a cloudless sky. Across the road from our subdivision is the Pleasantview Swamp which runs seven miles north to south and three miles wide east to west. We lived near the south end. As I walked the dog towards Larks Lake Road, two houses down from my own, I noticed a shiny cylindrical object appear from a near distance to the north as it flew a smooth, soundless, straight line, north to south, with no contrail whatsoever. It appeared as if it were following Larks Lake Road. I am not good at estimating distance above the ground but it was clear and low enough above the tree line to see a smooth bright silvery surface of its cigarette shape with no wings and flat ninety degree angles on both ends. When I first saw it the thought of it being a missile crossed my mind but it flew too slow but yet too big and fast to be a helium balloon. If I were to hold my fist to the sky, the length of the object would have extended beyond both sides of my hand. I watched in awe as it passed directly over me and to the south towards Nubs Nob. After watching for thirty some seconds I ran home to get my wife but her view was obstructed by trees and by that time it was too far away. My emotions at the time were not so much scared as it was being mystified and creepy hoping like hell it wasn't going to land in our open field. I still get that feeling today. Over the years I have told a few professional people, policeman and pilots about the sighting and at the time of the sighting I drew the crude digital drawing attached to this report."],"Weather Factors":"None","Longitude":"-84.991999","City":"Harbor Springs","Latitude":"45.431676","Object Flight Path":"Straight-line path","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/15743.html.txt","/var/www/straped/mufon/more/15743_submitter_file1__cylindar3.jpg","/var/www/straped/mufon/org/15743.html"],"Date of the Event":"07/20/2003 07:30 UTC","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.431676,+-84.991999(15743)&iwloc=A&hl=en\"> mufon case (15743) map </A>","Object Features":"None","Sighting Duration":"Undisclosed","Summary":"Flying metallic cylinder.","Date Submitted":"07/20/2003 07:30 UTC"}