{"Case Number":"15755","Date of the Event":"02/26/2009 08:00 UTC","Latitude":"39.731432","Date Submitted":"02/26/2009 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.731432,+-104.82319(15755)&iwloc=A&hl=en\"> mufon case (15755) map </A>","Longitude":"-104.82319","City":"Aurora","Source":"MUFON","Tags":"City","Weather Factors":"Windy, Medium","divs":["Sighting DetailsIt was around 8:00 pm and me and my friend were sitting in the back yard smoking. My friend noticed a bright lite in the sky and asked me what it was. I took a look and told him that i did not know and that it might be a plane or a star, since we live next to Buckley Air Force Base we have lots of planes flying around, but after a second look i noticed that the light was not moving. so i went in to the house and grabbed my Digital Camera and started taking pictures of it. I took 16 pictures of the light with all the diferent settings my camera had. Then i went back in the house and grabbed my Video camera and started filming it with normal and night vision on. than I went up stairs and climbed out the second floor window on to my garage roof and started filming from there. the object moved slightly lower from where it first was and then stoped. I kept filming it for another 15 or so minutes and got kinda cold on the roof so I desited to go back in the house. i set the video camera down and take some more photos of the light. After that I got a bit cold again and went back in the house for a few minutes. Then i came back outside to check on the light and it was further away and a bit dimmer but i could still see it very well and a few seconds later it just went off like some one just fliked a light switch, and that is it. My mom and my friend all saw it as well. and none of us could tell what it was. A few minutes later my sister got back from work and we all told her what we saw but she would not belive us until i showed her the video and the pictures, il post the pictures as well they are all original straight from my Sony CyberShot Digital camera and one of the pictures was shot with High Sensitivity ISO 1000 and i think its the best one, you can c a small yellowish object with a glowing halo around it il post all the pictures If anyone wants these pictures just email me at virtexman@gmail.com and i will send them to you and i also have about 20 minutes of video of this thing as well these photos i am posting are real I only zoomed in on the object and that is all I have the original full size pictures Email me if you would like me to send them to you The zoomed3 photo is the one i took with hight sensitivity ISO 1000 and it the best one i think"],"Object Flight Path":"Undisclosed","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around February 26th 2009","This sighting has never been favorited.",""],"Country":"United States","Disposition":"IFO","Sighting Duration":"Undisclosed","Region":"Colorado","Summary":"UFO over Colorado, white ball was in the sky for 30 minutes then gone","Viewing Distance":"Unknown","Object Features":"Undisclosed","Log Number":"US-02272009-0001","files":["/var/www/straped/mufon/html2text/15755.html.txt","/var/www/straped/mufon/more/15755_submitter_file1__zoomed1.jpg","/var/www/straped/mufon/more/15755_submitter_file2__zoomed2.jpg","/var/www/straped/mufon/more/15755_submitter_file3__zoomed3iso1000.jpg","/var/www/straped/mufon/org/15755.html"],"Object Shape":"Circle, Fireball, Star-like"}