{"Case Number":"15758","City":"Perth","Object Shape":"Circle, Square, Rectagular","Log Number":"AU-02272009-0004","Date Submitted":"06/04/2008 07:30 UTC","Region":"Western Australia","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Three circular pulses followed by one rectangular pulse.","Latitude":"-31.948434","Date of the Event":"06/04/2008 07:30 UTC","divs":["Sighting DetailsI was on a regular evening walk in Perth, Western Australia with my wife and two children. As I was walking in a northerly direction up a slight hill, I saw a white light seemingly 'flash' once in my peripheral vision (above and somewhat to the east of my line of sight). I thought it might be an aircraft of some kind and casually looked up toward the region in the sky. However, when I continued to watch, there was no visible flashing for several seconds. This caught my attention. I stopped at a T-junction before crossing and continued to watch. Approximately 15 seconds later, there was a second light. Because I was now focusing on the region, I saw the object more clearly on the second occasion. It appeared to be a pulse of light; i.e. the increase and decrease in the luminance of the object seemed to be a pulse in the proper sense of the word. The duration of the pulse was approximately a second (possibly slightly less). This pulse was almost certainly the same object. It was white, slightly grey. Its luminance was that of a relatively dim star; considerably less than the brightest star in the evening sky but brighter than the dimmest stars. Its size was larger than any star, its diameter in the order of 3 or more times that of any star. It was well after sunset. At the time of the second pulse, I made a point to 'get a fix' on the location relative to nearby stars. It was to the east of two stars that were close to one another; one of the stars being above the other. It was between these two stars and another to the east of them. I continued to watch the region. There was a third pulse of light, exactly the same, after another 15 seconds (approximately). I continue to wath. After approximately another 10 seconds or more, there was another pulse of light, this time rectangular as seen in the sky. It seemed distant, and I could not in any way ascertain its actual 3 dimensional shape. The width of this rectangular object was in the order of 3 to 7% of its length. This estimate is based on drawing the shape as it appeared, and measuring the dimensions. Its hue and luminance seemed identical to the three circular pulses. The rectangle was close to parallel with the horizone but inclined slightly downward from west to east; in the order of 15 degrees. By the time I observed the third pulse, my wife had returned to my location with the children. After I stopped, she had crossed the street, and only came back when I called to ask her to do so. I had oriented her attention to the region of sky by pointing to the three stars. My wife then observed another rectangular light in the same region. It occurred seconds after the one I observed. I did not see observe the pulse she saw. She said it was white, but slightly orange in appearance. I conveyed my estimate of the length, width, luminance, duration, and inclination of the rectangular light that I saw. We discussed all of these characteristics at some length. She thought the object she observed matched all characteristics except color. She was sure there was a slight orange hue. I told her of the preceding three circular pulses. We watched the area for about ten minutes after this and saw nothing more. As the minutes passed, I scanned a broader and broader region around the three stars. I then gave up and we continued on our walk. The object(s) was NNE and approx 30 degrees above the horizon. I was intrigued by the object. I reacted with a little surprise at first, then intrigue. Because it was not like anything I had seen previously, I found the appearance striking and quite strange."],"Object Features":"Unknown","Object Flight Path":"Stationary","Longitude":"115.860849","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=-31.948434,+115.860849(15758)&iwloc=A&hl=en\"> mufon case (15758) map </A>","Weather Factors":"None","Viewing Distance":"Unknown","Country":"Australia","trends":["There have been 15 other sightings in Perth","There were no other sightings in Perth on or around June 4th 2008"],"files":["/var/www/straped/mufon/html2text/15758.html.txt","/var/www/straped/mufon/org/15758.html"]}