{"Country":"United States","Object Flight Path":"Other","divs":["Sighting DetailsWhen i was young i encountered three beings. my father had made a pup tent for me and my brother. I woke to pee in what seemed to be a very bright moon, therefore i was not afraid of the boogie man. I went next to the blueberry bushes. While crouched I heard voices loud and what sounded like people revealing in happiness or whatever \"older people\" get to do, like go to the lake. I stayed low so they could not see me . I was going to spy on them! As they came closer toward our little pup tent , which had been put right next to a big pine tree. I noticed, hey! They were naked! They had no clothes on and oh, I could really see their eyes. It scared me to my full height, to run... then froze ,they had already some how noticed my presence! They did not jump back from me . I thought maybe I would have scared them a little, because it was so late at night. I was as quite as a wood mouse. ( I thought rapidly). I felt it of no use to run anymore to my parents house. Maybe they were to kidnap me. I didn't want them to get my brother ,too. I knew I was helpless.( weird to have that feeling with your parent only yards away) Or maybe, I had mistaken their nudity and these were people for Halloween tricks. Then i remember this high squeaky sound and then it lowered to a voice mixed with the radio. Eyes smooth as glass, large brown with some black in the center. Penetratring eyes. I could hear them talking in their language and didn't understand, but a few words in my language came to me; not this one! the taller one said. I heard it and new it cam from him, he had no mouth! It was then I realized in my child mind this was a bad thing. These are, I am not sure if I knew the word alien, but it was not the boogie man! I think that one short evil one I'll call him and ruthless is the one whom wanted to do awful things to me. His face was more scrunched and wrinkled with a brownish pink naked skin. Long arms , not hairy , just weak looking arms with long fingers. It gives me the creeps writing it now, like they know i am writing this(sorry transgressing, maybe a real or to others an unreal emotion to compute).. Evil also had a large head with more of the pinkish tone,still ugly. The three of them stood there like the British solders do in the movies at war. looking at me. I looked to the middle, taller being. He gave me a sense of calm . Again i felt as though he talked to my brain and my brain answered! My mouth did not move, I put my hands on my lips i felt them not move. Before I could be shocked, Evil squiggled withed his voice and \"interrupted us\" I did not understand Evil, but felt his desire for me so to speak. I could only as a child think what on earth do you want with a kid? Aren't you here to teach the big people how to behave? We have a war going on. Maybe this , these words I just wrote are inserts from rationalizations for the past 40+ years or memories are just a result of trauma of the Vietnam war?? I have asked my self over and over. You will never know how many times I have asked myself. If it is just a bad dream why do I have that;the burnt in my brain feeling there? When Evil was for lack of a better description,arguing I heard or felt the urge to run. I did right into my brother's side . Realizing that was scary I covered my head and said over and over\" If I can't see you you can't see me\"! I do not remember going into a craft. I have always really feared what they did to my brother. I beleive i have seen them throughout my years five of more times. I have shooed them away after my daughter came home from the hospital. I commanded them, as my mother had told me to do! Other than that i believe i have in some odd way gotten used to them. I also get angry over the fact that if there was something to be done to me or others they only need to Ask! The tall ones are more compassionate then the smaller or uglier ones. I don't know if I make this crap up or i just kinda know like telepathy. One other thing water is important to them and they use lakes."],"Latitude":"43.818506","Object Features":"Undisclosed","Viewing Distance":"20 Feet or Less","Date Submitted":"06/30/1968 12:00 UTC","Case Number":"15754","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15754.html.txt","/var/www/straped/mufon/org/15754.html"],"trends":["There has been one other sighting in Windham","There were no other sightings in Windham on or around June 30th 1968"],"Source":"MUFON","Object Shape":"Other, Unknown","Tags":"City","Disposition":"Unknown","Region":"Maine","Summary":"Alien encounter.","Longitude":"-70.415144","map":"<A HREF = \"http://maps.google.com/maps?q=43.818506,+-70.415144(15754)&iwloc=A&hl=en\"> mufon case (15754) map </A>","City":"Windham","Log Number":"US-02262009-0023","Date of the Event":"06/30/1968 12:00 UTC"}