{"Object Features":"Other","Case Number":"15768","Region":"Nova Scotia","divs":["Sighting Detailsi saw this in the sky when i was out for a walk on Feb 24, 2009, around 9:00pm in Nova Scotia, Canada. i looked up as i was walking down my hill and saw these lights in the sky on my street. **please notice how the lights change colour in a rotation, except for the red one (if you can, poor quality, i know)** when i first seen it, i knew it was something strange, which made me take out my phone and capture it for proof when i go to tell the story to people, or to see if anyone else could identify it. the whole thing was moving as a unit, not making any noise; then it stopped suddenly. originally i meant to just take a picture, but my camera phone was on the video setting by accident. the original size of the object is located in the first 1-3 seconds before i zoom in. i wish i could have captured a longer film, but i tried to switch to photo (i dont know why, i hesitated i guess) and started moving once again and it dissapeared out of sight behind trees (in the forest surrounding my area) shortly after... it was the weirdest thing i have ever seen. also, i live on the street that i saw it on, therefore i know its not street lights, or lanterns or anything like that, its something i have never seen before."],"Longitude":"-62.634985","map":"<A HREF = \"http://maps.google.com/maps?q=45.590985,+-62.634985(15768)&iwloc=A&hl=en\"> mufon case (15768) map </A>","Weather Factors":"Unknown","City":"New Glasgow","Summary":"Weird lights that moved and the lights changed colour, then suddenly stopped.","Object Flight Path":"Hovering then path,Path then hovering","trends":["There has been one other sighting in New Glasgow","There were no other sightings in New Glasgow on or around February 24th 2009","This sighting has never been favorited.",""],"Object Shape":"Diamond, Triangle","Disposition":"Unresolved","Source":"MUFON","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"02/24/2009 09:00 UTC","Latitude":"45.590985","Date Submitted":"02/24/2009 09:00 UTC","Sighting Duration":"Undisclosed","Log Number":"CA-02282009-0004","Country":"Canada","files":["/var/www/straped/mufon/html2text/15768.html.txt","/var/www/straped/mufon/org/15768.html"]}