{"Date of the Event":"02/22/2009 09:00 UTC","trends":["There have been 2 other sightings in Galena","There were no other sightings in Galena on or around February 22nd 2009","This sighting has never been favorited.",""],"Tags":"City","City":"Galena","Source":"MUFON","Object Features":"Undisclosed","Disposition":"Unresolved","Case Number":"15763","Sighting Duration":"12:00:00","Date Submitted":"02/22/2009 09:00 UTC","Weather Factors":"Unknown","Log Number":"US-02272009-0008","files":["/var/www/straped/mufon/html2text/15763.html.txt","/var/www/straped/mufon/more/15763_submitter_file1__Becca.jpg","/var/www/straped/mufon/org/15763.html"],"Region":"Illinois","Summary":"Black soundless triangular about 20 something feet across.","Viewing Distance":"Unknown","Country":"United States","divs":["sighting detailsi really dont want to write about it, but it happened on feb 22, 2009 we left my freinds house at 8 30 and we were going back to college.. im 21 and have always been sane. ... but yeah there were many of them following us for our 3 hour car ride.. and they were just blinkies, blinking moving lights that were following us, and we got out at a lookout point and got back in the car to drive away and im staring out the back window and the blinking thing started coming right at us, i did not take my eyes off of it... and when it got close it shined this bright [cms\\pd] light and then stopped and it flew slowly over our parked car me and my friend both drew what we saw, we didnt look at eachothers pictures and when we compared them they were the same. i havent been right since... everytime i look in the sky they appear. i wawnt to believe they are plans but after it flew 25 above our car and made no sound... scary [cms\\pd]. theyre here... ; )"],"Object Shape":"Triangle, Other","Object Flight Path":"Undisclosed","Latitude":"42.422604","Longitude":"-90.423677","map":"<A HREF = \"http://maps.google.com/maps?q=42.422604,+-90.423677(15763)&iwloc=A&hl=en\"> mufon case (15763) map </A>"}