{"divs":["Sighting DetailsWhile walking alone through a backyard during a usual routine of exercise I had stopped for a glance in the sky as I ordinarily do on clear days when in the air straight up above me at an altitude of about 3000 feet I had spotted a round ball-like object hovering in a slow but steady glide toward a southerly direction. This visible object did not in any way appear as what would normally have been a bird or plane, no wings or tail were seen. With the extreme force of wind current and at it's estimated height, it would not have been possible for any winged creature or balloon to hover so sternly, as they would have shown an air pattern in a more turbulent or vibrational path. Additional note: Using my very sharp and accurate vision I was able to depict that because of the slow steady movement it presented, this was not a star nor even a meteor. Either one would have displayed a more split-second sparkling streak or no movement at all. The object remained in sight for at least one minute and as the cold wind began to water my eyes I glimpsed away briefly and when I quickly returned to what was a very open part of the sky, the object was nowhere in sight. After another whole minute of observing that area of sky and with the awareness of how the sun will divert things at different angles and colors, there was nothing visible. In retrospect from what similar reports have stated, it seemed very possible that the object must have made itself off at a high rate of speed. It is unknown to me as to what it was or why I had come to observe this, other than for me to account for it and being clearly seen and recognized as a UFO. I'll be recalling this experience until the end of my days."],"Tags":"City","Weather Factors":"Windy, Heavy","Summary":"\"What the heck is this I'm seeing!!\"","Date of the Event":"02/23/2009 02:28 UTC","Latitude":"41.297414","Date Submitted":"02/23/2009 02:28 UTC","Disposition":"Unknown","Object Shape":"Circle, Sphere, Other","files":["/var/www/straped/mufon/html2text/15766.html.txt","/var/www/straped/mufon/org/15766.html"],"Object Features":"None, Other","Viewing Distance":"501 Feet - 1 Mile","Case Number":"15766","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 5 other sightings in Peekskill","There were no other sightings in Peekskill on or around February 23rd 2009","This sighting has never been favorited.",""],"City":"Peekskill","map":"<A HREF = \"http://maps.google.com/maps?q=41.297414,+-73.918726(15766)&iwloc=A&hl=en\"> mufon case (15766) map </A>","Longitude":"-73.918726","Country":"United States","Object Flight Path":"Hovering then path","Log Number":"US-02282009-0002","Region":"New York"}