{"trends":["There have been 3 other sightings in Lagos","There were no other sightings in Lagos on or around February 27th 2009"],"Viewing Distance":"Unknown","Longitude":"3.395833","Object Features":"None","Source":"MUFON","City":"Lagos","Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=6.453056,+3.395833(15764)&iwloc=A&hl=en\"> mufon case (15764) map </A>","files":["/var/www/straped/mufon/html2text/15764.html.txt","/var/www/straped/mufon/org/15764.html"],"Country":"Nigeria","Log Number":"NG-02272009-0009","Disposition":"Unresolved","Summary":"A sudden appearance of a very bright star that flashes off to the left and vanishes.","divs":["sighting detailsi was showing my family the crescent moon with venus and was trying to figure out if venus was the bright star we noticed the night before,so i thought i'd just watch the sky for a while to see if any other bright star would become visible...as i was staring at the moon...a very bright star suddenly appeared on the left hand side,parallel to the moon! as i gasped it started traveling to the left in a flash and an absolute straight line,so i called my husband over to take a look (he was seated 5feet away from me and the window), he got there just in time to see it and in another flash it vanished. in detail,when it appeared it was golden\\whitish and stationary like a huge star,then started suddenly moving very fast to the left and traveled a very short distance horizontally and seemed to swell with a greenish tinge and what looked like the beginning of a tail when it suddenly stopped and ...gone..vanished! no sound at all! no smoke at all! nothing! like it was never there!!! i am still stunned! where did it come from? i had been staring at that spot for the last 20-30 mins and there was nothing there but the moon,it was just like someone putting on a lightbulb! if you have any questions please feel free to ask, i really want to know what that was....i thought ufo but haven't really ever heard a similar story...please help! thanks."],"Date Submitted":"02/27/2009 07:30 UTC","Weather Factors":"None, Does Not Apply","Sighting Duration":"Undisclosed","Object Shape":"Bullet, Missile, Star-like","Region":"Lagos","Date of the Event":"02/27/2009 07:30 UTC","Tags":"City","Case Number":"15764","Latitude":"6.453056"}