{"Date of the Event":"03/01/2009 12:00 UTC","Object Shape":"Circle, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.087491,+-106.644027(15789)&iwloc=A&hl=en\"> mufon case (15789) map </A>","Region":"New Mexico","Longitude":"-106.644027","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-03022009-0008","Tags":"City","Country":"United States","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around March 1st 2009"],"Disposition":"Unknown","Source":"MUFON","Date Submitted":"03/01/2009 12:00 UTC","Summary":"2 objects \"dancing\" in the southern sky over New Mexico.","divs":["Sighting DetailsIt's 10:02 pm on Sunday, March 1st and family G. had just finished watching a movie called \"Swing\" on DVD (Fabulous movie by the way). I was warm from the wood stove so I decided to step outside to get some air in the front door courtyard... As is my propensity, I looked up into the sky due south and witnessed a shooting star heading from north to south...except at about 30 degrees above the southern horizon, the blueish shooting star STOPPED and moved 90 degrees due east at about 10 degrees horizontally, maintaining an elevation of about 30 degrees over the southern horizon. Wondering if my eyes were deceiving me, I looked closer and noticed a second \"something\" a bit to the southwest of this NOW stationary object. Both objects were randomly alternating blue and white lights and were moving unlike any airplane or helicopter I've ever seen - and I know what airplanes, helicopters and ospreys look like when maneuvering. These two objects were moving fast, slow, random and were also stationary - often in a circular motion. I ran inside and called the family and for the next minutes all 4 of us watched these two objects \"dance\" in the sky directly due south, sometimes moving in extreme angles and at others seemingly spinning, then being stationary, also at times the objects would go dark, then a few seconds later would return with blue or white light. The second object dropped down below the horizon as my family stood outside and I ran inside to grab the video camera. When I got back outside, the first object had dropped below the horizon (in this case our neighbor roof) and we saw nothing more. I called a buddy of mine at the local TV station immediately and he said there had been no calls as of yet, but he usually gets them if something funny is happening in the sky...we'll see if anyone else corroborates this. I do know this, our youngest one was scared out of her wits and slept with us tonight. This entire family witnessed something amazing. If any news comes forth about strange moving objects with blue and white lights somewhere over Southern NM, yet viewable from Albuquerque's west side, you'll now know that it WASN'T bunk. This was amazing, beautiful and mind altering."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/15789.html.txt","/var/www/straped/mufon/org/15789.html"],"City":"Albuquerque","Case Number":"15789","Latitude":"35.087491"}