{"Date of the Event":"05/31/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.273202,+-89.985916(15788)&iwloc=A&hl=en\"> mufon case (15788) map </A>","Object Features":"Undisclosed","Date Submitted":"05/31/2008 12:00 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Log Number":"US-03022009-0007","files":["/var/www/straped/mufon/html2text/15788.html.txt","/var/www/straped/mufon/org/15788.html"],"City":"Brandon","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"15788","Object Shape":"Star-like, Triangle","Source":"MUFON","Summary":"6 pyramids with red lights on each corner of the pyramid accompanied by 3 star-like spherical objects.","Region":"Mississippi","Tags":"City","trends":["There have been 4 other sightings in Brandon","There were no other sightings in Brandon on or around May 31st 2008"],"Longitude":"-89.985916","Object Flight Path":"Stationary,Hovering then path","divs":["sighting detailsi was sitting in the backyard of my house with my friends sometime in mid june, 08. we were planning on having a cookout when a small plane flew over at about 400 feet which drew my attention towards the sky. i immediately saw some objects in the sky, and i knew at that instant that it wasn't any animal, manmade craft or astronomical body. after a second, i counted 9 objects, 6 of which seemed a bit larger. these objects were at a stand still about 1000 feet above my house\\neighborhood, and slowly spinning. i grabbed a pair of binoculars out of my car to get a better look. upon viewing the objects closer, i noticed that 6 of them (the larger ones) were clearly triangular, in the shape of a pyramid. the pyramid-shaped crafts had a dark, metallic grey look to them. the body of the craft was seemless with red lights on each corner, and slowly rotating. floating along the pyramids were 3 spheres of bright white light (mind you this is midday). the whole time the objects were entirely silent. all the objects then, in sync, and never leaving formation, headed east against the wind until they passed out of sight; my friends and i sat stunned and silent. it was a beautiful and eerie experience that moved all of us. i made a police report, and the officer that i spoke to told me i was the 4th person in my neighborhood to report the objects i saw."],"Latitude":"32.273202","Viewing Distance":"501 Feet - 1 Mile"}