{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/15782.html.txt","/var/www/straped/mufon/more/15782_submitter_file1__16011a.jpg","/var/www/straped/mufon/org/15782.html"],"Case Number":"15782","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Statesboro","There were no other sightings in Statesboro on or around February 15th 2009","This sighting has never been favorited.",""],"City":"Statesboro","Longitude":"-81.781417","Date of the Event":"02/15/2009 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.451118,+-81.781417(15782)&iwloc=A&hl=en\"> mufon case (15782) map </A>","Country":"United States","Object Flight Path":"Path with directional change","Summary":"Disc that became very bright.","Log Number":"US-03022009-0001","Region":"Georgia","divs":["sighting detailsi saw an object moving across the horizon(north to south),i almost knew for sure what it was because i know what a helicopter or airplane looks like and not to mention you could just look at it and tell,and it made no sound that was lit up all the way across, it appeared to be disc shaped.... i have a l.e.d headlight that has a white and red light on it i flashed the object with both colors,it hooked around in closer(heading west) and got very bright, the object then dimmed down to reveal multi colored lights that at one point blinked off and then re-appeared(heading back north),the object eventually moved below the trees........before i saw this object we were watching the lights behind the house that got really bright and then went out and continued to do so for a lengthy amount of time(were not stars)....we were at my house.....my emotions were a mix of curiosity,fear,amazement,awe,.......i posted this video on my myspace many times and it was taken off by someone on every attempt,i still do not understand that.......i do have a video but i am on my phone so i cant download it,in the video the disc object and lights can be seen clearly.......we have seen many ufos here,ranging from spheres,discs,saucers,cigar shaped,triangle,......we spotted a saucer at dawn(7:30am)(12\\29\\08) hovering above the trees,silver with red and green lights on top and around the diameter of it,no sound, it was the most amazing specticale i have ever witnessed,it was moving slow until it moved out of sight, had no camera at the time but have had one nearby since then..........................if you would like to obtain the video please feel free to contact me,i never get tired of watching it,it is amazing."],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Date Submitted":"02/15/2009 08:30 UTC","Latitude":"32.451118","Tags":"City","Object Features":"Undisclosed","Object Shape":"Disc, Fireball","Sighting Duration":"00:05:00"}