{"files":["/var/www/straped/mufon/html2text/15780.html.txt","/var/www/straped/mufon/more/15780_submitter_file1__UFOChad2.2609.jpg","/var/www/straped/mufon/org/15780.html"],"Object Flight Path":"Straight-line path","Object Shape":"Cylinder","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around February 26th 2009","This sighting has never been favorited.",""],"Object Features":"None","City":"St Augustine","Disposition":"Unknown","Date Submitted":"02/26/2009 08:45 UTC","Source":"MUFON","Tags":"City","Summary":"City-sized cigar, triangles, balls of light at St. Augustine beach.","Latitude":"29.901624","map":"<A HREF = \"http://maps.google.com/maps?q=29.901624,+-81.305148(15780)&iwloc=A&hl=en\"> mufon case (15780) map </A>","divs":["Sighting DetailsThe witness and his girl friend went to St. Augustine beach because he felt that he would see a UFO there. He had been having flu-like symptoms but felt compelled to go. At 3:30 the two stood on the beach watching a blinking light move rapidly across the sky. They then witnessed a huge cigar-shaped craft estimated at 50 to 100 miles across, followed by four triangular shaped ones for one or two minutes, and then a series balls of light in different formations. The witness estimated about 40 to 60 balls were seen. All of the objects and lights were moving south to north all at the same speed near the Atlantic Ocean over the course of an hour. Many airplanes and helicopters were in the area, but seemed not disturbed by the objects. There were not reports in the morning papers about any of the AUPs. The next morning four or five whales were seen outside the hotel close to the beach. After the sighting the witness' flu symptoms had disappeared and he felt and slept well. Mary Margaret Zimmer FL ASD, FI"],"Viewing Distance":"Over One Mile","Log Number":"US-03012009-0004","Country":"United States","Sighting Duration":"01:00:00","Region":"Florida","Longitude":"-81.305148","Weather Factors":"Windy","Case Number":"15780","Date of the Event":"02/26/2009 08:45 UTC"}