{"Case Number":"15790","Tags":"City","City":"Aurora","Sighting Duration":"Undisclosed","Region":"Illinois","Object Features":"None, Wings","Latitude":"41.767325","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15790.html.txt","/var/www/straped/mufon/org/15790.html"],"Longitude":"-88.316792","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.767325,+-88.316792(15790)&iwloc=A&hl=en\"> mufon case (15790) map </A>","Log Number":"US-03022009-0009","Object Flight Path":"Hovering then path","Object Shape":"Blimp, Chevron, Other","Country":"United States","Date of the Event":"03/01/2009 12:00 UTC","trends":["There have been 7 other sightings in Aurora","There were no other sightings in Aurora on or around March 1st 2009"],"Date Submitted":"03/01/2009 12:00 UTC","Summary":"Saw flood light hovering over I-88 with airplane shape and no sound.","Disposition":"Insufficient Data","divs":["Sighting DetailsDriving home from NIU, heading east on I-88 between Rt. 47 and Orchard Road exits. I was driving, and had 17 yr old son in front passenger seat and wife in back right seat. Saw extremely bright white light hanging in sky from a mile away. As we approached, saw red and green lights to sides of bright flood light. Object was slowly drifting over the expressway. As we came closer, son opened window to have better look at object off to our right. Said it had common airplane shape, but was hovering at 100-150 ft. above ground. Wife said it had shape of triangular military stealth plane. No sound heard while windows open. When I looked briefly, I thought I saw shape of blimp with lights coming from gondola. Object seemed drifting slowly south. After passed it, I looked in rear-view mirror, and saw only small red speck of light, and no evidence of bright flood light. Wife and son saw same thing out back window. Light then disappeared. We were traveling at about 60 mph on expressway. Have never seen hovering object that large. Several vehicles traveling in both directions, but light traffic on expressway. All of us expressed surprise at oddness of sighting."]}