{"Date Submitted":"12/20/2008 10:45 UTC","divs":["Sighting DetailsAs I was walking out the front door looking into the southern sky, it was a clear day. I shielded my eyes from the sun with my hands as I looked up at a commercial jet contrail heading north across the sky. Then I saw 3 single jet contrails converging on a spot in the sky and when I looked at that spot, I saw a small disc in the sky slowly tilting. As it tilted it caught the sunrays and became very shiny and then began rippling and disappeared totally from sight. The 3 jets still converged on the disc location but the contrails slowly disipated and they no longer were visable. I immediately came into the house to call my brother-in-law and was talking to him about what I saw. I then heard helicopters flying over the house. He advised me to hang up as we would speak about it in person. I ran outside to see 2 plain black helicopters fly over. My brother-in-law said he could see the copters from his front door (he lives about 3 blocks away from me) and as we were talking about what I saw, one of the copters made a sharp turn and flew over his house. At that point we dropped the subject and hung up our cell phones. About two weeks later, I was talking with a neighbor in my living room about what I saw. He lives across the street from me. We talked for quite awhile on this subject, when we heard helicopters flying over my house again. We went outside to see 2 plain black helicopters fly over the house. Needless to say, we ceased talking about the subject again. I am beginning to believe.....THEY CAN HEAR EVERYTHING! That's what happened on Dec. 20th. I will never forget what I saw. Respectfully, David"],"Country":"United States","Longitude":"-84.622996","City":"Bronston","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Latitude":"36.985632","Object Features":"Unknown","Object Shape":"Disc","Summary":"Shiny disc in southern sky. 3 fighter jet contrails heading into it from different directions.","Date of the Event":"12/20/2008 10:45 UTC","Disposition":"Unknown","Region":"Kentucky","Tags":"City","Log Number":"US-03022009-0012","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15793.html.txt","/var/www/straped/mufon/org/15793.html"],"Case Number":"15793","trends":["There have been no other sightings in Bronston","This sighting has never been favorited."],"Source":"MUFON","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.985632,+-84.622996(15793)&iwloc=A&hl=en\"> mufon case (15793) map </A>"}