{"Date Submitted":"11/27/2008 12:00 UTC","divs":["Sighting DetailsI was on my way to Thanksgiving day dinner with 17 yr-old son in front passenger seat, 18 yr-old son in left rear seat, and wife in right rear seat. While on I-55 traveling northeast, past Lemont road exit, and toward Cass Av. exit where we going to turn off interstate, saw enormous, square object flying across interstate. All people in car saw it clearly. It appeared as if a giant piece of paper had been stood on its side. It had red stripes across it, but it was not a giant flag. It flew slowly, and never wavered from its solid shape. I had impression that it was two-dimensional, but others in car thought that it had depth along sides. Because it was bright out, saw no lights on object. It flew along roadway and then disappeared. I then looked to left and saw the same thing on north side of highway, well away from where object had disappeared. As we exited the interstate onto Cass Av. north, it flew away from us to the northeast and disappeared as well. All of us commented on how strange the sighting was. Traffic was fairly busy on the interstate in both directions. We were close by Argonne Nat'l Laboratory and old missile sites."],"Disposition":"Unknown","Object Features":"None","Date of the Event":"11/27/2008 12:00 UTC","Summary":"Two flat sqare surfaces flying.","Latitude":"41.748348","files":["/var/www/straped/mufon/html2text/15792.html.txt","/var/www/straped/mufon/org/15792.html"],"Log Number":"US-03022009-0011","City":"Darien","Tags":"City","Object Shape":"Square, Rectagular","Longitude":"-87.973794","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","Country":"United States","trends":["There have been 2 other sightings in Darien","There were no other sightings in Darien on or around November 27th 2008"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.748348,+-87.973794(15792)&iwloc=A&hl=en\"> mufon case (15792) map </A>","Sighting Duration":"Undisclosed","Region":"Illinois","Source":"MUFON","Case Number":"15792"}