{"Region":"California","Object Shape":"Star-like, Triangle","files":["/var/www/straped/mufon/html2text/15795.html.txt","/var/www/straped/mufon/org/15795.html"],"Object Flight Path":"Stationary","Log Number":"US-03022009-0014","Sighting Duration":"Undisclosed","Case Number":"15795","trends":["There have been 5 other sightings in Coalinga","There were no other sightings in Coalinga on or around February 26th 2009"],"Disposition":"Unknown","Object Features":"Unknown","Summary":"I was driviing sout on US 5 when I saw three triangles going east to west. This happened twice. I looked to my right and saw three lights.","Longitude":"-120.35196","Country":"United States","divs":["Sighting DetailsI was driving south on US 5 near Colinga, CA. Which is in the middle of no where. It was a dark might without moonligh. As I drove along I saw three small triangles in a vertical line. I assumed that they were silver-white reflectors on a large truck on an overpass. The went east to west and disappeared. I assumed they went behing a freeway sign. I didn't think much of it and then a few minutes latter I saw the same thing. They to were going east to west. But as they passed to my right the went up at a 45 degree angle and vanished. My reaction was, What the hell. When I got to where the vanished I looked to my right and saw three bright lights about the size of the full moon they were equadistant from each other and horizontal. The two outside lights were blue green and the center one was orange red. I don't know what my reaction was, maybe shock. I was driving at 70 miles an hour and had to look back to the road. Several seconds later I figured I should take a \"mental photograph\" of the light and look again to my right. The were still in the exact same position. I was covering 102 feet per second and the lights stayed even with my car. The were almost straight of to the right. Since there were no points of reference I have no true idea of how far away the lights were but I feel it was less than 100 yards. This really freaked my out and I turned back to my driving and put it out of my mind, I did not look to the right again. I had three cameras with me and I could have stopped for a picture, but I wanted nothing to do with what ever was behind those lights. That's my story and I am sticking to it. I might point out I drive this road three to four times a year for the past 27 years and have never seen anything like it before. I have no idea what it was and don't want to see it again."],"City":"Coalinga","map":"<A HREF = \"http://maps.google.com/maps?q=36.142938,+-120.35196(15795)&iwloc=A&hl=en\"> mufon case (15795) map </A>","Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"None","Date of the Event":"02/26/2009 10:00 UTC","Tags":"City","Date Submitted":"02/26/2009 10:00 UTC","Latitude":"36.142938"}