{"files":["/var/www/straped/mufon/html2text/15796.html.txt","/var/www/straped/mufon/org/15796.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.741724,+-88.636715(15796)&iwloc=A&hl=en\"> mufon case (15796) map </A>","Log Number":"US-03022009-0015","divs":["Sighting Details me and my twinn brother \"who passed away four months after\" were out about eleven at night just out driving on old back roads as we did almost every night.we were heading from town going east on backesburg road when we came up on spot where there are two bridges whithen 50 yards of each other and some fields for farming but no crops. and a tree line along the fields splitting the farm land . when we started coming to the bridges and the tree line we saw an awsome redish orange glow in the field floating i would say 15 feet in the air swaying only a little from left to right . i stoped the car never got out just sat there and was like awstruck.thirty seconds or so later the thing whent straight up in the air. when it did this it turned to the bluest butain color and left a streack of white lighte. i have told only a few people of this. i think it was a ufo. my brother thought it was a secret stealth fighter that was able to hover. but when it was hovering it wasnt horizontal like an airplane hovering it was standing strait up with one point at the top two at the bottom. thats why i thought it was ufo.its left me wondering what the hell is realy going on."],"Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Longitude":"-88.636715","Tags":"City","Object Shape":"Triangle","Country":"United States","Object Flight Path":"Hovering then path","trends":["There have been 3 other sightings in Mayfield","There were no other sightings in Mayfield on or around March 15th 1996"],"Case Number":"15796","Latitude":"36.741724","Sighting Duration":"00:00:30","Object Features":"Unknown","Summary":"It was the coolest thing I ever saw.","Disposition":"Unknown","Date Submitted":"03/15/1996 11:00 UTC","City":"Mayfield","Date of the Event":"03/15/1996 11:00 UTC","Region":"Kentucky","Source":"MUFON"}