{"Source":"MUFON","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around March 2nd 2009"],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Date of the Event":"03/02/2009 01:05 UTC","Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.442406,+-84.276303(15802)&iwloc=A&hl=en\"> mufon case (15802) map </A>","divs":["Sighting DetailsI was getting into bed at around 1AM, my window in my bedroom doesn't have blinds on it as it backs up into woodlands. As I was trying to go to sleep three lights kept catching my eye through the trees. At first I thought that they were planes, but as I watched them I noticed that the lights were quite strong and errie and that they moved whithout breaking their original formation. I got up to go look out of the window and looking reletivley straight up I saw three more points of light, they seemed to be rotating and keeping formation as if the points of light were fixed to the same object; I observed these two groups of lights for approx. 30 min. At this point I was getting a little freaked out and my heart was racing and my breathing was getting quick so I went to the kitchen to get some water, when I walked back to the window in my bedroom I started noticing more of the objects with the lights on them. At this point I decided I wanted to get a better look from outside, when I went out of my back porch I looked up to see numerous objects in every corner of the sky, there were two objects that looked very large and low in altitude compaired to the rest which were in varying smaller sizes (meaning higher altitude I thought). The number of the objects was impossible for me to count from where I was, if I had to estimate Id say there were at least 25+. I observed these until about 5AM which is when I fell asleep somehow (I hadn't been able to even sit still throught the whole thing and I had had work that night so I passed out on my couch while I was trying to calm myself down) and when I woke up two hours later at 7AM it was light out and they were gone"],"Longitude":"-84.276303","Log Number":"US-03022009-0020","Object Features":"Undisclosed","Region":"Florida","Disposition":"Hoax","Object Shape":"Triangle","Case Number":"15802","files":["/var/www/straped/mufon/html2text/15802.html.txt","/var/www/straped/mufon/org/15802.html"],"Weather Factors":"Unknown","Date Submitted":"03/02/2009 01:05 UTC","Summary":"50+","City":"Tallahassee","Latitude":"30.442406"}