{"Weather Factors":"Does Not Apply","trends":["There have been 9 other sightings in Meridian Charter Township","There were no other sightings in Meridian Charter Township on or around February 23rd 2008"],"Source":"MUFON","Longitude":"-84.401085","Case Number":"15804","Object Features":"None","City":"Meridian Charter Township","Object Flight Path":"Hovering then path","Disposition":"Unknown","divs":["Sighting DetailsI was laying in bed with my girlfriend and we just finished watching a Mothman documentary on YouTube on her laptop. I happened to look out my window to see the stars and I thought that I saw one of the stars move a little. I focused on the star that I thought moved and I could see it going back and forth, moving side to side. It's movement reminded me of a bee or humming bird hovering in front of a flower. It had a reddish tint to it, with flashing red, white and blue lights. I told my girlfriend, \"It's a UFO!\" We got out of bed to take a better look and she said \"Wow! It is a UFO!\" That's when I saw the second UFO. It looked exactly like the first, but it was far left of the first object and it performed the same bee-like movement as the first. I watched it for about ten minutes and then I began to comfort my girlfriend, because she was a little freaked out by the experience. She was scared about being abducted, but I was in awe. It was cool to actually see the UFOs up there doing their thing. I was in bed with her for about 20 minutes or so until she fell asleep. I checked the window and the UFOs were still there. I watched for a few more minutes, then I went to have a cigarette and collect my thoughts. I was a little spooked about what my girlfriend said about \"abduction\", because they were hovering about a thousand feet or more above of our apartment. She didn't want me to watch the UFOs too much for that reason. After the cigarette, I figured that she may have a point, so I decided to play a few games of NBA 2K9. I played for about an hour and a half, then check again, but the UFOs were gone by then."],"Latitude":"42.746979","files":["/var/www/straped/mufon/html2text/15804.html.txt","/var/www/straped/mufon/org/15804.html"],"Date Submitted":"02/23/2008 02:26 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Summary":"Two UFOs hovered above my apartment for about an hour.","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.746979,+-84.401085(15804)&iwloc=A&hl=en\"> mufon case (15804) map </A>","Log Number":"US-03032009-0001","Date of the Event":"02/23/2008 02:26 UTC","Object Shape":"Star-like","Region":"Michigan"}