{"Disposition":"Unknown","Longitude":"-77.423627","City":"Centreville","Case Number":"15807","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.845351,+-77.423627(15807)&iwloc=A&hl=en\"> mufon case (15807) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"11/30/1996 12:00 UTC","Date of the Event":"11/30/1996 12:00 UTC","Weather Factors":"Unknown","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Log Number":"US-03032009-0004","Summary":"I saw what looked like a star at first manuvering across the sky.","Region":"Virginia","Latitude":"38.845351","Source":"MUFON","divs":["Sighting DetailsMy roommate \"Frenchie\" and I were outside looking up at the airplanes taking off and landing from Dulles International Airport in Centreville, Va. While watching a plane fly over I happened to notice what at first looked like a star moving slowly across the sky. I said to my roommate \"hey check out that satillite up there\", he took notice and after a second or two the object began darting in a zig-zag type motion. It darted to the left then to the right and in a split second it darted unbelievably fast into the darkness and was gone. I think my friend and I were both speachless for a moment because we did not say a word for a few more seconds. He asked if I saw what he saw and I confirmed. This object was dimmer than the average star and looked as if it were beyond our atmosphere, but it was hard to tell exactly how far away it was. It was dark outside and the object had no detail, just a dim white light. Back then I didn't really know who to report this to, or where to go to share it, but I've had it with me all this time and I'm happy to finally get a chance to do so."],"files":["/var/www/straped/mufon/html2text/15807.html.txt","/var/www/straped/mufon/org/15807.html"],"trends":["There have been 5 other sightings in Centreville","There were no other sightings in Centreville on or around November 30th 1996"],"Country":"United States","Viewing Distance":"Over One Mile","Object Features":"Unknown"}