{"Case Number":"15805","Latitude":"41.633705","Object Flight Path":"Undisclosed","Summary":"Round disc with 10 circular lights on bottom.","trends":["There have been no other sightings in Walker Valley","This sighting has never been favorited."],"Log Number":"US-03032009-0002","divs":["Sighting Detailsi was on my way home from work last night, my girlfriend was driving, i was reclined in the passenger's seat looking at the sky. I was drawn to how clear the sky was since we just ended a big snow storm about two hours before. I saw a very bright light which i thought was venus but it rapidly descended to about 500 ft avove some distant trees and hovered there silently. almost immediately i could see what appeared to be the dark outline of a circular object which had approximately ten yellowish lights in a circular pattern on its underbelly. i estimat that the object was about 100 feet across. I have never seen anything like it. We actually stopped to watch it and in about three minutes the lights went out but you could still see the dark disc outlined against the sky. Ther was and intense burst of bright white light a moment later and the object seems to have vanished with the flash. We both had cell phone cameras but were to mesmerized to snap any pics. after it vanished I called my father to tell him what i had just witnessed before we even started the car back up! I felt like I had just been in a sci fi movie! by far the strangest thing i have ever seen!"],"Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/02/2009 08:30 UTC","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/15805.html.txt","/var/www/straped/mufon/org/15805.html"],"City":"Walker Valley","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.633705,+-74.377932(15805)&iwloc=A&hl=en\"> mufon case (15805) map </A>","Tags":"City","Object Features":"Unknown","Weather Factors":"Unknown","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/02/2009 08:30 UTC","Longitude":"-74.377932","Region":"New York"}