{"Source":"MUFON","Object Flight Path":"Path with directional change","City":"Atlanta","Summary":"Abroad AirTran flight #693 from Sarasota to Atlanta, saw lights on ground from 30,000 feet.","Sighting Duration":"Undisclosed","Date Submitted":"03/02/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/15808.html.txt","/var/www/straped/mufon/org/15808.html"],"divs":["sighting detailsmy husband and i were seated in seats 23a and 24a. i was watching the normal city\\town lights on the ground almost under the plane when i saw what i can describe as a \"flashlight\" type of light on the ground. it ranged from a smallish circular light to a wide moving \"splash\" of light. it appeared and then disappeared. changing positions and sizes for several minutes. i could not discern any pattern. it was a very random display. my husband saw it. he thought it might be a light from the plane catching a few small clouds below us. the sky was very clear. i could see planets and other planes flying all the time. could it have been from the plane? i could have thought so if it had been a light that stayed the same, but it moved randomly and varied in size and shape. (like clouds?) it was a white light. very strange. we fly only occasionally, so i'm not an expert on moving ground lights viewed from 30,000 feet! but i did think i was viewing something unusual. maybe what i saw from the plane could be matched up with something viewed from the ground."],"Longitude":"-84.379222","map":"<A HREF = \"http://maps.google.com/maps?q=33.757965,+-84.379222(15808)&iwloc=A&hl=en\"> mufon case (15808) map </A>","Viewing Distance":"Unknown","Log Number":"US-03032009-0005","Latitude":"33.757965","Object Shape":"Unknown","Case Number":"15808","Weather Factors":"Unknown","Country":"United States","Date of the Event":"03/02/2009 12:00 UTC","Object Features":"Unknown","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around March 2nd 2009"],"Disposition":"IFO","Region":"Georgia","Tags":"City"}