{"divs":["Sighting Detailsi was heading north on rt 31 into crystal lake at about 4:45am. i looked to my left and saw beams of white light coming from the sky to the ground. the best way to describe what i saw would be like bright white search lights they use for a grand opening only if they were in the sky pointing straight down and not moving. there were about 10 light beams i saw they looked to be over an area that had just houses. there was one light that flashed a few times as i was watching it looked like lightning only the way it flashed and the color but it stayed a beam. also i saw what looked like when the sky is cloudy and the sun breaks thru and you see the rays of sun come down but it didnt go allthe the way down. it really looked there were light sources in the clouds that caused the rays cause i saw the ray go down and up from the clouds. i am not alone in seeing this event i was on my way to work when i say it. when i got into work 2 guys came up to me and asked if i saw the lights also. i said yes and we all saw the same thing pretty much but we came different ways to work. so as the day went on i talked to a bunch more guys at work and i found almost 20 different people coming from different directions that all saw pretty much the same thing and i know there is more this was very bright and alot of people were on the way to work. its should be with in radar range from a small airport"],"Weather Factors":"Snow, Light","Viewing Distance":"Unknown","Date Submitted":"03/02/2009 04:45 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/15801.html.txt","/var/www/straped/mufon/org/15801.html"],"Disposition":"IFO","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.242414,+-88.309986(15801)&iwloc=A&hl=en\"> mufon case (15801) map </A>","Tags":"City","Source":"MUFON","Log Number":"US-03022009-0019","City":"Crystal Lake","Case Number":"15801","Summary":"Beams of light and rays of light.","Longitude":"-88.309986","Region":"Illinois","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Crystal Lake","There were no other sightings in Crystal Lake on or around March 2nd 2009"],"Object Shape":"Flash, Other, Unknown","Latitude":"42.242414","Date of the Event":"03/02/2009 04:45 UTC"}