{"Date of the Event":"03/02/2009 06:55 UTC","Country":"United States","Date Submitted":"03/02/2009 06:55 UTC","Object Shape":"Star-like","Disposition":"Unknown","divs":["Sighting Details I was looking out of my East facing patio and noticed a \"moving starlike object\" E of my home and approx 55 degrees off of the horizon. I logged onto ISS Tracking and confirmed this was not the ISS, as the station was above the South Pacific at the time. I went outside and watched with binoculars as it reflected sunlight brighter and brighter, I quickly went to get my phone to call Judy Varne, MUFON, to bring her attention to it. As I was trying to describe location to her, the object, which was moving in a non-ballistic manner northward, slowing and speeding up, suddenly appeared to grow smaller and smaller and quickly disappeared from view. It appeared to be moving quickly away from earth space towards the direction of the Big Dipper, as the stars were becomming visible in twilight. At it's brightest the object was brighter than Venus currently is in the west at sundown. The sky was still in twilight and this ocurred between 6:55pm and 6:58pm. I also noticed a circumpolar satellite at the same time as the object disappeared, much dimmer heading N until it disappeared from view."],"Summary":"Reflective object above atmosphere, satellite appearance brighter than Venus.","Region":"Arizona","Longitude":"-111.449707","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 3 other sightings in Gold Canyon","There were no other sightings in Gold Canyon on or around March 2nd 2009"],"Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change,Other","City":"Gold Canyon","Object Features":"None, Unknown","Tags":"City","Case Number":"15813","map":"<A HREF = \"http://maps.google.com/maps?q=33.368454,+-111.449707(15813)&iwloc=A&hl=en\"> mufon case (15813) map </A>","files":["/var/www/straped/mufon/html2text/15813.html.txt","/var/www/straped/mufon/org/15813.html"],"Latitude":"33.368454","Weather Factors":"None","Sighting Duration":"Undisclosed","Log Number":"US-03032009-0010"}