{"Country":"United States","Object Flight Path":"Stationary","Summary":"Flashing row of white lights with a larger constant white light below the flashing lights.","divs":["Sighting DetailsAround 9pm I went out on the front porch of my house to bring in my dog. I looked to the east and saw these flashing white row of lights above the tree line. It caught my attention because there are no lights in this area. I have lived in this house for more that 15 years and know my surroundings very well. It was very dark outside with scattered clouds, and I could not make out a shape of this object. I continued to watch and observed that below the flashing row of lights there was a bright white light that was centered in the middle. This object was not moving, not making a sound, but the row of lights were constantly flashing. I wanted to go inside to get my camera, but I continued to watch for approximately 5 more minutes. Then I began hearing the sounds of jet aircraft approaching. That is when the lights just vanished. I waited for a few more minutes to see if the lights would return, but they never did. At no time did I feel frightened, but I really would like to see them again and figure out exactly what it was that I saw."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=35.536156,+-100.959871(15811)&iwloc=A&hl=en\"> mufon case (15811) map </A>","Disposition":"Unknown","Tags":"City","Latitude":"35.536156","Sighting Duration":"Undisclosed","Region":"Texas","Log Number":"US-03032009-0008","Object Shape":"Unknown","City":"Pampa","Longitude":"-100.959871","Date of the Event":"03/02/2009 09:00 UTC","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/15811.html.txt","/var/www/straped/mufon/org/15811.html"],"Viewing Distance":"Unknown","Case Number":"15811","trends":["There has been one other sighting in Pampa","There were no other sightings in Pampa on or around March 2nd 2009"],"Source":"MUFON","Date Submitted":"03/02/2009 09:00 UTC"}