{"Sighting Duration":"01:00:00","Date of the Event":"03/02/2009 07:30 UTC","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Case Number":"15810","trends":["There has been one other sighting in Vidalia","There were no other sightings in Vidalia on or around March 2nd 2009"],"Latitude":"32.217686","Summary":"Really bright white light.","map":"<A HREF = \"http://maps.google.com/maps?q=32.217686,+-82.413461(15810)&iwloc=A&hl=en\"> mufon case (15810) map </A>","divs":["Sighting DetailsAt 730 pm on March 2nd 2009. My brother and I were driving westbound on Interstate 16 from Savannah to Macon when a really bright white light appeared in the sky. It came out of nowhere and this thing was bright, I mean really bright. It appeared, then disappeared, then reappeared and stayed stationary in the sky for exactly one hour. I work in aviation so I know what we saw was not a plane, helicopter, planet or whatnot. There had to be a ton of people see this, including truckers that were driving westbound also. It just stayed there directly in front of us for an hour. Right before it disappeared, it flickered red and was gone. I found this website because I wanted to see if there was anyone else out there that saw this light too. My brother was skeptical for a while, then after about a half hour of it just staying there, he finally said, thats weird. What was strange is that it did not get any closer or further away it seemed. But it was stationary, just following the road you could see it. I did not know what to feel really. It was just something I have never seen before. It was weird, just plain weird."],"Date Submitted":"03/02/2009 07:30 UTC","Region":"Georgia","Object Shape":"Other, Unknown","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/15810.html.txt","/var/www/straped/mufon/org/15810.html"],"City":"Vidalia","Disposition":"IFO","Source":"MUFON","Longitude":"-82.413461","Country":"United States","Log Number":"US-03032009-0007","Tags":"City"}