{"Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.100501,+-83.287054(15817)&iwloc=A&hl=en\"> mufon case (15817) map </A>","Object Flight Path":"Stationary,Straight-line path,Path then hovering,Other","Date of the Event":"02/28/2009 08:53 UTC","Region":"Michigan","Date Submitted":"02/28/2009 08:53 UTC","Object Shape":"Chevron, Triangle","Latitude":"42.100501","trends":["There have been 2 other sightings in Flat Rock","There were no other sightings in Flat Rock on or around February 28th 2009"],"Source":"MUFON","Log Number":"US-03032009-0014","Longitude":"-83.287054","Tags":"City","Object Features":"Unknown","City":"Flat Rock","Summary":"I saw it in the west just south of Metro Airport approx. 5000 Ft. and approx. 3000 Ft. and approx. 1500 Ft.","files":["/var/www/straped/mufon/html2text/15817.html.txt","/var/www/straped/mufon/org/15817.html"],"Case Number":"15817","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"IFO","divs":["sighting detailsi tryed this report last night and kept getting knocked off i hope this works! on feb 28th iwas going to cvs drug store heading west at appox. 8:30 pm. i saw a bright object that at first ithought was a low star, then i said to myself that it was too low for a star, and i hoped it would still be there when i got back home. i got home and looked just south of metro airport and the object was still there,so i grabbed my 10x750 binoculars and gave it a look,it took a moment to get it focused and then i coul just make out 2 red lights on either side of a white light.i watched for appox. 20 minutes and went in the house. i came back out at 10:15 pm and the object was still in the same location except it had dropped down lower. i watched for appox. 10 minutes and i could better make out the red lights and could just see blue green lights with the red. then i went in the house for awhile.i came back out at at appox. 11pm and the object had dropped to where i could just see it over the roof tops. i went in and came back out at midnight and object was gone. march 1st i came out at appox.7:30pm and the object was back at appox. the same location except it was further south by appox. 3-4 miles, this time i had my 65 year old neighbor come take a look to see what she thought, she was shaken by it. i calmed her down and she was ok.we watched for appox. 1\\2 hour it was very cold, so i went in she kept watching through her kitchen windowat about 9:30pm she let me know it had dropped, i told her that was s.o.p at appox. 10;pm she called to say it had dropped from sight. i went out and checked and it was visible from the end of my drive way. i let her know it was still there. at appox.12 midnight i went out and did'nt see it in the west, so iscanned the sky with my naked eye, in the south west i saw a low twinkle, so ilookd through my binoculars, and ther was my buddy, but this time it was turned so i could see it was chevron shape, with red blue\\green and white lights down the sides. march 2nd 1:21 am looked s\\w and did not see it, so i scanned the sky and saw him setting in n\\w appox 20mi. n\\w of metro,it still lokked like a twinkle. the only time it seems to be bright white is when it's almost a front veiw. getting sore, will talk more about night of march 2nd. i have l5\\s1 pinched nerve can't set long. will contact after i check tonight march 3rd d.a.b."]}