{"Date Submitted":"03/03/2009 06:59 UTC","Disposition":"Unresolved","Viewing Distance":"Over One Mile","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.110304,+-88.03424(15822)&iwloc=A&hl=en\"> mufon case (15822) map </A>","Longitude":"-88.03424","Weather Factors":"Unknown","Region":"Illinois","trends":["There have been 3 other sightings in Palatine","There were no other sightings in Palatine on or around March 3rd 2009"],"Case Number":"15822","Object Shape":"Square, Rectagular","Source":"MUFON","Object Flight Path":"Path with directional change","Object Features":"Unknown","Latitude":"42.110304","Log Number":"US-03032009-0019","Date of the Event":"03/03/2009 06:59 UTC","Summary":"Square 4 white lights, blinking red strobe.","divs":["Sighting DetailsI'm guessing this is just an optical illusion, but who knows. I've lived near O'Hare Airport all my life, and I can tell what airplanes look like day or night. While driving Westbound as a passenger tonight, I saw out of my right window looking NE something that made me utter out loud \"what the hell?\" I saw four white lights in a perfect square with a red strobe near the rear section of the craft. The craft turned, and then it looked like three lights close together. I'm guessing it may have still been a commercial jet, but I've never seen an angle which could make a jet appear as four lights in a perfect square. I believe it was traveling Eastbound or slightly ENE, and if it was a regular jet, my guess at the altitude puts it at 2-3,000'. I have my doubts it's anything unusual, and I'm sure there's a logical explanation. Perhaps the pilot activated a rarely used light by accident, giving the appearance of four lights. My mother was also a passenger in the car, and saw it too, asking if I saw the \"double decker plane.\" I asked if she saw a square shape of lights too, and she did. We passed by some trees and I lost visual contact. Also, I didn't notice any directional lights (red and green) on the wingtips that planes usually carry. Weather conditions, cold, about 28F (in dash thermometer) and overcast, with a fairly high ceiling."],"City":"Palatine","files":["/var/www/straped/mufon/html2text/15822.html.txt","/var/www/straped/mufon/org/15822.html"],"Tags":"City"}