{"Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","trends":["There have been 13 other sightings in Newtown","There were no other sightings in Newtown on or around May 31st 1982"],"Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"05/31/1982 12:00 UTC","Summary":"I saw the same craft, or one that looked the same, on 2 occasions. Once hovering over the Delaware River next to the Washington Crossing State Park, as I crossed the bridge. This was in May. Another time, it was hovering over an empty field in Pa.","map":"<A HREF = \"http://maps.google.com/maps?q=40.230791,+-74.914819(15821)&iwloc=A&hl=en\"> mufon case (15821) map </A>","Longitude":"-74.914819","divs":["Sighting DetailsWe had been seeing lights in the sky, and aircraft shaped like triangles for a few weeks. They seemed to fly in pairs, circle around and pass each other, and they would flash their lights in some type of a code as they passed each other. Me and my friends would drive around, or sit outside in a field to look for them at night. Then, one night around 3:00 am, I was riding over the Delaware River on the Bridge that goes thru the Washington's Crossings State Park, and I saw a silver disc shaped object hovering over the river. It was like a saucer, but raised up in the middle (like a dome). It was not the triangle shaped craft we had been seeing. Anyway, it had no windows, no lights, but it was solid silver and it rotated as it hovered there in one spot. It was silent. I stopped, sat on the bridge and stared at it, then drove away. It was above the water, almost level with the bridge. I told no one, and I wished I had. So, now I want to share the whole story with someone. I felt no fear that night, I was curious and excited. I began going out at night and driving around that area, trying to see it again. I would see the lights as I described in the beginning of this story, flying over deserted areas in Pennsylvania, and I tried to follow them. Most of the time I just drove around, hoping to see something. Then, one night about a month after the river sighting, I was coming around a bend in a lonely area in the Washington Crossing Area, I think near Yardley. And, as I turned the bend, I saw the silver disc, hovering silently over a field. I hadn't noticed it until I rounded the bend, because it was closer to the ground then the tops of the trees. It was just hovering there. I stopped and put the car in park, and stared at it. It just sat there spinning silently and so did I, for awhile or so it seemed. Then, all of a sudden lights came up in back of my car, really bright lights and I got scared. I thought it was the police (I was sitting alongside a road) I thought I would be in trouble for sitting there like that. Then, a thought filled my mind \"We're not the police, we won't hurt you\" I know this sounds crazy, but I heard this in my mind. A few men were now swarming the car. They opened the back doors, and my passenger side door. (Yes, I was driving around on lonely roads that night with all of my doors unlocked). The man who came in from the passenger side had blonde hair. He looked normal. I felt no fear, it was like I was numb or in a trance. It all happened so fast. He gently reached over and turned the keys in the ignition and turned off the car. I looked out at the field to see if the silver craft was still there, and someone was walking towards me from it. I didn't see him actually get out of the ship, but he was directly underneath of it, then he began to walk to the car. The other men seem to have come up on the car from behind it, but this man came from the direction of the silver craft. He wore the same tan pants and shirt that the man in the front seat of the car wore. Only, he looked like a human bug. That is the only way I can describe it...like a praying manthis. He had a face and a head like a praying manthis, but yet he had a body almost like a human and was wearing clothes. His arms seemed too long, but his hands were normal. He gently opened my car door, and put his hand on my arm and led me out of the car. It was all so gentle, they were very calm and nice. No rough treatment. I remember starting to get out, and I felt no fear. That's it. I don't remember anything else. The next thing I know, I am sitting in my car, parked by the side of the road. The car feels cold. I looked, and the silver craft is still just hovering there silently and spinning. I turned the car on and drove off. I continued to search those roads at night. I felt an intense longing to see the craft again. That was the most important feature of this whole story, that I felt such a longing to find the craft. From the night I saw it over the river, I felt I needed to find it. Anyway, I never saw it or the other lights again. I got tired of looking after awhile and stopped. In 1992, when my daughter was a baby, her and I shared a bedroom together in my parents house. I was a single mom. One night I had a dream, or maybe this really happened. I don't know, but I want to include it here. I believe it really happened. I woke up and the room was flooded with bright light. I was paralyzed, pinned down to the bed and couldn't move. I knew they were outside, intuitively, and I heard those voices in my mind like the night on that lonely road. They were discussing taking me somewhere, but couldn't because of the baby. I heard \"Oh, she's got a child now. We can not take her and leave it unattended\" and the idea filled my mind that the baby needed to have a mother with it at all times. Then the light left, the room was dark and I got up and went over to check on the baby. I have never had another experience with this type of thing since then. Thank you for taking the time to read this. I have never told anyone and it feels really good to be able to share it."],"Case Number":"15821","Log Number":"US-03032009-0018","Object Shape":"Disc, Triangle","Latitude":"40.230791","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Date of the Event":"05/31/1982 12:00 UTC","Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/15821.html.txt","/var/www/straped/mufon/org/15821.html"],"Region":"Pennsylvania","Country":"United States","Object Features":"Undisclosed","City":"Newtown"}