{"Date Submitted":"03/03/2009 11:45 UTC","Latitude":"40.332328","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around March 3rd 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/15829.html.txt","/var/www/straped/mufon/org/15829.html"],"Country":"United States","Object Shape":"Boomerang","Longitude":"-75.030447","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=40.332328,+-75.030447(15829)&iwloc=A&hl=en\"> mufon case (15829) map </A>","Source":"MUFON","City":"Doylestown","Date of the Event":"03/03/2009 11:45 UTC","Object Flight Path":"Undisclosed","Log Number":"US-03042009-0004","divs":["sighting detailsi was sitting at my home office desk on the computer and watching tv. it was 11:45 pm and there was a bright moon outside. there is a large window next to my desk with a view of my back yard (about 20 acres). very bright lights (almost like car highbeams) in the sky approaching my house caught my eye (peripheral vision) and i assumed it was a plane but given the late hour and the intensity of the lights, i went out the door next to the window even though it was about 18 degrees outside. i stood outside in awe as the object flew right over my head. it was going relatively slow and was somewhat low and the shape reminded me of a combination of a stealth plane and the concord. the odd thing was how silent it was and how mesmerizing the lights on the gray colored underbelly were. they were like strobe lights flashing lightning fast in a pattern and in white and blue\\green i think. a couple of seconds after it passed by, i could hear a low, quiet and steady engine buzzing sound. i was a bit frightened and excited at the same time and recall thinking that this is no plane i have ever seen or heard of -- and i have been to many air shows. i ran through the house to get to the front door and went outside. i saw it pass over my front yard and gain altitude and then i realized it was meeting up with at least two other identical crafts. suddenly there were three of them circling around each other in the distance. they were just flying around and periodically passing each other. i woke up my husband to show him and got out my binoculars. i could see that all three crafts were identical with the unique flashing strobe lights. they weaved and circled in no real pattern. when they were coming directly at my house, you could see the bright white \"headlights\" but when they turned, you could only see the strobe lights. they were close enough that we should have heard the engines if they were regular planes - but it was silent. i watched for a long time (over 30 minutes) as the crafts circled the area. i think they may still be out there in the general area and it is 2:00 am. they are higher in the sky but with the binoculars i can confirm them easily. at this point, i prefer to think that they are gone. i don't think i will be able to sleep tonight."],"Weather Factors":"Unknown","Summary":"Saw very bright lights in sky from house window. Went outside and it flew overhead. It was very quiet and had strobe flashing lights on underbelly.","Region":"Pennsylvania","Case Number":"15829","Viewing Distance":"Unknown"}