{"Tags":"City","Object Shape":"Circle","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around March 3rd 2009","This sighting has never been favorited.",""],"Date of the Event":"03/03/2009 08:15 UTC","Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15823.html.txt","/var/www/straped/mufon/more/15823_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/15823_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/15823_submitter_file3__UFO6.jpg","/var/www/straped/mufon/org/15823.html"],"Object Flight Path":"Stationary,Unknown","Latitude":"41.1086","Region":"Ohio","Summary":"While driving home I notice the bright light that didn't move...I got out the car and watch it for a while then took pictures ..the pictures showed more than I could see.","map":"<A HREF = \"http://maps.google.com/maps?q=41.1086,+-80.644199(15823)&iwloc=A&hl=en\"> mufon case (15823) map </A>","Case Number":"15823","Object Features":"Undisclosed","Log Number":"US-03032009-0020","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","City":"Youngstown","divs":["Sighting DetailsWhile riding home from the store at about 8:15 pm est ...I notice a bright light in the sky ... Looking at my sister i laugh and said here we go again ... We had seen this before about thirty years ago ...I got out the car and ran to get my camera. My Granddaughter yelled they moved.... I took four shots of what I thought was one object... when I downloaded them I saw there were two large ones... I looked for the moon to make sure it was not what I saw but the moon was behind me and it was cresent moon these things were completely round. I watched for a while when I went in the house about 15 mins later to down load the pictures ...I went back out 15 mins later and they had move slightly, after an hour they were gone. The photos show two although I could only see one with the naked eye. They were very bright withthe naked eye but through my camera the glare disappeared. I was a little excited because it had been thirty years since the last time I saw them and this would be the first time I actually got a picture."],"Date Submitted":"03/03/2009 08:15 UTC","Longitude":"-80.644199"}