{"Date Submitted":"01/10/2009 12:00 UTC","Tags":"City","Country":"United States","Region":"South Carolina","Source":"MUFON","Disposition":"Insufficient Data","Sighting Duration":"03:25:00","Weather Factors":"Unknown","Latitude":"32.778876","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around January 10th 2009"],"Object Flight Path":"Undisclosed","Case Number":"15833","map":"<A HREF = \"http://maps.google.com/maps?q=32.778876,+-79.921062(15833)&iwloc=A&hl=en\"> mufon case (15833) map </A>","City":"Charleston","files":["/var/www/straped/mufon/html2text/15833.html.txt","/var/www/straped/mufon/org/15833.html"],"Object Shape":"Disc, Unknown","Longitude":"-79.921062","Summary":"We've all seen what a cloud looks like? Right? A cloud with something in it, shaped like a fat saucer, with chrome edges, floating in a cloud, a stormy gray silver unlike a real cloud.","Viewing Distance":"Unknown","Date of the Event":"01/10/2009 12:00 UTC","Object Features":"Undisclosed","Log Number":"US-03042009-0008","divs":["Sighting DetailsCharleston harbor, on the james island connector. Went to pick a friend up from his work downtown, my son and i took the trip...noticed a strange cloud all by itself unlike a storm cloud this one came overhead and parked itself right over the battery park...heh...it was huge easily larger than downtown charleston proper...it wouldnt be all that unusual to see a rain type cloud over us, really but it was a beautiful sunny afternoon, no clouds pretty clear. i watch the air traffic around here and it seems pretty normal and patterned. i was in the military during the gulfwar and worked with many aircraft. its a fascination! my son shares the same fascination ...so you can imagine our surprise...we said nothing to each other about it really. on the way back from downtown, we drove up the connector, and i asked my friend and my son if the weird cloud is still there, as i was merging and couldnt take my eyes of my mirrors...driving safe ya know! i got situated and looked up to see... well...its now kinda obvious from this angle thats there IS something in that dark smokey gray cloud, it appears to have a saucer with a rather huge chrome frontend.very thick maybe 200 feet thick tall and a square half mile in diameter..but the cloud seems to be drafting and produced a rolling smoky front edge...weird kinda gave away its \"cloak\" we all were totally glued to it...i had to pull over. i couldnt, traffic was mad that day...we went home...we dont talk about it, but i know we are being visited...it could be one of ours...or...."]}