{"Longitude":"-78.386682","divs":["Sighting DetailsI was letting the cat in and saw 2 very bright lights, one in front of the other flying toward me. They were going the same speed and rather slow so I thought they were connected and if they were this thing was massive. At the same time both lights turned into 2 lights, it was getting closer and closer. I yelled for my daughter to wake up, she grumpily came to look. We watched the first one fly past and behind the house but the second one turned on 4 more lights totaling 6 horizontal lights. Awestruck we watched this thing turn completely right on a dime, it was now traveling right towards us over head. All 6 lights then turned red. We watched as 5 red lights on a long rectangular shape thing fly overhead. I could make out a rectangle shape due to the illumination of the red lights. The speed was quite slow. After it flew over our heads I watched this massive rectangular strip of red lights fly over the nearby mountain. It was incridible. There was no noise at all. It was about 15 degrees crystal clear sky moon was crescent and behind the house. This thing came from the south east. What the hell were these craft."],"Latitude":"40.437225","City":"Hollidaysburg","map":"<A HREF = \"http://maps.google.com/maps?q=40.437225,+-78.386682(15845)&iwloc=A&hl=en\"> mufon case (15845) map </A>","trends":["There have been 5 other sightings in Hollidaysburg","There were no other sightings in Hollidaysburg on or around March 4th 2009"],"Date Submitted":"03/04/2009 09:27 UTC","Weather Factors":"None","Summary":"Long rectangle row of red and white lights on 2 craft.","Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","Object Features":"Undisclosed","Case Number":"15845","Date of the Event":"03/04/2009 09:27 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/15845.html.txt","/var/www/straped/mufon/org/15845.html"],"Sighting Duration":"Undisclosed","Region":"Pennsylvania","Object Flight Path":"Path with directional change","Log Number":"US-03042009-0020","Tags":"City","Country":"United States","Source":"MUFON"}