{"Object Shape":"Boomerang, Chevron","Date of the Event":"03/04/2009 05:50 UTC","files":["/var/www/straped/mufon/html2text/15843.html.txt","/var/www/straped/mufon/more/15843_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/15843_submitter_file2__ufo2.jpg","/var/www/straped/mufon/org/15843.html"],"Tags":"City","Object Flight Path":"Stationary","trends":["There have been 17 other sightings in Cambridge","There were no other sightings in Cambridge on or around March 4th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","Source":"MUFON","Viewing Distance":"101-500 Feet","City":"Cambridge","Summary":"Silver boomerang object, slightly shiny on right side, hovering high in the sky west of Cambridge, MA.","Log Number":"US-03042009-0018","Weather Factors":"None","divs":["Sighting DetailsI had just exited the T in Harvard Square, and turned the corner on to Mt. Auburn St., when a shine caught my eye. I looked up, and saw what looked like a silver boomerang totally still, high up in the sky. I blinked because I thought my eyes were blurry, then turned around and saw the moon and a star (below it) very clearly...I turned back around, and the object was still there. It stayed completely still, and was shinier on the right side than the left. An airplane came from behind where I was standing, and flew low and beneath it, and I slowly realized my eyes were not playing tricks on me...the object was absolutely still and remained in the exact spot, with a slight haze around it. At first, I thought it was my eyes that were blurry and I simply didn't believe what I was seeing. I turned around, checked my eyes, and returned to still see it, and stared in disbelief. I felt scared, overwhelmed and sad all at once. I thought I should call someone or grab a stranger and point it out, but it took me telling someone else about it to begin to realize how real it was. It took hours for the event to actually sink in, and it feels unreal. I drew a picture...I wish I could've captured it on film. I actually can't do justice to how I feel right now...I had to search for somewhere to tell someone, and found this site. After probably a minute and a half, I turned the corner to my apartment, and when I looked back to check and see if it was still there, it was gone. It was there, then it disappeared. This happened at twilight, a quarter to 6pm, in a clear, cloudless sky."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.37834,+-71.105413(15843)&iwloc=A&hl=en\"> mufon case (15843) map </A>","Country":"United States","Case Number":"15843","Sighting Duration":"Undisclosed","Longitude":"-71.105413","Date Submitted":"03/04/2009 05:50 UTC","Region":"Massachusetts","Latitude":"42.37834"}