{"Viewing Distance":"Over 1 Mile, Unknown","City":"Franklin","Source":"MUFON","Country":"United States","Longitude":"-68.230505","Region":"Maine","Case Number":"15844","Summary":"UFO appears and \"hides\" moves and disappears.","Disposition":"IFO","Object Features":"Unknown","Weather Factors":"None, Does Not Apply","Date of the Event":"07/27/1997 11:30 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","Sighting Duration":"04:00:00","Object Shape":"Sphere, Other","divs":["Sighting DetailsUFO is in sky far distant away it appears to be a star that changes color rapidly. I'm laying in bed in a loft at a friends house with large sky light above me i start watching this object move at first i thought it was a helicopter but it was making 90 degree turns then it moves up higher in the sky stops changes colors to look like star sat there for about 45 minutes then suddenly came lower down stopped and went back to looking like star again for about 15 minutes then slowly moved out of sight the way it moved was not in a strait line more like a drunk driver. few days later i went out in to a nearby sand pit and watched the sky and saw an object that was slowly changing color and was like making odd turns again it look as if it can not go in a strait line then it went out of sight. i could tell you more of these types of sighting if you want me to. i was wondering if you have heard anything about this sighting in Franklin me the first sighting i listed here was seen from the Donnel pond rd the other sighting was seen from thee Franklin sand and gravel pit off of the black woods rd mike"],"Date Submitted":"07/27/1997 11:30 UTC","trends":["There has been one other sighting in Franklin","There were no other sightings in Franklin on or around July 27th 1997"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.595788,+-68.230505(15844)&iwloc=A&hl=en\"> mufon case (15844) map </A>","Log Number":"US-03042009-0019","Tags":"City","Latitude":"44.595788","files":["/var/www/straped/mufon/html2text/15844.html.txt","/var/www/straped/mufon/org/15844.html"]}