{"Country":"United States","Object Shape":"Sphere","Tags":"City","Summary":"Stationary very bright light in the western sky after dark.","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Unknown","Disposition":"Unknown","Latitude":"37.3281","City":"Madisonville","divs":["Sighting DetailsI was driving West on the Western Kentucky Parkway leaving Central City, KY towards Madisonville, KY at 7:15pm CST, March 3,2009. This is about a 30 minute drive and the parkway is not well lit and very dark. I noticed a very bright light in the western sky. When I first noticed it, it appeared out of place. I thought that maybe it was a planet in the night sky however I have never seen a planet so low. As I watched the light I tried to see if it would move maybe being a helicopter or low flying plane. The object was not moving and appeared to hover the right side of the parkway. The light was as bright as a street light and rather large. This really got my curiousity up. I was traveling around 65 mph and could see it from the right side of my windshield. It never blinked or changed colors. About 15 minutes of watching this object it appeared to slowly change sides of the parkway. It then hovered on the left side of the parkway for a few minutes and returned to the right side. Watching the object as I drove, I noticed that it suddenly began to get smaller, smaller, smaller, until it disappeared in the sky. I couldnt explain what it was or what I had just witnessed. I had never seen anything like this before in my 50 years of life. It was odd enough to catch my attention and strange enough to keep me watching until it was gone. I felt very uneasy as I continued to drive to Henderson, KY. I watched the sky as I drove home but never saw the object again."],"Viewing Distance":"Unknown","Longitude":"-87.498888","Region":"Kentucky","trends":["There have been no other sightings in Madisonville","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.3281,+-87.498888(15840)&iwloc=A&hl=en\"> mufon case (15840) map </A>","files":["/var/www/straped/mufon/html2text/15840.html.txt","/var/www/straped/mufon/org/15840.html"],"Log Number":"US-03042009-0015","Source":"MUFON","Date Submitted":"03/03/2009 07:15 UTC","Case Number":"15840","Object Features":"None","Date of the Event":"03/03/2009 07:15 UTC","Weather Factors":"None"}