{"Date of the Event":"03/31/2006 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 2 other sightings in West Chicago","There were no other sightings in West Chicago on or around March 31st 2006"],"Region":"Illinois","Date Submitted":"03/31/2006 12:00 UTC","Viewing Distance":"Over One Mile","Case Number":"15857","files":["/var/www/straped/mufon/html2text/15857.html.txt","/var/www/straped/mufon/org/15857.html"],"Tags":"City","Longitude":"-88.203961","Source":"MUFON","City":"West Chicago","Object Features":"Unknown","Latitude":"41.884751","Object Shape":"Star-like","Weather Factors":"Unknown","divs":["Sighting DetailsI was in West Chicago attending the Severe Weather Seminar at Fermilab. We took a break at intermission, and stepped outside to stretch our legs(my girlfriend and I). We both noticed a bright light to the northwest of our position next to Fermilab. I thought that on this clear evening I could situate the object in one of the constellations; being an astronomy fan. The light was not one of the bright stars of Gemini, Taurus, or Orion. To my dismay, I looked back to find the light, and it faed down in size, as though it were departing at high speed, leaving only a small light in the extreme distance. My friend and I were wondering at what we had just seen, when we noticed the light had returned in the same position, just as bright as originally. As we continued to look and speculate (because I've been a long time UFO fan also.) The light receded in size once again; causing us both to gasp in dismay. In weeks following, I talked to my pastor (now deceased) who had been a longtime science teacher before becoming a minister. As a scientist, he considered himself a UFO skeptic, and he referred us to the planetarium, and the U of I astronomy dept. We received explanations of either Venus (I knew it wasn't.) satellites catching sunlight as they came over the horizon at that time of the evening (This object showed no progression across the sky, as other satellites I've seen.) or meteors. (I've seen many shooting stars in my 54 yrs. I just wanted to see if anyone else reported something during this same time period, only a few months before the famous incident of Nov. '06."],"Log Number":"US-03052009-0008","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.884751,+-88.203961(15857)&iwloc=A&hl=en\"> mufon case (15857) map </A>","Object Flight Path":"Stationary","Summary":"Bright light in northwest sky that suddenly reduced in size, only to reappear, and fade out again."}