{"Case Number":"15869","Longitude":"-117.993106","Log Number":"US-03062009-0003","City":"Huntington Beach","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/15869.html.txt","/var/www/straped/mufon/org/15869.html"],"Object Flight Path":"Path with directional change","Tags":"City","Object Shape":"Circle","Disposition":"IFO","divs":["Sighting DetailsWhile at work in a small warehouse where I often work outside, I was outside the bay door sitting on the forklift having a smoke. I saw something leaving a vapor trail in the distance so I focus on this object which I determined to be a military jet by its shape and speed, it was going extremely fast west to east. I was about halfway through my smoke so I continued and I saw another of the same aircraft on a slightly more southern trajectory same speed and vapor trial. I am for whatever reason more observant than most of the skies (I work in aerospace and find aircraft interesting) so I know what level and style of activity to expect in this area of sky. What I saw was odd so the southwest portion of sky had my full attention at this point, that is when I saw a white orb drop down from about 45 degrees above horizon and move in a parabolic curve in proportion to the letter 'J' and disappear, this appearace lasted about 20 seconds. About 10 seconds later I saw the same exact thing happen, orb appeared did a J move and vanished. The coloring was eggshell white, I can't say that it was glowing because it was a clear sunny sky but it was not reflective either, just white with some texture or faint shadowing. About a minute later 3 more jets were scrambled followed by a transport helicopter (double rotor) all west to east. I had to go back to work but I kept my eye on the sky the rest of the day and assorted military helicopters and insersecting vapor streaks in the sky, lastly black helicopters maybe 2 patroling near and far. At 11:30am a C130 was observed on a more north eastern path. It was an odd thing for me, as much as I was looking up during this time, to not see any commercial aircraft. The first commercial flight I saw starting at 10:45am was not until 1:30pm. This sighting took place between the John Wayne airport and the Naval Weapons station, closer to the station. The only sounds I heard were from the choppers. Only other thing I can think to say is about myself. I have perfect eyesight, never had to go to an optomatrist. I know I did not see a seagull or balloon or other common object. Father was in the military and worked aerospace (pan-am, sperry, honeywell). I am now in the aerospace industry, point being I'm above average in aircraft awareness. I have no evidence photographic or otherwise. So hopefully you can pull up radar stats or something from one of the nearby facilities or at least tell me someone else saw some of that activity. Please contact me via email, if you are interested I am willing to give you a call for phone interview. Thanks for caring"],"Source":"MUFON","Summary":"2 white orbs 10 seconds apart following same path and disappearing, military presence heavy surrounding.","Date of the Event":"03/05/2009 10:45 UTC","Country":"United States","Object Features":"Other","Region":"California","Latitude":"33.669707","map":"<A HREF = \"http://maps.google.com/maps?q=33.669707,+-117.993106(15869)&iwloc=A&hl=en\"> mufon case (15869) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"03/05/2009 10:45 UTC","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around March 5th 2009"]}