{"Longitude":"-75.485353","Weather Factors":"Unknown","Date Submitted":"10/31/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.6184,+-75.485353(15861)&iwloc=A&hl=en\"> mufon case (15861) map </A>","Object Flight Path":"Path with directional change","Log Number":"US-03052009-0012","City":"Allentown","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"15861","Viewing Distance":"Unknown","Latitude":"40.6184","files":["/var/www/straped/mufon/html2text/15861.html.txt","/var/www/straped/mufon/org/15861.html"],"trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around October 31st 2008"],"divs":["Sighting DetailsI know that people have been seeing star-like things very often because I've been reading the ufo stalker reports. Well, I beleive it was November. There was'nt any snow in a little while, which gave me a clue to what time it was. It was definitly 2008. Honestly, I don't remember what the day was, because I don't keep track of that. I was really angry at myself because of it. Me, My younger sister and my mother were getting out of our Toyota Bennet Camry. I think we came back maybe from my Uncle's house, not entirely sure. I was on my front porch and I was looking at the night sky admiring it's beauty. I looked at the moon, and then I saw the constellation Orion, I saw his belt, his legs and feet, and his body, and i believe i may have seen his head. I then noticed a star. This star was slightly larger than the others. maybe in finger comparison, less than a milla inch. Except, what caught my attention was that..... It was moving. I began staring at in awe. I thought to myself, \"what is that... Is it a...\" I thought it was a meteor at first. But from my knowledge, Meteors aren't blue. Then I noticed that it sortove left a white sortove misty trail behind. It wasn't completely covering the portion of space. I could lightly see black behind it. Then I began to believe it was a UFO. My Mother veiwed the object also. I only remember her saying, \"It does'nt seem like an airplace...\" She does'nt believe in extra terrestrials. I do though. I've believed all my live. I believe my sister was there, but she keep's saying she does'nt remember. I don't remember her saying anything about the object. I then went inside and began veiwing it with my 10 By 8 Binoculars. I noticed no features on it. No lines or arks. Then, It began moving in a backward direction. When it went over the mist, the mist began to dissappear. I began watching discovery channel, ( I don't remember what was on)mighte have been mythbusters, then after 1 episode was completed, i looked outside again, and the object was gone. I looked b=for it for about 7 minutes. After the expirenence I began having nightmares about seeing aliens, UFO's, being attacked by white beams of light, and skinny, tall being's with long fingers touching my forhead. I asked my Mother if i could take a picture of the object with her T mobile razor phone. She refused. Thank you for letting people be able to share their expirences with you. Please believe me on this one. I have no Mental or Phyisical poblems. I'm not insane. To be honest, I still attend a Middle School. I have nothing to gain by posting this."],"Summary":"A blue colored light slowly moving and leaving a trail behind in the night sky.","Object Features":"Other","Date of the Event":"10/31/2008 12:00 UTC","Disposition":"Hoax","Source":"MUFON","Region":"Pennsylvania","Object Shape":"Star-like","Country":"United States"}