{"Region":"Arkansas","trends":["There have been no other sightings in Morrow","This sighting has never been favorited."],"City":"Morrow","Disposition":"Unknown","Case Number":"15862","Sighting Duration":"Undisclosed","Latitude":"35.857677","Object Features":"Window(s), Other","Object Shape":"Disc","Log Number":"US-03052009-0012","divs":["Sighting DetailsDuring winter after christmas of 1967, I, my brother and a friend were deer hunting about 8 miles south of my parent's house, which is located at 19497 Buckhorn Camp Road, Prairie Grove, AR, 72753-9270. There was only a slight glimmer of pink color in the dawn sky. Me, my brother and friend were facing a small pond on a hill overlooking a 40 acre pasture directly south with a view of an area located as: North:35 deg.47'1.69\"N; South 35 deg.,45'33.95\"N; East: 94 deg.,22'29.25\"W and West: 94 deg24'17.40\"W (Google Earth Image Overlay). My brother said \"Look\" and we looked to the northeast (in the direction of the SEFOR breeder reactor). We saw a blue round \"energy field\" surrounding the craft and the field was tapering behind the craft to form a \"tear drop\" shape. As the craft passed in front of us, it flipped from the round side to the disc-shaped side. As the craft revealed its saucer profile, we saw another disc shaped craft directly below the one that we first observed and they seemed to be only 20 feet apart in formation (one in perfect order on top of the other). As the rotation was complete, the blue field ceased (as if turning off a light bulb). We could see features on the discs that appeared to be a sort of large \"windshield\" on front and a round window port on the top and another round window port to the area of the disc opposite of the side that the windshield was located. The discs flew about 200 feet over the treetops at the south end of the pasture directly to our south and then to the bottom of a small valley to our southwest. I believe the discs were traveling at 200-300 miles per hour. We saw a the blue field flash again as the discs appeared to make a landing in the valley (locals called the valley \"Possum Holler\" as this is a small valley about one mile northeast of an area on the topographic map named \"Odom\" on the Evansville Quadrangle, section #28 near Garrett Hollow). As I was telling my brother and friend that I'd like to go see where the discs landed, they were running toward the pickup truck and I became afraid too. When we got home, we told my dad about the UFO. He called the Air Force. The officer who answered the phone told my dad that what we saw could be a reflection of the moon off the clouds. My dad told the officer that it was new moon, so there was no moon. The officer said that maybe what we saw was an ignition of swamp gas. My dad told them that we are in the mountains and there are no swamps. The officer then said it may be a weather balloon and my dad told them that no weather balloon has a blue energy field that shuts off and on. My dad told the officer that he was just lying and making up stuff. The officer would not talk any more, so my dad hung up on him."],"Date of the Event":"12/26/1967 12:00 UTC","Summary":"Saw UFO, saucer-shaped, with companion saucer.","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.857677,+-94.436699(15862)&iwloc=A&hl=en\"> mufon case (15862) map </A>","Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"12/26/1967 12:00 UTC","Longitude":"-94.436699","files":["/var/www/straped/mufon/html2text/15862.html.txt","/var/www/straped/mufon/org/15862.html"],"Source":"MUFON"}