{"trends":["There have been 7 other sightings in Rising Star","There were no other sightings in Rising Star on or around March 5th 2009"],"Object Shape":"Undisclosed","Source":"MUFON","Date Submitted":"03/05/2009 07:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.103764,+-98.956381(15864)&iwloc=A&hl=en\"> mufon case (15864) map </A>","Case Number":"15864","Region":"Texas","Disposition":"Unknown","divs":["Sighting DetailsMy husband and I were sitting on our porch 5 miles north of Rising Star Texas watching the stars when an orange light appeared about 20 degrees off the horizon southwest of us. It shone for about 5 seconds, then disappeared and reappeared a short distance from where we first saw it. It then disappeared, and about 1 minute later we saw three lights close together south of where the other lights had been. It also shone about 5 seconds, then disappeared. About 5 minutes later we saw a series of twelve lights that appeared in sequence, each one blinking a split second from northwest to southeast angling down at 30 degrees and covered a distance of a mile and a half. That whole occurance lasted about 5 seconds. About 5 minutes later, we saw a series of 7 lights that blinked in sequence, but those were farther apart than the series of 12. They were north of where we saw the series of 12, and were moving from south to north on a horizontal plane. My husband is a private pilot, and is very familiar with aircraft lights and patterns of movement. He has seen mysterious lights similar to these from our house several times before, but this was my first sighting."],"Object Flight Path":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/15864.html.txt","/var/www/straped/mufon/org/15864.html"],"Object Features":"Undisclosed","City":"Rising Star","Date of the Event":"03/05/2009 07:45 UTC","Longitude":"-98.956381","Summary":"Orange lights appear then disappear and reappear.","Log Number":"US-03052009-0014","Latitude":"32.103764","Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Country":"United States"}