{"divs":["Sighting DetailsMy friends and I had my 8' dobsonian telescope out trying to do some star gazing. There were too many clouds to really see any stars so we decided to just sit around talking. We noticed a light in the southern skies that looked from the naked eye much like Venus. As an amateur astronomer I knew it couldn't be Venus. So I moved my telescope to the object, looking through it, it appeared as a strange teardrop shaped object with something hanging from the end of it. The teardrop shape was obviously on fire, you could see what appeared to flames covering the teardrop shaped part of the craft. It also looked as if from the teardrop shape extending downward was a very faint line of some sort with a solid red light attached to it. After looking at it for about 20-25 seconds while it was stationary it began to rapidly move away, I followed for about 3 seconds with the telescope and lost it, followed with the naked eye for about another 7 seconds before it completely dissapered. Planes could be seen in the area about 15 minutes after the incident, and this object was obviously not a plane."],"Date of the Event":"03/05/2009 10:35 UTC","City":"St Joseph","Disposition":"Unknown","Source":"MUFON","Log Number":"US-03052009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=39.763668,+-94.829779(15866)&iwloc=A&hl=en\"> mufon case (15866) map </A>","Longitude":"-94.829779","Object Features":"Undisclosed","Latitude":"39.763668","Region":"Missouri","Viewing Distance":"Unknown","Summary":"Bright stationary light naked eye, telescope blimp shaped object on fire with light at end.","Country":"United States","files":["/var/www/straped/mufon/html2text/15866.html.txt","/var/www/straped/mufon/more/15866_submitter_file1__SAGANUFO.jpg","/var/www/straped/mufon/more/15866_submitter_file2__WINSUFO.jpg","/var/www/straped/mufon/org/15866.html"],"Object Shape":"Teardrop","Sighting Duration":"Undisclosed","Date Submitted":"03/05/2009 10:35 UTC","Case Number":"15866","trends":["There have been 10 other sightings in St Joseph","There were no other sightings in St Joseph on or around March 5th 2009","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Stationary","Weather Factors":"Unknown"}