{"Longitude":"-94.576077","Date Submitted":"03/05/2009 07:30 UTC","Tags":"City","Summary":"Bright Light hovered in western part of sky for over 45 Min before fading out","Disposition":"IFO","Object Features":"Unknown","divs":["Sighting DetailsIt was unseasonably warm nite and very clear skys tonite in KC. I had been doing a project in the driveway until dusk and wanted my wife to take me for a quick drive around our neighborhood to see a house in the west part of our subdivision. As we drove around the block I Noticed a bright light with glow above in sky and figured right off it was airplane but after 30 seconds or so noticed it was not moving at all. The airport was in general direction however after several minutes it was noticed that the light did not move , blink or display characteristics of an airplane due to the length of time it was stationary. I had a number of minutes to grab my video camera and took over 14 minutes of footage. I made call to friend who lives about 10 miles west of me directly to look out back of his home and he immediately noticed the bright light above. He was a pilot in the Army and had several years experience flying helicopters. He was clearly moved by what he was seeing and could not find a legitimate explanation as to the light. I would not be suprised if several people and pilots flying into to KCI did not clearly notice this in the sky. It was clearly in out atmosphere and not a planet, star, comet, or satellite. It just stuck around for a long time and glowed in the sky. During filming , in the view I had a few airplanes come into same view screen as to clearly distinguish this was not a plane as the ones flying across the screen were clearly airplanes. After several minutes I stopped filming as I started to second guess that this was \"supposed\" to be there like a bright star or something. Then as I talked with other neighbors I continued to glance at the object and noticed it seemed to get lower in the horizon and fainter until it over about 2 minutes just faded out heading west. The weird thing is that if it was a star or planet or plane it just sat stationary in the sky for almost an hour before disappearing. I have video of the event but currently my camera battery is down. Will be glad to share it or upload at another time. Approx 14 mins of footage."],"Object Shape":"Sphere","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around March 5th 2009"],"Object Flight Path":"Hovering then path","Log Number":"US-03062009-0001","Case Number":"15867","City":"Kansas City","Viewing Distance":"Unknown","Latitude":"39.106406","map":"<A HREF = \"http://maps.google.com/maps?q=39.106406,+-94.576077(15867)&iwloc=A&hl=en\"> mufon case (15867) map </A>","Sighting Duration":"Undisclosed","Region":"Missouri","Country":"United States","Date of the Event":"03/05/2009 07:30 UTC","files":["/var/www/straped/mufon/html2text/15867.html.txt","/var/www/straped/mufon/org/15867.html"],"Source":"MUFON","Weather Factors":"Unknown"}