{"Case Number":"15877","Log Number":"US-03062009-0011","Object Flight Path":"Unknown","Country":"United States","City":"Kansas City","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/15877.html.txt","/var/www/straped/mufon/org/15877.html"],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Region":"Missouri","Source":"MUFON","Date of the Event":"03/05/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.101846,+-94.573017(15877)&iwloc=A&hl=en\"> mufon case (15877) map </A>","divs":["sighting detailsi saw it briefly. i wasn't near the object, but i was on a high point in kc and could see at least 30 miles in the direction of kci, and i, too, saw this anomaly. i would estimate the brightness of this object to be 3x that of venus. i was a passenger in a car, so i couldn't stop and observe this. at 30 miles away, it was on the horizon, and if it was near kci, it had to be at a decent height. i estimated it was south of kci, but without time to study it, i can't verify that estimate. it almost looked like a 'bar' of lights from my locale. i also would like to see the videotape just to verify this is what i also saw. it was near 9 pm, cst. i was near arrowhead and the k stadiums. it was at 10-11 o'clock from my position. and i also agree this was not a conventional airplane\\helicopter. the light was only 10 degrees above the horizon when i saw it, which is why i didn't ask to stop and observe this longer than i did. i assumed it was a helicopter with special lights....but if this thing was near kci, i don't understand what it was. kci is about 30 miles from my location. these distances, and heights (degrees above horizon) i can verify. and i also can verify this was not venus. it's at the 8-9 o'clock position at this point in time. submit the video, please!"],"Date Submitted":"03/05/2009 12:00 UTC","Weather Factors":"Unknown","Longitude":"-94.573017","Summary":"I also saw the event in KC","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around March 5th 2009"],"Latitude":"39.101846","Object Features":"Undisclosed","Tags":"City"}