{"Viewing Distance":"101-500 Feet","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/15885.html.txt","/var/www/straped/mufon/more/15885_submitter_file1__3-6-2009114725PM.jpg","/var/www/straped/mufon/org/15885.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.116176,+-79.186705(15885)&iwloc=A&hl=en\"> mufon case (15885) map </A>","Object Shape":"Other","Object Flight Path":"Path then hovering","Log Number":"US-03062009-0001","Latitude":"41.116176","Source":"MUFON","Summary":"2 coworkers saw a strange \"airplane\" hovering silently nearby and at a low altitude.","Date Submitted":"03/03/2009 02:30 UTC","Disposition":"Unknown","Longitude":"-79.186705","Country":"United States","divs":["Sighting DetailsTwo of my coworkers, a man and woman probably in their mid-50s, both said they saw a strange aircraft hovering at a low altitude along a state highway between Summerville and Hawthorn, Pennsylvania, around 2:30 p.m. on Tuesday, March 3. \"Bill\" said he was traveling south along State Route 28 toward our workplace in New Bethlehem and was passing through an open area known as the Shannondale Flats when he saw what he described as a strange \"plane\" flying low above the highway up ahead which appeared to be either about to crash or land in the open field to his left. Based on his estimate of his distance from the craft as it travelled toward him, it was probably about 20 to 30 feet from the edge of the highway and 100 to 200 feet off the ground when it stopped its descent and hovered stationary. Bill said the plane stopped dead, \"as if he had a stop sign.\" At that point, Bill's truck was nearly adjacent to the object's position alongside the road. His driver's side window was down and he could hear no noise coming from the vehicle. Bill slowed down but did not stop as he passed the craft, and he watched it in his rearview mirror as it hovered in the same position for several seconds. Just before he lost sight of it as he crested the top of a hill, less than a minute later, Bill saw the vehicle rotate to its right about 90 degrees, as if on a vertical axis. He was somewhat vague concerning the size, but I get the idea that the thing was about the size of a small- to medium-size airplane. The entire craft was dark gray with no apparent markings. Bill stated he didn't see any windows or cockpit, but the vehicle had at least two swept-back wings and two similar appendages that he said looked like they may have been wings also, although he wasn't sure. Bill also noted that the vehicle had an odd rear end, \"like it had a spoiler on it.\" \"Marcy\" was also traveling south along Route 28 at around 2:30 p.m. on her way to work, but she was a few miles behind Bill. She first spotted the same craft, or one similar to it, sitting stationary in the air low over the town of Summerville about a mile off to her left. Marcy described the craft as completely gray with \"rounded\" wings and a tail that was \"shaped like a T.\" She said that it's general shape was that of a strange-looking airplane, and it appeared to tilt slowly from side to side as it hovered. She noted that she found the sight \"kind of scary\" and wondered what it was doing there. Within about a minute, Marcy lost sight of the craft as she started up a hill. Then, when she reached the top of the hill, she again saw the same or a similar craft much closer hovering just a short distance ahead of her car and a ways off the road. I got the impression that the distance from her car to the craft at this point is about the same distance as the beginning of Bill's sighting, perhaps a little further away. Marcy also noted that she could not hear any sound coming from the vehicle. This view of the craft lasted less than a minute before Marcy lost sight of it due to hills and trees. On Thursday I brought in a picture of a couple different Harrier jets to work and showed them to both of the witnesses. They said the vehicle they saw didn't look like any kind of fighter plane they had ever seen and that it had no visible engines or propellers. I tried to locate pictures online of other vertical-takeoff or hovering planes, but was unable to find anything that matched the witnesses' description. If anyone can find something like that, I would be very interested to find out what this thing was. After talking to these people I have no doubt that they are describing, as best they can, some flying, hovering aircraft they actually saw on their way to work."],"Weather Factors":"Unknown","trends":["There have been no other sightings in Summerville","This sighting has never been favorited."],"City":"Summerville","Case Number":"15885","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Tags":"City","Date of the Event":"03/03/2009 02:30 UTC"}