{"divs":["Sighting DetailsAt 7:45pm I was driving west on Bell Road near 43rd Avenue in the city of Glendale when I noticed a low and very bright light in the western sky. It caught my attention because it was so bright and very large and viewable through the front windshield of my car. I continued to look at it as I drove to my home near Bell Road and 51st Avenue. It was low in the sky and appeared to be 5 to 10 miles in the distance, which I estimated to be near or over Luke Air Force Base. My wife was in the car with me and once we stopped in our drive-way, I retrieved my Nikon 8x40 binoculars and took a closer look. My wife has very poor vision (nearly blind in one eye) and she could clearly see the light. This light was enormous and extremely bright, much larger and brighter than any star I've ever seen. The light was stationary in the sky, but every few minutes I could see a different color within the bright white light (green, then red, then yellow) through my binoculars. I do not have a video recorder or would have recorded this event. As I stated, this light appeared to be within 10 miles of my home, but could have been closer or even further. The size of the light gave me the impression that it was closer than farther, and appeared to be at least 50 times larger than a normal star. The brightness was incredible, and had a slight cross-effect as I viewed it through my binoculars, and appeared to light the sky around it. It was so bright that it was clearly visible through the clouds. After about 10 minutes of staring at this light, I went inside and ate dinner. While eating I tried to apply logic to what I had seen, but I know there are no mountains close enough in this view to have been a airplane warning light. Also, this definitely was not any type of military aircraft that I know of simply because of the size and brightness, not to mention it was absolutely stationary for the entire hour I viewed it. Ten minutes later I was still curious and dumbfounded about this strange light, so I went upstairs to our game room to get another look. I turned out the lights in the room to get the best possible view and continued to be amazed at this stationary light. I also watched several airplanes fly through my field of vision and they were very easy to disscern as moving objects with flashing lights. At 8:30pm I booted up my laptop and started searching for MUFON, then settled on this site. Just before starting this report at 8:45pm I went back into my game room to view the bright light once more. At this point, the light was gone and there were no lights anywhere in the sky. This evening in the Phoenix sky there are scattered clouds, which are blocking views of most stars in the sky. This was the most perplexing light I have ever seen and would be shocked if other people did not witness this and report it."],"Object Features":"Unknown","trends":["There have been 52 other sightings in Glendale","There was one other sighting in Glendale on or around March 6th 2009"],"Region":"Arizona","Summary":"I witnessed a very bright light in the western sky from Glendale, AZ from 7:45pm to 8:45pm","Tags":"City","Date of the Event":"03/06/2009 08:15 UTC","Case Number":"15883","Longitude":"-112.177677","Log Number":"US-03062009-0016","files":["/var/www/straped/mufon/html2text/15883.html.txt","/var/www/straped/mufon/org/15883.html"],"Weather Factors":"Unknown","City":"Glendale","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Oval, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.545562,+-112.177677(15883)&iwloc=A&hl=en\"> mufon case (15883) map </A>","Object Flight Path":"Stationary","Latitude":"33.545562","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"03/06/2009 08:15 UTC"}