{"Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/1589.html.txt","/var/www/straped/mufon/org/1589.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.622456,+-117.670897(1589)&iwloc=A&hl=en\"> mufon case (1589) map </A>","Latitude":"35.622456","Date of the Event":"11/30/1983 12:00 UTC","Summary":"Diamond shaped extremely luminescent craft","Source":"MUFON","Country":"United States","trends":["There have been 11 other sightings in Ridgecrest","There were no other sightings in Ridgecrest on or around November 30th 1983"],"Region":"California","City":"Ridgecrest","Log Number":"","Viewing Distance":"101-500 Feet","Sighting Duration":"01:00:00","Object Shape":"Diamond","Date Submitted":"11/30/1983 12:00 UTC","Object Features":"Undisclosed","Disposition":"Unresolved","Longitude":"-117.670897","divs":["Sighting DetailsI was at home when we heard a report of objects over a police scanner.We wereunsure of what the objects were but they were very bright, it was suggested thatperhaps they were search lights from Helicopters.Ridgecrest is a fairly smalltown (About 4 miles across east to west), it adjoins a Naval Air Weapons TestingCenter.09We heard a call on our police scanner that unidentified objects had beensighted by the college on the eastern edge of town. About a mile past the eastedge of town.09My father and I drove towards the college along with several civilians andcity police.09When we reached the craft were they had made it down the mountain and wereheaded straight towards994 mountain. This route took them over main street and numerous homes. Theywere traveling slowly enough to be followed by cars and were about 1000 feet up.09The craft eventually moved into the Naval Base air space and the police wereunable to pursue them further.09My father was a communications specialist and did work on the communicationsrepeater atop B mountain so he had keys to all of the locked gates and clearancepasses as well. The front gate guards were watching the craft in amazement anddid nothing to stop us from proceeding. We started up the mountain on a windingroad. We could see the ships periodically as we turned towards them on theroad. They were making better time than us and when we came around one of theturns they were on the ground about 300-500 feet from us.09We sat for a while watching them and then headed up the mountain a ways sothat we could turn around and head home. We drove up the road for a very shortdistance to a turn out and when we came back down (less than 5 minutes) thecraft were no longer there.09After that we went back home and the next day we contacted a friend of thefamily who was on duty with the police that night and he said93It never happened.94 There was also no report of the incident in the news papers or from theNaval base that I am aware of.09The craft were extremely luminescent. The entire craft was bright white. Idon92t recall seeing any light sources. Simply that the entire craft was lit up(apparently from the inside). I could, however, make out the shape of it andcould see defining lines. They were diamond shaped except that the top half wasabout half again as long as the bottom. They were bright enough that whenstopped together on the mountain the entire side of the mountain was illuminatedlike daylight.09I could not make out landing structures when they were93landed94. They were rested on their lower point but nothing was holding them up. Also, I did not see any form of propulsion.09We did not know what they were but it was suggested to us at the time thatthey may have been helicopter search lights. Having viewed them at close rangefor an extended time I must disagree with this assumption"],"Case Number":"1589"}