{"Weather Factors":"Windy","Sighting Duration":"Undisclosed","Case Number":"15895","Summary":"Approx. 8 stealth black triangles flying very slow shining search lights on the ground.","Object Features":"Undisclosed","Date Submitted":"03/05/2009 09:15 UTC","Date of the Event":"03/05/2009 09:15 UTC","divs":["Sighting DetailsFirst these were not UFO's but interesting none-the-less. It was Thursday March 5th, 9:15pm. I was lying on the couch watching TV when all of a sudden a bright light shined through the windows behind the couch and I immediately heard the sound of jet engines but they didn't seem as loud as the normal fighter jets that buzz over from time to time. I could see that the light came from an aircraft in the sky so I jumped up and ran out onto the back deck and witnessed 8 stealth style aircraft flying in two's at approx. 600ft - 800ft going from south to north and following close to one another. They were huge so I'm assuming that they were bombers & not fighters. They were flying so slow that I couldn't believe that they could stay airborne at that speed but they were. It was somewhat windy that night. Winds were SW at approx. 15mph. One of the first pair that flew over had its search lights on searching the ground all over which incidentally is the one that shined the light on my location. The next pair that flew over only had their marker lights on as did the next two. One of the last pair to fly over had it's search lights on and was shining it all over the place like they were searching for something. They kept the same speed & altitude until they flew out of sight and they kept searching the ground. The very next day, friday, March 6, at around 5:30pm approx. 6 more stealth aircraft flew over except this time they were flying single at around 25 seconds apart at a very high altitude and were traveling from south to north. It may be normal but I thought that it was worth reporting. I witnessed a bunch of black unmarked appache helicopters 'searching' around here a couple of years ago as well as a couple of hueys(spelling?) and no I am not crazy. Have a good day and thanks for all that you do Larry Neff Pool, W.V."],"Source":"MUFON","Longitude":"-80.842998","Object Shape":"Triangle","City":"Summersville","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.28336,+-80.842998(15895)&iwloc=A&hl=en\"> mufon case (15895) map </A>","Region":"West Virginia","files":["/var/www/straped/mufon/html2text/15895.html.txt","/var/www/straped/mufon/org/15895.html"],"Log Number":"US-03072009-0009","Disposition":"Insufficient Data","trends":["There have been 3 other sightings in Summersville","There were no other sightings in Summersville on or around March 5th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Country":"United States","Latitude":"38.28336"}