{"Tags":"City","Source":"MUFON","Object Shape":"Fireball, Other","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.50313,+-73.272197(15898)&iwloc=A&hl=en\"> mufon case (15898) map </A>","Date Submitted":"08/23/2008 09:30 UTC","files":["/var/www/straped/mufon/html2text/15898.html.txt","/var/www/straped/mufon/org/15898.html"],"Object Flight Path":"Undisclosed","Summary":"Traveling eternal flying flame, silent, Southampton NY, 2 days after Tinley Park Sightings.","Latitude":"43.50313","Country":"United States","trends":["There have been no other sightings in South Hampton","This sighting has never been favorited."],"Region":"New York","City":"South Hampton","Viewing Distance":"Unknown","Case Number":"15898","Date of the Event":"08/23/2008 09:30 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving in Southampton NY one night going out in the Hamptons and as I was driving East on Route 27 and I noticed an orange glowing light approximately 1500-2000 feet high flying, and I know the date was 8-23-08 Saturday night at 9:30pm; glowing up straight ahead and moving towards me (northwest)while I was driving towards it (southeast) and there were many cars on the road. I pulled off the side of the road, got out of my car and watched this orange glowing object silently fly dirctly over me and I have to tell you that my eye sight is top of the line and I noticed no other structure aound this thing. It looked like a glowing basketball. Orange in the night sky. All the cars kept going by and I just stood off the side of the highway pointing at the object, alone, following its every move which was mostly going in one direction traveling around 30-40 mph is my guess. The only reason I am writing this now is because I am watching the History channel and they are talking about Tinley Park 8-21-08 which was the Thursday, 2 days before my sighting. I called my friend up that was supposed to go out with me and told her I witnessed an eternal flame fly by. I do want to express that I am a highly open minded person and I questioned everything about this object to myself. There was no wings, no shape other than a round orange glow, it was silent, it had no shine, no engine, no blinking lights, but it looked liked it had a mild twinkle on occasion, and I was able to see the sky back drop to confirm no wing shape nor any constructed vehicle. This was quite bazaar and I am still extremely puzzled about the other things I have witnessed my whole life that I really never yet to tell anyone. This date is blowing my mind. I witnessed this 08-23-08 2 days after The Tinley Parks Sightings. I can't believe I'm just putting this connection together 7 months later. Todays date is 03-07-09"],"Disposition":"IFO","Longitude":"-73.272197","Log Number":"US-03072009-0012","Object Features":"Undisclosed"}