{"Date Submitted":"03/05/2009 08:00 UTC","Region":"Arizona","Date of the Event":"03/05/2009 08:00 UTC","Summary":"4 different clusters of orange lights in the night sky.","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/15894.html.txt","/var/www/straped/mufon/more/15894_submitter_file1__DSCF1179.JPG","/var/www/straped/mufon/more/15894_submitter_file2__DSCF1192.JPG","/var/www/straped/mufon/more/15894_submitter_file3__bgrange_page1_image2.jpg","/var/www/straped/mufon/org/15894.html"],"Case Number":"15894","trends":["There have been 13 other sightings in Buckeye","There were no other sightings in Buckeye on or around March 5th 2009","This sighting has never been favorited.",""],"Latitude":"33.37237","Object Shape":"Fireball, Sphere","divs":["sighting detailsi have been seen these lights on 3 different occasions(2\\23\\09,3\\3\\09,and 03\\05\\09),this sighting was by far the strangest. in the night sky were four sets of lights. these lights were grouped in sets of two, three and four. the lights glowed intensely and would blink on and off in order. the set of four lights were moving south over buckeye toward the desert between i-10 and i-8. these four lights blinked off only once in a hour period of time(when 6 fighter jets from luke went toward them). as the jets reached the lights they went out one by one. they returned about two minutes later when the jets flew off. there were another two sets of three lights over i-10 to the west. these lights were also moving south at an even slower pace. the last lights were a set of two(like i had seen on the first two nights). these lights were due west on the north side of i-10 and moved up and down over the hour. these four sets of lights were all over populated areas. i have heard that flares are dropped for testing over the barry m. goldwater test range, and this is the reason for the sightings in the phoenix area. the problem with this theory is that none of the lights were even close to the range. also these lights moved together, there was no smoke coming from them, and they held altitude for an hour."],"City":"Buckeye","Tags":"City","Log Number":"US-03072009-0009","Longitude":"-112.574907","Sighting Duration":"00:30:00","Object Flight Path":"Hovering then path","Source":"MUFON","Disposition":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.37237,+-112.574907(15894)&iwloc=A&hl=en\"> mufon case (15894) map </A>","Weather Factors":"None","Country":"United States"}