{"Country":"Canada","Case Number":"15903","Longitude":"-61.306258","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Inverness","This sighting has never been favorited."],"Object Features":"Undisclosed","Object Shape":"Sphere, Star-like, Other","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering,Other","City":"Inverness","Log Number":"CA-03072009-0017","Summary":"Watched a metallic satellite like craft manuvering in the sky.","Viewing Distance":"501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.230026,+-61.306258(15903)&iwloc=A&hl=en\"> mufon case (15903) map </A>","divs":["Sighting DetailsBack in 1971 I was up on Cape Breton Island, Nova Scotia-Sight Point area along the coast with my girlfriend's family for the summer. Many stars, the northern lights and milky way are visable up there as it is far from city light pollution. One night after dark we were outside star gazing etc. and I noticed a very obvious bright metallic looking object moving at amazing speed and in a highly unusual fashion. It was small, about the size of a big satellite or very bright planet or star but was moving and hovering, making impossible turns. My girlfriend had seen it right away also and asked me if I saw it too. I simply said yes. We continued to watch this object fly around high above us and after about 10 minutes it simply \"took off\" into space at a very high rate of speed and dissapeared. There was no sound, no little green men, no abduction, etc. but whatever it was it wasn't a plane, helicopter, satellite, star, or weather.(it was a very clear night) I've thought about this off and on for years and I've been all over the world, flown many planes, have seen military secret planes like the SR-71, Steath planes etc. and this wasn't anything like ours. What can you say? This \"craft\" or whatever it was could make 90 degree turns on a dime and also hover motionless. It's speed and manuvering was incredible and when it took off and dissapeared the only thing I can think of is Star Strek when they blast into hyperspace or whatever. There was no sound. Didn't know what to think except it isn't anything I've known or seen before or since so I'd say it was an unknown flying object."],"Date Submitted":"07/20/1971 12:00 UTC","Weather Factors":"None","Date of the Event":"07/20/1971 12:00 UTC","Latitude":"46.230026","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15903.html.txt","/var/www/straped/mufon/org/15903.html"],"Region":"Nova Scotia","Disposition":"Unresolved"}