{"Date Submitted":"01/12/2009 09:30 UTC","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around January 12th 2009"],"Sighting Duration":"Undisclosed","Log Number":"US-03082009-0002","map":"<A HREF = \"http://maps.google.com/maps?q=29.425722,+-98.490078(15909)&iwloc=A&hl=en\"> mufon case (15909) map </A>","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Tags":"City","Case Number":"15909","Object Shape":"Boomerang, Star-like, Triangle","Region":"Texas","Viewing Distance":"101-500 Feet, Over 1 Mile","Country":"United States","City":"San Antonio","Date of the Event":"01/12/2009 09:30 UTC","Disposition":"Unknown","Object Features":"Wings, Unknown","Source":"MUFON","divs":["Sighting DetailsIf I start from the begining I have to go back to the year 1999,where I oberved a star like object moving through the sky at the southern hemisphere. It wasn't much after that that I noticed another event in wich I saw a white star like object approching the earths atmosphere, as it got closer it started changing colors; first blue; then red; then orange, all of a suddne it broke into three sphere's turning a green and yellow color. All three headed off in diffrent directions, the event itself only lasted about 3 minutes. Ever since that I have made a rotuine of watching the night skies just to see how much activity was going on over our heads, and I have to say I am amazed. Any way over the years I have noticed that must ufo's when moving through the skies it's like a fish swimming in water they don't just move in a straight line like our aircraft do. I have also learned that most movement is from the south to the north or from the west to the east, and usely when the moon is not out for some reason when the moon is out there is no activity no matter what the moon cycle is. If you remember the year the big earth quake hit in the Indian Ocean causing the tidal waves that killed hundreds of thousands of people, the very night before it happened the ufo's I was observing changed their habit's. They started strobbing, and I don't mean like we are use to seeing in strobe lights, these seem to grow in intensitiy and as they grew the craft would seem to stop and when the intesity of the strobe would start dereasing it would move on. There was no pattern to the strobbing such as we see in intervals with our strobe lights, the only time I saw this pattern again was when hurricane Katrina it in New Orleans; and I mean the night before it hit. \"STRANG\". Well anyway I have notice now they seem to get down low now, till this recent sighting I have now had. This UFO was transparent and if you don't have some kind of light reflection or water vapor you can't see them, but they are so low now they are with in our own aircraft flight paths. This really should be looked at closely. Thank you"],"Longitude":"-98.490078","files":["/var/www/straped/mufon/html2text/15909.html.txt","/var/www/straped/mufon/org/15909.html"],"Latitude":"29.425722","Summary":"Noticed a boomerang object moving from the north to the south, only reason I saw it was because of spot lights accidently crossing it's path.","Weather Factors":"Unknown"}