{"Date Submitted":"03/31/2007 12:00 UTC","Country":"United States","Region":"Arizona","Longitude":"-111.934265","Weather Factors":"Unknown","Source":"MUFON","City":"Tempe","Log Number":"US-03072009-0016","Sighting Duration":"Undisclosed","Disposition":"Unknown","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around March 31st 2007","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was in the house with my wife and heard a helicopter very close...so I stepped outside and looked up. Above me was an unmarked, white helicopter hovering above my house with a cameraman inside. I followed the trajectory of the camera's path and saw a glowing orb hovering above the city of Tempe, AZ. It would sit still and then float from side to side. It had no marker lights and was clearly freely floating in the air. I watched in amazement for a while and decided to run in and grab my wifes Nikon camera. I brought it outside and we took about 20 pictures of the UFO as it moved away from us. We had no tripod, but did our best to brace the camera. The UFO was in sight for about 15 minutes max and was moving away from our direction, slowly the whole time. Look very closely and zoom in on these pics....it goes from being an orb, to what resembles four thrusters firing as it flew away. If you need to get the rest of the pics, send me an email. Tempe AZ 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.43257,+-111.934265(15902)&iwloc=A&hl=en\"> mufon case (15902) map </A>","Case Number":"15902","Date of the Event":"03/31/2007 12:00 UTC","Object Shape":"Sphere","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"33.43257","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Unmarked helicopter above house points out a UFO being filmed In Tempe.","files":["/var/www/straped/mufon/html2text/15902.html.txt","/var/www/straped/mufon/more/15902_submitter_file1__DSC_3485.JPG","/var/www/straped/mufon/more/15902_submitter_file2__DSC_3492.JPG","/var/www/straped/mufon/more/15902_submitter_file3__DSC_3495.JPG","/var/www/straped/mufon/org/15902.html"],"Object Features":"Undisclosed","Tags":"City"}