{"Viewing Distance":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/15912.html.txt","/var/www/straped/mufon/org/15912.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.767519,+-111.883557(15912)&iwloc=A&hl=en\"> mufon case (15912) map </A>","Date of the Event":"03/06/2009 12:30 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Summary":"Southwest flashing domed disc shaped object low in the sky position in front of the west mountain range which means it could have not been a low hanging star.","Sighting Duration":"Undisclosed","divs":["sighting detailsit was about30 minutes after midnight when upstairs to go to bed. as i lay down i happen to look out the second story window to the southwest of the city, i live in the east bench in the city. i saw a very unsual bight muli-colored strobing \\ flashing light very low in the sky. i thought it might be a star for a minute but realized that it was too low and close and positioned in front of the oquirrh mountain range to be a low hanging star i also saw the bright southwest star in the sky above it so i got curious and went and got my binoculars. my first view was a little out of focus but i could see it was pulsing and fashing a multi-colored light very rapidly. as i focused that is when i saw its distnict slightly domed on top of a ( two plates face to face ) disc shape with a slight protrusion of a lower domed bottom. i watched it for about 10 minutes and it did seem to be able to change but i believe these \"changes\" to be more related to how much or how little it shape was revealed by the amount of shape defining illumination the object was emitting. just an opinion. i was more curious so i went and got my wife out of bed to take a look but she did not have her conact lenses. i kept track of the object as it changed and lost its initial shape"],"Longitude":"-111.883557","Object Shape":"Disc","City":"Salt Lake City","Log Number":"US-03082009-0005","Country":"United States","Latitude":"40.767519","Date Submitted":"03/06/2009 12:30 UTC","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around March 6th 2009"],"Region":"Utah","Disposition":"Insufficient Data","Source":"MUFON","Case Number":"15912"}