{"map":"<A HREF = \"http://maps.google.com/maps?q=43.644381,+-79.523028(15911)&iwloc=A&hl=en\"> mufon case (15911) map </A>","Object Shape":"Circle, Oval","City":"Toronto","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around March 8th 2009"],"Log Number":"CA-03082009-0004","Summary":"Orange planet like shape.","Weather Factors":"None","Disposition":"Unresolved","Country":"Canada","Date of the Event":"03/08/2009 05:43 UTC","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","divs":["Sighting DetailsI woke up in the middle of night to get a glass of water. And then when I went back to bed, I passed through the window. Through the open curtains, I saw a HUGE orange planet like object in the sky. And it was apparently NOT too high above the ground. I can say so because the stars seemed the size of an ant from my viewpoint and that orange ball was relatively extremely huge. It was just my plain sight that made me notice it. It was so huge that no body could have missed it. At first, I though the object was a planet or something. I also considered the possibility of it being the moon, but moon isn't orange, neither it is that big as that object was. It had spots similar to the spots the moon has. It was very beautiful to look at. Its movement was not really apparent, but as I watched it I could tell it was moving because an electrical tower came in from of it after less than a minute. As I kept watching it, it started to fade away as if clouds were covering it, or as if it was shrinking. And in a matter of few minutes, it just disappeared. I kept looking for about another 15 minutes, but it didn't reapper. I also woke my Mom up, and she saw it too. I wish I had a camera to store a picture."],"Longitude":"-79.523028","Latitude":"43.644381","Source":"MUFON","Tags":"City","Date Submitted":"03/08/2009 05:43 UTC","Case Number":"15911","files":["/var/www/straped/mufon/html2text/15911.html.txt","/var/www/straped/mufon/org/15911.html"],"Viewing Distance":"Unknown","Object Flight Path":"Stationary,Other","Region":"Ontario"}