{"Viewing Distance":"Unknown","Country":"United States","Longitude":"-81.17997","trends":["There have been no other sightings in Elk Creek","This sighting has never been favorited."],"Disposition":"Unknown","City":"Elk Creek","Region":"Virginia","Summary":"Very large, blue and orange lights. Triangle 200 yards across.","Object Features":"Undisclosed","Latitude":"36.722698","files":["/var/www/straped/mufon/html2text/15919.html.txt","/var/www/straped/mufon/org/15919.html"],"Date of the Event":"03/07/2009 10:23 UTC","Source":"MUFON","Date Submitted":"03/07/2009 10:23 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.722698,+-81.17997(15919)&iwloc=A&hl=en\"> mufon case (15919) map </A>","divs":["sighting details i was on my farm in the comers rock section of elk creek va. i looked toward the flat ridge area of the jefferson national forest. hovering over the ridgeline was an extremely large triangle shaped craft. it had a total of seven lights. two on each side at the rear were light blue as was the one in the front. the two behind the front were distinctly orange. this craft was completely silent. the object turned toward my direction and came across the valley. using landmarks the object came as close as 1\\4 of a mile from my location. it hovered again for about fifteen seconds and then shot off to the north towards the town of speedwell at a speed that can best be described as instant and was gone. at its closest point to me i could feel a heavy feeling like if you walked from air conditioning outside to a very hot and humid day. i have held a job that was in the air defense industry. i am very well trained at identifying flying objects. this was not an airplane, nor did it have a jet or propeller engine. the turn that it made when it shot off would have torn the wings from any man made aircraft that we know of. residents of this area have seen strange military aircraft flying at night for many years and this was not one of them. if this is an american military craft i will sleep much better at night because we will have nothing to fear from any military in the world."],"Tags":"City","Log Number":"US-03082009-0012","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Case Number":"15919"}