{"Region":"New York","Date Submitted":"03/06/2009 12:00 UTC","Tags":"City","City":"Endicott","Summary":"A bright light appeared above the rooftops and traveled extremely quickly toward the horizon, but disappeared before reaching it.","map":"<A HREF = \"http://maps.google.com/maps?q=42.099488,+-76.047788(15914)&iwloc=A&hl=en\"> mufon case (15914) map </A>","Source":"MUFON","Object Features":"Undisclosed","Viewing Distance":"Unknown","Case Number":"15914","trends":["There have been 4 other sightings in Endicott","There were no other sightings in Endicott on or around March 6th 2009"],"Disposition":"Insufficient Data","Date of the Event":"03/06/2009 12:00 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Longitude":"-76.047788","Country":"United States","divs":["Sighting DetailsI woke up in the middle of the night and went out on the front steps of the house to smoke as I always do. I have made it a habit to look up at the night sky when I do this because I'd like to see some of these unidentified objects so many people have reported. While I stood there, a bright light the size of a planetary object or very large star appeared over and just beyond the rooftops of my neighbors' houses as I was facing south and slightly west. It zoomed across my field of vision in a more southwesterly direction and blinked out of existence, as best I could tell, rather than disappearing behind the distant hills. The entire sighting lasted less than 10 seconds. We have many airplanes, jets and helicopters going over our area all the time, but this light could not have been one of these as it moved much more rapidly than any of the aforementioned aircraft. The object moved from north to south in a westerly path and disappeared in 5-10 seconds. I didn't have much time to think about what the object was but I have been trying to find out if it could have been a meteor. This seems to me to be the mostly explanation to fit description of the bright object and its movements. Other than being a shooting star, I can't imagine what it could have been. I was happy to have seen this object, since it meant all that looking up at the night sky (while standing out on the front porch steps to smoke and keep my cigarette smoke from stinking up the house)had finally had results. I don't mind if it was only a meteor because I don't remember ever having seen one of those in my life, but if it was an exterrestrial craft or top-secret aircraft, that would be even cooler."],"Latitude":"42.099488","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/15914.html.txt","/var/www/straped/mufon/org/15914.html"],"Object Shape":"Star-like","Log Number":"US-03082009-0007"}