{"Disposition":"Unresolved","Log Number":"IE-03082009-0016","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"11/23/2008 03:15 UTC","City":"Cork","Date Submitted":"11/23/2008 03:15 UTC","Object Flight Path":"Undisclosed","Country":"Ireland","Latitude":"51.906367","divs":["Sighting Detailsat three am approx my friend and I were on the bridge over the river lee in the middle of cork city. We were walking to a taxi rank when we notice a group of people looking skyward. We stopped and immediately looked up and right above us maybe 1000 ft up was an orange light. First i thought it was odd as it was overcast an the red haze of the citys lights could be seen against the clouds (note:we dont have any buildings over maybe 20 floors in Cork city) Then this glowing light started to move....slowly first then all of a sudden with no noise it shot up and moved at an angle and then straight off in a south east direstion towards cobh. When people started to gasp it came back almost to the same spot. It then stopped, and begane to move at intervals in no particular pattern. The object then went behind some clouds, out again and shot off at incredible speed. The craft appeared round but any real shape was glared by its one bright light. The main feeling I got from watching this whole incident was that whoever was piloting this craft knew it was been watched and i got the sense that it was sort of showing off, I know that seems strange. The next feeling was a feeling of oh well I knew it anyway, Ie I wasnt shocked or overwhelemed just a feeling like you I was expecting to see something eventually. I stood around and talked to some people (there was a group of maybe 20 people) and they all saw the same thing. It was a strange experience but annoyingly I heard nothing on the net about it no paper or media intrest, I mean Whats going on, It was over a large city at night glowing and moving around like it owned the place and no one registered. So hopefully since ive found this site someone might have seen the same thing and posted"],"Case Number":"15924","files":["/var/www/straped/mufon/html2text/15924.html.txt","/var/www/straped/mufon/org/15924.html"],"Summary":"Orange ball flying over city.","trends":["There have been 4 other sightings in Cork","There were no other sightings in Cork on or around November 23rd 2008"],"Sighting Duration":"Undisclosed","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=51.906367,+-8.475029(15924)&iwloc=A&hl=en\"> mufon case (15924) map </A>","Object Features":"Unknown","Region":"County Cork","Weather Factors":"Unknown","Longitude":"-8.475029","Tags":"City"}