{"map":"<A HREF = \"http://maps.google.com/maps?q=35.967408,+-83.918669(15920)&iwloc=A&hl=en\"> mufon case (15920) map </A>","Disposition":"Unknown","Date Submitted":"03/07/2009 05:30 UTC","Latitude":"35.967408","Date of the Event":"03/07/2009 05:30 UTC","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-03082009-0013","Object Features":"Unknown","Weather Factors":"None, Does Not Apply","Object Flight Path":"Straight-line path","Object Shape":"Cylinder, Unknown","trends":["There have been 50 other sightings in Knoxville","There were no other sightings in Knoxville on or around March 7th 2009","This sighting has never been favorited.",""],"Region":"Tennessee","Longitude":"-83.918669","files":["/var/www/straped/mufon/html2text/15920.html.txt","/var/www/straped/mufon/more/15920_submitter_file1__CasePhoto1.jpg","/var/www/straped/mufon/org/15920.html"],"divs":["Sighting DetailsI had just gotten home and was walking into my house. I was looking up at the moon in the sky. It was still day light with the sun shining. After I noticed the big moon in the sky I noticed a white jet fly under the right side of the moon leaving chemtrails when I noticed a large very white object flying perpendicular to the line of the jet. I couldn't tell if it was two objects or one with a dark area in the middle of it. It was higher in the sky and appeared to fly over the top of the jet and was going at such a faster speed that I couldn't help but notice it. It flew in a straight line and continued until I gave it up since I didn't have any way to record it. I knew that since I couldn't record it all I could do was watch it. I was talking on the cell phone to my sister when I saw this and asked her if she could see the moon from where she was. she said no. I couldn't make out the wings or tail but I could definitely see these on the jet. I heard no sound. either from the jet or the object in question. The darker area was in the middle of the craft. If it had been a plane it seems like the wings would be in the front and not in the center of this thing. I probably watched it for 15-20 seconds. It was still in sight but moving away very quickly when i came on in the house. I have seem strange things and lights at night but never in the day light."],"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","City":"Knoxville","Tags":"City","Case Number":"15920","Summary":"Object was not spherical as I could tell but was in a straight line in sky."}