{"Case Number":"15927","Source":"MUFON","City":"Litchfield Park","Longitude":"-112.357936","Viewing Distance":"Unknown","Region":"Arizona","Date of the Event":"05/31/2006 08:00 UTC","Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/15927.html.txt","/var/www/straped/mufon/org/15927.html"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-03082009-0019","trends":["There have been no other sightings in Litchfield Park","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.493374,+-112.357936(15927)&iwloc=A&hl=en\"> mufon case (15927) map </A>","Object Features":"None","Date Submitted":"05/31/2006 08:00 UTC","Tags":"City","Summary":"Inverted tear drop descended quickly at a right angle, then suddenly stopped and blinked out. It was pure, beautiful, pulsing white light.","Object Flight Path":"Path then hovering","Country":"United States","Weather Factors":"None","Latitude":"33.493374","divs":["Sighting Detailsmy husband John and I were sitting in our backyard on the steps of our swimming pool. My two daughters were swimming. It was completely dark and we had the pool light on in the water. It was a very clear Arizona night. All of a sudden, to our east a bright, pulsing light appeared. There was a streetlight about 25 feet from our location. The light appeared first above the streetlight and was so much brighter than the streetlight. My husband and I both noticed it at the same time and pointed it out to our daughters. It was shaped like an inverted teardrop. The light was bright and pure. I have never seen anything like it before or since. It was pulsing and seemed liquid as it descended at an angle. It was going quite fast but we watched it for a couple of minutes. The streetlight pole blocked some of the light as it descended, but it quickly emerged on the other side of the pole. I am horrible at estimating distances, so I won't even try to guess how far away it was from us. It seemed quite large, bigger than a hot air balloon. All of a sudden the thing stopped and was still. Then suddenly it just disappeared as if it had never been there. We lived near Luke AFB and the small Glendale Airport. We had been in our home for 4 years and I know what the jets look and sound like at Luke. We also could see airplanes approaching the Phoenix airport and knew what landing lights looked like as planes made turns toward the airport. This thing was far, far brighter than the any airplane lights we were used to seeing in our area. I wish I had the words to describe how pure the light was. It was just a beautiful pulsing white light. The light was mesmerizing. My husband and I tried to figure out what it could have been, but stopped once we realized we were upsetting our daughters. I wasn't afraid of the object, just puzzled as to what it could have been. The rate of descent, sudden stop and bright pure white light still stands out in my mind even to this day. The next day I asked several co-workers and neighbors if they had seen anything, but none of them had. If I ever see another object I will pay attention to the details of the time and date."]}