{"trends":["There have been 3 other sightings in Vidor","There were no other sightings in Vidor on or around March 6th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.13306,+-94.006624(15937)&iwloc=A&hl=en\"> mufon case (15937) map </A>","Source":"MUFON","Log Number":"US-03092009-0010","City":"Vidor","Latitude":"30.13306","Longitude":"-94.006624","Case Number":"15937","Date of the Event":"03/06/2009 07:00 UTC","Country":"United States","Tags":"City","Region":"Texas","Object Features":"None","Object Shape":"Other","divs":["Sighting Details My nephew-in-law and were in his front yard at the corner of Martha and Alpine streets. I was telling him about the Comet Lulin and where I thought we might see it in order to show his children. From his property on any clear or partly cloudy night , you can observe commercial aircraft coming out of the Houston, Texas airports headed east toward Florida and the east coast. We are familiar with where these planes fly, how fast they move, their lights and general behavior. We can also see the aircraft moving in the commercial lanes going west. The ones going west are farther to the south, about the same altitude, speed, navigation lights, etc as the ones headed east. We had been discussing Comet Lulin for about 4-5 minutes when I noticed the object come into view. It appeared out from behind the trees in the yard, moving at a speed made 5 to 7 times the speed of the jets. It was at a much higher altitude. It appeared as a solid green object, long and thin, with a cross section approximately one fifth to one sixth its length. It left no visible trail and when we had both observed the object for about 6 or 7 seconds together (I had pointed it out to him after I had seen it originally) it simply disappeared, turned off, vanished. My nephew-in-law stated that he had seen this in the past, but was not sure about what to sat or who to report it to. We discussed what the possible explanations might be; a satellite that passed into the Earth's shadow, the fabled Aurora spyplane, or some other high tech government vehicle that is not known to the public. I have had flight training in both fixed wing and rotary wing aircraft. I have a very good knowledge of what conventional aircraft can do and the speed of this object was well beyond anything that we can build, that is known to the public."],"Summary":"Looking to the south we witnessed a greenish object moving at a very high rate of speed from west to east.","Disposition":"Unknown","Object Flight Path":"Straight-line path","Date Submitted":"03/06/2009 07:00 UTC","files":["/var/www/straped/mufon/html2text/15937.html.txt","/var/www/straped/mufon/org/15937.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown"}