{"Object Flight Path":"Stationary","Object Shape":"Flash, Other","Viewing Distance":"101-500 Feet","Log Number":"US-03092009-0003","files":["/var/www/straped/mufon/html2text/15930.html.txt","/var/www/straped/mufon/org/15930.html"],"trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around February 27th 2009"],"City":"Lansing","Latitude":"42.736545","Longitude":"-84.552615","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.736545,+-84.552615(15930)&iwloc=A&hl=en\"> mufon case (15930) map </A>","Date of the Event":"02/27/2009 07:30 UTC","divs":["sighting detailsi was traveling from home to howell michigan(heading east) taking i-96. i was about 3\\4 of a mile west of m 127 and could see the overpass and noticed a white beam of light coming from the sky and appeared to go all the way to the ground. i couldn't see all of it due to the overpass was blocking my view it lasted about 4-5 seconds. the light was on the east side of m 127 and south of i96. i wasn't sure what it was and didn't think much of it till i went under the overpass of m 127. as i went by the overpass on the north side of i-96 and on the east side of m-127, right above me a huge blue beam of light came (like someone turned a switch) from the sky to the ground. it was about the size of a football field perfect circle. i could see inside the circle what seem to be static. other people also seen this as they were pulling over to see it to. this was not a natural thing it was to perfect. it went right into the clouds.( cloud cover was very low) it wasn't spot light like you see at grand opening. i can say that cause 5 miles west of m-127 they had that kind of light going and this blue beam was nothing like that. i felt very little next to this light. i've been in the airforce and work at the airport for years and i don't know of anything that could make a light like this or even a aircraft that could carry light or have the power the generate a beam this bright. the light disappeared like someone turning off a switch."],"Country":"United States","Region":"Michigan","Summary":"Blue beam of light from sky to ground.","Case Number":"15930","Sighting Duration":"Undisclosed","Date Submitted":"02/27/2009 07:30 UTC","Source":"MUFON","Disposition":"Unknown","Object Features":"Undisclosed","Weather Factors":"Does Not Apply"}