{"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/15944.html.txt","/var/www/straped/mufon/org/15944.html"],"Tags":"City","Log Number":"US-03102009-0005","map":"<A HREF = \"http://maps.google.com/maps?q=32.743227,+-97.103306(15944)&iwloc=A&hl=en\"> mufon case (15944) map </A>","trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around March 7th 2009"],"Region":"Texas","Summary":"Hovering crafts above Intersate-30 in Arlington next to Six Flags.","City":"Arlington","Viewing Distance":"21-100 Feet","Weather Factors":"None","Object Features":"Unknown","Sighting Duration":"00:01:30","Object Shape":"Bullet, Missile","Country":"United States","Case Number":"15944","Date Submitted":"03/07/2009 07:45 UTC","Longitude":"-97.103306","divs":["Sighting DetailsMy girlfriend and I were driving to Fort Worth from McKinney by way of Interstate-30. The time was approximately 7:45. She was driving and I was in the passenger seat. It was already quite dark out as we were hours shy of Day Light Savings' spring forward. I recall the highway being quite busy at the time. As we are driving through Arlington, we get pretty close to Six Flags Over Texas. Looking ahead of us a few hundred yards, I see two sets of lights in the sky. From the spot that we're in, I can see that there are two separate air crafts, but their shape was somewhat elusive as they were dark, and blended somewhat with the dark sky. They appeared to be shaped somewhat like a bullet, even a helicopter without the blades or the tail. Originally, I did think that they were helicopters. As we neared them my girlfriend and I could see how close these two crafts were to each other, and simultaneously yelled out that they were going to crash. We quickly realized, however, that they were not moving at all, but hovering in place. As we continued to get closer, we could see how close to the ground they really were - only about 60 feet above it. Confused, we both looked up as we got under them. Though their lights were, making it difficult to see, the stationary crafts' shapes were definitely not those of any flying craft I've ever seen. They were like bullets, but bluntly tapered at one end, much like the cross-section of a domed silo on its side. If I could compare it to anything, I'd say it looked almost as if there were two cars floating in midair there. Completely in shock from what we were seeing, and attempting to reason with ourselves what they were, she continued to drive, and I turned around and stared out the back windshield as the hovering crafts stayed there. We finally drove out of their sight. As we continued to drive to Forth Worth, our attempts at reasoning became more absurd, and succumbed to the possibility that they were paranormal objects. Dropping me off in Fort Worth, I told her to take the same route back and see if there was anything there that was possibly suspending the objects in the air. When she drove back through the area, nothing was in sight. I am extremely eager to know if anyone saw this as well!"],"Latitude":"32.743227","Source":"MUFON","Object Flight Path":"Stationary","Date of the Event":"03/07/2009 07:45 UTC"}