{"Source":"MUFON","Longitude":"-104.979613","map":"<A HREF = \"http://maps.google.com/maps?q=39.742254,+-104.979613(15946)&iwloc=A&hl=en\"> mufon case (15946) map </A>","divs":["Sighting DetailsOn June 9th 2007, I was in the backyard of my mother's house watching the sky through the growing cloud cover for a glimpse of the International Space Station and a tailing shuttle. At approximately 21:05 I saw a small object far off between a hole in the clouds northwest, on a northeast path. Two minutes later, at 21:07, I saw another very similiar object in the same location, moving the same way, though it was moving more slowly than the first. I assume these were the I.S.S. and the following shuttle now, but that night I wasn't convinced and wanted to see more, so I remained outside. I kept checking the clock, because the time given for the Space Station's overhead pass was different than the time I had seen it and hadn't yet passed. After I checked the clock at 21:13, I decided to give the wait a few more minutes then head back inside. I sat down on the back porch step and looked skyward again. It couldn't have been half a minute afterwards when I saw a light appearing over the shed to my left. At first, I wasn't very intrigued by the light, but simply watched for a lack of anything better to do. I didn't know what it was, and I didn't have time to ponder it. Then another light followed it, and another after that, and another after that one. The four lights were in a circular pattern, but there was a large circular object blotting out the sky surrounding the lights. The craft came into view slowly, very low, almost leisurely. After the craft seemed to have centered over me, it stopped and hovered. From the position of the four lights, the craft looked to be rotating in a counter-clockwise direction. I don't remember if it was rotating before it stopped. There was a dome in the center of what I could see of the craft, but I don't remember if it was a light or not. I don't think it was. The craft spanned the distance between the roof of the shed and the roof of the house. I stood and pulled the camera I had in my lap up to take a picture of the craft (though it sadly caught only blackness). The craft hovered breifly, and then stopped rotating. It then quickly shot off to my right, southeast, over the roof. I felt and feel as though the whole event couldn't have lasted more than a two-minute maximum, but I checked the clock as soon as I couldn't see the craft anymore, and it was 21:17. I then went inside, focused on drawing what I'd seen, this being the first time I used the camera. Just recently, my mother and I took the measurements of the area between the edge of the roof of the shed and the roof of the house. Using this, the craft had to have been more than 106 inches in diameter, and was at least 108 inches off of the ground. The sketch I've provided is, sadly, not the original, which has been lost. It's not the best, but I hope it'll do."],"Log Number":"US-03102009-0007","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around June 9th 2007","This sighting has never been favorited.",""],"Tags":"City","Date Submitted":"06/09/2007 09:13 UTC","City":"Denver","Object Shape":"Other","Sighting Duration":"00:01:00","Date of the Event":"06/09/2007 09:13 UTC","files":["/var/www/straped/mufon/html2text/15946.html.txt","/var/www/straped/mufon/more/15946_submitter_file1__001.jpg","/var/www/straped/mufon/org/15946.html"],"Object Features":"Dome","Latitude":"39.742254","Country":"United States","Region":"Colorado","Weather Factors":"None, Does Not Apply","Disposition":"Hoax","Case Number":"15946","Viewing Distance":"20 Feet or Less","Summary":"I sighted a circular object while skywatching in my backyard on June 9, 2007.","Object Flight Path":"Path then hovering"}