{"Summary":"There has been something in geosynchronous orbit with Venus for the last 7 months or so.Through my meade telescope it appears to be a bolide.","Case Number":"15947","Object Features":"Unknown","Country":"United States","Log Number":"US-03102009-0008","Object Shape":"Cylinder, Disc, Oval, Sphere, Other","Longitude":"-77.034976","divs":["sighting detailshi my name is danton lee. i am a native of washington d.c. .this is my story. one night about 7 or 8 months ago i was stargazing with my meade telescope.the night was clouldless so viewing was optimal. i decided to view venus since it was the most brightest thing in the night sky. when i trained my viewfinder on the planet, i noticed a tiny glint off to the side .i thought nothing of it at first.but when i trained my main viewing scope, something strange was hovering beside venus.at first i thought it might have been glare on my lens.thats when it slowly began to change shape.first it was a oblong-oviod.then it became a bar with partitioned sections.i went off for a few minutes and when i came back, it had moved! it completely changed its orientation beside venus.first it appeared to the upper left.then it was to the lower right. the best way to describe it is a transluecent shapeshifting bolide.i know it is transluecent because i could see venus through it. if it is a craft of some sort, then it is made of pure energy(hypothosis)it appears to shimmer with opalesent light.i don't know what it is. i have witnessed many things in the night sky.i have never seen anything close to this.if you wish you can view it for yourself.thats right, its still there.every night.still in geosynchronous orbit.i am inviting anyone from your organization to view this object from my house. you can bring any recording\\viewing equipment you like.if you wish to capture this phenomenon come between the hours of 8 and 9 pm.contact me by email so that i can know when to stand outside to greet you. please honk three times.thank you and i hope you take advantage of this incredible scientific discovery.keep looking up."],"Viewing Distance":"Over One Mile","Region":"District of Columbia","City":"Washington","Date Submitted":"03/09/2009 09:00 UTC","Weather Factors":"Unknown","Date of the Event":"03/09/2009 09:00 UTC","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=38.896112,+-77.034976(15947)&iwloc=A&hl=en\"> mufon case (15947) map </A>","Sighting Duration":"02:20:21","Source":"MUFON","Latitude":"38.896112","Tags":"City","Disposition":"Unresolved","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around March 9th 2009"],"files":["/var/www/straped/mufon/html2text/15947.html.txt","/var/www/straped/mufon/org/15947.html"]}