{"Country":"United States","Object Shape":"Circle, Square, Rectagular","Disposition":"IFO","Tags":"City","Summary":"One looked like a flying bus, rounded at front and back, other circle.","trends":["There have been 7 other sightings in Cantonment","There were no other sightings in Cantonment on or around March 9th 2009"],"Object Features":"Dome, Patterned Surface","Date Submitted":"03/09/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/15948.html.txt","/var/www/straped/mufon/org/15948.html"],"Longitude":"-87.349391","divs":["Sighting Detailscame from the northwest headed southeast, first one large rectangle white lights red flashing on rear, rounded on front and rear. three others were cirles, disk like red and white lights, 3 headed southeast, one headed east. The one headed east had white lights in the center and red around the disk, white lights went out and red lights started moving almost like light chaser Christmas lights. One of the small ones looked like it was doing acrobates. I was taking my garbage can to the road around 9:00 p.m., it was a very clear night with a bright moon, and I was just looking at the sky, when I saw a large object coming from the northwest, 3 more followed within the next 30 mins, one very large and 2 smaller ones. It was exciting, I called my nephew to ask him to get on his computer and see if it was the International Space Station, because I had seen it on February 14th, but this was much larger and closer, He said I should not be able to see it until 5:30 am the next morning."],"Viewing Distance":"Unknown","Case Number":"15948","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Florida","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Latitude":"30.608691","Date of the Event":"03/09/2009 12:00 UTC","City":"Cantonment","Log Number":"US-03102009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=30.608691,+-87.349391(15948)&iwloc=A&hl=en\"> mufon case (15948) map </A>","Weather Factors":"Unknown"}