{"divs":["Sighting DetailsMARCH 6TH 2009 7:00PM LOOKING OUT MY BEDROOM WINDOW I SAW ABOVE THE TREE A VERY BRIGHT LIGHT I CALLED BOTH MY SISTERS SON AND MY MOM TO LOOK AT IT. JUST THEN OVER THE POLICE RADIO A FRIEND TOLD MY MOM ON THE PHONE THAT OTHER PEOPLE AT A PARTY CALLED THE 9-1-1 CENTER TO REPORT A BRIRHT LIGHT IN THE SKY. OUR NEXT DOOR NEIGHBOR CAME OUT JUST AS MY FARTHE WAS GETING OUT OF THE CAR LOOKING UP AT THIS THING IN THE SKY. 2ND NIGHT MARCH 8TH 2009 7:57PM (THE BRIGHT LIGHT WAS NOT SEEN ON MARCH 7TH) ON MARCH 8TH THE LIGHT RETURNED WITH A JET PASSING NEAR THE BRIGHT LIGHT JUMPED OUT OF SIGHT THEN RETUNED ONCE THE JET PASSED BY. THEN FROM OUT OF NOWARE BETWEEN 8 TO 10 AIRPLANES STARTED FLYING ALL AROUND THE SKY. EACH TIME ONE OF THE AIRPLANES GOT CLOSE TO THE LGHT IT TURNED GHOST LIKE WERE NOONE SAW IT UNTELL THE PLANE PASS BY THE THE WHITE LIGHT RETUNED THIS 2ND NIGHT TOOK PLACE WITH OUR NEIGHBORS WATCHING WITH US A TOTAL OF 7 PEOPLE SAW THE LIGHT THE 2ND NIGHT MARCH 8TH 2009 FROM 7:57PM TO 8:30PM THEN THE LIGHT MOVED S.W. AND WAS GONE FROM SIGHT. MARCH 9TH 2009 FOR A 3RD TIME THE BRIGHT LIGHT RETUNED WITH 2 JETS FLYING AROUND AND MORE AIRPLANES GOING AFTER THE WHITE LIGHT. THIS TOOK PLACE FROM 7:58PM UBTELL 8:41PM THEN THE LIGHT WAS GONE AGAIN."],"Latitude":"38.038326","Date of the Event":"03/06/2009 07:00 UTC","Summary":"A bright light in the night sky seen by many people.","files":["/var/www/straped/mufon/html2text/15942.html.txt","/var/www/straped/mufon/org/15942.html"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Charlottesville","Object Features":"Other","Viewing Distance":"Unknown","Weather Factors":"None","Country":"United States","Log Number":"US-03102009-0003","Tags":"City","Case Number":"15942","Object Flight Path":"Stationary,Other","Object Shape":"Cigar, Egg","Date Submitted":"03/06/2009 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.038326,+-78.471098(15942)&iwloc=A&hl=en\"> mufon case (15942) map </A>","Longitude":"-78.471098","Region":"Virginia","Source":"MUFON","trends":["There have been 19 other sightings in Charlottesville","There were no other sightings in Charlottesville on or around March 6th 2009"]}