{"files":["/var/www/straped/mufon/html2text/15941.html.txt","/var/www/straped/mufon/more/15941_submitter_file1__WINSUFO.jpg","/var/www/straped/mufon/more/15941_submitter_file2__SAGANUFO.jpg","/var/www/straped/mufon/org/15941.html"],"Tags":"City","Summary":"Bright blue teardrop in Independence, MO","map":"<A HREF = \"http://maps.google.com/maps?q=39.094596,+-94.407547(15941)&iwloc=A&hl=en\"> mufon case (15941) map </A>","City":"Independence","Region":"Missouri","Object Shape":"Teardrop","Disposition":"Unknown","Longitude":"-94.407547","Object Flight Path":"Stationary","Weather Factors":"Windy","Viewing Distance":"Unknown","Latitude":"39.094596","Date of the Event":"03/01/2009 12:00 UTC","Log Number":"US-03102009-0002","Object Features":"Unknown","Date Submitted":"03/01/2009 12:00 UTC","Case Number":"15941","divs":["sighting detailssaturday night at 11:50 pm i was locking up the house for the night when i noticed a bright blue light in the western sky at approximately 30-40 degrees above the horizon. at first i thought it was venus, then i realized that it was not a round shape - rather, it was a long, cigar shape or teardrop shape hanging vertically in the sky. it almost looked like three lights, one on top of the other, and each one slightly smaller than the other one. it was partly cloudy and from my vantage point i could see no stars in the sky. the size was approximately the length of my thumbnail held at arm's length, and 1\\2 the width. it was brighter than venus and completely blue. i called my brother, who looked outside and could see nothing from his house. he lives in independence and his house is on top of a big hill. i watched the object for 20 - 30 minutes but it never moved. it was too cold outside to go out with binoculars or the telescope, but i can't understand why i didn't at least grab a camera and take some pictures. it was bright enough that it would have shown up. here i am a mufon field investigator and i didn't get a camera or binoculars and even look through the window. very strange. for the next 5 nights in a row, my daughter and her son and i all watched the sky for the object to appear again but it never did."],"Sighting Duration":"Undisclosed","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around March 1st 2009","This sighting has never been favorited.",""],"Country":"United States","Source":"MUFON"}