{"Object Features":"Appendage(s), Other","Sighting Duration":"Undisclosed","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/15950.html.txt","/var/www/straped/mufon/org/15950.html"],"Log Number":"US-03102009-0011","City":"Tallahassee","Tags":"City","Case Number":"15950","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Date Submitted":"02/18/2009 06:29 UTC","Summary":"Heard rumbling sound, looked out window and saw huge \"A\" shaped object in sky.","Date of the Event":"02/18/2009 06:29 UTC","Latitude":"30.445276","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=30.445276,+-84.277743(15950)&iwloc=A&hl=en\"> mufon case (15950) map </A>","Object Flight Path":"Straight-line path","trends":["There have been 26 other sightings in Tallahassee","There were no other sightings in Tallahassee on or around February 18th 2009"],"Country":"United States","Source":"MUFON","Longitude":"-84.277743","Region":"Florida","divs":["sighting detailswitness reports that she woke up around 6:30 am for a potty break. when she came back to bed, she heard a rumbling sound outside, so she looked out the window. about 100 feet above the trees, she saw a huge 'thing' as she described it. this 'thing' was about 200 feet above her house, and looked like a huge letter \"a\", triangular shaped, but not solid - there was a 'bridge' between the two 'legs' that would form either side of the letter \"a\" and on that 'bridge' was a small red light that was solid on, not flashing. she said she could see the sky through the top part of the \"a\" shape and also under the 'bridge' part. there were seven (7) white lights, one at the tip of the \"a\" and three down each side. the red light was in the middle -- none of the lights were flashing. witness said at first she wasn't sure of what she was hearing because it was more like a rumble that she could feel. when asked what it sounded like, she said it reminded her of the sound of jets in the distance, if she could relate it to anything she has ever heard before. witness said she watched it pass by the top of her home and saw it move on in a north \\ north-west direction."]}