{"Viewing Distance":"Over One Mile","Latitude":"32.755894","divs":["sighting detailsi was sitting in my back yard looking off to the west and had an unobstructed view of approximately half a mile or more, and above the roofline between the sillhouette of two mountain tops i saw a series of six lights. i have studied the lights and being familar with the skyline i knew these were new and unusual. i waited approximately 15 mintues to see if they would move or change and they did not. i went quickly into the house to get my camera, and this approximately one minute, i returned to the back yard with camera and photographed the skyline and lights wich were unchanged. i waited approximately five minutes longer and then went to my vehicle drove approximately five minutes, lost visual, returned to my back yard and they were gone. i did not witness their leaving or disappearance. i then sat waiting hoping they would return and noticed a brief return of one individual light in similar position in the sky, but further south on the horizon. this appeared in front of me, and then disappeared as if a cloak was covering it from one side and then was gone. i then drove approximately 1\\4 mile to my moms, picked her up and together we drove approximately 100 yards to the edge of our neighborhood. we sat looking into the night sky to the west, hoping for a nother glimpse or sighting. we waited approximately 15 minutes, and again south of the original sighting two more lights appeared. this was witnessed by my mom as well. these remained in the sky approximately three minutes, and then disappeared as per the single sighting, as if a cloak covered the two lights. then using binoculars i searched the skies and noticed sporadic silver individual sparkler like objects that were silver flashing on and off throughout the field of vision in the binoculars as if strobing and changing position. these were not visible with the naked eye. we then waited another twenty minutes, and no other lights appeared. we drove approximately five miles to another location, waited approximately twenty minutes, no further sightings and we returned home. photo to be attached later i am using christine dickey's e-mail address as i do not have one."],"Summary":"Oval shaped six amber lights in a row, four to the right and two to the left slightly staggered.","files":["/var/www/straped/mufon/html2text/15958.html.txt","/var/www/straped/mufon/more/15958_submitter_file1__johnabbott2013.JPG","/var/www/straped/mufon/more/15958_submitter_file2__johnabbott2014.JPG","/var/www/straped/mufon/more/15958_submitter_file3__johnabbott2015.JPG","/var/www/straped/mufon/more/15958_submitter_file4__johnabbott2016.JPG","/var/www/straped/mufon/org/15958.html"],"Case Number":"15958","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.755894,+-111.670958(15958)&iwloc=A&hl=en\"> mufon case (15958) map </A>","Object Features":"None","trends":["There have been 2 other sightings in Arizona City","There were no other sightings in Arizona City on or around March 5th 2009","This sighting has never been favorited.",""],"Date of the Event":"03/05/2009 09:50 UTC","Tags":"City","Log Number":"US-03102009-0019","City":"Arizona City","Region":"Arizona","Date Submitted":"03/05/2009 09:50 UTC","Object Shape":"Oval","Object Flight Path":"Stationary","Weather Factors":"None","Longitude":"-111.670958","Disposition":"IFO","Sighting Duration":"Undisclosed","Country":"United States"}