{"Disposition":"Insufficient Data","Date Submitted":"02/12/2009 07:30 UTC","Object Features":"None","Region":"Pennsylvania","Date of the Event":"02/12/2009 07:30 UTC","Source":"MUFON","Latitude":"40.343618","Longitude":"-75.922185","Weather Factors":"Unknown","divs":["Sighting Detailswe were coming home from dinner at 7:30pm, february 12, 2009. it was a very clear, cold night. as we walked up onto our deck at the back of our house, my husband was looking for his house keys to open the back door. the back house light was off, so it was dark. i looked up to admire the stars in the clear night sky, when i saw this object move over our house. it wasn't very high in the sky. my husband thinks maybe about 1000 feet off the ground. i don't think it was quite that high. we thought it was some type of aircraft, but at that height there should have been some kind of sound. there was no sound...NO sound at all. the entire shape was a large black triangle, much bigger than our house, with 8 or 10 circular lights in a vee shape along it's edge. the lights were not very bright, more like a soft, yellowish glow...like on dim. it moved somewhat quickly across the sky and over the backyards of our street. we watched it as it traveled to the end of the yards, then made a sharp right turn, went a short distance, made another sharp right turn, and then a sharp left turn. we were running around to the front of the house to get a better look, when it made another final left turn and disappeared into the night sky. the entire event lasted about 20-30 seconds. we have hesitated to share this story with others, for fear of ridicule, but after finding your site listed in an article in our newspaper about other sighings in the area, we felt compelled to tell our story. the sighting was so amazing and unexplainable, we are convinced that we did in fact see a UFO."],"Case Number":"15957","Tags":"City","trends":["There have been 42 other sightings in Reading","There was one other sighting in Reading on or around February 12th 2009"],"Object Shape":"Triangle","Summary":"Triangular with 8-10 lights in vee shape.","Log Number":"US-03102009-0018","City":"Reading","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.343618,+-75.922185(15957)&iwloc=A&hl=en\"> mufon case (15957) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/15957.html.txt","/var/www/straped/mufon/org/15957.html"],"Sighting Duration":"Undisclosed"}