{"Date Submitted":"03/10/2009 11:16 UTC","Viewing Distance":"Unknown","Disposition":"Insufficient Data","City":"Colorado Springs","Object Features":"Undisclosed","divs":["Sighting DetailsI returned from a business meeting and was just beginning to brief one of my employees when I observed a large white orb in the air, stationary in what appeared several thousand feet upward. It was North East of Pikes Peak, just sitting there. I observed it from the 4th Floor of a downtown building while looking out a window. I pointed the object out to another employee who also observed it. We watched as the object began moving upwards and moved slowly South West over the mountain range and gaining addtional altitude. About that time, another person appeared in the office and also observed the object. He ran and got a pair of binoculars. I used the binoculars and saw that the object was clearly a white orb, with what appeared to be a small tail like a tear drop end facing in the direction the object was moving. When the person went to get a more powerful pair of binoculars, the object simply disappeared. We discussed what we had seen, and one possibility we proposed what that a large white balloon may have become unmoored from a car dealership or something and that the sun was reflecting making the balloon much whiter and more visable to the eye at that altitude. Maybe the tail was some of the little flags that are often attached to these types of advertising balloons? Anyway, based on how the wind was blowing, we didn't think that would account for the manner in which the object was stationary for so long, its size, nor how it moved so slowy away. Best guess is that it was the size of a VW Bug or bigger."],"Tags":"City","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around March 10th 2009"],"Sighting Duration":"Undisclosed","Date of the Event":"03/10/2009 11:16 UTC","Object Shape":"Sphere, Teardrop","files":["/var/www/straped/mufon/html2text/15953.html.txt","/var/www/straped/mufon/org/15953.html"],"Summary":"Observed object stationary north of Pikes Peak. Then moved slowly upward and then southwest and disappeared.","map":"<A HREF = \"http://maps.google.com/maps?q=38.838682,+-104.817163(15953)&iwloc=A&hl=en\"> mufon case (15953) map </A>","Source":"MUFON","Latitude":"38.838682","Weather Factors":"Unknown","Log Number":"US-03102009-0014","Country":"United States","Case Number":"15953","Region":"Colorado","Longitude":"-104.817163","Object Flight Path":"Undisclosed"}