{"divs":["Sighting DetailsI was going home along a narrow driveway in the yard. The sky was dark but not entirely black. There were no distinct clouds, - just enough vapor to dim the stars, but not the planets. In the narrow part of sky visible between the 3-store house (to my left) and some (leafless) trees on the right, low above the horizon, I noticed a glowing object, moving from left to right and slightly descending. The object was entirely silent. It looked like a bright planet (e. g. Venus) as seen from Earth, only a yellowish hue. My first thought was \"a meteor\"; however, the object was too bright and too slow moving for a meteor. It left no trace whatsoever. It took about 2 or 3 seconds for the object to cross the visible part of the sky and disappear behind the row of trees that stand beside the driveway. I hesitated for 5 seconds or so (thinking over the sighting and looking intently at that part of the sky), and ran forwards along the driveway so as to close in somewhat and to leave the trees beside. The object was not there. I thought, \"so much for the UFO\". It couldn't have been an airplane, because an airplane sporting this bright a light would have to be too close to me to move so silently. Even if it was an airplane whose engines were off, I would have noticed its fuselage. I turned around to the left to unlock the door, but took one more glance across my right shoulder. Lo, there was the object once again! It moved from right to left this time, still slightly descending, still silent. In another 2 or 3 seconds, it was covered by the building. The whole observed trajectory of the object could look like a piece of wide arc, going down. I only saw 2 segments of that arc. I don't even know if the second sighting was of the same object as the first. But they looked damn similar, that's for sure."],"Object Flight Path":"Undisclosed","Log Number":"RU-03102009-0016","Date of the Event":"03/08/2009 07:30 UTC","Object Features":"Undisclosed","Source":"MUFON","Region":"Sverdlovskaya oblast","Case Number":"15955","Latitude":"56.85","Sighting Duration":"00:00:40","Disposition":"Unresolved","Country":"Russian Federation","Weather Factors":"Unknown","Object Shape":"Fireball","City":"Yekaterinburg","Date Submitted":"03/08/2009 07:30 UTC","Longitude":"60.6","Summary":"Maneuvering glowing object in the sky. Unnatural speed. Silent.","files":["/var/www/straped/mufon/html2text/15955.html.txt","/var/www/straped/mufon/org/15955.html"],"Viewing Distance":"Unknown","trends":["There have been no other sightings in Yekaterinburg","This sighting has never been favorited."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=56.85,+60.6(15955)&iwloc=A&hl=en\"> mufon case (15955) map </A>"}