{"Tags":"City","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/15966.html.txt","/var/www/straped/mufon/org/15966.html"],"Object Features":"None","Summary":"White lights circling in a dense cloud.","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Date of the Event":"03/11/2009 08:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.501055,+-81.693729(15966)&iwloc=A&hl=en\"> mufon case (15966) map </A>","Region":"Ohio","Case Number":"15966","Object Shape":"Egg, Oval","Weather Factors":"Unknown","Longitude":"-81.693729","Latitude":"41.501055","Country":"United States","Date Submitted":"03/11/2009 08:18 UTC","Source":"MUFON","Log Number":"US-03112009-0008","City":"Cleveland","divs":["sighting detailswhite light\\lights circling in a dense cloud seemed to circle my way every 5 seconds. had my son come out he saw them too he thought that they were egg shaped. 2 passenger planes went by heading for hopkins. the sky is very clear tonight with lots of stars for the city. seen in the northest sky close to edgewater marina. i've seen similar circling lights before on feb. 7, 2007 and did not report there were more that time but a clear sky with isolated dense clouds. minutes after this sighting at about 8:42pm a large aircraft flew over lower than the passenger planes do and rattled the house this is not the usual hopkins flight path but west to east. both times in 2007 february and tonight i was on my back porch for an after dinner cigarette. 9:13 i just went to look and see if all the clouds had blown over and the the lights are in the clouds again and the mass of clouds has drifted more nw. my neighbor just emailed to say he heard the plane and thinks it is a military helo. i'm sort of freaked out but not as much as in 2007 when i didn't believe. p.s. the moon is full. 9:23 took my spouse outside he sees the lights but thinks its nothing."],"trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around March 11th 2009","This sighting has never been favorited.",""]}