{"Latitude":"39.15887","Summary":"A green-yellow phosphorescent ball of light dropped out of a dark winter night.","City":"Fruita","Longitude":"-108.728988","Object Features":"Undisclosed","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/15961.html.txt","/var/www/straped/mufon/org/15961.html"],"Case Number":"15961","Date Submitted":"12/23/2008 01:15 UTC","Log Number":"US-03112009-0003","Country":"United States","Region":"Colorado","Date of the Event":"12/23/2008 01:15 UTC","Object Shape":"Fireball, Triangle","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsWhile driving from Arizona to Eagle Colorado for the holidays I had turned onto I-70 and somewhere (We wrote down the mile marker but cannot find it at the moment) between the Utah border and Fruita my wife and I were talking. The radio was low and our little girl and dog were sound asleep in the back. It was a clear, cold Colorado winter night. Suddenly from the north this huge green-yellow phosphorescent triangular shaped ball of light came across the sky right in front of us! It was so bright and it had a rooster-tail like plume coming off the top of it. In the center of it the light was so bright it almost hurt to look at it. At first I thought it was a meteor but then it slowed down and then speeded up again going north to south. My wife could not stop saying \"what is that?! What is that?!\" it was pretty frightning. Suddenly these red lights shot out the back of it while it seemed to hover and then it quickly changed direction and rocketed off to the east (Same direction we were traveling) moving so fast that it became a pinpoit of light in a matter of seconds!! We looked for it to come back all the way to Eagle. I have witnessed a few other UFO's in my lifetime but I am SO GLAD my skeptical wife was able to witness this with me. She is still in disbelief."],"Tags":"City","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.15887,+-108.728988(15961)&iwloc=A&hl=en\"> mufon case (15961) map </A>","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Fruita","There were no other sightings in Fruita on or around December 23rd 2008"]}