{"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Date Submitted":"11/15/2001 08:00 UTC","Viewing Distance":"101-500 Feet","City":"Bellaire","trends":["There have been no other sightings in Bellaire","This sighting has never been favorited."],"Longitude":"-85.211173","Weather Factors":"Unknown","Latitude":"44.980282","Sighting Duration":"00:30:00","Source":"MUFON","Tags":"City","Object Shape":"Boomerang","Log Number":"","Date of the Event":"11/15/2001 08:00 UTC","files":["/var/www/straped/mufon/html2text/1596.html.txt","/var/www/straped/mufon/org/1596.html"],"Country":"United States","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.980282,+-85.211173(1596)&iwloc=A&hl=en\"> mufon case (1596) map </A>","divs":["Sighting DetailsWitness description as given via original report:At 8:00 pm Nov. 15, 2001, my wife and I noticed a large object, with red andwhite lights around the perimeter of its triangular shape (it had a steadyblinking white light near its aft) almost directly over our small local airport,moving slowly north to south. The object was much larger than a helicopter andmoved to slow to be a passenger jet. Itemitted a low, humming noise as it passed over. We got into our van and wentsouth of town where the object slowly disappeared. We watched for a few minutesasking each other if what we saw was real or imagined. After returning home(10-15 minutes since we first saw the object) there it was again, this timemoving south to north...same lights, same noise. My wife mentioned at the timethat she was having difficulty focusing on the object. I grabbed my camera andtook some shots that did not come out. We got into the van and headed north towhere we last saw the object. When we stopped and got out, we didnot see the object but we did see four jets (flying in military formation)moving north to south, when suddenly one jet broke off and flew to the west forseveral seconds before rejoing the group. We watched the jets fly south andjust as they were to go out of sight, another jet broke off, flew east then backtowards us and then continued moving northwest. We did not see the objectanymore but did call the local police, who said they did get some calls and thathe FAA had been notified. A follow up call the next day got us absolutelynowhere. We did notice that our home radio, which was tuned in to a localstation had gone to total static and would only fix itself after I turned it offthen on again."],"Case Number":"1596","Disposition":"Unresolved","Summary":"Boomerang shaped object emits humming sound in Mic"}