{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.094488,+-93.728425(15967)&iwloc=A&hl=en\"> mufon case (15967) map </A>","Latitude":"30.094488","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"15967","Viewing Distance":"Unknown","Longitude":"-93.728425","Log Number":"US-03112009-0009","Source":"MUFON","files":["/var/www/straped/mufon/html2text/15967.html.txt","/var/www/straped/mufon/org/15967.html"],"Date Submitted":"03/11/2009 08:30 UTC","trends":["There have been 3 other sightings in Orange","There were no other sightings in Orange on or around March 11th 2009"],"Date of the Event":"03/11/2009 08:30 UTC","Summary":"Star like light but much brighter. It was about at a 35 degree angle from where I was watching it.","Object Flight Path":"Hovering then path","Weather Factors":"Unknown","divs":["Sighting DetailsI went to take the dogs out and noticed a very bright star to the West of my position. I looked directly above me and noticed it was a cloudy night and thought it was odd that I could see this star. I walked out the the road to get a better view and noticed the object was below the clouds. I watched it for about 5 min and seen it move first vertical and then horizontal to the North. I went inside and asked my wife to come out and take a look at the light. She did not know what to say. She just kept asking me \"What is it\" We watched it for about 5 more min and it made some more vertical and horizontal moves but never moved beyond my view. I went in to the house to get my night vision binoculars (took about 2 min) and when I returned the object was gone. I scanned the sky with the night vision but never could find the object. I have went out on and off to see if it has returned for the past 30 min but nothing has come back. The clouds have lifted and stars have become more visible but nothing in the area of the object. I have heard of several reports as of late from areas around where I live but never seen anything myself. It just bothers me that I can't come up with a reasonable excuse for what I have just witnessed."],"Disposition":"IFO","City":"Orange","Object Shape":"Star-like","Region":"Texas","Object Features":"Unknown"}