{"Sighting Duration":"Undisclosed","Tags":"City","Region":"Minnesota","Date of the Event":"06/30/2008 12:00 UTC","trends":["There have been no other sightings in Sunburg","This sighting has never been favorited."],"Longitude":"-95.238356","Log Number":"US-03122009-0009","Object Shape":"Cylinder, Sphere","Disposition":"Unknown","Viewing Distance":"Unknown","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/15979.html.txt","/var/www/straped/mufon/org/15979.html"],"Summary":"The first time I saw it I noticed an object in the SE sky with numurous colors.","Date Submitted":"06/30/2008 12:00 UTC","Source":"MUFON","Case Number":"15979","Latitude":"45.34774","City":"Sunburg","map":"<A HREF = \"http://maps.google.com/maps?q=45.34774,+-95.238356(15979)&iwloc=A&hl=en\"> mufon case (15979) map </A>","divs":["Sighting DetailsMy Fiance and I were in the living room when I noticed something in the sky to the east where we usually see cars coming down our road from. I guess the thing that got my attention first was the brilliant colors. You could see red, green, white,yellow and sometimes purple with the naked eye. I watched it for a while and it seemed to be moving slowly toward the south. From about 8:00 pm it was in my SE direction from my house,when I first noticed it. I went to bed about 11:00 pm that night, and from the time I first noticed it until I went ot bed it had moved from the SE to pretty much straight south sky, and then back north almost straight above my house. I think it was the very next night I saw it again and I showed my Fiance and I was watching it for a while when she said hey, there's another one. I didn't believe her at first, then she said really, look over here, and sure enough there was another one towards the SW of the house. The next time I saw it I got my telescope since it seemed farther away, and tried to take some pictures but they just looked like apurplish red blob. I did seem to get a pretty good look at it though and it looked round with a flat or slightly domed top and bottom. At one point it looked like a bunch of orange squares rotating around it from my left to right with a brilliant white on the top and the bottom, this continued for a while and all of a sudden it looked like purple exploded out the top and bottom of it simultaniously. Shortly after I first saw it I got on the internet to see if a satelite would look like this and the only info I found was that it would look bright white. I have seen this thing in the sky quite frequently when there is no clouds, even just the other night. I finally found someone to ask about it and am doing so to clearify this as to what it could be. I guess what added to my interest is what else has happened to me personally in about the same time period I have been seeing this object. On 3-9-09 I fell and probably tore my rotor cuff. This has nothing to do with this, accept I knew I would probably be going to the doctor about it as it was really sore. Yesterday, Wednesday 3-11-09 I woke up for about the fourth time since about last summer with what I had been calling scratches on the upper back part of my right leg. Only this time I also had them on the front part of my leg just below my beltline going downward about 5 inches long. Prior to this I thought I had just did this myself, accept this time I could see them much better. There was about 4 marks spaced about 3 and a half inches wide and about 6 inches up and down. The weird thing was one line going down Y'ed off into 2 line and one of those two Y'ed into another line all totally continus like it formed out of one line with no gaps between. On the back of my leg was even more distinct or deaper marks only running horizontal just under my but cheak. This is where they had been before. Looking closer with a mirror, one of the lines in back of my leg Y'ed off twice like the one in front. I guess the Y ing off with no gap in the line got my attention the most. Well I went to my doctor today and had him look at my shoulder and then I said I would like him to look at my scratches. I told him it happens in my sleep, and I don't even wake up, I just notice a slight burning sensation when I wake up. He said he had absolutly no idea what it could be from, but he said to him it looks like it was done with a razor blade and asked me if I had any lapse of memory at any time. I said no cause it only happens when I'm sleeping. I still see this thing in the sky but it seems farther away lately. I would greatly appreciate any input you would have on this. I guess if you could have someone call me to talk about this, that would be great. Thank you for your time, it is appreciated. Steve"],"Country":"United States","Object Features":"Patterned Surface","Object Flight Path":"Stationary,Path with directional change"}