{"files":["/var/www/straped/mufon/html2text/15976.html.txt","/var/www/straped/mufon/more/15976_submitter_file1__unbelievable.JPG","/var/www/straped/mufon/more/15976_submitter_file2__GoogleskyBiggerPhoto.JPG","/var/www/straped/mufon/org/15976.html"],"Tags":"City","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around March 12th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=51.509199,+-0.123815(15976)&iwloc=A&hl=en\"> mufon case (15976) map </A>","Summary":"A glittering cigar object unlike anything else on google sky.","Date of the Event":"03/12/2009 12:00 UTC","Object Flight Path":"Unknown","Latitude":"51.509199","Source":"MUFON","Longitude":"-0.123815","divs":["Sighting DetailsI was researching a project i'm doing ref:Abduction cases like Betty and Barney Hill and the Fish Map,Locating it on google sky and cataloging it, The same with Billy Meiers and Pleidians. Pyamids and other unknowns spotted on the Moon and different planets. Also i'm trying to see if I can match every pyramid,Ziggurats,Megaliths and Temples from all over world on Earth and to a particular star system and see if there's any activity there.If there is pyramids on Mars and Venus then there might be activity around them planets. I just zoomed in on Venus and something caught my eye and I have no idea what it is which is why I am sending it to you. My heart sank as soon as I saw it and my feeling is that it could possibly be a UFO. All I know is that I have had a interest in U.f.O's since I was a child and do a lot of research with 10 year old UFO magazines which is great when i'm comparing the sightings of today. Anyway this picture is proberly nothing but I feel glad to have informed you. Kind Regards Vicky"],"Region":"England","Date Submitted":"03/12/2009 12:00 UTC","Country":"United Kingdom","Object Shape":"Cigar","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"GB-03122009-0006","Disposition":"Unresolved","Case Number":"15976","City":"London","Viewing Distance":"Unknown","Object Features":"Other"}