{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.38675,+-118.527105(15974)&iwloc=A&hl=en\"> mufon case (15974) map </A>","City":"Santa Clarita","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around June 1st 1990"],"Date of the Event":"06/01/1990 06:45 UTC","Weather Factors":"None","Object Features":"Dome, Other","Object Flight Path":"Stationary","Object Shape":"Disc, Square, Rectagular, Other","divs":["sighting detailsearly morning 6:45 am. june 1st, 1990. newhall \\ santa clarita, ca. beautiful clear skies, unlimited visibility. driving on circle j road (now is oak ridge road) towards san fernando road. there is a large, 200 feet across, dry wash basin paralleling san fernando road, and on the other side of the wash basin is a line of high power electrical lines. san fernando road was under construction, reduced to less driving lanes due to widening of the road. i come to stop at the intersection facing san fernando rd. it is a \"t\" intersection which at this time has a temporary traffic signal directly in front of me on the other side of the road, approx distance 60 feet. as i am waiting for the red light to change i noticed something dark hovering in the sky to the left and at the same visual height as the traffic light but stationary and adjacent to the high power line directly across the wash. how could you miss it? it is flat black or very dark gray in color, stealth looking, a large object approx. 100 feet across. i do not remember any sound associated with it. the shape is hard to describe and i have never seen anything like it in pictures. it basically was a disk shape with a cap top that extends slightly over the sides, small vertical straight sides or slightly angled in top to bottom, and a flat bottom thats diameter was less than the cap. it had details, shapes on the sides below the cap. the visual of the object was obscured slightly by what i would associate observing heat coming off a highway in the summer. its position is approx. 400 yds direct line of sight from me at 10 o'clock, vertical . the object was stationary in the air, i do not remember it moving in any way, just the heat waves obscuring the view. i did not drive away when the light changed and chose to stay and continue observing the craft for a couple light changes. cars were stopped behind me honking their horn for me to proceed so i finally did pointing to what i was observing, driving up the road half mile to the fire station on san fernando. where i parked, got out and i could still see the object. i continued observing for a few minutes realizing i was late for work. i had to go. it was a weird experience, i felt maybe i was the only one that could see it. did anybody else see it?"],"Region":"California","Source":"MUFON","Viewing Distance":"101-500 Feet","Tags":"City","Latitude":"34.38675","Date Submitted":"06/01/1990 06:45 UTC","Case Number":"15974","Log Number":"US-03122009-0004","Country":"United States","files":["/var/www/straped/mufon/html2text/15974.html.txt","/var/www/straped/mufon/org/15974.html"],"Disposition":"Unknown","Longitude":"-118.527105","Summary":"Observed daylight visual of craft hovering adjacent to high power electrical tower while sitting at traffic light."}