{"Case Number":"15978","Object Flight Path":"Other","Date Submitted":"03/12/2009 12:00 UTC","Date of the Event":"03/12/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/15978.html.txt","/var/www/straped/mufon/more/15978_submitter_file1__GS-WWTAnomaly1.JPG","/var/www/straped/mufon/more/15978_submitter_file2__GS-WWTAnomaly2.JPG","/var/www/straped/mufon/more/15978_submitter_file3__GS-WWTAnomaly3.JPG","/var/www/straped/mufon/org/15978.html"],"Log Number":"US-03122009-0008","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","divs":["sighting detailsin the report from vicky in the uk event id\\case number: 15976 she write's: \"i was researching a project i'm doing ref:abduction cases like betty and barney hill and the fish map,locating it on google sky and cataloging it, the same with billy meiers and pleidians. pyamids and other unknowns spotted on the moon and different planets. also i'm trying to see if i can match every pyramid,ziggurats,megaliths and temples from all over world on earth and to a particular star system and see if there's any activity there.if there is pyramids on mars and venus then there might be activity around them planets. i just zoomed in on venus and something caught my eye and i have no idea what it is which is why i am sending it to you. my heart sank as soon as i saw it and my feeling is that it could possibly be a ufo. all i know is that i have had a interest in u.f.o's since i was a child and do a lot of research with 10 year old ufo magazines which is great when i'm comparing the sightings of today. anyway this picture is proberly nothing but i feel glad to have informed you. kind regards vicky \" out of curiousity i decided to cross reference it against the world wide telescope. i did not find the \"object\" at the coordinates where it can be found on google sky, however i did find this on the wwt in the same general vicinity: +0h 40m 46s, 13:16:38 ! and!!! corroborated this object also on google sky! screenshots attached. attachment 1 is of the object vicky discovered attachment 2 is of the object i discovered on the world wide telescope attachment 3 is this same object found on google sky"],"Longitude":"-82.900923","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Features":"Patterned Surface, Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.426897,+-82.900923(15978)&iwloc=A&hl=en\"> mufon case (15978) map </A>","trends":[""],"Latitude":"40.426897","Object Shape":"Cigar, Cylinder, Other","Region":"Ohio","City":"Undisclosed","Country":"United States","Summary":"Corroboration of earlier post by Vicky in the UK re: anomaly on Google Sky"}