{"Log Number":"US-03122009-0003","Longitude":"-85.599134","trends":[],"Summary":"I saw a bright light moving away from me it took an incredibly sharp 90 deg turn to the left (west) and sped off at speeds I have never seen.","Date of the Event":"07/04/2005 12:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.324584,+-85.599134(15973)&iwloc=A&hl=en\"> mufon case (15973) map </A>","Region":"Michigan","Object Features":"Unknown","Object Shape":"Star-like","Latitude":"44.324584","Country":"United States","Disposition":"Unknown","Source":"MUFON","Case Number":"15973","Viewing Distance":"Over One Mile","divs":["Sighting DetailsIt was a warm clear summer night. I was sitting on my boat doing some late night-early morning fishing as I had often done, when I noticed a bright light approximately 10 miles or so away.I was facing that direction already so it was no effort to look up. This was a very common sight because the international airport is about 25 miles to the south east. At first I thought it was an aircraft with it's landing lights on, but after a minute or so I realized the aircraft was going away from me. I thought it was odd because I could not remember ever seeing landing lights on a plane that was going away from me. I contemplated what it was. I thought it might be a jet with it's afterburner on. The aircraft was climbing steadily at about a 30 degree angle or so. I figured it might be the sun shining on it from the horizon. I watched as the light moved further and further away. It was also getting smaller and eventually kind of looked like a star. Then all of a sudden it took an immediate 90 degree sharp turn to the left (west) and increased its speed to an incredible rate and disappeared. I have never seen anything that could turn on a dime like that and I have never seen an aircraft go that fast before and I was in the military. After I got home I told my wife what I saw. I also told my co-workers what I saw when I went back to work. I am a fairly intelligent person, and I never believed in ufos before that. Ever since then I am completely convinced that the \"aircraft\" was in fact either a ufo or some kind of military aircraft that the world does not know about yet."],"Object Flight Path":"Path with directional change","Tags":"City","files":["/var/www/straped/mufon/html2text/15973.html.txt","/var/www/straped/mufon/org/15973.html"],"Date Submitted":"07/04/2005 12:00 UTC","Sighting Duration":"Undisclosed","City":"Undisclosed"}