{"files":["/var/www/straped/mufon/html2text/15984.html.txt","/var/www/straped/mufon/org/15984.html"],"Weather Factors":"Unknown","Summary":"Black triangle seen flying overhead.","Region":"Illinois","Longitude":"-87.627398","Sighting Duration":"Undisclosed","Date Submitted":"03/12/2009 05:45 UTC","divs":["Sighting DetailsI was walking my dog in the morning when I noticed a bright white light off in the distance. I didn't pay to much attention to it, thinking it was just an airplane. After a minute the light was closer and I could notice two blinking white lights behind it. Again, I assumed it was an airplane's winglights. After a few more minutes heard a low humming noise and looked above me. Floating by was a low flying large trianglular craft. The tip of it emitted a bright white light and the two end point had blinking blue lights. The bottom of the craft had 3 rows of thin dim yellow lights. After I had noticed it, it changed direction by about 70 degrees bearing north and then headed almost due west towards Chicago. The light remained in sight for several minutes after the event, then i lost it beyond a treeline. During and after the event I was terrified. This may have been the most terrifying expirience of my life. I have contacted local authorities and local airports, none of which report unusual activity or craft in the area at the time. No reports on this have been filed either."],"Date of the Event":"03/12/2009 05:45 UTC","Viewing Distance":"101-500 Feet","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Triangle","Source":"MUFON","Case Number":"15984","Latitude":"41.880934","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around March 12th 2009"],"Country":"United States","Disposition":"Insufficient Data","City":"Chicago","Log Number":"US-03122009-0014","map":"<A HREF = \"http://maps.google.com/maps?q=41.880934,+-87.627398(15984)&iwloc=A&hl=en\"> mufon case (15984) map </A>","Object Features":"None"}