{"Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/15980.html.txt","/var/www/straped/mufon/org/15980.html"],"Log Number":"US-03122009-0010","Tags":"City","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"15980","map":"<A HREF = \"http://maps.google.com/maps?q=43.884007,+-121.43864(15980)&iwloc=A&hl=en\"> mufon case (15980) map </A>","Longitude":"-121.43864","trends":["There have been no other sightings in Sunriver","This sighting has never been favorited."],"divs":["Sighting DetailsFebruary 17, 2009 PST 21:40 Local time. South of Sunriver Oregon on South Century Dr. Traveling south on South Century Dr. at N 43 49.321 & W 121 26.600. A bright green-blue light descending from SE toward West. Viewed for about 2 seconds. Transverses an angular change of 35-45 degrees, to the right front of my south bound vehicle, toward the west. Clear sky and stars visible, no moon that I noticed. Appeared to be below 80 feet (8 story building) AGL and descending at about a 5 degree angle toward the west. Above some trees on the south side of South Century Dr.. What I expected to witness was a crash of an airplane because the light looked very much like an aircraft right wing navigation light. I had just passed the fire station on South Century Dr. and of course that is an area where helicopters land. There is an illuminated helicopter landing pad there. No activity at the fire station that I noticed, no ambulance or other vehicles that I noticed. All quiet at the fire station. As I rounded the turn to the west on South Century Dr., I stopped the car and rolled down the window. No sounds. No airplane engine sound, no crash, no helicopter rotor blade or engine sounds, nothing. I stopped the car within 20-30 seconds of seeing the light. No debris trail like a meteor from the light, Simply a bright greenish-blue light that came on and went out 2 seconds later. The light came on and extinguished before the angle it was descending at would have made contact with the ground. I estimate the light was south of South Century Dr. after it turns west at the intersection with Huntington Rd. That would be a distance of about 500-600 feet from my position which was north of the turn about 200-300 feet. I guess speed to be in the 150 MPH range. The light moved faster than most helicopters but at about the approach speed of a business jet that could have been inbound to the Sunriver airport which is about 3 miles to the north. I consider the fact that both a helicopter landing pad nearby and general aviation airport 3 miles north has nothing to do with the light as I perceive it to not be from an airplane. I am a retired aviation professional with 25 years and 20,000 hours of flying experience, many aviation related certificates including a licensed aircraft mechanic A&P. I have flow Lear Jets and Cessna Citations, Boeing 737, 727 and Fairchild F-27 airplanes along with 125 different types of general aviation airplanes. It would be difficult to confuse me about airplanes, their lights, sounds and flight characteristics. I have submitted this report to the Northwest UFO group website."],"City":"Sunriver","Sighting Duration":"Undisclosed","Latitude":"43.884007","Date of the Event":"02/17/2009 09:40 UTC","Summary":"Witnessed what I thought was the green right wing tip navigation light of a corporate jet headed for a crash south of the Sunriver Airport.","Region":"Oregon","Date Submitted":"02/17/2009 09:40 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","Weather Factors":"None","Object Features":"None, Unknown"}