{"Weather Factors":"Does Not Apply","Region":"West Virginia","Country":"United States","files":["/var/www/straped/mufon/html2text/15987.html.txt","/var/www/straped/mufon/org/15987.html"],"Log Number":"US-03122009-0017","Tags":"City","Object Shape":"Triangle","Case Number":"15987","Viewing Distance":"21-100 Feet","Latitude":"38.224837","trends":["There have been no other sightings in Richwood","This sighting has never been favorited."],"Summary":"Object appeared in the distance and flew overtop of us.","Date of the Event":"11/30/1988 12:00 UTC","divs":["Sighting DetailsThis happened in the late 80's at Summit Lake in the Monongalia National Park. It was right around dusk. The sun was settings and the sky was very clear. Some friends and I went to the lake to hang out for awhile. We were not drinking or doing any type of drugs. There was five of us all together. We had parked in the boat ramp area. As we were standing around talking not long after we arrived, my one friend Danny, said he noticed a light which appeared to be comming up through the tree line on a distant hill. At first noone else saw this. After a few minutes it became visable that something was there. At the spot we were standing it was hard to say if it was comming closer or was rising from behind the hillside when we all first saw it together. As it got closer we all noticed it was not making any noise at all. If I had to guess the height in which it flew over us, I would have to say 300-400 feet above us. As it got closer it was obvious it was triangle shaped with a white light on each corner. It practically went directly over us and kept going over the horizon towards the town Of Richwood. Which was the closest town to where we were. We did not see anything else after it had gone over the horizon. It wasnt moving at a high rate of speed. It was slow enough to make out the shape and the lights. I have not seen any of my friends from that night in almost 20 years. Oddly enough, Danny and I got in touch a few weeks ago on the phone. He brought this up to me after all this time. He thought he would ask me if I remembered this event and I did. He said he wanted to make sure he wasnt imagining it after all these years. All our lives we had heard there was a secret military base hidden in the mountains. I have never seen or heard anything to this day that would prove the rumor. But that night made me wonder if they were true. I have never seen anything like that ever again."],"Longitude":"-80.533141","Date Submitted":"11/30/1988 12:00 UTC","Disposition":"Insufficient Data","Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.224837,+-80.533141(15987)&iwloc=A&hl=en\"> mufon case (15987) map </A>","City":"Richwood"}