{"Longitude":"-114.315655","Date of the Event":"03/13/2009 05:30 UTC","Source":"MUFON","Log Number":"US-03132009-0002","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/15993.html.txt","/var/www/straped/mufon/org/15993.html"],"Weather Factors":"Unknown","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around March 13th 2009"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.485001,+-114.315655(15993)&iwloc=A&hl=en\"> mufon case (15993) map </A>","Latitude":"34.485001","Object Shape":"Other","Region":"Arizona","Viewing Distance":"Unknown","Date Submitted":"03/13/2009 05:30 UTC","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Lake Havasu City","Case Number":"15993","divs":["sighting detailsi am reporting this on behalf of my co-workers. they know i often see these types of thing and are embarrassed but astounded by what they saw. two witnesses traveling in separate vehicles on the same stretch of road at approx. 5:30am march 13th met at work and excitedly asked each other if they \"saw that thing over the golf course\". i arrived a few minutes later at the office and they described it to me. description: elongated, orange\\amber glowing edge of a possible craft of unknown size and shape. they both could make out that there was something large and dark trailing behind the glowing light and that the light was \"attached\" to the object. the glowing portion was symmetrical. when one of the witnesses stopped and got out of the vehicle to observe, she noticed a \"twinkling\" or \"ember-type\" of material lightly \"sprinkling\" or \"trickling\" down from the lighted area. the craft moved very slowly from north to south and was within the city limits. the distance above the ground was approx. 600-800ft. or \"two or three football fields up\". both witnesses were pressed to get to work so the longest encounter lasted about 2 minutes. 10 minutes after the event was first witnessed i drove around the area to see if i could spot it. i didn't see anything. i spoke to a person on the golf course that was outside working during the event, he did not get a look at it either."],"Summary":"Elongated, amber glow - slowly moving across the horizon, 600-800 ft. above ground."}