{"Date Submitted":"06/25/1976 09:10 UTC","Weather Factors":"Unknown","Object Shape":"Disc","Source":"MUFON","Log Number":"US-03132009-0006","Longitude":"-89.696219","trends":["There have been no other sightings in Sterling","This sighting has never been favorited."],"Case Number":"15996","Object Flight Path":"Path with directional change","Date of the Event":"06/25/1976 09:10 UTC","Country":"United States","Viewing Distance":"101-500 Feet","City":"Sterling","Summary":"At night, large, disk shaped, spectacular color, no noise, close prox., slow rectangular passes, 60' off ground, 20 minutes.","files":["/var/www/straped/mufon/html2text/15996.html.txt","/var/www/straped/mufon/org/15996.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.788642,+-89.696219(15996)&iwloc=A&hl=en\"> mufon case (15996) map </A>","Region":"Illinois","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"41.788642","Disposition":"Unresolved","divs":["Sighting DetailsWe were coming back from dinner at a restaurant from a nearby town. (Dixon, IL.) at about 9 pm. I was with my fiance and future mother and father in-law. My future in-laws just took us out for our engagement dinner celebrating out marriage coming up in September. About 5 or 6 miles from Sterling I saw a very bright light low to the south maybe 10 degrees above the horizon, and stationary. This interested me being an amateur astronomer (have a Questar 7) for about seven years, and being familiar with Venus, Jupiter and other bright objects in the night sky. The sun had set about an half hour earlier and just a faint glow of twilight was in the west, but basically it was dark. Chicago being 100 miles to the east, it is not uncommon to see large commercial planes coming at you directly from the east with their landing lights still on slowly gaining altitude without any apparent motion, but as the craft comes closer motion can be finally detected and increases as they eventually pass overhead or therabouts. But this was different. It was motionless, and motionless. I kept quiet, being that I was the only one having seen it so far, and waited for it to move marking it in sky visually. It did not. I remarked then almost a minute later about this unusual motionless bright object. As we got closer it was apparent we were on a course to intercept this object. By this time I was quite excited and captivated as we approached the main highway where this object was hovering. With the object just 100 yards or less my father in- law (pulled onto the highway trying to watch and drive at the same time. I told him to puill over aobut 3 times and finally he pulled off onto the shoulder behind several other cars with people already out of their cars and watching this object. It was captivating. I have tried to find the drawings I made afterwards and notes I have yet to find them. Back then I told this story many times in detail to a point it became ingrained in me but now 32 years later the estimation in size may be slightly off but I believe well within the ballpark. But here goes. When we got out of the car the object was coming right at us slowly maybe 10-15 miles an hour. I When it became alarmingly close (70 yards?) and maybe 45 degrees up, I then got a good look at the size and shape of this thing. I had been an airman in the Navy for 4 years, (66-70) working with the A-6A Intruder as a plane captain receiving many of these and other jet aircraft types as well on the flightline and on carrier parking them for post flight inspections, but I have have never received one of these babies and didn't really want to chalk this guy. It was approx. 65-75' in diameter, disk shaped, and about 10,and brilliantly lit up. Before it broke out of its pattern, it made about 6or 7 rectanglar passes each time coming at us raising up to its' closest point and then banking slightly (tilted) to the direction (west) for about 75 yards, south for 100 yards, 75 yards to the east then at us (100 yards) to the north doing this 6-7 times. Being dark without the lights was impossible to tell the shape except for the lights. The Lights! Spectacular almost hypnotic at times. The ten foot heighth of the craft was divided up into about 5'wide by 10 high panels side by side each fully lit. (from inside?) outlining the shape as disk shape. But each panel went on and off and synchronized, moving rotating completely around the craft all the time it made these passes. The motion was quite rapid as I recall and at times had a reverse movement. It reminded me when as a boy I would turn my bicycle upside down, crank the pedal as fast as I could get it and watch the wheel and spokes make that reverse motion similar to some affects I've seen in the aurora borealis. Almost hynotic and quite spectacular. Anorher unsusal thing I noticed was that it made no sound. The only sound I heard an almost undetectable sound of the wind being cut as it rotated. A gentle cutting of the wind. In my mind I am gong over all the possible things this could be and I was coming up with a zero. Plane? moving too slow and no noise. Helicopter? No noise, too small. Balloon or dirigible? Don't think so. So what was it. I mentioned to Linda I wanted to run across the highway before its next pass, lie down in the grass and wait for it to pass overhead to get even a closer look, but she would not let me. And to tell you the truth part of me wanted to go and part of me said stay put which I did. Finally it slowly broke pattern and went off to the east. We were all getting into our vehicles when the person ahead said it was a helicopter but it could not have been. As we were coming into town still in sight I noticed it had now turned on colored maybe even blinking lights and then I lost sight of it. The next day I looked for headlines concerning this sighting especially being seen by scores, but I saw nothing in the newspapers. It was said that it was a dirigible hired to make passes over a nearby residence in celebration of someones birthday and I always had a problem with that explanation being there was not a house close. Thank you for listening. It is unusual with such a spectacular, captivating and entertaining tool at our use it has never been seen again to my knowledge any where else. Jim Stroup"],"Object Features":"Window(s), Patterned Surface"}