{"Date of the Event":"08/01/1990 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16008.html.txt","/var/www/straped/mufon/org/16008.html"],"divs":["Sighting DetailsI was on a trip with my friend to drive to the west coast from Rochester NY. In the middle of the night,we were driving in the Utah or Nevada dessert and I slowly approached a light that I could see for about two or three miles away. As I got to the light, which was about 500 to 600 meters away from the road on the passenger side, it appeared that I could not get away from it, it appeared to be following me parallel to the road and my car path once I got to a 90 degree angle of it. I decided to look at my clock, and my speed, and it turns out that this light object followed my car for about 12 to 15 minutes, and I was going 75 miles per hour(about 15 miles it followed me). From 500 meters off of the road on the passenger side, the object lit up the dessert and my car so bright as if you turned the light on in a dark room. The object floated above the ground, close to the ground, as it followed us. It was a white light, and it slowly \"let us go\" as it quit keeping up with me. At the time I didn't think anything of this, but the more I think about it, it seems weird. What kind of energy goes into creating a light which can light up my car from 500 meters away. I worked in video production and I know a 1K light is barely enough to be a spot light for 150 feet. There was nothing in the dessert, not other lights nor other cars nor rest stops. This object was out in the middle of nowhere, the ground was flat in between myself and the object. This is the truth."],"Disposition":"Unknown","Case Number":"16008","Source":"MUFON","City":"Unknown-Middle of the des","trends":["There have been no other sightings in Unknown-Middle of the des","This sighting has never been favorited."],"Longitude":"-116.417889","Viewing Distance":"Unknown","Summary":"Bright light Follows my car for 15 miles.","Region":"Nevada","Date Submitted":"08/01/1990 12:00 UTC","Latitude":"38.80657","Country":"United States","Object Flight Path":"Undisclosed","Log Number":"US-03142009-0005","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.80657,+-116.417889(16008)&iwloc=A&hl=en\"> mufon case (16008) map </A>","Object Features":"Undisclosed"}