{"Object Shape":"Star-like","Object Flight Path":"Stationary","Object Features":"Unknown","Log Number":"US-03142009-0006","trends":["There have been 6 other sightings in Georgetown","There were no other sightings in Georgetown on or around January 20th 2009"],"Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.216387,+-84.554851(16009)&iwloc=A&hl=en\"> mufon case (16009) map </A>","Latitude":"38.216387","Source":"MUFON","City":"Georgetown","Date of the Event":"01/20/2009 10:30 UTC","Case Number":"16009","Date Submitted":"01/20/2009 10:30 UTC","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"Lower than a star. Nowhere in the vicinity of Saturn that night. Hovering. Bright white light. near I-75 , seemed to get brighter at times.","Tags":"City","divs":["Sighting DetailsMy fiance and I were driving north bound on Lisle road one night toward town. I was in the passenger seat and my attention was imediatly captured. This object was too low to be a star. bright white light illuminated it. Saturn was visible that time of month but was in a more western part of the sky i think. i imediatly began to realize that this thing wasn't moving. no lights indicating a plane. i looked and stared at it to move, but the contour of the road, the turns...made me realize this thing was stationary. i had to move closer tho the windshield to keep my eyes on it and i knew something was up when we went right underneath of it! it had to be about 1,000 ft. up, i say that because the planes that usually land at the bluegrass airport, nearby in lexington , are seen around that altitude when assuming their descention. i began to lose sight of it when we turned a corner and it disappeared over the tree line. only when i turned around to see it throught he rear windshield, did my fiance turn and ask what was going on. i just shrugged it off, and told him he would think i was going crazy. a couple of days later, i was coming down Lisle Rd. the opposite way during the day and to the Left of me is I-75, to the right, open field and a 200 ft. radio communications tower. as i approached the railroad tracks near the tower, i notice multiple satellite dishes. 15'-20' in diameter. pointed in the same direction. this is where i first noticed this object, i remembered and it gave me goosebumps. i'm not supposed to think that there are extraterrestrials out there, it is against my faith, i am not wrong in what i saw and i haven't been able to stop reasearching since. this is the first time i've contacted an organization that i trust about it. all i know is.....my life will never be the same."],"Region":"Kentucky","files":["/var/www/straped/mufon/html2text/16009.html.txt","/var/www/straped/mufon/org/16009.html"],"Country":"United States","Longitude":"-84.554851","Viewing Distance":"101-500 Feet"}