{"Date Submitted":"06/05/1981 03:00 UTC","Object Flight Path":"Stationary","Region":"New York","divs":["Sighting DetailsTo whomever can help me. I am a 41 year old woman. I work as a nursing supervisor in a rehabilitation center. I am married with 4 children and 2 grandchildren. I lead a pretty normal life. But there is something that has stayed with me since the age of 14. Here goes...i asleep in my living room, on the couch. It was sometime in the mddle of the night. at first i thought it was a dream, but now i do not believe so. i awoke to a humming, almost a vibration in my head. the room which was pitch black was all lit from a bright light source coming from outside the windows. The curtains were blowing almost completely horizontal. I remeber trying to move but i was paralyzed. all i could do was open my eyes. this humming and bright light lasted for what seemed like an eternity. I would guess 30 min or so. thats all i can remember. the next day i was terrified. the fear stayed with me allthese years. if it was a dream, it would have faded. also less than a week after my experience my mother and her friend followed a disc shaped object in the night sky that was illuminated with bright yelow lights all around it which seemed to move in unnatural directions, less than 10 miles from my home. i never told anyone of my experience until now for fear of ridicule. what happened. can anyone help me? -- Sharon Foster 6080 Updyke Road Trumansburg NY 14886 Tel#607-229-9595"],"Date of the Event":"06/05/1981 03:00 UTC","Weather Factors":"None","Tags":"City","Viewing Distance":"21-100 Feet","Case Number":"16006","Latitude":"42.6363","Source":"MUFON","Sighting Duration":"00:30:00","City":"Boston","trends":["There have been 3 other sightings in Boston","There were no other sightings in Boston on or around June 5th 1981"],"Log Number":"US-03142009-0003","Summary":"Strange humming/vibration in head with paralysis with sitting following less than 1 wk after.","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.6363,+-78.734639(16006)&iwloc=A&hl=en\"> mufon case (16006) map </A>","Disposition":"Insufficient Data","Country":"United States","Longitude":"-78.734639","Object Shape":"Disc, Unknown","files":["/var/www/straped/mufon/html2text/16006.html.txt","/var/www/straped/mufon/org/16006.html"]}