{"divs":["Sighting DetailsI was out in the early morning walking my dog. It was 5:45. I was looking east, up my street when I looked up and saw this long grey box shape coming toward me in the sky.It was coming at me from over the houses rather then the street. At first I thought it was a plane but then I relized it was not. It was very silent with out ANY noise. As it came to be right above me, I, becoming nervous and kinda scared, moved to my porch and looked up. The bottom was grey, with what looked like black lines on it. It looked like it was 2 stories high, and by that I mean it had 2 stories. It had lines on top and bottom that made it look like it had windows, but with no lights. As it moved on I noticed the only lights I could see .It had three lights. 2 red ones , one on each side, and one white, in the middle. As it came over the houses, it curved and moved over the street and out toward the north. From the time I first saw it to the moment it glided over me and on out of sight was about 10 minutes. If you would like to contact me I have given my name and email address. Thank you.."],"Region":"Massachusetts","Date Submitted":"03/13/2009 05:45 UTC","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Window(s), Patterned Surface","Summary":"Grey, silent long box shape with 2 stories of what looks like colorless window side by side. Bottom was grey with black lines.","Longitude":"-71.020061","Tags":"City","Object Flight Path":"Path with directional change","Log Number":"US-03142009-0002","Country":"United States","Case Number":"16005","files":["/var/www/straped/mufon/html2text/16005.html.txt","/var/www/straped/mufon/org/16005.html"],"Sighting Duration":"Undisclosed","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around March 13th 2009"],"Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Shape":"Square, Rectagular","Date of the Event":"03/13/2009 05:45 UTC","City":"Boston","map":"<A HREF = \"http://maps.google.com/maps?q=42.369543,+-71.020061(16005)&iwloc=A&hl=en\"> mufon case (16005) map </A>","Latitude":"42.369543"}