{"files":["/var/www/straped/mufon/html2text/16007.html.txt","/var/www/straped/mufon/org/16007.html"],"Date of the Event":"03/13/2009 12:00 UTC","Longitude":"-119.770016","Date Submitted":"03/13/2009 12:00 UTC","divs":["sighting detailsi saw it when going in my back door i noticed it because there are no stars at that low in the sky and this one is extremely bright. i thought maybe it was a planet but planets\\stars ect..dont act like this. i went in a grabbed my binoculars and steady them on the top of the car parked in the driveway. thats when i witnessed it was changing shapes, size, intensity, and occasionally it will drop something out the bottom and it will hang there for a few seconds and then it goes back up into it again. it will also split in 2 for a few seconds and the rejoin and reshape again. this started 4 nights ago and has been there every night from sundown till about 9 to 10pm. then slowly drops out of sight. this takes about 5 to 10 minutes before its down out of sight. i dont know of any stars or planets that behave this way. my wife and i jumped in the car last night to try and get closer to it, we drove at least 15 miles towards it and it just seemed to slip away as we closed on it. as far as feelings and emotions...i just want to know what this is. if its a ufo...then lets find out before it leaves for good. this is not a case of i saw it and now its gone...this thing has been here 4 nights in a row. i have video and stills of it. the video and a few of the stills were taken with the camera sitting aon the rear window of the car so as to eliminate shaking. i'm telling you send someone out here...pronto"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.756777,+-119.770016(16007)&iwloc=A&hl=en\"> mufon case (16007) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-03142009-0004","Latitude":"36.756777","Weather Factors":"Unknown","Case Number":"16007","Region":"California","Object Flight Path":"Undisclosed","Summary":"Starts by looking like a brilliant star and constantly changes shape, size, intensity etc.","Source":"MUFON","Tags":"City","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around March 13th 2009"],"Country":"United States","Object Shape":"Boomerang, Circle, Cylinder, Star-like","Disposition":"IFO","City":"Fresno"}