{"trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around March 7th 2009"],"Object Features":"None","Weather Factors":"Windy, Light","Viewing Distance":"Unknown","Sighting Duration":"12:07:25","Date Submitted":"03/07/2009 01:07 UTC","Region":"Colorado","Log Number":"US-03132009-0013","Summary":"While walking saw black somewhat round object over head.","divs":["Sighting Details I was just taking a lunch break and going for a walk when I had this sensation that I had better look up, and as I did I immediatly saw this black round object that seemed to float, spin, and dip along in the air. I was determined to not take my eyes off of it for one moment. The object stayed in my field of view for approximately two minutes total. The wind was out of the southwest at a brisk fifteen m.p.h. The black object changed shape several times as I watched it. I thought at first it must be a plastic bag of some sort but it continued to fly directly against the wind! The approximate altitude I would guess was at about 1200 feet at first site. The object then moved directly over where I was standing and appeared to come closer to me, I would guess to about 800 ft. Then I could clearly see the surface seemed to be folding in on itself! It did have a somewhat metalic (or plastic) shine to it. This thing then moved back up to about 1000 ft. and proceeded on its course to the southwest. The oddest thing that occured to me as I tried to give myself an honest evaluation as to its make-up was that it appeared to be TRYING to look like a plastic bag! As this thing began to move away I tried to hurry to a better spot so I could keep it in sight, and as I watched it changed to a classic saucer shape and a little further on to a delta wing shape. Just amazing! It then was momentarily obscured by some trees, and I lost sight of it. I only wish I had my camera."],"Source":"MUFON","Date of the Event":"03/07/2009 01:07 UTC","Longitude":"-104.607391","Latitude":"38.255517","map":"<A HREF = \"http://maps.google.com/maps?q=38.255517,+-104.607391(16003)&iwloc=A&hl=en\"> mufon case (16003) map </A>","City":"Pueblo","Case Number":"16003","Object Shape":"Disc, Sphere, Other","Disposition":"Insufficient Data","Country":"United States","files":["/var/www/straped/mufon/html2text/16003.html.txt","/var/www/straped/mufon/org/16003.html"],"Tags":"City","Object Flight Path":"Path with directional change,Path then hovering"}