{"Latitude":"41.017594","Date of the Event":"07/31/1967 10:00 UTC","Case Number":"16015","files":["/var/www/straped/mufon/html2text/16015.html.txt","/var/www/straped/mufon/org/16015.html"],"Source":"MUFON","Date Submitted":"07/31/1967 10:00 UTC","trends":["There have been no other sightings in Chariton","This sighting has never been favorited."],"Object Features":"Dome","Region":"Iowa","Disposition":"Unknown","Log Number":"US-03142009-0012","divs":["Sighting DetailsIt was a humid summer night in Southern Iowa. I was on a car ride with six of my friends. We were told by the driver of the car that we were to go meet a 'friend'. We drove to the country into a quiet, secluded valley on a shale road. The car was stopped at the bottom and we all jumped out to wait for the 'friend' to show. Nothing happened for a while. Eventually, the driver announced the friend was on his way as he pointed to the sky. The rest of us went along with the story, laughing and making jokes about the new 'friend' who was about to join us. Things changed when we soon saw something that looked like a star slowing moving across the sky. As I watched it, I didn't really think much of it--it was possibly an airplane until it was obviously moving towards us. Everyone decided to get back into the car. It ultimately became clear that it wasn't a star because it became bigger and bigger. It was a spaceship. To give an idea of it's size-there were many willow trees in the valley where we were parked and the ship size spanned the width of the willow grove. By this time my friends and I were terrified. The driver announced that he was leaving to go visit his 'friend.' My girlfriend was begging him not to leave us. Her brother demanded to go with the driver, scared but trying to be brave. The driver told him no, that he should stay with us. I tried to hide from the blinding light that was flooding in on us. I began whispering to my girlfriend to be quiet as she was crying uncontrollably. We tried our best to be quiet and our terror subsided after a few minutes when we began to realize that we were OK. I peeked out the window. What I saw next will remain with me the rest of my life. I clearly saw a silver colored saucer shaped ship with a raised bump on the top side. The bottom was smooth. The white light came from the bottom of the ship--that's the light that lit up the entire road and the willow grove. Around the perimeter of the ship, there were colored lights that seemed to pulsate. The entire time, it was completely silent. It hovered above the trees. When it left, it was gone in a snap of an instant, angleing right up into the sky. The driver returned to the car, jumped in, and we drove back to town saying nothing--no one said a word."],"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.017594,+-93.309862(16015)&iwloc=A&hl=en\"> mufon case (16015) map </A>","Longitude":"-93.309862","Object Shape":"Other","Country":"United States","City":"Chariton","Tags":"City","Summary":"Slow moving 'star' that moved in and became larger turning into a spacecraft-blinding bright light and silent.","Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}