{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.59205,+-105.083063(16016)&iwloc=A&hl=en\"> mufon case (16016) map </A>","Case Number":"16016","Latitude":"40.59205","Weather Factors":"Light","Object Shape":"Cigar, Sphere, Star-like","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"03/14/2009 04:30 UTC","Disposition":"Unresolved","Summary":"Shiny object, sudden movements, tube object, end over end.","Object Features":"None","Log Number":"US-03142009-0013","Region":"Colorado","Sighting Duration":"Undisclosed","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around March 14th 2009"],"Longitude":"-105.083063","Date Submitted":"03/14/2009 04:30 UTC","Tags":"City","City":"Fort Collins","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16016.html.txt","/var/www/straped/mufon/org/16016.html"],"divs":["sighting detailsi was at avogadros number restaurant at 4:30 pm sitting on back patio with friends, looked up, and saw a shiny, stationary, object.i was excited because i knew what i was seeing. i pointed it out to everybody (there were 7 of us) but only 3 others saw it. it sat there and flickered, then moved to the left about 1\\4 of inch, then back again. it kept flickering and was very bright. nobody else seemed to care but i grew excited having several other viewings in the past. i ran inside to find someone with a digital camera but found no one. came back outside but failed to see the object again. as i looked in the vicinity, a white tube came screaming past where i was looking, moving in a westward direction. it looked as though it moved end over end a few times before getting out of view. i quickly drove home to get my camera but had no luck in spotting anyting else. the whole sighting lasted 5 minutes. it was as if i was given a showing for all of my skywatching diligence. the tube flying by made me gasp as i've never seen a tube before, only on ufo shows, it's speed was crazy and seemed to be very high in the sky."],"Viewing Distance":"Over One Mile"}