{"Case Number":"16012","Object Shape":"Cylinder, Other","Object Features":"Dome","Weather Factors":"Windy, Heavy","Disposition":"Unknown","Summary":"My wife and I were driving an 18 wheeler on Hwy I40 at approx. MM 70 to 77 just outside Barstow, CA.","Tags":"City","City":"Barstow","trends":["There have been 11 other sightings in Barstow","There were no other sightings in Barstow on or around December 31st 2007"],"Date of the Event":"12/31/2007 03:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.901806,+-117.007883(16012)&iwloc=A&hl=en\"> mufon case (16012) map </A>","divs":["Sighting DetailsIT WAS ABOUT 3 AM WE WERE DRIVING WESTBOUND ON A NEARLY EMPTY HWY AT ABOUT 70 MPH AROUND MM 71 APPROX WHEN I LOOKED INTO ONE OF THE MANY VALLEYS THAT RUN NO TO SO IN THAT AREA WHEN I PASSED ONE THAT WAS ILLUMINATED BY A BRIGHT RED SORT OF INCANDESCENT LITE AND NEAR THE BOTTOM OF THE VALLEY THERE APPEARED TO BE AN OBJECT THAT LOOKED LIKE A SMALL SUBMARINE WITH MULTI LITES HOVERING ABOUT 40 FEET OFF THE GROUND IN A VALLEY THAT WAS NO MORE THAN 150 TO 200 FEET DEEP. iT WAS TO THE SOUTH FROM OUR VANTAGE ON THE WEST BOUND SIDE. WE PASSED IT RATHER QUICKLY AT OUR SPEED JUST LONG ENOUGH TO SEE IT AND THAT IT HAD THE ENTIRE VALLEY LIT UP. IT SURPRISED ME AND I SORT OF EXCLAIMED \" WHAT THE HELL WAS THAT !\" I DONT KNOW WHAT IT WAS, BUT I KNOW WHAT IT WAS NOT. IT WAS NOT MOVING AND IT HAD NO WINGS OR ROTORS. IT LOOKED A LITTLE LIKE THE TRIESTE BATHYSPHERE FROM THE MARRIEANNIS TRENCH DIVES. I THINK THE OBJECT WAS PROBOBLEY NO LARGER THAN A SMALL RV. WE MOVED ONWARDS TOWARDS BARSTOW CAL. AND I BEGAN TO FORGET ABOUT IT FOR PERHAPS 45 MINS TO AN HOUR, AND THEN JUST AS WE BEGAN TO NEAR BARSTOW I ROLLED DOWN MY DRIVERS SIDE WINDOW AND FOR SOME REASON I LOOKED OVER MY LEFT SHOULDER BEHIND US AND THERE PROB. ABOUT 500 TO 700 FEET TO THE LEFT REAR OF ME THE SAME OBJECT WITH THE SAME UNMISTAKEABLE COLOR AND HUE WAS MOVING IN THE SAME DIRECTION AND SPEED THAT WE WERE. IT WAS 700 TO 1000 FT OFF THE GROUND JUST AT THE EDGE OF THE CLOUD COVER. THERE WAS AN INTENSE SORT OF SANTA ANNA WIND EFFECT THAT WAS BLOWING VERY HARD THAT EVENING SO HARD THAT IT WAS MOVING THE TRUCK BUT IT DIDNT SEEM TO AFFECT THE OBJECT AT ALL. AT THAT POINT I TOOK MY FOOT OFF THE GAS AND LET THE TRUCK SLOW SOMEWHAT, I LEANED OUT OF THE TRUCK AND LOOKED BACK DIRECTLY AT THE OBJECT AND GOT A BETTER LOOK AT IT, AND AS I CRANED MY HEAD OUT OF THE WINDOW OVER A PERIOD OF PROB. 30 SECONDS THE OBJECT SEEMED TO BE AWARE THAT I WAS LOOKING AT IT AND IT MOVED UPWARDS AND INTO A BANK OF QUICKLY MOVING CLOUDS THAT OBSCURED IT BUT AS IT MOVED AWAY IT ILLUMINATED THE CLOUD BANK AS IT LEFT AND THEN IT WAS GONE. WITH THE BETTER LOOK AT IT , IT SEEMED TO BE BELL SHAPED, ALMOST LIKE AN INVERTED BELL AND THE WAY THE LITES ON IT SEEMED TO BE MOVING UPWARDS FROM BOTTOM TO TOP IT KIND OF LOOKED LIKE A XMAS TREE ORNIMENT IT ALMOST SEEMED TO RESEMBLE ONE OF THOSE DEEP SEA JELLYFISH WITH THE PHOSPHERESCENT LITES MOVING UP AND DOWN ON THEM. {PARDON MY SPELLINGS } I KNEW I SHOULD REPORT THIS SOMEWHERE BUT I DIDNT REALLY KNOW WHERE. THIS REALLY HAPPENED AND PRETTY MUCH AS I DESCRIBED. I DONT KNOW WHAT IT WAS, BUT I KNOW WHAT IT WAS NOT; NOT ANY CONVENTIONAL AIRCRAFT THAT I HAVE EVER SEEN. IT DIDNT MOVE AT ANY EXCEPTIONAL SPEEDS, BUT TO ME IT SEEMED TO BE AWARE THAT I HAD NOTICED IT AND SOMEWHAT DIVERTED ITS COURSE INTO THE CLOUDS AS I SLOWED DOWN AND TURNED AROUND AND LOOKED AT IT. I DONT KNOW HOW LONG IT HAD BEEN GHOSTING US SO TO SPEAK OR HOW LONG IT HAD BEEN GOING IN OUR DIRECTION FROM WHERE I FIRST SAW IT, BUT I ALMOST GOT THE IMPRESSION THAT IT HAD BEEN OBSERVING US AFTER WE FIRST NOTICED IT; WE MAY HAVE GOTTEN ITS ATTENTION WHEN WE FIRST SAW IT. I ALMOST GOT THE FEELING THAT INSTEAD OF ITS BEING A CRAFT IT MAY HAVE BEEN A LIFE FORM ITSELF. MAYBE THATS JUST MY IMAGINATION (?) yOU MAY CONTACT ME IF YOU FEEL YOU NEED TO. SINCERELY"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16012.html.txt","/var/www/straped/mufon/org/16012.html"],"Source":"MUFON","Latitude":"34.901806","Date Submitted":"12/31/2007 03:00 UTC","Longitude":"-117.007883","Object Flight Path":"Hovering then path","Country":"United States","Log Number":"US-03142009-0009","Region":"California"}