{"Object Shape":"Cylinder, Fireball, Sphere","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Latitude":"42.791194","trends":["There have been 20 other sightings in Holland","There were no other sightings in Holland on or around March 13th 2009"],"Case Number":"16013","divs":["Sighting DetailsI was leaving my home at 3:30 AM to catch a 5:35 AM flight from the Grand Rapids airport.The temp outside was about 16 degrees F. As I came down the stairs from the bedroom I looked out the window as it was very clear, star filled early morning. A lovely almost full moon was visible lighting the landscape. I noticed off to the East a flaming object that I at first took to be space debris entering the atmosphere but it was moving slowly. It was headed West. The next thought was its a small plane and I thought perhaps it was in trouble because of the fire ball coming from it. The object was flying horizontal and at about the altitude that small planes fly in the area since the Park Township airport is just about a mile away. The object then stopped and hovered just off of my property line to the South and perhaps midway between my home and Lake Macatawa which is on the other side of the road from my home and maybe two or three hundred yards away. I went outside and watched it hover for a few minutes until it slowly rose up vertically and to the South until it disappeared. It made no sound that I can recall in the dense cold air. I felt that the object was \"deliberate\". That is the word that came to my mind while I was watching it."],"Log Number":"US-03142009-0010","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"03/13/2009 03:30 UTC","Region":"Michigan","Disposition":"Unknown","Object Flight Path":"Path then hovering","Object Features":"Unknown","Summary":"Most noticeable was the fireball or flame from the bottom. Too dark to see exact form of object.","Tags":"City","Longitude":"-86.10495","City":"Holland","Date Submitted":"03/13/2009 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.791194,+-86.10495(16013)&iwloc=A&hl=en\"> mufon case (16013) map </A>","files":["/var/www/straped/mufon/html2text/16013.html.txt","/var/www/straped/mufon/org/16013.html"]}