{"Disposition":"Unknown","Summary":"Black triangle emits loud buzz.","Longitude":"-107.984216","Date Submitted":"03/31/2003 12:00 UTC","trends":["There have been 6 other sightings in Aztec","There were no other sightings in Aztec on or around March 31st 2003"],"Region":"New Mexico","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.827066,+-107.984216(16024)&iwloc=A&hl=en\"> mufon case (16024) map </A>","Source":"MUFON","Weather Factors":"None","Log Number":"US-03152009-0004","Case Number":"16024","Object Features":"None","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/16024.html.txt","/var/www/straped/mufon/org/16024.html"],"Latitude":"36.827066","City":"Aztec","Date of the Event":"03/31/2003 12:00 UTC","Tags":"City","Country":"United States","Object Shape":"Triangle","divs":["Sighting DetailsI was out working about 15 miles NW of Aztec,NM surveying for the local utility company. My job was to do a survey routes for electrical distribution lines, and I have been around large to medium sized substations and distribution lines. I was parked at a gas compressor site and eating lunch while listening to the radio. I heard a loud buzzing sound, I figured that I parked near a bee hive. I was concerned that I may have parked near bee hive and I needed to survey the area. I looked around and I didn't see any bees or a hive. The sound was so loud that it seemed to be all around me. I could not figure out what was making the noise. It sounded like a higher pitch than the normal 60Hz hum that is created by high power lines or even substations. I went around the site and eventually looked up. I seen an isoscles triangle flying above, it was flat black with no markings. I figured that it was approximately 2000' in the air and moving very slow. It didn't have any lights, it was nothing like I have ever seen. I've seen F117 Stealth Fighters, and they are more like a \"V\" shape with a pronounced gap between the wings and rear section of the plane. This wasn't no F117 Stealth Fighter, it was an Unidentified Flying Object. It flew from the south to north in a straight line while emitting a loud buzzing sound. I really wasn't shocked, I didn't know what to think. It was nothing like I have ever seen, my first reaction was, \"What the hell is that?\". I didn't have any optical surveying equipment to zero in on the object, to get a better view. All I had was a mobile survey grade GPS device. It just flew to the north until it was out of sight."]}