{"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=45.238593,+-68.66367(16025)&iwloc=A&hl=en\"> mufon case (16025) map </A>","files":["/var/www/straped/mufon/html2text/16025.html.txt","/var/www/straped/mufon/more/16025_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/16025.html"],"Object Features":"Unknown","divs":["Sighting DetailsI was taking my dog out and while it does its thing I tend to stare up at the stars in hopes of seeing a falling star. It was about 10:30pm maybe later and the sky was clear and the stars were bright. I looked around and saw what I first thought to be a falling star. I remember being glad that I hadn't missed it and noticing how bright it was. After a moment or so I realized that the \"star\" was not disappearing as expected. It was then that I noticed a twin light was running parallel to the first. Both lights were red, and I know you must be thinking it must have been a plane, I thought this as well. Even with that thought in mind, if it were a plane it did not have the characteristics I would expect such as the color red on a plane is much brighter, the color tone not the light. The ones I was watching were almost a maroon orange texture. There was also no blinking lights as you see on commercial aircraft and the like. Even then I would have dismissed it had it not been for what happened next. As I stood and watched the lights dropped and flew over my head and out to the horizon and disappeared at a phenomenal speed. Further more there was no sound, in fact my dog did not even notice. The lights were approximately 1000 feet overhead or less, and the final thing that made me ponder was the fact that though the lights were moving at such tremendous speed there was no streak effect as you would find with fast moving light. In other words if you have ever been camping and placed the end of a stick in the fire until it was glowing and waved it around to see the circles and streaks in the air, these lights did not have that effect."],"Object Flight Path":"Path with directional change","Object Shape":"Unknown","Longitude":"-68.66367","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"05/01/2006 10:30 UTC","Case Number":"16025","City":"Howland","trends":["There have been no other sightings in Howland","This sighting has never been favorited."],"Source":"MUFON","Disposition":"Unknown","Summary":"Two redish lights came from a great height and flew at unreal speed directly overhead, no sound, too fast for detail.","Region":"Maine","Latitude":"45.238593","Log Number":"US-03152009-0005","Date Submitted":"05/01/2006 10:30 UTC","Tags":"City"}