{"files":["/var/www/straped/mufon/html2text/16029.html.txt","/var/www/straped/mufon/org/16029.html"],"Case Number":"16029","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Latitude":"33.256724","Date of the Event":"03/14/2009 07:45 UTC","Disposition":"Unknown","City":"Queen Creek","Source":"MUFON","Summary":"2 lights at the ends of a very large object in S.E sky (similar to in size to Phx lights object) appeared then receded at an incredible speed.","map":"<A HREF = \"http://maps.google.com/maps?q=33.256724,+-111.632069(16029)&iwloc=A&hl=en\"> mufon case (16029) map </A>","trends":["There have been 21 other sightings in Queen Creek","There were no other sightings in Queen Creek on or around March 14th 2009"],"divs":["Sighting Details I live on the eastern edge of Queen Creek, Az. and have a very good view of the night sky to the Northeast, East, and the Southeast. Tonight my adult son was visiting and I was showing him Saturn, then the Orion Nebula through my Celestron telescope. After showing him these objects I set the scope to go to another nearby nebula, and glanced at the S.E. sky as the scope was slewing. Clearly visible coming toward us in the distance was a large object with two very bright lights, one at each end. I grabbed my binoculars and as I watched, the object stopped, then receded at an incredible speed. As it receded I could see a haze forming around the lights. This went from sitting there to being completely gone in less then 10 seconds. The object was very similar in size to the published pics of the Phoenix lights object in 1997. (The 8:30 sighting, not the later one which was claimed to have been flares) Going over this in my mind I've been unable to come up with an explanation for this sighting other than what I've stated above. It absolutely was not any aircraft,flares or other terrestrial object I've ever seen before."],"Object Features":"Unknown","Object Shape":"Star-like, Other","Log Number":"US-03152009-0009","Date Submitted":"03/14/2009 07:45 UTC","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"None","Longitude":"-111.632069","Tags":"City","Region":"Arizona","Viewing Distance":"Unknown"}