{"Weather Factors":"Unknown","City":"Houston","Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around September 13th 2008"],"Tags":"City","Disposition":"Unknown","Date Submitted":"09/13/2008 02:30 UTC","Date of the Event":"09/13/2008 02:30 UTC","files":["/var/www/straped/mufon/html2text/16022.html.txt","/var/www/straped/mufon/org/16022.html"],"Object Shape":"Square, Rectagular, Triangle","Case Number":"16022","Region":"Texas","Viewing Distance":"101-500 Feet","Latitude":"29.767753","Longitude":"-95.36048","Object Features":"Other","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=29.767753,+-95.36048(16022)&iwloc=A&hl=en\"> mufon case (16022) map </A>","divs":["Sighting Details1) My family and I were in a small north Houston motel where we had planned to wait out the hurricane. It was September 13, 2008 and I had seen on the news that the eye was enetring Galveston Island. The weather outdoors was already very windy and a hard rain falling. I got out of bed to see first hand what the storm was doing in the event that I had to provide additional protection to my family. I was very much awake and alert. 2) At first only through the lightening could I see any further than the nearby parked vehicles and motel buildings. I stepped just out the door but quickly returned inside as the wind was strong and I did not want to get knocked over. After a few minutes I opened the door again to look at the storm. It was then that I saw a very emerald green object directly in front of me. The color was strong but did not seem to be bright or lighting up anything nearby. There seemed to have been a greenish halo of a less intense light that surrounded its configuration. It at first looked to be triangular in shape but, then seemed to be rectangular. The distance was only 100-150 yards from me. 3)The light seemed to be at first suspended, motionless, and soundless. The object completely blocked a 6-10 story building that was directly behind it. I stood in place looking at the object a good 2 minutes when my 11 year old son asked if he could get out of bed to see the storm. I gave my approval and he came and stood next to me. He immediately saw the object and asked what it was. I said, \"So you see it too\". I told him that I did not know what it was. The object then made strange slow movements while never leaving its location. The movements made it clear to me that it was three dimensional. 4) The entire time of the sighting, I was trying to determine the source. I first though that it was a mirage or reflection of other lights. The strong hurricane winds and rain did not seem to have any effect on the object. The movements that it was making made it appear as if they were self controlled and intelligent. The object did not spin, it did not rotate, it did not zig zag. The best I can describe the motion is that of a slide show in which different views of a same object is seen on a big screen but, of different sides. 5) During the first moments of the sighting, I stared at it and then around it trying to explain to my self what it was that I was seeing, in a logical fashion. I was very curious. When I could not find an explanation I became a little frightened. Because my son was standing next to me I did not want to frighten my son so I acted as normal as I could. The object and movements led me to believe that it wanted to get noticed. After about five minutes of seeing this object, I closed the door and for a few minutes and then went back to the door with my son and opened it to look outside. The object was gone. I have been bothered by the fact that I have not reported this incident. This incident is absoluely true and I now report to the best of my ability."],"Log Number":"US-03152009-0002","Country":"United States","Summary":"During Hurricane Ike I and my 11 year old son witnessed an emerald green UFO about 150 yards away.","Source":"MUFON"}