{"Longitude":"-112.71494","trends":["There have been 6 other sightings in Gila Bend","There were no other sightings in Gila Bend on or around March 9th 2009","This sighting has never been favorited.",""],"Country":"United States","Date of the Event":"03/09/2009 09:10 UTC","Object Flight Path":"Stationary,Hovering then path,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.952884,+-112.71494(16021)&iwloc=A&hl=en\"> mufon case (16021) map </A>","Summary":"Two orbs (orange and yellow) appeared sometimes for 2 plus minutes and sometimes for less than 5 seconds.","Region":"Arizona","Disposition":"Unknown","Source":"MUFON","Log Number":"US-03152009-0001","City":"Gila Bend","Object Shape":"Unknown","Weather Factors":"Unknown","Object Features":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/16021.html.txt","/var/www/straped/mufon/more/16021_submitter_file1__sdtrip010.jpg","/var/www/straped/mufon/more/16021_submitter_file2__sdtrip010.jpg","/var/www/straped/mufon/more/16021_submitter_file3__sdtrip019.jpg","/var/www/straped/mufon/org/16021.html"],"Latitude":"32.952884","Viewing Distance":"Unknown","Case Number":"16021","divs":["Sighting Details We were driving home from a trip to San Diego and had just left Yuma. Myself, My wife and our two kids plus a friend of our sons was with us. After driving for about 45 minutes out of yuma just past the Mohawk rest stop and my son and his friend asked what the object was in the sky. I was in the passenger side of our van and looked to the sky where they were pointing (southwest over the desert). Sitting the the front passenger side and heading east I had to look over my left sholder at about 3pm on a clock to see them. As we were driving we noticed several cars parked on the side of the road looking at the same lights. What we saw were two orbs a good distance apart. One was orange in color and the other was yellow. The stayed mnotionless for over 3 minutes from the time we started looking at them. We thought they might be flares but they did not move and did not appear to have any smoke and did not appear to be moving downward. The objects faded out and then re-appeared father south and east (from my point of view they were infront and to the right of the passenger side of our van (we could not tell how high in the sky they were). I used my cell phone to take pictures and have attached them. They are not the best photos but at least I got a few as well as my wife who was driving, I also believe that my son and his friend got some pics on their cell phones. the objects stayed there for a short period of time (1 minute 23 seconds) then faded again. This happend the entire way to Gila Bend. They faded in and out for several seconds or for several minutes. Once we reached the Gila bend Shell station we continued to watch the orbs and then they seemed to dissapear. My son and his friend stopped in the rest room at the shell and were talking about the orbs and a local said that they see some wierd stuff out there and as long as they leave him alone he did not care. I have several photos. It did not appear to us when taking them that we have more than two in some. We were trying to find red and blue lights on the objects to see if they were planes but did not see any. We also did notice many flashing lights from planes that appeared to be following these lights and they seemed much more erratic and the orbs stayed stationary."],"Date Submitted":"03/09/2009 09:10 UTC","Sighting Duration":"01:23:00"}