{"files":["/var/www/straped/mufon/html2text/16038.html.txt","/var/www/straped/mufon/org/16038.html"],"Longitude":"-74.001983","Case Number":"16038","Date of the Event":"03/15/2009 08:25 UTC","Object Shape":"Diamond, Star-like","Source":"MUFON","Log Number":"US-03152009-0017","Date Submitted":"03/15/2009 08:25 UTC","Summary":"Brilliant star like light appeared diamond shaped.","Object Flight Path":"Straight-line path","Country":"United States","Latitude":"40.719953","Sighting Duration":"00:02:00","Object Features":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.719953,+-74.001983(16038)&iwloc=A&hl=en\"> mufon case (16038) map </A>","Disposition":"Unresolved","City":"New York","divs":["Sighting DetailsI was on a frozen lake in the NY Adirondack park my friend and I had stopped on our ATV's for a break in the middle of a isolated frozen lake. We started looking at the stars as there were no clouds anywhere identifying constelations (Orion big dipper etc) and enjoying the pristine beauty. We imediately saw a satelite passing over then a while later a jet plane probably aproaching Albany airport upon watching the jet pass south to Albany we saw another light brighter and continious (No blinking light at all) coming over the horizon imediately thinking it was another jet but it was moving much faster as it approached aned was unusually bright. We waited to hear the jet engines as it neared as we had before but never did. It passed over us south of our position from roughly south west to north east (We had no compass so this is a very rough guess I am basing the direction on the direction of the jets flying to Albany) as it neared it was much brighter than any star in the sky and appeared to be diamond shaped and I would guess 35,000+ ft. After it passed over head it kept climbing and winked out in a split second I dont mean went over the horizon I mean traveled ito space and disapeared. We imediately looked at each other and agreed we had not seen a plane or satelite. We began to question what it could have been and decided it had to be the space shuttle but even that didnt agree with what we saw. We noted the time as 8.25 Eastern (NY) (By Rons watch (Which was correct to my computer which I checked when we got back home) I went to NASA's web page and they launched much earlier and as I said before this did not look like a rocket. I do not believe what I saw was the space shuttle. It did not appear to be a rocket it made no noise and was too low to have been the shuttle. I would imagine on a clear night in upstate NY someone else had to have seen the same thing. I also checked to see if the Koreans launched anything but nothing has been reported. Please let me know if anyone else saw this object as I have never seen anything like it in my 44 years. I never saw it turn it continiously climbed in a straight line into space at a rate that was starteling. I cant wait to see what if anything is reported. Thank you. I swear this entire story is the truth so help me God."],"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around March 15th 2009"],"Weather Factors":"Unknown","Region":"New York"}