{"Object Features":"Unknown","Viewing Distance":"Unknown","Tags":"City","Longitude":"-83.480896","Object Shape":"Triangle","Log Number":"US-03152009-0011","Object Flight Path":"Path with directional change","Weather Factors":"None","Case Number":"16032","City":"Canton","trends":["There have been 16 other sightings in Canton","There were no other sightings in Canton on or around March 3rd 2009"],"Source":"MUFON","Region":"Michigan","Country":"United States","Date Submitted":"03/03/2009 12:00 UTC","Latitude":"42.314104","Summary":"Triangle-shaped lights low over trees in Canton, Michigan.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was driving north on I-275. I was alone. The time was somewhere between 8 and 10 pm. I had just pasted Detroit Metro Airport heading toward Canton. There were many planes in the sky. As I approached the Michigan Avenue exit, I noticed 3 bright white lights low over the trees to the northwest of my position, moving slowly. At this point, they looked like they were simply in a straight line and about the size of a passenger jet. I watched them as I drove, looking for any blinking lights or red and green wing lights that you typically see with planes. There were no colored or blinking lights. It seemed unusually low considering the distance from the airport. As I pasted the Michigan Avenue exit, almost to the rest area, I was about even with the lights. Still no blinking lights. At this point, the lights banked slowly to the north, away from the airport. I was now quickly passing it, but as it banked, it then appeared to be a triangle shape with white lights at each corner and one smaller white light in the center. Because I was passing it, I only saw it for a few seconds. I debated whether to pull to the side of the road or go up to the next exit, come back around and try to follow it. I decided I really wanted to get a closer look so I drove to the Ford Road exit then quickly went south on I-275. Probably 5 minutes elapsed. I got off the Michigan Ave. exit and drove west and in that general area for about 15 minutes, but I could see no sign of it. I was reluctant to report this because I saw the triangle shape so briefly, I wasn't sure what I was seeing. I decided to report when I saw on this data base another similar sighting in the Romulus-Canton area the 4 days prior to my sighting."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.314104,+-83.480896(16032)&iwloc=A&hl=en\"> mufon case (16032) map </A>","Disposition":"Insufficient Data","Date of the Event":"03/03/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/16032.html.txt","/var/www/straped/mufon/org/16032.html"]}