{"map":"<A HREF = \"http://maps.google.com/maps?q=39.955865,+-75.162519(16043)&iwloc=A&hl=en\"> mufon case (16043) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 27th 2008"],"Tags":"City","Country":"United States","divs":["sighting detailsi kept watching, it didn't move. i didn't see blimp (goodyear) on tv, didn't see pic's of blimp over the stadium in phila (not the vet, the new one), on tv, kept watching from my kitchen window which faces south. i can often seen fireworks out my back window. i even went outside to look but couldn't see from ground. lights seemed to be in a cloud, greenish-gaseous, not moving (cloud), blinking lights of various colors. thought it was weird but assumed it had something to do w\\telecommunications & 2008 world series coverage. on the other hand it just stayed there and didn't seem to move. i kept checking and it was still there a couple hours later. obviously it could probably be easily explained - except that on the following philly home games during the world series, i didn't see anything more resembling - sky was clear on one night and on actual win it was horribly raining so didn't see anything but i kept checking back to see if same phenominon occured on other dates during the ws. i believe the lights i saw were on\\around that preceding sunday or possibly monday before the phils win. this was from my kitchen window, i was getting something to drink between commercials on the ws televised game. what made me first notice object was that it was a weird greenish light, just hovering and didn't move. i purposely turned my lights off, pulled up a chair and watched it for a good 10 minutes. when i first noticed it i thought it might be a goodyear type blimp over the stadium - how else to account for it and it would make sense since it was in direction of where stadium would be and there would be a reason for a blimp to be hovering, covering world series. i didn't lose sight of the object per se, i simply went to bed b\\c i had to get up for work. i don't recall it leaving the area that evening but wasn't there at all the next few evenings (i checked). haven't seen it since. often see lights in sky since to the south, out my window, some miles away, is philly international airport so no big deal to see lights moving, hear planes and helicopters overhead at any given time."],"Summary":"Greenish cloud w/blue & red & white lights, hovering over S. Phila during Sunday of World Series. I assumed was a Goodyear blimp.","Longitude":"-75.162519","Case Number":"16043","Object Shape":"Blimp, Star-like, Other, Unknown","Latitude":"39.955865","Date of the Event":"10/27/2008 08:30 UTC","files":["/var/www/straped/mufon/html2text/16043.html.txt","/var/www/straped/mufon/org/16043.html"],"Disposition":"Insufficient Data","Log Number":"US-03162009-0001","City":"Philadelphia","Weather Factors":"Unknown","Region":"Pennsylvania","Source":"MUFON","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Date Submitted":"10/27/2008 08:30 UTC"}