{"Country":"United States","Longitude":"-118.147259","files":["/var/www/straped/mufon/html2text/16047.html.txt","/var/www/straped/mufon/org/16047.html"],"Disposition":"IFO","Region":"California","Object Features":"None","Latitude":"34.11926","Date Submitted":"03/15/2009 07:45 UTC","Log Number":"US-03162009-0005","divs":["Sighting Details4 buddies and I were having a BBQ in the back yard of my house in South Pasadena, Los Angeles, California. We were standing, joking around. Must've been 7:30 - 7:45 and A medium-bright, white-light caught my eye traveling at medium-fast speed. With no sound. Not blinking. Traveling straight. I could assume that it was no more than 3mi. north of us traveling East, apparently flying directly over the city of Pasadena. There were no other air craft seen or heard during this sighting. As soon as i realized that there was no sound and that it still wasn't blinking I said to my buddies: \"help me witness this\" to get them to turn and look. I got their attention... They confirmed that there was no sound and that there were no blinking lights, only one light consistently illuminated. There were some clumping clouds... and we saw it for 30-45 seconds as it moved in the space where the clouds had cleared; only a couple hundred feet above these clouds. Then saw it slightly again through a smaller break in the clouds. Then it disappeared into the clouds. A minute later, we saw a jet air plane at almost the same height fly directly above us with normal lights and normal sounds. By this, we were able to gauge that we weren't def, blind and crazy... ...Then for some reason we did... we went crazy for 3min. We laughed hysterically, \"flipped out\", rallied...Repeated the saying: \"i cant F***in' believe that!\" and \"Oh my F***in' God!. I seriously could not believe that my first sighting was ALMOST trivial. I went inside to bring my dad a plate and quickly tell him what happened... And (without warning) when I came back out my friends were all packed up ready to leave like they had something to do. I guess they were a little too \"freaked out\" . I've been a believer for over 10 years and I listen to coast to coast from time to time, but never had a direct experience. This is my first sighting, and im so glad a had some close buddies share it with instead of being alone when this happened. I've done enough research to know that this was very low profile sighting. But I dont care, i know that every little bit helps. This sighting has turned me from a \"believer\" to a \"knower\". However I really hope you get a corroborating report. I'd love to hear it and share it with my buds. Also if there IS SOME explanation for this sighting please let me know. D"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.11926,+-118.147259(16047)&iwloc=A&hl=en\"> mufon case (16047) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"03/15/2009 07:45 UTC","Object Flight Path":"Straight-line path","trends":["There has been one other sighting in South Pasadena","There were no other sightings in South Pasadena on or around March 15th 2009"],"Weather Factors":"Unknown","Object Shape":"Star-like","Summary":"A silent craft witnessed by 5 people.","Source":"MUFON","Case Number":"16047","Viewing Distance":"Over One Mile","City":"South Pasadena","Tags":"City"}