{"Region":"Indiana","Case Number":"16053","Longitude":"-86.246157","Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Country":"United States","City":"South Bend","Object Features":"None","Disposition":"Unknown","trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around March 15th 2009"],"Date of the Event":"03/15/2009 12:42 UTC","Object Flight Path":"Straight-line path,Path with directional change","Summary":"Sphere shaped UFO's follow small plane.","Date Submitted":"03/15/2009 12:42 UTC","divs":["Sighting DetailsIt was 12:42 pm ,I was walking out to my car to plug my phone into its charger(I dont have a home charger). I hear the sound of a small plane flying above. There were alot of small planes in the sky that day most likely because it was the first day that summer was starting to reveal itself. I glance into the air to look at the plane and behind it I see something strange, there where two sphere shaped objects behind the plane, at first glance they looked like 2 balloons some one had release, I kept watching, and then I noticed the objects appeared to be following the plane! I kept watching, they were flying in a straight path then one of the objects circled the other one, between the size and the movements I ruled out it being a balloon about 30 seconds later the objects disappeared from view (from being to far away) at about the same time that I couldn't see the plane anymore. It was very strange and I had never seen anything like it before. I estimate the altitude to be about 3000 - 4000 ft and the size of the objects to be 8 - 15 ft in diameter and where white or creme. seemed to be traveling about a mile or so behind the plane."],"files":["/var/www/straped/mufon/html2text/16053.html.txt","/var/www/straped/mufon/org/16053.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.688081,+-86.246157(16053)&iwloc=A&hl=en\"> mufon case (16053) map </A>","Latitude":"41.688081","Log Number":"US-03162009-0011","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"00:01:00"}