{"Case Number":"16056","Log Number":"BO-03162009-0014","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Object Features":"None","trends":["There have been no other sightings in La Paz","This sighting has never been favorited."],"Latitude":"-16.49901","map":"<A HREF = \"http://maps.google.com/maps?q=-16.49901,+-68.146248(16056)&iwloc=A&hl=en\"> mufon case (16056) map </A>","files":["/var/www/straped/mufon/html2text/16056.html.txt","/var/www/straped/mufon/org/16056.html"],"Country":"Bolivia","Summary":"Saw it in TV on a film about the \"Death Road.\"","Region":"La Paz","Tags":"City","Date of the Event":"03/16/2009 12:00 UTC","divs":["sighting detailson the history channel (hist hd) airing in massachusetts at 5:30 pm on 3-16-09. the show was called \"death road\" about 1\\2 way through the program, just after it shows a blue and white bus on the death road going past a waterfall that is cascading on the road, then several seconds later, the video showed a view of the valley and monutians heading towards la paz. at that point in the upper right quadrant of the video, you can very plainly see a silver ball slowly flying across the view in the sky from left to right and the shot lasted about 8 seconds. i could see clearly mountians far behind and below the object and they were were in clear detail as the show was in hd and my tv is a large screen tv. i thought perhaps it was a helicopter,but whereas i could see objects below and further away in very good detail, i did not think that it was the camera pixilating over a helicopter. although there probably was a helicopter in use during the show. anyway, i thought that perhaps someone on your staff could retrieve the program and check it out. i reviewed the video as i had recorded it and looked at the video perhaps 20 times. i came back to the initial conclusion, maybe a ufo. richard barbieri 3-16-09 ashby, ma"],"Object Shape":"Sphere","Date Submitted":"03/16/2009 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-68.146248","City":"La Paz","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON"}