{"Country":"Australia","files":["/var/www/straped/mufon/html2text/16057.html.txt","/var/www/straped/mufon/org/16057.html"],"trends":["There have been 40 other sightings in Melbourne","There were no other sightings in Melbourne on or around March 16th 2009"],"divs":["Sighting Details I dont have any pictures, only my story. So if you require pictures then i can only suggest you stop here. Last night at about 9:45pm AEST i was playing Counter Strike and decided it was time for a smoke. I stepped out the front and walked over to the cars and stood inbetween them on the driveway, because it was a bit chilly. I was looking around the sky (As i do) and noticed a star 'moving'. At first i though it was a sattalite, which to me is something nice to see aswell.. but it started changing course, rapidly. At one point the light was coming straight for me and at this point i started stepping back (tripping over a car) and sorta hid behing the brick wall of the house, but never taking my eyes off this object. The light dimmed and appeared to face away from me, then crept across the sky turning a red colour and dissapearing. I should also note that when the light looked like it was facing me it had two blue lights on the front i suppose. The object appeared to be VERY far up. Higher that a Jet or Any plane. And a plane has never acted like what i have described. I can draw up a picture in paint or something i suppose, or take a picture in the daytime (I tried to take a picture last night, but iPhones dont like the night!) and give you an idea of what i am talking about. Again, sorry for no pictures. Im just as shattered as you are."],"Latitude":"-37.809187","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Melbourne","Source":"MUFON","Sighting Duration":"00:01:30","Case Number":"16057","Longitude":"144.97241","Date of the Event":"03/16/2009 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=-37.809187,+144.97241(16057)&iwloc=A&hl=en\"> mufon case (16057) map </A>","Region":"Victoria","Tags":"City","Summary":"Star like object flying through sky (read long).","Object Features":"Undisclosed","Log Number":"AU-03162009-0015","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"03/16/2009 09:45 UTC","Object Shape":"Star-like, Other"}