{"Disposition":"Unknown","Object Shape":"Triangle","Log Number":"US-03172009-0001","Region":"Arkansas","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.00481,+-92.802667(16061)&iwloc=A&hl=en\"> mufon case (16061) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI have to drive home several nights a week after dark. In the last few months I have repeated experiences where I've seen UFO's. The first time I was driving home and I saw these strange lights I knew they were close to the ground because I would kinda lose track of them for moments behind the trees. When I approached where these lights were I noticed these lights were all on the same object. This object was triangle in shape with red lights at all 3 points, between two of the red lights along the same line were 2 yellow lights it was dark in color or it reflected the darkness. This object was not 50ft from the ground and about 20ft. from the main highway (right beside me) it turned about 180 degrees like it was looking down on me,and that is actually when I saw the second yellow light. About 2 days later, same scenerio, but this time the object had blue lights only at the 3 points, again it turned right around as to look at me. If you were wondering I slowed down almost to a stop in the road both times but it is a little unnerving not knowing the origin or intent of these crafts. A few days later same scenerio,driving home,this time there were 2 crafts hovering in the same area the one with the blue lights and the other one had the same lights they were just the opposite as before three white lights at the points and two red lights in between. They were a little further off the road and seemed to be tilted forward as if looking at the ground. This is a very rural area with a few houses. The objects were kind of in a field surrounded by trees. This seems to be ongoing as I saw the one with the red lights again tonight this time the white lights were strobing. This is not my first experience in this area, 16 years ago (5 min. from this new area)I was sitting at home, my husband went outside for something and stuck his head in the door and said you have got to come see this! We had a guest and he as well went outside with us, there was a large (appox. 50ft across) silver disk just hovering over the power line in front of my house it made no noise and it seemed to be in no hurry (Just like the other ones it's like they don't care if you see them) it had round white lights all the way around it that strobed around in a circle and had a dome on top. I went back in the house not knowing what to do and to gather my thoughts but was drawn back out to see. It was so close to my house I was literally afraid! It slowly moved on by and off into the field by my house and just disappeared before my eyes! Now just who could you tell this story to? Well I've told it to you. I am interested to know what they are upto. I've written a blog on the ufo files and someone said they might be looking for certain minerals in my area. Which kinda makes sense since they were looking at the ground. Makes me a bit uncomfortable! If I had a good camera I could probably see right into the craft!"],"Source":"MUFON","City":"Perryville","Date of the Event":"03/13/2009 08:30 UTC","Case Number":"16061","Object Features":"Undisclosed","Latitude":"35.00481","files":["/var/www/straped/mufon/html2text/16061.html.txt","/var/www/straped/mufon/org/16061.html"],"Sighting Duration":"Undisclosed","Date Submitted":"03/13/2009 08:30 UTC","Summary":"I have seen two triangle shaped crafts on many occasions in the last 2 months they hover near the ground and not far off the road they seem to be in the same place at the same time of day repeatedly.","Longitude":"-92.802667","trends":["There have been no other sightings in Perryville","This sighting has never been favorited."],"Tags":"City","Viewing Distance":"Unknown","Country":"United States"}