{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.112198,+-84.51071(16060)&iwloc=A&hl=en\"> mufon case (16060) map </A>","Country":"United States","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16060.html.txt","/var/www/straped/mufon/org/16060.html"],"Latitude":"39.112198","Disposition":"IFO","Viewing Distance":"Over One Mile","Summary":"Faint high altitude blue/grey light following small jet.","Case Number":"16060","Date of the Event":"03/15/2009 12:00 UTC","Tags":"City","Date Submitted":"03/15/2009 12:00 UTC","City":"Cincinnati","Longitude":"-84.51071","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around March 15th 2009"],"Object Shape":"Sphere, Star-like","Source":"MUFON","Log Number":"US-03162009-0017","Sighting Duration":"Undisclosed","Region":"Ohio","Weather Factors":"Unknown","divs":["sighting detailson sunday 3-15-09 @ approx. 10pm i went outside to look at the night sky with my binoculars since the sky was perfectly clear. after about 2 minutes i saw a small private jet flying at about 1500ft at 45 deg due south of my viewing point that was heading north on a path that would take it directly over my head. i wanted to get a better view so i used my binoculars to look more closely at the aircraft, when i did, i notice a faint blue\\grey light that was slightly behind the aircraft but at a seemingly much higher altitude that i estimated was about the same height that i usually observe satellites at. by faint i mean that this light was not visible with the naked eye and was not a sharp pinpoint of light like most satellites but about twice the size and hazey. the other odd thing was that it moved about 2 to 3x faster than any satellite i've seen and i say it followed the jet only in the sense that it's pace seemingly matched that of the jet, never gaining or losing distance relative to the aircraft. this sighting lasted only about a minute before both objects were out of view. i observed 3 satellites in the next 5 minutes after this sighting and they were exactly what i am use to seeing and very much different from the blue\\grey light."]}