{"Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.411399,+-78.668939(16068)&iwloc=A&hl=en\"> mufon case (16068) map </A>","trends":["There have been 4 other sightings in Coats","There were no other sightings in Coats on or around August 31st 1996"],"Source":"MUFON","Country":"United States","Tags":"City","Viewing Distance":"20 Feet or Less","Region":"North Carolina","Object Flight Path":"Hovering then path","Object Features":"Wings, Other","Disposition":"Insufficient Data","Longitude":"-78.668939","Summary":"Something I saw as a kid.","Log Number":"US-03172009-0008","Date Submitted":"08/31/1996 08:00 UTC","Weather Factors":"None","Case Number":"16068","files":["/var/www/straped/mufon/html2text/16068.html.txt","/var/www/straped/mufon/org/16068.html"],"divs":["Sighting DetailsThis happened around 13 years ago, I was 8 at the time. It was a Monday night in either August or September. It was between 8-8:30 pm (I remember this because I was in Cub Scouts at the time and the meetings ended around 8 on Monday nights, and I remember school had just started back recently so it was either August or September). I was riding home with my mother (she wants to remain anonymous and doesn't remember much she did give me permission to use her name but she doesn't want to be contacted) from my Cub Scout meeting we were less than a mile from our house when we rounded a curve when we saw it (I don't remember who spotted it first). The object was shapped like a upside U with two large spotlights (it was these that drew our attention) on the bottom it also had numerous smaller red and green lights (like naviagation lights on aircraft), it was colored black or another dark color, it had no visible cockpit or propulsion system, and it was completely silent. It was hovering less than 50 feet (if I had a baseball I could've hit it) above a field (this field is about 5 feet from the road on the right side so the object was almost directly overhead) that was about 10 - 15 yards long and it seemed to be about as wide as the field below it, I'd estimate the height of the object to be 10 - 15 feet. It hovered there for about 2-2.5 minutes completely silent it then took off slowly at first but is started accelerating at a steady pace towards Coats NC which is about a 2-3 miles west. As it started to accelerate it started make an electrical humming that got louder as it sped up. It took less than a minute for it to leave our sight. During the time we saw it I wasn't afraid and I don't think my mother was either (she stopped the car in the middle of the road to look at it and she wouldn't have done that if she was frightened or concerned for our safety), I was curious about the object and so was my mother judging by her actions. I remember looking for a camera and asking my mother if she had one with her, she said no. I also asked if she knew what it was because I didn't, again she said no. I didn't feel in danger at anytime during the sighting and now that I look back on it I get the impression it was surveying the area (don't ask how I get this impression because I don't know I just do). After the object left me and my mother agreed not to tell my father because he would think we were crazy (when I finally told him several months later he treated me like child who says there's a monster under his bed). For a long time I thought it was an experimental military aircraft (based on the lights that looked similiar to red and green naviagation lights and the fact that I live in between several large military bases) but I've thought more about it lately and I can't understand why the military would test an advanced and obviously secret experimental aircraft so early at night in such a densely populated area near 3 major roads and 2 Interstates, then there's the lack of a visible cockpit (could have been on top) and propulsion system (I was close enough to it that it would have been impossible to miss and also because I got to see the front, left side, bottom, and back of the object) its beacuse of these things that I no longer think it was an experimental military (or civilian) aircraft, I don't know what it was. I still remember the object like I saw it 30 seconds ago and I could draw a very good sketch of it (I would've done it for this but I don't know how to transfer sketches to my PC). As an interesting sidenote after I saw this object I started taking an interest in UFOs (I already an interest in military aircraft) and I began to read books on the subject of UFOs and sightings of them to try and find out what it was (when I come across something I don't know I try to find out more about it). I still don't know what it was but I know it'll stick with me for a long time."],"Object Shape":"Other","City":"Coats","Latitude":"35.411399","Date of the Event":"08/31/1996 08:00 UTC"}