{"Region":"Texas","trends":["There have been 12 other sightings in Beaumont","There were no other sightings in Beaumont on or around March 17th 2009"],"Object Flight Path":"Unknown","Date of the Event":"03/17/2009 12:20 UTC","Weather Factors":"None","Country":"United States","City":"Beaumont","Summary":"Multi-colored UFO spotted in the sky.","Tags":"City","divs":["Sighting DetailsI had gone outside to have a cigarette and as I began to light up I noticed in the sky a bright object. At first I thought it was a star but after closer examination I noticed that it was far too bright and that it was blinking rapidly in array of different colors (blue, red, yellow, green). It almost looked as if the object was moving side to side slightly, but I wasn't sure. There was another witness who was at first skeptical claiming that it was a helicopter, however even he was in awe of the sight. After a few moments it seemed to dim, almost disappearing all together. Then it became bright again. The sighting lasted for thirty minutes until it seemed to fade out all together. Throughout the whole time of watching the object I felt as if it was communicating somehow, or even surveying the area. I did have a camera with me at the time, but I wasn't able to get the object because it was so far away. That and the fact I couldn't turn the flash off the camera. I haven't uploaded the photo's to my computer but would be willing to hand over what photo's I do have. I had a very eerie feeling during and after the object faded away. The weirdest part, aside from the UFO sighting, was the military aircraft that has been flying around our parts in the past few weeks. Earlier in the day I had seen a military helicopter flying low over the town of Port Neches. What I saw tonight was no star and nor was it a helicopter. There has been rumors of a secret military base in the area. This was not the first strange thing I have seen in this area, however this is the strangest of them all."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16066.html.txt","/var/www/straped/mufon/org/16066.html"],"Sighting Duration":"00:30:00","Disposition":"IFO","Longitude":"-94.123346","Object Shape":"Star-like","Object Features":"Unknown","Case Number":"16066","Latitude":"30.086314","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.086314,+-94.123346(16066)&iwloc=A&hl=en\"> mufon case (16066) map </A>","Log Number":"US-03172009-0006","Date Submitted":"03/17/2009 12:20 UTC"}