{"divs":["sighting detailsnote 1: eye witness reported sighting to me.. on monday march 16th approximated 8:20pm, while letting his dogs out and wanting to observe the space shuttle and iss fly-over, the witness spotted a dark gray-ish triangular object silently flying over-head. 1. color: dark gray-ish 2. shape: triangular in shape 3. structure: solid yet \"erie\" transparent with slight shimmering edges. 4. sound: no sound was emitted. 5. heading of object: south\\west towards north\\east 6. location of sighting: colorado springs at austin bluffs and academy 7. lights: none observed 8. observation: roughly 30 seconds 9. flight pattern: straight, steady velocity no swerving. 10. size: at arms length, roughly palm sized, 3 to 4 inches in diameter. 11. feelings: anxiety, nervous, amazed note 2: local authorities were called, no other reported witnesses. note 3: witness was not under any current medication or alcohol. witness contacted me and i'm requesting mufon assign case to me to complete. i will contact airport tower and other local authorities requesting if any other sightings were submitted. witness will draw a picture of what he saw and email it to me. chuck zukowski mufon star investigator ;-) mufon field investigator colorado springs, co 719-213-4250"],"Region":"Colorado","Case Number":"16071","Source":"MUFON","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-03172009-0011","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around March 16th 2009"],"Latitude":"38.843552","files":["/var/www/straped/mufon/html2text/16071.html.txt","/var/www/straped/mufon/org/16071.html"],"Country":"United States","Longitude":"-104.816123","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=38.843552,+-104.816123(16071)&iwloc=A&hl=en\"> mufon case (16071) map </A>","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","Summary":"Observed flying triangle traveling SW to NE.","Date Submitted":"03/16/2009 08:20 UTC","Date of the Event":"03/16/2009 08:20 UTC","Viewing Distance":"Unknown","City":"Colorado Springs","Object Features":"Undisclosed"}