{"Longitude":"-84.903052","Summary":"Object with multicolored lights seen in Portland,","Latitude":"42.869201","Source":"MUFON","Date Submitted":"08/10/1985 09:34 UTC","Case Number":"1607","Sighting Duration":"00:05:00","Weather Factors":"Unknown","divs":["Sighting DetailsWitness 1 was laying on the living room sofa watching TV. The television set isin front of a large picture window which faces south, overlooking a narrow dirtroad, a row of trees and brush on the other side of the road along a fence, andfields beyond. The neighborhood is very rural with widely scattered homes andfarms. Wit. 1 saw an anomalous object descending slowly behind the trees to thefield - while her vision was somewhat obscured by the branches, she could see itwas glowing intensely but not sparkling. There were 2 very bright pink lightsat the top of the craft, and a band of bright purple around the middleof thecraft like a belt. She said it appeared to be spinning slowly. There were twodull grey protubrances like landing gear at the bottom of this elongated oval. She jumped up, ran out onto the porch, and as the craft seemed to be landing,she ran back into the house to her brothers bedroom and called him out to seeit. He hurried out and described the same object as she did. They ran to gettheir parents, being away from the window about 1 minute, but when the fourreturned to the window, they could see no sign of the object. As he ran fromhis bedroom when his sister called, he noticed the digital clock on the TV said9:34 p.m. Both the father and Dan Wright searched for landing traces in thefields south and east of the witnesss home and found nothing that could not beattributed to deer or raccoon dameage in standing corn."],"Date of the Event":"08/10/1985 09:34 UTC","Object Shape":"Oval","Disposition":"Unresolved","Viewing Distance":"101-500 Feet","Region":"Michigan","Object Flight Path":"Straight-line path,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.869201,+-84.903052(1607)&iwloc=A&hl=en\"> mufon case (1607) map </A>","City":"Portland","Object Features":"Appendage(s)","Log Number":"","trends":["There have been 2 other sightings in Portland","There were no other sightings in Portland on or around August 10th 1985"],"Country":"United States","files":["/var/www/straped/mufon/html2text/1607.html.txt","/var/www/straped/mufon/org/1607.html"],"Tags":"City"}