{"Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","divs":["sighting detailsdriving eastward in the laguna hills\\laguna niguel area, my wife and i viewed a very bright star-like object directly above the saddleback mountains (southern part of the santa ana mountain range in south orange county) - object was viewed in the dim morning light after sunrise (7.40am). it seemed as if the object was moving very slowly upwards as it stayed within our perspective; it did not appear to radiate any color other than a very bright white light. at first, i assumed the object may be a plane approaching for john wayne airport, but the light appeared too bright and constant... usually main airplane lights fluctuate with perspective and are certainly not as intense. after viewing for over 1 minute, the object then appeared to rapidly 'flicker' away and vanish completely while in full view. there were no clouds and air quality was good. also, our view was not obscured throughout. i made a good attempt to see if the object was still visible in some way, but nothing was visible in any way that i could identify. the sun was rising from behind the mountains and this made for a reasonably well-lit viewing, but the object did not appear to be reflecting light - it appeared to be emanating it's own star-like light of exceptional intensity. airplanes do approach south orange county from the saddleback area, but their movements are frequent and familiar and can usually be tracked with the eye - even with changing perspectives. some airplane light usually remains visible on approach - regardless of the viewing perspective. i'm not sure if john wayne has incoming flights at this time in the morning - i believe they do not."],"Viewing Distance":"Unknown","trends":["There has been one other sighting in Coto De Caza","There were no other sightings in Coto De Caza on or around March 17th 2009"],"Tags":"City","Longitude":"-117.5875","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.595833,+-117.5875(16073)&iwloc=A&hl=en\"> mufon case (16073) map </A>","Log Number":"US-03172009-0013","Summary":"Star-like object viewed over Saddleback Mountains, Orange County, Southern Calif.","City":"Coto De Caza","Latitude":"33.595833","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/16073.html.txt","/var/www/straped/mufon/org/16073.html"],"Object Shape":"Star-like","Region":"California","Source":"MUFON","Date of the Event":"03/17/2009 07:40 UTC","Case Number":"16073","Object Flight Path":"Straight-line path","Date Submitted":"03/17/2009 07:40 UTC"}