{"Weather Factors":"Unknown","Summary":"Object staying still in the air, until we took a picture then started moving.","Country":"United States","Object Shape":"Circle, Disc","Case Number":"16074","Disposition":"IFO","divs":["Sighting DetailsWho would i call if every year i see these weird lights in the sky.It's different colors and is always in the same spot. (This only occurs one day in July)(And i'm not sure which day it was) and its weird because its in a direction of a airport. But around the area where i live. They are going to build house's but the construction workers discovered a bomb underground that never went off. The whole project stopped for about 3 week and no one every heard of why the bomb was there. Just the military took it and didn't say nothing. Is there a web site where i can see if the area i live in was a war zone or a bomb test site?? Now about my story... I was outside playing football and it was around 8:00 o'clock pm. I got thirsty and decided to get a drink. It only took about 2 min to get it. I came back outside and saw this small object in the air just staying still. I stared at it for awhile then started to see it move. Once it started moving i knew it wasn't me just seeing things. I called my dad and got the camera. I took some pictures and a video of this weird object. Once i did that the object started moving back and forward. We both knew it wasn't a plane. (We live near a airport and can see the plane getting ready for landing). The object was in that same spot for about 23 25 min. We sat down and started to observe this mysteries object. The object stopped moving and lights we just moving around it in a disc way. At that time the lights stopped and the space craft jumped across the sky and we never saw it again. As I have said I have seen this object in July ever year and i am not certain which day it was on. I can give a guess and i think it was 11th-19th. I told myself it was fake and it was just maybe a plane or something. But i believe it and i would like some help to figure out what it is. If anyone can help msg me at (maximboy07@hotmail.com) I really want to find out what this object is thnx for reading ;]"],"Date of the Event":"06/30/2008 12:00 UTC","Latitude":"31.976929","Log Number":"US-03172009-0014","Date Submitted":"06/30/2008 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.976929,+-99.892253(16074)&iwloc=A&hl=en\"> mufon case (16074) map </A>","Region":"Texas","Longitude":"-99.892253","Sighting Duration":"Undisclosed","Tags":"City","Object Flight Path":"Stationary,Path with directional change","files":["/var/www/straped/mufon/html2text/16074.html.txt","/var/www/straped/mufon/org/16074.html"],"City":"Mexico","Object Features":"Dome, Unknown","trends":["There have been no other sightings in Mexico","This sighting has never been favorited."]}