{"files":["/var/www/straped/mufon/html2text/16079.html.txt","/var/www/straped/mufon/org/16079.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.749747,+-119.769886(16079)&iwloc=A&hl=en\"> mufon case (16079) map </A>","Log Number":"US-03172009-0019","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/15/2009 12:10 UTC","divs":["Sighting DetailsLooking at Deodar Cedar tree in my backyard and noticed 2 dull-white spherical objects in the sky above at approximately 800 to 1000 ft. in the air. At first they looked like balloons. They were both the same size from what I could see. The objects appeared to be making a lazy circle and completed several rotations without any apparent patterns. As I watched them, one dipped out of view behind our tree and I lost sight of it. The other was still making an arc, and I believed it was a large balloon, floating upward on a thermal. It was a warm day and almost no clouds visible. Then, I observed the sphere suddenly change direction, as if a very strong wind had grabbed it and the object flew over my house, still at a fairly high altitude. I had to run out of the backyard and into my front yard to keep it in view. Hoping to get a better look at it, I watched it very closely. Suddenly it changed direction again and flew a straight course at an incredible rate of speed. I would estimate 300-400MPH to the west! On a perfectly straight line into the prevailing wind. I watched it for about another 10-20 seconds as it disappeared heading west toward the general direction of Firebaugh and the coastal mountains. It was clear to me that it was under some kind of guidance and propulsion. There was absolutely no audible sound from the sphere. It was a strange-looking dull white without any visible lights, almost as though it was illuminated, but in broad daylight and full sun. It was like it became aware of my gazing at it and reacted by zooming off! It was a weird feeling. I watched the sky for at least another 30 minutes and did not observe anything further. I am attracted to weather, take a lot of photographs of clouds and the sky. Have seen many balloons in the air at distances, but never seen an object like this one."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Region":"California","trends":["There have been 63 other sightings in Fresno","There was one other sighting in Fresno on or around March 15th 2009"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","Summary":"White spheres above central Fresno, CA.","Weather Factors":"Windy, Light","Latitude":"36.749747","Disposition":"Unknown","Case Number":"16079","Object Shape":"Sphere","Source":"MUFON","City":"Fresno","Tags":"City","Country":"United States","Longitude":"-119.769886","Date of the Event":"03/15/2009 12:10 UTC"}