{"Latitude":"34.488111","City":"Lake Havasu City","Longitude":"-114.319945","Case Number":"16085","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16085.html.txt","/var/www/straped/mufon/org/16085.html"],"Summary":"Series of three very bright lights, varying intensity, lit up then faded out over the mountains.","Object Features":"Unknown","Weather Factors":"None","Country":"United States","Date Submitted":"03/17/2009 08:30 UTC","Date of the Event":"03/17/2009 08:30 UTC","Disposition":"Unknown","trends":["There have been 30 other sightings in Lake Havasu City","There was one other sighting in Lake Havasu City on or around March 17th 2009"],"Object Shape":"Sphere, Unknown","Log Number":"US-03182009-0005","Object Flight Path":"Stationary","divs":["Sighting DetailsI am reluctant to report this additional sighting as just reported a separrate sighting a few days ago. My wife convinced me that I must. Sure enough, last night at approx. 8:30 PM, March 17th 2009, I stood up in the back yard of the house we were visiting and faced East. From my chair a few minutes earlier, I had noticed the star Sirius blazing away in the dark night sky. Left of Sirius there was an aircraft flying very low with abnormally consistant bright red lights on what looked to be the tail end and front end of the vehicle. One strobe flashed in the center. I dismissed that particular set of lights because for some reason the planes in thei are don't have to conform to ANY FCC rules as their lights are \"just whatever color\" and placed without regulation on \"just wherever\" on the plane. That's another story...So, after viewing this aircraft and Sirius for a short time, I noticed that the craft did move East over the mountains and was approx. at 6000ft alt. when it disappeared from view. A moment later, I stood up and stretched and glanced over to Sirius again. I saw three very bright but distant lights light up in horizontal form relative to one another. The lights was whitish-orange and had a large \"body\" to them. I would go so far as to say they were spherical orbs emiting copious amoutns of light. The three lights lit up one at a time and I don't remember the order. The middle light seemed to be on first. after only a few seconds, the Right light faded out, then the left, then the middle. My best guess on altitude would be 10,000ft. I would also guess they were attached to a single object because of the uniform distance from each other and perfect alignment. The total duration from my perspective was approx. 10 seconds. I watched the sky for over an hour afterwards and did not see them return."],"Source":"MUFON","Region":"Arizona","Tags":"City","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.488111,+-114.319945(16085)&iwloc=A&hl=en\"> mufon case (16085) map </A>"}