{"Summary":"Tilted looking Object moving from west to east.","Disposition":"IFO","Longitude":"-105.077103","Object Flight Path":"Straight-line path","Region":"Colorado","Tags":"City","files":["/var/www/straped/mufon/html2text/16082.html.txt","/var/www/straped/mufon/more/16082_submitter_file1__1ST_VIEW.JPG","/var/www/straped/mufon/more/16082_submitter_file2__2ND_VIEW.JPG","/var/www/straped/mufon/more/16082_submitter_file3__3RD_VIEW.JPG","/var/www/straped/mufon/org/16082.html"],"Object Features":"Unknown","trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around March 17th 2009","This sighting has never been favorited.",""],"Country":"United States","Latitude":"39.71001","map":"<A HREF = \"http://maps.google.com/maps?q=39.71001,+-105.077103(16082)&iwloc=A&hl=en\"> mufon case (16082) map </A>","divs":["Sighting DetailsI was on my way to an appointment, and had just turned onto northbound Wadsworth Blvd from Center Ave, in the Belmar area of Lakewood. A second or two after making the turn, I noticed this white \"line\" (could have been cylinder, cigar, disc or almost any shape) moving fairly quickly from left to right (west to east) well ahead of me - I estimate at least a few miles, maybe several miles (could have been over Wheat Ridge or Arvada...). As it got further east, the white color dimmed to a gray color, probably from going underneath the shade of a cloud (just a good guess). It was difficult to keep a really good eye on it as I was in rather heavy traffic, which was slowing down as I approached Alameda Ave., so I had to also keep a good eye on the traffic. I lost sight of it as it went out of view (an office building on the NE corner of Wadsworth & Alameda blocked my view). Once the traffic had moved forward enough, past Alameda Ave, I looked for it again, but could not see it, and had to continue to be careful driving. It might have still been there, but harder to see perhaps because it closely matched the color of background clouds? It also would have been getting farther away (farther to the east). I did not have a camera with me, and even if I had had one, I wouldn't have had time to turn it on, aim it and snap pictures while driving in heavy traffic - would have been very unsafe, also. However, I went back to that stretch of Wadsworth Blvd and took 4 pictures, approximating what my views were as I was driving this morning. I then used software to draw in what it looked like to me. I will upload the pictures in the sequence of the viewing; you will be able to see it as a white, angled line, west of Wadsworth and roughly above a bank building on the left side of the street, past Alameda Ave. The 3rd and 4th pictures show how it dimmed to gray as it moved farther east. I was on the phone with a friend this afternoon and told him about it. He asked me if it could have been an airplane banking in a turn. No, it could not have been that; if it had been that, it would have not appeared to move relative to my position, as it would more or less be flying away or toward me, not moving to my right (east), and it maintained this \"tilt\" throughout is movement eastward. If it was an airplane, then this would mean that the nose of the plane was inclined about 45 degrees, the nose pointing up and the tail pointing down. When a plane is landing at an airport, the nose is SLIGHTLY raised so that the rear landing gear touch down, then the nose lowers and the forward gear touch down. This was a much greater angle. If it was a plane, then something must have been very wrong and the passengers would have been very uncomfortable, to say the least. So, no, I don't believe it was an airplane. If it wasn't an airplane, what was it??? My MUFON ID is 10646. I have been a member since 2005. I could only upload 3 pictures. I have the 4th if anyone is interested. Keep in mind these are illustrations, not actual photos of the object, but I am pleased with the result. This is what I saw."],"Weather Factors":"None, Does Not Apply","Object Shape":"Unknown","Source":"MUFON","Date of the Event":"03/17/2009 11:42 UTC","Case Number":"16082","City":"Lakewood","Viewing Distance":"Over One Mile","Sighting Duration":"00:00:12","Log Number":"US-03182009-0002","Date Submitted":"03/17/2009 11:42 UTC"}