{"Summary":"Strangely moving bright ball of light in Central North Carolina night sky.","Latitude":"36.095972","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Object Shape":"Sphere, Star-like","divs":["sighting detailsi, including my brother and his girlfriend, witnessed a strange moving light in the night sky in mebane, north carolina (about 12 miles west of chapel hill). it happened friday june 6 2008. it happened approx. 11pm. i was talking with my brother on my back deck (his girlfriend was talking to her parents on a cell, but witnessed the event as well) and we were also looking at the western sky, enjoying the clear night, when i noticed an unusually bright, white, large stationary star just under the spoon of the big dipper. i thought it a little strange because i didn't think, from my limited knowledge of constellations, there was a large star under the big dipper. i looked down briefly, and my brother said, \"wow, i think it's moving...that's not a star.\", sure enough it did, and it traveled in an north easterly direction at a smooth, quick pace (much faster than you would see a high altitude jet). whatever it was seemed to me to be at very high altitude. i noticed it didn't have a trail like a meteorite does (and meteorites are much faster). i was also looking to see if it had tail lights or blinking lights, and i saw none. there was no sound. it traveled for a distance heading in the same north east direction, and it seemed to shrink into an red\\amber light about half as bright and size... at that time, i knew for sure it was something very unusual, when it did that it startled us. it then abruptly turned in the opposite direction, traveled again for a short distance, then remained stationary for a few seconds, then seemed to zip out of sight like it was traveling upwards at a high rate of speed. the whole encounter was about approximately 5 minutes in duration. unfortunately it happened so fast, and i was so captivated, i didn't even think about getting my camera."],"Date of the Event":"06/06/2008 12:00 UTC","Region":"North Carolina","Log Number":"US-03182009-0006","Longitude":"-79.266962","Source":"MUFON","Disposition":"Hoax","Object Flight Path":"Hovering then path","Case Number":"16086","trends":["There has been one other sighting in Mebane","There were no other sightings in Mebane on or around June 6th 2008"],"Tags":"City","Date Submitted":"06/06/2008 12:00 UTC","City":"Mebane","files":["/var/www/straped/mufon/html2text/16086.html.txt","/var/www/straped/mufon/org/16086.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.095972,+-79.266962(16086)&iwloc=A&hl=en\"> mufon case (16086) map </A>","Weather Factors":"Unknown","Object Features":"Unknown"}