{"Tags":"City","Object Features":"Dome, Window(s), Other","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around May 31st 1977"],"Region":"Michigan","Case Number":"1608","Longitude":"-83.678376","files":["/var/www/straped/mufon/html2text/1608.html.txt","/var/www/straped/mufon/org/1608.html"],"Date Submitted":"05/31/1977 05:00 UTC","Weather Factors":"Unknown","Latitude":"43.017237","City":"Flint","Sighting Duration":"00:30:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.017237,+-83.678376(1608)&iwloc=A&hl=en\"> mufon case (1608) map </A>","Viewing Distance":"501 Feet - 1 Mile","Summary":"Domed object with windows in Flint,Michigan","Log Number":"","Disposition":"Unresolved","Object Shape":"Disc","Object Flight Path":"Unknown","Date of the Event":"05/31/1977 05:00 UTC","divs":["Sighting DetailsNarrative taken from FI report:June of 1977 sixteen people were gathered at a house in Flint for dinner. About5:00 p.m. one of the dinner guests who was seventeen at the time left the livingroom and went outdoors. He had not been outside very long when he called to theothers, telling them to come outside very quickly. He was pointing north. Everyone gathered outside. They were astonished to see a strange objecthovering 50-100 feet over the tree tops, less than a city block away. The craftcontinued to hover for some thirty minutes. Bishop Airport and Flint City Policewere contacted. It was learned that other people were witnessing the sameobject. Wit. 1. estimated that the object was 80-100 ft. across, was round witha domed top, there were windows all around the dome. The bottom of the objectwas somewhat concaved and there was an object sticking out at the back whichresembled a big pipe. He could not see any lights on the object. Afterhovering for some thirty minutes, the dull aluminum colored object made a highpitched sound that resembled \"a gyro top\" and it starrted moving slowly to thesouth. The object then made a sudden 90 degree turn to the west. The back ofthe object, where the pipe protruded, pointed downward and the object went fromzero to an unbelievable speed and was out of sight in a second."],"Source":"MUFON"}