{"Summary":"2 jets chasing an orange object.","map":"<A HREF = \"http://maps.google.com/maps?q=39.659205,+-78.759648(16092)&iwloc=A&hl=en\"> mufon case (16092) map </A>","Tags":"City","Object Shape":"Blimp","trends":["There have been 8 other sightings in Cumberland","There were no other sightings in Cumberland on or around"],"Source":"MUFON","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Viewing Distance":"Unknown","Log Number":"US-03182009-0012","Case Number":"16092","Region":"Maryland","divs":["Sighting DetailsThis happened years ago. I don't remember the year or the date. My son and I pulled into our driveway and got out of the car. We live in an area without street lights so the sky is really bright and beautiful. My son pointed to an orange light in the sky. We thought it was Mars. That is until we noticed there were 2 jets chasing Mars. They were extremely hight. The orange ojbect sat still and waited for the jets to get close then it moved in a straight line away from them in a blink of an eye. It sat still and waited. The jets slowly turned in the new direction and slowly closed the gap. The object moved again. It almost looked like it was playing with the jets. The jets slowly turned toward it. The object took off. I have never seen anything move that fast. It vanished over hundreds of miles in just a second. The jets turned around and we went inside. We see lots of jets flying over where we live. I figure the jets had to be from the air base in Martinsburg, WV. That's the closest base that I know of. We also are within 2 miles of ABL which is a place they make missles in WV. This is not the only object we've seen."],"Object Features":"None","Disposition":"IFO","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16092.html.txt","/var/www/straped/mufon/org/16092.html"],"Longitude":"-78.759648","City":"Cumberland","Latitude":"39.659205","Date of the Event":"Unknown","Date Submitted":"03/18/2009 01:15 UTC","Country":"United States"}