{"Weather Factors":"Snow, Light","trends":["There have been 5 other sightings in Kingston","There were no other sightings in Kingston on or around March 16th 1993"],"Object Flight Path":"Hovering then path,Path then hovering","Date Submitted":"03/16/1993 05:30 UTC","divs":["Sighting Details The blizzard of 93 was supposed to start as rain and then we were to get a couple inches of snow. I love the snow so I couldn't sleep well.I live in a very secluded area, my nearest neighbor is a quarter mile away. I woke up about 5 and looked outside. The snow was just starting, nothing on the ground yet. The snow flakes were the size of tennis balls and it wasn't that cold yet, maybe 34 and the wind wasn't blowing.When the snow started, it fluxuated, hard one minute and the next nothing. I stepped outside to stand on my deck to see the snow starting to fall. No noise but I looked at the tree line beside my house and there it was.It was long and it was round in the front. The back of it was wider than the rest of the ship. There were no lights. It was just floating along the road. Not much faster than a walking speed.It was about 300' off of the ground and about 500'from me. It appeared to be about 200' long. It was big! I work surveying so I'm pretty good with distances. I freaked out and ran back inside to get my wife to come and see it but she wouldn't wake up.I screamed for her to get up and come see this thing, but she never moved. I returned to the deck, by this time it was gone. I watched the ship, and it was a ship, about 2 or 3 minutes before I went in to get my wife. Thats how slow it was floating by.The sky was full of low clouds but this thing was below the cloud cover.It was no cloud, of that I'm sure. I'll never forget the blizzard of 93' for more than one reason.My neighbor, who has died since, used to tell me, the \"flying sausers\" were landing in a clearing behind my house, past the woods. I kind of made fun of him back then, I don't anymore.Not since I've seen one up close."],"Region":"Tennessee","Object Features":"Dome, Wings","Sighting Duration":"00:02:30","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.886528,+-84.505275(16090)&iwloc=A&hl=en\"> mufon case (16090) map </A>","Date of the Event":"03/16/1993 05:30 UTC","Log Number":"US-03182009-0010","files":["/var/www/straped/mufon/html2text/16090.html.txt","/var/www/straped/mufon/org/16090.html"],"Longitude":"-84.505275","City":"Kingston","Object Shape":"Other","Latitude":"35.886528","Tags":"City","Source":"MUFON","Summary":"The blizzard of 93' was starting and an object floated by my house.","Case Number":"16090"}