{"Summary":"3 fireballs appeared then 2 by my house then ended up by one mountain and another.","Region":"Arizona","Date Submitted":"03/17/2009 08:25 UTC","Weather Factors":"Unknown","Object Shape":"Fireball, Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.761474,+-111.661468(16098)&iwloc=A&hl=en\"> mufon case (16098) map </A>","City":"Arizona City","files":["/var/www/straped/mufon/html2text/16098.html.txt","/var/www/straped/mufon/more/16098_submitter_file1__0325night01029.JPG","/var/www/straped/mufon/org/16098.html"],"divs":["Sighting Detailswe were bbq last night and my family and neighbors saw these three orange fireball lights right above a house across the street then then disappeared and reappeared above the next house disappeared and reappeared over the city towards these mountains. our 2 friends came home from the 3 mile stretch and said they saw these 6 org fireball lights in the sky sitting there it was 3 and 3 seperate and they were vertical.we have been seeing strange fireball lights between these two mountains towards casa grande by tabletop. we have been seeing them for about a month now first started when my sister and neighbors mom noticed them above the houses across the street said they looked like they were chasing eachother. then another night my 2 sisters went to the liquor store and my sister and i went to arbys and she called saying there was a ufo above our city and as we looked it was a big object hovering over our city in one spot for atleast 5mins it had red lights on it that my sister was closer said it looked triangler and she had seen something similar last year like that same area. my sister and her husband seen the same object on their way to nico's. there is 12 of us as witnesses about all my neighbors in my duplex area. we have been spotting them just about everynight in different forms and i do have different nights on videotape. last night we saw it more strange than ever last night when they appeared by the houses and over two mountains at the same time and when they disappear there seems to be star like twinking lights that form different shapes twinking around like triangler and a line. i read people are seeing the same in lake havasu. if you seen this please contact me."],"Country":"United States","Log Number":"US-03182009-0018","Case Number":"16098","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"32.761474","Sighting Duration":"Undisclosed","Object Features":"None, Unknown","Object Flight Path":"Stationary,Hovering then path","Disposition":"IFO","Date of the Event":"03/17/2009 08:25 UTC","trends":["There have been 2 other sightings in Arizona City","There were no other sightings in Arizona City on or around March 17th 2009","This sighting has never been favorited.",""],"Longitude":"-111.661468"}