{"Date of the Event":"07/31/1980 12:00 UTC","divs":["Sighting Detailswe were at a gaso station next to the bath, illinois, highschool and the object was larger than the entire block and only 500 feet or less above us. my friends could see movement of occupants(?) behind the vertical windows. there was definately some kind of 'lost time' type of occurance. none of has ever been quite the same since... when the object moved slowly toward the illinois river (only three blocks away)we could clearly see that it had to be some kind of disc-shaped object. the windows were the same from the rear as they were from the front. we could determine the size better as well as the object was contrasted between the tree tops and the night sky. suddenly it was gone--instatly. we all marvelled and are still amazed by this. I, along with, my parents, uncle, brother, sister and friends have seen quite a few very strange and unexplainable phenomenon in the deep rural illinois skys, especially in mason county."],"Latitude":"40.193378","trends":["There have been no other sightings in Bath","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet, Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"16099","files":["/var/www/straped/mufon/html2text/16099.html.txt","/var/www/straped/mufon/org/16099.html"],"Weather Factors":"Unknown","Summary":"I, along with four friends, witnessed a distant amber sphere in the distant eastern sky that with several right-angle-type maneuvers, suddenly appeared overhead as a very large--and silent--object with brightly-lit windows all down it's length.","Object Features":"Window(s), Other","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=40.193378,+-90.140952(16099)&iwloc=A&hl=en\"> mufon case (16099) map </A>","Longitude":"-90.140952","Disposition":"Insufficient Data","Country":"United States","Region":"Illinois","City":"Bath","Date Submitted":"07/31/1980 12:00 UTC","Tags":"City","Source":"MUFON","Log Number":"US-03182009-0019"}