{"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/16097.html.txt","/var/www/straped/mufon/org/16097.html"],"Longitude":"-111.99378","Sighting Duration":"Undisclosed","Latitude":"40.692703","Disposition":"Unknown","Tags":"City","Log Number":"US-03182009-0017","divs":["Sighting Details March 11th, 2009 at about 8:26pm or about 8:29pm? I saw a dull white triangle wing that was coming from the south area of the sky and moving northward. It was moving through the very thin white clouds. It was almost the same color of the clouds except lighter. I could not see any lights on it at all. I ran to get a camera. As I ran I quickly glanced back up to see where it still was. It was gone or disappeared. It wasn't moving that fast. It still should have been visible. It was silent and about 2,000ft AGL. I only saw it a moment, I could not see though it. I thought I was seeing things at first! Who wouldn't? Then at about 8:48pm I saw a white dull triangle wing shape at a distance. I wondered if it might be birds at first. As it got closer I could see that it was a wing shape object with squared corners. It looked to be solid with no visible lights on it. I could clearly see it. I could not hear any sound coming from it. Before it got even with me at about a 2:00 position, it disappeared! I first saw it about 2 blocks away. I think it was about 1,500 feet AGL and coming from the south moving northward. I seen a clear light come from it just before it vanished, it reminded me of a window. I'm not saying it was a window on it or what, I don't know. It also appeared to become translucent before disappearing. It was a weird thing to see. The sighting of this object was very brief. Perhaps 2-3 seconds? I have no witness to calibrate my testimony, you only have my word on it. I stayed out until about 10:45pm, I was kind of happy that I did not see anything else. I would be happy to know that it was one of over secret air craft's, not knowing concerns me."],"Country":"United States","Source":"MUFON","Object Shape":"Boomerang, Chevron","trends":["There have been 12 other sightings in West Valley City","There were 2 other sightings in West Valley City on or around March 11th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=40.692703,+-111.99378(16097)&iwloc=A&hl=en\"> mufon case (16097) map </A>","City":"West Valley City","Region":"Utah","Weather Factors":"None","Date of the Event":"03/11/2009 08:26 UTC","Date Submitted":"03/11/2009 08:26 UTC","Case Number":"16097","Summary":"Two white triangle wings see over West Valley City, UT.","Object Features":"None","Object Flight Path":"Straight-line path"}