{"Disposition":"Unknown","Latitude":"38.816068","Longitude":"-90.698368","Country":"United States","Tags":"City","Sighting Duration":"00:01:00","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16095","files":["/var/www/straped/mufon/html2text/16095.html.txt","/var/www/straped/mufon/org/16095.html"],"Object Features":"Unknown","Object Shape":"Fireball, Sphere","Source":"MUFON","Log Number":"US-03182009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=38.816068,+-90.698368(16095)&iwloc=A&hl=en\"> mufon case (16095) map </A>","Summary":"Saw 2 orange/red glowing globes slowly drift over subdivision","Region":"Missouri","Date of the Event":"10/31/2008 10:00 UTC","Object Flight Path":"Straight-line path","trends":["There have been 15 other sightings in O'Fallon","There were no other sightings in O'Fallon on or around October 31st 2008"],"Weather Factors":"Unknown","Date Submitted":"10/31/2008 10:00 UTC","City":"O'Fallon","divs":["Sighting DetailsI was sitting in my front yard after having completed trick-or-treating with my wife and children. I was sitting across a small bon-fire from my friend who pointed over my left shoulder and asked, \"What is that?\" I turned to see, just over the top of my neighbors house what looked like two glowing globes flickering from red to orange. My first impression was that of balloons with a candel inside that glowed the color of a typical fire (orange, yellow red). As they continued to float over the neighbors houses and the street that my house is on, I noticed absolutly no sound which further supported my perception of floating balloons. The area I live is used for hot air ballooning and I have seen multiple occurances of these over the last few years and based upon the color of the flickering lights and my perception of the height of the object, I would have assumed I would have been able to hear the sound of the gas ingnition of a hot air balloon. The two glowing objects started off in horizontal alingment to each other and upon progressing about halfway through our field of view rotated to a vertical alingment. As this movement progreess they appeard to stay a fixed distance apart. I could see no structure between or surrounding the objects. My friend, his wife and I continued to observe the lights for a total of about one minute. My perception was that they were about the height of a low flying helicopter. Further, my perception was that they would have covered about 5 miles in that amount of time and just slowly shrunk from our sight. The genearl direction of travle was from west to east. The night was very calm at least at ground level because the smoke on the fire was consistantly vertical."]}