{"City":"Tullahoma","Region":"Tennessee","Longitude":"-86.208274","Country":"United States","Sighting Duration":"Undisclosed","Summary":"Righ after sunset my father and I witnessed a light about 1000 ft up slowly move across the sky and over our house.","map":"<A HREF = \"http://maps.google.com/maps?q=35.364634,+-86.208274(16091)&iwloc=A&hl=en\"> mufon case (16091) map </A>","Disposition":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03182009-0011","Date Submitted":"03/16/2009 08:00 UTC","trends":["There have been 4 other sightings in Tullahoma","There were no other sightings in Tullahoma on or around March 16th 2009"],"Object Shape":"Other","divs":["sighting detailsi was out in the backyard when i saw what first appeared to be a plane coming from over the treetops about 1-1\\2 miles away. i'd never seen a plane come so low from that direction before and it seemed a bit strange looking because there weren't any navigation lights. i assumed i was at an angle where i couldn't see the navigation lights, but just the headlights. the light was white and bright and i could see no structure. i lived next to dullus airport for 20 years in va so i knew that this was a little strange to start. as i continued observing i decided to get my father out there. by that time the light had already moved above the house as it moved in one direction the whole time. as it passed over we never saw any navigation lights, it was just a silent slow moving light about the size of a passenger plane though just a ball of light. we watched it continue forward in the same direction headed towards normandy lake from ovoka where i live. it moved sw-ne over hunters point towards normandy lake. there is an airforce base nearby (arnold air force base), whether this was some test or not i couldn't tell you, but it was definatly strange. did anyone else see this or anything similar around coffee county? jryan.daniel@gmail.com"],"Date of the Event":"03/16/2009 08:00 UTC","Object Features":"None","Case Number":"16091","Latitude":"35.364634","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16091.html.txt","/var/www/straped/mufon/org/16091.html"]}