{"Tags":"City","City":"Stoke-on-Trent","files":["/var/www/straped/mufon/html2text/16096.html.txt","/var/www/straped/mufon/more/16096_submitter_file1__plane.png","/var/www/straped/mufon/more/16096_submitter_file2__plane2.png","/var/www/straped/mufon/org/16096.html"],"Date of the Event":"03/16/2009 07:32 UTC","Date Submitted":"03/16/2009 07:32 UTC","Summary":"An orange orb/fireball. Bit bigger and faster than a plane. Then a jet thing following it.","map":"<A HREF = \"http://maps.google.com/maps?q=53.007238,+-2.173984(16096)&iwloc=A&hl=en\"> mufon case (16096) map </A>","Sighting Duration":"Undisclosed","Longitude":"-2.173984","Log Number":"GB-03182009-0016","Country":"United Kingdom","Region":"England","Object Flight Path":"Undisclosed","Latitude":"53.007238","Object Shape":"Bullet, Missile, Circle, Fireball, Sphere, Other, Unknown","divs":["Sighting DetailsOkay then. So I was going out. and waiting outside for my mum. and i started skating (i usually do on my scooter) and i got to the bottom of the hill (the turn around bit with the tree, on the dead end,) and looking south from jervis street, (just by chance) id say it was 1 mile away. i saw an orange fireball. it was going quite quickly south and whilst i watched it, directly above me there was a jet kinda thing with rounded wings and little lights - the blue and red things (you can see my rubbish drawing here, its quite easy to tell) it was going in the same direction as the fireball but slower and it was COMPLETELY SILENT. and it looked twice the size of a normal boeing plane thingy. the lights slowly moved around the plane too. well anyway. the the jet was going so slow i thought it was actually hovering over me. and i looked back at the fireball and it continued going south until i lost view because of the houses. (see the other image)"],"trends":["There have been 8 other sightings in Stoke-on-Trent","There were no other sightings in Stoke-on-Trent on or around March 16th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"16096","Disposition":"Unresolved","Object Features":"Undisclosed"}