{"Sighting Duration":"Undisclosed","Tags":"City","Latitude":"36.754817","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Summary":"Soft appearing rectangular, silver, slowly going from west to east at same speed no banking or turning.","Date of the Event":"03/09/2009 02:00 UTC","Source":"MUFON","Case Number":"16106","files":["/var/www/straped/mufon/html2text/16106.html.txt","/var/www/straped/mufon/org/16106.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Country":"United States","City":"Fresno","divs":["sighting detailsi went up the hill to the shell station to get gas and while i was admiring the beautiful blue sky i saw a siver softly rounded rectangular appearing craft slowly flying from the west to the east in a straight line, no banking, no turning, no con-trail, no changes in direction that i could see. at the same time, coming from the south east,a plane was flying, it appeared that there could be a collision, but the plane (clearly a plane with the con-trail) appeared to be at a much higher altitude, so no contact there ( and i could distinctly see it was a plane). i was there approx 3-4 min, and when finished, dashed home to get the binoculars, but it was gone by then. i suppose it very well could be a plane, however, no colors, no banking, so did not see wings or tail. let me know if there was any sighting that day just in case it was not a plane, if possible. i came home and estimated it's size as about 1\\2 inch to 1 inch in length. like i said, it could be a plane just flying a straight course, but thought i'd write anyway since it seemed a little strange. thanks, sam"],"Region":"California","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around March 9th 2009"],"Longitude":"-119.763006","Log Number":"US-03192009-0004","Date Submitted":"03/09/2009 02:00 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.754817,+-119.763006(16106)&iwloc=A&hl=en\"> mufon case (16106) map </A>","Object Shape":"Square, Rectagular"}