{"Longitude":"-87.833459","Log Number":"US-03182009-0022","Source":"MUFON","City":"Park Ridge","Region":"Illinois","divs":["Sighting DetailsWhile looking outside of my window at work I noticed a grayish, shaded object move across my sight line in the sky. There were some clouds out, but for the most part the sun was out and it was relatively clear. I work within a couple of miles of O'Hare airport, so I see airplanes flying in all of the time. That day was no exception. So when I saw this object I kept waiting to see an airplane break out from the clouds and appear, but it never did. The object never changed shape, color, or speed. There were no lights. In fact, from beginning to end the sighting probably lasted 3 seconds, but by 2.5 seconds I realized that this was something I might want to pay attention to. I jumped up to get a better look because it was leaving my line of sight. By the time I made it to my feet and looked out of the window the thing was completely gone. It's likely that it just continued to fly the same vector and flew out of range of my sight line, but I was still surprised that I couldn't find it in the sky. My view out of the window still gave me pretty good view of the daytime sky. There were construction workers outside and some employees are out there all of the time, but I don't think anyone saw it. I wanted someone else to see it, but there was no commotion and I'm not the type to start any. I have to be clear. This thing NEVER changed shape or was distored by the clouds. I expected it to change shape as it flew through the clouds. This had me believe that the damn thing was flying UNDERNEATH the cloud line...and that freaked me out but I didn't realize that until the thing had just about disappeared. This thing was grayish in color but it didn't appear completely solid. That's why I though it might have been a particularly low flying plane. I was indoors so I don't know if it was making any kind of noise. Also, and in retrospect, this thing appeared to be 3 separate pieces (a sketch is attached). They were moving in unison which is why I was sure it was a low flying plane of some sort. But the sketch that I drew of exactly what I saw represents 3 independent objects. My brain wants to believe that it was one object. Nonetheless, the sketch represents two long cigar-shaped bars and one shorter cigar shaped bar in the middle. The fact that my mind couldn't process what I was seeing blows me away because I was WAITING for this \"plane\" to appear through the clouds and it never did. I don't know if I'm ready to say that this was an \"alien\" spacecraft with green people and stuff, but I didn't know what the hell it was, and I felt compelled to tell my wife (who promptly called me nuts and told me to get back to work). I didn't tell anyone else because I DO NOT want people thinking I'm a nut case or UFO watcher. Seriously. I'm not a conspiracy theorist, but I am curious. I can't resolve what I saw. One of the first things I thought was was the movie Predator where the alien creature went into stealth mode. You could tell that something was there, but you really had to focus...and then you could only really make out an outline. That's sort of how this object appeared, minus the shiny mirror type effect. The edges or outline of this object were much smoother. I can't say it enough: I was SURE that it was a plan ready for landing, but the damn thing never broke from the clouds...it was BELOW the clouds. I thought it was a plane that looked funny because it was flying through the cloud line. It NEVER changed shape or color, like an object would appear to be if it moved through the clouds. I don't even know if that makes sense. I just hope someone can understand what I'm trying to explain. The object stayed exactly the same as it moved across my line of sight. It appeared to move no faster or slower than a plane...but I see planes ALL THE TIME and this thing was like NO other plane I had seen before or sense. Please see my sketch. That's the best I can explain it. The sketch shows EXACTLY what I saw move across the sky, only not as solid as the sketch appears to be. It was sort of transparent...like some sort of stealth. I think my mind wanted to \"fill in\" the rest of the image. That's why the sketch appears to be cigar shaped. This was not a triangle."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.020351,+-87.833459(16102)&iwloc=A&hl=en\"> mufon case (16102) map </A>","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Park Ridge","There were no other sightings in Park Ridge on or around March 16th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/16102.html.txt","/var/www/straped/mufon/more/16102_submitter_file1__img328.jpg","/var/www/straped/mufon/org/16102.html"],"Viewing Distance":"Unknown","Country":"United States","Case Number":"16102","Date of the Event":"03/16/2009 12:15 UTC","Object Features":"Undisclosed","Date Submitted":"03/16/2009 12:15 UTC","Latitude":"42.020351","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Tags":"City","Object Shape":"Cigar, Cylinder, Unknown","Summary":"Stealth-like 3 cigar shaped \"object\" around O'Hare Int'l airport in Chicago."}