{"divs":["Sighting DetailsMy wife and I were headed out to run that evening. We live in a very rural area with only a very small residential establishment. The night sky is always very visible and there is a total absence of peripheral noise. There are typically commercial aircraft flying overhead at various times of night, almost always headed west to east, probably from Flagstaff to Gallup or Albuquerque. At 8:56 PM, I glanced my mp3 player to check the time in order to begin calculating our run time when I glanced to the big dipper before noticing a moving object out of the top of my eye. I was orientated east by northeast and the object seemed headed east. It looked like a slightly brighter than normal star, white in color moving at a reasonably fast rate of speed in a straight line. I motioned to my wife and she was able to pick up the object quickly. She noted later that there was no noise emanating from the object (I had my headphones on). We followed the object as it continued east when all of a sudden, the light vanished. We scanned the area it was in for another minute before beginning our run. We spoke about it after we returned home, still unsure about what it was that we had just seen."],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-109.542049","Country":"United States","Region":"Arizona","City":"Ganado","Weather Factors":"None","Object Shape":"Star-like","trends":["There has been one other sighting in Ganado","There were no other sightings in Ganado on or around March 16th 2009"],"Sighting Duration":"00:01:00","Tags":"City","files":["/var/www/straped/mufon/html2text/16104.html.txt","/var/www/straped/mufon/org/16104.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.711402,+-109.542049(16104)&iwloc=A&hl=en\"> mufon case (16104) map </A>","Latitude":"35.711402","Case Number":"16104","Date of the Event":"03/16/2009 08:56 UTC","Summary":"Unblinking light headed due east for 1 min before disappearing.","Date Submitted":"03/16/2009 08:56 UTC","Disposition":"Unknown","Source":"MUFON","Object Features":"Unknown","Log Number":"US-03192009-0002"}