{"Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Missouri","divs":["Sighting DetailsSometime during the late evening hours, around 10:00 pm., myself and another officer was standing on the prison yard at the Farmington Correctional Center, when I notice a large object about the size of a large jet liner just appear out of no where. At that time I ask my fellow officer. What the hell was that? He said, I don't know! In the blink of the eye it was gone. The craft made no noise and the best I can remember it was aluminium in color, glowing pulsing lights and was'nt in a motion, just hovering. The craft was appox. 500ft. from the ground and about a that distance from me.This craft was like a holowgram. It was there and then gone! Or it appeared that the time fram was only a few sec.. We both reported to the shift commander what we had seen and he laughed saying you both need a drug test. No one eles saw what we seen that night and the radio station was'nt reporting anything, so we kept our mouths shut about this. Maybe someone eles has had this happen to them, thats why I am reporting this."],"Latitude":"37.788865","Disposition":"Unknown","Case Number":"16100","Weather Factors":"Unknown","trends":["There have been 6 other sightings in Farmington","There were no other sightings in Farmington on or around May 15th 2003"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.788865,+-90.41936(16100)&iwloc=A&hl=en\"> mufon case (16100) map </A>","Longitude":"-90.41936","Tags":"City","Country":"United States","City":"Farmington","files":["/var/www/straped/mufon/html2text/16100.html.txt","/var/www/straped/mufon/org/16100.html"],"Object Flight Path":"Stationary","Log Number":"US-03182009-0020","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/15/2003 12:00 UTC","Object Shape":"Cigar, Disc","Date Submitted":"05/15/2003 12:00 UTC","Object Features":"None","Summary":"Myself and another officer were standing on the prison yard, when I noticed a large object.."}