{"Summary":"Picture of UFO from Simi Valley vantage point 3-17-09.","Date Submitted":"03/17/2009 09:30 UTC","Longitude":"-118.778932","Source":"MUFON","Case Number":"16103","Latitude":"34.271837","trends":["There have been 20 other sightings in Simi Valley","There were no other sightings in Simi Valley on or around March 17th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsThis is the story of the photos. I have been taking photos of the California sky from my patio for 2 years and a half now. I examine them at different zoom levels and discard them, because I had never found anything in them. March 17 2009 was an exceptionally clear and warm day after several cold days in a row,so I was enjoying the patio and the view of the mountains. I took my camera and started shooting. Later, I examined them. And I found the object that looks like a UFO with silvery metallic body that I include here. It was far away a and I did not see it while I was taking the picture. I am in the habit of not observing the sky, I examine the pictures. I discarded all other photos, around 16-20 of them.... What I did was zoom in with Microsoft Office Picture Manager and grab a screen capture when it was zoomed in with FastStone Capture. I keep for my records the big 10 MP digital file which is to big to send. It is worth mentioning that during a few minutes before, while and after I was taking the photos I saw a green helicopter fly above our home, though the actual object was far away over the mountains, far beyond Rocky Peak, I would say. It is not normal to see green helicopters flying by, though I can identify others that may be private, commercial or police flying by over us sometimes. I also so the same helicopter in the afternoon of March 17, and I took some pictures again. There were two objects in these but I could not say they are UFOS since they are blurry since by this time I had seen the morning pictures and was a little nervous about it. The zooms are 200x and 400x respectively."],"Object Shape":"Disc","Object Flight Path":"Stationary","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.271837,+-118.778932(16103)&iwloc=A&hl=en\"> mufon case (16103) map </A>","City":"Simi Valley","Sighting Duration":"Undisclosed","Date of the Event":"03/17/2009 09:30 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16103.html.txt","/var/www/straped/mufon/more/16103_submitter_file1__miOVNI200X.jpg","/var/www/straped/mufon/more/16103_submitter_file2__400X.jpg","/var/www/straped/mufon/org/16103.html"],"Weather Factors":"Unknown","Log Number":"US-03192009-0001","Object Features":"Dome","Region":"California","Country":"United States","Disposition":"IFO"}