{"Disposition":"Unknown","divs":["sighting details1st sighing - wednesday night, march 18th apprx 7pm 2009 my family and i were enjoying a bbq\\fish fry in my father-in-law's backyard. i noticed the fighter jet engine noise and looked to the sky. the first thing i noticed was 4 fighters with standard strobes flying in combat formation (lead plane forward, wingman to the right and slightly behind) there were two sets of two fighters trailing an enormous craft clustered of dozens of amber lights\\orbs. they were all traveling north to south at a consisant pace at first sight, then changed direction at about 280 degrees south to head north-west. traveling north-west, the craft and jets flew directly over our heads. 10 people were in the group, 7 people witnessed the event including myself. as the craft came dead straight above our heads, we could see clearly that it was a huge vehicle. at that time, it appeared to have a main body of amber lights and a \"hull\" and one wing outstretched to about 300+feet. what was odd, was that we could all make out the triagle\\boomerage shape because of the stars being blocked out as it passed them and by the small, very faint reddish glow or light at the tip of the \"wing\". the fighters jets kept pace and followed, maintaining the same distance througout. 2nd sighting - 30 minutes after the first sighting, the craft flew over again, this time the fighters were scrabbled and not in any noticable formation. the object itself was silent. that time, only my wife and i witnessed it while we were leaving to drive home. this was so impressive and the second pass inspired me to get home and get the video camera. when we arrived at our house a few minutes later, i could see it circling back around and coming our direction. i grabbed my binolulars and my wife and i faced south to watch it come back overhead. 3rd sighting - this time, with my binos, i saw the object perfectly. as i write this, my adrenalin surges a little and i get chills. at 10,000+ feet, this dark craft barely fit into view through the eye peices. i have 30 power binoculars to give some perspective. it definately blocked out the background stars and was boomerang shaped. its amber lights at the center of the body were the strangest part. i could not tell if they were on the outide of the craft or if that part of the craft was transparent. they seemed to be clustered in an oval shape but some were slightly larger than others indicating that i could see the closest ones and the furthest ones simultaneously. i could confirm that the wing tips had very miniscule lights on each end as well. this thrid pass, the fighters were trailing behind again. i got a sense of scale by that fact and was in awe. i handed the binos to my wife and she got a great look at it too. she has never seen anything like that and was speachless. the craft and fighters left our sight again and i took the time to run in the house and dig out the video camera. we sat outside for about 30 minutes and i saw the craft circling for a fourth pass. 4th sighting - i was able to get it on film! i am not sure about the quality, i have not had time to review it on a large tv yet but will this afternoon. of course lights in a dark sky could be anything but i am truly hoping the camera is sharp enough to show the darkened area of the craft when compared to the stars. that was one of the most impressive things i have ever witnessed!"],"Region":"Arizona","Log Number":"US-03192009-0012","Longitude":"-114.319135","City":"Lake Havasu City","Country":"United States","Latitude":"34.488631","Sighting Duration":"01:30:00","trends":["There have been 30 other sightings in Lake Havasu City","There was one other sighting in Lake Havasu City on or around March 18th 2009"],"Date Submitted":"03/18/2009 08:30 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/16114.html.txt","/var/www/straped/mufon/org/16114.html"],"Object Shape":"Boomerang, Triangle","Object Features":"Appendage(s), Wings","Date of the Event":"03/18/2009 08:30 UTC","Weather Factors":"None","Object Flight Path":"Path with directional change","Tags":"City","Case Number":"16114","map":"<A HREF = \"http://maps.google.com/maps?q=34.488631,+-114.319135(16114)&iwloc=A&hl=en\"> mufon case (16114) map </A>","Summary":"Boomerang or triangle craft, 300+ feet across spotted multiple times at apprx. 10,000+ ft. by multiple witnesses Wednesday night over Lake Havasu City/Needles, CA (video taken!)."}