{"map":"<A HREF = \"http://maps.google.com/maps?q=29.764803,+-95.36673(16112)&iwloc=A&hl=en\"> mufon case (16112) map </A>","Viewing Distance":"Unknown","Region":"Texas","Summary":"Circular silver object flashing red.","Weather Factors":"Unknown","Country":"United States","Latitude":"29.764803","Log Number":"US-03192009-0010","Object Shape":"Disc, Flash, Sphere, Star-like","divs":["Sighting DetailsOn February 4, 2009 I was in my backyard relaxing after work, listening to the radio and watching the skies as I often do. The sky was crystal clear with no clouds, fog, or haziness in the sky...absolutely beautiful blue sky! I frequently watch airline jets fly overhead, as my home seemingly is along incoming flight-paths to Bush Intercontinental Airport (I have always been a sky-watcher for as long as I remember). I went inside the house to get myself a glass of water and looked at the clock and saw the time was 5:58pm (the radio show that I listen to ends at 7pm, and I wanted to know how much longer until the end of the program). I walked back outside facing East and looked up to the sky at the moon, which was almost directly overhead. The sun was low in the sky behind me, but the sky was still blue with no stars visible yet. As I looked at the moon I spotted an object straight up directly over me. It was a chrome dot that was intermittently flashing red. My very first instinct was that it was a chrome mylar helium balloon like you get with a floral arrangement, spinning in the air above me (with one side chrome silver and the other side red). But I quickly realized that it was not a balloon because it was hovering completely stationary. Logically thinking that if the wind was causing a balloon to spin, then it would also be blowing it in motion and it would be moving. It was not moving at all...it was hovering completely still (other than possibly spinning)! I called my girlfriend over to show it to her, but she did not see it. It apparently was very high up in altitude so she couldn't get an eye on it, but I could not speculate as to how high it was. Then, as I was continuing to watch it, without taking my eyes off of it, it simply VANISHED before my eyes! It did not speed off, flicker or fade away, it just disappeared! This was not a jet aircraft, helicopter, bird, or a star! This was a solid metallic object that was clearly above my house motionless in the sky, that suddenly vanished! This sighting lasted approximately 2 minutes. I am still at a loss for exactly what it was that I saw, but I realized that it is VERY similar to video sightings from Mexico that I have seen on a television program about UFO's before."],"Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/16112.html.txt","/var/www/straped/mufon/org/16112.html"],"Longitude":"-95.36673","Case Number":"16112","Tags":"City","Date Submitted":"02/04/2009 05:58 UTC","Object Features":"None","Date of the Event":"02/04/2009 05:58 UTC","Disposition":"Unknown","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around February 4th 2009"],"Object Flight Path":"Stationary","City":"Houston","Source":"MUFON"}