{"Case Number":"16111","Tags":"City","Disposition":"Unknown","City":"Gallop N.M.","files":["/var/www/straped/mufon/html2text/16111.html.txt","/var/www/straped/mufon/org/16111.html"],"Longitude":"-108.237752","divs":["Sighting Detailssir or mam, again, much too long to sit in a library and type out. experience includes everything from first sight to actual road chases, foot chases, face to whatever contact to within mere inches while lucent(and angry).conversations with many law enforcement agencies, and by the way, while this event took place, i was an escapee from a prison-farm in alabama. so you can see that just by scratching the surface of this event there are facets too long in the telling to relate here. emotions and fear do not show as readily and i feel that the only way to the truth of this, is face to face with people who can maybe hypnotize or apply a serum which will loosen long buried details that i may not be able to recall alone. there are spans in my memory now where i don't know exactly why or how a thing happened but the body of the memory is good. it's been over 15 years and my reasons for delay are as many if not more than my reasons for telling. please do not dismiss this. i do not have any reason to tell you a fable which can be corroborated by a dozen witnesses, law enforcement, family members and oh yeah, the guy i haven't seen in the time since, who sat right beside me through the whole experience and if locatable would tell the exact same tale. it is surely as burned in his mind as mine. and he could better relate the story of the entity which sat in his car with us while we drove east only to leave in a flashbulb type burst of light through the windshield leaving it covered(inside and out) with some sort of waxy? goo. please, you can see i want to tell someone who may can aid me to understand(me and my friend) and remember details. this story will blow away everything that before has seemed so grand and awe inspiring."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.715247,+-108.237752(16111)&iwloc=A&hl=en\"> mufon case (16111) map </A>","Region":"Arizona","Source":"MUFON","Object Features":"Dome, Other, Unknown","Summary":"Way too big for that my friend.","Country":"United States","trends":["There have been no other sightings in Gallop N.M.","This sighting has never been favorited."],"Date Submitted":"03/31/1992 12:00 UTC","Weather Factors":"Unknown","Date of the Event":"03/31/1992 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-03192009-0009","Latitude":"35.715247","Viewing Distance":"20 Feet or Less, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Shape":"Bullet, Missile, Cigar, Disc, Flash, Oval, Sphere, Square, Rectagular, Star-like, Triangle, Other, Unknown"}