{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Case Number":"16116","Longitude":"-117.287766","Date of the Event":"09/07/2007 03:00 UTC","files":["/var/www/straped/mufon/html2text/16116.html.txt","/var/www/straped/mufon/more/16116_submitter_file1__100_2875.JPG","/var/www/straped/mufon/more/16116_submitter_file2__100_2877.JPG","/var/www/straped/mufon/more/16116_submitter_file3__100_2853.JPG","/var/www/straped/mufon/org/16116.html"],"Tags":"City","divs":["Sighting DetailsI know this event happened awhile ago but i have had these pictures and the sighting in my mind for a very long time now and i am dying for some one to review this. I was at a friend of mine's house around three o'clock in the morning hanging out in his drive way in Apple Valley california. We were talking about random things as we normally do that time of the morning when my friend went over behind his truck for a moment to urinate. When he came back he told me that he noticed a \"star\" moving in the distance we all converged at his truck and started to watch the object. Sure enough we all saw the image moving back and forth very rapidly and abruptly. Once we all agreed the object was moving he went inside and got his moms digital camera to photograph the object. We took multiple pictures from different angles and reference points like trees and other stars in the sky to try and validate the sighting. I even took a picture of the brightest star in the sky( other than the object in question ) and tried jerking the camera to mimic what we were seeing in the pictures... it barely appeared visible on the screen. The opject stayed in sight for about an hour moving bacj and forth in the sky as we talked in amazement for awhile and eventually got tired and all went our seperate ways. Since that day i have had the pictures dying to get a second opinion on what they were..."],"Object Features":"None","City":"Victorville","Weather Factors":"Unknown","Summary":"I need answers for the pictures I have.","map":"<A HREF = \"http://maps.google.com/maps?q=34.545027,+-117.287766(16116)&iwloc=A&hl=en\"> mufon case (16116) map </A>","Date Submitted":"09/07/2007 03:00 UTC","Country":"United States","Source":"MUFON","trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around September 7th 2007","This sighting has never been favorited.",""],"Region":"California","Latitude":"34.545027","Object Flight Path":"Stationary,Other","Object Shape":"Fireball, Sphere, Star-like","Disposition":"IFO","Log Number":"US-03192009-0014"}