{"divs":["Sighting Detailsthe event happend like this. i was sleepy so i went to bed. about one hour later my father told my mother to come and get me because theres something in the sky. so i thanking like this was one of my fathers usual jokes hesitated but i got up and went out and said to my father this i hope this is not a joke. and it wasent it was exactly as my mother had told me. so me and my father and mother looked at it for about 20 minutes and durning that period my mother had called her sister to ask them if they had saw it so my mothers sister looked also along with her daughter and they had also saw it and they where in the next town. the object stayed in one area never moving except going around in circles. durning the sighting we where in awe thanking what is this because this has never appeared in a town like mine. it was an great sight to look upon. something that is unexplainble to me, so i wanted to report this being that is is something to remember and ponder upon. the object disappeared right before us into a clear sky with some clounds. i looked for signs of spot lights, marketing lights but there was none. the object just disappeared like the blink of an eye. never to reappear that night."],"Object Shape":"Circle, Disc","Summary":"UFO was disc filled with light.","Date Submitted":"03/19/2009 08:30 UTC","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","Sighting Duration":"Undisclosed","Latitude":"38.925067","Log Number":"US-03202009-0006","Date of the Event":"03/19/2009 08:30 UTC","Disposition":"Unknown","Case Number":"16126","Object Features":"Unknown","Country":"United States","Tags":"City","Source":"MUFON","Region":"Virginia","Longitude":"-78.188675","City":"Front Royal","trends":["There have been 7 other sightings in Front Royal","There were no other sightings in Front Royal on or around March 19th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.925067,+-78.188675(16126)&iwloc=A&hl=en\"> mufon case (16126) map </A>","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/16126.html.txt","/var/www/straped/mufon/org/16126.html"]}