{"Object Features":"None","files":["/var/www/straped/mufon/html2text/16124.html.txt","/var/www/straped/mufon/org/16124.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"04/07/2008 05:00 UTC","City":"Marseille","Longitude":"5.36978","Country":"France","Case Number":"16124","Object Flight Path":"Hovering then path","Source":"MUFON","Disposition":"Unresolved","Object Shape":"Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=43.296482,+5.36978(16124)&iwloc=A&hl=en\"> mufon case (16124) map </A>","trends":["There has been one other sighting in Marseille","There were no other sightings in Marseille on or around April 7th 2008"],"Region":"Provence-Alpes-Côte d'Azur","Date Submitted":"04/07/2008 05:00 UTC","Log Number":"FR-03202009-0004","Tags":"City","divs":["Sighting DetailsAt 16:10 on Monday the 7th of April 2008 I left Paris Charles De Gaul airport bound for Tunis. My flight number was AF 2384. (Air France) The aircraft was an Airbus A320 and was travelling at an approximate altitude of 35,000 Feet. Between 17:00 hours and 17:30 hours I was looking out of the window on the left side. I noticed in the distance above the cloud cover and slightly higher than the flight a large oblong shape in the distance. It had a greyish coppery colour. I watched the object for some time thinking to my self 'Could this be my first UFO sighting?' The object was sitting still in the sky. It looked solid. Not clouds or anything explainable. As I was watching it I noticed to the right coming through the cloud base a small dark shape that looked like a fighter jet travelling in the opposite direction from my flight. It was small but I could just about make out the shape of the tail and nose. Behind the jet was it's slipstream, dark in colour. I watched the jet fly up over the cloud cover heading towards the object I was watching. The jet then turned right and then ascended getting closer to the object. Then I saw the jet do a zig zag motion towards the object. (I'd estimate the object as being at least 20 times bigger than the jet.) I could tell the zig zag motion by watching it's slip stream. As it got closer I noticed the object (UFO) get small very quickly then it disappeared moving away from my flight and the jet. About 15 minutes later I saw the fighter jet descend back down through the clouds. Obviously going back to base. I'm not sure exactly what country we were flying over at the time but I think it was southern France I am sure this was a UFO. I can't explain what else it would be. And I don't think a fighter jet would be chasing nothing. If there were any other passengers onboard who saw this too I don't know. But I am confident in saying this was my first UFO sighting. And I hope to see more....... A bit unfortunate I didn't have my camera with me!!"],"Weather Factors":"Unknown","Latitude":"43.296482","Summary":"Saw a UFO getting chased by a fighter jet!"}