{"Case Number":"16128","Summary":"Orange orb, changes colors from red to green to white to orange. stationary, hovering, blinking.","map":"<A HREF = \"http://maps.google.com/maps?q=38.050024,+-84.494526(16128)&iwloc=A&hl=en\"> mufon case (16128) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Region":"Kentucky","Object Features":"Other","Source":"MUFON","Date of the Event":"03/19/2009 10:08 UTC","Weather Factors":"None","Log Number":"US-03202009-0008","Latitude":"38.050024","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","files":["/var/www/straped/mufon/html2text/16128.html.txt","/var/www/straped/mufon/org/16128.html"],"divs":["Sighting DetailsI arrived home from work at 10:08p to get my cell phone. i had recently reported a sighting to your organization a couple of weeks ago from january so i've been looking to the skies alot more lately. anyway, i pulled into the driveway and saw the object in a NE position about 2 miles or less away, i am not quite sure the exact altitude. i noticed it was blinking and the colors were changing, so i ran inside and got my phone to take a pic. you can't see it on the phone, but i got my binoculars out to have a better look. the object was clearly changing colors and rapidly changing shape. i was so scared but i had somewhere to go and i brought mt binoculars with me. as i drove south on US-25 toward lisle rd. (where my first sighting took place) i notice that i was coming closer to it. as i turned down lisle rd. you can see a pretty big open field to the left and just above the field hovering over the trailer park was the UFO! about 1,000-1,500 ft. up about this time. i pulled over and got my binoculars out again and it exibited the same properties as before, just hovering stationary not moving. i had to rush to meet my cousin for the money she owed me. she lives just across the street in the adjacent trailer park. when i got to her house the treeline shielded the UFO from my sight and i couldn't see it. i ran in and ran out as quickly as i could try and track this UFO's flight pattern. i would've chased it all night! when I got back to the intersection of US-25 and Lisle Rd. i looked to my right at the field where i had seen it before and it was gone! i am not crazy, i do obsess about this, i don't drink or use drugs and i am not on any psych meds. this thing was there and just as quickly, gone. something is going on in this area and i want to know what. these things are disguising themselves as stars so that we don't pay anyattention to them. you cannot drive closer to a star and around it when you make left turns just less than 2 miles away from the initial point of sight. stars don't change shape and color before your eyes stuff like that takes tens of thousands or millions of years to do."],"City":"Lexington","Object Flight Path":"Stationary,Other","Country":"United States","Disposition":"Unknown","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around March 19th 2009"],"Date Submitted":"03/19/2009 10:08 UTC","Longitude":"-84.494526","Tags":"City"}