{"City":"Burlington","Disposition":"IFO","Tags":"City","Summary":"Distinct circle of yellow light moving fast towards ground like crashing plane - followed by strange police presence.","Region":"Vermont","files":["/var/www/straped/mufon/html2text/16121.html.txt","/var/www/straped/mufon/org/16121.html"],"trends":["There have been 13 other sightings in Burlington","There were no other sightings in Burlington on or around March 19th 2009"],"Country":"United States","Date Submitted":"03/19/2009 08:50 UTC","Case Number":"16121","Source":"MUFON","Date of the Event":"03/19/2009 08:50 UTC","divs":["Sighting DetailsTime is roughly 8:50pm. Location, So Burlington, Vermont. I was on I-89 North between the South Burlington and first Winooski Exit. Out of the top corner of my eye i picked up a dark yellowish round source of light moving in an extremely fast trajectory towards the ground. There is very little light on the highway so you can see the sky quite clearly against the dark background. I was heading North, having just passed the airport within 2 miles to my right. At first my instinct said plane crashing into the ground with great speed but for the life of me i could not see any explosion or impact. I was literally leaning over my steering wheel eyes wide open waiting for a huge explosion. Next thought was shooting start but this wasn't a line of light, it was a distinct ball or deep yellow that moved rapidly into the horizon from a 45*ish angle from the top right of my view to the bottom center and then gone. I was so thrown by this that i pulled off after the exit and looked up into the sky for a minute, but had trouble seeing because of the streetlights. A mile from this spot moving east was about a dozen police cars pulled off the road into a field with all lights off. They were from various local towns, and i could not see anyone walking around. This is a very clear area with little light so it is a good location to see the skies around you. I honestly couldn't understand what so many police were doing this late at night at such an awkward location having driven up off the asphalt onto the grass of the field to make room for all the squad cars. The other thing that really confused me was that there wasn't a single light on any of the cars, nor on inside the cars. I drive this route home almost every night at the same time and have never seen any cars off the side of the road in this fashion. There is a Military base roughly 1 mile from where the squad cars were piled together if it is of any added connection. As i passed this base another Essex Police car came by me with flashing blue lights on the opposite side of the road, seeming to slow and turn off lights in the vacinity of the other police cars. I have never reported anything like this before in my life, but have never felt so bewildered by an event such as what i witnessed tonight. I hope my documentation is of use to anyone else in the area that shared an experience tonight."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.477812,+-73.204022(16121)&iwloc=A&hl=en\"> mufon case (16121) map </A>","Latitude":"44.477812","Object Features":"Undisclosed","Object Shape":"Circle","Longitude":"-73.204022","Object Flight Path":"Undisclosed","Sighting Duration":"00:00:05","Viewing Distance":"Unknown","Log Number":"US-03202009-0001"}