{"City":"Rosarito","Tags":"City","Summary":"During chemtrail activity, an area of the sky suddenly began refracting light like a prisim; then exploded into bright-white light in the shape of a hand.","Date Submitted":"02/02/2009 03:30 UTC","Sighting Duration":"Undisclosed","Date of the Event":"02/02/2009 03:30 UTC","Latitude":"32.358791","Longitude":"-117.048203","Log Number":"MX-03202009-0016","files":["/var/www/straped/mufon/html2text/16137.html.txt","/var/www/straped/mufon/org/16137.html"],"Viewing Distance":"Over One Mile","Region":"Baja California","Case Number":"16137","Object Shape":"Flash, Other, Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.358791,+-117.048203(16137)&iwloc=A&hl=en\"> mufon case (16137) map </A>","Object Features":"Dome","Country":"Mexico","divs":["Sighting DetailsI am an attorney and have been practicing law in San Diego since 1981. I own an ocean-front condominium located aproximately four miles south of Rosarito Beach, Baja, Mexico, at Calafia, KM 34.5 (approximately 20 miles south of San Diego). (See calafiacondos.com for detailed information concerning the location.) On February 4, 2009, my girlfriend, Roberta, and I drove from downtown San Diego to my condo at Calafia. We left San Diego at approximately 3:00 p.m. As we were driving south from San Diego, beginning almost immediately after leaving downtown, both of us repeatedly commented on the strange clouds in the sky that had been produced by chemtrail activity that had taken place the previous 24-36 hours. The strange cloud formations continued to be present for the entire trip to Calafia. We got to my condo at approximately 4:00 p.m. and didn't think any more about the strange cloud formations until the next day. At approximately 3:00 p.m., Roberta and I went for a walk on the beach and around the grounds and swimming pool. This was Roberta's first trip down to the beach and swimming pool area. We took her Kodak Z812 IS point and shoot digital camera (several photos of what we saw are included in the attached zip file: \"Hand of God.\") After spending some time on the beach, we climbed up the stairs from the beach and began walking south along the cliffs (which are approximately 20-25 feet above the water level) to the swimming pool. As we were walking, Roberta said: \"Hey look, there's a prisim without a rainbow.\" I looked up and saw the patch of sky depicted in the center of photo 100_3748 (\"48\")in the attached zip file. In order to better orient the location of the patch of sky where the light was being refracted, I widened the shot to place the sun at the center of photo 100_3749 (\"49\"). Earlier in the day (evidently approximately 6 and a half hours earlier), I changed the batery in the camera. Athough I set the correct date of February 5, 2009, I didn't set the correct time. The information summary from the \"properties\" on these photos indicates that photos 48 and 49 were both taken at 6:37. After I took photos 48 and 49, Roberta and I turned our attention elseware. However, approximately three minutes later I looked back to the prisim in the sky and saw what is depicted in photos 54, 55, 57 and 58, all of which the info summary indictes were taken at 6:40. By 6:43, all that was left is what is depicted in photo 61. I have the complete series of photos (20 or so from the beach and 20 or so after the \"Hand of God\", all of which were taken at 3264 x 2448 (approximately 8 Mega-pixels). I've played around with various filters and such. Although I'm not an expert, I think there's alot more info in these pictures than meets the eye. Also, on March 2, 2009, after a couple days of heavey chemtrail activity, I took 172 photos of some real strange stuff, including some pretty clear photos of a \"flying saucer.\" (see, the photos attached in the zip file \"Flyng Saucer.\" Especially photos 100_4218 through 100_4221.) Again, I've got the originals, all of which are 3264 x 2448. I think that most of these photos also contain alot more info than meets the eye. I would love to meet with you to show the originals and discuss this incident. Feel free to give me a call. I'm usually at my home, where I can be reached at 970-372-0955. Or, try my office in San Diego at 619-53-0111. Thanks for your time in reviewing this material. Rick Bove rickbove@gmail.com rbove@pacbell.net"],"Disposition":"Unresolved","Object Flight Path":"Path then hovering,Other","trends":["There have been 2 other sightings in Rosarito","There were no other sightings in Rosarito on or around February 2nd 2009","This sighting has never been favorited.",""],"Source":"MUFON"}