{"Region":"Indiana","Date Submitted":"03/19/2009 09:00 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/16133.html.txt","/var/www/straped/mufon/org/16133.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Loogootee","trends":["There has been one other sighting in Loogootee","There were no other sightings in Loogootee on or around March 19th 2009"],"Disposition":"Unknown","Longitude":"-86.9131","Case Number":"16133","Log Number":"US-03202009-0013","Date of the Event":"03/19/2009 09:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.683794,+-86.9131(16133)&iwloc=A&hl=en\"> mufon case (16133) map </A>","Sighting Duration":"Undisclosed","Summary":"V shaped , dimly lit, very fast, no noise.","Object Shape":"Boomerang","Source":"MUFON","Tags":"City","Latitude":"38.683794","divs":["Sighting Details Approximately 9 pm, Thursday. Very clear evening. My wife & I sitting in a hot tub. My son had just left and commented that he saw the big dipper. We were discussing how he changed subjects in the middle of a sentence. I looked up and saw what I thought was a gaggle of geese coming towards us. I called my wife's attention and pointed. She thought they were geese also. The UFO was flying very fast and straight heading in a northeast direction. It just flew straight. No up, down or side to side. Much faster than jets that we have viewed before. It basically flew above our heads and vanished. It all happened very quickly. The best I can recall is that it was a v formation of about 7-10 pale orange or yellow triangular shaped lights. If they were seperate \"aircrafts\" they were flying in perfect formation. Absolutely no noise or sonic boom. We discussed the possiblity of a stealth fighter or flying wing, but this thing was faster than any aircraft I have witnessed. It didn't appear to be that high up in the sky, but that is difficult for me to judge. Absolutely no alcohol or drugs involved. I did not feel threatened or anything. It just kind of freaked us out and I feel I have to contact someone who wouldn't be as skeptical about a UFO sighting like I think the local police or sherriff would be. Thanks."]}