{"Tags":"City","Country":"United States","Region":"Virginia","Object Shape":"Triangle","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.302096,+-78.39194(16139)&iwloc=A&hl=en\"> mufon case (16139) map </A>","City":"Farmville","divs":["Sighting DetailsMy cousin and i go and set in different locations to look for strange lights and ghostly happenings - we were sitting at a pull off on a lonely stretch of road in the dark and we saw the outline of my truck on the trees about 50 ft. from us - we looked to try and find where the light was coming from and we looked throught the windshield and saw a HUGE triangle shaped object barely moving , just above the tree tops , no sound at all - the object got over the cut over in front of us and shot a bright light down front the front and lit the rear up like it was looking for something. after several seconds it cut the light off or retracted it and just kept moving slowly out of sight. i told a law offical a few days later and he said i wasn't crazy as that they had a report of the same thing i saw but it a long ways from where we saw it. i have had a sighting of this object 2 or 3 times- one time i blinked a light at this light i saw and it did a 180 turn and came ove us and it was the same triangle with a light on each corner. we still go and look for lights and objects when we get a chance - also have heard humming like an electronic signature so i know it is something not of this world . alot of strange things are going on in the area and i allways have a witness with me . strange lights zig zaging and going out . i try to investigate as much as possible as i believe in aliens and U F O\"S"],"Log Number":"US-03202009-0018","Latitude":"37.302096","Weather Factors":"None","Date Submitted":"02/26/2006 10:30 UTC","Case Number":"16139","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Farmville","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/16139.html.txt","/var/www/straped/mufon/org/16139.html"],"Date of the Event":"02/26/2006 10:30 UTC","Sighting Duration":"Undisclosed","Longitude":"-78.39194","Summary":"Saw a huge triangle shaped object.","Disposition":"Unknown"}