{"Latitude":"27.671377","Object Flight Path":"Straight-line path","Disposition":"IFO","divs":["Sighting DetailsGood morning! I would like to see if you could clarify something for me. Last night my husband and I were out driving south on A1A in Ponte Vedra Beach, FL through the Guana Preserve, around 10:50PM and we saw what seemed to be a reddish orange ball with a tail traveling through the sky parallel to the trees, appearing to be traveling north. Then the tail was gone and it seemed to kind of hover then move in an arc and was gone. At first we were thinking WTF was that, then after stopping at the beach to star gaze, grabbed our iPhone's and saw that there was the launch of the Kepler Delta II rocket last night right around the same time window. So after we got home we found some videos of the launch and it did look similar, except that we could not see the rockets disengaging like you can on the video. I saw on your website there's two reports of UFO sightings around the same time last night describing a fireball object that then lost it's tail, hovered and was gone. This was the Kepler right? In the spirit of truth that being said you may want to remove those posts as a UFO sighting to be fair. Not that I don't believe in UFO's, I saw one as a teenager a long time ago, but never have since. I admit I was hopeful I may have saw one again, but it just seems obvious to me that it was Kepler. Thanks and have a good day!"],"Object Features":"Undisclosed","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/16140.html.txt","/var/www/straped/mufon/org/16140.html"],"Region":"Florida","Date Submitted":"03/06/2009 10:50 UTC","Longitude":"-81.506884","Object Shape":"Fireball","Summary":"Kepler or UFO?","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","trends":[],"Date of the Event":"03/06/2009 10:50 UTC","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"16140","Log Number":"US-03202009-0019","map":"<A HREF = \"http://maps.google.com/maps?q=27.671377,+-81.506884(16140)&iwloc=A&hl=en\"> mufon case (16140) map </A>","Country":"United States"}