{"Object Shape":"Flash, Unknown","Latitude":"41.502205","Object Flight Path":"Undisclosed","Summary":"Very bright strobes, not landing lights or marker lights.","Tags":"City","Date of the Event":"03/20/2009 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.502205,+-81.692729(16149)&iwloc=A&hl=en\"> mufon case (16149) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"16149","trends":["There have been 47 other sightings in Cleveland","There were no other sightings in Cleveland on or around March 20th 2009"],"Weather Factors":"Unknown","City":"Cleveland","Disposition":"Insufficient Data","Date Submitted":"03/20/2009 06:30 UTC","Sighting Duration":"Undisclosed","Longitude":"-81.692729","divs":["Sighting DetailsWhile driving to work at about 6:30 am, I noticed an odd strobing object in the sky over the west side of Cleveland, Ohio. I was heading westbound on hwy 480 and the object was traveling roughly east to west. What caught my eye was the bright strobes. I couldn't tell what shape the object was, as the strobes were too bright and the object was several miles away ahead of me. It appeared to be several thousand feet above ground. The odd thing about the object, besides the extremely bright strobes, was that I could see no red or green marker lights that are on all military and civilian aircraft, nor the small strobes that are always present on conventional aircraft. The strobes on this craft appeared to be the size of the anti-collision lights or the landing lights, and were strobing in primarily white lights with occasional blue ones. I can not over-emphasise the brightness of the strobes, they were quite a bit brighter than landing lights and that was what caught my eye. Having been in the air wing in the Marine Corps, I am familiar with the configuration of aircraft lights, and this did not fit the conventional orientation. The other odd thing was that this object flew over or very near to Hopkins Airport, not a common thing for a conventional aircraft to do as it could possibly interfere with air traffic control. Perhaps there is a mundane explanation for this, but I am at a loss to explain it. The object continued westerly and I lost sight of it as I made my way toward downtown Cleveland."],"Region":"Ohio","Country":"United States","Log Number":"US-03212009-0007","files":["/var/www/straped/mufon/html2text/16149.html.txt","/var/www/straped/mufon/org/16149.html"],"Object Features":"Undisclosed"}