{"Date Submitted":"03/20/2009 11:40 UTC","divs":["sighting detailsi went out to walk the dog...coming back towards the house i looked up and saw two very bright ring shaped objects. the reason it caught my attention so closely is that it is a very overcast night - not a star to be seen in the sky. i was immediately amazed as i have never seen anything like this before. i started yelling for my boyfriend to come out. he came out and saw what i was seeing and told me to go in for the camera\\video camera. i ran in and got both....trying to take footage and capture pics at the same time. got maybe 2 minutes of video footage and nothing showed up on there - which i could tell right away because i could see nothing through the view finder. i took 2 pictures from the digital camera. we watched the objects literally dancing throught the sky. at one point one of the objects dropped down below the tree line from view and then bounded back up towards the other object. the objects were very bright in color...at some points bright white, blue and turning red. unbelievable! the pictures do not do what we saw any justice at all. we blew them up as much as we could and still it did not accurately show what we saw..but i am glad we have something to show for it."],"Latitude":"32.718199","Summary":"Circular - bright lights - moving all over the sky - looked like rings dancing in the sky.","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around March 20th 2009","This sighting has never been favorited.",""],"Region":"California","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"16145","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=32.718199,+-117.147275(16145)&iwloc=A&hl=en\"> mufon case (16145) map </A>","City":"San Diego","Tags":"City","Object Shape":"Circle","Date of the Event":"03/20/2009 11:40 UTC","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Log Number":"US-03212009-0003","Object Flight Path":"Undisclosed","Longitude":"-117.147275","files":["/var/www/straped/mufon/html2text/16145.html.txt","/var/www/straped/mufon/more/16145_submitter_file1__March2009013.JPG","/var/www/straped/mufon/more/16145_submitter_file2__March2009014.JPG","/var/www/straped/mufon/org/16145.html"]}