{"Weather Factors":"None","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Country":"United States","Latitude":"48.761873","Object Shape":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16152.html.txt","/var/www/straped/mufon/more/16152_submitter_file1__location.jpg","/var/www/straped/mufon/org/16152.html"],"City":"Bellingham","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around December 16th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=48.761873,+-122.481925(16152)&iwloc=A&hl=en\"> mufon case (16152) map </A>","Date Submitted":"12/16/2008 12:00 UTC","Date of the Event":"12/16/2008 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"16152","Summary":"House illuminated by downward light , no sound.","Log Number":"US-03212009-0010","Disposition":"Insufficient Data","Region":"Washington","Tags":"City","divs":["Sighting DetailsIn December 2008 Myself, wife and two children were sitting in our up-stairs living room watching t.v. Christmas lights on, and snow on the ground. My wife, son, and myself noticed a light illuminating the room and windows. We have six large windows and sliding glass door, My wife looked outside to see if a car was turning around or pulling into our street. but no car or people or even flashlights were present. Then about 15-20 seconds it was gone. I asked her if she noticed something strange about the light, she agreed but couldn't explain. I noticed that the light was lighting up the window sill on the BOTTOM of the window so the light came from straight up. My daughter was on the computer and did not see anything. We have had Medflight helos fly over, and civilian airplanes too, but all with sounds, we can hear them quite well, being our house is older and not very sound-proof. The next morning I went down-stairs where my mother lives(she is diabled with M.S. and lives with us). I sked her first if she noticed anything last night and left it at that. She then told me that she noticed a strange light around 8:30pm. She also thought it was possibly a car but did not see one. Then I proceeded to tell our story of the light and how it came from above the house. The light did not move like landing lights or spotlight would on a moving aircraft. My son said that he witnessed the same kind of event in the summer, just after dark. He said it was as if we had a spotlight right above our trees in the back yard pointing down.(Our trees are approx 80-100ft high) He said at the time he couln't understand, because our lights dont shine that high and it came from up high and lit up the backyard and lasted about 20 seconds also without any sound even with the windows open. We live in a quiet neighborhood and no neighbors saw anything. My wife noticed the same thing around March 14th 2009 but not sure."],"Source":"MUFON","Longitude":"-122.481925"}