{"Sighting Duration":"Undisclosed","Date Submitted":"03/20/2009 10:09 UTC","Country":"United States","Region":"Texas","Log Number":"US-03212009-0011","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Circle, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=30.275243,+-97.740961(16153)&iwloc=A&hl=en\"> mufon case (16153) map </A>","Disposition":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","City":"Austin","Summary":"Circle of purple lights with blue lights underneath.","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around March 20th 2009","This sighting has never been favorited.",""],"Case Number":"16153","Latitude":"30.275243","Viewing Distance":"Unknown","Longitude":"-97.740961","divs":["Sighting DetailsMyself and my friend were driving down South Mopac from 1826 when my friend pointed out the object as he was driving. I saw a circle of purple lights hovering, bobbing, and doing a sort of spin to our left, flying away from us. I did not want to stop and investigate, being in a moderately secluded area; roughly two minutes later, we turned around to investigate further, me picking up my courage, and there was no trace of it anywhere in the sky. Its physical features were a circular, possibly disc-like, with a ring of purple lights around it; as it bobbed, I saw its underside, with four very bright blue lights underneath it. We did not get any pictures, as I was initially too shocked to want to stop, and I assumed we only had our cell phones. I have included a very rough drawing of it; please excuse it if it isn't any help; I am not artistically gifted in any definition of the term."],"files":["/var/www/straped/mufon/html2text/16153.html.txt","/var/www/straped/mufon/more/16153_submitter_file1__ALIEN.jpg","/var/www/straped/mufon/more/16153_submitter_file1__ALIEN.jpg.1","/var/www/straped/mufon/org/16153.html"],"Object Features":"Undisclosed","Date of the Event":"03/20/2009 10:09 UTC"}