{"Date Submitted":"02/20/2009 09:15 UTC","Object Shape":"Square, Rectagular, Other","divs":["Sighting Detailsi guess the only reason i could see it, was because it \"reflected\" light, as the reflection quickly ran over its 'body' I could clearly make out some of the outer linings, I don't drink, wasn't high, and consider myself a smart person. it happened like this; I went in my back garden to take a piss and as i looked up to the stars -like I ALWAYS do- i was stunned, about 50 to 60 meters high, i could CLEARLY make out this 'ship', it looked like an upside-down boat but much more square, didn't look aero-dynamic at all, moved real slow, and as that bronze-like reflection went over it, then i was sure that either i lost my mind or i saw for the first time ever something out of this world. I checked if it couldn't have been a weather-balloon, but it was way to big.. to this day my mind still does not believe what my eyes saw. i thought it looked like a ship and to be honest the first thing that came to my mind was that it \"renewed it's \"shield\"\" almost stealth-like.I know it sounds real dumb, but that was my first thaught 4. it floated over, no noise i think, it was heading away from me, look the sky was dark and i only saw it when it reflected light, but i had the impression that the light ran over a big part of this vessel. 5.I was in awe, just stood there, I didn't even want to blink, I went back inside shaking, nervous, regret that i couldn't back it up. I calmed down for about 45minutes, maybe less, then i told my girlfriend, but she's too rational to be open for other life.. to this day i blaim a space-partical hitting my eye and causing this-as they do every second- this way I have an explanation"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.04654,+3.94683(16160)&iwloc=A&hl=en\"> mufon case (16160) map </A>","Disposition":"Unresolved","Object Flight Path":"Straight-line path,Unknown","Latitude":"51.04654","Weather Factors":"None","Case Number":"16160","Sighting Duration":"00:00:02","Date of the Event":"02/20/2009 09:15 UTC","trends":["There have been no other sightings in Overmere","This sighting has never been favorited."],"Log Number":"BE-03212009-0018","Summary":"Not typical.","Region":"Flemish Region","Longitude":"3.94683","Tags":"City","City":"Overmere","Object Features":"Other","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/16160.html.txt","/var/www/straped/mufon/org/16160.html"],"Source":"MUFON","Country":"Belgium"}