{"Object Flight Path":"Straight-line path","City":"London","Weather Factors":"Unknown","Date of the Event":"03/21/2009 11:59 UTC","Disposition":"Unresolved","Country":"United Kingdom","Summary":"Bright amber sphere, silent.","Log Number":"GB-03212009-0019","map":"<A HREF = \"http://maps.google.com/maps?q=51.514549,+-0.120975(16161)&iwloc=A&hl=en\"> mufon case (16161) map </A>","Tags":"City","Latitude":"51.514549","Viewing Distance":"Unknown","divs":["Sighting DetailsI am reporting from the uk. I live in surrey, which is under the flight path of heathrow airport, one of the busiest airports in the world. I also frequently see hellicopters flying to and fro from ascot race course, which is a famouse horse racing venue. I include this to varify that i know what an aeroplane looks like, and i know what a helicopter looks like, both in daylight and at night time. What i witnessed truely baffels my mind, i cannot, after much consideration, come up with a plausible explanation. I was standing at egham train station, at 11 59, on the 21st of March 2009, waiting for a train which was late (what else). In england we have street lights which are amber. I say this just to give some background. I happened to notice an amber light, which looked just like a street light, pass overhead. I observed this light maintained a straight course overhead, and noticed that it made no sound whatsoever. I continued to watch this light, which travelled on a straight course for no more than 20 seconds. Which was enough time for it to get so far away that it became impossible to see. As it got further away, the amber light turned red. I put this down to the way light appears as it travels away, but am not sure what this phenonoma is called. I know estimating the distance of a light source is subjective at best, i would say that this object was at a height of no moore than 1000 feet, i would contend that it was even lower than that. This object was in the form of a globe of light, but this is difficult to determine because of my viewing perspective which was directly underneath. I have never, In all my thirty six years on this earth, seen anything like this. No photo's, sorry."],"Case Number":"16161","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around March 21st 2009"],"Date Submitted":"03/21/2009 11:59 UTC","files":["/var/www/straped/mufon/html2text/16161.html.txt","/var/www/straped/mufon/org/16161.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Sphere","Object Features":"None","Longitude":"-0.120975","Region":"England"}