{"Region":"Nova Scotia","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16167.html.txt","/var/www/straped/mufon/org/16167.html"],"Viewing Distance":"Over One Mile","Country":"Canada","Log Number":"CA-03222009-0005","Object Flight Path":"Path with directional change","City":"Halifax","Sighting Duration":"00:25:00","Date Submitted":"03/12/2009 07:00 UTC","Case Number":"16167","Tags":"City","trends":["There have been 22 other sightings in Halifax","There were no other sightings in Halifax on or around March 12th 2009"],"Disposition":"Unresolved","Date of the Event":"03/12/2009 07:00 UTC","Object Features":"Unknown","Latitude":"44.653601","Summary":"Having a smoke on my balcony at 7am looking to the west were 7 or 8 very bright lights (about star size) moving left right up down, high speed.","Weather Factors":"Unknown","Longitude":"-63.566072","Object Shape":"Star-like, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.653601,+-63.566072(16167)&iwloc=A&hl=en\"> mufon case (16167) map </A>","divs":["Sighting DetailsUpon waking up on the morning of March 12, 2009, I went out on my balcony to have a cigarette. I live in Darmouth Nova Scotia and I always look to the west, appreciating the beauty of Halifax Harbour in the morning. The sun was rising and the sky in the east was a light blue and the sky in the west was a darker blue. Minimal clouds, I do not recall any wind either. When I noticed 7 or 8 lights in the west well above the horizon. They simply looked like stars, but it was too light out and I did not see any other stars in the sky. The lights formed absolutley no pattern or shape but they would move at mind boggling speeds left and right up and down. Sometimes they would kind of fade out then show up again very bright. I did not count more than 8 but there could have been more. I stood on my balcony in awe watching these things for a bout 1 minute before I realized I have to tell my girlfriend before she leaves for work. When she came out to look, literally a few seconds after I called to her, there was a patch of clouds moving in from the right moving left and they blocked the view, she had to catch the bus so she never witnessed them. I wanted to just stay on my balcony all day and watch these things, but I had to get ready for work. After my shower I came outside again and they were still there. The cloud cover was well gone by now and I could see them just as plain as I had almost 20 minutes ago. And that's all. I have made a call environment Canada but they forwarded me to an astonomy dept. at a local university, but I have had no response yet. I wlil keep you informed of any updates. Jason Muise"]}