{"files":["/var/www/straped/mufon/html2text/16166.html.txt","/var/www/straped/mufon/org/16166.html"],"Sighting Duration":"Undisclosed","Object Features":"Unknown","divs":["Sighting DetailsWe were at the Taylor fireworks, last yr 2008 When I just got the urge to look up being a paranormal investigator when I get the urge to do something I do it. Well I looked up to my right slightly behind me and I noticed two lights floating up in the sky pretty high up. At frist I thought nothing of it but couldent seem to stop looking up, about 2 mins in I noticed they were not moving, thats when I told the people I was with to take a look up there and tell me what they think they saw. We all agreed these objects were not moving. about 10 mins later with us still watching one just dissapeared. Then the other light about 3 mins after that slowly faded away kinda like a light bulb does when its about to die, but the object was also moving up. Now that night when I arrived home my mother who was also at the fireworks but not anywhere near us started to say \" Did you see...\" I cut her off and said the two lights in the sky, we both froze she had also seen the lights and told me the same thing to the tee as to what I saw. Ive also asked a few co workers about this and they also seen the event, has anyone else seen or heard about this?"],"Tags":"City","Longitude":"-83.260201","Disposition":"Unknown","Latitude":"42.246642","Date Submitted":"07/20/2008 07:30 UTC","Region":"Michigan","Object Shape":"Circle, Star-like","City":"Taylor","Object Flight Path":"Hovering then path","Summary":"Seen something in the skys in Taylor.","Source":"MUFON","Case Number":"16166","Date of the Event":"07/20/2008 07:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.246642,+-83.260201(16166)&iwloc=A&hl=en\"> mufon case (16166) map </A>","Viewing Distance":"Over One Mile","Weather Factors":"None","Log Number":"US-03222009-0004","trends":["There have been 11 other sightings in Taylor","There were no other sightings in Taylor on or around July 20th 2008"]}