{"Date of the Event":"03/21/2009 04:35 UTC","Object Shape":"Star-like","City":"Greencastle","Country":"United States","Latitude":"39.6543","Summary":"Don't know if its a landing site sure looks this way?","divs":["Sighting DetailsSaturday March 21rst,at about 4:30 to 4:35 P.M. decided to try to retrieve golf balls that I knew I had sliced off into the field in question the balls had been there since last fall but are hard to find due to the fact our field in this county (are no till)after finding four golf balls and knowing there were more I ventured some where 110 feet further back into the field came across a 12 foot in diameter circle. I returned home grabbed my Sony handy cam and returned to the location of the circle photographed and and took video of the said circle I returned to the area around 5:00 P.M. after inspecting it to be sure I wasn't just seeing what I wanted to see or that it might be something explainable I returned home showed the photo's to my mother,she then proceeds to tell me she could swear she saw something strange in the sky to the north west of our home in the sky I can not on the other hand confirm this myself(in other word I did not see this object). After reviewing the photo's and video clips I called a close friend told him I had found something I wanted to get his opinion at about seven thirty we left my home headed to the site I waited to discus the situation with him until we arrived we took more video measured the area and took soil samples while taking video for evidence one sample within the circular pattern and one soil sample from just outside. The circular pattern was completely dry while outside of it was damp or moist this is visible in one of my photo's that I will attach to this report it looked as if someone lay a a round pattern on the ground and dried the inner part with a hair drier making a perfect dry pattern in the end. There is a pile of dead corn stalks and bean stalks inside the circle that seem to show evidence of a swirl pattern (not well defined but seems to be a slight swirl)to the outer part of the circle the story is different there's an inch or more of plant matter that has been moved in what looks to be an evident swirl pattern around said area,there is more but I'm out of room here,we returned on the 22nd with metal detector compass and a stud finder to test for anything abnormal we got nothing with the metal detector or compass the stud finder on the other hand acted strange which I did not expect and this means nothing to me it was just an idea and these items were all we had to investigate with. If there is anything that you may want to know further you are welcome to contact me though I do not want to be hounded by outside sources other than MUFON,and or MUFON investigators in short what I'm saying here is that I don't desire having government officials pulling into my drive way thinking their going to take my camera because I stumbled into something that I may have not been meant to see,so I'm opting the circle below to not have any other person other than a MUFON rep or investigator to have my contact info and would be glad to answer any questions just look at the pictures below and tell me is this normal?"],"Tags":"City","files":["/var/www/straped/mufon/html2text/16168.html.txt","/var/www/straped/mufon/more/16168_submitter_file1__DSC00404.JPG","/var/www/straped/mufon/more/16168_submitter_file2__DSC00399.JPG","/var/www/straped/mufon/more/16168_submitter_file3__DSC00409.JPG","/var/www/straped/mufon/more/16168_submitter_file4__INLandingSite1A.JPG","/var/www/straped/mufon/more/16168_submitter_file5__INLandingSite006.jpg","/var/www/straped/mufon/org/16168.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.6543,+-86.860492(16168)&iwloc=A&hl=en\"> mufon case (16168) map </A>","Viewing Distance":"Unknown","Log Number":"US-03222009-0006","Region":"Indiana","Source":"MUFON","Object Flight Path":"Stationary","Object Features":"Unknown","Weather Factors":"None","Disposition":"Unknown","Case Number":"16168","Sighting Duration":"Undisclosed","Date Submitted":"03/21/2009 04:35 UTC","trends":["There have been 4 other sightings in Greencastle","There were no other sightings in Greencastle on or around March 21st 2009","This sighting has never been favorited.",""],"Longitude":"-86.860492"}