{"Object Features":"Undisclosed","Date of the Event":"03/22/2009 04:29 UTC","Object Shape":"Flash, Sphere, Star-like","Sighting Duration":"Undisclosed","City":"Freeport","Summary":"Star like, very small, very far away, moving and sometimes still.","Object Flight Path":"Undisclosed","Date Submitted":"03/22/2009 04:29 UTC","divs":["Sighting DetailsIn this one event of the many I've had with these objects I was in my 2nd floor bathroom looking out and up expeting to see one as I do occasionaly see when it is a clear and sunny day I would first notice a flash and see it as a tiny round ball moving across the sky silvery and sometimes white. It is very difficult to see them and I would have to squint my eyes to look and track them again. I think the flash is the sun reflecting off of it or it does it on purpose to get me to see again. You would think it would be a regular party balloon at first but... I dont know of many balloons that stay in place in the sky with a strong gust of wind. As I said before this not my first encounter. My first was in mid-November (cant remember the date) 2005 it was a warm overcast day I was taking the family rabbit out to play outside the backyard just looking up at the swirling dark clouds when I was looking towards the north and I noticed a single engine plane going west then something behind it at first it just stood still as the plane kept moving and then slowly moved from north to south until it was almost over me it was maybe 200 feet above right under the clouds small flat 3 pink triangles looking smooth and or glowing pointing south, east and west with an orange circle in the middle fussy looking did not seem to have anything attaching the four objects probably because the craft was cloacked but I did see what looked like heat or exhaust coming from behind it blowing north I moved right under it and I noticed some activity from the orange circle russling After watching it for a few mintutes I did not know what to make of it so I just went back in my house. The next day I notice the spot where I was under it the grass grew high and right around it was yellow ever since then I've seen many object mostly like the one at the top and I know its not a hullucenation because sometimes other people would also see them too cant take pictures camera cant pick them but I really dont whant to involved with this kind of stuff anyway sorry."],"Source":"MUFON","Tags":"City","Country":"United States","Latitude":"40.657602","Case Number":"16170","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16170.html.txt","/var/www/straped/mufon/org/16170.html"],"Longitude":"-73.583184","map":"<A HREF = \"http://maps.google.com/maps?q=40.657602,+-73.583184(16170)&iwloc=A&hl=en\"> mufon case (16170) map </A>","Region":"New York","trends":["There have been 2 other sightings in Freeport","There were no other sightings in Freeport on or around March 22nd 2009"],"Log Number":"US-03222009-0008","Weather Factors":"Unknown","Disposition":"Insufficient Data"}