{"trends":["There have been no other sightings in Napier","This sighting has never been favorited."],"Country":"New Zealand","Latitude":"-39.492844","Log Number":"NZ-03232009-0004","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Hawke's Bay","Tags":"City","Object Shape":"Cigar, Circle, Disc, Egg, Fireball, Oval, Sphere, Star-like","Date of the Event":"02/26/2009 09:15 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-39.492844,+176.912018(16179)&iwloc=A&hl=en\"> mufon case (16179) map </A>","City":"Napier","Object Features":"None","Summary":"Bright light, changed colours and shapes, moved eratically very fast in sky.","divs":["Sighting DetailsI was in Napier, Hawkes Bay, North Island of New Zealand, visiting and having dinner at a friends house with my 4yr old son and two other people. As we left the house we all walked down the driveway towards our vehicles then we noticed a bright white light ascending from behind the house across the road. It was as big as a large car. There was no noticable noise coming from the object. It was a still, quiet slightly overcast evening. The object seemed to be silent as it ascended into the sky. We all watched the object for about 20-30 seconds trying to comprehend what the object was. My thoughts at first were that it could have been a low flying plane or helicopter but then realised there was no sound associated with these aircraft. There was an airplane visible in the sky at the time of us sighting this other object. As we were watching the object the neighbours across the road arrived home and parked on their driveway. As we watched the object we overheard the occupants of the car across the road say something like \" What's that light in the sky\". It was that remark that prompted me to go to my car and get the video camera. By the time I had the camera turned on the light looked like a star in the sky. I then began to video the object using normal shot on the camera only zooming in on it once or twice which is noticable when played back. The object moved eratically in the sky and seemed to change colour from white to orange, green, red and purple. It also seemed to change shapes from round to oval and cigar and even looked as if it split in two as it changed direction at high speeds, looking at it through the camera lense. The object appeared to fly downwards toward the camera in a roller coaster fashion up and down, this is also very noticable in the footage. Then it seemed to retreat higher in the sky as it got smaller. I managed to get approximately three and a half minutes of footage of the object before it zig zagged across the sky rapidly, reducing in size and faded from view in an upward direction. Part way through videoing the object one of the witnesses left. This is clearly heard on the audio of the video. When the object disappeared the rest of us went our separate ways. I took the video home and put it onto a dvd. I am hoping to find an organisation that can help me get the footage analyzed to determine what the object could be. Due to the nature of the movements of the object I firmly believe that it is an unidentified flying object and that no aircraft known to man could move at speeds such as this did. I also realise that sceptics may put the eratic movements of the object down to camera shake and movement of the camera, but if watched closely it is noticable that the camera is very steady and that the camera would have to be moved very fast at different angles for the object to achieve such movement, which I believe to be impossible. It would be very interesting to find someone with the expertise to analyze this footage to determine that the object is in fact flying in this manner and that it is not due to camera movement. If you can help please contact me. Chris Lawson New Zealand"],"Longitude":"176.912018","Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16179.html.txt","/var/www/straped/mufon/org/16179.html"],"Case Number":"16179","Disposition":"Unresolved","Date Submitted":"02/26/2009 09:15 UTC"}