{"Object Features":"None","Sighting Duration":"Undisclosed","Case Number":"16186","trends":["There have been 3 other sightings in Winnemucca","There were no other sightings in Winnemucca on or around May 4th 1977"],"City":"Winnemucca","divs":["Sighting DetailsIn April of 1977 my dad asked me if I could attend a family reunion in the state of Wyoming. I told my dad that I was scheduled for a three week vacation starting May 1st and would make it. I worked at a local prison and attended college. My step sister was in the Army and had told me about the reunion plans a week before, so when dad talked about the reunion she told him that she could'nt make the reunion and set in motion a plan to surprise our parents. On May 4, 1977, at about 10am I left San Luis Obispo Ca traviling across California into Nevada and to Winnamucca Nv. I reached Winnamucca around 7:30ish, stopped for fast food and gas. I took hgw 95N and this is when my life changed for ever and I know that we are not alone in the universe. I drove north on 95 for about 15 to 20 minutes. When reaching for my drink in a drink container, I noticed a cigar shapped light from my right rear window. The light seem to be following the horizon of the mountains and at first I thought it was the beam of light from car driving on a mountain top road. As it was behind me to my right and far behind I continued driving and eating. As I drove on I noticed the light move to a more parellel but still behind position. That's when I noticed that something was different about this light. I slowed my car down and pulled over to the side of the road, stopped and got out of my car and watched in amazement and the light slowed down to a stop just before a saddle in the mountain, then it slowly moved over the saddle, stopped again, then left with a burst of speed nothing on this earth could match. I want to tell your organizationh before I die that I saw a vehicle from another planet and it is real. I continued on to Boise Id. picked my sister up at the Boise Air Port, and we went on to Baker Oregon. When we got home, around noon, I learned that my dad was called to work at 3am (Pacific Bell) and had to fix fuses along Oregons souther telephone power grid.I've seen these fuses, about the size of a Nerf Football. When he got home that after noon we had dinner and he explaned that an unusual power serge had blown out telephone fuses onlong a three hundred mile line and burnt out several fuses. He said that it happened around 8:30pm the previous night. I talked to my dad privately about what I saw while driving thru Nevada and after the usual question about drugs and booze, he laughed and told me to drop it and not mention it again to anyone in the family. He worried that I would be called a nut case. Will it's 2009, UFO programs are all over the TV, and I just want the world to know what I saw just out side of Winnamucca Nv. in 1977, God as My Witness. D.L. Kenney"],"Country":"United States","Date Submitted":"05/04/1977 08:30 UTC","Viewing Distance":"Over One Mile","Longitude":"-117.725885","files":["/var/www/straped/mufon/html2text/16186.html.txt","/var/www/straped/mufon/org/16186.html"],"Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=40.977888,+-117.725885(16186)&iwloc=A&hl=en\"> mufon case (16186) map </A>","Region":"Nevada","Object Shape":"Cigar","Object Flight Path":"Path then hovering","Log Number":"US-03232009-0011","Source":"MUFON","Date of the Event":"05/04/1977 08:30 UTC","Latitude":"40.977888","Tags":"City","Summary":"Stopped car along Hwy 95, maybe 15 min out of Winnamucca Nv. to observe light in shape of cigar.","Weather Factors":"Unknown"}