{"Country":"United States","Source":"MUFON","Case Number":"16189","Log Number":"US-03232009-0014","Summary":"4-5 lights observed by myself, girlfiend and a married couple.","Date of the Event":"04/30/2008 09:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/16189.html.txt","/var/www/straped/mufon/org/16189.html"],"Region":"Florida","trends":["There have been 2 other sightings in Eagle Lake","There were no other sightings in Eagle Lake on or around April 30th 2008"],"Weather Factors":"Unknown","Object Features":"Unknown","City":"Eagle Lake","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=27.984636,+-81.746659(16189)&iwloc=A&hl=en\"> mufon case (16189) map </A>","Tags":"City","Date Submitted":"04/30/2008 09:00 UTC","Latitude":"27.984636","divs":["Sighting DetailsI was first to notice lights from back porch, mentioning to guests. the lights looked like LARGE airplane landing lights, but stationary.they were of whitish pale yellow in color. If they were aircraft lights they had to be from helios. I would gustimate the altitude at 400'-600' AGL. At first they were all in a horizontal line. The far right light gained altitude followed by the nearest light which stationed next to the first light. Of the remaining two lights, one rose in altitude but not as far as the other two and then came down to its original position. The higher two lights came down and again formed a horizontal line with the other lights. Slowly all four lights decended to where they were obscured by distant tree line. The size of the lights did not get smaller as they decended. We estimate the lights were visable for a minimum of 5 minutes.long enough we went off the porch and stood in the yard watching. two points of reference I was able to use were #1....beacon on top of water tower in Eagle Lake, #2...the aforementioned tree line which is across the small lake we live on. There is an operational airport located near my residence, Bartow (KBOW) (a former WWII training field) The next day after digesting what we had seen the night before I discounted the lights were from helios.Especially after googling and extrapolating water tower,the tree line our residence location and Bartow airport. The area where the lights decended is far removed from the eastern runway at KBOW In late Dec(2008) or early Jan(2009) while fishing at night(abt 10pm) I observed at least 5 lights ( small yellowish orange colored) in general vicinity of original sightings,though further to the west. These lights formed a verticle semi arch with the bottom ascending to the to top and then disapperaing. These light were only visable for mere seconds."],"Longitude":"-81.746659","Disposition":"Unknown","Object Shape":"Other"}