{"Date Submitted":"10/31/2008 07:00 UTC","Case Number":"16184","Sighting Duration":"Undisclosed","Summary":"Silver ribbon/red orb.","divs":["Sighting DetailsMy wife, daughter, son, mom, and I were trick or treating in a large group when around 6:30-7:00 a woman in our pack said \"Oh, how pretty a shooting star.\" I looked up and saw a solid and stright bright silver line or ribbon.(the only way I can explain it) I said to the woman, \"that's no shooting star.\" From where I was standing (obviously on the ground), if I measured it with extended arms, it was probably about 3 feet long and 1 foot thick. We watched it for about 1-2 minutes and then it just faded. We continued trick or treating, but I keopt looking at the sky hoping to see it again. Approximately 20 minutes later we ALL saw a orangish - red orb moving with no sound and swiftly from the south to north. It almost looked on fire. I can not tell you how high it was flying, but It was more than just a light. I could actually make out the shape and it was an orb. It appeared to be solid on the top and bottom, and the light came from the middle. I have never seen anything like it. I tried to capture its image on my cell phone, but I could not get it to function. We watched it go and then fade away. I was not a believer in UFOs, but that night changed my mind. I began to watch UFO hunters and sure enough another sighting that occured on Oct. 31st happened in Tinley Park a few years ago. I was really confused for a few days, but came to realize that yes I had indeed seen an Unidentified Flying Object."],"files":["/var/www/straped/mufon/html2text/16184.html.txt","/var/www/straped/mufon/org/16184.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.267202,+-88.129517(16184)&iwloc=A&hl=en\"> mufon case (16184) map </A>","Log Number":"US-03232009-0009","trends":["There have been 2 other sightings in Wauconda","There were no other sightings in Wauconda on or around October 31st 2008"],"Object Shape":"Sphere, Unknown","Viewing Distance":"Unknown","City":"Wauconda","Object Features":"Dome, Other","Object Flight Path":"Stationary,Straight-line path","Latitude":"42.267202","Disposition":"Unknown","Region":"Illinois","Weather Factors":"Unknown","Tags":"City","Date of the Event":"10/31/2008 07:00 UTC","Country":"United States","Longitude":"-88.129517","Source":"MUFON"}