{"Region":"San Salvador","Latitude":"13.69","Disposition":"Unresolved","Weather Factors":"Unknown","Longitude":"-89.19","trends":["There have been no other sightings in San Salvador","This sighting has never been favorited."],"Case Number":"16192","map":"<A HREF = \"http://maps.google.com/maps?q=13.69,+-89.19(16192)&iwloc=A&hl=en\"> mufon case (16192) map </A>","divs":["Sighting DetailsIt was August 3 of 2008 at 14:08, I was at my aunt's house at about 10 miles from the volcano, i was staring at the volcano to see the panorama, then i noticewd something strange going up and down, side to side, even hid behid the volcano, since i believe in aliens and UFO's i thought it was a UFO, and i think it wasn't my first sighting, so i got excited and tried to take evidence from it, I tried to photograph it with my phone but the zoom was too little so i went looking for my aunts camera but she had hid the batteries and i couldn't find them, i was afraid it would leave; it took me about 10 minutes to find the batteries and i went to the window but i couldn't see it until, in a suprise had hidden behind the mountain and i took 12 images and 2 videos with her Samsung s630 and for my suprise it had stayed for about 3 hours i think, since i dont think it was there from the beginning, in the proximity of the volcano, i just told my mother and my cousin about this and i dont know who else saw it; i always have believed in UFO's and had a lot of experiences but this one i have proof, I don't know if there were any planes or helicopter there but i dont think any helicopter or plane can rise at that much speed and steer so sharply or even have that shape, since also i play flight simulators and know the planes movements and aerodinamycs. I was thankful that it lasted so long, but i don't know how much it lasted, it kept going after i stopped the photos and the videos and i lost sight when i came back to my house and downloaded the photos, i came to my aunt's house on the night and it wasn't there, the camera's time is wrong."],"Date of the Event":"08/03/2008 02:08 UTC","Source":"MUFON","Country":"El Salvador","Object Flight Path":"Path with directional change","Object Shape":"Triangle, Other","Tags":"City","Date Submitted":"08/03/2008 02:08 UTC","files":["/var/www/straped/mufon/html2text/16192.html.txt","/var/www/straped/mufon/more/16192_submitter_file1__S6300222.JPG","/var/www/straped/mufon/more/16192_submitter_file2__S6300231.JPG","/var/www/straped/mufon/more/16192_submitter_file3__S6300221.JPG","/var/www/straped/mufon/org/16192.html"],"Object Features":"Unknown","Log Number":"SV-03232009-0017","City":"San Salvador","Sighting Duration":"03:00:00","Viewing Distance":"Over One Mile","Summary":"UFO over Quezaltepec Volcano, San Salvador, El Salvador."}