{"Date Submitted":"06/14/1987 08:27 UTC","Object Shape":"Teardrop, Other","trends":["There have been 6 other sightings in Tooele","There were no other sightings in Tooele on or around June 14th 1987"],"Longitude":"-112.29828","Viewing Distance":"Over One Mile","Tags":"City","Latitude":"40.530778","Source":"MUFON","City":"Tooele","Region":"Utah","Country":"United States","Sighting Duration":"00:26:00","files":["/var/www/straped/mufon/html2text/16194.html.txt","/var/www/straped/mufon/org/16194.html"],"Log Number":"US-03232009-0019","map":"<A HREF = \"http://maps.google.com/maps?q=40.530778,+-112.29828(16194)&iwloc=A&hl=en\"> mufon case (16194) map </A>","Object Flight Path":"Hovering then path","divs":["Sighting DetailsDue to threats on my life I can not reveal the location of this sighting. Suffice it to say it was on a millitary base in the west desert.My crew and myself saw it rise up from behind a ridge of mountains west of our observation point. It was first thought to be a flare but it was too big and there was no smoke coming off it. It was also the wrong color. Most flares are yellow,orange and from wherenwe were we alsocould not see a parachute on it either. We were equipped with high power field glasses and a B.C. scope and were only about 2000 meters from the mountain ridge,so we could see it very well. It was a brilliant blue color almost as intence as an arc welders arc when he is welding.The shape was like an almond on its side and as near as we could tell it was about 100 feet long. Ithovered about 500 feet above the ridge for about 15 to 20 minutes then it did the strangest thing. It dimmed so much yyou could hardly see it then reappeared down range about 25 miles and re appeared. It was almost like it moved with out moving for lack of a better discription. Then it went slowly down behind the ridge out of sight.When I reported the incident to range control there was suddenly a new voice on the radio telling me to report to the provost marshalls offiec A.S.A.P. When I arrived I was hand cuffed and taken into a back office. There I was informed by a two star general and two gentle men in black suits that I was to keep my mouth shut about what I saw and that if I said anything toanyone about the incident that it is a big desert out there and it would take a long time for anyone to find my body. I am taking a huge risk reporting this but I am retired now and I feel that someone should know what is going on."],"Object Features":"None","Date of the Event":"06/14/1987 08:27 UTC","Weather Factors":"Unknown","Summary":"Strange air craft at millitary post.","Disposition":"Insufficient Data","Case Number":"16194"}