{"Country":"United States","divs":["Sighting DetailsI was on my way home driving down I 35 heading southbound towards Temple from Waco. My wife pointed to a strange light in the sky moving at incredible speed. It suddenly stopped on a dime over a field about a mile or so off the highway. I pulled my car to the shoulder as we were wondering what it was. Suddenly is appeared to land in the field and when it did we could make out a disk shape but due to the darkness it was hard to tell exactly. It was a cloudy night. I pulled my binoculars out of the back seat and when I focused in I saw what did indeed appear to be a saucer like object on the ground. I at first dismissed this as a feeder for livestock due to my poor visibility and it being a farmers field with livestock. I soon realised this object had what appeared to be a door of somesort that opened up and a redish orange light could be seen when it opened from what appeared to be the interior. Then suddenly it appeared 3 men walked out of the craft and the door shut. The craft then after about 3 minutes rose upward hovered for a brief time then took off Northbound at a very high rate of speed and I lost sight. I then refocused on the field to see if I could see any one or any thing in the field but visibility was very poor. I did note to my wife that they appeared to be walking in the direction af a rest stop that was just off of the field near the high way. I wanted to make a u turn and go northbound and stop at the rest stop but my wife wouldnt let me, she was getting concerned that maybe it could be aliens. I have lived in the area 35 years and never have seen anything like this. We do live near Fort Hood but the military to my knowledge does not have anything disk shaped in it's arsenal. I never regained sight of the 3 figures but they did leave the craft and my wife refused to stick around for it's return if it did come back at all."],"Object Features":"Unknown","Date of the Event":"03/22/2009 04:10 UTC","Source":"MUFON","trends":["There have been no other sightings in Lorena","This sighting has never been favorited."],"Weather Factors":"Does Not Apply","Object Flight Path":"Hovering then path,Path then hovering","Sighting Duration":"00:06:00","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-97.21556","Latitude":"31.386559","map":"<A HREF = \"http://maps.google.com/maps?q=31.386559,+-97.21556(16195)&iwloc=A&hl=en\"> mufon case (16195) map </A>","Region":"Texas","Case Number":"16195","Log Number":"US-03232009-0020","Disposition":"Hoax","Tags":"City","Summary":"Disk shape craft descended into field near Lorena, Texas.","Date Submitted":"03/22/2009 04:10 UTC","City":"Lorena","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/16195.html.txt","/var/www/straped/mufon/org/16195.html"]}