{"Region":"Florida","Latitude":"30.70702","divs":["Sighting DetailsMy brother and I were riding in the car and we saw what looked like very low flying planes, until it disappeared and reappeared. There were 5 lights that would fade and disappear and then reappear and stay lit for about 5 seconds and disappear again. This continued on and we tried to follow it (heading south on Log Lake Rd. until we got to Guest? Lake) to find out what the lights were. We stopped at a good place to view the lights in front of a house where the residents were looking at the lights, too. The round lights were about the color of the orange-yellow of common street lamps and we decided they weren't fireworks, flares, helicopters, or airplanes. We live very close to Eglin AFB's and Duke Field's outlying land. I took my brother home (the opposite way we were following the phenomena) and when I came back to jump on the interstate (I-10), there were several emergency response teams coming from that way. I couldn't make out what types of response vehicles they were, though. It's a SUPER rural area, so there's nothing back there for 6 or 7 such vehicles to come from. There was no sound with this...happening. Bizarre!"],"Date of the Event":"03/23/2009 12:00 UTC","Weather Factors":"Unknown","Tags":"City","trends":["There have been no other sightings in Holt","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Date Submitted":"03/23/2009 12:00 UTC","Disposition":"Insufficient Data","City":"Holt","Object Features":"Undisclosed","Object Shape":"Circle, Oval, Other","Country":"United States","Summary":"Thought they were fireworks!","Case Number":"16207","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/16207.html.txt","/var/www/straped/mufon/org/16207.html"],"Log Number":"US-03242009-0002","map":"<A HREF = \"http://maps.google.com/maps?q=30.70702,+-86.747643(16207)&iwloc=A&hl=en\"> mufon case (16207) map </A>","Source":"MUFON","Longitude":"-86.747643","Object Flight Path":"Path with directional change,Unknown"}