{"divs":["sighting detailsi saw orange lights to west that have been seeing for last 3-4 years, i seem to be able to sense when these things are going to occur now, primarily due to the presence of several things: loud, but high altitude aircraft barely visible due to altitude and small blinking lights, dogs barking all around, (sounds they hear?) and partial cloudy skies, not totally obliterated low ceiling clouds as typical march indiana skies. anyway, at 8:54 saw 3 episodes, very close together, within one minute of start of orange amber \"flares\" that seemed to be strung together. this time much further in distance than i have seen before, no noise, was able to get my son to witness...(he's not that excited by it) lights were motionless in sky after appearing but stayed lit for about 4 seconds. i dont get too excited about them now as i do believe these are military flares occuring at a place called \"hilltop\" airspace near grissom afb between peru and kokomo but west of us 31. i am guessing asa an inexperienced\\untrained observater, that these are about 5 miles west of 31. do not understand why fort wayne national guard unit who flies f-16 aircraft, in this airspace, do not let civilian population be aware of the manuevers as they are alarming to witness at first. you do not know if you are witnessing an aircraft accident or whatever. it caused a big stir last year in kokomo due to a sonic boom that occured in syncronism with the sighting of the \"flares\" which i saw that same eveing as well as hearing the boom; same thing then,i went out expecting to see something and was not let down. dont know how or why i can sense these dam things are going to start showing up. always seems to be around 9- 9:30 pm at least prior to daylite savings time. additionally, the only other thing that disturbs me is that experience pilots who have posted on this website, claim to have never seen such lights, so what gives? top secret manuevers and \"flares\" over central indianan with out so much as a \"heads-up\" to the local newppaper\\press\\radio stations? or are they just having fun with us?"],"Disposition":"IFO","Object Features":"Undisclosed","City":"Kokomo","Longitude":"-86.132423","Viewing Distance":"Unknown","Date Submitted":"03/23/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/16204.html.txt","/var/www/straped/mufon/org/16204.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.489267,+-86.132423(16204)&iwloc=A&hl=en\"> mufon case (16204) map </A>","Summary":"Same orange lights saw for last 3 -4 years west of my location. I did see high altitude aircraft and now believe these are some new kind of flares occuring @ \"hilltop\" airspace near Grissom AFB, same as those that caused stir last year after sonic boom.","Tags":"City","Region":"Indiana","trends":["There have been 61 other sightings in Kokomo","There were 3 other sightings in Kokomo on or around March 23rd 2009"],"Sighting Duration":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Case Number":"16204","Latitude":"40.489267","Object Shape":"Star-like","Log Number":"US-03232009-0028","Date of the Event":"03/23/2009 12:00 UTC","Weather Factors":"Unknown","Source":"MUFON"}