{"Country":"United States","Log Number":"US-03242009-0004","Object Shape":"Other","Region":"Florida","Longitude":"-87.341311","Object Features":"Unknown","City":"Cantonment","map":"<A HREF = \"http://maps.google.com/maps?q=30.608021,+-87.341311(16209)&iwloc=A&hl=en\"> mufon case (16209) map </A>","trends":["There have been 7 other sightings in Cantonment","There were no other sightings in Cantonment on or around March 23rd 2009"],"Weather Factors":"Light","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"03/23/2009 08:30 UTC","Case Number":"16209","files":["/var/www/straped/mufon/html2text/16209.html.txt","/var/www/straped/mufon/org/16209.html"],"Disposition":"IFO","Date of the Event":"03/23/2009 08:30 UTC","Summary":"Red-orange floating dots.","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting Detailsin washington highschool in pensacola florida a fire alarm went off with out cause causing many people to come out. now it was around 8:30 so there wasnt very many people in the school other than janitors and orchestra practice students. when every one was out side we heard emergency response vehicles coming toward us but they circled around us torward the airport which was very strange, we were sure they were coming in response to the fire alarm. we looked toward the airport and saw orange red lights that would appear for about 4 seconds and dissapear and appear to the right about 10 - 30 seconds later. it did this about two times when a helicopter over passed us extremely close to the ground for just a helicopter to be flying around. the helicopter made a L shaped turn towards the lights.the lights appeared and dissapeared about 8 times.the helicopter then went around the area we first saw the lights.then about 2-3 min later we were facing the complete opposite direction, 180 degrees the other way and we saw the lights appear and reappear about twice and stopped for the rest of the night. pretty soon after words there was about 3-5 helicopters flying around all of the areas we had just sighted the flying dots. this was all in pensacola florida.right after the fire alarm went off, we heard a loud bass sound for about 30 second to a minute. after the dots dissapeared a large cloud seemed to cover that area."],"Tags":"City","Latitude":"30.608021","Object Flight Path":"Straight-line path"}