{"Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/16217.html.txt","/var/www/straped/mufon/org/16217.html"],"Disposition":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.749499,+-117.247035(16217)&iwloc=A&hl=en\"> mufon case (16217) map </A>","City":"San Diego","Object Shape":"Other","Object Flight Path":"Undisclosed","Source":"MUFON","Region":"California","Date Submitted":"03/20/2009 10:00 UTC","divs":["sighting detailsi was walking on the ocean beach pier on friday march 20, 2009 at approximately 10 pm. i looked east towards the fog and saw what looked like a flare being launched into the sky and thought \"oh someone is just launching fireworks or something.\" then it disappeared and another flare-looking object appeared elsewhere in the sky going downwards and sideways as the other flare-like object reappeared. they then started doing random and weird aerodynamics, looking like how bugs just random fly around. but they were also disappearing and reappearing at random. i pointed it out to my friends and me and my friend took out our cell phones and filmed the incident. other fishermen on the pier saw what we saw and we all did not know what it was and were quite frankly weirded out. i tried to point it out to as many people as possible. after about 5 minutes the objects disappeared. i knew it wasnt a flare, because it was flying around and i knew it wasn't a jet or anything because it was disappearing and reappearing. sadly the video i took on my phone was not in good enough quality to see the objects, but heres the video anyways: http:\\\\www.youtube.com\\watch?v=gkratnhphym i looked around on youtube for other ufo videos and found one video that looks exactly like what i saw. here it is\": http:\\\\www.youtube.com\\watch?v=lidndoidflg this was my first ufo sighting and definitely was a life changing experience. keep your eyes to the skies."],"Latitude":"32.749499","Case Number":"16217","Summary":"2 UFOs sighted in Ocean Beach, CA (in San Diego) on the Pier looking towards the east on Friday, March 20. 2009 at approximately 10:00 PM.","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around March 20th 2009"],"Longitude":"-117.247035","Object Features":"Undisclosed","Tags":"City","Date of the Event":"03/20/2009 10:00 UTC","Weather Factors":"Unknown","Log Number":"US-03242009-0012"}