{"Object Shape":"Circle, Disc","Viewing Distance":"101-500 Feet, Unknown","Log Number":"US-03242009-0006","Country":"United States","Summary":"Driving north on Old Wire road. Happened to look up right as it flew above me also headed north.","Date of the Event":"11/11/2008 08:30 UTC","Object Features":"Dome, Unknown","Longitude":"-94.151466","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 21 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around November 11th 2008"],"divs":["Sighting DetailsI was in my car driving North on Old Wire rd. It was 8:30 in November so it was pitch black outside. As I was driving, I happened to look up at the sky between the trees on both sides of the road. Almost immediately as I looked upwards, a halogen-like, bright blue saucer flew from directly above me, traveling in the same direction as I was until it was out of sight in about a second, maybe even less. My initial reaction was, \"Wow that was a bizarre shooting star!\" But then it sunk in, and I realized that what I had just seen was not a star but a saucer like object. It's hard for me to gauge how high up above me it was due to the brief amount of time I was able to observe it, but if I were to guess, I would say anywhere from 150-500 ft high. Also, the next day, I was at a friends house and against my better judgment, I mentioned it to two of my friends, that I had seen a UFO. (knowing that even if they didn't believe me we were close enough that they wouldn't take me for a loon) To my surprise, one of my friends who I had told said that he and his girlfriend had been walking on campus that night roughly 3 miles or so from where I had seen the UFO, and that they too had seen the exact thing I had just described."],"Region":"Arkansas","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16211.html.txt","/var/www/straped/mufon/org/16211.html"],"City":"Fayetteville","Case Number":"16211","Disposition":"Unknown","Latitude":"36.06828","Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=36.06828,+-94.151466(16211)&iwloc=A&hl=en\"> mufon case (16211) map </A>","Date Submitted":"11/11/2008 08:30 UTC"}