{"Viewing Distance":"101-500 Feet","Source":"MUFON","Region":"Indiana","files":["/var/www/straped/mufon/html2text/16214.html.txt","/var/www/straped/mufon/org/16214.html"],"Log Number":"US-03242009-0009","trends":["There have been 61 other sightings in Kokomo","There were 3 other sightings in Kokomo on or around March 23rd 2009"],"Object Flight Path":"Unknown","Summary":"String of 5-7 lights in row.","Disposition":"IFO","divs":["Sighting DetailsI was living work I clocked out at 8:52 pm I smoked half a cigarette got in my car and started to drive towards grissom but in kokomo so whatever direction that is. I noticed these 2 lights a little redder than the peach color of street lights towards my left. I assumed it was two plains in the clouds flying near each other with lights on. Ahead of me and towards the right I saw a low flying re fueler with all its lights on so I would say it was about 150 ft in the air. I realized it was about same distance away from length and highest of other 2 plains and i looked back towards left at them the two lights were closer together, so still assuming they were two plains crossing i put my attention back on refulier. I often wonder how my times re fueler with lights on a mistaken for UFO's there so bright and look strange with all lights on thats why it was holding my attention. I looked back at reddish lights and noticed they were gone and figured they had passed and turned off lights. I was coming towards a 4 way stop and slowing down by this time. I then saw the reddish lights blink on and off 3-4 times but looked to be jumping around. Then all at once like a jet dropping flairs in order 1 2 3 4 5 6 maybe 7 of these lights in a perfect line not real bright flairs that close would be but bright maybe do to clouds. I slammed on brakes and grab camera phone flipped open and was about to take picture and gone. 3 second no more were these lit up. I sat there looking for something nothing to be seen no flashing lights from jet nothing. I could see the flashing lights on refulier so I assumed on jet I would be able to see too. On the way home I was thinking maybe that it wasn't two jets passing in sky but these thing flashing lights on and off, that is unknown. What i do come to realize on way home that this thing had to be over man part of Kokomo and doubt air force would drop flairs over a city, That even if they could put a 3 sec burn on flairs that they would have burned out in order they were dropped not all at once. I wish I had gotten a picture. I read another person reported this and thinks its flairs I thought it was to at first but not sure with the two things I just stated. I am sure that if there had been a jet I would have seen a flashing light on it do to fact i could see the flashing light on refuler even with all its lights on."],"City":"Kokomo","Object Features":"Unknown","Date of the Event":"03/23/2009 08:55 UTC","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"00:01:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.493647,+-86.128913(16214)&iwloc=A&hl=en\"> mufon case (16214) map </A>","Date Submitted":"03/23/2009 08:55 UTC","Object Shape":"Unknown","Longitude":"-86.128913","Latitude":"40.493647","Case Number":"16214"}