{"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16229.html.txt","/var/www/straped/mufon/org/16229.html"],"Object Shape":"Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=30.361644,+-87.160577(16229)&iwloc=A&hl=en\"> mufon case (16229) map </A>","divs":["Sighting DetailsComing home from Pensacola beach, I spotted three lights in a row. The object seemed to turn and then it appeared to be triangular with more lights. The lights would stay on 3-4 seconds and then disappear. The object did not appear to be moving, so I assumed it was not an airplane or helicopter. I kept watching as we were driving accross the bridge and the object did not appear to move. I wached the lights go on and off in the same pattern at least 4-5 times. As we reached the end of the bridge and turned on HWY 98 toward Navarre, we looked to our left and the same lights and pattern appeared on the left side of HWY 98 totally opposite the side of the road we had seen it before. This time it seemed to be moving back accross HWY 98 back toward the water. It moved across, in front, above us, and lower behind trees. We were in a Jeep with no windows, but heard no noise what so ever. After arriving home in Midway, we looked in the sky and could see what seemed to be puffy small smoke-like clouds above us, but the rest of the sky was totally clear. Shortly afterwards we saw and heard several military helicopters going toward where we last saw the object. We were totally amazed as we continued to rule out the possibility of planes, copters, flares, ect. We came to the conclusion there was nothing we knew that could exhibit such unusual patterns of movement and light display."],"Summary":"Sighted object coming home from Pensacola Beach going home in Gulf Breeze.","Latitude":"30.361644","Case Number":"16229","Weather Factors":"Unknown","Log Number":"US-03242009-0024","Sighting Duration":"Undisclosed","trends":["There have been 55 other sightings in Gulf Breeze","There was one other sighting in Gulf Breeze on or around March 23rd 2009"],"Disposition":"IFO","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Flight Path":"Hovering then path","Longitude":"-87.160577","Region":"Florida","Date of the Event":"03/23/2009 08:15 UTC","City":"Gulf Breeze","Tags":"City","Country":"United States","Date Submitted":"03/23/2009 08:15 UTC","Source":"MUFON"}