{"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around September 30th 1994"],"Object Flight Path":"Straight-line path","divs":["Sighting Detailsmy first experience was in the fall of 1994.my girlfriend now my wife and i were driving leaving Deer Park Texas on Rail road ave.which is a feeder road that runs along Hwy 225 going to Houston.it was a cool night about 9:30.my wife was looking threw the glove box when i witnessed a streak of light shoot from over Shell refinery from right to left and crossed our path,.from my drivers seat looking out the windsheild it was a 3 inch streak with a yellowish red tint.i immediatly said \"what the hell\",that was when my wife looked up, at that momment it seperated into 3 perfect spheres of light,same size of the streak.then disappeard to nothing.we couldnt believe what we saw,and havent seen that particuler object again.the thing that really gets me is this object was solid light,no sparks no fire no smoke,just light.and what got me to contact MUFON is that ive started hearing simular reports from around the world my intrest is peaked.we are BELIEVERS and know we are not alone. thank you for your time-R.S."],"Disposition":"Unknown","Date Submitted":"09/30/1994 12:00 UTC","Latitude":"29.767673","Tags":"City","Country":"United States","Longitude":"-95.36077","Case Number":"16225","map":"<A HREF = \"http://maps.google.com/maps?q=29.767673,+-95.36077(16225)&iwloc=A&hl=en\"> mufon case (16225) map </A>","files":["/var/www/straped/mufon/html2text/16225.html.txt","/var/www/straped/mufon/org/16225.html"],"Weather Factors":"None","Sighting Duration":"Undisclosed","City":"Houston","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03242009-0020","Region":"Texas","Object Shape":"Sphere, Other","Summary":"Witnessed a reddish amber streak of light that then turned to 3 spheres that vanished.","Source":"MUFON","Object Features":"Other","Date of the Event":"09/30/1994 12:00 UTC"}