{"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.771711,+-72.682043(16226)&iwloc=A&hl=en\"> mufon case (16226) map </A>","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around March 19th 2009"],"Date of the Event":"03/19/2009 06:15 UTC","Country":"United States","Log Number":"US-03242009-0021","City":"Hartford","Case Number":"16226","Tags":"City","Region":"Connecticut","Latitude":"41.771711","Date Submitted":"03/19/2009 06:15 UTC","Disposition":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsEarly on the morning of March 19, 2009, I was walking my dog down the street. As I looked ahead, I saw what appeared to be a plane taking off, although there are no airports in my area. It seemed to be flying at a height of about 250 feet, in an eastward direction at about a 30 degree angle. It seemed strange, but I didn't pay much attention to it until I saw it make a dramatic climb in altitude. It went from flying at a 30 degree angle to flying at about an 80 degree angle. It was practically flying vertically, and it was climbing altitude rapidly. After about 5 seconds of flying, it had probably risen to a height of about 600 feet. Then, it gradually began to level - off. It took about 3 seconds for it to get level again. Once it was level, it slowly turned left and headed north towards me and my dog. It banked, and its triangular shape became apparent. Unsure of what this thing was, I started to run back home to tell the rest of my family, so that they could come and see it. But, as it flew closer, I decided to stay and watch it, because it was so fascinating. It was probably flying at around 70 miles per hour. As it approached and passed overhead, I was able to see its underside. It was clearly a triangular aircraft. From my point of view, the object was about the size of a baseball, and all three sides of the object were the same length. It was black or gray in color, and it had one small white light on each corner (which made 3 white lights altogether), and one small red light in the center. It continued to fly north, and I watched it until it disappeared behind the trees. Throughout the entire flight, it made a low whistling noise, similar to a quiet \"whoooosh\" sound. It sounded similar to the sound that an airplane makes as it moves through the air, but I didn't hear the humming of an engine. The entire experience probably lasted about 1 minute."],"Longitude":"-72.682043","Summary":"Triangular aircraft flies extremely low, then flies vertically, then flies directly over me.","files":["/var/www/straped/mufon/html2text/16226.html.txt","/var/www/straped/mufon/org/16226.html"],"Object Flight Path":"Path with directional change","Object Shape":"Triangle","Source":"MUFON"}