{"Viewing Distance":"Over One Mile","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.313326,+-70.971179(16238)&iwloc=A&hl=en\"> mufon case (16238) map </A>","Case Number":"16238","Disposition":"IFO","Date of the Event":"03/21/2009 08:00 UTC","trends":["There have been 4 other sightings in Rochester","There were no other sightings in Rochester on or around March 21st 2009"],"Longitude":"-70.971179","Object Flight Path":"Straight-line path","Log Number":"US-03252009-0007","files":["/var/www/straped/mufon/html2text/16238.html.txt","/var/www/straped/mufon/org/16238.html"],"divs":["sighting detailsaround 8pm, i was outside chatting with a friend in my driveway. i observed a bright object moving low across the sky. it was a reddish-white colored light and at one point became extremely bright (mostly white) while continuing along its trajectory. there was no indication of any strobes or beacons as i normally would associate with aircraft. it was moving away from us in a nw direction. no sound whatsoever could be heard and the brightness i observed could only be compared to a very close plane approaching us with its landing lights on. this object however was traveling away from us and away from any nearby airports. i estimate initial brightness at 5x the brightest star or planet in the sky and peak brightness at about 10x. the object disappeared from view beyond the horizon\\tree line heading in a nw direction. it was moving rapidly enough to cover a large swath of sky in less than a minute. impossible to estimate the exact distance from our vantage point, but i would figure 5 miles north of us, give or take. i felt as though i had just watched an event in progress that was difficult to explain or compare to any other aircraft i had seen up to this point. i scanned the sky and noticed a plane that was heading south to north in same general direction as where we lost sight of the object. the plane's altitude was 2-3 times higher in the sky, it was only noticeable by the tell-tale strobe-beacon light and seemed to be traveling no more than 1\\4 of the speed of the first object we had observed."],"Object Shape":"Star-like","Tags":"City","Region":"New Hampshire","Source":"MUFON","Summary":"Star-like, color-changing, low-flying object, moving quickly across the horizon.","City":"Rochester","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"43.313326","Object Features":"Unknown","Date Submitted":"03/21/2009 08:00 UTC"}