{"Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.544986,+-81.377096(16239)&iwloc=A&hl=en\"> mufon case (16239) map </A>","Object Features":"None","Log Number":"US-03252009-0008","Weather Factors":"Unknown","Date Submitted":"03/14/2009 02:15 UTC","divs":["Sighting DetailsI was flying from Chicago to Orlando, FL on March 14, 2009 on Air Tran flight 823. During our final descent I noticed a small, dull silver colored spherical orb in the air below the plane on the left. The object caught my eye because of its gray color and perfectly round shape. The object was at less than half the altitude of the plane. I noticed it, saw it disappear behind the wing and reappear on the other side before leaving my range of sight out of the plane's window. The object was moving in the opposite direction of our plane, slightly faster than our plane's speed. At first I thought it was a power line with some sort of identifying object, but saw no other orbs or power lines. My next thought was that it was a bird, but I later saw a bird flying below our plane. The bird was traveling in the same direction and at approximately the same altitude as the object and it was easily recognizable as a bird. After the sighting I tried to explain to myself what I had seen, but no explanation came to mind. Later seeing a bird which looked very different confirmed that I had seen something unusual and unexplainable. The object was definitely in the air and looked unusual enough for me to want to report it."],"files":["/var/www/straped/mufon/html2text/16239.html.txt","/var/www/straped/mufon/org/16239.html"],"Longitude":"-81.377096","Source":"MUFON","Sighting Duration":"00:00:45","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around March 14th 2009"],"Region":"Florida","Latitude":"28.544986","Disposition":"Insufficient Data","Date of the Event":"03/14/2009 02:15 UTC","Summary":"Saw small spherical orb-shaped UFO while coming in for landing at Orlando International Airport on Air Tran flight 823","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16239","Object Shape":"Sphere","Object Flight Path":"Straight-line path","City":"Orlando"}