{"Date of the Event":"03/24/2009 12:00 UTC","Object Features":"Unknown","Longitude":"-75.339905","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16237.html.txt","/var/www/straped/mufon/org/16237.html"],"Summary":"Several slow moving objects.","Viewing Distance":"101-500 Feet","City":"Norristown","Log Number":"US-03252009-0006","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.121497,+-75.339905(16237)&iwloc=A&hl=en\"> mufon case (16237) map </A>","Disposition":"Unknown","Sighting Duration":"Undisclosed","Latitude":"40.121497","Weather Factors":"Unknown","Case Number":"16237","Object Shape":"Unknown","Tags":"City","Date Submitted":"03/24/2009 12:00 UTC","divs":["Sighting DetailsI was at the park last night directly behind the east norriton township building walking my dog as I do 4-5 nights a week. It was about 10 PM. Its a great spot to look at the stars and all of the planes flying by because there is very little artificial light at night. As i watched my dog run around and play, I saw two bright lights in the distance which looked stationary - almost like 2 towers with bright lights atop them. It seemed odd to me that I had never noticed them before in the 2+ years I had been walking my dog there at night. As I stared at them, I noticed they had been moving, but very slowly. I was transfixed on them because they seemed unlike any plane I'd ever seen. Finally, after about 10 minutes, they were directly over me and flying at a very low altitude, and at a very low speed. They had lights on them that went from what looked like blinking white lights which would change to blinking red and blue lights and then occasionally a non-blinking bright white light. At first their were only 2. And then 2 more followed. I started too look all around me and to the east I could see 3 more. All flying low, slow, and changing light displays. In all, I saw a total of 10-12 of them. Another thing is that they generally flew in pairs and VERY close to each other, much closer than normal planes do. Lastly, they made NO noise until they were directly above me, i could hear the faintest rumble of an engine. Other than that, they were earily silent. After watching and watching, eventually they all just flew away and I couldnt see what happened. After about an hour, the display was over and I still have no clue what I witnessed. As I was watching, I was confused mainly. I just could not for the life of me figure out what I was seeing. The funny part is that the East Norriton Township building also house the police station. I easily could have gone in to tell them but I didnt want to cause a stir if I turned out to be overreacting. I apologize if this is poorly written. Im at work and have a very busy day, but had to tell someone this!"],"trends":["There have been 2 other sightings in Norristown","There were no other sightings in Norristown on or around March 24th 2009"],"Region":"Pennsylvania"}