{"trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around March 25th 2009"],"Case Number":"16243","Object Features":"Unknown","Weather Factors":"Does Not Apply","Country":"United States","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsI was standing in my back yard letting my dog pee, when I noticed two stars in the sky that I had never noticed before. I often stargaze while I'm out back with my dog, so I knew that something was different. They then BOTH began to move west. I instantly ran inside to get my video camera. When I came back out, they had moved about 45 degrees to the west from when I left them. Up until this point, they were an equal distance apart. They then both blanked out and then instantly reappeared much further apart. They did this twice. The entire time that I was trying to film them, my cheap auto focus video camera couldn't hardly pick them up. Then the most westward one sent out three very bright and distinct strobes. Then the second one replied with a series of strobes itself. They then began to move at a slightly faster pace, whilst continuing to strobe to each other. At no time were any of the strobe sequences the same. If one sent out three strobes, the other would do a different number of strobes. It was extremely obvious that the two ufos were communicating with one another. I continued to try to film them as they continued westward and out of my sight line. Once I could no longer see them, I got my iphone and googled MUFON Oklahoma, and called the number listed, and told the person what had just occurred. Being a former police officer, I have had numerous hours of training in observation. These were absolutely not airplanes. Airplanes don't disappear and reappear miles from where they just were in an instant. There was no sound, but even if they were emitting sound, they were so high up that I wouldn't have been able to hear them. When you witness something like this, it gives you a feeling inside that is absolutely unique. It's like you're hit with the realization that you are ACTUALLY witnessing a UFO incident, and the feeling is just indescribable. But to try to put into words how it makes you feel is like the most scared that you could be, mixed with the most excited you could be, mixed with the most confused that you could be. Humans DO NOT have flying machines that can do these things."],"Date Submitted":"03/25/2009 08:30 UTC","Date of the Event":"03/25/2009 08:30 UTC","Longitude":"-97.510318","files":["/var/www/straped/mufon/html2text/16243.html.txt","/var/www/straped/mufon/org/16243.html"],"Source":"MUFON","Log Number":"US-03252009-0012","Disposition":"Unknown","Object Shape":"Flash, Star-like","City":"Oklahoma City","Summary":"2 UFOs flying s x sw strobing to each other. Disappearing and reappearing.","Latitude":"35.46939","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.46939,+-97.510318(16243)&iwloc=A&hl=en\"> mufon case (16243) map </A>"}