{"Source":"MUFON","Tags":"City","Disposition":"Unresolved","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"00:10:00","Longitude":"-83.683056","Object Flight Path":"Unknown","divs":["Sighting DetailsFrom FI Report: On the evening of June 21, 1985, Wit. 1 had taken one of her neighbors to astore near their home in Flint, Michigan. Wit. 1 noticed a very large light inthe northern sky, which was at eye level, as she viewed it through thewindshield. She could not tell if the light was moving or standing still. Shedoes know that she passed under the light because she could see it in herrearview mirror, as she continued north. Upon arriving home, she and theneighbor got out of the car. They could see the huge object, pinkish-orange incolor, hovering overhead a short distance away. She stated the object was roundin shape, about the size of a compact car, appeared to have some type of hazesurrounding it. The object hovered for a few minutes then began to move ever soslowly in a southerly direction. AS the object moved it kept descending andascending in a zig-zagging fashion. She said that the object looked like it wasspinning, giving it a pulsating effect as it moved across the night sky. Shesaid that they were very frightened as they stood there watching but they werein such awe that they could not go inside until it was out of sight. Thiswitness was not aware of a previous sighting the night before in the samelocation (see WUFOD Report #1-755)"],"Log Number":"","Object Shape":"Oval","Region":"Michigan","Case Number":"1624","map":"<A HREF = \"http://maps.google.com/maps?q=43.019067,+-83.683056(1624)&iwloc=A&hl=en\"> mufon case (1624) map </A>","Date Submitted":"06/21/1985 10:30 UTC","Date of the Event":"06/21/1985 10:30 UTC","Viewing Distance":"Unknown","City":"Flint","Summary":"Pink-Orange Object seen in Flint, Michigan","Latitude":"43.019067","files":["/var/www/straped/mufon/html2text/1624.html.txt","/var/www/straped/mufon/org/1624.html"],"Weather Factors":"Unknown","trends":["There have been 40 other sightings in Flint","There was one other sighting in Flint on or around June 21st 1985"]}