{"Weather Factors":"None","Date Submitted":"11/27/1995 12:00 UTC","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around November 27th 1995"],"City":"Indianapolis","map":"<A HREF = \"http://maps.google.com/maps?q=39.769666,+-86.150914(16244)&iwloc=A&hl=en\"> mufon case (16244) map </A>","Object Flight Path":"Path with directional change","Summary":"Twelve glowing objects in night sky in a formation moving back and forth.","divs":["Sighting Detailsin november of 2005 me my wife and son witnessed 10 to twelve redesh ornge balls in the night sky we watched them for 45 min crossing back and forth we new it was something spesial not normal did not know what to do or whay to think i wanted to wake the nieghbors but we just moved in and did not want to seem crazy. it was so weird seeing something you can not explain. it has not been my first time with ufo;s but for my family it was. it made them believe or atleast wonder what was happening. i have had what i would call personal incounters though out my life only now do i wonder if my incounters meen something . i have had things happen to me i can not explain. hard to put into words. i am not the best typest or speller i would have to tell some one me story to make them understand. i have only told my close friends even then its had to believe. how do you explain something with long fingers holding you down scared to death can not move but i could see in and out. wanting to get away but cant. the next time it happend i was with friends i was watching tv they where sleeping one the floor a light took over the whole room a soft white light it started small but took over the room i yelled at my friends hey hey do you see this the would not answer i keeped yelling to them as soon as they answered me the light went away in the same way it came but it went from big to small my friends believed me but explained it as a religous sight. i didnt know so i let it go. but i found myself studing ufo books vidios and tv shows about ufos always wondering why i feel this way and why for so long"],"files":["/var/www/straped/mufon/html2text/16244.html.txt","/var/www/straped/mufon/org/16244.html"],"Source":"MUFON","Date of the Event":"11/27/1995 12:00 UTC","Tags":"City","Longitude":"-86.150914","Case Number":"16244","Log Number":"US-03252009-0013","Viewing Distance":"101-500 Feet","Object Shape":"Sphere, Unknown","Country":"United States","Disposition":"Unknown","Object Features":"Other, Unknown","Region":"Indiana","Sighting Duration":"Undisclosed","Latitude":"39.769666"}