{"Tags":"City","Sighting Duration":"Undisclosed","Region":"Colorado","trends":["There have been 22 other sightings in Pueblo","There were no other sightings in Pueblo on or around February 24th 2009"],"divs":["Sighting DetailsI know the exact time because we always leave to go dancing at 6:45 PM, but I don't know if it was MDT or what--I can not keep the time zone straight, but it was before it changed to the time we have now)I am not sure which Tuesday it was but before March and sometime in middle February. My friend and I were getting in the pickup to go dancing. As we walked to the pickup, I remarked how bright the stars were and how clear the sky was and no wind (which we had been having). We saw the evening star in the west and as I was looking at the clear sky, I looked around the sky and in the southeast I saw a circle of lights with maybe 6 or 8 lights. They appeared as if I was looking at the stars VERY far away but in perfect cirle. In front of the circle, or (hovering above the formation, it is hard for me to explain) was a formation with 7 objects in the shape of a V. As I saw them I said \"look at that\". My friend said \"what\" and I said \"those things flying\". They were in such perfect formation and my friend couldn't see what I was pointing at, at first, and by the time he looked up and saw them they had moved from the southeast to the north west and just about as he located them they were out of sight. He said \"those are geese\" because it resembled their formation and shape, only the wings didn't \"flap\". I said \"geese don't fly at night\". By the time of those few sentences, the formation was gone out of sight. It didn't seem they flew out of sight as much as if they just disappeared heading in the northwest still in perfect formation. They didin't appear to be as far up in the sky as the circle, but they were as high as a jet would fly . The circle didn't move to the northwest with them, unless it was so high it was out of sight of my natural eye. I looked back to see the circle and to see if I had imagined things, but my friend said let's go so I got in the pickup and we left. He doesn't like things like that,but I said \"it seems so eerie because all those things didn't make even one sound\". He agreed that it was eerie but wanted to dropped the subject. It only lasted the length of time it took us to say the above sentences. The sky was so clear that evening. I didn't report this earlier because I couldn't find any place on the internet, until I read the article about the cow in our local paper today, March 25, 2009, and saw this website. I didn't report it to the local paper. I do not like publicity, but do know what I saw. I also saw a UFO in the fall of 1948 in Nebraska, but it didi't look like this."],"Disposition":"Unknown","Longitude":"-104.605541","Date of the Event":"02/24/2009 06:45 UTC","Latitude":"38.257487","Summary":"7 objects flying as geese would fly; in perfect formation; no sound/a circle of lights seemed to be much higher; did not follow formation.","Object Features":"Wings, Other","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Case Number":"16240","City":"Pueblo","Log Number":"US-03252009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=38.257487,+-104.605541(16240)&iwloc=A&hl=en\"> mufon case (16240) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16240.html.txt","/var/www/straped/mufon/org/16240.html"],"Country":"United States","Object Shape":"Chevron, Circle","Date Submitted":"02/24/2009 06:45 UTC","Viewing Distance":"Unknown"}