{"Log Number":"US-03262009-0008","Summary":"Very bright star like object. Brightest object in sky at that time. I watched as it fell to earth in controlled fall very slow and object never changed shape or size during its descent. It took over 10 mins. and was very controlled in its flight.","Latitude":"34.168487","City":"Cartersville","trends":["There have been 9 other sightings in Cartersville","There were no other sightings in Cartersville on or around March 15th 2009"],"Object Features":"None","Object Flight Path":"Stationary,Straight-line path","Weather Factors":"None","Longitude":"-84.790298","Sighting Duration":"Undisclosed","Case Number":"16254","Disposition":"Insufficient Data","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.168487,+-84.790298(16254)&iwloc=A&hl=en\"> mufon case (16254) map </A>","divs":["Sighting DetailsI watched to see if it would cause an explosion or fire when it hit the ground but nothing occurred. It just seemed to come to a soft quiet landing. I watched all local news for a story about a meteor or space junk or anything that would have explained what I saw but nothing. I find it hard to believe I was the only person who saw it coming down especially since it took so long for it to fall out of the sky.I have seen many planes,helicopters,and shooting stars in the sky above my home but this was a new sight and I would love any info. on what it might have been.If it helps I can even tell you right where it came down at because it was right over a pair of red lights that flash at night to warn pilots of high lines and structures. Thanks to that I will never forget the exact spot I saw this glowing ball go behind the trees. If anyone is ever interested in looking for what fell that night I would be glad to show you where I last saw it. I will admit I am very interested in finding out what it was or is for that matter. 1)where-on my back porch in cartersville,Ga. 2)noticed object because it was 10 times brighter then any other star in the sky at that time and looked for blinking lights that would have told me it was a plane no lights at all. 3)shooting star 4)realized it wasn't losing size,color,shape,and it was moving very very slow and in a straight line down it also had no tail or smoke tail. 5)it was going so slow I hoped my husband would get home in time to see it so I never took my eyes off of it as it went down so I could point it out to him when he got home.I also thought it might cause a fire due to the dry conditions in the woods but I never even saw any kind of reaction in the area it landed in. 6)Went behind some trees and seemed to land softly."],"Date of the Event":"03/15/2009 08:30 UTC","Object Shape":"Fireball, Star-like","Date Submitted":"03/15/2009 08:30 UTC","Tags":"City","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/16254.html.txt","/var/www/straped/mufon/org/16254.html"],"Region":"Georgia","Country":"United States"}