{"divs":["sighting detailson march 2nd, 2009, my mom and i were out birthday shopping at the mall, when i noticed, alone in the early evening sky, as there were absolutely no other stars or planets in the sky at that time (starting at around 6:30pm), i noticed an extremely bright star-like object hovering over the mall. it appeared to move across the sky at times, and then go back to remaining stationary. i called my brother and told him to look to the west, to which he replied that he didn't think it was anything because he's seen it almost every night of the past 2 weeks. i thought, maybe, it was the planet venus, but it was just soooooo damn bright!! brightest thing i've ever seen in the skies! when i got home, i started charging the video camera... and then i started seeing other strange, star-like objects in the skies not far from the main, brightest object, that seemed to sort of circle it in essence. there were no blinking lights on the clearly smaller, moving star-like objects and they were very similar, but not exact in their luminescence to the other star-like object i saw\\reported last year. i managed to get about 30 seconds of the smaller, clearly moving star-like object (due to the fact that our video camera wasn't charged and you can't pre-charge the battery and keep it charged) but i did manage to capture about 30-40mins of the main, bright star-like object in the sw sky, which, after observing it, went inside for no more than 15-20 mins, went back out and it was gone... at which point, a short distance away from where it had been stationary, and did appear to be moving slightly, i saw, what i believe was the same bright, star-like object moving just above and thru the tree-line, which i also managed to catch on video tape. i'm not saying that it was \"for sure\" a ufo or an alien craft, but it remained in the sky for approx. the next 4-5 days, at which point, i haven't been able to locate it since."],"Object Features":"Undisclosed","Country":"United States","Tags":"City","Region":"Michigan","Source":"MUFON","Log Number":"US-03262009-0010","Latitude":"42.607829","Weather Factors":"Unknown","Date of the Event":"03/02/2009 07:30 UTC","Longitude":"-83.14875","map":"<A HREF = \"http://maps.google.com/maps?q=42.607829,+-83.14875(16256)&iwloc=A&hl=en\"> mufon case (16256) map </A>","Sighting Duration":"Undisclosed","City":"Troy","files":["/var/www/straped/mufon/html2text/16256.html.txt","/var/www/straped/mufon/org/16256.html"],"Object Flight Path":"Undisclosed","trends":["There have been 18 other sightings in Troy","There was one other sighting in Troy on or around March 2nd 2009"],"Case Number":"16256","Viewing Distance":"Unknown","Date Submitted":"03/02/2009 07:30 UTC","Summary":"For approx. 2-3 hours, I watched an extremely bright star-like object in the SW skies.","Object Shape":"Flash, Star-like","Disposition":"Insufficient Data"}