{"Disposition":"Unknown","Object Flight Path":"Stationary","Object Shape":"Oval","Longitude":"-98.488658","City":"San Antonio","Date of the Event":"03/25/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.428562,+-98.488658(16252)&iwloc=A&hl=en\"> mufon case (16252) map </A>","Summary":"Silent, oval, ominous, shiny...","Sighting Duration":"00:00:12","Tags":"City","divs":["Sighting DetailsMy wife, child and I were visiting my Father-in-law today at his place by Medina Lake here in San Antonio, Texas. I took my daughter on a small tractor ride through a dense wooded area about a mile from the lake itself. My daughter was on my lap steering when she suddenly pointed up at this object directly in front of us about 100 yards and around 30 feet off the ground. She turned around quickly and hid her eyes on my shoulder as I tried to stretch my leg out to get my cell phone out of my pocket and take pictures. I was extremely nervous that it was so clearly in plain view and that I knew I needed to get the pictures. But not being able to take my eyes off of the object made for fumbling fingers and tight pockets, not to mention that my daughter was scared to death. This whole process from first sighting to getting the cell phone out took about 7 - 9 seconds. By that time the object tilted slightly and the sun light gleemed off of its surface as it disappeared. I tried to see a trail but there was nothing. I told my daughter to relax and when we got back and told everyone they said we were pulling their legs. But it happened. The entire sighting lasted an estimated 11-12 seconds. NOTE: I DID post this to a different website earlier tonight but forgot that there WAS an aura or fuzziness to the stability of the crafts \"flight\". I apologize for this error. 1. The craft (object) was semi-circular 2. A mercury - mirror type shell 3. Slight protrusions from top center and maybe bottom as well. 4. No sound 5. No lights 6. No windows 7. Slight acidic taste to faint odor (may have been any number of outside scents though) 8. No exhaust trail visible 9. Craft (object) was around 12-15 ft side to side and 5-6 ft top to bottom 10. Mower (tractor) encountered no motor malfunction and cell phone worked fine once in hand. 11. No one else saw a thing from what I know. Thank you for your time."],"Region":"Texas","Case Number":"16252","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16252.html.txt","/var/www/straped/mufon/org/16252.html"],"Log Number":"US-03262009-0006","Latitude":"29.428562","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around March 25th 2009"],"Weather Factors":"Unknown","Date Submitted":"03/25/2009 12:00 UTC","Viewing Distance":"101-500 Feet","Country":"United States","Object Features":"Unknown"}