{"Weather Factors":"None","Date of the Event":"03/22/2009 09:05 UTC","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in Hudson","There were no other sightings in Hudson on or around March 22nd 2009"],"Disposition":"IFO","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-71.436708","map":"<A HREF = \"http://maps.google.com/maps?q=42.768931,+-71.436708(16260)&iwloc=A&hl=en\"> mufon case (16260) map </A>","City":"Hudson","Log Number":"US-03262009-0014","Latitude":"42.768931","divs":["sighting detailscoming from boston on sunday night 3\\22\\09 at about 9; 05 pm. we live in nh 03053. i pulled into my driveway and looked up at the stars because they were so bright. i saw what i assumed was a satellite, and said to my wife and two kids hey look at the satellite, they got out of the car and looked up and said where? my wife and daughter went in the house. at that point i couldn't see anything moving. then i said, oh i could have sworn i saw something moving. my son said oh yaw there it is, and it was moving slower than a few seconds before when i saw it from in the car. i looked at the corner of the roof of the house to see if it was really moving and it was. then it started moving a little faster so you could easily see that it was moving. we watched it for a couple of seconds and i saw it jerk real quick to the right about an inch, (as your looking at the stars) and then back. i thought that it was my eyes playing tricks on me so i didn't say anything , but my son said hey that moved back and forth real fast didn't it .i said with total surprise you saw that ? and he said yaw it moved, i asked what direction it moved in, and he motioned with his hands what it did. showing the same direction and movement. then as we watched, it picked up speed moving in the same direction (north) and it moved really fast and we lost sight of it in a few seconds."],"Summary":"Object moved at different speeds and made unusual jerking movement.","files":["/var/www/straped/mufon/html2text/16260.html.txt","/var/www/straped/mufon/org/16260.html"],"Case Number":"16260","Object Features":"Unknown","Object Shape":"Star-like, Unknown","Date Submitted":"03/22/2009 09:05 UTC","Tags":"City","Region":"New Hampshire"}