{"Object Flight Path":"Hovering then path","Sighting Duration":"00:20:15","trends":["There have been 8 other sightings in Royal Oak","There were no other sightings in Royal Oak on or around May 19th 1976","This sighting has never been favorited.",""],"Tags":"City","divs":["Sighting DetailsAbout a year out of high school a good friend along with our girl friends where making out in a city park, where as I opened my eyes I saw lights off a tree we where leaning against and I turned to see the extraterrestrial space craft about a city block away and about a block high, motionless no sound and no wind being generated nothing, but an intelligence we felt not of this world, as we have nothing and I don't care what we have revers engineered~ this craft must be thousands of years ahead of any technology we now have! It hung motionless for about ten minutes then tipped down towards a fair that was going on at the time as if to have been attracted buy the lights of the fair rides, It remained that way for about five minutes then slowly straight ed out again, it stayed that way for about five more minutes then began leaving at about twenty mile increments at high speed until it was out of sight! people where climbing on to there garages and houses to get better views the whole time. my friends an I where very exited and ran to my girl friends house to report it to the news, they said they had a flood of calls in on this sighting, soon we saw on the news that the AUTHORITY'S claimed~ it was a plain carrying an advertisement sign. well I must say after that obvious LIE! I LOST MY TRUST IN OUR AUTHORITY`S, It made me so mad that the gull of these few people if you want to call them that! put me on a quest to find out who and what and why this grope feel thy know whats best for use from cradle to the grave and that they are better than the common man, and have lost them self's to these grays and the power that is offered to them by these beings that feed on our fear an violence. but to there dismay they must be unaware of how many people are on to there plans and destructive intentions! for the truth is spreading FAST. and justice will prevail! they claim this cover up is best for the people, but ignorance to the truth is never the best course, they are wepponizing space and pissing off a lot of our galactic family`s, and they all will have to deal with the highest advanced beings soon! so have your fun now because your existence is but a flash in time, and if you read this, you better pray that existence is [not] for an eternity! your Brother STEVEN.B"],"Latitude":"42.49596","Date Submitted":"05/19/1976 05:12 UTC","Log Number":"US-03262009-0021","files":["/var/www/straped/mufon/html2text/16269.html.txt","/var/www/straped/mufon/org/16269.html"],"Summary":"Myself along with three friends and hundreds of others saw a UFO in the seventies.","Source":"MUFON","Case Number":"16269","City":"Royal Oak","Disposition":"Unknown","Region":"Michigan","Longitude":"-83.143518","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.49596,+-83.143518(16269)&iwloc=A&hl=en\"> mufon case (16269) map </A>","Viewing Distance":"101-500 Feet","Date of the Event":"05/19/1976 05:12 UTC","Object Shape":"Disc","Object Features":"Undisclosed","Country":"United States"}