{"Disposition":"Unknown","Log Number":"US-03262009-0017","trends":["There have been no other sightings in Nashville","This sighting has never been favorited."],"Region":"North Carolina","Tags":"City","Object Shape":"Chevron, Triangle","Summary":"Spotted hovering above road.","Object Flight Path":"Straight-line path,Path then hovering","Sighting Duration":"00:10:00","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.974598,+-77.965541(16263)&iwloc=A&hl=en\"> mufon case (16263) map </A>","Weather Factors":"Unknown","Latitude":"35.974598","Country":"United States","Date Submitted":"03/10/2009 11:42 UTC","Source":"MUFON","divs":["Sighting DetailsOn 03-10-09, roughly 11:30-11:40pm, I was driving East on US Route 64. As I approached the first exit for Nashville, (NC), I noticed an object hovering along, as if following, ALT US 64. This object was around 75-100 feet above the ground. I had thought it was maybe a military helicopter, but I began to think differently when I actually noticed the lights. I noticed that it did have 3 visible lights. Two red lights toward what appeared to be the rear, and a bright white light near the front. It was about 200-300 yards from me. I judged the size of the object to be between 40-50 feet wide between all three lights. I knew by then, that this was not a helicopter. The object proceed to hover over US Route 64 in a South-Southeast direction. As I approached the exit, I watched it disappear behind a small grove of trees, then came back into view. It continued to move in the same direction until it stopped and began to hover near a small shopping center. I stopped my truck (Tractor-trailer) on the off ramp and turned off the engine, then got out to observe the object. It made no sound. (Not even a humming or whirring sound.) The lights from the parking lot only slightly illuminated the object. I could barely make out a shape. It did look like a chevron shape, only thicker that made it look almost like a triangular shape. It continued to hover in that spot for about 5-7 minutes, then proceed to move away in the south-southeast direction. I continued to watch the object for another couple of minutes until it moved out of my sight. I had a small digital camera, but in my excitement of watching this object, I never thought to snap a photo. Sincerely, Randall Breason P.S. I have attached a crude drawing of what the object looked like. The lighting that night was rather dim, but through that reflecting parking lot lights I could still make it out. It is the best description I can do."],"Date of the Event":"03/10/2009 11:42 UTC","Longitude":"-77.965541","files":["/var/www/straped/mufon/html2text/16263.html.txt","/var/www/straped/mufon/more/16263_submitter_file1__02-object-description-03-10-09.jpg","/var/www/straped/mufon/org/16263.html"],"Object Features":"None","Case Number":"16263","City":"Nashville"}