{"Viewing Distance":"Unknown","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around September 22nd 2001","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"09/22/2001 08:10 UTC","Log Number":"US-03262009-0022","files":["/var/www/straped/mufon/html2text/16268.html.txt","/var/www/straped/mufon/more/16268_submitter_file1__UFO.JPG","/var/www/straped/mufon/more/16268_submitter_file2__UFO2.JPG","/var/www/straped/mufon/org/16268.html"],"Source":"MUFON","Object Shape":"Unknown","Tags":"City","Longitude":"-77.93926","Region":"North Carolina","divs":["Sighting DetailsLong Description of Sighting Report I remember watching the movie about the kid waking up in the woods after getting to ride in the UFO. He got taken up and got to pilot with a cute little alien. He found his house on the lake cause his brother shot fireworks. I was coming home on e night on my bike. I was gonna cut through the woods. I still remember telling myself not to. I imagined a log laying across the trail. It was a short trail that ended right back on the street. It was supposed to be a little detour. It was I guess in the year 2001. I believe in Angels. So maybe that was it. I didn't see anything. I went on the trail and instead of coming right back off I ended up in another patch of woods half way across campus. There is no way because the trail doesn't cross the street and I never did. It would have taken me a good ten or more minutes to ride that distance. But I entered the trail and ended up on the other side and opposite direction from where I was headed. Which is impossible. I know the streets and I know the places but I don't feel like being a scientific experiment. All I know is that I defied logic. Somehow I ended up in a place that didn't connect with the one I tumbled in. I have gone over and over the area to try to see if maybe I was wrong about it. But I don't think I am. To God Be the Glory 34degree 12'58.51\"N 77degrees 51'55.00\"W Riegel Rd. Was gonna go on this sand trail heading towards Campus and end up on 34 degrees 13'oo.70\"N 77degrees 51'57.52\"W Plyler Drive. Just a short couple minutes. I ended up from Riegel Rd start spot all the way over to 34degrees 13'12.39\"N 77degrees 52'04.56\"W Walton Drive. I never crossed Plyler or L Street. I stayed in the woods and ended up leaving woods but not the same ones I entered. I never really thought about it. That night I was unsure of how I ended up so far off the path. STRANGE"],"Sighting Duration":"Undisclosed","Date of the Event":"09/22/2001 08:10 UTC","Disposition":"Hoax","Country":"United States","Object Features":"Undisclosed","Case Number":"16268","Latitude":"34.230726","City":"Wilmington","map":"<A HREF = \"http://maps.google.com/maps?q=34.230726,+-77.93926(16268)&iwloc=A&hl=en\"> mufon case (16268) map </A>","Summary":"Invisible"}