{"trends":["There have been 61 other sightings in Kokomo","There were 3 other sightings in Kokomo on or around March 23rd 2009","This sighting has never been favorited.",""],"Longitude":"-86.128143","Summary":"I saw lights coming on and off in sequence in north end of Kokomo.","divs":["Sighting DetailsWalking down Appersonway heading south I stop at the intersection of Fischer street and as I looked to the west I saw orange lights coming on in sequence about 4 or 5 degrees apart. The lights turned off in sequence in the matter of 5 seconds. I took these to be flares because I have seen flares before in that area. This event occurred about 15 degrees above the horizon and appeared to be in the order of 1 to 3 miles away. After those lights went out, 10 to 12 lights appeared just to the north of the area as the first lights. They appeared to be spaced approximately a fingernails length apart. They looked like a string of beads, in a circular pattern going around an object. They were orange. I noticed the lights were on all at the same time and they went out all at the same time not in sequence which was different from the earlier lights I observed. I took that the two events could have been connected because they were in the same time and area. I thought the second lights were not flares because the lights were not spaced apart only a small degree compared to the lights before which I believe could have been flares. Also, because the lights all shut out together at the same time made them appear suspicious."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.488137,+-86.128143(16264)&iwloc=A&hl=en\"> mufon case (16264) map </A>","Object Shape":"Circle","Disposition":"Unknown","Date Submitted":"03/23/2009 09:00 UTC","Log Number":"US-03262009-0018","Latitude":"40.488137","City":"Kokomo","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/16264.html.txt","/var/www/straped/mufon/more/16264_submitter_file1__MOAMap.JPG","/var/www/straped/mufon/org/16264.html"],"Region":"Indiana","Object Flight Path":"Stationary","Date of the Event":"03/23/2009 09:00 UTC","Case Number":"16264","Weather Factors":"None"}