{"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Longitude":"-81.259552","City":"Louisville","Summary":"Triangle sighting over neighborhood.","Log Number":"US-03272009-0001","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Date of the Event":"04/03/1999 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"04/03/1999 12:00 UTC","Viewing Distance":"Unknown","Region":"Ohio","Latitude":"40.837281","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.837281,+-81.259552(16272)&iwloc=A&hl=en\"> mufon case (16272) map </A>","divs":["Sighting DetailsThe sighting took place in the spring of 1999. I happened to be 11 years old at the time but remember the event vividly. I was riding in the car with my mother and younger sister on our way to school. We came up to the stop sign at the end of the road facing east. The sun was coming up and you could easily see a star about 45 degrees in the sky. The star grabbed my attention because it started pulsating and getting brighter. I don't believe it's a star at all actually, it's in the sky most times of the year and day and doesn't flicker like other stars. Anyway, we all sat there and watched the star for a couple of minutes. Very suddenly, another bright star-like object seemed to drop down very quickly from the original star. It circled the star a few times and then seemingly became stationary. The object came closer and closer, very quickly. It stopped and hovered above a few houses right in front of us. It was about 300ft long (estimating) on each of its three sides. We all had a very long time to take a look at it because it didn't move for almost 15 minutes. Three glowing circles were on the underside. All three changed color from blue to green to red and orange. It made absolutely no sound at all, and it didn't move. I was very scared, and couldn't believe what I was looking at. Then all of a sudden it accelerated west and out of sight in a split second. I believe it came out of or from that star. It's always there and wonder if its the International Space Station. This memory has been disturbing me for 10 years."],"files":["/var/www/straped/mufon/html2text/16272.html.txt","/var/www/straped/mufon/org/16272.html"],"Source":"MUFON","Case Number":"16272","Tags":"City","trends":["There have been 2 other sightings in Louisville","There were no other sightings in Louisville on or around April 3rd 1999"]}