{"Log Number":"US-03262009-0023","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Disposition":"Insufficient Data","Longitude":"-97.471245","Sighting Duration":"Undisclosed","Date Submitted":"03/26/2009 01:00 UTC","Date of the Event":"03/26/2009 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.657372,+-97.471245(16271)&iwloc=A&hl=en\"> mufon case (16271) map </A>","Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsMy brother and I stepped out back for a small cigar and cigarette respectively at about 1am in the morning (we had been up late playing some video games). I saw a light that looked like no other star I've see before (I own a telescope) and after watching it for a few moments while smoking the cigar I could actually tell it was moving. At this time I still thought it was nothing (being a huge skeptic and thinking UFOs are BS) but after continually observing it I was able to logically rule out anything I thought it could be. It was at this time I told my brother about it. I almost jokingly, \"I think this might be a UFO here\" (still just not really believing what I was seeing. It was bright with colors rotating throughout it (90% sure these colors were just red, green, blue but there could have been subtleties I didn't completely perceive). There were strobing lights coming from it at times, radiating out at least 5 times the width of the object. It moved but not very fast, and it appeared to move back and forth a little but mostly in a single direction. I tried to get some video but my handheld hd camera wouldn't pick it up in such light conditions. My brother got his binoculars out of his truck and we observed it through those. You could then clearly see it was almost a chrome light, and the colors made it almost look like a pearl glowing very brightly. You could see the strobes very clearly with the binoculars. After observing it for a while we went back in due to how cold it was but would step out and look at it every few minutes. We almost convinced ourselves it was a star but then on the next trip out it was gone. I've always thought UFOs were just people seeing planes, etc but this was unreal. Still I think at the most it's just some advanced military craft."],"trends":["There have been 16 other sightings in Edmond","There were no other sightings in Edmond on or around March 26th 2009"],"Region":"Oklahoma","Case Number":"16271","Viewing Distance":"Over One Mile","Latitude":"35.657372","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/16271.html.txt","/var/www/straped/mufon/org/16271.html"],"Object Shape":"Flash, Sphere, Star-like","Object Features":"Undisclosed","Summary":"Bright multi-colored (green, red, blue, white) orb with colors rotating.","City":"Edmond"}