{"Object Shape":"Sphere","Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There have been 49 other sightings in Huntington Beach","There were no other sightings in Huntington Beach on or around February 20th 1997"],"Disposition":"Unknown","Region":"California","Date Submitted":"02/20/1997 04:10 UTC","files":["/var/www/straped/mufon/html2text/16287.html.txt","/var/www/straped/mufon/org/16287.html"],"Object Features":"Other","Longitude":"-117.993616","map":"<A HREF = \"http://maps.google.com/maps?q=33.665077,+-117.993616(16287)&iwloc=A&hl=en\"> mufon case (16287) map </A>","Date of the Event":"02/20/1997 04:10 UTC","Latitude":"33.665077","Tags":"City","Case Number":"16287","divs":["sighting detailsmy buddy and i just finished up a surf session, we were hosing the sand off of us outside my house ( i lived across the street from the beach) when we heard the huntington beach police helicopter coming overhead and it was rather unusual in that it was quite loud as it was very low maybe 500 ft. and to our surprise it was in hot pursuit of a small,dull metallic object. we both were employed at boeing long beach and are quite familiar with aircraft. my yearly physical confirmed my good eyesight as 20\\17 at the time. we went through a checklist right away and confirmed no beacons,wings,or propulsion units of any kind, however we could easily see the details of the helicopter. we also could not detect any sound at all from the object. it was about 10 ft. in diameter or so and a bronze color and somewhat weathered. it performed some zig-zag moves that were very impressive! the 'copter just couldn't keep up with it at all. it gave me the willys as it flew around the electrical plant a few times then shot off inland and out of sight! this all lasted about 20 seconds so no chance to take a picture. i thought about running inside and getting my camcorder but i sensed it would be over shortly and it was. i really wish i could have videoed it because it would have been proof that something is going on. i did yell for my girlfriend to come out but she didn't. her loss. i got a really strange feeling like the hairs standing up on the back of your neck thing. whatever was occupying the sphere had to be tiny or maybe it was remote controlled? some time later(years actually)i happened to come across a police pilot who was relatively new and i asked him about that incident and to my surprise he said \" oh yeah i heard about that- it was picked up on costa mesa radar.\" (john wayne airport?).he then seemed to realize that maybe he wasn't supposed to talk about that and excused himself! anyway, that's my only ufo story that i had a witness to and was solid. i've seen some other things but were too vague like distant lights etc. but just weren't as close and visible as this. i was a skeptic but now believe something is going on. i really burn to know who they are and what they want. it is my belief that they are super intelligent and are not hostile but why are we chasing them? are they just playing with us? i really believe that something is going to happen soon, i just hope it is a good thing!"],"Weather Factors":"Unknown","Summary":"Sphere chased by police helicopter near Edison electrical facility.","Country":"United States","Sighting Duration":"00:00:20","City":"Huntington Beach","Object Flight Path":"Path with directional change","Log Number":"US-03282009-0001"}