{"Latitude":"33.722647","Disposition":"IFO","Log Number":"US-03272009-0012","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Other","Summary":"Pulsating pale white orb-like object hovered then brightened, did some rapid crazy figure eight manuevers. Then hovered again only to drift away slowly towards east.","Longitude":"-116.207812","Region":"California","Date of the Event":"03/25/2009 09:45 UTC","files":["/var/www/straped/mufon/html2text/16283.html.txt","/var/www/straped/mufon/org/16283.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.722647,+-116.207812(16283)&iwloc=A&hl=en\"> mufon case (16283) map </A>","Object Shape":"Sphere","Viewing Distance":"Over One Mile","Object Features":"None","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"None","Case Number":"16283","divs":["Sighting Details My husband and I were having a cigarette out on our patio at about 9:45 pm in Indio, near Palm Springs, California on March 25, 2009. I was looking at the stars, as I always do, when I saw a wierd pulsating orb-like light in the eastern sky, out towards the Salton Sea. I watched it for awhile before asking my husband to take a look. We both observed a pulsating pale-white light just hovering. Suddenly, the object brightened, did a couple of rapid crazy figure eight manuevers which made us wonder what the hell it was. It then pulsated faintly and slowly drifted off to the east. My husband went in to go to bed and I observed the faint pulsating light for another ten minutes or so and then it was gone. My husband and I were baffled. We tried to logically explain what we had just seen, but couldn't. We ruled out a star, planet, meteor, airplane, helicopter, blimp, spotlight, and laser. It made us a bit uncomfortable not being able to identify what we had seen. We would like to know if anyone else saw it."],"City":"Indio","Country":"United States","trends":["There have been 9 other sightings in Indio","There were no other sightings in Indio on or around March 25th 2009"],"Date Submitted":"03/25/2009 09:45 UTC"}