{"Country":"United States","files":["/var/www/straped/mufon/html2text/16298.html.txt","/var/www/straped/mufon/org/16298.html"],"Log Number":"US-03282009-0012","Object Features":"Unknown","Sighting Duration":"00:00:05","Weather Factors":"None","Date of the Event":"03/29/2009 06:00 UTC","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around March 29th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.986135,+-93.260406(16298)&iwloc=A&hl=en\"> mufon case (16298) map </A>","City":"Minneapolis","Region":"Minnesota","Object Flight Path":"Unknown","Object Shape":"Fireball, Flash, Unknown","Summary":"It looked like it could have been meteorite debris, but since I don't know what it was I thought to report it here.","Disposition":"Insufficient Data","Longitude":"-93.260406","Tags":"City","Latitude":"44.986135","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16298","divs":["sighting detailsmany mornings i wake up around 4:00 am and if i can't fall back to sleep i love to look out of my balcony window if it is a clear night. i just take a chair and sit in front of my balcony window and look into the clear night sky. i have always been fascinated with the stars and love to just look into the early morning sky in hopes of catching a glimpse of a shooting star. this happend somewhere between 5:45 am to 6:30 am over downtown minneapolis. after sitting and looking into the sky i noticed a beautifu v formation of birds, these birds were unlike any other that i have seen they were high up and i told my daughter that they seemed to glow against the dark sky. they weren't like i normally see 7 or 8 geese in a v formation, this was like they were maybe 10 to 15 birds on each side and flying in a tight v formation, it was so beautiful, it was soon after that when i shifted my gaze to the right and saw this flash of fire\\light.it looked so different from any other meteor, comet or shooting star that i had ever seen. it maybe looked similar to a shooting star but the ones that i have always seen seem to shoot across the sky and look far away, not straight down and close by. this one looked like it happened just above this bldg. which was the united state court house, which is about three blocks away from where i live. it didn't have any beginning to it that i saw. it didn't land, it was a long flash of light just above the bldg. i felt that it was so close by like if someone shot a flare into the sky or like a firework went off only in a straight line of light. it wasn't a beam of light it was more fire like. i was amazed at how close it looked to my condo and i just happened to be looking in that direction at the time. i kept thinking of what it might be for most of the day, so i decided to go out and walk around that area. they are doing lots of road construction work around are area. i didn't see anything that caught my attention except for one large rock that looked a little different from some of the surrounding rocks but didn't think it had anything to do with what i saw. hope this is information might prove helpful in some way."],"Date Submitted":"03/29/2009 06:00 UTC"}