{"Region":"Illinois","divs":["Sighting DetailsI was testing my camera in combination with 15x binoculars fitted with solar filters, and decided to photograph the sun , even though there was considerable overcast. I took a number of shots of the solar disk. When I downloaded the images, one of them exhibited an oblong white spot. I assumed at first that I was seeing some sort of optical artifact or aberration , but none of the other photos, all taken within minutes of this one, showed anything unusual. Upon closer inspection, I realized that the white spot had dimensionality. The upper portion of the image is quite light. There must be significance to this brightness; the solar filters I was using reduce the incoming sun light by a large factor, ten thousand times if I am not mistaken ! Then, there is the underside of the image to consider. To me , it is obviously in shadow, and it is also apparent that this object is wingless. I am still in awe of the chances that I happened to be imaging the sun at what looks to be the very time that this craft was in position. This sighting took place from my front yard in Oak Forest, Illinois."],"Date Submitted":"03/20/2009 12:00 UTC","Latitude":"40.635815","Object Flight Path":"Unknown","Object Features":"Unknown","Log Number":"US-03282009-0013","Summary":"Captured UFO in front of sun using optics protected with solar filters.","files":["/var/www/straped/mufon/html2text/16299.html.txt","/var/www/straped/mufon/more/16299_submitter_file1__solarshot028.jpg","/var/www/straped/mufon/org/16299.html"],"Source":"MUFON","Sighting Duration":"00:02:00","Disposition":"Unresolved","City":"Undisclosed","Tags":"City","Date of the Event":"03/20/2009 12:00 UTC","Country":"United States","Object Shape":"Oval, Sphere","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.635815,+-89.394588(16299)&iwloc=A&hl=en\"> mufon case (16299) map </A>","Viewing Distance":"Unknown","Case Number":"16299","Longitude":"-89.394588","trends":[""]}