{"map":"<A HREF = \"http://maps.google.com/maps?q=40.276983,+-85.841925(16293)&iwloc=A&hl=en\"> mufon case (16293) map </A>","Weather Factors":"None","City":"Elwood","Date Submitted":"03/15/2009 10:15 UTC","Country":"United States","trends":["There have been no other sightings in Elwood","This sighting has never been favorited."],"Latitude":"40.276983","Object Shape":"Unknown","Case Number":"16293","Sighting Duration":"Undisclosed","Summary":"It appeared to be very large (two to three times the length of a bus) and low flying.","Longitude":"-85.841925","Region":"Indiana","files":["/var/www/straped/mufon/html2text/16293.html.txt","/var/www/straped/mufon/more/16293_submitter_file1__DSC01424.JPG","/var/www/straped/mufon/org/16293.html"],"Tags":"City","Object Flight Path":"Hovering then path,Straight-line path","Date of the Event":"03/15/2009 10:15 UTC","Source":"MUFON","Disposition":"Unknown","divs":["Sighting DetailsI put my work uniforms in the trunk of my car on friday and I needed a uniform for work in the morning so I went to my car to get one. I was walking back into my house when I noticed the strobing lights. I wouldn't have noticed it if it wasn't for the number of lights and their relative brightness to anything else I usually see in the sky. I first thought that it might be a helicopter because I live three blocks from a hospital with a helipad and because it seemed to be fairly still in the sky. I watched for a minute or so listening for the sound of the helicopter (it's is very obvious when one flies over because it is loud). There wasn't even the faint sound of a plane - that I could tell. It started to move away to the south-by-southeast. It was maybe three times the height of an oak tree over the tree line. It seemed to elevate slightly as it went away. I lost sight of it when it went behind the tree line. I can't say for certain that it was anything unusual, just something I can't explain. Their were maybe 3 - 5 lights that were mirrored along two lines that were angled up to a point where there was one bright slow strobing light ( the angle was probably 5 degrees. The one bright light at the meeting point of the lights that caught my eye was a whitish light. The ones going slightly down and away were yellowish (fast strobing) and the ones on the ends were deep red (not strobing). The lights never seemed to changes position relative to one another: so, I thought it might be one fixed object. I was completely sober and awake when I witnessed the lights. I didn't tell my wife until three days agao - I thought she'd think I lost my mind, she was actually a little disappointed that I didn't come get her, I told her I didn't want to miss anything. I don't want to be contacted and I'd like to remain anonymous. Thank you. You can email me if you need any other information - although I think I've given you everything I have. If I could pinpoint it's exact location when I first saw the lights it would be at South \"B\" street and 11th Street. The photo is from exactly where i was standing. Although it was actually in the evening and I opened the photo with paint so I could give a rendering of where the lights were and the relative size. I didn't see an object, only lights. The picture isn't depicting and actual event of any sort it is for reference only."],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-03282009-0007"}