{"Source":"MUFON","Tags":"City","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around October 16th 2008","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Country":"United States","Date of the Event":"10/16/2008 02:18 UTC","divs":["Sighting DetailsI was coming home from work and arrived home to see an orange orb the size of a small shed it looked as if something was inside, it moving around,it was glowing and I was astonished to actually see it so close I shut the jeep down and sat and observed it seemed to hover for such along time between the two tree tops..then it moved up and away across the street easterly low flying...I went into the house where my son was sleeping on the couch in front of a television and he wanted me to stay up to finsh the movie , he is 25 and also works nights but was on days off at the time I had finally went to bed about 4:30 am and just about dusk my son awoke me and said his arm was burning and asked me to look at it...he had 3 marks like pods that were raised in the shape of a triangle during the course of the week it hurt and it was hard to prevent him from scratching it till it bled I kept telling him to leave it alone it finally disappeared, I had to calm him down a little and tell him this is common as I had one and sightings too in the course of the next few months my daughter which had the same triangle on her during her pregnancy in ft. Morgan, CO. in Nov.3,2005 this was the birth of my grandson, and Nov.14th 2008 he had a dark triangle on his hand... and I pointed this out to his mom...since then I had witnessed the orange orb following me home from Ft. collins, Co. about 1:45 am when I leave the Redman Dr. to hwy 14 west to Timberline south to hwy392 west to hwy 287south to get home they seem to follow at a distance sometimes not always...This is ok with me as I have had contact with triangular craft and have had amissing fetus in 1991 with at least two beings in my house in the Ft. Moran Colorado area...I am from Trumbull, Connecticut and have notice alot of reports in that area too. thanks for letting me report this I am truthful with this report...for some reason I draw the marks and implant sights all thru the years and the dates and the drawings ,but have always distroyed them...I didn't know whom to give them too"],"City":"Fort Collins","Disposition":"Unknown","Longitude":"-105.079463","Weather Factors":"Unknown","Summary":"Orange orb large over treeline between two trees in front of driveway.","Region":"Colorado","Object Features":"Unknown","Sighting Duration":"Undisclosed","Case Number":"16297","Viewing Distance":"21-100 Feet","Latitude":"40.58986","Log Number":"US-03282009-0011","Date Submitted":"10/16/2008 02:18 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.58986,+-105.079463(16297)&iwloc=A&hl=en\"> mufon case (16297) map </A>","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/16297.html.txt","/var/www/straped/mufon/more/16297_submitter_file10__MUFON_16297_WitnessDocE.jpg","/var/www/straped/mufon/more/16297_submitter_file1__MUFON_16297WitnessDocA_redacted.jpg","/var/www/straped/mufon/more/16297_submitter_file2__MUFON_16297WitnessDocB_redacted.jpg","/var/www/straped/mufon/more/16297_submitter_file3__MUFON_16297WitnessDocC_redacted.jpg","/var/www/straped/mufon/more/16297_submitter_file4__MUFON_16297WitnessDocD_redacted.jpg","/var/www/straped/mufon/more/16297_submitter_file5__MUFON_16297WitnessDocE_redacted.jpg","/var/www/straped/mufon/org/16297.html"]}