{"Viewing Distance":"101-500 Feet","Summary":"Four bright revolving lights in the sky remained stationary and then \"blinked\" out.","files":["/var/www/straped/mufon/html2text/16296.html.txt","/var/www/straped/mufon/org/16296.html"],"Country":"United States","Latitude":"40.799011","Weather Factors":"None, Does Not Apply","trends":["There has been one other sighting in Tamaqua","There was one other sighting in Tamaqua on or around March 25th 2009"],"Region":"Pennsylvania","Disposition":"IFO","Case Number":"16296","Object Features":"None","Sighting Duration":"00:18:00","Date Submitted":"03/25/2009 09:15 UTC","City":"Tamaqua","divs":["Sighting DetailsWitness Jack Burke (hereafter Burke) provides: \"My wife and daughter were yelling that I need to go out and see this. I had just got in bed. I ran outside and was so amazed by what I saw I came back in the house, got dressed, and went out on the back deck. There were four (4) very bright lights in a stationary position. They started to spin in a circular motion. One light went out, a third started to flicker and went out. I called the next-door neighbor to make sure someone else from another household saw what we were seeing. The neighbor saw the two (2) lights and then they both went out. I'm not really a believer of this stuff, but this really freaked me out. The area it was in is a state park with a large lake; very woody and quiet. The other freaky thing is...we could see the lights and the motion of the lights but we took pictures and you could see the lights when I took the picture but nothing is on the memory stick. Same with the video camera. We could see the lights through the camera but the video is black.\""],"Tags":"City","Longitude":"-75.960601","Log Number":"US-03282009-0010","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=40.799011,+-75.960601(16296)&iwloc=A&hl=en\"> mufon case (16296) map </A>","Date of the Event":"03/25/2009 09:15 UTC","Object Flight Path":"Stationary","Source":"MUFON"}