{"files":["/var/www/straped/mufon/html2text/16292.html.txt","/var/www/straped/mufon/more/16292_submitter_file1__P2160076.JPG","/var/www/straped/mufon/org/16292.html"],"City":"Kingston","divs":["Sighting DetailsThere is nothing really to decribe as the object only appeared on jpeg image on download. We saw nothing at time photograph taken. Walking for exercise up a city road to the north of Kingston, Jamaica, at 6.10 am or nearly that time, we stopped to take phtographs of the city behind us as the site was about 500 ft higher than the city. We took several and then went home after the exercise walk. We walk there very couple of days. On downloading the pix into a pc, we saw what appeared to be a small disc-shaped object in the upper right hand quadrant of one of the five images we took. We cannot identify the object. It appears to be about one half mile or so away from the camera and over some trees. It is exactly in front of the Olympus FE 115 digital camera. Like most small consumer digitals this has a small infra-red focusser beam which would have been pointing directly at the object. I would appreciate some information on what your team thinks this object might be. Thank you. Dr. Karl Aiken."],"Object Features":"None","Source":"MUFON","Case Number":"16292","Tags":"City","Weather Factors":"None","Longitude":"-75.887964","Latitude":"41.266078","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","Object Flight Path":"Unknown","Summary":"Object found only on download into computer.","map":"<A HREF = \"http://maps.google.com/maps?q=41.266078,+-75.887964(16292)&iwloc=A&hl=en\"> mufon case (16292) map </A>","trends":["There have been 4 other sightings in Kingston","There were no other sightings in Kingston on or around March 26th 2009","This sighting has never been favorited.",""],"Country":"United States","Log Number":"JM-03282009-0006","Sighting Duration":"00:00:05","Date Submitted":"03/26/2009 06:10 UTC","Disposition":"Unresolved","Object Shape":"Disc","Date of the Event":"03/26/2009 06:10 UTC"}