{"Tags":"City","Weather Factors":"Unknown","Latitude":"40.090264","Country":"United States","Case Number":"16301","divs":["Sighting DetailsIt was aprox. 9-10pm. I was looking outside while i was on my laptop, and saw an airliner with usual path, then a lot higher was this other blinking slower and moving slower than an airplane, object.I grabbed my bincoluars,and watched it move east from west and im not sure if it was rotating- as i had thought, but i was sure it was a rounded object with 3 lights, 2 blinking 1 red, 1 green. As i was trying to follow it, it was zipping back and forth so quick that if i had not propped the binoculars (as i moved to the other bigger window to follow it at this point) it would had probably not looked like it was zipping back and forth to anyone else. Anyways, i wasn't going to report it because i see these government and what not operated objects very often.I just wanted to bring some relief to the other person in OH wherever they live that i saw something similar as well.My case worker is Connie McNichols. I'm not concerned if i hear from mufon or not, like i said, i see these things so often it gets annoying.If anyone else from OH see's these things, and wants to seriously talk, my email is jenbobsquarepants83@yahoo.com."],"Log Number":"US-03292009-0001","Viewing Distance":"Unknown","City":"New Albany","map":"<A HREF = \"http://maps.google.com/maps?q=40.090264,+-82.801956(16301)&iwloc=A&hl=en\"> mufon case (16301) map </A>","Date Submitted":"03/28/2009 09:00 UTC","Summary":"Saw a disc object flying over tree tops, rotating around area, not in same path as airplane, had blinking lights, moving very slow and erratic.Watched with binoculars-(10x50 288 ft. at 1000 yds,96m at 1000m).Only reporting because I'm sure of what I saw.","trends":["There have been 11 other sightings in New Albany","There were no other sightings in New Albany on or around March 28th 2009"],"Object Flight Path":"Undisclosed","Object Shape":"Disc","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16301.html.txt","/var/www/straped/mufon/org/16301.html"],"Longitude":"-82.801956","Date of the Event":"03/28/2009 09:00 UTC","Object Features":"Undisclosed","Region":"Ohio","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data"}