{"map":"<A HREF = \"http://maps.google.com/maps?q=39.521108,+-84.393816(16300)&iwloc=A&hl=en\"> mufon case (16300) map </A>","Log Number":"US-03282009-0014","Sighting Duration":"Undisclosed","Case Number":"16300","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around March 28th 2009"],"Disposition":"Insufficient Data","Object Features":"Unknown","Region":"Ohio","Weather Factors":"None","Tags":"City","Date of the Event":"03/28/2009 03:00 UTC","Source":"MUFON","Longitude":"-84.393816","City":"Middletown","files":["/var/www/straped/mufon/html2text/16300.html.txt","/var/www/straped/mufon/org/16300.html"],"Date Submitted":"03/28/2009 03:00 UTC","Country":"United States","divs":["Sighting Details At around 3am I happened to look out my second story window and saw unusual lights in the sky to the east of my location. At first I thought it was a microwave tower that stands about a mile away, but then I noticed that the light on the tower was to the right of the lights I was seeing. The tower light is white and blinks around 40 times per minute. The lights I saw seemed to be rotating around on a horizontal axis and were red and green in color. They were similar to 'chaser lights' and were blinking at about 120 times per minute. At first I believed that the lighted object was hovering just above I-75 which runs north and south about a mile away. However, as I watched, the object slowly descended behind the hills some distance past the interstate. I did not see the object again. Moments later, a small plane passed overhead from west to east over my home and in the direction of where I had seen the object. I then watched the plane until it passed out of sight and saw nothing more. Later in the day, I was able to eliminate other factors. The light from the microwave tower is clearly farther south than the lights I saw and it has only one white light. From the back of my home it is possible to sometimes see headlights on the Interstate, but the object I saw was clearly high in the sky. This was not an airplane. This object hovered for a minute or more before descending. As best as I can tell, the object made no sound as I had my window open and could clearly hear cars on the highway but nothing else. I don't mind saying that this has me a bit rattled. I know people who have seen unidentified objects and I do believe they exist, but this was the first time I have witnessed one myself. I considered reporting this to the local authorities, but decided to wait and see if there were any other reports that made the papers or local news. Having seen and heard nothing, my boyfriend suggested MUFON as he is familiar with the group and believes that my report will be taken seriously. Thank you."],"Viewing Distance":"Over One Mile","Object Shape":"Disc","Latitude":"39.521108","Summary":"I witnessed what appeared to be a disc shaped craft with lights rotating around the perimeter.","Object Flight Path":"Hovering then path"}