{"Longitude":"-77.960517","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"03/29/2009 09:30 UTC","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"16313","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/16313.html.txt","/var/www/straped/mufon/org/16313.html"],"Object Shape":"Fireball, Sphere","City":"Martinsburg","Source":"MUFON","trends":["There have been 9 other sightings in Martinsburg","There were no other sightings in Martinsburg on or around March 29th 2009","This sighting has never been favorited.",""],"Region":"West Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=39.46476,+-77.960517(16313)&iwloc=A&hl=en\"> mufon case (16313) map </A>","Disposition":"IFO","Viewing Distance":"Unknown","Latitude":"39.46476","divs":["sighting detailsworking nightshift at the local hospital, stepped outside with a coworker for a cigarette and when returning to the building noted what loked like a \"falling star\" but brilliant - it illuminated the parking lot and left a blue\\green trail behind it. the sphere itself was approximately the size of a small car and brilliant white in color with a blue \"aura\" around it. it flew extremely close to the ground with absolutely no sound that we could hear. it seemed to, for lack of a better description, suddenly burst in speed leaving a ring of sparks and appeared to accelerate before disappearing out of view. once again, no sounds - not a boom, not a crash, nothing. like it just vanished. i do not believe it was a metorite, and if it was, it was surely larger than any i've ever witnessed in my life - and i've seen plenty. (leonids, for example) and it appeared to literally fly, not fall. as an amateur astronomer, i'm accustomed to seeing things like the space station, satellites, comets, falling meteorites and the like - this was something distinctly different in both appearance and behavior."],"Tags":"City","Summary":"Brilliant fireball at extremely high speed.","Log Number":"US-03302009-0003","Date of the Event":"03/29/2009 09:30 UTC"}