{"divs":["Sighting DetailsI was visiting a friend when one of her sons shouted that he could see a ufo above where they lived (Hillmoor Street, Pleasley Nottinghamshire), Me and my friend looked out of the window and we clearly saw an object bigger than an air balloon and lit up like a christmas tree and making a woo woo noise as it was spinning round, We decided to follow the object and we could see it was getting lower and starting to land in a school playing field so we kept following the object as we saw it landing on the field, (we had to cross farmland to get to the school field and it was seperated by a load of trees) about 20 feet from the trees we could see it had landed, So we carried on to where the trees were and we were puzzled because when we got to the trees it had disapeared (it had only taken us seconds to get to the trees), So we made our way back to my friends and got asked if we had seen anything and why we had been gone for about an hour when it should have only taken 30 minutes? I dont know what happened but i would like to find out as not long after i started getting lumps on my skin on my neck which have never been explained, It has taken me a lot of years to pluck up the courage to report this as i think we may have been abducted and about 4 of us witnessed this object. I would like this to be investigated further under hypnosis to find out what happened in that missing time."],"Country":"United States","Viewing Distance":"21-100 Feet","Longitude":"-82.509527","Source":"MUFON","Tags":"City","Object Flight Path":"Hovering then path","Region":"Ohio","Log Number":"GB-03302009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=40.76288,+-82.509527(16316)&iwloc=A&hl=en\"> mufon case (16316) map </A>","Date of the Event":"11/30/1995 12:00 UTC","Date Submitted":"11/30/1995 12:00 UTC","files":["/var/www/straped/mufon/html2text/16316.html.txt","/var/www/straped/mufon/org/16316.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Saw UFO land then disappear.","Case Number":"16316","Object Shape":"Disc","Latitude":"40.76288","City":"Mansfield","trends":["There have been 14 other sightings in Mansfield","There were no other sightings in Mansfield on or around November 30th 1995"],"Object Features":"Unknown","Disposition":"Unresolved"}