{"Source":"MUFON","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Flight Path":"Path then hovering","Country":"United States","Object Shape":"Circle","Case Number":"16312","map":"<A HREF = \"http://maps.google.com/maps?q=41.883454,+-87.623528(16312)&iwloc=A&hl=en\"> mufon case (16312) map </A>","Longitude":"-87.623528","Date of the Event":"03/29/2009 11:30 UTC","files":["/var/www/straped/mufon/html2text/16312.html.txt","/var/www/straped/mufon/org/16312.html"],"Latitude":"41.883454","City":"Chicago","Object Features":"Undisclosed","Date Submitted":"03/29/2009 11:30 UTC","Weather Factors":"Unknown","Log Number":"US-03302009-0002","divs":["Sighting DetailsMy son and I were driving home from a friend's house. At around 11:30 P.M. we noticed a bright circular light in the western sky. It had a red pulsating component to it. It was not moving when we first saw it. The red light was what intrigued me. We continued watching it and even drove to a location where we could see it beter and parked for a while. It was in the western sky high above the tree tops in the far distance. I used a tree as a guage to judge its movements but it only moved a tiny bit and stayed at the same level in the sky for a long time (20-30 minutes). Then we drove north and it appeared to move north. We drove the equivalent of two blocks (we were in an unincorporated area)and it clearly had moved because we could see it from the same angle out of the car window (in other words, we didn't have to look back. It was still at the same vantage point). I thought it was a helicopter and that it was hovering over the Thornton Quarry for some reason. If I had to guess where it was in relation to Lansing (our location) I would say it was at the quarry or just west of it. I heard no sound and wondered why a helicopter would be there at that time of night. There were also several planes that flew past so I could compare the lights and flight movements of the planes with this light. What we were looking at was clearly not a plane. We drove home (another block or two) and I watched it for a while from the parking lot, then I got out of my car and watched it for a few minutes longer. My son did not stay outside with me. I did not feel scared. I thought it was odd that the only time it appeared to move sideways (south to north) was when we drove north. I thought it might be aware of me observing it. I wish it would have flown closer so I could get a better look but it went farther west because it got smaller and was not as bright. It still stayed in the same location, though...same vantage point, only farther away. The object was getting harder to see and it was cold outside so I went inside. When I got in the time was 12:14 A.M. so I watched it for almost 45 minutes."],"Region":"Illinois","Tags":"City","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around March 29th 2009"],"Sighting Duration":"00:45:00","Summary":"Circular bright star-like form with red pulsating light stationary at times, periodically moving slowly."}