{"Sighting Duration":"Undisclosed","Longitude":"-85.761583","Viewing Distance":"21-100 Feet","Object Features":"Patterned Surface","divs":["Sighting DetailsI have held this in for some time now. I awoke one night I believe to be around june or july of 2004. For some reason I don't know why but I looked out the blinds of my window. I pushed 4 of the blinds down with my fingers. This was a 2nd floor apartment I was living in. What I saw I could not have mistaken for anything else. Just floating about 200' above a tree line by a housing addition across the street about 50 yards away was a dull greenish blue orb. It appeared to be metal or something similar to a stainless steel textured material. This floating orb was about the size of a two story house. A perfect circle. The orb was not moving it was just floating there with no noise. The orb had a lighted gold ring around itself with a single row of round lights evenly spaced out in orientation which did not have physical contact with the orb itself. The ring was 5 to 6 feet from top to bottom and spun in a clock wise position centered around the orb. The rotation was slow enough that I could make out the round lights. I can remember being in awe of what I was seeing and studying it. It was very hard to take my eyes off of the orb. I can remember thinking I have to go wake up my roommate. The point in time which I thought of waking my roommate up a very bright white light emerged from one of the round lights. It was not as though someone had shinned a light at me. It was almost as though this light was slowly pulsating at me foot by foot. It was like there was breaks in it and I don't mean like someone was turning off and on a light. It was almost as if it would stall and then appear 2 feet in front of itself. The light hit my eyes and I was blinded for 3 seconds or so. At this point I can remember trying to look at the orb for what it was going to next but I also felt afraid as though I had no control. I was panicked. It was very helpless feeling. When my vision was starting to auto focus on the craft again another light was coming at me. This one hit quicker. This light hit my eyes and I was blinded even longer then the first. Within 5 seconds I was auto focusing again by then light was already coming again. At this point I blacked out and woke up the next morning. There is not a day that goes by that I don't think of this and replay it in my mind. I felt as though I was enlightend and stripped of some thing at the same time. It was as real as typing this message right now. I feel very different about UFO's after this. Whether it was Alien or man made. Although I don't think man has this technology yet and if he does why is he making a pit stop in Greenfield Indiana to float above some trees. I can draw a pic of this no problem. It is still that fresh in my memory 5 years later."],"Date of the Event":"06/18/2004 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.786743,+-85.761583(16329)&iwloc=A&hl=en\"> mufon case (16329) map </A>","Tags":"City","Source":"MUFON","Date Submitted":"06/18/2004 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Region":"Indiana","City":"Greenfield","Disposition":"Insufficient Data","Log Number":"US-03302009-0019","trends":["There have been 7 other sightings in Greenfield","There were no other sightings in Greenfield on or around June 18th 2004","This sighting has never been favorited.",""],"Summary":"Globe shape object emits pule like light. I was less the 50 yards aways and object was maybe 200 feet off the ground. The globe was as big or bigger then a 2 story house.","Object Shape":"Circle, Sphere","files":["/var/www/straped/mufon/html2text/16329.html.txt","/var/www/straped/mufon/more/16329_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/16329.html"],"Latitude":"39.786743","Object Flight Path":"Stationary","Case Number":"16329"}