{"Latitude":"36.862126","divs":["Sighting DetailsI saw a flash of light so I looked out of my back window that gave me an excellent view of a huge white blue sphere of light that flashed and shot backwards away from my area very fast. It again flashed and I saw a smaller sphere move from it, then shortly after was a loud kind of percussion boom, this all happened very fast. I went outside to my back deck and looked to see what was going to happen next. I really felt I was seeing a UFO. I never thought meteorite I did not see the sparks or green ball people were describing but maybe it was just my location.I noticed about 5 minutes or so later up very high in the sky was an object flashing from red to blue to green. At first I thought it was an aircraft but it moved left and then backwards. It really scared me because I have never seen anything like this. It stayed up there so long I had my husband come out and see it then had my mother drive over to look at it. Then there were jets flying around up there near the area and then it was gone. I can't say what that was. I just know that many people saw the flash and heard the boom there were sirens with emergency folks looking for a crash it pretty scary. Not everyone saw the big moon like sphere that people in my area did. I have read that now the navel observatory is calling it space junk but wow wouldn't someone know where this stuff was falling? I think this needs an investigation by someone because it seems no one really knows for sure what happened last night. But as for me, I'm calling it a UFO."],"Summary":"Huge white flash of light that looked like a blue white sphere it was huge.","Object Flight Path":"Other","Case Number":"16323","Tags":"City","Object Shape":"Flash, Sphere","Longitude":"-75.970425","Country":"United States","Source":"MUFON","trends":["There have been 47 other sightings in Virginia Beach","There were 3 other sightings in Virginia Beach on or around March 30th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.862126,+-75.970425(16323)&iwloc=A&hl=en\"> mufon case (16323) map </A>","Date of the Event":"03/30/2009 12:00 UTC","Disposition":"Insufficient Data","City":"Virginia Beach","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Virginia","Date Submitted":"03/30/2009 12:00 UTC","Viewing Distance":"Unknown","Object Features":"Other","files":["/var/www/straped/mufon/html2text/16323.html.txt","/var/www/straped/mufon/org/16323.html"],"Log Number":"US-03302009-0013"}