{"Date of the Event":"11/30/2002 05:00 UTC","Region":"Texas","City":"Mansfield","Case Number":"16327","Tags":"City","Date Submitted":"11/30/2002 05:00 UTC","divs":["Sighting DetailsThis sighting was many, many years ago but I can still remember the sighting pretty well itself, I just don't remember the exact date or time and I'm just now reporting this. It was early evening between 5 or 6 PM I believe, and I was riding home with my mother. It was a cloudless day and the sun was behind me and the sky was just starting to turn pink. When we were almost home I looked up to my right and at the sky and I noticed a light. This light just floated in one spot and flickered for maybe just over a second and flickered out. At first I thought it was maybe lights reflecting off a plane or something until the very next day. The very next day I look at the same area of the sky at about the same time of day and I saw the light again but this time there were two other lights with it and they floated(or hovered i don't know) for maybe just a few seconds and they, like the first light just flickered until they disappeared but I think the strangest part about these lights is that they were in formation. They made a triangle formation but it was easy to tell this wasn't one big object but 3 lights because the light went through in between them. I wish I had more details but that's all i can spare."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.563192,+-97.141677(16327)&iwloc=A&hl=en\"> mufon case (16327) map </A>","Object Features":"Undisclosed","Latitude":"32.563192","files":["/var/www/straped/mufon/html2text/16327.html.txt","/var/www/straped/mufon/more/16327_submitter_file1__MUFON-MansfieldTX-2003.jpg","/var/www/straped/mufon/org/16327.html"],"Country":"United States","Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 6 other sightings in Mansfield","There were no other sightings in Mansfield on or around November 30th 2002","This sighting has never been favorited.",""],"Longitude":"-97.141677","Summary":"Separate lights in formation.","Object Shape":"Circle, Sphere, Unknown","Viewing Distance":"Unknown","Sighting Duration":"00:00:01","Weather Factors":"Unknown","Log Number":"US-03302009-0017","Disposition":"Unknown"}