{"Latitude":"30.23959","Date of the Event":"08/30/2000 12:00 UTC","Object Features":"Undisclosed","Country":"United States","Object Flight Path":"Undisclosed","Case Number":"16326","Source":"MUFON","Object Shape":"Circle, Disc, Egg, Fireball, Oval","trends":["There have been no other sightings in St. Marteen","This sighting has never been favorited."],"divs":["Sighting DetailsMy wife and I was on Vacation in St. Martin. We were at the airport around 3pm. Our plane was to depart from St. Martin at 4pm. We checked our luggage and waited outside of the airport. As we sat waiting for 4pm to come around, I saw fire in the sky. I got up and walked into the parking lot to see where the fire was coming from. The fire in the sky appeared to be moving extremely fast.I thought it was a airplane on fire. I asked my wife to come see what I was seeing. She approached, looked up in the sky and the fire was not there anymore. The fire turned into a silver ball, stood still, then started the zip across the sky from right to left. The silver ball then moved up and down with speed that is unbelievable. The object just disappeard in broad daylight. There were no clouds in the sky it was a picture perfect day. After the object disappeared my wife and I stood there asking each other \"what was that?\" What did u just see? We asked each other why didnt we ask other people did they see it. We know what we saw. No one can take that away from us."],"Disposition":"Unresolved","Viewing Distance":"Unknown","Tags":"City","Summary":"I saw a fire in the sky, when I called my wife the fire turned into a silver ball made some remarkable moves then disappeared.","Log Number":"VI-03302009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=30.23959,+-91.753882(16326)&iwloc=A&hl=en\"> mufon case (16326) map </A>","Longitude":"-91.753882","Weather Factors":"Unknown","Region":"Louisiana","files":["/var/www/straped/mufon/html2text/16326.html.txt","/var/www/straped/mufon/org/16326.html"],"City":"St. Marteen","Sighting Duration":"Undisclosed","Date Submitted":"08/30/2000 12:00 UTC"}