{"Country":"United States","Weather Factors":"Unknown","Disposition":"Unknown","Summary":"I saw three lights in triangle formation. They flew across the sky and then were stationary and in formation.","files":["/var/www/straped/mufon/html2text/16325.html.txt","/var/www/straped/mufon/org/16325.html"],"Case Number":"16325","Object Flight Path":"Stationary,Hovering then path","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.855434,+-77.300993(16325)&iwloc=A&hl=en\"> mufon case (16325) map </A>","City":"Fairfax","Region":"Virginia","trends":["There have been 14 other sightings in Fairfax","There were no other sightings in Fairfax on or around March 29th 2009","This sighting has never been favorited.",""],"Latitude":"38.855434","Log Number":"US-03302009-0015","Object Shape":"Circle, Flash, Star-like","Date of the Event":"03/29/2009 10:35 UTC","Date Submitted":"03/29/2009 10:35 UTC","Longitude":"-77.300993","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went to sleep early, and woke up a few hours later, I looled at me cell phone and if was 10:35PM. My dog needed to go out, so I put on my shoes and went with him to the garden. When I looked up I saw a small point of light that I thought was a star. The point of light flashed, and then I saw two other lights on either side of it. They began to move in the sky from left to right in triangle formation. I thought it was the underside of a plane, but there was no sound and the wingspan would have been too long for a normal plane. I watched it for a few seconds, and realised this was not a normal plane. I ran back inside and found my digital camera (Sony Cybershot)and ran back out to the garden. When I was back outside they were still there. I took a video for about a minute without using zoom on the camera. Because it was dark out, I could not see what was being captured on the camera screen very clearly. When they continued to move, I went up the stairs that lead to the balcony, and adjusted the zoom on the camera. The lights remained stationary but changing formation. After I filmed it, I went inside and woke up my grandmother. When we went back outside they were still there, and she was able to observe them for about a minute before they became too dim to see. There was no sound in the sky when I first saw them, towards the end of the video, I could hear a plane coming, and two planes flew overhead towards Dulles Airport. The lights continued to move into distance until they were no longer visible. The first half of the video the lights are almost too small to detect, they are in the centre of the screen towards the left. The yellow lights on the bottom of screen at times is a porch lamp from a neighbour's house. The next day, I read a report that many people had seen lights in the sky over MD, DC, and VA due to space debris from a Russian Rocket that broke the earth's atmosphere. People reported seeing fireballs, and red and green lights. The lights I saw were white, round and flew sideways and in intelligent formation. I did not see any colours or fireballs, and nothing fell to the ground. 03.29.09 Ms. L. Lyons"]}