{"files":["/var/www/straped/mufon/html2text/16321.html.txt","/var/www/straped/mufon/org/16321.html"],"Country":"United States","Object Flight Path":"Path with directional change","Latitude":"30.461543","Longitude":"-91.1322","Object Features":"Window(s), Wings","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"16321","Region":"Louisiana","Source":"MUFON","Log Number":"US-03302009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=30.461543,+-91.1322(16321)&iwloc=A&hl=en\"> mufon case (16321) map </A>","trends":["There have been 27 other sightings in Baton Rouge","There were no other sightings in Baton Rouge on or around September 26th 1969"],"Tags":"City","Object Shape":"Cigar","Summary":"Occupied UFO came from behind and then passed to the left of me as I traveled the highway to the east.","City":"Baton Rouge","divs":["Sighting Details A fellow Navy shipmate and I were on our way from Orange Texas to Great Lakes Training Sta. for seperation via stops at some of my relatives along the way. We left Orange Texas in the late afternoon as soon as they were able to get my 67 Ford Mustang GTA off the ship and onto the pier and our transfer papers ready. We had our seabags packed from the trip we took through the Panama Channel Zone to Orange Texas. We, in our dress blues, stopped for a meal outside of Orange and took off for Bogalousa where my Aunt & Uncle lived for a visit along the way. I was driving a split 4 lane highway and it was a very dark and calm night and I had my window down, my friend was sleeping in the passengers seat. Listening to my radio, which was turned down due to my sleeping buddy, I noticed that we were running into some low overhanging fog which was about 20 or 30 feet above the highway and seemed to travel with the car and pulsate like a wave action above the car. That's when I saw about 5 bright lights shining at the car from behind. I first thought it was some kind of truck or bus until it passed me off to the left and crossed the low median and positioned itself on my drivers side traveling the same speed I was. It was a long cigar shaped craft with clear windows on its side just above apertursion the length of the craft and beings onboard which I could make out due to the background light inside it. They were not human. I had to keep watching the road ahead while driving but watched it as much as I could. This craft was about 60 feet long and I could only see about 15 feet of it pertruding beneath the pulsating wave fog. We were the only car on the road at the time. The area we were traveling in was in a somewhat county setting with woods and brush around. There was no sound to it and my buddy never woke up during this time. I really don't remember any thing after that except when we got to my Aunt & Uncles and had breakfast with them. I never spoke to any one about it as I have always believed in UFO's even as a kid I wrote essays about life on other planets. My mother had to see one of my teachers to discuse one of them."],"Date Submitted":"09/26/1969 01:28 UTC","Date of the Event":"09/26/1969 01:28 UTC","Disposition":"Unknown","Viewing Distance":"21-100 Feet"}