{"divs":["Sighting DetailsI was working with my son on his car in the driveway with one of my neighbors. I walked inside to check on my two other sons, and came back outside. I walked around the car in the driveway and started talking to my neighbor. Something just didnt seem right. There was no strange noise or anything, I just had a strange feeling that something was out of place or just not right. I looked around to the north, then turned to the south and saw the object in the sky. I examined it for a few seconds, and I could not identify it. (I worked in the cargo airline industry, I am very familiar with aircrafts, was a certified load master. I have seen blimps, commercial, and military aircraft on a regular basis, and there is nothing I have seen that could account for this object). I pulled my neighbor's and son's head out from under the hood of the car and said, \"Look at that. What is it?\" They were as shocked as I was at the size. The object was stationary at what I would guess at 5000 ft. I am in the approach and takeoff pattern for SAT, and have flown over my house at roughly 10000 feet everytime. The craft was well over a football field in length. The sky was clear, however, I live near a plant that has incredibly bright lights in their parking lot, so we could not make out any details of any shape other than the lights. The craft had a large, very large, red light in the center, and a small white light on either end. The lights were linear and horizontal in the sky, and never changed orientation. The large red light in the center did not blink. It dimmed, then got brighter, then dimmed again, but never went out. It was more like the old bubble gum ball lights the cops used to have on their cars, only imagine the mirror inside spinning very slowly and the effect on the light omitted. That is the best way I can describe it. The only way to provide a contrast to the size of the lights, imagine the red light in the center the size of a light house lamp, and the white lights on the ends being the smallest Christmas tree lights you can buy (the small LED ones). The white lights on the ends were constant and never blinked nor did they ever change. Their distance from the center never changed, so the orientation of the craft was E-W. The craft slowly moved to the west for a few minutes, then stopped, stayed stationary for about a minute, then changed direction and moved E, paralleling I-10 heading toward Houston. We watched it for approximately 10-15 minutes until it was out of sight. There was no wind or anything to obscure sound. We live @1 mile north of I-10, and we could hear the cars and trucks going by on the interstate, we can always hear the jets going over, but this thing was dead silent. It made no engine noise whatsoever. The object was witnessed by myself, my 3 sons, my neighbor, and another neighbor and his wife and 2 kids who came home while we were standing in the street observing the object. Again, the thing that was the most shocking was the immense size. The red light in the center had to be two stories tall or more based on my best guess of it being at 5000ft and approximately 150-200 yards in length. My only regret is that my son, my neighbor, and I all had camera phones on us, and my digital camera was sitting inside my front door hung on our hall tree, but we were so shocked at the size of what we saw, that not one of us even thought about taking a picture of it."],"trends":["There have been 3 other sightings in Seguin","There were no other sightings in Seguin on or around July 31st 2008"],"City":"Seguin","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/16331.html.txt","/var/www/straped/mufon/org/16331.html"],"Country":"United States","Longitude":"-97.959127","Region":"Texas","Date of the Event":"07/31/2008 08:45 UTC","Log Number":"US-03302009-0021","Tags":"City","Object Shape":"Unknown","Date Submitted":"07/31/2008 08:45 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Case Number":"16331","map":"<A HREF = \"http://maps.google.com/maps?q=29.578461,+-97.959127(16331)&iwloc=A&hl=en\"> mufon case (16331) map </A>","Object Features":"Unknown","Source":"MUFON","Summary":"Very large object in sky with large red light in center and small white lights on ends in southern sky.","Latitude":"29.578461","Sighting Duration":"00:15:00"}