{"Region":"California","Viewing Distance":"Unknown","Summary":"10 plus boomerang shaped objects hovering in sky above Carlsbad.","Country":"United States","Date Submitted":"03/30/2009 11:10 UTC","divs":["Sighting DetailsBoomerang object hovered in sky for little over an hour, no other planes in site. hardly any stars in sky on this night. I went out to smoke a cigarette and notice these objects in the sky. Boomerang objects with flashing red, white and blue lights back in for not in any set pattern just changing of colors back and forth. About 10min in I notice a jet or some type of plane fly by and the objects didn't move. I tried taking a photo but cell phone camera was the only thing I had it wouldn't see that far. I took a shower came out and checked again, noticing they have moved out a bit and no longer 10plus but maybe 4 - 5 that are still notice able. Roommate comes and I also show him and he sees them but the have moved out more then before, but are still noticeable to a trained eye, so the binoculars come out about that moment a shooting star also comes out of no where. He sees them and notice the lights and we start noticing jets ( I know there are jets cause u can hear there engines and they are flying in a straight pattern) with weird light patterns also start showing up and flying by these objects, they move out a little more and then a little more but are still visible with binoculars and some with just your eyes. The colors give them away."],"trends":["There have been 14 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around March 30th 2009"],"Date of the Event":"03/30/2009 11:10 UTC","Weather Factors":"Unknown","Latitude":"33.160623","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","Tags":"City","City":"Carlsbad","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.160623,+-117.347184(16334)&iwloc=A&hl=en\"> mufon case (16334) map </A>","Case Number":"16334","Longitude":"-117.347184","files":["/var/www/straped/mufon/html2text/16334.html.txt","/var/www/straped/mufon/org/16334.html"],"Log Number":"US-03312009-0003","Object Shape":"Boomerang"}