{"Region":"Florida","Sighting Duration":"00:00:02","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around March 26th 2009"],"City":"Homestead","files":["/var/www/straped/mufon/html2text/16333.html.txt","/var/www/straped/mufon/org/16333.html"],"Tags":"City","Summary":"Sharply defined pale blue craft crosses half the night sky in less than 2 seconds.","Source":"MUFON","Latitude":"25.475962","Viewing Distance":"Unknown","Date Submitted":"03/26/2009 10:05 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Date of the Event":"03/26/2009 10:05 UTC","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"16333","divs":["Sighting DetailsI was camping with a large group at Flamingo campground in the Everglades. No light pollution nearly clear sky with bright stars. Numerous satellites, planes and several meteors also seen. Was stargazing at double cluster near head of Perseus with a friend. As he was finding the cluster, my gaze wandered to Auriga, the Charioteer. Oddly, I happened to be gazing at the exact spot where some object appeared. The location of appearance was between Capella and beta-Aurigae. The shape was nearly elliptical but with almost pointed anterior and posterior ends. The size would be approximately equal to the appearance of a standard tylenol capsule held at arm's length - or far larger than even the largest planes we saw constantly passing overhead. There was no way to estimate its altitude. Toward the posterior end (based on the direction of flight) there seemed to be dark projecting flaps on each side - almost like the way the sealing ring on an old mason jar projects from the glass lid. The flaps did not project beyond the posterior tip of the object, and were only visible at the instant of its appearance. My impression was that they may have been vortices related to its materialization. My friend had looked up from his binoculars and immediately saw it as I shouted \"Wow!\" The object either materialized at full speed or instantly accelerated to the cruising speed that carried it from about 5 degrees North of Auriga to a couple of degrees beyond Sirius in less than two seconds. If I was counting, the count would have been \"one-thousand-one, one-thou.\" As it passed Orion, it faded slightly from view possibly from clouds but it may have also partially de-materialized. But beyond Sirius, it winked out entirely. All in all, it covered about half the visible sky on a north to south path. It made no sound of any kind. Any man-made object moving that fast would have produced a sonic boom unless it was above the atmosphere entirely. Given its size, an altitude above the atmosphere would have made it many times the size of the largest objects we can get up there. The object was a light translucent cool blue, with very sharp and clear edges. No hint of debris or anything meteor-like. No shifting colors or edges. Too bad I was only stargazing and not filming. I asked my friend how fast he thought it was traveling (he has a pilot's license) and his response was a joking \"oh about mach 27,000.\" The whole thing left us fairly blown away. For myself, after seeing all kinds of films over the years on various videos, films, etc., this was nothing like the wobbly, fuzzy, out-of-focus stuff that passes for unidentified flying objects. My friend sat and talked about it for a couple of hours afterwards. It was certainly more interesting than any of the celestial bodies we were looking at."],"Log Number":"US-03312009-0002","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=25.475962,+-80.470357(16333)&iwloc=A&hl=en\"> mufon case (16333) map </A>","Weather Factors":"Windy, Medium","Longitude":"-80.470357"}