{"Tags":"City","Log Number":"AN-03312009-0006","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/16337.html.txt","/var/www/straped/mufon/more/16337_submitter_file1__stthomas1.jpg","/var/www/straped/mufon/more/16337_submitter_file2__DSCN6021.JPG","/var/www/straped/mufon/more/16337_submitter_file3__DSCN6024.JPG","/var/www/straped/mufon/org/16337.html"],"Summary":"Small? Tube-like UFO not seen with the naked eye (only showed up on film).","Object Flight Path":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"52.282316","Source":"MUFON","Date Submitted":"01/09/2008 12:00 UTC","Weather Factors":"None","trends":["There have been no other sightings in Warwick","This sighting has never been favorited."],"Case Number":"16337","map":"<A HREF = \"http://maps.google.com/maps?q=52.282316,+-1.584927(16337)&iwloc=A&hl=en\"> mufon case (16337) map </A>","Object Features":"None","divs":["Sighting DetailsI was on a helicopter tour on vacation in St. Maarten. I was snapping pictures of anything and everything because it was my first time on a helicopter and also my first time in St. Maarten. I have been extremely interested in UFOs for as long as I can remember, but never had a sighting. I had these pictures for a full YEAR before I noticed a tiny blip on one of my pictures as I was quickly going through them as I so often did. I didn't want to get too excited, and I thought it might have just been a spot on the camera, but as I went through the other pictures the object (in the exact same size and shape) was in different places all over the screen. I don't know how to analyze pictures very well, but the first picture I'm going to post I think has a shadow under the object on top of the ocean. It is very hard to see, as it is so small, and I have reported this to another site, but I never got any feedback as to what the object could be. It looks kind of like a blimp almost, but it is so small that I don't think it could one. I didn't see the object while in the sky, but I don't know if it's just because I was so overwhelmed by being on an island on a helicopter tour that I didn't notice it. I would really like to know what I saw. The only one that shows a really good picture I'm taking from UFOcasebook where I originally reported it. The next two I'd have to explain where they are as I have a Mac and don't know how to use it. In the second picture the object is faintly seen in the clouds to the upper left on the islands going across the middle of the picture (I honestly don't know if you can see it). And the third one is also very hard to see but now it's on the upper RIGHT hand corner of the picture and is almost going off the picture. I know it looks like nothing, but it's the first picture that had caught my eye as it's blatantly out in the open- but there are two anomalies on the other pictures that resemble the object in the first one."],"Longitude":"-1.584927","Country":"United Kingdom","Region":"England","City":"Warwick","Date of the Event":"01/09/2008 12:00 UTC","Object Shape":"Blimp, Cigar, Cylinder"}