{"Country":"United States","Object Features":"Unknown","Tags":"City","Sighting Duration":"00:01:30","trends":["There have been 3 other sightings in WAYNE","There were no other sightings in WAYNE on or around March 30th 2009"],"Object Flight Path":"Straight-line path","Latitude":"40.05565","divs":["Sighting DetailsI am reporting this for my Mother, Mary Daily, who was the one to see it. 1. I told her to watch for the space station going over at that exact time. She was in the backyard looking towards the west. The space station came from the right side of the moon; this object was on the left side moving in the opposite direction- towards the west. 2. was looking for the space station at the time. That either; that there was a very bright quality to the light-or that there was a horizontal row of lights that did not resemble lights that one is used to seeing with aircraft. Very bright, or intense lights that would have been extremely easy to notice. 3. thought there was a possibility that it was the space station for which she was watching, as I [her son]had instructed her; at which minute to be looking towards the west between 20:48- 20:51. She chose to be outside at 20:51. 4. Described the lights in answer 2 [there were white lights with a possible red light on the left end of the horizontal row; with some slight amount of blinking]. The movement was smooth but steady. When noticed;at about 45 deg. traveling to aprox. 20 deg. WSW; in aprox. the one minute time frame. It was moving with a speed that would have indicated a plane noise would have been heard as it was closer; plus, if it were an aircraft, it would have moved away in distance slower. The duration of sighting was approx. 1 min. 30 sec.s 5. Had thoughts that there was a possibility it was the space station. Also had thoughts about how both the quality of light was brighter than other nighttime sky craft; and that the shape of the row of lights were not any regular aircraft configuration. Did not stop watching until it disappeared. Went inside and told her husband what she had just seen. 6. Faded off into the distance as if it had travelled very far."],"Weather Factors":"Unknown","Longitude":"-75.385194","Disposition":"IFO","Viewing Distance":"Unknown","Region":"Pennsylvania","Date of the Event":"03/30/2009 08:50 UTC","Summary":"A horizontal row of lights, without noise, travelling to the west, seeming to cover great distance-vanishing in the distance.","Case Number":"16339","Object Shape":"Square, Rectagular, Other","City":"WAYNE","Date Submitted":"03/30/2009 08:50 UTC","files":["/var/www/straped/mufon/html2text/16339.html.txt","/var/www/straped/mufon/org/16339.html"],"Source":"MUFON","Log Number":"US-03312009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.05565,+-75.385194(16339)&iwloc=A&hl=en\"> mufon case (16339) map </A>"}