{"City":"Brownsburg","Source":"MUFON","Tags":"City","Object Features":"Undisclosed","Region":"Indiana","Disposition":"Unknown","Date Submitted":"03/30/2009 10:15 UTC","Latitude":"39.846927","Summary":"Didn't see anything but lost an hour.","Object Shape":"Undisclosed","Date of the Event":"03/30/2009 10:15 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.846927,+-86.388124(16344)&iwloc=A&hl=en\"> mufon case (16344) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsI just dropped off a friend at his house at 22:15. It was a nice night out, so I took the long way home. I was coming to an an intersection. I remember seeing the stop sign, but don't remember coming to it, or stopping. The next thing I know I am starting my car, and I am turing to wave good bye to my friend. I realized I wasn't at his house, but near a corn field... parked. I began to panic and looked down at my feet and my shoes were all muddy. I got out of my car caught my breath and regained myself. I look around and just could comprehend what just happened. I got back in and looked at the clock. I lost an hour. I look at my watch (this is the most troubling thing) it is a dual analog and digital watch. The didital portion was an hour off than the analog. I drove home with a very funy feeling. But I felt fine. Not tired, sore, sick. I felt great! other than my sense of panic of what happeded. I feared that I had some sort of seizure, or something. The next morning I contacted my brother. He is very much into the UFO phenomena, and has had a few experiences in his life, but more so he just has done a lot of research in this area of study. He told me I should make contact with you guys and share with you my story. Later today I finally decided to drive out where I found myself. It was very strange to be there again. As I drove around the field (a place I have never been) it seemed all too familiar to me. Like I had been there, and deep down inside a feeling of comfort and yet complete terror. I have tried to look at this logically and the only conclusion I can come up with is something happened, that had altered time (the watch and clock). Beyond that I have no logical explanation. In short, it was like being put to sleep for surgery. One minute your looking up at the lights and doctors, and the next you are in recovery. The differance was, I was sleepy, or groggy. I was perfectly awake, and tring to start the car just as if I turned off to drop him off, and I was starting it again. But only an hour later 2 miles away. I know this sounds crazy! It does to me right now, but I just can't explain what happened."],"Weather Factors":"Unknown","Log Number":"US-03312009-0013","Country":"United States","files":["/var/www/straped/mufon/html2text/16344.html.txt","/var/www/straped/mufon/org/16344.html"],"trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around March 30th 2009"],"Object Flight Path":"Undisclosed","Case Number":"16344","Longitude":"-86.388124"}