{"Date of the Event":"03/28/2009 09:45 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=44.74601,+-93.121872(16341)&iwloc=A&hl=en\"> mufon case (16341) map </A>","Country":"United States","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/16341.html.txt","/var/www/straped/mufon/more/16341_submitter_file1__16341SitePhoto12009-03-28RosemountMN.jpg","/var/www/straped/mufon/more/16341_submitter_file2__16341SitePhoto22009-03-28RosemountMN.jpg","/var/www/straped/mufon/org/16341.html"],"Region":"Minnesota","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsDriving home from a friend house around 9:45.I saw a light that i thought was on a smoke stack,as I got closer i realized it was above a field not on a stack. It was really bright I pulled over on a dirt road to the right and got out of my car to look it at. I then noticed it was about 500 to 1000 feet away and 200 feet off the ground. perfectly silent and rock solid in the sky with no movement at all. It consisted of a bright light with to little blinking lights to either side of it. At first i thought it must be a plane landing but it just sat there in the middle of the field for approximately 4 minutes.I then thought i would try and take a picture of it with my phone as i was reaching for my phone I got really freaked out think i was all alone on this dark road. this is very unusual for me i can barely rember getting back in my car but i was shaking and scared. again unusual. as i drove back on the road i could see some kind of shape to it but not much else. the thing i think is weird about this is this overwhelming feeling that came over me to get out of there it was out of place and from nowhere."],"Summary":"Hovering object above a field off County Hwy 46.","Tags":"City","Object Features":"Other","Log Number":"US-03312009-0010","Disposition":"Unknown","City":"Rosemount","Object Shape":"Other","Source":"MUFON","Date Submitted":"03/28/2009 09:45 UTC","Latitude":"44.74601","Case Number":"16341","Longitude":"-93.121872","trends":["There have been 2 other sightings in Rosemount","There were no other sightings in Rosemount on or around March 28th 2009","This sighting has never been favorited.",""]}