{"divs":["Sighting DetailsWhile I was out on my deck smoking a cigeratte, I was looking at the moon and noticed how bright it was. It looked like the moon was moving which we all know it doesn't move, we do and not enough for me to notice. I ran in and got my son's digital camera (which I have never used). I came out and took about 5 pictures of the moon. As I was taking the pictures, I noticed through the camera that the color of the moon had changed to red like a fiery sunset and then a blue color. Then I decided to drive to get a different view and went to Gary Lane and across the street is a dead end road, I rode to the end and the moon was bright but you could clearly see there was nothing in front of it as I had just seen. I went home. The next day, I asked my son to downloaded the pictures and asked him what he saw. He stated that there was red in one picture and he thought there was blue in another and wanted to know what I had been looking at. I explained and after reviewing them, we decided to enhance the pics to see what we could see and there was something there. What I don't know. The direction the moon was in that night was east of Exeter, NH and the next town is either Hampton or Seabrook. (Seabrook NH has a nuclear power plant). The actual thing I saw was triangle looking once it moved away from the moon. There were 3 blue lights on it and it was at an angle. Yes, I believe it was a UFO and it moved away and out of the sky itself. the camera timestamp is incorrect, the time had just changed on March 8th to 1 hour ahead and we did not adjust the camera."],"Tags":"City","Case Number":"16348","Date of the Event":"03/12/2009 09:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.990427,+-70.946634(16348)&iwloc=A&hl=en\"> mufon case (16348) map </A>","Summary":"Looked like something was overlapping the moon.","Object Flight Path":"Unknown","Date Submitted":"03/12/2009 09:50 UTC","Object Features":"Unknown","trends":["There have been 6 other sightings in Exeter","There were no other sightings in Exeter on or around March 12th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/16348.html.txt","/var/www/straped/mufon/more/16348_submitter_file1__IMG_1317.JPG","/var/www/straped/mufon/more/16348_submitter_file2__IMG_1318.JPG","/var/www/straped/mufon/more/16348_submitter_file3__IMG_1314.JPG","/var/www/straped/mufon/more/16348_submitter_file4__IMG_1315.JPG","/var/www/straped/mufon/more/16348_submitter_file5__IMG_1316.JPG","/var/www/straped/mufon/org/16348.html"],"Weather Factors":"None","Longitude":"-70.946634","Disposition":"IFO","Object Shape":"Triangle","Latitude":"42.990427","Source":"MUFON","Region":"New Hampshire","Log Number":"US-03312009-0017","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","City":"Exeter"}