{"City":"Washington","Case Number":"16355","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Country":"United States","Viewing Distance":"Unknown","Longitude":"-78.159444","Tags":"City","Log Number":"US-04012009-0001","divs":["Sighting Details-------------------------------------------------------------------------------- In the Spring of 1979 I was driving with a friend in Virginia. We were not too far from Skyline Drive and West Virginia going towards Washington, D.C. It was very early in the morning and still very dark. I saw a bright orange sphere hovering over the tree tops. I slowed down then stopped the car behind two other cars that had pulled over to the side of the road. A couple people stood outside their cars looking up at the sphere, but I was too afraid to get out of my car and just rolled down the window about half way. The sphere was bright, silent and I didn't notice any indication of turbulence of the atmosphere around it. After a couple minutes it ascended straight up out of site at an incredible speed. In what seemed like 1 - 2 seconds it was out of the atmosphere out of site. It left no trail of emissions behind it. I did not approach the other witnesses and drove away frightened. My friend slept through the entire event even though I tried to get her to wake up telling her that I thought I was watching a UFO. I have always considered that there may have been an explanation other than UFO and remain open to suggestions. I have often wondered what the other witnesses thought of this siting. If only I had been brave enough to venture over to them. It was prudent to not approach them because we were two young women traveling through a pretty isolated area. I have told my family and friends that I believe I may or may not have seen a UFO. Any similar sitings out there? All explanations welcome."],"Weather Factors":"Unknown","Summary":"Bright orange self-illuminated sphere.","Date of the Event":"04/30/1979 12:00 UTC","Latitude":"38.713452","files":["/var/www/straped/mufon/html2text/16355.html.txt","/var/www/straped/mufon/org/16355.html"],"Region":"Virginia","Date Submitted":"04/30/1979 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Washington","There were no other sightings in Washington on or around April 30th 1979"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.713452,+-78.159444(16355)&iwloc=A&hl=en\"> mufon case (16355) map </A>","Object Shape":"Sphere"}