{"Tags":"City","Summary":"Witnessed object est. 3k feet up in clear night sky: stationary multiple colored lights moving rapidly.","divs":["Sighting DetailsAt 8:45 PM on Tuesday night, March 31, 2009, I was out in my driveway cleaning some mud off of my shoes when I took a minute to admire the stars on a clear night. My eyes focused upon a stationary object off to my Northeast at what my father, who I asked to come out to see the object, estimated to be at about 3,000 feet up in altitude. We looked at it through two different sets of binoculars. My description of the object is of the lights associated with it, as it was too dark and the lights too bright to be able to make out a shape. As for colors, I saw greens, reds, and light yellows. The lights pulsed in a rapid series of movements, so much so, that they actually made me a bit dizzy after a couple of minutes of focusing upon them with the binoculars. At times, the lights seemed to diminish in brightness and intensity of movement, but would shortly resume their previous brightness and frenetic movement. The lights moved frenetically, but the object that they emanated from stayed perfectly still. The object made no sound that was observable to me or to my father. As I watched it, I remarked to my father that this was officially my first sighting of a UFO. After about 30 minutes of watching the object, it either started to move off slowly towards the northeast, or the lights it emitted were reduced in intensity and movement, I couldn't tell which. About five minutes after that, I went back into the house, even though the object was still visible, in the diminished state I just described."],"Disposition":"Unknown","trends":["There have been 3 other sightings in Pine Bluff","There were no other sightings in Pine Bluff on or around March 31st 2009"],"Object Shape":"Unknown","Region":"Arkansas","Country":"United States","Object Features":"Unknown","City":"Pine Bluff","Sighting Duration":"Undisclosed","Weather Factors":"None","Latitude":"34.230021","Source":"MUFON","Log Number":"US-03312009-0020","Date Submitted":"03/31/2009 08:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.230021,+-91.993316(16351)&iwloc=A&hl=en\"> mufon case (16351) map </A>","Longitude":"-91.993316","Case Number":"16351","Date of the Event":"03/31/2009 08:45 UTC","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/16351.html.txt","/var/www/straped/mufon/org/16351.html"]}