{"Object Flight Path":"Undisclosed","Longitude":"-75.567537","Region":"Antioquia","City":"Medellin","Sighting Duration":"Undisclosed","Date of the Event":"10/04/1994 12:00 UTC","Case Number":"16369","Country":"Colombia","Tags":"City","Latitude":"6.243525","Log Number":"CO-04022009-0002","Date Submitted":"10/04/1994 12:00 UTC","Summary":"It was a sphere silvered, with no windows, doors, or whatever.","divs":["Sighting DetailsI WAS IN THE BALCONY OF A THIRD FLOOR HOUSE. IT WAS 4 OCLOCK(MORE OR LESS) THE SUN WAS BEAUTIFULL IN THE SKY AND THERE WERE LITTLE CLOUDS, BUT MOST OF ALL SKY WAS BLUE. I WAS WHIT TWO GIRLS FRIENDS SPEAKING, NONSENSES, WHILE THE GIRLS WERE SPEAKING BETWEEN THEMSELVES, I LOOKED TO THE HORIZON AND SAW A LITTLE \"BALL\" SILVERED STOPPED IN THE SKY BLUE. THE MOST INCREDIBLE CASE WAS THIS SPHERE, BEGAN \"TO GROW\", BUT KEEPING ALL THE TIME THE PERFECT FORM SPHERICAL IT MEANS, THAT SINCE THE BEGINNING, THE FORM SPERICAL WAS CONSTANT. I THOUGHT IT WAS A GLOBE OF HOT AIR, THAT ARE VERY COMMON IN COLOMBIA, BUT....IN OCTOBER? THOSE GLOBES ARE NOT COMON IN MEDELLIN (OUR CITY) AND THIS SPHERE SILVERED WAS IN THE SAME ROUT OF THE PLANES THAT FLIES OVER MY CITY. THE MOST STRANGE OF ALL, WAS THAT THE WIND WAS VERY STRONG AND THIS SPHERE DID NOT DO ANY KIND OF MOVEMENT AND BEGAN TO GROW OVER AND OVER AGAIN, BUT SLOWLY. THIS SPHERE HAD, MORE OR LESS, TEN METERS OF DIAMETER UNTIL I REMEMBER, IT DID NOT HAVE WINDOWS, ANTENAS, \"FEET\" OR WHATEVER. I SHOUT TO MY GIRLSFRIENDS ABOUT THIS \"BALL\" BUT THEY (BOTH OF THEM) DID NOT SEE ANY KIND OF FORM, THEY ONLY SAW A LIGTH THAT GROWS SLOWLY BUT NO FORM DEFINED SOMETHIG GAVE ME PANIC, I COULD NOT MOVE MY RIGTH ARM AND LEG, I HAD MY HART JUMPING LIKE A MAD AND MY MOUTH HAD LIKE WATER AND MY TONGE WAS VERY \"HEAVY\" I COULD NOT SPEAK CLEARLY. MY GIRLFRIEND (ADRIANA) BEGAN TO MOVE MY RIGTH ARM AND LEG. I BEGAN TO SAY IN MY MIND: \"GOD, HELP ME PLEASE\" AND SUDENLY ALL THIS EFECTS STOPED. WHILE ALL THIS THINGS WERE HAPPENING TO ME, THIS SPHERE DISSAPEAR SUPER FAST. I NEVER SPOKE TO ANY BODY THIS CASE, ONLY I TALKED WITH MY EXGIRLFRIEND, BUT IT ONLY HAPPENED LONG TIME AGO, AND I DO NOT WANT TO BE NAME LIKE A MAD MAN. I KNOW WHAT I SAW AND IT IS ENOUGH FOR ME. EXCUSE ME MY BAD ENGLISH ARQUITECTO: LUIS FERNADO ARANGO ARBOLEDA"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=6.243525,+-75.567537(16369)&iwloc=A&hl=en\"> mufon case (16369) map </A>","trends":["There have been 13 other sightings in Medellin","There were no other sightings in Medellin on or around October 4th 1994"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/16369.html.txt","/var/www/straped/mufon/org/16369.html"],"Object Shape":"Sphere","Source":"MUFON","Disposition":"Unresolved"}