{"files":["/var/www/straped/mufon/html2text/16361.html.txt","/var/www/straped/mufon/org/16361.html"],"Date of the Event":"07/15/1998 02:30 UTC","Object Features":"Unknown","Summary":"Silver shaped saucer/disc.","Country":"United States","Log Number":"US-04012009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=36.119956,+-115.163606(16361)&iwloc=A&hl=en\"> mufon case (16361) map </A>","Disposition":"Insufficient Data","Object Shape":"Disc","Source":"MUFON","City":"Las Vegas","Weather Factors":"Does Not Apply","divs":["sighting detailsi was on my way back from a fun trip to las vegas, nevada, at the approx. times i listed. the jet was headed back to texas. we had just taken off and had only been in flight for about 5 minutes. i was sitting next to the window on the side where you cold actually see the grand canyon and hoover dam below, as i had seen them on the way in, sitting on the same side in the jet, by the window. ---thoughts of \"area 51\" went through my head for a few seconds as we were in beginning flight.....then i turned away from the window for about 1-2 minutes, then i began looking down to see if i could see hoover dam again....then my eyes went upwards parallel to the clouds and jet's wing...and there it was!---parallel to our jet and about 50-100 yards away was this silver,metallic flying disc\\saucer!---it was just hovering there in place for about 5-10 seconds as if it were observing our jet!---so i turned to the person next to me,(whom i did not know, and nudged her with my hand, and told her to look out the window so that she would also see the saucer, but by the time we both looked out the window----it was gone)!------i just had to report this, even if it's about 11yrs. later because...i know what i saw, and isn't it amazing that i had heard there was stuff like that going on at \"area51\" with ufo's and aliens, and then i end up seeing one near the vicinity of 'area 51?!?'---so there must be something to this 'area 51' after all!"],"Region":"Nevada","Latitude":"36.119956","Sighting Duration":"00:00:10","Tags":"City","Case Number":"16361","Date Submitted":"07/15/1998 02:30 UTC","Object Flight Path":"Stationary","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 15th 1998"],"Longitude":"-115.163606"}