{"Object Features":"Appendage(s)","Object Shape":"Bullet, Missile, Cylinder, Fireball, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/16364.html.txt","/var/www/straped/mufon/org/16364.html"],"Case Number":"16364","Latitude":"33.458287","map":"<A HREF = \"http://maps.google.com/maps?q=33.458287,+-112.070647(16364)&iwloc=A&hl=en\"> mufon case (16364) map </A>","Disposition":"IFO","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI have been monitoring the skys over Pheonix Arizona since early March 2009 using the ADEQ (Arizona Department of Air Quality) web cams from my home in the San Francisco Bay Area. I became interested in doing this as a result of seeing the film The Pheonix Lights a few months ago. I also stumbled on a web site www.webcamufo.com that allows you to download zoomable high resolution pictures from the Phoenix web cams. In just a few short days of watching these cams starting in the early evening hours, I've been able to capture more than two dozen unusual objects in the air over Phoenix. I have no idea what they are but I am cureous to find out. I have attached three of the more interesting ones for all to see. I saved the original high resolution 5.6mb images that I used to crop these three from as well as the dozens of others I have. If anyone would like more information or you would like me to supply you with the original high res pictures please feel free to contact me through the folks at MUFON."],"Region":"Arizona","Object Flight Path":"Unknown","Date of the Event":"02/28/2009 06:00 UTC","Viewing Distance":"Unknown","Weather Factors":"None","Tags":"City","trends":["There have been 417 other sightings in Phoenix","There were 4 other sightings in Phoenix on or around February 28th 2009","This sighting has never been favorited.",""],"City":"Phoenix","Summary":"A variety of objects seen over a period of days.","Log Number":"US-04012009-0008","Country":"United States","Date Submitted":"02/28/2009 06:00 UTC","Longitude":"-112.070647"}