{"Object Shape":"Circle, Flash, Sphere, Star-like","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change,Path then hovering","Summary":"Red & blue light flashing, almost twinkling and round looking sphere moving at sharp angles, stopping and starting quickly.","trends":["There have been 6 other sightings in Painesville","There were no other sightings in Painesville on or around April 1st 2009"],"Date of the Event":"04/01/2009 11:00 UTC","Longitude":"-81.244207","Object Features":"Unknown","divs":["Sighting DetailsI was riding my ATV late with a friend. We stopped to take a break in a nursery clearing in Painesville Ohio. It was a very clear night and could clearly see the stars, the half moon was really bright. Over the tree line you could clearly see the lights of Painesville City. My friend and I were talking, not even looking toward the sky. I caught a movement out of the corner of my eye and turned to see what it was and saw a sphere of light make a circle air manuver that had to cover an imposssible distance in just over a second. I originally thought it was a flashlight for a split second because I saw light movement and thought someone was coming. I started watching the light and noticed that it had red and blue flashing twinkling lights all around it. It seemed to hover in the same place for a while after doing the circle manuver and then started to slowly move in sharp angles left to right, up and down, stopping abruptly and then going in the opposite direction than it originally came. It would also make slight curving turns, stopping abruptly. It was clearly over the space of Painesville City. The direction in the sky was north, possibly toward the lake. The field that we were parked in was very wide open and you could see for miles. The main abundance of light from the ground was coming from Painesville city. And this object was high in the sky over the city and was clearly not a city light, tower, plane etc..It was entirely too high in the sky for anything like that..I watched this thing for close to a half hour make darting movements in the same part of the sky. I would have never noticed the object if it would have not made the circle movement out of the corner of my eye. If you were to just glance at it for a second you would probably mistake it for a plane becasue of the red and blue flashing lights but this thing clearly made airial movements like I have never seen befor, covering vast distances in the sky and stopping abruptly.I felt like I was witnessing something unworldly and I seemed to be drawn to it and could not look away..After a half hour or so, we headed back to the trucks because it was almost midnight. This has really sparked my interest and I plan on going back with a camera just for the chance it would be back. I know what I saw and would take a lie detector test to prove it."],"Case Number":"16371","City":"Painesville","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.726438,+-81.244207(16371)&iwloc=A&hl=en\"> mufon case (16371) map </A>","files":["/var/www/straped/mufon/html2text/16371.html.txt","/var/www/straped/mufon/org/16371.html"],"Weather Factors":"None","Region":"Ohio","Log Number":"US-04022009-0004","Latitude":"41.726438","Source":"MUFON","Date Submitted":"04/01/2009 11:00 UTC","Tags":"City","Country":"United States"}