{"Source":"MUFON","Log Number":"GB-04022009-0005","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/16372.html.txt","/var/www/straped/mufon/org/16372.html"],"City":"Middlesboro","Weather Factors":"None","Summary":"UFO sighting as a child with strange noises that followed in the house.","Date Submitted":"06/30/1977 12:00 UTC","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=36.622778,+-83.71484(16372)&iwloc=A&hl=en\"> mufon case (16372) map </A>","Country":"United States","Latitude":"36.622778","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Date of the Event":"06/30/1977 12:00 UTC","Object Features":"Undisclosed","Tags":"City","Region":"Kentucky","Longitude":"-83.71484","trends":["There have been 3 other sightings in Middlesboro","There were no other sightings in Middlesboro on or around June 30th 1977"],"Disposition":"Unresolved","Case Number":"16372","divs":["sighting detailsthis all happened in the north east of england in the summer of 1976\\77. i was about 8 or 9years old at the time, i do remember it was a monday night. i had gone to bed at about 9.00pm. it was one of those nights where the summer night sky was a light brown colour, you could see objects on ground a couple of houses away. my bedroom was on the upper floor at the rear of the house in the little town called hartburn in north yorkshire. i had gone to sleep but soon woke with a strange feeling over me, it was hard to explain, i just felt like i needed to look out of my window. my bed was near the window so i just sat up and peered out of the corner of the curtains, the sky was very clear, as i looked to the right out of the window i saw an object floating over an oak tree in the rear of a neighbours house about 4 doors down. it was as round as the canopy of the tree. about 1\\2 as deep as the canopy of the tree. just under the rim of the disk seemed to have a dim orange glow that pulsated. i watched it for what seemed like 5 or 10 minutes then i suddenly got a very spooky feeling that i should not be watching it, i then closed over the curtains, that was when i started hearing strange noises in the air, all i remember is that it felt like wolves howling way off in the distance. not what you would hear i the north of england.i ended up huddled under the covers with them pulled over my head. after a while (not sure how long) the whole feeling and the noises just stopped. after a few minutes i got the guts to look out the window again. the object was gone. so i had a good look around and noticed it was way off in the distance now and then it just seem to streak up steeply and it was gone. it was then that i felt that all was normal again, it was like the air was all tense and then just all gone and back to normal. i told mum and dad the next day but they just put down to my imagination. but i am not 40 years old and i will not forget it at all."]}