{"map":"<A HREF = \"http://maps.google.com/maps?q=14.681561,+121.04866(16379)&iwloc=A&hl=en\"> mufon case (16379) map </A>","Longitude":"121.04866","Log Number":"PH-04022009-0012","Disposition":"Hoax","City":"Quezon City","Country":"Philippines","Region":"Metro Manila","Tags":"City","files":["/var/www/straped/mufon/html2text/16379.html.txt","/var/www/straped/mufon/more/16379_submitter_file1__UFO2009010.jpg","/var/www/straped/mufon/more/16379_submitter_file2__UFO2009009.jpg","/var/www/straped/mufon/more/16379_submitter_file3__UFO2009029.jpg","/var/www/straped/mufon/org/16379.html"],"Weather Factors":"None","Date Submitted":"03/04/2009 01:30 UTC","Object Shape":"Disc, Oval","Object Flight Path":"Stationary,Path then hovering","Object Features":"None","Date of the Event":"03/04/2009 01:30 UTC","divs":["Sighting DetailsI was watching the TV when the television signal was interrupted and the same signal problem with the radio. I just get out of the house when i saw our neighbors looking at the sky and taking some pictures of a strange craft. I ran out to the house to get my digi cam and i took alot of pictures of it. It was moving slowly and some other times it was moving in great speed from left to right. The people freaked out when it came above us. We ran to the tricycle ( kind of vehicle) still taking some pics from the vehicle window. Others are brave enough to took shots of pictures under the ufo. It was really huge and television signals are interrupted. Some people were scared. We shared our pics to each others. it was still mysterious. Most of the witnesses are kids playing in the playground with some adults. My friends also witnessed the craft. At night, i hear some voices i dont know what it was saying. It was just whispering and murmuring. That happening made me really scared that i hold the rossary and start praying. It only occured that night. I always dreamed that the craft had landed and when i woke up i was sweating. Im not that really scared but theres a few creep deep into me. I believe that they exist.... I was just thinking if that night the aliens are talking to me."],"Case Number":"16379","trends":["There have been 9 other sightings in Quezon City","There was one other sighting in Quezon City on or around March 4th 2009","This sighting has never been favorited.",""],"Latitude":"14.681561","Summary":"Large metallic disk shape object.","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Sighting Duration":"00:30:00"}