{"Date Submitted":"03/25/2009 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.293468,+-80.054763(16374)&iwloc=A&hl=en\"> mufon case (16374) map </A>","Log Number":"US-04022009-0007","Tags":"City","City":"Salem","Latitude":"37.293468","Sighting Duration":"Undisclosed","Disposition":"Unknown","Date of the Event":"03/25/2009 02:00 UTC","trends":["There have been no other sightings in Salem","This sighting has never been favorited."],"Longitude":"-80.054763","Viewing Distance":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16374.html.txt","/var/www/straped/mufon/org/16374.html"],"Source":"MUFON","Object Shape":"Unknown","divs":["Sighting Details It was on a clear day last week, around the 25th of March. I was standing next to my house, looking up at the sky, observing the chemtrails which I do often. It wasn't a heavy chemtrail day, just a couple of Xes and lines that were spreading out. Suddenly I noticed something moving quickly past the trails. My eyes focused on what I first thought was a flock of birds in the far distance. It looked like bunch of dots in a formation. I'm wasn't sure how many, maybe ten or twelve, because this formation of dots was moving very fast. When I noticed them, they were directly in front of me, but within 2 to 3 seconds they had traveled across the sky to my left until they vanished in the distance. I stood there a few minutes thinking about what I just saw, wondering what it could have been. If it wasn't for the speed, it could have been a flock of birds so far away that they looked like dots. Then I thought it could have been a group of insects that were quite close to me streaking by and staying in a perfect formation. Maybe a squadron of jet fighters? But there was no noise made by this UFO. I thought it couldn't have been any of these things because it was just moving to fast. I didn't think much more about my sighting until last night when I saw the photo of the London sighting. It appears to be the same kind of formation only closer to the viewer. Could it be that there's a UFO squadron speeding around globe? I think it's a possibility."],"Weather Factors":"None","Summary":"Looked like the London sighting, but streaked across the sky at incredible speed.","Region":"Virginia","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"16374"}