{"Weather Factors":"None","City":"Avon Park","Object Features":"None","Disposition":"IFO","Log Number":"US-04022009-0013","Date Submitted":"06/16/1997 02:00 UTC","Object Shape":"Fireball, Sphere","Viewing Distance":"501 Feet - 1 Mile","Region":"Florida","Sighting Duration":"00:30:00","Latitude":"27.628297","Date of the Event":"06/16/1997 02:00 UTC","divs":["Sighting Detailsi was driving west bound on highway 60 with the begining of avon park bombing range on my left south of me.i was a medical courier and had just made a delivery on the east coast i caNT REMEMBER WHERE.there was very little trafic hardly any thing but woods on both sides of the road.suddenly slightly in front of me and off to my left there appeared an orange ball of light it wasnt big or didnt seem to be like maybe a large flair it deffanitly seemed like some sort of fire source i felt like maybe it was emiting smoke but i didnt see any.after maybe about 5 minutes other fire balls showed up some were larger than the first one a few trucks and cars passed from the opposite direction i wondered if the were seeing what i was seeing.i felt like pulling off the road just to watch them but i kept going there must have been about 10 of them when i saw a car getting ready to pull into the highway from a dirt road to my right i braked and pulled up next to the car and got out and walked up to the car. there were about 3 or 4 people in the car i asked the driver what those things were in the sky he was dark complectioned and started speaking in spanish i speak a little spanish and i thought he said something about a hunting club in broken english.he wasnt much help so i got in my car and kept going.more light began to appear some even bigger than the previos ones. i would estimate that they were no higher than a mile and no more than a mile away from the high way.after about 10 or 15 more of driving some of the larger ones started to devide thats the only word i can think of to describe it sort of like cellulre division the middle of the fire ball became more narrow till it got to the point that one ball became two one verticly a short distance hihgher than the other.soon i would estimate that there were 20 of them with only 2 or 3 dividing.after about 5 or 10 minutes more of driving the werent in front of me any more but directly off to my left in another minute or so i came up upon a gas station that was closed bet still had its outside lights on i pulled into it and there was a station wagon with people in it. i got out of my car and walked up to a woman that was standing out side of the station wagon watching the lights there were 3 or four people inside the wagon i asked her what she thought those things where and she said she didnt know we watched in awe for maybe another 5 minutes. i asked her if maybe that there would be something about the lights in the news papers and she said o we will never know after a few more minutes one by one the lights went out.i was straining my eyes pretty hard as i watched them disapear and i thought i saw something like two blinking lights that seemed to be moving they were very dim like a very small distant star as all the lights disapeared the two separate blinking lights moved away till i couldnt see them.the whole scene seemed kind of an enjoyable event and i didnt feel threatened but i guess emotionally i was a little shaken up upon saying goodby to the people in the station wagon i continude west bound to my home on the west coast of florida.the rest of my trip was uneventful"],"Object Flight Path":"Stationary","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.628297,+-81.443225(16380)&iwloc=A&hl=en\"> mufon case (16380) map </A>","Case Number":"16380","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16380.html.txt","/var/www/straped/mufon/org/16380.html"],"Country":"United States","Summary":"Started with one then went to 20 or so.","Longitude":"-81.443225","trends":["There have been no other sightings in Avon Park","This sighting has never been favorited."]}