{"files":["/var/www/straped/mufon/html2text/16384.html.txt","/var/www/straped/mufon/org/16384.html"],"City":"Kelso","Disposition":"Unknown","Viewing Distance":"Unknown","Object Shape":"Bullet, Missile, Circle","Summary":"Ball of light zooms back and forth across the sky at unreal speeds and disappears.","Country":"United States","Region":"Washington","Case Number":"16384","Latitude":"46.146779","Longitude":"-122.908444","Tags":"City","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.146779,+-122.908444(16384)&iwloc=A&hl=en\"> mufon case (16384) map </A>","Weather Factors":"None","Date Submitted":"02/21/2001 09:45 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Source":"MUFON","divs":["Sighting DetailsMy boyfriend was driving me home from his house. We were sitting at a stop light waiting for it to change to make a left turn, when we both noticed a white light. It was a bright white circle, and it appeared to get bigger and brighter as if it were coming straight at us. It suddenly took a sharp left turn and at unreal speeds zoomed across the sky and disapeared. It looked like it left a light trail behind it as it moved which also disapeared almost immediatly. The stop light turned green and we took a left onto the bridge. The original sighting spot was now to our right. The light globe appeard again only on the opposite side from which it disappeared to. It appeared to travel in a giant circle, leaving the white light tail behind it. When I turned my head to look at my boyfriend, I noticed that all the cars on the bridge, as well as us, were at a complete stop, staring at this sight. After making about 3 circles, with out faiding or anything it just was gone, then suddenly appeared again in a different part of the sky, did a few more circles, then zoomed away leaving its light tail and was gone. We could not figuere out what we had seen. We thought of it maybe as airport lights or fireworks. But I dont know why anyone would be doing that extreme of fireworks, and the airport is miles and miles away. I started to cry because I could not explain what had just happened and it scared me. My mother and all my aunts tell me of stories of how they saw a ufo sitting in the parking lot of a local mark morris high school in longview washington, when they were very young. Probably around 1970. They described it as a disk with different colored lights flashing all the way around it then it went straight into the air and disapeared."],"Sighting Duration":"Undisclosed","Date of the Event":"02/21/2001 09:45 UTC","trends":["There have been 5 other sightings in Kelso","There were no other sightings in Kelso on or around February 21st 2001"],"Log Number":"US-04032009-0002"}