{"Case Number":"1638","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=44.842478,+-93.29218(1638)&iwloc=A&hl=en\"> mufon case (1638) map </A>","Object Features":"Undisclosed","City":"Bloomington","Disposition":"Unresolved","Tags":"City","divs":["Sighting DetailsFrom Report Writeup:Sighting Background===================I and the witness are both friends of another MN MUFON member. I was informedof the sighting by this mutual friend, who indicated that it would be OK tocontact the witness. I contacted and interviewed both witnesses on 27 February,2002. Both witnesses gave full form 1 reports. The primary witness also wrotehis description of the sighting in an attached writeup.Witness Description===================The witnesses are a couple that lives and works in the Bloomington area. Theprimary witness is a 25 year old male. His health, vision and hearing are allexcellent. The second witness is his girlfriend. She is 22 years old and hasexcellent health and hearing. She describes her vision as less than great(somewhat nearsighted). She was not wearing her glasses at the time of thesighting. Both witnesses indicate that they have had no health changes sincethe sighting. Both witnesses work at the same place, and both were there atthe time of the sighting.Sighting Account================The primary witness had left work to run a quick errand at a nearby store in thesame strip mall where he works. At about 5:30 PM CST, as he was walking betweenlocations, he looked to the southwest to observe a bright light which appearedto be stationary, about 45 degrees up in the southwestern sky. He felt that itseemed unusual not a star or airplane, and was curious about it. He watchedit for several minutes, as he walked back from his errand. The light wasbriefly obscured by a building and when it became visible again, he again saw itat the same location. Along with the first light, a second light was nowapproaching on an east to west path, from a location closer to due south. As he watched, the second light approached the first from the left (east) at asteady rate, and then merged with it. The first light remained at the samebrightness, and in the same location. He ran into work to get his girlfriend(the second witness). They both stepped outside to observe the light, whichremained motionless in the southwestern sky. They observed it for slightly lessthan a minute more, as it rapidly, faded out and was no longer visible.Object Description==================The primary witness described both objects as solid white lights, which thewitness described as about the brightness of the moon. [It was not clear whatthis meant, and therefore what the actual brightness was. However bothwitnesses felt that it was brighter than any stars present]. He indicated thatthey had an observable diameter to them. He also notes that at the end of thesighting, the remaining object faded from view.The second witness described the object (one object only, since the two lightshad merged by this time), as reddish and about the brightness of a star. Shewas not wearing her glasses at that moment, so could not discern any size to theobject. She observed it suddenly vanish it just wasnt there."],"Weather Factors":"Unknown","Sighting Duration":"00:10:00","Latitude":"44.842478","Viewing Distance":"Unknown","Source":"MUFON","Log Number":"","Date of the Event":"01/02/2002 05:30 UTC","Country":"United States","trends":["There have been 9 other sightings in Bloomington","There were 2 other sightings in Bloomington on or around January 2nd 2002"],"Object Flight Path":"Straight-line path","Date Submitted":"01/02/2002 05:30 UTC","Object Shape":"Unknown","Summary":"Bloomington, MN - distant NL/MA1 seen by two witne","files":["/var/www/straped/mufon/html2text/1638.html.txt","/var/www/straped/mufon/org/1638.html"],"Longitude":"-93.29218"}