{"Region":"Arizona","Date of the Event":"04/02/2009 09:27 UTC","files":["/var/www/straped/mufon/html2text/16387.html.txt","/var/www/straped/mufon/org/16387.html"],"Weather Factors":"Unknown","Summary":"Stationary bright white lights in a v formation.","Tags":"City","Object Flight Path":"Stationary","Object Shape":"Chevron, Star-like, Triangle","divs":["Sighting DetailsI was traveling on highway 70 outside of pima and noticed two lights that were appearing and then fading out over pima. I could not tell if they were attached to a craft or not. After I passed through pima a bright light got my attention above the horizon. As I turned to look six more lights showed up, three on each side of the first one making a v shape. I pulled the car over and grabbed my video camera and as I turned it on the lights faded out leaving only the original one which stayed on for several seconds longer. I wasn't able to get any video. The object was obstructing my view of the constelation Orion and I watched trying to see what was there, it was very dark but i would guess the overall size to be 300-400 feet and approx 1000 feet off the ground and silent. I couldn't actually see the craft however I began to drive and noticed that as my position changed I was able to stars the object was blocking. after driving about a mile I reallized the stars blocked were the constalation orion. I turned around and drove opposite the way I had came and sure enought the stars along orions belt were blocked from my view again untill I was about a mile past where I had originally stopped. I have no idea what could be so large and not move. Also the lights were very large and white had it not been for there size they could have easily been mistaken for stars and were situated in orions belt in a manner that could almost fit the stars positioning only the individual lights were much too large to pass for stars."],"City":"Pima","Source":"MUFON","Latitude":"32.057499","Object Features":"Unknown","Longitude":"-111.666072","Date Submitted":"04/02/2009 09:27 UTC","trends":["There have been no other sightings in Pima","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Log Number":"US-04032009-0005","Country":"United States","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.057499,+-111.666072(16387)&iwloc=A&hl=en\"> mufon case (16387) map </A>","Case Number":"16387"}