{"Sighting Duration":"00:05:00","Date Submitted":"09/30/2000 10:30 UTC","Longitude":"-93.447769","Object Features":"Wings","Source":"MUFON","Date of the Event":"09/30/2000 10:30 UTC","Disposition":"Unresolved","Summary":"Plymouth MN CE1 Triangular object at close proxim","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.010519,+-93.447769(1639)&iwloc=A&hl=en\"> mufon case (1639) map </A>","Weather Factors":"Unknown","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Country":"United States","divs":["sighting detailssighting background:i was contacted by the witness at the close of the minnesota mufon meeting indecember 2001, regarding this sighting. i interviewed her in january of 2002.witness description:the witness is a 79 year old female. she is a homemaker and retired bank andmortgage clerk. she indicates that her health and hearing are ok and her visionis correctable to 20\\20 using eyeglasses, which she was wearing at the time ofthe sighting. she describes her education level as a partial college education. she has extensively followed the ufo phenomenon in the last few years andindicates that she may have had a number of psychic and ufological experiences.sighting account:the witness was doing some quick household chores on the main floor of her houseat about 10:30 pm. she was momentarily standing on her back porch, which is onefloor above ground level, facing southeast. she indicates that she oftenobserves the sky, and at this moment, she looked up and observed a largetriangular object nearly due south in the sky at an elevation of about 50degrees or higher. the object moved out of her view so she ran into her living room, which has asouth facing window, and attempted to look up at the object. she was unable tosee it due to the overhang of the roof. she thus lost sight of the object atthat point.she felt that the total sighting time was under two minutes [cl estimate:probably less than one minute]. object description:she describes the object as being about six times larger than an aircraft wouldappear at that location. it moved slowly and silently in an east to west path. she did not know the elevation, and thus could not estimate its size, however,its angular size was larger than that of a garage about blocks away from whereshe stood [cl estimate, angular size would have been at least that of hand atarms length].the object was described as having at least three non-blinking blue lights oneach wing and one at the apex. the color was described as dark, but notabsolute black. the motion of the object was slow, smooth and silent."],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/1639.html.txt","/var/www/straped/mufon/org/1639.html"],"Log Number":"","trends":["There have been 6 other sightings in Plymouth","There were no other sightings in Plymouth on or around September 30th 2000"],"Region":"Minnesota","Latitude":"45.010519","City":"Plymouth","Case Number":"1639"}