{"Source":"MUFON","Region":"Arizona","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around April 2nd 2009"],"Date Submitted":"04/02/2009 12:00 UTC","Tags":"City","Weather Factors":"Unknown","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=32.231053,+-110.918409(16391)&iwloc=A&hl=en\"> mufon case (16391) map </A>","divs":["Sighting DetailsI was outside in my back yard. I always have my eyes to the sky and happened to have my camera in reach. This object was not blinking and flying away from me. (not airplane headlights) This could very well be the space station if it flew over Tucson around 6pm because it faded out like a sattalite would do as it rounded the earth. What has me perplexed is the way the photographs turned out. You know the classic squiggly lines of light that other people capture on film, I got some of those. Later I took more pictures of lights in the sky, such as airplanes and stars to see if the same effect was happening due to me either shaking my hands or the wind. I have one very focused photo that I distinctively remember holding my hands on the fence to steady myself. Still it was extremely \"wiggly\". I also have a few daytime photos of a cylinder type object that flew over Davis monthan airforce base here in Tucson and then over the flight line and dissappeared. I did not see it disappear beacuse i was trying to find it in my binoculars but my son Tyler said he saw it \"flash out\". One other one over the base, seperate incident, I was on my roof alone skywatching and saw what I thought was a firework or even a flare (being over the base and all) but this explosion was different. It seemed like a firework that exploded orange but before its full potential explosion size it was compressed into a flat line and then \"flashed out\". this made me get off of my chair I have up on the roof because a portion of this \"Explosion\" was obscured by a tree. As soon as I got up after the chair collasped on me, I steadied myself and it happened again a little to the left of the first one I saw. (About 3-4 seconds between the two of them)I would really like to know what that was. Me, being a UFO believer I would say that it looked like two spacecraft entering light speed over DMAFB. I don't have the knowledge to upload these pictures but I would like to get them in your hands."],"Case Number":"16391","Summary":"Went straight across the sky from NW to SE then faded out. Possible space station flyover. Big bright light.","Date of the Event":"04/02/2009 12:00 UTC","Latitude":"32.231053","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Features":"None","files":["/var/www/straped/mufon/html2text/16391.html.txt","/var/www/straped/mufon/org/16391.html"],"Country":"United States","Disposition":"IFO","City":"Tucson","Log Number":"US-04032009-0009","Viewing Distance":"Over One Mile","Longitude":"-110.918409"}