{"Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Sighting Duration":"00:00:20","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.857876,+-75.972095(16408)&iwloc=A&hl=en\"> mufon case (16408) map </A>","Longitude":"-75.972095","Date of the Event":"04/04/2009 09:00 UTC","Tags":"City","Summary":"A glowing object that went out but did not brake up.","Log Number":"US-04042009-0010","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around April 4th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy dad, my sister, and I were going out to the store, and just when we where driving out of the court I looked out the passenger window when I saw an object in the sky about the size of an oven. It was round-like. To me it looked like an egg of silly puddy when you flatten it slightly. The blunt end was going forwarded(or the front). At first it looked as if it might of been on fire, that lasted for about five seconds. It was a short tail only about three feet long and a orange glow, it came directly from the back not consuming the hole thing. Then it went out, but I could still see the silhouette of it of it because the end if it was still glowing vary slightly. It was going south south east, I saw the object for about ten minutes until it went behind the trees. It could not have been a shooting star I know because my dad used to be a meteorologist, and he has told me what a shooting star looks like, I have also seen a few my self. This thing I saw was too low, at about the hight of 90ft. Also if it was a shooting star when it went out that would mean it burnt up, but I saw it for about ten seconds after it stooped glowing, and it wasn't broken up. It might have been a low meteor, but I think thats a small chance."],"files":["/var/www/straped/mufon/html2text/16408.html.txt","/var/www/straped/mufon/more/16408_submitter_file1__IMG.jpg","/var/www/straped/mufon/org/16408.html"],"Date Submitted":"04/04/2009 09:00 UTC","Case Number":"16408","Object Shape":"Fireball, Oval","Latitude":"36.857876","City":"Virginia Beach","Country":"United States","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet","Region":"Virginia"}