{"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date Submitted":"04/02/2009 09:45 UTC","City":"Middle","Sighting Duration":"Undisclosed","Latitude":"39.082614","Disposition":"Unknown","Log Number":"US-04042009-0006","Weather Factors":"Unknown","Country":"United States","Object Shape":"Bullet, Missile, Sphere, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16403.html.txt","/var/www/straped/mufon/org/16403.html"],"trends":["There have been 2 other sightings in Middle","There were no other sightings in Middle on or around April 2nd 2009"],"Date of the Event":"04/02/2009 09:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.082614,+-74.823779(16403)&iwloc=A&hl=en\"> mufon case (16403) map </A>","Case Number":"16403","Longitude":"-74.823779","Summary":"Initial appearence of large number of low flying airplanes but unfamilliar light pattern and silent when passing overhead.","Region":"New Jersey","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","divs":["Sighting DetailsI had just returned to cape may court house from my college located in Mays Landing. I went to Arby's to pick up three of my friends and on our way back to my car we noticed an extremely bright light coming directly toward us. We were very alarmed at the brightness of the light and how low it was flying. All four of us stood outside my car and speculated on what kind of aircraft it was and it wasn't until it flew directly overhead that we suspected it may be something other than a conventional airplane. and certainly wasn't a helicopter either because as it passed overhead it made absolutely no sound whatsoever. What was even more interesting was when we noticed a second much smaller lighted craft that was traveling above the first craft at a 45 degree upwards angle traveling at exactly the same speed. The second craft had to be very small because it was not until the first craft flew directly overhead that we even noticed there was a second craft of some kind traveling above and behind the first craft. I know they were traveling at the same speed because the separation between them did not change. During this part of the event, we began to notice a great many more very similar looking craft flying EVERYWHERE we looked. This continued for over 3 hours and we had been traveling to various parts of the county throughout the night so it was not simply relegated to one area. These craft almost seemed to be tracking something, but if it wasn't for the first sighting we would have probably just thought they were low flying planes that were searching the area for something. I estimate sighting a craft about 30 times in the 3 hour period, but then we began to see the same type of craft when three of the four of us present during the original sighting began to see the same types of vehicles floating silently about the sky. This sighting took place in two places. The first was the Wildwood Villas, and here is where we witnessed many different strangely lit craft all scouring the area, and most peculiarly we witnessed a very bright white point of light hovering at about a 30-40 degree angle from our line of sight, and I'd say no more than 10-15 miles from where we stood. It was very low to the ground and considering the blanket of cloud cover over the area I find it difficult to believe it was a star or venus. Not to mention when we watched it eventually begin to move as the other craft did, but not before yet another of the silent craft flew directly overhead. Then we left the Villas and I took my friends back to their house in Whitesboro. There were the same flashing lights as before, only this time it looked as though the object was either two very closely approximated craft with the same light pattern, or one craft that was very rapidly shifting position. The lights appeared in one spot one second, and then seemingly defying the laws of physics the light would move 1 or 2 degrees to the left or right making it seem...you know what? I have no idea what to make of it. It was so unusual, and I would love to know what that and all the other craft in the sky really were. Then as quickly as they had appeared, the craft were gone and I did not see any more for the remainder of the evening. I wish my cell phone camera didn't have problems adjusting the light level enough to take a picture of what I was seeing. It was almost as though these craft were making an attempt to imitate commercial aircraft light patterns but terrestrial craft do not A: share such incredibly close airspace such as the very first sighting out in front of Arby's because of the very real danger of a midair collision. B the second smaller craft tracking the first was too small to even be an aircraft, and C aircraft and helicopters are not silent. I hope this report is detailed enough, but I would be surprised if you've received any other reports because of the flashing light pattern that could easily be explained away by saying they're merely low level aircraft. My friends and I however were lucky enough to get an overhead fly by and what we saw did not add up to anything that we have seen before. I live directly under multiple flight paths and I have seen planes and helicopters in the skies over my head for my entire life. This was not a plane. I have no asked my friends if they wish to publicly talk of this, but I am sure they will all anonymously confirm my report. But out of respect for them and their privacy I need to find out if I have their consent. If this is of significant interest you may contact me and I can most likely set up an interview with one or more of them. Two more things. I am unsure if there were actual planes in the area, because there were so many countless lights in the sky all flying in nondescript flight paths, so for the questions below I am going to say that some of these had to be airplanes because of the part of airspace my county sits underneath. Finally during the second night as the rapidly shifting lights on the craft flew overhead I was overcome with a very acute pain and stiffness in my right leg. This continued when I got back in my car and until shortly after I left. Yet unlike the first night, I was not as worried or afraid. By the time I got home, I was filled with an overwhelming sense of calm and serenity as though I had no reason to fear what i saw. My one friend seemed very frightened however. So much so that after the second night of sightings, he said he, \"wasn't touching that one.\" He didn't want to continue speculating on the objects origin or intentions in any way shape or form."]}