{"Date of the Event":"03/20/2009 07:57 UTC","Latitude":"33.648799","Disposition":"IFO","divs":["Sighting DetailsOn Friday March 20, 2009 shortly before eight pm I went outside to look at the sky. To my surprise I thought I saw a large white shooting star descending to earth. Lost sight of it behind a building.Almost instantly I saw it or something very similar shooting up from the same area I watched the object disappear. This object was white and arching up toward the south. As it gained altitude it seemed to have smaller shooting stars coming from the original object. It continued up until it disappeared. As soon as it disappeared another or the same object appeared traveling parallel to the ground producing smaller versions of itself until they too disappeared. This continued for approximately fifteen minutes and culminated in a white ball turning red with a green fuzzy area around it. This too faded from view then I saw an orange glow that consumed approximately ten percent of the southern sky. During the entire event I never heard a sound. Nor do I recall seeing the laddder in both pictures.I was not the only witness as someone sent in a report that very night form Peoria AZ. I did not have the digital Rebel XSI 12 mega-pixel with a 100-300mm lens at maximum extension. I grabbed my camera to take the attached photos but did not have a tripod available which resulted in the blurry photos. Multiple objects appear in the photos due to the length of time the shutter had to remain open to gather enough light. I did get some video but for some reason I can not send the files or copy them to a DVD."],"Region":"Arizona","Longitude":"-112.388778","Weather Factors":"None","Log Number":"US-04042009-0009","Object Features":"None","City":"Surprise","Summary":"Thought it was a large shooting star but soon determined it was very different.","Object Shape":"Circle, Star-like","Object Flight Path":"Path with directional change,Unknown","Country":"United States","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around March 20th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16407.html.txt","/var/www/straped/mufon/more/16407_submitter_file1__IMG_0008.JPG","/var/www/straped/mufon/more/16407_submitter_file2__IMG_0009.JPG","/var/www/straped/mufon/org/16407.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.648799,+-112.388778(16407)&iwloc=A&hl=en\"> mufon case (16407) map </A>","Tags":"City","Date Submitted":"03/20/2009 07:57 UTC","Case Number":"16407"}