{"Latitude":"39.772736","Case Number":"16405","City":"Indianapolis","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.772736,+-86.148814(16405)&iwloc=A&hl=en\"> mufon case (16405) map </A>","Object Features":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16405.html.txt","/var/www/straped/mufon/org/16405.html"],"Log Number":"US-04042009-0007","Date of the Event":"02/20/2009 12:39 UTC","Date Submitted":"02/20/2009 12:39 UTC","Weather Factors":"Does Not Apply","Region":"Indiana","Object Flight Path":"Hovering then path","Longitude":"-86.148814","Viewing Distance":"21-100 Feet","Source":"MUFON","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around February 20th 2009","This sighting has never been favorited.",""],"divs":["sighting detailson 02\\20\\09 at 1239am i heard what sounded like rumbling from thunder.i looked up from my front window and seen 2 huge unexplained air crafts (triangular in shape with blue and white lights in a circular motion with one center white light in front of craft in search or scanning mode.did not hear any noise from aircrafts) descending from the southwest in front of my house (approximately 150 feet above my neighbor's house) and began flying through the neighborhood not to far above the houses and flying north to south over shadeland avenue. notified impd to see if there was a search for a suspect with helicopters. they did not have anyone in the area. informed channel 13 as of today no results. no other witness accounts to my knowledge as of today. these air crafts were not helicopters even though they were flying in a search pattern.in addition to description there was a long rectangular box with small boxes red in color could have been their propulsion system on the rear of crafts. the approximate width was about 45 ft for each craft. i did not need binoculars to see them they were very close just above the neighbors house. when they descended one was on top of the other before they moved about the house\\tree tops searching\\scanning. no other sighting after 245am.i did not capture event on video nor photograph.if they return i will attempt to video record air crafts."],"Summary":"UFO sighting east side of Indy (Story posted on Roger Marsh site).","Tags":"City","Country":"United States"}