{"Case Number":"16415","Object Flight Path":"Undisclosed","Log Number":"US-04052009-0007","Longitude":"-76.79127","trends":["There have been 11 other sightings in Sunbury","There were no other sightings in Sunbury on or around April 4th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.872005,+-76.79127(16415)&iwloc=A&hl=en\"> mufon case (16415) map </A>","Disposition":"Hoax","Date of the Event":"04/04/2009 12:00 UTC","Latitude":"40.872005","Sighting Duration":"09:45:04","Date Submitted":"04/04/2009 12:00 UTC","City":"Sunbury","files":["/var/www/straped/mufon/html2text/16415.html.txt","/var/www/straped/mufon/org/16415.html"],"Viewing Distance":"Unknown","Summary":"Seen star like orb that became very bright after noticing it from my front porch","Region":"Pennsylvania","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","Object Shape":"Flash, Star-like","divs":["Sighting DetailsIt was 9:45 p.m. I decided to go out and stand on my front porch to see how cold it was out! The wind was really blowing and I decided to look up at the sky as I was looking I seen this orb type object moving as if it were a star but just as I seen it coming into view the orb became very bright for like 2 seconds and as it was moving it became dim again.I watched it as it faded away and dissipated it was no airplane nor any type craft that we have no noise or anything. The Orb looked like the very one's seen on You Tube and other web site's. It looked like the very one that me and my friend from Ohio seen out in my back yard over the past summer when we were setting on lawn chairs in my yard. He's a witness also to what we had seen up close I believe it's the same craft or just one of it's kind. I feel like they are observing either me and my family or just the area in general but the amazing thing that draws my attention is the very brightness that comes off the craft like they are trying to get my attention so I notice them Well Sam if you are reading this please give the people your testimony of what we seen over the summer in my back yard! If anyone has seen the same origin please contact me Jacob1973@msn.com Thank you"],"Country":"United States"}