{"Region":"California","City":"Los Angeles","Country":"United States","Date Submitted":"04/05/2009 02:30 UTC","Latitude":"34.058084","Tags":"City","Summary":"Daytime star-like object seen 3 times over LA.","Date of the Event":"04/05/2009 02:30 UTC","Longitude":"-118.242535","Log Number":"US-04052009-0008","files":["/var/www/straped/mufon/html2text/16416.html.txt","/var/www/straped/mufon/org/16416.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.058084,+-118.242535(16416)&iwloc=A&hl=en\"> mufon case (16416) map </A>","Object Features":"None, Unknown","Object Shape":"Star-like","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around April 5th 2009"],"Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Path then hovering","Weather Factors":"None","divs":["sighting detailsfor the third time in about 3 weeks, i've seen a star-like object in the middle of the day over la. today i saw it in the same area of the sky where i first saw it a couple of weeks ago. it looks like venus only it's sunny and bright out and the object moves slowly and appears to hover and then moves slowly. twice i've seen in from my neighborhood of montecito heights in the nw sky over la. it's either very high up or very small - i can't tell which. the first time i thought it was a balloon, but it moves too intentionally, and i saw it today in the same area of the sky. i watched both times for about 15 minutes while walking my dogs, and then lost sight of it behind trees in my hilly area. both times i relocated it in a different area and it appears dimmer and less bright and very hard to see. i can see airplanes flying in hte sky near it, but can't tell which is higher. the second time i saw a similar object in the morning over hollywood - my 6 yr old son saw it first, along with three commercial airplanes -one of which he referred to as a \"rocketship\" b\\c it was leaving very visible contrail and appeared to be \"going up\" from our vantage point. he pointed them out and said \"not the white thing in the sky - \"the rocketship\" sure enough, there was the star-like thing again - this time looking more white than \"bright\". it appeared stationary and appeared to be higher than the plane my son was watching. this object was a little larger than the star-like ones i saw. we watched it for about 5 min. until we lost it while driving. there is a fourth object that both me and my son saw about 6 weeks ago over glendale while driving about an hour before sunset. there were huge, puffy clouds in the sky, and he saw - and then i saw a small, round metallic looking object hovering in hte sky. there was a large cloud behind it so it popped out as being grayish\\metallic. a traffic copter flew towards us and was considerable lower than this object. i asked my son \"what is that?!!\" he said he didn't know. i tried to pull over to get a better look, but it disappeared. it was larger than a star, but still pretty small. it looked totally round - like a ball. my son seemed a little upset and didn't want to talk about it, and i didn't want to upset him. i've never had experiences like these before - never seen anything out of the ordinary. in all cases, i kept telling myself, these things are balloons. but i've seen them too often - esp the two star-like ones. my husband thinks i'm nuts. i keep thinking these are some kind of surveillance system."],"Case Number":"16416","Disposition":"IFO"}