{"Region":"California","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around October 27th 2008"],"Object Shape":"Triangle","Country":"United States","Case Number":"16413","Object Flight Path":"Other","Object Features":"Unknown","City":"Irvine","divs":["Sighting DetailsMonday, October 27th, 2008. I came home to my apartment (near the main campus of University of California-Irvine) from school later than usual (around 7:15 or so). It was foggy (more dense in some areas than others). I went into my apartment and did a few things and then decided to print some papers. I remembered that the printer in the graduate villa next door did not have any ink (I tried printing a few hours earlier). Therefore, I had to walk towards the main office (clubhouse). I walked outside along the main path between the apartment buildings and when I got to one of the entrances to the parking lot, I looked over to my left and saw a triangular shaped craft descend over the metal fence across the street. The craft was silent and had three, white, circular lights under it. The craft itself was a dull metallic, gray color(like the metallic color of the keyboard for the Dell Inspiron 1525) and the edges of the triangle were rounded, not pointed. The street that it flew across is not busy. It is only used by residents and shuttles for the residents. At the time, there was a field across the street where the University was clearing land for new apartments. I saw the underside of the craft and some of the back. From what I could see, it looked like it did not have significant height to it. It looked surprisingly flat. The craft did not look like someone could be inside of it, unless they were laying down. It must have flown very close to the tops of the apartment buildings judging from the angle and speed that it descended over the fence. The portion of the descent that I happened to see took about three seconds. It really surprised me because it was silent. I thought I was seeing a reflection in my glasses. However, the field was really foggy and I could see the craft correct itself and fly horizontal to the ground. I could see the lights under it illuminate the fog. It looked like a car's headlights shining in the fog pointing towards the ground (but the length of the light beam was not long enough to shine directly on the ground underneath). The craft did not stay level once it crossed the fence. It smoothly ascended, but was still pretty low for a flying object. This happened three to four seconds after the descent over the fence. The lights in the fog told me that I did not see a mere reflection in my glasses! I walked toward the field because the craft disappeared (which was probably due to the fog) but I did not see anything else. I stayed outside trying to look for it for the next 10 minutes, while I called my boyfriend and my friend to tell them what I saw. I later thought that since it did not have height -from what I could see, that it may have been controlled by a remote by the military. However, I don't know why the military would fly over a small construction site and fly so close to civilians' apartments especially if they had the technology to even make a silent craft. I would say all of this happened sometime between 7:50pm and 7:58pm EST."],"Weather Factors":"Unknown","Summary":"Triangle shaped craft, medium in size, three circular white lights under it, silent , dull gray color.","Log Number":"US-04052009-0005","Date of the Event":"10/27/2008 07:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.690807,+-117.789074(16413)&iwloc=A&hl=en\"> mufon case (16413) map </A>","Longitude":"-117.789074","Tags":"City","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16413.html.txt","/var/www/straped/mufon/org/16413.html"],"Latitude":"33.690807","Date Submitted":"10/27/2008 07:50 UTC","Sighting Duration":"Undisclosed"}