{"Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-04062009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=39.953745,+-75.158259(16418)&iwloc=A&hl=en\"> mufon case (16418) map </A>","Disposition":"Hoax","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Case Number":"16418","Source":"MUFON","City":"Philadelphia","divs":["Sighting DetailsI was in the second story of my house, master bathroom which is full of sky lights and windows. The bathroom over looks the back yard. Up in the sky I saw a blinking light that at first could have been what seemed like an airplane. The only thing is the light did not move. It kept blinking and was stationary and it was only 1 single white light. Airplanes and helicopters usually have more lights and move. When I first noticed it, it seemed to be two blinking white lights - one to the left and one to the right - and they never were 'on' or 'lit' at the same time. (Almost like either two objects or maybe a large object with a light first blinking on the right side then a light blinking on the left side.) I kept looking at it and then it was only one blinking light and it did not move. I went to the bathroom, came back and looked at it and it was still there blinking in same spot. I compared it to a tree branch to make sure it wasn't moving and it wasn't. It remained in the same location respective the tree branch. I was curious and searched for my shoes and was going to go out side to get a better look. I put my shoes on and went back to the window and it was gone. I went out side and didn't see it anymore."],"Object Flight Path":"Undisclosed","Latitude":"39.953745","Date of the Event":"04/06/2009 11:25 UTC","Tags":"City","Object Shape":"Circle","Longitude":"-75.158259","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around April 6th 2009"],"Summary":"Blinking light mechanical looking hovered outside window.","Country":"United States","files":["/var/www/straped/mufon/html2text/16418.html.txt","/var/www/straped/mufon/org/16418.html"],"Weather Factors":"Unknown","Date Submitted":"04/06/2009 11:25 UTC"}