{"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-04052009-0004","Tags":"City","Country":"United States","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around April 2nd 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.456456,+-99.726864(16412)&iwloc=A&hl=en\"> mufon case (16412) map </A>","Case Number":"16412","divs":["Sighting DetailsI was outside watering some new apple trees I had recently planted enjoying the darkness and cool breeze when a bright light in the sky caught my attention. Obviously Not a conventional aircraft because the speed was incredible. Not a metor, I see those here all the time. Fast moving silent object at approximately 10 thousand feet moving west to east. The object was large bright and starlike with no blinking red or colored lights that might indicate the miss identification of a conventional aircraft. The brilliant white object moved across half of the visable sky in level flight in less than 5 seconds. (Out here in West Texas the visible sky is vast and horizon to horizon without obstructions from tall buildings, trees etc, with local topography almost flat.) It then made a course correction bearing almost due east and then shortly therafter vanished or winked out. Commercial and military aircraft were in the same portion of the sky at the time of this strange sighting. Heavy B1 activity at Dyess Air Force base prior to the sighting with the roar of B1 takeoffs in the background during the sighting. Bright clear night with unlimited visability I live close to Dyess Air Force Base and I am used to seeing all kinds of aircraft during the day and night but this was something extraordinary. I observed a similar aircraft close to the base several months ago with similar flight characteristics"],"Object Shape":"Star-like","Summary":"Large bright white fast mover.","Date Submitted":"04/02/2009 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Texas","Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"04/02/2009 12:00 UTC","Longitude":"-99.726864","City":"Abilene","Latitude":"32.456456","files":["/var/www/straped/mufon/html2text/16412.html.txt","/var/www/straped/mufon/org/16412.html"],"Source":"MUFON"}