{"Latitude":"32.888188","Country":"United States","Object Features":"Window(s), Patterned Surface","Region":"Georgia","Object Flight Path":"Straight-line path","Date Submitted":"04/03/2009 07:38 UTC","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/16414.html.txt","/var/www/straped/mufon/more/16414_submitter_file1__0403091938a1.jpg","/var/www/straped/mufon/more/16414_submitter_file2__0403091939a1.jpg","/var/www/straped/mufon/more/16414_submitter_file3__11050808341.jpg","/var/www/straped/mufon/org/16414.html"],"Source":"MUFON","City":"Thomaston","Summary":"Shiny silver object silent with no jet stream and no wings.","divs":["Sighting Detailsi looked up to see a shiny silver rectangular object in the sky. sunlight was glinting off its surface. i was at work in thomaston , ga and had left the building to gather supplies from a storage building when i saw it. it was silent with no jet stream although it was lower than most jets fly i could see how large it was. it should have jet stream if it was a plane. i took four pics with my camera fone but was unable to id anything until i sent them to my e mail and could view the pics on the computer screen. i observed the object for less than one minute before it was out of view. i had hoped for a clear photo since i could see it clearly with the naked eye. of course when i was able to look at my pics on my email at home all thar could be seen were more \"blurry ufo pics\"! im not sure what made me look up and see the object unless it was the bright glare of sunlight glinting off the object. i looked at it for a few seconds then quickly snapped some shots with the camera fone. i was excited to have seen something unusual at that time of day."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.888188,+-84.326585(16414)&iwloc=A&hl=en\"> mufon case (16414) map </A>","Object Shape":"Bullet, Missile, Cigar, Square, Rectagular","Date of the Event":"04/03/2009 07:38 UTC","Case Number":"16414","Viewing Distance":"Unknown","Log Number":"US-04052009-0006","trends":["There has been one other sighting in Thomaston","There were no other sightings in Thomaston on or around April 3rd 2009","This sighting has never been favorited.",""],"Longitude":"-84.326585","Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply"}