{"Summary":"Several star-like objects east of Lake Elsinore.","trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around April 6th 2009"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.674717,+-117.323202(16426)&iwloc=A&hl=en\"> mufon case (16426) map </A>","Tags":"City","Disposition":"IFO","Date Submitted":"04/06/2009 01:08 UTC","Case Number":"16426","files":["/var/www/straped/mufon/html2text/16426.html.txt","/var/www/straped/mufon/org/16426.html"],"Weather Factors":"Unknown","Latitude":"33.674717","Log Number":"US-04062009-0009","divs":["Sighting DetailsThis is in regards to report 16425. I saw a very similar effect in the sky northwest of Lake Elsinore, CA. Several star-like objects (very bright) appeared about 15 degrees above the horizon. constantly moving, they would appear very bright, then fade and disappear, then get bright again. I was able to use binoculars to get a fairly good look at the objects. They looked like pelicans- they were very far away, and I'd estimate their altitude to be around 3500 feet. They would slowly circle- I could easily see them when they flew north, as they were banking to the left; the sunlight reflected off of them brilliantly. As they turned toward me, they became almost invisible, then would get brighter and brighter as they completed their circles. I observed them for several minutes. I had to confirm with my wife (life-long resident and bird watcher) and father-in-law (pilot) that pelicans can get that high. Both confirmed that they absolutely can, and are common in this area. The birds were so far away that without binoculars, it just looked like a slowly moving, tight formation of intensely bright objects that disappear and reappear without rhyme or reason."],"Longitude":"-117.323202","City":"Lake Elsinore","Region":"California","Object Shape":"Star-like","Object Features":"None","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Unknown","Source":"MUFON","Date of the Event":"04/06/2009 01:08 UTC"}