{"map":"<A HREF = \"http://maps.google.com/maps?q=33.416667,+43.3(16427)&iwloc=A&hl=en\"> mufon case (16427) map </A>","Date of the Event":"05/15/2005 02:34 UTC","Date Submitted":"05/15/2005 02:34 UTC","Region":"Al Anbar","Viewing Distance":"Unknown","divs":["Sighting DetailsAs Pilot in Command of a MedEvac UH-60A for a Medevac Helicopter Company I had transfered controls to my copilot to take a break from flying as we were on what is called a \"Milk Run\" from Al Asad Airbase to Balad Airbase and back to Al Asad. These milk runs are done either really late at night or very early in the morning. Flight took place May 15th 2005 aprox 2:30 am as written in my logbook. We had completed most of our flight and were in between Ar Ramadi and Lake Tharthar heading west towards Al Asad. Flight was under ANVIS 6s. Shortly after the transfere of the flight controls I looked up through what we call the \"Green House\" a plexi-glass window above the pilot and copilot stations in the helicopter and located a triangular object with five lights along the point and forward portion of the object. Object was observed moving at high rate of speed coming from the south heading towards the north at what I would estimate FL300. Object stayed in sight under night vision goggles for approx 1 min then went out of sight as we continued flying west. We were at an altitude of 300ft as night restrictions in Iraq apply. Once we landed I took a look at the daily flight scheduel for all multi-national forces in Iraq to make sure what I observed was not an aircraft, no aircraft were operating in the area at the time of the sighting. I did not mention the incedent to any other pilots from fear of ridicule. I had always thought that as a pilot if I saw a UFO I would tell everyone but when it happened I could not bring myself to speak of it. Now I want to know whats going on in the skies over Iraq as other soldiers have seen strange phenomena under NVGs."],"Object Features":"Undisclosed","City":"Al-Ramadi","Sighting Duration":"00:01:00","Disposition":"Unresolved","Tags":"City","Case Number":"16427","Country":"Iraq","files":["/var/www/straped/mufon/html2text/16427.html.txt","/var/www/straped/mufon/org/16427.html"],"Summary":"Triangle UFO spotted under NVG.","trends":["There have been no other sightings in Al-Ramadi","This sighting has never been favorited."],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Log Number":"IQ-04062009-0010","Object Shape":"Triangle","Longitude":"43.3","Source":"MUFON","Latitude":"33.416667"}