{"Date of the Event":"04/05/2009 11:15 UTC","Latitude":"33.728704","Longitude":"-116.367386","Object Flight Path":"Stationary,Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=33.728704,+-116.367386(16425)&iwloc=A&hl=en\"> mufon case (16425) map </A>","trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around April 5th 2009"],"Log Number":"US-04062009-0008","Weather Factors":"None","Date Submitted":"04/05/2009 11:15 UTC","Sighting Duration":"Undisclosed","Country":"United States","City":"Palm Desert","Source":"MUFON","Case Number":"16425","files":["/var/www/straped/mufon/html2text/16425.html.txt","/var/www/straped/mufon/org/16425.html"],"Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsOn family vacation in Palm Desert. Out for a walk alone on the sidewalks near a golf course. Not a cloud in the sky; sun fairly high and bright. I heard a loud commercial plane overhead and looked up to see it. In the far background, behind the plane, I saw a bright glint of sunlight off an object. I focused on the object and it was a speck of light. I believe it was north to north east of my position in Palm Desert, very high in the sky, likely 75 degrees or so above a horizontal sight line. I immediately thought of a supernova, bright enough to see in the daylight. I continued to view this spot, thinking I was in on a spectacular event. I then sensed that the object was moving very slowly in the sky. I move a few feet down the sidewalk to put a tree, about 20 feet high, within my frame of view. The wind was very light to non-existent, so the branches on the tree were not moving appreciably. When viewed next to a limb of this tree, the object definitely was moving as it slipped behind the limb. I moved back clear of the limb and reacquired the object. It stopped moving, hovered for a few seconds, then reversed course, not quite 180 degrees. It moved in this new direction for a few seconds, then started moving in various directions, almost as if doing figure eights. At that time, a golf course worker in a golf cart came by. I asked him to look at the object to confirm it. When we both looked up again, neither of us could see it. Feeling slightly foolish, I continued my walk. I could not help looking up as I walked, however, hoping to see it again. A minute or so after I starting walking again, I saw the object at about the same spot in the sky. This time, however, there were at least five other similar objects in a loose configuration with each other. I blinked my eyes and rubbed them to make sure I was not seeing things. I was not. The objects persisted, moving together in a direction I perceived to be west to north west. Two of the objects started to move close to each other, but then moved away just before converging. I continued to watch these objects move slowly until they simply dissolved from view, as if suddenly moving directly away from me out of my range of acuity. There were no contrails associated with these objects, even though I saw several high-flying commercial craft trailing contrails in all parts of the sky. I only saw one glint of sunlight, off the original object, but it was bright enough to be an unmistakeable reflection of sunlight. I considered the objects to be balloons, but could not explain the irregular, seemingly controlled movements of the first object that I spotted and the actions of the two other objects closing with each other and then separating."],"Object Shape":"Star-like","Object Features":"None","Region":"California","Tags":"City","Disposition":"IFO","Summary":"Daytime stars at very high altitude."}