{"Weather Factors":"Windy","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Channahon","There were no other sightings in Channahon on or around September 15th 2008","This sighting has never been favorited.",""],"Latitude":"41.429475","Source":"MUFON","Date Submitted":"09/15/2008 10:00 UTC","Object Shape":"Cylinder","Object Features":"None","Summary":"Saw a cylinder-shaped object twice moving erratically and disappearing.","map":"<A HREF = \"http://maps.google.com/maps?q=41.429475,+-88.228674(16424)&iwloc=A&hl=en\"> mufon case (16424) map </A>","Disposition":"Unknown","Date of the Event":"09/15/2008 10:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Log Number":"US-04062009-0007","Tags":"City","divs":["Sighting DetailsI was at work at the exxon-mobil refinery, a crew of about 6 or so carpenters was dismantling a scaffold on the east coke heater.I was in the middle on a passing chain when we stopped for a few minutes to take a break. I was about 40 feet in the air on a scaffold deck and was just kind of looking at the sky when I noticed a vulture circling. As I was watching the bird, I noticed behind it and behind a passing cloud, an object that was cylindrical and sat perfectly still in an otherwise very windy sky. As I watched, it moved right and left very ridgidly and I could see it glimmer slightly.It was mostly dark in color but when it moved, it would glint off the sun alittle. I watched it for about 10 minutes and it moved to the west very rapidly in a straight line, turned at a 90 degree angle, went straight up in the sky and disappeared. I kept looking to see if it would come back and about 15 minutes later, I saw it again over to the east of the refinery, repeating the moves it had done before. This time it started to move southwest against the prevailing winds, it picked up speed very rapidly and was gone in an instant. I told a good friend of mine what I saw, and he said he believed me. Later as we were back in our material yard on the north side of the plant,he (Brian),said to me that he had just seen something similar to what I had just seen on the north side of arsenal road, hovering over the Desplaines River. It hovered and disappeared after a cloud passed it. I know this object was no aircraft becaused it stayed perfectly still in a very windy sky, moved very ridgidly, accelerated very fast and manuevered in 90 angles. I called MUFON the next day and left a voicemail about what I had saw, but never got any response. This object appeared to be surveying the construction that was going on at the refinery. It was observed by me and my friend in three directions, directly near the new constuction project."],"Longitude":"-88.228674","City":"Channahon","Country":"United States","Case Number":"16424","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16424.html.txt","/var/www/straped/mufon/more/16424_submitter_file1__GoogleEarth_Image.jpg","/var/www/straped/mufon/org/16424.html"],"Region":"Illinois"}