{"Weather Factors":"Windy, Medium","Log Number":"US-04072009-0007","Object Flight Path":"Other,Unknown","Viewing Distance":"501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.144522,+-118.982724(16439)&iwloc=A&hl=en\"> mufon case (16439) map </A>","Case Number":"16439","Longitude":"-118.982724","Disposition":"IFO","Source":"MUFON","trends":["There have been 17 other sightings in Thousand Oaks","There were no other sightings in Thousand Oaks on or around December 9th 2008","This sighting has never been favorited.",""],"Date of the Event":"12/09/2008 06:01 UTC","Tags":"City","Region":"California","files":["/var/www/straped/mufon/html2text/16439.html.txt","/var/www/straped/mufon/more/16439_submitter_file1__A087.jpg","/var/www/straped/mufon/more/16439_submitter_file2__A088.jpg","/var/www/straped/mufon/more/16439_submitter_file3__A089.jpg","/var/www/straped/mufon/org/16439.html"],"Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Unknown","Summary":"8 lights. 5 red and 3 white.","City":"Thousand Oaks","Date Submitted":"12/09/2008 06:01 UTC","divs":["Sighting DetailsI can send you the pictures. I copied them on a CD. To what address do I send them? (I will try to send them to you via \"attachments\" thing below.) On December 9, 2008, there was a fire in Thousand Oaks. I went there and took pictures. I got a \"shakey hands\" warning from my camera, and I could see on the display that the pictures were out of focus. I didn't have much interest in them. Lately I felt a need to get my personal pictures off my computer at work. I was going to burn them on a CD. I looked through the pictures, wanted to delete any duplicate shots. When I saw the picture, I was puzzled. I can not imagine what makes the appearance of these lights up in the sky. On the day that I took the pictures, my first vantage point was a dud. So I hopped in my car and drove around until I found a better view. Even at that, trees were in the way ... by the time I found a good spot, it was getting late, losing sunlight. I remember the flames of the fire suddenly seemed to burst up. It was like when you light a gas stove and the fire erupts with a burst. The fire did a burst; then it quickly fizzled out to glowing embers. \"Oh well,\" I thought, \"show's over.\" Maybe you can determine a logical explanation for the lights. Or at least rule out, \"dirty lense, etc.\""],"Object Shape":"Other","Latitude":"34.144522"}