{"Date of the Event":"06/15/1996 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.958015,+-82.447468(16445)&iwloc=A&hl=en\"> mufon case (16445) map </A>","Log Number":"US-04082009-0005","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"27.958015","Country":"United States","Viewing Distance":"21-100 Feet","Date Submitted":"06/15/1996 12:00 UTC","Tags":"City","Region":"Florida","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/16445.html.txt","/var/www/straped/mufon/org/16445.html"],"divs":["Sighting DetailsI remember everything accept the exact date, accpet in was in 1996. I lived with my parents at the time and I was watching Jay Leno, so it was just after 11:30pm and power went out. I was the only one up. So I went to the kitchen to get some water and looked out the windows and saw a light flying around. Did not think much of it. Helicopter probably. So went back to my room and power was restored minutes later, as I comfortable again the power went out a second time. I was already into UFO's too so that got me worried and excited as I went back to the kitchen and there was light, which I could tell the shape at that time still. So back to my room and for the 3rd time the power goes out. That's it I go back to the kitchen to observe. The light seems to be coming my way along our main road called Henderson, so lost site of it and walked outside under out walkway I froze, this huge object, could of been the size of the space shuttle or a blimp, but it was lit up like a christmas tree and not one sound came from it. I kept thinking it was military only because it was flying right in directon MacDill Air Force base. I was once stationed at Ft. Bragg and saw all kinds of military helecopters flying at night and this could of been what I saw. I just watched it slowly cruise by and it went on it's marry way to the south flying just above tree level. I told some people at work the next day and got laughed at. So I just deciced to tell my closet friends afterwards. Later on in the year though I was at my friends house and watching channel 8 news and they showed short clips that years UFO sightings and someone filmed what I saw. I have watched tons of UFO documentrys and searched the interent high and low for what I saw and the attached pic is the comes the closet. Would love to hear back if you guys have heard of this one. Mark"],"Weather Factors":"Unknown","Summary":"Looked a little like something out of Star Wars, the imperial ship.","City":"Tampa","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Other","Disposition":"Insufficient Data","Longitude":"-82.447468","trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around June 15th 1996","This sighting has never been favorited.",""],"Case Number":"16445"}