{"Longitude":"-82.709937","Date Submitted":"04/07/2009 12:45 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Region":"Florida","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=28.251507,+-82.709937(16442)&iwloc=A&hl=en\"> mufon case (16442) map </A>","Date of the Event":"04/07/2009 12:45 UTC","Viewing Distance":"Unknown","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsI was driving south on Madison St on my way to an appointment at the hospital on that same street street. I was just a few yards from the entrance to the hospital parking lot when I thought to look up. Recently, I have become very interested in the UFO phenomenon and have been trying to pay more attention to the skies. I looked up through my windshield looking south. It was then that I spotted what at first appeared to be a plane. But, the more I looked at this object, the more I became aware that it could not be a plane. The object was silver in color and reflecting the sun. It was heading from east to west, toward the Gulf of Mexico. It's difficult for me to judge the distance from the ground that the object was flying because the whole sighting only lasted about 10 seconds. Though, it did appear to be at an average height of normal small aircraft. When I first noticed the object, I initially thought it could be a smaller plane. It appeared to be larger than if it were a commercial aircraft due the altitude in which commercial aircraft are normally seen. It's also hard to judge the size of the object since I was not able to determine its altitude. As I watched the object I leaned back a little so that I could view it through the sunshade section of my windshield that runs across the top. I did this because the glare of the sun reflecting off the object was very intense. It was at that moment that I noticed I could not see as much of the object as I could just a second before. I then leaned forward to again view it through the unshaded part of my window. That was when the object appeared to be dematerializing right before my eyes! At first it seemed as though half the object had vanished. As I watched in amazement, driving very slowly down the road, the object became completely invisible. There were no clouds in the immediate vicinity of this thing so it didn't go behind them. I first thought it might be a plane but, I don't recall seeing very many silver, shiny airplanes. I live in airport community, so I see a variety of airplanes regularly. And I can say without a doubt that this thing did not get lost from my line of sight, fly behind a cloud or anything logical. It simply vanished into thin air as I watched it! I stopped looking for this thing so that I could park my car in the parking lot of the hospital. Once I had gotten out of my vehicle, I immediately began searching the sky for any trace of what I had witnessed. If it had been a plane, it should have still been in my field of view. As I looked all around the sky above me and in the area the object appeared to be heading, I could see nothing even remotely resembling this thing. I searched the skies until I had to get inside the building in order to make my appointment. This is the very first time that I have seen something that defies explanation or logic. In fact, this is the very first UFO experience of my life."],"Case Number":"16442","files":["/var/www/straped/mufon/html2text/16442.html.txt","/var/www/straped/mufon/org/16442.html"],"Summary":"Object disappeared!","City":"New Port Richey","Weather Factors":"Windy","Object Shape":"Disc","Latitude":"28.251507","Disposition":"IFO","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around April 7th 2009"],"Log Number":"US-04082009-0002"}