{"Weather Factors":"None","Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.294365,+-91.257386(16450)&iwloc=A&hl=en\"> mufon case (16450) map </A>","Object Shape":"Cigar","Object Features":"Unknown","Summary":"Cigar shaped craft over Lake Superior witnessed by several creditable people.","Date Submitted":"07/31/1972 11:00 UTC","files":["/var/www/straped/mufon/html2text/16450.html.txt","/var/www/straped/mufon/org/16450.html"],"divs":["Sighting DetailsI'm submitting this report for my Grandparents, who are the most credible witnesses you could ever ask for. My Grandmother is a P.h.d. who taught at Valparaiso Indiana University. At the time of this sighting she was a member of a traveling Christian folk gospel band, the \"Cross Bearers.\" My Grandfather (who was driving her touring bus at the time) is a Lutheran Minister. The following is his report, as I requested of him through email: We seem to remember that our sighting near Silver Cliff, between Silver Bay and Two Harbors, was in August 1972. We were just coming back from a Concert tour of Grandma's \"Cross Bearers\" singing group. It was very late (around midnight) and I was driving the bus around Silver Cliff. Many of the girls were sleeping, but a couple of the girls shouted out, \"UFO, there's a UFO out there!\" We all looked as I slowed the bus down. We only had a quick glimpse, since I couldn't stop the bus in the traffic. We remember it looking like the body of a wingless DC 10 or a 747 with lights shining around circumference. It was suspended above the water and we were looking down on it. By the time I got the bus stopped in a safe place. We could no longer see it. We heard that the men working on the loading dock at Taconite Harbor (about 30 miles from where we saw it) saw the same phenomenon. Also people witnessed it from up on Good Harbor Hill near Grand Marais. You have to realize it was at least 37 years ago, but we still have a vivid memory of seeing something unusual."],"Log Number":"US-04092009-0001","Sighting Duration":"Undisclosed","Longitude":"-91.257386","City":"Silver Bay","Date of the Event":"07/31/1972 11:00 UTC","Region":"Minnesota","trends":["There have been no other sightings in Silver Bay","This sighting has never been favorited."],"Object Flight Path":"Stationary","Country":"United States","Source":"MUFON","Case Number":"16450","Viewing Distance":"Unknown","Latitude":"47.294365"}