{"Weather Factors":"Medium","Sighting Duration":"Undisclosed","Summary":"Triangular craft wanted attention - Rt.11 - SC","Date of the Event":"03/09/2009 11:30 UTC","Object Shape":"Triangle","trends":["There have been no other sightings in Ashville S.C.","This sighting has been favorited 1 time."],"Date Submitted":"03/09/2009 11:30 UTC","City":"Ashville S.C.","Log Number":"US-04092009-0002","files":["/var/www/straped/mufon/html2text/16451.html.txt","/var/www/straped/mufon/more/16451_submitter_file1__ufo1.jpg","/var/www/straped/mufon/more/16451_submitter_file2__ufo2.jpg","/var/www/straped/mufon/more/16451_submitter_file3__ufo3.jpg","/var/www/straped/mufon/org/16451.html"],"Latitude":"35.030327","Object Flight Path":"Straight-line path","Country":"United States","Source":"MUFON","Case Number":"16451","Object Features":"None","Disposition":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.045639","Region":"South Carolina","divs":["Sighting DetailsApproximately 11:30 PM Monday March 9, 2009 A friend and I were driving from Atlanta to Asheville, NC via Rt.11 in South Carolina. We were in separate vehicles and I was following behind him. I saw what I assumed was the light of a plane a couple of miles in the distance, not paying it much thought. Suddenly from over the tree-line to the right of us a massive triangular craft turned on it's own axis up onto it's side right above us exposing lights all the way around the edges. My friend and I both instantly swerved thinking a plane was crashing into the road. We decelerated a bit to get a better look as this thing floated slowly and silently right over our vehicles, crossing the road diagonally. If we had stopped, we could have literally thrown a rock at it. It couldn't have been, at it's lowest point, more than 25 feet above us. I hit my brakes to take a look before it was out of sight. The moon was behind some thin clouds and illuminated them enough for me to see the silhouette of this thing go from the vertical position back to a parallel position with the ground. I clearly saw three lights on each corner of an equilateral triangle. We went over a hill and it was out of sight. With no phone service, I signaled for my friend to pull in to the next store we approached. We were both speechless. We made sure we both saw the same thing and indeed we had no explanation of what he had just experienced. We both described feeling a bizarre sense of fright as it passed over us. I asked a local man who pulled into the parking lot if he had seen anything strange in the sky, expecting him to look at me like I was crazy. He quickly said there is a Cessna Sea Plane flying over the tree-lines. I told him what I saw and he assured me it was a Sea Plane. I am not an aircraft expert, but I am not an idiot either. This was no conventional aircraft. Point 1: As slowly as it was traveling it would have fallen out of the sky. Point 2: As close as it was, we would have heard a sound. Point 3: It was a perfect equilateral triangle. On my way back to Atlanta, I stopped at a gas station near where we had seen it and spoke with a Pickens County Sheriff. I asked if there were any bases he knew of in the area that would be testing aircraft. He asked why I was curious, and I was hesitant to tell him. At first he asked if I was messing with him and I assured him I was not. He said he had never heard of such a craft. I made a 3d rendering of the sighting in SketchUp and took snapshots of the viewing angle. In the pictures it appears to be daylight but that's because I don't know how to make night in Sketchup. I can only speculate as to what it was. I guess I'm more curious to know why it made such a spectacle of itself, and who was driving... I have never been into sci-fi and it does not interest me in the least. But I know that what I saw was not fictional. I guess it's different when you see it for yourself."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.030327,+-82.045639(16451)&iwloc=A&hl=en\"> mufon case (16451) map </A>"}