{"Summary":"Bright white/silver light.","Latitude":"-10.283333","files":["/var/www/straped/mufon/html2text/16455.html.txt","/var/www/straped/mufon/org/16455.html"],"Tags":"City","Viewing Distance":"Unknown","Log Number":"PR-04092009-0006","trends":["There has been one other sighting in Combate","There was one other sighting in Combate on or around April 4th 2009"],"Weather Factors":"Unknown","Object Features":"None","City":"Combate","map":"<A HREF = \"http://maps.google.com/maps?q=-10.283333,+-62.966667(16455)&iwloc=A&hl=en\"> mufon case (16455) map </A>","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Date of the Event":"04/04/2009 08:00 UTC","Case Number":"16455","Date Submitted":"04/04/2009 08:00 UTC","Longitude":"-62.966667","Source":"MUFON","Region":"Rondônia","divs":["Sighting DetailsOn my recent visit to the town of Combate, near the famous light house on the southwest coast of Puerto Rico, at 8 p.m. I was walking towards my car and I saw two family members noticing a distant bright light approaching directly at us. It was traveling from east to west at about the same rate of speed as a helicopter. I thought this was an airplane with its landing lights on at first. The light was much brighter than any stars around it and was not flickering. No blinking lights or sounds were noticed. It was very steady and moving in a straight line towards us. I ran inside to get my camera as it did not look like anything I had seen before. As soon as I came back out the object was almost directly over us and as I looked up the object took off at an incredible rate of speed straight up. Almost as if the light just went out. It was not seen again. I wasn't able to determine if this was a large object at a very high altitude or a smaller object at a low altitude. I would have to guess this was at an altitude a helicopter would normally travel. I don't know what this was, but I can say this was not an airplane or helicopter or any other type of flying craft I'd ever seen. This thing just went from moving slowly, steadily overhead to gone in less than a second. At first, I was very excited that I may have just seen for the first time in my life a real UFO!! Later on that night as I replayed the event over and over with my family and friends, I was actually a little disturbed and scared at times that I had witnessed something I could not explain, maybe even something from another world? I think about it several times a day still."],"Country":"Brazil","Disposition":"Unresolved"}