{"Summary":"Subsonic type sound directly above my house, woke me up out of a sound sleep, the whole bed and my self felt the vibration and then it was gone.","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around January 15th 2009"],"Date Submitted":"01/15/2009 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.733902,+-104.82721(16452)&iwloc=A&hl=en\"> mufon case (16452) map </A>","Disposition":"IFO","Longitude":"-104.82721","divs":["Sighting DetailsI was sound asleep,about 2 - 2:30 in the morning and was awakened by this sound.\"subsonic\" seems to describe it. It was not like the backfire of a car, or a sharp sound like the breaking of the sound barrier, both of which I would recognize. and at the same time my body felt it had just been dropped back into my bed,(but I was completely under the covers)or I was just feeling the vibration of the \"boom\" .The sound was just above my house. My bedroom is on the second floor. The impression I got was that something was just lifting off above the house right above my bedroom and then it was gone. I realized that something out of the ordinary had occurred but I did not get up and look out the window. I turned over and went back to sleep. This type of event has never occurred before. I am not claiming an abduction. I did not report this before, until I read another reporting by an woman whose felt a \"virbration\" inside her house and an electrical interference with her television and stepped outside and had a sighting, so thought I should probably share this experience."],"Date of the Event":"01/15/2009 12:00 UTC","Region":"Colorado","Log Number":"US-04092009-0003","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Latitude":"39.733902","files":["/var/www/straped/mufon/html2text/16452.html.txt","/var/www/straped/mufon/org/16452.html"],"Object Shape":"Unknown","Tags":"City","Viewing Distance":"Unknown","Case Number":"16452","City":"Aurora"}