{"Viewing Distance":"Unknown","Date of the Event":"04/09/2009 12:00 UTC","divs":["Sighting DetailsI was driving north on I-25 near Berthoud. I was admiring the sun setting behind Longs Peak, so this occurred within a few minutes of sunset. I looked to the north west about 15 - 20 degrees of Longs Peak when I noticed a small silver dot in the sky, within about a minute it grew, about triple it's original size. Picture a pencil eraser about 20 feet away, that's about how big this silver object grew. I noticed the silver color, there appeared to be no reflection from the sunset. It was a sphere, and it was present for about 3 minutes, when it shrunk in size and disappeared. A couple of minutes later I noticed an airplane, about 15 degrees further north from where I saw the sphere, It's contrail was visible but the plane was very very small. The plane was about one quarter the size of the sphere at it's largest. I watched the sky for a few minutes longer, while trying to still drive, but did not see this again. Could this simply have been a refraction of a reflection of the sunlight off of the plane? I don't know. I'm curious. Never seen it or heard of anything like it."],"City":"Berthoud","Country":"United States","Object Features":"None","Region":"Colorado","Case Number":"16463","Disposition":"IFO","Tags":"City","Log Number":"US-04102009-0001","Object Flight Path":"Other","Longitude":"-105.076692","trends":["There have been 3 other sightings in Berthoud","There were no other sightings in Berthoud on or around April 9th 2009"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.310557,+-105.076692(16463)&iwloc=A&hl=en\"> mufon case (16463) map </A>","Object Shape":"Sphere","Summary":"A small sphere appeared right at sunset for 3 about minutes then disappeared.","files":["/var/www/straped/mufon/html2text/16463.html.txt","/var/www/straped/mufon/org/16463.html"],"Latitude":"40.310557","Date Submitted":"04/09/2009 12:00 UTC"}