{"Sighting Duration":"Undisclosed","Date Submitted":"04/07/2009 10:00 UTC","Object Shape":"Unknown","trends":["There have been 4 other sightings in Emerald Isle","There were no other sightings in Emerald Isle on or around April 7th 2009"],"Object Features":"Unknown","Summary":"Lights appeared from SE to SW and regrouped due South over the Atlantic.","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.67794,+-76.950776(16467)&iwloc=A&hl=en\"> mufon case (16467) map </A>","Object Flight Path":"Stationary","Tags":"City","Case Number":"16467","Country":"United States","Log Number":"US-04102009-0005","City":"Emerald Isle","Disposition":"IFO","Latitude":"34.67794","Region":"North Carolina","Weather Factors":"Windy","Date of the Event":"04/07/2009 10:00 UTC","divs":["Sighting DetailsThe beach house we are renting for the week does not permit smoking inside, good for them. Therefore, I went outside around 10pm for a cigarette before bed. The time was somewhere between 9:50 and 10:20 pm the evening of the 7th. The deck faces due South and I'd observed the Big Dipper up over my left shoulder a hands width above the house next doors' roof line. I looked towards the moon coming up which was approx in the 10 o'clock position in its' travel across the Southern sky. Out of the corner of right my eye I saw and directed my vision towards a pair of red lights which seemed to just \"appear\". I recall thinking I should have noticed them coming from some where, dropping from the sky, hearing yet another one of the MANY aircraft from one of the Marine Air Bases or the Air Force Base(Seymour Johnson) in Goldsboro, NC that had been around that day and while considering this, they winked out. By winked, I mean it didn't just disappear but rather faded quickly. It seemed to have a white-ish center that was wavering as does heat waves over a runway but the dominant color was red as is an aircraft's running light. I have been around military aircraft for over 39 years and can I.D. over 40 at a glance. THIS WAS NO AIRPLANE, JET AIRCRAFT, OR HELICOPTER, (nor were they Osprey aircraft which could be from Cherry Pt., MCB Lejeune, or New River MCAS which lie to the Northwest and Southwest from here respectively). Being as versed as I am in Military air I can comfortably say these had no relation to any known vehicle, or method of flight. In Brief: In all, I believe there were three separate \"lights\". One to the SE, and two to the SW. All showed themselves a total of three times until they were grouped the closest together in what may have been a triangular formation and then \"winked\" out. In Detail: After getting my attention then disappearing, a second pair, of lights or more likely the same pair repositioned, appeared a little more to the South with one more in the foreground than the other. These too faded quickly after perhaps 2-3 seconds and I called my son out. My son is 19 and will be in the Marine in about 3 weeks. He too saw what came next, and last. Just prior to his making it out the sliding glass door, the only light to appear to the Southeast appeared in the distance and then went away quickly lasting the same 2-3 seconds. All of these lights had a dominant red appearance overall with a white-ish middle that you could not focus on (too fast and \"wavy\"). The last episode has all three of the lights that had shown themselves grouped due south with one in the foreground, one well behind and to the right (west) and one in-between distance-wise and farther west. If I were looking down from above they may have represented the points of a triangle with the base at an angle from NE to SW and the third point to the west. They remained in this configuration for the same 2-3 seconds and were gone. I had hoped for a subsequent showing another night, but as yet no reappearance has been made. I called the newspaper and inquired, but no other reports have been made."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/16467.html.txt","/var/www/straped/mufon/org/16467.html"],"Longitude":"-76.950776"}