{"Longitude":"-82.756768","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=28.146125,+-82.756768(16461)&iwloc=A&hl=en\"> mufon case (16461) map </A>","Region":"Florida","Object Features":"Undisclosed","Latitude":"28.146125","Source":"MUFON","Case Number":"16461","City":"Tarpon Springs","trends":["There have been 7 other sightings in Tarpon Springs","There were no other sightings in Tarpon Springs on or around April 8th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was photographing an eagle with my Nikon Digital and 500mm lens. I've always haphazardly shot photos of airplanes passing...especially with the telephoto - it really pulls them in closer. I shot one photo of a jet, then another photo less than 2 seconds after. I didn't know what kind it was until I downloaded in on my computer. The first photo shows the jet with blue sky all around and some spots that were on my lens. Then I looked at the second photo...without thinking I cropped it closer to get a better look (deleted the originals off the camera). The object I saw was puzzling because in the photo shot seconds before...nothing. I don't think it's possible for that object to have appeared in 2 seconds from that great distance. It does resemble the back end of a fighter jet with the afterburners...but still Impossible for it to be there that fast. Since it the photo was shot with a 500mm from a great distance, the clarity isn't there, but still it's a curiousity! I really WOULD LOVE SOME FEEDBACK!!!! The first photo is the one I shot first...then only seconds later the other. Please note that all the smaller jets I had seen around were leaving vapor trails but the big jets were not. It was about 70 degrees on the ground. Please let me know thoughts??"],"Object Shape":"Disc","Disposition":"IFO","Date Submitted":"04/08/2009 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16461.html.txt","/var/www/straped/mufon/more/16461_submitter_file1__FedEx_secondsbefore.JPG","/var/www/straped/mufon/more/16461_submitter_file2__FedEx_.jpg","/var/www/straped/mufon/org/16461.html"],"Country":"United States","Date of the Event":"04/08/2009 12:00 UTC","Log Number":"US-04092009-0012","Object Flight Path":"Unknown","Summary":"I would say it was disk shaped...with a light coming from the bottom.","Tags":"City"}