{"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Region":"California","Date Submitted":"04/06/2009 10:00 UTC","divs":["Sighting DetailsOn Monday, April 10, 2009, at approximately 10p.m., I was leaving the parking lot of my apartment complex at 5585 Pacific Coast Ave. The parking lot entrance faces PCH, and in order to exit the lot, a driver must look south (left) towards oncoming traffic. As I looked south (left), preparing to make my right turn onto PCH, I noticed an extremely bright powder-blue streak across the sky. I do not believe this could have been a meteor or any other form of space debris incinerating while falling to earth for several reasons. First, I have witnessed numerous meteors, and this streak was much brighter in intensity and pure in color. This was not white, this was a rich, bright blue. Second, and most peculiarly in my opinion, was the nature of the streak. I witnessed the streak start in a definite spot and then end in another definite spot, almost as if the streak popped into existence then disappeared. The entire event could not have lasted more than two seconds, and it is very possible that it was shorter than one second. Whatever the object was, it appeared to be traveling at an extremely high speed. A third element that leads me to believe this was not a meteor was the height of the object from my point of view. Although I could not possibly determine the distance from myself to the streak, the streak was only slightly higher than the roofs of the buildings in the direction I was looking. This leads me to believe that the object was lower than a meteor. I am unsure of what I saw on Monday, April 10, 2009, but I am quite certain of the details from my vantage point."],"Object Shape":"Bullet, Missile, Fireball","Date of the Event":"04/06/2009 10:00 UTC","Disposition":"IFO","Viewing Distance":"Over One Mile","Country":"United States","Log Number":"US-04102009-0007","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.805397,+-118.155986(16469)&iwloc=A&hl=en\"> mufon case (16469) map </A>","Sighting Duration":"Undisclosed","City":"Long Beach","Case Number":"16469","files":["/var/www/straped/mufon/html2text/16469.html.txt","/var/www/straped/mufon/org/16469.html"],"Object Features":"None","Source":"MUFON","Summary":"Extremely bright powder-blue streak, started and ended in distinct locations.","Latitude":"33.805397","Longitude":"-118.155986","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around April 6th 2009"]}