{"map":"<A HREF = \"http://maps.google.com/maps?q=42.534899,+-92.445316(16479)&iwloc=A&hl=en\"> mufon case (16479) map </A>","Longitude":"-92.445316","Region":"Iowa","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting DetailsIt was the spring of 1974 while I was attending UNI, in Cedar Falls when I saw my first UFO. I was 20 yrs old at the time, and no I hadn't been drinking alcohol, or using any illegal drugs. It was night time and I was bored and just staring out my window to the west of my dorm room in \"Harding House\" in Shull Hall at UNI. Movement above the roof of Noren (sp?) Hall caught my eye, and that's when I saw the outline of a spherical UFO hovering about 10 ft above the roof. It was approx 20-25 ft in diameter, and gray in color. It had a slight hump in the middle of the craft, but didn't have any portals or windows, nor any markings to identify it. it made no sound, emitted no form of firey complusion to move it. I sat there in disbelife of what I was seeing. I just sat there and watched the craft, for the short time frame that it was present The UFO moved slowly along the roof line, and then began to move further away to the west until out of sight. It had no lights on it, and the only way I was able to see it, was from the ambient light from the street lights. After it left, I sat down and drew a sketch of the UFO that I had seen. Approx. 6 months later I watched a documentary on UFOs, and they had a picture of a UFO that fit the description of the one I had seen. Including the fact that it didn't have any external lights on it. I kept that sketch up until about 4 yrs. ago. I'm allergic to paper dust, and its' decaying paper caused me to have an allergic reaction to it, so i tossed it out. Do I believe in UFOs? \"Yes!\" But I'm sitting on the fence as to whether they are from an alien race from outspace, or just experimental aircraft from earth."],"Object Features":"Dome","City":"Cedar Falls","Summary":"Spring of 1974 a spherical UFO hovers above UNI's Noehren Hall.","Date Submitted":"04/15/1974 11:00 UTC","Sighting Duration":"00:10:00","trends":["There have been 4 other sightings in Cedar Falls","There were no other sightings in Cedar Falls on or around April 15th 1974"],"Tags":"City","Viewing Distance":"21-100 Feet","Latitude":"42.534899","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16479.html.txt","/var/www/straped/mufon/org/16479.html"],"Country":"United States","Disposition":"Unknown","Log Number":"US-04112009-0006","Object Shape":"Sphere","Weather Factors":"None","Date of the Event":"04/15/1974 11:00 UTC","Case Number":"16479"}