{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.735593,+-70.550936(16470)&iwloc=A&hl=en\"> mufon case (16470) map </A>","Source":"MUFON","Disposition":"Unknown","Longitude":"-70.550936","files":["/var/www/straped/mufon/html2text/16470.html.txt","/var/www/straped/mufon/org/16470.html"],"Weather Factors":"Does Not Apply","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Summary":"Silent, black triangle with many white lights flew over two witnesses at a very fast rate of speed.","Case Number":"16470","Latitude":"43.735593","Sighting Duration":"00:00:10","Country":"United States","Date Submitted":"09/30/2007 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","City":"Standish","Log Number":"US-04102009-0008","Date of the Event":"09/30/2007 12:00 UTC","trends":["There have been 3 other sightings in Standish","There were no other sightings in Standish on or around September 30th 2007","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy friend and I had been star gazing for a few nights and this night we were doing the same thing, we had seen some shooting stars and were hoping this night would be the same. We walked down towards Sebago Lake and laid a blanket down in a path which had a clearing so we could see the sky. I recall there being very little to no moon so the sky was very black and the stars were very bright. We were watching meteors for a few hours, and the conversation had lulled. Suddenly a black triangle, with two rows of white lights on each side flew over us at a very high rate of speed. The thing that struck me the most was that it was completely silent. We had seen airplanes go by all night, and they had flashing lights and you could hear them very clearly. But not this craft. Imagine an Isosceles triangle, flying with the point straight over us. The two equal sides of the triangle had two rows of lights each, the rows had aprox. six lights. The lights were bigger than the stars, but not brighter. It kind of blended in with the stars. The thing is, if we were not looking at the sky at this exact moment, we never would have seen it. I had the impression it was very large. When I first saw it, my mind went blank. I immediately thought to myself that it was a hawk or an eagle flying over us, with lights reflecting off of it. I don't know why I thought that, the thought popped into my head as soon as I saw it. We both said, \"Wow\" and \"Did you see that?\" but did not talk about it for at least a half hour. Then the shock or whatever seemed to ware off and we both could not believe what we had seen. It did take us a while to get over it, and I still remember the thought that popped into my head when I saw it. The craft flew directly over us at a very high rate of speed. We saw it for maybe three seconds, but saw it clearly and both agreed to its features. We lost sight of the craft when it continued flying over trees. We still talk about what we saw, and don't tell many people. But we know what we saw and my friend will back me up on this. I will never forget seeing this thing!"],"Region":"Maine","Object Features":"Undisclosed"}