{"Object Features":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.373343,+-84.95533(16489)&iwloc=A&hl=en\"> mufon case (16489) map </A>","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Summary":"Very low, almost noisless, hovering moving very slowly, black shaped like a triangle with 5 lights on the back.","Latitude":"45.373343","Date Submitted":"08/31/2007 07:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/16489.html.txt","/var/www/straped/mufon/org/16489.html"],"Longitude":"-84.95533","Case Number":"16489","Date of the Event":"08/31/2007 07:00 UTC","Source":"MUFON","Tags":"City","divs":["Sighting DetailsSweeping the deck, heard a faint humming noise off to my right. Went to check it out and I saw what I described above. The odd thing about it was that it was so huge but was hardly moving. I called 911 - I don't think they believed me and I had my husband come out to take a look. We watched it for quite awhile then just went back inside. It was still there when I looked out to see if it was gone. I didn't know what to think of it or I would have taken a picture. We just kept trying to figure out what it was. We think it may be something from the government or a practice run for some new airplane. Who knows. All I know is that is was HUGE and flying very low and very still. It was black, triangular in shape and hummend. The lights were not symetrical in placement- 2 on the left and 3 on the right. We live in the country and it was just about at the level of some trees on the hill so it was hanging very low. Could you shed some light? Really interested in your thoughts. Thanks, Teri Rounds"],"trends":["There have been 5 other sightings in Petoskey","There were no other sightings in Petoskey on or around August 31st 2007"],"City":"Petoskey","Log Number":"US-04122009-0006","Region":"Michigan","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet"}