{"Viewing Distance":"21-100 Feet","divs":["Sighting DetailsAlthough I can't even tell you exactly what year it was, I believe that I have witnessed one of the most amazing sightings in history! My Mom was driving about to pull into our driveway when a neighbor stopped us yelling\"Susan get out of the car, you gotta see this!\" We pulled over in the street next to our driveway and unbelievably there was a flying saucer hovering right over another neighbor's house. It was low enough and light enough with the snow covered ground to dismiss this for anything but an actual UFO probably from another world. I concede that there are many possibilities including a time travel ship or a craft from deep under water or a possible military experiment but my gut tells me VISITORS! There was no sound at all and it stayed in one spot for about 15 minutes barely moving. My Mom told me to get my father to get a camera or video but he was watching something on TV and thought I was making it up. (Unforgivable!) so tragically we got nothing except our memories. The craft zipped about a quarter mile south and hovered there for a while (still very visible). After a while the craft started slowly moving back towards me until it stopped and hovered over our next door neighbor's yard. When it appeared to start descending, I ran and hid behind my couch not wanting to meet the \"whatevers\". There's of course more details and more witnesses to this event but I'm not big into typing so, if anyone wishes to interview me, give me a polygraph or anything else, I'm happy to do anything that might help me shed some light on what we might've seen. For over 30 years I've been relatively silent about this and it's been haunting me so I've made a video and photo simulation to help me see once again what's been puzzling me for most of my life."],"Object Features":"Undisclosed","Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"New York","Date of the Event":"11/30/1977 07:00 UTC","Source":"MUFON","Summary":"I have created a simulation of this extraordinary event.","Object Shape":"Disc","Date Submitted":"11/30/1977 07:00 UTC","Country":"United States","City":"Roslyn","map":"<A HREF = \"http://maps.google.com/maps?q=40.801313,+-73.648262(16490)&iwloc=A&hl=en\"> mufon case (16490) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/16490.html.txt","/var/www/straped/mufon/more/16490_submitter_file2__RoslynUFOsimulation.jpg","/var/www/straped/mufon/more/16490_submitter_file3__citing.jpg","/var/www/straped/mufon/org/16490.html"],"trends":["There has been one other sighting in Roslyn","There were no other sightings in Roslyn on or around November 30th 1977","This sighting has never been favorited.",""],"Longitude":"-73.648262","Log Number":"US-04132009-0001","Weather Factors":"Snow","Latitude":"40.801313","Case Number":"16490","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering"}