{"Longitude":"-123.032396","Log Number":"US-04132009-0003","Source":"MUFON","Tags":"City","Date of the Event":"04/09/2009 12:00 UTC","Region":"Oregon","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/16492.html.txt","/var/www/straped/mufon/more/16492_submitter_file1__WeirdobjectoverStateCapital.JPG","/var/www/straped/mufon/org/16492.html"],"Latitude":"44.947128","Disposition":"IFO","Summary":"Strange object on a photo over state capital building.","Viewing Distance":"Unknown","divs":["Sighting DetailsWhile reviewing my photos taken during a recent photo trip, I noticed a strange object in one of my photos. It looks like a somewhat transparent worm with spiral wings in an area of the sky. I took a few bracketed images and the object does not appear on the others. Not really a believer but it sure is strange. I remember seeing something similar in a discovery channel UFO special once, so I thought you would like to know about it. The funny thing is that whatever it is, it is flying over the Oregon State Capitol Building. I lowered the quality of the original to prevent theft but I have the original high res jpeg as well as the original Nikon RAW image. Neither image has had any digital manipulation. I did crop the image that I sent to you to narrow the area you have to search for the object. You should be able to find the image in the upper left area of the sky near the edge of the flowering cherry tree. I origially thought that i may be some sort of insect in flight but the wind was blowing and the flowering cherry shows very little wind movement so my shutter speed was fairly high. Let me know what you think Tracy Fox"],"trends":["There have been 40 other sightings in Salem","There were no other sightings in Salem on or around April 9th 2009","This sighting has never been favorited.",""],"City":"Salem","Object Shape":"Chevron, Other","Object Flight Path":"Undisclosed","Case Number":"16492","Date Submitted":"04/09/2009 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.947128,+-123.032396(16492)&iwloc=A&hl=en\"> mufon case (16492) map </A>"}