{"map":"<A HREF = \"http://maps.google.com/maps?q=41.018139,+-75.994925(16491)&iwloc=A&hl=en\"> mufon case (16491) map </A>","Latitude":"41.018139","Summary":"One red light lead and three white light in a dimond shape all together.","Country":"United States","Tags":"City","trends":["There have been no other sightings in Drums","This sighting has never been favorited."],"Region":"Pennsylvania","Sighting Duration":"00:05:00","Date of the Event":"04/12/2009 09:50 UTC","Case Number":"16491","Object Shape":"Diamond","Date Submitted":"04/12/2009 09:50 UTC","files":["/var/www/straped/mufon/html2text/16491.html.txt","/var/www/straped/mufon/org/16491.html"],"Log Number":"US-04132009-0002","Object Features":"Unknown","Object Flight Path":"Path with directional change","Viewing Distance":"101-500 Feet","Longitude":"-75.994925","Weather Factors":"Windy","divs":["Sighting DetailsI was on a chiar watching tv when I notivced a light outside. I know that their are planes in the area and I know the light patterns of planes and ahelicopters at night but I didn't recongize this type. I went out side and the first thing that I notice is that I heard nothing. What I first thought was a plane was going maybe 80-90 MPH because of how slow it was going over the tree feild very low to the horizion. I can judge the distance of the object cause of how far apart the lights were and the angle of them changed at it drew closer to me. I have heard jets at night and airplanes and helicopters. Everything in the valley makes a sound and it can travel a great distance. The object was low on the horizion and it passed right by me. The object moved slowly across the sky, it seemed like it was floating, I flt very weird at that moment. I could not recongize what the object was. I felt a warm feeling in my body as I watched it go by me. It seemed to be very close. I felt like something was watching me at that moment. I listened again for a sound for a hint on what it might be but their was no sound what so ever. Nothing was outside and nothing was moving so if the object did have a prop or a turbine I would of heard it. It went out of my site heading towards the road. I then ran to the other side of the house to the front door and saw it climb rapidly and ascend to a high alitude and circle around the house. It must of triples the alitude from before and then again I felt like it was watching me. I the then disappeared out of my site either it teleported ot the lights turned off. But either way it did not act like any aircraft that I seen before."],"Source":"MUFON","Disposition":"Unknown","City":"Drums"}