{"Log Number":"US-04142009-0005","Date of the Event":"07/13/1994 09:30 UTC","files":["/var/www/straped/mufon/html2text/16508.html.txt","/var/www/straped/mufon/org/16508.html"],"Case Number":"16508","City":"St Francis","Disposition":"Unknown","Object Features":"Dome","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/13/1994 09:30 UTC","Weather Factors":"Unknown","Region":"South Dakota","Country":"United States","divs":["sighting detailswell some time around 9 pm my mother returned home from a sweatlodge ceremony and she was saying \"come on kids get in the car we seen lights in the sky by spring creek jct. !\" so me and my mother and three younger siblings got in the car and we drove aprox. 3-4 miles south of st. francis and as we came to the top of a hill we noticed these bright lights just above the tree tops a 1\\4 miles from where we parked. the lights lit up the area below like big giant flood lights about 20-25 light in a circle and above the we could see a very large dome shaped object. as we watched it the lights began pulsate and change color from white to purple to blue and to yellow then they started spining in a circle. there was a road about 100 yards in front of the object that i wanted my mom to go and drive down so we could get a closer look, but as she was about to drive closer my younger siblings began to freak out and started crying saying\"no mom dont go down there its gonna take us!\" so she turned the car around and headed back for town. we watched the object for about 15 minutes and as we were leaving i watched the object till it was no longer in view."],"Source":"MUFON","Summary":"Large dome shaped object with lights on the bottom.","Object Flight Path":"Stationary","Longitude":"-100.903056","Object Shape":"Disc","Latitude":"43.144167","Sighting Duration":"00:15:00","Tags":"City","trends":["There has been one other sighting in St Francis","There were no other sightings in St Francis on or around July 13th 1994"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.144167,+-100.903056(16508)&iwloc=A&hl=en\"> mufon case (16508) map </A>"}