{"Object Shape":"Sphere, Star-like","Latitude":"51.517769","Disposition":"Unresolved","Source":"MUFON","Longitude":"-0.118845","Viewing Distance":"Unknown","Case Number":"16506","files":["/var/www/straped/mufon/html2text/16506.html.txt","/var/www/straped/mufon/org/16506.html"],"Tags":"City","Country":"United Kingdom","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around April 14th 2009"],"City":"London","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.517769,+-0.118845(16506)&iwloc=A&hl=en\"> mufon case (16506) map </A>","Log Number":"GB-04142009-0004","Date of the Event":"04/14/2009 09:30 UTC","Weather Factors":"Unknown","Date Submitted":"04/14/2009 09:30 UTC","Summary":"4 lights in a ball pulsing in same spot for over an hour.","divs":["Sighting DetailsSeen light in the sky around 10 miles away (roughly speaking)..over guildford way from dorking. went out side after 5 mins was still there. got a pair of binoculars looked and with these it went from a redish ligh to white green red and violet light which pulsated different lights. culd not take a picture my camera was not god enought to pick up the light. got my mum too look and she could not explain and my girlfriend who has a licence to fly 2 seat aircraft and she said that it was nothing she had seen before.(she is by no way a expert but if tere is a good witness goodcoming from her) after i went to bed got up around 1045 ish cant be accurate about thistime and it had gone. There is gatwick air port near me and plenty of aircraft around the area at the time. severalhelicopters too. as they flew by this object it was nothing like the lights or shapes that aircraft make in he air. if you look on you tube for light over guildford from 2007 ish and farnborough it was very much like that. only that i dont think a camera can pick up the colours in such definition that i did with eye goggles!!"],"Region":"England"}