{"map":"<A HREF = \"http://maps.google.com/maps?q=27.078459,+-82.441213(16501)&iwloc=A&hl=en\"> mufon case (16501) map </A>","Log Number":"US-04132009-0012","Sighting Duration":"00:01:15","Object Flight Path":"Path with directional change","Country":"United States","City":"Englewood","Summary":"UFO filmed in Englewood, Florida on the Gulf of Mexico.","trends":["There have been 9 other sightings in Englewood","There were no other sightings in Englewood on or around April 13th 2009","This sighting has never been favorited.",""],"divs":["sighting detailsi always take my camera with me cause the first sighting i had i did not having one.i been saving ufo photos and other video i have,and just posted it all on my blog worldufospace yesterday.a friend of mine who live near me came over cause he kept saying he see's ufos every night,and we set up to film tonight.not 30 mins into watching the sky a bright object appeared in the south at high altitude,and moving fast,so i got the camcorder,and he grabbed the big spotlight i started filming it flying stright from south to north.when he shined the spotlight at it,it made a 90 degree turn left to go out over the gulf.we filmed it till it went out of view,it look to blink out.i don't have the right wire to upload the footage stright from my camcorder so i had to hook it up to the t.v. and film the t.v. with my little camera.we started watching about 8pm till 10:10 pm and seen a total of six,or seven objects, most were not bright enough to pick up with camcorder,but i did film them so they could be pulled out maybe.i checked the space station tracker,and nasa j tracker and the space station,or satellites were not over us at all the time we were out there.the object were not all going the same way,a few went north to south,or east to west.if anyone has any questions or if you seen the same thing you can contact me at my blog worldufospace.blogspot.com. the video can also be seen by going to this link http:\\\\www.youtube.com\\watch?v=alnbzsnxpue"],"Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/16501.html.txt","/var/www/straped/mufon/org/16501.html"],"Object Features":"Unknown","Date Submitted":"04/13/2009 08:20 UTC","Region":"Florida","Weather Factors":"Unknown","Case Number":"16501","Date of the Event":"04/13/2009 08:20 UTC","Object Shape":"Circle, Sphere","Viewing Distance":"Unknown","Longitude":"-82.441213","Source":"MUFON","Latitude":"27.078459"}