{"Log Number":"US-04142009-0003","Object Features":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around April 13th 2009"],"Date of the Event":"04/13/2009 07:11 UTC","Country":"United States","Object Shape":"Bullet, Missile, Egg, Sphere, Teardrop","Weather Factors":"Unknown","City":"New York","Tags":"City","Date Submitted":"04/13/2009 07:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.721753,+-74.001493(16505)&iwloc=A&hl=en\"> mufon case (16505) map </A>","Summary":"4 bluish bulbous UFOs in formation near Outerbridge Crossing, Staten Island, NY (NYC).","Region":"New York","Latitude":"40.721753","divs":["Sighting Details I had just driven through the toll booth for the Outerbridge Crossing, so heading ENE, and heading towards what used to be called the Richmond Parkway, when I saw them -- four blueish things flying in formation. At first I thought they were birds, but they were too big and flying too fast, and no wings. Then I thought maybe they were the Blue Angels, but again these things didn't have wings, appeared smaller, there was no smoke, and no sound or vibration. They came in from the east and turned and went north. The objects moved smoothly and were quickly out of sight. From the highway there is good visibility and there is wide panoramic view. When I say blueish, it was sort of a hazy atmospheric blue, the way mountains can look in the distance. The shape was sort of bulbous, with one side being a bit more pointed. The formation was not perfect, but they maintained it in the turn. Again, they were flying very fast. This was maybe a quarter of a mile in front of me, and not that high up. Lower than most planes fly. When i looked at my clock it was a few minutes later and it said 7:11 pm. Also, I think that clock might be a few minutes slow. i don't drink or use drugs. I didn't feel afraid, just curious. Thought it must be fun to bop along so fast."],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"16505","Longitude":"-74.001493","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/16505.html.txt","/var/www/straped/mufon/org/16505.html"],"Sighting Duration":"Undisclosed"}