{"Country":"United States","Disposition":"IFO","Source":"MUFON","Weather Factors":"None","divs":["Sighting DetailsI don't believe this to be extraterrestrial in nature (however that would be awesome if it was) however, myself and 3 others were outside smoking and noticed a burning object heading west. It appeared to be a fireball with an 'arm' waving around it. It was moving slowly across the sky at about 500 feet. It stopped at one point and seemed to spin around several times and then moved in a northerly direction. After awhile something started falling off of it, like pieces of it were burning and dropping off. It eventually, slowly however, moved to the north and disappeared behind a cloud. Our guesses were a hot air balloon (but why would it be out this late at night), a blimp, weather balloon, etc., but it seemed to be too low to the ground and again, if it was on fire, why are there no other reports of it at this point? I hope someone can get to the bottom of this. We contacted 911 believing that there was an aircraft of sorts in trouble but it was gone by the time they arrived and they left without incident. I can't find anything on local papers or news websites that are updated frequently. Has anyone else reported anything? Was there some sort of an accident or did we in fact maybe witness something 'otherworldly'?"],"Object Shape":"Blimp, Circle, Cylinder, Disc, Fireball, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.81696,+-118.037285(16504)&iwloc=A&hl=en\"> mufon case (16504) map </A>","files":["/var/www/straped/mufon/html2text/16504.html.txt","/var/www/straped/mufon/org/16504.html"],"Log Number":"US-04142009-0002","Latitude":"33.81696","Case Number":"16504","Summary":"Burning object in the sky.","Region":"California","Longitude":"-118.037285","Date of the Event":"04/13/2009 11:05 UTC","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","City":"Cypress","trends":["There have been 6 other sightings in Cypress","There were no other sightings in Cypress on or around April 13th 2009"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Sighting Duration":"Undisclosed","Date Submitted":"04/13/2009 11:05 UTC","Object Features":"Appendage(s), Other"}