{"City":"Brainerd","Date of the Event":"04/14/2009 09:05 UTC","Latitude":"46.35863","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["sighting detailsmy daughter had dance practice and we all decided to go to town and get some coldstone and watch her practice. we left and headed south on cr 45 and then turned left on cr 44. we went up over the first rise and my wife saw what appeared to be two separate crafts that seemed to be going very slowly from east to west and very close to each other. my children 12 and 5 became very frightened mostly due to my wife over reacting to whatever we were seeing. but, i really wanted to pull over and look and listen. when i pulled the car over and was able to turn around and look i noticed that one of the things was gone. i asked my wife to look and she saw the same thing. our house was about a mile away and i quickly took everyone home, ran in the house and grabbed our camera and quickly drove back to the site. nothing there. then i see two very large airplanes headed west to east in formation going towards the north side of south long lake. they went about as far as the lake and made a hard turn back the way they came and went directly over my house like they were searching for something. not uncommon for military planes and helicopters as we live about 15-20 miles from a base, but never this low. i never felt a great deal of fear, mostly excitement because i had seen these light\\crafts once before about 2 years ago and everyone thought i was nuts. when my wife saw them she said she felt the same not really scared just excited. kids were quite scared and did not really know what to think. my father, grandfather, great-grandfather, aunt and uncle are all pilots, two active captains for major carriers. i have flown all over in all different aircraft and i have never seen anything like this before."],"Tags":"City","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=46.35863,+-94.18793(16511)&iwloc=A&hl=en\"> mufon case (16511) map </A>","Country":"United States","trends":["There have been 4 other sightings in Brainerd","There was one other sighting in Brainerd on or around April 14th 2009"],"files":["/var/www/straped/mufon/html2text/16511.html.txt","/var/www/straped/mufon/org/16511.html"],"Object Features":"Unknown","Case Number":"16511","Disposition":"Unknown","Date Submitted":"04/14/2009 09:05 UTC","Region":"Minnesota","Object Shape":"Boomerang, Circle, Triangle","Viewing Distance":"Unknown","Summary":"Two separate crafts in formation over CR 44, 6 miles south of Brainerd.","Log Number":"US-04152009-0001","Longitude":"-94.18793","Source":"MUFON"}