{"Tags":"City","Object Shape":"Disc","Summary":"The craft was possibly black in color. The base of the craft was flat and resembled an angled door stop pointy in the front and back as opposed to dome shaped.","Date of the Event":"04/09/2009 09:20 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/16512.html.txt","/var/www/straped/mufon/org/16512.html"],"Case Number":"16512","Country":"United States","Latitude":"39.807774","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around April 9th 2009"],"Longitude":"-105.081084","Object Features":"Window(s)","Sighting Duration":"00:01:00","divs":["Sighting DetailsI arrived at home from running an errand at probably 9:19pm. I walked in to my bedroom and heard a very loud couple of helicopters outside and ran to the spare room window to see what was making all the racket. I witnessed a large helicopter and another aircraft I could not identify flying together due North and not very far away from my condo. I watched for as long as I could see both aircraft and then went into my roon and saw my alarm clock displaying 9:22pm. I called and woke up my neighbor and asked if she heard the helicopter and proceeded to explain what I saw. She verified right away that she heard the helicopter and came over to look from my vantage point. We decided to take a drive over by Rocky Mountain Airport (formerly jeffco airport I think) up in Interlocken to see if we could see if they had landed there. We were unable to see anything of that nature at the airport and we went home. Immediately realize that my main concern is that the aircraft did not have any visible lights working and was flying after dark. It was flying in formation at exactly the same speed with a very loud helicopter possibly a double bladed heli. I clearly saw lights on the helicopter the entire time both aircraft were visible. I was under the impression the helicopter was escorting the craft flying due north at a very low altitude above Arvada, Colorado between Wadsworth blvd and Sheridan on Thursday April 09, 2009 after dark at 9:20pm. I cannot estimate the altitude without advice from someone with better judgment. I only have a reference point of the position of the two aircraft with respect to the rooftops looking East out my spare room window. I feel that this is a military aircraft until I am advised differently. I am under the impression that the Lightning II, Nighthawk, Spirit, and Raptor are unable to maintain a perfect formation with the super slow speed of a large double bladed helicopter. I witnessed a Stealth fighter many years ago and it was a very high speed aircraft very unlike the slow traveling aircraft I witnessed. The Stealth I saw years ago was the loudest aircraft I have ever heard and had no audible resemblance to the craft I saw last Thursday. I only heard the helicopter and I heard two blades but was focused on the craft in front and never verified if the helicopter was double bladed. Again... no lights were visible on the craft the entire time I was able to view them and lights were clearly visible on the helicopter. A rainbow effect can be visible as oil floats on water. This same rainbow effect was visible once in the front of the craft and once in the rear of the craft at a perfect side view giving me the impression the aircraft had two windows at least. The craft was hard to see due to the lack of lights and became increasingly difficult to see the further away it got from me. Both aircraft traveled at the same speed the entire time and were clearly flying together. The aircraft and the helicopter were roughly the same size but clearly not the same shape at all."],"Region":"Colorado","Date Submitted":"04/09/2009 09:20 UTC","Source":"MUFON","Log Number":"US-04152009-0002","City":"Arvada","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.807774,+-105.081084(16512)&iwloc=A&hl=en\"> mufon case (16512) map </A>"}