{"Viewing Distance":"Unknown","Summary":"3 orbs appeared at lunchtime during UFO conference","City":"Santa Clara","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-04152009-0004","Country":"United States","Object Features":"None","Source":"MUFON","Date Submitted":"09/27/2008 12:00 UTC","trends":["There have been 12 other sightings in Santa Clara","There were no other sightings in Santa Clara on or around September 27th 2008"],"Case Number":"16514","map":"<A HREF = \"http://maps.google.com/maps?q=37.356858,+-121.953036(16514)&iwloc=A&hl=en\"> mufon case (16514) map </A>","Latitude":"37.356858","Region":"California","Object Shape":"Circle, Sphere","Longitude":"-121.953036","files":["/var/www/straped/mufon/html2text/16514.html.txt","/var/www/straped/mufon/org/16514.html"],"divs":["sighting detailsi attended my first ufo conference in santa clara ca on the weekend of sept 27\\28 of 2008. during the lunch break which was sometime between noon and 1pm to the best of my recolection and i think it was on the second day. there were a group of participants eating lunch outside the hotel lobby at least10-15.i came outside and found others looking up and calmy observing 3 silvery whitish orbs fixed in a triangular formation verry high up and some where able to observe a fourth. this continued for at least half an hour. i returned inside for a bit and came back out and the phenonomon continued and then slowly faded out. this was my first observation of a ufo and felt they appeared for us to see knowing we were all outside at that time. my feelings were actually calm but surprised at the timing of this event. the strange thing was thatthe following day a small grain like moveable lump appeared in my right thumb just below the joint which i have yet to have x-rayed. there is no scar and produces a queasy sensation when manipulated, more troubling than the siting."],"Date of the Event":"09/27/2008 12:00 UTC","Disposition":"IFO"}