{"Region":"Washington","trends":["There have been 8 other sightings in Oak Harbor","There were no other sightings in Oak Harbor on or around February 11th 1969"],"Weather Factors":"None","Country":"United States","divs":["Sighting DetailsI was watching TV,my mother asked my older sister to call another sister at her friend's house, home for dinner.A few min.later the door opened, i turned to look at my sister and saw that she was white as a ghost, an trying to say something.All she could do was point out the door.I went first, then my sisers an mom.It was dark out.Standing on the walkway ,and looking to the NE.over, but beyond my school and the surrounding area called Govmt.Property, we could not help but see a elongated bright white light. It was about a mile away,an about 2-3000 ft.high,an apprx. 1-2000ft.in length (possibly more).It was totaly quiet outside(so were we).I remember thinking it might be a searchlight from NAS. Whidbey Isl.,but it was much brighter, no shaft of light was comeing from the ground, and it was perfectly still in the dark (i do'nt remember seeing any star's) sky.Within second's of going out(it seemed) and seeing this,something told me to turn around,i saw some,if not all our neighbor's, standing in front of there house's looking up in silence.(i still have that particular memory ,and the feeling of how strange this all was, an how still and quiet everyone was.)I turned back an watched the light (still in the same place)for another minute or so, and wondering what it could be,and why i did'nt hear any plane's from the base (3 miles away)to check it out.All of a sudden in a slight arc toward's the east(almost straight) up it shot, shrinking out of site in maybe just more than a second.--- POST NOTE;All of these memories only became aware to me 7 yr's later,when a slightly different incident happend,wittnessed by my girlfriend and some other's,over Kaneohe Marine Air Base in apprx. June 1976.Since then i have asked my mother,who is now deceased,and my sister's about that night,and if they remembered it.My mother's eye's got so wide an full of tear's (an fright!!)that she truly started babbelling an would not talk to me for a day an half,and refused to talk about it any more.As for my sister's,they said they did'nt remember anything like that, an looked at me as if i was loseing my mind. But after around a week or so, one of my sister's an i were together, and she admitted that she did remember and felt bad for not saying so.Shortly after that my other sister(after talking with the other one)said she did too."],"Longitude":"-122.636534","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/11/1969 06:00 UTC","Date of the Event":"02/11/1969 06:00 UTC","Sighting Duration":"00:10:00","Object Shape":"Blimp, Oval","files":["/var/www/straped/mufon/html2text/16516.html.txt","/var/www/straped/mufon/org/16516.html"],"Latitude":"48.301676","Object Flight Path":"Stationary","Summary":"Over 1000 ft. length, apprx. 2-3000 ft. alt., apprx. 1mile from my house, over military housing and radar site.","map":"<A HREF = \"http://maps.google.com/maps?q=48.301676,+-122.636534(16516)&iwloc=A&hl=en\"> mufon case (16516) map </A>","Case Number":"16516","Disposition":"Insufficient Data","Source":"MUFON","Log Number":"US-04152009-0006","Object Features":"None","City":"Oak Harbor"}