{"City":"Aurora","Summary":"Two helicopters together, one lit with red rights, the other no lights.","Log Number":"US-04162009-0001","Object Flight Path":"Straight-line path","Latitude":"39.731602","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"04/09/2009 10:10 UTC","Longitude":"-104.82207","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.731602,+-104.82207(16522)&iwloc=A&hl=en\"> mufon case (16522) map </A>","Object Shape":"Other","Object Features":"Undisclosed","Date of the Event":"04/09/2009 10:10 UTC","Disposition":"IFO","Region":"Colorado","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/16522.html.txt","/var/www/straped/mufon/org/16522.html"],"Source":"MUFON","Sighting Duration":"00:01:00","trends":["There have been 48 other sightings in Aurora","There was one other sighting in Aurora on or around April 9th 2009"],"Case Number":"16522","divs":["Sighting DetailsOn thursday evening, April 9, 2009, at exactly 10:10 pm, my wife and I both witnessed an unlit helicopter followed immediately by another helicopter that had red lights on it. We were driving south on E-470 at the east edge of the metropolitan Denver area, very near Southlands mall at Smoky Hill Road. I first noticed two red lights on a low-flying aircraft that appeared to be ready to cross over E-470 just in front of us, from right to left (west to east) and looked up with curiosity as I started to hear the rather loud rumble of a low flying helicopter. The moon was full (full at 8:56 pm that night to be exact), and it brightly lit up the southeast part of the sky above us through some broken and hazy clouds. Against the bright moonlit part of the sky I saw the black silhouette of a completely unlit helicopter leading the red lights by perhaps 100 feet, very roughly. Immediately, a second helicopter followed on its tail across the moonlit part of the sky, and I could see its silhouette too. It was lit with the red lights. For a few seconds I could see both helicopters at the same time, one following directly behind the other in single-file order. I sensed the two helicopters were of the same make, but my wife thought perhaps they were slightly different models. Looking at pictures on the Internet we both agree they were a close match to UH-60 black hawk military helicopters, again as a rough guess. As the two helicopters passed overhead going east, I continued to watch them out my driver's side window. They quickly disappeared into the darker part of the sky, but I did noticed a very small and very dim, steady yellow light on the unlit helicopter that was in the lead, probably in the tail rotor area. I had the impression the only purpose of this tiny light was as a visible safety indicator for the sake of the pilot of the helicopter following very closely on its tail. That light was so very dim that within seconds it faded from my view and only the red lights of the second helicopter were then visible as they proceeded at a steady clip off to the east. Without the moon in the background, I'm sure we would not have noticed the leading helicopter at all. Perhaps these two helicopters were from Buckley AFB out on a training mission of some sort, but it struck me very odd that one of them would be flying dark over the community at such low altitude. Tonight I heard a rumor someone else reported something similar on the same night, so combining the data from both reports might help figure out if this was an explainable military training event, or if something odd was going on."],"Country":"United States"}