{"Date Submitted":"04/14/2009 08:15 UTC","trends":["There have been 5 other sightings in Swansea","There were no other sightings in Swansea on or around April 14th 2009"],"Disposition":"Unresolved","Weather Factors":"None, Medium, Light","divs":["Sighting DetailsI had just got out of my car at the Petrol Station in my local Town (Port Talbot) when I noticed an orange light in the sky. At first I thought it was a helicopter (we get quite a few over the town with strong spotlights looking for who knows what) as it was moving slowly and that maybe the orange light was blocking my view of the helicopter. I had to fill up the car with petrol which I remember being annoyed at as I really wanted to see what this light was. After filling up with petrol I tried to make visual contact again whilst driving (not recommended). I was getting occasional views of the light but I couldn't stop as I was on a busy road with nowhere to pull over. As I was making my way to another garage to inflate my tyres the light was above and in front of me. I was still driving and trying to keep eye contact with the light. It went directly overhead and I managed to slow down and get a better view. The light was almost the same intensity and colour of a street light but just above the orange light I could make out a strange dark disk shape that I can only describe as appearing to vibrate. It was blurred like an out of focus object. It was this that really made me realise this object was unusual. There was no sound and I would say it was no more than 150 to 200 ft above me. I lost sight as it went overhead and I remember cursing that I couldn't pull over to get a better view, I was also only a few minutes from home (with a camcorder waiting to be utilised) but by the time I got home I couldn't see the light at all. I should add that our local paper had a small write up on the incident confirming my sighting as being unusual and independently witnessed."],"Summary":"Orange light with strange blurred disk above it moving over town at low altitude.","Object Shape":"Circle, Sphere","Tags":"City","Latitude":"51.62937","Date of the Event":"04/14/2009 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.62937,+-3.934746(16524)&iwloc=A&hl=en\"> mufon case (16524) map </A>","files":["/var/www/straped/mufon/html2text/16524.html.txt","/var/www/straped/mufon/org/16524.html"],"City":"Swansea","Longitude":"-3.934746","Source":"MUFON","Country":"United Kingdom","Region":"Wales","Sighting Duration":"Undisclosed","Case Number":"16524","Log Number":"GB-04162009-0003","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"None"}