{"Case Number":"16529","Region":"Nevada","Country":"United States","Sighting Duration":"Undisclosed","City":"Las Vegas","Latitude":"36.115796","divs":["Sighting DetailsI was a child about age 9 living in Las Vegas, Nevada at the time. It was an overcast day in the early to mid afternoon and I was looking out of a north facing window which was on a second floor level of an apartment building. I forget why I was looking out the window but this sighting is all I remember of that day. I was in my sisters' room at the University Park Apartments a block away from UNLV. I had to stand atop a bed in order to look out the window due to the window's basement-like, high, horizontal orientation. From the west heading to the east I saw a large, low-flying ship just below the clouds. The appearance of which looked bronze-colored with a sort of faceted surface (somewhat similar to that of the the angular shapes of the F-117 Stealth). The shape is unlike anything I have seen before and would not fall under a normal \"ufo\" description as it was not at all like a disc. The shape was more like a manta-ray with a long nose. Something similar would be a star trek like ship. At the \"nose\" of the craft were what appeared to be windows of a cockpit, they were basically pitch black rectangles at the front of the \"nose\". The craft flew very slowly towards the east and after about 10 seconds or so it slowly began turning slightly north, again very slowly. As the craft turned north, I could see the backside, which appeared to have a type of wing that came down from the craft at an angle towards the ground. My line of sight was then blocked by some trees. Heading into my mothers room which was the next room to the left, I was unable to see the craft again."],"Date of the Event":"12/31/1991 12:00 UTC","Disposition":"Insufficient Data","Date Submitted":"12/31/1991 12:00 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/16529.html.txt","/var/www/straped/mufon/org/16529.html"],"trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 31st 1991"],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.115796,+-115.163966(16529)&iwloc=A&hl=en\"> mufon case (16529) map </A>","Log Number":"US-04162009-0007","Object Features":"Window(s), Patterned Surface, Appendage(s), Louvres, Wings, Other","Source":"MUFON","Summary":"Wierd shaped craft flying slowly over Las Vegas, Nevada in early 90's.","Tags":"City","Longitude":"-115.163966"}