{"Object Features":"Other","Object Flight Path":"Straight-line path","Case Number":"16531","Date Submitted":"04/15/2009 09:33 UTC","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsMy teenager (13) had opened the front door for us to receive fresh air! They were on their way to bed, for school the next day. We were looking out at the water tower on the hospital grounds. She suddenly yelled, \"Moma, what is that? What is that?\" I asked her where, because my eyes were focused on the water tower and Wal-Mart (approx. 100 ft.) She said, \"It looks like smoke! Coming towards us!\" At that very moment, my eyes picked up on the thing she referred to. Nothing in my database could explain what this was. Even though it's dark, we live in a well-lit area. The first thing I thought was birds, flying in formation! Until I grabbed my binoculars and had a closer look. Each item I thought was a bird, was oval shapped. Almost like an egg! By this time I paniced. I grapped her inside by the shirt, and locked the screen. These things slowed down and changed into several shapes. One modeling a mosquito. The others I couldn't quite identify because I was in awe. At first, they were in V formation; as if they were birds flying like I said earlier. There were no sound at all. And they floated from East to West real slow-like to allow us to view the many shapes they were making. They were see-through as they floated in our face (20 ft approx.) And through these things, the sky was visible. As soon as it floated to the end of my house where the steps were, they disappeared. We all ran outside, afterwards of course, to see where they had gone. I wanted to get a picture with my camera. It was me(35), daughter (13), son (11), and son (4). It took me almost half an hour to calm down my four year old. This happened in a spann of six min. for all of us to see. It wanted to be seen, well they, wanted to put on a show, and they did. If they were birds, as they passed the trees, they would be visible to us for a few more hundred feet. But, to just disapper in the blink of an eye, after a photo-show, was Extraordinary. These were NOT birds I admit. I am a teacher with a high IQ, and have no reason to lie about anything. As a matter of fact, I did not believe in anomalies, but now I want to know What the World did I see? I am a believer in the unknown now."],"Tags":"City","Summary":"20 to 30 ovals flying in bird formation; as it approached the children and I, it changed numerous shapes!","Latitude":"31.333429","Region":"Mississippi","map":"<A HREF = \"http://maps.google.com/maps?q=31.333429,+-89.283119(16531)&iwloc=A&hl=en\"> mufon case (16531) map </A>","City":"Hattiesburg","trends":["There have been 10 other sightings in Hattiesburg","There were no other sightings in Hattiesburg on or around April 15th 2009"],"Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/16531.html.txt","/var/www/straped/mufon/org/16531.html"],"Date of the Event":"04/15/2009 09:33 UTC","Log Number":"US-04162009-0009","Object Shape":"Diamond, Oval","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-89.283119","Source":"MUFON"}