{"files":["/var/www/straped/mufon/html2text/16539.html.txt","/var/www/straped/mufon/org/16539.html"],"Object Shape":"Boomerang","Disposition":"Unknown","Latitude":"39.116702","Date Submitted":"04/16/2009 03:23 UTC","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","City":"Pasadena","map":"<A HREF = \"http://maps.google.com/maps?q=39.116702,+-76.563945(16539)&iwloc=A&hl=en\"> mufon case (16539) map </A>","Case Number":"16539","Region":"Maryland","Date of the Event":"04/16/2009 03:23 UTC","Source":"MUFON","trends":["There have been 8 other sightings in Pasadena","There was one other sighting in Pasadena on or around April 16th 2009"],"Log Number":"US-04162009-0016","Country":"United States","Tags":"City","Summary":"Finacee woke me up @ 3am to hear a strange noise from sky.","Weather Factors":"Light","Longitude":"-76.563945","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI was dead asleep @ 3am ish on April 16th 2009 my finacee woke me up to hear what I thought at first was a street sweeper. I told her to go back to bed but she insisted I get up and look out side. I admit at first I was sure it was a street sweeper a couple streets over it was a very dull humming like a electrical transformer. I looked out the window on my side of the bed...nothing I walked to the front room facing our street nothing. The sound kept a stationary volume. I told her it had to be a street sweeper. So I walked over to her side of the bed and looked out the window for sure I would see some sort of sweeper or utility truck a street or two over between the houses..nothing and the sound yet stayed staionary at what seemed to be just over our house to the wood line.That area of the sky is pretty dark but kinda against the sky which was slightly cloudy I could make out this very seemingly large shadow or just black diamond boomarang shape looking thing drifting over the tree line and the humming..I can't get over the humming..no visiable lights nothing just blackness and a ever constant humming I didn't want to alarm my fiancee so I told her nothing was there it must have been a sweeper a couple of streets over. I dont know how to take this. We live around a lot of military type bases in Maryland so that was my first though but I never have seen or in-countered a sound like that.I don't know...Im puzzled Im not sure if this has anything to do with this but I felt a little wierd after that and seen my Dr. the next day with pains in my back and chest. I wasn't feeling the best before but the next day I felt very strange never the less maybe it's nothing."]}