{"files":["/var/www/straped/mufon/html2text/16544.html.txt","/var/www/straped/mufon/org/16544.html"],"Region":"Arizona","Disposition":"Unknown","Source":"MUFON","Log Number":"US-04172009-0005","Viewing Distance":"21-100 Feet","Tags":"City","Weather Factors":"None","Case Number":"16544","Summary":"In my yard flew over my house. No sound, two bright white lights shined down on me. Flew over neighbors house on down the street.","Object Shape":"Disc, Oval","map":"<A HREF = \"http://maps.google.com/maps?q=33.37446,+-112.576517(16544)&iwloc=A&hl=en\"> mufon case (16544) map </A>","trends":["There have been 13 other sightings in Buckeye","There were no other sightings in Buckeye on or around January 10th 2007"],"Longitude":"-112.576517","Latitude":"33.37446","Object Features":"Wings, Unknown","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"01/10/2007 09:30 UTC","Date Submitted":"01/10/2007 09:30 UTC","divs":["Sighting DetailsOutside talking on the cell phone.I seen the neighbors house light up bright with a stobe type light.I figured it was an ambulance or firetruck coming down the street.I kept talking on the phone.The light got brighter,flew over the top of my house and lit everything up like daylight,but with a very white light.I kept talking on the phone then I realized this object was not making any noise at all.It was also moving very slowly.I held the phone up so the person I was talking to might hear something,he said he did not hear anything.I watched as it went over my neighbors house going east.It appeared to go on down the street and turn to the south towards the I-10 freeway.On the southside of the freeway is Buckeye Airport.I watched it until I could not see it anymore.One strange thing I thougt of as it flew and turned it stayed flat in the turn,it did not bank over as an airplane would.I could not make the shape out good.The lights were bright.As it headed away from me it seemed very dark the shape and possibly a tall center section,such as a tail.The lights stayed on all the way as it flew.I also noted the phone did not loose reception or have stactic.I finally hung up on the guy.I seen the UFO hot spots article on the net on MSN so I thought I would write.After the sighting I came into my house told my wife,step son and his wife.They all laughed of course.This event did not scare me or give me the creeps in anyway.I figured I would eventally run into somebody else in my area who seen it,no luck so far.This has bugged me since I seen it.Did anybody else report a sighting that night in my area? I am curious and would like to know.I told people at work and other family members.Please let me know if it was reported by anybody else.Thanks. {pid}"],"Object Flight Path":"Path with directional change","City":"Buckeye"}