{"Disposition":"Unknown","Source":"MUFON","City":"Burnsville","map":"<A HREF = \"http://maps.google.com/maps?q=44.769162,+-93.276173(16545)&iwloc=A&hl=en\"> mufon case (16545) map </A>","files":["/var/www/straped/mufon/html2text/16545.html.txt","/var/www/straped/mufon/org/16545.html"],"divs":["Sighting DetailsA friend of mine and I where sitting out by here house stargazing on a hillside by here town home complex in Burnsville MN. The clouds where starting to move in, so i was not hoping to see many constellations. As we sat talking I began to notice six dim lights in the sky in the shape of a hallow. It was very clear that they made up some sort of a disc hovering in the air. At first I thought that maybe they where just stars peaking through the clouds, but as the clouds kept moving in I noticed that the lights did not leave. Though they where slightly dimmer. They seemed to be within the clouds. For a moment I figured that they could be spotlights. However there where no beams of light shining up into the sky. At this point I asked my friend if she saw that halo too. She in fact did. We watched it for almost half an hour until it finally started to dim. Eventually I could no longer see the lights and lost track of the object. Not once did the object move. Though I do believe that at some points it could have. However my eyes are not so great and I have issues with lights. Neither of us wanted to leave the hillside and miss the event and neither of us had any recording device available, so we where unable to record it. The entire time I had no idea what to think. I am still slightly frightened and even embarrassed(surprisingly) that it happened. I do not want people thinking that I am crazy and if their are any other explanations I would be happy to hear them."],"Date of the Event":"04/15/2009 11:40 UTC","Object Features":"Undisclosed","Summary":"There where six bright lights in a circle perfectly aligned hovering and able to be seen through the clouds.","Sighting Duration":"Undisclosed","Date Submitted":"04/15/2009 11:40 UTC","Weather Factors":"Unknown","Region":"Minnesota","Tags":"City","Latitude":"44.769162","trends":["There have been 3 other sightings in Burnsville","There were no other sightings in Burnsville on or around April 15th 2009"],"Object Shape":"Circle, Disc","Longitude":"-93.276173","Log Number":"US-04172009-0006","Viewing Distance":"Unknown","Country":"United States","Case Number":"16545","Object Flight Path":"Undisclosed"}