{"Case Number":"16549","Log Number":"US-04172009-0010","Source":"MUFON","Object Flight Path":"Path with directional change","Region":"Colorado","trends":["There have been 16 other sightings in Englewood","There were no other sightings in Englewood on or around April 16th 2009"],"Summary":"7 circle shapes in the pattern of two sides of a triangle. Moving in the direction following the point. Looked fuzzy or see thruugh. No sound. Maybe just reflected light from it.","Tags":"City","Longitude":"-104.98347","files":["/var/www/straped/mufon/html2text/16549.html.txt","/var/www/straped/mufon/org/16549.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Weather Factors":"Unknown","Country":"United States","Date of the Event":"04/16/2009 09:45 UTC","Date Submitted":"04/16/2009 09:45 UTC","Object Shape":"Boomerang, Triangle","Sighting Duration":"Undisclosed","Latitude":"39.657675","Disposition":"Hoax","City":"Englewood","divs":["Sighting DetailsMy fiance and I were sitting on my back deck looking at the stars and she said, \"what is that a bird?\" I had seen something moving in the sky but did not pay attention until she mentioned it. Immediately we could tell it was not a bird. The sky was clear but this thing seemed fuzzy or hazy, maybe see through. It moved liked it was gliding or being \"pulled\" along, not being propelled or pushed through the air. It seemed to be floating and moved some side to side as it kept moving along. It flew across the sky and then over the house where we could no longer see it. We both knew that it was a UFO. It was like nothing we had ever seen, even very hard to discribe. No way a camera would have captured, it was difficult to acquire by the naked eye. There were seven cirles or spheres in the formation of two sides of a triangle. One at the point and three on each side. You could see them but they didn't seem to be lit, more like dimly glowing or just reflecting light from the city. It looked like there was a shadow filling in the rest of the triangle. Is a good word for it \"cloaked\"? It was eerily quiet. It seemed that it was more quiet when it went by. Looking back the experience was surreal, it was nothing like we had ever seen, we are still trying to process it. Would love to get another look some time."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.657675,+-104.98347(16549)&iwloc=A&hl=en\"> mufon case (16549) map </A>"}