{"Latitude":"41.704311","Source":"MUFON","divs":["Sighting DetailsI was laying on the grass looking at the stars when movement grabbed my attention. It was difficult to process what exactly I was seeing at first but then I got a focus on it. The object was and inverted V with the point traveling forward. The object was difficult to focus on because it was made up of five (5) individual lights on each side, they appeared as though they were stars that would be visible with the naked eye. It moved as a whole object at a very odd speed, it appeared to slide across the sky with no resistance whatsoever, it was unlike anything I have ever seen as far as objects in flight. It also appeared to be transparent because I couldn't distinguish between the night sky and the object other then the lights moving in the inverted V pattern. From my perspective the object had to have been relatively low in the sky based off of its size (spacing between the lights as the basis of the objects size)yet there was no audible noise to be heard. It moved in the northwest direction and disappeared out of sight, almost as if it were two dimensional. Seeing this shook me up a little bit because nothing about it seemed normal, it was very difficult to believe my eyes and I doubt I would have if someone else hadn't seen it as well and been equally shaken by what was seen. This was my first time seeing anything like this and I was never a believer or a skeptic prior to this, I think that's why the event bothered me so much."],"Summary":"Inverted V, five lights on each side similar to visible stars, moving as one object.","map":"<A HREF = \"http://maps.google.com/maps?q=41.704311,+-73.91611(16542)&iwloc=A&hl=en\"> mufon case (16542) map </A>","Date of the Event":"04/16/2009 09:20 UTC","Country":"United States","Tags":"City","Region":"New York","Object Flight Path":"Undisclosed","Longitude":"-73.91611","Object Features":"Undisclosed","Log Number":"US-04172009-0003","trends":["There have been 14 other sightings in Poughkeepsie","There were no other sightings in Poughkeepsie on or around April 16th 2009"],"Case Number":"16542","files":["/var/www/straped/mufon/html2text/16542.html.txt","/var/www/straped/mufon/org/16542.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"04/16/2009 09:20 UTC","City":"Poughkeepsie","Sighting Duration":"00:00:15","Disposition":"Insufficient Data","Object Shape":"Triangle, Other"}