{"Disposition":"Unknown","Latitude":"35.479876","trends":["There have been no other sightings in Sanford","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/16553.html.txt","/var/www/straped/mufon/org/16553.html"],"Object Shape":"Circle","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"16553","Date of the Event":"03/10/2007 10:15 UTC","Region":"North Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=35.479876,+-79.180299(16553)&iwloc=A&hl=en\"> mufon case (16553) map </A>","Log Number":"US-04172009-0012","Date Submitted":"03/10/2007 10:15 UTC","City":"Sanford","Object Features":"Unknown","divs":["Sighting DetailsMy family and I were sitting on our deck about 10p.m. on March 10, 2007 and we noticed there was this object moving rapidly in different directions and then it would stop and hover and then do these same movements again. As we watched we heard and saw two F-15's approaching this object one approached from the east and the other approached from the west and as they got close to this object it shot straight up and disappeared in 2 seconds. I have never seen anything move so quickly. My best friend lives near us and as she was leaving for work that night(works third shift) her and her husband saw the samething happening. There have been other sightings in this area and I am sure that there will be more. I am not surprised at all about seeing these UFOs I am sure we are not the only planet in this vast solar system with life and to think we are is to me quite arrogant. I believe there have been space travelers for as long as man can remember. Especially since they are evn mentioned in the Bible."],"Summary":"Made quick movements sideways, up and down, zig zag motion.","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-79.180299","Tags":"City","Viewing Distance":"Over One Mile"}