{"divs":["Sighting DetailsMy girlfriend and I came home from a seminar and noticed a light beam that came out of the western horizon and streaked across the entire sky toward the east. We said, northern lights? No because it was coming from the western horizon. Milky way? No because it actually resembled the beam of a flashlight shining through clouds or something only on a much larger scale. I went in the house and grabbed the camera (Kodac EasyShare 643 - 6 megapixel). I wanted to see if I could capture the light. I took 25 pictures of the sky, but when I viewed them on my computer the light didn't really show up. However, something else showed up that neither of us saw with our naked eye. It was round and appears to me like a globe. As I say, I never seen the object myself, but have it on a digital memory card. I have copied it to my computer. When I went out to take the picture the light beam had shifted and was going from the west to the east south east instead of west to east."],"Country":"United States","Date Submitted":"04/16/2009 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.732239,+-83.451072(16558)&iwloc=A&hl=en\"> mufon case (16558) map </A>","Object Features":"None","Viewing Distance":"Unknown","Object Shape":"Circle, Sphere, Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/16558.html.txt","/var/www/straped/mufon/more/16558_submitter_file1__100_0282.JPG","/var/www/straped/mufon/org/16558.html"],"Sighting Duration":"Undisclosed","Longitude":"-83.451072","Latitude":"43.732239","Summary":"Trying to capture light beam in sky caught a globe shape.","Log Number":"US-04172009-0017","Weather Factors":"None, Does Not Apply","trends":["There has been one other sighting in Sebewaing","There were no other sightings in Sebewaing on or around April 16th 2009","This sighting has never been favorited.",""],"City":"Sebewaing","Object Flight Path":"Unknown","Case Number":"16558","Source":"MUFON","Region":"Michigan","Tags":"City","Date of the Event":"04/16/2009 09:30 UTC"}