{"Object Features":"None","Longitude":"-61.478912","Region":"San Juan-Laventille","Case Number":"16559","Date Submitted":"07/31/1987 12:00 UTC","Object Shape":"Bullet, Missile, Cigar","Tags":"City","Summary":"Cigar shaped, dull metallic, no wings, fuselage or external projections.","map":"<A HREF = \"http://maps.google.com/maps?q=10.659567,+-61.478912(16559)&iwloc=A&hl=en\"> mufon case (16559) map </A>","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"10.659567","Date of the Event":"07/31/1987 12:00 UTC","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/16559.html.txt","/var/www/straped/mufon/org/16559.html"],"trends":["There have been no other sightings in Port-of-Spain","This sighting has never been favorited."],"Country":"Trinidad & Tobago","Log Number":"TT-04172009-0018","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting Details On the date given i was a Police Officer attached to the Trinidad and Tobago Police Service. Around 100 pm on the day in question I was in my living room having lunch, visibility was exceptional, the day was sunny as many other days since we have beautiful tropical weather, my wife looking out the open doorway in the kitchen towards the mountains approximately one mile away to the East of our home called out to me in a loud tone\" mitch, come and look at this, what the hell is this\", realizing her excitement i went to where she was standing when she pointed to the direction of the mountains where i saw this cigar shaped dull metallic object in the air, size I'd calculate because of distance could be 150ft in length, height approximately 40 ft there were no wings or any other projections attached to this object, which was slowly heading towards the mountains. I continued viewing this object for about 7 seconds whilst when it disappeared behind the mountain. I came to the conclusion that this object could not be any aircraft known to me and both my wife and myself had no idea what it could have been. After 22 years i still have that belief. Except for my wife i have not discussed the incident with anyone for fear of ridicule since in my small country people seem not to entertain those discussions."],"City":"Port-of-Spain","Object Flight Path":"Straight-line path"}