{"trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around April 12th 2009","This sighting has never been favorited.",""],"City":"Roanoke","map":"<A HREF = \"http://maps.google.com/maps?q=37.27696,+-79.932377(16554)&iwloc=A&hl=en\"> mufon case (16554) map </A>","Date of the Event":"04/12/2009 08:35 UTC","Sighting Duration":"00:01:30","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/16554.html.txt","/var/www/straped/mufon/more/16554_submitter_file1__4.12.09003.jpg","/var/www/straped/mufon/org/16554.html"],"Latitude":"37.27696","Case Number":"16554","Summary":"Bright red silent light flying very low.","Country":"United States","Date Submitted":"04/12/2009 08:35 UTC","Region":"Virginia","Longitude":"-79.932377","divs":["Sighting DetailsI had just walked to my back door to have a cigarette on the back deck and I noticed a very bright red light traveling up the mountain right behind my house. Originally, I thought it was the brake lights of a car traveling very fast up the road on the mountain. Then I realize that the light was not on the road when it traveled straight up very fast to the top of the mountain and was still heading higher. At this time, I yelled for my daughter to come outside and see what I was looking at. She knew before she ever got outside what it was because we have had other sitings in the last year from our back deck. When she came out the light began to travel towards us. This was the first time that we both actually got a little nervous because it just kept coming closer to us just above the tree tops. I ran in to grab my camera and ran back out and it was still there just hovering about 100 yards away still above the tree tops. The light was extremely bright and the object made no noise. I took the picture and the flash went off on my camera. We then realized that the ducks down at the creek behind our house were quacking very loud and the dogs in the neighborhood were all barking. After, I took the picture and the flash went off the light seemed to began to vanish right before our eyes. I couldn't tell if the object was getting smaller, moving away, or just disappearing. Within a matter of seconds the light had completely disappeared before us and then ducks and dogs seemed to quiet instantly. From where we were standing on the back deck if we were to hold up a quarter that would be about how big the light was. We continued to stay outside looking for it for about another 15 minutes but didnt see anything more. We have had other sightings including crafts zooming over the mountain stopping and hoovering while changing colors then disappearing and a single bright white light that flew over our house very low then returned a few minutes later to disappear right above us. This particular white light was a triangular, silent,silhouette. I have attached the picture I took with my Cannon PowerShot A410. The light was alot closer, larger and brighter than what my camera picked up. Maybe someone can zoom in on the light in the picture and get more detail about the object."],"Object Shape":"Unknown","Object Flight Path":"Stationary,Path then hovering","Log Number":"US-04172009-0013","Weather Factors":"None","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Source":"MUFON"}