{"Viewing Distance":"Unknown","Date of the Event":"11/24/1992 07:00 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","City":"Shirley","Date Submitted":"11/24/1992 07:00 UTC","Weather Factors":"Unknown","Region":"New York","Latitude":"40.801488","Object Shape":"Fireball","Country":"United States","files":["/var/www/straped/mufon/html2text/16552.html.txt","/var/www/straped/mufon/more/16552_submitter_file1__benttrees.jpg","/var/www/straped/mufon/org/16552.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.801488,+-72.867603(16552)&iwloc=A&hl=en\"> mufon case (16552) map </A>","trends":["There have been 3 other sightings in Shirley","There were no other sightings in Shirley on or around November 24th 1992","This sighting has never been favorited.",""],"divs":["Sighting Detailsin 1992 a ufo crashed into southhaven park in shirley long island. many witnessed the event as it is near sunrise highway, a well traveled roadway. the park was closed for three days. brookhaven national labs was called in. a large flatbed truck brought something large back to the lab. my brother, who worked on the lab at the time, told me that they had an alien, alive, on the lab property. he told me this shortly before he died in 2006. he told the same thing to my mother, and his family in real time., at the time of it happening. there are reports saying there there is film footage of the event. the spot of the crash is still obvious from ariel view. the trees are twisted and turned about. some of them are bent. and it is reported that there is no electro magnetic field where there should be there. in order to corroborate my sighting information i offer you this report from the paranormal investigative group. long island oddities: i have also enclosed a picture of the twisted trees. Southaven Park - the crash The most Coherent information on Southaven was located in the LIUFON Press Release on August 3 1998. The actual crash occurred at 7:00pm on Nov. 24th, 1992. A man was driving east on Sunrise Highway heading toward WIlliam Floyd Parkway. There was a patch of trees separating Sunrise from Montauk Hwy. To the south of Sunrise he saw a large craft that he describes as, \"tubular in shape with two large bright blue lights on each end with a bright white light in its center whose structure was composed of a dull metallic grey texture\". He saw the object make a very tight right angle, cross the highway, and crash into the woods of Southaven Park. When it hit, the object emitted a dazzlingly white beam that was said to turn night to day for a moment. The same man turned and came back on the other side of Sunrise to backtrack and find the source of the crash. He saw helicopters near the exit to William Floyd Pkwy. Neither the helicopters or the personnel that came to block off the westbound exit to William Floyd bore any markings or insignia and the men were dressed in plain black. Finally he went west on Victory which was closed off later, and reached the second turn on Gerard Ave. This street and its neighbors would soon report all manner of electrical glitches, phone ringing with no one there, and TV static. At this time though our witness could see a huge fire back in the woods. At the same time someone also driving east on Sunrise saw an oval shaped object fly over the town dump hill, \"on a descending course 30 degrees to the horizon which was leaving a green ionization trail as it passed\". Could this have been part of its crash trajectory? The oval craft or one like it may have been scouting out the local area because there was an incident \"reported over Islip Town which were seen on the Channel 12 News in March 1992 at the Bagatelle Road Exit of the Long Island Expressway\". Some researchers say even now that there are areas of Southaven that have the trees bent as if almost torn out of the ground at some point in their growth. On a scouting mission we think we found such a site. We also found a good aerial shot of the area that shows a large roundish area that has no trees at all. The photos are below."],"Summary":"ufo crashed at southhaven park in shirley long island.","Source":"MUFON","Disposition":"Unknown","Log Number":"US-04172009-0011","Longitude":"-72.867603","Object Flight Path":"Undisclosed","Case Number":"16552"}