{"Summary":"Over flight by unknown triangle craft or formation.","City":"St Petersburg","Object Shape":"Triangle, Other","files":["/var/www/straped/mufon/html2text/16568.html.txt","/var/www/straped/mufon/org/16568.html"],"Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsAt approximately 8:50 last evening (4-17-09) I was leaving a friend's house in Gulfport, Florida and noticed what I thought to be a low flying aircraft coming almost directly over my vehicle. I could see clearly a triangle shape of lights with distinct solid red lights at the three corners and white blinking lights at the corners also. Following this closely were what appeared to be three other sets of lights that didn't seem to be in the triangle shape. The objects were moving from the SW to the NE at a slow speed and probably below 5000 ft. altitude although it was hard to judge, but not very high. I have seen many aircraft at night and live in the landing pattern of MacDill AFB, so am very used to numerous aircraft types, civilian and military. I am 58 and this was the first time I have seen something like this. I am not certain if I was seeing six distinct craft, or whether the triangle was one large one. There was no sound that I detected, as should be the case at that altitude by normal aircraft of any type. I could not detect a solid shape to the triangle, but it was quite dark at the time and no moon. I was looking out my driver side window and had stopped in the road to look at the lights. The total time it was observed by me was approximately 30 seconds. I've never seen a military formation with this much distance between them or with the strange lighting. As it was headed over downtown St. Petersburg, it must have been viewed by many people."],"Longitude":"-82.63341","Source":"MUFON","Object Features":"None","Case Number":"16568","Tags":"City","Latitude":"27.776156","Disposition":"Unknown","trends":["There have been 35 other sightings in St Petersburg","There were no other sightings in St Petersburg on or around April 18th 2009"],"Weather Factors":"Unknown","Date Submitted":"04/18/2009 12:00 UTC","Object Flight Path":"Straight-line path","Date of the Event":"04/18/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.776156,+-82.63341(16568)&iwloc=A&hl=en\"> mufon case (16568) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-04192009-0001","Region":"Florida"}