{"Disposition":"Unknown","Latitude":"36.20811","Object Shape":"Star-like","City":"Lebanon","map":"<A HREF = \"http://maps.google.com/maps?q=36.20811,+-86.291102(16560)&iwloc=A&hl=en\"> mufon case (16560) map </A>","Country":"United States","Weather Factors":"None, Does Not Apply","Region":"Tennessee","Viewing Distance":"Over One Mile","Date Submitted":"04/17/2009 08:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Lebanon","There were no other sightings in Lebanon on or around April 17th 2009"],"Object Features":"None","Object Flight Path":"Path with directional change,Other","Date of the Event":"04/17/2009 08:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/16560.html.txt","/var/www/straped/mufon/org/16560.html"],"Summary":"Approx. 6 objects moving erratically S to N very high alt horz to horz in approx. 5 min.","Longitude":"-86.291102","Log Number":"US-04172009-0019","Case Number":"16560","divs":["sighting details1. outside home looking at sky. stars can be seen clearly but some light pollution--no overcast noticed. aircraft seen in sky during this half-hour period: 1 (headed north) at approx 10k feet; 2 (headed north east) at approx 20k feet. no aircraft visible while objects were visible. 2. movement. stare at 2 or 3 stars close together (about 10 degrees apart) and any nearby movement stands out. each object seemed to move like a satellite in low orbit. 3. satellite (have observed satellites before) 4. under closer visual observation object changed velocity (+\\-) in a rapid jerky manner. angular motion (+\\-) was also rapid and jerky. these deviations from what seemed to be a smooth orbital path were not obvious at first but quickly became apparent: the motion was very odd. one went from west to east and then swerved back and headed north also (this might have been two objects). using 8x50 binocs on the last object just revealed a point of light but brighter than the visual object. all these observations were made relative to the nearest fixed star so there would be no illusion of motion. 5. first time i have seen anything in the sky that appeared to do the impossible. it was interesting. i thought that with a steady hand i could mimic the motion (all objects basically moved the same way) with a laser pointer on a theater wide screen. it seemed that the object was not under the influence of newtonian forces as you would expect of a physical object up in the sky--sort of like a 'cosmic' laser pointer. 6. objects disappeared in distance approx 45 degrees above horizon."]}