{"Viewing Distance":"501 Feet - 1 Mile","Summary":"6 UFO lights moving north over Evanston.","Region":"Illinois","Tags":"City","Weather Factors":"Unknown","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/16561.html.txt","/var/www/straped/mufon/org/16561.html"],"Case Number":"16561","Latitude":"42.048051","Log Number":"US-04182009-0001","City":"Evanston","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Evanston","There were no other sightings in Evanston on or around April 17th 2009"],"Longitude":"-87.680449","divs":["Sighting DetailsAt 9:40 pm I ( 48 year old professional) was arriving home from picking my daughter up in Evanston. Just prior to pulling the car into the garage, my 11 year old yelled from the back seat \" oh Crap- dad.. a UFO\" She was out of the car. I thought perhaps she was just joking. I got out of my vehicle to open the garage door as my remote was unresponsive. I looked up over head and slightly north and observed four lights moving together northward. They appeared to be about 3000 feet or less if they were the size commonly on aircraft. The sky was very clear tonight as I could make out the big dipper immediately between me and the moving lights. They were in a somewhat linear arrangement, like orion and a fourth light positioned left of the lead light. I then hollered for my friend and son to come out and see this. I then notice two other lights trailing the four lights, but moving in a irregular, somewhat elliptical fashion across the sky. By eliptical I do not mean long sweeping arch, but short, tightly curved sweeps across the sky. My friend (a 53 year old professional) and my 13 year old son both observed the lights moving across the sky and the additional two trailing lights. We all agreed it was not a jet or jets. No sound was heard. The lights were white and steady. after five minutes or perhaps slightly less, the lights were so small we were no longer able to visually track them. My daughter having the closest look thought thought the four light were together on a single unit, appearing somewhat invisible. Like a big shape of four lights stuck together, but could not see the platform, but the lights kept rotating\" I have observed many satellites at night. They were not satellites.. they were too near in the local sky and not moving in a precise linear arch. They were not commercial jets, however. I am confident that they would have appeared on the ORD - Chicago radar control as they were in Class controlled airspace."],"Object Flight Path":"Path with directional change","Date Submitted":"04/17/2009 09:40 UTC","Date of the Event":"04/17/2009 09:40 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.048051,+-87.680449(16561)&iwloc=A&hl=en\"> mufon case (16561) map </A>","Country":"United States","Disposition":"Insufficient Data","Object Features":"None"}