{"map":"<A HREF = \"http://maps.google.com/maps?q=36.616984,+-6.358202(16563)&iwloc=A&hl=en\"> mufon case (16563) map </A>","Weather Factors":"Unknown","trends":["There have been no other sightings in Rota","This sighting has been favorited 1 time."],"Region":"Andalucía","Summary":"Appeared at naval base in early hours. Remained until after 1700.","Latitude":"36.616984","Longitude":"-6.358202","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change","Date of the Event":"05/31/1972 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/16563.html.txt","/var/www/straped/mufon/org/16563.html"],"City":"Rota","Case Number":"16563","divs":["Sighting DetailsI was an electronics mechanic assigned to the control tower at the U.S. naval base at Rota, Spain. I daily checked with air controllers to see if any immediate repairs were needed. I entered the control tower at approximately 0830. Two controllers were in the tower not paying any attention to a very large spherical object at the east end of the runway. It's hard to say how far away it was because I don't know the size and it is hard to say the size since I didn't know the distance but it was large. It appeared spherical but there was no shadow because it radiated a very white light. It was like looking at the sun but it didn't hurt my eyes. I ask if it showed up on radar and was told that the ground controlled approach radar was down for scheduled maintenance. I did see some pilots go to their planes on the apron to light up their radars but never did hear if they had radar acquisition. I had a strange urge to bow down to this thing. May say something about my mental stability. I mention it in order to record all that I remember. I ask what in the hell it was and nobody knew. They said it was there at 0600 when the controllers woke up from their nap. They slept on watch as there was almost never any traffic after midnight. The exact arrival time is therefore unknown. I was told that it at one point ascended at an extreme rate of climb. Near instantaneous to around 50,000 feet. Moved slowly to the south east and hovered over the port area. We had both missile boats and fast attack boats. I hovered there for minutes then did the climb and slow drift to it's original position where I saw it. At around 1000 I went up to the tower to see if it was still there and the tower was full of naval officers including the c.o. of the base. There were no intelligence types that I saw. Air ops, air traffic control and others who were assigned to the air terminal building. There were secretaries from around the building. At some point one of the officers ask if we should scramble the air force. The c.o. said that they would just laugh at us. I returned to work and checked periodically. After noon chow the object had moved to the southwest and hovered over the atlantic ocean until 1700 when I got off work. One thing that may be related is a strange action by base security. I don't recall how much later but sometime later, maybe a month or more, the air traffic control division and the ground electronics division was called to base security. We were given a story about fissionable material being missing from the weapons department. We had to carry radiation dosemeters which nobody did. I ask why we were involved since we didn't have access to the weapons dept. and was told not to be a smart ass. The dates are approximate because there has been many years passed since the incident occurred. I will say that at the time I questioned whether the object was extra terrestrial or perhaps earthly and experimental."],"Date Submitted":"05/31/1972 12:00 UTC","Object Features":"None","Log Number":"ES-04182009-0003","Sighting Duration":"Undisclosed","Country":"Spain","Tags":"City"}