{"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Date Submitted":"04/18/2009 07:30 UTC","Date of the Event":"04/18/2009 07:30 UTC","Object Flight Path":"Straight-line path","Case Number":"16579","City":"Noblesville","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around April 18th 2009","This sighting has never been favorited.",""],"Object Shape":"Disc, Star-like","Region":"Indiana","Summary":"Black disc with star-like triangles all around the edge, used my binoculars to get closer look.","map":"<A HREF = \"http://maps.google.com/maps?q=40.053432,+-86.003726(16579)&iwloc=A&hl=en\"> mufon case (16579) map </A>","Latitude":"40.053432","files":["/var/www/straped/mufon/html2text/16579.html.txt","/var/www/straped/mufon/org/16579.html"],"divs":["Sighting DetailsI was in my backyard (downtown Noblesville Indiana) looking up at some pigeons flying around and noticed a dark spot in the sky thinking it was a balloon a kid let go. As I kept looking at this spot it moved directly over my yard and I then noticed the way it was flying was strange (not like a balloon) and it looked disc shaped. It was sunny outside with a mild breaze and some clouds to the East. I had my son bring me binoculars and I zoomed in on the object as it slowly flew over my yard from West to East and I clearly saw a black disc shaped object with triangles all around the edge, like a star pattern. It was rotating slowly but appeared damaged as it was wobbly rotating but in a consistent pattern. It definitely was not a balloon. It was low enough to see it with my naked eyes and my neighbor came out and by that time it was too far away for him to see. It appeared to go into the clouds from a distance. I got into my car to try and follow it but could not see it due to clouds. I felt amazed at what I saw, disappointed my neighbor could not see it, but my son saw it too."],"Disposition":"Insufficient Data","Log Number":"US-04202009-0002","Longitude":"-86.003726","Country":"United States","Tags":"City"}