{"files":["/var/www/straped/mufon/html2text/16577.html.txt","/var/www/straped/mufon/org/16577.html"],"Longitude":"-104.873713","Object Features":"Undisclosed","City":"Centennial","Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change","Object Shape":"Disc","divs":["Sighting DetailsI had just left Littleton, CO headed for Ft. Collins. I was driving north on University Blvd. and as i looked north above the treeline in the sky probly 35 to 45 degrees off the horizon something caught my eye. I couldnt really get a good look at it for long enough before the road dipped and the object was obstructed by trees. By the time the trees were no longer in the way i looked in the same spot and couldnt see anything. I wasnt sure what i had seen until about another mile up the road i looked up the same area and i saw it again but this time it had moved probly five to ten miles westward. I stared at it as much as i could while driving trying to decipher what it could be. From my viewpoint, its apparent shape was that of a disc, but the object was probably 1500 to 2000 feet up in the air and at least a mile away from me, so it could have been a traingle or cylinder shape etc. At first it appeared white against the blue sky, and it was slowing moving Northwest. But as it passed under a small group of clouds, it appeared to almost camoflauge itself with its backround. It blended with the color of the clouds, and then as it passed back onto the blue backround of sky again it appeared to look blue. I couldnt keep my eye on it the entire time because i was driving and there was no one else in the car to watch. I looked at the road and then looked back and it was moving away very fast, it grew smaller and then it was gone. It was a very clear day and there werent many clouds in the sky. I am one hundred percent convinced that it was not a plane or jet or helicopter of any kind, it did not have the normal flight charachteristics that you would find in our known earthly arsenal. Afterward i saw a lot of activity in the area in the sky, but im not sure if the planes in the area were comercial planes or military planes or what. I have read a lot on the subject of UFOs but this is my first personal experiece seeing anything and i would like to know if anyone else saw it."],"Sighting Duration":"Undisclosed","Latitude":"39.588615","Log Number":"US-04192009-0010","Disposition":"Unknown","Country":"United States","Tags":"City","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=39.588615,+-104.873713(16577)&iwloc=A&hl=en\"> mufon case (16577) map </A>","Summary":"While driving I saw a white disc shaped object.","Date of the Event":"04/19/2009 05:10 UTC","Date Submitted":"04/19/2009 05:10 UTC","Source":"MUFON","Case Number":"16577","trends":["There have been 16 other sightings in Centennial","There were no other sightings in Centennial on or around April 19th 2009"],"Weather Factors":"None"}