{"Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"None","Country":"United States","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16573.html.txt","/var/www/straped/mufon/org/16573.html"],"Summary":"My friend witnessed these UFOs on the way to work.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.604311,+-73.082389(16573)&iwloc=A&hl=en\"> mufon case (16573) map </A>","Date of the Event":"05/31/2001 12:00 UTC","Date Submitted":"05/31/2001 12:00 UTC","Object Shape":"Star-like","Case Number":"16573","Object Flight Path":"Path with directional change","Latitude":"41.604311","divs":["Sighting DetailsIn the summer of 2001 in early evening, I left my house in Fairfield County, Connecticut to go to work. I managed a retail store at the time. It was dark and the stars were out, as I pulled out of the driveway I noticed there were three white lights in the sky sitting together over my left shoulder as I drove the car facing to the north. They were the size of the planet Venus when we are able to see it in the sky. One seemed either further away or smaller than the other two. They were just above the tree line along the road but in the distance I had no sense of how close they were. They were fairly bright and caught my eye. I thought they were stars. As I made a few turns to get on the highway I noticed that the lights were still over my left shoulder but i was going east now so I thought they were lights on a plane possibly. They stayed over my left shoulder the whole way on the highway as if they were following me. I turned off the highway and was going west and the lights were still over my left shoulder in the same place in the sky. I started thinking they were much more than lights. After a few more turns which the lights made with me, I arrived at work. I parked in front of the store and rushed in to get the other manager to come out to see the lights. They stayed right in the sky where they were when I parked and hovered as my co-worker and I watched them for about 10 minutes. Then one after another they zoomed away and left no trail. The last one stayed for a few seconds longer then followed the others. The smaller left first. I had no missing time; I got to work on time."],"City":"Undisclosed","Longitude":"-73.082389","Region":"Connecticut","Weather Factors":"Unknown","Log Number":"US-04192009-0006","trends":[]}