{"Summary":"Lights hover I-29,backflip as move straight up","files":["/var/www/straped/mufon/html2text/1658.html.txt","/var/www/straped/mufon/org/1658.html"],"City":"Omaha","trends":["There have been 4 other sightings in Omaha","There were no other sightings in Omaha on or around December 25th 2001"],"Object Flight Path":"Unknown","Sighting Duration":"00:05:00","Log Number":"","Date Submitted":"12/25/2001 06:42 UTC","Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"101-500 Feet","Region":"Iowa","Longitude":"-95.997988","map":"<A HREF = \"http://maps.google.com/maps?q=41.252363,+-95.997988(1658)&iwloc=A&hl=en\"> mufon case (1658) map </A>","Case Number":"1658","Country":"United States","divs":["Sighting Details OnChristmas Day night at 6:42 p.m. the family of witnesses (mother, father, and 4children - 2 of whom were toddlers, and the older two children being age 11 and12) were on their way from Sioux City, Iowa back to Omaha, Nebraska on I-29(SOUTHBOUND) when south of Missouri Valley, Iowa (about 3 miles north of theNorth Omaha exit, which turns west on I-680), they sighted a lighted objectabout one-half mile ahead of their vehicle.The mother called the familys attention to the light ahead of them, commentthat the lights looked like a crown. It was at first thought that the objectwas an airliner on approach to Eppley Airfield several miles south of theirposition. But as the vehicle neared the lights, the family realized that theobject was hovered beside the opposite side of the interstate, rather thanmoving, and realized they were looking at what appeared to be a UFO.They also observed that traffic on the opposite (NORTHBOUND) side of theinterstate had drastically slowed and that 4 cars had stopped as if observingthe object and that one individual had gotten out of a vehicle and was lookingup at the object.At closest approach, the object was perhaps 500-600 feet ahead and diagonally tothe left (SE) of the witnesses vehicle and at an estimated 500 feet altitude. As witnesses vehicle drew near, the object suddenly began to rise, and as itdid so, the Witnesses perception was that the objects lights seemed to flip360 degrees (briefly disappearing from view as it flipped, then reappearing intheir original position) as it rose straight up into the clouds and disappeared.NOTE: It should be noted that altitude estimates are always subject to thewitness perception. Because of the 2,200 foot cloud ceiling, we at least knowthe object was below 2,200 feet altitude - and the object may in fact have beenno higher than the witness estimate of 500 feet. Without the ability to be morespecific, what seems obvious is that the sighting was close, and at fairly lowaltitude.Sighting duration was perhaps 3-4 minutes. To the witnesses, the size of theobject was indeterminate - they indicated that it was smaller than an airliner. The adult (father) witness is a well-spoken, thoughtful type individual, who didnot try to over-conclude during phone conversations with the investigator beforenor during the on-site interview conducted on February 17, 2002. The twoadolescent witnesses, ages 11 and 12, are intelligent children, fascinated andamazed by what they saw and articulately willing to share their perception ofthe incident. The children exhibited nothing giddy or frivolous as theydescribed and drew sketches of their perceptions of what theyd seen. Theysimply entered seriously into the conversation when encouraged to do so, as wedrove to the site and sat parked for 30 minutes viewing the area."],"Date of the Event":"12/25/2001 06:42 UTC","Tags":"City","Object Shape":"Boomerang","Disposition":"Unknown","Latitude":"41.252363","Weather Factors":"Unknown"}