{"Tags":"City","Country":"United States","Date Submitted":"04/16/2009 08:53 UTC","files":["/var/www/straped/mufon/html2text/16584.html.txt","/var/www/straped/mufon/org/16584.html"],"Sighting Duration":"00:00:30","Summary":"Bright white circular object moving at a very fast speed","Log Number":"US-04202009-0007","Source":"MUFON","Date of the Event":"04/16/2009 08:53 UTC","Object Flight Path":"Path with directional change","Latitude":"42.394877","Region":"Massachusetts","Viewing Distance":"Unknown","trends":["There has been one other sighting in Somerville","There were no other sightings in Somerville on or around April 16th 2009"],"Disposition":"IFO","Case Number":"16584","map":"<A HREF = \"http://maps.google.com/maps?q=42.394877,+-71.091697(16584)&iwloc=A&hl=en\"> mufon case (16584) map </A>","Longitude":"-71.091697","Object Shape":"Circle, Sphere","City":"Somerville","Weather Factors":"None","Object Features":"Unknown","divs":["Sighting DetailsI was taking a left onto Somerville Avenue in Somerville Massachusetts. While waiting for traffic to clear, I noticed a very bright white light moving very quickly at a low altitude. It's speed caught my attention immediately. It was in the western sky, heading north. I only saw this object for about 20 seconds until it disappeared due to its low position in the sky behind some buildings. I did not hear any sound however it may have been too far away to hear an audible sounds. While observing the object, it moved with a slight arc downwards toward the ground. I checked the NASA website and confirmed the ISS was not visible at this time as I have seen the ISS before. However this object was far brighter than the ISS and moved much faster. Typically, planes fly over this area from Logan after taking off heading east to west at a low altitude (Somerville is about 3 miles from Boston Logan). The direction this object was traveling was not a normal flight pattern for any commercial aircraft. On this night, the winds were calm and planes were not taking off over Somerville. I confirmed this on the Passur Airport tracker software on the Boston Logan Massport website. One aircraft at the time I witnessed the object was heading west near somerville which is not the way I saw this object traveling. So whatever this object was, it did not appear on Boston's airport radar. I hope this information helps and anyone else who saw the same object should be encouraged to report it as well. Thank you."]}