{"Viewing Distance":"101-500 Feet","Object Shape":"Cone, Fireball","Date of the Event":"04/19/2009 09:30 UTC","Region":"North Carolina","Case Number":"16585","Latitude":"35.936718","map":"<A HREF = \"http://maps.google.com/maps?q=35.936718,+-78.998102(16585)&iwloc=A&hl=en\"> mufon case (16585) map </A>","divs":["Sighting Detailslast night at around 9.30pm I went out in my back yard to let my dog out, as soon as I opened the door I saw a large orange light like aplanet, it was standing still. I shouted my mother who I live wit to come out quickly as it started moving slowly south, then it turned and started going north towards durham city.it sort of had a short fire trail behind it.My mum when seeing it said \"it looked like a plane on fire?, yet I thought it looked like a planet. I ran in house to get camera and I couldnt find it, so grabed my phone to take a picture. In sky it was moving very slowly yet in phone camera lense it was shooting about very quickly like a orb. I caputred light, yet its only small dot on camera and white not orange like to eye. It was moving slowly, yet I was in a panic trying toget camera etc and it seem to be over very soon afterwards. Mam and I didnt say much as I think we were both shocked. I know theres an explaination somewhere. has anyoneelse seen this in the county durham area of durham or anyone anywhere?. angela"],"Source":"MUFON","Log Number":"GB-04202009-0008","City":"Chapel Hill","Summary":"Large orange ball with trail, standing still, then moving slowly in zig zag movements.","Longitude":"-78.998102","Sighting Duration":"Undisclosed","Date Submitted":"04/19/2009 09:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Country":"United States","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/16585.html.txt","/var/www/straped/mufon/org/16585.html"],"trends":["There have been 4 other sightings in Chapel Hill","There were no other sightings in Chapel Hill on or around April 19th 2009"],"Object Features":"Dome"}