{"Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=36.728058,+-108.218686(16591)&iwloc=A&hl=en\"> mufon case (16591) map </A>","trends":["There have been 4 other sightings in Farmington","There were no other sightings in Farmington on or around June 14th 1957","This sighting has never been favorited.",""],"Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsMy sister and I were playing out in our front yard. It was a clear day in June. I noticed a sphere hovering in the air to the SW of our house and yelled at my sister to look. We both looked at it for a about 30 seconds. It was about 500 feet away just hovering about 150 feet in the air. It was a dull metallic gray color and had several rows of black square windows around it. It did not make any noise that we could hear. Its size was around 150 feet in diameter. I turned and ran to our front porch (20ft away) yelling for my dad to come out and see the object. The front door was open but the screen was closed. My dad was sitting on the couch in the living room and I got him to come outside to see what we were looking at. As he came outside I turned and looked for the object. I could not see it anymore and asked my sister, where is it? She stated, its gone! I ran back out into the front yard and looked in all directions. I could see in all directions from our house. Whatever it was had come and left quietly. I explained to my dad what we had witnessed and he said he did not know what it could have been. Even at that age I was fimilar with aircraft. My dad taught me about planes. He and my mother were both pilots and used to fly a converted B-25 out of Santa Fe airport in the late 1940's. My feelings at the time were high excitement. I knew this was something unusual and I have always wondered what it was. It is still a very vivid memory and I recall the details to this day."],"Viewing Distance":"101-500 Feet","Date Submitted":"06/14/1957 12:00 UTC","Object Shape":"Sphere","Case Number":"16591","Date of the Event":"06/14/1957 12:00 UTC","Object Features":"Window(s)","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-04202009-0013","Longitude":"-108.218686","Weather Factors":"Unknown","Summary":"Sphere appeared SW of our location 150 in the air /500 feet away /no noise.","Latitude":"36.728058","files":["/var/www/straped/mufon/html2text/16591.html.txt","/var/www/straped/mufon/org/16591.html"],"Source":"MUFON","City":"Farmington","Object Flight Path":"Stationary"}