{"Log Number":"","Case Number":"1659","Date Submitted":"01/22/2002 05:02 UTC","Date of the Event":"01/22/2002 05:02 UTC","Latitude":"43.363857","Summary":"Lighted object hover back yard 30 ft above utility","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.363857,+-92.554069(1659)&iwloc=A&hl=en\"> mufon case (1659) map </A>","Country":"United States","Longitude":"-92.554069","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Riceville","This sighting has never been favorited."],"Region":"Iowa","Weather Factors":"Unknown","City":"Riceville","Viewing Distance":"21-100 Feet","Object Shape":"Disc","Source":"MUFON","divs":["Sighting DetailsWitness work is related to the medical profession. She works nights, gets homeabout 12:30 a.m., and stays up sometimes as late as 6:00 a.m.In early morning hours of January 22, 2002, as witness was lying across hersisters bed (facing east) talking long distance with her boyfriend, a lightshone in the bedroom window and drew her attention to an object hovered above a30-foot utility pole in the back yard some 100 feet from the house and sheestimates that it was hovered at about twice the height of the pole, i.e. about30 feet above the pole, directly east of the bedroom windows.Witness saw 3 white lights, very bright, plus one red light in the center ofwhat seemed to be the underside of the object. While witness boyfriend waitedon the telephone line, she scrambled to get her glasses and when she againturned toward the window, she realized the object had moved away from theutility pole area. And when she looked to the northeast, she saw that it washovering again, but now at some distance (perhaps a few miles) away, seeming tohave elevated in altitude. (At no time, did the witness actually see the objecttravel.)Her first impression (based on the positioning of the lights led her to thinkthe object might be triangular, but she was not sure, since the lights when somedistance away did not show the same configuration as she thought them to be upclose (and without her glasses on).The entire episode lasted for perhaps 3 minutes, with the very close, but verybrief sighting of perhaps ten (10) seconds or less near the house furnishing themost clarity for the witness perception - even given the fact that she was notwearing her glasses.NOTE: It should be noted that witness at age 18 and on her way home from a highschool dance, saw steady red lights (lower than a jet liner flies) which movedback and forth...and when she pulled in to her home driveway, she stood andlooked for 3-4 minutes before it moved away.NOTE: It should also be noted that witness (in a telephone conversation withInvestigator Trout) referred briefly to recalling some sort of sightingexperience when she was a child and in the car with her parents, but couldntrecall detail."],"files":["/var/www/straped/mufon/html2text/1659.html.txt","/var/www/straped/mufon/org/1659.html"],"Object Features":"Undisclosed","Sighting Duration":"00:05:00"}