{"Summary":"Orange fireball traveling northbound over Las Cruces.","divs":["Sighting DetailsMy wife and I were out exercising near our home in the northern part of Las Cruces, New Mexico. She was jogging and I was on the bicycle. We were on a road (Settlers Pass) heading eastbound when I saw an orange fireball in the southern sky. At first I didn't know if what I saw was a street light or a helicopter with a spotlight in our direction or maybe a meteor. As I slowed down the bicycle I briefly lost view of the fireball behind a house. I wanted to make sure what I saw so as I kept rolling east I saw the object again and it was flying northbound towards our direction. I was surprised that it did not have any blinking lights like all the other aircraft that I see fly over. I told my wife about it, she had already finished her jog before me spotting the fireball and was walking to cool down. She thought it was strange too. It flew almost directly over us, just a little to our east as it kept going north. It moved the same speed as any other aircraft that I have seen. By the time that it was some 2 or so miles north of us, it must have sped up because the light got small really fast and eventually we could not see it anymore. I wondered if anyone saw it. I did not report it to the police because they probably can't do anything about it. I don't know if this was an extraterrestial craft but if it was all I have is two eye witnesses. With no visual proof I was not too excited to share this with too many people, but I thought I should tell someone or at least log it down for myself."],"Country":"United States","Object Shape":"Fireball","Date of the Event":"04/20/2009 06:35 UTC","Case Number":"16597","Disposition":"Unknown","Tags":"City","Region":"New Mexico","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around April 20th 2009"],"Longitude":"-106.759564","map":"<A HREF = \"http://maps.google.com/maps?q=32.32585,+-106.759564(16597)&iwloc=A&hl=en\"> mufon case (16597) map </A>","Weather Factors":"Unknown","Log Number":"US-04212009-0004","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16597.html.txt","/var/www/straped/mufon/org/16597.html"],"Object Features":"Undisclosed","City":"Las Cruces","Latitude":"32.32585","Source":"MUFON","Date Submitted":"04/20/2009 06:35 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}