{"Latitude":"44.22463","files":["/var/www/straped/mufon/html2text/16595.html.txt","/var/www/straped/mufon/org/16595.html"],"Tags":"City","trends":["There have been 3 other sightings in Junction City","There were no other sightings in Junction City on or around April 19th 2009"],"Disposition":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-04212009-0002","map":"<A HREF = \"http://maps.google.com/maps?q=44.22463,+-123.199428(16595)&iwloc=A&hl=en\"> mufon case (16595) map </A>","Longitude":"-123.199428","Region":"Oregon","City":"Junction City","Object Shape":"Triangle","Weather Factors":"Unknown","divs":["Sighting DetailsI was out in my usual atar observation site. I am an amature astronomer with mikitary arcraft observation training. I heard a bird in my neighbors yard, it sounded startled. I looked up in that direction expecting a flock of gees. They are nousy and you can hear them honking at a quarter mile and at even at a thousand feet you can sometimes hear them flaping their wings.I heard nothing and from the time that i noticed and paid attention I counted nine seconds.In about the third second it was directly overhead. It seemed to reflect light from the neighborhood street lights for 2 seconds. After that I was able to follow it because it blocked stars, of which I am well familiar. The object did not accelerate or change course ,east to west. As I had no direct reference to size I can only speculate that if it was at 500 feet it would have been 125 feet across I am not saying that I saw aliens , but would sure like to know ---what the hay? I am willing to talk about this and other events that I have trust in the sources,local to my sight. Call me."],"Case Number":"16595","Object Features":"Unknown","Viewing Distance":"101-500 Feet","Summary":"No lights and silent, blocking out stars and possible reflection from street lights.","Date of the Event":"04/19/2009 11:18 UTC","Source":"MUFON","Date Submitted":"04/19/2009 11:18 UTC"}