{"Date of the Event":"06/30/1991 10:00 UTC","Date Submitted":"06/30/1991 10:00 UTC","Object Flight Path":"Path with directional change","Tags":"City","Region":"Massachusetts","Object Features":"None","files":["/var/www/straped/mufon/html2text/16606.html.txt","/var/www/straped/mufon/org/16606.html"],"trends":["There have been 9 other sightings in Northampton","There were no other sightings in Northampton on or around June 30th 1991"],"Source":"MUFON","Longitude":"-72.634751","Country":"United States","Summary":"I observed a bright light in the sky hovering with no noise. Object moved in 90 degree angles to different points then vanished.","Viewing Distance":"Over One Mile","Sighting Duration":"00:01:15","Weather Factors":"None","Disposition":"Unknown","Log Number":"US-04212009-0013","City":"Northampton","divs":["Sighting DetailsDuring a clear, warm summer night in July of 1991, I was in the front yard of my residence in Northampton, MA looking towards the sky. I had my fathers \"Maglite\" during this time. I remember it was approximately 10PM. Out of nowhere from a southern direction, came a bright light, white in color, and a steady beam. It was as fast as a jet would travel, but then it just \"stopped\" in an instant. The light was still on. I could not hear anything, as I was expecting to hear the \"chop\" of rotor blades. The light continued to remain on. I shined my flash light back to the object. The object then moved in a 90 degree angle, again as fast as a jet and stopped. This happened a few times over the time of a minute or two. All of the sudden, the light was gone. I have attempted to make sense of what I saw that evening for the rest of my life. I thought it could have been a spot light like the ones at the fairs, but it was shining down, not up. There was not a cloud in the sky for any type of reflection to take place. There was no way it could have been a helicopter because of the speed and immediate stops. During the time that this encounter took place, I was almost in disbeleif that it was happening. I was attempting to make some form of logic of what was taking place but couldnt. I have told several people of this expirience during my life, but never really followed thru because of the stigmas associated with these types of things. As fast as it appeared in the sky, it just dissapeared the same way."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.33381,+-72.634751(16606)&iwloc=A&hl=en\"> mufon case (16606) map </A>","Object Shape":"Circle","Latitude":"42.33381","Case Number":"16606"}