{"Object Shape":"Unknown","Summary":"Large UFO sighted slowly moving over wooded area shining beam of light on the ground.","Viewing Distance":"Unknown","City":"Rector","Region":"Arkansas","Country":"United States","Disposition":"Unknown","divs":["Sighting DetailsStory was told to me 3rd person. Not sure if it was the 10th or 11th Local farmer and his wife were driving on a gravel road @11pm near community of Boydsville when they sighted a beam of light slowly moving through a wooded area near the road. He stopped the truck and watched as an object shining the light came into view slowly moving just above the trees. He asked his wife if she was seeing what he was seeing. She stated yes. He discribed the object as over 400 foot long with large windows about 8 foot in size. The object then traveled slowly away. At the rear were large glowing blue lights. He discribed the color of the lights as being welding arc blue and just as bright. The object moved away I believe to the west and was lost sight of near a large ditch. A friends mother in law who lives in the same area has been complaining of people looking into her windows late at night. Oddly she discribed the peeping toms as very tall and very skinny with egg shaped heads. She stated that her border collie was hiding under the bed at the time of the incident. My friend noted strange behavior of his animals also. Only thing odd that I have seen was a flash of bright blue light that appeared for only a second or so sometime the same weekend I think it was on Friday the 10th. I was on the north side of the city of Rector when I caught a glimpse of the flash. The flash seemed to be traveling from east to west and was located southwest of town. Really thought it was a shooting star before I heard of these incidents. The flash struck me as odd because it was very bright, much brighter than any shooting star that I have ever seen. I have seen alot I have worked nights for over 10 years."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.263118,+-90.292601(16612)&iwloc=A&hl=en\"> mufon case (16612) map </A>","trends":["There have been no other sightings in Rector","This sighting has never been favorited."],"Longitude":"-90.292601","Latitude":"36.263118","Date of the Event":"04/10/2009 12:00 UTC","Log Number":"US-04212009-0018","Tags":"City","files":["/var/www/straped/mufon/html2text/16612.html.txt","/var/www/straped/mufon/org/16612.html"],"Sighting Duration":"Undisclosed","Case Number":"16612","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"04/10/2009 12:00 UTC"}