{"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.27511,+-79.935877(16615)&iwloc=A&hl=en\"> mufon case (16615) map </A>","Source":"MUFON","Latitude":"37.27511","Case Number":"16615","Viewing Distance":"101-500 Feet","Date Submitted":"04/20/2009 07:48 UTC","City":"Roanoke","divs":["Sighting DetailsI decided to take some pictures of the clouds yesterday evening because of the tornado watches that where out all over the area. The clouds just had a different look and were moving fast. I took several pictures with my Cannon PowerShot A410 and in this particular picture I noticed that right before a took the shot that a bright white light showed up on the screen of my digital camera. I took the picture and moved the camera to see what made the light and there was nothing there. I looked through the screen again in the same spot and nothing. This is the second UFO sighting I have had in the last week and half. My other report is in Event ID #16554. Now I think I have finally seen a daytime UFO. The picture has a bright white light at the bottom (above the tree) when zoomed in on you can definitely see a bright white center with a black ring around it and it seems to have somewhat of a square outer layer. This picture was taken at 7:48 pm facing northeast. There is definitely alot of UFO activity going on in my area in the last year!"],"Object Features":"Unknown","Weather Factors":"Windy","Log Number":"US-04212009-0021","Tags":"City","Region":"Virginia","Sighting Duration":"Undisclosed","Longitude":"-79.935877","Country":"United States","files":["/var/www/straped/mufon/html2text/16615.html.txt","/var/www/straped/mufon/more/16615_submitter_file1__4.20.09002.jpg","/var/www/straped/mufon/org/16615.html"],"Disposition":"Unknown","trends":["There have been 24 other sightings in Roanoke","There were no other sightings in Roanoke on or around April 20th 2009","This sighting has never been favorited.",""],"Date of the Event":"04/20/2009 07:48 UTC","Summary":"Circular UFO with bright white in center with black ring around it appeared in picture.","Object Shape":"Circle, Flash, Sphere, Square, Rectagular"}