{"divs":["Sighting DetailsI was driving home from a local television station after dropping off a friend at the university (UNM) campus on Central Avenue. On the freeway to go home, I had just gotten on I-25 from the frontage road and was somewhere around the exit for Montgomery road. As i was driving I happened to look up through the windshield at what I though was a reflection in the glass from behind. However, when I looked up the light was coming from an intensely bright object in the sky, maybe (I'm estimating here) about 45 degrees up from the horizon of my car hood. The object was shaped like a tear-drop on it's side. I almost thought it was a comet at first, but then I realized it was completely solid looking. It looked like it had a tail except the \"tail\" was as solid as the rest of the object and very distinct. There was none of the hazy quality you usually see with a comet's tail, plus it was clearly all one piece, with no detached parts. Also, it was really low in the sky so I could see it very clearly. I'm thinking a comet that close to the city would be pretty much impossible. The object was about the same altitude as planes are when they are coming in to land at the airport nearby. There was a red \"aura\" for lack of a better word springing to mind, out in front of it...but only around the curve where the \"front\" of the object was based on the direction it was travelling (west to east across the sky). The object was moving really fast. It crossed an area of the sky about as wide as my windshield in probably less than a second. I got a good look at it but only briefly before it flashed a kind of bright blue and was completely gone. It did not go over a horizon or behind any buildings or cars and the Sandia mountains were still a good distance away from where it disappeared. It just flashed bright blue and was gone. There was no sound, and no trace of anything left in the sky. The night was largely clear (at least I didn't notice any clouds), with very good visibility. You could see all the constellations really well and there were not an inordinate amount of vehicles on the road, about average for a Tuesday night. I can say with certainty that this was not a reflection, a balloon or lamp, a shooting star, or anything else. It was way too solid, distinct and fast (and pretty big at that) for any of those things. It moved in a fairly straight line before disappearing. I looked around to see if anyone else noticed it, but honestly couldn't tell if anyone had. I hope someone else did because I'd like to compare notes and see what they saw. It was very intense,solid, bright and quick, but it was one of those moments where there is no doubt about the details of what I saw. I don't drink or party or anything and I got a really clear look at it. It was definitely odd looking and not something I could explain. I wish I could say I had snapped a pic, but it was gone too quick."],"Object Flight Path":"Straight-line path","Longitude":"-106.643687","Date of the Event":"04/21/2009 09:40 UTC","Summary":"Teardrop UFO flew right over the freeway.","Region":"New Mexico","Object Shape":"Teardrop","Source":"MUFON","Latitude":"35.086511","Sighting Duration":"00:00:10","Disposition":"Unknown","City":"Albuquerque","map":"<A HREF = \"http://maps.google.com/maps?q=35.086511,+-106.643687(16617)&iwloc=A&hl=en\"> mufon case (16617) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16617.html.txt","/var/www/straped/mufon/org/16617.html"],"Object Features":"Other","Tags":"City","Date Submitted":"04/21/2009 09:40 UTC","Log Number":"US-04222009-0001","Case Number":"16617","Country":"United States","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around April 21st 2009"],"Weather Factors":"Unknown"}