{"map":"<A HREF = \"http://maps.google.com/maps?q=41.845278,+-73.331389(16614)&iwloc=A&hl=en\"> mufon case (16614) map </A>","Region":"Connecticut","Viewing Distance":"Unknown","Latitude":"41.845278","Date Submitted":"03/28/2009 01:00 UTC","Case Number":"16614","Log Number":"US-04212009-0020","divs":["sighting detailson march 28th inbetween 12:30 am and 1:30 am. my wife, my brother and i, where at the cornwall cemetary. we where there to record evp and video, when we began to hear what sounded like an air craft flying over head. comming from a south easterly direction, we where standing in the west cornwal cemetary several hundred feet from the road, it was pitch black. heading in a northwesterly direction the sound of an unseen flying object was over our heads. the noise gradually increased in volume and vibration to a point where it was right on top of us, to slowly decrease in passing over head. the only thing i can relate to is a fighter jet that flew over my head during a perade several years ago. the jet was flying at low altitude and the sound was only a fraction of the sound that i had herd at cornwall. the weather was crisp,slightly above freezing and a little cloudy but we were able to see other air crafts in the air. the sorce of this sound that appeared to be right above me, was not visible. i have an actual audio recording of this event. if you wold like to analize it, let me know. my wife and brother where with me and are also eye whitness \\ ear witness to this same event."],"Object Shape":"Unknown","Longitude":"-73.331389","files":["/var/www/straped/mufon/html2text/16614.html.txt","/var/www/straped/mufon/org/16614.html"],"trends":["There have been no other sightings in Cornwall","This sighting has never been favorited."],"City":"Cornwall","Country":"United States","Weather Factors":"Does Not Apply","Date of the Event":"03/28/2009 01:00 UTC","Object Features":"Unknown","Source":"MUFON","Summary":"While in Cornwall Cemetery we heard a large, close object pass overhead but could not see it.","Object Flight Path":"Straight-line path","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"IFO"}