{"Latitude":"33.458037","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around April 21st 2009"],"Weather Factors":"None","Region":"Arizona","Date Submitted":"04/21/2009 09:20 UTC","Summary":"A gyrating object in the sky with flashing lights, caught our attention for 1hr 20min.","Source":"MUFON","divs":["Sighting DetailsI went out on the patio to sit and enjoy the cool night air. I noticed a bright light in the sky south east from where I was. It was spinning and flashing blue, white and orange red lights. Also moved in all directions, but seemed to maintain a course at the same elevation from ENE to WSW. Over the course of time watching, I noticed that when a plane came by it reacted to it and a beam of light shone from the object to the plane. Perplexed and mystified I yelled for my Mom to come look and she could instantly notice the object in the sky. She was just as dumbfounded as I was. We stared at it till it disappered. We discused it during the time we were watching it and decided that it couldn't be a plane, helicopter or any heavenly body. Over all the object seemed to move slow, but in reality it traveled half the distance of the sky in an hour & 20 min. the strangest thing about the object was the fact that it made so many erratic movements. From up and down to side to side, sometimes slow and sometimes quick. My Mom and I were both amazed and felt somewhat euphoric. Like we were seeing something that you only read about or see on TV, it was right in front of us for an hour and twenty minutes."],"Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","Country":"United States","Tags":"City","Object Shape":"Egg","Date of the Event":"04/21/2009 09:20 UTC","files":["/var/www/straped/mufon/html2text/16620.html.txt","/var/www/straped/mufon/org/16620.html"],"Case Number":"16620","map":"<A HREF = \"http://maps.google.com/maps?q=33.458037,+-112.071527(16620)&iwloc=A&hl=en\"> mufon case (16620) map </A>","Longitude":"-112.071527","City":"Phoenix","Log Number":"US-04222009-0004","Object Features":"Unknown","Sighting Duration":"Undisclosed"}