{"Date Submitted":"04/23/2009 12:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.711945,+-85.861311(16634)&iwloc=A&hl=en\"> mufon case (16634) map </A>","Disposition":"Unknown","Weather Factors":"None","Tags":"City","trends":["There have been 4 other sightings in Elizabethtown","There were no other sightings in Elizabethtown on or around April 23rd 2009"],"Object Flight Path":"Stationary","Latitude":"37.711945","Region":"Kentucky","Summary":"Bright strobe light hovering over highway 65 that changed colors.","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsThis is actually the second time I have seen this same object. The first time I saw it was at around 12:20am on the 19th m and the second time just now was at 12:45am in the same location of the sky. I first noticed the object when I was looking out of the front double windows of my apartment which has a clear view of the sky above the highway. I was making coffee at the time and just looking outside while waiting. I noticed this bright strobing light hovering in the sky in the general area of the highway and, as a curious person, stood and watched for a bit. At first the object didn't move, but then it began to move north to south back and forth a couple of times, pausing to hover ever so often, before it dissapeared out of my view. My very first thought when I saw this was helicopter, but I've never seen a helicoptor that changes colors. When I first noticed the object it was bright orange. The second color it changed to was a red. The third color it became was green. And the final color was a bright white. The object also appeared to be flashing very quickly like a strobe light. At first I thought this could be rotor blades of the craft passing in front of the light making it appear to flash, but after it changed color several times I discounted this theory. Hovering above the highway here seems a little odd to me at 12:20am to 1am. Even when there has been a bad car accident(which there hasnt) it seldomly happens. Fort Knox is only 11 miles from my location, but they do not conduct flight training there. I can't say if this has been happening more often than the two times that I happen to notice it."],"Date of the Event":"04/23/2009 12:45 UTC","files":["/var/www/straped/mufon/html2text/16634.html.txt","/var/www/straped/mufon/org/16634.html"],"Longitude":"-85.861311","Object Shape":"Star-like","Viewing Distance":"Unknown","City":"Elizabethtown","Log Number":"US-04232009-0003","Case Number":"16634"}