{"Region":"Illinois","City":"Schaumburg","Object Shape":"Oval","Longitude":"-88.080286","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"16638","files":["/var/www/straped/mufon/html2text/16638.html.txt","/var/www/straped/mufon/org/16638.html"],"Tags":"City","Log Number":"US-04232009-0007","Disposition":"Unresolved","Viewing Distance":"Unknown","Summary":"A UFO lands in my former house mother’s backyard.","map":"<A HREF = \"http://maps.google.com/maps?q=42.041451,+-88.080286(16638)&iwloc=A&hl=en\"> mufon case (16638) map </A>","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Schaumburg","There were no other sightings in Schaumburg on or around May 17th 1972"],"Date of the Event":"05/17/1972 12:00 UTC","Date Submitted":"05/17/1972 12:00 UTC","Latitude":"42.041451","Object Features":"Undisclosed","divs":["Sighting DetailsHello, I am a mentally handicap disabled person with slow learning disability. I have an old UFO story that I like to share with everyone I may not know how true this was, But this was a second hand story that was told by my former house mother, who was our care taker out at a lived in facility for the mentally disabled residents out in Palatine IL. This is a story told by my former house mother = recalled from a short memory of mine in which she told me. My former house mother was in the kitchen late one night, as she was washing dishes as usual. She just happened to look out the window, where the sink was over looking out into her backyard. She had seen this strange looking oval shape craft, as it was flying over her house. It made a strange eerie sound, as it landed out in the field of her backyard. She told me that small 3 creatures Martians like beings, came out of their spacecraft looked around in the back yard. My former house mother had called the Police to report there were strange intruders in her back yard. I don't quite remembered the whole story, but somehow the story ends as the Martians got into there spacecraft and flew away as they vanished through mid air without a trace! Note*** Please do not contact me by cell phone, due do that fact that I may get charges for making and receiving extra long distance charges, that may reflect on my cell phone bill; unless if this is an extreme absolute emergency!!!... Thank you very much."],"Country":"United States"}