{"Latitude":"32.800213","Disposition":"Unknown","Longitude":"-116.961087","Sighting Duration":"Undisclosed","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around April 21st 2009","This sighting has never been favorited.",""],"Source":"MUFON","Region":"California","Date of the Event":"04/21/2009 09:40 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16632","divs":["Sighting DetailsI live within a half a mile of a small but busy airport and when I steped out to have a smoke out of the corner of my eye I saw a shape just gliding accross the night sky. I'm used to seeing small aircraft and allmost don't notice them any more but this caught my eye becaus it was large and airborne but had no lights at all. If it would have flash even a single light I would not have even looked at it twice. The longer I stared at it the mor the shape became visiable. It was aproxametly 9 squares joined at the corners in a flying v or boomerang shape but it seemed to be only one object. I saw it for just over a minute. It made no sound. The object was lit by reflecting the city lights below off of it's surface. Each of the squares were lit and shadowed like a pyramid. At arms length it would have taken my whole fist to cover the object and judging from the angle of the shadows on it's surface it must have been nearly a quarter mile away. It was headed from west to east. Deffinatly larger than the local aircraft. It was much higher then they fly around here also. All I can offer is a quick drawing of what I saw. My wife saw it also but not for nearly as long and we have different ideas about what it could have been. I have run it accross everything I know of and I can't identify this. The object finally drifted out of sight over the building I live in."],"City":"El Cajon","Date Submitted":"04/21/2009 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.800213,+-116.961087(16632)&iwloc=A&hl=en\"> mufon case (16632) map </A>","Object Flight Path":"Straight-line path","Object Features":"Other","Object Shape":"Boomerang, Square, Rectagular","Tags":"City","files":["/var/www/straped/mufon/html2text/16632.html.txt","/var/www/straped/mufon/more/16632_submitter_file1__scan0001.jpg","/var/www/straped/mufon/org/16632.html"],"Log Number":"US-04232009-0001","Weather Factors":"None","Country":"United States","Summary":"Silent, no lights, soared across the small view of sky that I have."}