{"Object Features":"Other","Log Number":"US-04232009-0008","Tags":"City","Date of the Event":"04/24/2009 12:00 UTC","trends":["There have been 17 other sightings in Mayo","There were no other sightings in Mayo on or around April 24th 2009"],"Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/16639.html.txt","/var/www/straped/mufon/org/16639.html"],"Source":"MUFON","divs":["Sighting DetailsI had a dream of a very unusual truck with very large hood (almost like the one in Jeepers Creepers but larger) it chased me all over Florida to prevent me from leaving to visit a family member in Navada. I knew they were Aliens and I knew this was a space ceaft. It even caught my car under the Unusually large hood at one time but i managed to excape. The Aliens appeared to be MEN with longish hair,there were three of them. They wore jeans and checkered shirts. They all three sat on a binch seat in the truck with the long hood. I have noticed that small air craft seem to be moving slower than normal over my residence. from 1500 feet to 5000 feet. The larger aircraft above 20000 feet seem to be moving at their normal speed. After 7:00AM when I awoke the birds disapeared from around my house. there were crickets singing, and my canary did not even want to interact with me this morning. He is usually very verbal. The sounds from moter vehicals a quarter mile away seemed to be muted. Until about 9:30 AM. Between 1:30 AM and 3:30 AM my neighbors dogs were very aggitated. They awoke me and I felt very aggitated and could not go back to sleep for over an hour. Even my Pups seemed affected they had accidents in the house last night. I am very disturbed by this dream. I have not had such a dream sence I was about 12 or 13 years old. I feel confused, and alarmed at the thought of the Aliens stopping me from leaving Florida. Is it a warning or a threat.?????????"],"Case Number":"16639","Date Submitted":"04/24/2009 12:00 UTC","Sighting Duration":"Undisclosed","City":"Mayo","Region":"Florida","Latitude":"30.054281","Viewing Distance":"20 Feet or Less","Disposition":"Insufficient Data","Longitude":"-83.172718","Summary":"Very unusual truck chased me all over Florida to prevent me leaving Florida.","map":"<A HREF = \"http://maps.google.com/maps?q=30.054281,+-83.172718(16639)&iwloc=A&hl=en\"> mufon case (16639) map </A>","Object Shape":"Square, Rectagular, Other","Country":"United States","Object Flight Path":"Path with directional change"}