{"divs":["Sighting DetailsWorking in my shop with employees I was working at the front area around 11 am. looking out ward I notices something odd going very slow arross the blue shy. from the south west and moving northward. as I was watching this thing at first I though it was more baloons again. it was siver in color had a shadow type bottom and had a odd ovel type shape. as I keep on wathching it one of my employees ask me what was I stearring at? and as he walk up to me I pointed at it and jokenly said maybe some type of a baloon but I think it just mite be a UFO? What? my employee said out loud. by my side we watch this thing moving slow for about 1 to 2 mintes going north we estimated it was maybe over the freeway area. It was as big as a small airplain. I estimate that it was around 150' to 200' away. then the ufo stop and went strate up maybe 100'? both of us frek-- Wow. then it moved north 100'? stop and moved down back to its same hight again and keep going north---west and gainning speed. due to the other building across us the ufo slowly going out of our site at a very high speed! We where very serprized of what we just saw! after a day or two I remenber that I should draw what we saw on paper so that we wouldnt for get it...... I told the men about my mother had some photos of a real up clost UFO back in the 1968...and I would ask my dad if he had thous photos and told him this same story that we saw this past year.my mother had past away about 1.5 years ago..Dad said he will fine them and mail then to me.... In nov.08 dad mail them to me for christmas...that was very cool.. anyway I have the photos! Its the best photos yet from what I have seen on the history channel,etc. I have had some so call photo-pro's look at them. Its seems to be the real deal... Call me anytime....This may help others in the details that this photos have..there getting old and some of the color is fadding. Im a local contractor for 16 years as a black smith do under stand about details. just not that grate in wrighting. I hope this will help."],"Longitude":"-121.794343","Sighting Duration":"Undisclosed","Date Submitted":"01/22/2008 12:00 UTC","Summary":"Silver type with shaded bottom moving very odd speeds and changes.","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.686753,+-121.794343(16633)&iwloc=A&hl=en\"> mufon case (16633) map </A>","City":"Marina","Date of the Event":"01/22/2008 12:00 UTC","Object Shape":"Oval, Other","Viewing Distance":"Unknown","Object Features":"Undisclosed","Tags":"City","Case Number":"16633","trends":["There have been 5 other sightings in Marina","There were no other sightings in Marina on or around January 22nd 2008"],"Source":"MUFON","Log Number":"US-04232009-0002","Object Flight Path":"Undisclosed","Latitude":"36.686753","Weather Factors":"Light","Country":"United States","Region":"California","files":["/var/www/straped/mufon/html2text/16633.html.txt","/var/www/straped/mufon/org/16633.html"]}