{"Longitude":"-83.372566","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Athens","There were no other sightings in Athens on or around April 21st 2009"],"City":"Athens","files":["/var/www/straped/mufon/html2text/16643.html.txt","/var/www/straped/mufon/org/16643.html"],"Weather Factors":"Unknown","Region":"Georgia","Latitude":"33.958152","Disposition":"IFO","Case Number":"16643","Summary":"Plane following a red light.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.958152,+-83.372566(16643)&iwloc=A&hl=en\"> mufon case (16643) map </A>","divs":["Sighting DetailsI was walking my dog just after 10 pm outside my apartment complex. It was dark outside and a clear night. I heard a low-flying plane which got my attention, especially since it was very loud and sounded like 2 low-flying planes. I saw the plane outlined by it's lights as it passed almost direclty overhead. It wasn't until it was starting to go pass me that I noticed there was a red light some distance ahead of the plane, maybe 2 or 3 plane lengths, moving at the same speed and trajectory of the plane behind it. As the they got close to a tree line, the red light disappeared, although it may have still been there but beyond my sight. The plane and the red light seemed to be locked in place, so it might have been a light on a very long extension from the plane nose, or maybe the plane was following a second plane with only a red light (I did seem to hear two planes). I couldn't tell what type of plane it was, it was a large plane, not a personal aircraft, but it was not long enough to be a passenger jet and didn't look like a fighter jet of any sort, it was more short and squat but large. I got the impression of the plane chasing or just following the red light."],"Date Submitted":"04/21/2009 10:05 UTC","Date of the Event":"04/21/2009 10:05 UTC","Object Shape":"Flash","Object Flight Path":"Undisclosed","Log Number":"US-04232009-0011","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Viewing Distance":"Unknown"}