{"Log Number":"CA-04232009-0009","files":["/var/www/straped/mufon/html2text/16641.html.txt","/var/www/straped/mufon/org/16641.html"],"Disposition":"Unresolved","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.590456,+-77.743238(16641)&iwloc=A&hl=en\"> mufon case (16641) map </A>","Object Flight Path":"Undisclosed","Summary":"2 gray disk shape objects.","Region":"Ontario","Longitude":"-77.743238","Case Number":"16641","Weather Factors":"Unknown","trends":["There have been no other sightings in Toronto,Oshawa","This sighting has never been favorited."],"Country":"CA","Latitude":"43.590456","Object Shape":"Cone, Disc, Saturn-like","Date Submitted":"04/18/2009 10:10 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThis is my 23 and 24th sighting of objects in 3 years but \"first\" report. With intention to spot UFO.s I put out my seat cussing on the ground in my back yard with log under the head area. It's 22;00 hrs. Eyes get use to the dark a little. Motions suddenly getting stronger. Getting Irritated a little..feels like I will see something soon. Have had this feeling before another sighting. My back yard is big, quiet and dark. My head faces south but I look towards north,over my trees in the back yard. I see big dipper well and the polar star. 10:10 now and clear night. Then ,,from left I see movement. To objects come, just above treeline but high up, 8-10.000 feet or so. Cruise at double passenger jet speed. Leader cruised steady but the one left and little back was more wobbley, like trying to keep in formation,,somehow. (seen 6 in formation before and the 2 in the middle where wobbling in and out in the formation. April 08). Gray in color and the size of Smarties hold out or little smaller. I stood up,,still looking and walked right for better view, and then they were over the treeline to my right. Lasted about 6-8 sec. Felt exited,heart racing. Open the patio door and called my wife and said that I had just saw to flying Saucers fly by. Se said ,,Yea cool.. and then looked back into here laptop. Went back out,,looked around a little and went back inside. 10:15. The next night I saw a Black flying Triangle, from the same place. It came in to my view over my head from left heading north east at 11:15. Came over in front of me and swung left somehow and headed north. 7-10.000 feet. I stood up. Lost sight when it was blocked by my trees. I ran under the trees,,and relocated the craft on the other side. It kept it course north and it faded into the dark. Lasted 12 sec. Seen a Triangular object before at same place October 2006( first sighting ) That one just crawled over my house at 3.10 am. I was looking south when to my left and up,, Huge Triangle with 3 lights on each corner. The two lights, front and left back started swinging,wobbling, like watching through mirage on the road, when the craft was going a way,like heat source coming down the middle of it to make that kind of effect. 1000 feet or less. Like 3 aircraft carriers in Triangle. Like snake skin on the outside but dark."],"City":"Toronto,Oshawa","Date of the Event":"04/18/2009 10:10 UTC","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON"}