{"divs":["Sighting DetailsTuesday Night, April 21, 2009 My wife and I were standing outside of the Treasure Island Resort in Las Vegas, NV. We planned to view and record the 10pm Siren's of Treasure Island show and had been one of the first people to arrive (sometime around 9:15pm) and we moved to a position directly in front of the hotel. There is not much to do during the 45 minutes leading up to the show, so my wife began talking to people next to us and I was observing the low-flying commercial and private aircraft that were departing McCarran Int. Airport and flying almost directly overhead from east-to-west. As more people gathered, sometime between 9:45pm and 9:55pm I noticed a group of people a short distance away from us (maybe 30ft to 40ft) looking up toward the sky and pointing. My immediate thought was that they were looking at another aircraft as it flew overhead. I glanced up and could not see anything out of the ordinary...I looked twice, trying to guess the general direction based on where the people were pointing but there was nothing obvious to be seen -- no aircraft or helicopters of any kind. While I was distracted by looking for whatever the distraction was in the air, the crew for the Sirens show had raised a sheet or screen on the deck of the Sirens' ship. I asked my wife when they put that up and she said they had just raised it. I glanced at my watch and it was almost 10pm. I started my video camera and aimed it at the screen aboard the Sirens' ship while I continued to observe the people nearby looking up and pointing into the sky. Obviously, more people were looking up and pointing than before and I would guess at least 20 to 30 people were looking up at the sky instead of being ready to watch the Treasure Island show. Once again, I looked up and took a couple of moments to allow my eyes to adjust. There were no aircraft overhead, so I assumed it must be something much more faint and harder to see than a Boeing 737 at 1,200ft. That's when I saw the object. It was almost directly overhead, but I would guess that I was looking northward and upwards at an angle of at least 80 degrees. What I saw was a triangular formation of lights...an open V-shape, perhaps 3-times wider than it was tall. The leading point of the V was directed several degrees west of due north...assuming the Las Vegas strip runs directly north-and-south, I would say that the formation was pointed and moving on an approximate 340-to-345 degree heading. In the one-to-two seconds that I first observed the object, I concluded that it was not a commercial airliner, nor was it a formation of individual aircraft. It appeared to me to be a single object, flying at an altitude much greater than that of the departing aircraft from nearby McCarran. I made a comment out loud to my wife, which you can hear on the video, and I attempted to frame the object with my video camera. I had the camera lens zoomed in for preparation for the show, and was unable to obviously capture the object on video. I tried to use the nearby lighting post (one of the many theater lights used for the Treasure Island show) as a reference guide to frame the object, but either the lens was zoomed in too tightly or the camera's iris could not adjust quickly enough to the change of lighting conditions. In the background, I heard emergency sirens from somewhere nearby on the strip but I could not say if they were police, fire, or ambulance sirens since I did not turn to look behind us. I directed my attention back to the Treasure Island show as it began moments later, and was unable to continue to observe the object. The total event lasted at least 8-12minutes based on the actions of the crowd and the people who saw the object before I did. And I have no idea how long the object was in view after I stopped observing it. I am a licensed private pilot, an amateur videographer, and professional graphic artist. I have uploaded the video from the event and a Photoshop image depicting what I saw."],"Source":"MUFON","Sighting Duration":"Undisclosed","City":"Las Vegas","Date of the Event":"04/21/2009 09:52 UTC","Longitude":"-115.170516","Date Submitted":"04/21/2009 09:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.118426,+-115.170516(16646)&iwloc=A&hl=en\"> mufon case (16646) map </A>","Region":"Nevada","Latitude":"36.118426","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","Case Number":"16646","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around April 21st 2009","This sighting has never been favorited.",""],"Weather Factors":"None","Disposition":"Unknown","Object Shape":"Boomerang, Chevron, Triangle","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/16646.html.txt","/var/www/straped/mufon/org/16646.html"],"Summary":"Triangular-formation of lights fly over Las Vegas on April 21, 2009.","Log Number":"US-04232009-0014","Object Flight Path":"Straight-line path"}