{"divs":["Sighting Details4-21-09 north west of hereford, arizona, cochise county 9:11 p.m. went outside to smoke, looked east, observed 4 to 6 objects appearing to be sphere shaped. the objects were very bright-strobe light bright. most of the objects were in line about 2-300 meters apart. one object was higher and not in formation but all seemed to be signalling each other, moving and strobing from the east to the south-east. there were two other eye witnesses besides me. 5 of the 5 objects appeared to be heading east and north of naco, arizona while the 6th object that was higher and not in formation with the others disappeared. after about 12-15 minutes the objects in formation were lost to sight. all objects sighted were too distant to detect any noise. my 1st guess was that the objects were remotely operated drones, as this location is a common route for illegal immigrants. location of sighting is approx. 4-7 miles from fort huachuca, a u.s. army base. there is also an 'eye in the sky' white blimp probably used by the army base for surveillance purposes, but the 'eye' was much further west and about 5000 meters in the air and stationary. i was sober and neutral about what they are or aren't. photographic proof is best but neither the two witnesses or myself had no cameras or binoculars."],"Summary":"4-6 spheres in formation strobing with 1 sphere like signals.","Case Number":"16640","Longitude":"-110.15278","Date Submitted":"04/21/2009 09:11 UTC","trends":["There has been one other sighting in Hereford","There were no other sightings in Hereford on or around April 21st 2009"],"Log Number":"US-04232009-0008","Tags":"City","Date of the Event":"04/21/2009 09:11 UTC","Source":"MUFON","Disposition":"Unknown","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=31.37917,+-110.15278(16640)&iwloc=A&hl=en\"> mufon case (16640) map </A>","City":"Hereford","Object Flight Path":"Path with directional change","Region":"Arizona","Latitude":"31.37917","Sighting Duration":"00:12:30","files":["/var/www/straped/mufon/html2text/16640.html.txt","/var/www/straped/mufon/org/16640.html"],"Country":"United States","Object Shape":"Circle, Sphere","Object Features":"Unknown","Weather Factors":"Unknown"}