{"Object Shape":"Circle, Disc, Egg, Oval, Sphere, Other","Weather Factors":"Unknown","Source":"MUFON","Latitude":"36.124146","Object Flight Path":"Undisclosed","divs":["sighting detailsvideo that was on u-tube of an 2008 interview of \"victor\" who was interviewed by art bell in 1997 or 98 for his radio program. this interview is a follow-up of some kind done in a car in the middle of the desert and his voice is changed again. i notice something outside the car at about 6:14 to 6:24. it starts in the passanger rear window and goes around like a bird or hawk, but then when it passes again it accelerates at unbelievable speeds, i dont know if it is a well done hoax or a hell of a good photoshop, but i thought it was strange that a person from area 51 and s4 who has spoken out before and who has also smuggled out supposed video clips of an alien interogation. strange that he is alive, but would make sense that he is under constant survellince. please let me know what you think of this for i am curious to see what the analysis is. i have been interested in ets, ebes, ufo\\usos, and other life in our galaxy for as long as i remember. started when i saw something in the sky as a child of 8 or 9 and just hovered for about a minute for my mother, grandmother, grandfather, uncle and i to see, all i can remeber is being totally in a panic and sheer terror and it has followed me to this day, but has always left me wondering what it was. like a huge star that blinked at us twice and then was gone in a flash to the south and accelerated at an unbelievable rate very similar to this object. i couldnt get it to attach properly so i am going to email it to you at the webmaster email address found at the contact info on you site here. it is an email to myself and a friend so that i can save it to my computer because it has been deleted twice now from u-tube. you have my email address above so i dont have to give it here and have millions of people seeing my email address. thank you and i hope to have an explanation."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.124146,+-115.171056(16654)&iwloc=A&hl=en\"> mufon case (16654) map </A>","Country":"United States","Tags":"City","City":"Las Vegas","Case Number":"16654","Log Number":"US-04242009-0001","Region":"Nevada","Summary":"Unkown object seen on video from an interview of the \"Victor\" guy from Area 51 and S4 .","Longitude":"-115.171056","Disposition":"Insufficient Data","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around June 30th 2008"],"Date Submitted":"06/30/2008 02:00 UTC","files":["/var/www/straped/mufon/html2text/16654.html.txt","/var/www/straped/mufon/org/16654.html"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"06/30/2008 02:00 UTC","Viewing Distance":"Unknown"}