{"Object Features":"Undisclosed","City":"Newport","Disposition":"IFO","Log Number":"US-04232009-0018","Object Shape":"Triangle","Viewing Distance":"Unknown","trends":["There has been one other sighting in Newport","There were no other sightings in Newport on or around March 10th 2009"],"Longitude":"-69.2642","Tags":"City","files":["/var/www/straped/mufon/html2text/16652.html.txt","/var/www/straped/mufon/org/16652.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.840974,+-69.2642(16652)&iwloc=A&hl=en\"> mufon case (16652) map </A>","Latitude":"44.840974","Object Flight Path":"Undisclosed","Region":"Maine","Weather Factors":"Unknown","Date of the Event":"03/10/2009 08:15 UTC","Date Submitted":"03/10/2009 08:15 UTC","divs":["sighting detailseast newport maine u.f.o. video march 10th 2009. the u.f.o. video is up at this these links ----> youtube.com\\user\\maineufohunter part #1 http:\\\\www.youtube.com\\watch?v=m3ae9r2uf2e part #2 http:\\\\www.youtube.com\\watch?v=26km6yb18v8 i uploaded the video before i made the correction at the beginning, i typed users\\ when it really is user without the s. youtube.com\\user\\maineufohunter right now the video is in 2 parts at these links: part 1 ----> http:\\\\www.sendspace.com\\file\\gr3mug part 2 ---> http:\\\\www.sendspace.com\\file\\616jkw you may be able to view the videos at a larger size over youtube by downloading the sendspace files. this is a rare video, what i filmed was actually 2 u.f.o. crafts flying in the sky at the same time. make sure to fully watch part 1 and 2 because the crafts can be seen throughout. i filmed roughly 18 minutes of footage, they 2 u.f.o.s were flying around my house for about 1.5 hours. i first saw a u.f.o. on jan 27th 2009. this sighting was my second sighting on march 10th 2009 at 8:15 pm. ever since jan 27th i had my video recorder ready every night. u.f.o. #1 kept flying a strange pattern in the sky over and over until is finally vanished. it would fly all up around the sky stop at a certain point in the air, come towards my house then fly around to the front sky and it kept doing that over and over. u.f.o. #2 kept flying from the right of my yard towards the left then it would vanish through the tree line. it would appear again from the right side and it kept repeating that pattern. it is either u.f.o. #2 or a 3rd u.f.o. that flew directly over my house in part 2 of the video. i think it was u.f.o. #2. sometimes when i zoomed in on the crafts their strobe lights would force my camera to try and refocus, that's why it looks like my camera slightly zooms in and out sometimes during zoomed filming. that night was really amazing. i have seen about 5 more sightings in march 2009 and about 7 so far in april 2009 being april 4th,8th,10th,18th,20th and 20th (2 seen in same 24 hour time period). the crafts would change up their light patterns, turn instantly in the reverse direction, change speed patterns, hover, hover downwards, and they flew in patterns that i have never seen any human aircraft fly before. one one night in april a u.f.o. flew 60 feet over my house, the strobe lights from the craft lit up the fog and i could see the u.f.o. with 100% up close clarity. i could tell it wasn't any man made craft. i estimate 60 feet because i know how much 40 feet is because i have climbed many 40 feet climbing walls before, also i estimated the height of the trees next to my house as a reference also. i think this is some of the best u.f.o. footage out there right now. also there is a certain spot in hermon maine that the u.f.o. frequently hover over and even have possibly landed at. i may investigate that area in hermon over the next few days. here is my maine u.f.o. hot spot thread that i originally started --> http:\\\\boards.history.com\\topic\\ufo-hunters\\ufo-hot-spot\\520045963 fyi, none of these crafts were airplanes or helicoptors or jets. i have seen enough of those in the daytime and nighttime to be able to tell the difference between them and u.f.o.s. these u.f.o. were flying very low in the sky opposed to the normal aircrafts that fly high in the sky in a straight line to their destination. notice how these u.f.o.s flew in strange patterns and stuck around for 1.5 hours..."],"Country":"United States","Case Number":"16652","Sighting Duration":"Undisclosed","Summary":"2 UFOs filmed on video over Newport, Maine.","Source":"MUFON"}