{"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around April 22nd 2009"],"City":"St Augustine","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.897944,+-81.304418(16661)&iwloc=A&hl=en\"> mufon case (16661) map </A>","Latitude":"29.897944","Region":"Florida","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"04/22/2009 10:00 UTC","Weather Factors":"Unknown","Object Shape":"Oval","Viewing Distance":"20 Feet or Less","Summary":"Fast light appeared and disappeared two nights in a row.","Country":"United States","Log Number":"US-04242009-0008","Case Number":"16661","Date of the Event":"04/22/2009 10:00 UTC","Disposition":"Unknown","Longitude":"-81.304418","files":["/var/www/straped/mufon/html2text/16661.html.txt","/var/www/straped/mufon/org/16661.html"],"divs":["sighting detailsmy husband and i were out on our back porch (4\\22\\09) at 10pm. i saw a large white blue-ish oval shape shoot across the sky very fast. it was about the size of a penny. by the time i told my husband to turn around and look, it disappeared. it was a clear night and it appeared out of no where and then disappeared. the next night (4\\23\\09) we were on the back porch at 10pm again and we were talking about what happened the night before. then i saw the same size and color oval ball moving very fast again but on the opposite side of the sky. this time it stayed in the sky longer because i told my husband to turn around and look and he did and he saw it too. we stood up and watched it for another few seconds and then it disappeared again. again it was a clear night. my husband and i were shocked. there were other planes in the sky and this light looked nothing like anything i have ever seen. i have never seen anything fly like this appear and disappear. i am also an amateur astronomer and have been studying the sky for many years. i have seen many comets and shooting stars and this again was unlike anything i have ever witnessed."]}