{"Disposition":"Unknown","trends":["There have been no other sightings in Bowens Mill","This sighting has never been favorited."],"Region":"Georgia","Source":"MUFON","Date of the Event":"08/08/2008 05:30 UTC","files":["/var/www/straped/mufon/html2text/16668.html.txt","/var/www/straped/mufon/org/16668.html"],"Summary":"I saw a jet then a bright flash in front of the jet, when jet passed, saw 3 other flashes then S shape movement.","Tags":"City","Viewing Distance":"Over One Mile","Sighting Duration":"00:01:00","Object Flight Path":"Path with directional change","divs":["Sighting DetailsAt 5:15 a.m. I stopped for a break on top of a hill on State Road 182. About a half a mile from Bowens Mill, GA, County of Ben Hill. I was standing on the top step of my truck lookiing up into the sky, hoping to see a meteor or two. Out of the corner of my eye I noticed the lights of a jet, it was heading towards the north. I would look at the lights of the jet periodically while scanning the sky. ( It was dark and mostly clear night.) At one point while watching the jet, I saw a bright camera-like flash in front of the jet. (I'm very uncertain of the distance the jet and light was from me. I would appoximate about a mile or two.) I thought the jet had a near miss with a meteor. The jet kept going(of course, like it's gonna stop,) I saw another bright flash a little south of the first flash. I thought it also was a meteor. I kept watching and then saw, a little south of that, a light fade in and out, and then a little south of that I saw another light fade in and out at that time I felt I was seeing something unusual, that maybe these wasn't meteors. At that time a little south of the fourth light I saw a light fade in, do a S shape(like going around cones or something) and then the light faded out. It was moving in a southward direction. At that point I was surprised and very happy that I may have seen a UFO. I kept watching but I didn't see anymore like it. First, I looked at the clock to see what time it was,and it was 5:30 a.m. Then I called my wife and she acted like \"yeah whatever let me go back to sleep\". Then I called my Dad, and he just laughed. About around 6:00 a.m. I noticed alot of streaks criss-crossing the skies which I believe were meteors. I saw one small airplane flying from the east going west and it turned around and went back towards the east. And that's about it. I hope someone in the jet maybe saw the flash, being it was so close, and maybe someone else saw it from the ground. I'm hoping it can be proved by radars. That's all of my story."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.842682,+-83.20932(16668)&iwloc=A&hl=en\"> mufon case (16668) map </A>","Weather Factors":"None","Log Number":"US-04252009-0006","Object Shape":"Flash, Star-like","City":"Bowens Mill","Date Submitted":"08/08/2008 05:30 UTC","Object Features":"Unknown","Latitude":"31.842682","Country":"United States","Case Number":"16668","Longitude":"-83.20932"}