{"Log Number":"US-04252009-0002","Sighting Duration":"00:03:00","Tags":"City","divs":["Sighting DetailsIt was around 10:35 on thursday night of April 23, 2009. I along with 6 of my friends were hanging out at their house on Lyons street in Clifton Cincinnati. My friends Jeff, Brad, Dave, and Andy, were outside on the second floor balcony, which has a view or a small part of Indiana and a large part of Northern Kentucky, as well as parts of cincinnati (Its one of the highest points in the area, Very close to the University of Cincinnati) Well i was sitting in my friend Bobs room with him (his room connects to the balcony basically) I was looking for a song to listen to on his computer when i heard Jeff and Brad both SCREAMING my name. I came running out onto the balcony and they are yelling (It's the UFO! they have reported to me seeing this same object earlier in the year but i was NOT apart of witnessing that.) Now I'v stood on this balcony thousands of times, and there are numerous planes that fly overhead heading north towards either Dayton Airport or somewhere else, and they're are numerous hospitals in the area so seeing helicopters is a normal occurrence. What I proceeded to see was a fire orange color sphere ball (the color of a candle flame) and it was flying relatively slowly. Standing on the balcony, attempting to judge its distance, it had to have been directly over the Ohio River, It wasn't very high in the sky either, it was almost eye level with us on the balcony just a few miles away. It was moving to our right, so from the Northern kentucky, downtown Cincinnati area headed towards eastern Indiana. As it flew it never really increased speed nor did it climb vertically or change its course what so ever. As it began to get more towards Indiana we began to loose sight of the object, of course it was by this time we had finally got the digital camera out but it was too late, the object was to far off. I remember feeling extremely excited but at the same time disappointed because it was such a short experience. But on another note on talking to other friends from the area, this sighting is nothing new the kid who named it \"the flying pumpkin\" saw it multiple times in this area, another friend of mine said he saw the same object in the sky recently as well. i hope this helps and ill keep my eyes open. thanks for running such an awesome services, thanks to you."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.111968,+-84.5042(16664)&iwloc=A&hl=en\"> mufon case (16664) map </A>","Latitude":"39.111968","files":["/var/www/straped/mufon/html2text/16664.html.txt","/var/www/straped/mufon/org/16664.html"],"Summary":"It was a beautiful orange sphere that pulsated sporadically, \"Flying pumpkin\" as dubbed by a friend.","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Case Number":"16664","City":"Cincinnati","Object Features":"Undisclosed","Source":"MUFON","Region":"Ohio","Country":"United States","Date Submitted":"04/23/2009 10:35 UTC","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around April 23rd 2009"],"Viewing Distance":"Over One Mile","Date of the Event":"04/23/2009 10:35 UTC","Weather Factors":"Unknown","Object Shape":"Flash, Oval, Sphere, Other","Longitude":"-84.5042"}