{"files":["/var/www/straped/mufon/html2text/16660.html.txt","/var/www/straped/mufon/org/16660.html"],"Log Number":"US-04242009-0007","Object Features":"Unknown","trends":["There has been one other sighting in Williston","There were no other sightings in Williston on or around April 24th 2009"],"Latitude":"44.445278","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Date Submitted":"04/24/2009 01:12 UTC","Source":"MUFON","Sighting Duration":"00:03:00","Case Number":"16660","divs":["Sighting DetailsMy friend and I were heading home from Colchester to Barre after a night at the drive in. We were on Interstate 89 heading south just past Exit 14 when I first noticed two bright lights in the sky. I've sat on the tarmack at O'Hare airport enough to know what planes look like when they're \"stacked up\" waiting to land at night and have their \"landing lights\" on. That's what I thought I was seeing. After driving a few miles I could see a plane that was flying very low, coming in for a landing. This was on the left side of the Interstate near the Williston exit. Looking to the right I then saw what I again thought were planes in line to land...but now there were three of the bright lights. The two on the left were closer together than the one that was farthest to the right. As we drove a bit further down the road either trees or hills blocked the view of that part of the sky. I commented to my friend that it seemed very odd that Burlington airport would have 3 planes waiting to land...ever, let alone at that time of night. He said he thought the lights were too close together to have been planes. A mile or two down the road, the Interstate curves to the right as it goes down a hill...about 2 miles before the Richmond exit. I figured that we would have a good view of the \"same\" sky when we got there and then we'd have another chance to look at the lights. However, we never saw the lights again. The night sky was very dark, no moon...and no clouds. I believe that, if the lights had been planes, we would have seen them again as they came in to land. But we never saw or heard a plane landing (after the one we saw landing as we drove past the Williston exit.) The lights appeared to be a almost an orange color, but a very yellow-white orange. Size-wise, the lights appeared bigger than any star or planet I've ever seen in the sky. I can't say that I saw the lights moving at all, except for seeing 3 lights after earlier having seen 2. The more I replay it in my mind the more I am reminded of how the planes looked at O'Hare airport at night while they are in line waiting to land. (They also don't appear to move when still far away in the sky because they are, in essence, heading directly at you.) It was the strangest thing I've seen in the sky in a long, long time."],"Date of the Event":"04/24/2009 01:12 UTC","Summary":"Looked like 3 planes lined up waiting to land. (Was 12:12 AM, site won't accept that time when entered).","Region":"Vermont","Object Shape":"Sphere","Weather Factors":"Unknown","Disposition":"IFO","City":"Williston","map":"<A HREF = \"http://maps.google.com/maps?q=44.445278,+-73.099167(16660)&iwloc=A&hl=en\"> mufon case (16660) map </A>","Longitude":"-73.099167","Object Flight Path":"Stationary,Unknown","Country":"United States","Tags":"City"}