{"Date Submitted":"04/22/2009 12:00 UTC","Longitude":"-114.285878","Region":"Arizona","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.152106,+-114.285878(16679)&iwloc=A&hl=en\"> mufon case (16679) map </A>","Weather Factors":"Unknown","Object Features":"None","Latitude":"34.152106","trends":["There have been 14 other sightings in Parker","There were no other sightings in Parker on or around April 22nd 2009"],"Case Number":"16679","Tags":"City","divs":["Sighting DetailsWe have been seeing them for months now and the other day my wife was telling her friend about them and was over heard by a lady and she said your not the only one that is seeing them. They are being seen as far as Lake Havasu City. And to be careful. The come out 3 lights at a time they stay for a few second and disapear 10 to 15min. later they come out again one night we were watching them and my wife says did you see that the one on the left jumped over to the middle in a matter of seconds. Our son and his girlfriend saw 12 in a row he dicribed them as playing leep frog and started disapearing one be one. We were watching your program and thought we would report it because when we called the police they say there flares and they are not flares. We mentioned it to our neighbor and he said yea my sister lives up river and they have been seeing strange lights up there to. We live in a small town so in the evenings we sit out in our back yard and watch the sky for satalites thats when we first noticed them its been around 4 months now. They are not out there every night more like maybe somtimes twice a week. where we live there are no street lights so the stars are nice and bright. they are alway to the southeast of Parker town what we call P mountain."],"Object Shape":"Circle","City":"Parker","Country":"United States","Viewing Distance":"Over One Mile","Source":"MUFON","Log Number":"US-04262009-0006","files":["/var/www/straped/mufon/html2text/16679.html.txt","/var/www/straped/mufon/org/16679.html"],"Sighting Duration":"Undisclosed","Summary":"Lights from 3 to 4 at a time they come out and dissapear look like headlights.","Date of the Event":"04/22/2009 12:00 UTC","Disposition":"Unknown"}