{"City":"Morden","Weather Factors":"Unknown","Date Submitted":"10/10/1958 12:00 UTC","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Morden","This sighting has never been favorited."],"Country":"United Kingdom","Date of the Event":"10/10/1958 12:00 UTC","Tags":"City","Source":"MUFON","divs":["Sighting Details1: I was walking home from the movies with my girlfriend, and as we approached the gate to her backyard, I happen to look up at the starts because it was such a clear night, when I noticed that one of them moved slightly to the right? I asked her if she could see the same thing, and she replied yes. As we kept watching the star flew off to the right at a high speed, and this is facing north. Then slowly one of the other two that were left move west then circled around the one star that was very still. Suddenly the first star came back at a slower speed. The two moving stars made a complete circle around the lone stationary star, then all of a sudden all three flew at a tremendous speed in three different directions. We stared for a while, but they never came back. I realized they were not stars, but I have an open mind I was exited to see that happen. We went inside and told her parents about it, but I don't think they believed us at all? 2: In 1961, my best friend an I went to the Isle of White off of the south coast of England. One night after a couple of drinks at the local pub near Ryde we were walking back to our hotel around 12 midnight, and the stars were very very clear. This would have been in August, exact date unknown. The thing as above happened, but with two stars that were circling each other, and suddenly took off in different direction. This happened within a period of about five minutes. After we happened we just walked home and discussed the sighting between us. The next day we heard on the radio that seven hundred people had reported the same thing, but the British Airforce said it was weather balloons! 3: Sometime in the early 80's I was staying with my parent in Rye England, After about ten thirty all the street lights go out and it gets very dark. It was a clear night, and from my parents house you can see all across the fields to the sea which is about four miles away. Also north is Dungerness Nuclear Power Station. At approximately 11.30 p.m. I took my dads binoculars out in the garden to look at the stars. All of a suddenly moving from east to west close to the nuclear power station I saw a green ball of light that changed from green to red and back. It moved very slowly, and it seemed to be about a thousand feet in the air about two miles away. I ran inside and said to my parents that I would like them to look through the glasses and tell what they see? Of course they were astonished, but then my dad told me that one night he had forgot to shut the hose off which was watering the grass. He said as he turned the water off a very bright green light shone up the whole garden, so bright that it was like day, but green. He said it went very slowly moving N.W. and suddenly shot up into the black sky like a rocket, but no sound. My father was not the type of person to make up stories either, so I believed him."],"Object Features":"Unknown","Object Shape":"Star-like","Longitude":"-0.19446","Case Number":"16676","Log Number":"GB-04262009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=51.394943,+-0.19446(16676)&iwloc=A&hl=en\"> mufon case (16676) map </A>","Region":"England","files":["/var/www/straped/mufon/html2text/16676.html.txt","/var/www/straped/mufon/org/16676.html"],"Latitude":"51.394943","Disposition":"Unresolved","Summary":"Three stars moving!"}