{"Case Number":"16674","Country":"Philippines","Disposition":"Unresolved","City":"Manila","Latitude":"14.599512","Log Number":"PH-04262009-0001","Weather Factors":"Unknown","divs":["Sighting DetailsMy sighting happened in December 23, 1993. I was staying in Sampaloc, Manila, Philippines. I was going up the stairway to 2nd floor of our house. Upon reaching the window Around 11:00 pm I moved to the window to catch a breath and look-up the sky. This I normally do everytime. What I saw is unforgettable in my life. I saw two bright orange glowing object(twinkling) in the sky of the same size which looks unsual than any bright object.They are in diagonal position. The object on the right side is higher than the left one. Suddenly, they met at the middle(face to face).I was trembling then and shouted to my wife who's at the other room to come to me but she's resting already. after a few seconds they separated and went back to original position. Then after a few seconds both object move simultaneously.The object on the right move straight line going to left, while the left object move straight going to the right direction. Both object disappeared very fast.They move like in Z formation and dissapear.Up to now I am having goose bump when I recall the incident. I told my freinds and family but nobody paid much attention. Truly, I believed it's a UFO. To date, no aircraft can do such maneouver and formation with lighting speed. I can't imagine any aircraft can be built like that unless it's made by so much advance intelligence and technology. It's unbelievable but I saw it in my own naked eyes."],"Source":"MUFON","Longitude":"120.98422","Date of the Event":"12/23/1993 11:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=14.599512,+120.98422(16674)&iwloc=A&hl=en\"> mufon case (16674) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16674.html.txt","/var/www/straped/mufon/org/16674.html"],"Object Flight Path":"Other","Region":"Metro Manila","Object Shape":"Circle, Star-like","Date Submitted":"12/23/1993 11:10 UTC","Object Features":"Unknown","Tags":"City","Summary":"Unbelievable but I saw it happened truly with my naked eyes.","trends":["There have been 18 other sightings in Manila","There were no other sightings in Manila on or around December 23rd 1993","This sighting has never been favorited.",""]}