{"Country":"United States","Date of the Event":"04/25/2009 09:15 UTC","files":["/var/www/straped/mufon/html2text/16677.html.txt","/var/www/straped/mufon/org/16677.html"],"Longitude":"-112.183887","Viewing Distance":"Unknown","Latitude":"33.540862","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.540862,+-112.183887(16677)&iwloc=A&hl=en\"> mufon case (16677) map </A>","Case Number":"16677","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around April 25th 2009"],"divs":["sighting details4\\25\\09 about 9:15 pm i was in my back yard faceing west. i live at 59th ave and deer valley in glendale az. it was a very windy night and lots of cloud coverage. i was looking thru binoculars , watching planes and stars when they could be seen thru the clouds. i was on my childs swing set , sitting on the top of the slide. i noticed a large cloud to the northwest that looked lighter than the others in the sky. in the cloud i saw what i thought were three faint stars in the shape of a triangle. it looked like they were moving with the cloud. i set the binoculars on the top of the swing set , as not to have any shaking. i know the wind and atmosphere will cause stars to look like they are moving and such.. to my surprise the lights were moving and i had to keep turning to follow it. the northeast sky had far less clouds and you could easily see the big dipper. this cloud or fog moved directly under the big dipper and then out of my view due to a mountian. the three lights were very faint and did not blink. i could not see them without the binoculars, you could see the cloud. i kept telling myself i was seeing things, but i can honestly say that something was traveling within that cloud.. undeniable it took about seven minuets from the time i first spotted it untill i lost sight of it. no noise was heard."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Windy, Medium","Date Submitted":"04/25/2009 09:15 UTC","Object Features":"Unknown","Log Number":"US-04262009-0004","City":"Glendale","Tags":"City","Source":"MUFON","Object Shape":"Triangle","Region":"Arizona","Summary":"Large v shape flying w/in a cloud or mist Northwest to Northeast."}