{"Summary":"U-shape changing with 5 lights moving into it then away from it.","map":"<A HREF = \"http://maps.google.com/maps?q=40.720553,+-73.996503(16684)&iwloc=A&hl=en\"> mufon case (16684) map </A>","Source":"MUFON","Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/16684.html.txt","/var/www/straped/mufon/org/16684.html"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Flash, Star-like, Other, Unknown","Object Features":"Undisclosed","Region":"New York","Longitude":"-73.996503","divs":["sighting detailsi was at a truck yard installing surveillance cameras for sercurity. i looked up and saw a star moving back and forth. after staring at it for a few seconds, i noticed a few other stars near it moving the same way. it was only around 4pm so it was still very sunny with little cloud cover. after watching these lights move back and forth i saw a grey \\ silver colored \"u\" shape with orange\\reddish lights at the tips of the u shape. i don't know if it was fire or lights coming out the tips but it would light up and then disappear. the u shape would sort of change shape. as if the u shape was split right down the middle and was sort of twisting into a straight line. while this u shape was changing shape and flashing red\\orange lights the white lights or star looking lights would move towards it, then stop completely and go back in the opposite direction. there may have been more than 5 lights, i don't remember exactly the number but at least 5. i thought maybe it was a satelite but i have seen plenty of satelites before and they never changed shape or had lights moving into and away from them. they usually dont have flames or lights flashing out of them either. i was with a few other people and just so i knew i wasn't just seeing something that wasnt there, i pointed it out to them and after a few minutes of trying to show them where to look they definitely saw the same thing. this wasn't something that appeared and disappeared,, it was up there above new york city, and it wasn't going anywhere. i wish i would have had a telescope to see a little further. i had a camera on my cellphone but theres no way it would have picked this up during the middle of the day,, it was way to bright and the object was way to far away. i am going to purchase a telescope and go back to the yard and see if it's still there. if i do see it i will try to send a picture. i looked everywhere on line and there is no such satelite or experimental craft that even remotely look like this. it is possible that it's some secret satelite, but as of now i have not been able to identify it. i see strange lights all the time, but never have any equipment to view it or take pictures."],"trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around June 15th 2006"],"Latitude":"40.720553","Case Number":"16684","City":"New York","Disposition":"Unknown","Date of the Event":"06/15/2006 04:00 UTC","Date Submitted":"06/15/2006 04:00 UTC","Log Number":"US-04262009-0011"}