{"Sighting Duration":"Undisclosed","City":"Kokomo","Source":"MUFON","Date Submitted":"04/26/2009 04:37 UTC","Object Shape":"Disc, Triangle","Log Number":"US-04262009-0012","files":["/var/www/straped/mufon/html2text/16685.html.txt","/var/www/straped/mufon/org/16685.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.495097,+-86.124853(16685)&iwloc=A&hl=en\"> mufon case (16685) map </A>","divs":["sighting detailsin 1973\\74 my mom,my cousin and i were out looking for houses to rent in the country. we were somewhat close to grissom air force base and thought we saw a strange light that did not look like a plane. i don't know why but we followed the direction it took. we thought it was gone and we pulled overon this country road to talk about what we saw,it was summer and warmand probably about 10:00 pm. as we were sitting there this huge disc came floating by,it must have been the size of a football field or bigger and it was very close to us and very close to the ground.it did not make any noise and it was going very slow and then it just disappeared.we vowed to never tell anyone and i never did untill i told my ex-husband in 1989. two or three years ago my two small children and i were taking the dog for a walk around the block before we went to bed. it was a warm summer or early fall night about 10:00 or 11:00 pm and just as we rounded the corner to come home something made me look up and there was a large triangle shape in the sky only you could really only see that there were three lights in a triangle form and you could hardly see the body of the object. i asked my little girl if she saw it and she did and she was scared.we did not bring this to the attention of my little boy who was laging behind us with the dog.just like the first sighting in 73\\74 this one to seemed close enough to reach out and touch and it too never made a sound. it floated over us and then it was gone. i have told no one about this untill now"],"Viewing Distance":"Unknown","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around"],"Weather Factors":"Unknown","Disposition":"Insufficient Data","Case Number":"16685","Country":"United States","Summary":"The first sighting was in 1973 or 74. It was a huge disc shape with windows all around it. The second sighting was in 2005 or 06. It was a triangle shape. It was right above our neighborhood.","Region":"Indiana","Object Features":"Undisclosed","Date of the Event":"Unknown","Tags":"City","Longitude":"-86.124853","Latitude":"40.495097","Object Flight Path":"Undisclosed"}