{"Date of the Event":"05/10/1976 04:45 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Features":"Other","Disposition":"Unknown","Source":"MUFON","Tags":"City","Case Number":"16686","trends":["There have been 14 other sightings in Fairfax","There were no other sightings in Fairfax on or around May 10th 1976","This sighting has never been favorited.",""],"Summary":"A white rocket shaped object moved through the sky silently with a wake trail.","Country":"United States","files":["/var/www/straped/mufon/html2text/16686.html.txt","/var/www/straped/mufon/org/16686.html"],"divs":["Sighting DetailsApproximately 4:45 in the morning my brother and I were walking southbound on Dequincey Drive in the Kings Park West subdivision in Fairfax Virginia to the drop point for our Washington Post newspaper routes at the corner of Dequincey Drive and Commonwealth Blvd. As we were about 100 yards from the end of the street we noticed an object in the sky about SSW from our position maybe 20 degrees above the horizon, moving upward and to our left at about a 60 to 70 degree angle. It was white, roughly rocket shaped with a pointed nose cone, a main body and what looked like tail fins at the back end. The nose cone was about as long as the main body of the object was wide, the total length was about 5 times the width of the main body and the tail fins extended out about half of the width of the body and the length top to bottom was about 1.5 times the width of the body. The object was absolutely pure white from top to bottom as if it was lit up by very bright spot lights or some internal light source. It was completely silent as it moved through the sky, had no lights visible on it and no fire out the tail end typical of rocket powered objects. It also left a visible wake trail across the sky as it moved through the air. The whole time it was visible it appeared to move at a constant speed but decreased in apparent size as it moved away from us. At some point we just couldn't see it any more so we stopped watching the object and went ahead and delivered our newspapers. We first noticed the object because it was so bright in the night sky, the apparent size was so big and the fact that it was silent and left a trail. The width appeared to be about one fourth or fifth the width of the house that it was above when we first saw it. We had never heard of a rocket or missile that could fly silently like that so we thought it was some sort of UFO since we couldn't identify exactly what it was. We thought the wake trail looked pretty cool behind it but we never worried about what it was since it was flying away from us. It was definitely a curiosity and to date we have never been able to come up with an explanation for what it was. We never heard any reports on the radio or TV about it and it never appeared in the newspaper so we are not sure who else may have seen the object. The date could be off by a year or more since I only know it was during the time I delivered newspapers, and the time could have been plus or minus a half hour since we didn't always start our routes at the same time every day. In my 27+ years working on aircraft including 20 years in the Air Force I have never seen an object that looked quite like what I saw that morning. Another time within about 2 years from this observation I was driving alongside a field in a developing fog when an area off to my left, in a pasture, was inexplicably illuminated. Let me know if you would like information about this other unusual event also."],"Region":"Virginia","Log Number":"US-04262009-0013","Latitude":"38.847714","Object Shape":"Bullet, Missile","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","City":"Fairfax","Date Submitted":"05/10/1976 04:45 UTC","Longitude":"-77.300693","map":"<A HREF = \"http://maps.google.com/maps?q=38.847714,+-77.300693(16686)&iwloc=A&hl=en\"> mufon case (16686) map </A>"}