{"Date Submitted":"12/20/1960 07:10 UTC","Viewing Distance":"Unknown","Region":"New Jersey","Source":"MUFON","Tags":"City","City":"Linwood","Country":"United States","Object Flight Path":"Unknown","Case Number":"16687","Object Shape":"Cone","Latitude":"39.339838","trends":["There have been no other sightings in Linwood","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/16687.html.txt","/var/www/straped/mufon/org/16687.html"],"Date of the Event":"12/20/1960 07:10 UTC","Log Number":"US-04262009-0014","Summary":"Ice skating on pond, object appeared w/o sound or motion, many witnesses, loss of time.","Longitude":"-74.575156","map":"<A HREF = \"http://maps.google.com/maps?q=39.339838,+-74.575156(16687)&iwloc=A&hl=en\"> mufon case (16687) map </A>","divs":["Sighting DetailsApproximately between years of 1959 and 1961, at the age of 10 or 11, I was ice skating on Off's Pond in Linwood New Jersey. There were many people there. There were bonfires on the shore line. Suddenly without sound or motion a well lit cream colored vehicle appeared aboce our heads in the cove area of the pond. It was silent, it was low. It projected a red schematic of sorts in the air in front of it for several minutes. It was a flowing pattern. It seems as though when I look at this in my memory, everyone was somewhat still and mesmerized. The Police arrived. I can see the officer standing in his car, one foot on the ground, looking at the object. The object had what would be windows, but you couln't see in or out of. It disapeared the same way it came, without warning. I really don't know how much time transpired. I remember running home and telling my mother. She reacted rather passively. Much to my amazement, no one ever really spoke of it. I don't think they really remember. It came back to me in a later age when I was doing some memory recall exvercises. My husband is always excited about my story but I never wanted to talk about it, not unlike you just had on TV from 2008 where the guy's family started falling apart because they didn't believe him. I felt sorry for him. I know what it's like to doubt yourself. I think \"why me\". Why haven't these visiters shown themseles to the world. I must say, when you see snapshots and videos of UFOs on TV, I always say \"are they kidding me\" I had a full view of a craft no higher than a telephone pole over my head and no one had a camera! Oh well, I finally spoke of it and that's it. I know it would be hard to find out any information about it now. I know the policman (whose name I know) is no longer with us. Some things are more easily remembered than others. I remember my coat, but not my exact age. Thank you, Marilyn"],"Object Features":"Window(s)","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"None"}