{"City":"Undisclosed","Date Submitted":"03/05/2009 06:30 UTC","Object Features":"Dome, Patterned Surface","Disposition":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting DetailsOn March 5, 2009 at approx. 6:45 am est. on the way down the side walk going to the vehicle, a bright object captured our attention. The object was moving erratically in the sky and was slightly larger than the planet Venus just after dark or just before dawn. It was about 25 to 30 degrees in the morning sky about 6 to 10 miles away and we were facing south. The digital camera we used was hand held and not on a bipod as we were not expecting to capture anything that morning. The weather was clear, no cloud cover, no rain, perfect and cool. The object, as stated earlier, moved erratically for a short time then stopped and hovered for about 5 minutes. The photo numbered 705 is the picture of the object just hovering. Once stopped we could tell that it was shaped circular like a doughnut with lights of every color around the outside of the craft with a solid center. After hovering for 5 minutes or so the object took off moving north relatively fast making no sound what so ever. My son and I saw the object and even though we have been looking for it every morning since we have not seen the object again. I do realize that alot of people try to hoax the public and are out for their 15 minutes of fame. This is not the case as we want no media what so ever. Just simply an answer for what we have seen in the sky over our home would suffice. We understand that may not be possible but just knowing somewhere someone has seen something similar would help. We are not nut cases claiming abduction and honestly we have reservations about the people who do. My son is a 12 yr old 7th grader and i am a building sub-contractor."],"files":["/var/www/straped/mufon/html2text/16680.html.txt","/var/www/straped/mufon/more/16680_submitter_file1__IMAG0703.JPG","/var/www/straped/mufon/more/16680_submitter_file2__IMAG0704.JPG","/var/www/straped/mufon/org/16680.html"],"Source":"MUFON","Longitude":"-79.01241","Tags":"City","Case Number":"16680","Latitude":"35.765823","Viewing Distance":"Over One Mile","Country":"United States","Object Shape":"Other","trends":[""],"Region":"North Carolina","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=35.765823,+-79.01241(16680)&iwloc=A&hl=en\"> mufon case (16680) map </A>","Log Number":"US-04262009-0007","Summary":"Walking out of the home towards the truck, looked up into the sky and saw a light moving unlike anything I've ever seen.","Date of the Event":"03/05/2009 06:30 UTC"}