{"Object Flight Path":"Straight-line path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=38.447917,+-122.706601(16683)&iwloc=A&hl=en\"> mufon case (16683) map </A>","Region":"California","divs":["Sighting DetailsThree friends taking a hot tub in barn late one night on 10 acre ranch a mile from town of Tomales one person ran to our cafe to get drinks came back fast honking horn yelling UFO out back we were all nude put on my boots came out and just behind the Hot Tub barn 100 feet over head under cloudy skies that gave sky a grayish look was a dark circular object 100 125 feet across moving too slow to be an air craft giving off a humming electronic noise other than that no sound I was able to run under the craft and almost keep up to it running waving my hands yelling hey stop and give me a ride! my friends thought me crazy and reminded me I was naked ! I said I didn't care they always take your close off for the examination any way, as it got further away 1000 yards towards the U.S coast Guard Station which was a few miles down the road and all of the sudden took off in a split second up up and away in the outer atmosphere and disappeared. I was in Navy during Viet Nam war submarines been in every flying craft from gliders Cessnas jets para sails helicopters you name if it flies I been in it, this was none of the above. Reason; Too slow too quiet too fast moving to be ours. And would I have gotten in had it landed YES I would have push the little grays out of the way to push my way in to see the inside of that craft if that's who was driving it. The person who spotted it first said as he was returning from town with drinks said the craft came in over the ocean which was about 4 miles away came up hwy 1 towards the town of Tomales took a right turn towards Petaluma and Santa Rosa area"],"Longitude":"-122.706601","files":["/var/www/straped/mufon/html2text/16683.html.txt","/var/www/straped/mufon/more/16683_submitter_file1__pic.jpg","/var/www/straped/mufon/org/16683.html"],"Tags":"City","Date of the Event":"08/19/1989 09:14 UTC","Log Number":"US-04262009-0010","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Latitude":"38.447917","Case Number":"16683","Summary":"slow moving 100 feet diameter dark no lights intermitten spot towards ground","Source":"MUFON","Object Shape":"Circle","Date Submitted":"08/19/1989 09:14 UTC","Disposition":"Hoax","City":"Santa Rosa","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around August 19th 1989","This sighting has never been favorited.",""],"Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed"}