{"Date Submitted":"04/21/2009 10:00 UTC","Date of the Event":"04/21/2009 10:00 UTC","City":"Elk City","Sighting Duration":"00:02:00","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Case Number":"16698","divs":["Sighting DetailsI was driving westbound on I-40 east of Elk City at about 10:00 PM. Out of the left window I noticed a slow-moving object coming toward the car from the south. It seemed unusual because of it's sort-of-triangular shape, the unconventional lights, and it's perception of slowness. I rolled down the window for a better view. After a few seconds it made a sharp right turn displaying a line of lights in the direction of flight and secondary lines of lights to the sides, forming a sort of triangle with lights longitudinally fore and aft. It was traveling apparently slowly for it's size, but because it was dark it was hard to tell how big it was or how far away. I could hear no noise from it, but there was engine and wind noise from my car so I can't say it was 'noiseless'. It traveled eastbound for less than a minute and then made an abrupt turn toward the south and then disappeared. Upon reaching home the next day I did some research. There is a small, old airport with a very long runway at Burns Flat, Oklahoma. That would have been about 6 or 7 miles south of where I saw the object. Further research shows that airport to be the home of Rocketship Global, a company that is developing a 'space tourist' craft. Depictions of the \"Rocketship XP\" online show it to be roughly the size and shape of a bizjet. What I believe I witnessed was a night-time test flight of the Rocketship XP, with the plane landing at Burns Flat. It must have lights along the belly and wings as described above. I'm guessing that night-time flights of this puppy are going to spur a number of reports of triangular lighted object sightings."],"Object Flight Path":"Path with directional change","Log Number":"US-04272009-0007","trends":["There have been 2 other sightings in Elk City","There were no other sightings in Elk City on or around April 21st 2009"],"Summary":"Triangular object, lights in rows in arrow configuration.","Disposition":"Unknown","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.416294,+-99.397789(16698)&iwloc=A&hl=en\"> mufon case (16698) map </A>","Latitude":"35.416294","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16698.html.txt","/var/www/straped/mufon/org/16698.html"],"Object Features":"Appendage(s)","Object Shape":"Triangle","Country":"United States","Longitude":"-99.397789"}