{"Longitude":"144.793731","files":["/var/www/straped/mufon/html2text/16692.html.txt","/var/www/straped/mufon/org/16692.html"],"Viewing Distance":"20 Feet or Less","Case Number":"16692","trends":["There have been no other sightings in Guam","This sighting has never been favorited."],"Date of the Event":"11/30/1972 12:00 UTC","Summary":"Round light, the size of a football field; tall creature and another creature look like just a sheet of light.","Disposition":"Unresolved","Date Submitted":"11/30/1972 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=13.444304,+144.793731(16692)&iwloc=A&hl=en\"> mufon case (16692) map </A>","City":"Guam","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Log Number":"GU-04272009-0001","Object Shape":"Circle","Country":"Guam","Region":"","Tags":"City","Object Flight Path":"Stationary","Latitude":"13.444304","divs":["Sighting DetailsI wanted to ask about something I have been trying to make sense of. I was living on Guam, I was about 15.5 years old. I was sleeping at my sister's house because I used to babysit for her. I was born and lived on Guam and in those days on the island the windows usually does not have screen over it, windows are just open with curtains to cover it. I guess because the wind comes through and cools the house off. This particular home, it was high enough off the ground that my 4 and 5 year old nephews that lives there can run under the house without hitting their heads. So at night I feel secure enough that I never felt afraid of anyone coming in the windows since it was too high off the ground. But on this one night, I was awaken by the rustling or something brushing against the wall of the house right under the window in the bedroom I was sleeping in by myself. Since the house was made of wood, the rustling was loud and was noisy so I woke up and when I looked towards the window I saw a figure with one leg in and was trying to bring the other in and then I gasped real loud that it popped its head in and seems shocked or startle when it looked my way. It finally was able to bring its whole body in and stood on the floor. My light in my room was on so I was able to see it. It was very long and skinny and had like a long oval head. It was so tall it had to hunch over. It came towards me, I was frozen and even though I wanted to move, I could not move even my fingers. I think I was either frozen in fear or just felt paralyzed. It had long fingers and it was wearing something like green. being from the islands I could not then compare it to anything I ever saw in my life. It head came so close to me I could feel its breath, it looked at me and moved its head like a preying mantis. IT was looking at me in the eyes and then looked me up and down to towards my toes. It did that several times. I was there but I was so confused inside my head because what my eyes were seeing could not make my brain make sense of what this creature was. I knew it was not human, but it had legs, arms, hands, wierd fingers, and extremely tall. It looked like it was wearing green? and the hands were so white and pale it looked transparent. I really would like to know how to make sense of this thing. All these years and I try to ignore what I witnessed and it keeps coming back in my head and I cringe when I remember how close it came. For a few years after this incident I would not want to talk to anyone about it or explain to anyone what I saw. I felt foolish and my family made me feel I was crazy and then I get embarrassed to ever bring it up again. But after I saw your show tonight I realize that I aI should not be embarrassed any more. After a few years I did see a UFO and it was this huge light the size of a football field. It was so close to the ground I could see the blades of the grass it was hovering over. I try not to say anything because i did not want to get teased. After I had seen this huge light, I had another run in with some kind of creature, on the islands it was normal to have outside showers and I heard wierd noises from the chickens on the trees, and when I came out of the shower, I looked to the left and there was this light, it looked like someone took a sheet that was made out of light and threw it over a figure, it was not standing off the ground, it was about a foot off the ground. I did not remember anything after that. I could not even remember how long or where I went or if I went to bed that night. this happened at night about 8:30 or 9:00PM when I would take my showers on the weeknights. I hope you are able to at least tell me something about what I saw."]}