{"Date of the Event":"04/27/2009 12:10 UTC","Case Number":"16696","map":"<A HREF = \"http://maps.google.com/maps?q=30.088694,+-94.125416(16696)&iwloc=A&hl=en\"> mufon case (16696) map </A>","trends":["There have been 12 other sightings in Beaumont","There were no other sightings in Beaumont on or around April 27th 2009"],"Object Features":"Patterned Surface","Sighting Duration":"Undisclosed","Longitude":"-94.125416","Object Shape":"Triangle","Source":"MUFON","Tags":"City","Date Submitted":"04/27/2009 12:10 UTC","divs":["Sighting DetailsJust moved into a new home in beaumont texas and decided to do some late night swimming after unpacking all day. The wife and kid were sleeping and i was just floating in the pool. The wind was blowing very bad and i looked up at the neighbors palm tree when I noticed an orange light. I wanted to run inside and get my camera but things were still in boxes and I would never have found it. I got out of the pull and climbed on the roof. The triangular craft was hovering with 6 blinking greenish lights. The lights seemed to be going in some sort of sequence. After watching the craft for a few minutes it moved very quickly to the northeast and hovered some more. it was incredible! i would have sat there all night watching it. I hopped off the roof and grabbed my flashlight and climbed back up. I dont know what I was thinking, I just wanted to make some desperate attempt of communication, so I started flashing and waving my light. haha. I estimated the craft to hover for about 10 minutes before it vanished. I didn't move or anything, it just shined a little brighter then it was gone. This was truly amazing. I have always believed, but this just strengthens my belief."],"Weather Factors":"Unknown","Summary":"Late night swimming and saw orange and greenish lights!!","Disposition":"Unknown","Country":"United States","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/16696.html.txt","/var/www/straped/mufon/org/16696.html"],"Region":"Texas","Log Number":"US-04272009-0005","Viewing Distance":"Unknown","City":"Beaumont","Latitude":"30.088694"}