{"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-96.633123","files":["/var/www/straped/mufon/html2text/16694.html.txt","/var/www/straped/mufon/org/16694.html"],"City":"Garland","Object Flight Path":"Straight-line path","Object Shape":"Sphere, Triangle","Disposition":"Unknown","Object Features":"None","Case Number":"16694","Source":"MUFON","trends":["There have been 19 other sightings in Garland","There were no other sightings in Garland on or around April 22nd 2009"],"Date of the Event":"04/22/2009 10:30 UTC","Latitude":"32.914654","Region":"Texas","Weather Factors":"Unknown","Tags":"City","Date Submitted":"04/22/2009 10:30 UTC","Summary":"2 triangular \"vehicles\" in formation.","map":"<A HREF = \"http://maps.google.com/maps?q=32.914654,+-96.633123(16694)&iwloc=A&hl=en\"> mufon case (16694) map </A>","divs":["Sighting DetailsApproximately 10:30 AM Wed.22 Apr. 2009 I work at an automotive repair shop in a N.E. Dallas suburb and I was examining a vehicle outside the shop on the N. side of the building. There is a constant inbound and outbound flow of light,commercial and military aircraft, including vintage aircraft, due to our proximity to DFW, Love Field,Addison airport and Dallas Naval Air Station as well as other municipal airports. I am also a Private Pilot. When this event occured, the prevailing wind was from the south, about 20mph, the temperature was approximately 58 degrees F., and there was about 20% cloud obscuration primarily to the north and northwest from my location. At this time, I heard the roar of a turbojet engine from the south of my location, but my sight line was blocked by the shop building. In a matter of several seconds I saw a military fighter climbing to the north at a high rate of speed,and the pilot may have been using afterburner thrust as it was much louder than the usual jet noises.The jet crossed over at an estimated altitude of 8000 feet. I've seen many training scenarios, mainly radio intercept operations like this all around this area, and I assumed this was simply another one. I then looked to the east, and saw another aircraft heading westbound as if on an intercept course with the jet from the south. I then noticed a third jet to the north on a southern course.The aircraft from the east and north were both generating exhaust contrails as they were higher and in colder air. After I'd noticed the jet to the north, I saw other motion to the left, or west, of my field of vision. I saw what at first appeared to be 2 jet aircraft in \"wingman\" formation, but as I focused my attention on them it became apparent they were not aircraft,at least not aircraft in the conventional sense.Both appeared to be 6 to 8 times larger than the military jets, but from the distance I was observing all this, I can't be certain. Both were triangular shaped, but all 3 ends were spheres joined by what looked to be black tube or beam structures that formed the triangle shape. The spheres were silver irridescent,and at first appeared to translucent, until I realized they were reflecting the blue of the sky and sunlight. Both maintained an east direction of flight at approximately 100 knots air speed at a right angle to the prevailing wind.It did'nt make any change in attitude, direction or altitude, or any unusaul manuvers. My immediate thought was that this was all a prank or hoax, and I reasoned that someone had built these \"machines\" from balloons and pvc tubing, but balloons would tend to fly with the wind, not across or into it. I went inside the shop to obtain a pair of binoculars from our front office in an attempt to get a better look. I was back outside the shop in less than 20 seconds, but both \"machines\" had simply vanished and the 3 jets had all turned 180 degrees relative to their flightpaths and were all converging on the location where I'd last seen the \"machines\". I've related what I've experienced to 1 family member and 1 very close friend today, and now to MUFON.I don't have any fear or dread of what I witnessed, and I don't have any worry of being ridiculed. I consider myself detail oriented and analytical both in my profession and hobbies. I try to maintain an open mind to any and all possibilities."],"Log Number":"US-04272009-0003","Country":"United States","Sighting Duration":"Undisclosed"}