{"Longitude":"-75.661182","Latitude":"44.076608","City":"Watertown","Log Number":"US-04282009-0004","Date Submitted":"04/25/2009 02:30 UTC","Date of the Event":"04/25/2009 02:30 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"2 objects 30 miles in 5 sec 2nd object alternately turned invisible alternately.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","divs":["Sighting DetailsI had just laided down on my hammock and noticed what at first was an incredibly high flying bird but instantly I realized that it was an object moving dead north at about 10 thousand feet, easy to verify as it was just below very high ceiling clouds I started to tract it then and I started to count off seconds it was visible moving at such a high rate of speed that it could not be any plane. I estimated how far I could see it before it disappeared and am sure that it went out of view by the \"horizon\" about where Watertown NY is which is about 30 miles north of my camp. It never change elevation speed or course and was out of sight in about 5 seconds. About 5-10 minutes later I settled back down when I noticed another similar object moving at exactly the same elevation and course and I accuraately started timing this one and it took 4.3 seconds plus or minus before exitng my view HOWEVER this one changed about 15 times alternating equally spaced from visible to invisible, the objects were clearly below the clouds as it continued on a dead north course. The second object kept disappearing throughout its travels. At first I was simply amazed at how fast and lazerlike the trajectory was but the second one made feel very uneasy watching a hard black object disapear and reappear over and over again."],"Case Number":"16707","map":"<A HREF = \"http://maps.google.com/maps?q=44.076608,+-75.661182(16707)&iwloc=A&hl=en\"> mufon case (16707) map </A>","Disposition":"Unknown","Object Shape":"Circle, Cylinder, Disc","files":["/var/www/straped/mufon/html2text/16707.html.txt","/var/www/straped/mufon/org/16707.html"],"Sighting Duration":"00:00:05","Tags":"City","trends":["There have been 4 other sightings in Watertown","There were no other sightings in Watertown on or around April 25th 2009"],"Object Features":"Patterned Surface","Source":"MUFON","Region":"New York"}