{"Weather Factors":"Unknown","Case Number":"16710","Date of the Event":"04/20/1989 12:00 UTC","Longitude":"-94.411997","Latitude":"39.098396","Summary":"Classic BBD. Same as well known photos from '90s Belgium. One light on each corner and the circle light in the middle.","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around April 20th 1989"],"Date Submitted":"04/20/1989 12:00 UTC","Object Features":"Unknown","Log Number":"US-04282009-0007","Object Flight Path":"Straight-line path","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.098396,+-94.411997(16710)&iwloc=A&hl=en\"> mufon case (16710) map </A>","Region":"Missouri","files":["/var/www/straped/mufon/html2text/16710.html.txt","/var/www/straped/mufon/org/16710.html"],"City":"Independence","Disposition":"Unknown","Tags":"City","divs":["sighting detailsi do not recall the exact address but the location is 39.091666, -94.438345. it was about 9:30pm and i had stepped out onto the porch of our third floor apartment. i looked to the south and saw a very unusual aircraft going east. it passed just below a full moon. although i was 14 at the time i had a very deep interest in aircraft and new this was not normal as it did not have the standard faa lighting. once the craft was out of view i went inside and told my mother what i had seen. she shortly left for work. about 20 minutes later i return to the porch. after standing there for a few minutes i look up to see three of the same aircraft flying in diamond formation. i was in awe. the aircrafts were at roughly 10-15,000 ft. now i was used to seeing airliners coming into kci\\ (mci) all the time. these craft were flying above the normal approach altitude but below the normal transcontinental altitude. the only thing was even at their altitude they appeared at least three times larger than a conventional airliner at the approach altitude. they were massive. they moved slowly, taking at least two minutes to leave my field of vision that was fairly confined as i was in an apartment complex. the other thing that i noted is that at no time did i ever hear engines of any kind. one detail that i wish to mention is the circle in the middle of these triangles. when i saw the first one at a profile, this circle appeared to be more of a dome on the bottom of the craft. then later looking up at them this dome had white light but also appeared to have swirling colors within that white light. at this point i went back inside. i then placed a phone call to the control tower at kci\\ (mci). i asked the man who answered if there had been any aircraft fly formation over the kansas city area anytime in the last 48 hours. he said that he didn't know the answer but if i could hold he knew who would. after being on hold for about five minutes he returned and informed me that indeed there had been no aircraft flying formation in the area in the last 48 hours. i then told him that we had a problem because i just saw three large aircraft less than 15 minutes ago in formation. i explained what i had seen. he then asked if i would like to report a ufo. i said that i did. he said that i would need to hold as he put in a conference call to the, \"united states ufo reporting agency\". after being on hold for about five minutes the man from kci introduced another guy that was on one of the worst phone connections i have ever heard. it was distorted, scratchy, a lot of line noise. i gave the man a detailed account of what i saw. he took my name and number and said that they would be in touch. i never heard back from anyone."],"Viewing Distance":"Over One Mile","Object Shape":"Triangle","Source":"MUFON"}