{"Date of the Event":"04/28/2009 09:05 UTC","Object Shape":"Triangle","Tags":"City","Longitude":"-111.218622","Sighting Duration":"Undisclosed","Latitude":"32.442821","map":"<A HREF = \"http://maps.google.com/maps?q=32.442821,+-111.218622(16726)&iwloc=A&hl=en\"> mufon case (16726) map </A>","Date Submitted":"04/28/2009 09:05 UTC","trends":["There have been 3 other sightings in Marana","There were no other sightings in Marana on or around April 28th 2009"],"divs":["Sighting Details On April 28, 2009 at 9:05 p.m., I went outside into my backyard to let my dog out when I immediately noticed in the sky three bright white strobe lights in the shape of a triangle. These lights were in a northwesterly direction, approximately one mile away and at a height about level with the moon and just west of the moon. The three strobe lights flashed in sync with one another about every second. In the space between the lights or object was about the size of a football field. These lights appeared to be hovering in the air in a perfect triangular shape with absolutely no sound. The sky was clear and calm. I did not see any stars in between the lights as if the lights were attached to a solid object. After watching this for about two minutes, I ran over and banged on my bedroom slider to alert my wife, where she then came outside to join me. As she was coming out, the three lights moved very slowly toward the northwest, changing shape into a straight line, then into a stretched backwards letter \"C\" shape and added four or five more strobe lights. The strobes changed as well, with three strobes in sync with one another, then two with another two or three at the far end of the line of lights or object where it had curved into the backward C shape. I then ran into the house to get my binoculars. When I came back out (which took about 15 seconds), I looked at the lights through my binoculars to see when the strobe lit, it illuminated a dark colored object behind the lights. My wife and I then watched this move off toward the northwest. The whole experience lasted about five to seven minutes. To make this even more interesting to me, was the fact that this object or objects were flying in the flight pattern toward the Tucson Airport and at the time, I saw no airplanes flying south in the flight pattern until the end of my siting, a plane was flying south but east of the normal flight pattern. I believe this plane may have seen the object or it was diverted."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/16726.html.txt","/var/www/straped/mufon/org/16726.html"],"Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16726","Log Number":"US-04292009-0007","Summary":"Triangle shape object whith strobe lights that changed shape.","Region":"Arizona","Country":"United States","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Weather Factors":"None","City":"Marana"}