{"Case Number":"16721","Summary":"3 amber lights above Estrella Mountain.","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 28th 2009"],"Viewing Distance":"Over One Mile","Source":"MUFON","Country":"United States","divs":["Sighting DetailsWhile in Glendale Arizona I was looking south toward Estrella mountain {south west of Phoenix- directly west of south mountain} right above the horizon I saw 3 amber lights that didn't move. I had seen them before I went into the store, but didn't pay that much attention, thinking they were two planes together, because it was at a distance to where I was I only glanced that way and noticed it but went into the store as I was in a hurry and on the phone at the same time. When I came out of the store around 5 minutes later, the 3 amber lights were still there, hovering, not moving since I had gone in the store, in the same exact spot and they looked like they were twinkling. there were 3 distinctive lights. What I noticed was it seem way too large to be a plane on approach to SKY HARBOR {my son and I watch planes on approach all the time} when I was watching it intensely a plane was coming from the west and dwarfed in size to these three lights. If I had to estimate the size I would say 3-4 Jet plane size wise at least. Way to big to be a regular craft. Plus they were AMBER in color, not like any normal craft lights. It was not a helicopter as it was too far to be that big. And they run with white, green and red lights. As I was watching these 3 lights I called my son on the phone to try and see it, but he was in an area that the tree lines near our house blocked the view but because I was at the field at 51st and Olive I could see clearly the area it was hovering at. I stood there for 3-4 minutes watching then I couldn't believe my eyes as the lights started to twinkle brighter then dim then the center light went out first, then the one on the right, then the one on the left. It was not a plane or helicopter, nor was it a craft I have seen at any airshow I have been to in the last 30 years. The lights were in a line next to each other but what was weird is that it was parallel, or slightly above the nearby south mountain lights but not too far above the horizon. about .5 - 10 degrees above the ground but more over the estrella mountains side of the southland. It was not like flares I have seen in the past, it was not like blimps or balloons we see here often in Arizona, it was 3 Amber lights close together but separate."],"files":["/var/www/straped/mufon/html2text/16721.html.txt","/var/www/straped/mufon/org/16721.html"],"Date Submitted":"04/28/2009 09:50 UTC","Disposition":"Unknown","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","City":"Phoenix","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.489826,+-112.226479(16721)&iwloc=A&hl=en\"> mufon case (16721) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-04292009-0002","Date of the Event":"04/28/2009 09:50 UTC","Tags":"City","Object Shape":"Other, Unknown","Longitude":"-112.226479","Latitude":"33.489826"}