{"Object Features":"Unknown","Date of the Event":"04/28/2009 12:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around April 28th 2009"],"Date Submitted":"04/28/2009 12:00 UTC","Summary":"Lights seen 'spawning' more lights.","files":["/var/www/straped/mufon/html2text/16720.html.txt","/var/www/straped/mufon/org/16720.html"],"divs":["Sighting DetailsWent out on my porch this evening about a hour ago and saw a bright, amber colored light in the southwest sky, low above the horizon at about 25 to 30 degrees. The light was stationary. Earlier in the evening I was driving on my way home and saw a pair of lights that looked similar but further away as if on a distant mountain. But these lights I viewed from my porch were bright and would then dim, sometimes releasing new lights that would go dark. I then got into my truck and began to drive south towards the Ak-chin Indian comunity that was a few miles down the road which would provide me a better view. Driving south I saw about a mile behind the Ak-chin casino the lights were then on the ground (landed) with flashing orange strobe lights as if from emergency vehicles spaced about a hundred yards apart in a line parallel to the road I was on. I proceeded to make a u-turn and see the lights on the ground once I had passed the casino and lost my line of sight. On the northbound portion of my car ride I agains saw the yellow emergency lights within close proximity to the bright amber lights on the ground. I decided to head home after not finding any viable way to drive any closer."],"Tags":"City","Weather Factors":"Unknown","City":"Phoenix","Region":"Arizona","Log Number":"US-04292009-0001","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"33.449757","Longitude":"-112.064647","Disposition":"Unknown","Case Number":"16720","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Oval, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.449757,+-112.064647(16720)&iwloc=A&hl=en\"> mufon case (16720) map </A>"}