{"Case Number":"16724","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around April 2nd 2009"],"Object Shape":"Triangle","City":"Miami","Date Submitted":"04/02/2009 02:30 UTC","Weather Factors":"Unknown","Country":"United States","divs":["Sighting DetailsMy wife and I were visting friends at thier house. While my friends played xbox inside the house, my wife wanted to smoke a cigarette outside, i agreed to accompany her. We went outside to the back of the house to the porch. We stood outside for a few seconds looking at the moon. the moon seemed very bright. while i looked at the moon my wife spotted something spectacular behind me. She was in awe and told me to look behind me. I turned to look and to my amazement I saw and Big Black Triangle (Delta). I first taught it was a B-2 Stealth Bomber. Being that I am ex-military and was in The UNITED STATES AIR FORCE and have a secret clearence. The B-2 bomber is the closes thing I could think of but is way off. It emerged from a cloud that had happen to slow down making the object come out of the cloud completely and I could cleary distinguish the shape of the object to be a massive triangle slowy coasting at a very low altitude over our heads. It was at least a hundred yards long, like a football field. It had 8-12 white lights underneath it shaped in a V. It was very silent. I couldn't believe that such a massive object could be flying over our heads at such a low altitude without falling out of the sky in dead silence.As I looked at it, I needed my friends to see it, I ran into the house to tell my friends to come out side immediately. As i came out I could see it going into another cloud directly infront of it's on-going course over our heads.It flew from South to North right over our heads.By the time my friends came out it had gone into the clouds. I was ecstatic that I was very lucky to have seen such an amazing object. I first taught it was military. But as soon as my reasoning started to think otherwise(non-human) that is when i started to get chills all over, that such an object can be flying over so close without any detection is very scary, I was in the military and i've never seen that before. I am sorry to say i have no pics of the event. Just to witness being that of me and my wife. Big Black Triangle 8-12 lights forming a V-shape Low Altitude flying,Silent,"],"Sighting Duration":"00:00:20","Disposition":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=25.795469,+-80.217399(16724)&iwloc=A&hl=en\"> mufon case (16724) map </A>","Latitude":"25.795469","Region":"Florida","Summary":"Big black delta fly over Miami .....it was in the clouds.","Log Number":"US-04292009-0005","Date of the Event":"04/02/2009 02:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/16724.html.txt","/var/www/straped/mufon/org/16724.html"],"Source":"MUFON","Longitude":"-80.217399","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile"}