{"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.561438,+-89.897323(16725)&iwloc=A&hl=en\"> mufon case (16725) map </A>","Object Features":"Unknown","Summary":"Saw lights in sw sky about 0545 end of Sept begining of Oct in 2008 thought it was the tower at Scott AFB.","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"38.561438","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Source":"MUFON","Country":"United States","City":"Shiloh","Region":"Illinois","files":["/var/www/straped/mufon/html2text/16725.html.txt","/var/www/straped/mufon/org/16725.html"],"divs":["sighting detailsi was heading toward st louis on i-64 this fall, just got on at the lebanon\\mascoutah entrance mm23, when i noticed what appeared to be a \"bank\" of windows in the southwest portion of the sky, i thought it was the tower for scottafb, but then noticed the same kind of lights over greenmount rd.mm16. i put it off to headlights reflecting off the big green road sign, and thought nothing of it for awhile. as i got into school in ladue mo., i thought wait a minute!! those lights couldn't have been the tower because they were bright yellowish white like you see in windows at night at a house or building. all in a row in a long rectangle like a bank of windows. airtraffic control towers dont use that kind of lighting, its usually red or green so as not to mess with night vision. i lost sight of the lights as i drove down i64. i grew up in o'fallon, my dad was a ret. af major and pilot, and i was in the usn and worked on a-4 skyhawks in gitmo. so i know it was not an airplane. i talked to my sister about it when i got home ( i live with her) and we talked about the wierd \"ufo\" she and her husband saw back in the 60's, and just put it off to wierd lights until i watched the travel channel and saw the highland, lebanon,..sighting in \"ufo's over illinois.\" they showed the graphics, and when they described the lights and then showed the back of the \"craft\" i thought that's exactly what the lights i saw looked like. now i don't know what it was that i saw, but there are no buildings that tall in that area, and airtraffic control towers don't move, so i must assume i saw an unidentified aircraft of some sort. i just feel that something should be said\\reported, and i regret not doing so sooner."],"Date Submitted":"10/03/2004 05:45 UTC","Object Shape":"Unknown","trends":["There have been no other sightings in Shiloh","This sighting has never been favorited."],"Longitude":"-89.897323","Date of the Event":"10/03/2004 05:45 UTC","Case Number":"16725","Disposition":"Unresolved","Log Number":"US-04292009-0006"}