{"Summary":"2 nights in a row, a craft hovers over rincon mountains for hours!!!","Source":"MUFON","Country":"United States","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"02:14:15","Longitude":"-110.917139","Object Features":"Undisclosed","Date of the Event":"04/28/2009 05:07 UTC","City":"Tucson","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=32.230903,+-110.917139(16731)&iwloc=A&hl=en\"> mufon case (16731) map </A>","Case Number":"16731","Log Number":"US-04292009-0012","files":["/var/www/straped/mufon/html2text/16731.html.txt","/var/www/straped/mufon/org/16731.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around April 28th 2009"],"Latitude":"32.230903","divs":["Sighting DetailsI FIRST NOTICED WHAT LOOKED TO BE LIKE A STAR AT 5AM IN TUCSON AZ , BUT I QUICKLY REALIZED IF IT WAS A STAR, IT WAS HUGE, REALLY LOW AND IT WAS THE ONLY ONE. TOTALLY FREAKED, I WAS STILL ABLE TO GET MY BINOCULARS AND SNAPPED A PICTURE FROM MY PHONE. IT LITERALLY STAYED THEIR FOR ALMOST 2 HOURS EVEN WHEN IT WAS BRIGHT AS DAY!! THAT ALL HAPPENED ON THE 28TH AT ABOUT 5 AM. THEN AGAIN, ON THE 29TH AT ABOUT 3AM, I GO OUTSIDE TO HAVE A CIGARETTE AND I SEE THE SAME DAMN THING! THIS TIME I WAS FREAKED, I WENT AND GOT MY BROTHER UP, AND WHILE HE THOUGHT ABOUT IT FOR APPROXIMATELY 2 MINUTES, HE TRIED CONVINCING HIMSELF THAT IT WAS A \"SATELLITE.\" THEN HE STARTED LAUGHING AND ASKED IF I WAS ABLE TO GO BACK TO SLEEP NOW THAT I SAW THIS. SO WE GOT THE BINOCULARS ONE MORE TIME AND CONFIRMED THAT SATELLITES DON'T REMAIN IN THE SAME SPOT WITHIN THE ATMOSPHERE FOR OVER 30 MINUTES. I'M GONNA GO OUT ON A LIMB AND SAY IT WAS AT LEAST 2 OBJECTS. INTERESTINGLY, TUCSON INTERNATIONAL AIRPORT AND DAVIS MONTHAN AIRFORCE BASE ARE WITHIN A 10 TO 12 MILE RADIUS FROM OUR ADDRESS, AND I'M WONDERING IF A SITUATION LIKE THAT OF WHAT HAPPENED IN THE 60'S AT EDWARDS IN CA - WHAT THE HELL WOULD THEY DO? LISTEN BROTHERS AND SISTERS, IT MAY HAVE BEEN SOMETHING MAN-MADE. I WILL SAY THIS THOUGH, ITS BEEN CONSISTENTLY THERE FOR HOURS AT A TIME, IN THE SAME SPOT, AND ITS IN THE SAME SPOT - EXACT SAME SPOT BY MEASURING IT AGAINST THE TELEPHONE WIRES THAT MARK THE SKY ALL OVER THIS NEIGHBORHOOD."],"Disposition":"Unknown","Date Submitted":"04/28/2009 05:07 UTC"}