{"trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around April 29th 2009"],"Log Number":"US-04292009-0015","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/16735.html.txt","/var/www/straped/mufon/org/16735.html"],"Source":"MUFON","Case Number":"16735","Latitude":"30.335614","map":"<A HREF = \"http://maps.google.com/maps?q=30.335614,+-81.654461(16735)&iwloc=A&hl=en\"> mufon case (16735) map </A>","Date of the Event":"04/29/2009 09:03 UTC","City":"Jacksonville","Tags":"City","Region":"Florida","Summary":"A dim light flew over then got very bright then dimmed again then disappeared.","Date Submitted":"04/29/2009 09:03 UTC","divs":["Sighting DetailsI went outside @ 9:03 pm April 29 2009 to take a phone call when I glanced upward and seen an interesting light.It was dim and white.I noticed no flashing lights of any kind,just one solid dim light.I continued to observe when after a couple minutes it grew really bright for approximately 15 seconds,then once again dimmed.I then looked away to check the time it was 9:06 pm.I looked back up afraid once I looked away and would disappear,but,it was still going.It was moving from the northwest to the southeast direction slowly.Another reason it caught my eye,I live in a fly zone with lots of air traffic.So I can distinguish a plane or helicopter.When the event ended it got to a cloudbank and as if someone shut out the lights and disappeared.This was also interesting because it never entered the clouds.It disappeared before it got to the clouds.Like a light switch.Very odd behavior for a plane or helicopter.It was definitely something different.Well as for this story it isn't my only sighting in this area.I have seen dozens around here.Many being this same type.It always gives me goosebumps like wow! Well thats my story.Feel free to contact me on this matter.I believe and want answers as well from the Government. Yours Sincerely,Douglas Walker"],"Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Longitude":"-81.654461","Weather Factors":"None","Object Shape":"Star-like","Object Flight Path":"Straight-line path","Disposition":"Unknown"}