{"trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around April 16th 2008","This sighting has never been favorited.",""],"Longitude":"-121.885596","divs":["Sighting DetailsI am avid photographer and sky watcher who loves to take pictures of airplanes and nature. In California I always noticed the different types of military and commercial planes flying. So as a normal evening i was going out to grill dinner and i glanced in the sky and i saw it. I told my wife , who also witnessed the sighting. This is the third time i have saw sphere objects through out my life. All in different states. Twice in Colorado and one In California. I notices and imediatley new it was unusual. I ruled out the possibilities of it being a balloon because of the altitude....It seemed to be above normal air traffic for the region. The object eventually moved up and diagnol before i lost sight of it behind the trees... before that it was very still ,,stationary. i was excited that i saw it and was able to document the event...because it has happend before and everybody gets a chuckle when i talk about it ..but to me it is no joke it is real.. These are pictures of the object and a picture of an air plane you decide...i do have alot more pictures if interested ...some better than others.."],"Sighting Duration":"Undisclosed","Date Submitted":"04/16/2008 12:00 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/16737.html.txt","/var/www/straped/mufon/more/16737_submitter_file1__DSC01753.JPG","/var/www/straped/mufon/more/16737_submitter_file2__DSC01748.JPG","/var/www/straped/mufon/more/16737_submitter_file3__DSC01755.JPG","/var/www/straped/mufon/org/16737.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.340656,+-121.885596(16737)&iwloc=A&hl=en\"> mufon case (16737) map </A>","Date of the Event":"04/16/2008 12:00 UTC","Viewing Distance":"Unknown","Tags":"City","Region":"California","Object Shape":"Sphere","City":"San Jose","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Country":"United States","Latitude":"37.340656","Case Number":"16737","Summary":"Circular, floating.","Log Number":"US-04292009-0017","Source":"MUFON"}