{"City":"Oregon City","Object Shape":"Triangle, Other","Date of the Event":"04/04/2009 08:00 UTC","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=45.364173,+-122.598988(16743)&iwloc=A&hl=en\"> mufon case (16743) map </A>","Longitude":"-122.598988","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Region":"Oregon","trends":["There have been 7 other sightings in Oregon City","There were no other sightings in Oregon City on or around April 4th 2009"],"Sighting Duration":"Undisclosed","Case Number":"16743","Object Features":"Wings","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/16743.html.txt","/var/www/straped/mufon/org/16743.html"],"Country":"United States","Summary":"Flying V.","Date Submitted":"04/04/2009 08:00 UTC","Latitude":"45.364173","divs":["sighting detailsthe object was dark in color,had 3 red pulsating,not flashing lights at the bottom.one at the end of each wing and one in the center of the main front part.no sound at all. my son,his friend and i were heading to south end road market\\gas station when we saw a red blur fly over our yukon,the sun roof was open so we saw it good.i got on the gas and rounded a bend in the road and observed it up ahead over a big steel power line carrier and a field. i stoped my truck and got out to see if it was a conventianal craft,i.e engine noise etc..but there was nothing.just 3 red lights that stoped pulsating as it sat there. my sons friend had a cell phone so i told him to get the camera on and give it to me,he did but as i pointed the phone toward the object shaped as a giant v the phone went black.i hollerd and cursed because i thought he had handed it to me off,but he said he turned the camera on himself..so..i got back in my truck and just as i did that it turned 180 deg. and zoomed off the direction it came,and kinda shuffled to the left. all 3 of us saw this thing.it was about 150 feet or so across and hooverd about 500-700 feet of the ground.so we saw it pretty good. no way man made that thing with the technology we have now! i reported it to the local clown house a.k.a police dept. and they said it was probably someones private craft!!how funny!!!"],"Tags":"City","Log Number":"US-04302009-0005"}