{"Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","Region":"New Mexico","Case Number":"16747","Date Submitted":"07/20/2002 09:15 UTC","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.276128,+-107.75549(16747)&iwloc=A&hl=en\"> mufon case (16747) map </A>","Weather Factors":"None, Does Not Apply","Log Number":"US-04302009-0009","Longitude":"-107.75549","Tags":"City","Object Shape":"Blimp, Egg, Flash","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around July 20th 2002"],"Country":"United States","Latitude":"32.276128","divs":["Sighting Details I had been star gazing for perhaps thirty minutes as I did frequently at that time. I lived alone about midway between Deming, NM and the border with Mexico. This is fairly remote desert land about 18 miles out of Deming. The sky above the desert was very clear giving me excellent visibility. I saw this object on four seperate occasions over a period of about three months. Three of the sightings were of short duration, one was possibly three minutes. As I was getting ready to enter my dwelling, a bright white light directly overhead caught my attention. My reflexes are very fast and I was able to look up quickly enough to catch it in mid-pulse. It appeared as a pulsating, egg-shaped light. There were no external lights or strobes, it appeared to be much like a rigid eggshell with a bright light shining within. It pulsated light on about a one or two second interval. Between pulses it disappeared, reappearing a considerable distance from the previous pulsation. On this occasion it looked to be at least ten miles high and perhaps much further. I have no doubt that it was intelligent directed, it was obviously not any sort of natural object. My first thought was \"Man, this is weird!\". I had never seen anything like it before and knew immediately that it was an UFO. Whatever height it actually was, it appeared to be the same approximate length as the large passenger airliners that I saw frequently going to and from Albuquerque. It was about half as wide as it was long, the taper from mid-point appeared identical both front and back. It pulsated twice in a straight line and then pulsated once at 45 degrees from the line with an identical distance between pulsations and then disappeared. The entire occurance lasted maybe five seconds. Two other seperate sightings within the same three month period were only a single pulsation. The last time I saw it, it was low to the ground near the Tres Hermanas mountains, which were about ten miles away. At first it moved very slowly and a bit erratically. At that distance, it may have been 300' long. As it shifted gradually toward me, it slowly dimmed from a bright white to pale yellow on thru orange and red to a dusky reddish brown reminescient of a lunar eclipse. It finally blinked out while moving slowly to the west parallel to me and disappeared. When I asked nieghbors about it, some said they had seen a similiar object before but didn't know what it was. During and after sightings I experienced an uncomfortable, somewhat elated awe. At about the same time period I observed two cold meteorites (non-glowing), one traveling horizontally at about one hundred and fifty miles per hour so close I thought I heard a swishing sound. I was living in a remote area of the desert, the closest nieghbors being about a mile away. I have spent many years studying the UFO phenomenen and even wrote a short book on the subject (The Truth, If You Dare). I have had three other encounters since about 1969. After abundant research in the UFO and many relevent fields, I firmly believe that I understand what they are and why they are here, tho' I doubt that everyone would agree with me. I tried many times to shoot holes in my theories but was unable to do so, in fact, my theories began to speak to and answer questions relating to other remarkable phenomenen. I employed converging lines of evidence to reach my conclusions. I am very bright, testing in the top one percent nationally and am not a crank of any sort. Thank you for allowing me to give this testimony."],"Date of the Event":"07/20/2002 09:15 UTC","Object Features":"None","City":"Deming","Summary":"Huge, internally lit, pulsating ,egg-shaped craft able to move both slowly and very fast as well as hovering","files":["/var/www/straped/mufon/html2text/16747.html.txt","/var/www/straped/mufon/org/16747.html"],"Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed"}