{"files":["/var/www/straped/mufon/html2text/1674.html.txt","/var/www/straped/mufon/org/1674.html"],"City":"East Lansing","divs":["Sighting DetailsWitness replies to Form 1 questions:She states she was driving home when she noticed some bright lights, which atfirst looked like an airplane flying too low. She watched to see if it was introuble or going to crash. She slowed down (10-15 mph) and was trying to figureout why an airplane would be in that particular place, flying so low and movingso slow. Using a lamppost for a guide she decided it was not moving at all soher next thought was that it was some sort of light tower. She states that sheknew that it could not be a tower in that particular place and then she thoughtUFO. She stated that cars were driving by quickly and she wondered why theywere not slowing down to see what this object was. As she got right next to it,she pulled into the parking lot of an abandoned gas station so she could lookright up at it. She opened up her car door to ascertain if there was any noiseand all she could hear was the noise from the road. When she opened up her doorit made a sharp turn to the west. She followed it with her eyes for a fewblocks and the lost sight of it. She then drove on a road going west but neversaw it again. The clock in her car stated 8:48 p.m. She states the object was solid and shiny. It had very bright white lights in acircle with red lights in the middle of the white lights. It seemed to behovering until I opened my door and then made a sharp turn to the west and movedsmoothly and quickly away."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.736979,+-84.483865(1674)&iwloc=A&hl=en\"> mufon case (1674) map </A>","Tags":"City","Log Number":"","Object Flight Path":"Unknown","Summary":"Low flying shiny metallic object seen in East Lans","Case Number":"1674","Sighting Duration":"00:05:00","Country":"United States","Date Submitted":"09/27/1990 08:46 UTC","Disposition":"Unresolved","Date of the Event":"09/27/1990 08:46 UTC","Longitude":"-84.483865","Latitude":"42.736979","Viewing Distance":"21-100 Feet","trends":["There have been 8 other sightings in East Lansing","There were no other sightings in East Lansing on or around September 27th 1990"],"Region":"Michigan","Object Shape":"Boomerang","Object Features":"Undisclosed","Weather Factors":"Unknown"}