{"Log Number":"US-04302009-0002","Object Flight Path":"Straight-line path","Summary":"Unusual lights.","Latitude":"30.839312","files":["/var/www/straped/mufon/html2text/16740.html.txt","/var/www/straped/mufon/org/16740.html"],"Disposition":"IFO","Date Submitted":"04/29/2009 10:30 UTC","City":"Valdosta","Case Number":"16740","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.839312,+-83.271905(16740)&iwloc=A&hl=en\"> mufon case (16740) map </A>","Weather Factors":"Unknown","Object Features":"None","Date of the Event":"04/29/2009 10:30 UTC","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Region":"Georgia","trends":["There have been 6 other sightings in Valdosta","There were no other sightings in Valdosta on or around April 29th 2009"],"Object Shape":"Flash, Star-like","divs":["Sighting DetailsMy husband and I were standing on the back patio star gazing as we do every nice night when a large flash caught my eye it was very bright, almost as a camera flash would be, and as I looked in that direction it flashed again and was traveling as fast as a free falling object would. I seen a total of 3 flashes before it fell behind the trees. There was no sound at all with this movement and I was unable to tell the distance. It was so weird to see that, so my husband and I moved out to the back yard and looked up for a plane to see if maybe by chance this was a flare drop, no plane was in sight. Next thing we see a \"moving star\" as we watch that, another \"moving star\" comes out of no where and is moving in the opposite direction and both are in view, however 2nd \"moving star\" disappears within approx.10 secs and the 1st \"moving star\" keep moving and slowly moved out of sight. We are both well aware of planes as we see a dozen a night. These \"moving stars\" are seen about 1-2 nights a week between the hours of 9:30pm up to 11:30pm and on average 2-3 a night all with 30 minutes of each other. Two nights ago we seen 4 total and a \"flasher\". One was moving very fast, faster than any jet we'd ever seen during the day. And one was very bright then just vanished as if the lights were turned off."],"Longitude":"-83.271905","Source":"MUFON"}