{"Object Features":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Disc","Region":"Queensland","Latitude":"-27.464703","Country":"Australia","Case Number":"16749","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16749.html.txt","/var/www/straped/mufon/org/16749.html"],"Disposition":"Unresolved","Object Flight Path":"Undisclosed","Log Number":"AU-04302009-0011","divs":["Sighting DetailsIt was approximately 8pm and i was walking up the back stairs of the house which faces an easterly direction over the ocean.as i got to the top of the steps i noticed a very bright blinking star which at first glance i thought it was a areoplane coming in of the sea to land at brisbane airport. It then seemed strange to me as i have lived on this island all my life and i have never seen a aeroplane come in from that direction so i stood at the top of the steps for about 10 mins and noticed that the lights were blinking brighter than a usual plane, in this time the lights did not seem to get any closer so i walked inside to put the washing down i had just got off the clothes line. I went out side again as the lights had me interested for some reason and when i went back outside the light was still in the same position so i called to my wife to bring the binoculers out so i could have a better look as this thing was about 20 to 30 km away. When i ajusted the binoculers i was stunned to see that there was like a disc shapped object with the most beautiful coloured lights that i have ever seen which comprised of a blue intermintent light flashing light on top of this thing and the middle of was bright red like a tail light of a motor car, at the bottom it was changing colours in a swirling fashion from orange to a light blue to a green sort of colour at that point i thought i was going nuts so called to my wife and adult son to come and have a look at this thing. My wife was the first out of the pair to look at it and was very supprised and started to get very worried and wanted to call someone about it as by this time it had come a little closer and had now tilted on its side at about 45 degrees at this point we knew it was not an aeroplane. My son all this time was taking the mickey out of me saying that the little green men are comeing to get me but once he looked at it through the binoculers he went real quiet and turned around and went back inside as my wife and i continued to watch. In all we watched it for about 50 minutes and started to get attacked by mossy's so we went inside to get some insect reppellant which only took about 40 to50 seconds as it was on top of the fridge near the door but when i turned around to look at it again it was gone and as it was a very clear night we could not see it any where only an aeroplane landing at brisbane airport and it was nothing like what we had just seen, thanks for listening."],"Date of the Event":"04/29/2009 06:17 UTC","Longitude":"153.027402","Date Submitted":"04/29/2009 06:17 UTC","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-27.464703,+153.027402(16749)&iwloc=A&hl=en\"> mufon case (16749) map </A>","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around April 29th 2009"],"Summary":"Bright disc shaped object with different coloured flashing lights. Blue flashing light on top red in the middle & orangelight on bottom that changed colours as if turning around some how.","City":"Brisbane"}