{"Region":"Washington","files":["/var/www/straped/mufon/html2text/16751.html.txt","/var/www/straped/mufon/more/16751_submitter_file1__Snapshot_20090430_1Enhanced.jpg","/var/www/straped/mufon/more/16751_submitter_file2__Snapshot_20090430_1.jpg","/var/www/straped/mufon/more/16751_submitter_file3__Snapshot_20090430.jpg","/var/www/straped/mufon/org/16751.html"],"Date Submitted":"04/30/2009 07:27 UTC","Weather Factors":"Unknown","Log Number":"US-05012009-0001","Object Shape":"Triangle","Disposition":"IFO","Longitude":"-122.326801","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI have a modified webcam with no IR filter connected to my PC and looking upward towards the sky through my office window. I keep it there all the time and watch the skies, clouds etc. using WebCam application. I was just gazing at the WebCam while taking a break this evening around 7:30PM Seattle time and noticed a smooth sailing triangular looking object flying by. It was flying very slow compared to the planes that usually fly by here all the time. I sit close to the window where the camera is and can hear the planes all the times. In this case it was quiet and I couldn't see anything outside through the naked eye but only through the WebCam application connected to my modded camera. I hit the SNAPSHOT button twice on the application to capture the frames, got two. I am attaching the original picture as the camera sees it and then the enhanced one. To me it looks like a triangle of some sort. Have any one of you seen something like this? Is it really a triangle flying. What was unique about this is that it was quiet, smooth slow sailing, no lights as I couldn't find it in the sky but only through the cam. Can't confirm what it is - see the pics and be the judge."],"Latitude":"47.61055","Source":"MUFON","Case Number":"16751","Object Features":"Undisclosed","trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around April 30th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.61055,+-122.326801(16751)&iwloc=A&hl=en\"> mufon case (16751) map </A>","Summary":"Triangle looking - flying slowly.","Tags":"City","Date of the Event":"04/30/2009 07:27 UTC","Viewing Distance":"Unknown","City":"Seattle","Country":"United States"}