{"Date of the Event":"04/29/2009 08:30 UTC","trends":["There have been 13 other sightings in Burlington","There was one other sighting in Burlington on or around April 29th 2009"],"Case Number":"16758","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Longitude":"-73.204832","Date Submitted":"04/29/2009 08:30 UTC","City":"Burlington","Object Features":"Undisclosed","Object Shape":"Sphere, Unknown","Disposition":"IFO","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.476982,+-73.204832(16758)&iwloc=A&hl=en\"> mufon case (16758) map </A>","Viewing Distance":"Unknown","Summary":"Three orange objects.","Sighting Duration":"Undisclosed","divs":["Sighting Detailsmy friend and i were sitting on my balcony when i noticed a strange bright orange light moving slowly in the southwestern sky. i brought out my telescope to investigate. i was able to look at it through my telescope for a few seconds at a time before it would pass out of view. it appeared to be a perfect spherical structure with some sort of legs. i don't think it was giving off any light, instead i think it's glow was reflected light from the sun, so it must have been very high up as the sun had already set a while beforehand. it followed an odd path about the southwestern sky, sometimes moving faster than others, before it faded away. it was soon replaced by another closer one (or perhaps the same one?) which moved in a similar manner through the sky and was soon joined by another. after a few minutes they both faded. i watched for more but saw none, however, a few minutes after the last one had vanished my friend and i (and another friend who i had called to watch in case another thing appeared) saw a pair of some sort of fast moving but silent planes in that area of the sky whose lights blinked in a way unlike any planes i have previously seen."],"Latitude":"44.476982","files":["/var/www/straped/mufon/html2text/16758.html.txt","/var/www/straped/mufon/org/16758.html"],"Country":"United States","Log Number":"US-05012009-0008","Region":"Vermont"}