{"Object Flight Path":"Stationary","Date Submitted":"04/30/2006 08:15 UTC","trends":["There have been 2 other sightings in Camp Verde","There were no other sightings in Camp Verde on or around April 30th 2006"],"Object Features":"Unknown","Date of the Event":"04/30/2006 08:15 UTC","Country":"United States","Latitude":"34.563636","Log Number":"US-05022009-0008","Object Shape":"Flash, Unknown","Longitude":"-111.854318","Summary":"Flashing bright lights/stationary.","Disposition":"Unknown","divs":["Sighting DetailsAS I WAS WALKING MY DOG AT THE CLIFF CASTLE CASINO SOUTH PARKING LOT IN CAMP VERDE, ARIZONA, WHEN I NOTICED A BRIGHT LIGHT IN THE WESTERN SKY JUST ABOVE THE MOUNTAINS. I HAD JUST GOTTEN OUT OF THE CAR WHICH WAS FACING THE WEST AND THERE IT WAS, SO BRIGHT, YOU COULDN'T MISS IT. AT FIRST I THOUGHT IT WAS PROBABLY A SMALL PLANE (THERE'S A PRIVATE AIRSTRIP RIGHT THERE BY THE CASINO, AND ANOTHER AIRPORT NEARBY IN COTTONWOOD). HOWEVER, THE LIGHTS WERE FLASHING RAPIDLY, NOT IN THE PATTERN OF STROBES. THEN I THOUGHT IT MIGHT BE A HELICOPTER BECAUSE IT SEEMED TO BE MAINTAINING THE SAME POSITION IN THE SKY BUT AS FAR AS I KNOW HELICOPTER LIGHTS DON'T FLASH DIFFERENT COLORS, SO I RULED THAT OUT. THE LIGHTS WERE FLASHING RAPIDLY, TURNING FROM BRIGHT BLUE TO WHITE AND OCCASIONALLY RED, AND BACK AGAIN. I COULDN'T MAKE OUT AN EXACT SHAPE BUT ONCE IN A WHILE A WHITE BEAM OF LIGHT WOULD FLASH UNDER THE OBJECT AND THEN DISAPPEAR. IT REMAINED IN THE SAME PLACE THE ENTIRE TIME I WATCHED IT. I FELT THRILLED TO SEE IT, AT THE SAME TIME VERY CALM, AND AS I LEFT TO GO INTO THE CASINO, A GREAT SENSE OF PEACE. I LOOKED BACK JUST BEFORE GOING IN, AND IT WAS STILL THERE. SUBMITTED: MAY 2, 2009 GAIL BERRY, SEDONA, AZ"],"City":"Camp Verde","Sighting Duration":"00:03:00","Weather Factors":"None","Tags":"City","Viewing Distance":"Over One Mile","Case Number":"16766","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.563636,+-111.854318(16766)&iwloc=A&hl=en\"> mufon case (16766) map </A>","files":["/var/www/straped/mufon/html2text/16766.html.txt","/var/www/straped/mufon/org/16766.html"],"Region":"Arizona"}