{"Country":"United States","Longitude":"-108.215556","Weather Factors":"None","Case Number":"16769","Log Number":"US-05022009-0010","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/16769.html.txt","/var/www/straped/mufon/org/16769.html"],"Object Features":"Window(s)","City":"Farmington","trends":["There have been 4 other sightings in Farmington","There were no other sightings in Farmington on or around July 31st 1990"],"Tags":"City","divs":["sighting detailsi was standing on the north side of our van, talking to some relatives through the passenger side window. i glanced over my left shoulder and i thought i saw a movement. sure enough, there was the tail end of a black ufo about 3-5,000 thousand feet above. (it looked like it was about three telephone poles high.) i could see about four people inside a window. they were dressed in black and they looked down in our direction. i saw about 3\\4 of their figures in their ufo window. for some reason i did not get all excited and run around the building to get a better view. i just said, \"hey, look at that!\" i believe my wife's brother was the only one who looked in the direction of the ufo. whether he saw it or not, i don't know. (he is now diseased.) there was no sound and it was moving real slow. probably about 20 miles an hour. the ufo flew west. on the google earth location, it was 36 degrees 10' 02.44\"n abd 108 degrees 20' 10.51\" w and flying west. later i was thinking what would a ufo be doing way out here in the middle of nowhere. i don't know what the overall shape was because i did not run around the side of the building to get a better view. why not? i don't know."],"Latitude":"36.735218","Summary":"Black.","Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=36.735218,+-108.215556(16769)&iwloc=A&hl=en\"> mufon case (16769) map </A>","Date of the Event":"07/31/1990 12:00 UTC","Object Shape":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Date Submitted":"07/31/1990 12:00 UTC"}