{"Disposition":"Unknown","Viewing Distance":"21-100 Feet","Tags":"City","Date Submitted":"05/15/1955 02:00 UTC","files":["/var/www/straped/mufon/html2text/16776.html.txt","/var/www/straped/mufon/org/16776.html"],"Region":"Kentucky","Log Number":"US-05032009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=37.82338,+-87.24389(16776)&iwloc=A&hl=en\"> mufon case (16776) map </A>","Weather Factors":"None","Object Flight Path":"Stationary","trends":["There have been no other sightings in Stanley","This sighting has never been favorited."],"Summary":"10 days of night visits when I was 11.","Object Features":"Unknown","Longitude":"-87.24389","Date of the Event":"05/15/1955 02:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"16776","City":"Stanley","Source":"MUFON","divs":["Sighting DetailsWe lived in a small farming community & in an old farm house. We had no bathroom facilities inside, just an outhouse that was a good walk from the house. One spring night, sometime between 2:00 & 3:00am, I woke up with a great need to go to the bathroom. I drug myself out of bed, through the house & into the dark. As I went around the coal shed toward the outhouse, I realized that it was perfectly quiet, no cricket or frog sounds. I had the impluse to look up. When I did, I saw an object that was right over the coal shed. It was round & was about 30 ft across. It was about 40 ft. above me. The object did not move or make a sound. There were lights around the bottom. There was a red light that held my attention. I couldn't stop looking at it. I can remember wondering it the object was a helicopter. I had heard that copters could hover without falling, but I'd never seen one. Staring at the red light was the last thing that I remember about it. The next thing I remember is that I woke up in bed. This happened for ten nights in a row. The only difference was that when I'd go off the back porch, I would hear the old screen door slap, then I'd wake up in bed the next morning. This was happening back in 1955. I tried to tell my parents about it, but of course they convinced me that I was just dreaming. Even though I don't remember the details, I know that I had a real experience. I've had other things happen to me that I realize must be connected to my childhood experience. But of course I don't remember the details. I must have had the fear of God put into me for me not to remember. I know you can't do anything with this, but it sure has made me feel better to share it with folks that might understand it."],"Object Shape":"Circle","Latitude":"37.82338"}