{"Sighting Duration":"00:02:00","Summary":"triangular. only saw back. crossed road into sonora while driving.","Disposition":"Unknown","City":"Sonora","Date of the Event":"06/12/2002 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.986141,+-120.376268(16770)&iwloc=A&hl=en\"> mufon case (16770) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/16770.html.txt","/var/www/straped/mufon/org/16770.html"],"Tags":"City","Country":"United States","Longitude":"-120.376268","divs":["Sighting Details About six or so years ago my dad, mom, and i were on our way home to Sonora California at the base of the foothills of the Sierra Nevada's. my father is a tow truck driver so we were out pretty late. about one maybe two in the morning. ten minutes till Sonora on Hwy 108 we were coming up upon the yosemite' turnoff in this semi flat area when we noticed a big dark triangle cross the road. this object had no lights on but the outline and certain features were still visible. we never said a thing until it was gone. we were almost mezmerized. no recorded loss of time but its strange that we just stared at it and never said anything. the object was hover above the road as we drove. we got closer and though we were going to drive right into it and suddenly it disappeared into nowhere. after the object was gone we all agreed on what we saw. today i saw a special on the History channel called ufo hunters that i watch about the same area in and around sonora california and the sierras called triangle ally. i was interested and suprised when i saw my hometown and lionsbald mountain. the i was amazed to see an artist rendering of what witnesses explained they saw and looked exactly what i saw. seeing this compelled me to report my sighting to mufon and hope to find more info on this areas high sighting rate. if you wish to see an sketch of what it looked like i can draw one or copy and paste a still frame of the rendering off of the show. please contact me and tell me more about triangle alley for i am very interested in ufo's and always have been since i was little. please send or reply to my primary email listed in the report, or call."],"Object Features":"Undisclosed","Latitude":"37.986141","Object Shape":"Triangle","Source":"MUFON","trends":["There have been 4 other sightings in Sonora","There were no other sightings in Sonora on or around June 12th 2002"],"Region":"California","Log Number":"US-05022009-0011","Date Submitted":"06/12/2002 01:30 UTC","Case Number":"16770","Weather Factors":"Unknown","Viewing Distance":"Unknown"}