{"Disposition":"Unknown","divs":["Sighting DetailsThe reason I am reporting this now is my brother who has recently became a MUFON Investigator told me I should report this sighting. My friend and I had this sighting several years ago in a town called Sanger. I don't remember the exact date but it was between 1996 and 1997. It was a Friday night and we were at my cousins house getting ready to go out to a casino. It was 10:00 p.m. and my friend and I were waiting outside for my cousin, we were talking and I noticed something in the night sky. I looked up and I saw this black object floating slowly across the sky. I told my friend to look up where she saw the object and she freaked out and ran inside. I, on the other hand kept looking at the object as it floated from North-West to South-East. The object was not making any noise. I really don't remember the size or the shape but it was sort of long and retangular in shape. This was a long time ago and it is hard to remember the specifics. I saw the object for about 10 seconds until I ran inside. We told my cousin but he did not believe us. We did not go back outside until my cousin was ready to go. By that time the object was gone and we went to the casino."],"trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around May 31st 1997"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.749807,+-119.767986(16778)&iwloc=A&hl=en\"> mufon case (16778) map </A>","Summary":"Friend and I went outside and saw a black object moving very slowly no sound.","Weather Factors":"Unknown","Case Number":"16778","files":["/var/www/straped/mufon/html2text/16778.html.txt","/var/www/straped/mufon/org/16778.html"],"Longitude":"-119.767986","Log Number":"US-05032009-0006","Object Features":"None","City":"Fresno","Region":"California","Date Submitted":"05/31/1997 12:00 UTC","Tags":"City","Object Shape":"Square, Rectagular","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"36.749807","Country":"United States","Date of the Event":"05/31/1997 12:00 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"21-100 Feet"}