{"map":"<A HREF = \"http://maps.google.com/maps?q=37.088727,+-94.508041(16783)&iwloc=A&hl=en\"> mufon case (16783) map </A>","Latitude":"37.088727","Country":"United States","files":["/var/www/straped/mufon/html2text/16783.html.txt","/var/www/straped/mufon/org/16783.html"],"Log Number":"US-05032009-0011","Tags":"City","Disposition":"Unknown","Region":"Missouri","Viewing Distance":"Unknown","Sighting Duration":"00:15:39","Object Flight Path":"Undisclosed","Date of the Event":"02/15/2009 04:57 UTC","Summary":"Waiting 4 wife 2 get off work son looked up and asked what is that! I looked and seen a triangle!","Case Number":"16783","Longitude":"-94.508041","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around February 15th 2009"],"Object Features":"Undisclosed","City":"Joplin","Object Shape":"Triangle","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI and my son went to pick up my wife from work,the time was 4:50pm,it was a nice clear day and we parked by the frount door of the restraunt,and was just sitting in the car, and talking,and not much time went by and my son looked up and blared out!..WHAT IS THAT! and I replyed what is what? my son said THAT! so I leaned over in the car to look,and right above us was a black triangle! I was shocked to say the least! we just sat there looking at this thing I almost couldn't beleve I was seeing this!There was a BLACK TRIANGLE just flooting by it made no sound and it was slowly turning in a clockwise rotation and was moveing about 5,to 10mph,I would say it was about 1500 ft in the air it looked like it was at lest 50 to 60 ft long and at lest 20 ft tall,and the top of it was in the shape of a dome but the top changed colers like it was airadesent the colers wentfrom black to a yellowish green to a blue then there was some red coller in it to! We watched this thing floot by then it begain to slowly gain hight and it was going in a westernly direction but as it gained hight it changed to a northwesternly direction and we watched this thing tell it disapered from sight! we looked at each other and I looked at the time and it was alittel after 5:10pm I told my wife but she gives me static about it ! But I don't care!! we ! my son and I know what we seen !!I know it wasn't a ballon!or a plain! or even a helocopter!I grew up by a airforce base when I was young and I know what those things are but this ! IT WAS A BLACK TRIANGLE !! I don't realy know what to think ! but I know one thing for sure I look up alot more now!"],"Date Submitted":"02/15/2009 04:57 UTC"}