{"Object Flight Path":"Straight-line path","Summary":"2 seperate events see below","Region":"Alaska","files":["/var/www/straped/mufon/html2text/16785.html.txt","/var/www/straped/mufon/org/16785.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=61.226036,+-149.890528(16785)&iwloc=A&hl=en\"> mufon case (16785) map </A>","Latitude":"61.226036","Source":"MUFON","Log Number":"US-05042009-0001","Object Shape":"Fireball, Oval, Teardrop","Weather Factors":"Unknown","divs":["Sighting DetailsLast night I saw a bright flash of light while out on the porch a few minutes later a large orb shaped object was hovering where the flash of light had occurred. It faded into almost invisible but I could see that it was still there. Tonight out on the porch again saw what looked like a comet or shooting star right above the tree line moving pretty fast but wasnt in my view very long. It was sort of an oval shaped white, firey object with a tail about 1 to 2 ft long. I supose it could have been a comet or shooting star about to crash in my neighborhood but I really dont think so. If it was then a fire should start soon very close by. I dont think the object was falling but it wasnt in my range of sight very long. If it was a comet it hit really close but there was no noise and I have seen very large shooting stars fairly close and you can hear them. Besides this I think was too small to be a meteorite. Describe my reaction huh lets try HOLY S--T WHAT WAS THAT!!! That was my reaction. I lost sight of it because it was moving and the neighbors house got in the way. I went outside and looked in that direction and not seeing any smoke yet if it was a meteorite.Its been about 15 minutes and still not hearing any sirenes from a recently started fire. I really dont think it was a meteorite but most likely a UFO."],"Date Submitted":"05/02/2009 10:34 UTC","Longitude":"-149.890528","Country":"United States","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around May 2nd 2009"],"Case Number":"16785","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"05/02/2009 10:34 UTC","Tags":"City","Disposition":"Unknown","City":"Anchorage","Viewing Distance":"501 Feet - 1 Mile"}