{"trends":["There have been 3 other sightings in La Palma","There were no other sightings in La Palma on or around May 3rd 2009"],"Longitude":"-118.040661","Viewing Distance":"Unknown","divs":["Sighting DetailsAt 11:07 I walked into my bedroom and I looked out the window due North from my home and saw one bright non-blinking star-like light. The sky was clear and there was no other moving lights in the sky at that time. I can see planes on final approach to LAX in that same direction, but this light was much higher on the horizon and not moving E to W as the planes do. At first I thought it was a helicopter approaching from the N toward the S, but the object moved slowly and erratically, forward and back unlike any aircraft of any kind. The object was as bright in the sky as the lights on an aircraft might be if it were in the area. It odd direction it moved and its brightness made it quite noticeable in a dark and quiet sky. There was no color, only white light like a star. The object moved around the NE sky for several minutes and then dove to the S suddenly and was lost on the horizon. In a few minutes the light appeared again, but with a companion light about 10 degrees to the NW of the original object. The lights moved in perfect tandem around in the NW sky, again much higher than the planes which I could still track low in the sky on their approach to LAX. I got a second witness to physically observe with me and she saw the same thing. We both also thought that someone on the planes, a passenger or even a pilot, must have seen them unless they were too far N in the sky for them to be seen from the windows on the planes. The tandem lights moved, slowly at first, erratically, but still in tandem. At one point the original object brightened and dimmed and the companion light did the same thing about five seconds later. They moved quickly around the N sky for a couple of minutes, brightening and dimming and moving erratically, then pausing and hanging motionless in the sky. They were stationary for several minutes and then finally dove quickly and brightly directly down to the horizon in the N sky. There was no sound that accompanied the lights. I remember thinking that I could not believe what I was seeing. I was transfixed, tracking the movement and I knew I needed to get someone to see it with me and I did. I called two friends but no one answered the phone at that hour. I'd wished that I had a camcorder available, but I did not. After the event, no other activity was noted. I remained at watch alone for another hour, but no reoccurance."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.847854,+-118.040661(16788)&iwloc=A&hl=en\"> mufon case (16788) map </A>","files":["/var/www/straped/mufon/html2text/16788.html.txt","/var/www/straped/mufon/org/16788.html"],"Object Flight Path":"Path with directional change","Object Shape":"Star-like","Weather Factors":"Unknown","Source":"MUFON","Disposition":"IFO","Region":"California","Case Number":"16788","Tags":"City","Date of the Event":"05/03/2009 11:07 UTC","Country":"United States","Summary":"Erratically moving single, then double star-like in N skies over Los Angeles.","Sighting Duration":"Undisclosed","City":"La Palma","Date Submitted":"05/03/2009 11:07 UTC","Latitude":"33.847854","Object Features":"None","Log Number":"US-05042009-0004"}