{"Case Number":"16793","Date of the Event":"07/01/2000 08:45 UTC","Country":"United States","Latitude":"41.324546","Longitude":"-74.796398","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=41.324546,+-74.796398(16793)&iwloc=A&hl=en\"> mufon case (16793) map </A>","Tags":"City","Date Submitted":"07/01/2000 08:45 UTC","files":["/var/www/straped/mufon/html2text/16793.html.txt","/var/www/straped/mufon/org/16793.html"],"Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Milford","There were no other sightings in Milford on or around July 1st 2000"],"Summary":"As though a stage spotlight from above moved through the floor of the woods.","Object Features":"Unknown","divs":["Sighting DetailsI was headed to our summer getaway in rural NE Pa. on US RT. 6 west about midway between Milford and Hawley Pa. In the car were my late elderly father who was sleeping, and my wife who was listening to the radio with eyes closed and did not witness the event.(as it happened so quickly). I was on a fairly straight stretch of road approaching a slight curve to the left in a generally westerly direction. As the road went left and slightly downhill, in the woods straight ahead of me I saw, on the ground, approaching, a circle of orange light(like an old time heat lamp). It was the time of year when the twilight seems to last a long time. (The \"gloaming\", as the Scots put it.) I was going about 45- 50 mph and the light on the ground seemed to be approaching slowly- at maybe 10- 15 mph. As it was not quite dark enough for headlights, I only had on the parking lights. As the light on the ground seemed to be on a \"collision\" course, I hit the brakes slightly. We did not collide and instincivly I looked in the side view mirror-- and to my surprise, I saw the \"object\" cross the road directly behind me and continue moving into the woods- behind and to the left of me in a generally SE direction. I say to my surprise because my first thought was that it was a reflection of my parking lights and how could that be possible- behind me? It was a circle of reddish orange light not as bright as the setting sun (like a heating lamp). I'd estimate it to be about 30 to 36 inches across. It was as though someone had held a stage light above the floor of the forest and was moving slowly through. I've hesitated to report this because it seems so implausible to me - I can think of no logical explanation, and expect not to presented with one. The car was a 94 pontiac transport mini van, if that matters."],"Object Shape":"Circle","Object Flight Path":"Straight-line path","Log Number":"US-05042009-0009","Source":"MUFON","Weather Factors":"Unknown","Disposition":"Unknown","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","City":"Milford"}