{"Summary":"Pilot sights strange incandescent beacon light pass close underneath left wing.","divs":["Sighting DetailsA very strange dim incandescent beacon light approached at night from the right-hand side of the aircraft and passes across the path and then underneath the left wing in a matter of 20 seconds. The beacon light was strange in that it was unilluminated (off) more than it was on. The interval was like one second-on and five seconds off, and we saw the light 4 times. We did not see any other running lights. From the perspective of the path, i.e. relative motion, and the closing speed and angle, this light passed across the aircraft path at almost the same level and in very close proximity. Ground-based lighting would take minutes to pass an aircraft travelling at 2.5 miles a minute, this light was not on the ground. The first thought was that the light was attached to a military jet, but this has been dispelled by discussions with military aircrew after an unofficial enquiry two weeks later when I described the beacon. An aircraft does not normally sport a white running light, nor a single white beacon in the forward direction. A white light, except for landing lights, is reserved for the rear of an aircraft. When the beacon is unlight, it should be relatively easy to see one or more red or green navigation running lights when the aircraft is heading towards your own aircraft. This sighting occured in the same designated remote area as a previous sighting. The light was seen by the pilot and co-pilot almost simultaneously, and they both queried each other, \"what is that?\". Unfortunately the corroborating witness is since deceased. Along with other unusual night time sightings, it is difficult to associate this white light with a known aircraft when none of the other expected tell-tale lights are present. This is yet another unexplained night time sighting by two pilots, and easily dismissed as fleeting incident."],"Latitude":"-35.99665","Country":"Australia","map":"<A HREF = \"http://maps.google.com/maps?q=-35.99665,+148.773968(16798)&iwloc=A&hl=en\"> mufon case (16798) map </A>","Viewing Distance":"Unknown","City":"Adaminaby","Case Number":"16798","Object Features":"Undisclosed","Object Shape":"Unknown","Longitude":"148.773968","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Log Number":"AU-05052009-0004","trends":["There have been no other sightings in Adaminaby","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/16798.html.txt","/var/www/straped/mufon/org/16798.html"],"Date of the Event":"03/09/2008 12:00 UTC","Sighting Duration":"Undisclosed","Region":"New South Wales","Disposition":"Unresolved","Tags":"City","Date Submitted":"03/09/2008 12:00 UTC"}