{"Case Number":"16797","Sighting Duration":"Undisclosed","City":"Canberra","Object Flight Path":"Path with directional change","trends":["There have been no other sightings in Canberra","This sighting has never been favorited."],"Weather Factors":"Unknown","Region":"Australian Capital Territory","Log Number":"AU-05052009-0003","Summary":"Pilot sights incandescent light on unknown craft at same altitude as own aircraft.","Date Submitted":"06/22/2008 12:00 UTC","Date of the Event":"06/22/2008 12:00 UTC","Country":"Australia","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=-35.282,+149.128684(16797)&iwloc=A&hl=en\"> mufon case (16797) map </A>","Disposition":"Unresolved","Latitude":"-35.282","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Source":"MUFON","divs":["Sighting DetailsAn unknown unidentifable air craft was sighted between Merimbula and Canberra sporting one continuous incandescent light approximately 3 miles in front of own aircraft, travelling at night, and moving with relative motion showing that it was at the same altitude and keeping pace only a few miles in front, while we were on descent from 9500' at 157 Knots down to 7500'. The incandescent light appeared to be the rear nav light of an aircraft, but there was no anti-collision strobe or beacon visible on the unknown. Own aircraft was in contact with airservices and the unknown was not reported as traffic despite being only a few miles in front for over 6 minutes. The unknown rapidly descended through continuous cloud cover that was over 1000' thick and would have descended below lower safe altitude when the closing distance between own aircraft and was reaching two miles or less. Even Instrument Rated pilots do not descend through cloud below lower safe altitude in the dark unless executing an approach procedure. The descent was rapid and in close proximity of high country and certainly not in the approach area of any airport. The light was visbile for more than 6 minutes above solid cloud but when we closed in on it, it just jumped down and went through cloud. The unknown was sighted by two, slightly bewildered pilots. At no stage could any shape be determined, just distance and proximity."],"Tags":"City","Longitude":"149.128684","files":["/var/www/straped/mufon/html2text/16797.html.txt","/var/www/straped/mufon/org/16797.html"]}