{"Summary":"Bright flashing blue light.","trends":["There has been one other sighting in Newton","There were no other sightings in Newton on or around April 21st 2009"],"Object Features":"None","Viewing Distance":"21-100 Feet","Source":"MUFON","Longitude":"-71.035","Latitude":"42.86944","Date of the Event":"04/21/2009 04:00 UTC","Log Number":"US-05052009-0013","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.86944,+-71.035(16808)&iwloc=A&hl=en\"> mufon case (16808) map </A>","Country":"United States","divs":["Sighting DetailsThe power flickered on and off which woke my boyfriend up when his lamp (touch sensitive) turned on. He woke me and asked me to check out what he was seeing out the window. I opened my eyes and immediately saw the blue light flashing on then off. I thougt it was a police car stopping someone on the street. I looked out the window and noticed the bright blue light. It looked like it originated about 50 yards away in the neighbors yard right next to or on the street. It was about 2 feet from the ground. It flashed and lit up the entire sky as bright as lightning. It was raining that night. When it wasn't flashing, the sky was black. It continued to flash 5 or 6 times more then stopped. After it stopped we both tried to figure out what it could have been. We came to the conclusion that it might have been a downed power line or something electrical, so we called the police to report it, especially as it seemed to interfere with the power. The police instructed us to call the fire department who came to investigate. They couldn't find any downed power line or anything out of the ordinary. a couple hours later the local utility company, Unitil came to the house to investigate followed by the police. We explained what we saw to them. They also checked the street, the neighbors property, our own property, but they found nothing as well."],"Date Submitted":"04/21/2009 04:00 UTC","files":["/var/www/straped/mufon/html2text/16808.html.txt","/var/www/straped/mufon/org/16808.html"],"Tags":"City","Sighting Duration":"Undisclosed","Region":"New Hampshire","City":"Newton","Weather Factors":"Windy, Rain, Medium","Object Flight Path":"Stationary","Object Shape":"Flash, Unknown","Case Number":"16808"}