{"files":["/var/www/straped/mufon/html2text/16805.html.txt","/var/www/straped/mufon/more/16805_submitter_file1__083108UFOb.jpg","/var/www/straped/mufon/more/16805_submitter_file2__083108UFOc.jpg","/var/www/straped/mufon/org/16805.html"],"Tags":"City","Latitude":"33.451427","Summary":"Triangle UFO in daylight witnessed by three people together.","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 31st 2008","This sighting has never been favorited.",""],"Date Submitted":"08/31/2008 05:15 UTC","Case Number":"16805","Source":"MUFON","Log Number":"US-05052009-0010","Weather Factors":"Unknown","City":"Phoenix","Region":"Arizona","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsAt our home in the Ahwatukee area of Phoenix (behind South Mountain)on August 31, 2008 around 5-5:30 pm in broad daylight, my husband, myself, and my son all witnessed a UFO from our backyard. It was moving at a slow steady and purposeful speed heading from south to north above the I-10 freeway. To us, it appeared like three round white objects held together as if well affixed. At first, we were thinking balloons, but this did not drift of get smaller, it simply moved with forward motion without veering or going higher. We watched it make a trip towards the north for a good 15-20 minutes perhaps. Even my completely skeptical husband said, \"that's a UFO.\" I never reported it because I wasn't really sure if there was a central place to report to that would keep records. Roger Marsh from Examininer online suggested I put this into your database. We see a lot of strange things in the skies here, but this time we all saw it together, debated it, watched how it moved, and took photos, so I feel very good that as skeptical and logic-minded as we are, we couldn't explain this one. The only way it disappeared was that it moved north too far to see it any longer with the roof line in the way. It didn't seem to change altitude or veer one way or the other. It looked very purposeful. Oh, and this made NO sound at all from where we were. It was not directly overhead, slightly to the east of us, but very high in the sky so nearly overhead. It looked like three lobes attached to each other. To the naked eye, they appeared to clearly be three spheres attached to each other and very white in the blue sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.451427,+-112.069447(16805)&iwloc=A&hl=en\"> mufon case (16805) map </A>","Object Shape":"Triangle","Disposition":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"08/31/2008 05:15 UTC","Viewing Distance":"Unknown","Longitude":"-112.069447"}