{"Object Features":"None","Date Submitted":"05/04/2009 04:15 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=46.917894,+-98.702546(16803)&iwloc=A&hl=en\"> mufon case (16803) map </A>","City":"Jamestown","Country":"United States","Object Flight Path":"Straight-line path","Region":"North Dakota","Summary":"Enormous wing.","Log Number":"US-05052009-0009","Tags":"City","Latitude":"46.917894","Longitude":"-98.702546","files":["/var/www/straped/mufon/html2text/16803.html.txt","/var/www/straped/mufon/org/16803.html"],"Case Number":"16803","Weather Factors":"None","Object Shape":"Chevron","trends":["There have been 5 other sightings in Jamestown","There were no other sightings in Jamestown on or around May 4th 2009"],"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["sighting detailson dike patrol for the national guard on the james river, standing behind the store near the hwy 281 bridge. at 4:15 am, myself and 1 other soldier were walking the dike, checking for seepage, breaches or leaks. i have always had a habit at looking up and staring at the stars on clear nights. we noticed an enormous object fly over our heads heading at a fairly slow rate going east by south-east. we could not see any real shape to the aircraft but the there was a center red strobe light and three red lights going off of it in a low angle swept back wing pattern at an equal distance apart. (the soldier that was with me thought there were four lights on the objects left side and three on the right). there was no noise associated with the object. we both estimated the object to be about half the size of a city block or 1\\4 mile in width. i tried to take a photo of it with my cell phone, but the pixel rate was too low and all i see is a completely black photo. i called our operations center and talked to some of my peers about it, but faced ridicule and am not going to pursue it further. this is the only ufo i have ever seen after over 25 years in the military."],"Date of the Event":"05/04/2009 04:15 UTC"}