{"Weather Factors":"None","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.737798,+-81.332517(16813)&iwloc=A&hl=en\"> mufon case (16813) map </A>","Country":"United States","divs":["Sighting Details On sunday April 26, 2009 at approxamatly 2:00 AM, not able to sleep, I went outside on my deck to have a cigarette. It was a beautifull, warm and clear night. No clouds, just stars. While having my smoke and as by habit, my eyes were drawn to the night sky. Whenever I'm outside, day or night, I continually watch the sky in anticipation of such incidents as the one about to be described. What I wittnessed was a round, defined, white ball or oval object cross the sky above me at a straight trijectory and high rate of speed (took 4 seconds)before it dissapeared. The object had no tail, it did not fly in an arc and its shape was a clearly, well focused ball with no haze or aura around it. At first I thought the object to be a shooting star, but, I've seen shooting stars and noticed they usually have a tail and fly at an arc. This object flew straight and had no tail. There was no sound niether. The object flew rapidly to a point it could no longer be seen as opposed to simply vanishing. It's pattern of flight appeared deliberate. I was amazed at its \"crystal\" defined, clarity. Its size was indeterminate. My view at ground level, suggested the object to be 1 inch in diameter so in relation to the altitude from the ground to the sky I suspect the object to be quite sizable. I was very excited to have seen this. As I've expressed earlier, I am facinated by such activaty and I'm always looking up at the sky in the hope of captureing more incidents such as this. This event happened in Conover, NC in the county of Catawba in the Springhaven Subdivision. Submitted by: Gregg Pepitone May 6, 2009"],"Disposition":"Unknown","Region":"North Carolina","Sighting Duration":"00:00:04","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05072009-0001","trends":["There have been 33 other sightings in Hickory","There were no other sightings in Hickory on or around April 26th 2009"],"Object Shape":"Circle, Oval, Sphere","Summary":"Noticed what appeared as white round ball cross the night sky at high rate of speed.","Case Number":"16813","Longitude":"-81.332517","City":"Hickory","Date Submitted":"04/26/2009 02:00 UTC","Tags":"City","Date of the Event":"04/26/2009 02:00 UTC","Latitude":"35.737798","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/16813.html.txt","/var/www/straped/mufon/org/16813.html"]}