{"Latitude":"38.904212","files":["/var/www/straped/mufon/html2text/16815.html.txt","/var/www/straped/mufon/org/16815.html"],"Date of the Event":"11/30/2006 12:00 UTC","Tags":"City","Disposition":"Insufficient Data","Summary":"Ball of light.","Weather Factors":"None","Region":"Washington","City":"Washington","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around November 30th 2006"],"Viewing Distance":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.904212,+-77.029736(16815)&iwloc=A&hl=en\"> mufon case (16815) map </A>","Object Shape":"Sphere","Log Number":"US-05072009-0003","Object Flight Path":"Undisclosed","Case Number":"16815","Country":"United States","Date Submitted":"11/30/2006 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsI awoke with my girlfriend to a loud electrical type sound (Kind of like the electrical bolts on the old Frankenstein movies..but a much lower frequency) I got out of bed and looked through my blinds and seen a globe of light across the water at least half a mile away. A beam of light then focused on us,so it seemed so I closed my blinds and the blanket the covers them, and the light just went right through.(this was weird because the blanket is there to block out all light and had no effect)The light was bright and lit up the entire room unlike any light I have ever seen before, it was brighter than daytime.WE then got very scared and turned on the TV and internet to see if it was like an emergency or something.Nothing abnormal was on. We went back to bed and didn't talk about the event much and I tried to reassure my girlfriend that everything was all right. I was very scared and had many thoughts on what it was. I didn't write down the date or time...I searched the internet and newspaper sure it was going to be flooded by reports but never seen any matching my encounter. I let time get away from me and lost the time in witch it happened . I asked some friends and they made me feel crazy. This was very real and I am surprised I have never seen a similar report. I don't want fame or money I just want to know if anyone else reported this. This event kind of eats away at me because I know it was real. Was it a government thing or alien I don't know that. I sometime lay awake in bed waiting for it to happen again..and I will take action this time. There are so many things I wanted to do but was too scared at the time. I tried to find other sites to report to but I wanted to find a creditable one first. I am almost scared that I missed my only oppurtunity to see such a thing. Then again,maybe getting out of the light was the best thing to do ..who knows?"],"Sighting Duration":"Undisclosed","Longitude":"-77.029736"}