{"map":"<A HREF = \"http://maps.google.com/maps?q=30.399912,+-88.884088(16817)&iwloc=A&hl=en\"> mufon case (16817) map </A>","Longitude":"-88.884088","City":"Biloxi","Viewing Distance":"501 Feet - 1 Mile, Unknown","Sighting Duration":"02:00:07","Country":"United States","Summary":"Very bright light in the sky for an extended time moving erratically.","Weather Factors":"None","Latitude":"30.399912","Date of the Event":"04/22/2009 03:00 UTC","files":["/var/www/straped/mufon/html2text/16817.html.txt","/var/www/straped/mufon/org/16817.html"],"Tags":"City","Log Number":"US-05072009-0005","Source":"MUFON","trends":["There have been 4 other sightings in Biloxi","There were no other sightings in Biloxi on or around April 22nd 2009"],"Object Shape":"Sphere, Star-like","Date Submitted":"04/22/2009 03:00 UTC","Case Number":"16817","Region":"Mississippi","divs":["Sighting DetailsEarly WedEarly Wednesday morning, while sleeping on the couch of my friend, Alex Pisarch, I awoke sometime after 1am to the sound of my phone's text message ringtone. I then spent the next hour and a half texting a female friend of mine until we both desided to goto sleep. Around 3am, while laying on the couch, I noticed what I thought was the brightest star I have ever seen shining through the window. After looking at the light for about 3 seconds, it disappeared to the right behind the tree line and I said to myself, \"Oh, it was just an airplane.\" A few moments later, I noticed it come back into view, from the right to the left. I sat up and said, \"what the hell, airplanes dont change their directions like that\" and went to the window. I watched it wobble in the air in the same place for a few minutes then decided to go outside for a better view. Once outside, I witnessed the object move left then right and up and down at various speeds. I felt dumbstruck. I didn't know if I was just crazy or this was really happening, so I decide to wake someone in the house for backup. My first choice was to alert my friend Alex, but I noticed his twin sister Averil had her door open and the tv was on. I checked if she was awake and luckily she was. I convinced her to come outside with me to witness the event. She and I both watch the object move erratically for around an hour. The only thing I could possibly think it was would be a balloon, because most of the time it just stayed stationary, but the brightness of the object and the at random times very rapid movement ruled that out, we was slightly frightened but very intrigued. This was something neither of us had ever seen. We then decided to wake Alex and Averil's boyfriend Jeff. By the time everyone as assembled outside, it had stopped moving rapidly, and pretty much settled where it was going to be. It only moving slightly up down left and right. After a few minutes we all went inside to search for binoculars. When we went outside the object was gone. It's important to say that this took place from 3am to a little after 5am and during that time, the object trekked from slightly below the treeline while laying down inside to very high in the sky that could only be viewed while outside. It was much brighter than any star and moved like no man made object. And this was a clear night. We do live near Keesler Air Force Base, but it was not near it. Alex and Averil said they could both see pulsating lights under the main bright light, but I could not."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"None, Unknown","Disposition":"Unknown"}