{"files":["/var/www/straped/mufon/html2text/16814.html.txt","/var/www/straped/mufon/org/16814.html"],"Latitude":"30.205169","City":"Marathon","Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsMy Partner and I were driving to Big Bend National Park on vacation. We were about 50 miles south of Marathon, Tx on 385 heading south. It was a clear day, and we were both well rested and excited about our trip. I was gazing out the window at the mountains and the desert terrain. We had to be doing about 85 mph. I was in the passenger seat. I noticed out of the corner of my eye soemthing extremely bright and moving fast toward the car. I saw what looked like a teardrop shaped head for lack of better words with a thin line of what appeard to be a shiny band of silver wrapped around the center. I thought i saw what looked like a figure in a running man pose supporting the teardrop head, but I couldn't be absolute becaus the entire thing was engulfed in an undescriable white light, and was follwed by light tracers. I don't know if the figure or thing moved through the vehicle but as quickly as i saw the thing the cab of the SUV was filled with the light. The vehicle moved in an upward circular motion but never left the ground kind. The light exited the vehicle on the driver side. I saw my partner who was driving look at me. He was pale white and dioriented, and he said to me \"What are we doing?\". I said, \"I dont know.\" And that was it. A Few things:#1. The raio was playing in the car quite loud, however when the light moved through the vehicle there was no noise, not even the sound of the car on the road. #2 When the light was in the vehicle, it was all you could see. No definition to anything, just white light. After it was over I did not see spots liek one normally would after being exposed to UV lights. #3 My partner was driving the whole time, and never lost control. #4 It was not cloudy, it was broad daylight. #5 There were no other cars in sight.#6 There were no bumps or dips in the road to excuse the motion of the vehicle.#7 No dust devils in sight before or after.#8 The vehicle was not damaged in any manner.#9 We were completey sober.#10 We had the same experience with sligth detail differences. #11 We were paniced right after it occured, but shortly after we were very giddy.#12 We didn't discuss it much after the vacation was over, however when we got home, everytime we discussed it together we would get extreme anxiety. When we discussed it seperatley with our friends we were okay."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.205169,+-103.24462(16814)&iwloc=A&hl=en\"> mufon case (16814) map </A>","Weather Factors":"Unknown","Longitude":"-103.24462","Region":"Texas","Case Number":"16814","trends":["There has been one other sighting in Marathon","There was one other sighting in Marathon on or around April 22nd 2009","This sighting has never been favorited.",""],"Country":"United States","Source":"MUFON","Date Submitted":"04/22/2009 12:39 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Log Number":"US-05072009-0002","Object Features":"Undisclosed","Date of the Event":"04/22/2009 12:39 UTC","Object Shape":"Flash, Teardrop, Other","Summary":"Desert encounter with bright object/figure/light while in vehicle broad daylight Highway 385 around Marathon, TX."}