{"Sighting Duration":"00:15:00","Object Features":"None","Latitude":"33.853172","divs":["Sighting DetailsI was driving east on Gates in Redondo Beach, about to turn into my driveway when I spotted something very strange in the dusk Western sky. It looked like a large horizontal vapor trail that didn't vaporize. It hung in the air for a short time and then started moving south. At times it looked like the lowering sun reflecting off of a MUCH bigger object, as if I was just seeing a small corner of a stealth hidden blimp or other plane. I called my brother, who lives a little further south and he went outside to look. His view was blocked, so he went inside and up stairs and confirmed that he, too saw something strange. He asked me to go get my camera, and I did. When I back came outside, the object had \"shortened\" in length and was now moving north. I was able to get some pretty bad footage of this. Right then, my brother said he saw something else in the north west sky. Sure enough, there was an orange ball with a vapor trail that seemed to be hanging in the air. I was able to get some bad footage of this too before the sky cleared. This could just be a plane and a meteor, but we would like to confirm if others say the same strange things. The uploaded footage is small, I have larger sized footage."],"Object Shape":"Bullet, Missile, Fireball","files":["/var/www/straped/mufon/html2text/16816.html.txt","/var/www/straped/mufon/org/16816.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.853172,+-118.381638(16816)&iwloc=A&hl=en\"> mufon case (16816) map </A>","City":"Redondo Beach","Summary":"West over Manhattan Beach, California (90266) saw horizontal short vapor trail move south and then stop and move north. Second object spotted in north west sky - orange fire ball that hung in air.","Country":"United States","Longitude":"-118.381638","Case Number":"16816","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"Unknown","trends":["There have been 10 other sightings in Redondo Beach","There were no other sightings in Redondo Beach on or around May 6th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Tags":"City","Date Submitted":"05/06/2009 07:45 UTC","Region":"California","Disposition":"Insufficient Data","Date of the Event":"05/06/2009 07:45 UTC","Viewing Distance":"Over One Mile","Log Number":"US-05072009-0004"}