{"Summary":"Boomerang shaped, black, hovering aircraft. 5 lights facing you, invisible turned away.","Weather Factors":"None","Longitude":"-118.770503","City":"Fallon","Country":"United States","Log Number":"US-05072009-0006","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy boyfriend and I were driving around the desert. We had been out there a while, and soon it got very dark. We were driving back on our way home, when we both saw 3 objects in the distance, with lights we had never seen before, and flying in a unusual way, in a group. We got very excited while watching, and suddenly they started breaking away from eachother. One started going down towards the ground and dissapeared like it had crashed. The other two continued to fly, almost towards us. We decided to chase them! We started after them, and they flew right by us many times. One specifically seemed to keep coming back to us. We tried to comfirm it as a military aircraft, but it was nothing either of us had seen before. We thought maybe it could be a Drone, but the more we looked we knew it wasnt. At first there was 3 flying objects, but by this time there was only 2. But only one seemed to awknowlage us. We parked the truck after watching it fly by us and over us several times. It was completely silent. And hovered slowly, although in the distance it went faster. I decided to plug the spotlight in and try and get its attention. It worked! we were parked on a dirt road, next to a water canel. Across from the canel was a small passture, the hovering craft flew directly at us, and stopped facing us. We shined the light at it, and put our hand over the light to make it strobe. The craft sat there for a good 5 mins, and seemed like it was getting closer, so close it was alomst as if we could throw something at it. and there was NO SOUND. I tried to get pictures but, the pixel rate on my cam phone was too low and came up as all black on the screen. We started to get scared and jumped back in the truck, as soon as we did the craft moved and went behind us as if it was following us. The other craft was in the distance as if it was watching, sort of like back up. My boyfriend and I both called our parents freaking out, and not knowing how to explain the events that were going on. We watched them fly around us consistantly. But when we reached the highway, and back on our way into town, they dissapeared. When we made it back into town to my house, i was stadning outside, and seen a c 130 fly over our heads. I knew this wasnt the craft i seen because it was too large, was too high up, and wasnt silent. I could also see the shape of it and it was obviously a plane. But these hovering crafts we seen were black, almost invisable except for the lights. When they turned you couldnt see them. The only time they were all visible was when they were facing you, and that because of the 5 alined lights. I went inside my house and drew a picture for my father, he called the naval base here in fallon. They told us they had no reports of any aircraft besides the c 130. But I knew it wasnt a c 130! My boyfriend and his father went back out to where we were. When they got there, there were helicopters with spotlights on the ground, several trucks with spotlights driving through the desert. A black SUV with very dark tented windows driving towards the area we seen the crafts. Men walking around with spot lights in the desert. As if they were all looking for someting. But if they were looking for the craft that we thought we seen crash, they were in the wrong area, they were looking where we had first seen the crafts from a distance. Miles off. Im not sure what i saw tonight, but ive always been a believer of other life forms. And tonight was proof for me. I was scared..and excited. I hope I find out more about what i saw."],"Object Features":"Unknown","Tags":"City","Case Number":"16818","trends":["There have been 4 other sightings in Fallon","There was one other sighting in Fallon on or around May 7th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.475212,+-118.770503(16818)&iwloc=A&hl=en\"> mufon case (16818) map </A>","Date Submitted":"05/07/2009 09:23 UTC","files":["/var/www/straped/mufon/html2text/16818.html.txt","/var/www/straped/mufon/more/16818_submitter_file1__SIP16818012.JPG","/var/www/straped/mufon/more/16818_submitter_file2__SIP16818004.JPG","/var/www/straped/mufon/more/16818_submitter_file3__SIP16818035.JPG","/var/www/straped/mufon/more/16818_submitter_file4__SIP16818033.JPG","/var/www/straped/mufon/org/16818.html"],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Boomerang","Date of the Event":"05/07/2009 09:23 UTC","Region":"Nevada","Disposition":"Unknown","Latitude":"39.475212"}