{"Longitude":"-88.074063","Sighting Duration":"00:05:00","Case Number":"16824","Disposition":"Insufficient Data","divs":["Sighting DetailsDriving a regular babysittter home, around the corner and down the road from my residence,(on an extremely cold and clear night), we both noticed these two huge, parallel,white circles, about ten feet above a maple tree, near a ranch-style house. Having traveled the road nightly, I questioned \"what in the world\" they were, since we both had never seen such a display. No sound emanated from them either. The teenager said it must be an airplane; however, no airplane perches ten feet above a tree, without any sound. As we turned left in front of the tree, the lights passed over my automobile and shot straight out into the night sky! When I returned to my residence, I immediately called Dr. J. Allen Hynek of the Center For UFO Studies in Evanston, Illinois. I had taken an astronomy course from him while an undergraduate at Northwestern University. He answered the call, himself, took down all the relevant information, and replied that he had many other calls of the same nature from the farther south suburb of Carol Stream. To this day, as that night long ago in January of 1976, I feel incredulous, and wary that I experienced such phenomena."],"Latitude":"41.98475","Date Submitted":"01/20/1976 01:15 UTC","Weather Factors":"None","Object Features":"Unknown","Object Shape":"Circle","Tags":"City","Region":"Illinois","City":"Roselle","Viewing Distance":"20 Feet or Less","Log Number":"US-05072009-0010","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.98475,+-88.074063(16824)&iwloc=A&hl=en\"> mufon case (16824) map </A>","files":["/var/www/straped/mufon/html2text/16824.html.txt","/var/www/straped/mufon/org/16824.html"],"trends":["There have been 2 other sightings in Roselle","There were no other sightings in Roselle on or around January 20th 1976"],"Summary":"Two huge, silent, parallel, white, stationery circles, ten feet above a maple tree on a residential suburban road.","Source":"MUFON","Object Flight Path":"Stationary,Straight-line path","Date of the Event":"01/20/1976 01:15 UTC"}