{"Object Features":"Unknown","Case Number":"16829","Summary":"3 rows of 3 oval vehicles in formation.","files":["/var/www/straped/mufon/html2text/16829.html.txt","/var/www/straped/mufon/org/16829.html"],"divs":["Sighting DetailsI am a construction worker building a waste water treatment plant in Vonore Tennessee. The morning this happened I was preparing a 16 foot tall,concrete form for a pour that afternoon. We are on the edge of Tellico lake and are accustom to seeing bald eagles, osprey and other birds flying over the job site. I heard several sandhill cranes calling overhead and began looking for them. At this time I saw what I thought was 9 cranes very high overhead, Maybe, this is a guess, 10000ft, there was an airliner above them producing a comtrail probably 30 to 35000ft. The object were silver in appearance and moving up and down heading south. At this time I thought they were very high cranes because I could still hear the cranes calling. Then I saw the real crane circling to land at the lake, I continued watching the 9 objects which were flying paralle to me still making a slight up and down motion. At this time formation turn north coming directly over my head, this is when I realized these ojects were not birds, because when they made the turn they were in perfect formation, 3 rows of 3. After watching for maybe one minute these things blinked out as if you turned out a light. It blew my mind. I have not told a soul about this and have no reason too, everyone around here would think I needed a rest at the funny farm but I felt this needed to be reported to someone. Thanks for your time!"],"Region":"Tennessee","Object Shape":"Sphere","Longitude":"-84.241861","City":"Vonore","Tags":"City","Disposition":"Unknown","Sighting Duration":"00:04:00","trends":["There have been no other sightings in Vonore","This sighting has never been favorited."],"Country":"United States","Date of the Event":"10/28/2008 11:30 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","Latitude":"35.590078","Weather Factors":"None","Date Submitted":"10/28/2008 11:30 UTC","Object Flight Path":"Path with directional change","Log Number":"US-05072009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=35.590078,+-84.241861(16829)&iwloc=A&hl=en\"> mufon case (16829) map </A>"}