{"Disposition":"Unknown","Latitude":"33.05763","Country":"United States","Log Number":"US-05072009-0009","Object Shape":"Star-like, Triangle","Region":"Mississippi","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16823.html.txt","/var/www/straped/mufon/org/16823.html"],"Source":"MUFON","Date of the Event":"04/01/2009 11:40 UTC","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsApproximately at 11:40 pm I awoke from about an hours sleep. I went out on front porch to smoke a cigarette. The sky was pitch black and clear, you can see all stars clearly, not a cloud in the sky. I looked up to look at stars when I noticed what i thought was a falling star but it looked like it was going up and it was the same size as the stars with a fire like color to it. then out of nowhere before I could blink my eye there are these 3 triangle shape things just right above the tree lines kind of like gliding over the sky. They were too small to be a plane they were moving way too slow for a plane. they were flying in a diagonal formation and they didn't even make a single sound. the only thing I heard were crickets.they were in the sky for about one minute then they just disappeared. These objects were orangish white that almost seemed to be see thru. I have never in my life seen anything like it. I called the local police, they advised me to call the airport which I did, no military planes that night. I called the NWS in Jackson, MS..no weather ballons at that time of night. I was also advided to call the air nat'l guard in pearl ms. who refered me to security which I did, they advised no military planes. they also told me my conversation was being recored which was fine with me. I just got the internet today. I don't want folks to thing I'm crazy but I know what I saw and it was nothing i have ever experienced before. While I was watching them I wasn't scared it was almost peacful but the next day I was a nervous wreck."],"City":"Kosciusko","Summary":"3 distinct triangular shapes with orangish white glow.","Weather Factors":"None","Tags":"City","Object Flight Path":"Path then hovering","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.05763,+-89.587576(16823)&iwloc=A&hl=en\"> mufon case (16823) map </A>","trends":["There have been no other sightings in Kosciusko","This sighting has never been favorited."],"Longitude":"-89.587576","Date Submitted":"04/01/2009 11:40 UTC","Case Number":"16823"}