{"Log Number":"US-05082009-0003","Country":"United States","Object Features":"Dome","Disposition":"Unknown","Longitude":"-94.388858","Region":"Arkansas","Tags":"City","City":"Fort Smith","Date of the Event":"05/07/2009 11:00 UTC","Object Shape":"Circle","divs":["Sighting DetailsTrying to find out if OG&E had a power surge. I live less than 1 mile from a power station. Sometimes hear the buzzing of the station in my home. Could have been many things, including fatigue, but the events follow typical UFO encounters. 1) Went to bed about 2235 L 2) About 2300L I saw a light outside my bedroom window traveling the permiter of the window in an rectangular pattern. 3) After about 30 seconds I saw a small light gray circular domed disk travel through the room in which I was sleeping. 4) The object entered the room at the corner of the window. 5) The object was about 8-12 inches in diameter. 6) The object was not illuminated. 7) The object was a light gray color as if it were covered with a cloak. 8) The object traveled through the air about 7 feet from the floor. 9) There was a louder humming noise when the object was in the room. 10) The object was in the room about 10-15 seconds. 11) There was no physical contact and no voice sounds. I have a very logical mind, my career profession used to be scheduling aircraft for an airline. This morning I had trouble with the lights on my modem for internet connection. Strictly a light problem all systems are operating properly. There could be other explanations for this, but I have encountered this same experience on at least one other occasion at this location. If this was a UFO encounter, I suspect that power stations are what they are targeting. Possibly due to a power drain or power failure somewhere in their internal operating system. Will be happy to speak with someone about this if they want more information. I've only experienced possible UFO sightings less than 5 times in 60 years. I do not drink or drug. I am a female 60 years of age."],"Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Fort Smith","There were no other sightings in Fort Smith on or around May 7th 2009"],"Object Flight Path":"Straight-line path","Date Submitted":"05/07/2009 11:00 UTC","Case Number":"16835","map":"<A HREF = \"http://maps.google.com/maps?q=35.387744,+-94.388858(16835)&iwloc=A&hl=en\"> mufon case (16835) map </A>","Summary":"Bright light outside, small domed circular disk seen inside house. Light gray.","Latitude":"35.387744","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/16835.html.txt","/var/www/straped/mufon/org/16835.html"]}