{"Date of the Event":"05/07/2009 09:45 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around May 7th 2009"],"Tags":"City","Weather Factors":"Unknown","Object Shape":"Star-like, Unknown","Latitude":"34.058434","divs":["sighting detailsi really don't know how to think about this let alone write about it... my girl friend and i went out to the garden for a smoke, looking up i saw what i thought was a satellite passing over head, i ran inside and got my laser pointer to point it out to my girlfriend. we followed it as it traversed the sky south north it then seemed to fade away, only to reappear but this time it would pulse (maybe 20 times brighter) then disappear, reappear again, pulse and disappear again. this continued maybe 8 or 9 times. as strange as this was it is not why i felt the need tell someone. just as it disappeared i looked up and saw something moving across the sky east\\west, i still can't comprehend what i saw or what it was i think my brain is finding it hard to process it. the best way to describe it is to say that a part of the sky was moving, or at the very least something that blended in to the sky was, i know that doesn't make sense but my girlfriend was also was there and we are still trying to accept and comprehend what we saw. i then pointed the laser pointer so that i could keep track\\focus on it as it was hard to follow, i was completely shocked when right off the bat the laser hit it or i should say it dispersed across its surface spreading out and very bright. the next shock was the realization that it was a lot closer than i had originally thought and absolutely dead silent. the only way for me to describe it would be to say i could not see a definitive shape because it was, to use a sci-fi term, cloaked! do we have this type of technology? i'm still trying to grasp what happened and still feel the shock from the laser hitting it and how bright it became. it was like sensing something in a dark corner you shine a light to find there is nothing there only this time there is."],"City":"Los Angeles","Log Number":"US-05082009-0002","Case Number":"16834","Date Submitted":"05/07/2009 09:45 UTC","Sighting Duration":"Undisclosed","Longitude":"-118.234405","Viewing Distance":"Over One Mile","Summary":"Cloaked flying object.","Country":"United States","files":["/var/www/straped/mufon/html2text/16834.html.txt","/var/www/straped/mufon/org/16834.html"],"Source":"MUFON","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.058434,+-118.234405(16834)&iwloc=A&hl=en\"> mufon case (16834) map </A>","Object Flight Path":"Straight-line path","Object Features":"Unknown","Disposition":"IFO"}