{"Tags":"City","Longitude":"-118.51155","Latitude":"34.203197","City":"Los Angeles","Date of the Event":"01/18/1992 12:00 UTC","Object Features":"Undisclosed","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around January 18th 1992"],"Source":"MUFON","Sighting Duration":"00:10:15","Object Shape":"Other","Weather Factors":"Unknown","divs":["Sighting Details I was laying in bed when I noticed a light shining in my two windiws one facing west and one south the light was like a fog it was fogging in you could see decent pattern's , at first I thuoght it was a police helocopter so I jumped up out of bed and looked out the west window and observed a light emiting object with no sound when I herd no sound I Knew I was in trouble , the light went off so I backed up from the window about three feet and it came back on so I stopped and freaked and said did you see that and she said yes , and it went off for a second and I ran down the hall into the other room where my sister was sleeping and tried to wake her up and could not arouse her and the light came back on blasting in ,I backed up again , and in a moment the light went off so I was angry and ,ran outside out front under a tree and no light was observed , paused for a second and ran to the side where I saw the object on the west side of the house and looked up in a partley clouded Sky and Saw a Exiting light fade out gone I looked up just in time to see this happen this vehicle was using this light as a means of propluion , the way the light fade happened could only mean interdementional travel means I say this because I saw It happen just at thr right time. sincerley John Bozant."],"Summary":"White light/blue tint fogging in and decending like a helicopter, no sound.","Viewing Distance":"Unknown","Date Submitted":"01/18/1992 12:00 UTC","Case Number":"16833","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.203197,+-118.51155(16833)&iwloc=A&hl=en\"> mufon case (16833) map </A>","Log Number":"US-05082009-0001","Region":"California","files":["/var/www/straped/mufon/html2text/16833.html.txt","/var/www/straped/mufon/org/16833.html"],"Disposition":"Insufficient Data","Object Flight Path":"Undisclosed"}