{"divs":["Sighting DetailsI was in my backyard with my dogs just about sundown. The sun had just gone below the horizon but the sky was still very bright with some high level haze or thin cloud cover. As usual I was watching the sky just looking for birds, airplanes, etc. We live under one of the approach paths for SAT airport and we have a lot of civilian and military traffic.I saw what at first I thought was a buzzard but then I noticed I couldn't see any wings and it was not circling as they usually do. The object was totally black with no reflection from the sun and was moving in a straight line to the Northwest at a steady pace. It was moving at about the speed of a normal civilian airliner as viewed at normal flight altitude. It did not deviate at all in altitude or direction. All of a sudden it occurred to me that this thing was not normal. I thought about grabbing my camera, but i realized that by the time it powered up the object would be gone over the horizon so I grabbed my binoculars instead. I got them focused on the object just before it disappeared over the horizon.The object was solid black with no light reflection and did not appear to be below the haze or cloud cover. It looked like a cube made up of large black balls. I would have thought it might be some kind of balloon except that it was a perfect cube and the surface looked more like just half of balls arranged to form a cube. I really can't judge the sized due nothing else being close to it in the sky. I've never seen anything like this before. Maybe it was some type of balloon but due to it's constant speed, direction, and altitude I doubt it. Right now I consider it to be a true Unidentified Flying Object. The attached JPG file is a simulation of what I saw. The object is not at correct scale."],"City":"San Antonio","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Object Features":"None","Date Submitted":"05/07/2009 08:40 UTC","Region":"Texas","Disposition":"Hoax","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around May 7th 2009","This sighting has never been favorited.",""],"Tags":"City","Case Number":"16836","Log Number":"US-05082009-0004","Date of the Event":"05/07/2009 08:40 UTC","Latitude":"29.427232","Viewing Distance":"Over One Mile","Object Shape":"Square, Rectagular","Sighting Duration":"00:01:10","files":["/var/www/straped/mufon/html2text/16836.html.txt","/var/www/straped/mufon/more/16836_submitter_file1__cube.jpg","/var/www/straped/mufon/org/16836.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.427232,+-98.484638(16836)&iwloc=A&hl=en\"> mufon case (16836) map </A>","Longitude":"-98.484638","Summary":"Black cube moving NW by SAT airport.","Country":"United States"}