{"Source":"MUFON","Country":"United States","Region":"Michigan","Log Number":"US-05092009-0001","Latitude":"42.842256","Sighting Duration":"00:05:00","Weather Factors":"None, Does Not Apply","Summary":"Triangular, metallic object, in the sky, with multi colored lights.","Object Shape":"Triangle","trends":["There has been one other sighting in Clarksville","There were no other sightings in Clarksville on or around September 20th 2003"],"files":["/var/www/straped/mufon/html2text/16843.html.txt","/var/www/straped/mufon/org/16843.html"],"Case Number":"16843","Longitude":"-85.24251","Disposition":"Unknown","City":"Clarksville","divs":["Sighting DetailsI was at my mailbox at the end of my driveway when I noticed a triangular shaped metallic object in the sky above the cornfield. The craft was about 300 feet off the ground and about 100 yards from me as a distance. It seemed to just hang in the sky making no sound. There were multi colored lights around the perimeter and seemed to blink in a controled fashion. The colores were red, blue, green and white. The sighting in its entirety lasted aprox 2 minutes. When the craft left it slowly rose another 200 feet and then just took off at an amazing rate of speed. When I went to the mailbox I was on the phone and wasnt paying attention to what was going on infront of me. I remember looking at the ground the whole time I was walking. I only noticed it because I saw the beautiful light display from the object from the corner of my eye. I dont remember who I was on the phone with at the time I just rembering saying\" oh my God!\" The other person said something to the effect of \"whats going on?\" And I just hung up the phone and stood in amazement. I am a tool and die maker by trade and can honestly say I have never saw something so incredibly beautiful in my life. The craft was a work of art. I just stood there in awe of the creative masterpiece that hung so silently in the sky. The lights seemed to be so clear and vibrant. I would estimate the craft to be the size of a football field. During the sighting I was almost frozen and just stood there even afraid to blink. I knew that what I was seeing was not normal and I didnt want to miss any - thing. There is no way our government could create some thing this awsome in size and to have it so silent. I was not afraid in any way until I went back into the house after the sighting. It was then that I realized what I saw. I know.. what I saw that night was a U.F.O - I did not make a report because I didnt think calling the police was the proper channel. It wasnt until the last year that I heard of MUFON and since decided to make my report."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.842256,+-85.24251(16843)&iwloc=A&hl=en\"> mufon case (16843) map </A>","Date Submitted":"09/20/2003 08:30 UTC","Object Features":"None","Object Flight Path":"Stationary","Viewing Distance":"101-500 Feet, Unknown","Date of the Event":"09/20/2003 08:30 UTC"}