{"Region":"Florida","Weather Factors":"None, Does Not Apply","Object Shape":"Sphere","Source":"MUFON","Case Number":"16848","divs":["Sighting DetailsI was traveling toward hwy. 98 on Blue Angel hwy. and I saw something that looked like it was going to collide with a plane. I became very anxious at this sight and tried to figure out what it was. At first I thought it was two planes, then I realized the other object was too small. After that, I thought it was a bird, but quickly realized that this object was not shaped like a bird and didn't have the movements of a bird. As I drove closer to the intersection I could see that this thing was round and looked like it was maneuvering around the plane. My five year old commented that it looked like someone kicked a ball up there and it couldn't come down. I even thought maybe it was a balloon. One of the mylar balloons that's shiny metallic. There's a small airport called Ferguson's Airport further down hwy. 98 and the plane turned and took off in that direction. The object stayed straight and just went the opposite direction in a very fluid movement across hwy. 98 and hovered the trees once it was a little distance across the hwy. I was completely amazed at what I was seeing and unable to figure out what this object was, so I pulled into the gas station on the corner of the two highways and stared at the object hovering above the trees. It was shiny and seem to be blinking or something while it was there. I have no idea how long I sat there staring because I was afraid that if I turned my head I might lose it and might never know what it was. All of the sudden I was staring at the object and then somehow it was gone! I have three children and the only one who saw this thing was my five year old who sits in the middle of the back seat with the best visibility."],"trends":["There have been 68 other sightings in Pensacola","There were no other sightings in Pensacola on or around April 22nd 2009"],"Longitude":"-87.211765","Date Submitted":"04/22/2009 02:15 UTC","files":["/var/www/straped/mufon/html2text/16848.html.txt","/var/www/straped/mufon/org/16848.html"],"City":"Pensacola","map":"<A HREF = \"http://maps.google.com/maps?q=30.430959,+-87.211765(16848)&iwloc=A&hl=en\"> mufon case (16848) map </A>","Date of the Event":"04/22/2009 02:15 UTC","Tags":"City","Latitude":"30.430959","Country":"United States","Summary":"Small round metallic object flew around plane and then hovered above trees.","Object Features":"None","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"US-05092009-0006","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path"}