{"files":["/var/www/straped/mufon/html2text/16844.html.txt","/var/www/straped/mufon/more/16844_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/16844.html"],"Log Number":"US-05092009-0002","Weather Factors":"None, Does Not Apply","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Summary":"Moving steady red light glowed, then turned to larger brilliant white, passed over our car. We saw a triangle with 3 white lights underneath.","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","Date of the Event":"04/05/2009 04:35 UTC","divs":["sighting detailson sunday morning 4\\5\\09, at exactly 4:30 am, my family (son ryan, wife kathie, mother leota) were returning from soaring eagle casino. we were heading south on us127 and were somewhere between mt. pleasant and shepard (where the speed limit is still 70mph) i was driving, when my son ryan pointed and asked what that is? i could not see it at that time. ryan said it was a red light, then he said it zipped across the road and then back again at a very high rate of speed. ryan said it did this 2 times. i finally saw the red light at 11:00. it seemed to be growing brighter and slightly larger, but it was not blinking. i would estimate, using the tree line that it was roughly 10-12 times higher in the sky. kathie and leota who were in the back seat could not see the light at this point as the roof of the car was blocking thier view of the light. at this point about 3 minutes had elapsed. ryan and i then saw the red light all of a sudden it flashed to a brilliant large white light. i have never seen anything so bright before. it was a peircing white light. the white light was moving now on a course that took it directly across us127 and over my car while i was going 70mph. as the light approach from 11 o'clock, we could make out 3 seperate lights in the shape of a triangle. the 3 lights were very large and as it passed overhead, we could see through the windshield that not only were there 3 white lights in a triangle shape, but that there was also the outline of a trianglular shapped craft. the 3 lights took up the majority of the craft's outline that was visible. at this point the craft was only about 3 times the tree level over our car. we also saw a small fin on the back, but no wings and there was no sound, as i had rolled my window down. it was moving fast and crossed over the car and out over the field to our right, where it hovered. it was at this point that my wife kathie and my mother leota saw the lights. leota was sitting behind the driver's seat and could not see much, she is 90. kathie had a better view from the backseat now, but could not tell what it was. ryan my son is 24, kathie is 55 and i am 60 years old."],"Source":"MUFON","City":"Mt Pleasant","Longitude":"-84.765654","Object Features":"Appendage(s)","Latitude":"43.604508","Date Submitted":"04/05/2009 04:35 UTC","Object Shape":"Triangle","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=43.604508,+-84.765654(16844)&iwloc=A&hl=en\"> mufon case (16844) map </A>","Tags":"City","trends":["There have been 11 other sightings in Mt Pleasant","There were no other sightings in Mt Pleasant on or around April 5th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Case Number":"16844"}