{"Tags":"City","Weather Factors":"Unknown","Case Number":"16847","trends":["There have been 68 other sightings in Charlotte","There were no other sightings in Charlotte on or around May 3rd 2009"],"Date of the Event":"05/03/2009 03:50 UTC","City":"Charlotte","divs":["sighting detailsobject was black- showed up big-was not far away. i was on park road coming from downtown direction. when got in left turn lane to go to south park saw object in sky behind new condo building over trees(slightly to my left) or least it appeared to be over the trees. was not very far above the trees. it did not move. i glanced away and looked back and it was com;pletely gone. i thought it was odd that a flying maching that was so big and hovering in a way that appeared not to be even moving could get away so fast. i continued on to phillipos place on fairview road. when i turned into phillips place at the dean and deluca entrance there it was again slightly to my left over the trees behing more condos. it did not move and this time i glanced away and same thing happenened. when looked back it was gone. i ckd along park road later to see how far back the trees go. the next road back is sharon view but i think it was over the trees behing the big condo before get to sharon view and in that area are some pylons with an opening for the pylons cut through the trees. when i saw it the first time i thought was a balloon of some sort tho i had never seen a balloon like it and the form was completely different from any balloon i had ever seen. if someone wants to contact me it will be ok. i used to go to mufon meetings. or also if anyone has seen anything similar i would like to hear about it. thanks [cms\\tg\\pid]"],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/16847.html.txt","/var/www/straped/mufon/org/16847.html"],"Region":"North Carolina","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.235377,+-80.836917(16847)&iwloc=A&hl=en\"> mufon case (16847) map </A>","Date Submitted":"05/03/2009 03:50 UTC","Summary":"Looked like rounded egg with small rectangle on back.","Object Features":"Unknown","Source":"MUFON","Country":"United States","Log Number":"US-05092009-0005","Longitude":"-80.836917","Sighting Duration":"Undisclosed","Object Shape":"Other","Object Flight Path":"Stationary","Latitude":"35.235377"}