{"Date Submitted":"05/09/2009 04:30 UTC","Object Features":"Unknown","Country":"United States","Source":"MUFON","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around May 9th 2009"],"Object Shape":"Circle","Latitude":"32.226063","Sighting Duration":"Undisclosed","Log Number":"US-05092009-0009","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Weather Factors":"None","Longitude":"-110.919689","divs":["Sighting Details On Saturday May 9th 2009 at 1630 my wife an I were at a park in downtown Tucson Arizona. It was a bright sunny day with no clouds. We laid down to enjoy the day and we both spotted plane flying over head. It was a normal passenger plane. We are near an Air Force base and an International airport. My wife and I are under a pine tree. The plane disappears into the braches, and then we spot a very small yet super shinny object up In the sky. It seemed to be higher than the plane and further away. The plane crossed between us and the object in our field of view. The object was stationary. I thought it was an astronomical event, maybe Venus shinning very brightly for some odd reason. So we did not try and find the plane after it flew over the tree we were under. But neither of us ever saw it again. The UFO stayed in its position for approximately 15 minutes. After a while we both had taken our eyes off of it, only too look back to its location and not see it there. Instead it was heading northeast at a decent pace, blinking like a light. Its speed was maybe a little faster than a cruising passenger plane. However we could not judge its altitude well. It flew too far away and out of sight for us. We did not have a video or picture abilities with us. My wife and I were surprised and proceeded to try and interpret what we had saw. Then after we were digesting what we had saw, we looked back up and she spotted two more objects that were the exact same luminosity and size. They were floating very slowly in the same direction as the previous one. They floated away over a period of ten minutes and out of view, however they never blinked or sped up. My wife and I did not spot anything else that day."],"Viewing Distance":"Over One Mile","Case Number":"16851","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.226063,+-110.919689(16851)&iwloc=A&hl=en\"> mufon case (16851) map </A>","Summary":"Three shiny objects over Tucson, AZ.","City":"Tucson","Date of the Event":"05/09/2009 04:30 UTC","Region":"Arizona","files":["/var/www/straped/mufon/html2text/16851.html.txt","/var/www/straped/mufon/org/16851.html"]}