{"Longitude":"-81.762064","map":"<A HREF = \"http://maps.google.com/maps?q=36.881503,+-81.762064(16857)&iwloc=A&hl=en\"> mufon case (16857) map </A>","Object Shape":"Circle, Sphere, Star-like","Weather Factors":"None, Does Not Apply","Log Number":"US-05102009-0003","Latitude":"36.881503","files":["/var/www/straped/mufon/html2text/16857.html.txt","/var/www/straped/mufon/org/16857.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","City":"Saltville","Date Submitted":"05/10/2009 05:30 UTC","trends":["There have been no other sightings in Saltville","This sighting has never been favorited."],"Object Features":"Unknown","Country":"United States","Summary":"Wierd lights in the night sky around my house.","divs":["Sighting DetailsHi my name is Kevin and at 5:30am Sunday May 10th, 2009 i was outside smoking a cigerette, when i looked up from the corner of my house and saw a bright white light traveling south-west from my property at big tumbling creek, outside of saltville va. this very bright light did not flash, flicker, nor pulsate. it was a constant light. the really strange part is as soon as i started to really focus on it, it went dark!! it was as if, it realized i noticed it and shut it's light off! i've been a avid skywatcher for some time now and i know what planes and etc look like and the types of flashing lights on different parts of the planes and helicopters. This was no conventional aircraft. It was lower to the ground than lets say a airliner, made no noise. whats really strange is around this time last year i witnessed something very similiar, last year i was fooling with a sensor light on the side of my house, pushing the sensor upwards with a broom stick because its high up at the eve of my roof and seen a solid white light, a sphere or globe, etc.it was halfway between a airliner flying height and the ground. It was huge!! if you put a nickel at arms length up to the sky,...that was the size of it!! just a solid white light, it was round or a sphere, i couldn't tell. It made no noise as well. It flew right over my head (which was when i noticed it) and it flew north-east. I watched it till it went over the mountain range which took i'd say 10 to 15 seconds but, it felt like forever seeing as how i was fascinated and shocked watching it!! Both times i haven't had a camera ready. my camera doesn't take good pics at night sky wise but it would have taken a good pic etc of the time last year since it was so bright! it was almost like watching the moon flying by!!! NO JOKE. This report probably is all jumbled and out of order, lol sorry about it i'm just excited at the moment seeing it just happened a few minutes ago lol last year i had witnessed 2 other things a few days after the initial sighting. i tried to take a pic of it but it didn't take. one was something pretty big and was down in the valley floating towards the other mountain. there is no way a plane would be down at around 100 to 150 feet above my neighbors house. i live in a valley and the 2 mountains are wayyy to close for that. it was silent as well. it had numerous lights on it that didn't blink, they were yellow in color. then a week or so after that i road up the road from my house to a pop machine in a campground close by and as i turned around i noticed something orange in color right above my house! it was no more than 100 feet. it floated towards a hill close by my house and disapeared in the tree line. there was no noise as well. the peculiar thing with that one was a minute or so after it dissapeared in the tree line i saw some sort of aircraft come from that way, heading back the other way. when i seen it i heard it. but, it made no sense. that left me truly confused. it almost looked like a flare, which maybe it was, but i only say that because of the color and it sort of looked like a firey light. but how it went from one thing and then turned around behind a tree and was i'd say 50 feet higher and made noise i don't understand. that probably made no sense, i'm sorry but it's hard to explain at the moment"],"Case Number":"16857","Source":"MUFON","Object Flight Path":"Straight-line path,Path with directional change,Other","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unresolved","Date of the Event":"05/10/2009 05:30 UTC","Region":"Virginia"}