{"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/16869.html.txt","/var/www/straped/mufon/org/16869.html"],"Log Number":"ES-05112009-0004","Object Flight Path":"Straight-line path,Path with directional change","Region":"Beni","Source":"MUFON","Latitude":"-13.88904","Date Submitted":"04/27/2009 03:50 UTC","Country":"Bolivia","Longitude":"-63.876949","Weather Factors":"Windy","Object Features":"None","Disposition":"Unresolved","Tags":"City","Date of the Event":"04/27/2009 03:50 UTC","Sighting Duration":"00:02:00","Case Number":"16869","City":"Puerto del Carmen","trends":["There have been no other sightings in Puerto del Carmen","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=-13.88904,+-63.876949(16869)&iwloc=A&hl=en\"> mufon case (16869) map </A>","divs":["Sighting DetailsI was on vacation in the Canary islands, Lanzarote, town of Puerto del Carmen. At the time of the sighting I was relaxing back on a balcony, listening to music and looking up at the sky. I was wearing sunglasses. There were a few puffy white clouds moving from the north-east to the south west. The first object simply drifted into my field of vision. It was a white sphere, and looked about the size of a pea held out at arms length. It was bobbing about in the air, but I could see the passing clouds above it, so it was beneath the cloud base. When I saw it first I immediately thought it was either a bird like a gull, but I didn't see any wings or flapping - the object retained its spherical appearance. Then I thought it was either a child's balloon, or maybe a plastic bag, but then I noticed it was moving in a random fashion *against* the prevailing winds. The clouds above it (I would estimate at 6000 feet) were moving from the NE to the SW, but this object was moving in a generalNE direction. I called my partner who spotted it after a few seconds. I was still trying to make out if it was in fact a weather balloon (I've seen those before, I know what they look like), when I noticed a 2nd, identical white spherical opject, moving a dead-straight line from the SW to the NE. This object had the identical appearance to the first, but it was moving like a satellite - like it was on rails. It too was beneath the clouds, and moving in the opposite direction to that which the clouds were blowing. For a moment I wondered if I was possible seeing the ISS or something like that, but I immediately dismissed that as the object wasn't reflecting light or giving off any light of its own, and besides it was beneath the clouds too. I was excited, and torn between going inside to get my camera, or staying and watching. I regret that I decided to stay and watch. The second, straight-moving object continued on its NE track and was soon obscured by the roof of the building, and I didn't see it again. In all, it was visible for about 15-20 seconds. The first object continued on its slightly random, bobbing course, but definitely moving to the NE too. It bobbed and floated against the clouds, and eventually it too was gone over the roof of the building in the same direction as the 2nd object, and I didn't see it again either. I talked to my partner about this sighting, and he also said that he was very puzzled by it; he too didn't think it was a bird, or a balloon. He really thought it was man-made, but he couldn't explain why there were no wings or blades or any feature at all on the objects - he agreed with me that they appeared perfectly spherical. I estimate the clouds were at about 6000 feet, and the objects were beneath the clouds, perhaps at 5000 feet. From their apparent size, I would guess that on the ground they might be the size of a small car, no bigger. The objects appeared completely featureless; no marks, no lights, no appendages of any kind that I could see. If I didn't know the were moving against the wind, I would immediately surmise they were white balloons, like weather ballons. I know that there are different wind directions at different altitudes, but I'm sure these 2 objects were at the same altitude, and yet their movements were so different; one bobbing and floating, and the other absolutely dead-straight, steady speed. Although Puerto Del Carmen is quite close to Ariciefe International Airport, and there was constant air-traffic througout our stay, I didn't see any other aircraft in the sky at the time of the sighting. I ocaisionally do some backyard astronomy from my home in Ireland, and I've seen satellites, I've seen weather balloons, and once before, in the early 1990s I watched what I thought was a satellite moving in a slow track over my house; abruptly stop; describe a neat circle anti-clockwise, then extremely rapidly shoot off in the opposite direction from which it came, clearing the horizon in about 20 seconds."],"Object Shape":"Sphere","Summary":"2 small white spheres travelling in the same direction, against prevailing winds."}