{"Source":"MUFON","trends":["There have been 3 other sightings in Jacksonville Beach","There were no other sightings in Jacksonville Beach on or around May 9th 2009","This sighting has never been favorited.",""],"divs":["sighting detailswe had just finished having dinner and went to this out door bar to enjoy the ocean air. we had just found a table to sit at, and at exactly 11:29pm (may 11th, 2009i noticed a eraser sized, white\\yellowish object moving in the sky. my seat was facing west, my back against the beach. my friend brent and robert were also at the table...robert didn't see the object, but brent did (he was facing in a general sw direction). my first reaction, i looked at robert...brent's reaction was the same....then we looked at each other and saw the look on each others face. then we looked around, and it was as if no one saw anything. it was quite the experience....and we were just amazed that we saw it. also, it was as if we were the only ones to see it. and, to guess at how the object moved, i would have to use the coast line as a reference. with this, it made a \"less than symbol\" zag and then changed direction again, and shot off in a general nw or wnw direction, and then was instantly gone. to answer another question...in terms of what we thought when we saw it, we were both very amazed. in my own mind, i've never really seen any evidence first hand....so now that i've seen it, i'm sure its a technology that isn't of this world, and\\or that hasn't yet been released. also in regards to my first reaction to this light was it's size and brightness. it was very much larger than any stars, and very much brighter than anything, but the moon. its speed amazed me very much. its agility surpasses anything i could even imagine we (as a world community) has ever developed. and lastly, 'how we lost the object' was after it changed direction (the last time)....it seemed to just to accelerate and fade away. unfortunately we have no pictures, it happened way too fast for us to react other than just seeing it."],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"05/09/2009 12:00 UTC","Disposition":"Unknown","Log Number":"US-05112009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=30.287042,+-81.395034(16868)&iwloc=A&hl=en\"> mufon case (16868) map </A>","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"30.287042","City":"Jacksonville Beach","Sighting Duration":"Undisclosed","Date Submitted":"05/09/2009 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/16868.html.txt","/var/www/straped/mufon/org/16868.html"],"Summary":"UFO at The Sea House Oceanfront Inn. on Atlantic Beach, Jacksonville FL.","Country":"United States","Case Number":"16868","Region":"Florida","Longitude":"-81.395034"}