{"divs":["Sighting DetailsMe and 2 friends went outside to have a cigarette on my front porch, since I've seen dozens of ufo's in the last year we had our eyes glued to the sky like usual. It was very clear out no clouds at all. I noticed a flashing yellow light near 2 stars so I laerted my friends, but when they went to look the flashing light was gone but about 20 seconds later it re appeared traveling in a different direction than before we all saw it for about 40 seconds and then it completely dissapeared. It was traveling to slow to be a plane plus it just completely dissapeared. I knew it was a UFO's because I've had several experiences with UFO's. We went back inside to watch some tv and returned back outside an hour later thats when we saw another UFO I've seen a few like this one before. It was a solid yellowish white star like orb but it was way to close to be a star and it was way to high to be any aircraft that I know about. It was traveling in one direction and kind of zig zagging and in a split second it started going in a completely different direction and went over top of my house. I wasn't really fazed by the sighting as its almost becoming a natural occurrence for me but it was one of my friends first time seeing one so we were pretty excited about that. I've thought about reporting all my other sightings but alot of it is to overwhelming. This is my first report and I plan on reporting any further sightings."],"Weather Factors":"Unknown","Source":"MUFON","Region":"Ontario","Sighting Duration":"Undisclosed","trends":["There have been 9 other sightings in Barrie","There were no other sightings in Barrie on or around May 11th 2009"],"Tags":"City","Object Features":"Undisclosed","Latitude":"44.37995","City":"Barrie","Case Number":"16876","Log Number":"CA-05112009-0011","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=44.37995,+-79.696816(16876)&iwloc=A&hl=en\"> mufon case (16876) map </A>","Object Flight Path":"Undisclosed","Summary":"Solid yellow/white like a star, moving way way faster than an airplane, changed directions several times, zig zagging.","Date of the Event":"05/11/2009 09:30 UTC","Viewing Distance":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/16876.html.txt","/var/www/straped/mufon/org/16876.html"],"Country":"Canada","Date Submitted":"05/11/2009 09:30 UTC","Longitude":"-79.696816"}