{"trends":["There have been 6 other sightings in Yreka","There were no other sightings in Yreka on or around May 11th 2009","This sighting has never been favorited.",""],"City":"Yreka","Weather Factors":"Unknown","Summary":"Silent blurry white light","Date of the Event":"05/11/2009 10:30 UTC","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/16888.html.txt","/var/www/straped/mufon/more/16888_submitter_file1__PassGTrackLargeGraphic.jpg","/var/www/straped/mufon/more/16888_submitter_file2__PassGTrackLargeGraphic2.jpg","/var/www/straped/mufon/org/16888.html"],"Object Shape":"Sphere, Other","divs":["Sighting DetailsI was sitting in my hot tub gazing up into the night sky watching for the usual meteors and satellite. I noticed a blurry white light moving slowly and silently in a straight line from the west to the north-east towards the city Klamath Falls. It appeared to be about 12 to 15 miles away from my viewing spot. I quickly got out of the hot tub and asked my wife to come outside to see it too. I then ran for the binoculars and looked at the object. It continued its slow northeasterly path and it remained a soft blurry white light. I watched it until it faded out of site. I did not see any green or red navigation lights or any strobe light. It was too large to be a satellite, and I'm convinced it was not a jet or prop driven airplane, keeping in mind that it made no sound. It was a perfectly clear night sky, no clouds, haze or moisture in the air. I am pretty convinced we spotted a UFO of some kind."],"Date Submitted":"05/11/2009 10:30 UTC","Viewing Distance":"Over One Mile","Object Flight Path":"Straight-line path","Region":"California","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.736649,+-122.630051(16888)&iwloc=A&hl=en\"> mufon case (16888) map </A>","Tags":"City","Log Number":"US-05122009-0005","Latitude":"41.736649","Longitude":"-122.630051","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"16888"}