{"Case Number":"16887","Source":"MUFON","Summary":"Two flying objects, flashing and traveling erraticaly before dissapearing.","Disposition":"Unknown","divs":["sighting detailsi was driving along u.s. 52 from portsmouth to my home in west portsmouth. i was excited about the weather because the stars were quite visible in the night sky. earlier in the night, i had considered doing some late-night observing, but i remembered the telescope at the local planetarium is currently being repaired \\ serviced. i noticed the first flying object as i was leaving portsmouth, headed toward west portsmouth. the object caught my attention because of its large size, low altitude, flashing lights, and slow speed. there were several instances in which the craft stopped completely. the lights beneath the craft seemed to behave somewhat erratically. i slowed my car and watched from the side of the highway for several minutes. the first craft (ufo1 in my drawings) appeared to stop over the sky several times and change the patterns of the lights underneath it. i saw ufo1 for the longest duration of time (probably 6 minutes) before it disappeared from view. around 4 minutes from the time of the initial sighting, i spotted the second craft (ufo2) which was exactly the same size and shape and exhibited the same lighting patterns beneath. ufo1 seemed to stop moving in the sky at least twice. however, ufo2 only seemed to stop once before redirecting and following ufo1. i aggressively followed ufo2, attempting to keep track of it and get a better look. unfortunately, it seemed to completely disappear after passing over a ridge. there was no detectable sound emitted from either craft. i have included two maps, as well as an animated gif showing the light pattern."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.731743,+-82.997674(16887)&iwloc=A&hl=en\"> mufon case (16887) map </A>","Object Features":"Other","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Log Number":"US-05122009-0004","trends":["There have been 6 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around May 12th 2009","This sighting has never been favorited.",""],"Object Shape":"Boomerang, Triangle","Longitude":"-82.997674","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Region":"Ohio","Date Submitted":"05/12/2009 01:05 UTC","Sighting Duration":"Undisclosed","Latitude":"38.731743","files":["/var/www/straped/mufon/html2text/16887.html.txt","/var/www/straped/mufon/more/16887_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/16887_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/16887.html"],"Country":"United States","Date of the Event":"05/12/2009 01:05 UTC","City":"Portsmouth"}