{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.437962,+-79.695975(16880)&iwloc=A&hl=en\"> mufon case (16880) map </A>","Latitude":"40.437962","Disposition":"Unknown","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around April 4th 2009","This sighting has never been favorited.",""],"Object Shape":"Chevron","Case Number":"16880","Log Number":"US-05112009-0015","Summary":"PA-Reflective daytime V-Shape (Chevron) 1/2 inch at arm's length, tumbled slowly.","Date Submitted":"04/04/2009 11:46 UTC","Country":"United States","Date of the Event":"04/04/2009 11:46 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/16880.html.txt","/var/www/straped/mufon/more/16880_submitter_file1__V-shape4-4drawing.jpg","/var/www/straped/mufon/more/16880_submitter_file2__V-shape4-4A.jpg","/var/www/straped/mufon/more/16880_submitter_file3__V-shape4-4B.jpg","/var/www/straped/mufon/org/16880.html"],"City":"Murrysville","divs":["Sighting DetailsMurrysville, PA - 11:46 am. I had slept in on that Saturday morning because everyone was gone early. I was drinking my coffee and strolled over to the living room patio door to check the weather outside since I could see the trees in the valley blowing pretty hard. I was thinking to myself, \"This probably would be a great day to fly a kite\". Just as I thought that, a glint of metallic or reflective something caught my eye up. I couldn't believe it! I kept squinting & blinking my eyes hard to clear them. I said, \"What the...\" It was a V-shaped object below the clouds, tumbling slowly. I wondered it someone's kite or balloon got away, so I turned around to grab my binoculars off the bar to check it out. In the second or two it took me to grab the binoculars and spin around, it was gone! I thought, \"WOW, that must have been another UFO!\" (We've seen quite a few different kinds here especially since last year) So, I grabbed my camera, looked, didn't see it, but decided to take a few pics anyway in case it reappeared. It did, half minute later, but it was drastically farther away in that short period of time AND to the left of where it was, judging by how much smaller it was. The 'kite' would've had to go against the wind to go where it did. The 1st pic is of where I first saw it with drawing added of what it looked like. The 2nd and 3rd pictures are the ACTUAL pics of it with blowups enhanced. The 4th pic I took after it went out of view but I look a pic anyway, and, after zooming in and looking around, found this little speck that might be it far away (can't upload it because only can do 3). I wasn't going to post it because, a) the pics are not too clear, b) we've reported so many people might think we're 'kooks'... but my family thinks it's better than no pictures and that others might have seen the same thing."],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-79.695975","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Source":"MUFON","Object Features":"Undisclosed"}