{"Tags":"City","Viewing Distance":"Unknown","Country":"United States","Longitude":"-70.247226","Disposition":"IFO","City":"Portland","Sighting Duration":"00:10:00","Date of the Event":"07/08/1990 10:50 UTC","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.667701,+-70.247226(16886)&iwloc=A&hl=en\"> mufon case (16886) map </A>","Log Number":"US-05122009-0003","Region":"Maine","Latitude":"43.667701","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around July 8th 1990"],"files":["/var/www/straped/mufon/html2text/16886.html.txt","/var/www/straped/mufon/org/16886.html"],"divs":["Sighting DetailsI believe the year was 1990. It was summer, probably July. About 11PM. I had driven come from work to my parents house in Lebanon, Maine. I looked up at the sky to see if I could find the bigger dipper. While locating it, I saw what I thought was a shooting star. Then another shooting star took off where the last one ended (The light would shoot across the entire sky and then disapear... it looked just like a shooting star... same size, light intensity, shape,speed, apparent distance to the eye, and color). However, it could not be a shooting star because the next one always took off where the last one ended. The pattern was erratic. sometimes it would take off at a 90 degree angle from the last flight path and other times 180 degrees. It zoomed across the entire skyline in a matter of 1 to 2 seconds... amazingly fast... too fast for anything man made and making direction turn that would be impossible at such speeds. After about a dozen or so of these lights across the sky, it took off past the tree line and did not reappear. I stood there stunned for about a half an hour before giving up on seeing it again. My mother's friend, a 70+ year old lady told her about seeing it that same night (I never told my mom ... or anyone... until my Mom mentioned this lady telling her... I thought people would think I was crazy). I have never seen anything like that in my whole life (I was 17 at the time and I am now 36). It was amazing and even with my scientific mind, I cannot explain what it is that I saw that night. I've tried to rationalize it many times and I just can't explain it... but I saw it and it was real."],"Object Shape":"Star-like","Summary":"Shooting star looking object(s) darting across sky several times.","Date Submitted":"07/08/1990 10:50 UTC","Source":"MUFON","Case Number":"16886","Weather Factors":"Unknown"}