{"Summary":"Yellow/white light heading Northwest to Southeast.","Disposition":"Insufficient Data","City":"Pekin","trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around May 11th 2009"],"Date Submitted":"05/11/2009 09:20 UTC","Region":"Illinois","Country":"United States","Object Features":"None","Object Shape":"Circle","Log Number":"US-05112009-0017","Source":"MUFON","divs":["Sighting DetailsMy brother and I had just finished watching UFO Hunters, ironically, and we decided to step outside to have a smoke. The sky was perfectly clear and you could see alot of stars. As we were talking, I noticed a bright yellow light coming at us from the Northwest, it was flying to the Southeast in a straight line, but it was wobbling in a calculated left to right shift in very short, calculated bursts. There was absolutely no sound, and this thing was moving fast. It was definitely not an airplane or anything like that. It had no flashing lights. It could have possibly been a satellite or the space station, but I don't think that is the case, because of the left and right short shuffle motions it was making. We watched it for about 3 minutes before it disappeared over the rooftops continuing on it's Southeast path. I wanted to go in and get my Nitemax camcorder and MiniDV recording unit, but I knew that by the time I got back in, it would have passed by because of it's speed. We opted to just watch it. We made note of the trees, and the stationary stars, and you could clearly see the wobbling motion it was making by looking at the stationary objects and viewing the object from our peripherals. We're not quite sure what it was, but it definitely wasn't an airplane or a balloon. And at one point in it's path, it's light intensity increased to a bright whitish blue. Would like to know if anyone else witnessed it in the area."],"Case Number":"16882","Longitude":"-89.632548","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/16882.html.txt","/var/www/straped/mufon/org/16882.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.570099,+-89.632548(16882)&iwloc=A&hl=en\"> mufon case (16882) map </A>","Object Flight Path":"Straight-line path","Latitude":"40.570099","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"05/11/2009 09:20 UTC","Viewing Distance":"Unknown"}