{"Latitude":"44.306172","Date of the Event":"05/06/2009 09:15 UTC","Log Number":"US-05122009-0010","Region":"New Hampshire","trends":["There have been 4 other sightings in Littleton","There were no other sightings in Littleton on or around May 6th 2009"],"divs":["Sighting DetailsI live on the third floor of my apartment building. It has 4 windows facing the mountains to the south and west, and also the river behind main st. I had just put my children to bed around 9:15pm, and went out side to sneak a smoke, when I heard what sounded like a very low rumble, maybe a jet ( not uncommon for jets to make a once over around here) I looked up and saw a small twinkling light moving very quickly (south across the sky directly over main st. but as i was watching it, the light would go out completely and (still flying in the same direction) would show up again about 5 seconds later. I thought that was weird but didn't think much of it. Was probably a plane, though I had never seen one act like that before. I went back inside and put on a movie. About 10 minutes later, I heard the low rumble again, and noticed that the same twinkling light was coming back again from the east but this time it was very low, about 100ft? above tree line. The light did not blink out as it had before but moved in a very straight line from east to west and was going much much slower than before. It went out of sight so I sat back down to watch my movie. Then I guess 3-4 minutes later I got up to used the bathroom and happened to look out the window. What I saw caught me off guard. I saw three very large lights like spotlights or headlights straight ahead of my window. They were lined up horizontally and just hovered. It looked, from my perspective, that they were right over a nunnery that overlooks the river. I thought for sure that twinkling light I had seen earlier was now headed on a collision course with my apartment! Except the lights never got bigger as if it were getting closer. It just stayed in the same place for about 30 seconds or so. I don't know how long it was there to begin with but I felt like it knew I was watching it. Very quickly the bright lights seemed to dim into much smaller ones with soft blue lights in between and a bright almost neon green aura around it( it maybe 1 craft or two and one just turned off it's lights.They were so bright I could not tell if the smaller one was there before.) It was circular with one large middle light that was white, and two smaller lights on either side of it that had a bluish tint then two more smaller white lights on the outer edge. The green aura looked like it just outlined the craft and was pulsating or glowing. The rest was black. It looked like the lights were rotating(I drew pictures hopefully i can upload by the end of the week) It moved at a snails pace toward the river to the west. I watched it for at least a full minute before it just seemed to disappear. I looked around for it because I know that planes can't do that, so it had to go somewhere. As I looked around I saw a single tiny red dot hovering at least 75ft over the river behind my apartment directly under the moon. It stayed there motionless so I thought my eyes were playing tricks on me but there was no reflections of anything red coming from inside my apartment. Anyway I watched it for maybe 15-20 seconds then all of a sudden it went straight up in the air! Slowly at first then faster. It stopped right dead center of the moon then came flying right over my apartment. These objects made no sound! It was early in the evening so the moon was still pretty low, it was also a very clear night no clouds in the sky at all."],"files":["/var/www/straped/mufon/html2text/16893.html.txt","/var/www/straped/mufon/org/16893.html"],"Object Shape":"Circle, Flash, Star-like, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.306172,+-71.770088(16893)&iwloc=A&hl=en\"> mufon case (16893) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Tags":"City","Disposition":"Unknown","City":"Littleton","Country":"United States","Date Submitted":"05/06/2009 09:15 UTC","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Longitude":"-71.770088","Source":"MUFON","Case Number":"16893","Summary":"Three bright lights just above the tree line and smaller object with lights and green halo.","Sighting Duration":"Undisclosed","Weather Factors":"Medium","Object Features":"Other, Unknown"}