{"Date of the Event":"05/12/2009 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.972278,+-76.721845(16899)&iwloc=A&hl=en\"> mufon case (16899) map </A>","Summary":"ball of light, i thought was plane until an actual plane flew over at same time.CLEAR difference. Too high to be helicopter","Object Flight Path":"Undisclosed","Sighting Duration":"00:05:50","City":"York","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date Submitted":"05/12/2009 09:15 UTC","Tags":"City","divs":["sighting detailsalright \\x\\ it is 9:26 as i am re-typing this. at 9:15 pm est i took my dog outside, i live in adams county pa and i looked up and saw this bright [cms\\tg\\pd] light, and i thought nothing of it. i hear a few cars go by, and some crickets. no big its a nice night. =p so i keep looking at this bright light and its moving really fast. so i stare at it neglecting my dog and i see this streak of light come off of it, then im like \"alright what am i looking at?\" so the thing that came off of it disappeared, and i continued looking at the fast moving light. and im like \"no this has to be a plane, and the setting sun is reflecting light off of it\". ya know? trying to be rational =p. and as it passes over head, i listen close and i hear no sound at all. then i see something else in the sky (the sun is still making a small amount of light on the horizon) and i quickly realize \"oh its just a plane.\"....\"oh its a plane!!\" because there was no light \"reflecting\" off of it. so i look back at this bright [cms\\tg\\pd] light and its been about 30 seconds since it had passed over head and seemed to be quite a distance away from where i was standing. and still i head no sound other than the plane that had also just passed over.(( the distance and angle between the two objects allowed me to discern which sound would have come from which object. its kind of hard to explain due to \"no pictures\".)) but taking into consideration that planes usually fly about 40000ft, the object i was looking at was well over 60000. i came to this conclusion because i compared their overall size to the size of the stars as they passed. its a rough guess, but its as good as i could do. i was going to go listen to the police scanner, to hear if there were any eye witnesses, but the antenna was broken. ;_;. i posted this on 4chan. i wrote it to get a few laughs, then someone told me about this site. ill add to it now. the object was flying in a straight line and flew too far away, so i could no longer see it. my feelings were, that of belief. =p i would have taken pictures, but i didnt want to miss a second."],"Longitude":"-76.721845","Disposition":"Unknown","Object Features":"Undisclosed","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around May 12th 2009"],"Region":"Pennsylvania","Case Number":"16899","Country":"United States","Latitude":"39.972278","Log Number":"US-05122009-0015","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/16899.html.txt","/var/www/straped/mufon/org/16899.html"],"Source":"MUFON"}