{"Source":"MUFON","Date of the Event":"05/01/2009 09:11 UTC","Sighting Duration":"00:00:01","map":"<A HREF = \"http://maps.google.com/maps?q=34.87514,+-111.75971(16891)&iwloc=A&hl=en\"> mufon case (16891) map </A>","Object Flight Path":"Undisclosed","Region":"Arizona","Country":"United States","Longitude":"-111.75971","Case Number":"16891","Date Submitted":"05/01/2009 09:11 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16891.html.txt","/var/www/straped/mufon/more/16891_submitter_file1__UFOsPicAZ.TRIP.SEDONA.2009146.jpg","/var/www/straped/mufon/org/16891.html"],"Object Features":"Undisclosed","Object Shape":"Oval","divs":["sighting detailshi, the photo was taken a couple of weeks ago from the breakfast area of the king's ransom hotel in sedona, az at 9:11am on 5\\1\\09. i have to say that it was taken through a window(dark spots, most visible in the sky area, are dirt from window), but there were no lights on inside the room to cause a reflection that results in the bright \"objects\" seen in the sky area of the photo. additional things to take note of when viewing this photo are: -slight cloud cover that day\\overcast -taken with an iphone, which is only 2 mega pixels(but almost 200 additional pictures were taken with the same phone on this trip and none resulted in any light objects\\artifacts that are seen in the sky on this photo) **also, one of the benefits of the phone is that it captures crucial meta data(i.e. date, time, location etc..) within the file, which can be viewed by right-clicking(on pc) properties\\summary. -also important to note that i did not see these objects with the naked eye at the time the photo was taken. i was only when i looked at them a couple of days later that i noticed them. obviously had i seen them, i would have more to share because i would keep clicking until i ran out of storage. let me just say that i am still not sure what they are, and am a bit of a skeptic, but this definitely got me thinking and i would be interested to see other people's take on it. if they are ufos, they seem to be in a similar formation\\pattern as many of the other pictures taken in the arizona skies and all over the world. this seems like a very good forum on this and would like to see if there was anyone else in the sedona area that day that witnessed, or have pictures, of this as well. thanks"],"Disposition":"Unknown","Summary":"Picture taken of mulitple objects in sky over Sedona 5/1/09.","Weather Factors":"Unknown","Log Number":"US-05122009-0008","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around May 1st 2009","This sighting has never been favorited.",""],"Latitude":"34.87514","City":"Sedona","Tags":"City"}