{"Weather Factors":"None","City":"Rochester","Region":"New York","Case Number":"16890","Object Features":"None","Disposition":"Unknown","Date of the Event":"05/11/2009 07:48 UTC","Summary":"Large, bright ball, appeared at high speed from sm. cloud, shot off and blinked out.","Log Number":"US-05122009-0007","Latitude":"43.16293","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.16293,+-77.603572(16890)&iwloc=A&hl=en\"> mufon case (16890) map </A>","Object Shape":"Circle","Sighting Duration":"Undisclosed","Longitude":"-77.603572","Date Submitted":"05/11/2009 07:48 UTC","Source":"MUFON","Country":"United States","Tags":"City","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/16890.html.txt","/var/www/straped/mufon/org/16890.html"],"trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around May 11th 2009"],"divs":["Sighting DetailsI was driving a client home at 7:48PM tonight. (Monday, May 11, 2009.)We were about to stop for a red light when I looked at my dashboard clock. IT was 7:48PM.I was early getting this client home. I'm always checking out the skies whenever I stop the car. We had beautiful skies all day long and I took notice of it. At the time of this event, the sky had several flat, wispy clouds in the south western sky. As we stopped for the red light, I had a clear view of the sky and looked up. We were stoped at the traffic light at the corner of Browncroft Blvd and Winton Road, Rochester, NY, We both saw a plane in the distance taking off from the Rochester Airport, low in the sky, ascending upward and flying slightly south-easterly, turning more easterly and starting to climb to cruising altitude. I said to Arlene, my passenger, \"I wonder where they're going at 8 o'clock at night?\" I then felt the \"need\" (urge) to look above and to the right of that airplane, where I saw a large bright round ball of light come right out of the clouds very abruptly, heading north-easterly and moving fast. It was moving about one and half times faster then the airplane. It was heading to what looked like the same direction of the airplane, but a bit more south-easterly. (if the ball of light had continued in that direction, in a very short time it would have been parallel to the plane, but at a higher altitude. At first I thought it was another airplane coming in for a landing from the south, and that the setting sun was hitting it and lighting it up to look like a ball of light. It didn't act like a regular airplane though, so I held my hands up to it and closed both thumbs and both index fingers together to form a circle, and it was about that size and round, like a bright ball. I asked Arlene if she could see it and she said no, because there was a tree across the street in her sight of vision. Just as I asked her that question, the ball stopped dead and turned sharply at a right angle to its left, my right(westerly). I watched it head west for several seconds at a very high rate of speed, and then it just blinked out against a clear blue sky. It did not go into any clouds, as there were no clouds in that area of the sky, just blue and clear as it just blinked out. It just disappeared. The traffic light changed and I drove forward about 2 blocks and pulled into a driveway on my right. I looked up, but could not see anything in the sky. Had it been another airplane it would still be in the clear sky and visible by then on a sideways angle without sunlight on it. It would have been visible in the shape of a regular airplane. I have witnessed airplanes do this many times over Monroe County during a setting sun. (A bright light, which turns back into the shape of the airplane after the airplane turns to head to the airport.) I scanned the south-westerly sky all around the area of the first sighting and to the right and nothing was visible except the original plane, on my left, still heading easterly and climbing slightly. This whole event probably took one and a half minutes. By it's actions and speed, I feel this could have been a UFO. I sent a personal email and copy of this report to Mr. James Bouck, Jr., New York State Director of MUFON and he asked that I send it to you, also. You may contact me, however, I will be away May 15-22. End of report."]}