{"Summary":"Super bright white light, starlike, flashed like it had exploded then started moving slowly then disappeared.","Viewing Distance":"Over One Mile","Source":"MUFON","Object Shape":"Flash, Sphere, Star-like","Region":"Michigan","Log Number":"US-05122009-0011","Sighting Duration":"00:00:30","City":"Detroit","Weather Factors":"Unknown","divs":["Sighting DetailsI was outside in my backyard at appoximately 10:50PM having a cigarette, when I looked up at the stars like I always do, It was a clear night so many stars were out. I was noticing the little dipper just above my house. I looked down to give my neck a break and was thinking just how far away the little dipper was in miles from where I was standing. I am not sure why I was thinking about that at the time, I guess my mind was just wandering. Then I looked up again, and to the eastern sky I noticed this super bright white light, At first I thought \"Wow that is the brightest star I have even seen\". It appeared to be far away like in outer space, like the stars. I live near a airport, and I knew that it was not an airplane or any other type of aircraft since there was no running lights (red or green) flashing. I have seen many of airplanes at night, in fact far off in the distance in the northern direction, there were planes flying at the time I noticed this \"unusual\" bright light which was in an area where there were no planes flying. So I stared at this intense light for a good 30 seconds, then it dimmed to almost nothing, and then it started to move slowly in a southern direction. Then it disappeared. At first I thought that maybe it was a exploding star or meteor, but based on what I saw, I came to the conclusion that this was something that was very different. Then I started to think that I maybe what I just saw a UFO. I still do not understand what I saw, but I experienced something I will not forget."],"Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around May 11th 2009"],"Case Number":"16895","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/16895.html.txt","/var/www/straped/mufon/org/16895.html"],"Longitude":"-83.036574","Latitude":"42.334077","map":"<A HREF = \"http://maps.google.com/maps?q=42.334077,+-83.036574(16895)&iwloc=A&hl=en\"> mufon case (16895) map </A>","Object Features":"None","Date Submitted":"05/11/2009 10:50 UTC","Tags":"City","Date of the Event":"05/11/2009 10:50 UTC"}