{"Longitude":"-80.080988","Sighting Duration":"00:00:02","map":"<A HREF = \"http://maps.google.com/maps?q=26.365078,+-80.080988(16894)&iwloc=A&hl=en\"> mufon case (16894) map </A>","Viewing Distance":"Over One Mile","Country":"United States","Region":"Florida","files":["/var/www/straped/mufon/html2text/16894.html.txt","/var/www/straped/mufon/org/16894.html"],"Log Number":"US-05122009-0010","Object Features":"None","City":"Boca Raton","Object Shape":"Bullet, Missile, Cigar","Disposition":"Unknown","Date of the Event":"05/12/2009 10:30 UTC","divs":["Sighting DetailsMy wife and I were sitting on the Boca Raton Beach at 10:30 a.m. on Tuesday May 12, 2009. The sky was clear blue with a few scattered cumulus clouds. Suddenly my wife sat bolt upright staring at the sky and stated she had just seen a UFO. She said she was watching what she (at first)thought was an airplane emerging from a cloud flying horizontally from North to South at conventional aircraft speed. The object suddenly changed direction and speed travelling upward at an almost vertical angle at a velocity so fast that it was literally gone in one to two seconds. she described the object as bullet shaped and larger than the convential aircraft we periodically saw from the same position. We have been Florida residents for 30 years, and are accustomed to seeing all types of aircraft in the local skies including helicopters, blimps, hot air balloons, private general aviation airplanes, commercial jets and military aircraft including Harrier Jump Jets and advanced stealth Bombers and fighters at the annual military air shows. Nothing in our experience comes even remotely close to the flight characteristics demonstrated by this object."],"trends":["There have been 24 other sightings in Boca Raton","There were no other sightings in Boca Raton on or around May 12th 2009"],"Object Flight Path":"Path with directional change","Date Submitted":"05/12/2009 10:30 UTC","Source":"MUFON","Tags":"City","Weather Factors":"None","Summary":"Sighted at 10:30 a.m. from beach. impossible speed and course change.","Case Number":"16894","Latitude":"26.365078"}