{"Summary":"Illuminating light flies across sky while missile fighter jet looking objects intertwine and dissapear.","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"05/12/2009 09:20 UTC","Latitude":"41.309875","divs":["Sighting DetailsWell we were walking about to meet up with some people when I spotted a bright yellow orange light with no apparant shape that just looked like a flying ball of light silently hovering toward the mountain, we watched it flying when all of the sudden these three objects flying in formation (that at first I thought were three fighter jets) appeared out of nowhere and were speeding faster than the other object, going in a different dierction but was within the radius of the other object, it started intertwining in some kind of crazy formation then the three objects dissapered leaving the yellow object alone it started flying towards the mountain and looked like it just hovered for a few seconds then either went behind the mountain out of sight or just suddenly died out. it was like nothing i have ever seen as i was watching and after we seen the object i was just cussing out of excitment and shock. The sighting lasted less than five minutes"],"Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.309875,+-122.310567(16905)&iwloc=A&hl=en\"> mufon case (16905) map </A>","Log Number":"US-05132009-0005","Tags":"City","files":["/var/www/straped/mufon/html2text/16905.html.txt","/var/www/straped/mufon/more/16905_submitter_file1__PassGTrackLargeGraphic.jpg","/var/www/straped/mufon/org/16905.html"],"Source":"MUFON","Disposition":"IFO","Viewing Distance":"Over One Mile","trends":["There have been 6 other sightings in Mt Shasta","There were no other sightings in Mt Shasta on or around May 12th 2009","This sighting has never been favorited.",""],"Weather Factors":"Windy, Medium","Region":"California","Longitude":"-122.310567","Date Submitted":"05/12/2009 09:20 UTC","Object Shape":"Bullet, Missile, Fireball, Star-like, Other, Unknown","Country":"United States","Sighting Duration":"00:05:04","City":"Mt Shasta","Case Number":"16905"}