{"Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Longitude":"-75.381541","Tags":"City","trends":["There have been 4 other sightings in Harleysville","There were no other sightings in Harleysville on or around May 11th 2009"],"Log Number":"US-05132009-0001","City":"Harleysville","Case Number":"16901","map":"<A HREF = \"http://maps.google.com/maps?q=40.282548,+-75.381541(16901)&iwloc=A&hl=en\"> mufon case (16901) map </A>","Country":"United States","Viewing Distance":"Unknown","Region":"Pennsylvania","Object Features":"Undisclosed","Disposition":"Insufficient Data","Summary":"A bright light crossing the sky slowly, no deviation in the light whatsoever, no sound.","files":["/var/www/straped/mufon/html2text/16901.html.txt","/var/www/straped/mufon/org/16901.html"],"Latitude":"40.282548","Date of the Event":"05/11/2009 12:00 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","Date Submitted":"05/11/2009 12:00 UTC","divs":["Sighting DetailsIt was approx 8pm Monday evening, noticed a bright light in the sky, at first I thought it was a plane, as we have plenty of air traffic, but I noticed the light was very bright and it seemed close. As it passed, I thought I would hear a sound but nothing, I also noticed that the light never changed, it stayed constant even though I saw the object coming towards my direction, passing overhead and then moving off away from me. It pretty much followed a straight line, as it was moving off, we had some cloud cover and it seemed to pass through a cloud. I've never seen a plane with a constant light unless it was heading towards or away from me. I usually see with planes a bright light as it heads towards then generally you will see some type of blinking as it passes overhead. It was strange, but I can't say it was a UFO, only that it was odd the way it passed. Based on how bright the light was I thought it was closer to the ground than most planes fly and I was confused because it made no sound and didn't seem to travel all that fast."]}