{"Region":"Colorado","trends":["There have been 13 other sightings in Vail","There were no other sightings in Vail on or around May 9th 2009"],"Log Number":"US-05132009-0006","divs":["Sighting DetailsI am a MUFOM investigator living in Vail and was a my job as a security officer for the Vail Valley Medical Center. I was in a stairwell at the west end of the hospital and there is a window that faces north on the landing between the second and third floors. I was watching the sky for a few minutes as there had been a number of UFO reports in the area when I noticed this white cigar shaped object moving from west to east at about 30 degrees of elevation. UFO was about three quarters of an inch long at arms length and I could not see any wings or tail assembly on the craft. AS it went to the east it entered a small cloud and I felt I should have seen it come out the other side but did not. I did notice an aircraft with a single contrail further to the north and above and behind the UFO that may have been a jet fighter. I guess I had some difficulty realizing what I saw but I did see a similar cigar shaped craft on March 19th, 2004 when I was out in the parking lot at the hospital that traveled the same course. It was during a time when there was a lot of sighting reports out here and I had a sighting the previous day which I reported to MUFON. In both cases the cigar shaped craft reminded me of video shot in Salida in 1995 that was recently shown on one of the UFO Hunters shows."],"Sighting Duration":"00:03:00","Viewing Distance":"Over One Mile","Latitude":"39.647814","City":"Vail","Source":"MUFON","Case Number":"16907","Date Submitted":"05/09/2009 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.647814,+-106.371716(16907)&iwloc=A&hl=en\"> mufon case (16907) map </A>","Summary":"Bright white cigar shaped crossed sky to the north of Vail. Entered small cloud and did not come out other side.","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/16907.html.txt","/var/www/straped/mufon/org/16907.html"],"Date of the Event":"05/09/2009 10:30 UTC","Object Flight Path":"Straight-line path","Object Features":"None","Tags":"City","Weather Factors":"Windy","Disposition":"Unknown","Country":"United States","Longitude":"-106.371716"}