{"Region":"Nevada","Country":"United States","files":["/var/www/straped/mufon/html2text/16919.html.txt","/var/www/straped/mufon/org/16919.html"],"Date of the Event":"05/08/2009 12:30 UTC","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around May 8th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsIt was just past midnight when my roommate and I went outside for a smoke. We live 10 minutes south of the Las Vegas strip. The night was beautiful and clear as the moon shined bright. It wasn't more than 30 seconds into our smoke when I noticed a ball of light smoothly cruising straight for us. The object was very bright, flying at an extremely high altitude. Right away you could tell that this was not man made. I called my girlfriend outside for a third pair of eyes. Her father is a pilot and she has grown up in and around planes all her life. She exclaimed, \"That is definitely not a plane.\" As it cruised directly over our heads, glowing bright like a huge star, it maneuvered in one sharp-angled \"S\" shape. It made quick movements right, left, right and then returned back to its original flight path. I ran into the house, grabbed the flip and filmed a video that does not do the sighting justice. After about 3 minutes the ship had made its way to the outskirts of town, flying parallel with the 15 fwy. Suddenly the bright light turned off. Amazingly, you could still see the ship cruising in the well lit vegas night. About 60 seconds later, still following the same exact flight path, the ship started flashing different colors of white, green, blue, and red. The flashing happened in random order and timing, as if it was communicating with something else. In hind sight I wish we could have gotten better footage of the color changing pattern. Every 20-30 seconds the ship would go dark as if it was receiving transmission, then back to a completely different set of flashing colors. Unfortunately we were not able to see the entire sky from our side yard, so we could not tell if there were any other ships at that time. We were only able to see a narrow strip of the sky right above us, since our view was blocked by the neighboring houses. The sighting lasted 11-12 minutes until it disappeared over the mountains on its way to visit California. In posting this article I'm hoping that someone else has video of the color changes that they could share. I find it hard to believe that we were the only ones that witness such an obvious sighting as it flew directly over the city lights."],"Object Flight Path":"Undisclosed","Object Shape":"Circle, Sphere","Log Number":"US-05142009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=36.122596,+-115.163566(16919)&iwloc=A&hl=en\"> mufon case (16919) map </A>","Case Number":"16919","Object Features":"Undisclosed","Summary":"Large bright light cruising at a smooth fast pace at extremely high altitude began signaling to something else with a code of speratic colorful flashes.","Viewing Distance":"Unknown","Weather Factors":"Unknown","Latitude":"36.122596","Tags":"City","Sighting Duration":"00:15:00","Disposition":"Insufficient Data","Source":"MUFON","Longitude":"-115.163566","Date Submitted":"05/08/2009 12:30 UTC"}