{"Longitude":"-106.723464","Case Number":"16910","Object Shape":"Diamond, Disc","City":"Edwards","Tags":"City","files":["/var/www/straped/mufon/html2text/16910.html.txt","/var/www/straped/mufon/org/16910.html"],"Log Number":"US-05132009-0008","divs":["Sighting DetailsI am a MUFON investigator (Bob Fiske) filing this report for the witness who does not have a computer. Witness related the following to me about her sighting. She woke up about 4:30 AM and noticed bright flashing lights in the sky through her bedroom window, which faces to the north. The window was dirty so she went outside to the landing between the first and second floors of the unit and observed a disc shaped craft to the northwest, north of I-70 taht was flashing red orange white and blue lights around the perimiter. She estimated its size at arms length as to the second joint on her index finger, perhaps one and one half to two inches. At one point the craft dropped a diamond shaped satellite object with red white and blue lights that descended to the ground. She saw the disc depart at high speed to the northwest and when it did a twin rotor helicopter came into view from the west. Helicopter may have been out of the Army high altitude training center at the Eagle County airport some 20 miles west. I called the center and spoke with the CO who said they did not have any aircraft up that early. I have known the witness for two months and she is very creditable."],"Object Features":"Undisclosed","Date Submitted":"05/07/2009 04:36 UTC","Weather Factors":"Unknown","Summary":"Witness woke up at around 4:30 AM and noticed flashing lights to the northwest. She went outside and saw a disc hovering which at one point dropped a diamond shaped satellite object that descended to the ground.","map":"<A HREF = \"http://maps.google.com/maps?q=39.576406,+-106.723464(16910)&iwloc=A&hl=en\"> mufon case (16910) map </A>","Source":"MUFON","trends":["There have been 2 other sightings in Edwards","There were no other sightings in Edwards on or around May 7th 2009"],"Latitude":"39.576406","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary,Hovering then path","Region":"Colorado","Disposition":"Unknown","Date of the Event":"05/07/2009 04:36 UTC","Sighting Duration":"00:05:00","Country":"United States"}