{"Object Shape":"Star-like","divs":["sighting detailshellow all, since 1997 i've been observing ufo's in the night sky's. most of these sightings have been spotted with the use of hi power binoculars. these objects are so high you can't see them with the naked eye. to this day 5\\13\\09,i have spotted at least 1000 (yes that is correct 1000!!).the first time i saw one i was blown away. now i can't stop looking at the sky. iwanted to get a better look at what i was looking at so i bought a pair of super hi power binoculars. what i discovered was that there are even more hi flying ufo's up there, my guess is at least 500,000 feet. you just can't see them with the naked eye. i'm sure many of you have seen these little lights moving across the sky, and i urge you to get a pair some good binoculars because what i saw next is the whole reason i'm writing this report. about two weeks ago i was outside in the backyard of my house hoping to spot more of these little lights moving across the sky. got more than i wished for. 3 (three) small little lights about the size of a far-away star were moving across the sky at a very slow speed. they were traveling from the south moving northwards. their formation was one in the front then one following behind and to the right and the third following further behind and to the left. suddenly the one following at the end picked up speed and moved in closer to the group but was still behind the second. how it picked up speed was amazing. at first it gota very bright glow and in a split second moved form the very back to right behind the group then suddenly stop glowing as bright and back to its normal glow. i was blown away all my hairs were standing on end. i knew exactly what i was looking at. they kept traveling northward until they disappeared through my binoculars. i'm now saving up money to buy a super hi power telescopic camera to send these ufo pictures to the world. i only hope to be as lucky and see another group or formation of ufo's as i did that night. the world will finally have some genuine proof that we are not alone. your friend, for more info email me at miguelbarron72@yahoo.com miguel barron"],"Object Flight Path":"Undisclosed","Tags":"City","City":"Mountain View","Longitude":"-122.075471","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=37.390162,+-122.075471(16914)&iwloc=A&hl=en\"> mufon case (16914) map </A>","Case Number":"16914","Viewing Distance":"Unknown","Source":"MUFON","Summary":"3 UFOs traveling across night sky.","Sighting Duration":"00:01:00","Country":"United States","Object Features":"Undisclosed","Date Submitted":"05/02/2009 01:00 UTC","Weather Factors":"Unknown","Log Number":"US-05132009-0012","files":["/var/www/straped/mufon/html2text/16914.html.txt","/var/www/straped/mufon/org/16914.html"],"Region":"California","Latitude":"37.390162","Date of the Event":"05/02/2009 01:00 UTC","trends":["There have been 10 other sightings in Mountain View","There were no other sightings in Mountain View on or around May 2nd 2009"]}