{"Date of the Event":"05/13/2009 02:50 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.396413,+-80.597911(16918)&iwloc=A&hl=en\"> mufon case (16918) map </A>","Object Shape":"Circle","City":"Cape Canaveral","Disposition":"Unknown","Date Submitted":"05/13/2009 02:50 UTC","Case Number":"16918","Object Flight Path":"Straight-line path","Object Features":"Unknown","Tags":"City","Country":"United States","Longitude":"-80.597911","trends":["There have been 7 other sightings in Cape Canaveral","There were no other sightings in Cape Canaveral on or around May 13th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Source":"MUFON","Region":"Florida","Summary":"UFO was some what stationary at approx 11:30 position very, very high up. Disappeared when jet came near.","Latitude":"28.396413","divs":["Sighting DetailsI was visiting Kennedy Space Center as a chaperone helping with a group of school kids on a field trip. This was 2 days after the recent launch of the space shuttle. After visiting Kennedy Space Center we had taken the kids to the beach at a State Park in the City of Cape Canaveral. We arrived at the beach at around 2:20-2:30pm or so. I had taken my binoculars so I could keep a eye on the kids on the beach. I had also taken a digital camera to take pictures on the trip. While sitting in a chair on the beach watching the kids in the water at about 2:50pm I looked up in the sky and noticed a small shining object that appeared to be very, very high up. The object was straight up over me at about 11:15-11:30 o'clock position as I faced east toward the beach. I first thought it was a jet flying very high, but after a few moments I realized the object was not moving, or if moving, moving very, very slow. I looked at it through my binoculars and the object was still very small even when looking at through the binoculars. Even though small, I could make out a shape. The object was whitish in color and was circle shaped. There appeared to be a very,very thin faint layer of a dark color around the outer edges of the circle. It appeared a little thicker on the side away from the sun, but this dark layer may have been as a result of a visual illusion. Also it appeared that on the top there was a faint image of something protruding up away from the main body of the object, however, I can't be sure here. It was too hard to see any specifics other than the obvious circle shape and whitish color. I looked at it for a minute or so trying to see if I could make out what it was. It just sat there. I then set my binoculars down and picked up my digital camera to try and take pictures of it. The object was so tiny in the sky it took me a moment or two to find it again. This happened each time I took my eyes off it. Once I found it again, I tried to get it in my view finder of the camera, but it was so small I could not make it out through the camera. So I started taking pictures blind just guessing when to take the picture. I would take a couple of pictures then put the camera down and look at it again through the binoculars. It stayed the same shape, color and size. For about 10 minutes I would take a couple of pictures then look at it through the binoculars, take more pictures and look through the binoculars again. I then alerted the teacher and a couple of the other parents about the object. They each saw it and wondered what it was. I asked the teacher, who had a 35mm camera with a telephoto lenses, to see if she could find it in her view finder and take some shots of it. I then sat back down in my chair and continued to look at it with my binoculars. I knew the resolution of my digital camera was set on the lowest resolution and I wanted to set it on the highest resolution for a better image. I did not know how to change the resolution on my camera so I called a friend who owned a similar camera and asked how to change the resolution. My phone records indicated that I made this call at 3PM. He told me how to changed the resolution and I did it while on the phone with him. After changing the resolution I took a few more pictures. Since I could not tell if I was getting the object in the picture or not I zoomed in and out taking pictures hoping I would get lucky and get a clear close-up shot while shooting blind, but zoomed out so to make sure I covered a large area to make sure it was in a shot. While I was taking pictures with the higher resolution, an elderly lady came up to me and said she had been watching me and wanted to know what I was looking at and taking pictures of. I told her it was a very small object that looked similar to the size of a large star. I tried to show her, but she gave up quickly and said \"If you say so, I can't see it\" and left. I then looked at the teacher to see what she was doing and she had sat her camera down and was looking at the kids in the water. I asked her if she had taken photos of it and she said she could not find it in her camera. I asked her If I could try and she said \"sure, but the camera does not focus on its own\". I got her camera and sat back down and tried to find the object in the view finder of her camera. It was at this moment that I noticed that the object had been moving. It was now at about a 11:45 position. I had a point of reference because I had been laying me head back on the back rest of the chair each time I took a picture or look at the object with binoculars. Now as I laid my head on the back of the chair I had noticed I had to look more straight up. The object had been moving to the west inland and a little south, but mostly west. There were several thunderstorms around on the north and south of me and they all were moving to the east. This made me decide that the object was not a weather balloon for if it was it would also have been be moving east. After working with the 35mm camera for a minute or so, I was able to find the object for a second in the view finder, but it was blurry and moving around a lot in the view finder and hard to hold within the view finder. I then decided to pre-focuse the camera so all I had to worry about was finding the object in the view finder and taking the picture without having to worry about focusing. I decided to focus on a boat way off in the distance which best represented the size of the object. This took only 10-15 seconds to do. I then looked back up and tried to find the object again, but it was gone. While looking around to find it again, after a few seconds a commercial jet appeared from behind my left shoulder going east in the direction of and nearing where the object had been. However, the path of the jet took it a little to the left(north) of where the object was. After looking for the object for a few more moments and not being able to see it I then tried to take pictures of the commerical jet for a reference point in case I did get pictures of the object and for and additional proof. I put down the 35mm camera and tried to take pictures of the jet with my digital camera, but like the object, I unable to find the jet in my view finder. I took a couple of photos anyway again guessing where to shoot. The jet did not appear to be at a high cruise altitude, In fact, I thought it may be still climbing. It was not leaving a trail. I actually thought the object was much higher than this jet, but can't say for sure. The smallness of the object may have played tricks on me. Shortly after trying to take pictures of the jet I looked at the cell phone clock and it was 3:19PM. The object did not re-appear. I kept looking until we left the beach and the park at 3:39pm. The day was partly cloudy with scattered thunderstorms around. In the area of the object the sky was 95% blue with a very small amount of very thin clouds. After uploading the digital pictures I was disappointed to see that I had only one image showing the object. Amazingly it was the very first picture I took. I missed the jet all together. At some point, but I can't tell you precisely when in this outline, I looked at my cell phone to record a time as to when I was seeing the object and it was 3:11. While typing this I had the thought that this object may indeed be a weather balloon that NASA sets lose prior to a launch to check the weather. However, two things cause me to cancel this thought. 1) The object moved west when thunderstorms were moving east. 2) After my looking at the object for over 25 minutes, the object disappeared in a matter of seconds. I wish I had been looking at the object when it disappeared to see if it zipped off or just vanished in thin air."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16918.html.txt","/var/www/straped/mufon/more/16918_submitter_file1__IMG_4052.JPG","/var/www/straped/mufon/org/16918.html"],"Log Number":"US-05142009-0003"}