{"divs":["sighting detailsi had just returned home from night class and parked my car about 1\\2 block from my house. i was walking south on the left side of my street. i have a tendency to look up at the stars on clear nights to see if i can make out any constellations. the skies were clear this evening. i look up to the right and saw three stars, but then strangely, i noticed that one of the \"stars\" was moving. the star-like object was moving east in a slow but constant speed and no sound. slow enough for me to follow it as i walked to my house from my car. i don't live too far from o'hare airport so i see a lot of planes come and go all the time. so when i saw this object moving slowly across the sky with no flashing lights like commercial airlines do...then i knew this was not something normal. in fact, as i was walking a plane happened to fly accross (going east)and that confirmed my suspicions. the glowing star-like object seemed to be higher and moving slower than the plane. as i was getting closer to my house i was loosing sight of it because by this time it was over my head and descending east...so i was able to catch a glimpse through the spaces between houses. by the time i got the alley next to my house i turned around and looked east and saw that the object curved and continued going in a northeast direction. after that i lost sight of the object. i was in awe of what i was seeing that it didn't dawn on me to record it. all i had with me was my phone, but even then i don't think my camera phone would have picked up something so high up in the dark sky. i didn't what to make of what i saw. i didn't say anything and thought maybe it's just my imagination, but it's been eating at me ever since just because i've never seen anything like it in my life. i just don't know how one would explain what i saw especially when it was moving slower than a plane in a slow and steady pace."],"Log Number":"US-05142009-0009","Object Features":"None","Object Shape":"Star-like","Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Star-like object moving slowly across Chicago sky in eastern direction 5/11/2009.","Region":"Illinois","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/16924.html.txt","/var/www/straped/mufon/org/16924.html"],"Case Number":"16924","Viewing Distance":"Unknown","Latitude":"41.883304","Disposition":"IFO","Date Submitted":"05/11/2009 09:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.883304,+-87.621268(16924)&iwloc=A&hl=en\"> mufon case (16924) map </A>","Source":"MUFON","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 11th 2009"],"City":"Chicago","Date of the Event":"05/11/2009 09:40 UTC","Country":"United States","Longitude":"-87.621268"}