{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Tags":"City","City":"Aberfeldy","Summary":"Unusual telephone event followed by sighting.","divs":["Sighting DetailsGlen Lyon Perthshire, Scotland UK 13th May 2009. About 2207 bst the telephone rang but when i picked it up there was just a series of beeps. I dialed 1471 to see who rang but no number had been left. At 2210 bst a bright white light appeared in the clear, moonless night sky heading West to East and descending. Oddly i saw it as being round while the wife saw it as being triangular in shape and orientated vertically. The object was completely silent and left no vapour or smoke trail. There was no flashing aircraft beacon showing and no navigation lights. The objects track lay south of us; it may have been flying between the Ben Lawers range of mountains (munros) and the river Lyon because as seen it appeared to pass behind bushes in this garden as it descended towards the east. If it had been further south over Loch Tay it would have had to have been at a considerable altitude as otherwise the Ben Lawers hill slope would have obscured it before it appeared to pass behind the bushes. The prevailing wind has been from the east over the last few days and so that UFO could not have been a balloon as it would have had to travel upwind!! Additionally, aircraft landing lights are very directional and always shine directly along the flightpath (or track) the aircraft is following and not across it so it can't have been landing lights. Another aspect of the sighting was the incredibly steady speed at which the UFO flew, no plane is that steady. At about 2230 bst i reported the sighting to Central Scotland Police who said they would log the incident as a UFO sighting and pass details to the department dealing with sightings for subsequent relay to relevant aviation authorities."],"trends":["There have been no other sightings in Aberfeldy","This sighting has never been favorited."],"Sighting Duration":"00:03:00","Country":"United Kingdom","Longitude":"-4.0517","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Date of the Event":"05/13/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/16920.html.txt","/var/www/straped/mufon/org/16920.html"],"Weather Factors":"Unknown","Object Shape":"Circle, Triangle","Region":"","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=56.59824,+-4.0517(16920)&iwloc=A&hl=en\"> mufon case (16920) map </A>","Latitude":"56.59824","Log Number":"GB-05142009-0005","Date Submitted":"05/13/2009 12:00 UTC","Case Number":"16920","Object Features":"Other"}