{"Date Submitted":"11/03/2008 12:00 UTC","Tags":"City","Disposition":"Unknown","Case Number":"16929","Latitude":"33.452767","map":"<A HREF = \"http://maps.google.com/maps?q=33.452767,+-112.068547(16929)&iwloc=A&hl=en\"> mufon case (16929) map </A>","Object Features":"None","Date of the Event":"11/03/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/16929.html.txt","/var/www/straped/mufon/org/16929.html"],"Viewing Distance":"Over One Mile","Country":"United States","Region":"Arizona","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Phoenix","Object Flight Path":"Stationary","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around November 3rd 2008"],"Summary":"Strange rectangle in the sky disappeared.","divs":["Sighting DetailsA coworker and I had just landed at Sky Harbor airport from Seattle, rented a car and were approaching a Freeway onramp (Interstate 10?)to head for Mesa. It was around 3:00PM, clear, sunny, and there was lots of traffic. My coworker was driving, I was the navigator, and I noticed straight ahead - maybe 2 miles away from the airport and a few hundred feet in the air - a rectangle in the sky, with mountains in the background. I immediately assumed it to be an advertising banner being pulled by an airplane. Still, it seemed out of place, it didn't appear to be moving, and I couldn't see an airplane pulling it (but because it was between us and the mountains, I figured I was unable to distinguish the plane from the terrain behind it) I pointed the object out to my coworker, she saw it too and remarked that it was odd. Her focus though quickly returned to merging into freeway traffic. As I continued to observe the object, I assumed the plane pulling it must have turned to head directly away from us and towards the mountains, because the rectangle got thinner and thinner until it disappeared completely. I mean literally, seconds later there was no object, no airplane, nothing. I scanned the area for another minute or two as we drove, there was nothing there. I said, half-kidding, \"that must have been a UFO!\" The entire sighting was maybe 30 seconds."],"Longitude":"-112.068547","Weather Factors":"Unknown","Log Number":"US-05142009-0014","Object Shape":"Square, Rectagular"}