{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-90.914169","Viewing Distance":"Unknown","Log Number":"US-05142009-0006","Summary":"This craft flew over 4 times during the week. I caught it on camera twice.","Object Features":"Undisclosed","Region":"Louisiana","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.240609,+-90.914169(16921)&iwloc=A&hl=en\"> mufon case (16921) map </A>","trends":["There have been 7 other sightings in Gonzales","There were no other sightings in Gonzales on or around April 14th 2009","This sighting has never been favorited.",""],"Date of the Event":"04/14/2009 09:30 UTC","Case Number":"16921","Weather Factors":"Unknown","Latitude":"30.240609","Disposition":"Hoax","divs":["sighting details i walked outside to smoke a cigarette when i noticed a ghostly white glowing object to my 2o'clock position in the sky. it was a triangular craft w\\ windows hovering in one spot. once the glow started to fade away the object began moving. after a few minutes another smaller object flew in and passed right by the slow cruising triangle craft. this one pulsated a white light in the front and back very brightly. after this one left the area the black triangle craft turned and started heading back towards me and my wife. when it flew right over our heads is when i got the best shot of it on film. i've seen this craft 6 times total in 3 years and during this week (i was outside 4 out of the 7 days) when this craft passed over. i could really use a state of the art camera (like in ufo hunters) to get better shots of these 'things'. i'm working on editing a daylight sighting i have on film of a black 'saucer' shaped craft that was filmed around 8:30 in the morning. i will upload that one when i get done. thanks."],"City":"Gonzales","Object Shape":"Cigar, Triangle","Date Submitted":"04/14/2009 09:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/16921.html.txt","/var/www/straped/mufon/org/16921.html"],"Country":"United States"}