{"Object Shape":"Other","Date Submitted":"05/12/2009 09:11 UTC","Object Features":"Wings","Latitude":"33.754035","divs":["Sighting DetailsI am a 32 year old man that lives in Vinings, Atlanta, Georgia. On the twelfth of May 2009 at approximately 9:11 to 9:15 p.m. I went to my back porch to smoke a cigarette. I looked up into the sky to see a normal traffic flow of commericial jet liners and one smaller somewhat low flying plane cross the sky. It was at that time that a somewhat large (what seemed to be a smaller commercial jet) that was flying at a very low altitude came into view on my left. It was absolutely silent. At that moment, from tip to tail in one long red stripe that ran down its side it vanished above me as it disappeared out of view behind one large tree that sits off the left of my porch. I know that was a long sentence but that is about how long this whole event took. Pretty quick. As it vanished the red line that ran down its side seemed to glow briefly with more concentrated bright red light starting in the front and moving through it? It is hard to describe. That is it. I went back inside my apartment, told my roommate (who rolled his eyes) and felt like it was a pretty cool thing. Thank you."],"Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.754035,+-84.380772(16923)&iwloc=A&hl=en\"> mufon case (16923) map </A>","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"16923","Summary":"I watched a silent airplane vanish into thin air.","files":["/var/www/straped/mufon/html2text/16923.html.txt","/var/www/straped/mufon/org/16923.html"],"Tags":"City","Date of the Event":"05/12/2009 09:11 UTC","City":"Atlanta","Longitude":"-84.380772","Country":"United States","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:05","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around May 12th 2009"],"Region":"Georgia","Log Number":"US-05142009-0008"}