{"Country":"United States","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/16927.html.txt","/var/www/straped/mufon/org/16927.html"],"Weather Factors":"Unknown","Case Number":"16927","Source":"MUFON","Tags":"City","Summary":"Bigger and brighter than a star, closer than a star. Moved faster than a plane, no flashing lights.","map":"<A HREF = \"http://maps.google.com/maps?q=33.402266,+-104.513554(16927)&iwloc=A&hl=en\"> mufon case (16927) map </A>","divs":["Sighting DetailsI had been watching a movie, just put the kids to bed, and wandered outside to our detatched garage to see what my husband was up to. I leaned down to pet the dog and then scanned the sky as I always do. This is right around 9 pm on Saturday May 9, 2009. At that time, I saw a light in the sky that looked like a star but was much brighter, bigger, and closer than a star in the sky. It was moving from the northern part of the sky southward. I watched for the tell-tale blinking lights, like the wings of an airplane, but there was no fluxuation in the light. After about 30 seconds of approaching from north to south, it turned eastward and gained in altitude. It got smaller and smaller and about 15 seconds later it was obscured by a tree, so I went running to the front yard. By the time I got to the front yard, it had disappeared. There was also no sound with this object, definitely no plane engine sounds. In fact, while typing this, I became concerned that what I had seen was actually a flight to Dallas from our local airport, so I looked it up. The evening flight leaves at 8 and I know it was at or a little after 9pm that I saw this object. I did not feel afraid or nervous. I was excited and hopeful that I was actually seeing something out of the ordinary. I should have called my husband out to see it, but he had a friend over and I didn't want to seem weird. I kept scanning the sky for signs of it again, but it didn't return."],"Object Features":"Unknown","City":"Roswell","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Latitude":"33.402266","Log Number":"US-05142009-0012","Date Submitted":"05/09/2009 12:00 UTC","Disposition":"Unknown","Object Shape":"Star-like","Date of the Event":"05/09/2009 12:00 UTC","Longitude":"-104.513554","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around May 9th 2009"]}