{"Latitude":"38.633092","Log Number":"US-05142009-0016","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around May 14th 2009"],"Weather Factors":"Unknown","Disposition":"IFO","Region":"Missouri","Source":"MUFON","Object Flight Path":"Hovering then path","Longitude":"-90.195324","files":["/var/www/straped/mufon/html2text/16931.html.txt","/var/www/straped/mufon/org/16931.html"],"Case Number":"16931","Summary":"Small black circle moving in late afternoon sky.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.633092,+-90.195324(16931)&iwloc=A&hl=en\"> mufon case (16931) map </A>","divs":["sighting detailshaving just been picked up at work from a downtown st. louis hospital, sitting in the rear passenger seat i noticed a small dark object slowly moving in the sky. we were traveling south, and the object was in the southwestern sky. at first i thought it was a single small balloon filled with helium. stopped at a light, i could see a dark object seeming to rise and move to the front right of us, between a row a trees along the road. between 30 and 45 degrees in the sky from the ground, it appeared small, only the \"diameter\" of an 1\\8th of inch. it seemed to be getting closer, but there was little wind, and what wind there was was moving in the opposite direction than the object was, which kept my attention on it. it then appeared to stop and hover or stay in place, clearly a perfect circle, but completely black with no lighting to it at all, reflected or otherwise. the sky was partly cloudy, the clouds high and thin, the object definitely beneath them. the object seemed to then \"wiggle\" back and forth, at least 3 times its diameter size to either side of its \"hovering\" position, then it started moving in a completely straight line to the west, not changing in \"size\" during it's move to the west-northwest location. sometimes the object would be blocked by trees or building as we drove or stopped at lights, but a vast majority of the time the object stayed in view. it seemed to stop once or twice along its southwest to north-northwest location, again \"wiggling\" each time. it \"wiggled\" again when it finally \"stopped\" in the west-northwest location. it seemed to \"stay\" in that location, but slowly grew smaller until i lost sight of it. even though it was a small size in significance to what is usually reported, its perfectly circular black shape made it seem more like a small moving black hole in the sky, and also going against the wind, and its very strange \"wiggling\" behavior - i don't know what can can travel \"against\" wind without sound and wiggle and have no reflected nor illuminated light?"],"Date of the Event":"05/14/2009 05:35 UTC","Date Submitted":"05/14/2009 05:35 UTC","City":"St Louis","Viewing Distance":"Unknown","Country":"United States","Tags":"City","Object Shape":"Circle","Object Features":"Unknown"}