{"Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.096049,+-79.081558(16939)&iwloc=A&hl=en\"> mufon case (16939) map </A>","files":["/var/www/straped/mufon/html2text/16939.html.txt","/var/www/straped/mufon/org/16939.html"],"Summary":"Spotted bright red/white light to SW of position at 10-15 degrees off horizon.","Date of the Event":"05/14/2009 10:50 UTC","Log Number":"CA-05152009-0005","Case Number":"16939","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Features":"Unknown","Source":"MUFON","Longitude":"-79.081558","Tags":"City","City":"Niagara Falls","Latitude":"43.096049","divs":["Sighting DetailsI was watching CSI:NY and I stepped out on the back porch to smoke,during a commercial. It was approximately 2245, the night sky was very clear. I was facing west and scanning the sky from the south back to the west. I watched some planes in the final approach to Buffalo International Airport and I was star-gazing towards the SSW-SW. When I dropped my gaze back to the horizon, I noticed a very bright red and white light. I immediately pasted it off as a plane. It's position was approximately 200 to 240 degrees at about 10-15 degrees off the horizon. Just about the same as the planes making the final into the airport. From where I was, I figured it was over Lake Erie at about Port Colborne. I watched for movement, expecting it to continue eastward, but it didn't. It made some quick movements, like short spurts, horizontally and vertically. It remained in approximately the same general area within a degree. That's when I realized it wasn't a plane and the hair on the back of my neck rose. I kept trying to orientate the object to a stationary one on the ground (a spruce tree), but the light was very bright (in relation to the night sky) making it difficult to maintain a good point of reference. It wasn't illuminating, just a very bright pinpoint. I went inside to wake my brother-in-law, but I didn't, I wish now I had. I returned outside to see if it was still there, and it was. I went back inside to get my phone to call my wife, I opened it to check the time (2254), watched about a minute of CSI:NY, then returned to the porch to call her. It was gone by the time I had returned to the porch. I called my wife and told her about it. She joked they were going to come and get me. I'm fifty years old and I sort of had the heebie-geebies. I had seen another object when I was about 8 or 9 at my grandparents house in Athens,Texas. It was in the western sky and about the same attitude. My dad told me he thought it was just a helicopter or something. It just hung in the sky too. I'll tell you I had nightmares for the two weeks I stayed at my grandparents house. I still remember that evening. I just past it off as watching too much \"Outer Limits\"."],"Object Shape":"Star-like","Country":"Canada","Disposition":"Unresolved","trends":["There have been 16 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around May 14th 2009"],"Date Submitted":"05/14/2009 10:50 UTC"}