{"Log Number":"US-05152009-0001","Object Features":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16934.html.txt","/var/www/straped/mufon/org/16934.html"],"Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailswhile driving in to work (night shift in downtown tulsa, ok) at 10:02pm on hwy. i-75 southbound (near 96th street exit) i saw a very bright \"strip\" of white or bluish white light in the sky to the east. this is very close to the approach used for runways at tulsa international (rwy. 18l and 18r). i am use to seeing planes approaching to land at the airport in tulsa, but this was not an airplane about to land at the airport. it appeared (as best i can tell) to be about 1\\4 mile to my east (no way to reference this distance, just a best guess). it had a dark outline i could not identify well, but then lit up with a very bright strip of white light on it's bottom. the light looked a bit like the expensive xenon headlights used by teenagers in the import cars, as it was almost blue tinted a bit. maybe like a mercury vapor light, but much brighter. it stayed on for about 3\\4 of a second and went out, then back on for about 1\\4 second. then, as it was going dark, it started moving away (appeared to be eastbound, but was hard to tell). as soon as the lights went out, i lost sight of it's dark outline and the sighting was over. if i were to guess, i would say this strip of light was at least 100 feet long, but i could see no real shape except that the strip of light was a straight line below a darker craft. when i saw it i immediately got a \"fight or flight\" feeling as adrenaline surged through me and i was awestruck and scared at the same time. i continued the drive to work (no missing time on my commute) and sent this report."],"Object Shape":"Unknown","Longitude":"-95.986185","Region":"Oklahoma","Summary":"Large very bright bluish white \"strip\" of light seen on bottom of a large craft.","trends":["There have been 59 other sightings in Tulsa","There was one other sighting in Tulsa on or around May 14th 2009"],"Case Number":"16934","map":"<A HREF = \"http://maps.google.com/maps?q=36.159382,+-95.986185(16934)&iwloc=A&hl=en\"> mufon case (16934) map </A>","City":"Tulsa","Source":"MUFON","Tags":"City","Country":"United States","Date of the Event":"05/14/2009 10:02 UTC","Disposition":"Unknown","Date Submitted":"05/14/2009 10:02 UTC","Latitude":"36.159382","Object Flight Path":"Hovering then path","Weather Factors":"Unknown"}