{"Viewing Distance":"Unknown","Disposition":"Unknown","Date Submitted":"05/14/2009 09:45 UTC","files":["/var/www/straped/mufon/html2text/16935.html.txt","/var/www/straped/mufon/org/16935.html"],"trends":["There have been 2 other sightings in Morrilton","There were no other sightings in Morrilton on or around May 14th 2009"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Arkansas","Latitude":"35.151957","Longitude":"-92.734114","Object Shape":"Undisclosed","Case Number":"16935","Country":"United States","Summary":"Multiple UFOs flying, helicopters circling bottoms, def. UFOs not planes or satelites.","divs":["Sighting Details This area in the bottoms beside the Arkansas River Dam is a major hot spot - Major. I have more ufo reports including ribbons of light that looked like the one's in stephensville texas and kokomo indiana, we watched that thing for 50 minutes, we didn't leave till we felt it was safe. But this, my little brother (age 17) and me (age 23) were on a hill in the bottoms about to watch the stars. We notice some of them moving like we had never saw before... and we watch the stars every night now. We've seen thousands of satelights, meteors, even a few comets, and can pick out planets, we are Not mistaking these, they are some type of space crafts flying in space. We saw one, it looked just like a star, they all did, different sized stars kinda. It was moving away from us and my little brother spotted another. Then we saw another on comming in, and it was moving faster, then slower (there was no wind blowing, and again, they were in space as high as the stars are), not only faster and slower, but side to side, and stoping for extended periods. We counted about 16 and they were moving all around, EVERYWHERE. Then we started noticing helicopters circling the bottoms and one came around and was circling us you could see his rutter kind've turning, so I took off to leave, and when I got back to my house 3 of 4 miles back, I noticed the same helicopter was going on ahead of my house, and my little brother told me the whole time he was following us. There is crazy things going on in Arkansas, I don't know about the rest of America or the world... Come on Obama just let this knowledge out, how can we change the world with such secrets?????"],"Weather Factors":"Unknown","Tags":"City","Date of the Event":"05/14/2009 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.151957,+-92.734114(16935)&iwloc=A&hl=en\"> mufon case (16935) map </A>","City":"Morrilton","Log Number":"US-05152009-0002"}