{"map":"<A HREF = \"http://maps.google.com/maps?q=39.295945,+-76.604599(16932)&iwloc=A&hl=en\"> mufon case (16932) map </A>","divs":["Sighting DetailsI was working second shift at a Federal Defense Plant in Linthicum Md and was giving someone a ride home and was traveling down Marley Neck Road in a Triumph Spitfire with the top down on a quiet summer night. I dropped my friend off at his house and proceeded to take the dark quiet road home. The road I was traveling on was a one lane both ways with not alot of cars at that time of early morning of 2:00am. I had the top down on my car because it was a pretty night after I got off work. I was traveling on Marleyneck Road half point from B&A Blvd and Fortsmallwood Road and to my right was a field with a grove of trees and something caught my eye as i drove by and i hurried up to stop my car and then backed up to see a teardrop object hovering over the trees!!..At first I thought this can't be happening to me and i am seeing things, but it was very quiet and made a humming sound. There is no way a plane or heilocopter could hover over trees and not make any noise or wind being that close to the trees. In the moonlight reflection it looked to be shinny silver, very upscale from anything that anyone could imagine. I was there for about 5 minutes or so and it tilted at a slant and within seconds it was so far up in the air behind me, that it was just a small light in the sky. I kept my eyes on it until it was a dot in the sky and it finally disapeared. I could not believe my eyes on what I had seen that summer night. I told my dad and mom and friends. I have never ever forgotten about what i had experienced in my life and never will..."],"files":["/var/www/straped/mufon/html2text/16932.html.txt","/var/www/straped/mufon/org/16932.html"],"Object Flight Path":"Stationary","City":"Baltimore","Date of the Event":"06/30/1984 12:00 UTC","Country":"United States","Object Shape":"Teardrop","Disposition":"Unknown","Date Submitted":"06/30/1984 12:00 UTC","Longitude":"-76.604599","Case Number":"16932","Object Features":"None","Region":"Maryland","Log Number":"US-05142009-0017","Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around June 30th 1984"],"Latitude":"39.295945","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Shiny, silver looking under the moonlight.","Weather Factors":"Unknown"}