{"Date of the Event":"07/31/1955 12:00 UTC","Region":"Washington","Source":"MUFON","Longitude":"-119.276697","trends":["There have been 2 other sightings in Moses Lake","There were no other sightings in Moses Lake on or around July 31st 1955"],"Viewing Distance":"101-500 Feet","divs":["Sighting DetailsI was 14 years old, sleeping in a haystack with friend, we were about 4-5 miles north of Moses Lake, Washington. We noticed an orange, circular ring making strange movements in the sky approximately two miles away at an altitude of 2 to 3 miles. The object was moving relatively fast in a zig zag at what I concidered imposible angles (some greater than 90 degrees); then the object hovered and seemed to wobble,then it moved very quickly to directly over us. Looking straight up at it looked about the size of nickle held at arms length and we cound see the orange ring and three lights at the center of the circular ring that continually changed colors from red to greenish blue and a violet. We had no idea what the object was and did not become alarmed until it hovered over us. We then paniced and got on our bikes and headed back to town. the most frightening thing to me was that there was absolutely no sound. As we were leaving the area we heard the roar of the two f-86's heading straight for the object and we stopped to see what would happen. When the jets approached the object it lit up in extreme brilliance like looking at a welders torch, then it just shot of at incredible speed and left the two jets like they were standing still. The oject was over the horizon in a blinding flash. Simply gone. The jets circled and returned to Larson AFB, I have always assumed the AFB picked up the object on RADAR and scrambled the jets to investigate. My friend and I were shaken and afraid. I told my father (he was chief flightline inspector for the Boing plant there in Moses Lake)and he laughed at me, I did'nt mention the event for many years for fear of ridicule (particularily back in the fifties). P.S. I had a second sighting of an pulsating egg shaped object on the ground in the rolling hills of missouri at approximately 2 AM while driving. It was on the other side if the freeway about 200 feet away and I could see it plainly. I stopped my car, turned out the lights to observe it and thought of going across to look closer then I became frightened and drove away. I swear the sun came up about 20 minutes later, I don,t know what happened to the time and all I remember was driving away. This was in 1974 and I was driving from New Jersey to Texas after my discharge from the Army. I was then 33 years old. The hills there in Missouri go up and down like a roller coaster; I had just topped a hill when a blinding light from the next hilltop hit me and an 18 wheeler right behind me. The light completely blinded me but it only lasted perhaps a second then switched off. The 18 wheeler did not stop and he damned near ran over me when a pulled off the interstate. If you are interested I can submit a separate report on this incident.I really want to know what really happened and what happened to the approximately 4 hours in time. Sincerely, Patrick D. McCabe"],"Object Shape":"Disc","Log Number":"US-05162009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=47.131332,+-119.276697(16944)&iwloc=A&hl=en\"> mufon case (16944) map </A>","Date Submitted":"07/31/1955 12:00 UTC","Country":"United States","Weather Factors":"None","Tags":"City","Disposition":"Insufficient Data","City":"Moses Lake","Case Number":"16944","Object Flight Path":"Path then hovering","Summary":"Sighted in air, pursued by two F-86 Sabre jets from Larson AFB.","Latitude":"47.131332","files":["/var/www/straped/mufon/html2text/16944.html.txt","/var/www/straped/mufon/org/16944.html"],"Sighting Duration":"Undisclosed","Object Features":"Window(s)"}