{"Object Shape":"Egg","Longitude":"-4.250356","Country":"United Kingdom","Object Flight Path":"Straight-line path,Path then hovering","Latitude":"55.871057","Disposition":"Unresolved","Viewing Distance":"101-500 Feet, Over 1 Mile","Object Features":"None","Case Number":"16940","map":"<A HREF = \"http://maps.google.com/maps?q=55.871057,+-4.250356(16940)&iwloc=A&hl=en\"> mufon case (16940) map </A>","files":["/var/www/straped/mufon/html2text/16940.html.txt","/var/www/straped/mufon/org/16940.html"],"Weather Factors":"Light","City":"Glasgow","Log Number":"GB-05152009-0006","Source":"MUFON","divs":["Sighting DetailsI was in the back garden.my area i live is surrounded in wooded areas.i was relaxing as it was a sunny day and there were hardly no clouds in the sky.what caught my attention was a shinny glint,then when i looked closer i actually was really excited as i know this was something out of the ordinary..as i kept watchinh it ,it glinted again.i assume this was because of the sun reflecting off it.it was shaped like a rugby ball.not sharp egdes.very smooth.it was high up ,but i couls still make out the shape easily enough.it did not make any erratic moves.just kept goong on it way.i was buzzing at this time and was looking around for people to shput at them to watch this.my wife was in the house and she came running out and saw the object aswel.the forst thinh she said was \"is that a Ufo\" i sais it sure as hell looks like one.and it was moving much to fast to be a blimp or anything like that.no way.this was an egg shaped.rigby ball shaped craft.that was going at some very fast speedy.its hard for me to gauge the speed but if i had to guess o would say 250 yo 300 miles an hour.that is my report down to the exact detail.this was something i have never seen before on my life and i have helecopters and planes,jets flying avross my area alot.so i know the difference.finish this for now.thank you for listening to me as most people would think me mad.but in actuall fact they are the ones that are mad.just my opinion.i saw this with my own eyes and im not the only one.my wife saw it aswell.thank you for your time."],"Summary":"Rugby ball. Silver. Dull in shade.","Tags":"City","Region":"Scotland","Sighting Duration":"Undisclosed","trends":["There have been 22 other sightings in Glasgow","There was one other sighting in Glasgow on or around May 4th 2009"],"Date of the Event":"05/04/2009 12:00 UTC","Date Submitted":"05/04/2009 12:00 UTC"}