{"files":["/var/www/straped/mufon/html2text/16947.html.txt","/var/www/straped/mufon/org/16947.html"],"Case Number":"16947","Object Flight Path":"Straight-line path","Tags":"City","Object Features":"Other","Region":"New Mexico","Weather Factors":"Windy","City":"Las Cruces","Date of the Event":"05/16/2009 10:15 UTC","Disposition":"Unknown","Object Shape":"Cylinder","Country":"United States","Source":"MUFON","divs":["Sighting DetailsI was sitting on the deck when I noticed a jet with contrails. Then I noticed another object with no contrail very close to the jet which was about 3 times the size of the jet or more. As they moved to the west, the larger cylinder shaped object moved way ahead of the jet until my wife and I lost track of both. We got the binoculars out and were able to see the cylinder shaped UFO very clearly. It was long and skinny and white colored. It had something in the middle of it, like spokes sticking out or something sticking out. It seemed to be divided somehow in the middle. The UFO started out on the other side of the jet going at first the same speed as the jet but then it went a lot faster and went kept putting more distance between it and the jet. The UFO disappeared while we could still see the jet and contrails in the distance. We were astounded and excited when we saw it and, of course, very curious. The UFO was too far away and moving too quickly and getting even further away to take any pictires or a video. I wish we could have because it was so clear through the binoculars."],"trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around May 16th 2009"],"Summary":"Object was beside and in front of a jet airplane.","map":"<A HREF = \"http://maps.google.com/maps?q=32.32195,+-106.756124(16947)&iwloc=A&hl=en\"> mufon case (16947) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"32.32195","Log Number":"US-05162009-0004","Longitude":"-106.756124","Date Submitted":"05/16/2009 10:15 UTC"}