{"Summary":"One of many sightings finally caught on camera.","Tags":"City","Object Flight Path":"Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/16943.html.txt","/var/www/straped/mufon/more/16943_submitter_file1__100_0468.jpg","/var/www/straped/mufon/org/16943.html"],"Date of the Event":"05/14/2009 11:45 UTC","Case Number":"16943","trends":["There have been 4 other sightings in Rogers City","There were no other sightings in Rogers City on or around May 14th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsLast night, my girlfriend and I saw a UFO powerup and caught it on my digital camera. It is one of many sightings this week, here near Rogers City. I have a hunting camp outside of town and have been observing Ufo's for over five years here. I consider it a hot spot. The Ufo in the picture was traveling east and is the brightest spot to the right in the picture. There are two other orbs of light to the left, that were not seen when I snapped the photo, only the one to the right was vilible. It flew in, powered up and continued crusing until it was out of sight. This is common here, I see them almost every night. After viewing it for maybe two minutes, we saw, what I presume was an f-16 heading toward the object. This is also very frequent. The f-16's kinda patrol a permimiter around the area of my camp all day and night. I would like to have someone with the right equipment film the sky around my camp for a few nights, if the sky is clear, I promise you will see exactly what I have been wathcing for years. Please feel free to call or email me. I kinda wanna keep this under wraps until we can say for sure what's going on. Because I think the airfore is involved. Hope we can work together soon. The activity has really ramped up in the last week. Thanks for your time."],"Object Features":"Unknown","Source":"MUFON","Object Shape":"Sphere, Star-like","Longitude":"-83.81833","map":"<A HREF = \"http://maps.google.com/maps?q=45.421402,+-83.81833(16943)&iwloc=A&hl=en\"> mufon case (16943) map </A>","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-05152009-0009","City":"Rogers City","Disposition":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Latitude":"45.421402","Region":"Michigan","Date Submitted":"05/14/2009 11:45 UTC"}