{"Case Number":"16945","files":["/var/www/straped/mufon/html2text/16945.html.txt","/var/www/straped/mufon/org/16945.html"],"Log Number":"US-05162009-0002","Region":"Washington","Latitude":"46.292641","Weather Factors":"None","Object Shape":"Sphere","Longitude":"-119.281162","Object Features":"None","Viewing Distance":"Unknown","divs":["Sighting DetailsOn Sunday about mid day, May 10, 2009, on a clear sunny day, I was walking around in my yard looking at my plants leafing out when I noticed a plane flying overhead. It was flying from east to west and then I noticed the contrails from the plane because they were shorter than those I normally see in the sky from my yard. From my view the two contrails appeared to be only about 5\" long. While I was looking at the plane and the contrails, suddenly there just appeared in mid air coming from the north a white ball traveling pretty fast. The white ball crossed behind the plane's path about an inch (in my view) from the end of the 2 contrails from the plane. The ball was traveling in a straight line from north to south and was visible for only about 6 to 7 seconds before suddenly just vanishing. It probably traveled about 10\" to 12\" (in my view of the sky) before disappearing. There were a few fluffy white clouds in a different part of the sky, but none were anywhere near where I saw the ball or the plane. The ball appeared larger than the plane. It was cloud-colored white and was slightly smaller than an aspirin held at arm's length. It was moving fast--much faster than the plane. Because of the height of the plane, it barely appeared to be moving at all as the ball crossed its path. I don't know what I saw, but it was round and was the color of a white cloud. It just appeared in the sky, was traveling fast, and then just disappeared. The event lasted only seconds and it startled me to see something out of the ordinary."],"Date Submitted":"05/10/2009 12:00 UTC","Sighting Duration":"00:00:08","Summary":"White cloud-colored ball appeared in sky traveling fast from north to south and suddenly disappeared.","Tags":"City","Source":"MUFON","Date of the Event":"05/10/2009 12:00 UTC","City":"Richland","Country":"United States","trends":["There have been 9 other sightings in Richland","There were no other sightings in Richland on or around May 10th 2009"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=46.292641,+-119.281162(16945)&iwloc=A&hl=en\"> mufon case (16945) map </A>","Object Flight Path":"Straight-line path"}