{"Object Features":"Unknown","Summary":"First of three UFO sightings from 22:08, then second 22:20, and third 22:32.","divs":["Sighting DetailsI stepped outside on my backyard patio at 22:08 to sky watch and observed a very bright beige-white sphere, pea sized at arms length, moving in a straight line WNW to ENE at 60 deg elevation for ~ 30 sec. I called my daughters (age 11, 7, and 6) who also witnessed the object in a clear night sky that did not blink and made no sound. At first I told my daughters that we were observing the space shuttle and hubble telescope yet upon checking SpaceWeather.com the ISS was not tracking 42.3 lat., -83.2 long on 05-14-09 nor any other listed satellite at 22:00! Next at 22:20 I again walked outside to my backyard and observed a sharp star sized white ball with medium brightness moving straight line ESE to ENE at 80 deg for ~ 20 sec. I again called my daughter (age 11) who also witnessed the object moving toward the direction of the first larger object seen 12 min earlier. It seemed that the second sphere was vectoring toward the first larger sphere's flight pattern at a faster relative speed as we lost sight due to a large tree in our neighbor's front yard. Finally at 22:32 again in my backyard I observied a star sized sphere materialize first very bright white than dim to pale white at 90 deg traveling slower yet reversing the second sphere's direction for ~ 10 sec. It seemed that second sphere was returning from its mission 12 minutes earlier as it slowly dimmed to invisable in the clear night sky also being observed by my daughters (age 11, 7, and 6). The 12 minutes between each sighting seemed a structured pattern to me? Also acknowledge that ESA launched a satellite from French Guinea on 05-14-09 and am unaware of its orbit pattern."],"Region":"Michigan","files":["/var/www/straped/mufon/html2text/16946.html.txt","/var/www/straped/mufon/org/16946.html"],"Object Flight Path":"Hovering then path,Straight-line path","City":"Melvindale","Date Submitted":"05/14/2009 10:08 UTC","Source":"MUFON","Latitude":"42.282538","Viewing Distance":"Over One Mile","Country":"United States","Weather Factors":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-05162009-0003","Case Number":"16946","Object Shape":"Circle, Egg, Sphere","Date of the Event":"05/14/2009 10:08 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.282538,+-83.175203(16946)&iwloc=A&hl=en\"> mufon case (16946) map </A>","Tags":"City","Longitude":"-83.175203","trends":["There have been 6 other sightings in Melvindale","There were no other sightings in Melvindale on or around May 14th 2009"]}