{"Region":"Illinois","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around March 13th 2009"],"Latitude":"41.901538","Date Submitted":"03/13/2009 07:15 UTC","divs":["Sighting DetailsI am writing this on behalf on my dad and my brother who saw something amazing on the 13th March 2009. My Dad and my brother just dropped my brothers girlfriend off on March 13, 2009 at around 7:15 PM, and were driving down Santa Barbra Road and saw an orange thing in the clouds. My Dad and my brother thought thought they saw some bats fly over the street posts they both said, they said they looked far too big to be bats. Then they saw lights appear in the sky and spiral around in a circular formation like how a Tornado goes or like a really big light show. My Dad drove really slowly and they were covering an area far too big to be the Friday night football game which was going on at Brisbane (Queensland). Then in three seconds, all they lights took off at a very fast speed and the thing which is amazing is that they took the clouds with them, they said after it you could see the stars. They said the clouds were sucked away like a vacuum cleaner sucking a fog like substance out of a jar. They flew in the distance for another ten minutes and they said they could still just see them. They were very freaked out my amazed on what they saw that night. Another thing to add is that tihs happened on the same day and month that the Phonix lights occured (13th March 1997) Thanks."],"Object Features":"Undisclosed","Tags":"City","Log Number":"AU-05162009-0009","Source":"MUFON","City":"Chicago","Country":"United States","Summary":"Lights about the size of a pea a little smaller.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/16952.html.txt","/var/www/straped/mufon/org/16952.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.901538,+-87.622973(16952)&iwloc=A&hl=en\"> mufon case (16952) map </A>","Case Number":"16952","Object Shape":"Circle","Object Flight Path":"Undisclosed","Longitude":"-87.622973","Disposition":"Unresolved","Weather Factors":"None, Sleet","Date of the Event":"03/13/2009 07:15 UTC"}