{"Viewing Distance":"Unknown","Region":"Nebraska","divs":["sighting detailsok ok heres i go.... well it alll started when i was at a wild n crazy collage partayy in da hizzouse snoop diggity dawg in day hoo... o oi sry back on topic... got a lil carried away drer.. weel it alll starteddd.. when i was 26 and a half yrs old walkin to larrys bakeshop he said yeaaa watttudawwant i asked him ya goot anyb glazzed doghnuts? andy ny way suddenly while i was eatin my sour crout benjamin button comeuo ta me and he says i tell ya was he he says he says ta ta kme he sas if u build it the wl come \"who wil come\" i ask i reele did my home skkiddy dawg holdenc auifield came up to me and killed himselfd anywhooooo so then world famus scientologist tom cruise says \" thbritsh are coming the birtish are comng george sampson? i ask i reele didcaus that mean i a chunkj! mmmhm i wanna get withcha and talye ypo picture lend me some suga i am yo neighba here we go now dodokmdooomdoomdodmoom do,m, cant touch this breakint down now stop do touch m mmme there this is my priveatte suarer oo rite back the story \\well the alieummms come down i flying saucer named fred the fallopean and they saya to me the says \"take to urleaader' and ib says to him i says \"ok ill bring to to my leaaaher\" sowere walkin to yjdid sp were walkin to the white house me ndsss the aliums and i bvarge in to the oval office and spot good oll obamanation and jimmy kimmel on da desk with prez hilon and hilary clinton idoin al il somtin sonut\\ anywayy........ to i says to the aliums i says \"hese me leader i saya while showing him the tatoo of obama oon my butt it says: yes we caannn yeass weee (its a musical ) uyess we czasaaaaannnn csn we change all the sudden the naked brotyhers band comes and brakes into their melodius tune of iopds ceelphones rap mucscis boooo wait(lets kik it old school shall we) crrraaaazzyy csaaaar to lead me knowhere lead me lno o reiite back to story....where were we...o yeah...the four someand the aliums... kk so these aliums...weelll one of em looked like kenny rogere after his surgery....and the other one looks like that little cracka chiuaua from the taco bell comeercial\\....any way....then the aliums said...he really did....\" lets go see soulja boy tell 'em s total wangsta's college house partayyy crib\" an so i sayed no way ;lets go see those jon ass brothers crib...then the cracker chuiaua alium smacked me on the head and so i says \" whadya do that fo????\" 4 bein an idiot okay!\" so in the end we went to kevin butzz crib. the end"],"Case Number":"16950","Sighting Duration":"12:13:21","Object Features":"Undisclosed","Object Shape":"Blimp, Circle, Egg, Fireball, Saturn-like, Star-like, Teardrop, Other","Disposition":"Hoax","Date Submitted":"09/06/1895 06:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.501517,+-99.896613(16950)&iwloc=A&hl=en\"> mufon case (16950) map </A>","files":["/var/www/straped/mufon/html2text/16950.html.txt","/var/www/straped/mufon/more/16950_submitter_file1__untitled.JPG","/var/www/straped/mufon/more/16950_submitter_file2__DSC04465.JPG","/var/www/straped/mufon/more/16950_submitter_file3__012.jpg","/var/www/straped/mufon/org/16950.html"],"Country":"United States","Latitude":"41.501517","Longitude":"-99.896613","City":"glokenspmerfin URFACESNOO","Summary":"i did ur mom A FAVOR by making you A SANDWICH she is a hor RIBBLE COOK and i quote U STINK MCLOVIN FOR lLIFE bacon 4 prez","Weather Factors":"Unknown","Log Number":"US-05162009-0007","Object Flight Path":"Undisclosed","Tags":"City","trends":["There have been no other sightings in glokenspmerfin URFACESNOO","This sighting has never been favorited."],"Date of the Event":"09/06/1895 06:06 UTC","Source":"MUFON"}