{"Summary":"Driving home from the movies and noticed bright lights in triangle pattern.","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Straight-line path","Latitude":"40.252937","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.252937,+-75.128114(16954)&iwloc=A&hl=en\"> mufon case (16954) map </A>","Tags":"City","trends":["There have been 5 other sightings in Warrington","There were no other sightings in Warrington on or around May 16th 2009","This sighting has never been favorited.",""],"Object Features":"None","Log Number":"US-05162009-0011","Object Shape":"Triangle","Source":"MUFON","Disposition":"Unknown","Case Number":"16954","files":["/var/www/straped/mufon/html2text/16954.html.txt","/var/www/straped/mufon/org/16954.html"],"City":"Warrington","Date Submitted":"05/16/2009 09:59 UTC","Date of the Event":"05/16/2009 09:59 UTC","Longitude":"-75.128114","divs":["Sighting DetailsIn car with wife driving home from movies. Spouse was driving. Both of us witnessed the event. Driving NW on County Line Rd. approximately 4 miles NW of Rt 611. Sighting started with seeing 3 birht white lights in triangle pattern low and to the left ahead of vehicle just above tree line. Lost sight for approximately 10-15 seconds due to trees. Nest saw to our left for approximately 25 seconds total. Again 3 bright white lightsin triangle pattern. Two or 3 red light now visible on underside of object. Object was now clearly siloutted against low cloud cover. Shape was a very distinct black triangle. The bright white lights were at each tip of the triangle. Object was moving slowly to the southeast. After first sighting thought maybe it was a C-130 landing at nearby Willow Glove Naval Air Station. I am a aviation buff, former student pilot and travel weekly by commercial air. I am pretty familiar with most aircraft and can identify what is and isn't normal. After further consideration and discussion with my wife, we know what we saw. There is no doubt in our minds this was not an aircraft. We were not paniced and tried to reacquire sighting by going back in the direction it was going but could not do so. I've followed UFO oly all my life but never expected to really see one. My wife was a skeptic but is now convinced."],"Sighting Duration":"Undisclosed","Region":"Pennsylvania","Country":"United States"}