{"Disposition":"Unknown","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.138105,+-84.580508(16955)&iwloc=A&hl=en\"> mufon case (16955) map </A>","Object Features":"Unknown","Log Number":"US-05172009-0001","divs":["Sighting DetailsI was traveling back from Paulding, OH to Antwerp, OH on Cement Plant Road traveling northwest. I noticed a slow pulsing brilliant bronze colored light with a pure white flashing light that changed patterns between 1 to 3 seconds a pattern (1 sec flash, 2 sec flash, 1 sec flash, 3 sec flash, repeat) hovering in place which then started to move north west towards Antwerp almost parallel with my own direction. This strange light was at a high altitude as it appeared small, but very bright. It then suddenly dropped altitude very abrupt and quickly maintaining the same speed and direction. I noticed that the pulsing bronze light appeared to remain constant in a peak diameter before retracting back into a single point of light and then back again. Both the pure white flashing light and bright bronze pulsing light suddenly started changing in intensity, appearing to randomly change from very dim to very bright. It then began to accelerate and crossed out of view in about 2 to 3 seconds. I believe the lights were fixed onto something as they moved together perfectly."],"Source":"MUFON","Case Number":"16955","Latitude":"41.138105","Date of the Event":"05/17/2009 10:52 UTC","files":["/var/www/straped/mufon/html2text/16955.html.txt","/var/www/straped/mufon/org/16955.html"],"Longitude":"-84.580508","Summary":"Slow pulsing bright bronze light with patterned bright white flash changed altitude at acute angle very abruptly while traveling at very high rate of speed.","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"05/17/2009 10:52 UTC","City":"Paulding","Country":"United States","trends":["There have been no other sightings in Paulding","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path,Other","Tags":"City"}