{"map":"<A HREF = \"http://maps.google.com/maps?q=32.426774,+-104.225648(16969)&iwloc=A&hl=en\"> mufon case (16969) map </A>","City":"Carlsbad","Object Features":"Unknown","Disposition":"Insufficient Data","Summary":"Saw a bright orange object hovering in the sky behind my house to the West.","Case Number":"16969","Object Shape":"Cigar, Circle, Fireball, Star-like","Date of the Event":"05/17/2009 08:26 UTC","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around May 17th 2009","This sighting has never been favorited.",""],"Date Submitted":"05/17/2009 08:26 UTC","Country":"United States","divs":["Sighting DetailsI was on myspace when a friend said he saw something in the sky to the West, and it did not look like a star. I have always been interested in UFO's so I went outside to see for myself, at first I could not see it. Then my boyfriend came outside to look also. I was about to give up when he said look over there behind that tree you can see something glowing. He is much taller than I am so he was able to see it, when I could not. I went out towards the alley behind my house and could see it clearer. I was not sure what it was I was seeing all I knew was that it was not a star, or a plane, or anything I have ever seen before. I then went inside my house to get my camera which is a Nikon D40. I went to take pictures then I discovered I did not have my SD card in my camera so I had to go back inside and get it. I then ran back outside toward the vacant lot behind the alley. I took numerous pictures, the object in the pictures does not fully show what I saw. It was hanging in the sky to the West, it looked like a big bright ball of fire or a bright orange ball not sure which. The object seemed to stay and hover in the same spot. I was scared, and kind of excited I couldn't believe it. I continued to take pictures until the light started to fade out then fully disappeared leaving no trace behind. When I looked at the pictures on my computer I noticed when I blew them up 100% that in some of the pictures it looked like an orange cigar shaped object."],"Object Flight Path":"Stationary","Viewing Distance":"Unknown","Tags":"City","Log Number":"US-05182009-0001","Latitude":"32.426774","Region":"New Mexico","Longitude":"-104.225648","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/16969.html.txt","/var/www/straped/mufon/more/16969_submitter_file1__DSC_0096.JPG","/var/www/straped/mufon/more/16969_submitter_file2__DSC_0108.JPG","/var/www/straped/mufon/more/16969_submitter_file3__DSC_0113.JPG","/var/www/straped/mufon/org/16969.html"]}