{"Summary":"Round object moving and stopping over and over with less than one second interval between moves.","City":"Westminster","Region":"Colorado","Latitude":"39.845333","Country":"United States","Disposition":"Unknown","Log Number":"US-05172009-0006","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/16960.html.txt","/var/www/straped/mufon/more/16960_submitter_file1__RoundMovingObject.jpg","/var/www/straped/mufon/more/16960_submitter_file2__RoundMovingFast.jpg","/var/www/straped/mufon/org/16960.html"],"Source":"MUFON","Tags":"City","Weather Factors":"None, Does Not Apply","Case Number":"16960","trends":["There have been 30 other sightings in Westminster","There was one other sighting in Westminster on or around May 16th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.845333,+-105.034335(16960)&iwloc=A&hl=en\"> mufon case (16960) map </A>","Longitude":"-105.034335","Object Flight Path":"Stationary,Path with directional change","divs":["sighting detailswhile laying on the grass saturday night taking photos of the night sky using my nikon s630 set to night landscape i saw an object on my left move and stop, move and stop, move and stop with about 1\\2 second interval in between each move. i quickly shifted the camera to the location of the object and got off one photograph. since the shutter stays open longer filming at night i had to wait for the camera. i kept seeing this object continually moving and stopping. i got off one more shot before i did not see it again. note: the time stamp on these photos in not accurate. this camera has a problem that needs to be fixed by nikon.the time and date is accuratly set in the time\\date settings but the time stamp is not accurate. this object was about 100' from the ground, probably less than that. it would not stay still long enough for me to make an accurate guess. the object is not very large, less than 50' in diameter. i was very excited seeing this object. my original intentions were to go out and wait for it as i was expecting it and my hunch paid off. looking at the photo one can easily see the object and then the movement, then stop and more movement before stopping again. because the shutter stays open longer using night landscape the camera captured the object and the movement. great camera best i ever owned. great night photography."],"Object Features":"None","Object Shape":"Circle","Date Submitted":"05/16/2009 08:30 UTC","Date of the Event":"05/16/2009 08:30 UTC","Viewing Distance":"101-500 Feet"}