{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.596495,+-82.188467(16970)&iwloc=A&hl=en\"> mufon case (16970) map </A>","Case Number":"16970","Object Features":"Undisclosed","Date of the Event":"05/15/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/16970.html.txt","/var/www/straped/mufon/org/16970.html"],"divs":["Sighting DetailsAccording to my neighbor a few people were discussing an alleged UFO over the Highlands Airport in Abingdon, Virginia. So far, I have been unable to find these witnesses. However, several complaints were called into the local Sheriff's office of a low flying jet going very fast over Abingdon. This jet actually was so loud that it frightened my daughter who was outside playing at the time. I have confirmed that the jet did in fact fly over by talking to several witnesses, including my own wife. Langley AFB in northern Virginia directed me to McGhee Tyson in Tennessee. Attempts to file an FOIA electronically have failed (email is invalid and bounced back). I will be submitting the FOIA via snail mail today. According to Langley and the Sheriff's Office in Abingdon, military exercises were being conducted. I find this suspicious as I have lived in Abingdon for about three years now and have never seen a military jet fly over that low. Furthermore, since there is rumor of a UFO over the Highlands airport, I feel this incident is worthy of further investigation. This incident has also been picked up by Jerry Pippen and included on one of his recent shows - on Saturday. It's worth noting that last year in Abingdon there was a very significant sighting of two Rectangular objects, among others, and is listed in MUFON's database. This sighting took place around the same location - very close to the Highland's airport."],"Tags":"City","Date Submitted":"05/15/2009 12:00 UTC","Latitude":"36.596495","Longitude":"-82.188467","Object Flight Path":"Undisclosed","Weather Factors":"None","Summary":"Low flying jet allegedly chasing UFO.","Country":"United States","Region":"Virginia","City":"Bristol","Object Shape":"Unknown","Disposition":"Unresolved","trends":["There have been 5 other sightings in Bristol","There were no other sightings in Bristol on or around May 15th 2009"],"Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-05182009-0002"}