{"map":"<A HREF = \"http://maps.google.com/maps?q=43.840307,+-88.012493(16975)&iwloc=A&hl=en\"> mufon case (16975) map </A>","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON","Object Features":"Unknown","Case Number":"16975","Weather Factors":"Unknown","Date Submitted":"05/07/2009 10:30 UTC","Object Shape":"Flash, Star-like, Other","Longitude":"-88.012493","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/16975.html.txt","/var/www/straped/mufon/org/16975.html"],"trends":["There have been 2 other sightings in Elkhart Lake","There were no other sightings in Elkhart Lake on or around May 7th 2009"],"Summary":"Strange, slow-moving light increases brightness, fades.","City":"Elkhart Lake","Object Flight Path":"Straight-line path","Latitude":"43.840307","Log Number":"US-05182009-0007","Date of the Event":"05/07/2009 10:30 UTC","Sighting Duration":"Undisclosed","Region":"Wisconsin","divs":["Sighting DetailsIt was later on in the evening, 10:30pm or so. I was seated on my front porch with my wife; we'd just had dinner at a local restaurant, and since it was a mild evening in terms of temperature, we thought we'd catch some fresh air. Our house is in the middle of a small village that's somewhat rural in location, so we can usually see a good amount of stars on a clear night despite living across the street from a filling station. Star-gazing is something we enjoy doing. By no means are either of us professionals in terms of astronomy, but we've spent a fair amount of time gazing up at the night skies. Out of the corner of my eye, I caught something in the northeast sky, directly over a large tree in our neighbors yards. The object was quite a distance away though. It was a dim light, about half the brilliance of an average star seen with the naked eye, and about the same size. What struck me was how slow it was moving. In fact, I said to my wife, \"Well would you look at that slow-moving plane.\" She looked up and saw it too, and just after she looked up the object began to increase in brightness, to where it seemed to reach the brilliance of at least double the brightness of the brightest star in the sky that night; so bright it blotted out the starlight in a circle surrounding it. The brightened for about 3 or four seconds, then began to dim and became so faint I could barely see it when using my peripheral vision, though I still saw it continuing in a straight line until it disappeared altogether. We commented to each other on the strangeness of the situation, as each of us have seen many satellites, birds, and planes in flight at night. We noticed no flashing lights on this object; just a single white light source, the one that brightened and dimmed. Also, there was no sound accompanying this object, as it was dead silent. As I mentioned, I've seen many things which I'd initially were Unidentifiable, but soon became identified with further scrutiny. This was the exception in the sense that I have not been able to settle upon a concrete explanation for the occurrence, which is why I'm reporting it as a UFO in the chances that someone else saw it that night. Another reason why I couldn't settle on the satellite explanation was that it seemed to be traveling from northwest to southeast, and I'd never seen one in that location before, or traveling in a similar direction. I suppose the most likely explanation is satellite, but as I'm not sure, I've reported this to MUFON."],"Country":"United States"}