{"Source":"MUFON","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=34.151072,+-118.448337(16971)&iwloc=A&hl=en\"> mufon case (16971) map </A>","Date of the Event":"06/14/2007 06:00 UTC","Log Number":"US-05182009-0003","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around June 14th 2007"],"Longitude":"-118.448337","divs":["Sighting DetailsThis sighting was one of many that I experienced in the middle of the city in Sherman Oaks, CA, from 2004-2007. I live in a townhome community, and around 6pm, I walked out to the parking lot area of my home, which is approximately 25 feet from my front door. I can't explain why I looked up, but I did, and hovering what would have been very high up in the stratosphere was what appeared to be what had to be an absolutely enormous grey oval, which, from my perspective, looked to be the size of my pinkie fingernail. It was broad daylight, and the oval was illuminated on one side with the setting sun, creating what looked like a reflective stripe around the one side facing the sun. This oval was simply standing still, high above even the thin scalloped stratus clouds. Even though the clouds were traveling south with the wind, the object remained perfectly stationary. This was my first clue that it wasn't some sort of weather balloon, as it would have been traveling with the clouds. I pointed the object out to my partner, who acknowledged it, and that it was unusual, and she promptly went into the house. I remained observing it. I knew it was not a weather baloon, and no idea what it was. It was clearly not an airplane, or a blimp -- if it was a blimp, it would have to be an herculean size, to be that large and above the status clouds. I remained staring at this object for at least fifteen minutes. I did not change it's movement, simply hovered while the clouds traveled beneath with the wind currents. My then-neightbor came out of his townhome, and asked me what I was looking at, after having standing in the parking lot for so many minutes, staring at the sky. I pointed to the object, and responded that I was looking at what I thought was a UFO. He looked up, clearly saw what I was looking at, and at first said nothing, but then said it was nothing but a weather balloon. He seemed very uneasy. I told him it could not be a weather balloon, otherwise, it would be moving with the wind currents, not standing perfectly still. He became very uncomfortable, and ran into the house. I heard his deadbolt lock. He and his family were very devout fundamentalist Christians, so perhaps there was content in the discussion he was uncomfortable with. The large dark grey oval simply stayed up there for a very ling time, around twenty minutes, until it began getting smaller, and more faint, as if it were moving upward through the atmosphere. I was finally unable to see it, as it slowly continued to retreat upward, like riding up an elevator. It never made an radical movements, nor did it move forward or backwards -- only hovered. I noted several other curious phenomenon with the same exact movements as the mysterious grey floating oval, from 2004-2007, in broad daylight, usually in evening and night times. The stationary hovering for long periods of time, and then the fading up and getting smaller, through the atmosphere. The Oval was the most pronounced shape of all, although at one other time I noticed what appeared to be a hovering cigar-shape made up of several spheres, length-wise. Other times, it simply looked like a point of white light that would fade to a more red color, and fade out, as it appeared to up and through the atmopshere over a period of several minutes. I am from Montana origianlly, and have seen unusual activity in the sky. However,I have never witnessed more \"obvious\" activity in the sky as to when I moved to the urban area of LA. This surprises me, but perhaps, because of all the air traffic here, anything in the sky would not be so easily noticed."],"Disposition":"IFO","Weather Factors":"Windy","Country":"United States","City":"Los Angeles","Object Features":"Unknown","Summary":"Dark grey, shaped like my pinkie finger nail.","Latitude":"34.151072","Region":"California","Object Flight Path":"Stationary","Date Submitted":"06/14/2007 06:00 UTC","files":["/var/www/straped/mufon/html2text/16971.html.txt","/var/www/straped/mufon/org/16971.html"],"Object Shape":"Oval","Case Number":"16971","Tags":"City"}