{"Latitude":"43.842157","trends":["There have been 2 other sightings in Elkhart Lake","There were no other sightings in Elkhart Lake on or around May 16th 2009"],"Object Shape":"Circle, Star-like","Log Number":"US-05182009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=43.842157,+-88.009073(16976)&iwloc=A&hl=en\"> mufon case (16976) map </A>","Summary":"What seemed light a shooting star goes erratic.","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/16976.html.txt","/var/www/straped/mufon/org/16976.html"],"Object Flight Path":"Path with directional change,Other","Object Features":"Unknown","Date Submitted":"05/16/2009 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Region":"Wisconsin","Longitude":"-88.009073","Case Number":"16976","Viewing Distance":"Unknown","City":"Elkhart Lake","Source":"MUFON","Date of the Event":"05/16/2009 12:00 UTC","divs":["Sighting DetailsIt was later on in the evening, around 11pm, and I was standing out on my porch, which faces east, having a cigarette before going to bed. My wife was already upstairs reading at that point in time. It was a cold night, probably 40F, which is a bit cool for us this time of year. However, it allowed for a wonderful, unobstructed view of the stars. There were more visible than normal. Very clear, and sharp. There was almost no twinkle to the stars at all. I was simply gazing around, star to star, when out of the corner of my eye, I saw something moving quite fast almost straight above me. From the corner of my eye I thought \"shooting star\" because of the speed and the direction of its travel. The speed was consistent with a shooting star, as was the direction; I couldn't catch sight of it at first after trying to find it looking direct of instead of with my peripheral vision. I finally did catch it looking directly at it, and I was sure it was a shooting star because it glowed blue, and it might have had a little tail to it, but I cannot be sure. No more than two seconds after I locked my eyes on it, the thing went absolutely nuts. Started zig-zagging and jumping around and looping, yet still traveling in the same direction that it was heading in the first place. It took me about two seconds of watching this to realize that it wasn't behaving like a shooting star, and this quite literally freaked me out. Instead of watching it til I saw it disappear, I dropped my cigarette, turned around and bolted into the house, forgetting that my wife was no longer downstairs, but was up in our bedroom. My heart was racing, but I went back outside again to finish my cigarette and size up the situation. I did not see anything more while I was out there. It made no sound, and seemed to be about as bright as a faint shooting star, and there was absolutely no sound."],"Country":"United States","Disposition":"Insufficient Data"}