{"Region":"Oregon","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Log Number":"US-05182009-0011","City":"Bend","Tags":"City","Latitude":"44.065503","Object Flight Path":"Straight-line path","Summary":"A small private airplane was being tailed by a large \"vaporous\" looking aircraft which was in the shape of a large airplane.","Disposition":"Insufficient Data","Longitude":"-121.31182","map":"<A HREF = \"http://maps.google.com/maps?q=44.065503,+-121.31182(16981)&iwloc=A&hl=en\"> mufon case (16981) map </A>","Object Features":"Wings","Date of the Event":"05/17/2009 01:15 UTC","Object Shape":"Other","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/16981.html.txt","/var/www/straped/mufon/org/16981.html"],"Sighting Duration":"Undisclosed","trends":["There have been 20 other sightings in Bend","There were no other sightings in Bend on or around May 17th 2009"],"Date Submitted":"05/17/2009 01:15 UTC","divs":["Sighting DetailsYesterday, Sunday May 17,2009, I was sitting out on the back deck of my home in the sunshine. It was a beautiful clear day..the sky was brilliant blue. There were little or no clouds. I heard above me the sound of a plane engine, but it was more like the buzz of a smaller sized private plane. We live along the flight pattern of the Bend Municipal Airport, so it was not unusual to see a small private plane flying over on a clear day. I glanced up at it ...but did a double take when it appeared to be pulling something larger than itself. It looked like a bigger airplane. As I looked more closely it appeared to be a very large plane, about the size of a water carrier.I knew that planes could not travel that close together.The larger plane was right on the tail of the smaller one. Even more strange was that it had an almost translucent look to it. It was white and vaporous looking.. ...I hesitate to say it but it looked like I could see through it. As the planes traveled in the direction of the airport,they were soon going to be out of sight over the top of my roof.A I stood, I saw the larger plane make a sharp right turn and fly off in that direction. I ran through the house to the front door and ran out...(it would have taken only a matter of 6-7 seconds)..and I expected to resume watching the two planes continue flying in the directions they were headed...but I did not see either plane. I could still hear the engine of the small plane as it seemed to get further away. I should have been able to see it ...but It was no where in sight. The larger plane was not in the distance..it seemed to have just dissapeared into thin air. I called the airport to see if anyone landing around that time had reported anything strange just before landing at the airport, but no one had. I can't imagine if the pilot of that airplane had seen the large plane on it's tail, that they would not have reported it. I have never seen or reported any incident like this before. I am doing so now, in order to find out if anyone else saw what I did. It is very uncomfortable to have seen something like this and to be the only known witness."],"Case Number":"16981"}