{"Source":"MUFON","Tags":"City","Log Number":"US-05182009-0012","Summary":"Light in the sky TWO nights in a row, around same time period. No flashing or running lights like a plane.","City":"Kent","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"-122.230333","Country":"United States","divs":["Sighting DetailsMay 16th (1st sighting): Approx 10:30pm my boyfriend went outside to walk the dog and returned shortly later with a concerned look on his face and told me that he had just watched a very strange light in the sky. His encounter was that the light at first seemed like a plane, and was traveling from west to east. He then further noticed that it had NO flashing lights or running lights like a plane. He stood and watched as the light seemed to have turned to the North and just disappeared. After hearing this we both returned outside to further investigate, but found nothing more. May 17th (2nd sighting): At 9:45pm we are driving home from town (within 3 miles of 1st sighting) traveling N and from the passenger side window I notice this bright light in the sky. It was traveling West to East and the light was a blueish white and bigger and brighter than a star. I kept staring at it trying to see its running or flashing lights. But when I could not see them I asked my boyfriend (who was driving) if the light looked like what he saw the night before. When he seen it, he immediatly tried to follow its direction. It was the same thing that he seen the night before. We tried following it for approx 2 minutes, but the trees got in the way of seeing it any longer."],"Region":"Washington","Viewing Distance":"Unknown","trends":["There have been 7 other sightings in Kent","There were no other sightings in Kent on or around May 17th 2009"],"Weather Factors":"Unknown","Disposition":"IFO","Latitude":"47.390054","Object Features":"Unknown","Object Shape":"Star-like, Other","files":["/var/www/straped/mufon/html2text/16982.html.txt","/var/www/straped/mufon/org/16982.html"],"Case Number":"16982","Date Submitted":"05/17/2009 09:45 UTC","Date of the Event":"05/17/2009 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.390054,+-122.230333(16982)&iwloc=A&hl=en\"> mufon case (16982) map </A>"}