{"files":["/var/www/straped/mufon/html2text/16987.html.txt","/var/www/straped/mufon/org/16987.html"],"Latitude":"40.555036","divs":["Sighting DetailsWife and I went out onto the back porch to have a cigarette. No sooner then stepping out onto the porch my wife looked towards the south west and noticed a strange color in the sky. We thought it might be a small plane in jeopardy, mostly due to the color. We do see patterns of small planes in flight around here with the red and green lights. But this one was larger and the orange looked exactly like a flame in a campfire. As it travelled what really caused us to notice was it broke apart and a piece of the fire swung out and under, like tethered to it like in a \"C\" motion. And the smaller piece tracked with the larger. All we saw was light, no structures. The larger piece that fell under seemed to fade. As the main fireball tracked north, tiny pieces of light seemed to fall off it. Like a spark or ember dropping straight down. These were extremely small, had to squint to notice. This happened at least 4 times at fairly regular intervals as it made it course. We assumed it was a meteor or something burning up as it went across, but travelled alot slower then a shooting star. About as fast as typical plane traffic around here. We lost sight of it as its arc in the horizon was obscured by trees. If I were to look directly south at 0' and north at 180', the course it took this is what happened. If I was to guess, looking off deck we noticed it at a 15' and then around 30' the \"C\" dropped off, 60' a ember, same at 90' 100' and lost it due to trees at 120'. The whole thing was about a minute. My feelings were a plane in trouble. As it continued more or less straight with no dropping I thought it could be a meteor and got concerned due to imagining what size it might have been if it made impact around here. With the embers I wondered if they woudl light anything on fire, but seemed to fade out as there dropped. I don't know what it was. Course was straight so maybe meterological or a plane in trouble."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.555036,+-85.596074(16987)&iwloc=A&hl=en\"> mufon case (16987) map </A>","Log Number":"US-05182009-0017","Country":"United States","City":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"05/18/2009 09:40 UTC","trends":[],"Case Number":"16987","Object Flight Path":"Straight-line path","Date Submitted":"05/18/2009 09:40 UTC","Summary":"Looked orange like a campfire.","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Fireball","Longitude":"-85.596074","Region":"Indiana","Tags":"City"}