{"Weather Factors":"Unknown","Country":"United States","Summary":"Fast, erratic moving Star","Latitude":"40.449918","Date of the Event":"05/18/2009 10:30 UTC","files":["/var/www/straped/mufon/html2text/16994.html.txt","/var/www/straped/mufon/org/16994.html"],"Longitude":"-75.334737","Date Submitted":"05/18/2009 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.449918,+-75.334737(16994)&iwloc=A&hl=en\"> mufon case (16994) map </A>","Region":"Pennsylvania","trends":["There have been 12 other sightings in Quakertown","There were no other sightings in Quakertown on or around May 18th 2009"],"Source":"MUFON","Disposition":"IFO","Log Number":"US-05192009-0002","Case Number":"16994","Tags":"City","divs":["sighting detailsi was debating whether or not to post this sighting. it may have been a satellite, as i'm not sure how quickly one would move across the night sky when viewed with the naked eye. it was 10:30pm on 5\\18\\09 and i was headed out to work. i stopped at my car and looked up at the sky as i frequently do and i noticed a star that was moving quickly and erratically through the sky. from my perspective, it was a single point of light exactly the same size\\brightness of an average star when viewed with the naked eye. it was solid whitish\\yellow, did not blink, and it did not appear to change color\\shape\\size etc... it moved diagonally from about 70 degrees above the horizon on my right-hand side to about 40 degrees above the horizon on my left hand side (estimates), crossing about 2-3 feet of sky at arms length. it was definitely headed in one direction (not looping around or anything), but moved randomly side to side from my perspective. i lost sight of the object as it faded out. there were a few wispy patches of clouds, so it may have just passed behind one of these and given the illusion of fading out. the entire sighting lasted about 10 or 15 seconds. if you need to contact me, 10am-1pm est is the best time b\\c i work 3rd shift and sleep in the afternoon\\evenings. thanks!"],"Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"Unknown","City":"Quakertown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like"}