{"Disposition":"Unknown","Source":"MUFON","Object Shape":"Circle","Log Number":"US-05192009-0003","Region":"Pennsylvania","Viewing Distance":"Unknown","Case Number":"16995","City":"Murrysville","trends":["There have been 31 other sightings in Murrysville","There was one other sighting in Murrysville on or around May 18th 2009","This sighting has never been favorited.",""],"Summary":"Another amber/orange UFO seen in Murrysville, PA-plus 7 more UFOs that night!","Sighting Duration":"Undisclosed","Date of the Event":"05/18/2009 10:20 UTC","Date Submitted":"05/18/2009 10:20 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.432372,+-79.696455(16995)&iwloc=A&hl=en\"> mufon case (16995) map </A>","Latitude":"40.432372","Object Features":"None","Country":"United States","Longitude":"-79.696455","files":["/var/www/straped/mufon/html2text/16995.html.txt","/var/www/straped/mufon/more/16995_submitter_file1__amberUFO5-18-09c.jpg","/var/www/straped/mufon/more/16995_submitter_file2__amberUFO5-18-09b.jpg","/var/www/straped/mufon/more/16995_submitter_file3__amberUFO5-18-09a.jpg","/var/www/straped/mufon/org/16995.html"],"divs":["sighting detailsmurrysville, pa: coming back from monroeville mall around 9:25p.m.-ish, girlfriend was coming down hill on rt 22 by wendy's when looking south, saw an amber\\orangey, larger-than-a-star light that looked similar as one we both saw on 5\\13\\09. she took the 1st kid who went with daughter & friend home, then got back on rt. 22 towards delmont. object was seen at that time by 3 people total in car. no other stars were out yet. no blinking light, it was steady glow--the only light in the sky. not chinese lanterns. her story: decided to try and drive over towards it south off of rt. 22. it was no longer visible. took 2nd kid home in delmont, was returning to home in murrysville on rt. 22, heading west past rick's sports bar, saw it again in western sky to the left of the large radio tower w\\3 or 4 red lights (daughter said it is by cochran car dealership up on hill in monroeville. as we watched it, it got substantially brighter and bigger (like 4 times bigger)... enough that we said, \"whoa, whoa! look what it's doing! it can't be a plane!\" it was moving right, towards the tower while it did it's thing several times--getter brighter, then dimming. we were going to drive to the hill in monroeville by the tower to check it out, when it dimmed to nothing...gone. we turned left onto our road, school rd. south. coming up to top of hill we decided to turn onto farmland that has a 360 view of surrounding area and look for it again. we saw overhead a small star-like object moving in wiggling s-pattern towards south--same pattern as on the 13th! daughter (with much better eyes) saw a total of 5 objects moving within 15-20 minutes, most straight overhead by the big dipper. one i couldn't see until it slowed down then 'flashed' white then moved faster (note: we've seen weird small 'flashes' in the sky--looked and saw nothing... wondering what caused it--perhaps this is the cause!) another craft moving s to n with crazy flashing lights she said moved in arching pattern, back and forth--no sound. she called me on phone about 10:30pm, told me to grab canon camera and go shoot pictures of amber 'thing' that was back in southern sky. at first i couldn't see it because of the trees (she saw it from top of hill clearly--she flashed her headlights at it several times and it scared them by getting brighter like it was coming closer to them). it made erratic 'jump' up above the sky, flashed brighter, moved down, then, up-down, brighter, bigger, more to the right, etc. not knowing how to use a rebel camera, took pics on auto, but flash kept flashing. got one good pic i'm uploading with blowups. the other night it didn't look exactly round and perhaps this is the shape? the light under it was not visible while taking the pics--perhaps a probe? it dimmed to nothing before she came back home and could try and get better pics. she saw 2 other dim objects high up with binoculars shortly afterward we both saw what appeared to be a triangle, rounded edges, with 2 white lights on back, red on bottom, one flashing white light flying e silently... all between 9:30 to 11:00pm! weather clear & cold, no wind. similar orange ufos on youtube video in scotland on may 11, 2009 around 10:30pm with link to tv report: http:\\\\www.youtube.com\\watch?v=-wquuar789e"],"Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Path then hovering"}