{"Latitude":"33.31379","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around May 18th 2009"],"divs":["Sighting DetailsWhile talking on my cellphone around sunset I noticed what appeared to be Venus on the horizon to the Northwest from my kitchen window. For the next five minutes the object remained in the same location and became brighter as daylight faded. This increase in brightness caught my attention since as the sky got darker the object seemed both too bright and too large to be Venus. At this point I assumed it was one of the many airplanes in the Phoenix sky, but quickly realized that it wasn't moving and was not in any of the usual flight paths (My apartment has a view of the South Mountains and Estrella Range to the west and often airplane lights can be seen to the untrained eye as an arc of lights in the sky). But this object was much different and I went to get my binoculars. The object in the binoculars appeared to be a milky white color, luminescent, and seemed to be an upside down triangle or diamond shape. At times there was sparkling or blinking white light on the left side of (and within) the object and then dark areas on the right center. From my vantage point the object remained completely motionless for nearly 30 minutes and then completely disappeared when a fairly small string of clouds drifted in front of it. Two minutes later, the clouds drifted and the object was completely gone. I had been tracking the position of the object in relation to the corner of a building in my line of vision and it did not move as a planet would. About 15 minutes after it disappeared, a lightning stormfront rolled in from the southwest. Local news report mentioned that 1000s of people witnessed this as far away as Sedona (which would be in the correct direction from my postion). Possibly a Nasa weather balloon headed to New Mexico, according to the news report. I've never seen anything like this before and I cannot explain it well enough to do it any accurate justice."],"Log Number":"US-05192009-0001","files":["/var/www/straped/mufon/html2text/16993.html.txt","/var/www/straped/mufon/org/16993.html"],"Weather Factors":"Unknown","Country":"United States","Tags":"City","Viewing Distance":"Unknown","City":"Chandler","map":"<A HREF = \"http://maps.google.com/maps?q=33.31379,+-111.83362(16993)&iwloc=A&hl=en\"> mufon case (16993) map </A>","Object Shape":"Triangle","Object Flight Path":"Stationary","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"05/18/2009 07:30 UTC","Region":"Arizona","Source":"MUFON","Summary":"Motionless bright white inverted triangle in sunset sky for over 20 minutes","Case Number":"16993","Longitude":"-111.83362","Date of the Event":"05/18/2009 07:30 UTC"}