{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.85697,+-114.612152(16990)&iwloc=A&hl=en\"> mufon case (16990) map </A>","Object Shape":"Cone","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsAt 7:50 P.M. Arizona time my husband noticed a bright illuminated object stationary above Mohave Valley Arizona more towards the eastern horizon line. He summoned me to wittness the object which appeared to be either a weather ballon or hot air ballon. The problem with either of the obvious conclusions is that it was transparent and glowing brightly white. While observing the object through a pair of field binoculars we both noticed a long rope, cord or (other) hanging from beneath the object and at the very tip another object appearing to be a globe of some sort hung and glowed brightly as well. Trying to be objective, we looked for signs of a basket or holder for people if it was an air ballon but there did not appear to be any, however we did notice that there was movement in the bottom of the ballon shaped object, (inside of it in fact). We could not determine with our glasses if it was humans or not. What made this sighting intresting is that there is presently a build up to the west of us, of storm clouds, this object was not drifting, not rising or descending, just hanging still in the air, we would have assumed that (if) it was an air ballon that it would have moved, but it did not. The next assumtion, that it was a hot air ballon had already been dispelled by nothing to hold travelers beneath a flame fueled craft, if what we saw inside of the object was human air travelers then we have no idea how they fueled the craft. The object is still in the sky at 8:26 P.M. but now only appears intermittentedly and is not visible constantly as it was before sunset. what it is we can not say, I have seen many U.F.O.s but nothing like this. Attached is two camera phone photographs of the object which has limited blow up capabilities but when I blew them up on my computer the object actually appears to be a globe shaped object. In fact a luminescent globe shaped object was sighted over Arizona yesterday, so we don't honestly know what the dickens it was. Thanks Shaba"],"Case Number":"16990","Disposition":"IFO","Date Submitted":"05/18/2009 07:50 UTC","Sighting Duration":"Undisclosed","Longitude":"-114.612152","Source":"MUFON","Log Number":"US-05182009-0020","City":"Needles","Object Features":"Other","Object Flight Path":"Stationary","Date of the Event":"05/18/2009 07:50 UTC","trends":["There have been 2 other sightings in Needles","There were no other sightings in Needles on or around May 18th 2009","This sighting has never been favorited.",""],"Summary":"Illuminated cone shaped object hoovering above Mohave Valley Arizona","Latitude":"34.85697","files":["/var/www/straped/mufon/html2text/16990.html.txt","/var/www/straped/mufon/more/16990_submitter_file1__Objectinsky.jpg","/var/www/straped/mufon/more/16990_submitter_file2__ObjectintheskyMay18th2009at750PM.jpg","/var/www/straped/mufon/org/16990.html"],"Region":"Arizona","Tags":"City","Weather Factors":"None"}