{"Latitude":"34.487141","Case Number":"17009","Region":"Arizona","Date Submitted":"05/18/2009 07:40 UTC","Sighting Duration":"01:30:00","divs":["Sighting DetailsLooks like quite a few people have already reported this object, and it looked the same to me as they all describe. Around sunset, my wife and I and a few other people noticed it in the sky after a church meeting. Extremely bright and very stationary. I watched it all the way home; as the sky darkened, the object stayed lit up. But I also noticed that the clouds were still lit up as well, which is, of course, because the sun was still shining at that altitude. Also on the way home, I noticed a tiny object dangling from the bottom of the large lit-up one, which was shaped like an upside-down tear drop. Pretty convinced at this point that it was a weather balloon, but the fact that it wasn't moving seemed very strange. When I got home, I grabbed my digital camera and binoculars, and looked first through the binoculars. The object looked very extraordinary and impressive, but absolutely a weather balloon. I took some film footage of it just for fun (see attached). The object stayed in the same position for well over an hour (still seemed strange), and then faded to orange, then black, as the evening sky darkened. I was confused by the stationary aspect of the balloon, but read today on the Web that balloons are sometimes floated to fairly high altitudes (1,500 feet or higher) while tethered to the ground. Obviously the case here... Admittedly, I do believe in \"UFO's\", though I don't believe they're visitors from other planets... In the case of this particular sighting, it simply wasn't a \"UFO\" at all... Sorry... :)"],"trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around May 18th 2009","This sighting has never been favorited.",""],"Country":"United States","Object Features":"None, Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.487141,+-114.316535(17009)&iwloc=A&hl=en\"> mufon case (17009) map </A>","Disposition":"IFO","Weather Factors":"None","Object Flight Path":"Stationary","Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/17009.html.txt","/var/www/straped/mufon/org/17009.html"],"Date of the Event":"05/18/2009 07:40 UTC","Log Number":"US-05192009-0016","Summary":"Mohave County, AZ - UFO at sunset - Mystery solved!!","City":"Lake Havasu City","Viewing Distance":"Over One Mile","Longitude":"-114.316535","Source":"MUFON","Tags":"City"}