{"Object Shape":"Undisclosed","Source":"MUFON","Tags":"City","Date of the Event":"04/12/2009 12:00 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around April 12th 2009","This sighting has never been favorited.",""],"Latitude":"26.649078","City":"Fort Myers","Country":"United States","files":["/var/www/straped/mufon/html2text/17015.html.txt","/var/www/straped/mufon/more/17015_submitter_file2__R1-25A.jpg","/var/www/straped/mufon/more/17015_submitter_file3__R1-23A.jpg","/var/www/straped/mufon/more/17015_submitter_file5___IGP3091.JPG","/var/www/straped/mufon/org/17015.html"],"Date Submitted":"04/12/2009 12:00 UTC","Case Number":"17015","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.649078,+-81.866968(17015)&iwloc=A&hl=en\"> mufon case (17015) map </A>","Summary":"Alien creatures.","divs":["Sighting DetailsMy son Shane saw 2 aliens from his bedroom window. a grey and a reptililian. It was hard to believe him but he was so sincere. He saw them several times thru the month of april and May. I got nervous about it and kept door locked etc. about 1 am an the 16 of May I checked the back door, it was not locked and opened when i checked it. In the morning this foot print was out side the back door. I must have startled it as you can see dirt flew up as it moved quickly to its left. It had rained we had had a drought and it left it's print.I am going to try and send photos. It may not work. If not I will send to mufon, or you can get them from Mary Margaret Zimmer, I was able to mail some to her as I had her e mail address. her e mail is mm@skyscan She can foward pics of the foot print to you . I also have a plaster of paris cast.BIG claws. a foot like a chicken 3 claws in front one in back, or like an eagle, but it has a foot shape too behind the back claw with a heel. Notice the dirt it threw up to the side as it lept sideways.Also it has jumped up on our roof 3x once we heard it. 3 prints are in the front where it just jumped right up. Sincerly Mike"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Region":"Florida","Object Flight Path":"Undisclosed","Log Number":"US-05192009-0022","Longitude":"-81.866968"}