{"City":"Picayune","Log Number":"US-05192009-0020","Summary":"Bright green \"flare\" at constant speed.","Object Flight Path":"Undisclosed","trends":["There have been 4 other sightings in Picayune","There were no other sightings in Picayune on or around May 19th 2009","This sighting has never been favorited.",""],"Latitude":"30.532659","Date of the Event":"05/19/2009 09:10 UTC","Case Number":"17013","Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/17013.html.txt","/var/www/straped/mufon/more/17013_submitter_file1__ufo.JPG","/var/www/straped/mufon/org/17013.html"],"divs":["Sighting DetailsI had just turned down the street and reached an area with two driveways on the left when I saw a bright green (more dark center with a glow than a flare, but \"flare\" in brightness) light travel from right to left in the sky. There are trees along the side of the road, but as I was driving, \"more\" of the path of the UFO came into view as I cleared an area of trees (where there is about an acre of open land by the road on the left). The event lasted about 5 seconds. It moved across my field of view faster than a plane, but about a quarter the speed of a shooting star, and toward the end, because of the brightness and relative motion, seemed more like a flare just above the house about 1,000 ft away. Unlike a flare, there was no smoke trail, and no \"sparks.\" The glow and brightness was constant. The size was about that of a traffic light if stopped at an intersection, but at least double the brightness, and a deeper, perhaps bluish-tinted green. I know there are helicopters that fly to oil platforms offshore, and have even seen a military helicopter or A-10 (national guard) fly a path over this area, but those are almost perpendicular to the path of the UFO. There is another flight path for c-130's that sometimes fly in pairs at night, and there path is close (within 20-25 degrees), but there size, speed, sound, and \"lighting pattern\" are very distinctive. I didn't see nor hear any low-flying aircraft in the area (on the \"drive in\"). I estimate it was debris entering the atmosphere above Indiana moving over Iowa. This object stood-out as being something other than a traditional aircraft, and the it was different enough from known objects to warrent this report."],"Sighting Duration":"Undisclosed","Date Submitted":"05/19/2009 09:10 UTC","Tags":"City","Longitude":"-89.677888","Object Shape":"Fireball, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=30.532659,+-89.677888(17013)&iwloc=A&hl=en\"> mufon case (17013) map </A>","Region":"Mississippi","Viewing Distance":"Unknown"}