{"map":"<A HREF = \"http://maps.google.com/maps?q=35.090091,+-106.647337(17011)&iwloc=A&hl=en\"> mufon case (17011) map </A>","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17011.html.txt","/var/www/straped/mufon/org/17011.html"],"Source":"MUFON","Log Number":"US-05192009-0018","Viewing Distance":"Unknown","Summary":"Looked like pieces of clear balloon floating in sky, not descending.","Region":"New Mexico","Object Features":"Undisclosed","Country":"United States","Case Number":"17011","City":"Albuquerque","Tags":"City","divs":["Sighting DetailsI was stopped at a traffic light at the corner of candelaria & wyoming here in Albuquerque, NM on May 13, 2009 (approx noon), when I noticed what appeared to be several sizable pieces of clear plastic floating in the sky only slightly above the height of the stoplight. At first I assumed this was just litter in the wind but I noticed that these pieces were not falling to the ground or even descending that much at all. Rather they appeared to float around in a whirlwind type of motion consistently staying aloft. I continued oberving this strange material until I noticed that the light had changed. It piqued my curiosity at the time, but when I saw images of the supposed \"NASA balloon\" mistaken for a UFO over New Mexico and Arizona on May 18th I realized that what I saw was the same material. Clear floating plastic material that looks very much like a soap bubble. Only what I saw was not a balloon, but rather pieces of this material as if the balloon had popped and the debris was just floating around. However NASA is caiming that the giant weather balloon blamed for these ufo sightings only launched on Sunday, May 17th. So what is the explanation for several large pieces of this material floating over Albuquerque, NM the prior Wednesday? Another giant clear weather balloon?"],"Date Submitted":"05/13/2009 11:00 UTC","Weather Factors":"Unknown","Object Shape":"Other","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around May 13th 2009"],"Date of the Event":"05/13/2009 11:00 UTC","Latitude":"35.090091","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-106.647337"}