{"Date Submitted":"11/20/2008 10:30 UTC","Date of the Event":"11/20/2008 10:30 UTC","Object Shape":"Unknown","divs":["sighting detailsa friend and i were traveling from statesboro to swainsboro ga at app 1030pm thursday night 11\\20\\08. we travel this route at least once weekly at various times of day and are very familiar with both the route and terrain.i first noticed the object in the northwest sky(the sky was very clear that night)while traveling north on highway 25. we had just crossed the 301 bypass and were heading toward the hopeulikit community that is at the intersection of us 25 and us 80. initially, i thought it was a cell tower that was being obscured at times by the tall pine trees that line the west side of hwy 25 because the light red orange light appeared to blink out at times.(also, there is a cell tower in the area that we also were able to see in the distance.) i brought the light to my friends attention and were both intrigued. as we got closer to the hopeulikit community the light changed from reddish orange to a bright white light and grew much larger and suddenly became 3 lights and blinked out. we stopped our vehicle and got out to see it we could locate and spot it again. we could not see or hear anything. we continued to travel north on highway 25 for a few miles hoping to see it again but saw nothing. we turned around to continue our drive back to swainsboro thinking that what we saw had vanished and that the excitement had ended. upon leaving the hopeulikit community the object re-appeared on the north side of hwy 80. the object appeared to now be red and was flying below the top of the pine trees. the object paralleled our vehicle and appeared to be flying at the same speed 30-35 mph. this took place for a distance of approximately 5 miles.as we entered the portal city limits at the fire dept the object crossed atop hwy 80 and again expanded to 6+ white lights however they appeared much smaller this time.my partner was able to take a picture with a cell phone.(attached) the lights blinked out and the object disappeared. we again pulled over and got out the car but could not see or hear anything. i agree to be interviewed by mufon staff but wish to remain anonymous and do not consent to be contacted by third parties. i do reserve the right to consent to be interviewed at a later date by third parties."],"Weather Factors":"None, Does Not Apply","Sighting Duration":"Undisclosed","Summary":"UFO spotted while traveling west between Statesboro, GA and Portal GA - Reddish orange light turned into multiple spheres and flew along Hwy 80 for approximately 6 miles then disappeared.","Viewing Distance":"101-500 Feet","Case Number":"17016","Log Number":"US-05202009-0001","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17016.html.txt","/var/www/straped/mufon/more/17016_submitter_file2__17016d.jpg","/var/www/straped/mufon/more/17016_submitter_file3__17016e.jpg","/var/www/straped/mufon/org/17016.html"],"Longitude":"-81.932338","Source":"MUFON","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.538222,+-81.932338(17016)&iwloc=A&hl=en\"> mufon case (17016) map </A>","Region":"Georgia","City":"Portal","Object Flight Path":"Hovering then path","Latitude":"32.538222","Disposition":"Unknown","trends":["There have been no other sightings in Portal","This sighting has never been favorited."]}