{"Country":"United States","Object Flight Path":"Straight-line path","Object Features":"Other","Date Submitted":"05/19/2009 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.609395,+-86.976702(17024)&iwloc=A&hl=en\"> mufon case (17024) map </A>","Longitude":"-86.976702","Source":"MUFON","divs":["Sighting DetailsAt around 11:30am I went out back to have a smoke, I was sitting there (facing south) and I looked up and saw a large shiny silver object in the sky moving slowly from east to west. At first I thought it was a low flying jet ( I am not too far from the Huntsville Airport and it was large like the body of a passenger jet) but I noticed it did not have any wings and it appeared to be spinning like a windsock. I thought it was just my eyes playing tricks on me at first but as hard as I tried I could not make out any wings! It went behind a tree top, taking at least 20-30 sec to get to the other side, which in my mind seems a little slow for a large jet to be trying to land at Huntsville, not to mention it was heading away from the airport. As I watched it, it seemed to be descending heading toward the TN River over Decatur Proper. I even thought it might be a large balloon, but a balloon that big and long would have twisted in the wind, also the wind was blowing out of the south and the object was moving WNW. It never changed direction or speed. The only odd thing was it looked like there were dark \"shadows\" moving from front to back which is where I got that it looked like it was spinning I guess. It was, if I had to guess about 2,000 feet up and maybe a half a mile away. I watch the planes in the area all of the time and have never seen anything like it. Also I have been a witness to several other ufo events and this is not the most strange one I have seen, but it is the first daytime ufo I have seen. I waited to see if anyone else was going to report it but no one has...There has to be some other people that saw this. One other thing, I have lived here for over a year, you rarely see military jets but an f-16 flew over around 9 that morning. I have only seen one other f-16 over Decatur and that was 10-11 months ago. If anyone else saw this object, PLEASE report it or let me know what it was."],"Case Number":"17024","files":["/var/www/straped/mufon/html2text/17024.html.txt","/var/www/straped/mufon/org/17024.html"],"Date of the Event":"05/19/2009 11:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.609395","Tags":"City","Object Shape":"Cylinder","trends":["There have been 2 other sightings in Decatur","There were no other sightings in Decatur on or around May 19th 2009"],"Log Number":"US-05202009-0009","City":"Decatur","Summary":"Not really sure what it was...","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Alabama","Disposition":"Unresolved"}