{"map":"<A HREF = \"http://maps.google.com/maps?q=37.78193,+-122.415686(17036)&iwloc=A&hl=en\"> mufon case (17036) map </A>","Sighting Duration":"Undisclosed","Summary":"8-10 orange circles traveled from east to west over my house.","Source":"MUFON","Object Features":"None","Longitude":"-122.415686","Region":"California","divs":["sighting detailsin the early morning of may 20, 2009 between 12am and 1am, i was laying in bed looking out the window and able to see the sky. i noticed a bright star and was looking at that when 8-10 orange circles of light appeared in the sky, lower than the star. at first my brain tried to make sense of it but nothing about the lights seemed as if they could be something familiar. (afterwards i thought it was possible that someone could've been pointing lasers at low cloud\\fog cover but it couldn't have been cloudy if i could see that star.) the circles of light were spread out almost in a line and as they moved from east to west they split into two separate formations of equal numbers. as they came closer to my house i expected them to move faster but they slowed down! they then rejoined into a group and as they passed over my house they spread apart, still moving slowly and then they were out of my range of vision. my feeling at the time was mostly surprise. i was talking to my mate while observing this and as the circles started acting less like something recognizable, i was becoming more excited and astonished finally exclaiming in complete amazement practically pressing my nose against the glass. needless to say, he thought i was crazy as he did not see them because of not have a direct view of the window. i have never seen anything like this before."],"Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/17036.html.txt","/var/www/straped/mufon/org/17036.html"],"Country":"United States","City":"San Francisco","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around May 20th 2009","This sighting has never been favorited.",""],"Latitude":"37.78193","Weather Factors":"Windy","Case Number":"17036","Viewing Distance":"Unknown","Date Submitted":"05/20/2009 12:00 UTC","Tags":"City","Object Flight Path":"Path with directional change,Path then hovering","Disposition":"Unknown","Date of the Event":"05/20/2009 12:00 UTC","Log Number":"US-05202009-0020"}