{"Object Shape":"Square, Rectagular","Latitude":"42.207419","Weather Factors":"None","Longitude":"-72.613541","Case Number":"17035","map":"<A HREF = \"http://maps.google.com/maps?q=42.207419,+-72.613541(17035)&iwloc=A&hl=en\"> mufon case (17035) map </A>","Object Features":"None","Log Number":"US-05202009-0019","Country":"United States","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/17035.html.txt","/var/www/straped/mufon/org/17035.html"],"Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Disposition":"IFO","City":"Holyoke","Source":"MUFON","trends":["There have been 3 other sightings in Holyoke","There were no other sightings in Holyoke on or around May 19th 2009"],"Date of the Event":"05/19/2009 10:40 UTC","Summary":"5 second sighting of very odd looking object that disappeared.","divs":["sighting detailswas driving on 91 north 1\\2 mile or so from exit 17a\\b and something caught my eye in the sky. i looked up and saw a rectangular object with rounded ends; it was about the color of gun metal grey, leaning towards a brown color. it did not appear to move sideways to me, but might have been coming towards me. approximately two seconds later the object \"dipped\" and the sun appeared to reflect off the object, turning the object bright white. the object looked different as it moved\\dipped, going from a rectangular object to something trapezoidal. almost immediately after this it disappeared, as if it \"blinked\" or was \"switched\" off. direct answers to questions: 1. i was driving back to work after picking up office supplies at staples in west springfield 2. it was a very odd color and shape compared to other things i've seen in the sky 3. at first i did not think anything of it (other than noticing its odd shape and color) until i noticed it wasn't really moving and when it then changed color (not really changing color but started to reflect the sun) 4. explained above 5. during and after i became confounded as to what i saw; i still am shaking my head about it."],"Date Submitted":"05/19/2009 10:40 UTC","Tags":"City"}