{"Longitude":"-87.623558","Date Submitted":"05/20/2009 10:20 UTC","Summary":"Came from walking to gas station down my street, got to my house and saw a light (sphere) move slowly across the sky.","Object Features":"Unknown","Date of the Event":"05/20/2009 10:20 UTC","Sighting Duration":"00:04:00","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around May 20th 2009","This sighting has never been favorited.",""],"Case Number":"17037","Log Number":"US-05202009-0021","map":"<A HREF = \"http://maps.google.com/maps?q=41.881284,+-87.623558(17037)&iwloc=A&hl=en\"> mufon case (17037) map </A>","files":["/var/www/straped/mufon/html2text/17037.html.txt","/var/www/straped/mufon/more/17037_submitter_file1__Mufonsketch.jpg","/var/www/straped/mufon/org/17037.html"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Circle, Sphere","Weather Factors":"None","City":"Chicago","divs":["Sighting Details1. Where were you and what were you doing at the time? I was at my yard coming back from the gas station down the street. 2. What made you first notice the object? I'm a star gazer and tonight was a very clear night and u could see most of the stars that aren't ussually visible. 3. What did you think the object was when you first noticed it? A bright star, but only for a second, it was always moving when i first spotted it. 4. Describe the object and its actions and motions. The object looked like a bright star, no blinking lights on this thing from what i saw and i starred at it for a while. It moved slowly from East to West. It was a very wierd sighting, not my first of these kinds of things(i saw one very similiar almost one year ago and reported it). 5. Describe your feelings, reactions and actions, during and after sighting the object. First i didn't think much of it, but as i kept looking and seeing this wasn't the ussual aircraft i see often living by O'Hare airport, and i seen them all, after a while i just kept starring to see if i could spot a red or white blinking light, noting at all. 6. How did you lose sight of the object? It was weird as i know and this can be verified by the weather service that tonight was mostly a clear sky. This is why i find it hard to believe that this thing just dissapeared. I dunno maybe it did dissapear behind a cloud. I saw an airplane come right by it so this couldn't have been it. Maybe it was a sattelite? ..."],"Object Flight Path":"Straight-line path","Disposition":"IFO","Latitude":"41.881284","Country":"United States","Region":"Illinois","Source":"MUFON"}