{"Tags":"City","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/17039.html.txt","/var/www/straped/mufon/org/17039.html"],"Sighting Duration":"00:02:00","City":"Ocean Shores","Summary":"Object in sky directly above, very bright, moving from north curving to SE heading up to space and disapearing.","Log Number":"US-05212009-0002","Weather Factors":"None, Does Not Apply","Object Features":"Unknown","Object Shape":"Star-like","trends":["There have been 2 other sightings in Ocean Shores","There were no other sightings in Ocean Shores on or around May 20th 2009"],"Latitude":"46.976469","Date of the Event":"05/20/2009 11:11 UTC","Source":"MUFON","divs":["Sighting DetailsI went out on my deck to have a cigarette, it was about 10minutes after 11:00pm and as I steped outside I looked up as I always do to see if I can see any shooting stars. I imediately saw a very bright light that looked like a star (brighter than venus)I thought it was a plane coming from SeaTac. There were no blinking lights or other colors. There was just a brightness that made it look like a star. There was no sound. Clear skies.I thought for a few seconds that it was a UFO and that it knew I was watching it(when it was directly overhead). The object moved at a curve or toward the southeast above me and the harbor. The light grew dim and up and away it disapeared. I also saw a shooting star seconds after first seeing the object. The shooting star seemed to pass behind the object when it was over and north of my house. I finished my cigarette and came inside and it was 11:15pm. A similar event happened once before, maybe 6 to 8 monthe ago. The object came from a slightly different direction and from a lower initial visual contact and exited at the same point in the night sky."],"map":"<A HREF = \"http://maps.google.com/maps?q=46.976469,+-124.148915(17039)&iwloc=A&hl=en\"> mufon case (17039) map </A>","Date Submitted":"05/20/2009 11:11 UTC","Longitude":"-124.148915","Region":"Washington","Disposition":"Unknown","Country":"United States","Viewing Distance":"Unknown","Case Number":"17039"}