{"Region":"Michigan","Tags":"City","Source":"MUFON","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.893329,+-84.348263(1703)&iwloc=A&hl=en\"> mufon case (1703) map </A>","Log Number":"","City":"Laingsburg","divs":["Sighting DetailsFrom Form IMy residence is a mobile home in rural country setting 5 miles north ofLaingsburg, MI. Area is a small plane practice area and far away from anapproaches to the Capitol City Airport at Lansing, MI, 30+ miles south. I letmy dog out of the back of the mobile home (facing east) and saw a bright light,brighter than a star, which moved out of the NE slowly toward me and then wentin a westerly direction. I went through the mobile home and out the front door(facing west) to watch it pass out of sight in the west. It went from horizonto horizon. I then walked to the back door to let in the dog. There was asimilar bright light coming out of the northeast, from the horizon and it alsomoved across the sky, but it passed to the southeast until it disappeared behindtrees. There were small planes flying in the area, but these lights bore noresemblence whatsoever to the aircraft. No sound, no running lights. We watchstars and aircraft a great deal in this country area and are familiar withsatellites as well. These were much brighter than a satellite, more like a verybright planet. They were a steady light, not flashing or flickering."],"Object Features":"Undisclosed","Summary":"Nocturnal lights seen in Laingsburg, Michigan","Longitude":"-84.348263","Weather Factors":"Unknown","trends":["There has been one other sighting in Laingsburg","There were no other sightings in Laingsburg on or around October 24th 1985"],"Country":"United States","Case Number":"1703","Viewing Distance":"Unknown","Sighting Duration":"00:05:00","Date Submitted":"10/24/1985 10:30 UTC","files":["/var/www/straped/mufon/html2text/1703.html.txt","/var/www/straped/mufon/org/1703.html"],"Latitude":"42.893329","Date of the Event":"10/24/1985 10:30 UTC","Object Shape":"Undisclosed","Object Flight Path":"Unknown"}