{"Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsBoyfriend and I were in backyard, looking up at the stars and noticed what we thought was a satellite traveling from South to North. Our sky is so clear and unobstructed at night, the stars, satellites, etc., are absolutely clear as a bell & even more beautiful!! I live 22 miles outside of the city limits so I have great views. Anyway, when the \"satellite\" just about reached the roof of my home, which was then straight up from where we were standing in the yard, we both noticed that 2 UFO's left the initial \"satellite\" or \"other UFO\". The supposed satellite continued Northbound. The 2nd of the 3 veered off to the East in an almost arch before straightening out, and the 3rd object veered off to the West, arching and straightening out just like the 2nd did. Needless to say, we were both very excited at the sighting. We just looked at each other and smiled, wondering if we saw the same thing..lol We did! We know that satellites do not change directions like 2 of these objects did! Now we are not sure if it was a satellite that was being flanked by 2 UFO's or there were 3 UFO's traveling together and each went separate ways. Did anyone else manage to see this event? Would be interested in reading your report. Besides us and our friends, we didn't think to put this online until someone mentioned this site to us. I love this site! I was in Phoenix in 1997 when that huge triangle UFO went over. Took some videotape as we were driving East on I-10 but need to get it transferred to regular VHS. Must unpack it and find someone to do that for me...lol"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.275678,+-107.75344(17033)&iwloc=A&hl=en\"> mufon case (17033) map </A>","Object Flight Path":"Path with directional change","Object Features":"Unknown","Viewing Distance":"Unknown","City":"Deming","Region":"New Mexico","Weather Factors":"None","Source":"MUFON","Longitude":"-107.75344","Date of the Event":"02/21/2009 09:00 UTC","Log Number":"US-05202009-0017","Case Number":"17033","Tags":"City","Summary":"UFOs with satellite (or other UFO).","Date Submitted":"02/21/2009 09:00 UTC","Object Shape":"Unknown","Latitude":"32.275678","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around February 21st 2009"],"files":["/var/www/straped/mufon/html2text/17033.html.txt","/var/www/straped/mufon/org/17033.html"],"Disposition":"Unknown"}