{"Country":"United States","Weather Factors":"Unknown","Summary":"Object came from south and made a right turn to the east. Flew approx. 3 miles and then hovered in place before disapearintg.","Source":"MUFON","Date Submitted":"05/20/2009 10:30 UTC","Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=35.662752,+-97.471145(17042)&iwloc=A&hl=en\"> mufon case (17042) map </A>","Tags":"City","Longitude":"-97.471145","Object Shape":"Triangle","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/20/2009 10:30 UTC","Object Features":"Unknown","Latitude":"35.662752","trends":["There have been 16 other sightings in Edmond","There were no other sightings in Edmond on or around May 20th 2009"],"Case Number":"17042","City":"Edmond","divs":["Sighting DetailsMy friend and I were feeding horses in a rural area between Piedmont and Edmond, OK. She was outside the truck and I was sitting in the passenger side. She first saw the object and noticed there was no sound. I got out of the truck and watched the object along with her. This object had 3 red lights and a smaller fourth light of a light color (yellow or white). I could not see the body of the object, but the lights formed a triangle shape. The lights were constant and not pulsating. It was very low and moving too fast with an erratic flight path to be an airplane. The object moved to the east and approximately 3 miles away, it began to hover. It hovered in one place for approximately 30 seconds and then disappeared abruptly. The entire event happened over a period of less than 45 seconds to a minute. At first we wondered why an airplane or helicopter had no sound at that altitude. When we saw the direction of movement, we realized that a plane was unable to perform this movement. We were both observing this movement with a curiosity but when the object stopped the flight path and hovered in place and then disappeared in place, we knew we saw something unusual. Neither of us had consumed any alcohol or drugs the entire day. Neither of us have ever seen anything like this up to this time. Both of us feel a little unsettled at this point."],"Sighting Duration":"00:00:45","Object Flight Path":"Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/17042.html.txt","/var/www/straped/mufon/org/17042.html"],"Log Number":"US-05212009-0005","Disposition":"Unknown"}