{"Viewing Distance":"Unknown","Object Features":"Unknown","Longitude":"-90.508217","Case Number":"17046","Disposition":"Unknown","Region":"Missouri","trends":["There have been 12 other sightings in St Charles","There were no other sightings in St Charles on or around May 20th 2009"],"City":"St Charles","Source":"MUFON","Object Shape":"Sphere, Unknown","Log Number":"US-05212009-0009","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIt was in the evening time. We were making bbq outside on the grill. I am staying in an RV park, not very far from a major airport. A few days before this incident, I heard on the news that there had been a UFO sighting in Saint Louis, so I was purposely looking up keeping a watch, hoping for a sighting of my own. Now I dont know if this is wishful thinking, but I wanted to report this information anyways because it may mean something to someone out there! My fiancee and I happened to be looking up into the sky and I noticed a plane which clearly had white vapor trails coming from its wings (I just assumed it was a very large plane, very high up, like an airbus or something), but then there was another object that was down and to the right of the airplane from my point of view. The object is best described as a shiny dot. I watched it for a while because it just seemed strange to me the 2 crafts were so close to each other in the sky, and it seemed they were close enough to each other, they could crash in mid air. After a few mins I realized the object was following the trails of the airplane and we watched it for a few mins. Then the object just seemed to disappear in thin air, but you could clearly see the other plane still flying along, with its trails still visible."],"Summary":"2 objects in the sky, one disappeared after it seemed to be following the other object in the sky.","Sighting Duration":"Undisclosed","Weather Factors":"None","Country":"United States","Tags":"City","Latitude":"38.786913","map":"<A HREF = \"http://maps.google.com/maps?q=38.786913,+-90.508217(17046)&iwloc=A&hl=en\"> mufon case (17046) map </A>","Date of the Event":"05/20/2009 06:30 UTC","Date Submitted":"05/20/2009 06:30 UTC","files":["/var/www/straped/mufon/html2text/17046.html.txt","/var/www/straped/mufon/org/17046.html"]}