{"Sighting Duration":"00:15:01","trends":["There have been 6 other sightings in Clovis","There were no other sightings in Clovis on or around August 15th 1997"],"Weather Factors":"Unknown","Case Number":"17043","Latitude":"34.410219","Object Shape":"Other, Unknown","Tags":"City","Log Number":"US-05212009-0006","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.410219,+-103.196727(17043)&iwloc=A&hl=en\"> mufon case (17043) map </A>","Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Clovis","divs":["Sighting DetailsIn 1997, I was stationed at FE Warren Air Force Base in Cheyenne, Wyoming. I decided to travel to a friends house who happened to be stationed in Clovis, New Mexico. It was very early in the morning approximately 0100 hours just as I crossed into the state of New Mexico from Colorado. I can not remember the road I was on, however I do remember that the road was winding through a mountain range. It was a clear night and I noticed a set of 4-5 bright lights one right behind the other. The lead light was extremely bright and the remainder of the lights following the first light got progressively smaller and smaller. The lights that were following the lead light seemed to be following the lead light and the travel pattern appeared to mimic that of a snake. I watched the pattern for a few moments then stopped my car and turned the ignition off. I was the only vehicle on the roadway and I could not hear any sound from the aircraft above. I was only in the Air Force for four years but I know what an F-16 and F-15 sound like at altitude and there was no sound coming from this aircraft. Also the formation that this craft was flying was far too close to anything that I had ever seen. I would just like some answers."],"Date of the Event":"08/15/1997 01:30 UTC","Date Submitted":"08/15/1997 01:30 UTC","Source":"MUFON","Country":"United States","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/17043.html.txt","/var/www/straped/mufon/org/17043.html"],"Summary":"Strange lights.","Region":"New Mexico","Longitude":"-103.196727"}