{"Sighting Duration":"Undisclosed","City":"Paw Paw","Log Number":"US-05212009-0016","Weather Factors":"Unknown","Longitude":"-78.458344","Object Features":"Undisclosed","Date Submitted":"05/21/2009 11:15 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/17053.html.txt","/var/www/straped/mufon/org/17053.html"],"Source":"MUFON","Case Number":"17053","divs":["Sighting DetailsI just went out on my deck before retiring. My house is elevated -- very clear views for a great distance. To the North of my deck is a large mountain that I believe is Town Hill Mt which I think lies in Maryland - I am very close to maryland and am just beside the Potomac - I am in Hampshire County, WV. Honestly -- I keep my eyes open for UFOs here because I can see so far and it is rural -- no lights, lots of stars. So -- tonight I finally saw one. It was roughly spherical - it was totally illuminated a rich golden, almost the color of cantaloupe. It very very definitely was beaming a spotlight down onto the ground. Where it was - is a location I look at every day -- I know it well. There is nothing there but trees -- it was the base of this mountain and at times it \"beamed\" farther up the mountain. As if it were looking for something -- but there is nothing over there I dont think even any houses. It stood PERFECTLY still a lot of the time. Usually with its \"beam\" shining down. If it were a helocopter I should easily have been able to hear it here -- it is very quiet here and this object was not very far away -- maybe 5 miles. Maybe 2 miles. It eventually moved off toward the West -- that might put it heading over Keyser, WV, maybe Springfield or Ft Ashby - maybe it would eventually get near Cumberland MD. When it moved off, it was slow. Still beamed down from time to time. I assume that a helocopter does not glow golden with a consistent bright golden light all around it. I think a copter would have headlights -- but not the entire thing would be shining bright gold. I dont know how quickly you read these reports -- but if you could forwarn someone west of me to be ready I think they could film it. I tried to photo it -- will review the pix in a minute but I dont think they will be helpful."],"Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Paw Paw","There were no other sightings in Paw Paw on or around May 21st 2009"],"Summary":"Roughly spherical illuminated object its light was golden with small red lites also sometimes. It was very definitely beaming a \"spotlight\" onto the earth.","Region":"West Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=39.532038,+-78.458344(17053)&iwloc=A&hl=en\"> mufon case (17053) map </A>","Disposition":"Unknown","Object Shape":"Sphere","Date of the Event":"05/21/2009 11:15 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"39.532038"}