{"Region":"Idaho","Summary":"Silent but speedy and dark object cutting through the night sky.","Country":"United States","Disposition":"IFO","Date Submitted":"05/19/2009 11:15 UTC","divs":["Sighting DetailsI was watching the sky from my backyard facing due east when out of the corner of my eye to the south I caught movement. I turned expecting to catch a glimpse of a shooting star but what I saw was not lit up at all. The object moved across my field of view from South to North moving at a very high rate of speed; not quite as fast as a shooting star might move but it appeared many times faster than a satellite might seem to move. I did not notice any light as you would see with a star or satellite. There was absolutely no sound and just before I lost sight of it to the North it appeared to slightly angle to the east. The best way I can explain it is it appeared as if something was CUTTING through the sky. This is why I marked the shape as a cigar. I can not tell if the object was shaped like a cigar or what but it was almost like watching a jet boat on the water from a high mountain top where there was a sort of wave or ripple left behind although there was no noticeable length of tail and I could not distinguish between the object and the sky. It took approximately 3 seconds to go from one side of my view to the other. I watched this object move across the whole of my horizon and thought to myself: \"No way, what the hell was that? Seriously, what the hell was that? No way, no way!\" The night was mostly clear but with a few high altitude light hazy sort of clouds around. The more I think about it the more I wonder if it could have been some sort of stealth military air craft, but I just don't know."],"Longitude":"-116.786582","Object Flight Path":"Straight-line path,Path with directional change","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=47.766016,+-116.786582(17056)&iwloc=A&hl=en\"> mufon case (17056) map </A>","trends":["There have been 5 other sightings in Hayden","There were no other sightings in Hayden on or around May 19th 2009"],"files":["/var/www/straped/mufon/html2text/17056.html.txt","/var/www/straped/mufon/org/17056.html"],"Weather Factors":"Unknown","Object Shape":"Cigar","Date of the Event":"05/19/2009 11:15 UTC","Object Features":"Unknown","Latitude":"47.766016","Viewing Distance":"Unknown","City":"Hayden","Log Number":"US-05222009-0003","Case Number":"17056"}