{"Date Submitted":"11/30/1980 07:00 UTC","Object Flight Path":"Path with directional change","Date of the Event":"11/30/1980 07:00 UTC","Weather Factors":"None","trends":["There have been 2 other sightings in Ooty","There were no other sightings in Ooty on or around November 30th 1980"],"Object Shape":"Star-like","Disposition":"Unresolved","Source":"MUFON","Region":"Tamil Nadu","City":"Ooty","Object Features":"Unknown","Latitude":"11.420678","files":["/var/www/straped/mufon/html2text/17058.html.txt","/var/www/straped/mufon/org/17058.html"],"Tags":"City","Case Number":"17058","Longitude":"76.698216","Summary":"Wandering star.","Sighting Duration":"Undisclosed","divs":["Sighting DetailsThe year was 1981, and I was in 8th Grade at St.Georges Homes, Ketti, Nilgiris Dist., India. Three or four friends and me were waiting outside the school dining hall one evening at around 6.30pm or 7.00pm for a movie to begin in the Dining hall which doubled as a movie theater once a month, when one of us, pointed towards the sky and started watching a star that was moving, slowly like a satellite would.It looked just like any other medium sized star, but dont remember if it twinkled. At first we thought that we were looking at a satellite, however we realised it couldnt be a satellite because sometimes it stopped, sometimes it went backwards and also sideways in fact we realised it did not seem to have a fixed path, to us, the kids observing the star, it just seemed to move from one star to another randomly. We watched this star for a few minutes and then what happened next was so strange that it will be hard to believe. The star stopped moving when it was near the first star in the constellation Big Dipper. One of my friends casually remarked \"What if it moved to the next star in the same constellation?\" and to our surprise the wandering star appeared to do just that, it moved next to the next star in the constellation. Since what just happened excited us, we again tried our luck and said \"What if the star went back to the first star?\" Lo and behold it did just that, as if it was understanding or listening what we were saying. In this way, I think we spent nearly quarter or half an hour ordering the star about in the sky and everytime, it moved exactly to all the stars we asked it to move to. As a graduate in Science, I know that as per the laws of Physics it is impossible for any object to move so fast from one star to another and also that the stars in a constellation only appear to be in a particular formation because of the position of the earth and solar system. But no matter what, the moving star did give us the impression it went near every star we asked it to go to...Have no clue how it did that or how it made us believe it was doing that or how on earth it heard what three or four small kids were talking between themselves. There were other students near us when all this was happening, but for some reason we did not alert the other kids nor did we talk about the incident till I met one of my friends twenty three years later...Very strange, but true. A couple of years earlier, the whole school had seen two small moon like stationary objects..."],"map":"<A HREF = \"http://maps.google.com/maps?q=11.420678,+76.698216(17058)&iwloc=A&hl=en\"> mufon case (17058) map </A>","Log Number":"IN-05222009-0005","Country":"India","Viewing Distance":"Unknown"}