{"Weather Factors":"None","Longitude":"-117.322022","Object Flight Path":"Straight-line path,Path with directional change,Other","files":["/var/www/straped/mufon/html2text/17051.html.txt","/var/www/straped/mufon/org/17051.html"],"Sighting Duration":"Undisclosed","City":"Lake Elsinore","Tags":"City","Case Number":"17051","Object Shape":"Triangle","Country":"United States","Log Number":"US-05212009-0014","Viewing Distance":"Over One Mile","Date Submitted":"05/20/2009 09:00 UTC","Latitude":"33.669947","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.669947,+-117.322022(17051)&iwloc=A&hl=en\"> mufon case (17051) map </A>","Summary":"UFO seen by husband and wife approaching from the northeast.","trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around May 20th 2009"],"Date of the Event":"05/20/2009 09:00 UTC","Region":"California","Source":"MUFON","Disposition":"IFO","divs":["Sighting DetailsGuys, I Didn't know who else to e-mail outside of my circle of friends about what my wife and I witnessed last night. My wife and I saw something in the sky's over Lake Elsinore Ca that appeared to be a satellite moving in orbit coming out of the North East at extreme altitude or space. The object appeared to be traveling a little faster than a typical satellite moves which got my attention. We were out on our deck observing the lake and the stars when it appeared. I had my binoculars with me which I use to observe air traffic witch is a hobby of mine being a Helicopter pilot. When I saw the object I decided to look at it with my binoculars. I was able to follow it and trying to make out its shape. Thats when it started to slow down then circle around and stop. In a panic I told my wife to look at it. It then appeared circle around it' position a couple times and then hover again. We then saw another light that seemed to be turned on and thats when i was able to make out its shape. As I looked at it with the binoculars I could see that there were 3 lights in triangle formation. In the center was a dark shadow. So it was definitely triangular shape. Suddenly it emitted a blue flash of light almost looked like when you look directly at a laser beam head on but with a rapid flashing. About 2 mins later it light up and shot out about a 30 degree angle up and upon doing so it almost resembled the opposite of a shooting star but at a upwards vertical rather than down. This scared us quite a bit and we were both panicking. I don't have pictures or video because it all happened in about 8 to 11 mns and I was glued as well as my wife. We just recently moved here and my recorder is still boxed up in the garage. I have already ruled out the space shuttle for we wouldn't need it if we had a craft like this. My wife and I are shaken up about this and I am questioning the reason for all this. I can talk in more detail about this verbally if you like. Lucius Luciano"]}