{"Viewing Distance":"Unknown","Date of the Event":"05/05/2009 05:07 UTC","Disposition":"Unresolved","Tags":"City","Country":"United Kingdom","Object Features":"Unknown","Log Number":"GB-05222009-0002","Object Shape":"Triangle","City":"Peterborough","Longitude":"-0.24053","Sighting Duration":"01:00:00","map":"<A HREF = \"http://maps.google.com/maps?q=52.569498,+-0.24053(17055)&iwloc=A&hl=en\"> mufon case (17055) map </A>","Weather Factors":"Unknown","Summary":"Slow moving craft with second orb coming out.","Date Submitted":"05/05/2009 05:07 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17055.html.txt","/var/www/straped/mufon/org/17055.html"],"Latitude":"52.569498","Case Number":"17055","divs":["Sighting DetailsAround 4:50am, I was awoken by my two dogs barking like mad. beliving it was someone in my back garden, I went outside to see who it was. I went down stairs and into my back garden where I saw my dogs jumping up, upon going outside and looking around and up to see what the dogs here barking at. I saw a massive triangle object, moving slowly, i would say in a north west direction. I could see the 3 corners of the object as each corner had a light on it, this light was a soft white light, and I could see the dark outline of the triangle itself. and as it moved slowly i was blocking out the stars. At this time my husband had come down to see what was going on when I pointed it out to him and he claimed it was just a plane going over head. he went back to bed while i watched this object slowly moving over some fields. the craft was very high up in the sky. I really could not say how high it was. The craft itself started to move away from my sight, so i quickly got some jeans and top on, and took my dogs into the back fields. (a note for where I live, it is very flat and newly built, so very open). the craft at this time, i would say about 5:25 started to get smaller and go faster, i can only guess it was moving up in height and in speed. I noticed that a small orb of light seemed to appear from the middle of the craft and float down and vanish. i say float down as i would have though it would have dropped quicker if it was not under control. after this the craft quickly moved away and vanished into the distance over the next 30 mins. The craft made almost no sound, there was alittle humming sound, but it seemed more like a humming feeling than a sound itself. as i said before there was soft light on the 3 parts of it and you could make out the black body part that formed the rest between. i could not make out any more about it. the orb that came out from it seemed to appear from the middle of the craft and floated down. i am not sure what it was, it was just a orb(sphere of light) that floated down. While seeing the craft, It made me feel very relaxed and peaceful."],"trends":["There have been 2 other sightings in Peterborough","There were no other sightings in Peterborough on or around May 5th 2009"],"Region":"England","Object Flight Path":"Hovering then path"}