{"City":"Iraan","Object Features":"None","Longitude":"-101.897906","Source":"MUFON","trends":["There have been no other sightings in Iraan","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/17067.html.txt","/var/www/straped/mufon/org/17067.html"],"Viewing Distance":"20 Feet or Less","Disposition":"Unknown","Date of the Event":"05/12/1989 12:00 UTC","Object Flight Path":"Other","Date Submitted":"05/12/1989 12:00 UTC","divs":["Sighting DetailsI don't know what to put for county event occurred in. I just selected a random county so I could submit. I have always believed in the existence of UFOs, but never saw anything I could categorize as such until my freshman year of college. My best friend at the time, Raymond, accompanied me on a long day trip from Odessa to San Antonio. We wre freshmen in college, and didn't have enough money to spend the night in a hotel. We took just enough money for eating and drinking. Around 10 p.m., we headed back to Odessa, about a 5 hour drive. We were on the last leg of the trip where we had to pass threw some of the small towns on the way North from I10 to Odessa. These are towns where the population is generally under 1,000. At night, you're the only one driving down main street. As we started to approach Rankin, we noticed that on the open highway behind us, there appeared to be a motorcycle behind us. We were doing about 65 mph. I owned a Dodge 4 cylindar that wouldn't do much more than 80 mph. The strange thing is, the light came right up on us, and then stayed right off our rear bumper. With no one else in the road for miles in either direction, we didn't know why the vehicle wouldn't just pass. Over the next few minutes, it would drift back maybe 100 yards, then close the distance again. It did this repeatedly, for miles. What happened next is we started seeing two lights, in different configurations, that is... one on top of the other, or two side by side. We were already concerned, it was clear we were being \"messed with\" by something. Rankin was approaching on the horizon. As we came in town, the main road lead right to a convenience store. We pulled in the lot and turned the car back in the direction we had just came from. We wanted to see what had been behind us. The light had drifted back as we approached town. We sat there, pretty scared at this point, waiting... for about 10 minutes. Nothing ever came. We slowly drove through the small town, looking for the state highway on the outskirts. The entire way, there were street lights. Nothing ever came through that town behind us, we watched carefully. We got back on the road, this time headed toward Iraan. We drove a solid 10 minutes past Rankin with nothing in the rear view mirror. Then, off in the distance, we saw a single light, again closing the distance. We really became concerned at this point. I tried driving faster, but it made no difference to the light, the same pattern of behavior continued. I asked Raymond to climb into the back seat and look closely through the hatch window. Even though the light was right on us, it appeared just to be a light. We couldn't see the outline of a vehicle, person, motorcycle, anything. It just appeared to be a light. I have had people ask me why I didn't just tap the breaks or stop the car. I don't think it really seriously ever occurred to us. Raymond and I just wanted to keep going... to get home. We were in the middle of nowhere, and if we could just keep going, that was the best thing. We came into Iraan, and did the same thing. We sat in the lighted parking lot of the first convenience store we saw, and waited. Nothing. This time, we even waited longer. But sure enough, once we were a good distance outside of town, the light appeared. The light followed us until we were only about 40 miles outside of Odessa. As the lights loomed on the horizon, the light just faded off into the distance, and left us alone. Could it have been a person somehow doing this and we just couldn't see them? Sure. But why? We're talking about a great distance this light followed us, and for over two hours. I have no logical explanation for this. I lived in a house alone back then. I do know that it was one of the most terrifying nights of my life. Even when I got home, I laid in the darkness of my bedroom feeling the STRONGEST sensation of being watched all night. When sunrise came the next day, it was the most beautiful thing I had ever seen. I took my wife to meet Raymond in San Antonio after we got married (Raymond lives there now). The two couples were having dinner, and Raymond brought it up. It is something that has never left the minds of either of us."],"Country":"United States","Weather Factors":"None","Region":"Texas","Sighting Duration":"Undisclosed","Object Shape":"Circle","Summary":"Lights pursued our car for over two hours between small towns in dead of night","Case Number":"17067","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.914048,+-101.897906(17067)&iwloc=A&hl=en\"> mufon case (17067) map </A>","Latitude":"30.914048","Log Number":"US-05222009-0013"}