{"City":"Monsey","Object Features":"Undisclosed","Sighting Duration":"01:00:00","Summary":"Bright silent slowly hovered into the sky.","Disposition":"Unresolved","Object Shape":"Circle, Oval, Star-like, Unknown","Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-05222009-0010","Latitude":"41.115407","Source":"MUFON","trends":["There have been 2 other sightings in Monsey","There were no other sightings in Monsey on or around April 22nd 1988"],"Tags":"City","Longitude":"-74.060545","Date Submitted":"04/22/1988 05:00 UTC","files":["/var/www/straped/mufon/html2text/17064.html.txt","/var/www/straped/mufon/org/17064.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.115407,+-74.060545(17064)&iwloc=A&hl=en\"> mufon case (17064) map </A>","Date of the Event":"04/22/1988 05:00 UTC","Case Number":"17064","Region":"New York","divs":["Sighting DetailsI was outside talking to a friend and my brother when I noticed a bright light in the sky, I pointed it out and my brother joked that it was a watch tower, but you cannot see any mountains from my house- it was weird how there was something that looked like a comet just standing still. It really fascinated me when I noticed this. I have always kept up with UFO news and this clearly wasn't a plane, helicopter, or a planet- so I made the connection that it is a unidentified flying or hovering object. This bright light seemed to appear to be changing sizes ever few seconds and it would brighten and dim its lights constantly. It seemed like it was staying in the same place for pretty long but after 20 or 30 minutes it started to slowly drift upwards. This whole event really surprised me, I plan on keeping an eye out more often- I am fascinated that there are these mysterious silent things in the sky that seem to come out when everyone is sleeping. I lost sight of the object because I was tired so I went into my house and checked up on it every few minutes and eventually it just drifted away."]}