{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/17078.html.txt","/var/www/straped/mufon/org/17078.html"],"Log Number":"US-05232009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=40.863746,+-79.892173(17078)&iwloc=A&hl=en\"> mufon case (17078) map </A>","Summary":"Tear drop rose out of the old axel building.","Date Submitted":"05/22/2009 03:13 UTC","Weather Factors":"Unknown","divs":["sighting detailsi was on my route today when i passed with in 1000-1500 feet of the old allegeny axel building, when there was a small rumbleing coming from the plant and since the plant had been closed for a few months i had figured it was just some of the local goth scene doing one of their larp games in the plant when the rumbleing increased to a ear paining level. then sections of the old bay door had opened and judgeing by the size of the bay door i would belive the object was at least 8 and 1\\2 feet wide and 10 feet long. hovering about 3-4 feet off the ground it came out of the bay horizontal before it made a lazy 90 degree turn to the sky and lifted about 20-30 feet high and then paused flashed a 15 second series of red, gold and blue lights before it turned 90 degrees again to become horizonal with the ground and then slowly turned towards the south west and started to slowly move forward before it shot off. one neighbor hood homless person approached me and asked if i just saw the tear of god leave. this was roughly 10 minutes later"],"Disposition":"IFO","Tags":"City","City":"Butler","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Teardrop","Viewing Distance":"501 Feet - 1 Mile","Region":"Pennsylvania","Date of the Event":"05/22/2009 03:13 UTC","Latitude":"40.863746","Country":"United States","Case Number":"17078","Sighting Duration":"00:45:15","trends":["There have been 6 other sightings in Butler","There were no other sightings in Butler on or around May 22nd 2009"],"Object Features":"None","Longitude":"-79.892173"}