{"Sighting Duration":"00:01:10","Latitude":"32.729159","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","City":"Fort Worth","Disposition":"Unknown","Date Submitted":"11/30/2004 10:30 UTC","Date of the Event":"11/30/2004 10:30 UTC","Object Features":"Unknown","Log Number":"US-05232009-0001","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around November 30th 2004"],"Case Number":"17076","Longitude":"-97.31916","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.729159,+-97.31916(17076)&iwloc=A&hl=en\"> mufon case (17076) map </A>","Tags":"City","Summary":"Hover, slow snail pace, mach one, 45 degree angle shot at light speed from south to west direction.","Region":"Texas","Country":"United States","files":["/var/www/straped/mufon/html2text/17076.html.txt","/var/www/straped/mufon/org/17076.html"],"Weather Factors":"None","divs":["Sighting DetailsWalked on to front porch facing south to smoke a cig., Looked right and noticed looked like a red light hovering in distance over tree tops like a chopper but didn't hear it. It was a bright red light and it looked like it was sort of faintly strobing. I watched it hover then it slowly at a snails pace moved south for several seconds like it was going to cross Hwy. 67 and suddenly it got up to mach one speed like a fighter jet and hit a 45 degree angle and shot like a beam of light west and disapeared with a tiny beam of light that reminded me of a sewing needle behind it. I could hold a nickel up and thats the distance away.I felt like I had just saw a ghost. I was alone and my husband was in the bed asleep. I went in an woke him up and of course he didn't take me serious. It was unbelievable and my knees bent under me and I felt almost sick because I never actually believed that I would ever be one to see that sort of thing. I wonder what they are looking for , their purpose, what they want and how they fit into reality if u will. Very scary that I know man doesn't have those type of aircraft capabilities and what is next, I don't want to see another. About 4 months before sightings in Stephenville,my daughter looked south out the window and ran to the north back door and told her dad and I to look and a huge airplane like a B-2 but way bigger flew was flying over our house at only about 1500 - 2000 feet and it scared us that it was flying so low it would crash. It was flying parallel with I-35W headed north towards Burleson, Texas. There is Spinks airport in Burleson but have never seen a aircraft of that size land there. Sometime before the 2005 sighting, I was sitting outside again looking at the stars west and saw what looked like a star in the way far distance shoot out like a star but it was going in a slanted upward position."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Object Shape":"Bullet, Missile, Circle, Fireball, Flash, Star-like"}