{"Tags":"City","Sighting Duration":"00:03:30","Object Features":"Undisclosed","Date Submitted":"06/15/1992 12:00 UTC","Log Number":"US-05232009-0011","Weather Factors":"Unknown","trends":["There have been 45 other sightings in Allentown","There were no other sightings in Allentown on or around June 15th 1992"],"Date of the Event":"06/15/1992 12:00 UTC","Case Number":"17086","Summary":"Multiple Encounter with Four UFO's","City":"Allentown","Object Flight Path":"Path then hovering","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.6132,+-75.480553(17086)&iwloc=A&hl=en\"> mufon case (17086) map </A>","Longitude":"-75.480553","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/17086.html.txt","/var/www/straped/mufon/org/17086.html"],"divs":["Sighting DetailsHi, my name is Edward Mundy. The date is May, 11 2009. I am 27 years old and when I have seen the UFO's I was about 9. I will never forget what I have seen with my own two eyes. My friend and I were having a sleep over and were up till about 2AM and we were looking out my windows. For some reason I seen that a flashing red light was blinking on top of the mountain for airplanes just in case they fly too low. The lights at that time were hardly ever on and for them to just start blinking for no reason was weird. So my friend and I were looking for a plane and all of a sudden we seen a purple and blue light blinking above the clouds. We kept watching and the sky actually opened up and a UFO came out of the opening and flew around the area it came out of and stopped. It shined a beam of light straight down and was moving the light around almost like shining a spotlight around looking around for something. Then a few minutes later three more came out of the same hole in the sky and split up and went separate ways almost like looking for something. It didn't last long and the three smaller ones went back up in the hole in the sky and the bigger UFO before following back in the sky pulled its beam back up and shot something toward my back yard. My friend and I were scared because we didn't know what to think but for some reason I couldn't stop watching the UFO and it then went back in the hole in the sky and the lights faded and had gone. That morning we went and looked in the back yard and field and could not find anything. I am telling you this because I seen your show last night when you were in bucks county, Pa. It struck me just then that the same thing happened to me that happened to these other people and i know that if this UFO shot the same thing that shot on your show that that guy has it has to still be there. I still know about where this thing landed. You can contact me by e-mail or my cell. (610)573-0860. I am giving you this number because I know what I seen, I know what happened. And will never forget it. Again I know that thing has to still be there. Thanks for your time. Ed Mundy"],"Object Shape":"Disc","Region":"Pennsylvania","Source":"MUFON","Latitude":"40.6132","Country":"United States"}