{"Object Features":"None","Summary":"Giant triangular aircraft flies directly over my house.","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Case Number":"17087","Date of the Event":"03/29/2009 11:30 UTC","Weather Factors":"None","Source":"MUFON","Tags":"City","Object Flight Path":"Path with directional change","City":"Hartford","Latitude":"41.772801","Log Number":"US-05232009-0012","Disposition":"Unknown","Date Submitted":"03/29/2009 11:30 UTC","divs":["sighting detailsit was late at night on march 29, 2009. i was lying in bed, trying to go to sleep, when i heard a quiet rumbling\\vibrating noise outside. i had previously seen a ufo on march 19 (the report is on mufon if you want to check it out), which had made a quiet rumbling\\humming noise. i quickly made a connection between the sounds, and leaped to my window to see what i could see. i searched the night sky, hoping to see something intriguing. after a few seconds, i saw a large triangular craft fly directly overhead. it approached me from behind, and apparently flew right over my house. it had 3 brilliant, bright white lights (1 on each corner). after about 5 seconds, it slowly turned left and flew out of sight. i was indoors, and i wasn't really able to see it after it turned left, so i ran outside, but by the time i got there, it had disappeared. strange things have been happening in the skies over my area. besides the triangular ufos, i've noticed an increased amount of air traffic in my area, including an abundance of contrails, commercial planes, and this weird helicopter with some red and white lights that's been flying over my house recently. i hope that someone can catch this thing on video or something before it just disappears."],"Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.772801,+-72.675763(17087)&iwloc=A&hl=en\"> mufon case (17087) map </A>","Object Shape":"Triangle","trends":["There have been 13 other sightings in Hartford","There were no other sightings in Hartford on or around March 29th 2009","This sighting has never been favorited.",""],"Longitude":"-72.675763","Country":"United States","files":["/var/www/straped/mufon/html2text/17087.html.txt","/var/www/straped/mufon/more/17087_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/17087.html"]}