{"Longitude":"-84.667222","trends":["There have been 6 other sightings in Gaylord","There were no other sightings in Gaylord on or around May 18th 2009"],"Summary":"Two lights on each craft then turning to three lights like a triangle.","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-05232009-0007","Case Number":"17082","Source":"MUFON","Region":"Michigan","Tags":"City","Object Shape":"Triangle","Object Features":"Unknown","Date Submitted":"05/18/2009 11:00 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/17082.html.txt","/var/www/straped/mufon/org/17082.html"],"divs":["Sighting DetailsIt was Monday May 18, 2009 when my fiance, a friend and I were sitting outside on our porch in the hot tub. We were all talking and I looked up at the sky to see if I could see the stars that night. I remember I noticed something coming out of the east side of the sky there were two orange or a dim red looking lights on two different aircrafts. I pointed this out to the others I was with and started joking around about being happy about not being on that plane. There was clearly two crafts and they were a short distance apart. Thats when I realized that they didn't look like airplanes at all. My Fiance said that they had to be airplanes, although there was no flashing lights or anything that would look like a normal airplane. It was clompletly silent. We sat and watched them silently fly over us and as they did the two lights that were on both of the aircrafts turned into three lights in the shape of a triangle. It lasted for about 10-15 minutes. They just stayed the exact same distance apart and changed lights at the exact same time. When I finally couldnt see them anymore it was because they were out of my viewing area. I remember sitting there and just watching this happen not wanting to take my eyes off what I was seeing."],"City":"Gaylord","map":"<A HREF = \"http://maps.google.com/maps?q=45.036113,+-84.667222(17082)&iwloc=A&hl=en\"> mufon case (17082) map </A>","Date of the Event":"05/18/2009 11:00 UTC","Latitude":"45.036113"}