{"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.345851,+-94.725197(17080)&iwloc=A&hl=en\"> mufon case (17080) map </A>","Summary":"Triangle multi-leveled object hovered over Highway 7 east for 15 minutes, then it disappeared.","Log Number":"US-05232009-0005","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/17080.html.txt","/var/www/straped/mufon/org/17080.html"],"Case Number":"17080","divs":["Sighting DetailsI was in my front yard searching for my cats to bring them in for the night when I located my female cat who was looking up at the sky. So I looked up and to my amazement, a huge multi-leveled triangular object was hovering in the sky. I have never seen an aircraft that even looks remotely similar to this object. The object was in a vertical position in the shape of a triangle with white orbs illuminating its 3 points. The object was silent as it hovered. I stared at it for a few minutes before I went inside to get my binoculars. Viewing the object through the binoculars, I noticed an alternating red and green pulsating light in each white orb. After I had been looking at the object for about 10 minutes, a small white orb quickly shot out of the left side (my left) of the object. At this point, I was wondering if I should call 911. I then walked to the property next door to get a different view of the object. This view revealed a silver cylinder rotating clockwise in the middle of the object. The object remained motionless and silent for 15 minutes before it just disappeared before my eyes. The event caught me by surprise, but it was exciting until the white orb shot out of the object. At that point, I became concerned for my safety."],"Source":"MUFON","Object Shape":"Sphere, Triangle","Date Submitted":"05/23/2009 02:45 UTC","trends":["There have been 7 other sightings in Lufkin","There were no other sightings in Lufkin on or around May 23rd 2009"],"Weather Factors":"Unknown","Region":"Texas","Date of the Event":"05/23/2009 02:45 UTC","Object Features":"Other","Country":"United States","Tags":"City","Object Flight Path":"Stationary","City":"Lufkin","Latitude":"31.345851","Longitude":"-94.725197"}