{"Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=46.716214,+-122.954297(17085)&iwloc=A&hl=en\"> mufon case (17085) map </A>","trends":["There has been one other sighting in Centralia","There was one other sighting in Centralia on or around May 22nd 2009"],"Summary":"Very bright oval object, no sound and moved steadily through our sky, dimmed and extinguished. May 22, 2009 10:38 PM","Latitude":"46.716214","Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"05/22/2009 10:39 UTC","City":"Centralia","Date of the Event":"05/22/2009 10:39 UTC","Tags":"City","Longitude":"-122.954297","Object Features":"None","Viewing Distance":"Unknown","divs":["Sighting DetailsOn May 22, 2009 at 10:38 PM in Centralia, WA we saw a very bright oval object appear on our west horizon line, traveling W-E at a steady pace at what appeared to be approximately 3000 to 4000 feet in the air. It passed our home making no sound at all and then it appeared to slow down as it approchaed a hill, then faded (started dimming) to a pale yellow then extinguished, as if one was blowing out a candel. This entire event took place in five minutes. We looked at it through very high powered binnoculars and looked for strobbing lights, red lights, a comet tail, fire, anything to explain that it was an aircraft, sattalite, meteor, etc.....it had none of these discriptives. It was nothing like we have seen before. When we noticed the object we were in our back yard, putting away our telescope when we noticed the object thinking it was a very low flying plane. I ran for the binnoculars and was able to capture it in the view finder. No distinguishable shape other than the oval light. No blinking lights, no colored lights and no sound. We were trying to figure out what it was, and then it simply disappeared before our eyes, prior to the hill it was approaching. It seemed that it needed to exstinguish it's lights before approaching the hill. (?) Then we saw it \"blow out\" and couldn't see the object any further. Our feelings? Very confused! We wanted more than anything to explain what it was, and that's frustrating because it's like nothing we have ever seen. We have no military testing bases anywhere near us, there is a small airport but this object had no strobe light or sound. Whatever it was it was flying very low to the ground, as we said, 3-4000 feet. We are curious if anybody else in Lewis County, WA saw the same object?"],"Weather Factors":"Unknown","Country":"United States","Log Number":"US-05232009-0010","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/17085.html.txt","/var/www/straped/mufon/org/17085.html"],"Sighting Duration":"00:05:00","Case Number":"17085","Disposition":"IFO"}