{"map":"<A HREF = \"http://maps.google.com/maps?q=32.821138,+-96.945514(17100)&iwloc=A&hl=en\"> mufon case (17100) map </A>","Disposition":"Unknown","Latitude":"32.821138","Viewing Distance":"101-500 Feet","Object Features":"Other","City":"Irving","Tags":"City","Country":"United States","Object Shape":"Disc","Longitude":"-96.945514","files":["/var/www/straped/mufon/html2text/17100.html.txt","/var/www/straped/mufon/more/17100_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/17100.html"],"trends":["There have been 18 other sightings in Irving","There were no other sightings in Irving on or around July 31st 1967","This sighting has never been favorited.",""],"Case Number":"17100","Date of the Event":"07/31/1967 12:00 UTC","Summary":"Saw glowing orange with orange lights object rise from nearby trees, remain stationary, lights changed to red, white and orange, then took off at 45 degree angle.","divs":["Sighting DetailsIn the summer of 1967 at the edge of Irving, Texas my then boyfriend (later husband and now ex-husband) and I were driving to visit his Aunt and Uncle when I noticed a light behaving oddly (starting and stopping) in the sky. Upon arriving at his Aunt's home (an apartment complex), my boyfriend suggested they come look at the light. The Aunt, Uncle, their three children (aged from about 9 to 15), the boyfriend and I all went out to look a for the light. We were in an newly developed area and surrounded by low woods. At first I was looking in the sky and did not spot it. In a hushed voice the Aunt said \"I see it!\" and I looked at her. Her eyes were huge and she looked stunned. I said \"where?\", and she pointed at ground level. I then saw not a light but an object not in the sky, as I expected, but rising from some nearby trees. It was about the size of two or three of the treetops, and it was shaped like two shallow bowls placed together at their edges. There was a row of lights around the center (at the junction of the rims of the two bowls). The lights were orange and the entire object glowed orange, although the lights were so bright that I could not tell if the object was orange or if it was metallic and reflecting the orange of the surrounding band of lights. This was clearly an object, not a light or a reflection. It rose slowly (straight up) until it was well into the sky (I will guess 500 to 800 feet, though I am not a very good judge of altitude). It remained stationary, and after a few minutes the lights changed color and started flashing in a sequence of red, white and orange. The different lights were different colors at any given time and I could not discern a pattern to the color changes. The object remained still for several minutes, flashing the red, white and orange lights. The lights were again too bright for me to be sure of the color of the object, but it either glowed or was highly reflective. After several minutes, it took off at a 45 degree angle and vanished in seconds. It did not simply disappear, it grew smaller with distance as it left, so I knew it was flying away, but it flew so rapidly as to be gone from sight in seconds. Our little group returned to the house and after briefly reassuring one another that we had all seen it, we sat in absolute silence for a while. My feeling was that I had seen something that was impossible, and I sat in silence trying to reconcile what I had seen with what I believed to be possible. I guess we sat there for 30 min. to 1 hour, because then it was time for me to get home (I had to be home by 10:00PM). I suppose we were all too stunned to talk about it. What was there to say? Even the children were silent. I reported it to Carswell Air Force Base in Fort Worth, but they did not seem interested and may have thought it was a prank. It wasn't. I have tried to find other people who saw it or something like it. I met a man (we became friends) who saw an identical object on a rural road near Hallsville, Texas (at night that same summer) and followed it in his car until it took off over trees where he could not follow. He was closer to the object than my group, and he said it made a humming sound (I heard no noise). There were absolutely no drugs or alcohol involved in our sighting. My now ex-husband will not discuss it other than to say he saw something because he says people will think he's crazy if he describes what he saw. I am not crazy. I did dream once about it several years later. I dreamed that I awoke to find that my room was filled with brilliant orange light. I don't remember the middle of the dream, but at the end I felt contaminated with the light, as if I were glowing orange. I only mention this as a reaction to seeing the object. I read of your site when I saw mention of a woman in Texas who had seen something similar to this in 1967. I have always wondered how many people saw what I saw, and if they have any explanation for it."],"Weather Factors":"Unknown","Region":"Texas","Object Flight Path":"Stationary,Hovering then path,Other","Source":"MUFON","Log Number":"US-05242009-0003","Sighting Duration":"Undisclosed","Date Submitted":"07/31/1967 12:00 UTC"}