{"Case Number":"17105","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Country":"United States","Disposition":"Unknown","Source":"MUFON","divs":["Sighting DetailsI have told this story to a handfull of people (believers and non-believers), and to this day the event remains very accountable to the events of what we saw. I always wondered if anyone else saw what we saw. I do not know where the other eye witness is these days, but I'm sure he would tell the story the same as I would. So here goes. Are you familiar with Detroit? We lived in what is known as \"New Center\", which is an area about 2 miles north of downtown Detroit and just west of Woodward Avenue on Bethune Street. Our house was right next and east of the John Lodge Expressway. This neighborhood (street) no longer exists anymore. At somepoint GM bought out the complete neighborhood and renovated every home and put up high priced condo's, complete with security walls and private security. The \"New Center\" area is the home to the Fisher building, a beautifull skyscaper complete with a lit up golden top and was thus nicknamed \"The Golden Tower of the Fisher Building\". At one time this buliding housed the Detroit AM radio station WJR. Also in New Center was the home head quarters of GM, before they moved to the Ren Cen. It was an area of homes, a few skyscrapers, restaurants and hotels, not far away one would find the home of Mowtown, the Henry Ford Hospital, and Wayne State University. It was summer, could of been June, July or even August, all I remember about that, was that it was hot. The year I believe to be is 1975. My room mate Jeff Fields was standing on the front porch. Our front porch faced south. If you were standing on this porch, the Golden Tower of the Fisher Building would have been on your left, 3 blocks east and two blocks south. To the right of the porch would have been the John Lodge Expressway and the service drive for the expressway. Myself I was sitting in the living room of the house reading a science fiction novel (please don't hold that against me) when considering weather my accountability is authenic or not. It was dark outside, approximatly 9 or 10pm when my friend Jeff yelled out, \"John, come here\"! I admit I was really enthralled into my novel and ignored Jeff. Jeff yelled out again, \" John you got to come here, quick\". I again ignored his request, but when Jeff sounded frantic and yelled out, \"John come here, you ain't going to believe this\", I slowly got off the couch and walked out onto the porch and said, \"Okay, what?\" Jeff who was standing on my lefy pointed to the sky and said, \"Do you see that?\" At the time I didn't see anything so I said, \"See what?\" Jeff said, \"You don't see THAT?\" \"SEE WHAT\", I again exclaimed. At this point Jeff's finger was shaking as he was pointing to the sky and his voice was rather loud when he said, \"YOU DON'T SEE THAT?\" And well so I did, and at this point neither one of us said a word until what we saw was gone from out view. What we saw was a classical flying saucer, right out of the movies if you will. It was hovering above the New Center area south of the Howard Johnsons but only maybe a few hundred feet above the entire New Center landscape area. If it had been daylight you could have told what type of plane it might have been, it was flying THAT low. There wasn't any noticable sound coming from the craft. Even though it was dark you could still make out the outline of the object. My guess is that if it would have landed it would taken up the entire footprint of the Howard Johnsons restaurant and hotel. It had what looked like large rectangular lights on the side that were moving counter clockwise. It hovered here for a while sometimes moving up and slightly west. We had what seemed like quite a few moments to witness this. Slowly the saucer shaped object continued to move due west. After is had past over the John Lodge Expressway the lights seemed to rotate a bit faster, and then a bit faster yet, when all of a sudden the lights blurred together and headed in a south west direction toward old Tiger Stadium and within seconds the speed of this craft was gone from our sight. I had this feeling over me that I had just witnessed a once in a lifetime event, it left me in awe, but gratefull to now truly be able to say that, \"Yes, I belive that there is life on other planets\". I am not embarrased to tell this story, or afraid that people might think I am \"nuts\". Overall we estimated we had at least 3 minutes to witness this craft, and we talked about it often. We looked the next day to see if there were any reports in the paper, but this was in the \"old Days\" before the internet and found no other reports of this sighting. I found this amazing that we could never find any other eye witness's. My Dad, although retired at the time worked for the FAA at Metropolitan Airport, and was always getting called on planes out and about over Detroit that were not supossed to be there, and yet this object to my knowledge was never picked up on a radar. Well I know what we (I) saw, and it was classic. I have always believed that there was or is life outside of this planet, but after seeing this I became a true believer.My wife and I both intend to become members of MIMUFON and MUFON soon. Contact me if you wish. Thank you. Please note that there was another time I witnessed something unidentifiable in the sky. This time it was not the classic saucer shape I witnessed in this report, but something more bizarre, and I still am not sure what it was that I saw. I will make those claims in another report due to the nature of the time and people involved. Sincerely, John Reed"],"City":"Detroit","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-05242009-0008","Longitude":"-83.041094","files":["/var/www/straped/mufon/html2text/17105.html.txt","/var/www/straped/mufon/org/17105.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.334087,+-83.041094(17105)&iwloc=A&hl=en\"> mufon case (17105) map </A>","Viewing Distance":"501 Feet - 1 Mile","Latitude":"42.334087","Object Shape":"Disc","Date Submitted":"07/10/1975 09:00 UTC","Region":"Michigan","Object Features":"None","Date of the Event":"07/10/1975 09:00 UTC","Weather Factors":"None","trends":["There have been 56 other sightings in Detroit","There were no other sightings in Detroit on or around July 10th 1975"],"Summary":"It was not a short glimpse. Witnessed by two people for over 3 minutes+, then took off."}