{"Object Features":"None","Date of the Event":"05/23/2009 02:10 UTC","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17107.html.txt","/var/www/straped/mufon/org/17107.html"],"Sighting Duration":"Undisclosed","Weather Factors":"Does Not Apply","Country":"United States","City":"New Port Richey","Case Number":"17107","trends":["There have been 18 other sightings in New Port Richey","There were no other sightings in New Port Richey on or around May 23rd 2009"],"divs":["Sighting DetailsMy husband and I were driving south on Starkey Blvd in New Port Richey between Decubellis and Seven Springs when I happened to glance up toward the sky through my windshield. I saw what I, at first, thought was a plane but, upon closer inspection, I saw no wings, no windows, no markings and no tail fin like all airplanes have. This object was flying low enough that I could clearly see it was silver in color and had no other characteristics of an airplane. It was too big to be a small aircraft yet, smaller than a commercial aircraft. The craft was flying from west to east. As I watched the object flew into the bottom section of a cloud just a few thousand feet above us to the south. I waited for it to come out the other side. The cloud that this craft flew into was tall but not very wide. Any airplane would have come out the other side in just 3-4 seconds. This did not. It just disappeared into the cloud. Unfortunately, my husband did not see it and I had not mentioned it until the object neglected to appear on the other side of the cloud. This is only the second time I have seen something that I cannot identify. Both sightings have taken place in the same area within the past 2 months. It's hard for me to believe that no one else saw this object yesterday."],"Tags":"City","Viewing Distance":"Unknown","Region":"Florida","Log Number":"US-05242009-0010","Object Flight Path":"Straight-line path","Summary":"Long, silver, cigar shaped object flew into cloud and didn't come back out.","Object Shape":"Cigar","Longitude":"-82.716647","map":"<A HREF = \"http://maps.google.com/maps?q=28.252857,+-82.716647(17107)&iwloc=A&hl=en\"> mufon case (17107) map </A>","Date Submitted":"05/23/2009 02:10 UTC","Latitude":"28.252857"}