{"Viewing Distance":"101-500 Feet","Date of the Event":"04/12/2009 09:50 UTC","Object Flight Path":"Hovering then path","Sighting Duration":"00:25:00","Source":"MUFON","Object Features":"Patterned Surface","Object Shape":"Triangle","Disposition":"Unknown","Summary":"After loud helicopters passed, HUGE, dark triangle hovered very low over mine & adjoining townhouses, hard to see, finally saw 2 red and 1 white lights, moved off very slowly.","Country":"United States","Date Submitted":"04/12/2009 09:50 UTC","files":["/var/www/straped/mufon/html2text/17108.html.txt","/var/www/straped/mufon/org/17108.html"],"Latitude":"33.948713","Log Number":"US-05242009-0011","Case Number":"17108","Weather Factors":"None","Longitude":"-84.210671","Tags":"City","trends":["There have been 10 other sightings in Norcross","There were no other sightings in Norcross on or around April 12th 2009"],"divs":["sighting details**this report is being entered by asd & fi ralph howard because sighting account was not put into cms by witness but instead was sent to sd tom sheets via email on 4-15-2009. this account is taken verbatim (with minor editing for typos) from that email. case investigation initiated friday april 17-2009.**------------------------------------------------------ i would like to inform you of a sighting i had on april 12, 2009 (easter night). the time was 9:50 p.m. i was upstairs in my bedroom watching tv. (my bedroom is in the back of my townhouse.) i heard some really loud helicopters in the distance, they were so loud i figured they were military choppers. i occasionally see\\hear military helicopters because of dobbins afb. i have a habit of running to look at them when i hear them. on sunday night the sound of the helicopters appeared to be louder than the other times. for some reason they were taking a longer time to get to my general area. i decided to go and open the blinds to my window and wait for them to pass over my home. i have a limited view of the sky due to tall pine trees. i scanned the sky and trees to my right and left waiting to see how many choppers were passing me. as i looked to my left i noticed a bright white light that was blinking on and off. i then noticed a red light blinking on my left, i couldn't understand because i waiting for these helicopter to show up. i turned and looked on my right (a good distance) and i see another red light! at that point the white light and both red lights stayed on, and the complete shape of a triangle was in my view! (it was going very, very very slow!!). i realized that i was viewing this thing from underneath it as it passed over my house, the bottom was just above tree level (very low)! once it passed (very slow pace) i was able to see the whole back side of it. it appeared light in color maybe light gray, i couldn't tell the height of it but the distant between the back corner red lights gave me the sense that this thing was beyond big! there were a total of 3 helicopters, one flanked on each side of the triangle and one behind it. the helicopters didn't appear to be chasing this triangle but more like pacing it. i heard no sound coming from this triangle, no interference with my tv. also, the flight pattern was odd because planes don't fly over my house at all. i don't see any planes traveling parallel with holcomb bridge rd. heading toward ga 400\\roswell area! i can understand why it took a longer time for the helicopter to fly over me, because of slow the speed they were going. slow, slow, slow!!"],"City":"Norcross","map":"<A HREF = \"http://maps.google.com/maps?q=33.948713,+-84.210671(17108)&iwloc=A&hl=en\"> mufon case (17108) map </A>","Region":"Georgia"}