{"divs":["Sighting DetailsI have had quite a few sightings that I have reported to MUFON and although I believe most could be explained away my last sighting (the one about the pulsating 15 min light) and this one I posted tonight have me convinced that these two sightings were not natural by any means though perhaps this one may be military but it certainly felt other worldly if that's possible. Again I had a witness with me and it was the same person who saw the last sighting with me this time however we were speechless and did not talk to one another till after the sighting because we were taken by surprise to see something so big. I mean when we noticed and looked at the lights we swore a plane was about to fly in to your apartment! it took a really long time to glide across the sky however it seems as if we were looking at it for almost 20 minutes. When it first appeared there was a helicopter hovering around it but it seemed to fly away very fast for some reason then the craft which when all electronics in the house were turned off and the windows open we could not hear anything but oddly enough we could feel a vibration I can't really put it in to words. What really got me and my friend however is that it looked like a giant boomerang, it was really big I don't know how to really explain it only that we both agree it was the biggest craft we had ever seen. I wish I could show you how big it was it was easily 2-300 feet wide, unfortunately though this time we weren't equipped with the tools needed for evidence...we just didn't think we would see something again and especially like this. But then to top it all off the craft began to suddenly fly vertically and it looked like a giant vertical boomerang in the sky."],"Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.903872,+-77.030226(17104)&iwloc=A&hl=en\"> mufon case (17104) map </A>","Object Shape":"Boomerang","Case Number":"17104","Latitude":"38.903872","Weather Factors":"None","Longitude":"-77.030226","Region":"Maryland","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Unknown","Tags":"City","Summary":"Silent triangle craft glides across the skyway too perfectly to be natural.","Source":"MUFON","Date Submitted":"05/24/2009 09:40 UTC","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around May 24th 2009","This sighting has never been favorited.",""],"City":"Washington","Log Number":"US-05242009-0007","files":["/var/www/straped/mufon/html2text/17104.html.txt","/var/www/straped/mufon/more/17104_submitter_file1__sighting09.jpg","/var/www/straped/mufon/org/17104.html"],"Date of the Event":"05/24/2009 09:40 UTC","Sighting Duration":"00:19:00"}