{"Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-05242009-0013","Tags":"City","Latitude":"38.256328","Region":"California","files":["/var/www/straped/mufon/html2text/17112.html.txt","/var/www/straped/mufon/org/17112.html"],"Object Shape":"Square, Rectagular","Country":"United States","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Flight Path":"Straight-line path","Case Number":"17112","Date of the Event":"01/31/2001 12:00 UTC","Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=38.256328,+-122.036646(17112)&iwloc=A&hl=en\"> mufon case (17112) map </A>","City":"Fairfield","trends":["There have been 15 other sightings in Fairfield","There were no other sightings in Fairfield on or around January 31st 2001"],"Summary":"3 craft moving east to west slowly, no noise.","Longitude":"-122.036646","divs":["Sighting DetailsI was driving across town to pickup a coworker and was approaching a major cross street. The buildings afforded a good view to the left (east) of the intersection and I looked that way to make sure that no drunks were going to run the light (I had the green. I had to do a double take because I saw three street lights that seemed odd or out of place from the rest of them. When I looked again, I saw that these 3 lights appeared to be moving towards me. I quickly came to a stop and verified this and then pulled into a parking lot and got out of my car. As the craft approached (and they did so very slowly) I noticed that the center craft appeared to be having control problems as it moved in a very jerky fashion. The 3 craft were not directly behind each other but slightly to the right of the craft in front of it. When they were overhead, I could see the underside of them from the reflected light. It appeared that the front of the craft (with the light) was lower than the back but that the edges of the back were at the same level as the front. In this 'raised' area of the middle craft, I could see an 'arm' moving around as if making some kind of repairs. These 3 craft were at the same elevation which was very low, maybe 100 to 150 feet and made no noise that I could hear from almost directly undernieth. Two other vehicles stopped and the occupants also observed these objects. When the objects disappeared over the buildings, I got back in my car and picked up my coworker and raced out to the highway because we had to go in the same direction that these craft were moving but they were gone already."],"Date Submitted":"01/31/2001 12:00 UTC","Weather Factors":"Unknown"}