{"divs":["Sighting Detailsmy eyes glazed and things seperated i shook it off and looked too the sky....a giant star...thats always tehre(im always looking) it moved..slowly so slowly you almost chouldent tell it was moving....my glassses were off but it was big and the light was a white and blue...i was thinking of my own oersoanly faults at the time(for fruedian refrence)....i woke my grandmother and she saw it...too big to be a plane for the airport nearbye....and WAY too bright. move over my house....breif conversation with my gram....i cant speek russian only english (SH) refrence to a dream i had aabout teleportation and actualy cahnging shape to do imporablity of survival in lightspeed travel...(yada yda changing shape combats the effect of the energy reduction this is kind of hard to explain check out austrailian record for teleporting a set of atoms in a proton across asutrailia via fiber optics)...i have blue eyes and blonde curly hair...i know for fact that if you stare at the sun while in a certain eclipse the spectrum will burn you eyes and turn them green with agold ring. Personal opinion....i wanna go home. That or they were ahving techinicle difculties."],"map":"<A HREF = \"http://maps.google.com/maps?q=44.197006,+-72.502049(17119)&iwloc=A&hl=en\"> mufon case (17119) map </A>","Sighting Duration":"Undisclosed","Longitude":"-72.502049","City":"Barre","Object Shape":"Circle, Star-like, Unknown","Weather Factors":"Unknown","Summary":"Another one...2 in 3 weeks.VT","Latitude":"44.197006","Object Flight Path":"Path with directional change","Country":"United States","Date Submitted":"05/24/2009 09:47 UTC","trends":["There have been 2 other sightings in Barre","There were no other sightings in Barre on or around May 24th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date of the Event":"05/24/2009 09:47 UTC","Region":"Vermont","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17119.html.txt","/var/www/straped/mufon/org/17119.html"],"Disposition":"Hoax","Case Number":"17119","Log Number":"US-05242009-0019"}