{"Region":"Wisconsin","Object Features":"Unknown","Longitude":"-88.105169","Log Number":"US-05242009-0022","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/17122.html.txt","/var/www/straped/mufon/org/17122.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.070527,+-88.105169(17122)&iwloc=A&hl=en\"> mufon case (17122) map </A>","Disposition":"Unknown","Sighting Duration":"00:00:08","City":"Brookfield","Date Submitted":"05/24/2009 09:20 UTC","Country":"United States","Object Shape":"Sphere, Star-like","Date of the Event":"05/24/2009 09:20 UTC","Source":"MUFON","trends":["There have been 5 other sightings in Brookfield","There were no other sightings in Brookfield on or around May 24th 2009"],"divs":["Sighting DetailsSitting on the back porch looking upward at about a 45 degree angle, I was admiring the stars and I see a white star-like round object moving from right to left at a visual height of about 1500 feet. At first I thought it was a satellite then realized that this is much lower and brighter. I was under a table umbrella so I did not see the primary beginning location. I watched it move about twice as fast as a commercial airliner for about 8 seconds, and after 5 seconds the bright white light dimmed a little, slowly dimming until the light source turned off or disappeared. Too fast for a plane, too bright and low for a satellite. I've never seen this sort of light and movement in this area after residence of two decades. One thing that I must point out is that there have been a curious amount of military maneuvers via helicopter over the past few years, to the point where they are low enough to take a visual image of residents. I had one fly over my house and stop and shine the search light on my face and move in. It was completely unnerving and scared the hell out of me. I have no idea if the to correlate in any way but there are maneuvers and for the first time in my residence here I made the conscious decision that what I witnessed pass in front of me was worthy of report. Thank you."],"Latitude":"43.070527","Summary":"Star-like, bright fast moving anomaly, slowly dims then disappears.","Object Flight Path":"Straight-line path","Weather Factors":"None","Case Number":"17122"}