{"Weather Factors":"None","Country":"United States","Region":"Ohio","Log Number":"US-05242009-0023","Date Submitted":"05/24/2009 10:05 UTC","Date of the Event":"05/24/2009 10:05 UTC","Object Flight Path":"Straight-line path","Object Features":"Unknown","Case Number":"17123","files":["/var/www/straped/mufon/html2text/17123.html.txt","/var/www/straped/mufon/org/17123.html"],"City":"Monroe","Summary":"Fireball with a tail in eastern sky.","trends":["There have been 7 other sightings in Monroe","There were no other sightings in Monroe on or around May 24th 2009"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=39.442536,+-84.353823(17123)&iwloc=A&hl=en\"> mufon case (17123) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Latitude":"39.442536","Longitude":"-84.353823","divs":["Sighting DetailsWe were sitting out by a fire(4 of us) when I noticed the fireball. I was looking up at the sky, to the east, and initially thought it might be a falling star but as it continued I realized that it was orange and lasted too long to be a star. My next thought was a meteor but the last meteor I saw was white. It was orange, shaped like a ball with a tail. It was falling down. I yelled out to my friends \"What is THAT?\" We all jumped up to get a better view because it dropped out of sight due to the tree line. I would say it was visible for a good 10 seconds. One person was able to see it split into two parts. We also noticed helicopters flying towards it and heard lots of unusual air traffic about 20 min. after it happened (so much so it prompted a drive out in that direction which yielded no further information)we thought it might have been a plane wreck. I came home tonight and watched the local news and was interested to see a report of a UFO last night in the same general area (this one was 3 white lights in a triangle shape, covered by channel 12 news and shot with a cell phone). This footage was shot over Lebanon, Ohio which is north of where we thought the fireball and helicopters were (our estimate was that this event was over Mason, south of Lebanon)"],"Object Shape":"Fireball","Sighting Duration":"00:00:10"}