{"Longitude":"-88.297322","Summary":"My little friends","files":["/var/www/straped/mufon/html2text/17135.html.txt","/var/www/straped/mufon/org/17135.html"],"Log Number":"US-05252009-0011","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.893568,+-88.297322(17135)&iwloc=A&hl=en\"> mufon case (17135) map </A>","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"04:00:00","Region":"Illinois","Latitude":"41.893568","trends":["There has been one other sighting in Geneva","There were no other sightings in Geneva on or around May 25th 2009"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"05/25/2009 04:00 UTC","Case Number":"17135","Weather Factors":"Unknown","City":"Geneva","Disposition":"Hoax","Tags":"City","Date of the Event":"05/25/2009 04:00 UTC","Object Shape":"Other","divs":["Sighting DetailsIm so full of myself I might as well brag. Most important of all, I hate people, I hate every person Ive ever met. So anyhow I witness nightly UFO sighting for over 3 years. They know when Im outside in the middle of the night smoking and blink theyre lights at me and cruise off at impossible speeds. I am so Omunicious I can often disect stars from ships hidding among them, I even remember the code to the one I used to own, I watch his hands do it in vision because it is still my property. Couple weeks ago I had a large fleet of like 18 ships moving in sync stopping directly above my house seemingly just to hang out. Not a night goes by I do not see a Ship. Supposidly there are various species of \"aliens\". I was one of them, obviously I killed myself to be a Sh*tting monkey. Hahahahaha, I have been denied work by every company, denied sex and dating by every woman although I am a handsome six foot four white man with blue eyes. I was harrassed in high school, only got to tenth grade to read the bible, went to community college and they tried to pick fights with me for no reason at all.......The devil and the unseen spirits have theyre ways.......In conclusion, I HATE CHICAGO ILLINOIS ......Worst wishes bozos.......Jokes on you now...."]}