{"Object Flight Path":"Straight-line path,Path with directional change","Latitude":"45.84719","Region":"Oregon","City":"Hermiston","Longitude":"-119.28416","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.84719,+-119.28416(17142)&iwloc=A&hl=en\"> mufon case (17142) map </A>","Log Number":"US-05252009-0018","files":["/var/www/straped/mufon/html2text/17142.html.txt","/var/www/straped/mufon/more/17142_submitter_file2__VID00002-20090524-2150.jpg","/var/www/straped/mufon/more/17142_submitter_file3__VID00002-20090524-215001.jpg","/var/www/straped/mufon/org/17142.html"],"Country":"United States","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Object Shape":"Other","Source":"MUFON","Date of the Event":"05/25/2009 09:45 UTC","Case Number":"17142","divs":["Sighting DetailsOn 5-25-2009 around 9:45 pm, we were watching tv, Our son had taken the dog outside, and came back in the house quickly to tell us to come outside as there is a lighted object in the sky, my wife, my daughter (age 13), my son (age 17), and myself went out and observed a bright object in the sky about south west of us and watched it come north to above us, then I grabbed my blackberry cell phone and took a video of it, when i started taken the video it was slowy moving away from us to the south east, it got smaller then disapeared. It was way lower than the stars and ther was no noise, it was quite... The sky was clear and stars were out. This object was bright and looked like to have a tint of blue when it started going south east... The video appears to have deformed the object shape as it appeared to be round.... The object was very steady when moving but slow, then as heading south east it still was steady moving but got faster and smaller till it was gone...in the video it is the larger lighted object..... I also extracted 2 pictures from the video clip..."],"Date Submitted":"05/25/2009 09:45 UTC","trends":["There have been 3 other sightings in Hermiston","There were no other sightings in Hermiston on or around May 25th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Summary":"Lighted object in sky above our home.."}