{"Source":"MUFON","Viewing Distance":"21-100 Feet","City":"Boston","Case Number":"17155","Longitude":"-71.127027","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=42.283214,+-71.127027(17155)&iwloc=A&hl=en\"> mufon case (17155) map </A>","Object Features":"Unknown","Summary":"Three flashing lights in a triangle.","Log Number":"US-05262009-0003","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/17155.html.txt","/var/www/straped/mufon/org/17155.html"],"Object Shape":"Flash, Star-like, Triangle","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"42.283214","Date Submitted":"05/26/2009 12:29 UTC","Date of the Event":"05/26/2009 12:29 UTC","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Stationary","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around May 26th 2009"],"divs":["Sighting DetailsAny who read this should note that this UFO was, in all likelihood, just a streetlamp, whose beams of light were partially shaded by a tree. However, given certain unusual circumstances, I felt I should report it anyway. While reading a book at home, I happened to look up and see three flashing white lights in a triangular arrangement outside my window. They lasted for about 20 seconds, and then suddenly dissappeared. There was no movement, but the lights were flashing in and out, changing in brightness. The instant I had seen the UFO, I experienced a sudden feeling of terror; however, this was probably because earlier that day, I had read a book written by a man named Ted Owens, who had claimed that he had communicated with Space Intelligences (SIs) and had \"charged\" the book so that the SIs would have contact with all who read it. I am not sure what the UFO was, or whether it had anything to do with the reading of that book. I am highly skeptical as to whether it has anything to do with that. I ran over to my computer immediately, after the lights had faded away from the window."]}