{"Tags":"City","Object Shape":"Star-like","City":"Lockport","Viewing Distance":"Unknown","divs":["Sighting DetailsMy husband and I were sitting outside enjoying the warmth of a fire we had made in our fire pit and gazing up at the stars. The night was quite cool and crisp, but the sky was very clear with many stars. As we were looking up, we noticed a fairly bright object making its way across the sky in an arc-type path. The object moved steadily and consistently in a soft arc from the Northwestern part of the sky to the Southeastern part of the sky. It did not move exceptionally fast, but moved at a quicker pace than that of most planes we see. We assumed it was a plane, but continued to watch it as we could not see any blinking lights and it was extremely bright for the planes we normally see. I did not take my eyes off of the object because I was sure I would see blinking lights at any moment. As we both watched it move across the sky, the object appeared to get brighter and brighter - almost growing in size. The light that was coming from the object was similar to the very bright white light you see coming from the solor-powered lights that people often put around their gardens. I kept watching the object and convinced myself that I would see blinking lights at any moment, but there were none. As we watched the object, it continued to get brighter and brighter and then suddenly, it dimmed and completely disappeared. I double-checked to see if it could have suddenly gone behind some clouds, but there were absolutely no clouds in the sky. There were stars all around the area where it disappeared, so we know that there were no clouds present. When I realized that I had seen something that we could not explain, I was excited, yet my mind still tried to rationalize and create some logical explanation for what the object was. I knew the object was unusual when it went from emitting extremely bright light to dimming and disappearing in a matter of approximately 4-5 seconds. I would be very curious to know if others have seen something similar."],"Object Flight Path":"Undisclosed","Disposition":"IFO","Object Features":"Undisclosed","Log Number":"US-05252009-0026","Sighting Duration":"Undisclosed","Case Number":"17152","Country":"United States","trends":["There have been 13 other sightings in Lockport","There were no other sightings in Lockport on or around May 25th 2009"],"Date Submitted":"05/25/2009 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.178743,+-78.68577(17152)&iwloc=A&hl=en\"> mufon case (17152) map </A>","Weather Factors":"Unknown","Source":"MUFON","Latitude":"43.178743","Date of the Event":"05/25/2009 10:10 UTC","files":["/var/www/straped/mufon/html2text/17152.html.txt","/var/www/straped/mufon/org/17152.html"],"Longitude":"-78.68577","Region":"New York","Summary":"Extremely bright star-like object which traveled across the sky."}