{"Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","Object Features":"Unknown","Summary":"I saw what appeared to be a twinkling star about 45 degrees above the horizon at approximately NNW.","files":["/var/www/straped/mufon/html2text/17156.html.txt","/var/www/straped/mufon/org/17156.html"],"Date Submitted":"05/25/2009 09:30 UTC","Country":"United States","Case Number":"17156","Longitude":"-86.583404","Object Shape":"Star-like","Tags":"City","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around May 25th 2009"],"Latitude":"34.735579","Object Flight Path":"Other","Sighting Duration":"Undisclosed","Log Number":"US-05262009-0004","Weather Factors":"Lightning, Light","Region":"Alabama","divs":["Sighting DetailsI was leaving a friend's house at about 9:20 in the evening and we paused to take in the sky as it had been raining earlier and now the stars were shining. As I looked with my friends ( a man and his wife) I was showing them the big Dipper and noticed that there was a \"star\" that was twinkling. I remarked that i thought that was odd, because none of the other visible stare were twinkling. I told my friends I would take a look with my binoculars when I got home. My house was a ten minute drive from their place and when I got home I got my binoculars out and took a quick look at this \"star\". I was not able to resolve it into any shape, but it was red, green, and white and appeared to oscillate between those colors. At this point i knew it was not a star. I hurried into the house to get my telescope because the object was slowly drifting to the horizon. My telescope is a Questar 3.5 and I used a 16mm occular which provided 81 power magnification and about a 1 arc second resolution. I found the object and attempted to focus but was not able to image anything other than a point of light that varied between red, green and white. Because of where I had my focus set, in relationship to other nearby stars, I had the impression that this object was really far away (outside the atmosphere). The light was fairly bright for the distance. I would guess a magnitude 3. I watched the object for about 10 minutes before it went below the horizon. This was not a plane, blimp, weather balloon or any conventional flying object. I am a retired army officer with an extensive background in missiles and air defense."],"Date of the Event":"05/25/2009 09:30 UTC","City":"Huntsville","map":"<A HREF = \"http://maps.google.com/maps?q=34.735579,+-86.583404(17156)&iwloc=A&hl=en\"> mufon case (17156) map </A>","Disposition":"Unknown"}