{"Summary":"Bright light flying West to East","Region":"Washington","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Country":"United States","Date Submitted":"05/22/2009 10:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.218216,+-119.133234(17164)&iwloc=A&hl=en\"> mufon case (17164) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMyself and four of my friends were walking out to our cars when I looked up in the sky to the west and saw a VERY BRIGHT light moving. It had no flashing lights like an airplane would have an the light coming from it was too bright to be any aircraft that I know of. It was heading in a West to East direction. It had to be rather large judging from the size of the lighted area. We were able to see it all the way until it started to make a very sharp turn and then the light all the sudden went off. This was NO meteor, no aircraft that any of us were familiar with, it made no noise at all. Within seconds there was two other airplanes right in the area where this light had disappeared. This was definitely a craft of some sorts and to the other people that have reported this, yes we saw the EXACT same thing you saw so no you are not seeing things!!! I knew it was a ufo right when i saw it as there is nothing I know of that flys in the sky at night with lights as bright as these and especially without the flashing lights that are FAA MANDATORY for all aircraft. It gave me the chills and every time I think about i still get the chills!!"],"Longitude":"-119.133234","Log Number":"US-05262009-0011","Source":"MUFON","Case Number":"17164","Tags":"City","City":"Kennewick","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/17164.html.txt","/var/www/straped/mufon/org/17164.html"],"Weather Factors":"None","Object Shape":"Other","Latitude":"46.218216","Object Features":"Unknown","trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around May 22nd 2009"],"Date of the Event":"05/22/2009 10:37 UTC"}