{"City":"Fort Worth","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.733669,+-97.31708(17169)&iwloc=A&hl=en\"> mufon case (17169) map </A>","divs":["sighting detailsi saw what i thought to be an aircraft, because of the intensity of the light - but the light was red. this is not the light of an aircraft i know of - nothing coming out of dfw. we (my entire family) watched it as it came toward our home - it was dark outside - and it came rather quickly, faster than a normal\\passenger aircraft. when it reached overhead, it disappeared. it was quiet, and the lights were out - this is not normal aircraft activity. a few seconds later, my wife and children saw it again to our north, but just briefly, and heading away. it was bright, silent, and it disappeared from our view overhead and then again to my family in a matter of seconds several miles north of us. all of this happened in approximately 30 seconds. all i can think is that it was something burning up int he atmosphere - but, it never altered course, and never fell out of the sky - it just kept moving at a decent rate of speed, and seemed to be able to turn lights off and on. the \"craft\" did not have wing lights, either - planes will have lights flashing on the wings, and helicopters will have a tail rotor flashing light - this had neither. it was a bright red, pulsating \"ball\", moving very quickly from south to north - not darting back and forth, etc. it was also completely silent. weird!"],"Date Submitted":"05/25/2009 09:00 UTC","Object Features":"None","Case Number":"17169","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around May 25th 2009"],"Log Number":"US-05262009-0013","Country":"United States","files":["/var/www/straped/mufon/html2text/17169.html.txt","/var/www/straped/mufon/org/17169.html"],"Viewing Distance":"Over One Mile","Longitude":"-97.31708","Source":"MUFON","Tags":"City","Region":"Texas","Summary":"Good-sized pulsating red \"orb\" - moving at a good rate of speed.","Sighting Duration":"00:00:30","Object Shape":"Fireball, Sphere","Disposition":"Unknown","Date of the Event":"05/25/2009 09:00 UTC","Latitude":"32.733669","Weather Factors":"None"}