{"divs":["Sighting Detailsthis morning i witnessed a ufo. i went to my back door to let in my cats. i looked into the shy as day was dawning and saw a very bright object. it changed shape a couple of times. some moments it appeared as a cross, some moments it appeared as a disk with 2 light rays shooting from the top. there were occaisonal dimmer lights moving to and from the object. it also had 2 lines shooting out from the sides. the 2 bars of light from the top were red and blue and formed a V shape, the 2 on the sides were blue. it also would flash lights brighter than itself, and it was very bright. i got goose bumps when i realised it wasnt a star. and as it would change, i had fear mixed with excitement. as it stands it is still out there. dimmer, but still clearly visible. i just went out to look at the object again, it is gone now, but there are no less than 5 con trails in the air above my home. i also saw a very bright, glowing whit object flying at an incredible rate of speed over my home that left a contrail. it could have been a jet, but ive never seen a jet like it before. it was extremely bright. it looks as if i wasnt the only one that noticed(air force?) im going back out to look for further activity. it is now 5:41. 2 more jets over head one was easoly identifiable as a jet heading after the extremely bright object that left the contrail. something is happening here."],"Log Number":"US-05262009-0010","Date of the Event":"05/31/2009 05:27 UTC","City":"Bowling Green","Region":"Kentucky","Country":"United States","Disposition":"IFO","Longitude":"-86.442562","Latitude":"36.99288","Summary":"bright sparkling. changed shape. sometimes a cross. ha 2 light rays shooting out the top.","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.99288,+-86.442562(17163)&iwloc=A&hl=en\"> mufon case (17163) map </A>","trends":["There have been 25 other sightings in Bowling Green","There were no other sightings in Bowling Green on or around May 31st 2009"],"Object Shape":"Cross, Star-like","Object Features":"None, Appendage(s)","files":["/var/www/straped/mufon/html2text/17163.html.txt","/var/www/straped/mufon/org/17163.html"],"Case Number":"17163","Date Submitted":"05/31/2009 05:27 UTC","Source":"MUFON","Weather Factors":"Does Not Apply","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Stationary"}