{"Weather Factors":"Unknown","Object Shape":"Circle","Case Number":"17167","Longitude":"-73.034542","Date Submitted":"05/22/2009 10:50 UTC","Summary":"Round white light about the size of a dime at arm's distance.","City":"Selden","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.871207,+-73.034542(17167)&iwloc=A&hl=en\"> mufon case (17167) map </A>","Latitude":"40.871207","trends":["There have been 3 other sightings in Selden","There were no other sightings in Selden on or around May 22nd 2009"],"Object Features":"Other","Date of the Event":"05/22/2009 10:50 UTC","divs":["Sighting DetailsFriday night about 11 pm I was around the block on my friend's deck, looking up at the stars. At first there was nothing strange. I looked up at the stars again and saw a white light that I could compare to a huge floodlight with no beam. It was moving VERY slowely, from south to north. Lasted about 8 seconds. At first I said is that a Planet? But then said no that's too big. My friend missed it but saw my face and ran to get the binoculars but it was gone before he got back. As soon as I said that,(no, that's too big) you could see a flash, something close over it, kinda like two sections closing and the thing took off. It looked like a shooting star went to the left (or south),after the light was blocked, and the object continued north, but mostly straight out and away from earth at a rate of speed that I could not compare to any jetfighter I've seen, FAST! It was definately not in the earth's hemisphere,when it left, and when the beam of light went out, it was now as tiny as a star with a one red and one white light. The weird thing is that is DEFINATELY moved toward outer space, not around the earth. I watched it move further out until it went through a mist in outer space. I was able to watch the two lights for about 10 seconds. Then I could not see it anymore. It was so far out there. I can make a sketch if you'd like. Thank you."],"Disposition":"IFO","Log Number":"US-05262009-0014","Object Flight Path":"Straight-line path","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/17167.html.txt","/var/www/straped/mufon/org/17167.html"],"Source":"MUFON"}