{"Tags":"City","trends":["There has been one other sighting in Reedville","There was one other sighting in Reedville on or around May 8th 2009","This sighting has never been favorited.",""],"City":"Reedville","Country":"United States","Object Shape":"Diamond, Fireball, Unknown","Longitude":"-76.275777","Date of the Event":"05/08/2009 12:00 UTC","Object Features":"Undisclosed","Latitude":"37.842074","Viewing Distance":"Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/17172.html.txt","/var/www/straped/mufon/more/17172_submitter_file1__insane.JPG","/var/www/straped/mufon/org/17172.html"],"Log Number":"US-05262009-0015","Summary":"Flashing lights slowly moving in every direction, disappearing and re-apearing before our eyes.","Disposition":"Unresolved","Case Number":"17172","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=37.842074,+-76.275777(17172)&iwloc=A&hl=en\"> mufon case (17172) map </A>","divs":["sighting details my boyfriend and i went to visit my parents. shortly after we arrived there was a storm that knocked out the power. my boyfriend decided to go outside and stare at the sky (i should note, he has done that every previous visit) after a while he was saying he saw something, and i needed to see it. me, being the skeptic i am ( and always identifying his \"ufos\" to just be airplanes, stars, or satellites) completely ignored him for about twenty minutes. finally (and only to appease him)i went outside i looked at what he was talking about. i saw what at first looked like a plane, but the lights were flashing to quickly. and i couldn't see the distinct red light flashing. then i realized it was way to low to be a plane. the object began moving vertically and back and forth. i watched the yellow and white lights for about a long time before i realized i needed a picture of this- it was just too weird the flashing and way it was moving. i took about three or four and review them, and i thought them to be garbage. we discussed all the possibles of what we just could have seen in the sky. there was no conclusion. the next morning we told my parents, and they seemed to get a kick out of it, so we didn't say anything to anyone else. the real story here is when i came home to nc, and was looking back over the other pictures i started deleting the ones of the lights on the horizon and i saw one and thought, maybe if i zoom times 8x i'll see, just something... and what i saw literally shocked me. all we saw were lights. but the picture clearly shows a blue\\gray colored, emerald shaped object with a reddish bluish field surrounding it(?) it is a remarkable picture."],"Region":"Virginia","Source":"MUFON","Date Submitted":"05/08/2009 12:00 UTC"}