{"Weather Factors":"Unknown","Case Number":"17185","Summary":"UFO was still with one red light that flashed twice over a half hour period.","trends":["There have been 2 other sightings in Tybee Island","There were no other sightings in Tybee Island on or around May 19th 2009"],"Object Shape":"Boomerang","Date of the Event":"05/19/2009 01:50 UTC","files":["/var/www/straped/mufon/html2text/17185.html.txt","/var/www/straped/mufon/org/17185.html"],"Latitude":"32.000215","Log Number":"US-05272009-0005","Date Submitted":"05/19/2009 01:50 UTC","Sighting Duration":"04:50:00","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Source":"MUFON","Region":"Georgia","Longitude":"-80.845666","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=32.000215,+-80.845666(17185)&iwloc=A&hl=en\"> mufon case (17185) map </A>","City":"Tybee Island","divs":["Sighting DetailsWe were on vacation on Tybee Island which is straight east of Savannah, Georgia. We stayed on the 2nd floor which had an Atlantic Ocean view from patio doors in the living room. There were no palm trees, etc., hiding any of the view of the sky or ocean. I woke up & walked into the living room on Wednesday, May 20th at 1:50AM. I sat on the sofa & was looking out the doors. It was dark out of course but what I could see was this white object that was obviously too large to be a star. I got out my binoculars for a closer look. It appeared to be shaped like a boomerang. I saw a red light flash twice on the UFO. Each flash wasn't in sequence. The object was still for several hours. (1:50am til around 6am) Around 6am, dawn was coming. The UFO very slowly moved upwards & to the east. I was so excited to see this UFO! It was the first time I could actually say I saw a real UFO. When I first noticed this UFO, in 5 seconds time, I was trying to q rationalize that it was a commercial plane, then a helicopter. I knew what I was really seeing. The next morning, Thursday, May 21st, around 4:30am, I woke up & again went straight to the living room to see if the UFO was in the sky. It was. Using my binoculars, it appeared to be the exact shape as the UFO seen the morning before. It was again in the same position. I know this because of the distance from the top of the railing of the patio & the division of the doors. I also had someone else look this time & he agreed with me on the shape of the object. It was cloudy this night. I wasn't quite as excited this night. I watched it til 6am then left the room. The following morning, May 22nd, 2009, around 4:30am, the UFO was again in the same position. The difference this night was seeing 2 ships in the ocean that were quite a distance away to the human eye. The ships weren't directing below the UFO but to the north some. The ships didn't move. There were very bright lights the length of both ships. I had used my binoculars again to see the ships. The UFO never showed up on Saturday, May 23rd or Sunday, May 24th."],"Tags":"City","Disposition":"IFO"}