{"Date Submitted":"03/27/1995 03:00 UTC","Sighting Duration":"01:00:00","Summary":"Bright, blueish white light flashing on and off, over and over, from outside bedroom window.","Case Number":"17189","Region":"Vermont","map":"<A HREF = \"http://maps.google.com/maps?q=44.81881,+-73.15011(17189)&iwloc=A&hl=en\"> mufon case (17189) map </A>","Object Flight Path":"Unknown","Country":"United States","Viewing Distance":"Unknown","Latitude":"44.81881","divs":["Sighting DetailsThis event mostly took place after I had fallen asleep. It seemed like I might be dreaming at the time, but later on, it became clear that I had not been. It started out that my husband and I were sitting on our bed, noticing this light flashing on and off. During the \"dream\", we were trying not to notice it, but it was so bright, it was like all of the lights in the house had been turned on, and it was noon outside, even though it was actually well after sunset. Suddenly that scence disappeared, and I was laying on my right side, and my eyes were open, but I couldn't see anything except pure blackness and these 3 white lights that looked like stars, that were in the shape of an inverted triangle. Normally at night I can see a little bit in my bedroom, since our next door neighbor has a bug light. I was not feeling frightened, just confused, until something moved in front of my face, and I couldn't see the lights anymore. Then I would start to hyperventilate because I was so afraid. Of what, I don't know, just being engulfed in blackness, with something I couldn't see. This happened 3 or 4 more times, where I could see the lights, and then I couldn't. By the last time, I think I might have passed out with fear. Then I wake up, but not feeling like I was in a normal state of mind. This time I could see around my bedroom. I looked to my right, and I could see 2 people standing RIGHT next to my bed, who were definitely different from me. They looked like lizard people. Immediately my first thought was that I was dreaming, so I wasn't at all frightened. I decided to try to reach my arm up to the lamp next to the bed, and turn the light on, so I could wake up and then it would all go away. I did raise my arm about half way to the light, and then my arm just went back down, without my control. I was very confused by this, and not sure what to think. They were looking very intently at me. I got a very good look at them too. They had these thin green masks on, that looked like they were made of green leather, that covered their noses and mouths. They had 2 raised ridges on each side of the top of their heads. Their eyes were about the same size as ours, except they protruded farther out from their face than ours do. Their pupils were shaped like a cat's pupil. It was a gold color, the iris was black, and the rest of the eye beyond the iris was gold. They had dark green, somewhat shiny skin, but kind of roughish in a way too, hard to describe. There was a black emblem or ensignia of some kind on the right side of the chest on their clothing. It was also a dark green color, tight fitting, looked like some kind of spandex material or something. The one standing on the left, reached his right arm toward me and slid his index finger down the top of my left forearm. I could feel this sensation physically. His nail was like a short, pointed thick claw, of a grayish color. After that, I blacked out, woke up hours later, and could smell a burning sulfur odor for about 15 seconds, and then it was gone. I got up, just assuming it was a very strange dream, but then a few days later, the children mentioned seeing \"green ghosts\" in our room at night, touching our heads. I hadn't mentioned the dream to anyone. It was at that point that I started to question what might really be happening."],"Longitude":"-73.15011","Object Shape":"Triangle","City":"St Albans","Disposition":"Unknown","Date of the Event":"03/27/1995 03:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17189.html.txt","/var/www/straped/mufon/org/17189.html"],"Tags":"City","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been 7 other sightings in St Albans","There were no other sightings in St Albans on or around March 27th 1995"],"Log Number":"US-05272009-0009"}