{"Date of the Event":"05/24/2009 12:00 UTC","Date Submitted":"05/24/2009 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Region":"Wisconsin","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Log Number":"US-05272009-0017","City":"Merrill","Summary":"Round object moving in random directions ending in fade to nothing.","Tags":"City","Country":"United States","Latitude":"45.185922","Weather Factors":"Unknown","trends":["There has been one other sighting in Merrill","There were no other sightings in Merrill on or around May 24th 2009"],"files":["/var/www/straped/mufon/html2text/17197.html.txt","/var/www/straped/mufon/org/17197.html"],"Source":"MUFON","Object Shape":"Circle","Case Number":"17197","map":"<A HREF = \"http://maps.google.com/maps?q=45.185922,+-89.673559(17197)&iwloc=A&hl=en\"> mufon case (17197) map </A>","divs":["Sighting DetailsMe and 5 other individuals were out on the river in Merrill wisconsin when one person notices a bright reddish-orange ball moving south in the sky across the skyline. It was clearly not a airplane or anything of that sort because has a very clear solid glow with no blinking. Also, the object was close enough where there was no sound and it had very smooth movement. After the initial person noticed, several others viewed this object move above the trees probably a half mile away and when the object moved to the southwest of our position it changed direction suddenly and started moving east where it was not behind us. Initially viewing this from the bottom of the hill, we ran up the hill and saw the object directly above the treeline looking due south and the object stopped. At this time I pulled out my camera phone to video the object, right after this, the object, which was approximately 1 to 2 miles in the distance, but maintaining the same shape and glow, appeared to slowly diminish. It appeared as though it was moving away but to us viewers it was like the light turned off. One onlooker thought that the light at one point while it was moving from west to east, actually went east then back west then back east again before stopping and fading away. We were all shocked by this and all believed we saw something that should be considered a ufo. One of the viewers even stated in 20 years living here he'd never seen anything like that. Just to note, the object was definitely not a flare, firework or anything of that sort because the movement and the distance it traveled over several minutes was atleast 5 miles. The video on my camera phone actually shows two lights which is definitely not what was seen with the naked eye."],"Disposition":"Insufficient Data","Longitude":"-89.673559"}