{"files":["/var/www/straped/mufon/html2text/17195.html.txt","/var/www/straped/mufon/org/17195.html"],"City":"Surfside Beach","Date of the Event":"05/27/2009 10:00 UTC","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Other","Latitude":"33.610543","Source":"MUFON","Disposition":"Unknown","Longitude":"-78.964729","Sighting Duration":"Undisclosed","Object Shape":"Flash, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=33.610543,+-78.964729(17195)&iwloc=A&hl=en\"> mufon case (17195) map </A>","Date Submitted":"05/27/2009 10:00 UTC","Viewing Distance":"Unknown","Weather Factors":"None","Country":"United States","divs":["sighting detailsthere seems to be a tilted disc shaped object with red to green lights very small, stationary 15 to 25 degrees or so above the horizon. around this object are numerous , sporadic flashes the size of stars bu the flashes are bright enough to attract the eye. these flashes are occuring below the red\\green object. directly below it a series of 4 to 5 very bright and large flame colored lights appeared, lighting up in a random sequence with the last one flashing off to the north at an unbelieveable speed. this same type of formation-like brightllights occured again two more times, with the second time occurring further to the south and the third time occurring in between the first and second occurences. the tilted disc object is the only object in question as to whether it is something totally unnatural to the eye or if it's the eye trying to focus on a planet. the other flashes and bright light formations were quite obvious and observed by several people on the beach. my son saw the first formation and ran to tell me a half block from the ocean. i walked down and observed the other two occurences and all the flashes in the sky. we are near an airport but the airplanes were very easy to discern from the ufo activity. all the planes turned north away from the occurences. i and everyone on the beach, about 8 people, were very excited. i believe i was screaming. the flashes stopped and after 20 or so minutes there were no more formations occuring. everyone had then left the beach so i left just for my own comfort."],"Region":"South Carolina","trends":["There have been 2 other sightings in Surfside Beach","There were no other sightings in Surfside Beach on or around May 27th 2009"],"Case Number":"17195","Object Features":"Unknown","Log Number":"US-05272009-0015","Summary":"Off east coast beach, numerous large yellow-orange lights."}