{"Object Flight Path":"Straight-line path","Disposition":"Unknown","Weather Factors":"None","Tags":"City","Date of the Event":"06/30/2001 07:30 UTC","Country":"United States","Latitude":"38.033896","map":"<A HREF = \"http://maps.google.com/maps?q=38.033896,+-78.469758(17199)&iwloc=A&hl=en\"> mufon case (17199) map </A>","divs":["Sighting DetailsI was watering the garden in the evening as usual, and I was scanning the sky and enjoying the fading light. I remember the sky was completely clear and light blue. The sun was already down behind the mountain ridge. As I was gazing up a bright orange cigar shaped object rapidly traveled across the sky from west to east. The object was moving at an incredible speed- faster than anything I have ever seen, including satellites in orbit. The object was a perfectly shaped ellipse with sharp well defined edges. There was no contrail, nor any other visible disturbance in the sky. There was no sound I could detect. It was a very calm and quiet summer evening. The object passed from horizon to horizon in about 5 seconds. I neither saw nor heard any other aircraft before or after the event. I had the impression the object was very large and traveling at a very high altitude- 15,000 to 20,000 feet or more. I am an aircraft buff and routinely observe aircraft whenever they are overhead. There is no possibility that this object was any conventional craft, at least one I am familiar with. After the object passed from view I continued to watch the sky and wrap my brain around what I had just witnessed. I finished watering the garden and went inside to tell every one what I had seen. I said I had seen a UFO and the family thought that was neat. The kids went outside hoping to see something too. We did not witness any other events."],"Date Submitted":"06/30/2001 07:30 UTC","Longitude":"-78.469758","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"17199","Log Number":"US-05282009-0002","Summary":"Bright orange object flew from western horizon to eastern horizon at an incredible speed - no visible trail - definitely not an astronomical object.","Object Shape":"Cigar","trends":["There have been 19 other sightings in Charlottesville","There were no other sightings in Charlottesville on or around June 30th 2001"],"Sighting Duration":"Undisclosed","City":"Charlottesville","Object Features":"None","Region":"Virginia","files":["/var/www/straped/mufon/html2text/17199.html.txt","/var/www/straped/mufon/org/17199.html"]}