{"Date Submitted":"05/25/2009 10:30 UTC","files":["/var/www/straped/mufon/html2text/17193.html.txt","/var/www/straped/mufon/org/17193.html"],"Latitude":"41.518106","City":"Genoa","Log Number":"US-05272009-0013","Case Number":"17193","Source":"MUFON","Object Shape":"Unknown","Object Flight Path":"Straight-line path,Unknown","Object Features":"Unknown","Disposition":"IFO","Longitude":"-83.359094","Summary":"Strange light pattern, very bright, not like aircraft recognition lights.","Tags":"City","divs":["Sighting DetailsI was coming home from work on State rt. 163 east bound, when about 4 miles out of town, I noticed these strange lights. Now, working in aviation the last 8 years (I am not a pilot, but I have flown alot), I knew it didn't look like an aircraft, for some reason I thought it was a cell tower light. But then it hit me, There is only one light at the very top of those cell towers where I live. I have lived there my whole life. These lights were 2 very bright red blinking lights with a blueish faint light in the middle that just stayed on and didn't blink. At first, the 2 red lights were vertical of each other, then they kind moved aprt slightly horizontily. At this point, I knew I was seeing something very strange. Thats when it hit me, this thing was right over Genoa, like it was hovering, and I noticed the red strobe light on top of the water tower in Genoa at the park. At this point, I was about 2 miles out from town still in the country. What I noticed, was that these lights were in between the water tower light and SR163. Well, rushed into town and home and parked my truck. Mind you, once in town you don't have a good view of anything in the sky do to the trees in town. So I rushed up on the roof to see if I could get a better look at this whatever it was. I got all the way up to the peak of the second story (very steep and painfull I might add)and I could see the lights which looked like they were just over the top of the north side of town. Now, the red lights were now vertical again, and blinking very slowly and very brightly. The blueish whit light now turned into 2 lights of the same color very faint and very close together, with the trailing one being slightly lower than than the lead one. This is where things really got strange for me, the lights were moving at a snails pace, I was on that roof for 2 minutes, here's another kicker, NO NOISE, none whatsoever, no prop noise, no jet noise no chopper noise, nothing, dead silence. I then imediatly jumped off the roof while it looked like it was still due north of me and jumped in my truck with my brother (he came out do to the noise of someone running around on the roof) and immediatly headed west out of town. I only live 4 blocks from the western edge of town, and one block north of SR163, It only took me 30 seconds to get back out in the open country fields. by the time I got out there, these lights were already miles away, but still very bright. Maybe you guys can come up with an explanation."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.518106,+-83.359094(17193)&iwloc=A&hl=en\"> mufon case (17193) map </A>","Date of the Event":"05/25/2009 10:30 UTC","Region":"Ohio","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"United States","trends":["There has been one other sighting in Genoa","There were no other sightings in Genoa on or around May 25th 2009"]}