{"Country":"United States","Source":"MUFON","Weather Factors":"Does Not Apply","Log Number":"US-05272009-0016","Object Flight Path":"Straight-line path","Disposition":"IFO","Date of the Event":"05/22/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/17196.html.txt","/var/www/straped/mufon/org/17196.html"],"divs":["Sighting DetailsMe and my sister Jane have seen the same object go over several nights in a row. And has been witnessed by several family members. The object always goes from west to east. The object has gone over our house several nights in a row. We like to go out at night and just look at the night sky and yes I know the difference between a satelite and a plane we live very near the airport. We are not looking for glam or glitter me and my family just wants to know whats this all about. I have never witnessed anything like this at night. Something very strange is going on. It goes across between 9:45pm and 10:00pm and has done this for several nights. The object catches you off guard. The object goes in a straight line. Is there anyone else reporting this object lots of people have to be seeing this object it catches your attention because of the brightness and intensity. Me and my neice Sara have also seen the same object from her house she lives about four houses down from me. I have video of the object but it was further away and was taken from my sisters camera. I continue to go out between 9:30pm and 9:45pm trying to get better video. The video I am sending is terrible like I said I dont have a great video recorder wish I did. The object this night was further away unfortunitly.I was not going to send this video because of the poor quality believe me this video dosent give it justice to how close the object has appeared. Thank You. Jeffrey and Jane"],"Case Number":"17196","Summary":"The object was very bright and quiet.","Longitude":"-122.672597","Sighting Duration":"Undisclosed","Date Submitted":"05/22/2009 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"45.533052","Region":"Oregon","Object Shape":"Circle","Tags":"City","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around May 22nd 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=45.533052,+-122.672597(17196)&iwloc=A&hl=en\"> mufon case (17196) map </A>","City":"Portland","Object Features":"Unknown"}