{"map":"<A HREF = \"http://maps.google.com/maps?q=39.841053,+-105.028025(17206)&iwloc=A&hl=en\"> mufon case (17206) map </A>","Log Number":"US-05282009-0009","Sighting Duration":"Undisclosed","Summary":"Bright Light in Sky-Not a star-Second Day in Row- [cms/tg/pid]","Region":"Colorado","City":"Westminster","Source":"MUFON","Tags":"City","Disposition":"IFO","divs":["Sighting DetailsThis is the second day in a row this object just sat in the sky. I had taken pictures yesterday morning around 5am when I first noticed it. There is normally nothing in the sky at this position but I took pictures yesterday and did not use a tripod, therefore the photos were too bad to use, although I could tell the object was round. I was surprised this morning when I came out to go to work and upon looking up at the same place in the sky it appeared in the same place as yesterday morning. I quickly got out the tripod and took some photos on my way to work. The photo was taken looking just slightly east of due south. This object is very bright in the sky and most people would think it was a star unless you knew a star or planet does not appear at this location of the sky. I did not see the object move but if it did it moved very slowly. I looked at this object with binoculars and could clearly see the round shape. Should it still be in the same location tomorrow morning I will get more pictures of it."],"Date of the Event":"05/28/2009 05:00 UTC","trends":["There have been 30 other sightings in Westminster","There was one other sighting in Westminster on or around May 28th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Longitude":"-105.028025","Object Features":"Unknown","Case Number":"17206","Weather Factors":"Unknown","Latitude":"39.841053","Country":"United States","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/17206.html.txt","/var/www/straped/mufon/more/17206_submitter_file2__Picture004cropped.jpg","/var/www/straped/mufon/org/17206.html"],"Date Submitted":"05/28/2009 05:00 UTC","Object Shape":"Circle"}