{"Object Shape":"Circle, Disc, Egg, Oval, Sphere","Object Features":"None","Tags":"City","Longitude":"-122.710601","map":"<A HREF = \"http://maps.google.com/maps?q=38.448167,+-122.710601(17201)&iwloc=A&hl=en\"> mufon case (17201) map </A>","Log Number":"US-05282009-0004","Summary":"bigger than venus bright white circle moving away from us","files":["/var/www/straped/mufon/html2text/17201.html.txt","/var/www/straped/mufon/org/17201.html"],"Latitude":"38.448167","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"United States","City":"Santa Rosa","Weather Factors":"None","divs":["Sighting Detailsi was closing the blinds on my downstairs front that window looks south south east right off of hwy 12 in rincon valley. i turned the blinds up to close them and i noticed between two separate slats a bright light as bright or brighter than venus standing still. i thought it was venus. it then started to move with what looked like a smaller less bright object behind it(the smaller one could have been a reflection). i then went out my front door to get a better look and did'nt see the smaller one anymore. the object was almost directly over me and i think bigger than venus moving south southeast slowly. it almost looked like an airplane when it has it's landing light on coming towards you but it started going away from me and it did'nt fade or pulse or start blinking. just a steady bright light not any further up than a plane unless it was huge?! it seemed to be moving slow at first and pretty much straight. i ran inside and called my wife and told her to look out the upstairs bedroom window by the time i came out it was further than i thought it would be by how slow it was moving. it had went from over me to the horizon to the south south east that i could see above the hoses across the way from me. my wife saw the bright light and said \"what the hell?\" it then kept moving in the same direction away from us and the just faded out to nothing. no blinking lights, no sound, nothing, almost instantly.. i don't think it was a plane, helicopter or sattelite."],"Region":"California","Date Submitted":"05/27/2009 09:35 UTC","trends":["There have been 30 other sightings in Santa Rosa","There were no other sightings in Santa Rosa on or around May 27th 2009"],"Source":"MUFON","Case Number":"17201","Date of the Event":"05/27/2009 09:35 UTC","Disposition":"IFO","Object Flight Path":"Hovering then path"}