{"Tags":"City","Source":"MUFON","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/17202.html.txt","/var/www/straped/mufon/more/17202_submitter_file1__P1000370.JPG","/var/www/straped/mufon/more/17202_submitter_file2__P1000369.JPG","/var/www/straped/mufon/org/17202.html"],"Summary":"Me and my nephew took video and pictures.","Region":"Oregon","Country":"United States","Longitude":"-122.671657","Latitude":"45.525702","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"05/26/2009 12:00 UTC","Object Flight Path":"Straight-line path","Disposition":"IFO","divs":["sighting detailsme and my nephue were in our back yard looking thru the binoculars thats when i saw the object this is a follow-up of information i am sending to you. it did not resemble a plane. here are the photo's and video. my neice [cms\\tg\\pid] has had vivid nightmares about beings coming in there were two she first looked out side something gave her the chill something just didnt feel right. she told me that she couldnt move. her eye sight seem blured,she could not move. she also told she saw something out side and said the stars were formed in a pattern. her son said he heard something out the window also. she has had two vivid nightmares about the visitations. the other dream she said litte being came into her room she also could not move both her and her son were heald down on there beds then she told me that they were by the door before they left they let out a loud shreek. my neice can give you more iformation when the investigator comes out to talk to us as a family. thank you. [cms\\tg\\pid]"],"Date of the Event":"05/26/2009 12:00 UTC","Object Shape":"Cigar","Log Number":"US-05282009-0005","Case Number":"17202","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around May 26th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.525702,+-122.671657(17202)&iwloc=A&hl=en\"> mufon case (17202) map </A>","City":"Portland"}