{"Case Number":"1721","trends":["There have been 2 other sightings in Davison","There were no other sightings in Davison on or around April 2nd 1986"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.034749,+-83.518006(1721)&iwloc=A&hl=en\"> mufon case (1721) map </A>","Viewing Distance":"101-500 Feet","Latitude":"43.034749","Summary":"Shape changing lights seen in Davison, Michigan","divs":["Sighting DetailsThis excerpt is taken from a larger report which includes multiple sightingreports from different dates. That evening she was in her room with the lights off when she saw a light comingtoward her window. \"It was moving very slowly, going smoothly, weaving ina andout around trees and things. It came to the left of the window, then cameforward toward the house. I grabbed the binoculars and it backed up. I said tomyself, okay no binoculars, and it came forward again, coming closer. I justcould not resist and picked up the binoculars again. It shot away at a terrificrate of speed.\"The witness got out of bed and went to the bathroom about a half hour after thesighting, she then returned to her room. \"Suddenly it was there again, comingtoward my open window. There was no sound and the way it was moving, I gotreally scared. I ran downstairs and Mom went outdoors with me. When we gotoutside it started to change, the light started spreading out and it started tomake a funny sound. It was like an old engine sound with something wrong withit. It just didnt fit. We could see the bottom and there were four lightswith a circle of red lights in the center. The lights moved apart and becameoblong and two of the lights changed from white to blue.\" As they watched thelights moved to form a circle of light. The object flew toward the southwestand out of view."],"Disposition":"Unresolved","Longitude":"-83.518006","Source":"MUFON","Tags":"City","Date Submitted":"04/02/1986 10:00 UTC","files":["/var/www/straped/mufon/html2text/1721.html.txt","/var/www/straped/mufon/org/1721.html"],"Weather Factors":"Unknown","Date of the Event":"04/02/1986 10:00 UTC","Sighting Duration":"00:00:00","City":"Davison","Region":"Michigan","Country":"United States","Object Flight Path":"Unknown","Object Shape":"Oval","Log Number":""}