{"Date Submitted":"01/01/2009 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.466994,+-73.17096(17217)&iwloc=A&hl=en\"> mufon case (17217) map </A>","Weather Factors":"None","Longitude":"-73.17096","City":"South Burlington","Object Features":"Unknown","Date of the Event":"01/01/2009 06:30 UTC","Latitude":"44.466994","Source":"MUFON","Region":"Vermont","Log Number":"US-05282009-0020","Tags":"City","trends":["There has been one other sighting in South Burlington","There were no other sightings in South Burlington on or around January 1st 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/17217.html.txt","/var/www/straped/mufon/more/17217_submitter_file1__januaryn2009003.JPG","/var/www/straped/mufon/more/17217_submitter_file2__januaryn2009001.JPG","/var/www/straped/mufon/more/17217_submitter_file3__januaryn2009002.JPG","/var/www/straped/mufon/more/17217_submitter_file4__case17217a.jpg","/var/www/straped/mufon/org/17217.html"],"Case Number":"17217","Sighting Duration":"Undisclosed","Object Shape":"Star-like","divs":["Sighting DetailsI was on my deck having a cigarette before work when I noticed a bright light off in the distance. I live near an airport and have seen many numbers of planes and helicopters. There is also an Army base at the airport. Civilian and military airplanes & helicopters frequent the area. This particular light was stationary and was glowing blue and white. The light was also in the opposite direction of the airport. At first I thought another plane, but the light was floating there over houses. The planes that land at the airport have a designated flight path that does not pass over any housing areas. I went inside and grabbed my camera off the fireplace hearth and snapped a series of 3 photos. It was tough to snap a photo as it was dark, so I placed the camera on the deck railing to gain support and zoomed in. I only have a 10x zoom lens. Just as I was looking at the view finder the light slowly dissapated and where gone. I'm not sure what to make of the pictures. What I do know is that this light was not any sort of plane, or helicopter. 100%.... While examing the photos in Photoshop I was able to zoom in on the object. Notice how the stars around the object are stationary but the lights seemed blurred as if it were vibrating or moving. You can also see the tree branches in my yard as the object was in the distance."],"Disposition":"IFO","Object Flight Path":"Stationary","Summary":"Bright lights got my attention while having a smoke."}