{"City":"Antioch","Weather Factors":"None","Tags":"City","Case Number":"17212","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-86.670922","Country":"United States","divs":["sighting detailsi was 11 years old. i was living at the bavarian apartments (building p) which was adjacent to a patch of woods which we always played in and rode our bikes\\motorcyles in. one evening, three friends and myself were playing near the corner of the apartments (building p). we saw a glowing orange-yellowish ball come into our line of sight at a 45 degree angle. this object was moving at approximately 40-60 m.p.h. it came to a complete stop, hovering briefly above the tree tops of the woods, then desended straight down into the woods. the woods were glowing as it desended into the woods. i was in awe of this event. we each ran to our apartments and got flashlights. when we reasembled, the woods were dark. we entered the woods and followed trails to the center of the woods where we anticipated the object to be. we found nothing. we looked for scorched areas, broken tree limbs or disturbed patches of ground. we didn't find anything. we went back the following morning thinking we'd find something with the help of the sunlight. we couldn't find any clues. of course we were young and really didn't know what we were looking for other than physical proof. today, if you go to the same area you'll find that that patch of woods is now developed with housing. i am now 47 years old, and understand what we all saw that night was a special moment that few humans get to experience. and it's enough for me to know that i know..."],"Object Shape":"Fireball, Sphere","Object Features":"None","Latitude":"36.0669","Date of the Event":"06/12/1974 08:20 UTC","Date Submitted":"06/12/1974 08:20 UTC","Disposition":"Unknown","Log Number":"US-05282009-0015","Object Flight Path":"Stationary,Path then hovering","trends":["There have been 6 other sightings in Antioch","There were no other sightings in Antioch on or around June 12th 1974"],"Region":"Tennessee","files":["/var/www/straped/mufon/html2text/17212.html.txt","/var/www/straped/mufon/org/17212.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.0669,+-86.670922(17212)&iwloc=A&hl=en\"> mufon case (17212) map </A>","Viewing Distance":"101-500 Feet","Summary":"Ball of light descends at 45 degrees, stops, descends slowly."}