{"trends":["There have been 3 other sightings in Salisbury","There were no other sightings in Salisbury on or around May 28th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Latitude":"51.076185","Date of the Event":"05/28/2009 11:41 UTC","Object Features":"Dome","City":"Salisbury","files":["/var/www/straped/mufon/html2text/17227.html.txt","/var/www/straped/mufon/org/17227.html"],"Weather Factors":"Unknown","Region":"England","Object Flight Path":"Stationary","Longitude":"-1.789592","Summary":"Localised Dorset 'sighting' and recording.","Date Submitted":"05/28/2009 11:41 UTC","Object Shape":"Egg","Case Number":"17227","Country":"United Kingdom","Sighting Duration":"00:12:03","Log Number":"GB-05292009-0002","Tags":"City","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=51.076185,+-1.789592(17227)&iwloc=A&hl=en\"> mufon case (17227) map </A>","Disposition":"Unresolved","divs":["Sighting DetailsAfter driving back home (in Broadstone, Dorset) from seeing my Girlfriend at roughly twenty minutes past eleven (GMT). I suddenly noticed a small silver, egg shaped object approx. three hundred feet in the air, just over Ridgeway park. Upon stopping the car along Dunyeats Road and inspecting it for awhile, it appeared to simply hover in mid-air. No lights were operating upon it's surface and the definition of the shape was clear enough. It was a 'sideways egg' more or less and it's point was west facing. It had no motion, but as I stepped out of the car to check it out, I started to feel the windows of my car vibrate as I closed my side door. There was a gorgeous low bass-line emitting from what I thought was the object, as no other cars or Industrial equipment was operating near-by. There was a slight tingling from listening to the noise, a gentle massaging effect that did not upset me physically. Being a a boom operator, I quickly hooked up my Rode NTG-2 and field recorder from my boot and held the boom up as high as I could. I even thought about standing on the roof of my car. At about twenty to midnight, the humming slowly faded away and the object just simply blended into the night sky. Not an instant effect, but one that if you were to look back at, it would be gradually less and less visible to the eye. The recording is in WAV format, but I have (attempted) to clean up the pulses. There have been a few recent sightings of lights over the local Heathland, but as of yet, this thing was the most intriguing. - Tobe"]}