{"Log Number":"US-05282009-0024","divs":["sighting detailsoccurred : 9\\8\\2002 23:13 (entered as : 09\\08\\02 23:13) reported: 9\\9\\2002 8:24:04 pm 20:24 posted: 3\\21\\2003 location: fallon, nv shape: triangle duration:10 seconds fallon triangle seen by ufo television talk show host sept. 8 2002 11:13 pm while outside having a smoke i was looking north of 1880 auction rd when i saw a dark shadow of substance dimly lit hugh craft fly by at about 1000 feet. this craft traveled west down williams ave with no running lights but dimmly lit light nodes were seen but they were not lit. the nodes were in the shape of the whole craft, triangle. estimate amount of speed i would say 20 mph or faster. no noise was associated with the craft. i was completely surprised of this event and said why me. i have hosted a ufo television talk show for ten years of which mr. davenport has been a guest many times. i believe this was the true and real triangle craft. it was so completely unexpected yet there it was so close and so huge. i did not see a leading edge or rear of craft i just saw a triangle from the side and bottom of the ship. the sky was clear and about 70 degrees."],"Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Nevada","Date of the Event":"09/08/2002 11:13 UTC","Date Submitted":"09/08/2002 11:13 UTC","City":"Reno","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.536173,+-119.811303(17221)&iwloc=A&hl=en\"> mufon case (17221) map </A>","Country":"United States","Case Number":"17221","Source":"MUFON","Tags":"City","Object Features":"Other","Longitude":"-119.811303","Object Flight Path":"Straight-line path","Summary":"The Fallon Triangle.","Latitude":"39.536173","trends":["There have been 65 other sightings in Reno","There was one other sighting in Reno on or around September 8th 2002"],"files":["/var/www/straped/mufon/html2text/17221.html.txt","/var/www/straped/mufon/org/17221.html"]}