{"Weather Factors":"None","divs":["Sighting DetailsThis statement is in fact two reports of the same craft seen twice within a three week period. I do not remember the exact date but in the second week of May 2009 a co-worker and myself were dumping trash in a dumpster out behind the building we work at. The area is poorly lighted and is located near the city limits of Stephenville. The time was around 12:30am and the sky was overcast as we were heading back toward the building my co-worker pointed to the sky and exclaimed \"what the hell is that?\". What I saw appeared to be a very large triangle shaped craft, kind of a mix between a boomerang and triangle shape. If I had to be more exact, I would say it looked like a hang glider. I only saw it for a couple of seconds, it appeared to be a gray color and seemed to have a dim glow to it with no external lighting visable. It was traveling very fast and disappeared into the overcast. second sighting: On May 28th 2009 at around 1am, the same co-worker and myself again were in the same area dumping trash. The weather was clear, no wind and quiet. I happen to look to the west and saw something dimly lit and coming towards our position, the track of the object was from west to east and I estimate it's altitude to be approxamatly one to two thousand feet. As it passed, it had a dim gray glow and made no sound. I could see what appeared to the the lights of the city reflecting off of it as it passed over them. I estimate the size to be roughly the size of a Boeing 737 commercial airliner. After it passed our position, it appeared to bank sharply and that is when we saw the same triangle or Hang glider shape we had seen three weeks earlier. There were no external lights but was easy to see because of the dim glow it seemed to have. I am a poor judge of speed, but it was moving very fast. My co-worker estimated it was traveling at least 400 to 500 MPH. The one thing that stands out about the whole incident, is how there seemed to be electricity in the air, like static electricity, like your hair was standing on end. It took several minutes to get over that feeling."],"Log Number":"US-05282009-0026","Date of the Event":"05/28/2009 01:00 UTC","Case Number":"17223","Summary":"Triangle-shaped craft heading east at a high rate of speed.","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around May 28th 2009"],"Object Shape":"Boomerang, Triangle","Disposition":"Unknown","Tags":"City","Longitude":"-98.197623","map":"<A HREF = \"http://maps.google.com/maps?q=32.230576,+-98.197623(17223)&iwloc=A&hl=en\"> mufon case (17223) map </A>","City":"Stephenville","Object Features":"Dome","Country":"United States","Viewing Distance":"Unknown","Region":"Texas","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17223.html.txt","/var/www/straped/mufon/org/17223.html"],"Latitude":"32.230576","Sighting Duration":"00:00:08","Date Submitted":"05/28/2009 01:00 UTC","Source":"MUFON"}