{"Disposition":"IFO","Viewing Distance":"Over One Mile","Longitude":"-111.83671","Country":"United States","Date of the Event":"05/28/2009 07:10 UTC","Date Submitted":"05/28/2009 07:10 UTC","Source":"MUFON","Object Features":"None","City":"Chandler","Log Number":"US-05282009-0025","files":["/var/www/straped/mufon/html2text/17222.html.txt","/var/www/straped/mufon/more/17222_submitter_file1__PICT3195.JPG","/var/www/straped/mufon/more/17222_submitter_file2__PICT3201.JPG","/var/www/straped/mufon/more/17222_submitter_file3__PICT3205.JPG","/var/www/straped/mufon/more/17222_submitter_file5__PICT3216.JPG","/var/www/straped/mufon/org/17222.html"],"Region":"Arizona","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.31346,+-111.83671(17222)&iwloc=A&hl=en\"> mufon case (17222) map </A>","Case Number":"17222","trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around May 28th 2009","This sighting has never been favorited.",""],"Latitude":"33.31346","divs":["sighting detailsmy daughter called me stating that the local radio is talking about 11 to 16 disks in the sky above chandler (she was driving to work and couldn't see). i went out my front door talking to her and initially looked in the direction of chandler, nw, to try and see what she was talking about. didn't see anything and joked with her about needing to drive into chandler to try and observe what the radio was talking about. said good byes. i then went back out and leaned on my honda roof and slowly started to scan the sky in the direction of chandler. i then came across 2 white\\shiny disks\\orbs at about a 35degree angle. they were side by side with about a pinky width between them. i then continued scanning the skyline, due to the reported 11 to 16, and ended up observing 7 more white\\shiny orbs\\disks at about a 45 degree angle that stuck out against the clear blue sky. this second set of obrs\\disks were in 2 groups. one group of three were in a triangle pattern while the other was in a box formation (one orb\\disk in each corner of a \"box\" and a \"triangle\" formation. ran in and told my wife (which she just laid there) and then grabbed the camera and proceeded to take 40 pictures with my vivitar, vivicam 5386, 3x zoom f=5.4-16.2mm. by this time my wife walked out to see what i was talking about (her eyes were still adjusting to waking up, and didn't see anything). she advised i should wake up my 8yr old to have her come look. during the whole time of observing, i was quit elated that i finally got to see things in the sky. my eyes kept feeling wierd, trying to adjust on such small objects. (photo attached, zoom into the bottom center of the picture, right of the date)"],"Tags":"City","Object Shape":"Circle, Sphere","Summary":"Observed nine circles, NW of Queen Creek, over Chandler. They went from a box formation to triangle formation.","Object Flight Path":"Stationary,Other","Weather Factors":"None"}