{"Viewing Distance":"Over One Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/17236.html.txt","/var/www/straped/mufon/org/17236.html"],"Object Features":"Unknown","divs":["Sighting DetailsThe following is extracted from the MUFON Field Investigator Report made by Cameron Pack. The witness was laying face-up on the flight-line of Nellis Air Force Base waiting for the jets that he was responsible for as maintenance crew chief to return to the base when his sighting occurred. The sky was completely clear at this time. The witness stated that there was dry, cool air that day and not too much distortion when viewing the sky and aircraft. He noticed in the sky directly above him at the zenith that there appeared to be several objects in the sky. There were four objects total, with three being stationary and one in motion. All four objects were fairly close together. The objects were clearly defined and appeared as little white dots in the sky. The color of the objects was described by the witness as being a white color and he approximated the exact shade to be the color of a clover flower. The witness estimated the size of the objects to be a little bigger than a star seen in the night sky. The altitude of the objects was stated by the witness to be very high and estimated to be at least 30,000 feet. The three stationary objects appeared to be in some type of formation. The one object that was in motion was performing maneuvers which the witness described as being impossible for any man-made aircraft, classified or not, to perform, as he stated that the amount of G-forces being put upon the object would have caused death for any human pilot. The witness drew the maneuvers of the object on a piece of paper as being very tight loops, turns and circles. (See attached witness sketch.) The objects did not appear to reflect any light and did not appear shiny at all. There was no halo-effect or any vapor trails being exhibited by the objects. The witness called over three other US Air Force personnel to witness what he was seeing, with only two being able to see the objects, as one wore glasses and did not have excellent vision."],"Summary":"There were three stationary white colored objects with a fourth nearby that was performing tight circles and loops that no human could withstand high in the sky over Nellis AFB","Weather Factors":"Unknown","Object Shape":"Star-like","Country":"United States","Date of the Event":"11/30/2002 12:00 UTC","Log Number":"US-05292009-0011","Latitude":"36.254175","City":"Nellis AFB","Object Flight Path":"Stationary,Other","Date Submitted":"11/30/2002 12:00 UTC","Disposition":"Unknown","Longitude":"-115.064392","Sighting Duration":"Undisclosed","Region":"Nevada","Case Number":"17236","trends":["There have been no other sightings in Nellis AFB","This sighting has never been favorited."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.254175,+-115.064392(17236)&iwloc=A&hl=en\"> mufon case (17236) map </A>"}