{"Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17237.html.txt","/var/www/straped/mufon/org/17237.html"],"Log Number":"US-05292009-0012","Latitude":"36.861796","Tags":"City","divs":["Sighting DetailsThis description is extracted from the MUFON Field Investigator report made by Cameron Pack. The witness was on his break outside in the parking lot while working when he had his sighting. There was a loose group formation of seven orb-like objects coming from the southern sky and moving north. The formation was not of any particular style. (See attached sketch drawn by the witness.) The objects traveled at a speed moderate enough to be seen and able to be identified as something that was not man-made, but they did travel at a fairly high-speed in comparison to conventional aircraft. The formation was completely silent and left no vapor trail. The objects did not waver or wobble while moving and stayed together in a straight line path during the entire time that the witness observed them. The objects were very bright and shiny to give the appearance to the witness of a new headlight being caught in direct sunlight while turned off. The objects maintained equal brightness and shape during the entire time that the witness observed them. The witness stated that the color of the objects appeared to be similar to that of a bright white flare when lit. The witness estimated that the objects were at between 6,000 and 10,000 feet in altitude. The entire formation of the objects gave the appearance that they were about four to five times the size of an airliner at the same altitude. There was an airliner present at the time of the sighting and was traveling from south to northeast. The witness stated that the aircraft could have possibly seen or picked up the objects on radar. Also, the witness stated that the objects passed over the Ocean Naval Air Station as they went out of view from him and no doubt there might have been witnesses on base and possibly tracking of the objects by radar."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.861796,+-75.968185(17237)&iwloc=A&hl=en\"> mufon case (17237) map </A>","Region":"Virginia","Summary":"A formation of seven bright, shiny, white colored orbs passed quickly and silently overhead in straight lines with no change in altitude.","Disposition":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Sphere","Object Features":"Unknown","Country":"United States","Case Number":"17237","Longitude":"-75.968185","City":"Virginia Beach","Source":"MUFON","Date Submitted":"11/30/2008 12:00 UTC","Date of the Event":"11/30/2008 12:00 UTC","trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around November 30th 2008"],"Sighting Duration":"Undisclosed"}