{"divs":["sighting detailsthe whole thing was combination of two emiting light objects, the base part was a constant light with simillar to square shape supported with one small flashing light from the left-bottom side. the whole thing was on static place for few minutes or seconds and then it start to move to the left\\right, top\\bottom and forward\\backward and of its initial position then it stops for few minutes or seconds on new position. while doing that the base object was constantly emiting and the small one was emiting in impulses (3 short flashes) and on the fourth it was off. also it looks like it was rotating around its vertical axis, but not doing full 360 degrees.. maybe around 130-180 degrees in ping-pong style of cycle. after around a hour the whole thing become one \"solid\" circular or spherical object with more strong light than before and then it just turn off and dissappear.. like to turn off an electrical bulb. after a minute the forest on the hill below shined up twice.. and that was all"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Stara Zagora","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.423917,+25.624902(17246)&iwloc=A&hl=en\"> mufon case (17246) map </A>","Longitude":"25.624902","trends":["There have been 2 other sightings in Stara Zagora","There were no other sightings in Stara Zagora on or around May 29th 2009"],"files":["/var/www/straped/mufon/html2text/17246.html.txt","/var/www/straped/mufon/org/17246.html"],"Log Number":"BG-05302009-0006","Object Shape":"Flash, Square, Rectagular, Other","Country":"Bulgaria","Object Features":"Undisclosed","Sighting Duration":"01:15:00","Case Number":"17246","Region":"Stara Zagora","Date of the Event":"05/29/2009 03:40 UTC","Source":"MUFON","Date Submitted":"05/29/2009 03:40 UTC","Disposition":"Unresolved","Summary":"Around 20m big object stay still above a hill, around 5-7 km far, staying still for some time then start to move somehow chaotic to the left/rigth and forward/backward, also slow rotate around its vertical axis wich.","Weather Factors":"Unknown","Latitude":"42.423917"}