{"Object Flight Path":"Straight-line path","Tags":"City","Region":"Texas","Date of the Event":"05/29/2009 09:11 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsMy girlfriend and I watched the ISS (international space station) fly over 2 nights ago and this time with her 14 year old daughter, the 3 of us were watching it again (on 5-29-09). Information on its position and time came form SpaceWeather.com. We knew when and where to look and it appeared at the exact time and location predicted. We watched the ISS for about 20 seconds and then all three of us, at the same time, saw another object moving and approaching it from behind. Initially we were all in disbelief that we were actually watching something we knew was the ISS which was amazing itself and then something appeared that we couldn't explain. We were all witnessing a UFO event. The other, unidentified object overtook and moved past by the ISS. The UFO was moving 2.5 - 3 times faster than the ISS. They were moving in the same general direction but not the exact same heading. It was definately not an airliner as it was moving much faster. It had no colored lights. It had a much dimmer appearance when compaired to the ISS. The UFO was not a constant light but did not blink, more of a random dimming and then back to bright appearance. It was moving in a strait line. We watched them both until they moved out of sight. PS. I am a Mufon Field Investigator, #13357"],"files":["/var/www/straped/mufon/html2text/17241.html.txt","/var/www/straped/mufon/org/17241.html"],"City":"Mt Pleasant","Date Submitted":"05/29/2009 09:11 UTC","Latitude":"33.156786","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.156786,+-94.968269(17241)&iwloc=A&hl=en\"> mufon case (17241) map </A>","trends":["There have been no other sightings in Mt Pleasant","This sighting has never been favorited."],"Case Number":"17241","Summary":"While watching the space station fly over another object appeared.","Country":"United States","Log Number":"US-05302009-0001","Object Shape":"Star-like","Sighting Duration":"00:02:00","Viewing Distance":"Over One Mile","Longitude":"-94.968269","Source":"MUFON","Disposition":"Unknown"}