{"Object Shape":"Circle","Sighting Duration":"Undisclosed","Longitude":"153.026772","Region":"Queensland","Disposition":"Unresolved","Case Number":"17245","Summary":"Little lights.","map":"<A HREF = \"http://maps.google.com/maps?q=-27.462023,+153.026772(17245)&iwloc=A&hl=en\"> mufon case (17245) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/17245.html.txt","/var/www/straped/mufon/org/17245.html"],"divs":["Sighting DetailsHello, where i live must be a hotspot for ufos or something, This evening i decided to go star watching which i always do so i got my camera, compass, Binoculars and watch and went outside, it was 5:56pm when i saw this orange light about the size of a pea move across the sky very fast only lasted about 10-15 seconds so i go my camera out and took footage of it and it went behind the trees but at first i thought it was a plane or something but i couldn`t hear anything when in the corner of my eye i saw the light stop in mid air behind all the trees but there were gaps in the tree so i watched it for a second when a big white light the same size of the normal object went up from it and stood there above it. I was so excited i was videoing it when i called my sister and dad out my my dad came out and the objects were gone but my dad came in and i was out there looking around where it happenened when i saw a light like a star dissapear and went to take a video but my camera died and didn`t work when it was on full battery. I was dissapointed but i knew i had the footage from before to see it so i went in to look at the video when i saw no object there and it must of been small or something, i don`t blame people for not trusting me on this what are the odds of that happening and me reporting so many sightings but i can make a bet if someone looks at the sky for about 2 hours where i live for a couple of days in a row you will atleast 1 thing weird. I have reported a sighting my dad and brother saw and 4 of my own in december 2008 to now. Thanks and i don`t blame you for not beliving me i wouldn`t but i saw what i saw and the weather was clear as."],"Weather Factors":"Unknown","City":"Brisbane","Object Flight Path":"Undisclosed","trends":["There have been 27 other sightings in Brisbane","There were no other sightings in Brisbane on or around May 30th 2009"],"Date of the Event":"05/30/2009 05:56 UTC","Date Submitted":"05/30/2009 05:56 UTC","Latitude":"-27.462023","Source":"MUFON","Country":"Australia","Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"AU-05302009-0005"}