{"divs":["Sighting DetailsThere were many of us at the club's observatory tonight to enjoy the clear sky and get some observing time in. We also were watching the ISS as it passed over but noticed the same small object that came up from behind and zipped by the ISS very rapidly. It was much smaller but was moving so fast it didn't take it any time to catch up with the ISS, pass it and continue on until it was lost from sight. Basically we saw the same as the group down in Mt. Pleasant, TX., Case Number 17241. The smaller object was most certainly not a standard satellite that we are very accustomed to seeing or any aircraft that any of us was familiar with. It pulsed in brightness as it flew by. From our location it remained approximately 10 degrees to the right of the ISS at all times while in sight. It was surprising, astonishing actually, as to how fast this small pulsing object was moving. If there happens to be a satellite that moves at the same speed, well, it's the first time any of us have ever seen one and I can assure you we've seen more or less all of them."],"Sighting Duration":"00:03:00","Viewing Distance":"Unknown","Summary":"The same object was seen by many at the RMCC Observatory - Mounds, OK as reported from Mt. Pleasant, TX.","Log Number":"US-05302009-0003","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=35.879664,+-96.054467(17243)&iwloc=A&hl=en\"> mufon case (17243) map </A>","Source":"MUFON","trends":["There have been 3 other sightings in Mounds","There were no other sightings in Mounds on or around May 29th 2009"],"Disposition":"Unknown","Date of the Event":"05/29/2009 09:21 UTC","files":["/var/www/straped/mufon/html2text/17243.html.txt","/var/www/straped/mufon/org/17243.html"],"City":"Mounds","Country":"United States","Weather Factors":"None","Case Number":"17243","Region":"Oklahoma","Latitude":"35.879664","Date Submitted":"05/29/2009 09:21 UTC","Object Features":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-96.054467","Tags":"City"}