{"trends":["There have been no other sightings in Baner","This sighting has never been favorited."],"Date Submitted":"06/30/2009 12:00 UTC","Weather Factors":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"17244","Country":"United States","Summary":"Bright white star-like object moving rapidly in the sky.","Longitude":"-89.397128","Tags":"City","Object Shape":"Star-like","City":"Baner","files":["/var/www/straped/mufon/html2text/17244.html.txt","/var/www/straped/mufon/org/17244.html"],"Source":"MUFON","Region":"Illinois","Disposition":"Unresolved","Object Features":"None","Sighting Duration":"02:40:00","divs":["Sighting DetailsI am in Banner, IL . The object is being viewd in a south west direction. It was hovering in the night sky. Its moving rapidly left to right and then fades dim and then light. It must have been outside for hours.. It does not seem to go away . Its very bright like the helicopter lights but dims in and out and again moves in all directions.. Its like its being dangled on a string... I was just walking the dog outside andoticed it in the clear night sky. I compared it to several visible stars in the sky and it was the brights . I am very familar with the stars at night in this area and I have never seen that there before... I am joking with friends saying there are UFOS but this time I was right. The other person that viewed with me is a Volunteer EMT and firefigher Even after typing this for a few minutes I bet its still in the sky. I am so excited. I was joking with my friend and grabbed my very powerfull laser pin. I started point it at the light and flashing it on and off. I never expected to get a reaction. It seemed to stop moving and just got brighter. No point in taking a photo becuase it appears to look like a star. Any video would be pointless due to shaking and not able to remain steady."],"Log Number":"US-05302009-0004","Date of the Event":"06/30/2009 12:00 UTC","Latitude":"40.639955","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=40.639955,+-89.397128(17244)&iwloc=A&hl=en\"> mufon case (17244) map </A>"}