{"Case Number":"17248","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around May 22nd 2009"],"Longitude":"-118.550616","Viewing Distance":"Unknown","Latitude":"34.149485","divs":["Sighting DetailsI walked outside to get my baby monitor and noticed a large and bright white triangle in the sky with sparkling lights on the edges. I didn't think initially that it was a UFO because I'm not the type to look for them. I figured it was something affixed to the top of a far off building that was illuminated for the night, maybe for a party... but while looking and thinking I realized it was too large and too odd for that. Still, I didn't think it would move because it just was there for so long and not moving and not making any sound. It was north of Tarzana, where I was located. So, I bent down to get the baby monitor and my iphone so I could take a picture, and when I looked up it was gone. I never saw it fly or move, just saw that the sky was once again clear. This happened between 10 and 10:30 at night. I told my mother and mother in law when I went in the house. They were inside playing cards. We went back outside to look but it didn't come back, the sky was dark. So, I'm not really sure what it was but all I can say is it was very large, bright and shaped like a triangle. We watched the eleven o'clock news hoping to see some report on it but there was nothing. It was too large and obvious not to be seen by many people so I'm wondering why I'm not reading of any other sitings? Coincidentally, the next night we found my little cat dead. She had survived fine as an indoor outdoor cat for the last 15 years. We are certain she was killed Friday night, the 22nd. The same time I saw the big triangle. Our little cat was decapitated. Her head cleanly sitting on the lawn. There was no blood. Next to her, just a leg (partially eaten) just bone left and part of a foot. Again, no blood. There was also her fur. We are assuming an animal consumed most of her, we just found it odd that her head was so cleanly cut from her body... and because of that wondered if it was possible it was done by people. But because so much of her body was missing we figured she was probably eaten. Anyhow, summing it up as one weird night, but that's what happened"],"Source":"MUFON","Summary":"Big bright white triangle with flashing lights on the exterior.","map":"<A HREF = \"http://maps.google.com/maps?q=34.149485,+-118.550616(17248)&iwloc=A&hl=en\"> mufon case (17248) map </A>","files":["/var/www/straped/mufon/html2text/17248.html.txt","/var/www/straped/mufon/org/17248.html"],"Object Shape":"Triangle","City":"Los Angeles","Disposition":"Unknown","Region":"California","Weather Factors":"Unknown","Log Number":"US-05302009-0008","Date of the Event":"05/22/2009 10:20 UTC","Object Flight Path":"Stationary","Object Features":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"05/22/2009 10:20 UTC","Country":"United States"}