{"files":["/var/www/straped/mufon/html2text/17240.html.txt","/var/www/straped/mufon/org/17240.html"],"Object Shape":"Star-like","Object Flight Path":"Straight-line path","Longitude":"-97.31942","City":"Fort Worth","Disposition":"IFO","Latitude":"32.733229","Country":"United States","Source":"MUFON","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around May 29th 2009"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.733229,+-97.31942(17240)&iwloc=A&hl=en\"> mufon case (17240) map </A>","divs":["Sighting DetailsThis sighting would not be unusual except the object was moving AWAY from my position and never varied in brightness, and emitted no sound. The brightness was of magnitude zero to minus one which would put it in the Venus range. I was sitting on the front porch since before dark enjoying the early evening air. Looked up accidently and saw a BRIGHT light overhead. Object passed over central Ft Worth and moved to the South East at a speed of about 150 to 200 mph. Hard to tell the altitude which would of course change the rate of speed. Object never changed course as far as I could see; it moved over houses and trees out of sight. Saw the object about 2 minutes. No sound at all. Being a rather avid sky watcher since High school days (I am now 57) this caught my eye as something unusual. Rather than make a move for the binocs, I continued to just sit and watch to see where it went. No tail-postion aircraft white light was EVER this bright! This light had a bluish white color. I have over 34 years as a private pilot, 27 years in Aerospace writing Flight Manuals for fighter aircraft, and am an avid aircraft nut and radio control aircraft modeler. I am also an amateur astronomer since High School days (not too active these days) and am pretty familar with the night sky and how aircraft appear at night. This will have importance ONLY if someone else in the area saw the same thing to a greater extent than I. Right now I have no idea what it was, but it was VERY unusual whatever the case."],"Summary":"Bright light equal to Venus, silent, never changing brightness or course, while moving away from me.","Tags":"City","Region":"Texas","Log Number":"US-05292009-0015","Case Number":"17240","Date of the Event":"05/29/2009 09:00 UTC","Object Features":"None","Weather Factors":"None","Sighting Duration":"00:02:00","Date Submitted":"05/29/2009 09:00 UTC"}