{"Weather Factors":"None","Disposition":"Unknown","Region":"North Carolina","Tags":"City","Date of the Event":"05/31/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/17257.html.txt","/var/www/straped/mufon/org/17257.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.002773,+-78.896419(17257)&iwloc=A&hl=en\"> mufon case (17257) map </A>","Object Features":"Unknown","City":"Durham","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around May 31st 2009"],"Source":"MUFON","Date Submitted":"05/31/2009 12:00 UTC","Longitude":"-78.896419","Country":"United States","Log Number":"US-05312009-0001","Summary":"Two unusually flashing lights traveling in synchronicity.","Sighting Duration":"Undisclosed","Latitude":"36.002773","Object Shape":"Star-like","Object Flight Path":"Straight-line path","Case Number":"17257","divs":["Sighting DetailsSeven well-traveled adults from five countries saw this, all of whom hold at least Masters' degrees, with the minimum age about 37. We had just left a get-together at the home of another couple, around 12:15am, and were standing in their front yard when I noticed two flashing lights in the southwestern sky, about 40-degrees from the horizon, traveling in a westerly direction, with the lights roughly horizontal. The lights were far enough from one another to not be a conventional craft, but close enough so some observers thought they were part of the same craft, with a couple of people commenting they thought it was the space station; however, the distance between the lights was at least that of the thickness of my thumb, held out at arm's length, so if they were part of a single craft it would have had to be massive in size. The blinking of the lights seemed erratic, but at the same time they seemed to be blinking in an odd synchronicity with one another. The lights passed behind a tall tree, and then seemed to have disappeared, as they did not reappear on the right side of the tree. The whole event took at least three minutes and maybe as much as four, and was long enough for the group to comment to one another on what we were seeing, and acknowledge that it was something unlike anything any of us had seen before. The sky was clear, and there were many stars out."],"Viewing Distance":"Unknown"}