{"City":"Philadelphia","Viewing Distance":"Over One Mile","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around May 13th 2009"],"Tags":"City","Object Features":"Unknown","Log Number":"US-05302009-0010","Longitude":"-75.161649","Region":"Pennsylvania","Date Submitted":"05/13/2009 03:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.956055,+-75.161649(17250)&iwloc=A&hl=en\"> mufon case (17250) map </A>","Case Number":"17250","Object Shape":"Star-like","divs":["sighting detailson may\\13\\2009 the most uncanny thing happened.after returning home from being out,i parked my car in my garage and locked the door.i then began walking to my back door.about half way i stopped and something or some feeling possessed me to look up at the heavens.it was an unusually clear night and there were many stars to view.at this time looking to my south i seen an object or ufo out of nowhere travel past many stars in a matter of seconds.first thing i realized that the ufo was very far away, because it looked about the same size as the stars.i would say if i had to guess that the ufo was not in earth's atmosphere, but in outerspace within the earth's orbit or close to it.i then began talking to my self saying i know that was a ufo, but just in case let me think of the most logical explanation for what i seen. and thought it could be a satelite,(even though ive seen them before and know satelites move very slow)but then never seen one go in the trajectory it was traveling.the trajectory it was traveling was from right to left on a 45 degree angle downward.after it passed by about four or five stars it dematerialized and lost sight of it.albeit i seen another one about 25 to 30 minutes later. now standing in the same spot i viewed another ufo, or it could be the same one from earlier.this sighting was much diffrent,looking south again i witnessed this ufo traveling north while turning my head.the flight charecteristics although still starlike would shake or look jumpy as it traveled.its trajectory was the complete opposite from the first,it was moving between the stars on a 90 degree angle upward.and then it dematerialized and rematerialized close to another star. at that intense moment i had blinked and thought i lost it. but then as quickly as i lost it, it reapeared pulsating very bright.i then became very happy and decided to run in my house and grab a flashlight.when i came back out to the same poisition, i flashed light at it, and then the ufo grew even more brillant. i continued this for another minute or so until the ufo just simply vanished.i began looking in hope of seeing another one, as now it was approxximately 4:45am. at this time i noticed yet another one or the same one as before or before that, i don't know. but now looking to the east close to the moon i saw a ufo moving east,(east to where i live is where the delaware river is located)but this one was not as clear as the other sightings.probably because of the moon light.this ufo's trajectory was on a 90 degree angle, but would stop dematerialize and rematerialize closer to the moon until i lost sight of it."],"Summary":"While standing out in my back yard and staring up at the heavens, I witnessed a UFO traveling between the stars three different times between 3 and 5 in the morning.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17250.html.txt","/var/www/straped/mufon/org/17250.html"],"Latitude":"39.956055","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","Disposition":"Unknown","Date of the Event":"05/13/2009 03:40 UTC"}