{"Country":"United States","Weather Factors":"None","Object Shape":"Unknown","Case Number":"17269","files":["/var/www/straped/mufon/html2text/17269.html.txt","/var/www/straped/mufon/more/17269_submitter_file2__Bestforzoom.jpg","/var/www/straped/mufon/more/17269_submitter_file3__Overheadforzoom.jpg","/var/www/straped/mufon/org/17269.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.646428,+-81.862598(17269)&iwloc=A&hl=en\"> mufon case (17269) map </A>","Tags":"City","Region":"Florida","Sighting Duration":"Undisclosed","Date of the Event":"05/06/2009 06:36 UTC","City":"Fort Myers","Object Features":"Unknown","Longitude":"-81.862598","Log Number":"US-05312009-0013","Summary":"Bright column in lower SE sky, object flying overhead.","Viewing Distance":"Unknown","Latitude":"26.646428","divs":["Sighting DetailsI am in SW Fl. by the gulf. While walking my dog east before sunrise, I noticed a bright column of light in SE. I had my camera but decided not to waste memory until I reached the end of the street that runs N-S. As I walked for a couple minutes, I could see the \"object\" very slowly ascending. Then, with eyes, not camera, I saw a slight flash of metal as if the object turned reflecting the rising sun. It had begun to come in my direction when I resumed filming. It went over me. After turning the speed increased and it quickly flew overhead and was gone. WNW is the actual direction. There was no sound, just silence, except for the morning doves, my breathing (on video) and footsteps. It was very peaceful, and majestic to watch. Slightly NE of where I was standing is direction of SW Regional Airport. Further to the NNE and across the state, is Cape Canaveral. I had my dogs leash in the left hand and camera in the right hand so I tried to get as much of the event as possible. I did take more stills as they were easier to take."],"trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around May 6th 2009","This sighting has never been favorited.",""],"Source":"MUFON","Object Flight Path":"Path with directional change","Disposition":"IFO","Date Submitted":"05/06/2009 06:36 UTC"}