{"Date Submitted":"02/28/1962 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Akron","There were no other sightings in Akron on or around February 28th 1962"],"Case Number":"17260","files":["/var/www/straped/mufon/html2text/17260.html.txt","/var/www/straped/mufon/org/17260.html"],"Latitude":"41.090185","Longitude":"-81.510825","Source":"MUFON","Country":"United States","Date of the Event":"02/28/1962 12:00 UTC","Log Number":"US-05312009-0004","City":"Akron","Object Features":"Window(s), Patterned Surface, Insignia","Object Shape":"Bullet, Missile, Square, Rectagular, Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.090185,+-81.510825(17260)&iwloc=A&hl=en\"> mufon case (17260) map </A>","Tags":"City","divs":["Sighting DetailsIt was early spring, 1962; I was in first grade, home alone in a sparsely inhabited part of Portage County. I was the son of a military man, and quite interested myself in aircraft and the young space program, as with science in general. It was broad daylight. I was musing aimlessly in the southwest corner of our large front yard, near the road (a tar and gravel unmarked 2-lane affair with about four houses in our mile stretch of it). Suddenly, something made me look up above the phone wires and poles. There was a large box-like impossibly-heavy-looking grey object behind, with a significantly-slimmer fuselage sticking out towards the front coming up the road towards me, seeming to float above the road at a height just above the telephone wires; this fuselage had an almost-aircraft-normal looking canopy in the leading 'nose' of the vessel, with indistinct bodies visibly moving about inside. I had just learned the alphabet and numerals, and was sure that the characters on the fuselage must have been some sort of 'letters' and yet, though some of them seemed vaguely familiar, others were definitely not -- which confused me. As the vessel continued to move towards the west (into the prevailing wind) the rear box-like portion (which I immediately thought of as its motive force or engine) came abreast of me; it thrummed with a deep pulsating, yet nearly inaudible sound that was like nothing I'd ever experienced. Again, the closest approximation I've ever come across, was the deep thrumming of a deisel train engine idling. There was no sound of rotors or of thrusters, no dust kicked up. Just a sort of stillness, barely penetrated by that pulsating thrumming sound. I did not move a muscle, and continued to watch until it disappeared behind the tree-line, when complete quiet once again took hold. The whole thing had taken less than two minutes. The local authorities were quick to acknowledge this event, as evidently many reports of it came in; I was naturally quite interested to find out what it had all been about. The official statement was that it had been a \"weather balloon.\" I didn't yet know how hackneid that term was or was yet to become, but even a first grader knew that balloons didn't 'thrum' and, they don't float INTO the wind. Though I don't try to dwell on the experience, when I have thought about it at any time during the nearly fifty years since, it has caused me some nervous agitation. I've only mentioned this to perhaps five or six people, in all the time since, and I'm not real thrilled to bring it up now. Yet MUFON seems to be seriously seeking answers, and perhaps the time is right."],"Summary":"railroad engine-sized vehicle slowly (2 mph?)thrumming into the wind, just above the telephone poles along our country road","Region":"Ohio","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path"}