{"files":["/var/www/straped/mufon/html2text/17274.html.txt","/var/www/straped/mufon/more/17274_submitter_file1__056.JPG","/var/www/straped/mufon/more/17274_submitter_file3__055.JPG","/var/www/straped/mufon/org/17274.html"],"Object Features":"Dome","Latitude":"38.259175","Date Submitted":"04/18/2009 07:30 UTC","Sighting Duration":"Undisclosed","Case Number":"17274","Date of the Event":"04/18/2009 07:30 UTC","Source":"MUFON","divs":["Sighting DetailsOk it was around 7 7:30 or so when my girlfriend said, \"hey whats that?\" We were in the great lawn on the louisville side of the event, perched in between the 2nd street bridge and the kennedy bridge. Well my girlfriend looked over towards the kennedy bridge and then we seen it. It shaped like nothing else I have ever seen before. I wish I could draw it on here for you. Ill try my best to describe what it looked like and what its flight characteristics were like. Ok, Imagine a Big balloon, with several smaller balloons wrapped around it in a circular manner. Kind like saturns rings. It was not of metallic nature, its color was more organic, just like the color of white human skin. When I first seen it, it was hovering over the kennedy bridge. It hovered for a few seconds, the entire time it was spinning, but not in a defined circular manner. Imagine one of those tops you spin on a table. well you know when it slows down and starts to wobble, very unstable, or imagine if you threw a Frisbee the wrong way and it wobbles. Thats how it was spinning. We'll it was during an intermission time of the event and there were several airplanes flying over the entire area with these banners hanging off the back of the airplane, for the sponsors of the event, the horseshoe casino, kroger, blah blah blah. Well this craft hovered up to one of these airplanes altitude and appeared to be checking this airplane out. By this time I was starting to get a little scared, wondering if this thing has bad intentions. I looked around to see if anyone else was witnessing what we were seeing and to my surprise no one else of out of the hundreds of thousands of people who were there saw this thing, its almost like it wanted US and let only US SEE IT! Anyways I have over 6 material witnesses that was with my party that seen it. Ok so let me get back to the story. It was wobbling right around the airplane with the banners, it proceeded to lose altitude, fly under this airplane and then it took off into the general direction of jeffersonville indiana at an incredible speed. Nothing dramatic like sharp turns, very organic in its flight pattern. very circular flight path. Nothing angular, very organic in nature, it was not lit up with lights, it made no noise that I could hear. This was during broad daylight when we seen it. It was so real, I know it was and I dont deny what I saw that day and neither do anyone in my party that was with us. It was very emotional for me personally. I felt scared, privileged to see it, but scared none the less. I felt like this thing had channeled into our minds and it knew that we could see it and it didnt want to be seen by anyone else but us. I dont know what its intentions were but I dont think it had any plans other than to see the show, fireworks, airplanes. I have a theory that it was there to see some of earths technology at work, there were several highly advanced aircraft in attendance that day including the f22 raptor. There were supposed to be several skunk works craft flying in the airshow that day, including the b2 stealth bomber, the f117 nighthawk, but to our surprise none of those planes made an appearance that day like planned. I dont know why. We recorded part of this experience on our digital cameras, both in pictures and in video. This craft made our camera very fuzzy, and no defined pics could be had although we took several seconds of footage. I think it didnt want to be seen, it seemed to be very shy in nature. To my surprise no one has made any reports of this craft, and I think that we were the only people that seen it that night. I believe, and now my friends do as well. Once again it appeared to be very organic in appearance, very unstable in flight, almost seemed to defy physics in its flight pattern. These pics and video arent very good because I believe the craft had the ability to scramble the digital camera. all of the rest of the pics that day were crystal clear, but once we tried to tape and snap pics of this craft it scrambled and highly pixelated the camera."],"Country":"United States","Longitude":"-85.749156","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.259175,+-85.749156(17274)&iwloc=A&hl=en\"> mufon case (17274) map </A>","Region":"Kentucky","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around April 18th 2009","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Me and 5 friends were at thunder over Louisville when my girlfriend seen a real UFO in broad day light.","Log Number":"US-05312009-0018","Weather Factors":"Unknown","Object Shape":"Oval, Saturn-like, Sphere, Other","City":"Louisville"}