{"Viewing Distance":"Over One Mile","Object Shape":"Circle, Diamond, Disc","trends":["There have been no other sightings in Lacassine","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Summary":"There was a big bright light moving up and down and criss cross above the school. I ran to get my camera and video 30 sec. I moved QUICKLY!","divs":["Sighting DetailsI was outside talking on my cell when I noticed that in front of me about 2 miles away there was a bright circle light hovering above the school in Lacassine. What caught my attention was the way it was moving (up, down, side to side)and there was no sound (helecoptor or plane)I knew it was a UFO at that point. It was as if it was trying to get my attention. I ran in the house to get my camera to video, it only too 10 or 15 seconds to do so. By time I got back it was just about out of sight however I believe I did catch some of it on video. In the video you will have to look close over the shed within the first few seconds. As I zoom in you might see it better. My monitor sucks :-) Ok back again 1 hour later 9:30pm,I am our side and I see something moving across the sky move from the east towrds the High school and then \"Burns out\" as if a shooting star but come sideways. It is now 9:45 and as I am typing this I can hear a helicoptor flying around outside my home. I go and check and it is a big helicoptor. The same helicoptor circled my house last night for about a hour or so. Not sure as to why. I did not observed anything such as I did tonight."],"Longitude":"-92.921537","Case Number":"17279","City":"Lacassine","Date Submitted":"05/31/2009 08:36 UTC","files":["/var/www/straped/mufon/html2text/17279.html.txt","/var/www/straped/mufon/org/17279.html"],"Weather Factors":"Unknown","Date of the Event":"05/31/2009 08:36 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.235485,+-92.921537(17279)&iwloc=A&hl=en\"> mufon case (17279) map </A>","Latitude":"30.235485","Country":"United States","Log Number":"US-05312009-0023","Object Flight Path":"Other","Source":"MUFON","Object Features":"Unknown","Region":"Louisiana","Disposition":"Unknown","Tags":"City"}