{"Weather Factors":"Unknown","Log Number":"US-06012009-0005","Latitude":"40.93392","Country":"United States","City":"Yonkers","map":"<A HREF = \"http://maps.google.com/maps?q=40.93392,+-73.889087(17285)&iwloc=A&hl=en\"> mufon case (17285) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Cylinder","Date Submitted":"05/25/2009 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/25/2009 12:00 UTC","Region":"New York","Object Features":"None","Longitude":"-73.889087","Disposition":"Unresolved","trends":["There have been 6 other sightings in Yonkers","There were no other sightings in Yonkers on or around May 25th 2009"],"Source":"MUFON","divs":["sighting detailsi was sitting in front on a laundromat (between gold st and union place) on a retainer wall, waiting for my cousin to finish doing his laundry. i was looking out over the hudson towards the palisades when i noticed a very bright object hovering in the sky over the hudson river between yonkers train station and glenwood train station. the object was cylinder in shape with well defined edges, appeared \"solid\", and had an extremely shiny surface (like mylar). it was rotating clockwise at approximately 6-8 seconds per revolution, was tilted at approximately a 45 degree angle, and was at a height slightly above that of small planes and helicopters usually seen flying over the area. from my perspective, the object measured about 3\\4\" to 1\" in length and about 1 centimeter in width. the object hovered at first then slowly moved in a zig-zag fashion (rotating slowly as it went) first moving southeast, then moving west - climbing as it went. i did not see any windows, fins, wings, tethers or anything else attached to it. it did not behave like a balloon and i could not hear any noise associated with it nor see any exhaust. i did not notice any planes or other aircraft in the area at the time. the sky was clear and the day very sunny. my initial reaction was confusion at seeing a \"tube\" in the sky then bewilderment and amazement as i watched it for close to 15 minutes until it faded from view."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17285.html.txt","/var/www/straped/mufon/org/17285.html"],"Case Number":"17285","Tags":"City","Summary":"Bright metallic cylinder observed hovering (in controlled fashion) over Hudson River in lower Westchester."}