{"City":"New Orleans","Latitude":"29.960716","Date of the Event":"05/31/2009 12:00 UTC","Tags":"City","divs":["sighting details a friend came back from doing my clothes at a laundromat at about 3:30 pm and when i opened the door for her she said come out and look at this. so i hobbled out onto the porch on my walker and looked up to where she was pointing and i see a sliver of a metallic object. it had a red\\orange glow near the center that went on and off and a bright white light that went on and off. i was thinking that maybe the white light was a reflection of the sun. i don't know. it seemed still for about 5 minutes and then started drifting. it was out of my sight within about 2 minutes. the friend and my neighbor watched it for another maybe 3 minutes until they lost track of it behind the houses. i was seated, they were standing and had a better view. one thing unusual is that when i first spotted it there were 2 very small clouds near it, otherwise the skies were perfectly blue. my first impression of the object was that i was looking at a disc shaped ufo that was turned so that i only saw the side. i am not sure, it could have been a cylinder. it was very exciting for me to see it and i tried to vector it closer. i sent it telepathic messages and even spoke out loud to it, inviting it to come closer."],"Date Submitted":"05/31/2009 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path","trends":["There have been 26 other sightings in New Orleans","There were no other sightings in New Orleans on or around May 31st 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.960716,+-90.066032(17282)&iwloc=A&hl=en\"> mufon case (17282) map </A>","Log Number":"US-06012009-0002","Object Features":"None","Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/17282.html.txt","/var/www/straped/mufon/org/17282.html"],"Disposition":"Hoax","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","Case Number":"17282","Region":"Louisiana","Longitude":"-90.066032","Summary":"I saw my first UFO over New Orleans this afternoon.","Object Shape":"Cylinder, Disc"}