{"Tags":"City","Latitude":"37.77869","Object Shape":"Star-like","Longitude":"-122.416296","Object Features":"None","Viewing Distance":"Over One Mile","Date of the Event":"05/27/2009 09:21 UTC","Region":"California","Log Number":"US-06022009-0002","Case Number":"17298","Country":"United States","divs":["sighting detailslocation: san francisco, ca time: 21:21 pst visibility: clear, >10 miles cloud cover: none sky: dark stars visible: yes i went out on the back deck of my home for a cigarette and i always spend some time looking straight up at the stars. after a minute or so and out the peripheral vision of my right eye, i noticed a fast moving star like object. object was very similar in size to the background stars (only slightly bigger) but moving in a straight line sw to ne. object was brighter than the stars of the big dipper, but not as bright as the brightest star in the sky at the time. altitude (i would guess) approximately 40-60,000 ft. +. object crossed approx 12 inches of sky (from my standing viewpoint at arms length)in about 10 seconds. i turned and took my eyes off the object as i thought about running in to get my video camera. i then realized that the object would be gone before i made it back, but by the time i looked back up the object had disappeared. no engine sounds were heard. this was a fast mover. it wasn't a meteor or a shooting star as the object was much too slow for either. i was pretty perplexed by what i had seen. i tried a time \\ distance exercise on a high flying (30-35,000 ft) 747 the next day and that took approximately 50+ seconds to cross the same amount of sky. a 747 flies at approx 525-550 kts. i guesstimate that this would make the unknown object's speed somewhere around 2,700 kts. i have a commercial pilot's license and can pretty much name any aircraft - civil or military - under the sun. this didn't look like a known a\\c to me (it was spherical \\ star). not wanting to speculate too much, but it quite possibly could have been a black project a\\c (hypersonic). i have seen one \"doughnuts on a rope\" contrail before (again viewed at night from the same spot and headed in almost the same direction about 1 year ago). the residual contrail was only visible due to an extremely bright full moon - but i had heard of these over california before. the black project a\\c theory my be part of the reason for my 5 day hesitation in posting. whatever it was - it was fast and definitely unidentified. would be interested to hear if there were any other reports around the same time."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/17298.html.txt","/var/www/straped/mufon/org/17298.html"],"Disposition":"Insufficient Data","Date Submitted":"05/27/2009 09:21 UTC","City":"San Francisco","Summary":"Fast Moving \"Star\" like Object","trends":["There have been 127 other sightings in San Francisco","There was one other sighting in San Francisco on or around May 27th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.77869,+-122.416296(17298)&iwloc=A&hl=en\"> mufon case (17298) map </A>","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:10","Weather Factors":"Windy"}