{"Country":"United Kingdom","Tags":"City","Log Number":"GB-06012009-0014","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=53.384469,+-1.464005(17294)&iwloc=A&hl=en\"> mufon case (17294) map </A>","trends":["There have been 11 other sightings in Sheffield","There were no other sightings in Sheffield on or around June 1st 2009"],"Region":"England","Latitude":"53.384469","Summary":"Repeated appearance and dissapearance of floating flashing object.","Longitude":"-1.464005","Viewing Distance":"Unknown","City":"Sheffield","Date of the Event":"06/01/2009 10:00 UTC","divs":["Sighting DetailsTime - 22:00 exactly Its a hot summers evening, still light amidst the recent weekends heatwave. Im sat by my computer typing this exactly as it happens. As i sit here in my studio on the mufon website, i look out of my window to see a extremely bright light over a nearby hill visible between the houses of the cul-de-sac. When i first see the light i automatically think of the reasonably and rational things it could be, a flare, a plane. After the light hovered, moved slightly to the left, then faded away i put it down to being an aircraft. This was about 9:50 when the first sighting occured. in the 10 minutes i have been away from the computer since i began typing this, i dont know if it has returned however all i know is when i got back i looked and the light was there once more, glowing bright and fading within a 20 second timespan. If it werent for the second encounter of this unknown phenomeneon i would not be typing this now, however i have scanned this website and the detail matches similar case of floating lights also spotted in sheffield however slightly further away from my current destination. NOTE>< the light has just returned as i am typing this, exactly the same, appearing and fading. As i was saying it matches the description of someone elses sheffield sighting in which a series of floating lights hovered and flew over theri house. I dont know if these lights will return. However i have an exam in the morning and i need sleep. To finish. everytime i saw the floating light i felt a strange awe and aura, almost as if time had stopped for a breif second NOTE another sighting, howevber this time one floated sidewards and another came into visibility. this is creepy now. i will post another file if this sighting contunues tomorow. i cant take a photo. my phone wont pick up the light as it is too far away. however i wouldnt have typed all this if i had seen nothing. End."],"Object Shape":"Diamond","Case Number":"17294","Object Features":"Undisclosed","Source":"MUFON","Disposition":"Unresolved","Date Submitted":"06/01/2009 10:00 UTC","files":["/var/www/straped/mufon/html2text/17294.html.txt","/var/www/straped/mufon/org/17294.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}