{"Date of the Event":"05/29/2009 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.518417,+-80.303695(17299)&iwloc=A&hl=en\"> mufon case (17299) map </A>","Log Number":"US-06022009-0003","Disposition":"Insufficient Data","Source":"MUFON","divs":["Sighting DetailsI am reporting this because a similar light was reported by a MUFON dispatcher. This was Reported to (Denise) MUFON Dispater on Saturday evening at 11:30PM on May 30th 2009. I saw a light in the north west sky a while after sundown. I saw it Thursday night but didn't think it was a big deal because I saw it just before it seemed to move below the treeline. I thought it was just a star that seemed to blink in the twilight. The next night, Friday, I went outside with my wife and daughter to look at Saturn and saw this \"star\" again. I took a closer look this time and noticed it looked like it was blinking different colors. After we looked at Saturn, I pointed my telescope at the \"star\" and verified it did look as if it was blinking red, blue, yellow, orange, white, and green. I didn't notice if it was moving any faster than the other stars in the sky because it moved under the treeline and out of my sight. I think the time was approx 9:45-10:00pm. I tried to get a look at it Saturday night but the sky was cloudy. I have not seen the light again but I will continue to look in that direction to see if it appears again. The nearest major airport to my home is in Pittsburgh but it is about 100miles due north. The MUFON report from Saturday, May 30 was in the IL area which is in the direction the light would have been from my location in WV. I'm not sure but I am wondering if we saw the same light."],"Summary":"Bright object flashing different colors.","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/17299.html.txt","/var/www/straped/mufon/org/17299.html"],"trends":["There have been no other sightings in Rachel","This sighting has never been favorited."],"Object Features":"Unknown","Tags":"City","Latitude":"39.518417","City":"Rachel","Object Shape":"Circle, Sphere","Object Flight Path":"Unknown","Region":"West Virginia","Longitude":"-80.303695","Case Number":"17299","Country":"United States","Date Submitted":"05/29/2009 10:00 UTC","Weather Factors":"None","Viewing Distance":"Unknown"}