{"Weather Factors":"None","Disposition":"Unknown","Latitude":"41.088433","Summary":"4 amber-colored discs flew over our auto during an outdoor movie.","Longitude":"-85.136561","Region":"Indiana","City":"Fort Wayne","Sighting Duration":"00:04:00","Object Flight Path":"Straight-line path","Log Number":"US-06022009-0008","Source":"MUFON","Date Submitted":"06/30/1955 11:00 UTC","Case Number":"17304","Object Features":"Window(s), Patterned Surface, Other","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.088433,+-85.136561(17304)&iwloc=A&hl=en\"> mufon case (17304) map </A>","divs":["sighting detailsduring the summer of 1955 i was at a drive-in movie located on bluffton road in ft. wayne, in. i turned 9 years old in august and my brother turned 11 in july of that year. i don't know what month of that summer the sighting took place. my brother and i were in the back seat and my step-father was in the driver's seat with my mother beside him. my step-dad noticed 4 large discs in the distance, heading our way. they were yellow\\orange in color and glowed as if lit from within. the discs approached from our left front, continued almost directly overhead, and disappeared into the distance behind our right rear. as they neared our loation, we all exited the car and watched them pass overhead. they were moving slowly and skittered about erratically, though staying in a rough formation and moving along a straight route. they made no sound. they were headed toward the general direction of ft. wayne's airport, baer field. everyone at the movie was standing outside their cars watching. when they were overhead, they appeared to be no more than 200 feet above us, and perhaps 100 feet in diameter, although it was impossible to really know one measurement without knowing the other. they were about the size of a basketball held at arm's length. they were symetrically shaped, thin at the circumference, tapering more thickly toward the middle, slightly rounded at the top and bottom points. i could see a line along the circumference, as if the tops and bottoms had been two pieces joined together. also, there were dark lines forming radii from the edges of the rounded bottom points and extending nearly to the outer edges. between each radial pair of lines, there was a dark square, almost like port windows. the dark lines and squares were indistinct, but clearly visible. the next morning the journal gazette reported the speed and direction of the objects as they passed over the city as determined by call-ins to the night editor's desk during the sighting."],"Tags":"City","trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around June 30th 1955"],"files":["/var/www/straped/mufon/html2text/17304.html.txt","/var/www/straped/mufon/org/17304.html"],"Country":"United States","Date of the Event":"06/30/1955 11:00 UTC","Object Shape":"Disc"}