{"Sighting Duration":"00:02:20","Case Number":"17305","Region":"Baja California","Log Number":"MX-06022009-0009","files":["/var/www/straped/mufon/html2text/17305.html.txt","/var/www/straped/mufon/more/17305_submitter_file1__DSC00396.JPG","/var/www/straped/mufon/more/17305_submitter_file2__DSC00397.JPG","/var/www/straped/mufon/org/17305.html"],"Object Features":"Undisclosed","Object Shape":"Blimp, Triangle, Other","Source":"MUFON","Latitude":"32.540939","Date of the Event":"10/18/2008 07:06 UTC","trends":["There have been 7 other sightings in Tijuana","There were no other sightings in Tijuana on or around October 18th 2008","This sighting has been favorited 1 time.",""],"Weather Factors":"Unknown","City":"Tijuana","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.540939,+-117.012124(17305)&iwloc=A&hl=en\"> mufon case (17305) map </A>","Viewing Distance":"Unknown","Country":"Mexico","Summary":"Ovni sobre aeropuerto TJ.","Tags":"City","divs":["Sighting Details(In spanish) Me encontraba en el salon de clases y justo cuando sali a mi receso observe esta imagen en el orisonte, por el hecho de ser la frontera y el aeropuerto a espaldas de la universidad, pense que podria ser un avion o un helicoptero de migracion, pero el objeto duro mucho en el mismo sitio (sobre el final de la pista de aeropuerto) sobrevolando estatico y era muy luminoso, entonces decidi tomar la fotografia y en la fotografia sale con mas detalle que a simplevista ya que a simple vista tenia la forma de un solo objeto muy luminoso y poco triangular, pero en la fotografia paresen dos objetos caasi triangulares y acercandolos no tiene ninguna forma de avion o helicoptero, trate de hacer una segunda toma y cuando la tome pocos segundos despues ya no estaba el objeto desaparecio increiblemente rapido. Le adjunto las dos fotografias del lugar que muestran la primera al objeto y la segunda unos segundos despues que ya no estaba."],"Disposition":"Unresolved","Longitude":"-117.012124","Date Submitted":"10/18/2008 07:06 UTC"}