{"Date of the Event":"10/18/1997 10:30 UTC","Country":"United States","Longitude":"-93.4725","map":"<A HREF = \"http://maps.google.com/maps?q=41.65,+-93.4725(17310)&iwloc=A&hl=en\"> mufon case (17310) map </A>","Object Features":"Other","City":"Altoona","Summary":"Hovering invisible craft with visible door with cable draped to the ground.","Date Submitted":"10/18/1997 10:30 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Case Number":"17310","trends":["There has been one other sighting in Altoona","There were no other sightings in Altoona on or around October 18th 1997"],"Latitude":"41.65","Object Shape":"Square, Rectagular, Other","files":["/var/www/straped/mufon/html2text/17310.html.txt","/var/www/straped/mufon/org/17310.html"],"Log Number":"US-06022009-0014","Object Flight Path":"Stationary","Region":"Iowa","Disposition":"Unknown","divs":["Sighting DetailsI was closing up shop at a video store I was working at in the fall of 1997, and rather than to drive straight home I sometimes enjoyed taking the long way home in the country with the radio playing in my car. The night in question I was approximately a mile east of 1st street in Altoona on Adventureland Drive which is out in the country near the old graveyard out in the country. As I was about to turn west to head back toward town on Adventureland Drive, I looked off to the right uphill past the one lane bridge to check for traffic and up the road to the east about 500 yards away (approx) I saw a rectangular shaped light in the shape of a door just hovering probably 150 feet off the ground. There was nothing else around it in the air, as I could see the stars next to this doorway. But what didn't make since is that I could see inside the doorway into what looked like a large room on the inside, but there didnt seem to be anything that size around the doorway as if it wasnt really there. There was light beaming out of the doorway reflecting off the field, and inside the doorway I could see a wall in the back with a beige countertop lining the backside of the wall. There was a cable hanging down from the doorway that was perfectly straight had occasional 90 degree bends leading horizontally where the cable would again be perfectly straight for a while, and then it would bent back toward the ground with another perfectly straight section which eventually led to a small circular shaped object on the ground that was shining bright white. The whole time I watched, the object appeared in perfect motionless. When I was watching, at first my mind was trying to make since out of what it was that I was seeing. But as a few seconds went by and I still could not make since of what I was looking at, and yet I understood that what I was seeing was actually there and indescribable, tears came to my eyes and extreme cold chills came over me, as I don't know what in the heck it was, and so I got out of there. And every time I have thought of it since then, I feel the same way. Note the dates mentioned is approximate, as I dont remember the exact week, but Im sure it was on a Friday in October 2007."],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"None"}