{"Tags":"City","Weather Factors":"Unknown","Date of the Event":"03/15/2009 08:15 UTC","Region":"Quintana Roo","Summary":"On our balcony with a southeast view out toward the Caribbean Sea. My wife and I both noticed an orange ball of light moving at three times the speed of a satellite heading due north parallel to the ocean.","Log Number":"MX-06032009-0008","Longitude":"-86.842457","Source":"MUFON","divs":["Sighting DetailsWhile on vacation in Cancun Mexico we stayed in the hotel zone. On Sunday night March 15, 2009 at approximately 8:15 p.m., we were sitting on our balcony with a southeast view out toward the Caribbean Sea. My wife and I both noticed an orange ball of light moving at three times the speed of a satellite heading due North parallel to the ocean. The light seemed to slow down and it zigzagged in an S shape before speeding off. Within five to ten minutes we then saw another light in approximately the same location. So after the second light, we really started to keep an eye out. Over the course of the next three hours we spotted an additional fifteen to twenty more of these lights. Sometimes they were by themselves other times they would appear in twos or threes. Some would move across the sky and then stop completely and reverse direction two to three times before continuing back in a northward direction. They would also tend to get fainter as they slowed down or stopped. One light even appeared to travel below a cloud when we thought that it would have traveled above the cloud out of our view. There was no sound and speed would change as they crossed the sky. We went to bed at 11:15 and lights were still appearing at that time, out of the South."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/17318.html.txt","/var/www/straped/mufon/org/17318.html"],"Object Shape":"Cigar, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=21.165874,+-86.842457(17318)&iwloc=A&hl=en\"> mufon case (17318) map </A>","Object Features":"Undisclosed","Disposition":"Unresolved","Latitude":"21.165874","trends":["There have been 5 other sightings in Cancun","There were no other sightings in Cancun on or around March 15th 2009"],"Date Submitted":"03/15/2009 08:15 UTC","City":"Cancun","Case Number":"17318","Country":"Mexico","Sighting Duration":"03:30:00","Object Flight Path":"Undisclosed"}