{"Longitude":"-6.259984","Date of the Event":"03/18/2009 07:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.350544,+-6.259984(17314)&iwloc=A&hl=en\"> mufon case (17314) map </A>","Object Flight Path":"Path with directional change","trends":["There have been 12 other sightings in Dublin","There were no other sightings in Dublin on or around March 18th 2009"],"Country":"Ireland","Region":"County Dublin","Tags":"City","Object Shape":"Disc, Sphere","Case Number":"17314","Latitude":"53.350544","City":"Dublin","divs":["Sighting DetailsI was sitting in my back garden smoking at around 7:45 on wed 18 march 09, and it had just gotten dark, when i saw a very unusual luminous object coming from the SW, kind of floating towards my direction with absolutly so sound, I watch the skys all the time so i know when i see something that isnt normal i.e not an airplane, sattelite, meteor, flare, helicopter, planet, weather ballon, star etc..So i instantly stood up and my heart started beating really fast, I have a powerful pair of binoculars, 20x-108x70, that i watch the skys with and i instantly pointed them at this object and to my amazement it was a single luminous solid shape, with a strange haze coming off it, it was a sphere to the naked eye but when i looked with my binoculars it was thinner at the edges and thicker in the middle, sort of like a fat disk. I coudnt believe what i was seeing, i have seen unusaul points of light moving very high in the sky many times before, but never so close, clear and obvious. I was so exited i ran straight into my kitchen, which leads to my garden, and shouted for my mom and brother to come out, they came instantly and i showed them this object which was about a hundred meters from being directly above us, they are a bit skeptical about this kind of thing but they had no idea what it was, so we all were standing there watching this thing, i kept repeating \"WHAT THE F*** IS THAT !\" over and over. And then as it slowly moved away from us about 2-300 meters away it slowly started to get smaller and smaller and then it just dematerialised, at this point i was almost hysterical saying \" IT JUST DISSAPEARD!\" my brother confirmed that he saw it dissapear too, and we all looked at eachother with wide eyes in shock at what we had just seen, my mom was really surprised at what she had seen . Now im not sure wether it dematerialed or just flew away at high speed, its impossiple to tell. But what i do know is that iv never seen anything like that before and i dont know if i will again, it was not a conventional aircraft or a flare, star, planet etc... TRUST ME it was way too low to be in space and was clearly not a plane or helicopter, and we dont have an active military here in ireland so flares dont exsist here and besides a flare would look and behave completely different . I knew the second i saw this object that it was something really special, my first real UFO sighting, I think i was lucky to see this UFO because i havent seen anything like it since, i would love to see it again some day, and i NEED to discover more and find out what is going on in our skies . Thank you, Flynn"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/17314.html.txt","/var/www/straped/mufon/org/17314.html"],"Log Number":"IE-06032009-0004","Date Submitted":"03/18/2009 07:45 UTC","Summary":"A small luminous object, low in the sky, maybe 1000-2000 feet high, travelled from SW to NE direction then gradually dematerialised.","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile"}