{"Longitude":"-93.45","Region":"Minnesota","Object Features":"None","files":["/var/www/straped/mufon/html2text/17312.html.txt","/var/www/straped/mufon/org/17312.html"],"City":"Ramsey","map":"<A HREF = \"http://maps.google.com/maps?q=45.2611,+-93.45(17312)&iwloc=A&hl=en\"> mufon case (17312) map </A>","divs":["sighting detailshi my name is [cms\\tg\\pid] and for the past 2 weeks some friends of mine and i have been witnessing ufos over ramsey and, east bethel, mn. the first night we saw a very very bright light at around 10:15pm on 5-22-09. the light was brighter than any other in the sky and it was moving very slow, at first we thought it might be a satalite but then it stopped moving and hovered for about 10seconds before slowly fading out in the same place as if it took off into space. two days later my friend \"c\" and i were on our way to linwood lake to go fishing at around 6:30pm on 5-24-09 when we looked up in the sky and there was a very shiny object that was hovering in place over a field in east bethel,mn. it was so shiny it looked like someone was using a giant mirror in the sky and flashing us with sun light. we observed this for about 4minutes until it looked like it took off straight out into space. within 1 minute of it disapearing we watch 2 fighter jets come screaming in right where the object we saw was. and about 1-2 mins after that another fighter jet came screaming in with after burners on circleing the area. \"c\" and i could not believe what we were seeing specially since it was only 2 days after we saw the first object in the sky. then on 5-26-09 at around 10:30pm my friend \"r\" and i were standing on his back patio and we saw a strange light start to hover in between a few trees. as we watched this light another light seemed to come in and hover with it, then another and then another so that there was a total of 4 lights hovering in almost a triangle shape. as we watched the lights for for about 5mins. they all of the sudden started to flash at the same time as one another. they did this for about 2mins then one by one each light turned off until they all disapeared in place. and the last incident was tonight 6-2-09 at 10:20pm this time the object was exactly like the very first one we saw on 5-22-09 only this time it was gowing the opposite direction in the sky. and as i watched this time the object did a almost u-turn in the sky then took off and disapeared right above me there were no flashing lights and there were other airplanes in the sky so i could deffinatly tell the difference between the two. i didnt think of reporting these objects my friends and i have been seeing until tonight because we keep seeing them over and over. i swear i am not crazy and i dont know who else to report these objects in the sky to. if you might have any explanation to any of these objects please let me know. i now believe we are not alone in the universe. thanks and please let me know what you think. [cms\\tg\\pid]"],"Log Number":"US-06032009-0002","Weather Factors":"Unknown","Case Number":"17312","Latitude":"45.2611","Sighting Duration":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Date of the Event":"05/22/2009 10:15 UTC","Date Submitted":"05/22/2009 10:15 UTC","trends":["There have been no other sightings in Ramsey","This sighting has never been favorited."],"Object Shape":"Circle, Diamond, Sphere, Triangle","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"Multiple UFOs over Ramsey and East Bethel, MN.","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States"}