{"Country":"United States","Date Submitted":"10/31/2008 11:00 UTC","Date of the Event":"10/31/2008 11:00 UTC","Weather Factors":"None, Does Not Apply","Viewing Distance":"Unknown","Disposition":"Unknown","Latitude":"44.923855","Sighting Duration":"00:00:15","map":"<A HREF = \"http://maps.google.com/maps?q=44.923855,+-92.95938(17326)&iwloc=A&hl=en\"> mufon case (17326) map </A>","Object Flight Path":"Unknown","City":"Woodbury","trends":["There have been 4 other sightings in Woodbury","There were no other sightings in Woodbury on or around October 31st 2008"],"Log Number":"US-06042009-0003","divs":["Sighting Detailsit was october 31 st, or november 1 st...around midnight.... i was coming home holloween night. i got home parked my car, got out(right by highway 94 and 694). and as i always do when i come home at night i scan the sky for a moment or so to see if any thing is cool out to see. as i was looking up i noticed this big black object...it was like 8 or 9 boomerang bird type shaped things all aligned in the shape of a stealth bomber but the weird thing was you could see the out line of a ship like object...it was not birds this for sure i know...it was really close to the ground and i didnt hear any thing or see whings flap...and the color of it was pitch black and no lights at all on it..the only reason i seen it was cuz it ccame into my field of vision as i was lookin up at the sky. it flew by and a medium pace as it flew over me it covered the sky where i looked. i have no clue what this was. it was gone with in 10 seconds of when i seen it...would any one have any clue what it might have been...?? maybe secret jet i donoo.."],"Object Shape":"Triangle, Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17326.html.txt","/var/www/straped/mufon/org/17326.html"],"Region":"Minnesota","Summary":"All black, no sound, no lights, similar to stealth bomber............","Tags":"City","Longitude":"-92.95938","Case Number":"17326","Source":"MUFON"}