{"Date of the Event":"03/31/2009 12:00 UTC","Latitude":"6.462026","Log Number":"PT-06042009-0007","files":["/var/www/straped/mufon/html2text/17330.html.txt","/var/www/straped/mufon/org/17330.html"],"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=6.462026,+3.398573(17330)&iwloc=A&hl=en\"> mufon case (17330) map </A>","trends":["There have been 3 other sightings in Lagos","There were no other sightings in Lagos on or around March 31st 2009"],"Viewing Distance":"Unknown","Country":"Nigeria","Object Features":"Dome, Unknown","Tags":"City","Object Shape":"Disc","Source":"MUFON","Object Flight Path":"Straight-line path","Date Submitted":"03/31/2009 12:00 UTC","Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Lagos","Longitude":"3.398573","Case Number":"17330","City":"Lagos","divs":["Sighting DetailsMe and my sister have been awoken in the 1th of January of 2009 when we saw a UFO (I'll also register that one). But then, a few months passed by when we actually went and try to call them after I saw on Youtube that you could. I tried for several weeks, but I think, at that time I wasn't quite ready. Then, at night, I guess it was around 11pm, I was in the veranda of my apartment, and saw a bright light, more like a star - but brighter. Nothing special at first till I noticed it was moving rapidly. I imediatly called my sister (she was in the living room, on the computer). She didnt hear me. I looked again, it kept moving. Called her again and again and looked again. It passed in the middle of two of the stars in the \"tail\" of the ursa minor. She finally heard me and came, just to see it fade away. It went from South to North. Later that night, we were preparing to go to sleep but my sister was really enthusiastic and kept looking out the window (we share the bedroom). Then, when I was almost a sleep, she yelled. Look! I jumped out of bed and looked where she was ponting. There were three lights. Two red on each side and one white in the middle. It was a few metes above the apartment building in front of ours but I don't know how far. It hovered about 30 seconds there. We was stunned. Amazed. The bright light was a classic, but that was so much clearer. As we saw it in the sky, it had about 4 centimeters, imagine it real size! Then we called our brother so he could see as well, and maybe to prove that we weren't imagining things. But, when he came, the object started to move, slowly but continuosly from West to North-East. It slowly got out of sight. We guesses it was because my bother did not want to see it, from what we have learned from the \"Law of One\", they can only appear to those who whish it. I call also tell you that, in those weeks I had been trying to see something I earn some knowlegde to how the lights and shapes of an common airplane is and their rotes (from South to North), I started to identify some of the Constellations, so I'm pretty sure that, what I have seen is NOT an airplane. I'm sorry for the typing errors, but it's not my native tongue. I'll fill in for other sightings as well as best as I can because since those first, we have seen more than twenty. I hope to have contributed. Goodbye"],"Summary":"Lagos UFO sighting 3 lights."}