{"Region":"Utah","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17331.html.txt","/var/www/straped/mufon/org/17331.html"],"Summary":"5 to 6 UFOs.","Country":"United States","Log Number":"US-06042009-0008","Disposition":"IFO","Case Number":"17331","Tags":"City","Longitude":"-112.025254","Date Submitted":"06/03/2009 09:10 UTC","divs":["sighting detailsat home - the avenues (higher elevated bench area of salt lake city); was watching a movie - inspired to go outside all of a sudden. knew instinctively that this sighting was not airplanes or helicopters. very used to watching incoming and out-going air traffic - these were not of our planet!!!!! five to six ufo's appeared over the south end of the oquirrh mountains, visible across the entire salt lake valley. ufo's would dissolve and blink back in continueously, changing patterns with each appearance. lights were consistently a brilliant yellow\\gold color. contacted channel \"fox 13\" news tip line at 10:15 pm - they reported others contacting them. they stated they have this on film by cameraman. no news, visible or written, has been seen this morning, june 4, 2009. husband and i watched with binocculars and digital camera for nearly two hours. absolutely no way it could be \"swamp gas, flares, weather balloons, helicopters, airplanes, military!\" etc. planes were seen flying all over the salt lake valley - but none matched the huge ufo lights and stationary positions when they appeared. each appearance lasted at least 2 minutes, as one light would blink out, another would form up higher or lower. patterns consisted of triangles, but when four, five, or six would appear - the pattern changed from tirangular to split lights. most incredible, awesome sighting - similar to the phoenix lights! why is no one talking about this?"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.520585,+-112.025254(17331)&iwloc=A&hl=en\"> mufon case (17331) map </A>","Object Shape":"Other","Weather Factors":"Unknown","Object Features":"Other","Latitude":"40.520585","Object Flight Path":"Stationary","trends":["There has been one other sighting in Herriman","There were no other sightings in Herriman on or around June 3rd 2009"],"Date of the Event":"06/03/2009 09:10 UTC","Viewing Distance":"Over One Mile","City":"Herriman"}