{"Weather Factors":"None","divs":["Sighting DetailsIt was 10:30 and I was winding down after I put my kids to bed. I went outside of my house to have a cigarette. I was looking up at the stars and having a smoke when I noticed a star that was out of place. What I thought was a star was moving slowly and steadily picking up speed. As I watched head for the last star in the big dippers handle smaller objects seem to drop from its belly and dart of in the opposite direction. Three total. I reached down to grab my phone and in the time it took me to raise my head the object was gone. At first I thought it was a satellite or some space junk. It didn't blink or pulsate it was a steady light. I called my friend who lives down the street so I could tell him about this experience. At first I was thrilled...it could have been anything but my imagination was running wild. While on the phone with him a black helicopter with a red light in the front and one smaller one on the fin came darting across the sky, heading towards the point I lost site of the object.. It was moving fast. I told my friend to get outside because now I was freaking out. But that is not where the story ends. I ran to my back yard and in the next 20 minutes 5 more helicopter flew over head. Each having different lights. The strangest one resembled a police helicopter with a large spotlight. But the spotlight was aiming behind it and started to scan where it has been not where it was going. My town isn't very large but at one time I had felt like there were copters circling the city. After everything died down I sat in my back yard and was on the phone with my friend when I saw a low flying jet scream across the light of the moon dispensing a 3 tiered chem trail, that seemed to disperse faster than any trail I have seen before. The whole experience was quite alarming. I can't get my self to believe it was nothing. In a small town around 50k in the middle of minnesota what are the chances of there being 6 helicopters and a jet on the same night that I see something in the sky. It was nerve-racking but now the next day, I want answers. If there is something happening to our planet than the government has the responsibility to tell us."],"Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17333.html.txt","/var/www/straped/mufon/org/17333.html"],"Object Flight Path":"Straight-line path","Date of the Event":"06/03/2009 10:30 UTC","City":"Mankato","Object Features":"None","Date Submitted":"06/03/2009 10:30 UTC","Longitude":"-93.99835","Tags":"City","Log Number":"US-06042009-0010","Viewing Distance":"501 Feet - 1 Mile","Summary":"Large object dropping smaller object followed by multiple helicopters.","Source":"MUFON","Object Shape":"Oval","Region":"Minnesota","Latitude":"44.172908","trends":["There have been 18 other sightings in Mankato","There were no other sightings in Mankato on or around June 3rd 2009"],"Case Number":"17333","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.172908,+-93.99835(17333)&iwloc=A&hl=en\"> mufon case (17333) map </A>"}