{"Date of the Event":"05/30/2009 02:15 UTC","Source":"MUFON","Disposition":"Unknown","Tags":"City","Object Shape":"Circle, Disc","Case Number":"17343","divs":["Sighting DetailsI was traveling on hwy 23 going through Baldwin County Georgia. I was taking a trip to the Georgia mountains with my mother. About 1.5 miles before we reached the 441 Bypass to go to Mt. Airy, Ga, I saw a silver disk floating across the hwy. It was coming from over the trees from my right and going to the left. At first I said, mom, there is an airport here. I had driven about 3 hours and thought it was cool they had an airport because I rather fly next time. But as I looked, it had no airplane wings or anything. It then hovered over the hwy for about 30 seconds and looked like it was tilting a bit, like wobbling. I looked at the van infront of me and slowed down so I wouldnt hit him. I slowed down because I wanted to see the object. The van stepped on his brakes too, so I guess he saw it. I still don't know for sure if they saw it, but they slammed on their brakes too. Anyways, I looked up after 5 seconds of watching the traffic and it was still wobbling or something . It was so siler and shiny I couldnt see if it was spinning or wobbling. It made a sharp turn and you could see it travel straight up in the sky.. There were white clouds behind me , but not infront of me, so it didn't disapear in the clouds. It went straight out in space, in the blue atmosphere. This spooked me! As I traveled on to the 441 bypass, I saw a white private jet going towards Mt. Airy. I wonder if this pilot saw it because he was about 20 miles out and coming in the opposite direction. After I saw the disk that day, I did not see it again. Later that day I got very sick, and am still feeling like I have the flu. My mother says she felt kind of sick as well. I think the whole thing just freaked us out that it made us sick to our stomachs. This is the 4th time in 20 years that I have seen an unidentified object, all in Georgia."],"City":"Mt Airy","Longitude":"-83.500726","Weather Factors":"None, Does Not Apply","trends":["There have been no other sightings in Mt Airy","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/17343.html.txt","/var/www/straped/mufon/org/17343.html"],"Sighting Duration":"00:02:00","Summary":"Silver disk traveling over hwy and then traveling straight up.","Object Features":"None, Other","Region":"Georgia","Log Number":"US-06052009-0002","Latitude":"34.518711","Date Submitted":"05/30/2009 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.518711,+-83.500726(17343)&iwloc=A&hl=en\"> mufon case (17343) map </A>","Viewing Distance":"101-500 Feet","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change"}