{"Object Shape":"Fireball","Log Number":"US-06052009-0005","Viewing Distance":"Unknown","Tags":"City","Date Submitted":"06/03/2009 12:00 UTC","Region":"Utah","divs":["sighting detailscamp williams was testing flares the other night. we saw them too. we live in west jordan utah, and we could hear the booms from them and see them over the mountain. they were not ufos. i'm replying to this persons report: at home - the avenues (higher elevated bench area of salt lake city); was watching a movie - inspired to go outside all of a sudden. knew instinctively that this sighting was not airplanes or helicopters. very used to watching incoming and out-going air traffic - these were not of our planet!!!!! five to six ufo's appeared over the south end of the oquirrh mountains, visible across the entire salt lake valley. ufo's would dissolve and blink back in continueously, changing patterns with each appearance. lights were consistently a brilliant yellow\\gold color. contacted channel \"fox 13\" news tip line at 10:15 pm - they reported others contacting them. they stated they have this on film by cameraman. no news, visible or written, has been seen this morning, june 4, 2009. husband and i watched with binocculars and digital camera for nearly two hours. absolutely no way it could be \"swamp gas, flares, weather balloons, helicopters, airplanes, military!\" etc. planes were seen flying all over the salt lake valley - but none matched the huge ufo lights and stationary positions when they appeared. each appearance lasted at least 2 minutes, as one light would blink out, another would form up higher or lower. patterns consisted of triangles, but when four, five, or six would appear - the pattern changed from tirangular to split lights. most incredible, awesome sighting - similar to the phoenix lights! why is no one talking about this? they were not ufo's!!!! they were flares that were being shot up in the sky by cannons and then falling to the ground very slowly. they did this for about 2 hours. hope this helps.. :) keep your eyes to the sky."],"Latitude":"40.61796","map":"<A HREF = \"http://maps.google.com/maps?q=40.61796,+-111.932183(17346)&iwloc=A&hl=en\"> mufon case (17346) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"06/03/2009 12:00 UTC","trends":["There have been 10 other sightings in West Jordan","There were no other sightings in West Jordan on or around June 3rd 2009"],"Disposition":"IFO","City":"West Jordan","files":["/var/www/straped/mufon/html2text/17346.html.txt","/var/www/straped/mufon/org/17346.html"],"Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"Camp Williams testing flares not UFO'S","Longitude":"-111.932183","Case Number":"17346"}