{"Longitude":"-88.532587","map":"<A HREF = \"http://maps.google.com/maps?q=37.739521,+-88.532587(17349)&iwloc=A&hl=en\"> mufon case (17349) map </A>","Tags":"City","Country":"United States","Weather Factors":"Unknown","City":"Harrisburg","Date of the Event":"05/29/2009 06:20 UTC","Source":"MUFON","Object Features":"Undisclosed","Latitude":"37.739521","files":["/var/www/straped/mufon/html2text/17349.html.txt","/var/www/straped/mufon/org/17349.html"],"Date Submitted":"05/29/2009 06:20 UTC","Sighting Duration":"Undisclosed","Object Shape":"Disc","Viewing Distance":"Unknown","Disposition":"Unresolved","Summary":"UFO spotted by a cloud shaped like the number 3.","Log Number":"US-06052009-0008","Object Flight Path":"Undisclosed","Region":"Illinois","divs":["Sighting DetailsI was waiting for my boyfriend on my motorcycle, waited about a half an hour by the bike trail by paupers farm crossing to those of you who know Harrisburg. Just observing the clouds against a brilliant blue sky, I noticed one cloud that didn't move like the others did. This cloud was shaped just like the number 3. I wish I had had my camera. As I looked a little longer, a bright light about the size of pin from my distance, appeared just to the left of the cloud, then the light dimmed to an off white...and I realized it was a disc that started to move at a diagonal going downward...then all of a sudden almost as quickly it appeared, it made a loop and went straight up and dissapeared in a flash. It startled me for sure, I had never seen anything quite like that before. Still watching the sky after that, about ten minutes later I just happened to look overhead when I saw the disk shaped object appear again, this time a bit larger...about the size of a pea in the sky, but still that off white color...darted in a zig zag motion across the sky toward the number 3 shaped cloud that was still in the same spot in the sky, it was faster than anything I had ever seen before. I felt my heart jump in my throat and my pulse started racing. It was a phenomonal experience. Nothing like it ever."],"trends":["There have been 13 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around May 29th 2009"],"Case Number":"17349"}