{"trends":["There have been 47 other sightings in Virginia Beach","There were no other sightings in Virginia Beach on or around"],"Sighting Duration":"Undisclosed","Region":"Virginia","Log Number":"US-06062009-0005","Object Features":"Unknown","Disposition":"Insufficient Data","Tags":"City","Date of the Event":"Unknown","Case Number":"17356","map":"<A HREF = \"http://maps.google.com/maps?q=36.861436,+-75.976325(17356)&iwloc=A&hl=en\"> mufon case (17356) map </A>","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"36.861436","Viewing Distance":"Unknown","Longitude":"-75.976325","City":"Virginia Beach","Summary":"TV commercial accidentally captures flight of UFO.","Date Submitted":"06/06/2009 06:55 UTC","files":["/var/www/straped/mufon/html2text/17356.html.txt","/var/www/straped/mufon/org/17356.html"],"divs":["sighting details on ge's latest commercial for \"ecomagination\",in the last frame before it ends, i've spotted a ufo in it. as your viewing the commercial just take a look in the upper right hand corner, under the 'blinding' light being shown and you can see a white lit ball appear out of nowhere (moving from about the center to the extreme right). it zips past the big light and disappears out of the frame. i am serious about this report and i am a sober person. i work in a civilian capacity for the government, in the field of accounting\\finance (and i have been for many years). the object in question is not a plane,helicopter, star or a flare. but,in the commercial, compared to the big blinding light, it appears fairly small. i told my wife about this and she noticed the anomaly too. she agrees with me also that it can only be categorized as a ufo. i don't think ge knows about this object in their commercial yet and if it is widely mentioned, i am afraid that they will pull the ad off tv. i have not recorded the commercial\\ufo. i beleive that someone should and try to analyze the video."],"Weather Factors":"Unknown","Object Shape":"Circle","Country":"United States"}