{"Region":"Texas","divs":["Sighting DetailsI was driving South on Jones Maltsburger at the intersection of Nakoma at aprox. 10:12 am CDT. I noticed what I thought was a strange looking plane as it was over the airport and it was following the normal trajectory for a plane on aproach,(heading south east comming over 281) however it was not decending. It appeared to be about the size of a small private plane, kind of cigar shaped but i could not discern any wings. The object then turned away at a 90 deg angle and traveled south away from me...I could then tell it had no wings, and it then appeared more spherical. The object was slow moving for a few moments and then disapeared. It did not vanish in an instant, rather it almost faded away. The sky was as clear as I have seen it in a while, no haze, nor any clouds at all. After it vanished I couldnt stop blinking thinking my eyes were playing tricks on me, I searched for it for about 5-10 more minnutes while on my commute but was never able to see it again. when I aproched the intersection of 281 and 410 I looked at the downtown skyline, to see if there was any sort of haze that may have hidden the object, there was none."],"Longitude":"-98.492228","files":["/var/www/straped/mufon/html2text/17358.html.txt","/var/www/straped/mufon/more/17358_submitter_file2__Case17358overheadapproximate.jpg","/var/www/straped/mufon/more/17358_submitter_file4__eyewitnessperspective.JPG","/var/www/straped/mufon/org/17358.html"],"Object Flight Path":"Path with directional change","Date Submitted":"06/04/2009 10:12 UTC","Country":"United States","Case Number":"17358","Source":"MUFON","Latitude":"29.430172","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around June 4th 2009","This sighting has never been favorited.",""],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","City":"San Antonio","Date of the Event":"06/04/2009 10:12 UTC","Tags":"City","Weather Factors":"None","Log Number":"US-06062009-0007","Object Shape":"Bullet, Missile, Cigar, Circle","Disposition":"Unknown","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=29.430172,+-98.492228(17358)&iwloc=A&hl=en\"> mufon case (17358) map </A>","Summary":"Cigar shaped craft over the airport."}