{"trends":["There have been 6 other sightings in Port St Joe","There were no other sightings in Port St Joe on or around June 2nd 2009"],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=29.818762,+-85.289562(17351)&iwloc=A&hl=en\"> mufon case (17351) map </A>","Date of the Event":"06/02/2009 04:30 UTC","Object Flight Path":"Stationary","Summary":"Round shaped like a ball with closed flaps all over it.","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/17351.html.txt","/var/www/straped/mufon/org/17351.html"],"Weather Factors":"None","Tags":"City","Source":"MUFON","Longitude":"-85.289562","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Latitude":"29.818762","Object Shape":"Diamond, Star-like","Log Number":"US-06052009-0010","Case Number":"17351","Region":"Florida","divs":["Sighting DetailsI was on my way to my daughter's house from Georgia, driving down Hwy. 71 South that dead-ends into Hwy. 98 towards Port. St. Joe, Fl. Before that, I was on another part of Hwy. 71 that dead ends and then I had to turn right and make an immediate left at a caution light that was still part of Hwy. 71. The last part of my drive. It is about a 10 to 12 min. drive from that caution light on Hwy. 71 to Hwy. 98. going south. It was about 4:30 a.m. Just a minute or so later I saw these bright lights up in the sky. It seemed like 2 rows of lights very wide in width hovering way up in the sky. At this time it seemed a long ways off and I thought it was maybe a road block way up ahead of me, so I slowed down. This particular road for most of its distance has no houses, only trees on both sides of the road. It was very dark except for the bright lights in the distance. As I got closer, I kept looking over to my right to see if I could tell what it was. All of a sudden I saw this very bright sparkling silver ball with closed flaps all over it. I could see the flaps very clearly because it was so bright and shinny, sparkling like a diamond ring and the ball was spinning around very fast and staying still at the same time. The lights were coming off of the ball hovering back and forth in a slow rocking motion. The two rows of lights had no colors to it, only the color of light you would see from a big flashlight. When I saw this 'ball' it was only for a few brief seconds and it didn't come back up above the trees again. But, the whole 10 minutes I could see the light from it and when I past by and looked into my rear view mirror, I could still see the lights in the sky. Well, I was really afraid at this point, and I drove real fast to get into Port. St. Joe thinking it was going to come and swoop me up. Now, I am a very sane person, worked for 30 yrs before I retired from state government five yrs. ago and I am 58 yrs. old. I have never seen anything like this before and I do believe it was a UFO. I was too afraid to stop and try to figure out how to take pictures with my son's cell phone that I had borrowed for the trip. I did have my little Jack Russell Terrier in the back seat and he barked at the object. I stopped at the Exxon gas station on Hwy. 98 for a few minutes and when I arrived at my daughter's house it was 5:02 a.m. I told her and my son-in-law about my experience and they both believed me. My son-in-law said there is a lake there behind the trees. That morning he heard on the radio about someone else claiming to have seen the same bright lights that I saw. The End!"],"Country":"United States","City":"Port St Joe","Date Submitted":"06/02/2009 04:30 UTC"}