{"Region":"Texas","Sighting Duration":"00:10:00","files":["/var/www/straped/mufon/html2text/17355.html.txt","/var/www/straped/mufon/org/17355.html"],"Log Number":"US-06062009-0004","Object Flight Path":"Straight-line path","Longitude":"-94.101021","map":"<A HREF = \"http://maps.google.com/maps?q=33.434441,+-94.101021(17355)&iwloc=A&hl=en\"> mufon case (17355) map </A>","Date of the Event":"06/02/2009 10:31 UTC","Summary":"Triangular craft traveling across the western sky of East Texas.","Weather Factors":"None","trends":["There has been one other sighting in Wake Village","There were no other sightings in Wake Village on or around June 2nd 2009"],"Tags":"City","City":"Wake Village","Viewing Distance":"Over One Mile","Disposition":"IFO","divs":["sighting details on june 2nd, 2009 at or about 22:31 hrs i stepped outside to the back of my house to continue a call on my cell phone with a friend when i witnessed traveling what i had originally believed was a blimp flying across the western sky from north to south. however, within moments i realized something unusual about the crafts overall shaped. i quickly excused myself off the phone and ran inside my house to call my girlfriend to the back of the house to also observe and further confirm what i was witnessing. upon our arrival to the back of the house, just moments later, the craft was still in the sky and still traveling across the western sky moving from north to south through the constellation of leo, from above the 40 degree azimuthal grid line to below it. the craft can best be described as a triangular shaped craft with three white lights appearing to be located on the vertices of the crafts underbelly and one red flashing light appearing to be located upon the center of the crafts underbelly (ventral). in addition i was also able to hear what i believe to be engine noise emanating from the craft. the sound was similar to that of a low steady rumble of a jet engine at high altitude traveling at cruising speed. the craft was also not traveling at any unusual speed or pattern and appeared to be moving across the sky at, would appear to be, a comparatively reasonable speed for any aircraft. in fact, if it was not for it's close proximity to my location i might have not took notice of it. i am a soon to be forty year old male (june 8th) who served honorably as a security police officer in the united states air force from 1987 to 1993 and i am currently a federal corrections officer with the dept. of justice\\federal bureau of prisons and have been for the last fourteen years. i currently have an associate of science degree in mathematics. my girlfriend is a bank teller at local bank."],"Latitude":"33.434441","Source":"MUFON","Country":"United States","Date Submitted":"06/02/2009 10:31 UTC","Case Number":"17355","Object Features":"Unknown","Object Shape":"Triangle"}