{"Longitude":"-77.031206","Date Submitted":"06/07/2009 01:15 UTC","Latitude":"38.902952","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Same as previous but corrected: filmed light humming triangle UFO fly over.","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-06072009-0005","trends":["There have been 20 other sightings in Washington","There was one other sighting in Washington on or around June 7th 2009"],"files":["/var/www/straped/mufon/html2text/17366.html.txt","/var/www/straped/mufon/org/17366.html"],"divs":["sighting details(corrected the date was not the 6...i meant to write the 7th i apologize for this error\\also thought it would be easier to include a yt link) this is my third report to mufon of a strange craft that appeared in front of my apartment building but i was not the one to notice it. my roommate was actually the one to notice it. i was sitting at the computer relaxing after being out all night at the movies and dinner and he was on the sofa that sits right next to the balcony watching a movie. that is when i heard him asking me to come look out the balcony door window because he did not think whatever was there in the sky was a plane. so i got up camera in hand because lately there have been an increase in sightings it seems in this area, now i am not saying what is on film is of et origins but it was no plane there was no sound whatsoever except for a slight hum as it passed over head and it was moving eerily slow to be a plane, it was three lights in the shape of a triangle with one red light in the middle just like last time. this is the second time i have seen a triangle craft fly by in front of my balcony and i am more then happy to have had my camera handy this time. it could be military but truth is i really don't know and neither does my roommate, we are at a loss for words and shortly after we did see a helicopter head in that direction though we could not see what kind because we went back inside the apartment. however one thing is for sure this time we both agree that cant be a plane. http:\\\\www.youtube.com\\watch?v=khwntrpt0ae"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.902952,+-77.031206(17366)&iwloc=A&hl=en\"> mufon case (17366) map </A>","Region":"Maryland","Disposition":"IFO","Date of the Event":"06/07/2009 01:15 UTC","Object Shape":"Boomerang, Triangle","Object Flight Path":"Undisclosed","City":"Washington","Viewing Distance":"Unknown","Case Number":"17366","Tags":"City"}