{"Summary":"Spining disk appeared over Three Rivers Stadium during last 10 minutes of NFL football game in October 1979.","Date Submitted":"10/20/1979 12:00 UTC","Longitude":"-79.990346","divs":["Sighting DetailsI was watching the game on TV in Santa Barbara CA. between the Pittsburg Stealers and Dallas Cowboys in October 1979 from Three Rivers Stadium Pittsburg PA. During a commercial break around the 2 minute warning while Chuck Conners was sales pitching a toy gun, the commercial was cut abruptly and the picture went back to the stadium. The screen showed a metalic disk (10-30 ft) spinning like a coin(1-2 rev per sec) on a table at a height about equal to the top of the stadium. Pat Summerall's excited voice came on saying \"We don't know what it is we are showing you...it just appeared in the sky\". He repeated several time \"I can't believe what I am seeing\". Tom Brookshire ,the color man, said \"Oh that...that's just an illusion\". Summerall disagreed and said \"Well if they land, they're gonna say \"take me to your leader\". The crowd got very quiet...you could hear a pin drop in the place. A penalty was called on a Dallas player because he failed to get into his stance ...was just looking up at the sky. Pittsburg was winning 14 to 3...they had the ball and were running out the clock. The game ended with the camara on the disk till the end. I never heard or read a word about in any media. I didn't want the game to end...I wanted to keep looking at the disk. I felt sad when the picture changed. I was attracted to it some strange way. It changed the way I look at life and the creedance I give our government and media."],"Tags":"City","Country":"United States","Date of the Event":"10/20/1979 12:00 UTC","Latitude":"40.447175","map":"<A HREF = \"http://maps.google.com/maps?q=40.447175,+-79.990346(17362)&iwloc=A&hl=en\"> mufon case (17362) map </A>","Source":"MUFON","Disposition":"Insufficient Data","Sighting Duration":"00:10:00","Case Number":"17362","Object Flight Path":"Stationary","Region":"Pennsylvania","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around October 20th 1979"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/17362.html.txt","/var/www/straped/mufon/org/17362.html"],"Object Shape":"Disc","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","City":"Pittsburgh","Log Number":"US-06072009-0001"}