{"Summary":"Saw bright light, pickup died, very scared.","Country":"United States","files":["/var/www/straped/mufon/html2text/17369.html.txt","/var/www/straped/mufon/org/17369.html"],"trends":["There have been 12 other sightings in Carlsbad","There were no other sightings in Carlsbad on or around December 14th 1964"],"Date Submitted":"12/14/1964 12:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-06072009-0008","Case Number":"17369","Disposition":"Unknown","Date of the Event":"12/14/1964 12:00 UTC","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.423674,+-104.223968(17369)&iwloc=A&hl=en\"> mufon case (17369) map </A>","Object Shape":"Unknown","Region":"New Mexico","Object Features":"Unknown","Latitude":"32.423674","Longitude":"-104.223968","divs":["Sighting DetailsIn late 1964 or early 1965, my 2 brothers, my ex-husband, and one of his friends and myself were out coyote calling out in the foothills on the outside of Carlsbad, New Mexico about 10:00pm. We were use to the dirt roads and had been out often. We were driving down one of the dirt roads when all of a sudden it got light all around us, you could see the plants and rocks like it was daylight. The pickup died and then my next memorie is that I was so afraid that I was in the floorboard of the pickup. It got really light again and then dark and the pickup started. We didn't recoginize anything around us. When we finally got home I was grounded for being out so late, although to us,we had only been out for and hour or so. Years later one of my brothers passed away, while talking to my other brother,and my ex, we started talking about it and found that all three of us had to have a piece of metal removed from our legs, we also tried to figure out why we never discussed it. We all mostly remember being very frightened. I don't even know if I would want to remember what happened but in the back of my mind I know that something did happen."],"Weather Factors":"Unknown","City":"Carlsbad"}