{"Sighting Duration":"00:02:00","Summary":"Brief, silent, there and gone.","Source":"MUFON","Date of the Event":"06/02/2009 12:00 UTC","Disposition":"Unknown","Latitude":"45.826048","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Region":"Wisconsin","divs":["Sighting DetailsHave been watching small to large moving lights in the sky for quite sometime, decided to involve photography. This is what I see on film. I am viewing to the eastern sky. the constelation is coronae borealis and down to vega. I only concentrate on this area just as a focal point. No particular reason. I am using a old digital camera and usually capture the usual dust, pollen, dew particals of which I have many hundreds of photos of atractive blurs But once and awhile something pops up, usually after a scatter of activity. Iusually stay out till the hour of 11:00 pm and take every night a series of 25-50 pics..Mostly the usual explainable photo blunders but a handfull of times I have really captured a sight. Now I can not tell anyone what is in the photo but at the same time of the photo being taken I am flashed back. Here are the pics. I am not out to debunk anything at this point but take it to be just what it is..very interesting lights. My reactions are not fearful but comfortable and happy to see something different. This happens almost every night in some way."],"Object Shape":"Boomerang, Circle, Disc, Egg, Fireball, Flash, Oval, Square, Rectagular, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=45.826048,+-91.883243(17360)&iwloc=A&hl=en\"> mufon case (17360) map </A>","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Spooner","There were no other sightings in Spooner on or around June 2nd 2009","This sighting has never been favorited.",""],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17360.html.txt","/var/www/straped/mufon/more/17360_submitter_file1__trilight2.jpg","/var/www/straped/mufon/more/17360_submitter_file2__P1010748.JPG","/var/www/straped/mufon/more/17360_submitter_file3__lighttri.jpg","/var/www/straped/mufon/org/17360.html"],"Log Number":"US-06062009-0009","Tags":"City","Weather Factors":"None, Light","Longitude":"-91.883243","Case Number":"17360","Date Submitted":"06/02/2009 12:00 UTC","City":"Spooner"}