{"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.328668,+-83.07274(17372)&iwloc=A&hl=en\"> mufon case (17372) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Other","Longitude":"-83.07274","Date of the Event":"05/14/2009 12:00 UTC","Case Number":"17372","files":["/var/www/straped/mufon/html2text/17372.html.txt","/var/www/straped/mufon/more/17372_submitter_file1__Picture001enhancedcontrast.jpg","/var/www/straped/mufon/more/17372_submitter_file2__Picture002enhancedcontrast.jpg","/var/www/straped/mufon/org/17372.html"],"Log Number":"US-06072009-0011","Region":"Michigan","trends":["There have been 4 other sightings in Marlette","There were no other sightings in Marlette on or around May 14th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Country":"United States","divs":["Sighting DetailsI have had ongoing contact with off world beings since I was very young. I will start with the latest event and then go backwards through time. Thursday, in the very early morning hours of May 14th (around 3 am), I was awakened by a sharp pinch to my upper lip. I yelled, \"Owwww!\" and swatted at my face to remove the offending object. I opened my eyes (though everything appeared as if in a fog) and thought I saw a pair of legs that were greyish green. I then heard in my mind, \"You scratched yourself\" so got up out of bed, albeit very agitated and in pain from the \"scratch\", and went to put ointment on the wound to ease the pain. I groggily walked into the bathroom and tried to open my eyes so that I could see the scratch but what I saw was not a scratch at all but a bloodless circle with blistering around the edges of it. I put the ointment on it as if in a trance and went back to be without a further thought about the incident. I did take a picture of this wound but it is very out of focus. My husband, who is a light sleeper, never woke up during this whole episode even though the slightest movement of mine at other times brings him around to ask me, \"where are you going\"? The next morning I did not even remember the event even though I was angered greatly by the pain of my wound. Later that evening, as I was reading in bed, I remembered all of a sudden and asked my husband if he had heard me ywll, \"Owwww\" in the night. He said that he heard nothing until I went later to sleep on the sofa in the living room. By this time it was around 5 am. I walked over to the mirror to look at the wound and could not believe how perfectly circular the wound was....without a single line to imply a nail had done the damage. I did take two photos of it with a very nice digital camera but could not get the lighting right even with a flash. There were no other marks around it (as if the nail would skip and land in another spot), just one very clean circle of skin missing. I had a rather nasty pimple (yes, I still get those things every now and then) on my chin (right side) and it had been there for nearly a week yet this wound above the left side of my lip healed in only two days! That darned pimple hung around for a few more days after the mark was gone. How is that possible??? Ok, I will now go back to the summer of 1997. My ex husband and I were having a conversation in our living room when everything came to a stop....he just froze in midsentence and it appeared that time had come to a stop as well. Through the front wall of my living room 2 beings came through and then glided over to me. The one standing towards the front was a female (I could sense this) and the other stood just to the left of her and slightly to the back was a male. The female said, \"Do not worry about your Earth parents for we are your real parents.\" It was not spoken aloud but rather telepathically and in such a beautiful tone. Rather sing song. Immediately I had a recognition and said to myself, \"oh, yes, I remember now\"! This is all that I remember from that particular visit. In 1993 I was lying on a very uncomfortable sofa, that was doubling as my bed because I did not have the room for one, studying for a History exam that I was to take the following day. It was about 11:30 or so when I finally found the time to relax and study for this exam because I had to put to bed my four sons. I usually helped them with their nightly routine and read a story to them before they went to sleep. As I was studying I began to feel that I was being watched. The sofa was placed right beneath a large picture window so I could see a large portion of the front yard ( and beyond) from this view. It was a very cold but beautifully star studded evening. I lived in the deep woods of Tennessee so there was not an empty space in that night sky! So many stars. I went back to studying and then began to feel fear rising within me. I felt as though I was being drugged. Simultaneously I felt the need to lie prone, go to sleep and scream for help. I looked at the VCR clock and it read 12:15. At this point I could no longer move my head to turn it.I wanted so badly to turn and see who was there and to get up to run to protect my sons but I could not move! I was screaming in my mind with terror....sheer terror because I could feel someone in the house now and coming over to the sofa. I thought that I was going to die of a heart attack right then and there my heart was beating so wildly. I wanted to scream, to fight, to run to my boys but I could move nothing! Just as they came right up on me I must have passed out because the next thing that I knew my eyes shot open in wide eyed terror and I looked at the VCR clock again and the time was 3:30 am. I could not move, I dare not move or bat an eyelash just in case they were still there...but at the same time I wanted to run to check on my sons! I could not move for the fear of being noticed and taken again......although, I could not tell you where this thought came from. I waited until the sun rose before I moved one muscle then I ran to check on my sons. They were unharmed, sleeping soundly to my relief. From 1993 to 1996 multiple events such as this happened where beings came into my room to either take me, doctor me or impart knowledge to me. In 1993 I was working at a night club in downtown Clarksville, TN. My shift was usually from 7pm until 2 am. By the time I cleaned up the dance floor it was around 2:30 to 3 am. The drive home was about a 45 minute drive as I was still living in Tennessee Ridge in my family's old homestead with my four sons. I was, at that time, dating a young man in the military and he would watch my sons while I worked at night. For some odd reason I decided to take the Dover road home instead of the Cumberland City Hwy which would have been faster and less remote. As I drove along I kept thinking, \" I need to get home. I need to get home!\" because at the same time I also had thoughts of, \"I'm tired. I should pull over.\" It was as if I was arguing with myself but in a frantic frame of mind. I needed to get home to my children and my fiance who always waited up for me, but, instead of driving on I somehow managed to pull over and park my car without even remembering that I did so. Again, I suddenly came to holding the steering wheel so tightly that I thought that I would bend it! I awoke in a sitting position with my hands firmly gripping the steering wheel??? Again, my eyes were popping out of their sockets in terror. I had no idea how I came to be there (on the side of the road in an empty parking lot) or how it was that I did not even remember falling asleep?? When I looked at the clock it was 6am!! My fiance was going to be so worried Ithought to myself. I was absolutely frantic. My sons would be wondering where I was and as I always cooked them breakfast early in the morning this was not acceptable! I was really quite angry with myself for not being there at the time they would awaken. When I did finally make it home ( I had no home phone, there were no phone booths in the middle of nowhere and no cell phones) my finace was equally frantic with worry. I told him that I really did not know what happened but I thought that I had fallen asleep. He looked at me very dissapointed and I thought that our relationship would suffer from this night, but, I said very quietly, \" I really don't know what happened other than I fell asleep on the side of the road.\" He knew this was very uncharacteristic of me but said that he believed me all the same. A few months later we bought a house together and moved to Oak Grove, KY. In the spring of 1994 my ex husband and my children were on the front lawn enjoying the warm evening when I heard my ex call for me in an excited tone. When I came outside I saw what were 4 to 5 lights forming triangles, merging and making other maneuvers that were highly unusual. My ex said that these could not be flares as he was very familiar with their behaviour. We filmed the event for nearly 45 minutes. Several years later I contacted KY MUFON and they had the tape analyzed and it was determined that they were flares. I just do not see how flares can form triangles and blink in and out repeatedly. In 1995 I had another experience with a very tall being with long hair. Since 1987 I had been having problems with a cyst on my right ovary but with no insurance at the time I was not able to go to the doctors for medical treatment. I was really having a horrible time with this cyst and was in pain much of the time. One evening I became aware of someone in my bedroom so opened my eyes to see a tall man standing at the end of my bed. The room was dark so I could not make out exactly who was there ( there was a street lamp across the road from our home that afforded some filtered light to come through the blinds) so thought that it was my eldest who needed something. He was quite tall for his age but as I began to adjust to the dimness of the room I immediately saw that it was not my son! This person was nearly 6 and a half to 7 feet tall! I was embarrased by my nakedness and wanted to pull the blankets to cover myself but could not move. Before I had adjusted my eyes to the darkness I found myself telepathically asking my son what he was doing in my room. Then as the realization came over me that this was not my son I watched the being pull something up from his side and a beam of light began to focus upon my right side. I felt a burning so asked that he please stop! He did not pay any attention to me at all but went about his work. The pain was unbearable so I reiterated to stop. I remembered nothing more of that evening. The one thing that seems to stand out in ALL of these events is my ability to speak telepathically with these beings. I have never opened my mouth to speak as somehow I knew instinctively to communicate via telepathy. On another occassion ( sometime in 1995 )it seemed that I had just fallen asleep when I began to feel myself vibrating. The intensity of the vibration was increasing so greatly that I thought that I was going to explode, but, what happened at the height of this vibration was astounding. It appeared that I exited my body and was being taken into a craft hovering above our home. I remember arguing with them that I would not be able to go through the ceiling, as it appeared that this is where they were floating me, but no sooner had I thought this my I found myself in the attic and then through the roof of my home. The craft was absolutely beautiful and I distinctly remember hearing myself say this before I went unconscious. There was another time that I was visited by a very short being wearing a gold toga. (Yes....I know how this sounds....and looks. What can I say?) I was reading earlier that evening, and, as a matter of fact, was still reading when this began to take place! It was af if everything was in another dimension taking place....like in a fog? Anyway, this being came over to the bed and began to pull on my left leg. ( I was completely paralyzed at this point so could not move of my own volition). I said to this being telepathically, \"If you continue to pull me by my leg you will cause me to hit my head on the night stand!\" I was really terrified that I was going to be injured so panic was beginning to rise within me. This is the last that I remembered of that event. I have to say that there were more but what stood out about all these incedents was the fact that, 1) I experienced a paralysis before the event unfolded, 2) I could only speak telepathically and 3) I always awakend crying, panic stricken and begging my husband to help me. I would ask him why he never woke up when I screamed for him to help me and he would answer that he never heard me. I have seen them take a baby from my womb and hold it in their hand ooohing and awwwing over how perfect the specimen was just before they placed it in a tube of liquid. I would beg them to give me my baby back but they never paid any attention to my pleas. I have even had the horror of witnessing a mass extinction of mankind. I was standing on a balcony looking below at Earth and I saw people begging for their lives. I began to sob and pleaded, \"Why won't you help them? HELP them!\" They simply answered, \"This is how it must be\". At that momnet I recogized that I already knew this but had just forgotten. I never turned to look at these beings but had the feeling that there were 3 to the side of me and directly in back of me. I do not remember anything other than I was still crying when I woke up. They have given me so much information of why this event will take place and I am sure that I also came with this knowledge prior to this incarnation. Even though all of this FEELS real to me I need to have some other form of confirmation that does not rely just on intuition for my personal sanity and peace of mind. Thank you for reading this as I do not like to type and I am sure that this is evident. With Kind Regards, Jamie Santos"],"Summary":"Contact.","Tags":"City","City":"Marlette","Weather Factors":"Unknown","Date Submitted":"05/14/2009 12:00 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Latitude":"43.328668"}