{"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.92205,+-71.54951(17379)&iwloc=A&hl=en\"> mufon case (17379) map </A>","Log Number":"US-06082009-0005","Viewing Distance":"501 Feet - 1 Mile","Summary":"Triangle craft over Smithfield RI","files":["/var/www/straped/mufon/html2text/17379.html.txt","/var/www/straped/mufon/org/17379.html"],"Longitude":"-71.54951","Source":"MUFON","Object Shape":"Triangle","Sighting Duration":"00:10:00","City":"Smithfield","Country":"United States","divs":["Sighting Details On the afternoon of May 30, 2009, My four year old son and I were playing soccer at Deerfield Park in Smithfield RI. Shortly after 1700 hours a silent triangle shaped aircraft flew over us at around 3000 ft. The speed of the craft was very slow and I estimate its size to be between 45 ft to 50 ft wide. I then ran to my car to get my digital camera. As I ran to my car the craft accelerated in speed and altitude. By the time I started filming the craft was at a altitude of 15000 to 20000 ft. In my film the craft can be seen flying in and out of the clouds in a circular motion. The entire event lasted less than ten minutes. I filmed the object for three minutes until the batteries in my camera died. Soon after the object flew out of view. There were at least eight to ten other witnesses, but they were all strangers and I have no way of contacting them. My first thought was that it was a unmanned drone. Possibly used by the DEA to search for marijuana fields in the area. It was the most unusual thing I have ever witnessed. I have also filed a report with the National UFO Reporting Center. Because of the size of the file I have been having trouble emailing the file. I am willing to mail copies of the video to an investigator."],"Case Number":"17379","Tags":"City","trends":["There has been one other sighting in Smithfield","There were no other sightings in Smithfield on or around May 30th 2009","This sighting has never been favorited.",""],"Date Submitted":"05/30/2009 05:15 UTC","Disposition":"IFO","Latitude":"41.92205","Weather Factors":"Unknown","Region":"Rhode Island","Date of the Event":"05/30/2009 05:15 UTC","Object Flight Path":"Path with directional change"}