{"Case Number":"17375","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Cigar, Cylinder","Region":"Missouri","files":["/var/www/straped/mufon/html2text/17375.html.txt","/var/www/straped/mufon/org/17375.html"],"Summary":"Wonderfully heart stopping object that my friends and I saw.","Latitude":"38.706911","Log Number":"US-06082009-0001","Date Submitted":"06/06/2009 09:00 UTC","trends":["There have been 3 other sightings in Sedalia","There were no other sightings in Sedalia on or around June 6th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.706911,+-93.222251(17375)&iwloc=A&hl=en\"> mufon case (17375) map </A>","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"06/06/2009 09:00 UTC","Longitude":"-93.222251","City":"Sedalia","Disposition":"Hoax","divs":["Sighting DetailsI was at the car and go at the AppleBees in Sedalia MO, 5-6-09, when my x- and I saw the first UFO it was very far away, and we hardly gave it to much time, we saw those all the time (I dont know y this area isnt considered a hot spot, I have had at least 10 sighting, some on video), when we discussed the first one for a short time, then he went inside to ask what was taking so long, when coming right from the top of Applebees, was a beautiful cigar shaped object, at least 15,000 ft above our heads, I came out of my car, and wanted to tell my x- to come see, but I was afraid to miss anything, and just when I was catching my breath he walked out, and I yell what is that, at first he didnt know where to look bc there was absolutely no sound, and while we looked up other ppl in the parking lot looked to and someone had taken a photo, I tried to take a pic, but my camera is a pretty low quality, we watch it till it was no longer visible, it was about the size of a football field, there seemed to be a shadow around it, even though it was night there seemed to be something that was even darker all around, there were at least 12 sets of beautiful lights that glowed, all around some lights still and some blinking. When I got home a I seemed to had lots of missed calls from a friend across town that thought I missed it, she was so scared she wanted me to call the police, on a side note those of us that know about this really need to let ppl know, so that when this happens they can report it, with all the sightings that I see I dont know how no one else doesnt do it."],"Object Features":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON"}