{"map":"<A HREF = \"http://maps.google.com/maps?q=45.151521,+-122.853572(17382)&iwloc=A&hl=en\"> mufon case (17382) map </A>","Weather Factors":"None","Longitude":"-122.853572","Tags":"City","Object Features":"Undisclosed","Region":"Oregon","City":"Woodburn","Latitude":"45.151521","Date of the Event":"05/28/2009 11:20 UTC","Sighting Duration":"00:00:10","Case Number":"17382","trends":["There have been 5 other sightings in Woodburn","There were no other sightings in Woodburn on or around May 28th 2009"],"Viewing Distance":"Unknown","Summary":"Blue/green fireball with tail.","Source":"MUFON","Object Shape":"Circle, Fireball","Country":"United States","Date Submitted":"05/28/2009 11:20 UTC","Log Number":"US-06082009-0008","Disposition":"IFO","Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/17382.html.txt","/var/www/straped/mufon/org/17382.html"],"divs":["Sighting Detailsmy husband I were heading south on I-5 towards home from having dinner with friends. Neither one of us had alcohol in our systems. We were having a conversation as we passed the weigh station right before our exit- woodburn. A bright light caught the corner of our eyes at the same time. All we said was \"whoa, what's that\"? The time around 11:15-11:20 p.m. The sky was nice and clear. Had been hot that whole week. This bright circle shaped ball appeared high in the sky to our left. It was a bluish green, almost like teal color. It was traveling at an extremely fast speed and had a tail trailing behind it. There was no sound and it only lasted like 10 seconds as it went from up high to our left then traveled diaganally down to the bottom right. It went a great distance in a matter of seconds and continued flying downward smoothly till it looked like it crashed over the free way out of our sight. Hard to say the distance it was from us. It appeared to be huge judged by sight. Even if the object was indeed close to us, it would have been atleast 3 airplanes together in size. If it was far away, just means it was even bigger. My husband claimed there was no way it could of been a coment or meterorite or shooting star. it was too close to earths surface, and the color was just out of this world. The color was almost magical, just bright and beautiful. It had an appearance as if the object was on fire. My dream would be to witness a UFO crash, unfortunatly, we did not get to see it hit ground. My husband has always been skeptical and non-believer of UFO's till now. I on the other hand have always been aware of their existence. Just a matter of time till everyone is awakened to the truth. Untill then, keep looking up -Tiffany"]}