{"City":"Corona","Case Number":"17387","Latitude":"34.250907","files":["/var/www/straped/mufon/html2text/17387.html.txt","/var/www/straped/mufon/org/17387.html"],"Object Features":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Undisclosed","trends":["There has been one other sighting in Corona","There were no other sightings in Corona on or around November 14th 2008"],"Region":"New Mexico","Date of the Event":"11/14/2008 10:30 UTC","Object Shape":"Unknown","Date Submitted":"11/14/2008 10:30 UTC","divs":["sighting detailsnovember 14,2008, my son and i were hunting in corona, new mexico. we were hunting in state land where no one ever hunts the area. it happened about 6:30 am on the morning of our hunting day. we came along a nice big buck. i shot at it, but the buck kept going we didn't know for sure if we hit it . we were tracking the deer in bad terraine where i didn't think no one was ever in this mountain terraine . when we came up to this strange object i was driving the for wheeler, my son was on the back. i told my son,\" what is that \". i knew it was nothing fom this world, i told my son [cms\\tg\\pid]. that it is a ufo alien. it scared the holy cow out of us. we found the head under a pine tree, and there were bones scattered arond the area where i found the head. my family and i were from corona, nm. we moved from corona in 1968 to belen, nm. where my family and i live. my sister who is 60 years of age told me that a ufo crashed in corona, nm on the day of 1964 on a private ranch or state land. approximatly 80 miles from the town of roswell, nm crash site. i don't want to send a video clip or a photo at this time. sincerly, [cms\\tg\\pid]"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.250907,+-105.596669(17387)&iwloc=A&hl=en\"> mufon case (17387) map </A>","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"10:30:00","Longitude":"-105.596669","Summary":"UFO cranium/skull.","Tags":"City","Log Number":"US-06092009-0001"}