{"map":"<A HREF = \"http://maps.google.com/maps?q=32.228173,+-110.925059(17396)&iwloc=A&hl=en\"> mufon case (17396) map </A>","Viewing Distance":"Over One Mile","Disposition":"Unknown","Object Shape":"Cylinder","Date Submitted":"06/07/2009 04:00 UTC","Latitude":"32.228173","Case Number":"17396","Date of the Event":"06/07/2009 04:00 UTC","Country":"United States","Log Number":"US-06092009-0009","divs":["Sighting DetailsI have already call George Parks (AZ MUFON Rep)and gave him my description over the phone, he asked me to submit this here. I was in my pool in mid town Tucson looking for objects in the sky, hence the term sky watcher, thats what I do!!! I looked to the NW above my house; in the distance (20000 to 30000 feet in the air at an approx. angle of 25 degrees, I saw a small white pulsating light moving from my left to my right. Since I was in the pool and felt very lucky to have seen it at all, I decided to keep my eyes on this object. (If I got out and got my binoculars I would have never found it again) I slowly move to the edge of my pool and kept my eyes fixed on this \"Thing\". The pulse was constant and never changing. If I was to guess; I would say that this thing was going as fast, if not faster than the planes way up in the sky that normally leave some sort of vapor trail. (again 20 to 30 thousand feet) So I would guess 300 to 500 miles an hour. As soon as I got to the edge of the pool this object seemed to curve to its left and was heading due north heading toward Mt. Lemmon. Later my son who does believe in UFO's asked me if it could have been a ballon. I said yes, if it was the size of this pool and flying at 300 to 500 mile an hour. The pulsing light was consistant, not random. It wasn't a mylar ballon catching the light an reflecting toward me. It seemed to be fading just about 30 to 40 seconds after it headed north. I think it could have been slowly decending, but as something flys away from you it does appear to be decending so I'm not sure if it actually lowered in altitude."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Small pulsating sphere view from a distance (high in the sky) heading east then curved sharply to the north.","City":"Tucson","Tags":"City","Region":"Arizona","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around June 7th 2009"],"files":["/var/www/straped/mufon/html2text/17396.html.txt","/var/www/straped/mufon/org/17396.html"],"Longitude":"-110.925059","Object Features":"None","Object Flight Path":"Path with directional change","Source":"MUFON"}