{"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/17392.html.txt","/var/www/straped/mufon/org/17392.html"],"Longitude":"-80.140839","City":"Fort Lauderdale","Sighting Duration":"Undisclosed","Object Features":"None","Latitude":"26.131438","Region":"Florida","Log Number":"US-06092009-0006","Summary":"My son and I saw a cylinder flying then vanish.","Date of the Event":"06/07/2009 01:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around June 7th 2009"],"Country":"United States","Object Shape":"Cylinder","Case Number":"17392","Date Submitted":"06/07/2009 01:00 UTC","divs":["sighting detailsmy son was driving east on peters road approaching state road seven at approximately 1 pm. i noticed a white cylinder slowly flying from north to south in the distance. it looked to be about an inch long at arms length and about 1\\8 inch from top to bottom. it's movement was slow in fact at first i thought that it may have been a blimp as we have them often here. but it was not tapered, it was a solid whiteish color and there were no markings. it was at about a 35 degree angle. i pointed it out to my son who also thought it looked similar to a blimp. we watched it travel 5 inches (at arms length) then dissapear. it almost looked like it evaporated, faded. the distance from us was hard to estimate as of course it would all depend on the length of the object. if i had to guess i woud say no more than 2 miles and that is a guess at best. there were clouds but nothing as low in altitude as this was. we discussed what we saw and somethings did not make this easy to explain. as i said a blimp is not a cylinder it's tapered and usuallu has bright colors etc. also if it had turned as opposed to \"vanish\" the profile would have slowly shortened as it did. also this cylinder appeared to as far as i can tell fly level with no discernable motion usually blimps have a slight tilt and tend to have some up and down motion over a period of time. in the end we were at a loss to nail it down to a specific source that we could easily identify. now i have read a lot of literature on the subject, dr j allen hynek and tried to observe carefully as to not make a simple error, so although i am not \"trained\" i am cautious."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.131438,+-80.140839(17392)&iwloc=A&hl=en\"> mufon case (17392) map </A>","Source":"MUFON"}