{"Object Shape":"Cylinder","Date Submitted":"06/06/2009 08:32 UTC","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Sharon","There were no other sightings in Sharon on or around June 6th 2009","This sighting has never been favorited.",""],"Latitude":"41.236912","Disposition":"Insufficient Data","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.236912,+-80.486854(17397)&iwloc=A&hl=en\"> mufon case (17397) map </A>","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"17397","files":["/var/www/straped/mufon/html2text/17397.html.txt","/var/www/straped/mufon/more/17397_submitter_file1__new.jpg","/var/www/straped/mufon/org/17397.html"],"Log Number":"US-06092009-0010","City":"Sharon","Object Features":"Undisclosed","Date of the Event":"06/06/2009 08:32 UTC","divs":["Sighting DetailsI was walking our dog in my side yard in Sharon, Pa. It was still light, 2032, and I happened to look up over our house. I saw an extreamely bright silver cylinder traveling North East above Sharon. I First thought it was a commercial jet, but I couldn't hear any engine noise. I tried to make out wings and tail, but the object was reflecting so much sunlight that It was too dazzling to make out features. The most strange thing was that it emmitted a white exhust, not a con-trail as airplanes make, but an almost \"fan shape\" exhust that was only about the same length as the object was long. Not like an airplane that has a mile long contrail. This fan shaped exhust was \"broken\"....think of many short lines, one behind the other, all forming a fan shape. I can't estimate the altitude, if it was a jet liner, it was very low and I'd have heard it. It was on a very steady course never changeing speed, course or altitude. I went inside the house for my camera and binoculars, but when I got back it had gone into or over clouds and I didn't see it again. This whole event lasted about 3 minutes."],"Source":"MUFON","Longitude":"-80.486854","Tags":"City","Summary":"Cylinder shape bright silver emitting something white at rear.","Region":"Pennsylvania","Object Flight Path":"Straight-line path"}