{"Object Flight Path":"Undisclosed","Country":"United States","City":"Ruston","Case Number":"17391","Date Submitted":"06/09/2009 12:00 UTC","divs":["Sighting DetailsIt started on the 8th at 10:30 pm. I was talking to my girlfriend on the phone when I noticed a strange noise. It sounded like a mix between a flag blowing in the wind and a sparkler burning. It was coming from the sky and was loud enough that I notced it while in the middle of a conversation. I was on my back porch which faces east. The noise seemed to be coming from the east. I looked all around the sky but saw nothing. I yelled at my brother inside the house to come out and listen. After a while, I walked a few blocks away to the police station where I could see the whole sky. There was not a thing that I noticed. There was no wind at all so I was very curious to what was making the sound. It was coming from the sky. I live fairly close to the interstate and am very used to the sound as I smoke outside and here it at least an hour a day. I finally went back inside to watch a movie but came out over the next 2 hours frequently and the sound was still there. I stay up late because I work nights but was off this particular night. At 2:00 am, my girlfriend came over. I met her outside on my back porch. The sound was more faint at this time but was still fairly easy to hear. My girlfriend picked up the binoculars and looked toward where the sound was coming from. She instantly spotted something. When I looked through the binoculars I could see what appeared to be an upside down triangle. With the naked eye it looked like a faint star. At first I thought it was a star that just looked strange through binoculars. Then I realized it wasn't when I noticed it was slowly moving all around the eastern sky. I could tell it was moving because of it's relation in the sky to the stars and the trees behind my house. We then got out my brothers rifle with a high powered scope. We could really see much more detail with the scope. The triangle always stayed upside down with some black in the middle. It was reflecting tv mmonlight as it was a full moon or at least pretty close to it. We watched the object for about three hours. When it finally dipped to low for me to see it over the trees, I got in my car and drove to the service road next to the interstate. As I drove east up the road, I could not see any stars because it was very bright in the area because of all the city lights. Day break was also beginning. As I prepared to turn around, I saw what appeared to be a super bright star in the east. It was very, very bright. It was the only light I could see in the sky. It appeared to be just a few miles away. Because I was low on gas, I could not get on the interstate and try to get any closer. At this same time, my stepfather, who is a pilot was on his back porch having his morning coffee. He noticed the same light and was bewildered by it also. He had could not explain it either. When I got home I tried to find the triangle and the bright light again but had no luck."],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/17391.html.txt","/var/www/straped/mufon/org/17391.html"],"Summary":"Triangle moving around sky for hours. Later at daybreak saw super bright object.","Longitude":"-92.629227","Date of the Event":"06/09/2009 12:00 UTC","trends":["There have been 6 other sightings in Ruston","There were no other sightings in Ruston on or around June 9th 2009"],"Disposition":"Unknown","Log Number":"US-06092009-0005","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.528815,+-92.629227(17391)&iwloc=A&hl=en\"> mufon case (17391) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Star-like, Triangle","Weather Factors":"Unknown","Latitude":"32.528815","Region":"Louisiana"}