{"divs":["sighting detailsin frederick, md, within 40 miles radius of the dc unit) we sat outside and were visited by first an et contact, 10ft tall skinny lit up dudes, 2 fleets of 3 ships. william was totally talking to whoever the intelligence was - as was will. the message was to use the triad-trinity alignment of mind (pineal), heart and root chakra (genitals) to enable human freedom and root self in awareness\\love. however, within minutes of the last contact, we were bombarded by black ops probing which unfortunately was quite painful. will and myself both felt like needle probes. him in the frontal lobe. me on the right side of my head between the temple and cheekbone - the good news is that the combination of clear skies, the void and the great hall (google search bob dratch) are disabling some nasty circuits and enabling a drain at the same time. ~~~~~~~~~~~~~~~~~~~ et contact event ~~ saturdays, june 13th\\20th\\27th @ 9 p.m. est. these are followup events to the june 6th 'd-day contact event'. our saturday night meetings are potluck arrangements, so bring a dish you think others will enjoy. if this will be your first time attending the event, no need to bring a dish - just chairs for you and your friends attending. our group successfully made contact for several hours on june 6th, and will continue to expand our connection with our elder brothers and sisters in the universe every saturday until a global contact event transpires. the address for the june events is 4412 reels mill road, frederick, md. contact todd or nora @ 301-320-0645 for additional information\\directions as needed."],"Region":"Maryland","Log Number":"US-06092009-0008","Object Features":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"17395","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around June 6th 2009"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.417709,+-77.402601(17395)&iwloc=A&hl=en\"> mufon case (17395) map </A>","Country":"United States","Summary":"Two sets of three lights moving in strategic formation across sky.","Date Submitted":"06/06/2009 12:00 UTC","Latitude":"39.417709","Weather Factors":"Unknown","City":"Frederick","files":["/var/www/straped/mufon/html2text/17395.html.txt","/var/www/straped/mufon/org/17395.html"],"Longitude":"-77.402601","Sighting Duration":"03:00:00","Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"06/06/2009 12:00 UTC","Object Shape":"Star-like"}