{"map":"<A HREF = \"http://maps.google.com/maps?q=33.400946,+-104.518844(17402)&iwloc=A&hl=en\"> mufon case (17402) map </A>","Disposition":"Insufficient Data","Longitude":"-104.518844","City":"Roswell","divs":["Sighting DetailsI left work at about 10:10 PM that night and walked home (About 150 yards)from the resturaunt where I am a Chef. I walked into the house and my wife asked me to take the dog out because he had been whining at the door. Nathen and I walked out the front door and went around to the backyard where he proceeded to do his doggie thing running and playing. I was a very clear night, a lot of stars and warm. I looked up to the North towards the New Mexico Military Academy. I saw somthing that I thought was a dove fluttering as if trying to land on a wire from the telephone poles. As I stared at it I realised that not a dove at all or a bird of anykind, I was a fluttring dim pulsating thing that would hang in one place for about 30 seconds or so then move along to another location in the sky and stop again and flutter and pulsate and move again all in A North to South direction towards the Roswell Airport. If you were to watch a Hummingbird feeding off a bush or a plant Its motions were very similar. Hover in one spot then move along but not in a stright line but a very deliberate direction.I watched for about 10 minutes and started hollering for my wife to confirm what I was seeing.she came outside and when I pointed it out to her she watched along with me. In about 2 minutes it did A sharp left turn to the east and was gone. She looked at me and said I you say somthing about this people will think your nuts or drunk or trying to gain attention. She said so you saw a UFO Just shut up and she went into the house with the dog. I grabbed my cell phone and tryed to call the Roswell Airport but They would not take any calls for some reason and All I got was first a busy signal and then a recording telling me to try again later. And thats my story.....I know what I saw and it was not a bird or A plane or a weather ballon or chopper from the base or hospital."],"Summary":"Moving like a hummingbird feeding from flower to flower.","Case Number":"17402","Date Submitted":"11/30/0002 10:25 UTC","Log Number":"US-06102009-0003","Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 38 other sightings in Roswell","There was one other sighting in Roswell on or around November 30th 2002"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"33.400946","Object Features":"None, Unknown","Source":"MUFON","Country":"United States","Region":"New Mexico","Object Shape":"Sphere, Star-like, Other","files":["/var/www/straped/mufon/html2text/17402.html.txt","/var/www/straped/mufon/org/17402.html"],"Date of the Event":"11/30/2002 12:00 UTC","Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile, Unknown"}