{"map":"<A HREF = \"http://maps.google.com/maps?q=30.24854,+-93.24677(17407)&iwloc=A&hl=en\"> mufon case (17407) map </A>","Case Number":"17407","Longitude":"-93.24677","Viewing Distance":"Unknown","City":"Westlake","Region":"Louisiana","Source":"MUFON","Date Submitted":"06/05/2009 09:03 UTC","Date of the Event":"06/05/2009 09:03 UTC","Object Features":"Undisclosed","Tags":"City","Object Shape":"Star-like","Log Number":"US-06102009-0008","Country":"United States","Weather Factors":"Unknown","Summary":"Large moving planet???","divs":["Sighting DetailsAfter observing approximately 25 UFO sightings during the past 12 months in and around the Westlake, Louisiana area; I am somewhat reluctant to file the attached report which I consider the least of all the aforementioned sightings. However, the sightings around here seem to be tapering off a bit as I have not had any in the months of April or May, so out of boredom from a lack of activity, I submit this report. On the evening of June 5, 2009 at 9:00 PM, I stepped outside my house to scan the sky before retiring for the evening. The sky was extremely clear and all the stars were visible although somewhat dim due a nearly full moon. After slowly doing a 360 degree scan of the sky three times without seeing anything remarkable, I started walking toward my front door when I noticed an object lit up in the Western sky about 45 degrees above the horizon. The object can best be described as appearing somewhat like a very bright planet Venus, except it was approximately four times larger. The object appeared to just appear out of nowhere in the middle of the sky as it was headed North. The object was brightly illuminated for two seconds and would then quickly dim completely out of sight for 10-15 seconds and then reappear brightly for two more seconds. This sequence was repeated three times. Each time the object traveled approximately 20 degrees across the sky before it lit back up after 10-15 seconds. There was absolutely no noise at all outside during the entire 50 seconds or so of elapsed time of this sighting. I do not believe this sighting to be a normal aircraft due to a total silence during the time of the sighting, a lack of strobes and directional markers, and the relative size would be much larger than a jetliner at cruising altitude. Also, the speed of the object would have been much faster than a conventional aircraft. I also dismiss the notion of this being a satellite, as it was much larger and brighter than any satellite I have witnessed before. Besides, I have never seen satellites turn on and off before either."],"Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17407.html.txt","/var/www/straped/mufon/org/17407.html"],"Object Flight Path":"Undisclosed","trends":["There have been 12 other sightings in Westlake","There were no other sightings in Westlake on or around June 5th 2009"],"Latitude":"30.24854"}