{"trends":["There have been 5 other sightings in Boardman","There were no other sightings in Boardman on or around June 6th 2009"],"Date of the Event":"06/06/2009 10:30 UTC","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Ohio","Source":"MUFON","Object Flight Path":"Stationary,Path then hovering","Summary":"Red and white flickering lights apprx 500 yards away just above trees.","Longitude":"-80.654003","Disposition":"Insufficient Data","Date Submitted":"06/06/2009 10:30 UTC","Log Number":"US-06112009-0001","Tags":"City","divs":["sighting detailson the evening of june 6 at approx 10:30pm est, a group of 6 friends were wrapping up a barbeque in a backyard in applewood acres in boardman oh. the woman across from me was chattering away when she looked over my shoulder an said \" omg! what is that in the trees?\" we all ran into the back of the lot and watched this object in the moonlight move slowly above the treeline. at first, we could only see one light thru the trees but then another appeared as it moved into a clearing between the trees. the object hovered there for about 2 minutes- no sound!!. we could faintly make out the shape as a triangle, grey color like a shadow, with red\\white lights on edges that flickered like a flame or a plasma torch. they weren't solid or predictable like a plane's light, but random. we watched for about 3 minutes until a helo came close, and it stopped and hovered as if watching too! seconds later, the whatever slowly backed up away from the helo and the lights got dimmer until we couldn't see it anymore. the only place that has helo's that is close is the hospital life flight about a mile away. just ironic that it would be in the same place at the same time as this \"whatever\"!! we are all sure of what we saw but can't explain what it would be doing near a strip of land with strings of power lines and residential lots! mass halucination? or? ps---- none of us drink!!!"],"City":"Boardman","Case Number":"17409","map":"<A HREF = \"http://maps.google.com/maps?q=41.025226,+-80.654003(17409)&iwloc=A&hl=en\"> mufon case (17409) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Country":"United States","Object Features":"Unknown","Latitude":"41.025226","files":["/var/www/straped/mufon/html2text/17409.html.txt","/var/www/straped/mufon/org/17409.html"]}