{"Source":"MUFON","City":"GRAND CANYON","Region":"Arizona","Object Features":"Unknown","Object Flight Path":"Stationary","Viewing Distance":"20 Feet or Less, 21-100 Feet","Country":"United States","Log Number":"US-06102009-0007","Disposition":"Unknown","trends":["There have been no other sightings in GRAND CANYON","This sighting has never been favorited."],"Latitude":"36.044021","Tags":"City","Date of the Event":"11/19/1993 10:00 UTC","divs":["Sighting DetailsI never saw a U.F.O. that night but i saw a reddish blue yellow glow behind some trees. i was a line cook up at the grand canyon at el tovar. after 10pm all restaurants close and you can only get food from vending machines. i was on my way to get some food from my dorm and this strange glow caught my attention out a ways in the forrest. I went and got my navajo friend ( luke bigman) and we went towards this glow which was about maybe 50 feet or more into the woods. he was talking in navajo and before we got to a hill that came up to a top we saw three small looking things. we were about maybe 15 to 20 feet before we saw these shadowy figures that seemed about 4 to five feet tall doing something on the ground. they seemed to be looking or doing something on the ground. as we got a little closer one of them turned around and you could see its face. honestly it did not look like most aliens you see on t.v. or sketches. they looked very human. it had a slightly big head,bald and in little suits and larger eyes then a man but like I said not like sketches or paintings you would see on T.V. this all happend fast and as soon as it looked our way the other two walked off quickly behind the trees. the one just stood there and looked at us kind of liked an animal looks at you waiting to see who would move first. it then turned around and walked in the same direction as the other two. me and luke took a few steps back and were ready to run and at that time the light went out.we never saw a ship shoot off but we did notice a strange smell in the air kind of like a dry sweet burning smell. we walked backwards untill we got to the edge of the parking lot and told a few people which they thought we were drunk or on drugs.the next day i went out to the spot i thought the light came from and there was four impressions and burst reddish glass beads and the smell of that sweet burnt. I never reported it because of the b.s. those And these days and we (me and luke) spoke about a few times but nobody would believe us. I even told a park ranger and his only comment was to be careful and not venture into the woods late at night for fear of bears or getting lost. I just wanted to share my story if you believe me or not does not matter. but after that I started getting into hubble space pics and re-thinking if we really are the only ones out in this great huge universe. P.S. another reason i contacted you was because in january wheb a supposed ufo was over texas out here it made me think about that night in arizona with the same colors as the constible or some other guy filmed. that light looked the almost exact same."],"Sighting Duration":"Undisclosed","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/17406.html.txt","/var/www/straped/mufon/org/17406.html"],"Case Number":"17406","map":"<A HREF = \"http://maps.google.com/maps?q=36.044021,+-112.12636(17406)&iwloc=A&hl=en\"> mufon case (17406) map </A>","Date Submitted":"11/19/1993 10:00 UTC","Weather Factors":"None","Longitude":"-112.12636","Summary":"Bluish/red/green yellow light in Arizona 1993 around Nov.18 or 21 around 2am."}