{"Disposition":"IFO","Object Shape":"Disc, Star-like","Date of the Event":"06/06/2009 03:30 UTC","trends":["There have been 7 other sightings in Covington","There were no other sightings in Covington on or around June 6th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=39.085821,+-84.505524(17405)&iwloc=A&hl=en\"> mufon case (17405) map </A>","Log Number":"US-06102009-0006","Longitude":"-84.505524","Object Features":"Unknown","Region":"Kentucky","City":"Covington","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"06/06/2009 03:30 UTC","Weather Factors":"None","divs":["Sighting Details I left a friends house in the early morning of June 6th, around 2:30am. On the way, I noticed an oddly bright light in the north sky. It appeared about 3-5x bigger than the brightest star in the sky. Just a little more than enough to clearly define that it was not a star. When you looked close with a naked eye, it seemed to be strobing through different colors. So I rushed home to get my camera. This was my 3rd time witnessing strange lights in the sky, none caught on camera, so I was very eager to get this one. I live about 45 mins south of Wright Patterson AFB located in Dayton, OH. I'm in Erlanger, KY. I believe this could explain my multiple sightings. When I got home I immediately grabbed the camera, which ironically had no charge, it was left running the last time i used it. So after getting my power cord, finding it was too short to reach, unplugging the fish tank(poor guys), grabbing the extension cord, and plugging everything up, I was finally able to begin rolling around 3:00am. Everything was recorded from my 2nd floor balcony, with my Panosonic SDR-S7 camcorder. I filmed the light for at least an hour, using both manual and auto zoom. zooming in, zooming out. In the zoomed video you can clearly see the strobing plasma lights and its overall, beauty, i guess is the best way to say it. It's really bright and weird aurora's and strobes are visible, clearly. I had no tripod, but I did stablize the camera on my balcony banister with my right hand, and used my left hand to prop it up towards the light. It's pretty good footage, even capturing 700x zoom, while somehow keeping the craft in frame. When zoomed in, the light flattened out durastically. Basically, it looked like a dog bowl shaped disc, as it appeared to be circular with depth. Also, zooming in revealed the strobing, or pulsing, plasma-like lights were coming from the top of the craft or light. At this point I knew it was a craft of some kind, beaming with light energy, or something! After filming the object for over an hour, I was very tired, I had left my friends to go straight to bed, until I saw the light. Although I very badly wanted to record all night, into the next day, I had just enough satisfaction from catching it on tape, that I was able to go to sleep. I checked on it for the last time sometime after 4:00am, and it was still there. After that night, it hasn't been there since. Attatched is about 3 minutes of the best segment of footage I have, using manual zoom. At one point, when the object is out of focus, it appears as a blur, but this blur is perfectly flat on the bottom. I am not sure if this is anomolous, or just a normal thing. Definitely adds to the video though. I have 20-30 mins total of unedited footage that I am more than willing to upload all of it if you are interested. Thanks for your time. -Mark"],"files":["/var/www/straped/mufon/html2text/17405.html.txt","/var/www/straped/mufon/org/17405.html"],"Source":"MUFON","Case Number":"17405","Viewing Distance":"Over One Mile","Country":"United States","Latitude":"39.085821","Summary":"Beautiful pulsing plasma-like light, stationary, video proof, filmed 40 mins south of Wright Patterson AFB."}