{"Tags":"City","Weather Factors":"None","Viewing Distance":"Unknown","Log Number":"US-06102009-0009","files":["/var/www/straped/mufon/html2text/17408.html.txt","/var/www/straped/mufon/org/17408.html"],"Object Flight Path":"Straight-line path","Source":"MUFON","City":"Greenfield","Summary":"Bright orange object moving from south to north over Indiana.","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"39.786753","Date of the Event":"06/07/2009 11:00 UTC","Longitude":"-85.760453","Region":"Indiana","Object Features":"Unknown","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=39.786753,+-85.760453(17408)&iwloc=A&hl=en\"> mufon case (17408) map </A>","trends":["There have been 7 other sightings in Greenfield","There were no other sightings in Greenfield on or around June 7th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Case Number":"17408","divs":["sighting detailsi was watching some fireworks coming from a housing addition across a field for a few minutes and then they stopped - and a short time later i saw an orange round object come up from the southern sky and move north in a straight line - the people that had the fireworks must have seen it too - i could hear their voices and they weren't lighting any more fireworks. when i first caught sight of it, i thought perhaps it was some type of firework, but it kept moving from the south, i also thought maybe it was an aircraft and thought maybe when my view of it shifted i would see the navigation lights, but when it got more or less overhead, the object was illuminated exactly the same as when i first saw it (only a little bigger). about that time i realized i was seeing something very unusual and i had a quick thought to grab my binoculars and the camera, but i was afraid if i went back inside the house i would miss something. there was absolutely no sound, no aircraft navigation\\beacon lights and the object maintained the same orange color and shape regardless of the viewing angle and distance i was seeing it - i was seeing a definite shape, and not merely a blob of light. i kept watching it move almost due north until it was just an orange point of light far off to the north and then it disappeared. i remember thinking - this is unbelievable - i can't believe i'm seeing this."],"Date Submitted":"06/07/2009 11:00 UTC"}