{"Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Longitude":"-121.905134","Region":"California","City":"Milpitas","map":"<A HREF = \"http://maps.google.com/maps?q=37.435522,+-121.905134(17401)&iwloc=A&hl=en\"> mufon case (17401) map </A>","Case Number":"17401","Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","Summary":"Strange hovering/ buzzing craft on the edge of Calaveras Canyon.","Object Shape":"Unknown","Date Submitted":"06/10/2009 12:15 UTC","files":["/var/www/straped/mufon/html2text/17401.html.txt","/var/www/straped/mufon/more/17401_submitter_file1__calaverasrd.jpg","/var/www/straped/mufon/more/17401_submitter_file2__starr1.jpg","/var/www/straped/mufon/more/17401_submitter_file3__ufolocationmilpetas.jpg","/var/www/straped/mufon/more/17401_submitter_file4__ufolocationmilpetas2.jpg","/var/www/straped/mufon/more/17401_submitter_file5__ufolocationmilpetas3d.jpg","/var/www/straped/mufon/org/17401.html"],"divs":["Sighting DetailsMy boyfriend and I like to take night nature drives on the backside of Calaveras Rd. Through the canyon from Fremont to Milpitas. With hopes of seeing bobcats or mountain lions, strange owls, etc. Last night,June 9, we left at about 11:15pm. We're driving along, pointing out the diffrent lights (planes, since it is in the flight path of most major airports for the area). At approximately the last 2 miles of the drive about 12:15 am June 10th, my boyfriend yells, \"what the F*** is that!?\", I look up and see a HUGE red and blue light, hovering right above the top of the mountain. (Way too close to be an airplane) The lights were flashing in such a way that there was no pattern to them. The craft's outline was hard to make out since the lights were so large on it. My best assumption would be disc or boomerang. We were about 200ft from it at first and at one point it came very close to where we were and i had only caught one side which was white or grey and sort of rectangluar with a round edge looking. Made NO sound at all. It was just hovering in the same spot, but moving within that spot, sort of in a circular motion. Then it zipped over quickly about 100ft to the right, then back to where it was. We stopped the car immediately. I instantly started freaking out. This was like nothing I had ever seen, the movement, the size, and NO SOUND! We decided it was best to not continue going toward it, so we stayed in the same spot for about 10 min, My boyfriend watched in amazment, I opened and closed my eyes, This was way to freaky for me! Once it started moving slowly away from our direction and behind the hill out of our sight, we proceeded foward to exit the canyon. With me still crying, we got to the end of the canyon road, where we would make a right turn to go about one mile back into Milpitas. Then we saw it again! Hovering and buzzing over a different hill, but this time a little bit in front of it, more over the city. We sat and watched for about a half hour more, as it stangely flashed and hovered very quickly in about a 100ft area. My boyfriend was really excited and wanted a closer look, so we started driving toward the city to maybe find a better viewing spot. Once we exited we saw no trace of the craft. We drove around the area for another 45 mins, still baffled and scared, we couldn't locate it again."],"Object Features":"Undisclosed","Latitude":"37.435522","Log Number":"US-06102009-0002","Source":"MUFON","Date of the Event":"06/10/2009 12:15 UTC","trends":["There have been 3 other sightings in Milpitas","There were no other sightings in Milpitas on or around June 10th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Tags":"City"}