{"Sighting Duration":"00:00:01","Date Submitted":"06/10/2009 08:49 UTC","City":"St Louis","Tags":"City","Object Shape":"Unknown","Latitude":"38.628632","Longitude":"-90.191564","files":["/var/www/straped/mufon/html2text/17415.html.txt","/var/www/straped/mufon/more/17415_submitter_file1__2009061020492301.jpg","/var/www/straped/mufon/more/17415_submitter_file2__2009061020492303.JPG","/var/www/straped/mufon/more/17415_submitter_file3__2009061020492305.JPG","/var/www/straped/mufon/org/17415.html"],"Object Features":"Unknown","Date of the Event":"06/10/2009 08:49 UTC","Source":"MUFON","Object Flight Path":"Unknown","Region":"Missouri","divs":["Sighting DetailsI was outside trying to catch lightening from a storm passing by St. Louis at about 8:49 PM CDT. I was randomly snapping off pictures, trying to catch a bolt of the many flashing around my house at the time. After downloading them to my computer, I notice a strange \"triangle\" of apparently 3 white dots over my next door neighbor's house, as seen in the \"01\" image. I increased the brightness of that image some to bring out the few raindrops also captured in the image, but no lightening (which I never caught!) I zoomed in on the three lights. the \"03\" image, At 500% in \"original\" brightness, it appears that the three lights were more than that; a white light with two yellow lights emitting \"rainbows,\" all lights possibley within or around a larger red light. At 2000%, in original brightness, image \"05\" is zoomed about as much as possible for the image density. Curiously, the enlarged perspective of the lights is different than the original pespective, especially where the \"rainbow\" streaks become more visible and what appeared to be three lights at low resolution looks much different at higher resolution. The rainbow \"rays\" and the \"quantum leap\" perspective of the lights from low to high resolution are unidentified to me. Apparently, an object in the sky underneath the clouds, natural or artificial, emitted these lights. In a strange irony, how \"funny\" to see a rainbow in the sky at night!"],"Weather Factors":"Lightning, Rain, Light","Disposition":"Unknown","Log Number":"US-06112009-0007","map":"<A HREF = \"http://maps.google.com/maps?q=38.628632,+-90.191564(17415)&iwloc=A&hl=en\"> mufon case (17415) map </A>","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around June 10th 2009","This sighting has never been favorited.",""],"Summary":"Lights under night storm clouds.","Viewing Distance":"Unknown","Country":"United States","Case Number":"17415"}