{"map":"<A HREF = \"http://maps.google.com/maps?q=54.774807,+-101.844834(1742)&iwloc=A&hl=en\"> mufon case (1742) map </A>","Sighting Duration":"00:05:00","Object Flight Path":"Stationary","Source":"MUFON","Latitude":"54.774807","Date of the Event":"08/10/2002 02:00 UTC","Viewing Distance":"20 Feet or Less","Date Submitted":"08/10/2002 02:00 UTC","Longitude":"-101.844834","Summary":"burning bush ball of sine-waves of light","City":"Flin Flon","Object Features":"Other","divs":["Sighting DetailsAfter waking froom afternoon shift the next afternoon I was in the lake near theshore working with my brother building a wave break to stop erosion on thelakeeshore. My brother became suddenly exhausted and lay down and fell asleepthirty feet away. I was picking rocks out of the shallows when I notiaced ablack strobe-like effect through the top of my head. I looked up to where itwas from and there in a ytoung tree was a ball of sine-waves of Light. I hadbeen thinking about someone showing up at my work site who I expect meant meharm. The next day I remembered and ws vexed, which is when the massiveaudio-visual hallucination occurred. The ball of sine-waves of light moving inperfect symmetry. A voice that sounded like thousands and thousands of trumpetsof thunder spoke to me with telepathy. I spoke back the same way. I stood andobserved the ball of sine-waves of light for a short period of time until a carcarryi8ng three born again achristians camea down the cottage road. I spokewith regional mufon director Ed Barker about the encounter. \"Sounds like youwere programmed.\" he said. Dr. J.R, Delgado approached me during the followingcourt proceedings and shook my hand at the black box delusion trial when I wasfdound not guilty by reason of insanity. For a decasde afterwarad I wouldexperience of flashing behind my eyes, which may very well have been caused byeye problems and not the massive audio-visual hallucination. ENTER YOURNARRATIVE DESCRIPTION HEREPlease limit your narrative to 2000 words (equivalent to 6 typed pages)."],"Log Number":"","Country":"Canada","files":["/var/www/straped/mufon/html2text/1742.html.txt","/var/www/straped/mufon/org/1742.html"],"Weather Factors":"Windy","Disposition":"Unresolved","Region":"Manitoba","trends":["There has been one other sighting in Flin Flon","There were no other sightings in Flin Flon on or around August 10th 2002"],"Case Number":"1742","Object Shape":"Unknown","Tags":"City"}