{"Case Number":"17422","Sighting Duration":"Undisclosed","Longitude":"3.400333","Summary":"Luz UFO Lagos glow white.","files":["/var/www/straped/mufon/html2text/17422.html.txt","/var/www/straped/mufon/org/17422.html"],"Object Features":"Undisclosed","Tags":"City","Region":"Lagos","divs":["Sighting DetailsWe had gone to my aunt's house to celebrate new year. After the countdown, we said goodbye and were driving to a village near by for a ball (not exactly as you have it in USA, but it's the closest translation I could get). After one or two minutes after leaving the house, we were in the car (me, my sister, my mother and a cousin)driving through the buildings (4 storey high at most) when I noticed a bright red glowing shaped disc hovering over the buildings (about 5 centimeters above, in my sight). It was about 3 centimeters wide and one high. At first I didn't do anything about it. At that time I believed there had to be UFOs, but didn't pay that much atention to the subject. I just remeber thinking \"oh, it must be a UFO\". I kept looking a long time - I guess, I wanted to be sure I was really seeing something. That was when I told them what I was seeing. My cousin and sister glued themselves to the window, trying to see it. Both os them saw it. My mother kept the eyes on the road (and have to say she doesn't believe it truly, special because she's a devoted christian - altough she has dimed it out over the years). We watched it for a few minutes before it was completly blocked by the buildings (remeber we were moving). The object seemed to be just hovering, completly silent and motionless. I regret every single day we didn't stop to take a closer look at it. It was sooo close!!! We're pretty excited by the sight, but didn't know what to make of it... I even tried to take a picture (I had my camara to take photos of new's years), but I didn't get it out fast enough. I must say, in this particular case I did not have my glasses on. I don't see very well, but my sister and cousin do and they saw pretty much the same as I - with better quality I imagine! lol (in the time I had to put 23h - 11PM because it didn't let me put 24, an error occured)"],"City":"Lagos","map":"<A HREF = \"http://maps.google.com/maps?q=6.455536,+3.400333(17422)&iwloc=A&hl=en\"> mufon case (17422) map </A>","Date of the Event":"01/01/2009 11:06 UTC","Disposition":"Unresolved","trends":["There have been 3 other sightings in Lagos","There were no other sightings in Lagos on or around January 1st 2009"],"Weather Factors":"Unknown","Date Submitted":"01/01/2009 11:06 UTC","Log Number":"PT-06112009-0013","Source":"MUFON","Object Flight Path":"Undisclosed","Country":"Nigeria","Latitude":"6.455536","Viewing Distance":"Unknown","Object Shape":"Disc"}