{"Log Number":"PT-06112009-0012","Case Number":"17421","Object Flight Path":"Stationary,Straight-line path","Weather Factors":"None","Latitude":"6.458836","Object Features":"Unknown","Object Shape":"Cigar, Fireball, Flash, Triangle","Sighting Duration":"01:03:00","Country":"Nigeria","map":"<A HREF = \"http://maps.google.com/maps?q=6.458836,+3.403193(17421)&iwloc=A&hl=en\"> mufon case (17421) map </A>","Tags":"City","Source":"MUFON","Summary":"Triangle cigar flash.","City":"Lagos","files":["/var/www/straped/mufon/html2text/17421.html.txt","/var/www/straped/mufon/org/17421.html"],"Region":"Lagos","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMyself and my sister have been \"calling\" UFOs for quite sometime now, so we always check the skies to see if there is something out there to be seen. Today was no different. We're not calling them that much lately - we've already seen many. Well, I just went outside to the balcony with view to the East. It was around 22PM. The second I steped out, 2 flashes of light in a row near one of the brightest stars (about 3 centimeters from where I was standing). I thought: What a luck, just the minute I get outside I see an airplane. But then nothing more. When I saw it the light was pretty strong and if it was an airplane it would continue to be seen for a while till it had faded into a thin light. So I thought it was a way of them to say \"hello, we're here\" - because I'm pretty annoying, I guess. Always calling them. So I guess it was to prevent. lol! Then, because nothing else ocurred for a while, I went inside. Only came out about 20 minutes later. I know I was scaning the skies when I saw a bright and big (I'd say 5 times bigger than the brightest star, around two centimeters wide and half a centimeter high). It was moving from North to South, but I also think it might be slowly turning East because the light seem to grow smaller. It was orange all around and a white light flashed inside in a constante ritm. I called my sister and we both saw it till it desapeared. That was the interesting part. When we were about to lose sight of it (it was going behind the wall of our building), the object slowly faded away like they were saying \"we just came for you and since you can't see us anymore, there is no need to be visible\". Of course this is just my subjective interpretation and has nothing to do with the event itself - just with our experience in seeing this things. Afterwards, we ran to the other side (facing West) to see if it appeared on the other side (all airplanes do.. - makes sense, right?), nothing appeared at first. Then we noticed (we have binoculars close all the time) a flashing red light just hovering very far away. At this moment it looked more like a star if it wasn't pulsating constantly. We saw something else a few minutes later, but I'm convinced it was an airplane. The right size and seemed to flash at the rate airplanes do, so.. About the feelings - always joy, I guess. But after seeing so many we don't get that WOW effect (despite this orange glowing one did get us fascinated - we didn't get one so good for a while)."],"Longitude":"3.403193","Date of the Event":"06/11/2009 10:23 UTC","trends":["There have been 3 other sightings in Lagos","There were no other sightings in Lagos on or around June 11th 2009"],"Date Submitted":"06/11/2009 10:23 UTC","Disposition":"Unresolved"}