{"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Latitude":"-12.038746","Tags":"City","Region":"Lima","Sighting Duration":"Undisclosed","Log Number":"PE-06112009-0015","Summary":"Ovni.","Object Shape":"Disc","Country":"Peru","Source":"MUFON","Date Submitted":"01/01/2009 01:00 UTC","Viewing Distance":"Unknown","Longitude":"-77.060703","divs":["Sighting Details creo que tengo una pista sobre com funciona un platillo volador, me gustaria discutir el tema, porfa me tenga en cuenta,pues yo los tengo mui en cuenta, Yo e visto por history the chanel la esperiencia de como se puede obtener enegia infinita, otra reportagen de una arma de sonido que el sonido era direcionado para aturdir posibles enemigos y otra reportagen de que un cientista hace que una tapita flote con el sonido usando una determinada frecuencia pero porque no estava dentro de la tapa???? bueno solo se que que lo mas cencillo es mas facil y ablando de energia de locomocion no se si asta ahora se ha utilisado sonido con una determinada frecuencia y con poca energia para la locomocion ,tengo mucho mas informacion sobre el tema, y me gustaria ser un investigador de como se locomove los ovinis, como vuelan, hai que estudiar las fotografias reales, analisarlas y completar un rompe cabesas que yo creo que hai y es mui sencillo mui ligero mui bio mecanico y asta ser guiado con solo movimientos faciales indicando direciones transmitida por frecuencia de remotocontrol a una nave no tripulada, la verdade para min solo es cuestion de tiempo, ya estamos preparado pera la verdad. A mi me intresa la tecnologia de los autoparlantes voladores se esa teoria es aceptables no es cierto? pero la verdad que su forma dice mucho de como vuelan hai que investigar ....."],"trends":["There have been 10 other sightings in Lima","There were no other sightings in Lima on or around January 1st 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=-12.038746,+-77.060703(17424)&iwloc=A&hl=en\"> mufon case (17424) map </A>","City":"Lima","Date of the Event":"01/01/2009 01:00 UTC","Case Number":"17424","files":["/var/www/straped/mufon/html2text/17424.html.txt","/var/www/straped/mufon/org/17424.html"],"Weather Factors":"Unknown","Disposition":"Unresolved"}