{"Source":"MUFON","Summary":"Same thing we wittnessed last time.","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Region":"Arizona","Date of the Event":"06/11/2009 08:00 UTC","Longitude":"-114.611572","map":"<A HREF = \"http://maps.google.com/maps?q=34.85204,+-114.611572(17426)&iwloc=A&hl=en\"> mufon case (17426) map </A>","trends":["There have been 2 other sightings in Needles","There were no other sightings in Needles on or around June 11th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsHi Christine Dickie, It's me again. Sending the latest cell phone photo's of todays sighting. Sorry, I'm so sorry that I don't have a better way to photograph these things. This object was identical to the last one I reported, cone shaped, brilliant and stationary, although by dark it appeared to be moving further west. I know that last time we sighted this object an operations manager for Columbia Scientific Ballon Facility or the DSBF out of Palestine Texas claimed to the local paper here that what we all saw was a research ballon but how many times do they have to check the gamma rays around this region? I am sending you the local newspaper article on the \"so called\" explanation of the last sighting so you can see that they claim that these things are launched 10 to 12 times a year over Arizona but how come we have never seen them before? If what Mr. Bill Stepp claims is true then I believe there would have been more newspaper articles on the sightings to begin with and another question we have, is why does this object appear to frighten the animals. I feed several stray cats outdoors and a few of my own and yesterday I began to believe that a predator such as a coyote or stray dog was on the loose becasue all my cats dissapeared. Normally they have a ravenous appetite and hear me coming, if the sound of my feet fails, the pellets hitting the metal bowls always brings them out of their hidy holes but they remained out of sight for most of the day and only returned today. I personally am going to do some background research on gamma ray testing, Mr. Bill Stepp and CSBF. Somehow I don't think we are getting the truth from these people, even if they are launching ballons which glow and emanate and appear to have something moving inside of them. If you want to call, please do, I am home most of the time but if not my cell is always hanging from my side. Shaba"],"Case Number":"17426","Log Number":"US-06112009-0017","Latitude":"34.85204","files":["/var/www/straped/mufon/html2text/17426.html.txt","/var/www/straped/mufon/more/17426_submitter_file2__ANOTHERGAMMACOLLECTOR.jpg","/var/www/straped/mufon/more/17426_submitter_file3__UFOTOMEWEATHERBALLONTONASA.jpg","/var/www/straped/mufon/org/17426.html"],"Country":"United States","Date Submitted":"06/11/2009 08:00 UTC","City":"Needles","Weather Factors":"None","Object Shape":"Cone","Disposition":"IFO","Object Features":"None","Viewing Distance":"Unknown","Tags":"City"}