{"Summary":"Translucent, glow, almost transparent or crystal glass like.","Longitude":"-111.085211","Region":"Arizona","Object Shape":"Diamond","Object Features":"Undisclosed","Date Submitted":"06/11/2009 07:30 UTC","Date of the Event":"06/11/2009 07:30 UTC","trends":["There have been no other sightings in West of Anthem NLake Plea","This sighting has never been favorited."],"Log Number":"US-06122009-0003","Country":"United States","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17429.html.txt","/var/www/straped/mufon/org/17429.html"],"Case Number":"17429","Object Flight Path":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.056708,+-111.085211(17429)&iwloc=A&hl=en\"> mufon case (17429) map </A>","Latitude":"34.056708","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy family went for drinks at Sonic's Drive thru in Anthem, the exit faces west. I noticed around 735pm an object at what seemed at a stand still high in the far western sky (probably a bit further or around Lake Pleasant area) I pointed it out to my wife and kids as I ordered our drinks. I felt that it wasnt an airplane or air balloon so I immediately parked facing west. We gazed at this object for about five to ten minutes, it was partly cloudy and as the clouds moved north, the light of this object was piercing through the clouds. We headed home (only minutes away) I immediately asked my children to get the binoculars as I got the videocam and tripod. My little one even got his digital cam and filmed it. I filmed about 2 to 5 minutes of it, which outlines the diamond shape with a hyper white glow translucent hovering west of Anthem. the binoculars gave the cleanest appearance. At one point I attempted to place the binoculars in front of my camera lense to get a closer zoom but it didnt work. My film was set on a tripod, as the object hovers south out of angle and I zoom out carefull to put it in focus. My wife and kids all identified that this was certainly something out of the ordinary and Fascinating. Casey M"],"Tags":"City","Viewing Distance":"Unknown","City":"West of Anthem NLake Plea"}