{"Sighting Duration":"Undisclosed","Log Number":"US-06122009-0008","divs":["Sighting DetailsI first saw it around 6:45pm at Dreamy Draw Dam where I was photographing. I got my binoculars out and saw that it was very bright, possibly balloon-shaped, but it didn't look like a hot-air balloon and much too large to be a regular balloon. It did not appear to be moving at all. I then drove to Piestewa Peak Park to take more photos for a half hour or so. Upon leaving the park and heading home, I saw it in the almost-dark sky to the NW. It was still bright. I pulled into a parking lot and took a few photos but my telephoto lens is only 135mm. It still had not moved. I got home, told my significant other about it. He came outside and also looked through the binoculars. By this time I had seen it for about an hour and a half. It was now almost dark, the object was still very bright, no stars or other nighttime objects yet visible. We went inside to make a phone call to a friend. When we came back out, it was no longer visible and it was totally dark. We do not have an unobstructed view so if it went behind some trees or houses, we would not see it anymore."],"files":["/var/www/straped/mufon/html2text/17434.html.txt","/var/www/straped/mufon/more/17434_submitter_file1__UFOCropped.jpg","/var/www/straped/mufon/more/17434_submitter_file2__UFO.jpg","/var/www/straped/mufon/more/17434_submitter_file3__UFO2.jpg","/var/www/straped/mufon/org/17434.html"],"Object Features":"None","Date of the Event":"06/11/2009 07:00 UTC","Summary":"Saw in the NW sky while it was still light, bright, translucent. Saw as darkness set in, still glowing, then it was no longer visible when it became totally dark.","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.449847,+-112.067207(17434)&iwloc=A&hl=en\"> mufon case (17434) map </A>","Source":"MUFON","Latitude":"33.449847","Tags":"City","trends":["There have been 417 other sightings in Phoenix","There were 3 other sightings in Phoenix on or around June 11th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","Case Number":"17434","Date Submitted":"06/11/2009 07:00 UTC","Weather Factors":"None","Object Shape":"Teardrop","City":"Phoenix","Longitude":"-112.067207","Object Flight Path":"Stationary","Country":"United States","Region":"Arizona"}