{"Date of the Event":"06/11/2009 12:00 UTC","Log Number":"US-06122009-0011","Latitude":"33.642689","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Country":"United States","City":"Surprise","divs":["Sighting DetailsI was laying on my couch watching tv when my husband called and asked be to do him a favor and go outside and look to see if i saw what he could see. The sky was fairly clear with some clouds on the northwestern horizon. I saw a very very bright light that seemed to be shaped like a triangle. It did not appear to be a star it seemed way bigger then any star i have ever seen in the sky ( it was way disproportionate in size to any star i have ever seen, even the northern star, which it seemed to dwarf). It did not seem to move at all. My husband had been observing it for approximately fifteen minutes before he called my and described the same thing. My children and i sat on our back patio and watched it, then the coverage started to reach the radio, my husband was listening to the car radio and people were beginning to report it. Approximately five minutes prior to not being able to see it any longer we noticed it began to change color and fade in and out, the color it changed to was red. We did not see it disappear but the clouds passed over it and when they were gone you could no longer see the object."],"Longitude":"-112.392738","Summary":"Triangle shaped large very bright object that did not move.","Date Submitted":"06/11/2009 12:00 UTC","Source":"MUFON","Object Shape":"Triangle","Tags":"City","Object Features":"Undisclosed","Disposition":"Insufficient Data","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.642689,+-112.392738(17437)&iwloc=A&hl=en\"> mufon case (17437) map </A>","Sighting Duration":"Undisclosed","Case Number":"17437","Viewing Distance":"Unknown","trends":["There have been 11 other sightings in Surprise","There were no other sightings in Surprise on or around June 11th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/17437.html.txt","/var/www/straped/mufon/more/17437_submitter_file1__0611092003.jpg","/var/www/straped/mufon/org/17437.html"]}