{"Case Number":"17442","Log Number":"US-06122009-0016","Source":"MUFON","Tags":"City","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around June 11th 2009"],"Object Features":"None","Disposition":"IFO","City":"San Jose","Date of the Event":"06/11/2009 07:58 UTC","divs":["Sighting DetailsAt approximately 7:58 PM, on June 11, 2009, in Blythe California, my friend called me and told me to go look outside at the UFO towards Parker. My mom and I went outside and immediately saw the sphere shaped lit up craft stationary over what seemed to be the Colorado river, Northeast of our property. It was a good distance away, its hard to give distance in the air or how far away the object was.. It was slowly going in tiny circles it seems, then staying still... changing after about 4 minutes from white light to red... then at the sixth minute I observed it, it slowly dimmed and looked like a distant star, the stars weren't out yet. It was a wonderful experience, I don't know if it has anything to do with it, but I was really dizzy after watching it, maybe because I was looking up so long..my mom said the same thing.. We feel fine now and felt fine about 30 minutes after that. I tried to get my friend to take a pic, but he couldn't he said, however, his cousin said he looked through binoculars and saw what he described as a big balloon...he said it looked round... there is no way a balloon could have been there.... that big..... that high.. that long.... changing colors.... absolutely not.... and if so where did it go? I'm hoping others have reported this to you and got a good picture or video of it. I tried to call another friend to video it, but they weren't home.. anyhow it was a cool sight, I hope they come back tonight... take care , will be happy to talk to you if you like .. hope all of you are doing well... Thank you, Deana Walker"],"Longitude":"-121.937356","Latitude":"37.254024","files":["/var/www/straped/mufon/html2text/17442.html.txt","/var/www/straped/mufon/org/17442.html"],"Summary":"My mom and I viewed a brightly lit up white then red sphere in the northeastern direction for approx 7 minutes.","Object Shape":"Sphere","Date Submitted":"06/11/2009 07:58 UTC","Region":"California","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.254024,+-121.937356(17442)&iwloc=A&hl=en\"> mufon case (17442) map </A>","Object Flight Path":"Stationary,Other","Sighting Duration":"00:07:00"}