{"Weather Factors":"None","Longitude":"-72.643719","Case Number":"17449","divs":["Sighting DetailsAt 9:50pm EST was outside stargazing after two people left who came to see a piece of furniture I was selling being stored in the garage. I noticed a very bright star or planet just a few degrees to the east of the big dipper arm and said to my self that is not in the right place as I am an amateur astronomer. The skies were clear but with summer haze so that I could barely see secondary stars. As my eyes adjusted to it's precise location in relation to known stars I perceived it to be moving at a much slower pace than common aircraft speed but also at altitude equal to common airliners. I did not notice any flashing red wing lights, Just a single bright point of light. At that point the object seemed very odd to me although I am located in a high traffic aircraft zone military and commercial. The object then made an abrupt acceleration northbound at tremendous velocity that I perceived supersonic because of my naval aviation experience. I did not see any afterburner or hear any sonic boom. I quickly ran to the south side of my neighbors parking area so that I would not lose sight of the object as it moved towards the tree line on the north side of the property. As I looked up again after moving I could not relocate it."],"Region":"Connecticut","files":["/var/www/straped/mufon/html2text/17449.html.txt","/var/www/straped/mufon/org/17449.html"],"Country":"United States","Viewing Distance":"Over One Mile","Latitude":"41.570641","Tags":"City","Object Flight Path":"Straight-line path","trends":["There have been 15 other sightings in Middletown","There were no other sightings in Middletown on or around June 12th 2009"],"Object Shape":"Star-like","Log Number":"US-06122009-0023","Date of the Event":"06/12/2009 09:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.570641,+-72.643719(17449)&iwloc=A&hl=en\"> mufon case (17449) map </A>","City":"Middletown","Disposition":"IFO","Source":"MUFON","Summary":"Northbound planet like object accelerating from slow to high speed.","Sighting Duration":"Undisclosed","Date Submitted":"06/12/2009 09:49 UTC","Object Features":"None"}