{"Date Submitted":"08/31/1956 12:00 UTC","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","Object Shape":"Disc","Case Number":"17443","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.894227,+-78.875789(17443)&iwloc=A&hl=en\"> mufon case (17443) map </A>","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","Object Features":"Undisclosed","Region":"New York","Longitude":"-78.875789","Latitude":"42.894227","Date of the Event":"08/31/1956 12:00 UTC","Object Flight Path":"Undisclosed","City":"Buffalo","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around August 31st 1956"],"files":["/var/www/straped/mufon/html2text/17443.html.txt","/var/www/straped/mufon/org/17443.html"],"Log Number":"US-06122009-0017","Summary":"Afternoon. A silent, brass colored disc is hovering in front of me. Superstructure atop is obscured by intense light, blinking red, green, white.","divs":["Sighting DetailsJust north of the Peace bridge high tension wires span the Niagra River from Buffalo, NY tp Fort erie, Canada. On the American side, a few yards north of the power lines, the embankment runs high, blocking the view of the river from the corner where School Street starts east from Niagra Street. On a warm Septemeber 1956 afternoon, the Northbound Niagra Street bus dropped me at this corner on my way home from high school. Walking the short block east to Prospect Avenue, I crossed School Street to a small triangular park bordered by Niagra, School and Prospect. To my right across prospect and four houses down, was my house. But as I started to turn that way, a bright, blinking light caught my attention. my first fleeting thought was \"ye;;ow piper cub', then my eyes focused solidly and I was staring at a brass colored disc, the light atop rapidly blinking red, green and white. It hovered silently, completely motionless, and as hard as I tried, I could not discern any windows, markings or seams. And the light made it impossible to see the superstructure. It was slightly north, and higher than the power lines, perhaps 800 feet above the water. my immediate impulse was to run home to get my father. but I was mesmerized, staring, finally walking slowly back toward it, toward Niagra street. Gradually I became aware of the sound of jet aircraft approaching from the north. the roar of their afterburners started to hurt my ears, but they were out of sight, close to the water, then suddenly rocketing up into view toward the disc at a 60 degree climb. Two F-86 fighters, close enough that i cold see the piots. And an instant after they flashed into sight the disc took ff so fast it blurred, streaking out over lake erie. Any sound it made accelearting was drowned out by the jets. For a brief moment that all three aircraft were in view the disc appeared to be about half again as big as the jets. The following day a brief article about \"mysterious\" lights over the lake was published on an inside page of the Buffalo Evening News. A quote from the Niagra Falls Air Force base denied both radar contact and scrambled aircraft. After watching \"UFO Hunters\" air older sightings on the History Channel, I decided to finally get this sighting into the record."]}