{"Summary":"Two sightings within a week.","files":["/var/www/straped/mufon/html2text/17448.html.txt","/var/www/straped/mufon/org/17448.html"],"trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around November 30th 1996"],"Date of the Event":"11/30/1996 12:00 UTC","Weather Factors":"None","Longitude":"-94.571697","Country":"United States","Log Number":"US-06122009-0022","Region":"Missouri","Sighting Duration":"Undisclosed","Latitude":"39.101896","Case Number":"17448","Viewing Distance":"20 Feet or Less","Object Flight Path":"Hovering then path,Straight-line path","Tags":"City","divs":["Sighting DetailsThe first one looked like fast moving aircraft but it was just a bright spot,the best shape description above would be star. I thought it was an aircraft even though it was going very fast. I was standing on my front porch and saw it moving across the sky. I watch it as it went behind the tree across the street then it appeared between the two trees in the yard across the street. But it never came out the other side. It had just disappeared as it passed behind the second tree. The second was a few nights later. I was on my porch again while my dog was outside doing his business. There was an unusual sound, like an aircraft but not like an aircraft. Deeper and more of a hum than a jet engine sound. I lived on the flight path to the air base growing up and planes would come over daily, flying very low, so I know what air planes sound like, this was different. It was a sound that you felt. As I saw the aircraft it was moving very slow, far to slow to be a plane and still remained in the air. I didn't really see the body of the craft it seemed to be in a cloud but it seemed no higher than my tree tops. What I did see was three lights in a triangle shape they seemed to be below the cloud or bright enough that the cloud didn't effect my seeing them. It was so low it frightened me so I got my dog and went in the house but it was directly overhead when I got to the door. I've never seen anything like that before or since. It was fairly large but not as big as the Stealth Bomber. Maybe 20 or 30 feet across the widest part about as wide as my house. I couldn't tell you if it was an Isosceles or Equilateral triangle shape. It freaked me out so much because it was so close and I got a really ominous feeling about it that I just got inside as quick as I could. I thought about telling someone back them but I didn't know who I could tell. I just saw on the news about the sitings at UMKC. I thought sence your keeping track of these sitings I should maybe tell you."],"Disposition":"Unknown","City":"Kansas City","Object Features":"Unknown","Date Submitted":"11/30/1996 12:00 UTC","Source":"MUFON","Object Shape":"Star-like, Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=39.101896,+-94.571697(17448)&iwloc=A&hl=en\"> mufon case (17448) map </A>"}