{"Date Submitted":"06/12/2009 11:21 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"47.768246","Log Number":"US-06132009-0007","Object Flight Path":"Path with directional change","Tags":"City","City":"Hayden","trends":["There have been 5 other sightings in Hayden","There were 2 other sightings in Hayden on or around June 12th 2009"],"Object Shape":"Unknown","Region":"Idaho","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Weather Factors":"None","Case Number":"17459","Longitude":"-116.781702","files":["/var/www/straped/mufon/html2text/17459.html.txt","/var/www/straped/mufon/org/17459.html"],"Date of the Event":"06/12/2009 11:21 UTC","divs":["Sighting DetailsREFERENCE THE FOLLOWING REPORTS: 17056,17327,17431,17438... I have several minutes of video of a very large craft flying enormous circles around my town. Everytime I go to take video of this object I think its some sort of airplane. But once in a while it will stop in the distance and many other lights will appear around it. The size and shape are difficult to determine but aside from the very first sighting I can hear this object. It sounds like a low roaring jet engine. There are usually 3 white lights in a triangle formation that are constantly lit, although at times there are only two. There is always a flashing red and a flashing white light. I have no idea what this is and am very conflicted as to what I am seeing. If this is an airplane what is it doing flying circles around my town, and what are all the light anomalies that I am seeing? I will have video uploaded before the weekend is over but I have video from the 10th to the 13th of this object. This craft is accompanied by flashes of light in the sky. I have video record from the 10th of bright flashes of light coming from the direction of the Ursa Major constellation. I need someone to review and enhance my video as soon as possible."],"Summary":"Triangle light formation circling my town.","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=47.768246,+-116.781702(17459)&iwloc=A&hl=en\"> mufon case (17459) map </A>","Object Features":"Unknown"}