{"trends":["There have been 10 other sightings in Swartz Creek","There were no other sightings in Swartz Creek on or around April 26th 1989"],"Latitude":"42.965651","Weather Factors":"Unknown","Summary":"Multiple Witnesses see nocturnal lights in Swartz","Source":"MUFON","Disposition":"Unresolved","divs":["sighting detailsthis is an excerpt of the fi summary report:each witness was interviewed separately and each made drawings of what they hadseen and answered questions from form 1.the three boys were headed east on hill rd. after dropping off a fourth person. they were returning from a meeting of the order of demolay. dg was driving theolder model monza hatchback, jh was in the front passenger seat, and kp wasseated behind jh. kp was leaning back looking through the top of the hatchbackwindow. approx. 1\\2 mile after dropping the fourth person off at his home kpsaid, \"look at that!\" they pulled the car over and dg rolled down his windowand at 2:00 in the horizon he saw red, blue, white, and green lights flashing insequence. he stopped the engine, put out his lights. they all got out of thecar. there were two sizes of lights. the largest were the blue and whitelights with the blue lights being the brightest. at the ends, smaller in size,were the red and green lights just as bright in intensity. the lights emittedextremely bright camera-flash style strobe flashes moving right to left in afront to rear motion headed in a north-northeastward direction. the colorsseemed to change position. they gave the impression of a cigar shaped object. the lights moved into a cloud bank and he could see the reflection of the lightsstill moving inside the cloud. the lights left the cloud and slowly went out ofsight maintaining the same altitude in a straight line course. dg said thelights were as bright as the moon and probably aspirin tablet size at armslength. he estimated the speed at 70-75 mph and said the lights were brighterthan two airplanes they saw later on the way home. witness jh has the same basic story. saw three white flashing lights whichflashed in a line from right to left and moved in a straight flight parallel tothe car in a w to e direction. he estimated the lights to be 1-2 miles highmoving at a speed of 150-200 mph. no noise and no physical shape noticed. heestimated the length of the light to be two car lengths (chevettes). he statedthe lights never went behind any clouds.kh states that he noticed a bright white light in the sky which seemed to bemoving in a zig-zag motion towards the southeast. he said the lights seemed toraise in elevation as it came toward them though it did not pass over them. after a while the lights gradually sped up and faded off into the easternhorizon. he saw the lights for a period of 5-6 minutes. he states they werebright and constant, no flashing. he also states the lights did not passthrough any clouds during the sighting."],"Object Flight Path":"Straight-line path","City":"Swartz Creek","Region":"Michigan","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=42.965651,+-83.822834(1745)&iwloc=A&hl=en\"> mufon case (1745) map </A>","Log Number":"","files":["/var/www/straped/mufon/html2text/1745.html.txt","/var/www/straped/mufon/org/1745.html"],"Case Number":"1745","Date Submitted":"04/26/1989 10:40 UTC","Sighting Duration":"00:10:00","Tags":"City","Object Shape":"Oval","Object Features":"Undisclosed","Date of the Event":"04/26/1989 10:40 UTC","Longitude":"-83.822834","Country":"United States"}