{"Source":"MUFON","Region":"California","Latitude":"33.563144","trends":["There have been 7 other sightings in Murrieta","There were no other sightings in Murrieta on or around June 7th 2009"],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17463.html.txt","/var/www/straped/mufon/org/17463.html"],"Longitude":"-117.210613","Log Number":"US-06132009-0011","Object Features":"Other","Date of the Event":"06/07/2009 02:15 UTC","Object Flight Path":"Other","Summary":"Over house at 2500 ft, went up.","Sighting Duration":"00:03:00","Weather Factors":"Windy, Light","divs":["Sighting DetailsI was standing in the back yard. Looked up to a see flying object at aprx 2500 ft moving north east. Object was silver, had very bright light on (one or two). Was flying erratically. Suddenly reversed direction, came back towards my location. I had a very clear view of the object, although it was flying silently. I could not get an accurate estimate of its size since I didn't know its exact altitude. It may have been fifty feet long. About that time it started climbing straight up at a tremendous rate of speed until it disappeared into the clouds. (It was not an airplane, nor a blimp, nor a helicopter.) 1. I was in the back yard trying to fish a frog out of the swimming pool. 2. I saw a reflection of the flying object in the water. 3. Initially I thought it was a balloon, then I realized it didn't fit the description. No shroud lines. Somewhat erratic behavior. When it elevated in altitude, it went straight as an arrow. 4. It moved erratically, possibly as a result of wind currents. It went up at unbelievable rate. 5. I strongly suspected I had seen a \"flying saucer.\" I have been around aircraft all my life. 6. Disappeared into the clouds."],"City":"Murrieta","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","Date Submitted":"06/07/2009 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.563144,+-117.210613(17463)&iwloc=A&hl=en\"> mufon case (17463) map </A>","Object Shape":"Cylinder, Oval","Case Number":"17463"}