{"Disposition":"Unknown","Region":"Missouri","Weather Factors":"Unknown","Summary":"Sightings almost every night for about a year.","map":"<A HREF = \"http://maps.google.com/maps?q=39.016951,+-94.281615(17466)&iwloc=A&hl=en\"> mufon case (17466) map </A>","Date Submitted":"04/10/2004 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Tags":"City","trends":["There have been 28 other sightings in Blue Springs","There were no other sightings in Blue Springs on or around April 10th 2004"],"Latitude":"39.016951","files":["/var/www/straped/mufon/html2text/17466.html.txt","/var/www/straped/mufon/org/17466.html"],"City":"Blue Springs","Viewing Distance":"Unknown","divs":["sighting detailsmy house is between grain valley and blue springs, we are rural enough that we can see the night sky clearly, especially to the south\\southeast. we have a small pond to our south and sit facing there to chat on spring and summer evenings we first discovered what we thought was a satellite, but realized after a couple of minutes that it was pulsating, varying shades of color and degrees of light output. it also made darting movements that would be impossible to recreate in any known aircraft. it remained far away, but reappeared every night in the same general direction. the best parts were when it would appear early, during twilight and was very easily visible. those were the times when it seemed to be pursued by military aircraft. they would \"buzz\" the object(and our house)in combat formations and we could watch the object dart in a different direction, as if playing with the pilots. we have 3 generations of former military personell in this home, so we consider ourselves objective. i have always maintained that this is a ufo, only because it is unidentified to me. aside from the encounters the aircraft had with this object, it did seem reasonable that it could be a test aircraft of some kind, and even if it was something from outside this world, i am confident that the military does know it was here."],"Sighting Duration":"Undisclosed","Object Shape":"Fireball, Flash, Sphere, Star-like, Other","Source":"MUFON","Log Number":"US-06132009-0014","Longitude":"-94.281615","Date of the Event":"04/10/2004 12:00 UTC","Country":"United States","Case Number":"17466"}