{"Weather Factors":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/17462.html.txt","/var/www/straped/mufon/org/17462.html"],"Latitude":"40.344078","Date of the Event":"02/01/2009 05:45 UTC","Log Number":"US-06132009-0010","divs":["Sighting DetailsI posted this account on our RIPS (Reading Investigators of Paranormal Studies) MySpace and asked if anyone had had a similar experience. To date...no response. However, at our last meeting a fellow member brought to our attention that an article was published in March in our local paper concerning several sightings in and around the Berks area in the early months of 2009. After reading this account, we decided to report this event. This is what I wrote on the RIPS MySpace blog in February 2009... Ok guys...this is just amazing. But I DO trust my husband and he has NEVER in my 34+ years of being with him has he ever been untruthful...teasing, sometimes boastful...but never a liar!!! This morning at 5:45 he let the dogs out for their morning 'piss call'. He went back inside to prepare Diego's insulin shot. While watching the dogs through the kitchen window 'do their thing' he noticed a single bright light, moving slowly about tree-top height just below and beyond our lower yard. Being so near the airport, he thought at first it was a plane in trouble. He went outside to get the dogs and view the light further. It was then that he saw a form....yes...saucer shaped with a dome in the upper mid center. He didn't have his glasses on or any appropriate clothing to fully investigate it but he did see enough of it to describe its shape and its path of travel. The light was NOT a beam shining downward NOR did it shine outward but the light did illuminate the saucer's shape from the edges. The form was level and hovering momentarily and silently at tree-top height. It then moved toward and over the neighbor's house when its light went out and disappeared. Curiously, Diego is forever barking at planes and birds that fly over and near the house, but not this time. In fact, both dogs never even reacted to it. Later in the day he walked down to the area but nothing seemed to be 'out of place' or disturbed. He is still shaking his head in disbelief and I only wish I had been awake and downstairs to witness it too!!! I just wonder if others had seen or spotted something unusal in the skies of late."],"Object Features":"Dome, Window(s)","trends":["There have been 42 other sightings in Reading","There was one other sighting in Reading on or around February 1st 2009"],"Longitude":"-75.920545","Disposition":"Insufficient Data","Country":"United States","Sighting Duration":"Undisclosed","Case Number":"17462","Viewing Distance":"101-500 Feet","Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=40.344078,+-75.920545(17462)&iwloc=A&hl=en\"> mufon case (17462) map </A>","Summary":"Disc shaped saucer w/dome illuminated by white/yellow light, sometimes intense and pulsating. Also viewed round 'bubbled' windows on the saucer's angled surface of the saucer area.","Region":"Pennsylvania","Source":"MUFON","Date Submitted":"02/01/2009 05:45 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Reading"}