{"Object Shape":"Star-like","Case Number":"17460","Longitude":"-115.685718","map":"<A HREF = \"http://maps.google.com/maps?q=43.13401,+-115.685718(17460)&iwloc=A&hl=en\"> mufon case (17460) map </A>","Object Features":"Undisclosed","Summary":"Star crossing night sky makes right angle turn.","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"02/15/1979 12:00 UTC","divs":["Sighting DetailsThis is an old story, but true. While I was stationed at Mountain Home Air Force Base, Mt. Home, Idaho, I and a friend, who was an Iranian Air Traffic Control exchange student (he was in the Iranian Air Force), was walking outside our dormitory and looked up at the sky and saw what we thought was a star, going across the night skyline. At first we thought maybe it was a satelite, it was deep in the sky, appeared to be star like. As we continued to watch it cross the sky, it took a sharp right angle turn. Nothing we knew of could have made such a turn, that deep into space. I don't know how high it was, but it was out of our atomosphere and seemed to be deep into space. It was an extremely clear, dark night and the sky was lit up with stars. I do not remember the Iranian's name, but I believe his nickname was \"Sam'. He and his fellow student left just after the fall of the Shah of Iran and I think they just disappeared into the US somewhere as Sam said he would not go back. The date and time are very approximate, it may have been 1978, but it was so remarkable that I have never forgotten it. We both thought the object was not of this world."],"Region":"Idaho","Date Submitted":"02/15/1979 12:00 UTC","Country":"United States","Tags":"City","Log Number":"US-06132009-0008","Weather Factors":"Unknown","City":"Mountain Home","Object Flight Path":"Undisclosed","Latitude":"43.13401","Disposition":"Unknown","Source":"MUFON","trends":["There have been 3 other sightings in Mountain Home","There were no other sightings in Mountain Home on or around February 15th 1979"],"files":["/var/www/straped/mufon/html2text/17460.html.txt","/var/www/straped/mufon/org/17460.html"]}