{"City":"Breckenridge","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"06/12/2009 11:50 UTC","divs":["Sighting DetailsI've already spoken with a local MUFON investigator and was told I should report this. On Friday, June 12, at 11:50 p.m. CDST, I was looking at the stars and noticed one that appeared to fade then brighten. I thought maybe it was due to my binoculars, so I lowered them and looked again. Sure enough, the light would fade almost completely, then it would brighten again. The pattern was as follows: Bright for 10 seconds, dim to almost nothing for about 3 seconds, brighten again for 10 seconds, and so forth. The light, which was approx. the same magnitude as Sirius but half the size in appearance, was 70 degrees above the ENE horizon. Looking at it through binoculars it looked as though 2 white lights were stuck together, side to side. It did appear as though the light was moving ever so slightly in an Easterly direction. I watched this light for a few minutes then began scanning the Northern sky. It was then that a (black shadow) triangular object flew almost directly over my head, in a West to East heading. My best guess would be that it was 500 ft. (or more) in elevation and the size of a soccer ball held at arms length. It was totally silent, with no lights at all. The reason I saw it was due to the fact that the object appeared darker than the night sky behind it, and that the shadowy form blocked out the stars. I only saw it for about 2 seconds, long enough for it to \"register\". Since I can not give a definitive altitude of the object, I won't speculate it's speed. I can say that the triangular shape even, with what appeared to be rounded points at each end. When I looked again for the light that had been dimming, it was gone. The time was now 12:05 a.m., June 13, 2009. I will be speaking with the MUFON investigator again tomorrow and will give her a full report, as well as the drawing of what I saw. 1. Where were you and what were you doing at the time? Star gazing in my back yard. 2. What made you first notice the object? I first noticed the dimming, star-like object, then felt the need to scan the sky. I was about to turn my attention back to the star-like object, when I saw the dark triangular object. 3. What did you think the object was when you first noticed it? At first I thought the light was a star, until it moved. When I saw the second object I knew it was not any type of airplane that we have locally. 4. Describe the object and its actions and motions. See description above. 5. Describe your feelings, reactions and actions, during and after sighting the object. At first I felt somewhat surprised, which then turned to concern. 6. How did you lose sight of the object? Both object simply vanished."],"files":["/var/www/straped/mufon/html2text/17468.html.txt","/var/www/straped/mufon/more/17468_submitter_file1__6-12-09-triangle.jpg","/var/www/straped/mufon/org/17468.html"],"Longitude":"-98.89249","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"Texas","Disposition":"Unknown","Weather Factors":"None","Object Features":"Unknown","Case Number":"17468","Object Shape":"Star-like, Triangle","Summary":"Two objects seen, 1 star-like and the other a black triangle that flew over my house.","Log Number":"US-06132009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=32.759667,+-98.89249(17468)&iwloc=A&hl=en\"> mufon case (17468) map </A>","trends":["There have been 16 other sightings in Breckenridge","There was one other sighting in Breckenridge on or around June 12th 2009","This sighting has never been favorited.",""],"Latitude":"32.759667","Date Submitted":"06/12/2009 11:50 UTC","Country":"United States"}