{"files":["/var/www/straped/mufon/html2text/17479.html.txt","/var/www/straped/mufon/org/17479.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.806775,+-96.761503(17479)&iwloc=A&hl=en\"> mufon case (17479) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around June 13th 2009"],"Tags":"City","Case Number":"17479","Longitude":"-96.761503","Object Shape":"Star-like","Object Features":"Unknown","Date Submitted":"06/13/2009 01:30 UTC","Summary":"Seen a jet or plane following a bright orange/red object at seemingly high altitude.","City":"Dallas","divs":["sighting detailsjust got off of work and was in the parking lot, was looking up at the sky and noticed a plane or jet ( had normal flashing lights and a few extra flashing white lights in the position as to where the wings would be) was following a bright red\\orange spot or light that was staying solid in color. the plane or jet kept a constant distance, the red\\orange light would turn rather sharply and the plane would follow, but turning at a more gradual rate. i watched this go on for a couple of minutes as the red\\orange light would continue to zig zag and the plane or jet would follow. at one point the plane or jet appeared to get close to the red\\orange light and the light quickly increased the distance between them. i watched it go on until i could not see the two any long as they disappeared going north west from south east. there was not any sound to be heard which i am sure was due to the high altitude. also at arms length the two appeared about 2 inches apart. i just thought this was unusual. i have seen many aircraft in the sky but have never witnessed anything like this. just thought it was strange. thought you would like to hear about it."],"Object Flight Path":"Path with directional change","Region":"Texas","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unknown","Country":"United States","Source":"MUFON","Latitude":"32.806775","Log Number":"US-06142009-0005","Date of the Event":"06/13/2009 01:30 UTC","Weather Factors":"None"}