{"Longitude":"-81.684819","trends":["There have been 3 other sightings in Morganton","There were no other sightings in Morganton on or around June 12th 2009","This sighting has never been favorited.",""],"Object Features":"Unknown","Sighting Duration":"01:30:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.745407,+-81.684819(17471)&iwloc=A&hl=en\"> mufon case (17471) map </A>","Disposition":"IFO","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"06/12/2009 10:30 UTC","Source":"MUFON","Country":"United States","Latitude":"35.745407","Date Submitted":"06/12/2009 10:30 UTC","Region":"North Carolina","Case Number":"17471","Tags":"City","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/17471.html.txt","/var/www/straped/mufon/org/17471.html"],"Weather Factors":"None","City":"Morganton","Log Number":"US-06132009-0019","Summary":"Observed a bright white-orange light seemingly over Morganton while on Brown Mountain Overlook.","Viewing Distance":"Over One Mile","divs":["Sighting DetailsOn June 13, 2009 myself and 3 friends decided to take a trip from Boone,NC to Brown Mountain to see the famous Brown Mountain Lights. We arrived at Brown Mountain Overlook at approx. 10:30pm. This was the first time any of us had ever been to this site and were immediately taken back by the frequency of the lights and the brightness. Aftert aking a short walk away from the rest of my friends to relieve myself, I turned back to face the group to begin walking back and noticed a very bright light that appeared to be over Morganton. The city is approx. 15miles away from the Overlook and only the brightest lights and a few radio tower lights are visible. It was a very clear night with 1 Thunderstorm way off in the distance just to the right of Brown Mountain as you look from the overlook. At once I started asking my friends what they thought this light was. It was absolutely NOT a plane as there was heavy airplane traffic that night, and we had already observed numerous airplaines traveling over and across the sky in front and behind us. This light was brighter than anything else in the sky and was a white-orange in color. I did not appear to move horizontal or vertical and was well above the height of any of the towers in the city visible in the distance. Just all all 4 of us were starting to watch it and guess what it was, the light suddenly just went off. The light did not shoot away, it simply just went off like a light bulb would. Our first reaction was shock, I personally had a cold chill run down my back and had goose bumps on my entire body. We all stood there in disbelief but quickly turned out attention back to the Brown Mountain lights which were very active. Approx. 25mins later the light reappeared over Morganton, this time not quite as bright and a little bit farther to our left and it stayed for approx. 2mins before just disappearing as it did the first time. Approx. 30-40mins after this, the light re-appeared in about the same position as it had appeared the 2nd time only this time it moved as we watched it towards our left and seemed to just move away until I could no longer see it. By this time we were all basically in shock at what we were seeing and just stood there unable to really say anything, mouths wide open. We were just about to leave as it was getting towards midnight and we had a bit of a drive back to Boone when the object appeared again this time to the far right of the visable part of the city from where we were on the overlook. This time we all pretty much thought it might be a plane by the way it looked until it just simply went from being the brightest thing in the sky to gone in the blink of an eye. We attempted to get pictures with our cell-phones and with my friends digital camera but with no results."]}