{"files":["/var/www/straped/mufon/html2text/17478.html.txt","/var/www/straped/mufon/org/17478.html"],"City":"Spooner","Summary":"Very close bright red green blue with pulsating loud noise and rotating.","Object Flight Path":"Undisclosed","trends":["There have been 5 other sightings in Spooner","There were no other sightings in Spooner on or around June 13th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","divs":["Sighting DetailsTonight I was out watching the stars again and potographing any thing that might show up. My flash on the camera, which is quite useless in most respects for night time photography has indeed caught several abnormal and fluke photos in the past. Who knows what they where, bursts of light, fire flys or whatever could be debunked..but I am facinated on what the lense has captured in the past. I had taken a series of photos into the same constelation of corona borealis outside of Vega and within 5 minutes I heard a thunderous pulsating noise unlike anything I had ever heard before, keep in mind I have been in flight school and do fly so I know all sounds of aircraft. I heard coming from the north a immensley loud pulsating noise and above the tree tops saw an object with red green and blue blinding lights. It rotated just above me and I tried to take photos the entire time but mone would show what I saw. It was beautiful and spectacular..It was very big and larger than a normal aircraft..it was not anything I have ever known in pilot school and did not obey our flight pattern above our airspace. it was a free moving object and very powerful. I dont know what I saw but it was magnificient and I felt the really knew I was watching. What I saw was so powerful and unique. I would never dispute it as being nothing less than abnormal from what we know"],"Sighting Duration":"00:02:00","Disposition":"Unknown","Region":"Wisconsin","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-91.884053","Object Shape":"Unknown","Tags":"City","Country":"United States","Log Number":"US-06142009-0004","Date of the Event":"06/13/2009 11:30 UTC","Case Number":"17478","Object Features":"Undisclosed","Date Submitted":"06/13/2009 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.828658,+-91.884053(17478)&iwloc=A&hl=en\"> mufon case (17478) map </A>","Latitude":"45.828658"}