{"Region":"England","Country":"United Kingdom","map":"<A HREF = \"http://maps.google.com/maps?q=53.202352,+-2.883535(17482)&iwloc=A&hl=en\"> mufon case (17482) map </A>","Viewing Distance":"Unknown","City":"Chester","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"GB-06142009-0008","Date of the Event":"06/14/2009 07:35 UTC","files":["/var/www/straped/mufon/html2text/17482.html.txt","/var/www/straped/mufon/org/17482.html"],"Source":"MUFON","Longitude":"-2.883535","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Chester","There were no other sightings in Chester on or around June 14th 2009"],"Date Submitted":"06/14/2009 07:35 UTC","Latitude":"53.202352","Object Features":"Unknown","Case Number":"17482","Summary":"Spinning disc high up in the sky, sun must have reflected on it as it spun. Seemed to stay same place then covered in cloud.","divs":["Sighting DetailsWas outside brushing path and then sat down to have a drink. I always look up to the sky. I watched a plane going over toward Liverpool Airport when a shining reflection just underneath caught my eye. The object seemed quite far away in the distance at a guess it was probably over Liverpool Airport. From the way it was reacting in the sky it seemed to be spinning at a guess a \"disc\" shape object and I presumed the sun was reflecting on the object. My house was in the shade by then but could see the sun shining that way. I thought that a plane couldnt stay in the same place and to me it would be too high up to be a helicopter but it didnt look like that, it semed the whole object was spinning not just the blades. I've watched the Space shuttle go over and that really moves throught the sky but this seemed to stay in the same place. I wanted to call someone out of the house or get a camera but didnt want to loose sight of it and was trying to work out what it could possibly be when cloud came over and it was gone. It probably only lasted for about 3 minutes from when I noticed it to the cloud coming over. Went in to get my daughter and we came out to see if we could see it again but couldnt. The only thing I can think of that hovers is a helicopter but to me this seemed too far up. Just wondered if anyone else reported something."],"Object Shape":"Disc","Disposition":"Unresolved"}