{"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:30:20","Longitude":"-99.09289","Log Number":"MX-06142009-0015","Date of the Event":"02/06/2009 09:11 UTC","Summary":"A circle around object with fashing ligths.","Tags":"City","Case Number":"17489","Disposition":"Unresolved","divs":["Sighting DetailsMy mother and I were on my grandmothers house at dinner; aproxximetaly that week my sister needed an injection for her operation so we were leaving at 9 o clock, more or less, and before we made it into the car my mother saw a circle obje ct with flashing ligths above us, it was enormous, at least at our point of view, we really didnt freak out because it was like we were interested, we like UFOs investigations and we dont scare easily but it was weird. After a few minutes we jump in the car and went to the doctor for my sister injection and the hing was there moving in circles left and rigth but not in direction but his body was moving, some dogs passing by bark at the sky and my grandmother, who accompany us, was like esceptic saying that maybe it was some of the games in a nearby park that were making the lights effect, I went to investigate if that was true qhile my sister was battling. The result is that I didnt find any game at the park, tehre was some of em but they were not working so that wasnt the cause. My grandmother didnt believe me but my mother know I wasnt lying, after a while she told me to stop seeing that and concetrate in other things. When we were going back from the doctor it wasnt there any more but I knew what I saw."],"map":"<A HREF = \"http://maps.google.com/maps?q=19.24995,+-99.09289(17489)&iwloc=A&hl=en\"> mufon case (17489) map </A>","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/17489.html.txt","/var/www/straped/mufon/org/17489.html"],"trends":["There have been 3 other sightings in Distrito Federal","There were no other sightings in Distrito Federal on or around February 6th 2009"],"Object Shape":"Fireball, Saturn-like","Latitude":"19.24995","Object Flight Path":"Stationary","Country":"Mexico","Weather Factors":"Fog","Date Submitted":"02/06/2009 09:11 UTC","Region":"Distrito Federal","City":"Distrito Federal"}