{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","Case Number":"17488","trends":["There have been 39 other sightings in Erie","There were no other sightings in Erie on or around June 14th 2009"],"Log Number":"US-06142009-0014","divs":["sighting detailsi was fishing on lake erie, crystal clear calm day over the lake, some light cumulus clouds over both us and canadian shores, no clouds over the lake. while watching a jet with a noticable contrail fly across the sky i noticed a bright starlike object about 1\\4 of the way from the jet to the horizon moving parallel and in sync with the jet without a contrail and no plane like shape. at first i thought it was another plane reflecting sunlight and then realized that it didn't have any plane shape. this continued for about 30 seconds when the object stopped for a about 10 seconds while the jet continued on. the object then changed course at an angle (no arc) and flew about 3\\4 of the way to the northern horizon of the lake where it stopped again. suddenly the object moved very quickly (at speeds incapable of a plane) back towards the west where it slowed again, stopped and then headed due north out of sight. there was no sound or contrails at all and i could hear the jets passing at cruising altitude. i took my sunglasses off and checked to make sure there were no reflections. my friend saw it for only a few seconds before he lost it as he didn't have his prescription glasses on. i had no difficulty seeing it, it appeared a a star just after daybreak. but this was mid day and nearly straight over head. i've never seen anything like this before and i'm confident that it was no normal aircraft. i was really disappointed i had forgot my binoculars in my truck."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/17488.html.txt","/var/www/straped/mufon/org/17488.html"],"City":"Erie","Object Shape":"Star-like","Disposition":"Unknown","Summary":"Star like object shadowing a jet over lake erie in the middle of the day!","Latitude":"42.131614","Date Submitted":"06/14/2009 01:13 UTC","Date of the Event":"06/14/2009 01:13 UTC","Viewing Distance":"Over One Mile","Country":"United States","Weather Factors":"Unknown","Longitude":"-80.080769","map":"<A HREF = \"http://maps.google.com/maps?q=42.131614,+-80.080769(17488)&iwloc=A&hl=en\"> mufon case (17488) map </A>","Region":"Pennsylvania"}