{"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Region":"Oregon","Viewing Distance":"Unknown","Case Number":"17485","Longitude":"-123.333392","City":"Murphy","trends":["There have been no other sightings in Murphy","This sighting has never been favorited."],"Date Submitted":"06/12/2009 09:15 UTC","Weather Factors":"Windy, Lightning, Light","Tags":"City","Latitude":"42.347618","Summary":"White triangle with outside glow around it.","Country":"United States","Date of the Event":"06/12/2009 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.347618,+-123.333392(17485)&iwloc=A&hl=en\"> mufon case (17485) map </A>","divs":["Sighting DetailsI was driving home looking east into the sky because there were many thunder heads for we were in the middle of a thunderstorm. I was attracted to a very dark cloud to the east. I noticed a white triangular object on the right hand corner of the cloud. I was thinking it must be a cloud within a cloud for it had a glow around it within the black cloud and was slowly desipitating. I thought at the time that is very strange little cloud within that cloud. I was speaking to my son and he said that there are white triangular ufo's. He showed me one on the internet. I said, \"thats exactly what it looked like\". Just like the pic he showed me. I was astounded that I actually saw a white one. I have seen black triangular ones with three lights underneath but this one had the point of the triangle upward instead of seeing it flying flat over my head. It appeared to be going straight upward. Looking like such ^ . It eventually just disappeared. I kept thinking how strange it was but thought it was my imagination and wasn't going to say anything. My son suggested I report it to Mufon."],"files":["/var/www/straped/mufon/html2text/17485.html.txt","/var/www/straped/mufon/org/17485.html"],"Object Features":"None","Object Flight Path":"Stationary","Object Shape":"Triangle","Log Number":"US-06142009-0011"}