{"Sighting Duration":"Undisclosed","Region":"Minnesota","Case Number":"17495","Disposition":"Unknown","Log Number":"US-06152009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=44.856416,+-93.468586(17495)&iwloc=A&hl=en\"> mufon case (17495) map </A>","City":"Eden Prairie","Country":"United States","Summary":"Low slow moving triangular object.","divs":["sighting detailsi decide to go out on the balcony to have a smoke break and about half way through the smoke i get this feeling of something above me, like the feeling of someone moving up behind you very stealthily. so i look up and i see one light moving i would say about 25 - 35 mph over head about 3\\4 as high as a helicopter would fly over usually as the do pretty often. this was no helicopter so i leaned out and looked up and this object was low enough were i could see it's outline and the lights at the tip of each triangular point. i didn't see it for long but long enough in the low light of the city to tell its shape (triangular) color (grey\\blue) and that it had no identifying marks on its underside, i was not able to see it's top side as the complex is l shaped and it passed beyond my line of sight. the object made no noise what so ever. i have seen many things that could have been or were most certainly ufos. i have had them shine blue light on my vehicle as i was driving in the past but this one was the creepiest yet. it didn't even care that it was totally visible. did anyone else see this thing? i keep up on military air craft and this one was none of those that i had heard of. the closest is the navy's new unmanned bomber this thing was probably the right size but i can't believe it would be totally silent (jet engine) and able to move so slow. this thing was blatant. like a big f you guys, i'm here."],"Longitude":"-93.468586","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Latitude":"44.856416","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Date of the Event":"06/15/2009 01:10 UTC","Object Features":"None","Date Submitted":"06/15/2009 01:10 UTC","Source":"MUFON","trends":["There have been 4 other sightings in Eden Prairie","There were no other sightings in Eden Prairie on or around June 15th 2009"],"files":["/var/www/straped/mufon/html2text/17495.html.txt","/var/www/straped/mufon/org/17495.html"],"Weather Factors":"None"}