{"Object Features":"Unknown","Date of the Event":"04/30/1984 12:00 UTC","files":["/var/www/straped/mufon/html2text/17499.html.txt","/var/www/straped/mufon/org/17499.html"],"Sighting Duration":"00:07:00","Disposition":"Insufficient Data","Latitude":"32.720179","Log Number":"US-06152009-0008","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around April 30th 1984"],"Object Flight Path":"Stationary,Unknown","Case Number":"17499","Object Shape":"Disc, Other","Country":"United States","Summary":"Silver/gray football large over center of downtown S.D.1000ft+up early 80's.","Tags":"City","Date Submitted":"04/30/1984 12:00 UTC","Longitude":"-117.150705","Region":"California","Weather Factors":"Unknown","City":"San Diego","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.720179,+-117.150705(17499)&iwloc=A&hl=en\"> mufon case (17499) map </A>","divs":["sighting detailsin my teens early 1980s saw a ufo from my yard it was over the center of downtown san diego i couldnt have been the only one,bet it was seen by north island and lindberg field eyes and radar!even after getting my fathers glasses he still wouldnt stop gardening to look.i didnt see it arrive ,move or leave it was already there, but gone 5+ mins later secounds after i found binoculars upstairs.that was scary and when i looked out upper window and could not see it for miles in any direction from over downtown!fast!200ftwide or so 75ft thick or so not to high over ground 3500ft max.some what dull silvercolor, football shaped side view probably cirle top\\bottom view.i bet more will be seen in future,history channel ufo hunter show had a lady in great lakes say she saw a gray football like ufo with black triangular objects around or under it! scouting was also said.also less believable same show man walking in forrest in stepenville texas? recently spooked one said it may have been spying on people??no but was probably right on the its empty comment,also it flew away at odd angle+he saw indentations on bottom side, very telling i imagine they could be stacked in cyl\\colum or seated\\stabalized on those indents when landed at home?i think 99% of sightings are fake or wrong.."],"Source":"MUFON"}