{"City":"Gypsum","Object Features":"Unknown","trends":["There have been 2 other sightings in Gypsum","There were no other sightings in Gypsum on or around June 13th 2009"],"Date of the Event":"06/13/2009 11:30 UTC","Latitude":"39.65252","Weather Factors":"Does Not Apply","Longitude":"-106.948081","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.65252,+-106.948081(17491)&iwloc=A&hl=en\"> mufon case (17491) map </A>","Tags":"City","Date Submitted":"06/13/2009 11:30 UTC","Sighting Duration":"00:05:00","Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Case Number":"17491","Region":"Colorado","divs":["sighting detailswe; [cms\\tg\\pid] were camping at leeds reservior in gypsum, co from friday june 12th until sunday june 14th 2009. on the night of saturday june 13th we were sitting around the campfire and we were looking up at the stars, since it has been our first clear sky in like about 2 and a half weeks. anyhow, i (lucas) noticed two very bright lights travelling side by side very slowly across the sky. i pointed it out to my father (louie) and we all stood there and watched. it was 2 very bright lights exactly alligned as if they were on the ends of either side of whatever craft it was . the lights were not blinking, just a very very bright white. we were all watching this for a bout 2 minutes and it stopped moving. i immediatly grabbed the camera but couldn't figure out how to make it shoot video, because i knew the photo wouldn't have picked anything up. i couldn't figure it out. it was just hovering there for about a minute or so and then it began to rotate. it turned so that the lights were now one on top and one underneath, but still maintained the exact same distance between eachother as when they were side by side. it moved up a little then northbound again. then hovered again for about another minute, returned to it's original sideways position, and moved slowly northbound again and just seemed to dissapear in the night sky. we were a little wierded out and excited all at once."],"Viewing Distance":"Over One Mile","Summary":"2 bright lights, slowly moved accross the sky northbound, then stopped and hovered for a minute.","Log Number":"US-06142009-0017","files":["/var/www/straped/mufon/html2text/17491.html.txt","/var/www/straped/mufon/org/17491.html"],"Object Shape":"Other"}