{"City":"Mason","divs":["Sighting DetailsI was coming out of a friends house at about 12:30am early morning on Sunday, June 14th 2009. We had just finished up our weekly band practice and as I was walking to my truck I glanced up to look at the clear night sky and noticed what I believed to be the 'Little Dipper' and at that instant I saw a flash of white light, kind of like a photo flash. Thinking it was a high alltitude plane I kept watching for more lights but didn't see another flash until 5 or 6 seconds later. To give you a perspective of my point of view, as I look at the little dipper, the handel is to my left and the cup is to my right. The first flash I saw was a dime at arms length away to the right of the top edge of the cup. The next flash happened directly next to and underneath the handle but the third flash was a quarter at arms length away and above from where the handle and the cup meet, so basicaly this thing back tracked to form a triangular flight pattern and all three flashes were about 5-6 seconds apart and were \"flashes\" not \"streaks\". At this point I got the attention of two of my band mates to watch these flashes of light but we only saw one more that was about 12 inches to the left at arms length away from where I saw the last one. There was no noise and the sky was very clear."],"Date Submitted":"06/14/2009 12:30 UTC","Disposition":"Insufficient Data","Tags":"City","Country":"United States","Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=39.368189,+-84.302979(17496)&iwloc=A&hl=en\"> mufon case (17496) map </A>","Log Number":"US-06152009-0005","trends":["There have been 5 other sightings in Mason","There were no other sightings in Mason on or around June 14th 2009"],"files":["/var/www/straped/mufon/html2text/17496.html.txt","/var/www/straped/mufon/org/17496.html"],"Latitude":"39.368189","Date of the Event":"06/14/2009 12:30 UTC","Longitude":"-84.302979","Weather Factors":"Unknown","Case Number":"17496","Viewing Distance":"Unknown","Object Features":"Undisclosed","Region":"Ohio","Summary":"Four flashes about 5-6 seconds apart.","Source":"MUFON","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed"}