{"Sighting Duration":"Undisclosed","Object Shape":"Oval","Latitude":"32.701791","Log Number":"US-06152009-0015","divs":["sighting detailsmy friend sally noticed the object about 15\\20 minutes before me but said nothing until i noticed it. we tracked the object for 40 minutes until the road turned and the object staying stationary, was now behind us and could no longer be visible. i have pictures taken of the object a couple of times during the duration of the observation. at first the object seemed closer to the highway when i first noticed it at 7:39 p.m.(perhaps 10 to 20 miles away) but towards the end of the timeframe, seemed much farther away. the object was dark, no reflection or lighting of any kind. a helicopter or plane would have had lights on it and would not be hovering at the same altitude, in the same location for 40 minutes. the object was very large considering the distance and was oblong in shape. there were no lights of any kind. when we stopped along the freeway to take the pictures with my digital camera, the object never moved. the object was watched until 8 p.m. even though the sun had set by this time, the object never became \"lit\". i have seen many ufo's but never during daylight and never without lights. did anyone else report this? is it common to have reports in the desert between gila bend and yuma of ufo's? please contact me. location: 100+ miles out of yuma, arizona traveling from gila bend towards yuma. i was the passenger, my friend sally was the driver. i first noticed the object because of the vivid \"sun dog\" that was visible in the sky to the left of the sun. from the first moment i saw the object, i felt that it was a ufo because of the hovering, no lights with the sky continuing to darken as the sun was setting, the duration of the observation and no movement by the object when we stopped to take the digital camera pictures. my feelings were of curiosity and to observe as many details as possible to hopefully find out if anyone else saw it. i have seen many ufo's before, but always at night and with lights. when the highway changed direction, the object was lost from sight due to the object's stationary position. photos are available but i don't have internet."],"Summary":"Oblong shape over desert between Gila Bend & Yuma, AZ for 40 minutes.","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Date of the Event":"06/14/2009 07:39 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/17506.html.txt","/var/www/straped/mufon/org/17506.html"],"Date Submitted":"06/14/2009 07:39 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.701791,+-114.623372(17506)&iwloc=A&hl=en\"> mufon case (17506) map </A>","Case Number":"17506","Region":"Arizona","Disposition":"Unknown","City":"Yuma","Longitude":"-114.623372","trends":["There have been 27 other sightings in Yuma","There were no other sightings in Yuma on or around June 14th 2009"]}