{"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17518.html.txt","/var/www/straped/mufon/org/17518.html"],"Tags":"City","Case Number":"17518","divs":["Sighting DetailsA glimmer of light caught my eye from my kitchen and i caught 5 photos from inside the window. these show ta star pattern which is the screen reflecting, so I went outside and investigated. I could see this light with the unaided eye for over twenty minutes, taking pics for ten. This object seemed to be between me and the bushes, but if i went towards it, it vanished. It would return when i gave some room. The pics i took, and two videos are all with different settings and focus for a variety of views. It was flashing so some don't show it as intense as others. The AVI files i included are probably the best evidence of what I actually saw. I went over to the bushes multiple times and found nothing which could explain these lights. My wife, and best friend also investigated after i showed them the photos and videos i am sending you, all without any explanatory findings I dont know what this is, but it is weird. Thank you. Jimi Hughes PS, i am available for contact, but only through confirmation by MUFON reps. I do not want 3rd party reps calling my house directly."],"Region":"Montana","Viewing Distance":"20 Feet or Less","Object Shape":"Circle, Flash, Sphere, Star-like","trends":["There have been no other sightings in Conrad","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=48.172778,+-111.947222(17518)&iwloc=A&hl=en\"> mufon case (17518) map </A>","Object Features":"Unknown","Log Number":"US-06162009-0007","Object Flight Path":"Stationary","Source":"MUFON","Summary":"A light in my yard in the bushes 7 am June 9, 2009.","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"06/09/2009 07:00 UTC","City":"Conrad","Date of the Event":"06/09/2009 07:00 UTC","Longitude":"-111.947222","Weather Factors":"Unknown","Latitude":"48.172778"}