{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"New York","City":"Kingston","Date Submitted":"07/31/2008 12:00 UTC","Object Shape":"Sphere","Disposition":"IFO","Weather Factors":"Windy, Lightning, Light","files":["/var/www/straped/mufon/html2text/17513.html.txt","/var/www/straped/mufon/org/17513.html"],"divs":["Sighting DetailsI just remembered an event that occured last summer while watching a severe thunderstorm blow through our area. The most recent thunderstorms we've been having this year rekindled this memory. It was late in the summer, August from what I can remember. I was looking out my glass doors off the deck watching a strong storm pass through. It was VERY windy and there was alot of inter cloud lightning. I was amazed while watching this storm, the clouds were moving exceptionally fast and the torrential rain was somewhat subsiding even though the lightning strikes and wind were intensifying. This is when I noticed a blinking white light zooming in and around the clouds. I immediately thought, \"Oh my god what is that plane doing in this storm?!\" As the \"blinking light\" got closer I noticed it was round and in between the flashes of lightning and it's blink-glow, the object was silvery and shiney...almost reflective from the lightning flashes. I was amazed, a little frightened and a little upset that my husband wasn't home to confirm what I had just seen. The duration of veiwing this object was approximately 5 minutes or so. It followed along with the storm, flying in and out of the cloud cover.I watched it until I could no longer see it. I can honestly say that I've heard people mention \"ball lightning\"-this certainly was an OBJECT, a metallic round object. I have recently posted a sighting from the same backyard location in upstate NY where I saw a similiar shaped object, only quite a bit larger, still round and silver. This sighting was not during a storm but seen on a bright cloudless sunny day. Same area, but moving in a different direction."],"Object Flight Path":"Other","Latitude":"41.931157","Summary":"White round blinking object seen zooming in and out of thunderstorm.","Tags":"City","Log Number":"US-06162009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=41.931157,+-73.988631(17513)&iwloc=A&hl=en\"> mufon case (17513) map </A>","Date of the Event":"07/31/2008 12:00 UTC","Object Features":"None","trends":["There have been 13 other sightings in Kingston","There was one other sighting in Kingston on or around July 31st 2008"],"Case Number":"17513","Country":"United States","Source":"MUFON","Longitude":"-73.988631"}