{"Summary":"Sighting of a metal disc during flying within a aircraft.","City":"Manchester","map":"<A HREF = \"http://maps.google.com/maps?q=53.489131,+-2.244796(17517)&iwloc=A&hl=en\"> mufon case (17517) map </A>","Source":"MUFON","Date Submitted":"08/27/2008 07:30 UTC","trends":["There have been 26 other sightings in Manchester","There were no other sightings in Manchester on or around August 27th 2008"],"Disposition":"Unresolved","Object Features":"Undisclosed","divs":["Sighting Details1 was on a delta airlines flight with my wife and two of my children from new york to manchester england. they were sat on the left hand side of the aircraft i was sat on the right hand side in the aisle seat. we were on the landing aproach ,the seatbelt signs were on as we were descending i wanted to look out the window but felt uncomfortable looking to my right as there were two people sat next to me and so i tried to look accross the aisle where my wife and children were sitting but they were not interested and i could not see for there heads so i looked through the window on the next row back accross the aisle. i saw what i thought was the airport radio watch tower and i thought wow we are just about to land i looked at it as we went past but we did not land, in fact we were still just above the lower cloud cover ,as soon as i realized what was happening i froze and could not speak for the shock. we landed about fifteen minutes later. the object was a circular disc it was about two hundred yards away and on a level with us, it was about twenty to twenty five feet in diameter and its depth was around six to seven feet, it was metalic grey with horizontal lines which i thought were windows ,when i first thought it was the radio tower. i think it was stationary as i could not see after we went past. my family did not see it but i dont know about any other passengers as i said nothing for total shock. because of how i was positioned when i viewed the object it is possible that no one else saw it because i was looking back though the row behind me window at an angle that no one else was probably looking they would be looking foreward through their own windows iwas looking backwards through the row behind window. i have only spoke of this sighting to my family but feel troubled by it."],"Case Number":"17517","files":["/var/www/straped/mufon/html2text/17517.html.txt","/var/www/straped/mufon/org/17517.html"],"Weather Factors":"Unknown","Region":"England","Latitude":"53.489131","Object Shape":"Disc","Sighting Duration":"00:00:06","Date of the Event":"08/27/2008 07:30 UTC","Tags":"City","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-2.244796","Log Number":"GB-06162009-0006","Country":"United Kingdom"}