{"Log Number":"US-06172009-0008","Object Flight Path":"Unknown","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","Object Shape":"Circle, Disc","Latitude":"32.757167","divs":["Sighting DetailsJune 10, 2009 at 8:04 p.m. I take photos of clouds for my art projects. Sometimes I feel literally compelled to take photos of the sky. I looked at these photos through the view screen of my camera but didn't downloaded to my laptop until June 12, with only a cursory glance. I later examined all the photos, on the morning of June 17, 2009. As I examined each photo, I noticed something odd. There \"it\" was, dead center of one of the frames. I would have missed it but the symmetry of the object drew my attention. The light vs. shadowing shows a perfect circle of something that is there, yet seems to be attempting to hide. My digital camera appears to have captured the energy field around an object? This object is not a speck of dust, drop of moisture, insect, or light anomaly and does not appear in any other frames, before or after. Description: As I recall, I was facing East and the object would have been approx. 70-75 degrees above the horizon. The weather was quite warm. A thunderstorm had just passed and another was approaching from the West. I am attaching an adjusted and cropped version, with this report. The original, untouched photo is safely filed away and I have sent a copy of it to a MUFON FI (Teresa Turner), who is handling another case. Thank you."],"files":["/var/www/straped/mufon/html2text/17529.html.txt","/var/www/straped/mufon/more/17529_submitter_file1__938-June-10-09.jpg","/var/www/straped/mufon/org/17529.html"],"City":"Breckenridge","Date of the Event":"06/10/2009 08:04 UTC","Case Number":"17529","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around June 10th 2009","This sighting has never been favorited.",""],"Longitude":"-98.89966","Sighting Duration":"Undisclosed","Date Submitted":"06/10/2009 08:04 UTC","Object Features":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.757167,+-98.89966(17529)&iwloc=A&hl=en\"> mufon case (17529) map </A>","Tags":"City","Weather Factors":"Windy","Region":"Texas","Summary":"Taking photos and in one frame I captured the outline of a circular object."}