{"Case Number":"17526","Date Submitted":"06/16/2009 10:30 UTC","Disposition":"Unknown","Region":"Oregon","Summary":"Witnessed a crescent shaped light and multiple smaller orbs in the night sky.","divs":["sighting detailsi had taken my dog outside to have a cigar and about halfway through my cigar i started to notice flickers and flashes of light in both crescent shapes and orbs. there was cloud cover but no thunderstorms. the light seemed to be both in the cloud at times and also under the clouds. did not even loosely resemble lightning. as i watched this very lengthy light show, i was aware of a passing car. my dog then began to get unnerved and looked in the same direction as i was looking. as the car came closer down the road, across the street i noticed a pair of eyes as if an animal's eyes were reflecting in the light except they were a deep purple\\indigo. as the car passed i watched the spot where i had observed the eyes and was shocked to see a whitish humanoid shape stand up and quickly walk into the neighboring yard across the street. my heart began to race and i became quite unnerved. i called my wife outside and told her what i'd seen and asked her to look at the lights in the sky as well. she confirmed that something was flickering\\flashing in multiple spots. we both got very nervous and came inside the house. as i write this, my heart is still pounding in my chest. all through this episode the dog also was alert and cautious raising and lower her head as she watched something more that we couldn't see across the street. also, i heard a jet pretty low with a loud roaring sound afterwards."],"Weather Factors":"Unknown","Latitude":"42.441687","Object Flight Path":"Other","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around June 16th 2009"],"Country":"United States","City":"Grants Pass","files":["/var/www/straped/mufon/html2text/17526.html.txt","/var/www/straped/mufon/org/17526.html"],"Sighting Duration":"Undisclosed","Longitude":"-123.326662","Tags":"City","Object Features":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.441687,+-123.326662(17526)&iwloc=A&hl=en\"> mufon case (17526) map </A>","Date of the Event":"06/16/2009 10:30 UTC","Viewing Distance":"21-100 Feet, Unknown","Log Number":"US-06172009-0005","Object Shape":"Boomerang, Circle, Flash"}