{"Object Features":"Undisclosed","Longitude":"-110.225961","files":["/var/www/straped/mufon/html2text/17528.html.txt","/var/www/straped/mufon/org/17528.html"],"Date Submitted":"06/17/2009 12:13 UTC","Object Shape":"Other","Tags":"City","Source":"MUFON","Log Number":"US-06172009-0007","Weather Factors":"Unknown","Latitude":"36.100834","Sighting Duration":"Undisclosed","divs":["Sighting DetailsWe need help On friday at 3:30 I was standing in our front yard overlooking our corn field. We watch because of the crows. We live in a canyon that is about 300 feet deep and rather wide. I heard a LOUD noise like a helicopter but couldnt see it. It was getting louder and louder and my wife came out and stood by my side right after the black helicopter appeared. It came from the south and came right at us. It was small and black. It stoped in the middle of the valley and started to rotate to our left. It had allot of glass on one side and the sun reflected off it like the glass on the side of the buildings in a city. We could see the pilot when it was head on to us, and the pilot had a green helmet with brown sunshade. The helicopter was like a news helicopter but was completely black and as it rotated, it had no markings. It was a flat black. Everything seemed to be happening very slow. My wife decided to wave to it. I told her not to and she did it anyway. She said \"Maby they will land\". The pilot did not wave back. Then the helicopter left going north. Looking at google satelite map, I discovered that the helicopter was hovering over a gigantic mark in the earth. It is round and has portrusions coming from it. It is very unnatural. I ploted the arms, extending them on a national map and discovered there are 3 main ones. They go to Roswell, Page, and salt Lake City. There is a minor one that goes to Area 51. One goes to Colorado, blanding or beyond. The mark on the earth is 250 feet in diameter or larger IT IS VERY OLD. this is a new discovery. I am affraid, my wife is not, go figure. IF YOU ARE SERIOUS PLEASE TRY TO HELP US. Ive got a bad feeling about this."],"Viewing Distance":"Unknown","Summary":"I think we have discovered a major hub for underground activity.","Region":"Arizona","City":"Pinon","trends":["There have been no other sightings in Pinon","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","Disposition":"IFO","Country":"United States","Date of the Event":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.100834,+-110.225961(17528)&iwloc=A&hl=en\"> mufon case (17528) map </A>","Case Number":"17528"}