{"Log Number":"PR-06172009-0011","City":"Hatillo","Sighting Duration":"Undisclosed","Date Submitted":"10/24/2007 10:30 UTC","Viewing Distance":"Unknown","Country":"Puerto Rico","Object Features":"Undisclosed","Region":"","Latitude":"18.486333","Source":"MUFON","Case Number":"17532","files":["/var/www/straped/mufon/html2text/17532.html.txt","/var/www/straped/mufon/org/17532.html"],"Longitude":"-66.825454","trends":["There have been no other sightings in Hatillo","This sighting has never been favorited."],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=18.486333,+-66.825454(17532)&iwloc=A&hl=en\"> mufon case (17532) map </A>","divs":["Sighting Details I was on a flight from Puerto Rico to New York as we started to decend on a very cloudy and rainy fall morning I was sitting on the left side of the plane right over the wing,must people had their windows closed but mine remained open through the entire flight.I was very aware of the situation and wanted to see the entire decend.As we kept decending this acorn shaped thing just flew across the top of the plane from right to left and over the front part of the plane I took my eyes of it to see if anybody was seen what I was watching but seem to me that nobody wanted to see the aproached because all the clouds.(they probably felt uneasy)I had a very good look at it, was a dull brown color no shine what so ever,no visible windows or doors probably ten to fifteen feet across,I was on it for what I say was a minute but It could have been less,went over us and flew down and away from us, then made a fast right turn into some clouds,it was traveling quite fast,the clouds on this side of the plane were few at the time and as it flew over us it took so of a dive as it flew away to some distance,few thousand feet. I would say,because it went by the front part of the plane I know for certain that the captain of the plane and co-pilot had to see it.I did not discuss this event with other people in the plane because after the event I looked to see if any of the windows on my side were opened and could not find any, so I kept it to my self and plus not one would have belived me anyway.This did happened to Me...I do swear on the bible and I'm a christian and I don't swear in vane."],"Object Shape":"Other","Tags":"City","Weather Factors":"Unknown","Date of the Event":"10/24/2007 10:30 UTC","Summary":"Acorn shaped, dull brown color,10 to 15 feet diameter no windows, or wings or tail.","Disposition":"Unresolved"}