{"Weather Factors":"Unknown","City":"Woodland Park","Longitude":"-105.04759","Case Number":"17538","Date of the Event":"06/13/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/17538.html.txt","/var/www/straped/mufon/more/17538_submitter_file1__cowhandhorseufo.jpg","/var/www/straped/mufon/more/17538_submitter_file2__lightufocloseup.jpg","/var/www/straped/mufon/org/17538.html"],"Source":"MUFON","Object Features":"Undisclosed","Log Number":"US-06182009-0006","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Undisclosed","Disposition":"IFO","Latitude":"38.995271","map":"<A HREF = \"http://maps.google.com/maps?q=38.995271,+-105.04759(17538)&iwloc=A&hl=en\"> mufon case (17538) map </A>","Country":"United States","Date Submitted":"06/13/2009 12:00 UTC","Region":"Colorado","divs":["Sighting DetailsI read the Mufon post on almost a daily basis and noticed that there were several post in the proximity of the area I was visiting and took interest in what was happening in the skies during this period. I was up most of the night taking photos of a construction project we are working on in Woodland Park, Colorado. I noticed the night the photo was taken that a strange light appeared in one of the photos. Not a star, and not a typical round object. It was not until the next day when I was telling my mom about all the strange reports in Colorado that I put it all together, and furthermore, that there were similar qualities to the photo that aligned with the reports. It could be a coincidence and just some anomaly or light reflection in the photo, but I showed it to many others and it is a very strange photo of a red light with what appears to be spikes of light to the right and left and something coming from the bottom as most of the other post indicated as well. So, I think it would be a very strange coincidence if it is nothing because it is in aline with what others posted about their siting. If someone is investigating the 5 post that occurred between 6-12-09 and 6-15-09 and would like to investigate the photo, please contact me and I will submit it to the investigator. Thanks."],"Summary":"Photo captured same time period as 5 other Colorado posts.","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 3 other sightings in Woodland Park","There were no other sightings in Woodland Park on or around June 13th 2009","This sighting has never been favorited.",""]}