{"Log Number":"US-06182009-0003","Date of the Event":"03/31/2009 07:30 UTC","Case Number":"17535","Object Shape":"Sphere","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.954535,+-75.154859(17535)&iwloc=A&hl=en\"> mufon case (17535) map </A>","Object Features":"None","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around March 31st 2009"],"Region":"Pennsylvania","Summary":"Sphere entering cloud formation.","Weather Factors":"Unknown","Latitude":"39.954535","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","City":"Philadelphia","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Longitude":"-75.154859","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17535.html.txt","/var/www/straped/mufon/org/17535.html"],"Date Submitted":"03/31/2009 07:30 UTC","divs":["Sighting DetailsI was standing in the doorway of my home seeing a visiting friend out the door when I was gripped by a sudden desire to look up to the sky. It was a balmy April evening, the sky was clear and the sun had not completely disappeared in the horizon. As I gazed at the eastern sky and cumulus cloud formations, I noticed a sphere near a large cloud. It was moving slowly, and since I had seen this on other occasions, I suspected the sphere would go into the cloud, come out and travel a short distance away, then go back into the cloud. I watched the circular object disappear behind the cumulus formation, but didn't see it emerge out of the cloud. I ran back in the house and grabbed my camera binoculars to snap a photo, but never saw the sphere return to view. I stood there for about 15 minutes waiting, ready to snap a picture, but failed to see the flying object again. I can't figure the exact distance of my sighting, but if you can picture the distance of clouds in the sky from where you are standing, you can get an approximate idea of how far I was from this sphere. As I mentioned above, I have seen orbs going in and out of clouds on previous occasions. One of those times was about six years ago on my way to the Philadelphia airport. As always, whenever I spot one of these objects, be it a saucer, orb, or black, batman-looking aircraft, I get a sense of wonder and a spooky feeling that I am being watched."]}