{"files":["/var/www/straped/mufon/html2text/17531.html.txt","/var/www/straped/mufon/org/17531.html"],"Disposition":"Unknown","City":"Thousand Oaks","Case Number":"17531","Date Submitted":"06/17/2009 03:40 UTC","Country":"United States","Tags":"City","Log Number":"US-06172009-0010","divs":["Sighting DetailsI was driving eastbound on the 101 freeway at 3:40 pm this afternoon. I had just passed the transition to Rte 23 North when I glanced out the window to my left - in the normal course of safely driving on the freeway - and saw an object in the sky. At first glance I was confused by what I saw, and thought perhaps it was an old-fashioned box-kite. It hard an overall dark appearance, but seemed to be tinged with a general kind of rusty-red color as well, but in blobs or spots, not at all uniform. I realized almost instantly that if it were a box-kite it was shaped very oddly, and there was no visible tail or line or any of the things one might normally associate with a kite. It appeared to be roughly one thousand yards away from me and perhaps 500-700 feet in altitude. I squinted, but still couldn't recognize what it was. I turned to the passenger in the truck and asked him, \"What the heck is THAT? Do you see that?\" He had not been looking in that direction at all, and, as I turned to look back out the window again, I said, \"There, in the sky... what is that?\". As he tried to lean forward to get in position to see past me out the window, I was already looking back at the object and, quite impossibly it just faded into thin air. As if in a film it simply dissolved away. I was astonished, and immediately pulled the truck to the shoulder so that I could properly maintain a view of the exact part of the sky where this thing, this solid looking dark, oddly shaped thing had APPEARED to be only seconds before. There was nothing there. This happened very quickly and I understand that my description is vague at best, but the thing seemed VAGUE itself...I didn't understand the shape I was seeing, and I certainly didn't associate it with anything in the sky, and I sure as heck watched it fade from view in front of my very surprised (and somewhat disappointed) eyes. I wanted to know what it was, I didn't want it to disappear before I could grasp what it was. It is my hope that someone else may have observed this and be able to offer an explanation. Thanks."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"While driving on the freeway, witness observes bizarre object.","Date of the Event":"06/17/2009 03:40 UTC","Object Flight Path":"Stationary,Unknown","Latitude":"34.172201","map":"<A HREF = \"http://maps.google.com/maps?q=34.172201,+-118.830714(17531)&iwloc=A&hl=en\"> mufon case (17531) map </A>","Source":"MUFON","Longitude":"-118.830714","Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Region":"California","trends":["There have been 17 other sightings in Thousand Oaks","There was one other sighting in Thousand Oaks on or around June 17th 2009"],"Object Shape":"Other"}