{"Region":"Oregon","Date Submitted":"06/13/2009 05:45 UTC","Object Shape":"Cigar, Cylinder","files":["/var/www/straped/mufon/html2text/17536.html.txt","/var/www/straped/mufon/org/17536.html"],"Source":"MUFON","divs":["sighting detailsi am a former jet naval aviator and atp-certificated pilot with more than 5,200 hours total time in the air and flew in alaska for 18 years. i grew up around aviation, as my father started the first cessna dealership in medford, oregon. my sharp-eyed alaskan inupiat eskimo wife -- whose brother is a commercial\\instrument rated, alaskan bush pilot -- was the one who actually saw the object while i was driving our audi in light traffic. by the time i pulled into a parking lot to try and see it for myself, the low clouds obscured the almost white-colored-appearing cigar-shaped object. riding with us was a husband and wife who are both commercial-rated helicopter pilots, but they did not see it in time, either, as there were only a few openings in the clouds to discern it. my native alaskan wife is always the one who sees notable objects first while we're driving (like deer and other wildlife, birds, airplanes, etc.), as she has the kind of eyes (as many females do) that can immediately distinguish camouflaged objects from the surrounding scenery. the cigar-shaped object (she described at the time as looking like \"a white pencil with no eraser\") appeared to be moving north to south approximately over downtown medford, oregon, and slightly west of the climbout\\approach path for runway 14\\32 at the medford airport; it was not at a very high altitude (perhaps a thousand feet agl slightly above the base of the low clouds) and was drifting in and out of the low clouds. she says it looked exactly like the one in this short 8 second video found on you tube at this web link: http:\\\\www.youtube.com\\watch?v=azous1etpro&feature=related all four of us riding in the car last saturday afternoon at or about 5:50 p.m., june 13th, 2009, would be particularly interested if anybody else in medford spotted the object at that time, too. we have absolutely no doubt that what my eskimo wife described was really what she saw -- she has always had the sharpest eyes of any of us."],"Longitude":"-122.866735","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around June 13th 2009"],"Tags":"City","Sighting Duration":"Undisclosed","Date of the Event":"06/13/2009 05:45 UTC","Disposition":"Unknown","Log Number":"US-06182009-0004","City":"Medford","map":"<A HREF = \"http://maps.google.com/maps?q=42.333305,+-122.866735(17536)&iwloc=A&hl=en\"> mufon case (17536) map </A>","Object Features":"Undisclosed","Latitude":"42.333305","Case Number":"17536","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Summary":"While driving along Crater Lake Avenue near the intersection with Jackson St. saw cigar-shaped object drifting in and out of low clouds.","Country":"United States","Weather Factors":"Rain, Light"}