{"Date of the Event":"05/21/2009 07:43 UTC","Object Flight Path":"Path with directional change","Longitude":"-93.559909","files":["/var/www/straped/mufon/html2text/17549.html.txt","/var/www/straped/mufon/more/17549_submitter_file1__IMG_2260.JPG","/var/www/straped/mufon/more/17549_submitter_file2__IMG_2261.JPG","/var/www/straped/mufon/more/17549_submitter_file3__IMG_2265.JPG","/var/www/straped/mufon/org/17549.html"],"Log Number":"US-06192009-0009","Object Shape":"Cigar, Flash","Country":"United States","divs":["sighting detailson the evening of 5\\21\\09, i noticed that the sky looked cool and the reflection on the pond behind my house looked picturesque. so i took three photos of the landscape and noticed nothing unusual at the time. a few weeks later, i uploaded the photos to my computer and on the first photo i noticed a moving flash in the center of the sky. the next photo showed the shining object slip behind a tree to the left. i found these anomalous pictures to be quite interesting. i posted these photos on my facebook page and later noticed the the third photo shows the object speeding away on the upper right. this is very strange and i have no idea about what it was. i often take pictures of the seasonal changes behind my house. usually i will shoot two or three photos. what is strange here is that i believe that i took three pictures but there are three missing pictures?! images 262, 263 and 264 never showed up when i uploaded the files and i do not remember taking them. i am dumbfounded by this experience. something quite strange was out there that night and it wasn't a cessna, a helicopter or venus. et between recovered images: 1. img260 7:43:35 2. img261 7:43:38 3. img265 7:44:23 higher res pix available upon request."],"Viewing Distance":"101-500 Feet","Summary":"I took three pictures of beautiful wetland behind my house, and a strange object appeared when I uploaded the images...","Date Submitted":"05/21/2009 07:43 UTC","Tags":"City","Disposition":"IFO","Latitude":"45.195822","Region":"Minnesota","Sighting Duration":"Undisclosed","City":"Rogers","trends":["There has been one other sighting in Rogers","There were no other sightings in Rogers on or around May 21st 2009","This sighting has never been favorited.",""],"Case Number":"17549","Source":"MUFON","Object Features":"Undisclosed","Weather Factors":"Light","map":"<A HREF = \"http://maps.google.com/maps?q=45.195822,+-93.559909(17549)&iwloc=A&hl=en\"> mufon case (17549) map </A>"}