{"Summary":"3 bright lights in shape of triangle.","Latitude":"39.740514","files":["/var/www/straped/mufon/html2text/17542.html.txt","/var/www/straped/mufon/org/17542.html"],"Date of the Event":"05/05/2009 09:59 UTC","Weather Factors":"Unknown","Object Shape":"Triangle","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.740514,+-104.977593(17542)&iwloc=A&hl=en\"> mufon case (17542) map </A>","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around May 5th 2009"],"City":"Denver","Object Features":"None","Source":"MUFON","Log Number":"US-06192009-0002","Tags":"City","Disposition":"Unknown","Longitude":"-104.977593","Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Case Number":"17542","Region":"Colorado","Date Submitted":"05/05/2009 09:59 UTC","divs":["Sighting DetailsDRIVING HOME ON HWY#285, SOUTHBOUND Clear NIGHT SKY ,I NOTICED 3 BRIGHT LIGHTS OVER BAILEY, CO.,OVER THE NATIONAL FORREST. LOW IN SKY, THERE WERE NO STARS OUT, BUT I SAW ALARGE TRIANGLE SHAPE BLACKED OUT, THE SPOT IT STOOD IN. THE LIGHTS WERE IN PERFECT ALINEMENT. I ASSUMED IT WAS LOW STARS, BUT THERE WERE NO TWINKLING, AND I QUICKLY FORGOT ABOUT IT. THE OBJECT WAS A VERY LARGE TRIANGLE SHAPE, THE TOP PART, POINTED AT AN ANGLE TOWARDS THE SKY AND THE BACK LIGHTS, POINTED TOWARDS EAST AND WEST. IT REMAINED STATIONARY AT ALL TIMES WITH NO MOVEMENT AT ALL.NO BLINKING LIGHTS, OR ANYTHING ELSE. THIS OBJECT AND LIGHTS, COULD ONLY BE VIEW SOUTHBOUND OR WESTBOUND. AT FIRST I WASNOT CONCERN, AND ASSUMED IT WAS LOW STARS, BUT IT WAS WAY TOO LOW FOR STARS, THIS WAS VIEWED OVER THE PARK NATIONAL FORREST, AND AT ABOUT 8-9000FT MOUNTAIN ELEVATION WHERE THERE ARE NO LIGHTS. THIS OBJECT AND LIGHTS WERE PRESENT FOR ABOUT 3 WEEKS, ALMOST EVERY NIGHT, IN THE SAME AREA AND ABOUT THE SAME TIME FROM ABOUT 9:30 PM TO BEFORE DAWN. I BEGAN GETTING UP IN THE MIDDLE OF THE NIGHT ,OUT OF CURIOSITY, TO FIND THE LIGHTS FIRST, THEN I COULD SEE ITS BLACKED OUT SHAPE, FROM MY UPSTAIR BALCONY OR DRIVING HOME VERY LATE AT NIGHT . AFTER ABOUT 3 WEEKS THE LIGHTS AND OBJECT SIMPLY DISAPPEARED."]}