{"Tags":"City","files":["/var/www/straped/mufon/html2text/17555.html.txt","/var/www/straped/mufon/more/17555_submitter_file1__CH-46ESeaKnight.jpg","/var/www/straped/mufon/org/17555.html"],"Date Submitted":"12/15/2007 09:00 UTC","Latitude":"48.204202","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Longitude":"-122.122392","divs":["Sighting DetailsOn this night, it was cold out and I was on my back porch smoking a sigarett. I was a 22 year Preflight and Delivery Inspector for a large company her on the west coast, wich most of my years were spent on the flight-line. I heard a very large helicopter flying over the town of Arlinton and coming from what I suspect was the Naval antenna aray area; off to the north in the mountains. I waited to see what kind of helicopter it was, because I knew it sounded larger than the usual Chinook. As it came closer, what I saw next stunned me. It was two very bright lights about 50 yards apart and about a hundred yards behind came the helicopter. I have very good hearing, and with them traveling in a very straight line- I listened for an egine. There was absolutly no sound and no prox lights flashing. They traveled in a straight line right to the left of our house about a hundred and fifty feet up and were headed due south. After, I went into the house and told my wife, that something was up, because I had never seen aircraft like that before, in my just short of thirty years working with them. I toltally believe that the government either knows about them, or has something to do with them. I have been watching other stories of people seeing very simular lights, and felt I had to report this. I am sending a picture of the type of helicopter I believe was chasing them."],"Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=48.204202,+-122.122392(17555)&iwloc=A&hl=en\"> mufon case (17555) map </A>","trends":["There have been 8 other sightings in Arlington","There were no other sightings in Arlington on or around December 15th 2007","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Weather Factors":"None","Country":"United States","Case Number":"17555","Region":"Washington","Source":"MUFON","Object Shape":"Sphere, Star-like","City":"Arlington","Log Number":"US-06192009-0015","Summary":"I saw two starlike orbs being chased buy a large US helicopter near a naval antenna.","Date of the Event":"12/15/2007 09:00 UTC"}