{"Log Number":"US-06192009-0012","Latitude":"35.375282","Source":"MUFON","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.375282,+-119.016802(17552)&iwloc=A&hl=en\"> mufon case (17552) map </A>","Case Number":"17552","Disposition":"IFO","Object Flight Path":"Undisclosed","Summary":"I have a detailed account of how e.t gets in and out of cities. How the cia, and fbi are involved","Viewing Distance":"Unknown","Region":"California","Weather Factors":"Unknown","Date of the Event":"06/15/2009 12:00 UTC","City":"Bakersfield","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around June 15th 2009"],"Longitude":"-119.016802","divs":["sighting details in 1946 i became a genetic engeneered hybrid...i have advanced abilities. the cia, and fbi and other groups have been stalking me, and my kids thru three states for at least 6 years. in my past lives i was an ancient, in atlantis, pompeii, on the bridge of a space craft...i was a templar.....we have had many visits with different e.t.....in reno, nevada......bakersfield, ca..... i found that my real parent is in fact a e.t of advanced abilities, and power......having to do with the white robes.....the cia is working directly with e.t to use me as an experiment to make the perfect hybrid..it has to do with in fact jesus coming back thru a dimensional worm hole..... i have the ability to pull energy from objects that connect to the pyramid on the dollar.....bibles, crosses, any picture of jesus.....when we were in reno....i did have an encounter with the real virgin mary in the flesh.....i was only five feet from her....she stood about five foot 5..small built......delicate features.....looked young.....she wore a light blue outfit they wore in ancient times.....she looked perfect...... i have memories from the past that have come into the future as if they were in the present, and i could feel them as if i was there..... i have had encounters with higher beings of great power...... i have kept a record of the last few years of events.....the cia seems to be afraid of me, and my abilities....and the visits i have had from e.t........ we have had visits from draconian, reptoid, greys of different sizes, human looking ones...... would you like to know the rest of the story.....i may have something about e.t you will never find out on your own.....e.t have been coming after us for 7 years....... [cms\\tg\\pid]"],"files":["/var/www/straped/mufon/html2text/17552.html.txt","/var/www/straped/mufon/org/17552.html"],"Date Submitted":"06/15/2009 12:00 UTC","Tags":"City"}