{"Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Tags":"City","Object Features":"None","Longitude":"-114.583703","trends":["There have been 5 other sightings in Mohave Valley","There were no other sightings in Mohave Valley on or around","This sighting has never been favorited.",""],"Region":"Arizona","Case Number":"17568","Date Submitted":"06/20/2009 01:03 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/17568.html.txt","/var/www/straped/mufon/more/17568_submitter_file1__6-19-09-1223AM.jpg","/var/www/straped/mufon/more/17568_submitter_file2__61909-1225AM.jpg","/var/www/straped/mufon/more/17568_submitter_file3__6-19-09-1226AM.jpg","/var/www/straped/mufon/org/17568.html"],"Disposition":"Unknown","Summary":"As you will see by the photographs it is round most of the time but changed shape when in motion.","Object Shape":"Circle","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.935448,+-114.583703(17568)&iwloc=A&hl=en\"> mufon case (17568) map </A>","City":"Mohave Valley","Latitude":"34.935448","Log Number":"US-06202009-0003","Date of the Event":"Unknown","Object Flight Path":"Stationary,Straight-line path","divs":["Sighting DetailsSince we have been seeing anomalies in the sky for a few months lately we are beginning to keep an eye on the sky. Last night about 12:20 A.M. my husband went out doors to water the lawn and my husband came and got me out of bed to wittness a round ball of light in the night sky. It pulsed every so often. At times it appeared to move, but then move back to it's original position which was about at 20degrees to the S.E. of our position at 10503 Mint road in Mohave Valley Arizona. Since I feel at this point that I'm alarmed at every dot in the sky and reporting it, I hesitated to report this one until I began to check the night sky last night to determine if it could have been a star, which I doubted because of it's proximity to earth. There was in fact at about that location a teaming up of Neptune and Jupiter but I doubt that they would leave trails behind them when they move. We have been told that what we are seeing is weather ballons, prehaps some of them are but if you look to the lower right of each photograph you will see a very large tree, lit from a ground porch light. In my opinion, this thing flew and changed position and I do not believe it was a few planets which are very easy to spot. In retrospect I have re-examined the day time shots and had time to compare them to what other people claimed they saw on the 18th of May and I no longer believe that it was what other people claim they saw. I am almost certain these are not weather ballons, especially at night. Shaba"]}