{"Tags":"City","Object Shape":"Circle, Flash, Sphere, Other","Region":"South Carolina","Viewing Distance":"Over One Mile","Date Submitted":"09/15/2008 12:00 UTC","Case Number":"17567","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/17567.html.txt","/var/www/straped/mufon/org/17567.html"],"Source":"MUFON","divs":["sighting detailsthe date of observation is approximate as this event occurred last fall and i was not aware of this website to report it at that time. i had just gotten out of work at 11pm est and was driving home. i glanced to my left to see the quick movement of a bright green orb\\round object shoot straight down from the sky to the earth. from my view point, the object was at least two miles from me. at arms length, i would say it was the size of a quarter. as to it's actual size, i'm not sure. it was late at night. it did not flame out, had no tail or deviate from course. it just shot straight down, no angles. there was no crash observed or flare up at beginning or end of observation. i suppose it went down behind the tree line, on the other side of i-26, northbound. at first i thought maybe i was seeing things as it happened so quickly but realized, no, i really did see it. i was so excited that i called both my husband and then best friend on my cell phone to tell them about it. i was positive it was not a flare, fireworks or a satellite. nor was it a reflection of anything inside my vehicle as i took some time the next night to discredit that possibility. the electric door lock light on the passenger door is green but is immobile and can't go up and down as it's part of the door panel itself."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.958567,+-81.927598(17567)&iwloc=A&hl=en\"> mufon case (17567) map </A>","Summary":"Bright green orb shot straight down from sky to ground.","City":"Spartanburg","Object Features":"None","Longitude":"-81.927598","Date of the Event":"09/15/2008 12:00 UTC","Country":"United States","Latitude":"34.958567","trends":["There have been 2 other sightings in Spartanburg","There were no other sightings in Spartanburg on or around September 15th 2008"],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Log Number":"US-06202009-0002"}