{"Disposition":"Unknown","Longitude":"-93.992396","Latitude":"29.97438","Object Shape":"Star-like","Date Submitted":"06/19/2009 11:35 UTC","Source":"MUFON","Log Number":"US-06202009-0004","Weather Factors":"None","Sighting Duration":"00:05:00","Country":"United States","trends":["There have been 3 other sightings in Nederland","There were no other sightings in Nederland on or around June 19th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.97438,+-93.992396(17569)&iwloc=A&hl=en\"> mufon case (17569) map </A>","Summary":"Star-like object began to move higher after being stationary, and moved left to right.","Viewing Distance":"Unknown","Region":"Texas","Tags":"City","files":["/var/www/straped/mufon/html2text/17569.html.txt","/var/www/straped/mufon/org/17569.html"],"Object Features":"Unknown","Object Flight Path":"Stationary,Path with directional change","divs":["Sighting DetailsI walked outside to smoke and took time, as usual, to gaze upon the visage of the heavens, though there were clouds spotting the sky. All the stars out were familiar to me, and I was surprised when I looked West to have seen Mars out. Everything I know of the planet, be it science or mythology, ran through my head as usual. I was moving about trying to keep mosquitoes off me, yet keeping my eyes fixed on the celestial body. I began to question myself, because I was unsure if Mars was supposed to be visible at this time of the year. At this point, my mild OCD had kicked in and I had the red planet fixed visibly inside the corner of an L shape made by a nearby tree. As I was questioning myself, I began to realize: this was not Mars at all. It did not take any star charts to figure this out, because the so previously thought planet began to move directly up. This is when I noticed the clouds it had been in front of. It began to move side to side, left and right, yet still in an upward motion. Then it went into the clouds, not to be seen again. I called a friend of mine who told me about this site and said I should report it. So here I am, filling this all out. I wish I had a camera as my alibi but instead my words here must suffice for the reader."],"City":"Nederland","Date of the Event":"06/19/2009 11:35 UTC","Case Number":"17569"}