{"divs":["Sighting DetailsI was sitting next to a camp fire on New Years eve with about 15 people doing the same. Next to other camps in Glammis, California. A sand dune getaway. We were all sitting down lounging on beach chairs just enjoying the fire after bringing in the new year. The sky was bright from the moonlight and somewhat clear with a few patches of clouds. At one point I looked up to admire the sky and I kept looking all of a sudden I noticed a moving object on the sky. As I kept looking I remember other people started looking up and noticing the same thing I was looking at. Then one camp next to us started to point at the sky. We all began to say \"what is that?\" Below the patches of clouds we all noticed a circular object, but it was not solid nor had any lights. The object seemed to be a transparent like saucer on being able to see the edge of it. Like looking into a magnifying glass. Moving through the sky the object was moving slow enough for everyone to see. It seemed to be about 300 yards or more. Pretty high up in the sky. It seemed to be moving North west towards the light of the moon. I got up from my seat and I kept running trying to keep my eye on it and not loose it. Just for the record I did not have anything to drink that night. Not a big drinker. Everyone else was but they all noticed the same thing. I have never seen anything like that, as soon as the object got closer to the glare of the moonlight we lost it. I just remember the object was huge and see through glass like. It reminded me of the movie Independence Day but like I said \"transparent\". My friends and I still discuss it and wonder what it was. I remember that a few days later they announced on the news that there were some UFO sightings. I think it was in Utah and Texas. I just remember that the object was heading in that direction and I found it very unusual."],"Region":"California","files":["/var/www/straped/mufon/html2text/17578.html.txt","/var/www/straped/mufon/org/17578.html"],"City":"Glamis","Weather Factors":"None","Longitude":"-115.06341","Viewing Distance":"501 Feet - 1 Mile","Case Number":"17578","trends":["There has been one other sighting in Glamis","There were no other sightings in Glamis on or around December 31st 2005"],"Object Shape":"Disc","Summary":"New Year's Eve camp of 30 people witnessed a huge transparent disc.","Tags":"City","Log Number":"US-06202009-0012","Object Features":"Other","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"12/31/2005 11:00 UTC","Date Submitted":"12/31/2005 11:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.995361,+-115.06341(17578)&iwloc=A&hl=en\"> mufon case (17578) map </A>","Source":"MUFON","Disposition":"Unknown","Latitude":"32.995361"}