{"map":"<A HREF = \"http://maps.google.com/maps?q=46.583889,+-119.386667(17570)&iwloc=A&hl=en\"> mufon case (17570) map </A>","Tags":"City","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was driving the interstate just west of moseslake to the south west i saw 3 lights flying. there where 2 odd things to this one being i have never seen an aircraft move like this i have spent many years in the army part of my job was servalance one thing you learn is features of aircraft. the spacing of the lights where cymetrical and looked even. The second was the location of the sighting it was over Hanford outreach aks Hanford nuclear powerplant. The object apeared around dusk the sun wasnt set yet so you could see very clear. It was below the ceiling. The object moved fairly slow and extramly smooth. There was no jetstream behind it. at which time this is what caught my eye it just vanished. I continued to watch the area around a minute or 2 later the object then reapeared for about 30 seconds. It was moving even slower but still heading in a westerly direction. I then noticed it do something i have never seen an aircraft do it did a 180 degree rotation you could tell this because the light facing north rotated to the point it faded and you could only see one of the lights at which point the object vanished. The sky was a slight overcast and i didnt see and object hit opensky anywhere in the are around there and nothing showed up."],"Case Number":"17570","Date Submitted":"06/19/2009 09:10 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/17570.html.txt","/var/www/straped/mufon/org/17570.html"],"Disposition":"Insufficient Data","Object Flight Path":"Path then hovering,Other","trends":["There have been no other sightings in Hanford","This sighting has never been favorited."],"City":"Hanford","Viewing Distance":"Unknown","Longitude":"-119.386667","Weather Factors":"Unknown","Object Shape":"Unknown","Summary":"3 solid lights none blinking object had obvious rotation then vanished.","Log Number":"US-06202009-0005","Region":"Washington","Date of the Event":"06/19/2009 09:10 UTC","Source":"MUFON","Latitude":"46.583889","Object Features":"Unknown"}