{"Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/17575.html.txt","/var/www/straped/mufon/org/17575.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.927581,+-105.08218(17575)&iwloc=A&hl=en\"> mufon case (17575) map </A>","Log Number":"US-06202009-0009","Weather Factors":"Unknown","Tags":"City","Object Shape":"Square, Rectagular","City":"Broomfield","Date of the Event":"06/19/2009 04:30 UTC","divs":["Sighting DetailsI was entering the local IHOP's parking lot in a car having a good time with my two kids, near the intersection of Sheridan and 120th, going to a late lunch. I glanced in the direction of Denver and saw a rectangular object just above the obstructions on the horizon, oriented vertically, maybe 4:1 aspect ratio. White like a cloud, no apparent markings or motion, sky was clear around it. I didn't do a proper test at the time but it way maybe 1-2 cm tall at arm's length. Also did not note the exact time. I presumed it was some kind of advertisement or balloon so drove a little further to try and get a better look. Then it appeared to get thinner and vanished, like a 3x5 card rotating so it disappeared when edge-on, and did not reappear. Then we went on to our destination. My 6-yr old said she also saw it but is not reliable and I'm not sure she did. I had attended a talk by Dr Steven Greer Thursday in Denver, and we were in a peaceful and fun mood at the time, and I was probably thinking about the talk when I looked towards Denver and saw the object. I did not think much of it at the time, I'm not sure I consider any of this stuff really seriously, but do have an open mind and follow news on the subject. And I would not have bothered to report but saw a report of what appears to be the same object, so decided to report my sighting to help confirm it. This really makes me think twice about Dr Greer, who will be doing more stuff here this weekend."],"Case Number":"17575","trends":["There have been 11 other sightings in Broomfield","There were no other sightings in Broomfield on or around June 19th 2009"],"Disposition":"Unknown","Latitude":"39.927581","Region":"Colorado","Sighting Duration":"00:01:00","Longitude":"-105.08218","Date Submitted":"06/19/2009 04:30 UTC","Viewing Distance":"Over One Mile","Summary":"Saw large rectangular object in the distance towards the city of Denver.","Object Flight Path":"Stationary","Object Features":"None"}