{"Date Submitted":"06/21/2009 01:50 UTC","Source":"MUFON","Log Number":"US-06212009-0006","Latitude":"30.271993","Tags":"City","Sighting Duration":"Undisclosed","City":"Austin","files":["/var/www/straped/mufon/html2text/17584.html.txt","/var/www/straped/mufon/more/17584_submitter_file1__ufo6-21-09.jpg","/var/www/straped/mufon/org/17584.html"],"Object Flight Path":"Path with directional change","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around June 21st 2009","This sighting has never been favorited.",""],"Region":"Texas","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.271993,+-97.741611(17584)&iwloc=A&hl=en\"> mufon case (17584) map </A>","Object Shape":"Cylinder, Flash, Teardrop","Object Features":"Unknown","Disposition":"Hoax","divs":["Sighting DetailsMy boyfriend and I were driving back to my apartment after eating out late at night (it was almost 1am). We were driving north on Mopac, approaching FM 2222 (near Camp Mabry). We were talking as we drove and I was looking out the windshield up at the sky absent-mindedly. Suddenly I noticed a bright turquoise pellet shaped object traveling erratically at a high rate of speed over the freeway. It looked very high up to me, my first impression was that it was high enough to be a plane or maybe even a comet, but obviously not the right size, shape, color and speed to be either of those.. The color of the object was a very vibrant bright turquoise, and it definitely emitted it's own glow (much like a comet or shooting star). After about five seconds of watching the object travel, it winked out, like a flame dying. The most notable detail in my mind was the color and the shape of the object. Neither changed as it moved, and I have never seen anything that looked like this. My boyfriend saw the object a couple of seconds after I did. He saw a second smaller light as well, traveling in the same area. He only saw them for a couple of seconds before the lights winked out, but agrees that it must have been traveling very fast and was maneuvering erratically. This could have been some sort of celestial object. I don't have much knowledge in astronomy so I wouldn't be surprised if it was something explainable that I have just never heard of. All I know is it would have had to have been traveling at the speed of something like a comet, but it didn't look anything like one (at least none that I've ever seen or heard of). I know of nothing man-made that could have looked like this and moved as fast as this object did (especially as high up as it was). The object was many times larger than a shooting star. The bigger object (the one I saw) was one light as high up or higher than a plane, but occupying about twice as much space as an airplane would tail to tip. We couldn't have been more than a mile north of Camp Mabry when we saw it. I'm hoping some other people in Austin saw and will report this to MUFON. I am really curious as to what it was!"],"Case Number":"17584","Country":"United States","Weather Factors":"Unknown","Summary":"Bright turquoise pellet shaped object traveling erratically at high rate of speed over Mopac Freeway.","Date of the Event":"06/21/2009 01:50 UTC","Longitude":"-97.741611"}