{"Region":"Pennsylvania","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/17587.html.txt","/var/www/straped/mufon/org/17587.html"],"Case Number":"17587","Summary":"Black triangle with strange running lights buzzed over our supermarket.","Latitude":"39.989054","Log Number":"US-06212009-0009","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Narberth","This sighting has been favorited 1 time."],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-75.277072","Date of the Event":"06/20/2009 10:05 UTC","City":"Narberth","Disposition":"Unknown","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsI parked the car late at night at a Genaurdi's parking lot in Wynnewood for some ice cream and noticed a slow-moving object gliding underneath the cloud cover (it has been rainy here for a few days). At first, I thought it was a slow commercial aircraft but it did not have a traditional aircraft shape. It was a solid black silhouette against the nighttime clouds. It flew high above the supermarket and and then turned south. It had circular bright white lights at each vertex of the black triangular form. I have seen similar pictures taken of this object before. I also noticed a strange symmetrical running light pattern. It was not at all like that of a commercial aircraft. They were yellow, red and orange and flashed from the outside of the verteces towards the center. As it flew away from me (towards the SE) it seemed as if the flashing running lights were long colored rods. The pattern was not consistent and changed over time. There was absolutely no noise as this thing flew and it did not accelerate while I was watching it. It also banked like an airplane when it turned. It stayed at a steady slow-moving pace and I lost sight of it when it flew over the trees. I did not feel that this aircraft was extraterrestrial. My feeling was that it is some sort of manmade experimental craft. It was peculiar but I did not feel awe-struck."],"Country":"United States","Object Shape":"Triangle","Date Submitted":"06/20/2009 10:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.989054,+-75.277072(17587)&iwloc=A&hl=en\"> mufon case (17587) map </A>","Tags":"City"}