{"Longitude":"-121.051561","Log Number":"US-06212009-0004","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around May 28th 2009","This sighting has never been favorited.",""],"Object Shape":"Teardrop, Other, Unknown","Source":"MUFON","Region":"California","Summary":"UFO low over Mill St, shape shifted and came apart then west and then north again.","Country":"United States","Latitude":"39.221591","Case Number":"17582","Weather Factors":"None","divs":["sighting detailsmy mother and i were coming out of charlie's cafe in the late afternoon\\early evening. i saw a flying vehicle that i thought was a dark helicopter over the buildings of mill st just a few hundred ft away if that. it had no blades and made no sound and suddenly it shapeshifted and continued to do so...then it broke apart into two pieces and went back together again. well i thought my eyes were playing tricks on me but my mother was seeing the same thing happen. so i moved to the next parking lot next to carolines roasters and continued watching it change shape as it moved slowly along and then it turned west. i got back on the road and hoped it would not disappear before i could catch up with it again which i did at the top of main st by the cemetery at squirrel creek rd. i watched it for a good long time there, had time to call my three friends who are into ufos, one of whom had a house almost directly beneath the craft. it was higher in the sky now, but stationary and still changing shape and separating and reconjoining. bill was not home, ronna lee and marsha also but the two women called me while i was still watching the craft with my mother, then it turned an headed north again towards their houses but it was climbing faster now and soon became to small for me to see. i remembered at some point that i had a camera with me and took pics and video of the event at the third sighting. what i was seeing was as dark as the trees in the photos but it does not show up on the film. it was very frustration. i just couldn't believe it. but there are a sort of watercolor smudges on the fil where the craft was, perhaps with enlargement and enhancement it could be seen better. afterward i was thrilled. i had not had a sighting in a long time. used to all the time. it was quite thrilling, and to have my mom, a witness, was even better. i just wish i had remembered my camera while it was still over the buildings downtown. i have the photos on my camera but no way to get them off and to you."],"Tags":"City","Disposition":"Unknown","Date of the Event":"05/28/2009 08:00 UTC","files":["/var/www/straped/mufon/html2text/17582.html.txt","/var/www/straped/mufon/more/17582_submitter_file1__grassvalley2.jpg","/var/www/straped/mufon/more/17582_submitter_file2__Xlocationswmap.jpg","/var/www/straped/mufon/more/17582_submitter_file3__UFO1.JPG","/var/www/straped/mufon/more/17582_submitter_file4__UFO2.JPG","/var/www/straped/mufon/more/17582_submitter_file5__grassvalley3.jpg","/var/www/straped/mufon/org/17582.html"],"Object Features":"None","Date Submitted":"05/28/2009 08:00 UTC","Viewing Distance":"101-500 Feet, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.221591,+-121.051561(17582)&iwloc=A&hl=en\"> mufon case (17582) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Grass Valley","Sighting Duration":"Undisclosed"}