{"Region":"Colorado","Date Submitted":"11/18/1957 08:00 UTC","Disposition":"Unknown","Case Number":"17583","Object Features":"None","Tags":"City","divs":["Sighting DetailsI worked for Rocky Mountain Cementers in Farmington, NM and had taken an older truck to Denver to exchange for a new one being completed. I had spent most of the day in my motel waiting for the new truck when I was told it wasn't ready and wouldn't be for a couple of weeks. I had to drive the old one back again, but that was fine with me, because I was fully rested and ready to go. It was early when I got to Colorado Springs and passed the Air Force Academy being built and it was soon after passing Ft. Carson that I was going up this mountain and when I looked to my right I saw what looked like a big harvest moon coming up. I thought that's nice, because it would make the roads easier to see, especially on Wolf Creek Pass. Then I did a double take because I realized this \"moon\" was coming up in the south and it seemed to be gaining altitude fast. I was just a short distance from the top of the grade I was on and as soon as I reached the top I stopped, set the brakes and shut the engine off and stood on the running board to watch this \"thing\". In about a minute it was passing overhead and never made a sound, but I could tell it was moving along. At night, in the mountains it gets very dark and it's impossible to judge distance. I don't know how high it was, but it was big. Off to my left I could make out another mountain ridge line but don't know if it was fifty or a hundred miles away. This thing made it there in just 2 or 3 minutes and as it disappeared behind the mountains, I kept waiting for a big bang, a flash of an explosion or something. I got nothing but the silence I had heard ever since I pulled over and stopped. What ever this thing was it made the hair stand up on the back of my neck like I never felt before or since. Needless to say, I was very wide awake for the entire trip to Farmington. The next day listened to every news report I could catch and scanned the Denver and Farmington papers for information on this thing, because as big as it was I new others had to have seen it. I found nothing and never have. About 10 or 15 years ago I heard some reports from Colorado about sightings of round orange objects, but because of my job I never had time to investigate the matter. Can anyone shed any light on what I saw? This thing just came up in the south, made a big arc and went down behind the mountains to the north."],"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.840782,+-104.819703(17583)&iwloc=A&hl=en\"> mufon case (17583) map </A>","City":"Colorado Springs","files":["/var/www/straped/mufon/html2text/17583.html.txt","/var/www/straped/mufon/org/17583.html"],"Latitude":"38.840782","Summary":"It looked like a big harvest moon rising, except it was rising from the south.","Viewing Distance":"Unknown","Object Shape":"Circle","Weather Factors":"None","Longitude":"-104.819703","Log Number":"US-06212009-0005","Date of the Event":"11/18/1957 08:00 UTC","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around November 18th 1957"],"Object Flight Path":"Straight-line path","Country":"United States"}