{"map":"<A HREF = \"http://maps.google.com/maps?q=39.908806,+-79.708663(17594)&iwloc=A&hl=en\"> mufon case (17594) map </A>","files":["/var/www/straped/mufon/html2text/17594.html.txt","/var/www/straped/mufon/org/17594.html"],"Object Flight Path":"Undisclosed","Date Submitted":"06/09/2009 10:20 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI was driving west, through a rain and electrical storm, on Tippecanoe road which is lined with woods on both sides. The rain had let up some and as I passed a place where the trees opened up, I looked to the left 45 deg., and up 45 deg., and beheld, in the sky, a beautiful group of about four white lights, one above the other of the most pure brilliance I have ever seen. It, the group, was not bright in that would hurt ones eyes and make them turn away, it was its purity that I marveled at. My first thought, and one I held for quite awhile, was that I was looking across a small valley at the top of a hill where someone had several flourescent dusk to dawn lights mounted close together on a pole. It wasn't until some time later that I realized that there is no hill there, because I have traveled that road for years, and also that the lights were not all of the same uniform shape. One of the lights near the top seemed teardrop shaped with the point of the tear drop pointing up toward a 10 o'clock position, the others were of a general square shape with rounded corners and sitting above one another. Although they were not centered perfectly along the same axis, all the lights were touching one another and were nearly centered. For some reason I just kept driving like it was something that happens everyday, and that's not my nature, to be so cavalier about anything so unusual. The google earth co-ordinates of where the lights were located is, to my best estimate, almost exactly: 40-01-08.00 N, by 79-47-00.00 W. Extra details are that as I was traveling and looking up at the light it seemed that for a split second my car was sitting quietly on the road and not running as I gazed in awe at the light, I get an extreme case of goosebumps every time I visualize the light, but they are happy goosebumps."],"Object Shape":"Other","Disposition":"IFO","trends":["There have been 7 other sightings in Uniontown","There were no other sightings in Uniontown on or around June 9th 2009"],"Case Number":"17594","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Date of the Event":"06/09/2009 10:20 UTC","Sighting Duration":"10:20:00","City":"Uniontown","Country":"United States","Longitude":"-79.708663","Region":"Pennsylvania","Latitude":"39.908806","Summary":"Appeared as three or four static, brilliant white dusk to dawn flourescent lights vertically stacked.","Source":"MUFON","Log Number":"US-06222009-0002"}