{"Case Number":"17595","Object Shape":"Sphere, Other","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Source":"MUFON","Log Number":"US-06222009-0003","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17595.html.txt","/var/www/straped/mufon/org/17595.html"],"Latitude":"34.070714","Longitude":"-117.645528","City":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=34.070714,+-117.645528(17595)&iwloc=A&hl=en\"> mufon case (17595) map </A>","divs":["sighting details my wife and i both witnessed the same thing under two different dates (two seperate occurences). standing outside looking to the west, a light which suddenly appeared (as if someone 'reached' down and turned on a spotlight). it was a white, circular light, but undefined (it was just a light). the light illuminated a cloud on the night\\date and time described above (the light did not illuminate a cloud on the prior occurence). it only illuminated a small portion of the cloud. the light then sped off and disappeared in an upward motion. when the light sped off it wasn't as bright as it origionaly appeared (now appearing like a streak. we witnessed each event alone. my wife described the same event i described to her about one month prior (with the exception of the cloud). no tangible object was observed (just a light). as described previously, it appeared as if someone or something reached down and turned on a spotlight and quickly took it away while it was still on. i observe the night sky quite frequently, have seen many strange things, but nothing quite like this. both of us at each event were not purposely looking for anything, we were just wandering."],"Tags":"City","Region":"California","Object Features":"None","Weather Factors":"Unknown","trends":["There have been 18 other sightings in Ontario","There were no other sightings in Ontario on or around June 12th 2009"],"Date Submitted":"06/12/2009 09:45 UTC","Summary":"Bright light suddenly appears in the sky then disappears upwards.","Country":"United States","Sighting Duration":"00:00:30","Date of the Event":"06/12/2009 09:45 UTC"}