{"trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around June 19th 2009"],"Case Number":"17597","Tags":"City","Country":"United States","Log Number":"US-06222009-0005","files":["/var/www/straped/mufon/html2text/17597.html.txt","/var/www/straped/mufon/org/17597.html"],"Object Flight Path":"Path then hovering","Date Submitted":"06/19/2009 09:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.260083,+-95.993648(17597)&iwloc=A&hl=en\"> mufon case (17597) map </A>","Longitude":"-95.993648","City":"Omaha","Source":"MUFON","Disposition":"Unknown","Region":"Nebraska","Viewing Distance":"Unknown","Summary":"Brightly lit flying \"craft\" near Willow Creek Park.","Weather Factors":"None","Latitude":"41.260083","Date of the Event":"06/19/2009 09:45 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Object Shape":"Oval, Other","divs":["Sighting DetailsWe were at the Willowcreek park (149 and Harrison) Friday, June 19, 2009 at around 9:45 pm when the four children we were with started pointing and shouting for us to look at the \"fireball\" in the sky. We (2 adults) turned to look (toward the east) and we saw a fairly large, brightly lit \"flying craft\" just over the trees and houses in the neighborhood. At first I assumed it was an airplane, but immediately realized it was something else that I have never seen before and cannot identify logically. It was a bright, yellow-orange light in a somewhat trapeziodal shape, covered with a haze that diffused the edges, making it hard to define the exact shape, It also seemed to have a brighter spot in the center. It was slowly heading towards the park, but as the kids started shouting and pointing, it stopped moving forward, hovered for around 5-10 seconds, then began moving away from us (to the west) getting smaller, but then it was just gone! It was definitely some sort of \"aircraft\". It was not a firework, weather balloon, prop plane or even military plane. We are near the airbase and a small airport, but this was nothing like any of the planes that we see flying overhead. It was super-bright, entirely lit over the body of the object. It literally was flying forward, hovered, then flew back in the direction it came from. Then in an instant it was gone. I've never known a plane that can do that. The children said that when they noticed it and began pointing and shouting, the craft stopped moving towards us, as if it saw them. The object also changed shape when in began moving backwards, from the hazy trapezoid to an elongated oval. It was totally silent, which was strange for how close it was. We (the two adults) may not have even been aware of it if the children hadn't seen it first, even though it was just above the houses. During the event, no one was afraid, just awed by what we saw. Did anyone else see this?"]}