{"trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around June 19th 2009"],"Case Number":"17598","map":"<A HREF = \"http://maps.google.com/maps?q=39.104296,+-94.569397(17598)&iwloc=A&hl=en\"> mufon case (17598) map </A>","divs":["sighting detailswas sitting outside in my midtown kansas city back yard about 10:30-10:45pm talking. i live about 5 miles south of the downtown airport, so it is not unusual to see aircraft flying flow. we noticed two objects in the sky headed in a straight line from south to north (as if they were headed to the airport). the second object was about a second or two behind the first, both traveling in exactly the same line, same speed. at first i assumed they were airplanes. about 2 seconds later, another object came into view -- same size, speed, trajectory as the first two. another second or two later a fourth object followed, and a second or two later a fifth object did the exact same path. all were identical.... i don't believe they were airplanes. i saw no flashing lights, there was no sound (i often hear sound with planes landing downtown, just identical yellow\\orange fireballs streaming through the sky. i have lived in this same location 15 years and have seen many, many planes fly by. the first two objects that went by would not necessarily have caused me to research further. three caught my attention more... five convinced me this was something very unusual."],"Summary":"Fireballs in formation.","Date Submitted":"06/19/2009 10:30 UTC","City":"Kansas City","Country":"United States","Latitude":"39.104296","Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/17598.html.txt","/var/www/straped/mufon/org/17598.html"],"Viewing Distance":"Over One Mile","Region":"Missouri","Object Flight Path":"Straight-line path","Tags":"City","Object Features":"Unknown","Log Number":"US-06222009-0006","Sighting Duration":"Undisclosed","Date of the Event":"06/19/2009 10:30 UTC","Source":"MUFON","Weather Factors":"None","Longitude":"-94.569397","Disposition":"Unknown"}