{"Source":"MUFON","divs":["Sighting DetailsI spent most of my Saturday at Lake Ouachita and when i got back I went to my friends house to hang out. We left the house around 10:10 to go pick up my girlfriend from work to go get a snow cone with our friends. We took two different vehicles because she lives kinda out of the way. So we left the snow cone place and got on the bypass. we were driving along and talking at about 11:00 she pointed out the window and said \"what is that.\" we were on the bypass right before the airport road exit. i found it in the sky as well. It was a big oval sphere looking thing glowing a light orange. So i immediately pulled over to look at it.I had no idea what it could be we were by the airport but there wasn't a white red or green light on it. I rolled down my window to get a better look and no sound was coming from it. Then a white ball of light was dropped from it. the Sphere glided a little more toward the north-east. Then it faded away for a second then came back. There was a flash then it just disappeared. the only thing that i was thinking was what was that. We waited for a little longer but it never came back. So we set off i missed the exit to her house. but on the opposite side of the bypass there was a police officer pulled over with his lights on inside the cabin and it looked like he was writing something down. And then i took her home and waited on her dad and that's it. The whole sighting lasted less than five minutes."],"trends":["There have been 7 other sightings in Hot Springs","There were no other sightings in Hot Springs on or around June 20th 2009"],"Date Submitted":"06/20/2009 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.5082,+-93.04626(17591)&iwloc=A&hl=en\"> mufon case (17591) map </A>","Disposition":"Unknown","Date of the Event":"06/20/2009 11:00 UTC","files":["/var/www/straped/mufon/html2text/17591.html.txt","/var/www/straped/mufon/org/17591.html"],"Viewing Distance":"101-500 Feet, Unknown","Latitude":"34.5082","Object Flight Path":"Hovering then path","Sighting Duration":"00:00:50","Object Features":"None","Summary":"I was taking my girlfriend home after we got a snow cone and saw something we have never seen.","Weather Factors":"None","Object Shape":"Oval","Country":"United States","Region":"Arkansas","Log Number":"US-06212009-0013","Longitude":"-93.04626","Tags":"City","City":"Hot Springs","Case Number":"17591"}