{"Region":"Texas","Weather Factors":"Unknown","Date Submitted":"06/19/2009 02:30 UTC","Object Features":"Undisclosed","Disposition":"Unknown","City":"San Jon","Log Number":"US-06212009-0012","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in San Jon","This sighting has never been favorited."],"Case Number":"17590","Latitude":"35.107558","Longitude":"-103.328565","Object Shape":"Flash","Sighting Duration":"Undisclosed","Summary":"A bright green flash of light with debris falling seen for at least 44 miles.","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsWhile traveling east bound on I40 just about to cross into Texas from NM. It was cloudy, so no moon. Right about 0230 there was a brilliant flash of bright green light that was daylight intense in all directions. There was evidence of burning debris falling. About 20 minutes later I met 4 truck drivers traveling west bound. They were talking about the green flash of light over them! They were in Vega Tx when it happened. They gave me their exact location. They also said they saw what looked like burning debris falling. We both were thinking it happened above us and we were over 40 miles apart. Another driver who I talked to about 1 hour later said he was near Shamrock TX and saw the green flash start \"way above the clouds and went downward\". He could not give a distance estimate, just that is was west of him. There was no sound of anything blowing up. I have served in the military and know what a star shell looks like and ariel burst of munitions looks like. I have never seen anything like this. There was a sherriff near Adrian tx and a state trouper near Vega tx that may have witnessed it. There is also personnel at the NM scale house for the west bound lanes near San Jon NM that may have seen it also. I am a truck driver, just on a routine evening drive. I did not see a 'fireball\" just the entire area as far as I could see in any direction was brilliant green. I have no idea what I saw, only that I saw it."],"Tags":"City","Date of the Event":"06/19/2009 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.107558,+-103.328565(17590)&iwloc=A&hl=en\"> mufon case (17590) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17590.html.txt","/var/www/straped/mufon/org/17590.html"]}