{"Object Flight Path":"Stationary","Date Submitted":"06/20/2009 04:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Insufficient Data","Tags":"City","Case Number":"17592","Weather Factors":"Unknown","trends":["There has been one other sighting in Ocean","There were no other sightings in Ocean on or around June 20th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.791508,+-74.19514(17592)&iwloc=A&hl=en\"> mufon case (17592) map </A>","Summary":"Extremely bright ball of light hovering over Barnegat Bay for over an hour.","City":"Ocean","Latitude":"39.791508","Log Number":"US-06212009-0014","Longitude":"-74.19514","Object Features":"None","Sighting Duration":"01:00:00","divs":["sighting detailsat approximately 4 am on 6\\20\\2009, i was travelling east on michigan ave approaching sheridan st., at the bayfront, in waretown (ocean twp.) new jersey. as i approached the bay i could clearly observe a large extremely bright ball of light hovering above the barnegat bay, approximately a quarter mile west of the barnegat inlet. the sky was clear and i would estimate the the \"ball\" to have been approximately 80'- 100' wide. the object was projecting a direct reflection onto the water, and was hovering aproximately 300 to 400 feet above the water. it was the brightest light i had ever observed in the sky(and i have lived here for over 5 years). i entered my home and travelled to the third floor deck where i retrieved a spotting scope. looking through the scope (which was mounted on a tri-pod) i observed no solid structure, blinking lights, or movement. the object was nearly blinding when observed through the scope. the scope remained in a unchanged position for the duration of the observation, during which time the object never moved, dimmed, or made a sound. at approximately 5 am, the object instantly vanished. it should be noted than on 6\\21\\2009, i mentioned the event to my neighbor to see if he had observed anything similar on that, or any other evening. it was at that time he informed me that during a summer evening in 2008, he had observed a bright ball of light travelling north across barnegat bay. he stated that the object was being chased or followed by 2 fighter jets. he stated that as the object approached the area of barnegat inlet, it made a 90 degree turn, and \"shot\" west across the sky at a speed that was \"to fast to follow with your eyes\". he states that the jets then turned back out over the ocean towards atlantic city. and finally, it should also be noted that this area of barnegat bay is less than 1 mile from the oyster creek nuclear facility."],"Source":"MUFON","Object Shape":"Fireball, Sphere, Star-like","files":["/var/www/straped/mufon/html2text/17592.html.txt","/var/www/straped/mufon/org/17592.html"],"Country":"United States","Region":"New Jersey","Date of the Event":"06/20/2009 04:00 UTC"}