{"Sighting Duration":"00:05:00","Date Submitted":"06/04/2002 11:46 UTC","Summary":"Small luminous spheres, moving around my front yard.","Region":"California","divs":["sighting detailsi was in bed, at the time this happened. ileft my security camera w\\infrared light, recording in slp, at 2300 hrs.thecamera is black26 white, capable to see in the dark, but is a street light in front of myhouse, the camera is pointed to the front lawn and driveway, where i keep mypick-up truck parked.cheking the videotape next morning, i see this sphere,almost moving in front of the lens, then starting to move slowly around, landingin the grass, then going closer to my vehicle, and moving parallel to it fromback to front, then living in way up. this happened at 2346. at 0200 am,something different happened, this luminuos line, with three spheres or ayes,appeared in front of the camera, from botton up, and down and up, like ifscanning the lens! then it vanishes to the left.i have recordings of shortvisits of the spheres on the 6\\29, 7\\5, 7\\12, 7\\14.i have not see this spheresmyself, so i believe may be the infrared bean make them visible to the cameralens. (wich has a filter to make de infrared light visible)anbody else had sameexperience?"],"files":["/var/www/straped/mufon/html2text/1760.html.txt","/var/www/straped/mufon/org/1760.html"],"Country":"United States","Viewing Distance":"20 Feet or Less","Object Features":"Other","Latitude":"34.953034","Longitude":"-120.435719","map":"<A HREF = \"http://maps.google.com/maps?q=34.953034,+-120.435719(1760)&iwloc=A&hl=en\"> mufon case (1760) map </A>","Object Shape":"Sphere","Tags":"City","Log Number":"","Source":"MUFON","Object Flight Path":"Stationary,Other","trends":["There have been 4 other sightings in Santa Maria","There were no other sightings in Santa Maria on or around June 4th 2002"],"Weather Factors":"None, Fog","Date of the Event":"06/04/2002 11:46 UTC","Disposition":"Insufficient Data","City":"Santa Maria","Case Number":"1760"}