{"files":["/var/www/straped/mufon/html2text/17609.html.txt","/var/www/straped/mufon/more/17609_submitter_file1__IMG_3911.JPG","/var/www/straped/mufon/more/17609_submitter_file2__IMG_3825.JPG","/var/www/straped/mufon/more/17609_submitter_file3__IMG_3761.JPG","/var/www/straped/mufon/org/17609.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Latitude":"37.55271","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Photo taken of whitish metal looking object in the sky","Longitude":"-121.979832","City":"Fremont","Viewing Distance":"Unknown","Disposition":"IFO","divs":["Sighting DetailsI was out in my backyard with my cat and my Canon sx10is digital camera snapping photos of Mission Peak (mountain). I was trying out the different modes the camera has. When I was in aquarium mode I decided what the hell snap some photos see what they look like. In the viewer it looked like the sky was much bluer then in any other mode. It was not until I downloaded the photos to my computer and reviewed them on the larger screen that there was this whitish dot. After zooming on the picture closer is when I noticed that it was not a bird but a possible UFO. I have more then 1 photo of this object and it shows up in other parts of the photos. I know it is not a star since it shows up on other photos in other spots. I know for a fact there is no lint on my lens since I clean it all the time. I also know for a fact that it is not an airplane cause there was no planes in the sky at the time. I went back out back and started taking more photos and suddenly this black helicopter showed up which unfortunately I was not able to get the entire copter in but you can see the tail section. It was headed towards Moffett field. The photos I am including were taken on the same day the helicopter is earlier then the UFO photo that I posted but the UFO was there prior to helicopter showing up. I only posted the better of the UFO photos that I currently have taken."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=37.55271,+-121.979832(17609)&iwloc=A&hl=en\"> mufon case (17609) map </A>","Country":"United States","Object Shape":"Circle","Case Number":"17609","Date Submitted":"06/22/2009 12:00 UTC","Date of the Event":"06/22/2009 12:00 UTC","trends":["There have been 25 other sightings in Fremont","There were no other sightings in Fremont on or around June 22nd 2009","This sighting has never been favorited.",""],"Log Number":"US-06222009-0017","Region":"California"}