{"Region":"Nevada","files":["/var/www/straped/mufon/html2text/17607.html.txt","/var/www/straped/mufon/more/17607_submitter_file1__page1photo1.jpg","/var/www/straped/mufon/org/17607.html"],"Date of the Event":"05/28/2009 05:30 UTC","Object Features":"Other","Summary":"Secret USAF disc being tested near Las Vegas as a possible case for the Mufon Star Impact Project.","Longitude":"-115.168916","Object Flight Path":"Hovering then path","divs":["sighting details my name is ben woods and i have been published in both magazines and online as having access to where and when the usaf secretly test flies their et disc. on a recent expedition taken may 28th we collected enough images to submit to the star impact project. i have included one of the photos in the attachment and some additional information has been posted at http:\\\\www.secretetsaucers.com it is the website i use to post research results during correspondence with ufologists on my mailing list. during this incident i was positioned at an observing location just outside of las vegas with a photographer and portable observatory. the photo camp includes 1 tracking camera, 1 meade lunar planetary imager placed into a 800mm tracking telescope and 1 3.2ghz cpu with 19 inch monitor. we waited until 5:30am which was the scheduled test time for the disc and when it was picked up by the tracking camera at about 5:35am we began collecting images. the disc has several unique flight characteristics that can be seen during the tests. the major \"action or motion\" that can be observed is hover flight. it also exhibits zig zag motion..nothing like conventional flight. i am available now to accomodate and discuss research objectives mufon and sip may have. i had contacted mr. carrion last month and he has been waiting for my information. once i have been contacted through the email account i provided here i can send over my phone number. ben woods"],"Weather Factors":"None, Windy","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around May 28th 2009","This sighting has never been favorited.",""],"City":"Las Vegas","Latitude":"36.122716","Case Number":"17607","Viewing Distance":"Over One Mile","Sighting Duration":"02:00:00","Disposition":"Insufficient Data","Source":"MUFON","Log Number":"US-06222009-0015","Date Submitted":"05/28/2009 05:30 UTC","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.122716,+-115.168916(17607)&iwloc=A&hl=en\"> mufon case (17607) map </A>","Object Shape":"Disc"}