{"Country":"United States","trends":["There have been no other sightings in Harmar","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.545741,+-79.835277(17608)&iwloc=A&hl=en\"> mufon case (17608) map </A>","City":"Harmar","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17608.html.txt","/var/www/straped/mufon/org/17608.html"],"Date of the Event":"06/16/2009 01:39 UTC","Date Submitted":"06/16/2009 01:39 UTC","Case Number":"17608","Weather Factors":"Unknown","Latitude":"40.545741","Disposition":"Hoax","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","divs":["Sighting DetailsHarmar, Allegheny County, 14 miles N of Pittsburgh, PA off the PA Turnpike. Have a new vacation house on the Allegheny River in Harmar, PA across from famous Oakmont Country Club Golf Course. We were wiring paddle fans late when I went onto the porch facing the river to get something. Noticed crazy flashing multiple lights over Oakmont C.C. that gave me flashback to my sighting in Murrysville on 5-22-09. Grabbed Sony HDR-XR500 with 1.7 tele converter lens and started shooting, first in Nightshot, then Low-Lux. I've seen a lot of planes & helicopters where I live and this didn't look like anything I've ever seen. It looked first like a race car or choo-choo at first, then finally a more plane-like appearance. In review of the video, I could see that it's 'tail' end appears to change position. The lighting patterns are not consistent, some lights go out, and then towards the end the lights are straight across--flashing again in a non-consistent pattern. At no time did I see a GREEN right side navigation light which is FAA requirement. At no time during or after did I hear ANY NOISE whatsoever from the craft which was about 100. It cruised above the tree line, then turned downward dipping into the Allegheny River basin behind some trees on 12-mile Island (in the middle of the river) in the direction of Oakmont Yacht Club. It was not heading towards any airport around here. There are no airports anywhere near here. I'm trying to request a radar report, but the FAA sight has a \"page error\", of course (not that they would give me it anyway). I've witnessed several different types of UFOs, but this one is unique. It reminded me of the type seen and filmed by John Lenard Walson in outer space and is posted also on Youtube channels: JohnLenardWalson & GRIDKEEPER. They are too freaky to be seen in daytime, so perhaps that's why we've no daytime footage yet. The size of my really cool HD video is too large to upload here, so please go to my Youtube Channel name: seeingUFOsPA to see this video and my other sighting videos in HD. If anyone KNOWS EXACTLY what this is and HAS VIDEO PROOF of night lighting, etc., they can upload it on YT as a video response. Hearsay of \"secret government projects\" will not be accepted."],"Object Features":"Undisclosed","Object Shape":"Unknown","Longitude":"-79.835277","Summary":"Low altitude strange UFO that changes light patterns by Pittsburgh.","Log Number":"US-06222009-0016","Viewing Distance":"Unknown","Region":"Pennsylvania"}