{"Log Number":"US-06232009-0004","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/17616.html.txt","/var/www/straped/mufon/org/17616.html"],"Latitude":"45.524992","Region":"Oregon","Longitude":"-122.669307","Country":"United States","Summary":"Walked out to patio, saw very bright light. Maybe planet but odd place for planet.","Object Flight Path":"Stationary","Date Submitted":"06/23/2009 04:22 UTC","Viewing Distance":"Over One Mile","City":"Portland","Disposition":"IFO","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around June 23rd 2009"],"Date of the Event":"06/23/2009 04:22 UTC","divs":["sighting detailsi live in a direct plight path of pdx. planes fly over my house daily. in fact, a plane flew by at 4:44 this morning; it probably landed around 4:48 and it is very possible someone on that plane saw it. this was a very bright, white \"star\" but much lower than we could normally see a star and day was breaking and no other stars were visible. it wasn't the flashing green\\red that we all used to see so often in the '70's. i thought about a satelite but it stayed completely stationary for a full hour and i don't know if satelites do that. it was in the eastern sky, i can't tell you how high up but i would say that if a plane were that low i would at the least be able to make out that it was a plane. i really dreaded contacting you since i did this one before and we determined we saw a satelite and two planets all on the same night. i questioned at first if that was all it was but decided i was sure about it so left it at that. this time however, i really can't guess what it could be so... being aware of your knowledge of the goings on in the portland skies i thought i would just check in and perhaps you could enlighten me. i don't know how long it was out there but i finally came inside after standing there freezing for an hour. as far as \"where\" in the sky....the best way i could describe it would be it looked like it was directly above the cascade outlets in troutdale. it is quite possible that it was further east than that but i would guess that would be the vicinity regarding it's position. anyway, so i'm probably sounding like a nut by now but i really wonder if the pilot or passengers on the plane this morning saw it and mostly wonder if it is in fact \"un\" identified. thanks for your time, terri"],"Tags":"City","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.524992,+-122.669307(17616)&iwloc=A&hl=en\"> mufon case (17616) map </A>","Case Number":"17616","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON"}