{"Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=40.491107,+-106.823726(17615)&iwloc=A&hl=en\"> mufon case (17615) map </A>","Source":"MUFON","Weather Factors":"None","trends":["There have been 2 other sightings in Steamboat Springs","There were no other sightings in Steamboat Springs on or around June 22nd 2009"],"divs":["sighting detailsit is a particularly bright star night, no moon, very good sky detail. i was on a very dark street away from light pollution walking dog. flashes in sky caught my eye. i found the point and noted it to be moving slowly from east to west (approx) and alternating between a faint white pulse and a bright white pulse. the pulses were not at regular intervals. the object could be failty made out (very dim) between pulses. i noticed another object more to the south and moving in a similar direction but more to the sw than w. it exhibited the same irregular pulses. there were at least 2 aircraft visible in the sky during this time with their distinct red\\blue\\white strobes. this did not seem to be like a satelite which may become brighter or dimmer as it traverses the sky but it remains more constant due to its illumination by the sun. i was puzzled by this object's irregular pulsating patern, one expects an aircraft or to have a very predictable strobe patern and of course the expected colors of aircraft strobes. this object seemed to be in space, its color was that of the surrounding stars but it was moving in a plane that was not consistant with a satelite. the second object was moving at a similar speed but in a slightly different direction to the southwest. i had to tend to the dog who was getting restless as i stood in the road staring at the sky for over 10 minutes. once i returned to my house i lost view of the part of the sky where the objects were."],"Object Features":"Unknown","Log Number":"US-06232009-0003","Summary":"2 pulsating points moving E to W, irregular interval flashes.","Disposition":"Insufficient Data","Date of the Event":"06/22/2009 11:35 UTC","Viewing Distance":"Unknown","Region":"Colorado","Object Flight Path":"Straight-line path","Date Submitted":"06/22/2009 11:35 UTC","files":["/var/www/straped/mufon/html2text/17615.html.txt","/var/www/straped/mufon/org/17615.html"],"Case Number":"17615","Country":"United States","Tags":"City","City":"Steamboat Springs","Latitude":"40.491107","Longitude":"-106.823726","Sighting Duration":"Undisclosed"}