{"Viewing Distance":"Over One Mile","Object Shape":"Sphere, Square, Rectagular, Unknown","Weather Factors":"Unknown","Log Number":"US-06222009-0018","Sighting Duration":"Undisclosed","Case Number":"17610","Object Flight Path":"Stationary","Summary":"Bright night object rotating colors.","Date of the Event":"06/22/2009 03:30 UTC","Region":"Texas","Source":"MUFON","divs":["sighting detailsi had opened our garage door and was walking some trash to the garbage can on the street for next day pick-up. just above the neighbors tree across the street, i noticed a very bright object. i first thought it was an airplane with landing lights on. but almost immediately dismissed that idea. number one, my house isn't in line with a major airport unless the aircraft is approaching from the north\\north east (this object was west northwest). number two, i noticed that it was \"rotating\" its' colors (unlike an aircraft with stationary wingtip and tail lights). number three was that it was stationary, like a star but obviously not. i watched it for several minutes. when i realized that it wasn't moving off, i ran into the house to get my camera and tripod. i had enough time to mount the camera, get back outside and set it up... it was still there! just hovering way off in the distance. so i zoomed in on it the best my little cam could do and shot some video. (i've attached that video to this report. the camera is a kodak easy share z612. unfortunately, the auto focus motors are audible when viewing the video. sorry about that.) in the video, it appears that the object goes completely dark every second and a half or so... it didn't. it's just that my cam couldn't pick up the \"dim times\". i was watching it the whole time, it would go dim then bright, dim and bright, all the while with the rotating colors. this may sound a little dumb, but i'd heard that there a a few people who can and have contacted visitors vessels psychically. that when this was done, the object would move toward the person... hover, etc. i tried this to no avail. it just hung in the sky like a multi-colored, multi-faceted rotating gem. i was unable to put a \"shape\" to it because it was just too far away. \"t\" [cms\\tg\\pid]"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/17610.html.txt","/var/www/straped/mufon/more/17610_submitter_file2__My_location-redacted.jpg","/var/www/straped/mufon/org/17610.html"],"trends":["There have been 14 other sightings in Cedar Park","There were no other sightings in Cedar Park on or around June 22nd 2009","This sighting has been favorited 1 time.",""],"Date Submitted":"06/22/2009 03:30 UTC","Disposition":"Hoax","Latitude":"30.510108","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=30.510108,+-97.813509(17610)&iwloc=A&hl=en\"> mufon case (17610) map </A>","Country":"United States","City":"Cedar Park","Longitude":"-97.813509"}