{"map":"<A HREF = \"http://maps.google.com/maps?q=-26.194703,+28.048305(17617)&iwloc=A&hl=en\"> mufon case (17617) map </A>","City":"Johannesburg","Tags":"City","Date of the Event":"05/20/2009 07:00 UTC","divs":["Sighting DetailsWhilst watching an evening soccer match at a sports club in Houghton Johannesburg, South Africa, myself and several other parents and children at first noticed a large orange orb-like structure moving slowly from north to south and was very high up. After a few minutes this stopped moving and just hovered stationary in the sky. Soon thereafter 4 others followed in the same sequence, height and distance from each other forming a line at a slight 45 degree angle. These too stopped moving and just hovered in the sky. A few minutes later one by one and in order they moved at a 90 degree angle upwards into the night sky until they disappeared. This took several minutes. About l5 minutes later, another 7 followed from the same direction and in exactly the same way. They too disappeared very slowly upwards until they were out of sight. This whole process took around a half hour. During this time a light small plane and helicopter was seen flying well below these orbs, so we could easily see the difference and wondered if these planes had spotted them. Everybody on the field was distracted and very excited about what we were seeing. It was almost surreal to us, as it was a sighting nobody ever thought they would see. After returning home I called the local airports and around town to confirm that nothing out of the ordinary was going on, which wasnt. I called the radio stations to report this incredible sighting and emailed the local newspaper who did publish an article about this sighting. In response, other people reported seeing this sighting too in the area that night. One man confirmed he saw exactly the same kind of sighting 40 years in Johannesburg with his wife and daughter and has never forgotten this. All of us were amazed at this unbelievable sighting and were very excited, but confused as to what these could have been. Unfortunately nobody had a strong enough lensed camera to try and take photos and we only had cellphone cameras on us. With the lights from the field, we could not capture any good photos. This was an experience that we all shared together and will never forget."],"Object Features":"Undisclosed","Date Submitted":"05/20/2009 07:00 UTC","Case Number":"17617","Log Number":"ZA-06232009-0005","Object Flight Path":"Undisclosed","Region":"Gauteng","Latitude":"-26.194703","Summary":"Several orange orbs seen moving one at a time and then stopped for several minutes before disappearing.","trends":["There have been 3 other sightings in Johannesburg","There were no other sightings in Johannesburg on or around May 20th 2009"],"Longitude":"28.048305","Source":"MUFON","Country":"South Africa","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17617.html.txt","/var/www/straped/mufon/org/17617.html"],"Object Shape":"Circle, Sphere","Weather Factors":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown"}