{"trends":["There have been no other sightings in at Gross Reservoir","This sighting has never been favorited."],"Source":"MUFON","Region":"Colorado","divs":["Sighting DetailsI was at Gross Reservoir from all night fishing on the southern boat ramp. During dawn, 5:30 am or so, a strange sound came up the canyon from the west that sounded like a loud humming sound, very fast vibration like a humming bird. I looked to my left and saw two objects moving low across the water. The objects then made a hard left turn and accelerated at a high rate of speed over the mountains. The objects were hard to make out as they seemed to warp light. The objects looked to be the size of a hot-tub. They had the appearance of black stars that \"twinkled\" with black rays of distortion. When they turned they turned in formation and retained consistent distance form each other the whole time. They also banked to the left in unison during the turn as if it where one object. They moved in such a way that it was evident that they were not using aerodynamics for propulsion or maneuvering. I would guess that they were moving at 30-50 mph over the lake and over 600 mph as they moved away. My best guess is that these are government vehicles, but who knows."],"Object Flight Path":"Undisclosed","Latitude":"39.553251","Date Submitted":"06/20/2009 05:00 UTC","Case Number":"17614","Sighting Duration":"Undisclosed","City":"at Gross Reservoir","Summary":"two small sized objects swoop in over water at \"low\" speed, turn in formation and take off at high rate, strange humming sound.","map":"<A HREF = \"http://maps.google.com/maps?q=39.553251,+-105.777997(17614)&iwloc=A&hl=en\"> mufon case (17614) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/17614.html.txt","/var/www/straped/mufon/org/17614.html"],"Disposition":"Hoax","Object Features":"Undisclosed","Log Number":"US-06232009-0002","Longitude":"-105.777997","Date of the Event":"06/20/2009 05:00 UTC","Tags":"City","Weather Factors":"Unknown","Object Shape":"Unknown","Viewing Distance":"Unknown"}