{"Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/17624.html.txt","/var/www/straped/mufon/org/17624.html"],"Longitude":"-83.412334","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=42.74008,+-83.412334(17624)&iwloc=A&hl=en\"> mufon case (17624) map </A>","City":"Clarkston","Log Number":"US-06232009-0012","trends":["There have been 10 other sightings in Clarkston","There were no other sightings in Clarkston on or around August 11th 1994"],"Object Features":"Unknown","Sighting Duration":"02:00:00","Case Number":"17624","Country":"United States","divs":["Sighting DetailsWell One Night When I was 14 or 15 in 1994 I belive Me And My so called Friend where just hanging out at my Parents House and My Friend Said let's go out side for some fresh Air So I said sure.Then He noteiced an Airplane and said that it look like it was going to crash.I did not see anything!So We went down the driveway and we saw a landed U.F.O. disk shaped with alot of differend colored lights flashing in a horasantal pattern so I was watching the lights and next thing I know I am standing back at the end of driveway and no U.F.O. but my intuiuion told me to look up into the sky and I saw what looked like an airplane untell A sideways lightning bolt flashed and the ship dissipeared.Then I ran up driveway and my friend was like what are you doing.Like he did not even care abought what just happened I went inside and my brother said I was gone for a lond time I figger it took me 1 and a half hours to walk down the driveway and back.I am always seeing weird things in the sky nowadays last thing I saw was a brown disk shaped almost seethrough fly by my appartment slowley and then fly to canada.I have had nightmares abought U.F.O.s Hear is how my dream went I was happy walking with 4 frineds when I saw a dot in the sky then my friend wher frozen in time kinda shaking back and forth then the sky turned red and the U.F.O. was doing airal monuvers that when unreal so I ran I went into a house and it was dark and dirty there was some gross food boiling on plates on a tabel and I finley woke up after haveing dogs bite my privits in my dream.It was Probley the most scary nightmare In my 15 year nightmare every night campain. If You Can help me look of implants or just with dealing with this nightmare I call life."],"Region":"Michigan","Date of the Event":"08/11/1994 10:12 UTC","Viewing Distance":"21-100 Feet","Date Submitted":"08/11/1994 10:12 UTC","Latitude":"42.74008","Object Flight Path":"Other","Summary":"Abduction.","Object Shape":"Disc","Source":"MUFON"}