{"Object Shape":"Triangle","Disposition":"Unknown","Date of the Event":"02/12/2003 12:00 UTC","Date Submitted":"02/12/2003 12:00 UTC","Longitude":"-71.5151","trends":["There have been 66 other sightings in South Kingstown","There were no other sightings in South Kingstown on or around February 12th 2003"],"Sighting Duration":"00:10:00","Latitude":"41.487649","files":["/var/www/straped/mufon/html2text/17623.html.txt","/var/www/straped/mufon/org/17623.html"],"Summary":"Large black triange with 3 oval very bright lights at rear shining down on road.","map":"<A HREF = \"http://maps.google.com/maps?q=41.487649,+-71.5151(17623)&iwloc=A&hl=en\"> mufon case (17623) map </A>","Region":"Rhode Island","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Object Features":"None","divs":["sighting detailsthis event was related to me casually by a local carpenter working at my house this winter, 2008-2009, named [cms\\tg\\pid], aged 27. he was about 21 at the time of the sighting. he told me while driving home on rt. 1 in south kingstown, near perryville, heading northerly, with the matunuck beach exit on his right, he saw ahead what he thought was a low flying plane or helicopter with bright searchlights shining down, illuminating the road ahead. as he got closer he realized it was neither, but a triangular shaped object, black, with a row of 3 bright white lights at the rear shining down on to the road surface. he stopped about 100 yds in front of the object, got out, and watched in disbelief at this large, silent object, floating over the road and then drifting southerly toward matunuck town beach and the small community of mary and roy capenters beach shanties. there were no other cars on the deserted road and no other witnesses that he knows of. he said it 'freaked him out' and he drove home fast to wakefield. he only related this to me because i told him about my close encounter in perryville nearby to where he saw this similar object. he said he had no missing time or other unusual disturbances."],"Log Number":"US-06232009-0011","City":"South Kingstown","Tags":"City","Source":"MUFON","Viewing Distance":"101-500 Feet","Case Number":"17623"}