{"Log Number":"US-06232009-0014","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around June 21st 2009"],"Disposition":"IFO","Longitude":"-96.776634","files":["/var/www/straped/mufon/html2text/17626.html.txt","/var/www/straped/mufon/org/17626.html"],"Region":"Texas","Weather Factors":"Unknown","Sighting Duration":"00:01:30","Object Features":"Unknown","Tags":"City","Date of the Event":"06/21/2009 12:00 UTC","divs":["Sighting DetailsExactly around 3:30 AM my wife and I were sitting outside talking when this very bright sort of orange or amber glowing light appeared in the sky. Now, in my backyard there's a cluster of small trees that obscure the sky so when I say \"appeared\" I think that it might have come from that area. As soon as I saw it I immediately jumped up moved to get a better look (there's a few big pine trees in my yard). It was very bright and pulsating and slowly moving west. I will also say that it closely resembled a very bright Venus in the early night sky. Sort of star like. Now it only lasted about about a minute and a half then just vanished. I have seen a flare before and this was no flare. It was way to high up in the sky. There were no planes near and no noise. Now, I do not think I would have posted that had it not been for another event similar to this. My wife and I were on a vacation recently (much needed) when we saw something very similar to this. We were on the beach, probably around 9:30 pm, there was a full moon so the sky was very lit up. I was just gazing up at the stars when I noticed one that seemed oddly bright and colored(orangish). I also noticed that it seemed to be moving very slowly. Not being the expert here, it is impossible to gauge the height and speed in which it was moving. But, we all three saw it and then it just slowly faded out of sight. As if it were moving up and out, not across. This lasted about 5 minutes. I have seen plenty of satellites. I do not believe it to have been a satellite. That date was July 7th, 2009. Just thought I would share these two experiences and I'm glad there is a place to share it. :)"],"City":"Dallas","Object Flight Path":"Straight-line path,Path then hovering","Summary":"Bright orange pulsating sphere appeared moving slowely in the sky then just vanished","Country":"United States","Date Submitted":"06/21/2009 12:00 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Sphere, Star-like","Case Number":"17626","map":"<A HREF = \"http://maps.google.com/maps?q=32.789707,+-96.776634(17626)&iwloc=A&hl=en\"> mufon case (17626) map </A>","Latitude":"32.789707"}