{"Viewing Distance":"Unknown","Longitude":"-79.691525","Case Number":"17628","Date of the Event":"06/13/2009 12:27 UTC","Tags":"City","Object Shape":"Square, Rectagular","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around June 13th 2009","This sighting has never been favorited.",""],"divs":["sighting detailsmurrysville, pa: after multiple night time sightings including bright pinpoint flashes, i wondered if daytime \"glints\" were related and not just my eyes messing with me. after researching, i ordered an x-nite xdr ir infrared) filter for my new hd sony camcorder hdr-xr500. i had just received it on the 12th. getting ready to leave the house at 12:27 pm, i was sitting at my vanity table with a window above it in my bedroom. glancing up, i saw those \"glints\" again in the sky above the 40ft. pine trees in yard. so, i ran and got the camcorder and put the filter on and shot through the window glass. it only took about a minute to catch it on film whizzing by to the right. the 2 kids were in the garden and perhaps it wanted to check them out. i'm posted two still frame pictures here of blowups from that video. it seems to have a flat bottom and block-ish in shape in one still, but different looking in each frame-by-frame. there were other things caught with this method during the 2 minute shoot, but this one was undeniably not a plane\\bird\\bug etc. there is a cool mechanical whizzing sound when it goes by and strange horizontal streaks on some stills. perhaps the ufo affected the camcorder or it's from some other cause. the video footage was captured in hd 1920 x 1080i and the large hd movie file is uploaded on my youtube channel named: seeingufospa http:\\\\www.youtube.com\\watch?v=wjhk8axzolw check it out!"],"Weather Factors":"Unknown","Date Submitted":"06/13/2009 12:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.434402,+-79.691525(17628)&iwloc=A&hl=en\"> mufon case (17628) map </A>","City":"Murrysville","Summary":"Murrysville: Square-ish UFO daytime capture w/Infrared filter & nightshot.","Object Flight Path":"Stationary","Object Features":"Undisclosed","Log Number":"US-06232009-0016","files":["/var/www/straped/mufon/html2text/17628.html.txt","/var/www/straped/mufon/more/17628_submitter_file1__MurrysvilleUFO6-13-09(1).JPG","/var/www/straped/mufon/org/17628.html"],"Country":"United States","Disposition":"Unknown","Latitude":"40.434402","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Source":"MUFON"}