{"Object Shape":"Unknown","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been no other sightings in London Edgware","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/17622.html.txt","/var/www/straped/mufon/more/17622_submitter_file1__P6235270crop.jpg","/var/www/straped/mufon/more/17622_submitter_file2__P6235273crop.jpg","/var/www/straped/mufon/org/17622.html"],"Longitude":"-0.262034","Latitude":"51.615786","City":"London Edgware","Country":"United Kingdom","Sighting Duration":"Undisclosed","Region":"England","Date of the Event":"06/23/2009 07:11 UTC","Date Submitted":"06/23/2009 07:11 UTC","Disposition":"Unresolved","Log Number":"GB-06232009-0010","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.615786,+-0.262034(17622)&iwloc=A&hl=en\"> mufon case (17622) map </A>","Tags":"City","Viewing Distance":"Unknown","Case Number":"17622","Weather Factors":"Unknown","Summary":"Pictures of possible UFO high in sky London, June 23, 2009.","divs":["Sighting Details***I have cropped the images on all but one of the object I saw. The one large file is just an original .tiff file from the bunch.*** I have been watching the Skies for a good couple of years at ciggie breaks and lunchtimes, and when ever I have a cigarette in the garden at home. I am about 10-15 miles approx from Heathrow airport and the sky above me is a pretty busy place most of the time. Tonight though I was in the garden have a smoke looking at the sky as I always do, and I got a glint of something shiny high up in the sky. I thought could this be it my first UFO? I watched and this glinting seemed very strange but so so far away I didn't know what it could be. I watched for about a 2 minutes and it remained in the same place. Visual explanation of what I was looking at is not easy, just was not anything normal. I decided to take a chance and run for the camera, I took about 4 .jpg files and 9.tiff files. Just holding down the shutter. I decided at this point to grab the binoculars as they were only 10 feet away in the kitchen, I ran for them, and in that matter of seconds it was gone! leaving me very disappointed that I had not seen it closer up, but very happy that for me I believe I was looking at something not from this world .. possibly."]}