{"Sighting Duration":"00:04:00","Latitude":"41.399824","Date of the Event":"04/05/2007 09:30 UTC","Longitude":"-71.561171","map":"<A HREF = \"http://maps.google.com/maps?q=41.399824,+-71.561171(17621)&iwloc=A&hl=en\"> mufon case (17621) map </A>","Date Submitted":"04/05/2007 09:30 UTC","Log Number":"US-06232009-0009","Source":"MUFON","Region":"Rhode Island","City":"South Kingstown","Disposition":"Unknown","trends":["There have been 66 other sightings in South Kingstown","There were no other sightings in South Kingstown on or around April 5th 2007"],"files":["/var/www/straped/mufon/html2text/17621.html.txt","/var/www/straped/mufon/org/17621.html"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"17621","Object Features":"None","Summary":"Low, hovering, dark chevron craft with huge white light, small green light.","Country":"United States","Tags":"City","Object Shape":"Boomerang, Chevron, Triangle","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsReturning from a night class at the Univ. of Rhode Island, I approached the intersection of Post Rd. and Ministerial Rd whereupon I noticed a huge, perhaps 20 ft in diameter, yellowish white circle of light hovering above a house at the above intersection. I knew it should not be there, so I drove to the closest point under the light near Pitcher's Garage, but closer to the intersection. The light just hovered, made no sound, so I got out of my car to get a better look...I could barely make out the very dark outline of the craft, about the size of a small jet liner..I think I remember another white light at the other 'wing tip.' In the center of the craft was a small 'electric green' flashing light, a medium pretty shade of green. One car came out of a side lane next to me but quickly sped off..I don't know if they saw the craft and paniced or what, but they drove off in a hurry. I stayed and watched the craft. No other people were on the street. As I observed the craft I had a feeling of time slowing down right where I was...an odd feeling. Otherwise, nothing unusual. The craft then slowly pivoted, very smoothly, and drifted north on Ministerial Rd and perhaps to the east a bit, over the treeline, where I lost sight of it. I then called the South Kingstown police to report it. The dispatcher, a woman, took my call seriously but reported no one else reporting this object. I gave her a description of the craft. I then drove the two miles home in amazement of what I saw. There was no missing time or other phenomenom."],"Weather Factors":"Unknown"}