{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Region":"North Carolina","Source":"MUFON","Object Shape":"Flash","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/17635.html.txt","/var/www/straped/mufon/org/17635.html"],"divs":["Sighting DetailsIn the country fields of Johnston county. We were looking at the stars and talking about UFO's and the possibilities of life when we were both facing the south and looking directly at the big dipper. Now if you were to point towards the dipper and then draw your hand down 45 degrees facing south..this is the point of the sky we were observing. After a few minutes a bright light appeared with no origin - meaning you did not see it move from left to right as in the path of direction in flight but directly center of where we both were looking. It flashed brightly then would vanish for a few seconds then it would appear again but distance farther again not going right or left but towards space. I asked my friend if he saw it and as soon as the flash would appear we would alternate confirming the object. It was not a dual flash like most planes and it was inconsistent in length of delay between appearing and vanishing. We wanted to believe it was a plane because it seemed corny and wishful seeing that the object would just appear after talking about it but after we both discussed the possibilities to justify the flashes it was a standstill and we had to accept what we were seeing. Again - the fact this object seemed within the atmosphere of earth as to its brightness and closeness compared to the other stars and to show up without any origin has us mystified."],"Longitude":"-79.0098","Disposition":"Hoax","Latitude":"35.764963","Date Submitted":"06/23/2009 12:00 UTC","Object Features":"Undisclosed","Date of the Event":"06/23/2009 12:00 UTC","Summary":"Bright light flashes every few seconds as it slowly faded into the distance towards space with no origin.","Tags":"City","Country":"United States","trends":[],"Log Number":"US-06232009-0023","City":"Undisclosed","Case Number":"17635","map":"<A HREF = \"http://maps.google.com/maps?q=35.764963,+-79.0098(17635)&iwloc=A&hl=en\"> mufon case (17635) map </A>","Sighting Duration":"Undisclosed"}