{"Longitude":"-82.990704","Summary":"Two large bright lights circled by a colorful halo, shined light in her face","Log Number":"US-06232009-0021","files":["/var/www/straped/mufon/html2text/17633.html.txt","/var/www/straped/mufon/org/17633.html"],"Latitude":"38.740403","Country":"United States","Date Submitted":"08/31/2006 10:30 UTC","Case Number":"17633","Disposition":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Object Shape":"Circle, Saturn-like","Object Flight Path":"Straight-line path","Weather Factors":"None","Tags":"City","Viewing Distance":"21-100 Feet","City":"Portsmouth","trends":["There have been 6 other sightings in Portsmouth","There were no other sightings in Portsmouth on or around August 31st 2006"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsAbout 3 years ago the witness was driving down 52 east when she observed 2 very bright lights circled with a rainbow color halo. There was some steam or smoke coming from the back of the lights. She became very afraid because the lights where right above her. She felt she might be abducted or something. She really became afraid when the light shined in her car right on her face on the drivers side of the car. She doesn't remember much else just that she was afraid and could not wait to get home. She never told anyone until she told her grandson. Janet Moore has had another sighting about 40 years ago. Her and her husband observed a saucer shape craft with multi color windows going around the center of the saucer. She was just across the street from the saucer. It was just above a building, hoovering, making no sound. It was huge about 60 ft. long. She does not know why but they did not stay and watch it. Again she did not tell anyone until her grandson got more intvolved in his sightings. Janet was also a witness to her daughters sighting about 2 weeks prior to her grandsons sighting on 5-12-2009. She saw a oval light just above the trees that was very bright. Just as she saw it, it vanished."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.740403,+-82.990704(17633)&iwloc=A&hl=en\"> mufon case (17633) map </A>","Date of the Event":"08/31/2006 10:30 UTC","Region":"Ohio"}