{"Weather Factors":"Light","map":"<A HREF = \"http://maps.google.com/maps?q=53.006188,+-2.177644(17632)&iwloc=A&hl=en\"> mufon case (17632) map </A>","Object Features":"None","Disposition":"IFO","Log Number":"GB-06232009-0020","trends":["There have been 8 other sightings in Stoke-on-Trent","There were no other sightings in Stoke-on-Trent on or around June 23rd 2009","This sighting has never been favorited.",""],"Region":"England","Tags":"City","Source":"MUFON","divs":["Sighting DetailsDrove up onto Black bank, Knutton, because of the very good views up there. The night sky was unusually light tonight. I had just returned from delivering some photos to a colleague. I'd been working on them late. I couldn't see a suitable place to park so drove back down the bank and as I did I noticed the red light. Say a red light appear from the south east over Stoke on Trent. it disappeared but reappeared quite low, seemed to be moving northwards then slowed right down. remained in same area for a long time. Managed to take some photos but without a tripod they were a bit blurry. Some shots do show light in the sky and some suggest a solid shape. Its actions were unremarkable really save to say that whatever it was it was pretty low. It moved slowly, but not in any special or eye catching way. A couple of times I thought I saw other objects but cant be sure. At first I thought it might be a plane, but it was too low, then I wondered if it might have been the police helicopter but they usually have a searchlight when hovering. the object was observable for a few minutes and then just disappeared."],"Summary":"Bright red light appearing then disappearing.","Longitude":"-2.177644","Object Shape":"Disc, Oval, Star-like","Sighting Duration":"Undisclosed","Country":"United Kingdom","Viewing Distance":"Over One Mile","City":"Stoke-on-Trent","files":["/var/www/straped/mufon/html2text/17632.html.txt","/var/www/straped/mufon/more/17632_submitter_file1__auto-color.jpg","/var/www/straped/mufon/more/17632_submitter_file2__7arrow.jpg","/var/www/straped/mufon/more/17632_submitter_file3__2-arrow.jpg","/var/www/straped/mufon/org/17632.html"],"Object Flight Path":"Hovering then path","Date Submitted":"06/23/2009 11:40 UTC","Date of the Event":"06/23/2009 11:40 UTC","Latitude":"53.006188","Case Number":"17632"}