{"Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.570472,+-85.127144(17648)&iwloc=A&hl=en\"> mufon case (17648) map </A>","Country":"United States","divs":["Sighting DetailsWhile delivering newspapers on CR 274 Southwest of Altha Fl., I stopped at a paper tube near the intersection of CR 274 an Hannah Tower Rd..This location is on top of a hill overlooking the Chipola River Basin to the Southwest.As I looked ahead to the Southwest I saw what at first appeared to be stadium lights sitting motionless just above the tree line near the intersection of CR 274 and SR 73. The lights were amber in color and consisted of four separate banks containing eight lights each.I had been at this location every early morning for the previous four years and had never witnessed this before. From my vantage point on top of the hill I could clearly see the security lights at the several homes between my location and the point of interest.I know this area very well, delivering papers as well as visiting the area countless times over the past fourty-odd years. The lights on the object were very large and covered a horizontal distance of several hundred feet, estimated in relation to the the other known area features, (home security lights, tree line). I watched this object for approximately 15 mins. and decided to drive toward it, (SW on CR 274), down into the river basin, accross the Chipola River at Willis Bridge in an attempt to get closer to the object. As I arrived at the intersection CR 274 and SR73, (appox.5 min.) I stopped and got out of the truck. I looked intently in every direction but I was unable to locate the object."],"Summary":"While delivering newspapers I watched amber colored, stadium size lights sit motionless just above the tree line.","Object Features":"Unknown","Object Shape":"Square, Rectagular","Weather Factors":"Unknown","Region":"Florida","Tags":"City","Sighting Duration":"00:15:00","trends":["There have been no other sightings in Altha","This sighting has never been favorited."],"Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Latitude":"30.570472","City":"Altha","Longitude":"-85.127144","Case Number":"17648","Log Number":"US-06242009-0013","files":["/var/www/straped/mufon/html2text/17648.html.txt","/var/www/straped/mufon/org/17648.html"],"Date Submitted":"03/10/2003 05:30 UTC","Date of the Event":"03/10/2003 05:30 UTC"}