{"trends":["There have been no other sightings in Cutler","This sighting has never been favorited."],"Date Submitted":"10/31/1959 12:00 UTC","Weather Factors":"Unknown","Case Number":"17646","Longitude":"-89.565651","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17646.html.txt","/var/www/straped/mufon/org/17646.html"],"Object Flight Path":"Hovering then path","Date of the Event":"10/31/1959 12:00 UTC","Object Shape":"Egg","Tags":"City","Region":"Illinois","Summary":"It hovered over me and my 2 friends and then shot up and took a right turn.","Viewing Distance":"101-500 Feet","City":"Cutler","Object Features":"None","Latitude":"38.032273","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Log Number":"US-06242009-0011","map":"<A HREF = \"http://maps.google.com/maps?q=38.032273,+-89.565651(17646)&iwloc=A&hl=en\"> mufon case (17646) map </A>","Country":"United States","divs":["Sighting DetailsI was in the seventh grade and two brothers who were my friends were going with me to the grade school to board a bus for a basket ball game. We were no more than 100 feet from their house when the area around us was lit up. We looked up and saw hovering over us a light without sound, shaped like an egg. This thing was a brilliant light and since I was interested in space, I was pretty well acquainted with what we had in terms of airplanes and rockets, and I knew this was not anything that existed on earth; it must have been an alien craft. I and the eldest of the two brothers attempted to get the younger one to go back to the house and get a camera but he was as fascinated by this sight as were we and he refused to go. So we began shouting for their mother and as she came out on the front porch, the thing shrank rapidly in size which I took to mean it was moving upward and then it took a right angle turn toward the east without any apparent change in velocity. It moved onto the eastern horizon and suddenly began rolling end over end toward the south. After describing what we saw to their mother we went on to the grade school, not more than two blocks away. When we got there we told the other kids waiting for the bus our story and they began to laugh at us. I looked around the sky and the thing was now on the western horizon and still rolling end over end. At that point, the other kids stopped laughing."]}