{"Region":"England","Date Submitted":"06/15/2009 12:00 UTC","trends":["There has been one other sighting in Ipswich","There were no other sightings in Ipswich on or around June 15th 2009"],"Tags":"City","Object Shape":"Circle, Oval","Viewing Distance":"Unknown","Date of the Event":"06/15/2009 12:00 UTC","Source":"MUFON","Disposition":"Unresolved","Longitude":"1.14822","Country":"United Kingdom","Weather Factors":"Unknown","Summary":"Oval at first then became a flying saucer shape.","divs":["Sighting DetailsI was in my back garden, when i noticed a oval shaped object flying towards me. I couldn't hear any noise so i wondered at first if it was a large bird. So i waited as it came towards me to see what wings it had, but no wings appeared, it stayed a oval shaped. Then as it came nearly overhead i saw it was a disk shape, it looked to me like a classic flying saucer. I couldn't believe what i was seeing, and i got a bit confused. It continued to pass over and disappeared behind the roof of my house, (two story building), so i went around the side of my house to see it continue on its way, by this time, with the angle i was seeing it, it was back to looking like a oval shape once again. It then disappeared behind the roofs of other houses. As i said the object at no time made any noise. It certainly wasn't a aircraft or bird as it didn't have any wings. It was very hard to judge how high it was or how big it was. I don't know if it was small object flying at a low height and slow speed, or a large object flying very high at a fast speed. Or somewhere in between these two possibilities. What got to me is that it was broad daylight. It was flying over the town and it didn't seem to care if anyone saw it. I have no idea if anyone else saw the same object. I personally have kept quiet about it and even haven't told my wife, in case people will think i am mad or stupid."],"Object Features":"Undisclosed","Case Number":"17645","Sighting Duration":"Undisclosed","Log Number":"GB-06242009-0010","City":"Ipswich","files":["/var/www/straped/mufon/html2text/17645.html.txt","/var/www/straped/mufon/org/17645.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=52.056736,+1.14822(17645)&iwloc=A&hl=en\"> mufon case (17645) map </A>","Latitude":"52.056736"}