{"Sighting Duration":"Undisclosed","Latitude":"39.255354","Summary":"Fast moving strange lights.","divs":["sighting detailsi believe this was what was referred to as the hanover lights. for about an hour one evening my whole family, mom, dad, brother and my self watched three very high altitude fast moving objects\\lighted surfaces do maneuvers that are impossible for a regular aircraft to perform. i later did 20 years 55-75 in the navy and know what impossible aircraft maneuvers are. being only about 12-15 yo i had no idea of what i was seeing. later i saw something in print {?} in a newspaper or magazine about a strange set of unexplained lights in the sky and they were referred to as the hanover lights. the lights were in the northern sky from our place and that would put them toward hanover pa. on one other occasion a long cylindrical\\cigar shaped object at fairly low altitude passed directly over our farm. it had a long rectangular lighted surface on the side visible to us on the ground, was silent except for a very low ?humm? for lack of a better word. my dad passed both sightings off as \"something military\" and of course who was i to doubt my dad?"],"Region":"Maryland","Object Shape":"Cigar, Cylinder, Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.255354,+-76.452613(17642)&iwloc=A&hl=en\"> mufon case (17642) map </A>","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/17642.html.txt","/var/www/straped/mufon/org/17642.html"],"Object Flight Path":"Path with directional change","Source":"MUFON","Longitude":"-76.452613","Date Submitted":"08/19/1950 12:00 UTC","Tags":"City","City":"Dundalk","Case Number":"17642","trends":["There have been 3 other sightings in Dundalk","There were no other sightings in Dundalk on or around August 19th 1950"],"Log Number":"US-06242009-0007","Disposition":"Unknown","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Country":"United States","Date of the Event":"08/19/1950 12:00 UTC"}