{"Region":"Ohio","files":["/var/www/straped/mufon/html2text/17641.html.txt","/var/www/straped/mufon/org/17641.html"],"Tags":"City","Date of the Event":"06/21/2009 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.398384,+-81.804579(17641)&iwloc=A&hl=en\"> mufon case (17641) map </A>","City":"Brook Park","Object Shape":"Sphere","Sighting Duration":"00:15:00","divs":["Sighting DetailsI was sitting on my back patio watching the 10PM news when I saw a red round object in the sky which was glowing. I wondered what it was but did not get up to look closer ( I was in my screened in patio). A few minutes later 2 more of the same objects flew overhead. I then called my husband who had gone to bed to come out and verify that I indeed was not seeing things. He also witnessed the objects flying over our house from East to Southwest. He had never seen anything like this either. It was not a helicopter as there was no sound at all. We live close to Hopkins Airport and are used to hearing and seeing airplanes but this made no noise at all. I called the Brook Park police department (they probably think I am crazy)and asked them to go out and look. The dispatcher said \"well even if we see it I'm not sure what we can do\" I suggested that maybe we should call NASA Glenn Research Center and report it but she didn't seem to be believing me. She said she would make a note of my call. Both my husband and I watched it until it disappeared from sight. I can't believe that no one else in the area saw this but my husband and I. Have you received any other reports of this? I have seen meteors and shooting stars in my life and I have also seen planets and satelites in the sky. This was nothing like any of those things. It moved slowly and glowed red. It was one of the weirdest things I have ever seen. The next morning when I got up I asked my husband if in fact it did happen and I was not dreaming. He verified that indeed he had also seen it. He only saw the two but in all there were three."],"Country":"United States","Object Features":"Unknown","Latitude":"41.398384","Log Number":"US-06242009-0006","Longitude":"-81.804579","Viewing Distance":"Unknown","Case Number":"17641","Date Submitted":"06/21/2009 10:15 UTC","Weather Factors":"None","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unknown","trends":["There have been 4 other sightings in Brook Park","There were no other sightings in Brook Park on or around June 21st 2009"],"Summary":"Witnessed red glowing objects overhead flying from east to southwest."}