{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.769176,+-94.656345(17649)&iwloc=A&hl=en\"> mufon case (17649) map </A>","Log Number":"US-06242009-0014","Region":"Kansas","Latitude":"38.769176","Object Flight Path":"Stationary","Date Submitted":"06/16/2009 02:00 UTC","Disposition":"Unknown","Longitude":"-94.656345","Weather Factors":"Unknown","Object Shape":"Sphere","trends":["There have been 2 other sightings in Stilwell","There were no other sightings in Stilwell on or around June 16th 2009"],"Case Number":"17649","Object Features":"Appendage(s)","City":"Stilwell","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"06/16/2009 02:00 UTC","Summary":"Large object with arm followed by military aircraft in area.","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/17649.html.txt","/var/www/straped/mufon/org/17649.html"],"Source":"MUFON","divs":["Sighting DetailsThis is a report that I took from a person living in the Kansas City Area who called in this report after seeing a TV interview I did. She wishes to remain anonymous due to her job. She gave me this report over the phone the day after it occurred. The woman was somewhat upset about this and I felt that she was genuine. She wants no publicity. I am going to take another investigator with me in the near future to spend some time watching the area from her house and will add to this report later. \"I went outside on my back deck at 2:00 AM to have a smoke and let the dog out. Behind our subdivision there are woods going back for miles - this is a public park or National forest land. I noticed a large white light in the Southwest and as it moved slowly closer in my direction it got larger and larger. It stopped and I grabbed my high-powered binoculars to look at it - and I could see three large spheres connected together with a large arm or protrusion exending out at an angle underneath the craft. The arm was moving around in a circle. It was metal looking, but I couldn't tell what material it was made of. The object emitted a very bright white light. It stayed in that position for a long time then just dissapeared. Right afterwards, many military looking planes and helicopters appeared and combed the area for an hour. I am familiar with the planes coming to and from the Johnson County airport, and these were not commercial planes. Also notable is that there has been a decrease in air traffic from the JO CO airport in the past three months. I have lived in this house for four years and have seen many strange objects in the sky, including a black triangle shaped craft that floated by very slowly one evening last winter at 11:00 PM right over the center of our street. It was very close and very large. The lights on the bottom of the craft were so bright they illuminated all of the yards. My neighbor's motion activated yard lights went on and all of the dogs in the neighborhood went crazy - I couldn't believe that people didn't come outside to check to see what all the noise was about! I've also seen multiple white lights high up in the sky that dart around at sharp angles and move very fast, then just stop and look like stars in the sky. Have also seen some strange activities by the military and possibly some alien beings in the woods.\""]}