{"Object Flight Path":"Straight-line path","City":"Winchester","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.18912,+-78.156094(17652)&iwloc=A&hl=en\"> mufon case (17652) map </A>","trends":["There have been 8 other sightings in Winchester","There were no other sightings in Winchester on or around June 24th 2009"],"Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/17652.html.txt","/var/www/straped/mufon/org/17652.html"],"Summary":"Bright orange square shaped high-velocity object.","Date of the Event":"06/24/2009 11:55 UTC","Object Features":"None","Log Number":"GB-06242009-0017","Date Submitted":"06/24/2009 11:55 UTC","Sighting Duration":"Undisclosed","Region":"Virginia","divs":["Sighting DetailsThe UFO was a square shape with rounded edges (not rotating), glowing a bright orange. In the sky it appeared approx the size of alight aircraft descending to land at Southampton airport, however was apparently at much higher altitude and travelling at much higher speed. My initial thoughts were that I was seeing the burn-out of a satellite on re-entry, however this object was either very large at high altitude, or very fast at a lower altitude. The expected burn-out did not occur; instead the object continued to arc across the sky for approx 15-20 secs over an arc of approx 90 degrees until I lost sight as it passed behind a nearby tree. The direction of travel was north to south(west) at approx 190-200 degrees (based on pole star north). My first thought upon seeing the object was that I was witnessing a very large meteorite entry - it was very large in the sky. However as I continued to observe, it bacame clear that the velocity, though much faster than any aircraft, or low-orbit satellite, was way below that of a normal meteorite. Furthermore, it had a distinctive square shape and seemed to maintain its attitude as it traversed the sky, apparently wavering as an aeroplane would as it sought to align itself with a runway on approach. Its velocity did not appear to be perfectly constant and, while appearing to travel extremely fast, it did not exhibit the 'streaking' effect of an object entering the atmosphere at high velocity. I have no particular interest or fascination with UFOs and as a qualified engineer, tend to seek a rational and scientific explanation to mysterious events. However, having witnessed such an extraordinary occurence, I thought it was important to place it on record in a timely fashion and in as much detail as possible. It has of course occcurred to me that this may be some figment of imagination or optical abhorration and I would therefore appreciate news of any corrobarative sightings you may be aware of."],"Country":"United States","Weather Factors":"Unknown","Case Number":"17652","Disposition":"Unresolved","Latitude":"39.18912","Viewing Distance":"Unknown","Longitude":"-78.156094"}