{"Disposition":"Unknown","divs":["Sighting DetailsPHOTO LISTED IS NOT THE SAME AS DESCRIBED BY WITNESS BELOW. IT WAS A SECOND SIGHTING AT THE SAME GENERAL LOCATION ON THE SAME DATE. The time was 11:AM the place Louisville International Airport. I work for a very large package handling company, I am sure you have seen our vans. I work the air district side, on the ramp. I arrived to work to day 10:30 ish, as I was arriving to the bird I was to be working with today, some guy's came across the radio and started asking everyone if they were seeing this UFO over the North South runway. Curiosity sent me to the edge of the ramp and take a look, I didn't see anything so I thought some board people were just joking, I went on about my work. At about 1:55PM I was on the K-Loader for the bird, and I happened to see a reflection in the sky. The reflection was as if someone had a mirror and was trying to signal you. It would flash then be dark and then the sun would catch it and flash again, it was about midway over the runway at this point. I was working at the South end of the runway. As this object came closer I could make out it was rotating and was a cylinder then was a diamond shape. As it spun horizontally and clockwise the cylinder shape would catch the sun and reflect, but the diamond shape was black. The speed of the rotation was about 4 times a minute. It continued in a straight line over the runway at a slow and steady speed, it's height was just under the clouds, the puffy white clouds, that were scattered and sparse. Approximate altitude around 1500 feet ASL. It continued until it reached the very end of our ramp. It then sat in this position for 30 to 45 seconds, then started to ascend above the clouds. At that point I lost visual and it disappeared. The air traffic was very lite today, and at the time of my sighting there were no airlines landing or taking off from this runway. The object was moving against the wind that I would say was 5 to 8 miles an hour breeze, with lite gusts. I was wearing hearing protection and didn't think to take them out to try and hear anything. So I can't comment on the sound or non-sound it may have made. But there were no sounds that I am not used to hearing at the airport, and when the airport was quiet, as it was during my sighting."],"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Log Number":"US-06242009-0018","Latitude":"38.258985","Longitude":"-85.749946","City":"Louisville","Tags":"City","Viewing Distance":"Unknown","Date of the Event":"06/24/2009 01:55 UTC","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=38.258985,+-85.749946(17653)&iwloc=A&hl=en\"> mufon case (17653) map </A>","Region":"Kentucky","Object Shape":"Cylinder, Diamond","Object Features":"None","Source":"MUFON","Case Number":"17653","Country":"United States","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around June 24th 2009","This sighting has never been favorited.",""],"Summary":"Slow moving small object rotating, the sun would flash of its surface as it spun.","Date Submitted":"06/24/2009 01:55 UTC","files":["/var/www/straped/mufon/html2text/17653.html.txt","/var/www/straped/mufon/more/17653_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/17653.html"]}