{"Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=33.158894,+-96.817852(17667)&iwloc=A&hl=en\"> mufon case (17667) map </A>","Summary":"Traveling from the northwest towards the southeast at an extreme altitude, bright star-like, extreme speed.","trends":["There have been 17 other sightings in Frisco","There were no other sightings in Frisco on or around June 23rd 2009"],"Weather Factors":"None","Longitude":"-96.817852","Log Number":"US-06262009-0001","Object Features":"Unknown","Case Number":"17667","Disposition":"IFO","Viewing Distance":"Over One Mile","City":"Frisco","divs":["sighting detailsi copied a guys header from his event on june 22...it is exactly what i saw the next night on june 23rd. i was outside and drinking a glass of wine laying back in my patio chair and i saw a star like object moving very fast at a high altitude. it was 10:50 pm , i went in to get my binoculars and by the time i walked into the hallway and came back it was gone. i mean this thing was hauling ass. i went out tonight at the same time to see if i could see maybe the same thing at the same time, but nothing. i figure if it were a plane or satelite or space station i would see it orbit at the same time, generally. but nothing. and usually by that time of night the air traffic around my place in frisco texas is very light, and believe me this was no plane. it was very faint, looked like it was 40,000 ft plus easy...about the light value of the dimmest star you could see. thats actually what caught my attention initially. the dimmness and then, the speed. when a plane is at that altitude or higher it takes it awhile to traverse the vision path i have of the sky, and this thing had no problem going from north to southeast at 1\\3 of the time a jet would have. i was blown away. i am a 45 year old professional male, i was totally sober and served 6 years in the air force, stationed at bentwaters raf and tinker afb. i know aircrafet and reasonable speed. this was pretty strange. if anyone had the same experience or if you know what i saw, please contact me, powelson.stephen@gmail...thanks!"],"Country":"United States","Date of the Event":"06/23/2009 10:50 UTC","Date Submitted":"06/23/2009 10:50 UTC","files":["/var/www/straped/mufon/html2text/17667.html.txt","/var/www/straped/mufon/org/17667.html"],"Latitude":"33.158894","Region":"Texas","Tags":"City","Object Shape":"Star-like","Sighting Duration":"Undisclosed"}