{"Date Submitted":"06/25/2009 09:40 UTC","Object Features":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around June 25th 2009"],"Weather Factors":"None","Log Number":"US-06262009-0002","Object Flight Path":"Stationary","Region":"New York","Disposition":"Unresolved","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Latitude":"40.722543","files":["/var/www/straped/mufon/html2text/17668.html.txt","/var/www/straped/mufon/org/17668.html"],"Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.722543,+-73.998593(17668)&iwloc=A&hl=en\"> mufon case (17668) map </A>","divs":["Sighting Detailseach night i get home 1st t thing i do is go to the bathroom. my toilet is right by the window facing south. i am in a hi rise building facing south the view is a familiar one. tonite as i went to the bathroom i stared out the window as usual and there was this light. it appeared to be a star but it was a cloudy night. i was the only star in the sky. it wasnt moving just seemed to be there. a star. except it seemed to be blinking. each second it went back and forth from bright white to dim white. i caught myself staring at it wondering if it was a star. my brother and 2 friends came to my home about an hour in. i had all of them take a look at it. passenger planes would fly by, we would compare the light, even when dim, the stars light seemed brighter then the plane. like a pure white light, i checked on it for about another hour it hadnt moved. 15 minutes later i checked again, it was gone. it seemed to high to be a helicopter. it also to my opinion stay way too long in that same spot. im not sure helicoptors can hover but 2 hours plus seems to be alot. my friends and i have no idea what we were looking at. it was high up but under clouds. which made it really stand out. from the yankee staduim area in the bronx, it was high in the southwest sky. we dont know what this was."],"Longitude":"-73.998593","Date of the Event":"06/25/2009 09:40 UTC","Summary":"It was a star like light flashing dim white then bright white.","City":"New York","Object Shape":"Star-like","Case Number":"17668"}