{"Longitude":"-80.918538","Log Number":"US-06252009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=29.033189,+-80.918538(17663)&iwloc=A&hl=en\"> mufon case (17663) map </A>","trends":["There have been 9 other sightings in New Smyrna Beach","There were no other sightings in New Smyrna Beach on or around June 19th 2009"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Tags":"City","Summary":"Unknown object flies over beachside New Smyrna.","Latitude":"29.033189","divs":["Sighting DetailsLast Friday (19 June 2009) night my friend, who was visiting, and I were sitting outside on my patio smoking a cigarette and talking. I estimate the time of the event to be around 22:30, though I may have been mistaken since we had just been hanging out all night and not paying attention to time. My friend and I were outside smoking, and she looked up in the sky and pointed out to me what we both thought was a satellite. It was moving south-southeast We watched it briefly (about five seconds), only to see it stop mid-flight, jerk to the northeast (diagonally up and left from its position), and begin flight again. The object continued this pattern of stopping and re-starting for the next thirty to forty seconds. Its timing was very sporadic as was the degree to which it adjusted its flight path. When we started losing sight of it, I climbed up on top of my chair, but could not see it anymore due to the light pollution on the horizon. I walked inside and told my boyfriend, who was sitting on the sofa watching tv, exactly what we saw. My friend confirmed everything. My boyfriend told us that he had seen objects like that in the sky over the beach before. Neither my friend nor myself could discern a specific shape or color to the object as it was very high in the atmosphere. The area in which the sighting occurred is close to the Canaveral National Seashore, so there is a possibility that it was some sort of government intelligence. My friend and I are both twenty years old. She and I were room mates at the University of Alabama for one semester, after which I moved to the eastern Florida coast and she moved to a suburb outside of New York City. We're both hard-working students. My friend is pursuing a degree in nursing, while I'm busy studying chemistry so that I can do research someday. I'm also a waitress in a local wine bar. My friend had been working at a Red Lobster part-time. My boyfriend has a bachelors degree in economics from the University of Florida, but due to the economy he works at a local restaurant on the beach. Until February of this year, he worked overnight (from the time the restaurant closed until about 5:00) doing security and some maintenance."],"Date of the Event":"06/19/2009 10:30 UTC","Country":"United States","Sighting Duration":"00:00:45","Object Flight Path":"Undisclosed","Disposition":"Unknown","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/17663.html.txt","/var/www/straped/mufon/org/17663.html"],"City":"New Smyrna Beach","Weather Factors":"Unknown","Date Submitted":"06/19/2009 10:30 UTC","Region":"Florida","Case Number":"17663"}