{"Log Number":"US-06252009-0013","Summary":"Possible UFO sighting in Columbus, IN June 09.","divs":["sighting details about 11pm, on the northside of columbus, indiana, on thursday, june 25, 2009, i was locking up my car, i closed the door and started walking toward the front of my house and noticed a rather large glowing object floating in the sky from south to the north. the object seemed to be approximately 1\\2 mile away or closer. it was sort of coned shaped, bigger at the top than the bottom. it had a reddish brown glow to it. i listened and could not hear anything and it was extremely quiet outside as i don't live close to the noise and traffic of the city. i wasn't afraid of it, just very curious because i have never seen anything like this in my lifetime. i quickly ran to the door and yelled for my wife to come look at this, as i wanted to make sure i wasn't imagining it. she came out and saw exactly what i saw. we watched it as it floated to the north and the glowing light became dimmer and dimmer and then just seemed to fade away into the darkness. this whole occurence or sighting lasted maybe 60 seconds. she didn't hear anything either, just quiet. my wife and i watched for another 30 minutes, hoping it might come back but of course, it didn't. i've watched ufo documentaries before and i'm very intrigued but i never thought i might actually see one. i'm not positive that i did but i can't explain what i saw."],"Disposition":"Unknown","Region":"Indiana","City":"Columbus","Object Features":"Undisclosed","trends":["There have been 14 other sightings in Columbus","There were no other sightings in Columbus on or around June 25th 2009"],"Case Number":"17666","Source":"MUFON","Latitude":"39.20971","map":"<A HREF = \"http://maps.google.com/maps?q=39.20971,+-85.91541(17666)&iwloc=A&hl=en\"> mufon case (17666) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/17666.html.txt","/var/www/straped/mufon/org/17666.html"],"Sighting Duration":"Undisclosed","Date of the Event":"06/25/2009 12:00 UTC","Longitude":"-85.91541","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Cone","Date Submitted":"06/25/2009 12:00 UTC"}