{"files":["/var/www/straped/mufon/html2text/17661.html.txt","/var/www/straped/mufon/org/17661.html"],"Source":"MUFON","Region":"New York","Disposition":"Unknown","Longitude":"-77.50444","Summary":"Diamond shape object over house.","Latitude":"42.997841","Tags":"City","Log Number":"US-06252009-0007","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Undisclosed","Date Submitted":"04/10/1994 12:00 UTC","trends":["There have been no other sightings in Mendon","This sighting has never been favorited."],"Date of the Event":"04/10/1994 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.997841,+-77.50444(17661)&iwloc=A&hl=en\"> mufon case (17661) map </A>","divs":["Sighting DetailsPer witness, in 1994 he and several friends and family members witnessed a sighting over their back yard. It was April or May of that year and they were having a cook out in the back yard with their neighbors, and their two daughters. This occurred in Mendon, NY. The witness was approximately 10 years old at the time. It was later in the evening and started to get dark, when they heard what he described as a celestial noise before they saw anything. And slowly they saw a craft appear over the roof of the house, off of an angle. He stated it looked about 300 feet in length, and it hovered, turned on an axis, then flew off towards the farm lands in the opposite direction. It took off at the speed of light, as described per the witness and was the shape of a baseball diamond, light on each side. Everyone there saw it and were pointing and screaming that they saw a UFO. The two sets of parents separated all the children into separate rooms and asked them each to draw what they saw. Each child produced a drawing that pictured the same object. The witness did say his parents held onto the drawings for many years but that he did not think his parents still had them."],"Viewing Distance":"21-100 Feet","Weather Factors":"None","Sighting Duration":"00:10:00","Object Shape":"Diamond","Case Number":"17661","City":"Mendon","Country":"United States"}