{"Object Features":"None","Summary":"White circle going N to S brightened and changed colors as it descended to treetop height then ascended and continued south.","Sighting Duration":"Undisclosed","Date Submitted":"06/22/2009 09:00 UTC","Latitude":"34.071573","City":"Acworth","Viewing Distance":"21-100 Feet","Source":"MUFON","Weather Factors":"None","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/17676.html.txt","/var/www/straped/mufon/org/17676.html"],"Longitude":"-84.66978","Object Shape":"Circle, Sphere","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","trends":["There have been 5 other sightings in Acworth","There were no other sightings in Acworth on or around June 22nd 2009"],"Region":"Georgia","Case Number":"17676","divs":["sighting detailsapproximately 9:00 pm june 22, 2009, i was at home and took my dog outside to do his business. i stopped in my driveway and looked up at the sky (which is not unusual). the sun had set, but the sky was still light, with the stars just becoming visible. i noticed a white dot traveling north to south above acworth, ga (north paulding county), west of lake alatoona. i first thought it was an aircraft, but noticed that it was very high in the sky and there were no beacon(?) lights blinking. it then started to decend at a high rate of speed and curve to the west directly towards me. as it got closer it grew in size and changed colors from white to yellow\\amber (the color of an incandescent light bulb or a flashlight). it was getting close enough for me to start freaking out a little bit. i thought it was a baseball-sized meteorite or something that was coming straight towards me, but i was kind of frozen in place. it stopped just above treetop level (approx 50-75 feet), hovered for only a couple of seconds, then acended in a curved manner to the east and continued south at its' original altitude. i tracked it, until it disappeared behind some trees."],"Log Number":"US-06262009-0010","Country":"United States","Date of the Event":"06/22/2009 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.071573,+-84.66978(17676)&iwloc=A&hl=en\"> mufon case (17676) map </A>"}