{"trends":["There has been one other sighting in Freeport","There were no other sightings in Freeport on or around April 30th 1997"],"Object Flight Path":"Hovering then path,Path with directional change,Other","Disposition":"Hoax","Summary":"Saw a black triangle in the daylight hours, approx. 12 yrs ago. Don't know why I didn't report then as it was an incredible sighting, I was only a teen; I remember it fully to this day.","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/17670.html.txt","/var/www/straped/mufon/org/17670.html"],"Viewing Distance":"21-100 Feet","Tags":"City","Longitude":"-70.10312","City":"Freeport","Date Submitted":"04/30/1997 06:00 UTC","Region":"Maine","divs":["Sighting DetailsOk, so five of us were in a van bringing a friend home on the Raymond Rd. in Brunswick ME. I can't remember the exact date as this was 12 yrs ago. All I know is that it was late spring in 1997, approx. 6 pm in the evening EST. We came around a corner and we stopped for a second. Don't know why we stopped, we just did. All of a sudden from behind some trees, a black triangular craft floated out from behind some trees. The trees were only about 50-70 ft. tall and possibly as little as 50 yards away!! It was close, real close. It kind of like hovered there for a second. When it started moving it was kind of like just floating along real slow and completely silent. We just sat there and watched it. I remember when it appeared I hollered out, \"oh my god! A UFO!\" cause I'm a firm believer in them. We just watched it. Then I think that what ever was driving it noticed us cause it started to float away and when it did it actually hit the top of a tree causing the tree to move! It was floating. Thats the only way to describe its flight. It was moving side to side like a fighter jet would do to avoid getting a missle lock on it. Kind of like side to side. While it was doing this, we were able to see the bottom, side and top. It was completely black, and had no windows. From the side, there was a \"cockpit\" type bubble similar to that of a B-2 Stealth bomber, but not as severe if that makes any sense. The color was a flat black color, no reflection from the sun. From the bottom, it had solid white lights at each tip of the triangle, and in the very center it had a single blinking red light. No markings what so ever. It was kind of surreal. I remember it like it was yesterday. I thought it was totally awesome, awe inspiring. The four friends with me didn't seem to impressed, I don't think they understood how special this event actually was to witness. I actually jumped out of the van to watch it. It was just floating around for about 5-8 mins before it just floated away til we lost sight of it. The entire event was probably around 10 minutes. I totally wish I had had a camera or cam-corder cause this could of been one of the best UFO sightings ever if I could of got it on film. I will try to attach a sketch of it. When this event occured, I had never heard of a triangle ufo before. A few years ago I went on the internet to research this. What I found blew me away. The infamous \"Belgium Wave\" pics are IDENTICAL to the craft that I saw. Except that I saw mine during the daylight hours, and I saw it from all possible angles due to its flight pattern. But again, the infamous \"Belgium\" pics are IDENTICAL to what I observed when seeing the bottom of this craft. I will admit that when I saw this and to this day, I have to say that if this craft IS NOT extra terrestrial, it is definately a \"secret\" military aircraft. Especially since the Brunswick Naval Air Station is less than five miles away from the site. It looked like the same material as the B-2 and F-117 Stealth planes, but it WAS NOT a stealth plane, it was a triangle. I recently saw footage of a F-117 taking off at night, and the lights on the bottom of the jet looked like and reminded me of the triangle's lights. Three solid whites and a rotating or blinking red light, but in a different configuration as the F-117 is NOT a triangle. And yes, like I said before, it DID hit a tree, I probably could NOT find the exact tree today, however I do know the general area it was in, however some new houses have gone in the area since then. Well, thats about it on this case. Iam going to be reporting another sighting from a few weeks ago, I just have to find the date, as I do have the date and time for this other sighting. Thank you and I wish I would of reported it sooner. If you have any further questions, feel free to e-mail me at the address given. Your further questionaire made me remember that after the sighting, when it was finally dark out; there were ALOT of planes that I could see in the sky at high altitudes. There's usually quite a bit of air traffic anyway as the navy air base is in town and Portland Int. Jetport is only about 20-25 miles away, but I had never seen this many planes at one time either before or after this event. This happened the same day, probably a couple hrs later after it got dark. I found it quite strange like they were looking for the craft or something."],"Latitude":"43.857006","map":"<A HREF = \"http://maps.google.com/maps?q=43.857006,+-70.10312(17670)&iwloc=A&hl=en\"> mufon case (17670) map </A>","Weather Factors":"None","Case Number":"17670","Object Features":"Other","Date of the Event":"04/30/1997 06:00 UTC","Log Number":"US-06262009-0004","Object Shape":"Triangle","Sighting Duration":"Undisclosed"}