{"Weather Factors":"Unknown","Longitude":"-95.985375","divs":["sighting detailsreport is being filed by a mufon fi. witness did not wish to file a report. witness went outside about 10 p.m., saw an unusual light in the eastern sky, went back into his house to get his video camera, then took about three minutes of video. location is about 2-1\\2 miles from the tulsa airport. witness is familiar with lights from aircraft in the night sky. the light was much brighter than a star, perhaps comparable in intensity to the landing lights on an aircraft. what made it unusual was that it would flash twice in rapid sequence, then repeat this pattern in a few seconds. it was observed several times to send out a flash downward and to the left that had the appearance of an artillery piece firing. it also appeared to launch orbs, dimmer than the main light, that moved steadily upward and to the right. as many as three of these orbs were in sight at one time. the video also showed the light dividing into two and then three lights. while the witness was adjusting his camera the light turned to the north (toward the airport) and disappeared in the distance."],"Date of the Event":"06/18/2009 12:00 UTC","Source":"MUFON","Region":"Oklahoma","Object Shape":"Star-like","Tags":"City","Summary":"Flashing light in the night sky; appeared to send out flashes and orbs.","map":"<A HREF = \"http://maps.google.com/maps?q=36.163502,+-95.985375(17686)&iwloc=A&hl=en\"> mufon case (17686) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/17686.html.txt","/var/www/straped/mufon/org/17686.html"],"trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around June 18th 2009"],"Latitude":"36.163502","Date Submitted":"06/18/2009 12:00 UTC","Viewing Distance":"Unknown","City":"Tulsa","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Undisclosed","Disposition":"Unknown","Log Number":"US-06272009-0006","Case Number":"17686"}