{"Country":"United States","Sighting Duration":"Undisclosed","Summary":"Low, fly-by of possibly square looking object with orange glowing orb under it.","Weather Factors":"Unknown","Latitude":"40.053602","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/17687.html.txt","/var/www/straped/mufon/org/17687.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.053602,+-86.007126(17687)&iwloc=A&hl=en\"> mufon case (17687) map </A>","Object Flight Path":"Straight-line path","Object Features":"Other","trends":["There have been 9 other sightings in Noblesville","There were no other sightings in Noblesville on or around June 26th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Other","Region":"Indiana","City":"Noblesville","Date of the Event":"06/26/2009 10:25 UTC","Log Number":"US-06272009-0007","Date Submitted":"06/26/2009 10:25 UTC","divs":["Sighting Detailsi was sitting on my back porch looking at the sky like i do every night. It was a dark and clear night, many stars visable including milky way which is rare these days. at about 10:25 i was sitting faceing east, when something came into my sight from behind some trees. it immediatly startled me and i said out load ,to myself, oh my god whats that! It appeared to be a square or diamond shape object with a glowing orange orb under it. it was dark and i could not see the profile of the object, but the orb which was flickering like a flame, was reflecting of of the bottom of the object. I first thought of one of those paper ballons with the candle under it but this thing was moveing way to fast. once it came into my sight which was right over head, i watched it disapear into the horizon, twords indianapolis. it only took about 20 seconds. i think it was about 5000 ft high and it flew like an airplane no sudden movements. It also made no sound. It was following s.r. 37 just to the west, and would have gone right through noblesville and into indy."],"Longitude":"-86.007126","Case Number":"17687","Source":"MUFON","Tags":"City"}