{"Date Submitted":"06/26/2009 11:45 UTC","Region":"Texas","files":["/var/www/straped/mufon/html2text/17683.html.txt","/var/www/straped/mufon/org/17683.html"],"Disposition":"Unknown","divs":["Sighting DetailsI am relaying this second hand. I was on the phone with my son who is working this summer at a camp near Glenn Rose TX. He was walking outside across the camp grounds alone to get his computer out of one of the buildings. He suddenly interupted our conversation and said \"Oh my gosh, what is that\" I started asking him what he saw. He took a few seconds to answer as if he were speachless. He finaly answered and said \"I'm lookng at a bright ball in the sky, sort of yellowish orange. It's very bright. It looks too big to be a plane. Oh my gosh, It just darted to one side, way too fast to be a plane. Now it's just hoovering again.\" By this time he was so excited he sounded out of breath. The object had gone behind some trees. My son ran across the grounds to try to get out from behind the trees to be able to see the object again. \"There it is again\" he said. Then \"It just disappeared. One instant it was there, then it just disapperaed\"."],"Latitude":"32.239037","Log Number":"US-06272009-0003","Date of the Event":"06/26/2009 11:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.239037,+-97.750446(17683)&iwloc=A&hl=en\"> mufon case (17683) map </A>","Summary":"Large bright yellow/white ball first stationary, then moved sideways very rapidly, stood still for a few seconds then flew away at high rate of speed.","Object Shape":"Circle","Source":"MUFON","Country":"United States","Weather Factors":"None","Longitude":"-97.750446","City":"Glen Rose","Viewing Distance":"Unknown","Tags":"City","Case Number":"17683","trends":["There have been 8 other sightings in Glen Rose","There were no other sightings in Glen Rose on or around June 26th 2009"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Sighting Duration":"Undisclosed"}