{"Summary":"Flashing lites. never moving. 4 lites. Different colors.","Longitude":"-94.109447","Country":"United States","trends":["There have been 16 other sightings in Rogers","There were no other sightings in Rogers on or around June 26th 2009"],"Disposition":"Insufficient Data","Date of the Event":"06/26/2009 09:38 UTC","Object Features":"Unknown","Viewing Distance":"Unknown","Date Submitted":"06/26/2009 09:38 UTC","Log Number":"US-06272009-0001","Tags":"City","Source":"MUFON","City":"Rogers","Sighting Duration":"01:15:00","Region":"Arkansas","Case Number":"17681","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=36.34107,+-94.109447(17681)&iwloc=A&hl=en\"> mufon case (17681) map </A>","Object Flight Path":"Stationary","Latitude":"36.34107","files":["/var/www/straped/mufon/html2text/17681.html.txt","/var/www/straped/mufon/org/17681.html"],"Object Shape":"Flash, Other, Unknown","divs":["Sighting Detailsi was sitting in my backyard. i was lying on the trampoline. as i walk to my back door to head in. i glanced at the sky and saw a dim flashing lite. i look back and it is still there just flashing. i look at it and it gets brighter slowly. i stared at it for 30 minutes and biside it there was a smaller lite. it flashes weird colors. the first flashing lite was bigger than the 2nd lite. five minutes later i see a 3rd lite flashing a dim green and blue. it was the same size as the 2nd lite. i watch them and thee looked like they were comunicating with the flashing lights. i see something in the distance over my house. there was a fourth light in the sky. they are all flashing. then i come inside to get binoculars. i come back outside and with the binoculars i cans see the colors a little better. the colors they flash are green. red. blue. and grey. i had to come back inside to research on the internet and report what i saw. when i looked out the window they had left. during ther visit i had goose bumps and ramdome head aches and felt cold. it was 90 degrees outside"]}