{"Sighting Duration":"00:10:00","Object Flight Path":"Undisclosed","Log Number":"US-06272009-0008","Longitude":"-122.280836","Disposition":"Unknown","trends":["There have been 5 other sightings in Cottonwood","There were no other sightings in Cottonwood on or around May 25th 2009"],"Object Shape":"Star-like","Tags":"City","Region":"California","Latitude":"40.385709","City":"Cottonwood","Source":"MUFON","Weather Factors":"Unknown","Summary":"Multiple sightings -- Us, too. (For the VA Poster).","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.385709,+-122.280836(17688)&iwloc=A&hl=en\"> mufon case (17688) map </A>","Country":"United States","divs":["Sighting DetailsI just wanted to chime in--especially after reading the VA sighting report--that there really IS something odd going on overhead. If I was to list all the 'strange' things my family and I have seen over the past few months, it'd take too much time. Suffice it to say, I've seen the infamous satellite that makes a 90 degree turn. The one I saw traveled the length of a yardstick (held at arm's length) in about three seconds and then--bam--turned right. Crazy. I think the strangest thing that happened, however, was about a month ago I saw about six star-like objects travel the same path--one after the other--over the course of about ten minutes. They appeared about every two minutes. At first I thought they were satellites, but they were moving much too quickly for that. Plus, after the third one appeared I knew these were not satellites, especially when one of them stopped for a moment, then continued on its merry way. Two travled closely together, almost as if they were connected, except they were slightly off-center. I live in northern California (the TRUE north), on a horse ranch and so our arena is the perfect spot to view strange objects in the sky. Two months ago my husband and my brother-in-law (who lives on the property with us) saw a very bright, \"bobbing\" light in the sky. According to them it bounced up and down. They were pretty excited, but to be honest, I'm rather blase' about all this stuff now. BTW, I did check satellite trajectories at www.n2yo.com on the night when I saw the six star-like objects in a row. There were only four in the area, all over the course of the entire DAY. Yes, these might have been \"darks\", but SIX darks...in a row? I don't think so. Come on out to my place if you want to see some cool stuff. We've even got our friends and family members \"looking up\" these days. I'm thinking of getting bumper stickers printed. LOOK UP."],"Date of the Event":"05/25/2009 09:00 UTC","Case Number":"17688","Date Submitted":"05/25/2009 09:00 UTC","files":["/var/www/straped/mufon/html2text/17688.html.txt","/var/www/straped/mufon/org/17688.html"],"Object Features":"Undisclosed"}