{"Latitude":"38.848551","Date of the Event":"06/24/2009 10:15 UTC","Log Number":"US-06272009-0009","Weather Factors":"Unknown","Tags":"City","Longitude":"-77.421807","trends":["There have been 5 other sightings in Centreville","There were no other sightings in Centreville on or around June 24th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.848551,+-77.421807(17689)&iwloc=A&hl=en\"> mufon case (17689) map </A>","Date Submitted":"06/24/2009 10:15 UTC","Object Features":"Unknown","Region":"Virginia","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was at my girl friends house in Centreville Va. and while i was outside on the deck smoking a cigarette i noticed a pair of lights in the sky. from where im standing dulles would be at my 5 oclock.the lights approched from about a 9:30 position and panned slowly to the right through out the sighting. i thought the lights were lights from the ends of an airplane but when i watched them i realized the plane would be going sideways if it were. also the distance between the lights would indicate the plane would be very very low. i heard no noise. the lights stayed equidistant from eachother the entire time. my girlfriend kept saying it was a blimp or airplane but when the lights would pass in front of stars it didnt block them. meaning they were seperate crafts. the lights them selves where a few different blinking colors and did not blink an any pattern at all. they were moving extremely slowly and when i thought it might actually be an airplane tilting to go to dulles they moved in the opposite direction of the tilt. then kept the same angle and moved straight away from me as i watched until they were to far to see. i wish i could explain on here better what they looked like. i know it wasnt a plane or helicopter."],"Country":"United States","City":"Centreville","files":["/var/www/straped/mufon/html2text/17689.html.txt","/var/www/straped/mufon/org/17689.html"],"Case Number":"17689","Object Shape":"Triangle, Other, Unknown","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Summary":"2 UFOs flying in tandem over Centreville.","Source":"MUFON"}