{"Object Shape":"Disc, Triangle","Region":"Arizona","Latitude":"34.87274","Case Number":"17691","map":"<A HREF = \"http://maps.google.com/maps?q=34.87274,+-111.75709(17691)&iwloc=A&hl=en\"> mufon case (17691) map </A>","Log Number":"US-06272009-0011","Tags":"City","Object Flight Path":"Unknown","Source":"MUFON","Disposition":"IFO","Date of the Event":"06/24/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/17691.html.txt","/var/www/straped/mufon/more/17691_submitter_file1__P6240087.JPG","/var/www/straped/mufon/more/17691_submitter_file2__P6240088.JPG","/var/www/straped/mufon/org/17691.html"],"Date Submitted":"06/24/2009 12:00 UTC","Country":"United States","City":"Sedona","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around June 24th 2009","This sighting has never been favorited.",""],"Summary":"Two possible UFOs photographed in Sedona, Arizona.","Sighting Duration":"00:00:10","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-111.75709","divs":["Sighting DetailsWe were on a family vacation which took us through Sedona, Arizona. Traveling South on Rt 179, we took a turn-off the to Bell Rock Trail, and took several pictures; two of them are attached (P6240087 and P6240088). The first was of Courthouse Butte on my right using some optical zoom to compose the setting. The second was of Bell Rock just to the left of Courthouse Butte. I used some more zoom to center the second picture. At the time, I did not observe any objects in the sky since my concentration was on the beautiful rock formations. When we stopped at a hotel later that evening we downloaded our photos to a laptop computer. On the larger screen, I noticed two dark marks in the sky above Courthouse Butte (P6240087). Since my daughter loves hawks, and we saw quite a few on the trip, I joked to my son-in-law Bill, \"Let's magnify these two hawks for Sandra\". When we did, it appeared to be two UFOs; the left one silver colored and the right one darker. When magnified, each appeared to have a different color directly around it. They did not look like birds or planes. We then searched about 10 other pictures looking for other \"black marks\" in the sky. That is when we discovered the dark mark above Bell Rock (P6240088). We magnified this one and it looks similar to the one appearing on the right above Courthouse Butte. The pictures were taken about 10 seconds apart, so if it was the same object, it was traveling fast from my right to left. We looked at the photos Bill took with a different camera, but he had less sky visible in most of his, and no black mark were found. My reaction was WOW! The camera is an Olympus SP-320, 7.1 Megapixel, with 3X optical zoom."]}