{"Date Submitted":"06/27/2009 08:38 UTC","divs":["sighting detailsi had just returned to my home after picking up dinner at a local restaurant. upon existing my vehicle i had an \"urge\" to look up at the sky. i cannot explain the urge; it was something that i distinctly felt. i looked west and scanned up and to the southeast. the sky was clear with a number of stars visible. i observed the light (orb) moving south to north. i cannot approximate the distance, however the light was in approximate size to a pencil's eraser. what really caught my eye was the orb was radiating light much as a star would. the light had distinct radiating points of white light, approximately eight in total. the orb was moving at a rapid and constant rate of speed. the angle of the light was approximately 70 degrees from my postion. as the object arrived just east of my position, what appeared to be a headlamp turned on for a period of two seconds. the lamp illuminated in front of the object. immediately i felt a high pitched \"humming\" in both ears, and what could be best described as a \"static charge\" around my body. the sound was not painful. the \"humming\" is still present since the incident. i still hear the noise even when i put in earplugs. it took the object approximately seven seconds to traverse my visual spectrum. we have an airport located seven miles from my home. the speed and direction of the object does not conform to the airport's landing and takeoff pattern. we also have an international airport located sixty miles north. the object's light, lack of green\\red directional lights seemed odd, and did conform to faa regulations."],"Viewing Distance":"Unknown","Date of the Event":"06/27/2009 08:38 UTC","Country":"United States","Object Flight Path":"Straight-line path","Object Shape":"Flash, Oval, Star-like","Log Number":"US-06282009-0007","map":"<A HREF = \"http://maps.google.com/maps?q=33.691447,+-117.785374(17703)&iwloc=A&hl=en\"> mufon case (17703) map </A>","trends":["There have been 28 other sightings in Irvine","There were no other sightings in Irvine on or around June 27th 2009"],"Region":"California","Disposition":"Unknown","Latitude":"33.691447","files":["/var/www/straped/mufon/html2text/17703.html.txt","/var/www/straped/mufon/org/17703.html"],"Longitude":"-117.785374","City":"Irvine","Sighting Duration":"00:00:07","Summary":"Light orb that flashed a secondary light in direction of flight path.","Weather Factors":"Unknown","Tags":"City","Case Number":"17703","Object Features":"None","Source":"MUFON"}