{"Date Submitted":"06/26/2009 07:35 UTC","divs":["Sighting DetailsOk, i've seen this simular object now about a dozen times in the past few months. These supposed Chemtrail Planes are flying over and near the planes are thse orbs almost all the time. I've filmed one on a camera but since I don't have an actual camcorder I can't film them all. These orbs are always there when these planes fly over and they have some amazing speeds. One of these planes was flying over and one of these orbs was behind it at about a hands length and in a matter of seconds this orb went from beind well behind it to in front of it. It passed in front of the planes from right to left. It was behind it to the right and then quickly sped up and crossed paths with the plane and was in front of it and to the left of it in a matter of seconds. Theres something going on with these Chem planes and these orbs. Pay attention to the planes. Film them cause the one time i've filmed one I caught something on camera I didn't see. You tube it also theres thousands of videos on there of these orbs apearing when these planes are flying over. Not sure what else to say except something odd is going on. Pay Attention People!"],"Source":"MUFON","Viewing Distance":"Unknown","Disposition":"IFO","Weather Factors":"Unknown","Longitude":"-99.727234","Sighting Duration":"00:00:30","Case Number":"17708","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.455736,+-99.727234(17708)&iwloc=A&hl=en\"> mufon case (17708) map </A>","Tags":"City","Country":"United States","Summary":"Orb In the Sky","Latitude":"32.455736","City":"Abilene","trends":["There have been 63 other sightings in Abilene","There were no other sightings in Abilene on or around June 26th 2009"],"Region":"Texas","Log Number":"US-06292009-0002","Object Flight Path":"Undisclosed","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/17708.html.txt","/var/www/straped/mufon/org/17708.html"],"Date of the Event":"06/26/2009 07:35 UTC"}