{"files":["/var/www/straped/mufon/html2text/17700.html.txt","/var/www/straped/mufon/org/17700.html"],"Object Shape":"Triangle","divs":["Sighting DetailsAt about 1:35 a.m. after finishing up some online school work, I decided to go outside to have a smoke. I kept the patio lights off in order to keep the bugs away, and to better see shooting stars. After gazing at the sky for about 5 minutes a drifting object caught my eye. It was moving west at a slow pace, with no lights on, and it did not make much of a sound like most aircrafts would. I live next to the West Palm Beach airport and I am aware of the sound of most planes and helicopters. This was niether. My first thought was that is was a bunch of balloons by the way it almost floated through the sky, but after watching for a few minutes that guess quickly change. The object was triangular with almost like a circle inside the triangle. I watched as it made it's way west until it stopped, and accelerated backwards as if it saw me see it. I couldn't do much but shake and listen to my own heart pounding as the triangular object hovered almost directly above me. Then it began to sort of dance in the sky, my initial reaction was that they didn't know where or which direction they wanted to go. But it stayed in a general area above me drifting north, then south, east and west. I knew for sure at that point that it wasn't any aircraft belong to us. Silently this object danced in the sky for about 3 minutes. I then decided to get my camera, but being so terrified I couldnt even think straight enough to do so. I ran inside searched for my phone and called a friend. After I returned outside to see if it was there still, it was gone. Now that I think about it, it seems that they wanted me to see them, as if to confirm all of my beliefs. Growing up I've always had a strong belief in other lifeforms. Becoming an adult it was like after having no personal conformation you should just let it go, not that I did. This sighting to me was just that reconfimation of what I've always believed. Finally."],"Object Flight Path":"Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Weather Factors":"None","Tags":"City","Longitude":"-80.045875","Source":"MUFON","Country":"United States","Latitude":"26.722922","Viewing Distance":"Unknown","Case Number":"17700","Log Number":"US-06282009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=26.722922,+-80.045875(17700)&iwloc=A&hl=en\"> mufon case (17700) map </A>","Disposition":"Unknown","Summary":"Silent triangular flying object.","City":"West Palm Beach","Date of the Event":"06/26/2009 01:43 UTC","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around June 26th 2009","This sighting has never been favorited.",""],"Region":"Florida","Date Submitted":"06/26/2009 01:43 UTC","Object Features":"Undisclosed"}