{"Summary":"A cluster of bright scintillating lights in formation passed across the sky.","Date Submitted":"06/20/2009 05:20 UTC","Date of the Event":"06/20/2009 05:20 UTC","Source":"MUFON","Tags":"City","City":"Galesburg","Latitude":"40.952036","Region":"Illinois","trends":["There have been 5 other sightings in Galesburg","There were no other sightings in Galesburg on or around June 20th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Case Number":"17707","Longitude":"-90.36884","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","divs":["Sighting DetailsI was wrapping-up some work on my computer at about 5:20 AM on June 20, 2009, when the morning twilight began to filter through the windows. It being my birthday, and the weather being particularly pleasant, I decided to go outside to observe the dawn sky. I stepped out onto my front porch and looked up into the southern sky. I immediately noticed a very bright object about 30 degrees above the horizon. At first, I thought it was a very bright planet, but I then noticed that it was moving towards me and to the northwest. As the object came closer, I could see that it was not a single point of light; instead, it was a cluster of lights which seemed to be travelling together in formation. The cluster did not resemble an airplane. Instead, it seemed to be composed of several individual elements of various sizes arranged in a \"double-cross\" or diamond-like pattern. The lights scintillated in a way that suggested to me that the morning sun which was just about to rise was reflecting off the object. I have often seen jets reflecting sunlight in the twilight hours, but this thing in the sky did not look *at all* like a plane. When I realized that I was definitely not seeing a conventional aircraft, I thought to myself, \"I am seeing a f-ing UFO!\". I raced inside and grabbed a small handheld video camera. By the time I got back outside (about 40 seconds later), the object had moved overhead along the same smooth trajectory in the sky it had been taking since I first noticed it. I began filming the object. The video clearly shows a bright object moving in the sky, but the fine structure of the formation was not clearly captured by the camera (which unfortunately does not have a zoom lens). I shot video for about 2 minutes as the object receded into the northwestern sky. When it was passing overhead and to the north, the formation appeared to be a cluster of roughly coplanar lights in a sort-of triangular arrangement. It made no sound at all. Judging from the way the scale of the object changed as it moved across the sky, I would guess that it was approximately at the same height as a passenger jet at cruising altitude. The experience left me excited and a bit flabbergasted. I reviewed the video footage and was somewhat disappointed to find that the shape of the object on the video was not clear. I made a couple of quick pencil-sketches to record my impression of the cluster's shape, and then retired to bed."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.952036,+-90.36884(17707)&iwloc=A&hl=en\"> mufon case (17707) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Cross, Diamond, Triangle","Log Number":"US-06292009-0001","files":["/var/www/straped/mufon/html2text/17707.html.txt","/var/www/straped/mufon/org/17707.html"],"Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States","Disposition":"Unresolved"}