{"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.475024,+-78.270395(17717)&iwloc=A&hl=en\"> mufon case (17717) map </A>","Log Number":"CA-06292009-0011","Sighting Duration":"Undisclosed","Latitude":"42.475024","City":"Centerville","Summary":"Something captured on digital camera (not seen with the naked eye when we looked up) 2 photos taken from the bottom of the Skylon Tower toward the sky.","files":["/var/www/straped/mufon/html2text/17717.html.txt","/var/www/straped/mufon/more/17717_submitter_file1__IMG_0460_2_2.JPG","/var/www/straped/mufon/more/17717_submitter_file2__IMG_0459_2.JPG","/var/www/straped/mufon/more/17717_submitter_file3__IMG_0459.JPG","/var/www/straped/mufon/org/17717.html"],"divs":["Sighting DetailsOn June 26, 2009, Me, My husband, our daughter and son-in-law took a long weekend trip to Niagara Falls. At 6:00 p.m. we had arranged to take a tour with a guide. As the night was drawing to a close the Skylon tower on the canada side was our last stop. At about 9:30 p.m. we had all come back down to ground level and I was taking photos while waiting on the rest of our group. As I looked up to take my picture of the tower from the ground, there was Nothing in the sky. Also no noise of a plane, helicopter etc. However, after I took the pic, I noticed a very bright whitish light to the left of my frame. I immediately looked up and still saw nothing with my eyes. I took it over to my husband and showed him and asked what this was? He looked up and saw nothing. While he's looking up at the sky, (and not seeing anything) I'm zooming in on my photo to try and get a clearer picture. I looked up again, nothing I can see, so out of curiosity I snapped another pic. This was maybe after 40 seconds. In the second picture the object is to the right of the tower. Again, I look at the picture, bright white something. Look up, Nothing! I have uploaded these pictures to my computer and tried to enhance them to figure out what in the world it is. I cannot get a close enough zoom on my computer ( or I don't know how!) The object seems to have purple, blue and green lights when I manipulate it with my iphoto program. We have all looked at it and it is very bizarre indeed! It would be interesting if someone with the capability would take it, enhance it, and explain it!! I am sending 3 pictures. I have a few more that I have copied to try and enhance if you are interested."],"trends":["There has been one other sighting in Centerville","There was one other sighting in Centerville on or around June 26th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Date of the Event":"06/26/2009 12:00 UTC","Tags":"City","Source":"MUFON","Disposition":"Unresolved","Object Flight Path":"Undisclosed","Case Number":"17717","Country":"United States","Region":"Ontario","Viewing Distance":"Unknown","Longitude":"-78.270395","Date Submitted":"06/26/2009 12:00 UTC","Object Shape":"Boomerang, Unknown"}