{"Summary":"Saw two shiney light-reflecting objects traveling W to E. Too high to tell shape. One kept ahead of the other, speeding up and then stopping in midair, waiting for the other to catch up.","Tags":"City","Source":"MUFON","files":["/var/www/straped/mufon/html2text/17712.html.txt","/var/www/straped/mufon/org/17712.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"California","Weather Factors":"None","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Date Submitted":"10/24/2008 10:30 UTC","City":"Sacramento","divs":["Sighting DetailsI had just walked out to my garbage can when I looked up to see if there was any clouds, which there wasn't. It was then that I spotted the two objects traveling toward me. At first, I thought it was two planes, possible military so I decided to stand there and wait to see what kind they were. They looked about the height that a military plane would fly, but the sun was reflecting off of them so I couldn't see the bodies of the objects. I watched, and then got the surprise of my life. One, the first one, sped up and then stopped in midair. The second continuing at the it's speed, caught up to the first. Then the first repeated the speeding up and hovering. The second caught up again and then made a sharp right going from W to straight S in the blink of an eye. The first then pulled ahead and stopped. I tried to see the one going S, but it wasn't visable, just like looking into empty sky. Then I started to watch the hovering one. About that time my dog came barreling up and I took my eyes off of the whatever for a second, looking back up again and it wasn't visable. Both objects were moving about the speed of a commercial plane when I first saw them. I didn't know what I was looking at, but since then I've done some computer searching and found what I think it is. I believe it is the TR-3B, the plane that can hover indefinately and reach Mach 9. It could have been a photo shoot or just an escort following it. I've seen a triangle (which has been reported) back in the late 69-70's up fairly close. That one still has me puzzled. So far, I haven't seen the cigar, wingless kind- but if I did, I would wonder if it was the Canadian Monolith that flew a couple years back. As for seeing the objects and then seeing blue sky, our goverment must be using alot of reflective paint-$2500 per gallon. That is gleaned from both tv and the computer. All this did is fuel my curosity, wanting to know the truth- goverment black projects or alien."],"Object Features":"Unknown","Case Number":"17712","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around October 24th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.587192,+-121.4926(17712)&iwloc=A&hl=en\"> mufon case (17712) map </A>","Disposition":"IFO","Longitude":"-121.4926","Country":"United States","Date of the Event":"10/24/2008 10:30 UTC","Log Number":"US-06292009-0006","Latitude":"38.587192"}