{"Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=43.040839,+-83.508706(17716)&iwloc=A&hl=en\"> mufon case (17716) map </A>","Longitude":"-83.508706","Object Shape":"Cigar, Star-like","Source":"MUFON","Case Number":"17716","Viewing Distance":"Over 1 Mile, Unknown","Region":"Michigan","Summary":"Strange multicolored lights hover over Port Huron/Lapeer MI.","trends":["There have been 2 other sightings in Davison","There were no other sightings in Davison on or around June 29th 2009"],"Log Number":"US-06292009-0010","files":["/var/www/straped/mufon/html2text/17716.html.txt","/var/www/straped/mufon/org/17716.html"],"Country":"United States","Tags":"City","Date of the Event":"06/29/2009 04:15 UTC","Sighting Duration":"01:02:00","Object Flight Path":"Stationary","Object Features":"Louvres","Date Submitted":"06/29/2009 04:15 UTC","City":"Davison","divs":["Sighting DetailsOn the morning of June 29th at 4:15 am a very bright light was spotted from Davison, Mi to the east between 85 and 90 degrees and between 35 and 40 degrees in elevation. At the time my wife and i were going to bed and spotted a light out the window. At first glance i thought it could be a metorite however it was mostly stationary and multicolored. The light remained in this position until it disappeared at 5:15. Light consisted of multiple lights in 3 rows, with 10-12 lights in a row in a bar like shape. Lights varied between being on and off, in color, intensity. They varied from glowing to being beams of light extending 5 times the width of the object. The lights seemed to rotate at times and sit still at other times, and sometimes flash at random. Rotation was at times vertical and others like chasing lights along its length. A red beam was often seen shining from the bottom of the object. 6-10 audible tones were heard while the object was visible. Tones were heard about every 15 minutes and lasted only a few seconds. The object seemed to move slightly in reference to nearby stars every few minutes but still remained in nearly the same place. A low hum was maintained at all times during the sighting but this could possibly have been local road noise."],"Disposition":"Unknown","Latitude":"43.040839"}