{"Country":"United States","Viewing Distance":"Unknown","Region":"California","Sighting Duration":"00:01:00","Disposition":"IFO","Latitude":"36.779551","Source":"MUFON","Date Submitted":"06/27/2009 02:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.779551,+-119.415202(17714)&iwloc=A&hl=en\"> mufon case (17714) map </A>","Weather Factors":"Unknown","Case Number":"17714","Object Flight Path":"Undisclosed","Object Shape":"Star-like","trends":[],"divs":["sighting detailsdate: june 27, 2009, saturday group investigating: shannon mccabe's hpi (haunted and paranormal investigations international) location of sightings: carnegie svra state vehicular recreation area (observing area over lawrence livermore labs) ufologists present: paul dale roberts, tim dennehy, renee martine, monique dannille apodaca, chantal apodaca, laura miller, tammy straling, sadie bowman, vanessa kalinowski, ocita the chijuajua, luke the chihuahua\\dachshund, karen mace, david mace. lead ufologist: paul dale roberts renee martine (intuitive) and 2 other intuitives reported seeing 3 stars aligned in a right degree angle. the star in the middle seemed to wobble, split into two stars and finally vanished. time of sighting: 2:06am. other witnesses: laura miller and monique apodoca. note: the three using intuitive abilities were attempting to communicate with extraterrestials. tammy straling while observing the night sky saw a darting star object that moved in an erratic pattern. time of sighting: 3:01am. possible witness: paul dale roberts. my eyes could have been playing tricks on me. observing the night skies on a continuous basis causes mis-sight and misjudgment. while observing with binoculars, it appeared to be a fast moving star like ufo that darts straight, hard left angle and straight again. note: many conventional aircraft and satellites were observed. observations lasted through the entirely of the evening. photographic or video was not obtained. light\\laser signaling produced no results. psychic telepathy communication inconclusive. sightings by investigators are inconclusive."],"Summary":"Binocular sightings to star like UFOs over Lawrence Livermore Labs","Tags":"City","City":"Undisclosed","Longitude":"-119.415202","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/17714.html.txt","/var/www/straped/mufon/org/17714.html"],"Date of the Event":"06/27/2009 02:06 UTC","Log Number":"US-06292009-0008"}