{"Object Flight Path":"Path with directional change","trends":["There have been 7 other sightings in Yucaipa","There were no other sightings in Yucaipa on or around June 25th 2009"],"Tags":"City","Log Number":"US-06292009-0007","Latitude":"34.043515","Object Features":"Unknown","Summary":"Extremely bright whitish blue light intensified then dimmed over Yucaipa.","Viewing Distance":"Unknown","Case Number":"17713","files":["/var/www/straped/mufon/html2text/17713.html.txt","/var/www/straped/mufon/org/17713.html"],"Date Submitted":"06/25/2009 10:00 UTC","Source":"MUFON","Date of the Event":"06/25/2009 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.043515,+-117.037716(17713)&iwloc=A&hl=en\"> mufon case (17713) map </A>","City":"Yucaipa","Disposition":"IFO","Region":"California","Weather Factors":"None","Longitude":"-117.037716","Object Shape":"Star-like","Sighting Duration":"Undisclosed","divs":["sighting detailsmy husband and i were sitting on our front porch facing east in yucaipa, california. we were looking at the stars and watching for satellites when my husband pointed up toward the northeast sky. when i turned to look i saw a faint dot, like a satellite or faint star, which was brightening to an intense whitish blue light. the brightness was more intense than a jetliner head on in the night, more like a helicopter spotlight. the object was too far in the sky to be an airplane or helicopter and it was moving from north to south. the brightness lasted for about fifteen seconds then it diminished and again resembled a satellite or faint star as it changed direction and began heading up and eastward away from us until it disappeared. it was about 3\\4 up from the ground and appeared to be at the same height as satellites are normally seen. at the time my husband noticed the object we were discussing possible new job plans and just as i said, \"seems like we are supposed to be on a different path\" he pointed to the object. he said it looked like the object turned toward us, like a flashlight that is pointed away and then turns straight at you. we would just like to know what it was."],"Country":"United States"}