{"Case Number":"17728","Source":"MUFON","Disposition":"IFO","Summary":"Amber object w/angular direction change.","Object Shape":"Fireball, Star-like, Unknown","Weather Factors":"Unknown","Date of the Event":"06/29/2009 09:49 UTC","Sighting Duration":"00:02:30","Date Submitted":"06/29/2009 09:49 UTC","Viewing Distance":"Over One Mile","Region":"Connecticut","Object Flight Path":"Path with directional change","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17728.html.txt","/var/www/straped/mufon/org/17728.html"],"divs":["sighting detailsstanding in my driveway facing west i saw what appeared to be a flame-colored round light approach from the north and travel south at a relatively slow rate of speed until it made an angular direction change to a southwestern trajectory. upon going inside i looked up several nearby air-traffic control sites (jfk, bdl, bos, providence) and saw no flights traveling with that trajectory. also, i checked satellite traffic over the northeast for this evening, and no objects were in the area, especially making noticeable 60 degree southwestern turns. this may have been a pre-1970's airplane w\\out a pulsing nav light, but the size of the light and lack of sound would rule out any local air traffic in my opinion. also, this part of connecticut has a heavy volume of air traffic with bdl air traffic following interstate 91, running north and south, and i have never seen a light like this. this surely would have been picked up by any of the surrounding airports, being right in the middle of ny, ma, and ri. any other info would be appreciated. it is a very real possibility that i'm wrong to claim this as unidentified, but i've been around planes and know the local air traffic well, and have never seen anything like this."],"Log Number":"US-06292009-0020","Longitude":"-72.805884","trends":["There have been 7 other sightings in Meriden","There were no other sightings in Meriden on or around June 29th 2009"],"Latitude":"41.544274","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.544274,+-72.805884(17728)&iwloc=A&hl=en\"> mufon case (17728) map </A>","Tags":"City","City":"Meriden"}