{"files":["/var/www/straped/mufon/html2text/17720.html.txt","/var/www/straped/mufon/org/17720.html"],"Latitude":"43.910635","Object Features":"Unknown","Case Number":"17720","City":"Bath","Tags":"City","Disposition":"IFO","Viewing Distance":"Unknown","Summary":"Saw a solid white light pass over myself and a co-worker while we were leaving work. No blinking and completely silent. It flew overhead, was fairly low, but couldn't make out shape. It didn't fly completely strait, kinda wobbly and passed over BIW.","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"US-06292009-0014","Date Submitted":"05/15/2009 09:15 UTC","Region":"Maine","Weather Factors":"None","trends":["There has been one other sighting in Bath","There were no other sightings in Bath on or around May 15th 2009"],"Country":"United States","Date of the Event":"05/15/2009 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.910635,+-69.820602(17720)&iwloc=A&hl=en\"> mufon case (17720) map </A>","divs":["Sighting DetailsShortly after 9 a co-worker and I left work. Don't know why but something told me to look up. When I did I spotted a solid bright white light flying towards us. I pointed up and said to my co-worker, \"that's not a plane.\" We observed this object fly directly over our heads and just kept on going. Don't know exactly how fast, but at least 50-100 mph, not all that fast. The object was completely silent and didn't fly completely strait. It was kind of \"wobbly.\" It came from the south and flew north, crossing the Kennebec river in Bath. As it flew away i got into my car to go to a diferent location to keep an eye on this thing. I only saw it for a few seconds after that. All in all I observed it for about 10-15 minutes. This object had flown right over us, and we work right next to Bath Iron Works, or BIW, a General Dynamics company that builds warships; which is RESTRICTED air space. I don't know why, but I knew it was there, prompting me to look up. I do know that I feel and believe I've had alien abduction all my life, but thats another story for another day. I thought that this event was cool. It was really dark so I couldn't see the body of the craft as the light on it was extremely bright. My co-worker thinks it's a weather balloon."],"Object Shape":"Sphere, Star-like, Unknown","Sighting Duration":"Undisclosed","Longitude":"-69.820602"}