{"Log Number":"US-06292009-0016","Tags":"City","Object Shape":"Fireball, Sphere, Star-like, Unknown","trends":["There have been 2 other sightings in Brunswick","There were no other sightings in Brunswick on or around April 16th 2009"],"Case Number":"17722","Weather Factors":"None","City":"Brunswick","Object Features":"Unknown","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"04/16/2009 11:30 UTC","Latitude":"43.914016","Source":"MUFON","Summary":"Got home from work. Heard three to four different dogs barking so I looked up. Saw a solid orange star-like light flying from the southwest to the north east. Tried to contact it with a laser pointer. Did not react untril I blinked the laser three times.","Longitude":"-69.966996","files":["/var/www/straped/mufon/html2text/17722.html.txt","/var/www/straped/mufon/org/17722.html"],"Object Flight Path":"Straight-line path","Date Submitted":"04/16/2009 11:30 UTC","Region":"Maine","divs":["Sighting DetailsI got home from work. Walking to my door, I heard three or four diferent dogs barking in the background coming from different places. I decided to look up at the sky. When I did I saw a solid orange ball, a star-like object fly south to the north. I knew it wasn't any plane I've seen. I am a military \"brat\" and my father worked air defense in the army. I have lived in Brunswick since 1987, there is the BNAS, the Naval Air Station, and Portland Int. Jetport is about 25 miles away, so I see airtraffic all the time. This was NOT an airplane. I quickly ran inside and grabbed my bionoculars and my laser pointer. Thru the bionoculars it looked no different, so this object, what ever it was was big and pretty far away. I tried to contact it with my laser pointer. It did not respond until I blinked it three times. After I did that the object blinked three times back at me....and kept flying on its course!!! I felt amazed and shocked when it did that. I really didn't know what to think. I watched it til it flew out of sight."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.914016,+-69.966996(17722)&iwloc=A&hl=en\"> mufon case (17722) map </A>","Disposition":"IFO"}