{"Case Number":"17727","files":["/var/www/straped/mufon/html2text/17727.html.txt","/var/www/straped/mufon/org/17727.html"],"City":"Melvindale","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-06292009-0019","Object Features":"Unknown","trends":["There have been 6 other sightings in Melvindale","There were no other sightings in Melvindale on or around June 28th 2009"],"Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.29327,+-83.182105(17727)&iwloc=A&hl=en\"> mufon case (17727) map </A>","Object Shape":"Oval","Longitude":"-83.182105","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI was driving to work going north bound on the Southfield freeway at 11:10 pm when I noticed this bright light in the sky to the west of the freeway. I was just about to the outerdrive exit and I looked up and saw that it was a cluster of lights. I thought at first it was a plane but it didn't have the blinking lights a plane does and the lights weren't spaced right. I thought maybe it was a helicopter because it had a cluster of lights and then a little further away there was another one. So I turned my radio down thinking maybe it was a helicopter going to the hospital but I didn't hear any sound plus it wasn't moving. As the free way turned I noticed that the lights were spread out evenly. There were three maybe four of them. They were bright. Too bright for a plane or helicopter and they were really white. They were really low in the sky too. As I approached the oakwood exit I noticed a yellow dot shoot across the sky right through the lights. It stopped a short ways after the lights and then just disappeared. The dot moved too fast for anything I've ever seen before. I lost the lights behind some trees when I got off at the Oakwood exit. I kept looking but didn't even see a glimpse of them anywhere. I got to work at the hospital about 11:15pm. I went up to my floor and scanned the sky but didn't see anything abnormal. Later that night I was with one of my patients and she asked me if I had seen the lights in the sky and she pointed out her window in the direction of the freeway. I asked her what they looked like and she described them almost exactly as I had only she didn't mention a yellow dot. She said she'd never witnessed anything like that in her life. She said it made her feel weird. I never told her that I saw the lights or any details of my experience. When I was on the freeway I didn't feel scared or weirded out. I just felt curious. I wanted to know what the lights were."],"Object Flight Path":"Stationary","Date Submitted":"06/28/2009 11:10 UTC","Summary":"Driving to work saw round bright lights.","Latitude":"42.29327","Disposition":"Insufficient Data","Date of the Event":"06/28/2009 11:10 UTC","Region":"Michigan"}