{"files":["/var/www/straped/mufon/html2text/17731.html.txt","/var/www/straped/mufon/org/17731.html"],"Longitude":"-84.511925","trends":["There have been 12 other sightings in Woodstock","There were no other sightings in Woodstock on or around June 29th 2009"],"Disposition":"Insufficient Data","Object Shape":"Circle, Cylinder, Egg, Fireball, Sphere, Star-like, Unknown","Object Flight Path":"Straight-line path,Path with directional change,Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.103967,+-84.511925(17731)&iwloc=A&hl=en\"> mufon case (17731) map </A>","Region":"Georgia","Source":"MUFON","Summary":"From a cargo plane.","City":"Woodstock","Date Submitted":"06/29/2009 12:00 UTC","Object Features":"None","Log Number":"US-06302009-0001","divs":["Sighting DetailsI was out side on the front porch of my home in woodstock ga. It was around 10:30pm out of no whare. DID not here it intill it was in sight was a cargo plane, Only about 1,000 feet above the ground, I was watching it and from the right side of craft a ball of light, Not bright but not dim, In a aber color. Went about 70 feet to 100 feet above the plane the went fast. I Ran out in the yard to watch it the this ball of light turned right. It went right on a dime then I watch this cargo plane turn right following it. There was no noise from the other craft only from the plane. What I found strange was when the plane came over the tree that is when I started to hear the plane, as soon as it went over the tree line behind the house I could not here it anymore. There were no noise of the plane shoting anything, nothing coming from the other craft. There was no fire or smoke nothing that could point that this other craft had any type of engine. The cargo plane looked strange too. It had one green flashing light on the nose, then about 6 or 7 white light for the right side of the wing to the left week and I could not see any lights on the tail. After his all end I went inside me and my brother wife went in to tell my brother. We had no clue what is was. We tryed to debunk it but nothing that we knew could. If it was a missile or a gun we would have herd it, If it was a missile we would have seen the fire from the engine, And then it turned just right. That was so strange, I have no clue what it was. It could have been some type of probe but the cargo plane was chasing it. I have no clue what this was or why it was here."],"Case Number":"17731","Tags":"City","Latitude":"34.103967","Date of the Event":"06/29/2009 12:00 UTC","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"21-100 Feet"}