{"trends":["There have been 3 other sightings in Franklin","There were no other sightings in Franklin on or around December 1st 2004"],"Viewing Distance":"Unknown","Longitude":"-71.647299","Object Shape":"Undisclosed","Date Submitted":"12/01/2004 09:30 UTC","Latitude":"43.444243","Log Number":"US-06302009-0008","Tags":"City","divs":["Sighting DetailsIt was a windy December night, approximately 9:30 p.m. Me and my husband ,daughter, and son were all in the living room, everyone but my son who was 4 then was awake and watching a movie on Lifetime. All of a sudden my eyes glanced over to the top of my curtain rod and I noticed all these bright colors swirling around, it seemed like at first I sat there for a second and then I realized that it wasn't ordinary for those lights to be there.I jumped up ran over to the window and opened the curtains and all I saw was these really bright beautiful lights oscillating around, kind of rotating into each other if that makes any sense. I said \"what the heck is this\"? and my husband and 8 year old daughter ran up to me and they couldn't believe it either,we stood and stared for probably half a minute and I told my husband to go out and see what it was.It seemed like it was sitting over the house.As of then I was shaking so bad,my pulse probably was 120 easy.As my husband went out,we were still watching and suddenly they were gone.I ran over to the door and asked him what he saw and he said the minute he got out there was nothing,he looked all around for a helicopter or low plane or anything and there was nothing. There also was no sound.We went in and I ran up and checked my baby daughter sleeping in her crib and then I went down and called the Franklin Police to find out if there was any low planes because of the wind or anything,she checked somehow and said no,I proceeded to tell her what happened and the officer sitting next to her heard what we were talking about and said a man traveling on route 4 in Boscawen,NH which is 10 miles from here had called 2 weeks earlier with the same kind of sighting.That really freaked me out too.They said they would keep an eye out and that was that. For a month after what happened I kept noticing just about every night it looked like spotlights in the sky circling around our corn fields. They went away after that and I have never seen them since. I am just wondering if anyone else had seen these similar lights?"],"files":["/var/www/straped/mufon/html2text/17738.html.txt","/var/www/straped/mufon/org/17738.html"],"Weather Factors":"Unknown","Disposition":"Unknown","Region":"New Hampshire","Summary":"Oscillating red, blue, pink and purple lights coming from above house almost to ground.","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.444243,+-71.647299(17738)&iwloc=A&hl=en\"> mufon case (17738) map </A>","Source":"MUFON","City":"Franklin","Country":"United States","Date of the Event":"12/01/2004 09:30 UTC","Case Number":"17738","Object Features":"Undisclosed"}