{"Summary":"Large bright glowing object, much slower than meteor, much faster than plane/satellite.","Object Flight Path":"Straight-line path","Source":"MUFON","Date of the Event":"06/28/2009 10:15 UTC","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=37.978125,+-122.525457(17732)&iwloc=A&hl=en\"> mufon case (17732) map </A>","Object Shape":"Fireball, Oval","Viewing Distance":"Unknown","Longitude":"-122.525457","Latitude":"37.978125","Date Submitted":"06/28/2009 10:15 UTC","Tags":"City","trends":["There have been 6 other sightings in San Rafael","There were no other sightings in San Rafael on or around June 28th 2009"],"Weather Factors":"None","Disposition":"Unknown","Object Features":"None","Sighting Duration":"00:00:05","Country":"United States","Case Number":"17732","files":["/var/www/straped/mufon/html2text/17732.html.txt","/var/www/straped/mufon/org/17732.html"],"City":"San Rafael","divs":["Sighting DetailsDriving west across the Richmond-San Rafael Bridge at 10:14 p.m. PDT, I noticed out of my windshield directly ahead a large bright object in the sky moving apparently to the west toward the horizon at a rate of speed unlike any common object in the night sky. It was moving much faster than is possible for any aircraft (or satellite), but much slower than a meteor. It disappeared behind the ridge, from my perspective just to the south of Mt Tamalpais. I was near the eastern peak of the bridge (Richmond side) when I observed it. I only saw it for a few seconds before it disappeared from view. It was much brighter than any aircraft I've seen. I first thought it was a meteor. I can't be sure if it stayed on the exact same trajectory or turned slightly during the time I saw it. I immediately asked if any family member in the van had seen it, but none had. I just said \"Wow, look at that\", but due to noise and fatigue, no one else caught it out the windshield in time. I have seen one other similar object in my life, about 4 years ago in the town in which I live. One evening after dusk (about 20:00 hours) in April 2005 I saw the same type object from my windshield moving in a very similar trajectory -- due west. My daughter saw that object, too."],"Log Number":"US-06302009-0002"}