{"Latitude":"39.101626","Object Features":"Unknown","Date Submitted":"06/30/2009 12:30 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","divs":["Sighting DetailsI was at home,sweeping the deck and star watching. I stopped and took notice of it because of the size of the lights. Came over the tree line from the east. I thought could this be an airplane? Thought,\"Look at the angle of the bottom light. The other two sightings were straight on the wings.Chevron shaped 8 lights flew in from the east. The corner of the right side,was turned up and that light on the end was sitting up and to the side. I believe it is like the Phoenix lights pics. Not sure if it was the Phoenix lights pics but have seen this before. Like a check mark backwards, on the right side and straight on the otherside. 8 lights, 4 on each side. No noise on a quiet night. Almost stopped and turned a circle and went northeast, slightly north and more east. Low in the sky. I couldnt make out a body of the craft. Judging the shape by the lights. This has happened 3 times in the last 2 weeks. Last sighting, June 30,2009. Appx. 1AM I am normally not too impressed with lights in the night. But the size of the lights were the size of a dime held out at arms length. This could have been an aircraft. But flew too low. Judging the size of the ship by the lights would make this craft larger than our commercial aircraft. Height about 200-300 yards. Size of the light formation, about 100 yards, it was big."],"City":"Kansas City","Country":"United States","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around June 30th 2009"],"Summary":"Chevron shaped 8 lights flew in from the east.","Source":"MUFON","Object Shape":"Boomerang, Chevron","Longitude":"-94.570247","Case Number":"17746","Viewing Distance":"501 Feet - 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.101626,+-94.570247(17746)&iwloc=A&hl=en\"> mufon case (17746) map </A>","Weather Factors":"None","Date of the Event":"06/30/2009 12:30 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/17746.html.txt","/var/www/straped/mufon/org/17746.html"],"Region":"Missouri","Log Number":"US-07012009-0002"}