{"Longitude":"-95.994088","Source":"MUFON","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=41.255413,+-95.994088(17742)&iwloc=A&hl=en\"> mufon case (17742) map </A>","Summary":"See detailed description.","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around June 17th 2008"],"Date of the Event":"06/17/2008 07:30 UTC","City":"Omaha","divs":["Sighting DetailsI was on my balcony on a clear June night around dusk, but still pleantly of light in the sky. I walked out on my 3rd story appartment balcony to enjoy a cigarette, and my eyes were immediatley drawn to the horizon to the east, where I saw a huge dark object, like a cigar laying horizontally, and it seemed to slowly float, it was more like a bouncing or skipping, but it almost seemed to move in slow motion. I've never seen anything move like that in my life. I yelled for my girlfriend and my 7 year old son to come outside and look to make sure I was seeing what I was seeing, they were both stunned and had no idea what it could have been. We were watching it float from north to south togeather for about 1 minute, and then it dissapeared. Literally just dissapeared. No lights turned on, nothing. It was there, plain as day, then it was gone. I called Eppley Airfield & the local police station to ask them if anyone had reported seeing anything strange in the sky, because I had, and the operator snickered and told me no. What I saw was like nothing I've ever seen, and I hope everyone gets a chance some day to have the same experience. It was very exciting, it made me feel like a giddy little kid. Now that I have seen one, its very frustrating to me how people just laugh it off. Even when a report is so credible that it makes it to the evening news, EVERY time, the anchorpeople laugh it up & don't take it seriously causing the people watching not to take it seriouly."],"Log Number":"US-06302009-0012","files":["/var/www/straped/mufon/html2text/17742.html.txt","/var/www/straped/mufon/org/17742.html"],"Date Submitted":"06/17/2008 07:30 UTC","Case Number":"17742","Weather Factors":"None","Sighting Duration":"00:02:30","Object Flight Path":"Straight-line path","Disposition":"Unknown","Latitude":"41.255413","Tags":"City","Viewing Distance":"Over One Mile","Object Features":"None","Country":"United States","Region":"Nebraska"}