{"Date of the Event":"06/26/2009 11:15 UTC","Object Features":"None","Latitude":"37.596152","Viewing Distance":"Unknown","Sighting Duration":"00:00:25","Region":"California","Weather Factors":"Unknown","City":"Ceres","map":"<A HREF = \"http://maps.google.com/maps?q=37.596152,+-120.94961(17744)&iwloc=A&hl=en\"> mufon case (17744) map </A>","Case Number":"17744","Country":"United States","Source":"MUFON","Summary":"Orange glowing, straight line moving, looked like a few circles glowing together, disappeared into haze.","divs":["Sighting DetailsAfter returning from NYC on a business trip, I had my mom and girlfriend over for a BBQ and some time in the pool enjoying the sun (108F that day) When the sun finally set my GF and I enjoyed some quality time sitting on my extended patio looking up into the night sky. I was remembering my childhood and those summer nights spent hunting for satellites, looking for planets, and watching the jets come into SFO doing their Modesto Three Arrivals of which I was just a part of as I recently flew in on a Delta flight from JFK-SFO. The coolest thing was actually counting 8 satellites of which 3 were circumpolar. My GF is a nurse and had to get up early on Monday morning so she asked if I wouldn't mind if she laid down for a bit because she was tired. So she goes in the house, I grab my favourite recliner and lay back to count more satellites. I had an idea to grab my night vision binoculars and did. I love the night sky and have been looking at it since I was a boy. I decided to put them away after about ten minutes and went back to just looking straight up with my naked eye. Just then out of the corner of my eye I see something that grabs my attention. At first I thought, what a big bird that is, then after looking at it more intensely I decided it was a bunch of orange ballons drifting from NW to SW. As I lookedmore I realized that there was not any wind at so at because of the record 108 temps we had that day. So, I stared and stared even saying out loud, \"What the Hell is that?\" What I saw had fuzzy edges, but also like it was made up of objects that were round glowing orange like when metal is heated. It moved so elegant and so straight. Not fast, and not too high because of the duration that I saw it (25 secs) also, it did not disappear of trees but rather into the haze of the night sky. Funny thing, satellites never go all the way across the sky because at some point they are no longer in a direct path of the sun to reflect light. I was so excited with seeing this thing that I ran into the house and woke my GF up telling her every detail. Again, orange, glowing appearance, moving in straight line, not too fast but elegantly, made up of circular round looking light sources, and disappeared into the haze of the sky. I'd like to hear any explaination available for what this thing was. I'm a private piolt and an amateur astronomer enthusiast and I have NEVER seen anything like this."],"trends":["There have been 2 other sightings in Ceres","There were no other sightings in Ceres on or around June 26th 2009"],"Object Flight Path":"Straight-line path","Disposition":"Unknown","Log Number":"US-06302009-0014","Date Submitted":"06/26/2009 11:15 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/17744.html.txt","/var/www/straped/mufon/org/17744.html"],"Object Shape":"Other","Longitude":"-120.94961"}