{"divs":["Sighting DetailsWhile on a visit to see our son at his Phoenix residence, we (my wife, son, my son's girl friend, and myself) were relaxing by the pool on a typical hot Phoenix afternoon. While laying on a pool side lounge chair I noticed what appeared to be a star visible at mid-day in a bright cloudless sky. The object was a faint amber light that was difficult to see and I wondered how it would be possible to see any star in such daylight conditions. I removed my perscription sun glasses to view the object with my naked eyes just to ensure myself that the object was not an artifact caused by the lenses. The object was visisble to my normal vision also. I watched the object remain motionless for a few minutes and then noticed another faint amber light to the southwest of the object apparently appear out of thin air. The two objects then began to close on one another and appeared to get rather close and then seperate. It was at this time that I alerted my son, wife, and girl friend who were in the pool to look up to see if they could locate the objects I was pointing out. The women gave up looking after a few quick glances skyward. My son stuck with me and climbed out of the pool to sit behind me so I could point and direct his sight toward the objects. At that time one of the objects began to change brightness and color becoming much more visible and he picked it up. The brighter object began an erratic zig zag pattern of decent, then climbing higher into the sky and then a movement toward the west. A high flying airliner became visible as it flew west to east and we could easily estimate that the objects we were viewing were much higher than the aircraft which appeared to be above 35K feet. We commented back and forth about what the objects might be as two or three other small amber lights appeared in that portion of the sky. We ruled out satelites because of the motions the objects were exhibiting, as well as birds catching sunlight. We were convinced that the objects were intelligently controlled, very high and wondered if they were experimental aircraft. Then one of the objects began exhibiting a strange flight that resembled a bow-tie or highly angular object floating down from a high altitutde like a leaf falling from a tree on a windy day. The object grew brighter and changed (flickered) from white to blue to green to orange back to bright white and blue as it seemed to decend closer to us. We both were very excited by what we were seeing as well as confused and filled with more than a bit of wonder as to what they were and what it might mean. We viewed the objects for up to a half an hour before the objects appeared to increase in altitude and move out of sight to the west. We had a camera available but because of the daylight conditions and the apparent size of the objects in the sky, I believed we had no chance of actually getting a decent shot so I never tried to take a picture."],"Country":"United States","Object Shape":"Circle, Diamond, Star-like, Triangle, Other","Longitude":"-112.070837","Sighting Duration":"Undisclosed","City":"Phoenix","Summary":"Multiple star like and angular light objects exhibiting erratic flight, color, and size changes.","Log Number":"US-07022009-0004","Source":"MUFON","Object Features":"Unknown","Latitude":"33.451277","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Date of the Event":"06/25/2009 01:20 UTC","Weather Factors":"None","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around June 25th 2009"],"Tags":"City","files":["/var/www/straped/mufon/html2text/17759.html.txt","/var/www/straped/mufon/org/17759.html"],"Disposition":"Unknown","Date Submitted":"06/25/2009 01:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.451277,+-112.070837(17759)&iwloc=A&hl=en\"> mufon case (17759) map </A>","Viewing Distance":"Over One Mile","Region":"Arizona","Case Number":"17759"}