{"Weather Factors":"None","Object Shape":"Disc","Region":"North Carolina","Date Submitted":"09/30/2002 12:00 UTC","Object Flight Path":"Hovering then path","Latitude":"35.722739","City":"Wilson","Log Number":"US-07012009-0011","trends":["There have been 2 other sightings in Wilson","There were no other sightings in Wilson on or around September 30th 2002"],"Disposition":"Insufficient Data","Date of the Event":"09/30/2002 12:00 UTC","divs":["Sighting DetailsI had just left work about 5:00 pm and noticed a large number of jet contrails cris-crossing the sky. I live within 75 miles of Seymour-Johnson AFB and Cherry Point Marine Air Station so jet contrails are common place, but had never seen the large number I saw that afternoon (approx. 12 jets). The contrails were very high in the sky. I noticed what appeared to be a contrail that looked different than the others in that it was blunt on both ends, not narrow just behind the jet and wider as the jet moved away. I could see the jets just in front of the other contrails but not this one. It looked so unusual that I pulled over and got out of my truck so I could watch it a little closer. I then realized that this one particular contrail was much lower to the ground than the others and it was still blunt on both ends and was not growing longer as a normal jet contrail would as the jet moved through the air. As I said, I could not see any jet near this contrail. As I looked at it I realized that it wasn't a contrail at all, but was a mettalic looking object, silver gray in color, just hanging (hovering) in the air. I could see what appeared to be facets along the edge. It was about the size and shape of a silver dollar held out at arm's length and the right side was approximately 45 degree angle from the ground. I could not believe what I was seeing, but the longer I watched it the more certain that I was that it was some kind of a flying craft. It did not appear to have a dome on top like pictures I have seen. It was flat on top and bottom and appeared to be disk shaped and I was looking directly at the edge (side). While I was watching this the jets were continuing to criscross the sky but at a much higher elevation that the object I was seeing. It seemed as if the jets were searching for something. I watched it for about two minutes more and it began to shorten on both ends untill It was gone. I assumed that it traveled directly away from me at a high rate of speed and this is what made it appear to \"shorten\" on both ends. The sun had just gone beneath the horizen but the sky was completely bright so my visability was very good. There was no glare from the sun and no clouds - a beautiful day. I never reported it and never saw anything in the paper on on the news about it."],"Summary":"Noticed many jet contrails high elevation. Observed UFO below contrails.","Source":"MUFON","Case Number":"17755","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/17755.html.txt","/var/www/straped/mufon/org/17755.html"],"Longitude":"-77.90945","Object Features":"Patterned Surface","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.722739,+-77.90945(17755)&iwloc=A&hl=en\"> mufon case (17755) map </A>"}