{"Disposition":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Region":"California","City":"Pasadena","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17754.html.txt","/var/www/straped/mufon/org/17754.html"],"Longitude":"-118.143016","Date Submitted":"06/30/2009 08:00 UTC","Log Number":"US-07012009-0010","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","divs":["Sighting DetailsThis object was observed in Pasadena at the Caltech campus, just off Wilson Avenue to the west, at 8pm. It was heading north at quite a slow speed. I had just finished work and was heading over to the parking structure. There is a nice open space with a good view of the sky and I was taking in the view whilst walking. This is when I noticed the object, which was silhouetted clearly. At first I thought it was a helicopter as they're quite common around here. I also thought it might be a bird gliding high up. Closer scrutiny showed none of these to be the case. It was perfectly black, and could be seen clearly against the sky, which was still light as the sun hadn't set yet. What I observed literally was a perfectly round, black spot that changed shape to a thin line and back again, with a period of about 5 seconds. It looked to me a like a disc that was rotating about its planar axis, to give the appearance of a spot that was alternating its shape with that of a thin line. It was travelling along the direction of its axis of rotation, towards the north before it got lost to my vision behind other buildings and trees. I tried to find it again after getting on my motorcycle and heading north, but to no avail. As I mentioned, it's speed was relativity slow, and it was not moving in a straight line. It was meandering and hovering, but it's general direction was north. From its movement, I estimate that it was about 1km away and had a diameter of 50-100 metres (very subjective of course)."],"Date of the Event":"06/30/2009 08:00 UTC","trends":["There have been 26 other sightings in Pasadena","There were no other sightings in Pasadena on or around June 30th 2009"],"Object Shape":"Disc, Sphere","Latitude":"34.150225","Case Number":"17754","Weather Factors":"Unknown","Summary":"Black UFO, round disc shape that was rotating about its planar axis.","Country":"United States","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=34.150225,+-118.143016(17754)&iwloc=A&hl=en\"> mufon case (17754) map </A>"}