{"Longitude":"-121.053741","Tags":"City","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=39.227891,+-121.053741(17758)&iwloc=A&hl=en\"> mufon case (17758) map </A>","Object Shape":"Other, Unknown","Region":"California","Latitude":"39.227891","Date of the Event":"07/02/2009 03:30 UTC","Country":"United States","Log Number":"US-07022009-0003","divs":["Sighting DetailsAt 0330 hrs. I walked out front deck to feed the cat, then stopped a minute to have a cigarette. I was looking up in the sky towards the west when I saw a fiery object flying at a very rapid speed twoards our home , it did then fly right over our house, only a couple hundred ft. above the tree line, we have tall pines on our property so they are about 100 ft. tall...the object was not that high up, I could see it clearly...reminded me of a childs baton, a long stick with a bulb at each end...the center was dim, but the 2 lights at each end were fiery color and bright. The object was soundless, it was not a very large object, about the length of an old Toyota car best I can explain. It went over so fast I didnt'have time to wake my husband or get the camera, I did run around the house to see it again but by the time I got out back the object was gone. Please note the object did disturb our cat out front, the cat was very upset for about half hour after the event...I have never seen anything like that, was kind of disturbing to me also."],"Disposition":"Unknown","Weather Factors":"Unknown","Summary":"UFO shot over our house at a rapid speed, stick shaped object with 2 fiery balls at each end, center was dim. Soundless.","City":"Grass Valley","Source":"MUFON","Case Number":"17758","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17758.html.txt","/var/www/straped/mufon/org/17758.html"],"Date Submitted":"07/02/2009 03:30 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around July 2nd 2009"]}