{"Weather Factors":"Rain, Unknown","Object Features":"Patterned Surface","Date Submitted":"07/01/2009 08:30 UTC","Case Number":"17756","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17756.html.txt","/var/www/straped/mufon/more/17756_submitter_file1__UFOJuly12009.jpg","/var/www/straped/mufon/org/17756.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.717199,+-86.88873(17756)&iwloc=A&hl=en\"> mufon case (17756) map </A>","City":"Michigan City","trends":["There have been 15 other sightings in Michigan City","There were no other sightings in Michigan City on or around July 1st 2009","This sighting has never been favorited.",""],"Log Number":"US-07022009-0001","Longitude":"-86.88873","Object Shape":"Disc","Disposition":"Unknown","Latitude":"41.717199","Country":"United States","Region":"Indiana","Summary":"Michigan City, IN, July 1, 2009; bright orange/yellow light with black/grayish flutted edges, round.","Date of the Event":"07/01/2009 08:30 UTC","Viewing Distance":"101-500 Feet","Tags":"City","divs":["sighting detailsjuly 1, 2009, going home (west) hwy2, michigan city, in. wife and husband about 8:30 p.m. (dusk) when suddenly on the outskirts of town we observed what i thought to be an ingenious 4th of july stunt. as it became closer i realized we were seeing something truly unique. yes, a real ufo! the craft had a dark mass underneath and a bright orange\\yellow bright light spuing out an aura of same. it continued at a steady speed approximately 70 mph at about 500 feet in height. i could not pull over so continued on as it passed directly over our vehicle. wife put her head out of the window, looking straight up at the bottom of the craft, and saw what i have drawn, the bottom was flutted black\\gray with indentations, with a round, bright light of orange\\yellow in the middle and she probably got the best view of it. i then found a parking lot, pulled in, ran out and grabbed the binoculars. the height of the craft had increased by this time to about 800 feet and i zeroed in on it. the bright, flaring light had dimmed to a ring of continuous light of the same vibrant red\\orange color and distinctive black round disk-like rearend. there was no noise. it gained in altitude to about 1500 feet and my wife said it made a slight curve (turn) but maintained speed. just then another motorist pulled in beside us to ask- what the heck is that??!! he and his son saw it too. i watched as it disappeared out of sight, and gained more height. there is no reasonable explanation for this sighting. it had no wings so that its slow speed would invariably send it stalling to the ground. no balloon i know of could have such a varied light show this displayed with such intensity. i am a recreational pilot, and have a good sense of height and size. the size was approximately 30 feet in diameter."],"Source":"MUFON"}