{"map":"<A HREF = \"http://maps.google.com/maps?q=36.910137,+-116.754856(17751)&iwloc=A&hl=en\"> mufon case (17751) map </A>","Latitude":"36.910137","Case Number":"17751","City":"Beatty","Object Shape":"Sphere, Star-like","Log Number":"US-07012009-0007","Source":"MUFON","Longitude":"-116.754856","trends":["There have been 2 other sightings in Beatty","There were no other sightings in Beatty on or around June 26th 2009"],"divs":["Sighting DetailsWeeks prior to event, I planned on taking son and fiance with me for our 1st time visit to Gilliland Ranch (Trout Lake, WA) but my son's high-school football practice schedule recently confirmed conflicting summer scheduling. I have been disappointed because my fiance and son have been cynical of UFOs and have made jest of my personal experience a decade ago in Mount Shasta. We were traveling N to Reno between Beatty & Tonopah (Nevada) with fiance driving. I was watching night sky through our sunroof and side windows hoping to see a \"power-up\" sphere commonly seen at Gilliland Ranch but resolving it would be most improbable. As we traveled between Beatty and Tonopah, I saw a light traveling N over the mountains to the east at about 3 o'clock with respect to our vehicle. I pointed it out to my son in the back seat. My fiance caught sight of it as well. While we watched it, the star-like entity grew to incredible brightness whereby a large halo of light surrounded it. Shortly after comments of awe from my son and fiance, it began to dim as it traveled N reaching about 1 o'clock with respect to our vehicle. My son followed its traveling while in a dimmed state for a few seconds longer and commented it's \"weird\" traveling path. I could not see it after dimming. After we arrived in Reno, I googled the map and discovered it was within the western proximity of the NV Test Site and Area 51. It was not frightening. Both my fiance and son confirmed their feelings of having seen a UFO. I felt relief and satisfaction that my son had experienced what he could have seen if he could travel with us to Gilliland Ranch later this summer. Ironically, prior to our Reno trip, I had just received the materials for Mufon testing to be a field investigator. I doubt my son and fiance will be making jest of UFOs any longer."],"Object Flight Path":"Straight-line path,Path with directional change,Other","Summary":"Star-like traveled N, increased to large sphere with halo-like brightness, faded.","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"06/26/2009 10:15 UTC","Object Features":"Unknown","Viewing Distance":"Over One Mile","Sighting Duration":"00:01:00","Region":"Nevada","Tags":"City","Date Submitted":"06/26/2009 10:15 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/17751.html.txt","/var/www/straped/mufon/org/17751.html"]}