{"Region":"Pennsylvania","Summary":"The object was black and cigar shaped.","divs":["Sighting DetailsI was heading home from work, south bound on i95. It was a nice day and I was noticing how picturesque the sky looked. I have seen a few unusual cloud formations recently and have become fond of taking pictures of them. I saw an amazing cloud bank straight ahead over the high way, and thought wow this would be a nice shot. I had my camera on the seat right next to me, but decided that trying to take a picture wile driving was a bad idea. Then I saw what at first glance looked like a plain, but then I realized I never see plains flying across this part oh the highway. The other thing was that it was black and did not appear to have wings or any vertical control surfaces. Just as I was trying to figure out what this could be it vanished right before my eyes. I attempted to rationalize what I saw by telling myself it flew into the clouds, but the object never changed altitude and it was well below the clouds. The part that really got me going happened about three minutes after the object disappeared. I saw a fighter jet flying from the direction the object originally came from. It was moving conspicuously fast and then it accelerated out of sight. The fighter looked like an F18."],"Case Number":"17764","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date Submitted":"07/03/2009 02:30 UTC","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Weather Factors":"None","Object Shape":"Cigar","files":["/var/www/straped/mufon/html2text/17764.html.txt","/var/www/straped/mufon/org/17764.html"],"Sighting Duration":"Undisclosed","City":"Philadelphia","Latitude":"39.954495","trends":["There have been 216 other sightings in Philadelphia","There were 4 other sightings in Philadelphia on or around July 3rd 2009"],"Source":"MUFON","Date of the Event":"07/03/2009 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.954495,+-75.157689(17764)&iwloc=A&hl=en\"> mufon case (17764) map </A>","Tags":"City","Log Number":"US-07022009-0009","Longitude":"-75.157689","Country":"United States"}