{"Latitude":"42.336415","Case Number":"17769","Log Number":"US-07022009-0014","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.336415,+-122.874215(17769)&iwloc=A&hl=en\"> mufon case (17769) map </A>","Object Flight Path":"Undisclosed","City":"Medford","files":["/var/www/straped/mufon/html2text/17769.html.txt","/var/www/straped/mufon/org/17769.html"],"Object Features":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Date of the Event":"07/01/2009 12:00 UTC","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around July 1st 2009"],"Longitude":"-122.874215","Weather Factors":"Unknown","Tags":"City","Region":"Oregon","divs":["Sighting Details At approximately 2200 hrs on 1 july 2009 I was sitting on my deck, which faces south, when I noticed an object, which I thought was mars because it had a red cast to it, go from a stationary position and start moving south. It then made a sharp left turn and started moving east. It then made a another left turn and started north. When it started it was about at a 45 degree angle in the southern sky and moved toward my location until it moved far enough north that I could not see it because it went out of my sight behind the deck cover. About one minute later it reappeared from behind the deck cover heading south and stopped at about the position from which it started! When I looked at it through my field glasses, it appeared to have flashing red and green lights on it. However, that could have caused by atmospheric conditions. I have no idea how high it was or the range. I am a retired Senior Master Sergeant after working 35 years for the Oregon Air National Guard in avionics. When I retired in 1992 I was the Avionics Flight Line Superintendent at the 173rd Fighter Wing at Kingsley Field in Klamath Falls Oregon, so I have been around aircraft all my adult life. I never saw one that could come to a complete halt at altitude, start up again, make sharp turns and then return to a stationary position for almost and hour. I have spent many hours the past 15 years on my deck here in Medford after dark looking the at sky and watching airliners make their approach to Medford. This is the first the time I have seen any thing strange."],"Country":"United States","Date Submitted":"07/01/2009 12:00 UTC","Summary":"I was sitting on my deck at approx. 2200 hrs when I noticed an object I thought was Mars start to move.","Object Shape":"Circle","Sighting Duration":"Undisclosed"}