{"Log Number":"US-07032009-0004","map":"<A HREF = \"http://maps.google.com/maps?q=47.223114,+-123.091067(17773)&iwloc=A&hl=en\"> mufon case (17773) map </A>","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17773.html.txt","/var/www/straped/mufon/more/17773_submitter_file1__sightings.JPG","/var/www/straped/mufon/org/17773.html"],"trends":["There have been 6 other sightings in Shelton","There was one other sighting in Shelton on or around July 31st 2004","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Features":"Unknown","Summary":"A bright green light fell extremely fast and landed and glowed for hours.","divs":["Sighting DetailsI lived on a bay and a bright green light fell extremely fast from the sky, so fast that i expected to hear and see a crash, but it was silent. The bright green glowing object appeared to have landed, but it went from extremely fast to stopping in an instant. It landed across the bay in the forest, where i saw a green glow. I looked through binoculars and could only see a green glow, no object or movement. I watched it for about 3 hours, it was still glowing. There was definitely no glow there before the green light fell from the sky (unknown distance, i saw it from inside my house through a window). When the light fell it was so bright that it caught my attention while i was watching tv, saturday night live i believe. Also I know it was in the summer, however i never recorded it so i do not know the exact date, it might not have even been the 2004 summer. Anyway, i have really no explanation for this object being able to fall at an incredible speed and not hearing or seeing a crash, and then seeing it glow for hours. I fell asleep after watching the glow for about 3 hours. It was gone the next night, didnt see it during the next day."],"Case Number":"17773","Disposition":"Insufficient Data","Object Shape":"Other","Date of the Event":"07/31/2004 12:29 UTC","Country":"United States","Region":"Washington","Viewing Distance":"501 Feet - 1 Mile","City":"Shelton","Latitude":"47.223114","Sighting Duration":"03:00:00","Date Submitted":"07/31/2004 12:29 UTC","Source":"MUFON","Longitude":"-123.091067","Tags":"City"}