{"Log Number":"US-07042009-0006","City":"Golden","Case Number":"17785","Country":"United States","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around June 26th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.761243,+-105.21287(17785)&iwloc=A&hl=en\"> mufon case (17785) map </A>","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"06/26/2009 08:15 UTC","Source":"MUFON","Date of the Event":"06/26/2009 08:15 UTC","Weather Factors":"Windy, Medium","files":["/var/www/straped/mufon/html2text/17785.html.txt","/var/www/straped/mufon/org/17785.html"],"Object Features":"None, Unknown","Object Shape":"Circle","Object Flight Path":"Straight-line path","Summary":"While playing basketball in my back yard I noticed a black dot like thing flying west toward Lookout Mountain. It was windy that day and this object had no lights and was on the same course at the same speed heading into the wind. It appeared to be small.","Disposition":"Unresolved","Latitude":"39.761243","divs":["Sighting DetailsWhile playing basketball in my back yard I noticed a Black dot thing flying West toward Lookout Mountain. It was windy that day with thunder storms. This object had no lights and remained on the same course at the same speed heading into the wind. It appeared to be small. Like the size of a Car maybe. It was Black or Black Grey. After I watched it for a while I Pointed it out to my friend but he couldn't see it lol.. So I called my roommate out and he spotted it quickly and was puzzled about its Identity. I think it was about 5000 ft up and moving at about 300mph. This is all a guess unfortunately. It moved across the sky about the same speed as a satellite in the night sky, but it was day and Very low. It didn't look arrow dynamic. More like a boulder floating by and disappearing. Ive been camping and working a lot or I would have file this sooner. Any other reports of this? Regards, Robert L Richardson"],"Tags":"City","Longitude":"-105.21287","Sighting Duration":"00:10:00","Region":"Colorado"}