{"Date of the Event":"07/02/2009 11:15 UTC","files":["/var/www/straped/mufon/html2text/17782.html.txt","/var/www/straped/mufon/org/17782.html"],"Disposition":"Unknown","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.625941,+-97.133345(17782)&iwloc=A&hl=en\"> mufon case (17782) map </A>","Longitude":"-97.133345","City":"Gainesville","Viewing Distance":"Unknown","Region":"Texas","Object Shape":"Star-like","divs":["Sighting DetailsMy son and I were heading south on I - 35 freeway just outside of Gainesville, Texas on the border with Oklahoma at about 80 mph near 11pm July 2, 2009. Ahead of us, we suddenly saw a very bright slowly pulsing white light. It was only about 2 times higher than a freight truck ahead of us - 10 degrees off horizon. It was blinking very slowly but rhythmically. The light was a very large, extremely white and extremely bright single source white light. I would say the source of it as it blinked looked larger than 50' feet across. It was only a few hundred feet off the ground. No other little lights anywhere near it was observed. No other obvious airplane type wing tip lights were observed. The light source was so bright that we cannot see what generated it or what was behind the light source. Whenever it blinked, it looked like a giant starburst of pure white light and it looked to be just flashing rhythmically. It did not change colors while it blinked along. The speed of it was quite slow as it moved along the freeway. I'd say no faster than 100mph. As we moved south on the freeway, the light slowly came closer and closer to us and finally it flew past us going northerly. Its altitude was at best 500 feet. However, as it passed overhead, I opened the car window and could not see anything behind it and did not hear any noise beyond wind noise from the highway. Certainly, there were no helicopter blade noise nor were there engine noise. It is highly doubtful at a mere few hundred feet that a normal single engine or other type of airplane engine noise would not be heard. It continued north after passing the car. There were trucks and cars on the road at the time. Nobody stopped. The incident lasted about 20-25 seconds from beginning to the point where it we cannot see it in the rear view mirror after it went northerly and passed us going southerly on the freeway. It doesn't look anything like a helicopter, single engine or any kind of jet plane. It did not make any noise. The white flashes were very large and extremely long. It also held the white light much longer than a blinking flash would normally hold. I'd say when it \"pulsed\", the bright light source was on for at least half a second to 1.5 seconds each time . Then, it would be dark for about 1 second or less and it would blink again. The pulse itself looked at a distance to be wider than 50 feet. Certainly it did not look like a bulb or a wing tip light."],"Log Number":"US-07042009-0003","Summary":"Extremely bright single source pulsing white light moving slowly over the freeway.","Sighting Duration":"Undisclosed","Case Number":"17782","Date Submitted":"07/02/2009 11:15 UTC","Object Flight Path":"Undisclosed","Latitude":"33.625941","Country":"United States","Weather Factors":"Unknown","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Gainesville","There were no other sightings in Gainesville on or around July 2nd 2009"]}