{"Tags":"City","Longitude":"-92.84873","Log Number":"US-07042009-0005","divs":["Sighting DetailsWas halfway home going south on hwy52 coming from just seeing Judas Priest at the \"The Taste of MN\" as i driving along i could clearly see passenger jets lined up to make their landings of to the west you know how you see one giant headlight. Well of to the east heading north parallel to the highway at my quess 500-600ft looked like two headlights flying pretty slow then as came more off to the side of it it looked like the typical sightings of the triangle sort three white lights at the corners then one red strobing in the middle [bottom] its dark and i have my wife and three of my five kids with me so i didnt keep trying to see any more of it as i was going by. i could not for the love of god see it as anything ,but triangle shaped did not look like a plane at all. i only noticed because i was driving towards it and it was cloud cover and it was easy to notice the lights cuase it seemed so low. like i said we were going in opposite dirctions so it was basically on course nothing eratic it was all about 15 sec. my feeling was that i wished i could turn around to do some more inspection."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.74169,+-92.84873(17784)&iwloc=A&hl=en\"> mufon case (17784) map </A>","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Triangle","Latitude":"44.74169","Date Submitted":"07/03/2009 11:45 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Country":"United States","trends":["There have been 4 other sightings in Hastings","There were no other sightings in Hastings on or around July 3rd 2009"],"Weather Factors":"Does Not Apply","Case Number":"17784","files":["/var/www/straped/mufon/html2text/17784.html.txt","/var/www/straped/mufon/org/17784.html"],"City":"Hastings","Date of the Event":"07/03/2009 11:45 UTC","Source":"MUFON","Disposition":"Unknown","Summary":"Noticed triangle shape craft heading north following Hwy 52 towards St. Paul.","Region":"Minnesota"}