{"Weather Factors":"Unknown","Object Shape":"Cylinder, Sphere","Case Number":"17781","City":"Lake Havasu City","Date of the Event":"07/03/2009 07:45 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-114.314565","Tags":"City","Disposition":"Unknown","Date Submitted":"07/03/2009 07:45 UTC","Object Flight Path":"Undisclosed","trends":["There have been 30 other sightings in Lake Havasu City","There was one other sighting in Lake Havasu City on or around July 3rd 2009"],"Object Features":"Undisclosed","Summary":"4 cylinder/orbs appear in the sky directly above us and fly away incredibly fast.","files":["/var/www/straped/mufon/html2text/17781.html.txt","/var/www/straped/mufon/org/17781.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.491141,+-114.314565(17781)&iwloc=A&hl=en\"> mufon case (17781) map </A>","Country":"United States","Latitude":"34.491141","Region":"Arizona","divs":["sighting detailsmy girlfriend and i were watching the weather changes as the storms surrounding us were dying out. i was looking towards the south east i then panned towards the south and within an instant 2 cylinder\\orbs appeared directly over our house. they then began streaking away to the west. no sooner that set disappeared in the horizon, another cylinder\\orb appeared out of no where in the same location. my girlfriend was now also keyed in on what was happening and could not believe this other cylinder appeared out of thin air and began moving towards the west. we were both quite amazed at what we were seeing. as soon as the other cylinder\\orb disappeared on the horizon, one more appeared directly above us. both of us were just baffled that this was actually happening. i then ran inside to get my camcorder. when i came back outside aprox 10 seconds later it was also disappearing out of site on the western horizon. recently we've had several weather balloons make appearances as part of a joint nasa - univ of mexico project. i saw those weather balloons and this was nothing even remotely close to that. these objects were completely silent and incredibly fast. we often also have air force jets from nellis often training above us and refueling almost nightly, so i'm well accustomed to what they look and sound like. these were not a jets, they were way too fast to be jets. i have personally known about ufo's in our airspace since 1992 on a professional level. i worked in the national security agency from 1991 to 1995. this is only the second time i've witnessed a sighting in real time. it was truly amazing."],"Viewing Distance":"Unknown","Log Number":"US-07042009-0002"}