{"trends":["There have been 41 other sightings in Fort Wayne","There were no other sightings in Fort Wayne on or around June 28th 2009"],"files":["/var/www/straped/mufon/html2text/17780.html.txt","/var/www/straped/mufon/org/17780.html"],"City":"Fort Wayne","Case Number":"17780","Object Shape":"Sphere, Unknown","Latitude":"41.087733","Weather Factors":"Does Not Apply","Viewing Distance":"20 Feet or Less, 101-500 Feet","Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsI was awakened by my dog who wanted to go out at approximately 4:25 am. I let the dog out and went and got some water. After a few minutes when the dog hadn't returned I stepped to the front door and called his name. I turned and put on my shoes and stepped out onto my front porch to call for the dog. As I did, I noticed small, round white lights in the woods surrounding my home. *I live in a fairly heavily wooded area of five acres* These were multiple, white lights that numbered probably 20 or more. I initially thought they were flashlights but I realized some of the lights were high and others lower to the ground. At this time I became aware that the lights were moving towards me and I felt a little frightened. The dog came around the house and I told him to hurry. The lights were still moving towards me and becoming closer. My dog saw the lights and stopped and looked towards them. I urged him to come and I hurried us into the house, closing the storm door behind me. I turned back to the door and some of the lights were quite close to me and the door. One went right over where I would have been standing and I realized a breeze had come up and that some drops of fluid appeared on the glass of the door. I couldn't figure out what I was seeing and even though it was odd and scary I couldn't move away from the door and continued to watch these round, white lights. There seemed to be a pattern to them, almost an ebb and flow. I changed my position slightly and saw deeper into the woods a fairly large red light. I thought it was a police car at first and then realized the red light was not blinking like the lights of a police car. I then heard brakes and towards the highway I saw a car come to a quick stop and I think whoever was in the car was seeing the same thing I was. *Which was a big relief!* After several minutes the car on the highway pulled away. I wanted to see the red light closer and so I grabbed my car keys and ran to my car and drove down the end of my driveway. Once I was at the end of the drive I realized that I couldn't see the red light any longer. I looked up towards the sky and saw a large, brilliant white light. At this point, I drove back to my house and was able to see a few of the smaller white lights that seemed to still float around the woods. The smaller white lights seemed to be approximately the size of a baseball an smaller. They were not identical in size. This experience lasted approximately 20 to 25 minutes. I'm fairly sure of the duration as I was texting my sons who were gone for the week-end, telling them what I was seeing. I wish I had thought to take a picture but I was so freaked out by what I was seeing that all I could manage to do was watch."],"Summary":"Unusual lights and objects.","Region":"Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=41.087733,+-85.132691(17780)&iwloc=A&hl=en\"> mufon case (17780) map </A>","Object Flight Path":"Stationary","Log Number":"US-07042009-0001","Date of the Event":"06/28/2009 04:25 UTC","Date Submitted":"06/28/2009 04:25 UTC","Object Features":"Unknown","Disposition":"Unknown","Country":"United States","Tags":"City","Longitude":"-85.132691"}