{"Log Number":"US-07042009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=41.200082,+-75.874363(17795)&iwloc=A&hl=en\"> mufon case (17795) map </A>","Date Submitted":"07/04/2009 10:30 UTC","Longitude":"-75.874363","Date of the Event":"07/04/2009 10:30 UTC","Object Flight Path":"Undisclosed","Case Number":"17795","Object Shape":"Teardrop","Tags":"City","Region":"Pennsylvania","Country":"United States","files":["/var/www/straped/mufon/html2text/17795.html.txt","/var/www/straped/mufon/more/17795_submitter_file1__17795sketch2.jpg","/var/www/straped/mufon/more/17795_submitter_file2__17795sketch1.jpg","/var/www/straped/mufon/org/17795.html"],"divs":["Sighting DetailsLooking notheast up valley at fireworks saw light coming orange. Thought to be an airplane. heard no sound. object continued south, turned east. Next object came a few min. later [ 10? ] same path. followed by another in distance. ran in house for binoculars. sited and focused on third object. it rose in altitude east, and accelerated in speed out of site. Fourth object came over mtn. in north, heading southeast. Got good look at this as it came closer. Than object increased in altitude, and traveled southwest i'm guessing. It went up and out of site. followed a satelite and could still see that, behind slight cloud. Surmised cloud did not block view of fourth object. It looked like the shape of a hot air balloon. wind was moving toward east. It did not follow wind, nor could balloon have that much speed. REALLY COOL! Better than any fireworks! the first 3 seemed a bit yellow at times with the naked eye. An exiting thing to see, but you can't share that!"],"Disposition":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Hanover Twp","trends":["There have been no other sightings in Hanover Twp","This sighting has never been favorited."],"Latitude":"41.200082","Object Features":"Undisclosed","Summary":"Orange glowing brighter at bottom, not unlike illuminated hot air bal.","Source":"MUFON","Weather Factors":"Windy, Light"}