{"Summary":"Orange light moved across the sky, made an \"S\" curve and into clouds.","Case Number":"17797","divs":["Sighting DetailsAt 9:50pm after watching fireworks, me, my wife and child were headed home northbound on Hwy 97 in Sand Springs, OK (near Tulsa)passing near Shell Creek Rd. We saw what at first we assumed was a firework in the sky. It was orange in color and had no discernible shape, just an orange light in the sky. It was not a firework. It stayed at what appeared to be a constant altitude and crossed the road we were on, made a small \"S\" curve and disappeared into a cloud bank. The sighting lasted for what we assume was about 1 minute. It never changed intensity nor shape or size. There were no other colors or lights on it, just an orange, or yellowish orange light or possible sphere? There was lightning in the sky and as I have never seen ball lightning, I cannot rule this out, but this did NOT seem like any kind of lightning or \"plasma\" and appeared to be an orange light on a straight course until it made an abrupt \"S\" curve and then continued on the same basic heading right into a cloud and was lost from our vision. My wife and I both said out loud, \"That is NOT a plane or helicopter...THAT\"S A UFO!\". It was approximately about the size of a BB held at arms length."],"Disposition":"Unknown","Country":"United States","Viewing Distance":"Unknown","Date of the Event":"07/04/2009 09:50 UTC","Log Number":"US-07052009-0002","trends":["There has been one other sighting in Sand Springs","There were no other sightings in Sand Springs on or around July 4th 2009"],"Sighting Duration":"00:01:00","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/17797.html.txt","/var/www/straped/mufon/org/17797.html"],"Region":"Oklahoma","Date Submitted":"07/04/2009 09:50 UTC","Latitude":"36.14197","Tags":"City","Object Features":"Unknown","Object Shape":"Sphere, Other","City":"Sand Springs","Longitude":"-96.104331","Weather Factors":"Lightning, Medium, Light","map":"<A HREF = \"http://maps.google.com/maps?q=36.14197,+-96.104331(17797)&iwloc=A&hl=en\"> mufon case (17797) map </A>","Source":"MUFON"}