{"Tags":"City","trends":["There have been 14 other sightings in Warren","There was one other sighting in Warren on or around July 4th 2009"],"City":"Warren","Object Features":"Unknown","Longitude":"-83.024777","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Country":"United States","Weather Factors":"None","Region":"Michigan","Case Number":"17808","files":["/var/www/straped/mufon/html2text/17808.html.txt","/var/www/straped/mufon/org/17808.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.4948,+-83.024777(17808)&iwloc=A&hl=en\"> mufon case (17808) map </A>","divs":["Sighting DetailsIn Warren, Michigan, at apx. 11p.m., I stepped out onto the front porch (facing south). Watching the neighborhood fireworks, I happened to notice bright lights sitting stationary amid the fireworks. They were in a tight, horizontal row and golden-white in color. The middle one was slightly larger. I could faintly make out an amber-reddish glow around the periphery of each. It appeared to be three lights on one object. They were steady, not pulsating. Every once in a while, they would grow alittle bit brighter, then dimmer. Initially, I thought it was a firework with a delayed explosion, but it never exploded. Then, I thought it was an airplane making its ascent from a nearby airport, considering how low on the horizon it was (less than 45 degrees). But the lights were too golden, and the object was stationary. Convinced it wasn't conventional, I ran inside for 2 seconds to grab my camera-phone. When I got back outside, the lights had dimmed to a pale orange, but the object had not moved. I aimed my camera at it, and it suddenly tilted at an angle (diagonal) and made a rather hasty departure to the right of me (west). It flew behind the nearby treeline, and I lost sight of it. Didn't see it again."],"Log Number":"US-07052009-0013","Date of the Event":"07/04/2009 11:00 UTC","Source":"MUFON","Object Shape":"Other","Latitude":"42.4948","Viewing Distance":"Unknown","Date Submitted":"07/04/2009 11:00 UTC","Disposition":"Insufficient Data","Summary":"Object w/three bright golden-white lights, with amber-red \"aura\"...hovered for apx. 5 min. before tilting and moving sideways out of sight."}