{"Viewing Distance":"Unknown","Country":"The Netherlands","Log Number":"NL-07052009-0011","Disposition":"Unresolved","Case Number":"17806","divs":["Sighting Detailsat 0900 PM, my son told me a star had fallen from the sky and I looked out my bedroom window and saw a silver coloured kind of metalic sphere flying quite low and above our backyard, it had some kind of halo or aura around it, it was beautiful and I just could't stop looking at it, the thought of it being an ufo did not pas through my mind at that moment I just kept thinking where are the windows..my son of 6 yrs was very happy and kept jumping up and down and pointing at it.. a few minutes later it dissapeard behind the neightbours roof, located againts our backyard.. then another ufo appeard, this time a triangle shaped one, silver coloured and metalic, no windows no doors just metalic and the sun shining reflection on it, suddenlly lights came out underneath this triangle, as of it had some kind of led lights underneath, then it left and another one showed up this time following a plane ...at this point I realised it was an ufo as it started flying around the plane. My son of 6 took my camera and made two pictures, while but it was quite far away at that moment so you would have to zoom it to see it, what you see as being white is the reflectionof the sun on the metal. It was a clear evening, the sun shining brightly, almost no clouds, and no birds something I'm not used to see as there are always birds here flying around."],"Object Features":"None","Object Flight Path":"Stationary,Hovering then path","files":["/var/www/straped/mufon/html2text/17806.html.txt","/var/www/straped/mufon/more/17806_submitter_file1__P6050230.JPG","/var/www/straped/mufon/more/17806_submitter_file2__P6050231.JPG","/var/www/straped/mufon/org/17806.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=52.635031,+4.757556(17806)&iwloc=A&hl=en\"> mufon case (17806) map </A>","Weather Factors":"Unknown","Summary":"One sphere two triangles silver metalic.","Longitude":"4.757556","Date of the Event":"06/05/2009 09:00 UTC","Object Shape":"Sphere, Triangle","Latitude":"52.635031","trends":["There has been one other sighting in Alkmaar","There were no other sightings in Alkmaar on or around June 5th 2009","This sighting has never been favorited.",""],"City":"Alkmaar","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"06/05/2009 09:00 UTC","Tags":"City","Region":"Noord-Holland"}