{"map":"<A HREF = \"http://maps.google.com/maps?q=34.616084,+-112.311141(17815)&iwloc=A&hl=en\"> mufon case (17815) map </A>","Region":"Arizona","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-07052009-0020","Date of the Event":"07/02/2009 09:20 UTC","Summary":"5 to 8 objects, changing formations, hovering, pulsating colors.","Weather Factors":"Lightning, Light","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","trends":["There have been 12 other sightings in Prescott Valley","There was one other sighting in Prescott Valley on or around July 2nd 2009","This sighting has never been favorited.",""],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/17815.html.txt","/var/www/straped/mufon/more/17815_submitter_file1__OriginalPosition.jpg","/var/www/straped/mufon/more/17815_submitter_file2__Movement.jpg","/var/www/straped/mufon/more/17815_submitter_file3__Semi-CircleFormation.jpg","/var/www/straped/mufon/org/17815.html"],"Longitude":"-112.311141","Date Submitted":"07/02/2009 09:20 UTC","Object Shape":"Star-like","Disposition":"Unknown","Country":"United States","Tags":"City","City":"Prescott Valley","Latitude":"34.616084","divs":["Sighting DetailsAt around 9:20 PM, I was walking passed a large sliding glass door that looks out across my back yard and all the way to the horizon. I saw five very bright objects, relative to the size of bright stars, but brighter, hovering in the air. They appeared to be closer to the horizon than to my house. When I first saw them they were in a zig-zag pattern, like an elongated letter 'm'. I was curious, since I often look at the night sky and this formation did not look familliar, so I went outside to watch them. I watched them for more than half an hour. After watching them for a few minutes, I saw them start to move, in different directions. When they started moving, other objetcs appeared. I called my daughter out to look, and a few minutes later my whole family was watching. The objects changed formation while we watched. They formed a triangle, they formed a diamond, they formed a concave semi circle, they split into two groups, they came back to their 'm' pattern. Sometimes, other lights appeared (we saw as many as 8 at one time), sometimes they dimmed so that only three were visible. It seemed that when they were moving, they got dimmer, but when they were hovering, they were brighter. A couple of the objects pulsated, and the color of the light quickly changed from white to red to white to red, etc.... While viewing these objects, I was awestruck at what I was seeing. I knew they were not stars or planets because of their independent movement from each other. I knew they were not aircraft because of the way they were hovering, motionless. If they were some sort of helicopter, I would have expected to hear them. When it was over, and all the lights dimmed, my skin as covered with goosebumps. We finally lost sight of the objects when some of them just blinked out, and others flew off in different directions and dimmed out. While the objects were dsispersing and dimming out, I heard the sound of an aircraft flying by, but did not see anything. Using a compass, from my porch their position was very close to exact north, maybe a degree or two to the west. I would very much like to speak to an investigator about this sighting."],"Object Features":"Unknown","Case Number":"17815"}