{"Case Number":"17816","Sighting Duration":"Undisclosed","Country":"United States","Viewing Distance":"21-100 Feet","Log Number":"US-07052009-0021","Latitude":"37.679214","Date of the Event":"07/04/2009 11:10 UTC","City":"Chanute","Longitude":"-95.457203","Region":"Kansas","Date Submitted":"07/04/2009 11:10 UTC","Object Shape":"Circle","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=37.679214,+-95.457203(17816)&iwloc=A&hl=en\"> mufon case (17816) map </A>","Source":"MUFON","Summary":"Orange light.","files":["/var/www/straped/mufon/html2text/17816.html.txt","/var/www/straped/mufon/org/17816.html"],"trends":["There have been no other sightings in Chanute","This sighting has never been favorited."],"divs":["Sighting DetailsIn Chanute, Kansas around 11:00 pm on the 4th of July,last night, we had just finished shooting off the last of fireworks and everyone was going inside. I had steped back out on the porch and noticed to the NorthEast a firework display a couple of blocks from our house. I stood and watched it, after the firework was done I noticed a flaming orange ball come from the same direction. At first I thought it was a burning ember from the firework but it just keep coming my direction. I walked out into the yard and it was still lite up and coming my way. I really believed it was a burning ember, but the closer it got to me I noticed it looked like an orange fire inside of a clear ball. It traveled straight past our yard and our house and continued to travel to the south. I watched it for at least 45 seconds continuing on it's course south until I could no longer see it. I went inside and told my husband what I had just seen. He walked out with me and we were looking in the sky, a few minues later he asked me if that was what I had seen and to the East we seen another one off in the distance. I told him yes, that was the color. We sat in the back yard and continued to watch the sky. Within 20 minutes we seen another two from the North. Every time we would walk toward it to see it better, it would move back to the north. We had no storms in the area on the 4th. I know I have never seen anything like this in my life. We watched for over an hour and did not see anymore of them. This was no burning ember or firework it stayed lite to long and traveled a very long distance in a straight line, it never went any higher and stayed at the same altitude. When it went by the house it was close enough that I could see a clear ball with an orange fire inside, it made no noise and did not seem like it was very big, but it was diffently bright."],"Object Features":"None","Tags":"City","Disposition":"Unknown"}