{"Longitude":"-116.957187","Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Object Shape":"Star-like, Triangle","divs":["Sighting DetailsMy wife, parents and I were in the back yard to watch the Spring Valley fireworks at 9pm. Around 8:45 my mother said that she saw some red lights hovering over El Cajon. The rest of us looked and saw 3 lights in a roughly triangular formation hovering high over El Cajon. They began to drift slowly south-eastward. I went inside and grabbed a pair of binoculars to look more closely at the lights but they didn't look much clearer though they were of an elongated triangular shape which I've seen before. A fourth light appeared to the east and began to pace the 3 lights, and on top of a nearby hill (Dictionary Hill) we saw a red flaring light on the top that almost seemed to be signaling the lights. Around 9pm, when the fireworks were to start, the triangular lights formed a line, and the middle light faded quickly away. I predicted that the lights would probably be gone by the end of the fireworks display, and sure enough, by 9:15, they were gone. I did a search online this morning, and saw that such red lights have been sighted over El Cajon on the 4th of July now every year since at least 2003. I have witnessed 2 other UFO phenomena in or above El Cajon in the last 15 years, just for the record."],"Date Submitted":"07/04/2009 08:45 UTC","Summary":"3 red lights over El Cajon, in triangular formation.","Weather Factors":"Unknown","Latitude":"32.802793","Case Number":"17813","files":["/var/www/straped/mufon/html2text/17813.html.txt","/var/www/straped/mufon/org/17813.html"],"Date of the Event":"07/04/2009 08:45 UTC","Disposition":"Hoax","trends":["There have been 41 other sightings in El Cajon","There were 5 other sightings in El Cajon on or around July 4th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.802793,+-116.957187(17813)&iwloc=A&hl=en\"> mufon case (17813) map </A>","City":"El Cajon","Log Number":"US-07052009-0018","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Region":"California"}