{"City":"El Cajon","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-07052009-0016","Region":"California","Tags":"City","Weather Factors":"Unknown","Case Number":"17811","map":"<A HREF = \"http://maps.google.com/maps?q=32.796693,+-116.959837(17811)&iwloc=A&hl=en\"> mufon case (17811) map </A>","Latitude":"32.796693","trends":["There have been 41 other sightings in El Cajon","There were 5 other sightings in El Cajon on or around July 4th 2009"],"Sighting Duration":"Undisclosed","Date of the Event":"07/04/2009 08:30 UTC","Date Submitted":"07/04/2009 08:30 UTC","Disposition":"Insufficient Data","Object Features":"Undisclosed","Source":"MUFON","Longitude":"-116.959837","Summary":"Three flashing red dots stayed formed triangle and stayed in sky for over an hour; 4th joined eventually.","divs":["Sighting DetailsProbably not alien life, but definitely and unidentified flying object. I live in El Cajon, the east county part of San Diego. Last night was the 4th of July, so around 8:30 I went to this tiny church on a hill, it's where my friends and I go to just sit around basically, and there's a great view of San Diego from the spot. So we were up there waiting for fireworks and at about eight forty five one of us noticed three really bright red \"dots\" in the sky. They were flickering, not like a plane would but not like stars either, simply getting brighter and dimmer and brighter and dimmer. They simply sat in the sky for a minute or two, then started slowly moving, went directly over our heads, and eventually formed a very distinct triangle in front of us. Then after about fifteen minutes they seemed to disperse from each other again and headed in a different direction. They moved slowly, about the speed they would go if they were drifting with wind currents, but they were moving with purpose. They moved away from us and got dimmer but were definitely still there. I'd guess that there was probably a light on one side of the object, and it rotated the light away from us making it seem duller. Anyway, as they moved away, a fourth red object rose into our sights (it was blocked by the church until that point), and this one was as bright as the other three had originally been which makes me think that it had the light facing towards us? A few of my friends said that they saw one of the objects \"drop\" something dark, but I didn't see this.. A few also said that it looked like there was something \"behind\" the red lights, but I wear contacts which hinders my ability to pick out things like that. I ended up going home about when the 4th light came, which was probably around 9:15. I googled the red lights, and it seems like people have seen something very similar to them on the 4th of July in 2007 and 2008. So maybe they are some kind of government aircraft out there to regulate fireworks? I really don't know, I just know that these were not any kind of planes or flying object I had ever seen before."],"Country":"United States","files":["/var/www/straped/mufon/html2text/17811.html.txt","/var/www/straped/mufon/org/17811.html"],"Object Shape":"Triangle, Other, Unknown"}