{"Longitude":"-75.692593","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=45.43033,+-75.692593(17812)&iwloc=A&hl=en\"> mufon case (17812) map </A>","Object Features":"Unknown","Object Shape":"Unknown","City":"Ottawa","Date of the Event":"06/30/2009 11:59 UTC","Object Flight Path":"Straight-line path","trends":["There have been 55 other sightings in Ottawa","There was one other sighting in Ottawa on or around June 30th 2009"],"files":["/var/www/straped/mufon/html2text/17812.html.txt","/var/www/straped/mufon/org/17812.html"],"Latitude":"45.43033","Tags":"City","Date Submitted":"06/30/2009 11:59 UTC","Summary":"Circulating red light on silent craft.","Sighting Duration":"00:00:50","Log Number":"CA-07052009-0017","Disposition":"Unresolved","Region":"Ontario","Source":"MUFON","Country":"Canada","divs":["Sighting Details On the night of June 30th 2009 (Kingston Ontario, 44.2 lat., -76.5 long) myself and my mate were walking our dogs at 12:00 midnight to 12:10. Always being interested in the sky and keeping an eye open this night was perfect, clear sky's the moon just partly lit in the south west sky, when I noticed a glint in the southern sky at about 10 o'clock position looking West. I have seen lots of sat's give up there location to the setting sun glowing brightly and then going out. I watched this to see where it was going and how long it would last. It then got bigger and I figured I was looking at a plane headlight, but then it got longer so I asked my mate, what do you think of this light. She quickly looked up and we both watched as it got brighter and larger, looked like an hour glass on fire to me, how far off, no idea but it seemed a great distance, then after about 15 seconds it went out, just sort of a grey outline in the sky, so I thought wow that was some light show. It must be huge to look that bright down here and still be seen as an outline (looked to me like a bus flying through space, from where I stood) I thought, spacestation but it travels West to East I thought not South to North, I did assume thats what I must be seeing.. Then I noticed that there was a red light on the object. I thought, what in orbit would have a red light on it that I could see from here? Then I noticed the red light was moving. It traveled a circular pattern as it it was mounted on the outside and was going around something. The object could not be seen, it was as if it was invisible, but the red light gave it away, It took about 5 seconds for the light to do one revolution (counter clockwise), I watched 3, 4 revolutions as the object was directly over head moving towards the North. No sound, nothing, just then I noticed, it was glowing on the top, I could not see the top but the air above it was lite up like the color of a sunset, pink, orange, red, I mentioned, look it's glowing at the back on top, just then a small orb came off of the larger object, this orb looked like an ember from a hot fire, about the size of a star, and just as bright. It made several loops behind the object (like an ember in the wind) , seemed to follow, but I watched the larger object due to the fact that if you took your eye away you could probably not locate it again, the object continued to the north with the light rotating. The Red light was the red of a tail light in a car or a jet, how fast would it have to have been going to go from sunlight to over my head in 25 seconds, then to the north and back out of sight in another 35 seconds? The circular path the light took was very large, I would say that if you held out a 5 inch disk at arms length it's about the size of the light path when the object was overhead. The whole event lasted about 50 seconds or so. I have never seen anything like this and I am in my 45th year here on Earth. I will try to get my mate to submit what she saw. Never stop looking up you never know what you'll see ! James in Kingston."],"Case Number":"17812","Viewing Distance":"Unknown"}