{"Region":"Pennsylvania","divs":["Sighting DetailsThis is my third attempt to submit this sighting, everytime I click submit is goes to an Invalid page saying I lost my connection. Lets start the story. It was 8:42 exactly, my son and I were leaving the house to go to Keystone Pizza at the corner of our block for a pick up order for 8:45. Once we arrived at the corner I noticed this flashing green and red light over the city hall buildings. Usually when I come to this corner I can see a large variety of airplanes, some with flashing lights, some with bright flashing lights, bright steady landing lights etc. This was not one of the usually lights I seen. We ran back to the house I grabbed my digital video camera and ran back up to see the lights. They were still flashing green then red, I took video for a few seconds but the zoom couldn't capture the shape, so i tried to move closer and grabbed some more video. I took 4 all together. I noticed the object shift to the left, unfortunately I didn't get this on video, but after it was in the new position, the only light I could see flashing was the red. At this point the object was not moving just staying in that spot, so we proceeded to get our pizza. Came back out and crossed to the dollar store for drinks. Looked up and object was still there, I grabbed another video and I asked some neighbors and walking pedestrians to acknowledge the light and ask what there opinions were. Some said they thought it was part of the building until they realized the object was above the building, someone said it may be a helicopter, but I doubt it, I have seen helicopters and from that distance its noway a helicopter would be as big or as bright. Hopefully you can analyze video and figure out what I seen."],"Object Flight Path":"Undisclosed","City":"Philadelphia","Object Features":"Undisclosed","Date Submitted":"07/03/2009 08:45 UTC","Date of the Event":"07/03/2009 08:45 UTC","Object Shape":"Star-like","Country":"United States","Viewing Distance":"Unknown","Latitude":"39.953735","Disposition":"Insufficient Data","Tags":"City","files":["/var/www/straped/mufon/html2text/17819.html.txt","/var/www/straped/mufon/org/17819.html"],"Case Number":"17819","map":"<A HREF = \"http://maps.google.com/maps?q=39.953735,+-75.158369(17819)&iwloc=A&hl=en\"> mufon case (17819) map </A>","Longitude":"-75.158369","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 216 other sightings in Philadelphia","There were 4 other sightings in Philadelphia on or around July 3rd 2009","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Log Number":"US-07052009-0024","Summary":"UFO sighting over Philadelphia Center City."}