{"Summary":"White triangular shaped object surrounded by strange red, green, and yellow cloudlike light.","divs":["Sighting DetailsThe year was definitely 1964. I was 16. I'm not certain of the month, day, or exact time. I think it was spring or summer. The night of the sighting was pleasant, the night skies were clear and beautiful-cloudless and stary. My mother had taken our dog out into the front yard. She left the front door open so I heard her through our screen door say, \"What the hell is that?\" I got up and went outside immediately to see what was wrong. My mother pointed to the sky toward the east. At an altitude of about 3000 feet and a distance of about 2 miles,we saw a strange light in the sky- it is difficult to describe because I've never seen anything like it before or since. A moment or so after, my father came outside and saw the object as well. We saw three primary colors of red, green, and yellow surround- ing the object. What was particularly strange was that the light had a vaporous, cloudy, luminescent, quality to it-a very eerie sight.We watched the object for what was probably a few minutes-it was not moving- it just hovered in one spot. My dad told me to \"get the binoculars\" which I did very quickly. We all took turns looking through the binoculars and it was then that I saw a white triangular shape inside the vaporous colors that were described earlier. The triangle shape couldn't be seen with the naked eye.During almost the entire time of the sighting, the object continued to hover almost 20 minutes. I had enough time to knock on neighbors doors and call my best friend who lived about a block away but strangely enough, noone was home. We continued to watch but then an airliner (probably a 707) flew into the airspace of the ufo. The plane was on its final approach to Linberg Field in San Diego. They must have gotten a really good look at it becasue as the plane decended, it parralleled the altitude of the ufo for a moment. Suddenly, and for the first time the ufo moved at tremendous speed into deep space! Within 7 seconds the object seemed to disappear into space. It was then that my father who then worked for Rohr Aircraft on military and commercial aircraft and satillites and even had security clearances for some of the more secret work then being done, said,\"Well, we've just seen a ufo, we don't have anything that moves like that.\" This story is absolutely true and I hope you can send a record of this sighting to me -I have never had it verified. The sighting took place from our home in San Diego. Gregory N.Perna"],"Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/17814.html.txt","/var/www/straped/mufon/org/17814.html"],"Longitude":"-117.155555","Tags":"City","Latitude":"32.720629","Object Flight Path":"Undisclosed","City":"San Diego","Weather Factors":"Unknown","Date Submitted":"05/15/1964 08:15 UTC","Region":"California","Object Shape":"Triangle","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around May 15th 1964"],"Country":"United States","Log Number":"US-07052009-0019","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.720629,+-117.155555(17814)&iwloc=A&hl=en\"> mufon case (17814) map </A>","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Case Number":"17814","Date of the Event":"05/15/1964 08:15 UTC"}