{"Tags":"City","trends":["there have been no other sightings in university place\\lakewood","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.22012,+-122.557861(17822)&iwloc=A&hl=en\"> mufon case (17822) map </A>","divs":["Sighting DetailsMy mother and I were sitting on the back patio. Which is secluded because the house sits up on a bluff surrounded by trees. The way the house is situated on the property, as well the location of the property it is statistically improbable this was the result of fireworks. We live by McChord AFB and Ft. Lewis and they had festivities on base so no night flight activities there. Our house is also on the approach to Seatac Airport (South to North)However yesterday they were on the North,South approach. Moon rise had not occurred as of yet either. Ok, now that I have tried to dispel the usual suspects let's get to the story. As I was saying. my mother and I were sitting on the back patio when she noticed a red spherical shaped object suddenly appear in the evening sky and move slowly and silently from east to west. This lasted about 1 minute when all of a sudden it flashed real bright stopped changed from east to west to a southwesterly slight climbing in altitude direction it flashed two more times very quickly not as luminous and just disappeared. Ok, I am thinking this could have been a meteor skimming across the atmosphere before bouncing off into space. Well I would have been fine and dandy with that explanation, until not even a minute later it reappeared in the same position doing exactly the same motions, except varying speed then coming to a complete stop. It flashed brightly and then changed direction climbing in altitude and heading due south. It flashed two more times although not as intensely bright then just disappeared. The whole duration lasted five minutes. From 21:59 to 22:04 Pdt. I thought that was pretty fricken awesome, it was what happened afterwards that has me thinking this baby wasn't from anything we manufacture. Because at 22:06 I saw a low orbiting satellite fly over going from south to north and at 22:08 a second low orbiting satellite flew over heading from west to east. I understand there is a lot of equipment flying around in orbit, and maybe this is just coincidence. But...at 22:16 a low flying aircraft was over the same general area as the UFO not a normal flight pattern and this was a jet. Still coincidental? at 22:26 another jet this one smaller and older because the engines were louder not fighter more like an old 727. Flew over the same general vicinity. At 22:28 a third aircraft this one a cessna sized aircraft flew around the same general area this time flying in a circle around the general area before moving on. After that the skies were quiet except for the fireworks in the background. The episode ended at 22:38"],"Log Number":"US-07052009-0027","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Insufficient Data","Object Features":"None","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"07/04/2009 09:59 UTC","Region":"Washington","City":"University Place/Lakewood","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/17822.html.txt","/var/www/straped/mufon/org/17822.html"],"Summary":"UFO fly by.","Source":"MUFON","Latitude":"47.22012","Weather Factors":"None","Case Number":"17822","Date of the Event":"07/04/2009 09:59 UTC","Longitude":"-122.557861","Viewing Distance":"Unknown"}