{"Source":"MUFON","Disposition":"Unresolved","Case Number":"17835","Object Flight Path":"Stationary,Hovering then path,Path with directional change","trends":["There has been one other sighting in Akureyri","There were no other sightings in Akureyri on or around June 15th 2005","This sighting has never been favorited.",""],"Longitude":"-18.11046","files":["/var/www/straped/mufon/html2text/17835.html.txt","/var/www/straped/mufon/more/17835_submitter_file1__20050613234256644.jpg","/var/www/straped/mufon/org/17835.html"],"Object Shape":"Fireball, Star-like","Viewing Distance":"20 Feet or Less, 21-100 Feet, Over 1 Mile","Date of the Event":"06/15/2005 11:30 UTC","Country":"Iceland","City":"Akureyri","Region":"Norðurland eystra","Date Submitted":"06/15/2005 11:30 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=65.683868,+-18.11046(17835)&iwloc=A&hl=en\"> mufon case (17835) map </A>","Tags":"City","Weather Factors":"Windy, Rain, Light","Latitude":"65.683868","Sighting Duration":"00:01:00","Summary":"Fireball, orange looking, very fast, similar to meteorite.","Log Number":"IS-07052009-0039","divs":["Sighting DetailsWell, me and my nephew were at his house, prepping for an evening of stargazing. We were at the car when we saw a light in the sky.First i dismissed it as a plane.On further inspection, we could not dermine what it was and did not seem to be a plane as it was stationary otherwise and then it was going back and forth. This was a relatively still night. No outlines of a plane to be seen.just this white-bluish light south of us about 400-500 metres up.We were heading to where it was stationary so we decided to follow it.By then it had started to move south, out of town where we were going anyway for stargazing which i do quite frequently and see some strange things. We managed to follow it for some time not ever really seeing what it was until it stopped above a wooded area, which we then promptly entered.We stopped the car in a little clearing and couldnt see the light object anymore. We stayed there for awhile and then suddenly this red-orange, flash of light, came from the southeast sky to due north and just disappeard very quickly,lasted only about probably less than a minute i think.It went into the woods, it was very small, like a flare, but not. I would have thought it a meteor, but a meteor that close as i saw it would have had to had a trail and being so close would have done damage and obviously been visible longer upon inspection.I was stunned at seeing something so close and obviously i tried to go through what it was.If it had been a flare of some sort, there would have been noise, and it would have gonu up or down not sideways.It was not a light bug as there are none in Iceland.It was not a meteor or comet as this light was closer than a big meteor could be without destroying a vast area, disappered into the woods. It was to quick to decide if it was man made or otherwis a constructed object, I can say it was a ball of lightning, which is sort of what it was,however, but they are extremely rare in this country, and would they travel in mid air going downward for a few meters, i dont know.i have so little to compare with. although we do have something called snowmoon that are sort of whispy lights during winter like swamp gas or balls of fire. Note. I have numerous other accounts in those woods and in that general area, it is close to an airport, where people have seen things come on the radar and then disappear.people have been chased by balls of light in their cars and a few stories here and there from people who have had amazing experiences. P.s there are 1 thunderstorms in this town every 10 years or so."]}