{"Latitude":"47.759875","Tags":"City","Source":"MUFON","Case Number":"17840","Country":"United States","divs":["sighting detailswa state: watching fireworks a friend pointed out a \"planet.\" but looking at it, it was moving very slowing. it was red\\orange in color and started off very large. we kept watching it and it would get as small as a faint star, and then return very brightly. all the sudden there were two more objects, same in color and shape. they were flying around each other in all different directions still moving east (i think it was east) one would become fainter as if it was getting further away, the others brighter. one continued to almost flicker out until it was gone, then another one. the last one lingered for another 15 seconds before disappearing almost instantly. our initial reaction was that it was firework embers, but clearly it was not, it made no noise, although it was the fourth, so fireworks were going off. the stopping and going, and direction changes of the objects were too swift and fast looking to be a plane, helicopter ect.. and we decided we had never seen any aircraft that luminous in color. we all knew what we saw....we were so hoping we were not the only ones!!! we have been on the internet since last night looking for anyone who saw something similar to what we did."],"Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=47.759875,+-122.160048(17840)&iwloc=A&hl=en\"> mufon case (17840) map </A>","Date Submitted":"07/04/2009 10:15 UTC","City":"Woodinville","Object Shape":"Circle, Sphere","Object Features":"Undisclosed","Weather Factors":"None","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17840.html.txt","/var/www/straped/mufon/org/17840.html"],"Longitude":"-122.160048","Date of the Event":"07/04/2009 10:15 UTC","Summary":"Three red/orange objects flying in Washington State city.","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-07052009-0044","trends":["There have been 4 other sightings in Woodinville","There were no other sightings in Woodinville on or around July 4th 2009"]}