{"Case Number":"17844","Date Submitted":"04/16/2009 11:45 UTC","Log Number":"US-07052009-0048","Latitude":"39.115032","Date of the Event":"04/16/2009 11:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.115032,+-76.569365(17844)&iwloc=A&hl=en\"> mufon case (17844) map </A>","Country":"United States","Weather Factors":"Unknown","Object Shape":"Unknown","divs":["Sighting DetailsThis information is in addition to the April 16, 2009 incident regarding a sound signature unlike anything heard before over the skies of Pasadena. I did not see an object in the sky as described in the original report but defiantly heard the sounds as they were described that night. I am not military however I know sound signatures in the sky from years of experience. The sounds heard in the sky that evening were not helicopter, jet or blimp in nature. These sounds were magnetic resonance like. A oscillatory humming sound with a slight low frequency penetration. Defiantly pulse like. Not monatomic at all. Not street sweeper sounds as initially thought might be as described in the official report. All those machines could be identified blind-folded. Not this. I was home alone that night watching TV and the sound was heard in the direction SW from my location. The sound was overpowering the sound level on my TV. This is why I became interested in the noise. My wife was out of town. However a week later to the day the same sounds were heard only this time my son was with me and he heard it too. It freaked my son out just like the people from the original report. I have to admit I was a bit concerned as well. I am not sure where in Pasadena the other people saw and heard this but I am near Rt. 10 in Pasadena."],"Region":"Maryland","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","City":"Pasadena","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/17844.html.txt","/var/www/straped/mufon/org/17844.html"],"trends":["There have been 8 other sightings in Pasadena","There was one other sighting in Pasadena on or around April 16th 2009"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Longitude":"-76.569365","Summary":"Strange sounds in sky over Pasadena, MD, April 16, 2009."}