{"Sighting Duration":"Undisclosed","Latitude":"39.850647","Disposition":"Insufficient Data","Longitude":"-86.395554","Log Number":"US-07052009-0053","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Brownsburg","Summary":"Saw two objects within 7 minues of each other that had bright amber colored lights fly from the western sky to the south and disappear.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.850647,+-86.395554(17849)&iwloc=A&hl=en\"> mufon case (17849) map </A>","files":["/var/www/straped/mufon/html2text/17849.html.txt","/var/www/straped/mufon/org/17849.html"],"Date Submitted":"07/05/2009 10:15 UTC","divs":["Sighting DetailsMy wife, daughter and I were on our back porch and my wife and I at the same time saw a bright steady amber colored light coming from the western sky heading south. It had no sound and was very high up in the sky. My wife asked me \"what the hell is that\". We ran through the house to the driveway (faces south) and watched this thing make a straight line almost looking like it flew into the moon and disappeard. We of course were in a bit of disbelief and just stood there for a few minutes talking about it. Within 7 minutes, the exact same thing happened again only with a slightly different flight pattern. It came from the exact same area in the sky but seemed to veer more to the west before going higher than the moon this time and again, vanished. I had grabbed the camera between sightings and took some pictures which aren't great but I will try to post. I couldn't hold the camera steady enough but perhaps the pics can be used to compare colors with any other recently taken photos."],"Date of the Event":"07/05/2009 10:15 UTC","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around July 5th 2009"],"Viewing Distance":"Unknown","Case Number":"17849","Object Shape":"Diamond","Tags":"City","Region":"Indiana","Country":"United States","Object Flight Path":"Undisclosed"}