{"map":"<A HREF = \"http://maps.google.com/maps?q=32.802573,+-116.960927(17855)&iwloc=A&hl=en\"> mufon case (17855) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsI went to take my dog out before the evening's fireworks started, and I noticed several slow-moving bright red lights in the evening sky. They formed a loose triangular formation, but there were at least four that I was able to see from my building. They were moving very slowly (drifting) to the East (or so it appeared). I knew this was like nothing I had ever seen before, and I stopped in my tracks to watch it for a few minutes before continuing on my dog's bathroom break. When I returned to the home, I showed them to my mother-in-law who is visiting from Chicago. She was under the impressino that maybe they were government or military related objects, perhaps relating to the North Korean missile tests on the same day. They seemed to be very high in the sky, and even when I looked through binoculars, there was no visible detail. The lights looked electronic in nature, not from a natural or flame source. At least one of them had a very soft \"flicker\" to it, but the rest were fairly constant. We watched for a while, but there wasn't much action. We figured they were just something normal, and went back inside. When I looked later in the evening, they were gone. Supposedly, according to various online sources that I have seen since (which is how I found this site), these same lights have been seen year after year over El Cajon, CA on the 4th of July. According to the sources that I saw, there has never been an official explanation."],"Summary":"Bright red lights in varying formations.","Viewing Distance":"Unknown","Longitude":"-116.960927","Source":"MUFON","Log Number":"US-07052009-0059","Sighting Duration":"Undisclosed","trends":["There have been 41 other sightings in El Cajon","There were 5 other sightings in El Cajon on or around July 4th 2009"],"Country":"United States","Case Number":"17855","Tags":"City","files":["/var/www/straped/mufon/html2text/17855.html.txt","/var/www/straped/mufon/org/17855.html"],"Date of the Event":"07/04/2009 08:50 UTC","Object Flight Path":"Undisclosed","Latitude":"32.802573","Object Shape":"Other","Disposition":"Insufficient Data","Date Submitted":"07/04/2009 08:50 UTC","City":"El Cajon","Region":"California","Object Features":"Undisclosed"}