{"Disposition":"Insufficient Data","Date of the Event":"07/04/2009 09:05 UTC","Region":"California","Object Features":"None","Longitude":"-116.953167","City":"El Cajon","trends":["There have been 41 other sightings in El Cajon","There were 5 other sightings in El Cajon on or around July 4th 2009"],"Source":"MUFON","Date Submitted":"07/04/2009 09:05 UTC","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/17850.html.txt","/var/www/straped/mufon/org/17850.html"],"Summary":"Red light stationary 45-50' up. Not blinking moving horizontally about the speed of the moon.","Latitude":"32.802173","Log Number":"US-07052009-0053","Tags":"City","Object Flight Path":"Stationary,Straight-line path","Object Shape":"Circle","divs":["sighting details9:05 pm july 4th i went out my front door to listen to the fireworks. there are none nearby and absolutely none visible anywhere near my house. to the east there was a solid red light about the size and brightness of the brightest star in the sky but not at big or bright as venus appears. i waited for the light to blink like a plane but it did not. i got my meade 400mm telescope and locked on quickly. it was simply a pinpoint of redlight not flickering. the most logical explanation would be a suspended flare but it did not flicker and from living at the beach for a decade this didn't look like those emergency flares as it was solid, extrememly high and not moving. after comparing it against background stars it did move very slowly horizontally about the same speed as the moon or even less. it really struck me as an impossible red satellite as it appeared that far out, but there aren't any. if it was a flare it would have been ten miles away and several miles up and burning like a super led. the light did fade away into the darkness like a satellite, not like a flickering flare. other people in el cajon ca saw three and four lights. with my horizon blocked by trees and houses i would only see the highest. here are other witness accounts: http:\\\\www.examiner.com\\x-2363-ufo-examiner~y2009m7d5-annual-ufo-over-el-cajon-makes-fourth-of-july-appearance-once-again?#comments"],"Case Number":"17850","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.802173,+-116.953167(17850)&iwloc=A&hl=en\"> mufon case (17850) map </A>"}