{"Date of the Event":"08/23/2004 11:30 UTC","Object Features":"Patterned Surface","Case Number":"17854","Summary":"Clear sighting of unidentified flying object over Hayle in Cornwall.","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Latitude":"50.185467","Tags":"City","divs":["Sighting DetailsI was on duty as a driver for the Cornwall emergency out-of-hours doctor's service on the night of August 23rd, 2004. We were attending a patient in Hayle. The doctor was in the patient's house while I remained outside with the vehicle. I was standing beside the car pouring a cup of coffee when I noticed a bright flash in the sky towards the North. I thought it was a shooting star, but when I looked in that direction I was astonished to see an object which I couldn't identify burst into light and begin moving across the sky towards me. It was visible for some fifteen seconds, during which time it traversed an arc of about forty five degrees, moving at a steady rate due south until it was directly overhead with me staring up at it. I was so surprised I didn't even notice I was spilling coffee all over my trousers and shoes! At that point the lights went out and it simply disappeared. I searched a very bright, clear, moonlit sky for several minutes, but couldn't even see a silhouette. I am an ex soldier with a very keen interest in aircraft. The profile of this object resembled nothing I have ever seen or read about. I can only liken it to the plan view of an aircraft carrier's angled flight deck. It was brilliantly lit by bright blue lights surrounding each one of multiple panels covering the underside of the object. The blue lights made it difficult to see what colour the rest of the object was, but I could clearly make out shape and structure. I saw no wings, rotors or engines - it flew over me making no sound at all. I recall saying aloud, 'What the **** am I looking at?' just before it vanished. I made a quick sketch of what I'd seen and noted the time - 2330. I still do the same job - long night shifts out on the road - and I spend a lot of time watching the sky."],"Viewing Distance":"Unknown","City":"Hayle","files":["/var/www/straped/mufon/html2text/17854.html.txt","/var/www/straped/mufon/more/17854_submitter_file1__UFO.JPG","/var/www/straped/mufon/org/17854.html"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"GB-07052009-0058","map":"<A HREF = \"http://maps.google.com/maps?q=50.185467,+-5.42091(17854)&iwloc=A&hl=en\"> mufon case (17854) map </A>","trends":["There have been no other sightings in Hayle","This sighting has never been favorited."],"Object Shape":"Other","Source":"MUFON","Country":"United Kingdom","Longitude":"-5.42091","Date Submitted":"08/23/2004 11:30 UTC","Region":"England"}