{"Date of the Event":"07/02/2009 12:59 UTC","Object Shape":"Sphere","City":"Warm Springs","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","Tags":"City","Latitude":"32.890408","Case Number":"17864","Longitude":"-84.681038","Country":"United States","Weather Factors":"None, Does Not Apply","Summary":"Saw numerous bright lights move up in the sky and then hover back and forth.","Object Features":"Unknown","divs":["Sighting DetailsAt 12:00 midnight I went out on my deck for some fresh air and looking towards the eastern sky slightly to the south which would be approx. over gay Ga. I noticed several bright lights which were in a row and seemed to be like a star cluster, They appeared to be on one vehicle and attached, they then moved up into the sky at a high rate of speed and then stopped and hovered. When they moved up I noticed that they covered a long distance in such a short amount of time that it could not have been an airplane. I ran into my house and called my three teenage sons up from our den where they were playing video games, they came outside and all four of us watched the UFO for over an hour as it moved up and down in the sky. At one point it dropped down in the sky a good distance and then climbed back to where it was, it also seemed to move side to side frequently. We also noticed what appeared to be a trail behind the UFO when ever it made a fast movement, we took a very bright flash light we have and signaled the UFO for about 10 minutes and it moved higher into the sky closer to our house but still a long ways away. After an hour or so we went back into the house, perhaps some sort of Army tests, we were not afraid but it was pretty cool to watch it, it was not a copter or an airplane."],"Date Submitted":"07/02/2009 12:59 UTC","trends":["There have been no other sightings in Warm Springs","This sighting has never been favorited."],"Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=32.890408,+-84.681038(17864)&iwloc=A&hl=en\"> mufon case (17864) map </A>","files":["/var/www/straped/mufon/html2text/17864.html.txt","/var/www/straped/mufon/org/17864.html"],"Log Number":"US-07062009-0009","Disposition":"Unknown","Sighting Duration":"01:30:01","Source":"MUFON"}