{"files":["/var/www/straped/mufon/html2text/17863.html.txt","/var/www/straped/mufon/more/17863_submitter_file1__WestfieldOBOL(digital).jpg","/var/www/straped/mufon/org/17863.html"],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.051125,+-86.121409(17863)&iwloc=A&hl=en\"> mufon case (17863) map </A>","Region":"Indiana","Date Submitted":"07/05/2009 10:20 UTC","Summary":"Orange ball of light travling north to south in Westfield IN. July 5th, 2009, 10:20 pm.","divs":["Sighting DetailsI was the only one in the Target parking lot from about 10:10pm to 10:25pm, taking a few fireworks pictures. Just trying out my new Nikon. I was waiting to see if there were going to be anymore fireworks, and noticed an orange ball of light. It was moving in a straight line from north to south. It was almost right over me. At first I thought it might be a plane. But no noise, and no typical airplane lights...red, white, green. I got my camera and got out of the car, and took four pictures. And then got my film camera and took a couple more on film, which I haven't got developed yet. But the digital photos came out really good. I'll post them as soon as possible. My computer is running too slow to up-load right now. I watched it moving south untill I couldn't make it out anymore. The whole sighting lasted maybe 3-4 minutes. This is the 3rd actual sighting I've had in the last two years. I got two good photos last year on July 24th. You can definately tell that these are not planes or balloons, or helicopters, etc."],"Object Shape":"Circle","Longitude":"-86.121409","Latitude":"40.051125","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Unknown","Case Number":"17863","Tags":"City","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"07/05/2009 10:20 UTC","Disposition":"Unknown","Log Number":"US-07062009-0008","City":"Westfield","trends":["There have been 8 other sightings in Westfield","There was one other sighting in Westfield on or around July 5th 2009","This sighting has never been favorited.",""],"Weather Factors":"None, Does Not Apply"}