{"Case Number":"17875","Latitude":"41.540328","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Marblehead","This sighting has never been favorited."],"Source":"MUFON","divs":["Sighting DetailsOn July 3rd 2009 I was staying with a friend's family on Lake Erie. I was inside getting something to eat when everyone on the patio started yelling for me to come outside. (I have a science background and work in a related field) I ran outside to see a bright red fireball coming from the nortwest horizon and moving southeast. Following the fireball was a second fireball approximately 4 seconds behind. We (8 witnesses) followed the path as long at it stayed in site (approx. 20-30 seconds) The object was very bright but it's altitude and speed were very difficult to gauge. At 10:12pm a third red fireball moved across the sky, slightly less bright and further away than the previous two. It came from a direction further west than the first two. These objects did not streak across the sky and appeared to be burning or shooting flames. My first thought when I saw the objects was that we were witnessing missiles being launched. As I watched these objects I kept hoping they would continue to move across the sky and not crash to the earth. The first two objects disappeared behind the houses and the third one behind a cloud."],"Longitude":"-82.735462","Viewing Distance":"20 Feet or Less","Log Number":"US-07062009-0020","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.540328,+-82.735462(17875)&iwloc=A&hl=en\"> mufon case (17875) map </A>","files":["/var/www/straped/mufon/html2text/17875.html.txt","/var/www/straped/mufon/org/17875.html"],"Country":"United States","Tags":"City","Object Features":"Undisclosed","City":"Marblehead","Date Submitted":"07/03/2009 09:50 UTC","Object Shape":"Bullet, Missile, Fireball, Sphere","Weather Factors":"Unknown","Disposition":"Unknown","Summary":"3 red fireballs moving extremely fast.","Date of the Event":"07/03/2009 09:50 UTC"}