{"Object Shape":"Egg, Fireball","Latitude":"43.054206","map":"<A HREF = \"http://maps.google.com/maps?q=43.054206,+-88.216903(17870)&iwloc=A&hl=en\"> mufon case (17870) map </A>","divs":["Sighting DetailsMy husband and I were with family and friends at his sister's lake house on Pewaukee Lake on July 4, 2009. The annual fireworks show had just finished and we were talking amongst ourselves before preparing to leave. Best I can remember, the time was somewhere near or a bit before 10:00 pm Central Daylight Time. Some of us, including myself, were watching for additional fireworks behind the tree line across the lake. There are other towns and villages in the vacinity that host fireworks shows, so it's not uncommon to see multiple shows going on simultaneously on the Fourth of July. I was looking at the risen moon and noticed a large orange-red object \"floating\" in the sky, coming from the east. I told my husband and he watched the object. He initially thought it might be a helicopter. The color was intense. I am an amateur astronomer and have been observing the night sky for nearly thirty years. I'd never seen an aircraft with lights the color of this object, but I was open to any terrestrial explanation. The moon was nearly full and the sky had scattered clouds in it. At first I thought that maybe this object was a left-over firework but it never exploded and it kept coming toward the house. Some of us were watching as the object slowed to a halt, hovered above where we were standing, then begin to ascend into a thin cloud and disappear. We were all nonplussed. This object was acting unlike any terrestrial object I'd ever seen. I went into the house and came back out about a minute later and saw that a similar object was again in the sky, again in the east and moving toward the house, but in a more southerly direction. I took a photo of the object with our Canon XTi digital camera. I made sure to snap a section of the tree at the foot of the patio so that I could get the object on the frame. I didn't lose sight of the object until I turned to go back into the house. When I came back out a third time, it was gone. However, my sister-in-law said that after I went into the house, it was making a movement that was unusual. As far as feelings and reactions go, I'm always curious about the night sky and have seen strange objects all of my life, so it's not uncommon for me. However, to be in the presence of so many others who were observing the same object was a thrill. I had witnesses to what I was observing. I do not know what it was and even thought that it might be ball lightning, but it occurred twice (or was it two separate objects?). All I would like is to know if others saw this event and reported it, and whether or not my photo can help determine what it might have been. I hope this information is helpful in your research."],"Country":"United States","Sighting Duration":"Undisclosed","Region":"Wisconsin","Disposition":"Unresolved","Date of the Event":"07/04/2009 12:00 UTC","Date Submitted":"07/04/2009 12:00 UTC","Object Flight Path":"Straight-line path,Path then hovering","files":["/var/www/straped/mufon/html2text/17870.html.txt","/var/www/straped/mufon/more/17870_submitter_file1__pewaukeeufojuly409.jpg","/var/www/straped/mufon/org/17870.html"],"Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","City":"Pewaukee","Summary":"Orange-red bright sphere seen over Pewaukee Lake, Waukesha County, Wisconsin.","trends":["There have been 3 other sightings in Pewaukee","There were no other sightings in Pewaukee on or around July 4th 2009","This sighting has never been favorited.",""],"Log Number":"US-07062009-0015","Weather Factors":"None","Longitude":"-88.216903","Case Number":"17870"}