{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.633322,+-88.729552(17872)&iwloc=A&hl=en\"> mufon case (17872) map </A>","Sighting Duration":"00:02:00","Longitude":"-88.729552","City":"Waupun","Latitude":"43.633322","Viewing Distance":"Over One Mile","Case Number":"17872","Log Number":"US-07062009-0017","Region":"Wisconsin","Summary":"Two orbs weaving as they traversed the sky in broad daylight.","divs":["Sighting DetailsBack in Sept. 24th or 25th 2002 around noon(I know the date because I looked up the bill I submitted for that job) I was working on a chimney for a client east of Waupun, WI. I was on the roof and was tuckpointing and so I was looking up at the top of the chimney. Out of the corner of my eye I noticed some movement. I turned my attention to the movement and saw something strange. I saw two (2) orbs way up there in the sky. They were moving in a straight line south to north. These objects were so high that if I didn't concentrate my focus on them I would lose site of them. They traveled across the sky weaving in and out of each other. I got the impression that they were enjoying this weaving around each other. From what I could tell they were silver or chrome colored orbs moving fast at perhaps way over 10,000 ft., maybe 20,000 or more. It took them about 2 minutes to go across 25% of the sky and then they were so far away that I could no longer see them. My estimate of there size is approximately 10 to 15 feet in diameter. Had I not been looking up at that time I would have missed them. I'm pretty sure no one else could have seen them that day because they were difficult to see and you would need to be looking in the precise area of the sky at that precise time. I checked the jet stream that day when I got home. It was west to east that day in Wisconsin. These things were traveling south to north. They're movements were similar to what I would call intelligently controlled (weaving)silver balloons floating high in the jet stream. After that day I was no longer a skeptic about UFO's. I think of that day often and wonder. I've told a few people close to me about the experience but it's like you had to be there to get the full effect. I personally felt like it was not one of ours."],"Weather Factors":"Unknown","Date Submitted":"09/25/2002 12:00 UTC","Source":"MUFON","Date of the Event":"09/25/2002 12:00 UTC","Tags":"City","Disposition":"Insufficient Data","Object Shape":"Circle, Sphere","trends":["There have been 6 other sightings in Waupun","There were no other sightings in Waupun on or around September 25th 2002"],"Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/17872.html.txt","/var/www/straped/mufon/org/17872.html"]}