{"Object Features":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.882154,+-87.620518(17878)&iwloc=A&hl=en\"> mufon case (17878) map </A>","Case Number":"17878","Sighting Duration":"Undisclosed","Region":"Illinois","Object Shape":"Fireball","Viewing Distance":"Unknown","Summary":"Glowing orange light hovering in the sky.","files":["/var/www/straped/mufon/html2text/17878.html.txt","/var/www/straped/mufon/org/17878.html"],"Tags":"City","Latitude":"41.882154","Object Flight Path":"Straight-line path","Disposition":"Unknown","trends":["There have been 221 other sightings in Chicago","There were 2 other sightings in Chicago on or around July 4th 2009"],"Date of the Event":"07/04/2009 10:15 UTC","City":"Chicago","Longitude":"-87.620518","Weather Factors":"Fog","divs":["Sighting DetailsI come on this site from time to time because I find people's sightings fascinating. I also reported a sighting once and found out it was a satellite. However, I never stop believing in the possibility of life outside of our world. Anyhow...after a week or so of not checking the MUFON site I came on here this morning and I started reading about everyone's sightings about an orange glowing sphere moving in the sky. I couldn't believe what I was reading because I too saw this on the 4th of July. I had just arrived at my friend's house just after 10pm to join them for a few beers and to light fireworks. When I got there, I stood in front of the house, drank a beer and chatted with my friends and watching the elaborate fireworks in the sky (they bought those fancy fireworks from Indiana which are illegal in Illinois). Well I just so happened to look up after a firework had exploded in the sky when I saw a flickering orange glowing object moving in a linear direction. It looked almost like a chinese lantern. As my friends continued chatting I would look up every couple of seconds and it was still there moving across the sky! I tried to think nothing of it because I intially thought it was a lit amber from one of the lit firework, but it just kept floating in a linear direction (East to West) till I lost sight of it. No one really noticed except for me because everyone was drinking beers or occupied with lighting firecrackers. Also, the sky was really cloudy and the atmosphere foggy so it resembled a burning amber in the sky. I kept staring at it because this \"flame\" never died out! So when I come on here this morning and read that people saw this orange glowing light in other states, I can't help to think it was definitely a UFO. However, ever since I was told the last one was a satellite, I hope someone can tell me what this may have been. The picture taken by the person in Pewaukee is exactly what I saw except it was fuzzy because of the fog and clouds. Sorry no pictures because I honestly doubted what I saw... :("],"Country":"United States","Date Submitted":"07/04/2009 10:15 UTC","Log Number":"US-07062009-0023"}