{"Date Submitted":"07/03/2009 10:30 UTC","Longitude":"-82.38653","Object Shape":"Sphere","City":"Greenville","Case Number":"17884","map":"<A HREF = \"http://maps.google.com/maps?q=34.858978,+-82.38653(17884)&iwloc=A&hl=en\"> mufon case (17884) map </A>","divs":["sighting detailsvideo: http:\\\\www.youtube.com\\watch?v=ii9g-kvdzh0 description: i was camping out behind my house with my 4 year old. we live in spartanburg county about 3 miles from the greenville\\spartanburg airport. we were hanging out playing video games until about 10:30pm when we decided to turn in for the night. as i was getting our blankets ready i looked up and through the mesh door of the tent which was facing to the west. through the mesh i saw an incredibly bright red light of considerable size moving slowly over the treeline. my first thought was that it might be an airplane, but i have lived in this area my entire life and i literally see planes come and go every night. this was like nothing i had ever seen and i immediately knew that it was not a plane. i fumbled around in the dark for my video camera, unzipped the door of the tent and was able to start filming the object about 20-30 seconds after it originally caught my eye. at first the bright red object continued slowly moving south, but then unexpectedly a much smaller white light emerged from the top and went upward at a fairly rapid pace. when the light was a good 2x higher from the ground than the red light, the red light quickly disappeared. the white light continued to stay in view and continued to move southward at a speed of perhaps 3x faster than the red light was traveling. after a bit it flickered and disappeared. when the red one disappeared, it just blinked off like a switch was flipped, but the white one flickered and faded more subtly. i got the entire thing on tape, and the footage of the small object emerging from the larger object is quite good. my only regret is that i zoomed in to try to get a closer look, and some of the footage is rather jerky... serves me right for always making fun of people who don't seem to be able to hold a camera still while filming a ufo. still though, it's pretty exciting video. here's the link to the video on youtube: http:\\\\www.youtube.com\\watch?v=ii9g-kvdzh0 i was very excited to see this. i've kept my eyes open for stuff before when i'm looking at the stars, but this was completely out of the blue and entirely unexpected. plus, i never carry my video camera with me, so the fact that my camera on hand is still amazing to me. skeptics may point out that: 1. this sighting took place very close to an airport 2. the sighting took place on july 3rd (fireworks) had i not seen the object myself for the duration that it was visible, and especially the emergence of the smaller white light, i too would have argued these as possibilities. however, the footage easily dismisses these arguments. it made no sound, and it moved unlike any fireworks i have ever seen. especially the way the white light sped up after separating from the red light. my 4 year old can be heard in the background trying to figure out what it was that we were seeing. he obviously didn't think it was fireworks, but he did say \"maybe it's a rocket ship\", which i found interesting. whatever it was, it was a blast being able to see it and film it."],"trends":["There have been 10 other sightings in Greenville","There were no other sightings in Greenville on or around July 3rd 2009"],"Sighting Duration":"00:01:30","Log Number":"US-07062009-0029","files":["/var/www/straped/mufon/html2text/17884.html.txt","/var/www/straped/mufon/org/17884.html"],"Object Features":"None","Source":"MUFON","Disposition":"Unknown","Date of the Event":"07/03/2009 10:30 UTC","Viewing Distance":"Over One Mile","Latitude":"34.858978","Weather Factors":"None","Country":"United States","Region":"South Carolina","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Summary":"Saw a large bright red UFO launch a small white UFO in Greer, SC, July 3, 2009.","Tags":"City"}