{"trends":["There have been 42 other sightings in Lincoln","There was one other sighting in Lincoln on or around July 5th 2009","This sighting has never been favorited.",""],"Weather Factors":"None","Object Shape":"Triangle, Other","Viewing Distance":"101-500 Feet","Object Flight Path":"Path then hovering","Summary":"Red triangle shaped light with orange halo.","City":"Lincoln","map":"<A HREF = \"http://maps.google.com/maps?q=40.814062,+-96.672389(17889)&iwloc=A&hl=en\"> mufon case (17889) map </A>","Source":"MUFON","Latitude":"40.814062","Log Number":"US-07062009-0034","Country":"United States","Date Submitted":"07/05/2009 02:45 UTC","Tags":"City","Region":"Nebraska","Date of the Event":"07/05/2009 02:45 UTC","Case Number":"17889","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-96.672389","files":["/var/www/straped/mufon/html2text/17889.html.txt","/var/www/straped/mufon/more/17889_submitter_file1__UFOStar.jpg","/var/www/straped/mufon/more/17889_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/17889.html"],"Disposition":"Unknown","divs":["sighting detailsat 2:30 am on july 5th i was driving east on holdrege street stopped at traffic light to turn north on 56th street street. looked to my left to make the turn and noticed a brilliant red light to the northeast. i made the turn north and pulled on to a side street one block after turning. the light was a red\\orange triangular shape with an orange \"doughnut\" halo around it. the light although very bright did not emit a glow as would a street light. the object was moving at a steady pace, but much slower than an air plane, to the south west. as the object passed over me it slowed down and came to a stop for about 30 seconds then moved on again to the s.w. it flew for about a few blocks and again stopped for about 15 seconds then climbed higher in altitude and vanished. the object did not have any blinking lights and was completely silent. i would guess the altitude to be about 500 feet. the entire event lasted about 3 minutes in which time i was able to get many photographs of it."]}