{"map":"<A HREF = \"http://maps.google.com/maps?q=39.957485,+-75.158389(17890)&iwloc=A&hl=en\"> mufon case (17890) map </A>","Date Submitted":"07/04/2009 12:00 UTC","trends":["There have been 216 other sightings in Philadelphia","There were 4 other sightings in Philadelphia on or around July 4th 2009","This sighting has never been favorited.",""],"Object Shape":"Circle, Sphere","divs":["Sighting DetailsI decided to go outside in front of my house after hearing a lot of fireworks going on outside, I decided to go get my camera to take photos of them because I wanted to send them to my kids in Florida. after looking to the sky to see the fireworks I noticed the sky was bountiful because the sun was going down. I shot two or three photos and looked at them but i did not noticed nothing out of the ordinary. I kept shooting more. After about an hour and a half I decided to go inside and transfer them to my computer. And that's when I noticed these circles, the faded ones did not surprised me much but the clear blue one did.After that I made sure the lens from the camera was clean, thinking that maybe that could have been the problem but even after I wipe the lens i decided to shot more photos outside, by that time it was dark outside and there was no fireworks been shot. I shot more photos and the circle appeared again but this time it was real bright, and this last time I shot I pointed my camera towards a different direction to the sky. I would like someone to tell me what this could be. could this be a reflection of some sort or what? Thank you in advance"],"Summary":"A blue sphere apeared in the photo on the sky even though I didn't see it with just by looking at the sky.","files":["/var/www/straped/mufon/html2text/17890.html.txt","/var/www/straped/mufon/more/17890_submitter_file1__dayshotufo4.jpg","/var/www/straped/mufon/more/17890_submitter_file2__dayshotufo3.jpg","/var/www/straped/mufon/more/17890_submitter_file3__dayshotufo2.jpg","/var/www/straped/mufon/org/17890.html"],"Log Number":"US-07062009-0035","Source":"MUFON","Tags":"City","Longitude":"-75.158389","Object Flight Path":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Region":"Pennsylvania","Disposition":"Insufficient Data","Case Number":"17890","City":"Philadelphia","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"07/04/2009 12:00 UTC","Latitude":"39.957485"}