{"Latitude":"18.073838","Longitude":"-66.102117","Region":"","Date Submitted":"06/02/2009 03:00 UTC","Tags":"City","Source":"MUFON","Sighting Duration":"01:00:00","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/17905.html.txt","/var/www/straped/mufon/org/17905.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=18.073838,+-66.102117(17905)&iwloc=A&hl=en\"> mufon case (17905) map </A>","Object Features":"Dome","Viewing Distance":"20 Feet or Less","Date of the Event":"06/02/2009 03:00 UTC","Case Number":"17905","Object Shape":"Diamond","City":"Cayey, Carite Lake","Log Number":"PR-07072009-0011","divs":["Sighting DetailsI'm writing this with a bit of caution. As a trained scientist and an applicant to several PHD programs my reputation may be at stake. During a vacation I visited the rainforest that surrounds lake Carite of Puerto Rico I awoke in the middle of the night from restlessness. I wandered around the forest as I always did. But after wandering for a bit started to notice a strange metallic vapor smell. I recognized the smell from my freshman year in college when we were turning silver metal into a vapor compound. Very similar, but with something indistinguishable mixed in. I followed the smell and stumbled upon an area full of tall grasses and ferns. In the middle of this was a large black almost diamond shaped object. It was faceted on top like a diamond and rounded off at the bottom. It touched the ground on its rounded end and somehow managed to stay upright. I got closer in an attempt to find an opening but I found none, it was almost like a solid black stone in the ground. I attempted to use a stone to scratch off a sample of the material and a small chip came off. The material peeled away from the object almost like obsidian. I ran to the house to get my camera and returned as quickly as I could. When I returned the object was in the air almost indistinguishable from the surrounding sky, the colors mingled perfectly to camouflage it. I attempted pictures but they were pointless. The object was too dark in colour, the light too low. As it rose however, I did notice and almost honey colored row of circles appear on the faceted top. They seemed to be lit almost like a tungsten bulb behind paper. They seemed to move independently from the object and circled the faceted top. To make things even stranger the hole in the ground the rounded edge of the object had made was covered in plants by morning. It's as if overnight the forest had sprung up to repair the damage. I cleared them away and try as I might I could not find the hole left behind. The only thing I found was an abundance of plants and insects in unusual numbers near the area.The only evidence I found was a 1mm-ish burn on a nearby rock with the impression of the small shard that I had managed to chip with a rock. Now I don't know if I'm going mad and this was all a dream or something. But it feels good I suppose to get this all off my chest. As a scientist in training I have no explanation, there is obviously no rational explanation for anything that happened during these night. Maybe someone will have a similar story and this will be of use, maybe not."],"trends":["There have been no other sightings in Cayey, Carite Lake","This sighting has never been favorited."],"Weather Factors":"None","Country":"Puerto Rico","Object Flight Path":"Hovering then path","Summary":"Saw strange flying object in tropical rainforest."}