{"Date Submitted":"07/04/2009 10:30 UTC","files":["/var/www/straped/mufon/html2text/17906.html.txt","/var/www/straped/mufon/org/17906.html"],"Object Features":"Undisclosed","Country":"United States","Region":"Florida","Weather Factors":"Unknown","Case Number":"17906","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","City":"Tampa Bay","Object Shape":"Oval","Date of the Event":"07/04/2009 10:30 UTC","Latitude":"28.276497","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.276497,+-82.385878(17906)&iwloc=A&hl=en\"> mufon case (17906) map </A>","trends":["There has been one other sighting in Tampa Bay","There were no other sightings in Tampa Bay on or around July 4th 2009"],"Source":"MUFON","Disposition":"Unknown","Longitude":"-82.385878","Log Number":"US-07072009-0012","Summary":"Orange, oval thing coasting approx. 300 to 500 feet.","divs":["Sighting DetailsI WAS OUTSIDE OF MY HOUSE WITH MY GIRLFRIEND,2 YEAR OLD DAUGHTER,4 YEAR OLD DAUGHTER,7 YEAR OLD STEP DAUGHTER WATCHING THE FIRE CRACKERS BEHIND MY HOUSE,LOOKING OVER MY ROOF WHEN I NOTICED AN ORANGE GLOW COMING FROM THE WEST.THEN IT WAS MOVING HORIZONTALLY SO I SAID TO MYSELF THIS CANT BE A FIREWORK.THE OBJECT WAS MOVING REAL SLOW APPROX.30 MILES AN HOUR IF THAT.MY NIEGHBOR TO THE BACK OF ME SET OFF A BIG FIREWORK,THE OBJECT KIND OF DIPPED A LITTLE AND THATS WHEN IT CHANGED DIRECTION WHAT LOOKED LIKE A 45 DEGREE ANGLE TOWARDS THE SKY STILL GOING EAST.I WATCHED IT UNTIL I COULDNT SEE IT ANYMORE.MY NEIGHBORS KIDS ACROSS THE STREET SAW IT ALSO,I THINK THEY ARE AROUND TEN YEARS OLD,I DONT KNOW.MY GIRLFRIENDS NEPHEW SAID HE SAW THAT SAME OBJECT ONE TOWN OVER.I ASKED HIM TO DESCRIBE IT AND IT WAS IDENTICAL TO WHAT I SAW,HE'S SIXTEEN.THE OBJECT WAS OVAL IN SHAPE,ORANGE IN COLOR AND WAS PROBABLY MOVING SLOWER THAN 30 MILES AN HOUR.I WAS MORE EXCITED THAN AFRAID BECAUSE THIS IS THE SECOND TIME I SAW SOMETHING I COULDNT EXPLAIN IN THE SKY.THE FIRST TIME WAS IN 2002 IN SAN DIEGO.I WAS ON A NIGHT JOB WITH MY MANAGER RICARDO.HE YELLED WHAT THE HELL IS THAT,I TURNED AROUND AND SAW WHAT LOOKED LIKE A HORIZONTAL SMOKE BOMB.IT WAS OVER THE PACIFIC OCEAN NOT TO FAR OUT AND IT TO WAS ONLY A FEW HUNDRED FEET UP.WHEN YOU LITE A SMOKE BOMB THE SMOKE GOES VERTICAL,THIS LOOKED LIKE A SMOKE BOMB ON ITS SIDE.IT WAS MOVING SOUTH THEN TURNED WEST TOWARDS THE OCEAN.WHEN IT DID THE \"SMOKE TRAIL\" FOLLOWED.IT WAS PURPLE AND ORANGE AND EVEN THOUGH IT WAS ELEVEN THIRTY AT NIGHT I COULD SEE IT WELL.IT SEEMED TO BE GLOWING ALSO.I SAW IT WITH RICARDO BUT IM NOT GOING TO GIVE HIS LAST NAME OUT OF RESPECT.SO FOR BOTH SIGHTINGS I HAD PEOPLE WITNESS IT WITH ME."],"Tags":"City"}