{"Summary":"Sphere of bright white light moving from sw to ne.","Sighting Duration":"Undisclosed","trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around July 6th 2009"],"Viewing Distance":"Unknown","Case Number":"17915","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.669698,+-83.553312(17915)&iwloc=A&hl=en\"> mufon case (17915) map </A>","Log Number":"US-07072009-0021","Region":"Ohio","divs":["Sighting DetailsMy name is Bob Jefferds, My wife and I took our 2 dogs outside for their final potty for the day. This was approximately 9pm. It was an extremely clear night with very intense moon. I was admiring the clear evening sky with the bright moon when I noticed a bright sphere of light coming from the south west tracking to the north east. I could not determine it's elevation. My best estimate is that of an aircraft. If I had to put a number to the elevation my best guess would be between 10,000 and 20,000 feet. At first I thought it was an aircraft, however, as it continued to move toward my position I could not see the typical red or green wing tip lights. I continued to observe and looked to see if there was a beacon which there wasn't. The sphere of light was unusually brilliant. As it began to pass I thought perhaps it was landing lights on an aircraft and as it passed maybe the beam of the landing lights would pass me. It didn't. It remained bright and steady. The sphere of light continued north east until I lost sight of it. Its path was linear and steady. I couldn't hear any type of engine noise. I have worked around aircraft and this incident was not ordinary."],"Date of the Event":"07/06/2009 12:00 UTC","Longitude":"-83.553312","Object Flight Path":"Straight-line path","Disposition":"IFO","Object Shape":"Sphere","Latitude":"41.669698","Country":"United States","Weather Factors":"None","Object Features":"Unknown","City":"Toledo","files":["/var/www/straped/mufon/html2text/17915.html.txt","/var/www/straped/mufon/org/17915.html"],"Date Submitted":"07/06/2009 12:00 UTC","Tags":"City"}