{"map":"<A HREF = \"http://maps.google.com/maps?q=31.867527,+-116.599598(17912)&iwloc=A&hl=en\"> mufon case (17912) map </A>","files":["/var/www/straped/mufon/html2text/17912.html.txt","/var/www/straped/mufon/org/17912.html"],"Disposition":"Unresolved","Longitude":"-116.599598","Log Number":"MX-07072009-0018","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Ensenada","There were no other sightings in Ensenada on or around July 6th 2009"],"Object Features":"Unknown","Case Number":"17912","Summary":"3 objects crossed the sky from West to East.","Object Shape":"Unknown","Region":"Baja California","divs":["Sighting DetailsAt approximately 9pm I was on the patio with 2 friends looking out over Todos Santos Bay. One friend called may attention to a bright object at about 45 degrees above the horizon and asked if it was a plane. The object was extremely bright and, best guess, about 6 or 7 times the size of Venus and moving rapidly from west to east. I used binoculars but it was moving too fast to see more than a brilliant light. My first thought was that it was the space station crossing over again. I had missed the first passing over Ensenada but it looked the way friends described it to me. Just after passing overhead, another object, small and dim but moving just as fast, appeared from the north and abruptly changed direction to follow the larger one. Another small, dim object flew passed the other 2, coming out of the east. This one came to a dead stop when it reached overhead. It began to grow brighter until it was as big and bright as the first object and then dimmed again and reversed it's direction to go east with the other 2 objects. We followed their path until it crossed behind the hills. The first and larger of the objects moved in a straight line and my logical mind told me that it might have been a satellite or the space station but never in my life have I seen any object move the way the other 2 did. I was totally stunned."],"Country":"Mexico","City":"Ensenada","Tags":"City","Weather Factors":"None","Latitude":"31.867527","Date Submitted":"07/06/2009 09:00 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"07/06/2009 09:00 UTC","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering"}