{"Longitude":"-83.75056","Summary":"Long oval with 25 lights.","Latitude":"42.91444","Object Features":"Unknown","City":"Rankin","Date Submitted":"07/07/2009 01:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.91444,+-83.75056(17919)&iwloc=A&hl=en\"> mufon case (17919) map </A>","Object Flight Path":"Stationary","divs":["Sighting Detailsme and my friend Shannon were driving home from visiting with friends in Bridgeport, we left around 1am and headed to my home. after we crossed the 75 to 23 south exchange we began to see what looked like a large plane it appeared to not be moving in any direction. at first all we could see were two very bright lights that were too low to the ground and seemed to large for a plane. the closer we got the more uncomfortable i became,( i do not include how Shannon felt as her reaction was and continued to be before during and after, \"I'm ok really,\" with white knuckles on the steering wheel.) we passed hill road and lost track of the object due to a land fill. as we came around the other side of it we could see it again, it still remain motionless as our direction once again was true south. Shannon said that she felt it could be a tower,but as we got closer that was discarded as we could clearly see it was some kind of air craft. the closer we got the more lights we could see on it, at least 15 blinking in red white yellow and some times blue. as we drew even closer it became clear it was very very large, we both got the feeling it was as large as a 747, and when we drove under it, we could see it had no wings and was completely stationary. that's when we could see the rest of the lights, there were another 5 very large very bright lights, i am not sure if they were under or on the leading edge, maybe both. what was clear was that it was low enough to the ground that i could see the underside lit up by the lights on the back of it as we passed under and away from it. once we were maybe a mile away from where we had drove under it, we could no longer see it. I was very uncomfortable, and even commented to Shannon that i wish i had anxiety medication. i felt scared and kept looking all around us as we drove on till we exited 23 at M-59 and headed west to my home in Howell. unable to sleep i stayed awake till 6am and it is now 6:30pm, my chest hurts and the headache that started after the sighting is still with me."],"Log Number":"US-07072009-0025","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Region":"Michigan","Case Number":"17919","Tags":"City","Date of the Event":"07/07/2009 01:40 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/17919.html.txt","/var/www/straped/mufon/org/17919.html"],"trends":["There has been one other sighting in Rankin","There were no other sightings in Rankin on or around July 7th 2009"],"Country":"United States","Weather Factors":"None","Object Shape":"Oval","Source":"MUFON"}