{"Object Shape":"Fireball","files":["/var/www/straped/mufon/html2text/17911.html.txt","/var/www/straped/mufon/org/17911.html"],"Object Features":"Unknown","Log Number":"US-07072009-0017","map":"<A HREF = \"http://maps.google.com/maps?q=44.89109,+-84.303369(17911)&iwloc=A&hl=en\"> mufon case (17911) map </A>","divs":["sighting detailsmy family was in lewiston (by gaylord) michigan on tee lake to celebrate the 4th of july holiday. we had just finished watching a 4th of july fireworks display from our property on the lake, and retreated to the campfire. some time after being by the fire, my father pointed out a bright orange fire ball object in the sky, much brighter than a star\\sattlelite, and it was moving fairly fast across the sky to the right (from my view). i picked up the binoculars and tried to get a better look, but there was no detail of the object through the binoculars. it was an orange glow. it seemed to stop and hover over the moon for about 1 minute before disapearing. it was as if the object made a left at the moon and hightailed it away from earth. we all agreed that it was not a blinking light, but a constant light. it was too bright and round for a plane, it was to bright and fast for a satalite, and anyting in our orbit would not stop in mid flight and disapear."],"City":"Albert","Disposition":"Unknown","Summary":"Orange fire ball moving to the right (from my view) towards the moon faster than an air plane, Hovered over moon for a few minutes, disapeared.","Region":"Michigan","Date of the Event":"07/04/2009 11:00 UTC","Longitude":"-84.303369","Viewing Distance":"501 Feet - 1 Mile, Unknown","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Albert","There were no other sightings in Albert on or around July 4th 2009"],"Object Flight Path":"Path then hovering","Source":"MUFON","Date Submitted":"07/04/2009 11:00 UTC","Weather Factors":"Unknown","Latitude":"44.89109","Country":"United States","Tags":"City","Case Number":"17911"}