{"Country":"United States","Source":"MUFON","trends":["There has been one other sighting in Beaver Dam","There were no other sightings in Beaver Dam on or around July 7th 2009"],"Object Features":"Undisclosed","Longitude":"-88.837329","Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/17917.html.txt","/var/www/straped/mufon/org/17917.html"],"Latitude":"43.457769","Case Number":"17917","Region":"Wisconsin","Object Flight Path":"Undisclosed","Summary":"Looked like a school of fish, but way up in the sky. There where alto-stratus clouds that the objects where moving above and below. The keep going in a circle over and over slowly going east. I would loose them and pick up the objects 30 degrees away.","Disposition":"Insufficient Data","divs":["Sighting DetailsI probably would not have looked up if not for the sound of two military jets. They where circling around the area to the north east. This is not seen around here too often as there are no major airports for 60 miles or so. They looked like F-15s, but I don't think they fly those any more. They were definitely military jets one seen very clearly, and the other jet was heard. There are not any bases close by. While I was looking up to see the jets something else caught my eye. There where maybe a dozen or so objects to the east - south east possibly over Juneau, WI area. The best way to describe them is to liken them to a school of fish. They where going in a large circle moving fast and in sync like a school of fish. I lost them once and went to get my wife to see them. While looking up to see them again, I reacquired the strange lights due east from my position. The lights seemed to be very bright -9 magnitude and then change to very dark all while going in a complete circle. The circle seamed to be horizontal (side to side) and not vertical (up and down). At times seen above the clouds and at times seen below. The objects where moving quite fast in a clock wise circle. The second sighting did not last very long and my wife was not able to see the objects. It seamed that the objects disappeared and less than a minute or two later a jet was again heard at a very fast rate, and you can clearly tell the difference between military and civilian jets. The cloud layer was very thin higher altitude clouds. I would guess the clouds at the time to be 6000 to 10000 ft. At least one military jet was heard again, but not see after the last ufo sighting. Sounded very fast, but not super sonic. Possibly super sonic at high altitude when jet was last spotted heading straight east toward lake Michigan. I would very much like to find out what these objects where, and where the jets involved at all, or was it all just coincidence."],"map":"<A HREF = \"http://maps.google.com/maps?q=43.457769,+-88.837329(17917)&iwloc=A&hl=en\"> mufon case (17917) map </A>","Date Submitted":"07/07/2009 11:41 UTC","Date of the Event":"07/07/2009 11:41 UTC","City":"Beaver Dam","Object Shape":"Circle, Oval","Log Number":"US-07072009-0023","Tags":"City","Sighting Duration":"00:05:00"}