{"Country":"United States","Longitude":"-80.764524","Latitude":"41.101725","Object Flight Path":"Undisclosed","Object Shape":"Circle, Sphere, Star-like","Object Features":"Unknown","Source":"MUFON","Weather Factors":"Unknown","divs":["sighting detailssince june 2009 i have been regularly skywatching at night. i have been seeing white star-like orb ufo's. these orbs can dim or get very bright. they are low in the atmosphere and appear at various times of the night and in many different positions in the sky. they speed up and slow down and make sharp maneuvers at times. i usually see one at a time so i do not know if there is more than one or if the same one is appearing over and over in the sky cruising along. i have been wanting to get one on film getting brighter but have not had that opportunity until on this night. at approx 10:45pm est after i had just filmed the orb passing by some stars i sat back down and continued to skywatch. i was scanning the sky with my eyes and looked above me to catch a glimpse of a very bright, low, star-like object maybe a few hundred feet passing over where i was sitting. it was very low and very bright. it was moving west to east. i jumped out of my chair and began to film it. i was so astonished at the complete silence of this slow moving object! i could not see if it was a structured craft or what it was at all. all i could see was the bright light. you can see how low and bright this object was when it passes the stars as it is moving across the sky. i am an avid skywatcher and have been involved with this ufo phenomenon my whole life. i have filmed airplanes, helicopters and satellites and other various explainable aircraft. this was none of those things! the complete silence and appearance of this ufo light was amazing and i am so very grateful i was able to document it! i have the other ufo orb footage from various days in june and july i will upload after this one as well as what i filmed directly before this awesome sighting. note: my camcorder was running behind an hour. here is the youtube video: http:\\\\www.youtube.com\\watch?v=adud2jqp6rw"],"Date of the Event":"07/07/2009 10:45 UTC","Date Submitted":"07/07/2009 10:45 UTC","Region":"Ohio","map":"<A HREF = \"http://maps.google.com/maps?q=41.101725,+-80.764524(17918)&iwloc=A&hl=en\"> mufon case (17918) map </A>","Case Number":"17918","Disposition":"IFO","Summary":"Silent bright sphere object moving west to east July 7, 2009, Ohio.","City":"Austintown","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-07072009-0024","files":["/var/www/straped/mufon/html2text/17918.html.txt","/var/www/straped/mufon/org/17918.html"],"Viewing Distance":"101-500 Feet","trends":["There have been 6 other sightings in Austintown","There were no other sightings in Austintown on or around July 7th 2009"]}