{"Latitude":"44.03127","Object Shape":"Square, Rectagular","Object Features":"Undisclosed","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.03127,+-123.859546(17913)&iwloc=A&hl=en\"> mufon case (17913) map </A>","Country":"United States","Date Submitted":"07/07/2009 03:47 UTC","City":"Mapleton","Source":"MUFON","divs":["Sighting DetailsI was driving on a clear night a little after midnight with five friends, going east on hiway 126. about halfway between Cushman Or.& Mapleton Or. I saw a light comming low over the mountain about 5-6 miles up ahead & just off to the right at my 1 o'clock. At first I didn't think much of it as I continued driving and looking at it. It was flying very low just over the tree tops as it approched following along the vally floor. As it came closer I could see that it was very big, like a large airliner. That made me think something was very wrong, a jet airliner shouldn't be that low and slow. Soon I realized that it wasn't anything I had ever seen before, it was like a huge rectangle office building with smooth black or smoked glass sides, about 30- 40 feet high 300 feet long & 150 feet wide. It was flying at about 40-50 mph as it came directly over us, at less than 200' high. I could see rooms with lights inside shinning out through the glass. As it went over us I saw that the underside was bright with lights, and it was open undernieth with a catwalk running along the inside walls all the way arround it, also a catwalk ran across the middle from one side to the other side. I saw structural beems and pipes, with wires and cables hanging from them. It was silently moving over us so close that if someone was on the catwalk I could have picked him off with a slingshot. I kept driving never takeing my eyes off it untill it passed over the mountain top out of my veiw to the left and behind us. As soon as it was gone I pulled over to the roadside and said out loud \" WHAT THE HELL WAS THAT??? \" two of my friends were asleep in the back and another was falling asleep but the other two saw it too, and they said at the same time with a wierd look on thier faces \" I don't Know, what was it Scott? \" I said I don't know but I'm not staying arround to see if it comes back. I punched the gas and took off down the road doing about 80 mph all the way back to Eugene Or. With all of us feeling shocked, and looking at the sky on the way home. I know what we saw was real and it was close, and I know that it is not from earth. UFO's are real and the world should be told the truth. We need to know why are they here and what do they want with this world? Are they here as zoo keepers looking out for us, or are they useing us for thier owne gain? let me know if anyone else has seen this or something like it, ok? P.S. the drawing of the UFO was done fast and lacks good detail but it is very close as to what we saw. Thanks for your time, Scott Riddle."],"Object Flight Path":"Undisclosed","Region":"Oregon","Case Number":"17913","Date of the Event":"Unknown","Disposition":"Hoax","Longitude":"-123.859546","Tags":"City","trends":["There have been no other sightings in Mapleton","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/17913.html.txt","/var/www/straped/mufon/more/17913_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/17913.html"],"Log Number":"US-07072009-0019","Summary":"A rectangle 100 yards long, 30' to 40' high & 150' wide. flying slow about 200' directly over us. It was well lit up under.","Viewing Distance":"Unknown"}