{"map":"<A HREF = \"http://maps.google.com/maps?q=32.32357,+-106.753864(17925)&iwloc=A&hl=en\"> mufon case (17925) map </A>","Weather Factors":"Unknown","Object Features":"Undisclosed","City":"Las Cruces","Source":"MUFON","divs":["sighting details enjoying a cool summer night on the 4th of july in tortugas, nm (near las cruces) turned into an exciting night for a group of family and friends. as we were relaxing after a long afternoon of hanging out with family and friends, i decided to get up from my chair to stretch out when a bright red light in the southern sky caught my attention. i thought it was an airplane at first glanze, but it looked much brighter than the usual airplane or helicopter light. i stayed focus on the light until it slowly started dimming. i continued looking in the same direction and started seeing a round object appear in the distance and heading directly overhead. i called for my friend quickly to see the object that was passing over us. he quickly looked into the sky and mentioned that it looked like a balloon. the object did look like a balloon as it was passing directly over us but going at the speed of fast airplane. the object was right over the cloud level as it disappeared behind some clouds directly over the city of las cruces. the object was oval in shape and appeared to be of grey\\silver color against the dark sky. no lights seeing on the object as it passed overhead. the object was heading from south to north from the el paso, tx area to the las cruces, nm area. the speed it was traveling was a bit faster than a normal airplane would fly. no sounds emitted from the object. it would also appear that the bright red light was on top of the object and became obstructed by the oval object as it passed directly over us. others to experience the event were my good friend, my father-in-law and my niece. this is my first experience of anything of this nature. i must say it was not scary, but rather a very exciting experience. it would be nice to see if others saw anything similar flying over the las cruces area in new mexico on the 4th of july of 2009."],"Longitude":"-106.753864","Tags":"City","Log Number":"US-07072009-0031","Disposition":"Unknown","Object Shape":"Egg, Oval, Sphere","Date of the Event":"07/04/2009 11:30 UTC","Date Submitted":"07/04/2009 11:30 UTC","Viewing Distance":"Unknown","Sighting Duration":"00:03:00","Case Number":"17925","trends":["There have been 24 other sightings in Las Cruces","There were no other sightings in Las Cruces on or around July 4th 2009"],"Latitude":"32.32357","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17925.html.txt","/var/www/straped/mufon/org/17925.html"],"Summary":"Amazing experience in New Mexico on the 4th of July!","Region":"New Mexico","Country":"United States"}