{"Weather Factors":"None","Date of the Event":"07/07/2009 08:55 UTC","City":"Gibsonville","Longitude":"-79.542246","Case Number":"17922","Object Flight Path":"Stationary","Disposition":"Unknown","divs":["Sighting Detailsi was outside smoking a cigarette, looking up as i usually do, skywatching. it was still blue skies outside in Gibsonville, North Carolina, and there wasn't a single star in the sky - i looked hard, too. the sunset was scheduled tonight for 8:38pm, and it was now shortly after 8:50pm. i watched a car pass by, and when i looked back up, i saw this bright object, as bright as Jupiter, directly above my head, at 12 o'clock. it wasn't moving, as i had stationary power lines right above me to determine movement. i watched it get slightly brighter, and after watching it for about 5 minutes, my neck started to hurt from looking straight up. i looked down to stretch my neck for a second, and then looked back up, only to notice that the star-like object is starting to slowly fade away. as it fades, i see another \"dot\" appear RIGHT beside it - it looked like a millimeter away from my point of view. then both objects stopped fading, and another dot appeared right beside the second one, and finally, a third object appeared right beside that one! they were in the shape a single parenthesis \")\"... once they seemed to make that shape, two of them (the second and fourth one) faded away, leaving 2 left (the first and third one). then those last 2 faded away together, until i could just barely see a faint \"smudge\" of white in the sky. they then faded completely out of view, and i watched for five more minutes, only for nothing to return. ...the whole event last for approximately 5 minutes. by the way, i saw just about the EXACT same thing a year ago, where it started as one bright \"star\", straight up, while the sky was still blue. then as it faded, more \"stars\" appeared directly beside it, forming the shape of \"(\". then they all slowly faded away at about the same moment. again, no movement at all - just what seemed to be at a VERY high altitude directly above my head. this was also at about the same time of day last year, too. anyway, i'm just happy to see yet another \"UFO\" sighting!"],"Region":"North Carolina","files":["/var/www/straped/mufon/html2text/17922.html.txt","/var/www/straped/mufon/org/17922.html"],"Object Shape":"Star-like","Log Number":"US-07072009-0028","Viewing Distance":"Over One Mile","Latitude":"36.105691","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.105691,+-79.542246(17922)&iwloc=A&hl=en\"> mufon case (17922) map </A>","Summary":"Bright object remained in one spot, then faded away as 3 more \"dots\" appeared right beside it, in the shape of \")\"","Sighting Duration":"00:07:00","Source":"MUFON","trends":["There have been no other sightings in Gibsonville","This sighting has been favorited 1 time."],"Country":"United States","Object Features":"Unknown","Date Submitted":"07/07/2009 08:55 UTC"}