{"Disposition":"Unresolved","Object Features":"Dome, Window(s), Patterned Surface, Wings","Sighting Duration":"Undisclosed","Object Shape":"Chevron, Diamond, Sphere","Region":"SÃƒÂ£o Paulo","Tags":"City","Latitude":"-23.030938","City":"TaubatÃƒÂ©","Case Number":"17921","Date of the Event":"04/08/2009 12:00 UTC","Longitude":"-45.548324","Log Number":"BR-07072009-0027","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/17921.html.txt","/var/www/straped/mufon/org/17921.html"],"Date Submitted":"04/08/2009 12:00 UTC","Source":"MUFON","Summary":"Wasn't round at all, weird shape, gray colored with red lights.","map":"<A HREF = \"http://maps.google.com/maps?q=-23.030938,+-45.548324(17921)&iwloc=A&hl=en\"> mufon case (17921) map </A>","trends":["There have been no other sightings in Taubaté","This sighting has never been favorited."],"Country":"Brazil","divs":["Sighting DetailsIt was about 21:45 PM, I was watching the soccer game of SANTOS FUTEBOL CLUBE x CSA on my television, the first game of Brazilian Cup. So, when it finished, about 23:50 PM, I went to my yard, just to think, I always do this. So, in this moment, I started to look the moon, it was a nice and beautiful full moon night by the way. In the first moment, I've saw something very very weird, and didn't believed that... I've rubbed my eyes, and it was there, a great sized UFO, over my yard, many feets above, of course. At the first time, I thought it was my mind, but, when I've rubbed the eyes, I've saw that again. I was shocked and stunned, just watching that UFO flying through the skies above my yard. It was amazing, the UFO wasn't noisy, It didn't made ANY NOISE! And it was fast, not so fast, but fast. Anyway, the object wasn't round, it was like a semi-circle, splitted in two, with something like a cabin interconnected with something like wings, the object was gray-colored and with red lights in the probably \"wings\". The sighting leasted between one and three minutes aprox... At the moment, my feelings were: Surprise, shock, happiness and a bit scary at all, I never saw something like that, it was amazing. During the sighting, I was stunned, and after it just gone by the skies, I was excited: ran to my house and told to a couple friends what happened. Well, is it. Sorry for the english, I'm brazilian and don't know the english language very well."],"Weather Factors":"Unknown","Viewing Distance":"Unknown"}