{"Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Insufficient Data","Sighting Duration":"00:03:00","Object Features":"None","files":["/var/www/straped/mufon/html2text/17927.html.txt","/var/www/straped/mufon/org/17927.html"],"Source":"MUFON","Case Number":"17927","Longitude":"-122.315131","Date of the Event":"07/04/2009 12:30 UTC","divs":["sighting detailsit was after the fireworks had stopped for the night at our house in lynnwood, wa. my boyfriend and i were outside on the back deck when we saw a bright red light coming up on the horizon (ne). it was moving as fast as a satellite\\airplane would accross the sky. the light was very easy to see and bright, but there was no definite outline to it. it was a circular shape, but the light almost looked like a laser would with blurred edges. the center of the red light was bright yellow\\orange and looked exactly like a star except was a bit larger and closer, definately in the atmosphere. as it slowly moved accross the sky and over our house, my boyfriend was running to get his cell phone so we could take a picture when we saw a second, orange, light coming from the same place the first did. the light flew from the ne direction se, and they both followed the same path and faded away into the night. these were moving too quickly to be anything but a powered object, and were moving in a definate direction at a constant speed."],"Region":"Washington","City":"Lynnwood","Date Submitted":"07/04/2009 12:30 UTC","Tags":"City","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=47.82093,+-122.315131(17927)&iwloc=A&hl=en\"> mufon case (17927) map </A>","Viewing Distance":"Unknown","Log Number":"US-07072009-0033","trends":["There have been 9 other sightings in Lynnwood","There were no other sightings in Lynnwood on or around July 4th 2009","This sighting has never been favorited.",""],"Summary":"Red and orange flying objects, speed of satellite, distance and size of an airplane.","Country":"United States","Latitude":"47.82093","Object Shape":"Circle, Star-like"}