{"Region":"Nebraska","Weather Factors":"Unknown","Disposition":"Insufficient Data","Summary":"Flashing Orange Orb's","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","divs":["Sighting DetailsIn the backyard playing volleyball and notice this floating orb which appeared to be on fire. Time to fetch binoculars and it would not come into focus. We thought it was a piece of burning firework at first but it would not go out and continued on a consistent path (3 mins or so) across the sky. Low cloud cover but it was hard to determine distance. No sound and in perfect line so if it was a luminary from a firework it would have been blowing all over as the winds were 10-15mph. The orb finally disappeared into the cloud cover. This happened again hour later same path. Next sighting was around 2:30 AM July 5th. Much faster and farther off in the distance but the object would stop on a dime and then take off. It made the same orbit twice before stopping around 2:45 AM July 5th. No sound. We had four people witness the event and others in town saw the same 9:15 CDT sighting. We were all in disbelief of what we saw so we really haven't discussed until after the fact. We had no explanation as we all argued as if it was a plane, firework, Mars (planets don't do this), etc...but nobody really knew what to say."],"Log Number":"US-07082009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=40.814272,+-96.676029(17929)&iwloc=A&hl=en\"> mufon case (17929) map </A>","Object Features":"None","Object Shape":"Circle","Sighting Duration":"Undisclosed","Date of the Event":"07/04/2009 09:15 UTC","City":"Lincoln","Date Submitted":"07/04/2009 09:15 UTC","Latitude":"40.814272","Source":"MUFON","Case Number":"17929","Longitude":"-96.676029","trends":["There have been 42 other sightings in Lincoln","There was one other sighting in Lincoln on or around July 4th 2009"],"Object Flight Path":"Hovering then path,Straight-line path","Country":"United States","files":["/var/www/straped/mufon/html2text/17929.html.txt","/var/www/straped/mufon/org/17929.html"]}