{"Longitude":"-86.692525","Date of the Event":"07/04/2009 10:45 UTC","Latitude":"41.828097","divs":["Sighting DetailsI was on the beach in Union Pier, Michigan, to watch the fireworks and I noticed what looked like a plane. I pointed out that it would be neat to see the fireworks from an airplane, and my family and I watched it as we talked about this. As it got closer to us, we realized that it was not a plane. It was a bright red light and it stopped almost directly in front of us and stayed still for a few minutes. We watched it and noticed that it was slightly pulsating and eminating a blue-ish light amidst the red glow. Then it started to get smaller and smaller and it simply faded into the darkness, as if it was moving further up into the atmosphere. Not more than a minute or two later, I looked to the east again and saw another one heading our way, moving in a very straight pattern and rather fast, just like the first did. It was not floating, as it seemed to be going too fast and too accurately straight, and there was no noise or visible propellers, engines, or wings. It was just a glowing ball. Sure enough, this one did exactly what the first did in the exact same spot. As soon as it disappeared, another followed and still another. I was able to capture the second one on my digital camera, but I ran out of memory to capture the 3rd and 4th."],"Date Submitted":"07/04/2009 10:45 UTC","Object Shape":"Egg, Fireball","Disposition":"Unknown","Tags":"City","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.828097,+-86.692525(17926)&iwloc=A&hl=en\"> mufon case (17926) map </A>","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17926.html.txt","/var/www/straped/mufon/org/17926.html"],"Country":"United States","Log Number":"US-07072009-0032","Summary":"Noticed a bright red glowing object moving from the east. It stopped in front of us and stayed still for about 2 minutes. Then it seemed to get smaller until it disappeared from the spot it was. 3 more of the exact same thing followed.","Region":"Michigan","Object Flight Path":"Stationary,Path then hovering","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"Union Pier","trends":["There have been no other sightings in Union Pier","This sighting has never been favorited."],"Case Number":"17926"}