{"Date Submitted":"07/07/2009 10:40 UTC","Country":"United States","Object Shape":"Flash, Other","Object Flight Path":"Straight-line path","Date of the Event":"07/07/2009 10:40 UTC","Log Number":"US-07082009-0005","Region":"Utah","Disposition":"Insufficient Data","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/17933.html.txt","/var/www/straped/mufon/org/17933.html"],"Summary":"Bright moving light, no flashing from SW to NE","Sighting Duration":"Undisclosed","City":"North Ogden","Viewing Distance":"Unknown","Latitude":"41.307164","Case Number":"17933","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.307164,+-111.96022(17933)&iwloc=A&hl=en\"> mufon case (17933) map </A>","trends":["There has been one other sighting in North Ogden","There were no other sightings in North Ogden on or around July 7th 2009"],"Tags":"City","divs":["Sighting DetailsFrom my hot tub on the East side of my home, I noticed a very bright light, similar to a satellite moving slowly from what would have been the Southwest to the Northeast. Because of where my hot tub sits in relation to my house, I did not notice the item until it was almost directly overhead. It had no flashing lights like an aircraft and appeared to be too low for a satellite and too high for most conventional aircraft - also too bright. This is also a highly unusual path for aircraft traffic. It MAY have slowed, hesitated or varied slightly in it's course, but I can not be sure. Initially, I thought this may be the Shuttle or ISS catching the glint of the sun that had just set over the horizon, but the shining was FAR brighter than previous sightings of known space objects and the light did not fade or dissipate as it went towards the visible edge of the sky (we have mountains fairly close there). I had to exit the hot tub and proceed to the front of my home to maintain visibility as my neighbors home and shed quickly blocked my view. I lost sight of the item as it went past the rim of the mountains."],"Longitude":"-111.96022"}