{"Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Region":"California","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.801333,+-116.955007(17935)&iwloc=A&hl=en\"> mufon case (17935) map </A>","Case Number":"17935","Summary":"Large Red Flashing Star-Like object","Date Submitted":"07/07/2009 09:30 UTC","divs":["sighting detailstonight, july 7th, my sister and i were walking out of bible study on jerome st., which overlooks the valley of el cajon. we saw a single red light in the sky. at first we thought it was a plane. we stood by our cars talking before we took off, and during that time we noticed that the light was moving very slowly across the sky. several helicopters and planes went over, but this was much farther away and moving 1\\10th the speed and was 100% red in color. it looked like a really large, really bright red pulsing star. so i'm glancing at it, and notice several bizarre course corrections, all of which completely defy the law of physics. we started to talk about it with unease. my sister called her husband at home over in la mesa, and asked him to walk outside and look in the sky. he saw it but had no idea what it could be, and he used to be in the military. we watched it creep across the sky, hover in one spot for a few minutes, creep some more, and then after about a total of 15 minutes, it began to flicker, turned bright silver, and literally disappeared in front of our eyes. i could not believe what i saw. anyone else see this around 9:30 over el cajon, ca? i don't know what it was, and i will not speculate, but there are apparently various websites where people reported several bright red objects that behaved the exact same way being seen over el cajon on the 4th of july. if you google 'red lights over el cajon ca', you will see the sites i refer to. then i found other websites that talk about red lights being seen over el cajon for years. ??? this is all new to me. i have no idea what it was and it was very un-nerving."],"files":["/var/www/straped/mufon/html2text/17935.html.txt","/var/www/straped/mufon/org/17935.html"],"Object Features":"Undisclosed","Latitude":"32.801333","Longitude":"-116.955007","Tags":"City","Source":"MUFON","Disposition":"Insufficient Data","Viewing Distance":"Unknown","City":"El Cajon","Object Shape":"Star-like","Country":"United States","Log Number":"US-07082009-0007","Date of the Event":"07/07/2009 09:30 UTC","trends":["There have been 41 other sightings in El Cajon","There was one other sighting in El Cajon on or around July 7th 2009"]}