{"City":"Prineville","files":["/var/www/straped/mufon/html2text/17931.html.txt","/var/www/straped/mufon/more/17931_submitter_file1__DSC00757copy.jpg","/var/www/straped/mufon/more/17931_submitter_file2__DSC00755_copy2.jpg","/var/www/straped/mufon/org/17931.html"],"Longitude":"-120.824606","divs":["Sighting DetailsOn the fourth of July I took a lot of photographs int The Painted Hills of The John Day Fossil Beds in central Oregon. I reviewed the digital camera files when I got home the next day and found an unusual elliptical shape near the top of one photo. I enlarged it and enhanced it as much as I could with Photo Shop and Photo Paint, but it remains unclear. the enhancement did bring out distinct concentric ellipses, an inner one surrounded by an outer one. When changing the image to a negative view it became a little more visible. The photo was taken through the moon roof of my car at 6:53:16 AM., The sky was clear and there were no signs of aircraft there. I didn't see the UFO because I held the camera above my head and clicked the shutter a couple of times. Today, I checked another photo that was taken at 6:58:02 AM and found an image higher in altitude. It is very small and obscure, but has the same basic features as the one found in the other photo. I wanted to have those images in the the photos checked out by someone with a background in UFO photo analysis."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"07/04/2009 06:53 UTC","Date Submitted":"07/04/2009 06:53 UTC","Case Number":"17931","Disposition":"IFO","Latitude":"44.308868","Viewing Distance":"Unknown","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Undisclosed","Log Number":"US-07082009-0003","Summary":"UFO Image Appears on two digital photos taken in a remote part of Oregon","trends":["There have been 3 other sightings in Prineville","There were no other sightings in Prineville on or around July 4th 2009","This sighting has never been favorited.",""],"Region":"Oregon","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=44.308868,+-120.824606(17931)&iwloc=A&hl=en\"> mufon case (17931) map </A>"}