{"Region":"Michigan","Viewing Distance":"Over One Mile","Longitude":"-83.178536","Date Submitted":"08/03/2002 08:10 UTC","divs":["Sighting DetailsSummary from phone conversations with witnesses:Witnesses were in the backyard of a residence star gazing when they noticed astar shaped object shimmering in the sky. A telescope was then set up to get abetter view of this object and allowed the witnesses to determine that therewere actually 8 disk shaped objects arranged in a geometric pattern rather thanone single object. The objects were stationary and hovering and seemed to bereflecting light rather than being self illuminated. They described them aspopping in and out of sight and the objects changed the shape of the geometricpattern they were in.Female witness described them as being in a zig zag pattern and they changedpatterns 3 times. She also stated that previous to seeing them through thetelescope she believed it to be only one object rather than 8 seperate objects. She stated that she had severe headaches 22 hrs after the event which havebecome quite bothersome and will be seeking medical assistance for thiscondition and is currently on migraine medication. The second male witness described the object as a bright light which was movingand stopping which had a fainter light following it or circling it. Thiswitness watched it for about 5-10 minutes but didnt observe the objects throughthe telescope."],"Date of the Event":"08/03/2002 08:10 UTC","Source":"MUFON","Disposition":"Unresolved","Log Number":"","Latitude":"42.250594","Summary":"4 people witnessed a shining objects high in the s","Country":"United States","trends":["There have been 5 other sightings in Lincoln Park","There were no other sightings in Lincoln Park on or around August 3rd 2002"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=42.250594,+-83.178536(1793)&iwloc=A&hl=en\"> mufon case (1793) map </A>","Tags":"City","Object Shape":"Disc","City":"Lincoln Park","Object Features":"Other","Case Number":"1793","Weather Factors":"Unknown","Sighting Duration":"01:00:00","files":["/var/www/straped/mufon/html2text/1793.html.txt","/var/www/straped/mufon/org/1793.html"]}