{"Log Number":"US-07082009-0008","files":["/var/www/straped/mufon/html2text/17936.html.txt","/var/www/straped/mufon/org/17936.html"],"Tags":"City","Object Shape":"Fireball","Case Number":"17936","Date Submitted":"07/07/2009 12:00 UTC","Date of the Event":"07/07/2009 12:00 UTC","Country":"United States","Source":"MUFON","Longitude":"-93.601266","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around July 7th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Disposition":"Unknown","Object Features":"Unknown","Object Flight Path":"Other","Summary":"Unknown Aerial Phenomena - visually, very similar to Carp, Ontario case","Region":"Iowa","City":"Des Moines","divs":["Sighting DetailsI live in Des Moines Proper a couple blocks north of the freeway. I stepped into my kitchen close to midnight, as always I peered through the window to look at the northern sky. Then I noticed a multi-colored shining object to the north, beyond some trees, which have to be at least 100 feet tall (about 200-300 yards north of my house). My first instinct was it was a glare on the upper portion of the window, from my light. I then moved towards the window, realizing this was not the case. Then I actually said to myself aloud; \"why is that plane flying so low?\"- I do live a few miles northwest of the Des Moines Airport. Then I actually had a solid 6-7 seconds to take this object in... The problem was it was not moving towards the airport... or away for that matter... I will admit I have studied this kind of phenomena, in-depth... What I saw, before this anomaly literally faded out, looked very similar to a supposed case in the early 1990's in Carp, Ontario, Canada. This object seemed to have multiple shimmering orbs, however... I will admit- I only had enough time to decipher what I was looking at, which obviously, I have no idea what, or who's it was. I know these were not fireworks, it was too late for that on a weeknight (in my neighborhood), I did not hear a solitary firecracker lit that night, there was not a sound, expect for my mouth hitting the floor, that is. Not to mention this thing was above or parallel to trees that are 100 feet tall (plus) trees and it was already behind them, and didn't look like fireworks! I would also have to admit the lights were not quite as bright as a local firework. From the 10 seconds of the entire event, I would have to say this object was large, larger than a single engine Cessna, etc. From it's position from me- I would surely say this was probably larger than a commercial jetliner. I take these things seriously and would not post unless very serious. Please, if anyone else saw this thing- PLEASE REPOST!"],"Sighting Duration":"00:00:07","map":"<A HREF = \"http://maps.google.com/maps?q=41.608735,+-93.601266(17936)&iwloc=A&hl=en\"> mufon case (17936) map </A>","Latitude":"41.608735"}