{"Disposition":"Unknown","Country":"United States","Object Shape":"Cross, Sphere","Summary":"2 Lights flying over washington.","Sighting Duration":"Undisclosed","Date Submitted":"07/04/2009 12:30 UTC","Viewing Distance":"Unknown","Tags":"City","Date of the Event":"07/04/2009 12:30 UTC","Object Features":"Undisclosed","City":"Washington","Longitude":"-77.031936","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsWhat I seen was this. While sitting on the deck I was watching fireworks, I looked between two trees believing that what I was seeing was a firework that I known by a \"flare\" on it's way up it sparkles and soon enough goes out, easy enough. The twist to this was that the flare actually kept going, it changed to a reddish color and continued it's flight path (Which started making be believe I had just seen this object come into our atmosphere instead of the object being a \"Flare\" firework.\", in about 2 seconds of distance from how fast these objects were flying, came another dot but instead of it being reddish, it was a more of an orange colored dot flying what seemed in pursuit of the reddish one. The first object I starred at long enough and it seemed as though in the center it was a T with either edge acutely angled instead of it being at a 90 degree angle. My feelings during and after were all pretty much the same, I was calm during the whole situation and after just because of the sole fact I believe if there are aliens and there are UFO's I highly doubt they're here to hurt us. I lost sight of this object while it flew in a constant flight path while maintaining it's speed, it flew back out of our atmosphere or what seemed to, which then it just looked like another star in our space."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.904632,+-77.031936(17947)&iwloc=A&hl=en\"> mufon case (17947) map </A>","Case Number":"17947","Source":"MUFON","Latitude":"38.904632","Log Number":"US-07082009-0019","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around July 4th 2009"],"Region":"Washington","files":["/var/www/straped/mufon/html2text/17947.html.txt","/var/www/straped/mufon/org/17947.html"]}