{"map":"<A HREF = \"http://maps.google.com/maps?q=39.743524,+-104.982503(17944)&iwloc=A&hl=en\"> mufon case (17944) map </A>","Tags":"City","Log Number":"US-07082009-0016","Summary":"Bright object high in the sky with little motion and strange trajectory","Disposition":"Unknown","Longitude":"-104.982503","Sighting Duration":"Undisclosed","Date of the Event":"06/30/2009 10:10 UTC","Source":"MUFON","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around June 30th 2009"],"City":"Denver","Date Submitted":"06/30/2009 10:10 UTC","divs":["Sighting DetailsI was visiting a friend in Broomfield Colorado, near Denver, when I was standing in his front yard with him waiting for a cable repair guy to show up. I was facing west towards the Rocky Mtns. I noticed several commercial aircraft flying overhead at about 17k to 20k ft. They were traveling from the south toward the north. Just after one of them had passed by, I noticed what looked like a star directly above the mountains and quite stationary. I called the object to the attention of my friend who could not tell what it was either but did find it strange. He thought that it was rotating and could possibly have had a second object very close to it. I could not tell if there were two of them but it did look like it was rotating. After about twenty minutes of continuous viewing, it starting moving from west to southeast. At this time, I ran into the house and got my video camera. I tried to zoom in on the object but at full zoom, I could not get an image. This told me that the object was very far away. I asked my friend for a pair of binoculars or some other viewing device but he didn't have any. As the object continued to move toward the southeast, I watched it continuously. It finally stopped traveling and came to a rest. The total travel time from west to southeast was about fourty minutes. As I continued to watch the object, the size and brightness did not change. After another ten minutes at its new position, it started moving straight up. At this time, the object kept climbing until I could not focus on it with the naked eye. All in all the total view time was about 1hr 10min. The weather conditions for this day were clear skies and very sunny. Being 10am when the object was first spotted, and the sun shining brightly, the sun was low in the sky behind me and was shining brightly on the mountains in front of me. The conditions could not have been any better for viewing such an event. At no time did I loose sight of the object until the very end when it climbed too high to view any longer. This object was close enough to DIA airport that radar signatures could have been picked up. If they do not have reports of this object then maybe commercial aircraft flying in the area may have spotted it as well. I noticed that when the object was at the southeast position, at least one aircraft flew under the object at an elevation of more than thirty-thousand ft. I checked with the NASA web site for tracked objects and I could not find any man made objects in the Denver area at that time of day in visible site. I hope to discuss this further with an FI."],"files":["/var/www/straped/mufon/html2text/17944.html.txt","/var/www/straped/mufon/org/17944.html"],"Region":"Colorado","Viewing Distance":"20 Feet or Less","Object Features":"Unknown","Country":"United States","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Star-like","Weather Factors":"Unknown","Case Number":"17944","Latitude":"39.743524"}