{"Weather Factors":"Unknown","Country":"United States","Longitude":"-119.766436","Tags":"City","Summary":"2 ufo's paused under the moon","Region":"California","Disposition":"Unknown","Latitude":"36.757127","Log Number":"US-07082009-0020","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path then hovering","Source":"MUFON","Viewing Distance":"Over One Mile","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.757127,+-119.766436(17948)&iwloc=A&hl=en\"> mufon case (17948) map </A>","trends":["There have been 63 other sightings in Fresno","There were no other sightings in Fresno on or around July 7th 2009"],"Date of the Event":"07/07/2009 08:52 UTC","Date Submitted":"07/07/2009 08:52 UTC","files":["/var/www/straped/mufon/html2text/17948.html.txt","/var/www/straped/mufon/org/17948.html"],"Object Shape":"Disc","divs":["sighting detailslast night july 7th around 9:20 pm se of fresno. my wife and i spotted some unusual flying objects in the sky by the moon. i was only able to capture part of the event on video cause my camera ran out of charge. but in the first half we saw the object on the right side of the moon just siting there, for a good 3 minutes. i ran off to get my camera... once i started to tape...the object began to move towards the moon as i was tapeing this i noticed another object coming into view, once the first one flew past the moon my camera went out. as it flew past the moon it lowered itself slightly under the moon on the left side, then stopped. as it was moving the other ufo that came into view from the right side of the moon also stopped. it stopped below the right corner of the moon. the objects stayed in place creating a triangle position with the moon for a good 2 minutes before disappearing. i have contacted mufon once before, strange as it sounds these objects we are able to see almost at will. but they are very difficult to record. but we do have some video of it.this has been on going since november 3rd 2008. http:\\\\www.youtube.com\\watch?v=kkr6ewlofuc&feature=channel_page"],"Case Number":"17948","City":"Fresno"}