{"Date Submitted":"07/04/2009 09:40 UTC","Longitude":"-104.975603","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Path then hovering","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Latitude":"39.748064","map":"<A HREF = \"http://maps.google.com/maps?q=39.748064,+-104.975603(17953)&iwloc=A&hl=en\"> mufon case (17953) map </A>","Case Number":"17953","Log Number":"US-07082009-0025","Disposition":"IFO","Date of the Event":"07/04/2009 09:40 UTC","divs":["Sighting DetailsI was driving South on I-25 around 9:30 or so on July 4th 2009. I could see fire workes in the distance coming from several towns. I was scanning back and forth and notices 5 or six glowing orbs in the sky, not real close to any firworks that were going off. They looked out of the ordinary so I watched them rather than the fireworks. The orbs were kind of in a little group moving slightly up and down, left and right, but were staying a a tight little group. One orb started to vier off to the right. It went quite a distance away from the others but they were all still in sight. It slowly drifted off to the side maybe a quarter mile. I was probably 30 miles or so away so that is my estimate. Then the lone orb started moving back toward the other orbs. Slowly it made it's way back to the original group. After the orbs re-grouped, one by one they appeared to merge with eachother. All the orbs merged into one and then the orb slowly disappeared into the horizon. When I first saw it, I knew it wasn't ordinary, it was very different form all the other lights around it and it wasn't close by any fireworks. It Didn't move like anything I had seen before and i looked for any sign that could disprove what I though it was, a ufo(s) of some kind. No blinking lights like on a plane or predictable flightpath like any plane either. I didn't know what to think at first but I quickly came up with the idea that it could be a ufo. After looking for any possible evidence to refute my beliefs am left with a strong belief that what I saw was a ufo(s)."],"Summary":"Several erratic moving objects. One drifts off, then comes back. All object merge into one and disappear into horizon.","City":"Denver","files":["/var/www/straped/mufon/html2text/17953.html.txt","/var/www/straped/mufon/org/17953.html"],"Region":"Colorado","Object Features":"Other","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around July 4th 2009"],"Object Shape":"Circle"}