{"City":"Lima","Region":"South Carolina","Tags":"City","Summary":"Bright White Light Triangular Shape Objects in 3 f","map":"<A HREF = \"http://maps.google.com/maps?q=-11.870659,+-77.024061(1795)&iwloc=A&hl=en\"> mufon case (1795) map </A>","Source":"MUFON","Date Submitted":"09/30/1979 04:00 UTC","trends":["There have been no other sightings in Lima","This sighting has never been favorited."],"divs":["Sighting DetailsIt occurred sometime back, when I was attending HS in Lima, Peru, S.A. It was aholiday break period in early October 1979. I was retreiving some clothingitems from the laundry patio outside the house we lived, when I turn up to thesky south, and notice at a distance 3 triangular blurry like white light objecttogether hovering over slowly. The sky was overcast and cloudy. I saw themflying over and pass the house and continued south west direction toward theocean. About a minute or so later, I heard the engine of a fighther jet flewover uswe lived near an airforce base at that time, and saw the Peruvian AirforceMirage jet follow the same path of the triangular shape objects. We have hadjets flown over the area many times, but this one was shortly after those 3objects passed over the area. I had told this to my mother at that time, andthen my dad, since he was in the military. The local TV did not mentionedanything, nor any other one of the neighbors kids saw anything. I thougth youmight want to record this event for your research. I dont recall any soundcoming out when the 3 objects hover over the house, only the juet engine rightafter they passed."],"files":["/var/www/straped/mufon/html2text/1795.html.txt","/var/www/straped/mufon/org/1795.html"],"Date of the Event":"09/30/1979 04:00 UTC","Case Number":"1795","Sighting Duration":"00:05:00","Longitude":"-77.024061","Log Number":"","Disposition":"Insufficient Data","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Boomerang","Object Flight Path":"Unknown","Weather Factors":"Unknown","Latitude":"-11.870659","Country":"Peru"}