{"Sighting Duration":"02:00:00","trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around February 29th 1956"],"divs":["Sighting Details BY REASON OF THE ENCOUNTERS, I NOW UNDERSTAND WE HAVE ALWAYS HOSTED TIME TRAVELERS. SOME IN ENERGY ORBS, SOME IN UNIDENTIFIED FLYING OBJECTS (U.F.O.) I HAVE SEEN THEM AND HAVE PROSPERED FROM MY ENCOUNTERS WITH THEM. I SWEAR TO YOU WHAT I AM ABOUT TO SHARE WITH YOU IS TRUTH. THE ENCOUNTERS BEGAN IN THE YEAR 1956. I WAS STATIONED AT PORT HUENEME NAVAL BASE, CALIFORNIA. I HAD MET A GIRL THAT LIVED DOWN THE COAST HIGHWAY IN SANTA MONICA. LATE ONE NIGHT I WAS ALLOWED TO DO THE DRIVING OF HER CAR BACK TO MY BASE AFTER OUR EVENING TOGETHER. AS WE WERE TRAVELING BACK WE SAW TWO \"SAILORS\" HITCH-HIKING. WE AGREED TO GIVE THEM A LIFT. I NOTICED THE \"SAILORS\" LOOKED QUITE YOUNG, TOO YOUNG IN FACT TO BE IN THE NAVY. THEY DIDN'T APPEAR TO BE MUCH OLDER THAN FOURTEEN OR FIFTEEN. I ASKED THE \"SAILORS\", \"WHERE ARE YOU HEADED\"? ONE REPLIED, \"THE COOS HEAD NAVAL FACILITY IN CHARLESTON, OREGON\". I HAD NEVER HEARD OF THIS PLACE, BUT I SAID NOTHING. MEANWHILE WE ALL CONTINUED ON OUR WAY. AS WE APPROACHED THE OXNARD ROAD,\"THIS IS WHERE I TURN\" I EXCLAIMED. THEN WE LET THE \"SAILORS\" OUT, WISHED THEM A SAFE JOURNEY. THEN WE MADE OUR TURN AND AS WE DID, WE SAW A STRANGE-LOOKING BALL OF LIGHT HOVERING CLOSE TO THE CENTER OF THE ROAD. THIS WAS AN INTENSE LIGHT BUT DID NOT HURT THE EYES. AS WE DROVE CLOSER TO THIS LIGHT, IT DISAPPEARD. \"WOW\", WE BOTH EXCLAIMED. AS SOON AS WE DROVE THROUGH THE SPOT WHERE THE LIGHT HAD BEEN, A BONE-CHILLING ICYNESS PASSED THROUGH OUR BODIES. WE LOOKED AT EACH OTHER WITH QUESTIONING SURPRISE...\"WHAT THE HECK?\" WHEN I CHECKED MY REAR VIEW MIRROR-THERE IT WAS- BEHIND THE CAR! NOW WE WERE BOTH SCARED. MY DATE SCREAMED AND GOT DOWN INTO THE FLOOR BOARD. I SAID \"I'M GOING TO STOP\". SHE WAS SOBBING, SHAKING AND CLINGING TO THE FLOOR BOARD. HER SUDDEN TERROR WAS CONTAGIOUS AND I DID NOT STOP. THE LIGHT APPEARED TO BE FOLLOWING US NOW. UP AHEAD, THERE WAS AN INTERSECTION WHERE THE ROAD MADE A DIP. AFTER GOING OVER THE DIP, I WATCHED IN MY REAR VIEW MIRROR TO SEE WHETHER THE LIGHT MADE THE DIP AS WE HAD... IT DID NOT! THERE WAS A CAR COMING UP THE ROAD TOWARD US. I SWITCHED MY HEADLIGHTS OFF AND ON AND PULLED INTO HIS LANE WHICH CAUSED THE APPROACHING CAR TO PULL OFF THE ROAD AND STOP. AS WE PASSED THE NOW STOPPED CAR, THE BALL OF LIGHT ILLUMINATED THE SCENE, THE CAR WAS A TAXI, THE DRIVER WORE A WHITE SHIRT AND HIS LEFT ARM WAS RESTING ON THE DOOR WINDOW FRAME. HE DIDN'T LOOK AT US. HE APPEARED TO BE QUITE CALM-LOOKING STRAIGHT AHEAD. IN THE MEANTIME, WE AND THE BALL OF LIGHT CONTINUED DOWN THE ROAD. BECAUSE THE LIGHT WAS BECOMING SMALLER, SLOWING AND LAGGING A BIT BEHIND OUR CAR, I THOUGHT IT WAS ENDING IT'S PURSUIT. AHEAD, I COULD SEE THE STREET LIGHTS OF OXNARD. I DETERMINED, IF I COULD MAKE IT TO THESE LIGHTS WE WOULD BE SAFE AND COULD POSSIBLY SEE WHAT THIS THING WAS. AS WE WENT UNDER THE STREET LIGHTS, THE BALL OF LIGHT STOPPED ABRUPTLY JUST BEFORE REACHING THE STREET LIGHTS, HOVERED OVER THE STREET FOR A MOMENT THEN MADE A DEPARTURE AT A FORTY-FIVE DEGREE UP AND OUT INTO THE NIGHT SKY. NOTHINGNESS. NO VAPOR TRAIL, NO TRACKING LIGHTS- NOTHING. WE DROVE TO THE FIRST AVALIABLE PHONE BOOTH AND CALLED THE POLICE,I TOLD THEM BRIEFLY ABOUT OUR ENCOUNTER AND THEY SENT A PATROL CAR TO US. WE THEN RELATED THE ENTIRE ENCOUNTER. THE POLICEMAN GOT INTO HIS CAR,AND WE IN OURS AND WE RETRACED OUR ROUTE, STOPPING ALONG THE WAY TO POINT OUT SIGNIFICANT FACTS. THE MOST IMPORTANT FACT BEING THE FORCING OF THE TAXI TO PULL OVER OFF THE ROAD. THE POLICEMAN CALLED HIS DISPATCH OFFICER, THEY IN TURN CALLED THE TAXI COMPANY. THE POLICEMAN ASKED THE TAXI COMPANY WHETHER THEY HAD A TAXI IN THAT VICINITY AT THAT TIME. THEY REPLIED IN THE AFFIRMATIVE. THE POLICEMAN FURTHER ASKED IF THE DRIVER HAD REPORTED SEEING ANYTHING STRANGE OR UNUSAL. NO, NOTHING SAID THE TAXI COMPANY. I WAS DUMBFOUNDED! I TOLD THE POLICEMAN I COULD PROCESS THE FACT THE DRIVER DID NOT SEE THE STRANGE BALL OF LIGHT BUT I COULD NEVER ACCEPT THE FACT HE HAD BEEN FORCED OFF THE ROAD, CAME TO A COMPLETE STOP AND YET, HAD NO KNOWLEDGE OF THE EVENT. I REPORTED THE INCIDENT TO MY SUPERIOR AND HE FILED A REPORT. I, IN FACT, WAS GIVEN ORDERS TO REPORT TO THE VERY SAME BASE THE \"SAILORS\" CALLED THE COOS HEAD NAVAL FACILITY ALMOST A YEAR LATER. WHEN I ARRIVED AT THIS BASE, IT WAS NOT READY FOR OCCUPANCY. I AND OTHERS THERE WERE BIVOUACKED IN A LOCAL HOTEL IN COOS BAY,OREGON WHILE WE PREPARED THE BASE FOR RESIDENCY. WHILE AT THE COOS HEAD BASE I HAD ANOTHER ENCOUNTER. THIS ENCOUNTER WAS WITH FOUR THIN AND TALL PERSONS THAT LOOKED QUITE NORMAL. NO BIG EYES NOR GREEN SKIN, THEY ALL WORE BLUE JUMP SUITS. THIS ENCOUNTER TOOK PLACE WITHIN AND ON A SECURE BASE DOING SECRET MILITARY WORK. I AM A PLANK OWNER OF THIS BASE. I WAS THERE FROM 1957 THROUGH 1959. I FOUND MYSELF LAYING ON A WAIST HIGH GURNEY LOOKING AT THE FOUR STRANGERS. I WAS QUITE RELAXED. OVER MY HEAD AND AT MY FEET WAS A ROUND FLAT SCREEN. MY HEAD WAS LAYING ON AN ELEVATED PILLOW THAT WAS RESPONSIBLE FOR TRANSFORMING MY THOUGHTS INTO MOVIE-LIKE IMAGES ONTO THE SCREEN. THE LOCATION OF THIS ENCOUNTER WAS IN A ROOM IN THE FRONT OF THE CHOW HALL DOORS. NO ONE CAME THROUGH THIS AREA WHILE THE ENCOUNTER WAS TAKING PLACE. IT WAS DURING THE EARLY MORNING HOURS. ONE OF THE \"MEN\" QUESTIONED ME ABOUT THE SPINNING GYRO AND WHAT I UNDERSTOOD ABOUT IT. INSTANTLY,AN IMAGE APPEARED ON THE SCREEN. NOW I DID NOT FEEL SO RELAXED AND I TRIED NOT TO CO-OPERATE. THE \"MEN\" LOOKED AT EACH OTHER AND I SENSED THE SESSION WAS OVER, WHATEVER IT HAD BEEN. THE NEXT THING I REMEMBER WAS WAKING IN MY BUNK WONDERING WHAT HAD JUST HAPPENED. I DID NOT MENTION THIS ENCOUNTER TO ANYONE AS I DID NOT WANT TO APPEAR AS UNSTABLE WORKING ON THIS BASE. NOW THAT TIME HAS ELAPSED,I REALIZE THIS ENCOUNTER WAS TO PLACE TIME-RELEASE INFORMATION INTO MY SUB-CONSCIOUS. SINCE THAT TIME AT COOS HEAD, I HAVE OBTAINED A UNITED STATES PATENT WHICH IS FOR A VEHICLE THAT OPERATES USING HARMONICS. FURTHERMORE, I HAVE JUST RECENTLY INVENTED AND MADE WORKING MODELS OF THE WORLD'S FIRST HYBRID BOAT MOTOR, RUNS ON A SOUND WAVE. THIS MOTOR HAS NO MECHANICAL PROPELLAR AND WILL NOT HARM AQUATIC LIFE. THERE WERE MANY THINGS REVEALED TO ME. AND NOW I KNOW THINGS LIKE A SEER WOULD KNOW. IN 1988, I RETIRED EARLY AND FOUND MYSELF EASILY BORED. HAVING ALWAYS BEEN A HIGH ACHIEVER AND A BUSY DOER TYPE PERSON, I PONDERED WHAT I COULD POSSIBLY DO WITH MY EXTRA TIME. I DECIDED TO RENOVATE MY SMALL OUTDOOR UTILITY SHED INTO A WORKSHOP. THERE I REASONED, I COULD TINKER WITH SMALL IDEAS AND REPAIR MINOR HOUSEHOLD MALFUNCTIONS. AS TIME WENT ON I FOUND MYSELF ATTEMPTING TO MAKE A WORKING MODEL OF SOME SORT OF NEW MOTOR WITH INTERNAL PUSH. THIS IDEA HAD FLOATED AROUND IN THE DARK RECESSES OF MY SUB-CONSCIOUS FOR YEARS. I WAS BASICALLY EXPERIMENTING WITH ODDS AND ENDS OF MATERIEL WHICH WERE ON HAND AROUND THE HOUSE. I KNEW WHAT I WANTED TO BUILD BUT WAS NOT ENTIRELY CERTAIN JUST HOW TO GET TO THE END RESULTS. AFTER SEVERAL DAYS AND MANY FAILURES, A SMALL MODEL OF THE MOTOR BEGAN TO TAKE SHAPE. BECAUSE MY \"SHOP\" WAS SO TINY, I USUALLY WORKED WITH THE DOOR SLIGHTLY AJAR. NO ONE WAS AWARE OF WHAT I WAS WORKING UPON. ONE DAY WHILE WORKING ON THE MOTOR, I NOTICED A MAN WALKING INTO MY BACK YARD. I STEPPED OUT OF THE SHOP, PULLING THE DOOR CLOSED BEHIND ME, AND WENT TO GREET HIM. HE WAS A WELL-DRESSED PERSON, AVERAGE LOOKING, ABOUT FORTY-FIVE OR SO. I SAID HELLO AND COULD I HELP HIM. HE LOOKED AT ME AND I KNEW AT ONCE HE WORKED WITH COMPUTERS AS WE STOOD TOGETHER, MY THOUGHTS RETURNED TO THE ENCOUNTER IN 1958 AT COOS HEAD NAVAL FACILITY. WITHOUT SAYING ANOTHER WORD I SMILED AND HE POINTED TO MY SHOP DOOR. I KNEW HE WAS WELL AWARE OF WHAT I WAS WORKING ON. HE LEFT THE BACK YARD AND I NEVER SAW HIM AGAIN. KNOW THIS, THE TIME TRAVELERS, ARE REAL AND THE (U.F.O.)IS THERE TIME MACHINES. KNOW I KNOW THIS REPORT IS LENGTHY I DO HAVE A SHORTER VERSION. I AM VIRGIL E ATKINSON"],"Latitude":"34.206405","Tags":"City","Disposition":"Unknown","Weather Factors":"Does Not Apply","City":"Oxnard","Log Number":"US-07082009-0026","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=34.206405,+-119.169452(17954)&iwloc=A&hl=en\"> mufon case (17954) map </A>","Summary":"A BRIGHT ROUND LIGHT--DID NOT HURT YOUR EYES","Region":"California","Date of the Event":"02/29/1956 12:00 UTC","Date Submitted":"02/29/1956 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Other","Country":"United States","files":["/var/www/straped/mufon/html2text/17954.html.txt","/var/www/straped/mufon/org/17954.html"],"Viewing Distance":"20 Feet or Less","Case Number":"17954","Longitude":"-119.169452","Source":"MUFON"}