{"Summary":"orange-ish egg shaped object w/6-8 \"legs\" , red light in the center of belt, glowing","divs":["sighting detailsjuly 4th,2009 approximately 10:45pm after observing the bethlehem, pa area fireworks display, my 2 guests and husband were sitting on the back deck of our home. my sister-in-law was the first to observe the crafts, and called my husband's, her brother's, attention to it. my husband then came to our back door to get my attention. i walked out on the back deck, and saw the crafts immediately. the four of us stood there shocked for several minutes. i ran out front, through the house, but the crafts were not there. we had observed 8 orange in color, egg shaped ufos with approximately 6-8 \"legs\". the crafts had an aura around them with a single red light in the middle of their belted centers; in the area similar to a belt buckle. the crafts flew slowly, but \"chased\" after one another like children playing tag, and much lower in the sky than an airplane or the stars. the ufos proceeded to fly off in a east south eastern direction. we were all stunned and scared by what we had never before experienced. i\\we am\\are now a believer\\s!!!!!!!!!!"],"Object Features":"Appendage(s)","trends":["There have been 21 other sightings in Bethlehem","There were 2 other sightings in Bethlehem on or around July 4th 2009"],"City":"Bethlehem","Object Shape":"Egg","Latitude":"40.632792","Longitude":"-75.366158","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Source":"MUFON","Log Number":"US-07082009-0022","Date Submitted":"07/04/2009 10:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.632792,+-75.366158(17950)&iwloc=A&hl=en\"> mufon case (17950) map </A>","Weather Factors":"Unknown","Case Number":"17950","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/17950.html.txt","/var/www/straped/mufon/org/17950.html"],"Tags":"City","Country":"United States","Date of the Event":"07/04/2009 10:45 UTC","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed"}