{"City":"Undisclosed","Longitude":"-81.513534","divs":["Sighting DetailsIt was appx 9:15 EST clear sky with the moon in the east. I was walking my dog in my neighborhood heading West Listening to music on a bluetooth headset linked to my G phone. My dog stopped to pee and I looked up and noticed an Orange reddish cone shaped light over our neighborhood coming from the west heading E-SE. It was bright and glowed orangish red. What made me take another look was the fact that it made no noise. I just stood there staring at it as it headed closer. Since it was clear and almost overhead I had a hard time gauging the distance, the only other object that was near was the Streetlight (sodium vapor lamps) that is in the picture I took. Since I live about 3 miles from the Tamiami Executive airport I see planes and helicopters all the time. I was also in the USAF (many years ago) and I am very familiar with aircraft navigation lights. This bore no resemblance to that as it had no blinkies or other lights in a normal configuration. It was more like a shimmering orange Top or inverted cone that was red on the bottom or something. Since I was listening to music on my phone prior to seeing it so it took me a bit of time to get the camera working (I have a case which makes the button hard to get to). I removed the headset btw thats how I know the UFO was silent. Two neighbors were walking by and they saw it too and asked me what it was and we just stared at it. It continued moving E-SE very slowly but gaining altitude. A light plane had taken off from the airport and was now heading South the plane was about 600 feet (typical in my neighborhood) and we could clearly see the lights on the plane and hear the engine. It seemed the plane was heading toward the UFO. At that point the UFO turned South and headed away from the plane. It then rapidly disappeared. I tried to take video but I could not get the UFO in frame as it took off quickly. (and I was fumbling with the camera and my dogs leash). I called the Tamiami Tower who routed me to MIA Approach control. I told them my location and asked if there was any Traffic in the vicinity for the past 20 minutes and they could only confirm 1 airliner out of MIA that flew over me from the North as I was speaking to him. He could not confirm the small plane or any other traffic in the area. I uploaded the pic to my twitter account (threv65) and made an entry in my Facebook from my phone. The funny thing is, I thought I was looking at it for about 5 minutes but when I got home and looked at the timestamps on the picture and my video attempt almost 30 minutes had gone by. I called Channel 7 news and reported it but they had no calls (they are the local sensationalist news station everybody calls them first with the the weird stuff). I have attached the phot and the video thoug htey are of course really crappy and I'm not sure whether or not it is on the video (maybe near the end but I could not get it framed as it was heading away and my dog kept pulling me."],"trends":[""],"files":["/var/www/straped/mufon/html2text/17965.html.txt","/var/www/straped/mufon/more/17965_submitter_file1__UFO-2009-07-08_21.49.22.jpg","/var/www/straped/mufon/org/17965.html"],"Disposition":"Unknown","Object Shape":"Cone, Fireball","Latitude":"27.669327","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"07/08/2009 09:15 UTC","Source":"MUFON","Summary":"Light in low in sky heading E-SE","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Case Number":"17965","Viewing Distance":"Unknown","Date Submitted":"07/08/2009 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.669327,+-81.513534(17965)&iwloc=A&hl=en\"> mufon case (17965) map </A>","Tags":"City","Log Number":"US-07092009-0001","Region":"Florida"}