{"Object Shape":"Star-like","divs":["Sighting DetailsRight after my wife and I were married, we moved into a large Victorian house that had been converted into two one-bedroom apartments and two efficiency apartments. We had made friends with the couple who lived below us, who had just finished a stint with the stateside Peace Corps called VISTA. The husband had taken a summer job as a ticket collector and guide at the USS North Carolina Battleship Memorial on the Cape Fear River. During the summer months the battleship memorial would present a nightly sound and light show. It was this event for which my friend was hired. On the night in question, my wife and I were visiting the wife of my friend while he was at work. Sometime between 7:00 PM and 8:00 PM, my friend called his wife, ecstatic about a small light he was observing in the sky. He urged us to go outside and look straight up into the sky, because some of the people in the bleachers at the battleship memorial were also observing the UFO. We walked out to the sidewalk on S. Third Street and looked straight up at the zenith. We finally spotted the object moving erratically in the sky, a small white dot that was able to cross the entire sky in a matter of seconds or fly very slowly. It could also come to a dead stop, hover a few seconds, and then shoot off in an entirely different direction, often at a 90 degree angle to its original flight path. I now estimate this object to have been at about 30,000' altitude. We watched this object for about 15-20 minutes. It was and remains one of the most exciting nights of my life."],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/17968.html.txt","/var/www/straped/mufon/org/17968.html"],"Disposition":"Unknown","Date Submitted":"06/30/1966 12:00 UTC","Summary":"small white dot","Log Number":"US-07092009-0004","Tags":"City","City":"Wilmington","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.233186,+-77.94007(17968)&iwloc=A&hl=en\"> mufon case (17968) map </A>","Latitude":"34.233186","Weather Factors":"Unknown","trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around June 30th 1966"],"Region":"North Carolina","Case Number":"17968","Country":"United States","Source":"MUFON","Longitude":"-77.94007","Object Features":"Undisclosed","Date of the Event":"06/30/1966 12:00 UTC"}