{"trends":["There have been 9 other sightings in Gardner","There were no other sightings in Gardner on or around July 4th 2009"],"divs":["Sighting Details On July 4th our on duty fire crew of 4 plus one of the crews wife were on the west side of town to watch the fireworks display. It was approx. 9pm. We all saw a bright light to the north of us heading south. At first we thought it was a plane but quickly realized there was only one light, it was the wrong color and way to large. As it grew closer we could see that it was actually fire and not a light. The object continued at a fairly moderate but steady speed the entire time. The time that it was nearest to us we could see it going above low level clouds and under upper level clouds. Also at this point I got our binoculars from the engine and tried to view the object. Due to a problem with the binoculars and trying to focus on an object that far away without any other objects closer to base my attempts at focus I could only see the object cleary for a second or so. It appeared to be a very large fire ball that mostly covered the object, the upper rear portion of the fire ball had what appeared to be the edge of a square object sticking out of it. There was no noise, vapor trail, or anything else that could be associated with the object. It continued on its trajectory at a seemingly constant speed and altitude untill it could no longer be seen in the southern sky. As the object passed us the fire ball seemed to dim somewhat as if it were hidden partially by the object in it, but some fire was visible until the entire object disappeared from sight. I would estimate the entire duration to be in the 5 minute range. I would appreciate any information you have on this."],"Source":"MUFON","Summary":"Fireball seen flying south over the west edge of Gardner.","Country":"United States","files":["/var/www/straped/mufon/html2text/17975.html.txt","/var/www/straped/mufon/org/17975.html"],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=38.810841,+-94.927187(17975)&iwloc=A&hl=en\"> mufon case (17975) map </A>","Tags":"City","Longitude":"-94.927187","Log Number":"US-07092009-0011","Latitude":"38.810841","City":"Gardner","Object Features":"Other","Case Number":"17975","Weather Factors":"Unknown","Object Shape":"Fireball, Square, Rectagular","Viewing Distance":"101-500 Feet","Date Submitted":"07/04/2009 09:00 UTC","Disposition":"Unknown","Region":"Kansas","Date of the Event":"07/04/2009 09:00 UTC","Sighting Duration":"00:05:00"}