{"Date Submitted":"07/07/2009 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Hoax","Viewing Distance":"Unknown","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.432462,+-79.692675(17972)&iwloc=A&hl=en\"> mufon case (17972) map </A>","Date of the Event":"07/07/2009 12:00 UTC","City":"Murrysville","Source":"MUFON","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around July 7th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsWas home in greatroom which is glass mostly on 3 sides. Watching TV, I glanced to my right and saw really bright, pulsing light, round in shape, through patio door over the valley in front of south side of house. It was like the color of a dimmed down halogen light, but more white when it pulsed brighter. It headed east coming from the west. Totally silent. Had left my good HD camcorder at river house, so I grabbed daughter's cheap Sony Handycam and shot video of it, which would have been longer had it not been for the DVD loading stuff. It seemed to be round with a flat side and rotating--same as our sighting on May 18, 2009 here (pics are already on Mufon.com). That sighting was a much bigger sized thing than this. I estimate this one to be only about 10 feet in diameter--although purely a guess, as the distance and other factors were hard to gauge because of the light. On July 8, 2009 at 4:07 AM another one more orange in color came from WNW sky heading to SE sky into the trees also. Perhaps the color appears darker the further away you are. Our sighting on May 13th was a darker colored orange and was higher up overhead also. I went and got my good HD camcorder and waited in farm field across the street from my house and at 10:00:11 PM another bright one higher up appeared overhead silently and headed one tick above East. It was steady lit until it started descending into the tree line, at which time it began to pulse like the night before. Here are some blown up stills of it--the color perhaps is a blend of all the colors shown together to get the orange or dirty yellow color-- the video is posted to my YouTube channel name: seeingUFOsPA Channel name of nimitta1 has video of the same thing too (by Altoona, PA) The video from the 8th will follow soon. The orange ones seem to be an epidemic lately all over the world--wonder when the powers that be will address their presence?"],"Case Number":"17972","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Sphere","Summary":"Murrysville: Orange/yellow ORB flew W to E low altitude-same kind as 5/18/09 one","Log Number":"US-07092009-0008","Longitude":"-79.692675","files":["/var/www/straped/mufon/html2text/17972.html.txt","/var/www/straped/mufon/more/17972_submitter_file1__orangeufo7-7-09(5).jpg","/var/www/straped/mufon/org/17972.html"],"Latitude":"40.432462","Object Features":"Undisclosed","Country":"United States","Region":"Pennsylvania"}