{"Object Features":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"01:00:00","divs":["Sighting DetailsI looked oustside my window of my 2nd floor bathroom looked up and there it was, it looked like a balloon at first it twinkelled in the sunlight. But it was stationary. It moved slowly from the north to south east 300 feet up and a quarter a mile away over a very urbanized area until it disapeared going east slowley. I was able to get one good photo as it left the only reason a got a good shot was because it twinkelled as I took the shot. I also noticed these strange lines like airline exaust trails, and as it goes through a cloud it would leave an empty space. As I waited and examined the area a few minutes after the ufo left, these lines just appear out of no where with no aircraft of any kind flying in or around it. I dont know if this is of any significants but I thought it was something worth mentioning. I got a few good shots of it too. I also noticed what looked like military jets flying through the same area the ufo was, they were white, flying low maybe 200-300 feet high and made no sound if thats possible. I got a photo of one them too. I know what your thinking maybe the ufo was one of the jets but if you noticed in the first photo of the ufo its not moving."],"Case Number":"17984","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Log Number":"US-07092009-0020","City":"Baldwin","map":"<A HREF = \"http://maps.google.com/maps?q=40.678434,+-73.604883(17984)&iwloc=A&hl=en\"> mufon case (17984) map </A>","Object Shape":"Diamond, Egg, Sphere, Star-like","Region":"New York","Latitude":"40.678434","Longitude":"-73.604883","files":["/var/www/straped/mufon/html2text/17984.html.txt","/var/www/straped/mufon/org/17984.html"],"Date of the Event":"07/05/2009 02:00 UTC","Tags":"City","Source":"MUFON","Country":"United States","Summary":"Star like, small and very high","Date Submitted":"07/05/2009 02:00 UTC","Disposition":"IFO","trends":["There have been 4 other sightings in Baldwin","There were no other sightings in Baldwin on or around July 5th 2009","This sighting has never been favorited.",""]}