{"Latitude":"40.633242","Longitude":"-75.366558","Date Submitted":"07/05/2009 12:00 UTC","Region":"Pennsylvania","Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.633242,+-75.366558(17985)&iwloc=A&hl=en\"> mufon case (17985) map </A>","divs":["Sighting Details On the evening of July 5th I was sleeping in my bedroom when I woke up to a humming sound. At first the sound was a straight hum, but then it was followed by short beeps. The pattern would be: hum-beep-beep-beep, hum-beep-beep-beep. At first I though it was my burglar alarm. I got out of bed to check my control panel only to find out that the noise was not coming from that location. I then walked back into my bedroom and checked my ipod. I then sat on my bed and remember thinking how bright the moon beam was coming through my window. As I turned to look out my window I saw a huge round light just hovering outside my window in the sky. The light was almost blinding, it was so bright. The beam of light that came across my bedroom was almost pure white light, and very bright.When I walked over to my window I was able to ascertain that the noise was definitely coming from this round light source. I wasn't startled or scared. After a few minutes I crawled back into bed. The noise then stopped and the light was gone. This may sound very bizarre, but as I was drifting off to sleep I heard a voice say \"we have been watching you. As a matter of fact we have pictures of inside your body\". It wasn't until the next evening that my girlfriend told me about hearing people on the music station CAT County talking about a UFO sighting. This is whe I started to be come alarmed at what I had witnessed."],"Object Features":"None","Case Number":"17985","Weather Factors":"Unknown","Object Flight Path":"Stationary","Source":"MUFON","trends":["There have been 21 other sightings in Bethlehem","There were 2 other sightings in Bethlehem on or around July 5th 2009"],"Object Shape":"Circle","Summary":"humming noise very bright beam of light shining through bedroom window voices","Log Number":"US-07092009-0021","Tags":"City","Sighting Duration":"00:30:00","Date of the Event":"07/05/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/17985.html.txt","/var/www/straped/mufon/org/17985.html"],"Viewing Distance":"21-100 Feet","City":"Bethlehem"}