{"Country":"United States","Longitude":"-80.134108","Region":"Florida","trends":["There has been one other sighting in Greenacres","There were no other sightings in Greenacres on or around June 7th 1989"],"Date Submitted":"06/07/1989 09:00 UTC","Object Shape":"Circle, Flash, Sphere","Case Number":"17992","Viewing Distance":"501 Feet - 1 Mile, Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/17992.html.txt","/var/www/straped/mufon/org/17992.html"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=26.631526,+-80.134108(17992)&iwloc=A&hl=en\"> mufon case (17992) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","Weather Factors":"Unknown","Summary":"Green orb near Palm Beach International airport (This is actullay 2 reports)","Date of the Event":"06/07/1989 09:00 UTC","Tags":"City","Source":"MUFON","divs":["Sighting DetailsDue to the recent events in Boca Raton, this is the details of what I saw about 20 years ago near the same area ('bout 20 miles away)... But there's more after the green orb story. About 18-20 years ago, I seen something similar by the PBI airport. My girlfreind at the time and I were visiting a freind that lived in them houses behind the landing strip bar. We were walking around outside and saw exactly what these folks (In Boca) say happened, except it didn't stay for 2 hours. It was only in the sky for about 5 minutes when we watched it. It was a green orb, it hovered for a minute or so and then it zig zagged across the sky and shot away. No kiddin'. We told our much older freinds and they just laughed it off. They told us it could have been a deflating balloon or something. This isn't the only time strange things like that have occured here in PBC, I've even tried to get UFO specialists to come and investigate, but nothing ever come of it. If this is a hoax, it has been going on for a very long time. And it usually starts right around and during hurricane season. There was no sound smell or reflection, after awhile I told myself it could have been pockets of jet fuel. (gases) During hurricane Andrew, I had another weird few encounters. I was staying in a quanson hut for protection against the hurricane in Palm Beach Gardens FLA, and I heard and saw weird things during the storm. So much happened that night i'll just give you the skinny. )I heard things outside my door walking around )I saw something looking in through the metal door hole. )I found a scorched symbol on the inside of the quanson hut, I had never seen before, it was two rounded corner triangles inside one another that were inside two circles, and between the triangles and circles there were 2 lines of several lines that looked like some kind of writing. )I also found some strange rocks... Probably meteorites or something,(Same property) but they looked like a rocks and were hard. Until you put a flame to it, then it crumbled like dust where the heat was applied. It was kind of silvery inside. Anyways, I told my freinds about it, they asked if I had weird dreams, and I did, so they told me to contact someone. And I did. But I forgot who, some world renowned ufo investigator at the time, and we corresponded up to the point where he asked. \"Are you sure it was a UFO?\" And well, since I wasn't really sure, I had to say no and go one about my business without ever really understanding any of it all. Then recently when I saw them kids in the news in Boca, I was speculative, but when i saw what they described and what it did, I was stunned. Because over time I was sure what I saw years ago was a fluke of nature or something, that is until this happened. If I didn't have a witness with me the night I saw the green orb, we wouldn't be talking right now, because she saw it too. We have long departed ways and I have no clue where she's at, but if she see's this story, she might say something. I think I reported this to another site, along with other strange things, I'll see if I can hunt down what I put up there... I'm pretty sure it was a little more detailed than what this report has in it."],"City":"Greenacres","Latitude":"26.631526","Log Number":"US-07102009-0002"}