{"Source":"MUFON","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/17997.html.txt","/var/www/straped/mufon/org/17997.html"],"Sighting Duration":"Undisclosed","Object Flight Path":"Other","Longitude":"-82.420154","Object Shape":"Other","Log Number":"US-07102009-0007","Viewing Distance":"101-500 Feet","Tags":"City","Country":"United States","Case Number":"17997","Disposition":"Unknown","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=39.896454,+-82.420154(17997)&iwloc=A&hl=en\"> mufon case (17997) map </A>","trends":["There have been 3 other sightings in Thornville","There were no other sightings in Thornville on or around April 12th 2009"],"divs":["sighting detailsnot certain if this is the proer venue to report this-my apologies if not. i was up, unable to sleep, around 430am on june 12, 2009, and was up and on the computer. we live on a wooded 4.5 acre lot in thornville, oh. my neighbors yard is a cleared lawn that transitions into woods like ours, and as i looked over to their yard, out my office window (it was very dark near my house, but their porch light illuminated their lawn very well)i saw a \"human-like\" invisible creature appear out of nowhere in the middle of the lawn and walk very rapidly (faster than a human could walk-it looked as if someone was rolling a tape in fast-motion)for about 15-20 steps, maybe a distance of 30 feet, then it just disappearred. i could see through the being as it was invisible, however, i could definately tell something was there. the best way i can describe it is that it was like the alien in the \"predator\" movie w\\arnold schwartzenegger(sp?)when it was invisible in the jungle. my first thought was-are my eyes playing tricks on me? so i blinked and moved my head side-to-side by the window wondering if the window screen had caused me to see something, trying to recreate the sighting to no avail. being that all the windows in the house were open and it was very dark right next to my house-i got very spooked and ran to my room and jumped in bed next to my husband."],"Region":"Ohio","Date of the Event":"04/12/2009 04:40 UTC","Date Submitted":"04/12/2009 04:40 UTC","City":"Thornville","Summary":"invisible (like in predator movie) creature sighting","Latitude":"39.896454"}