{"files":["/var/www/straped/mufon/html2text/17991.html.txt","/var/www/straped/mufon/org/17991.html"],"Weather Factors":"None","Longitude":"-94.616319","Object Shape":"Unknown","Disposition":"Unknown","trends":["There have been no other sightings in De Kalb","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.508726,+-94.616319(17991)&iwloc=A&hl=en\"> mufon case (17991) map </A>","Sighting Duration":"00:01:00","Log Number":"US-07102009-0001","Date of the Event":"07/07/2009 09:15 UTC","Case Number":"17991","Viewing Distance":"Unknown","City":"De Kalb","Latitude":"33.508726","Tags":"City","Country":"United States","Date Submitted":"07/07/2009 09:15 UTC","Summary":"bright yellish white light by aircraft second light show up .","Object Features":"Unknown","Object Flight Path":"Straight-line path","Region":"Texas","Source":"MUFON","divs":["Sighting Details I was looking sw and setting in a lawn chair smoking and looking at the stars when I saw a jet with red, green, and strobe lights flying ne,wedo not have a security light so it is pretty dark at night. I have reported a light before,Coming from nw to se. I have also seen another light earlier, about april or may it came from the wnw from between the last two stars of the handle of the big dipper going in a straight line to the ssw. I thoght it was a satellite, then it went behind the milky way which was straight over my head and never come out. I was looking out my back door. The light I saw on the 7th was different. when I looked away from the plane and looked back and noticed a real bright yellowish white light flying to the ne also but, the light was a little to the south and behind the plane to the sw. I watched for a few minutes and thought the plane and light were about the same altitude then noticed the light go behind some clouds I did not see the plane go behind the clouds. when I turn around to look to the ne I noticed another light even higher and it appeared to be smaller and a different color futher to the se. I did not see that light very long by the time I noticed it, the plane and bright light were getting futher away. I did not see what direction the little light came from, but all three of them were going in what seemed to be a straight lines to the ne. After they flew futher away to the"]}