{"Object Flight Path":"Path with directional change,Path then hovering","Country":"United States","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=29.215685,+-81.013813(17996)&iwloc=A&hl=en\"> mufon case (17996) map </A>","Case Number":"17996","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Source":"MUFON","Date Submitted":"11/07/2008 09:00 UTC","Object Shape":"Circle, Fireball","Tags":"City","Date of the Event":"11/07/2008 09:00 UTC","Summary":"Saw glowing balls hovering at 5,000 feet, then splitting into 5 seperate balls.","Latitude":"29.215685","files":["/var/www/straped/mufon/html2text/17996.html.txt","/var/www/straped/mufon/org/17996.html"],"Object Features":"Undisclosed","Log Number":"US-07102009-0006","City":"Daytona Beach","Weather Factors":"None","Longitude":"-81.013813","Disposition":"Insufficient Data","trends":["There have been 13 other sightings in Daytona Beach","There were no other sightings in Daytona Beach on or around November 7th 2008"],"divs":["Sighting DetailsIt was the day we left Florida, November 7, 2008. I got off work at about 5:30pm, and the movers had already come and gone with our stuff. Once I did, we jumped in the car and literally took off immediately, eager to hit the open road. We plowed through the West Palm Beach traffic, passed Jupiter and were in the clear out of Palm Beach county, heading north on I-95. It was about 7:30 by now and dusk was strongly enveloping the east coast. As we neared the Daytona Beach exit, it was close to 9:00pm. All traces of daylight were gone, and it was a clear night of about 72 degrees. I happened to glance to my right, in the direction of the ocean, when I noticed what appeared at first to be a shooting star. I was going to say something to my wife, but figured by the time I said anything it would be gone. The seconds ticked by as I watched in amazement. 2, 3, 4, 5, 6 seconds.... by now I yelled to my wife \"Look at that shooting star!\" She said she saw it and we both watched, me with both eyes, my wife with one on the road and one on the sky. I never took my eyes off the strange burning light as it seared it's way southwards, directly over the ocean. Then the most amazing thing happened -- it SLOWED DOWN and eventually stopped, hovering directly over the ocean right between Daytona and Cape Canaveral. It was at least 30 miles or more out over the Atlantic by my estimation. My wife saw this phenomena as well, and we both yelled \"WHOA!\" at the same time. By now we thought maybe it was a comet, but then something even MORE amazing happened: the fireball started to head down towards the earth! Jen was starting to swerve a little, and looked away to correct the car in the right lane. We watched as the ball of light then SPLIT into 5 or 6 separate pieces! Each piece started to go in it's own direction, all headed more or less towards Earth. Next, all the separate fireballs paused and hung suspended in mid-air, maybe as low as 5,000 feet above the Earth. I judge their height based on the fact that there was a commercial airliner flying high overhead at the time, and if it was at 30,000 feet or so, I placed it about 6 times higher than the fireballs. We were very excited! This seemed like something that could not be explained typically. I have a strong scientific and skeptical background, and this was something that could easily be dismissed. I've seen meteors, comets, space stations with telescopes, thousands of planes and helicopters flying at night, balloons, etc., and none of them moved liked this or glowed with such ferocious intensity. And we really got excited when we saw it split into 5 or 6 pieces. It was an exhilarating experience and one we are glad to have shared. I just wish I had photos or videos of the event, or that someone else on Florida's east coast had seen the same thing. If you know of any video of this event, please share so I can compare it with what we also saw. We almost pulled off the highway to investigate, but had gotten such a late start on the road trip we decided to press on, noting the time and location so I could look it up online later. I watched the floating 5 balls until we were totally out of sight. To my knowledge they never moved. Later, my extensive internet research revealed nothing regarding the event."]}