{"Tags":"City","Object Features":"Undisclosed","Latitude":"47.775216","Log Number":"US-07102009-0003","Sighting Duration":"Undisclosed","Case Number":"17993","Summary":"Triangle Formation of 5 or 6 solid lights like a dimly lit star flew from the NorthEast to the SouthWest","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Other","trends":["There have been 5 other sightings in Hayden","There were no other sightings in Hayden on or around July 9th 2009","This sighting has never been favorited.",""],"Date Submitted":"07/09/2009 11:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.775216,+-116.777132(17993)&iwloc=A&hl=en\"> mufon case (17993) map </A>","Country":"United States","Region":"Idaho","Object Flight Path":"Straight-line path","Longitude":"-116.777132","City":"Hayden","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/17993.html.txt","/var/www/straped/mufon/org/17993.html"],"Date of the Event":"07/09/2009 11:15 UTC","divs":["Sighting DetailsStanding outside watching the sky when from the northeast I caught site of a formation of lights, about as bright as a dim star, I initially thought was a triangle type UFO but noticed that the lights were not in a perfect equilateral triangle and there were 4 of them. They were extremely high altitude, I'm guessing higher than a jet liner and moved smoothly without breaking formation in a straight path maybe 2 or 3 times faster than a commercial jet. The lights never broke formation and I lost them when the disappeared over the tree in my back yard. I actually jumped the fence and ran down the road to see if I could get a better view, but I lost them. I truly can not tell if these were multiple objects at a far distance or one large single craft closer up. The sky was clear with a haze on the horizon. When I first caught site of these they were almost directly over my head, I would say at about an 80 to 85 degree angle. I only saw them for maybe 5 or 6 seconds. The color was very similar to a dimly lit dull red star. There was absolutely no sound but as soon as I lost it over the trees a commercial jet came from the west flying to the east. I'm curious if the pilots saw anything. I drew a picture of their arrangement and approximate color."]}