{"Case Number":"17999","Country":"United States","City":"East Haddam","Source":"MUFON","Region":"Connecticut","Summary":"Bright orange globe seen over the Connecticut River down in leafless trees below the horizon","files":["/var/www/straped/mufon/html2text/17999.html.txt","/var/www/straped/mufon/org/17999.html"],"Log Number":"US-07102009-0009","Object Shape":"Circle","Tags":"City","Longitude":"-72.461401","trends":["There have been no other sightings in East Haddam","This sighting has never been favorited."],"Object Flight Path":"Other","Latitude":"41.453175","Date of the Event":"04/11/2009 10:30 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.453175,+-72.461401(17999)&iwloc=A&hl=en\"> mufon case (17999) map </A>","divs":["Sighting DetailsA friend and I were returning from a wedding at the Gilston House in East Haddam, Ct leaving at about 10:30 on the evening of April 11th, 2009. It was cold and overcast because it had been raining all day. We were driving south on route 154 between exits 7 and 9 of route 9 which runs parallel to 154. We noticed a large, bright, orange colored globe over the Connecticut River to our left down in the trees below the horizon. It was pumpkin orange, a perfect verticle circle, thick, paper like in texture with solidarity and sharply defined edges. It had a uniform luminescent hue to it. It was not the moon. We continued to observe it on our left for about 10 minutes as we followed the road turning right then up a hill, down a hill and up to where the road leveled off for quite a ways. The globe now seemed to be moving west-northwest on top of the hill, thru the trees, towards us. I thought about stopping and taking a picture several times with my cell phone but didn't because there was an ominous feeling to it. We both felt that. I don't exactly remember loosing sight of it. We just seemed to arrive at the intersection of 154 and I-95, 30 miles later. As we turned west on I-95, the sky was clear and the moon was further off to the west, yellowish white and high in the sky. We talked about what we experienced. The solidarity of the verticle circle, it's texture, sharp edge, illuminescent quality to it, the total lack of any sound and the ominous tone to the whole experience. How slowly and yet how quickly it moved thru the trees. And I mean THRU the trees. When we arrived in Clinton, Ct a little after 12:30, the yellow-white moon was in it's normal place almost overhead and we were glad the day was coming to an end. But it struck me odd that it took 2 hours to cover a 1 hour drive. We have no idea what we saw but checking the Mufon site the following week I saw reports of a simular object being seem in Westerly, R.I., Bristol, CT and Litchfield, CT. all aparently in the same evening. Could this be the 4th sighting of the same object on the same day? Going in the same direction for over 100 miles? All this tells me something unusual occurred that night. What ever it was was definitely not the moon. But what was it? It bothers me. So that is why I'm reporting it."],"Object Features":"None","Date Submitted":"04/11/2009 10:30 UTC","Viewing Distance":"101-500 Feet","Disposition":"IFO","Sighting Duration":"00:10:00"}