{"map":"<A HREF = \"http://maps.google.com/maps?q=47.026859,+28.841551(18003)&iwloc=A&hl=en\"> mufon case (18003) map </A>","Case Number":"18003","Date of the Event":"07/10/2009 08:40 UTC","Weather Factors":"None","Region":"","Log Number":"MD-07102009-0013","Object Features":"Undisclosed","Object Shape":"Fireball, Sphere, Star-like","Viewing Distance":"Unknown","divs":["Sighting DetailsWas standing outside in my garden as usual with my mother. Suddenly she pointed at the sky and asked me what the bright red orange thing up on the horizon was. It was emitting a radiating beam of light like a star or some similar object, hovering above buildings in the distance. It was like a bright orange fireball. It started moving from side to side above the buildings. It was close to the city's television tower and a big chimney from a coal-powered heat-providing station, so that the first thing my mother asked was whether it was some kind of tower identifying light. It moved from the left side to the right, stopping to hover slightly above each building, then continuing its motion. After it had gone to the right side it started moving backwards, then stopped and made a slight upward movement and then started moving extremely slowly. I ran around the house looking for a camera, and when i came back it was gone. The whole sighting lasted for no more than five minutes, although i have no idea for how long it was actually hovering there. One rather strange thing that i might add is that immediately before i actually saw the UFO i felt an impulse to go downstairs to talk with my mother. It might be completely unconnected, but it just seems strange that one minute i was engaged in one kind of task and the next i felt i HAD to go into our garden. I usually feel really scared when i see something like that out of the blue in the sky, but when i saw the light i actually felt somehow relieved, and when i started writing this i had a feeling of real ease and happiness. These might be just my own emotions unconnected with UFO activity, but then again..."],"Date Submitted":"07/10/2009 08:40 UTC","Country":"Moldova","Summary":"Bright red orange gleaming ball","files":["/var/www/straped/mufon/html2text/18003.html.txt","/var/www/straped/mufon/org/18003.html"],"Object Flight Path":"Undisclosed","City":"Chisinau","Source":"MUFON","Disposition":"Unresolved","trends":["There have been no other sightings in Chisinau","This sighting has never been favorited."],"Tags":"City","Latitude":"47.026859","Sighting Duration":"Undisclosed","Longitude":"28.841551"}