{"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=40.437542,+-79.687705(18006)&iwloc=A&hl=en\"> mufon case (18006) map </A>","Country":"United States","Date Submitted":"07/09/2009 10:23 UTC","Latitude":"40.437542","files":["/var/www/straped/mufon/html2text/18006.html.txt","/var/www/straped/mufon/more/18006_submitter_file1__20090709222301(1).jpg","/var/www/straped/mufon/org/18006.html"],"Date of the Event":"07/09/2009 10:23 UTC","Summary":"Murrysville: WEIRD TRIANGLE UFO-looked like Orange orb first!","Disposition":"Unknown","City":"Murrysville","Source":"MUFON","divs":["sighting detailsmurrysville, pa: july 9, 2009 two sightings: 1. 10:23 p.m. - orange orb traveling from w to e in sky approx. at lower plane type altitude. moved fairly fast, but did slow down, then speed up again. appeared to streak at times. constant glow, no pulsating like the july 7th sighting. this is the 3rd nightly sighting in a row! thought a plane behind it was following it at first--similar altitude, but it continued on it's more southernly path. another plane passed it too. not the iss or another satellite, we checked n2yo.com to see what was in the sky. hd video footage of it with other sighting videos posted to youtube on my channel: seeingufospa uploading 3 blown up stills from video here(if it works). 2. 11:09 p.m. - \"dot\" high altitude, white\\yellow in color, traveling w to e (or nw to ne to our position). daughter shined laser at it and it responded each time by glowing bright! didn't shoot & kill us, so i assume it because they're smart enough to determine that it's just a light, not a weapon. very exciting to get a response!!! shot video, but was too high altitude to show up on film. we saw another high altitude one after, but the laser had no effect--same path almost, very small dot."],"Object Shape":"Sphere, Star-like","Region":"Pennsylvania","Weather Factors":"Unknown","Longitude":"-79.687705","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-07102009-0016","Case Number":"18006","Object Flight Path":"Straight-line path","trends":["There have been 31 other sightings in Murrysville","There were 2 other sightings in Murrysville on or around July 9th 2009","This sighting has never been favorited.",""]}