{"divs":["sighting detailshello.first of all,i am an ordinary mother of two and wife in my early 30's who has taken an amazing photo that i'll cherish forever...my nephew and neice were having their graduation party at the pavillion of the lake where i took the photo. this lake(lake granger-willis creek park) is located about 20 miles south\\southeast from my current physical address. my son and 3 other children had been begging me all day to take them down to the water so they could swim. i finally took them all down to the water when it became cooler that evening. just me, my son and the three others went down to the water, which was about 50 yards from the pavillion, down the bank that leads to a tiny(non-swimming) beach area. as they were playing in the water i decided to take a couple of pictures of them, while just sitting there in my lawn chair.the kids were about 10-12 feet out in the water from the bank. it was still pretty sunny and hot and the lake was very calm. in the picture you can see the kids are playing with and around a lot of logs and sticks, due to the low lake levels because of the hot weather and drought here in texas.i only took two pictures of the kids with my cell phone camera. i never heard nor saw anything while taking the pictures and as you can tell from the picture, the kids don't even notice what's behind them ! later that night i was looking through the pictures i had taken throughout the day and realized i caught an unidentified object over the water of the lake !!! i've held the picture for over a month now because i had no idea who to contact and who i could trust. i e-mailed the picture from my phone to my computer and saved it in my hard drive (personal copywright). as i zoomed the picture of the disk to a very large size on my computer, i noticed the disk seems to have large green and red lights, which are very bright to the right side of the disk.... please contact me asap for any further details you may have or need ...thanks so much for taking your time to evaluate my photo!!! delia"],"Tags":"City","Object Flight Path":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","Source":"MUFON","Latitude":"30.723653","Summary":"LARGE UFO CAUGHT IN PHOTO OVER LAKE IN TEXAS !!!","Country":"United States","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.723653,+-97.43813(18007)&iwloc=A&hl=en\"> mufon case (18007) map </A>","Case Number":"18007","files":["/var/www/straped/mufon/html2text/18007.html.txt","/var/www/straped/mufon/more/18007_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/18007.html"],"trends":["There have been 3 other sightings in Granger","There were no other sightings in Granger on or around June 6th 2009","This sighting has never been favorited.",""],"Log Number":"US-07102009-0017","Object Features":"Unknown","Viewing Distance":"Unknown","Disposition":"IFO","City":"Granger","Object Shape":"Disc","Longitude":"-97.43813","Date Submitted":"06/06/2009 07:00 UTC","Date of the Event":"06/06/2009 07:00 UTC"}