{"files":["/var/www/straped/mufon/html2text/18005.html.txt","/var/www/straped/mufon/org/18005.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.798255,+-76.550147(18005)&iwloc=A&hl=en\"> mufon case (18005) map </A>","Date of the Event":"11/22/1975 01:00 UTC","Sighting Duration":"00:05:10","divs":["Sighting Detailsi was living in a small trailor with my husband and two small children. my oldest son who was three at the time was in bed with me .i always kept the bathroom light on and left the door open therefore the light would shine in at the foot of my bed and you could see in the room very well. on this night i couldnt fall asleep and was laying on my back.my son was sleeping beside me it was about 12:00 at night. i happened to look down to the foot of my bed and thought i was seeing things or my eyes were playing tricks on me.there was a small reptile like being with a very large head and hugh roundeyes staring at me and it looked very agressive. the eyes were not almond shaped but large and round. they looked like the eyes of an animal when light shines on them at night.i felt as though i was being held down against my will i could not move,speak or scream. i was terrified. i could not even call out to my husband it felt as though the force of gravity was holding me down on the bed. this thing moved in a strange way not as a human but like when the picture changes on tv.extremely fast.it went from the foot of the bed to the side of the bed in about 2 seconds flat. finially i broke away from the bed and ran out of the room screaming for my husband there was no way that thing could of gotten out of the room yet it was gone.this incident happened to me back in 1975 and iv told this story many times over the years and to this day i still think about it and wonder what it was. however i am not obessed with this stuff. just thought id tell my story and im certain there are many more like mine out there thanks bonnie wright"],"Date Submitted":"11/22/1975 01:00 UTC","Object Flight Path":"Undisclosed","Case Number":"18005","Tags":"City","Country":"United States","Longitude":"-76.550147","Region":"Pennsylvania","Object Shape":"Unknown","Disposition":"Hoax","Summary":"Alien","trends":["There have been 9 other sightings in Shamokin","There were no other sightings in Shamokin on or around November 22nd 1975"],"Viewing Distance":"Unknown","Log Number":"US-07102009-0015","Weather Factors":"Unknown","Latitude":"40.798255","Object Features":"Undisclosed","Source":"MUFON","City":"Shamokin"}