{"Region":"Florida","Tags":"City","Date Submitted":"07/07/2009 12:00 UTC","Object Flight Path":"Undisclosed","Longitude":"-80.076768","trends":["There have been 24 other sightings in Boca Raton","There was one other sighting in Boca Raton on or around July 7th 2009","This sighting has never been favorited.",""],"Date of the Event":"07/07/2009 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Oval, Teardrop, Unknown","Weather Factors":"Lightning, Light","divs":["Sighting DetailsOn July the 7th 2009. I experienced something that will haunt and excite me for the rest of my life. I was not the only one to sse what I saw and I definitely won't be the last. But I believe my side of the story is unique because I was one woman standing alone among men chasing something we till this cannot forget or explain. At 9 p.m. on July 7 2009 I sat in the living room of my boyfriend of over one year enjoying a movie, when he recieved a call from a close childhood. When he when outside to take the call he was urged by his friend to look up in the sky. There he saw something extrodinary a green orb-like object hovering in air a mere hundreds of feet up. He ran inside and coaxed me outside. I looked up and saw something I never imagined I would've seen my whole life. We watched the object in shock. Then we realized in was moving. We quickly gabbed a digital camera and jumped in my boyfriend small vw bug. We drove to his friend's house anxiously. When we got out of the car the object was still in our site. We urged his two friends to get in the car but they didn't want to lose of it. At that time we hopped back. Though I was very uneasy and unassure of the situation my boyfriend insisted we try to get as close to it as possible. We drove with the object in sight and stopped when we felt we were near. We got of the car it was at this moment we realized the green object was right above us. For once I am not going to put on the tough girl front I try to in life and tell the truth. There had been few occasions up to this point in which I had ever been so frightened. I grew more nervous by the second. I was so scared it was difficult for me to even look at the object. I only knew two things at this point this thing was definitely real and it was like nothing I had ever seen before in my life. I got in the car quickly and begged my boyfriend that we leave. After a few minutes he got in the car an headed back to his friends house. The four of us me, my boyfriend, and his friends got in the car and returned to the street where we had been directly under the object. We all jumped out of the car barely before it stopped moving. And then we saw we weren't the only ones. There in the middle of the street was a middle aged man. He had pulled his car over with his two small children and his wife. He was looking up at he object in pure amazement and confusion. It was at this time a woman and her children imerged fom the house we were parked in front. We later found out that she had heard her dogs baring and went outside to see what was happening. This is when everything started to happen. All at once we were all on the phone calling every close neighbor we could. Soon of few of our friends began to arrive. Most of them had excuses \"Its a plane or a helicopter.\" They were quickly silenced when the object began to move unlike any human-made machine we had ever seen before. It zig zagged erratically up and down, side to side at a rapid speed. I was completely amazed,excited and to be perfectly frank extremely scared. I began taking pictures. I took over a hundred pictures that night. And a young man who was there caught the strange object on video. But none of the photage could even slightly conpare to seing the object hovering in mid air. The people and families that had stopped to see what was going on grew tired and began to leave. We asked everyone there if they had a telescope. Only on young man did but he lived far and refuse to go get it from his home. So we tried our best to keep a steady view of the object through a pair of binoculars. It was difficult since at this point my hands were a bit shaky, from a mixture of excitement in fear. But still we all could make out the same thing. A rice shaped, oval like , glowing green object hovering in the sky. At this point there were only few of us left three young men, and myself. Four of the witnesses had left to retrieve the telescope. That when the object began to move again. Not being to let go of what we were seeing we all jumped in the car and followed the object over to the next street. Thats when another two cars stopped near us. five young men emerged from the cars and stared at the object amazed and skeptical. We shared our story with them and thats when the four young men arrived with the telescope. We tried but could not get the object into focus. It was at this moment that a police officer arrived he emerged from his car. Here we were a dozen teenage boys and one girl camped outside a perfect strangers house with a telescope. You can imagine we assumed the worse. But we couldn't accept being force to leave. So though we knew he wouldn't believe us we pointed out the object to the officer. And to the suprise amd relief of everyone he saw it and he believed. This officer then stared in wonderment and looked through our pair of binoculars. Searching his mind for any excuse he could feed us. But in the end he couldn't deny hat he had no explanation for what we all had seen. He quickly called in the report and left. A little after 12 a.m we were tired, hungry , and the object was nearly out of sight. So we all reluctantly decided to go home. I may never know exactly what I saw that night. But I know I will never forget it."],"Summary":"a long oval shaped, upright green object moving eractically over Boca Raton.","files":["/var/www/straped/mufon/html2text/18010.html.txt","/var/www/straped/mufon/more/18010_submitter_file1__DSCF0107.JPG","/var/www/straped/mufon/org/18010.html"],"Latitude":"26.360888","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=26.360888,+-80.076768(18010)&iwloc=A&hl=en\"> mufon case (18010) map </A>","City":"Boca Raton","Disposition":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-07112009-0002","Case Number":"18010"}