{"divs":["Sighting DetailsThis event happened in the late summer, 1965. Was outside of LaPorte, Indiana, near the Elks Country Club on Johnson Rd. I would have been 11 years old. It was late in the day and I was walking through the golf course about 2 blocks from home. I was on the hill near the parking lot when, looking down towards Johnson Road I saw something coming over the trees; it was maybe 30-40 feet above the tree tops. It was basically triangular in shape but rounded off at the corners. I saw no lights. The craft seemed to be a dark grey color. It was huge, moved very slowly and made no sound. As it came towards me I could see that the bottom wasn't smooth but had lines or something running across it. I remember as it came closer realizing it was going to go right over me; I was very scared and pushed myself into a large bush on the hill where I continued to watch it. As it got almost above me I could feel a deep vibration and hear a low hum. I hid my head after that, then, when I no longer felt the vibration I looked up and it was gone. I ran home and asked my mother, who was having coffee with the neighbor if she had seen anything in the sky. She said no but that it had gotten cloudy for a bit."],"Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=41.617757,+-86.7118(18017)&iwloc=A&hl=en\"> mufon case (18017) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Latitude":"41.617757","Summary":"Triangular UFO seen near LaPorte, Indiana; 1965","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface","Disposition":"Unknown","Tags":"City","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around September 1st 1965"],"Date of the Event":"09/01/1965 12:00 UTC","Log Number":"US-07112009-0009","Object Shape":"Triangle","Region":"Indiana","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/18017.html.txt","/var/www/straped/mufon/org/18017.html"],"Longitude":"-86.7118","Source":"MUFON","Date Submitted":"09/01/1965 12:00 UTC","Case Number":"18017","City":"La Porte"}