{"Log Number":"US-07112009-0006","Sighting Duration":"Undisclosed","Longitude":"-105.033075","Date of the Event":"07/03/2009 11:20 UTC","City":"Westminster","Summary":"Round, White/metallic object with circular thermal ball around it.","Latitude":"39.839913","Date Submitted":"07/03/2009 11:20 UTC","Region":"Colorado","divs":["Sighting DetailsI was lounging in my pool and happen to be looking up at the sky. I noticed what I first thought was a helium balloon about \"bird height\". I took off my sunglasses to get a better look and noticed that it was actually \"hovering\" back and forth. It also appeared metallic and white. It glinted off the reflection of the sun, as if it were rotating. I also noticed that there was an outer ball surrounding it. The best way to describe the surrounding ball is, wavy-like the heat from the sun rising off of a hood of a car in the Summer. I yelled for my oldest child to go inside and grab my camera so I could film it. He brought out my camera while I kept my eye on it. As I started filming it, it moved (floated) higher near some clouds. I also noticed that there seemed to be a \"glint\" of orange or red a few times. I knew it wasn't a balloon, because of the way it moved and how high in the sky it went in a short amount of time. It then went into the clouds and seemed to go out of sight for good. I have seen balloons flying over before and we also have a lot of planes and helicopters (due to a small airport being nearby)--but this was not like any of those. This hovered for about ten minutes, then rose up much higher in the sky till it disappeared. I have no idea what it was, but it was unlike anything I've seen during a daytime sighting."],"Weather Factors":"None","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.839913,+-105.033075(18014)&iwloc=A&hl=en\"> mufon case (18014) map </A>","Object Shape":"Circle","Disposition":"Unresolved","trends":["There have been 30 other sightings in Westminster","There were no other sightings in Westminster on or around July 3rd 2009","This sighting has never been favorited.",""],"Object Flight Path":"Stationary,Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/18014.html.txt","/var/www/straped/mufon/org/18014.html"],"Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"18014","Object Features":"Other"}