{"Latitude":"34.061934","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 10th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was swimming with my children, looked up and noticed. I thought it was a cluster of helicopters as is common in Hollywood around celebrity events. The objects were not moving, however, and made no sound. They seemed to be very high in the atmosphere. I was excited, gathered up my children and ran inside for the camera. I tried to take pictures but it was very difficult to photograph the sky. There was such little contrast marking the objects. A friend came over with her daughter to swim. I pointed them out to her and she saw them. She was excited and tried to call her husband to show him. He was not able to see them from his part of town. We watch them just hovering, not moving, not making sound. We had to watch the children swimming so at one point, when we looked away and looked back the objects had disappeared. They were difficult to focus on because of the glare of the sun. They seemed to be lit by the sun, not luminous themselves, like a star. They seemed to be spherical in shape and reflective. In person, their seemed to be 10-12 objects. As I reviewed the photo, I could only count 5. As I said, the photo was very poor. I will include an original photo, an enhanced, and an enhanced and cropped so you can find them. You can then go back to the original photo and do enhancements to reveal them for yourself."],"Case Number":"18016","Date of the Event":"07/10/2009 04:50 UTC","Summary":"Constellation of reflective spheres in formation without sound or movement","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Object Features":"Unknown","Object Shape":"Sphere, Other","files":["/var/www/straped/mufon/html2text/18016.html.txt","/var/www/straped/mufon/more/18016_submitter_file1__IMGP4879.JPG","/var/www/straped/mufon/more/18016_submitter_file2__IMGP4879edit.JPG","/var/www/straped/mufon/more/18016_submitter_file3__IMGP4879editcrop.JPG","/var/www/straped/mufon/org/18016.html"],"Tags":"City","Region":"California","Viewing Distance":"Over One Mile","Date Submitted":"07/10/2009 04:50 UTC","Log Number":"US-07112009-0008","Disposition":"Unknown","City":"Los Angeles","Longitude":"-118.240755","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.061934,+-118.240755(18016)&iwloc=A&hl=en\"> mufon case (18016) map </A>"}