{"Date Submitted":"09/30/1983 04:15 UTC","Date of the Event":"09/30/1983 04:15 UTC","Log Number":"US-07112009-0011","Weather Factors":"None","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=41.271504,+-95.859613(18019)&iwloc=A&hl=en\"> mufon case (18019) map </A>","Latitude":"41.271504","Viewing Distance":"101-500 Feet","City":"Council Bluffs","Longitude":"-95.859613","Source":"MUFON","Object Flight Path":"Stationary","Object Shape":"Disc","trends":["There have been 11 other sightings in Council Bluffs","There were no other sightings in Council Bluffs on or around September 30th 1983","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Object Features":"Window(s)","Summary":"Object hovering over house. Light from windows on rim illuminating house. Didn't move. Another witness observed.","files":["/var/www/straped/mufon/html2text/18019.html.txt","/var/www/straped/mufon/more/18019_submitter_file1__Sorensenmap.jpg","/var/www/straped/mufon/more/18019_submitter_file2__Sorensendirectionaldata.jpg","/var/www/straped/mufon/more/18019_submitter_file3__SorensenReportForm4.jpg","/var/www/straped/mufon/more/18019_submitter_file4__SorensenReportForm1.jpg","/var/www/straped/mufon/more/18019_submitter_file5__SorensenReportForm2.jpg","/var/www/straped/mufon/org/18019.html"],"divs":["sighting detailspaul hicks field investigator 10901 spirit lake iowa. i am entering an old report. form completed 2\\21\\1987. i worked with jean sorensen at bluffs run dog track. jean was on her way to work at the iowa school for the deaf in council bluffs, iowa. it was still dark. she noticed the object because it was so bright. at first she thought it must be something from offutt afb. she said it was \"so real\". it was hovering not directly above the droge house and it illuminated the house. (this house was built in 1936 and mrs droge murdered her husband in this house.) she stopped her car and looked at it for about 5 minutes. the object never moved. there were lighted windows or windows between lights, she wasn't sure. object: silver. 100' long, 25' thick. 100' from ground, 250' away. 45 degree elevation. \"she went on to work and about 5 minutes later her co-worker arrived. they were the only ones in the kitchen. jean said she came in looking strange and she asked her \"did something happen to you?\" the woman answered \"did you see what i saw too?\" they talked about it. i never talked to the other woman as they were no longer friends and jean wouldn't give me any info. this report sent to ray boeche mufon 12\\12\\1988. jean lived in the old fort dodge house in council bluffs. she said it was haunted. doors and drawers would open and close by themselves. she would hear her name being called. i have 8 pages of the original report that i cannot include in the attachments. ph"],"Disposition":"Unknown","Country":"United States","Case Number":"18019","Tags":"City"}