{"City":"Portland","Object Shape":"Flash, Sphere, Other, Unknown","Object Features":"Unknown","Weather Factors":"None","Source":"MUFON","Date Submitted":"07/10/2009 11:20 UTC","Latitude":"45.525552","Viewing Distance":"Over One Mile","Region":"Oregon","divs":["Sighting DetailsI was smoking a cigarette with my girlfriend on our darkened porch, looking at the stars, when we saw what looked like at first a moving star. My first thought was \"oh there's one,\" since this is not uncommon in the past month, then it got brighter and I thought \"Did that just happen?\" My Girlfriend also saw all of this stated below. The were 12 different sightings in a 4 hour period. 1) saturn like object slightly dimmer, flying east to west in an erratic patter(like it was swerving invisible safety cones set in no discernable pattern) Gradually got Brighter to outshine anything else in sky. Then got dimmer after about 15 seconds. Lost sight to the west faded out. 2)6 more sightings of objects with same type of movement (like they were dodging invisible safety cones set in no discernable pattern) two were east to west, one was northeast to southeast, one was southeast to north, andtwo north to south, steady consistent glow, varying degrees of brightness, all lost to the horizon, and none flying in a straight lines. 3)Sighting to the Northeast Hovering in air approx 5 miles away, Very Bright intense, almost looked like it was on fire with a white light. Hovered in air for 30 seconds, then stared behind treeline, lost to treeline. 4)3 More lights moving low to horizon. Two were north to south, one was east to west, all flying very low, and glowing white. 5)Throughout all this there were intermittent flashes of intensely white light in the sky. in several different directions. I would encourage anyone who saw this please post what you saw, as I'm sure someone else in Southeast Portland has seen things in the sky for the past month, that are not supposed to be there."],"Sighting Duration":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=45.525552,+-122.673547(18015)&iwloc=A&hl=en\"> mufon case (18015) map </A>","Case Number":"18015","Longitude":"-122.673547","Date of the Event":"07/10/2009 11:20 UTC","trends":["There have been 158 other sightings in Portland","There were 2 other sightings in Portland on or around July 10th 2009"],"Summary":"10-11 bright objects in sky. 2 stood out, one gradually got brighter, one was hovering and intensely bright then took off.","Country":"United States","files":["/var/www/straped/mufon/html2text/18015.html.txt","/var/www/straped/mufon/org/18015.html"],"Object Flight Path":"Hovering then path,Path with directional change","Disposition":"IFO","Log Number":"US-07112009-0007"}