{"Weather Factors":"Unknown","Tags":"City","Log Number":"US-07122009-0002","files":["/var/www/straped/mufon/html2text/18028.html.txt","/var/www/straped/mufon/org/18028.html"],"Sighting Duration":"Undisclosed","Longitude":"-84.500585","Summary":"arrowhead formation of milky orange lights heading noth east at high speed, silent","Date of the Event":"07/11/2009 11:45 UTC","Source":"MUFON","Object Shape":"Egg, Oval, Teardrop","Region":"Michigan","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around July 11th 2009"],"Object Flight Path":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.485278,+-84.500585(18028)&iwloc=A&hl=en\"> mufon case (18028) map </A>","Viewing Distance":"Unknown","Case Number":"18028","Latitude":"46.485278","divs":["Sighting DetailsFacing north sitting on deck watching stars, witnessed with my husband and grandaughter a v- formation of 12 to 14 oval or egg shaped lights that were a dull milky orange color.Noticed it while looking at the big dipper which was northwest of our position.Seemed like a flock of canadian geese in regards to formation of the lights. crossed a large section of the horizon in in 5 to 6 seconds. at the large end of the v formation 2 lights protruded off the end of the back of the formation on one side, and one light on the other side of the end of the formation.There was no sound at all. their trajectory was in a straight line with do deviation except it seemed to go hiher and higher until it was out of sight. Elevation and size was not determined as there was no background to compare it with, except a few stars in the northern skies into canada. Felt ominous and wierd. We are stargazers and witnessed a simular event 12 years ago: a v formation of white dull lights with less objects(5) that traveled much slower but was silent. This experience was bizarre as the object went over our house and returned traveling back to the same direction from when we first saw it."],"Disposition":"IFO","Date Submitted":"07/11/2009 11:45 UTC","Object Features":"Undisclosed","City":"Sault Ste. Marie"}