{"Region":"Indiana","Source":"MUFON","Viewing Distance":"21-100 Feet","Weather Factors":"Does Not Apply","Date Submitted":"06/01/1959 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"18021","Object Flight Path":"Stationary","Object Features":"Other","Summary":"Wheel shaped UFO; Indiana, 1959","files":["/var/www/straped/mufon/html2text/18021.html.txt","/var/www/straped/mufon/org/18021.html"],"Date of the Event":"06/01/1959 12:00 UTC","Longitude":"-86.70781","map":"<A HREF = \"http://maps.google.com/maps?q=41.619137,+-86.70781(18021)&iwloc=A&hl=en\"> mufon case (18021) map </A>","Object Shape":"Circle","Latitude":"41.619137","Country":"United States","trends":["There have been 32 other sightings in La Porte","There were no other sightings in La Porte on or around June 1st 1959"],"Tags":"City","City":"La Porte","Log Number":"US-07112009-0013","Disposition":"Unknown","divs":["Sighting DetailsThis happened in 1959; I would have been about 5 years old. It wasn't just one event although I'm not sure of how many times this happened. I used to be afraid to go to bed at night because of what I called the wagon wheel and the owl people. This was in the Monroe Manor subdivision outside of LaPorte, Indiana. A number of times I saw what I called a 'wagon wheel' that never stopped turning. There was some sound to it; I seem to remember a kind of clacking noise. It would be easy to see it out of the open window. I remember being very afraid of it. Along with that would be the 'owl' that would stand next to my dresser. I called him that because of his eyes, but I remember also thinking that he must be a little boy since he wasn't much bigger than I was. I don't recall being afraid of him in the beginning but later on I was. After that I always wanted to make sure there were no lights on in my room at night so I wouldn't be able to see him. My feeling was that the 'owl boy' was not good and was something to fear. At one time I saw a group of them and kept thinking that they were the 'wrong color'. Other memories of this are patchy at best."]}