{"Disposition":"Hoax","Date Submitted":"07/10/2009 11:59 UTC","Source":"MUFON","Object Features":"Appendage(s), Other, Unknown","Case Number":"18023","Object Shape":"Sphere, Triangle","divs":["sighting detailsmurrysville, pa - july 10, 2009 12:11 a.m. (23 miles east of pittsburgh) 4:45 minute hd video caught of an orange ufo that changed into a silent flying weird rotating triangle type ufo. thought it was another sighting of the orange ufo, filmed 3 nights in a row, on july 7, 8, & 9th at 9:44, 10:00 & 10:23 pm respectively--like a pattern. came back from farm field with 360 view on top of hill where i caught them last two nights. just came in and went sat down in livingroom that has high wall of alpine-style glass facing south. saw the moon, jupiter & noticed a second bright object orangey object higher to the left of them. thought, \"wow, it's back again!\". grabbed the camcorder and ran out onto the deck and started filming. was still in nightshot with infinity zoom from last shot, tripod still in the car. what was different was that the orange ball of light started blinking on the left side, the color green. thought, \"what, is this a \"lake horn style fake me out?\" (planes that look like ufos when approaching an airport). there is no airport in this direction of travel and so i kept filming to see what could be making the orange color. to my astonishment, more lights appeared in a somewhat faa pattern, but with 3 center bright white lights stacked like pyramid. it seemed to be rotating as it flew and examination of the video confirms this. the green right side \"navigation\" light ended up on the opposite side by the time it crossed the valley in front of my house, circled to the nw to disappear behind my roof line. the light patterns kept changing perhaps as a result of the tilting as it flew silently. valley is bowl shaped and you can yodel down it and hear a deer poop. no sound came from it. it wasn't traveling that fast to take 4:45 to travel about 3000 feet and i don't think a plane could fly upside down at that speed, in the dark, at midnight, over houses. it must have circled back towards the east because a woman in duncansville, pa by altoona filmed it several minutes later 80 miles away. she describes it as \"spinning\" and silent also. her youtube channel name is nimitta1 and she's seeing and\\or filming alot of the same stuff as me. perhaps route 22 is the ufo corridor! hd video with blow up stills can be seen on my youtube channel: seeingufospa video: http:\\\\www.youtube.com\\watch?v=rdpg257zhkk"],"Tags":"City","Weather Factors":"None","Region":"Pennsylvania","trends":["There have been 31 other sightings in Murrysville","There was one other sighting in Murrysville on or around July 10th 2009","This sighting has never been favorited.",""],"Longitude":"-79.695785","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Summary":"Murrysville: Orange UFO ball turns into weird rotating TRIANGLE UFO -SILENT FLYING","files":["/var/www/straped/mufon/html2text/18023.html.txt","/var/www/straped/mufon/more/18023_submitter_file1__triangleUFO71009_4.jpg","/var/www/straped/mufon/more/18023_submitter_file2__triangleUFO71009_22contrast.jpg","/var/www/straped/mufon/more/18023_submitter_file3__triangleufo71009_0.jpg","/var/www/straped/mufon/org/18023.html"],"Latitude":"40.430622","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.430622,+-79.695785(18023)&iwloc=A&hl=en\"> mufon case (18023) map </A>","Log Number":"US-07112009-0015","Sighting Duration":"00:05:00","Object Flight Path":"Hovering then path","Date of the Event":"07/10/2009 11:59 UTC","City":"Murrysville"}