{"Sighting Duration":"Undisclosed","Country":"United States","Latitude":"27.674177","Date of the Event":"03/12/1965 12:00 UTC","City":"Undisclosed","Object Flight Path":"Undisclosed","Log Number":"US-07112009-0014","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18022.html.txt","/var/www/straped/mufon/org/18022.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=27.674177,+-81.506774(18022)&iwloc=A&hl=en\"> mufon case (18022) map </A>","divs":["sighting detailsbrooksvile incident vol. 1 page 165 note script. this is per many years of investigation's into this incident and related matters, including attempt's to get other entities to translate this script. recent attempts include former navy personnel and their partial translation and combined efforts at translations. speculation's: read from line no.1: \"i am\" varient of name or name's two possibilities: one; 3 or 4 entities two; one entity description of entities and or thier point of origin, description of part\\direction of solar system, system's\\sector, ( region of space ) and or number of planets. line 1 partial; signature block or partial descritption their of, of said matters. line two: next entity's name and point of origin \"i am\". \"i am from the area....\" description of solar system or systems\\sector, ( region of space) more directions and directions of systems.... line three; more description of said matters line four; more description of said matters line five; more description and another possible name and description. line six, ( two lines ) signature block. photo pending this was one of a few incidents involving this type\\model ufo."],"Disposition":"Hoax","Case Number":"18022","Summary":"Known as the Brooksville Incident, per UFO Encyclopedia 2nd. Ed. By jerome Clark","Longitude":"-81.506774","Source":"MUFON","Weather Factors":"Unknown","trends":[],"Object Shape":"Undisclosed","Region":"Florida","Date Submitted":"03/12/1965 12:00 UTC"}