{"Object Flight Path":"Straight-line path","trends":["There have been 158 other sightings in Portland","There were 2 other sightings in Portland on or around July 12th 2009"],"City":"Portland","Object Features":"Unknown","Case Number":"18029","Log Number":"US-07122009-0003","divs":["Sighting DetailsSunday morning at 4:30 am I woke up like very alert and could not go back to sleep. At 5:35 my daughter came home very excited that she had seen a UFO. I had her describe calmly and in detail what happened. She was with two friends driving home after watching movies all night at another fiends home in Portland Ore. Patric was driving my daughter in the passenger seat, Jessie in the back seat. The car was approaching the intersection of Interstate and Killingsworth streets, going north on Interstate. A extremely bright light appeared on the drivers side about 4 ft. from the car it being about 3 ft in diameter and about 6 ft. in the air following along side of the car strobing intensely into the car , Patric yelled out \"what the f... a car approaching from the east on Killingsworth st. skidded to a stop. My said daughter it flashed very rapidly for about 4 seconds then time slowed down. There was no sound, she could not even hear the car motor running. They continued through the intersection, and became alert again, Patric said \"Was that an angel or a UFO lets.... forget it\". He would not talk about what just happened and brought my daughter home. It only takes 20 minutes to drive home so these kids are missing 40 minutes of time. The three of them are in their early twenties . They came home sober and clear. When my daughter was five years old she and her brother woke me one night and told me about a Gray that came into the bedroom they shared and stared at them a long time then dissolved into thin air. For myself and my twin brother we have had many UFO experiences."],"Date Submitted":"07/12/2009 04:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18029.html.txt","/var/www/straped/mufon/org/18029.html"],"Disposition":"Unknown","Region":"Oregon","Date of the Event":"07/12/2009 04:30 UTC","Latitude":"45.524502","Longitude":"-122.668767","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.524502,+-122.668767(18029)&iwloc=A&hl=en\"> mufon case (18029) map </A>","Summary":"Strobing white light-very close","Object Shape":"Flash, Sphere","Country":"United States","Viewing Distance":"20 Feet or Less","Tags":"City","Weather Factors":"Unknown"}