{"Log Number":"US-07122009-0006","Sighting Duration":"Undisclosed","Latitude":"47.107248","Viewing Distance":"Unknown","Date of the Event":"07/10/2009 01:41 UTC","files":["/var/www/straped/mufon/html2text/18032.html.txt","/var/www/straped/mufon/org/18032.html"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=47.107248,+-122.425466(18032)&iwloc=A&hl=en\"> mufon case (18032) map </A>","Region":"Washington","Country":"United States","Object Shape":"Sphere, Star-like","City":"Spanaway","Object Features":"Undisclosed","Case Number":"18032","Source":"MUFON","Date Submitted":"07/10/2009 01:41 UTC","Disposition":"Insufficient Data","divs":["sighting detailson 7\\10\\2009 i my husband and i went to bed around 1:30 am we were in bed for a few minutes and we heard a weird dat dat dat noise that was substantially loud, we live off of fort lewis and are used to the noise associated with the fort but in 9 years i have never had them randomly start shooting off at 1-2 in the morning. i got up and looked out the window to try and put an object to the noise (was it a horse caught in a fence or kicking at a barn wall, fire works? what was it) i didn't see anything so i went back to bed about 1-2 minutes later we heard it again but this time their were three different rounds of ammunition so my husband got up and looked out the window and said it was coming from fort lewis, he went back to bed a minute later it went off again and i got out of bed and my husband got out of bed we went to two different windows and looked outside, i had to view that was pointing to the fort i saw \"tracers\" from the ammunition that was being shot from fort lewis, i thought that was odd, again in 9 year i have never seen tracers off of ammunition from the fort. i continued to look outside and saw a blue spherical ball of light in the sky darting around and zig zagging through the sky it was very apparent that someone (weather it was fort lewis or a private party i don't know) was trying to \"shoot down\" this thing from the sky. the object was in the sky for about 10 seconds (that i saw) and it disappeared, just vanished once it was gone the shots stopped and we didn't hear anything for the rest of the night. in the morning i went to work (traveling north bound on 8th ave s) and as i drove by fort lewis i saw they had large wooden crates (7x7x5) with large yellow warrning signs tapped to the front of them that they were loading up onto army truck i don't know if this has anything to do with \"someone\" trying to shoot down the bouncy ball of light or not but found it to be odd."],"Summary":"Was Fort Lewis Trying To Shoot Down A UFO?","Longitude":"-122.425466","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Spanaway","There were no other sightings in Spanaway on or around July 10th 2009"],"Tags":"City"}