{"trends":["There have been 5 other sightings in Cedar Hill","There were no other sightings in Cedar Hill on or around May 6th 2002"],"files":["/var/www/straped/mufon/html2text/1803.html.txt","/var/www/straped/mufon/org/1803.html"],"Country":"United States","Sighting Duration":"00:05:00","Disposition":"Unknown","Date of the Event":"05/06/2002 09:25 UTC","City":"Cedar Hill","divs":["Sighting DetailsFirst I have to say that I am not sure that I really saw anything at all. Itsjust that for the past three months I have been thinking over and over aboutthat night and the possibility that I saw something has been eating away at me.Mostly because if it was something I should report it. So here is whathappened.It was around 9:25-30pm on the evening of May 6th. I was in my(upstairs) bedroom and I just happened to get up and look out the window. It wasdark so I cant give a totally clear description of what I saw, but I did see anobject. And at first it looked like a plane, but as I watched I saw a red lightthat went around it in a clockwise motion. I actually stood there and watched asthe light traveled around it which makes me think it was a saucer or somethinground. I dont know how long I watched itanywhere from a minute or more, but it just hovered and didnt move. Thenfinally it just floated away. During the whole time I couldt move. I reallycouldnt believe what I was looking at. To me it looked like a UFO, orsomething, but like I said it was dark and Im not sure if it was Military orwhat. You see I live 40 minutes away from Carswell Air Force Base. I guess I wasin shock, but I just stared at it and my mind was telling my to get my camera,but my feet wouldnt move. And then later I kicked myself for not taking apicture. Thats part of the reason I waited so long, because I didnt get apicture. And I dont want people to think I am some kind of nut who alwaysreports these kind of things. You see I reported something last winter under afalse name of Michelle Muller. Well the last name was false. But like I said thepossiblity that I saw something has been bothering me and so thats why Imcontacting you."],"Date Submitted":"05/06/2002 09:25 UTC","Object Shape":"Unknown","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-96.953065","map":"<A HREF = \"http://maps.google.com/maps?q=32.589669,+-96.953065(1803)&iwloc=A&hl=en\"> mufon case (1803) map </A>","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Log Number":"","Source":"MUFON","Summary":"saw red light from my bedroom window","Tags":"City","Region":"Texas","Case Number":"1803","Latitude":"32.589669"}