{"Object Features":"Unknown","Log Number":"US-07132009-0001","City":"Battle Creek","trends":["There have been 15 other sightings in Battle Creek","There were no other sightings in Battle Creek on or around July 4th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Date of the Event":"07/04/2009 02:00 UTC","Date Submitted":"07/04/2009 02:00 UTC","Object Flight Path":"Stationary","Object Shape":"Other","Tags":"City","Summary":"Unidentified objet at Battle Creek air show.","Country":"United States","Viewing Distance":"Unknown","Longitude":"-85.178564","Case Number":"18036","Source":"MUFON","Latitude":"42.326872","map":"<A HREF = \"http://maps.google.com/maps?q=42.326872,+-85.178564(18036)&iwloc=A&hl=en\"> mufon case (18036) map </A>","divs":["sighting detailsmy son, girlfriend, and her father attended the battle creek airshow on 7\\4\\09. honestly,we didn't notice anything out of the ordinary. however, when my girlfriend e-mailed the pictures we took to me, while i was cropping and zooming, i noticed a dot in the sky. when i zoomed in, it was not just a dot. there was something else in the sky that was out of the ordinary. it has a mass to it, and is unlike any aircraft that i am aware of. at first i thought that it might be an error or a piece of dust on the lense, but the object showed up in 3 of the photographs, out of about 20. it is in the first picture above a helicopter that was flying around 2:00 when the air show started, and it also shows up durring the thunderbird demonstration that ended around 4:45. i am interested to see if anyone else captured the object. i am attaching the photos unedited to give reference to the distance, and altitude."],"Disposition":"Unknown","Region":"Michigan","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18036.html.txt","/var/www/straped/mufon/more/18036_submitter_file1__IMG_0193.JPG","/var/www/straped/mufon/more/18036_submitter_file2__IMG_0224.JPG","/var/www/straped/mufon/more/18036_submitter_file3__IMG_0228.JPG","/var/www/straped/mufon/org/18036.html"]}