{"Tags":"City","Object Shape":"Sphere","Country":"United States","Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in Ellwood City","There was one other sighting in Ellwood City on or around July 5th 2009"],"Longitude":"-80.282802","City":"Ellwood City","Region":"Pennsylvania","Sighting Duration":"00:10:00","Source":"MUFON","Latitude":"40.86523","Case Number":"18034","Summary":"Bright orange sphere no other lights on it","files":["/var/www/straped/mufon/html2text/18034.html.txt","/var/www/straped/mufon/org/18034.html"],"Object Features":"Unknown","Date of the Event":"07/05/2009 09:30 UTC","Disposition":"Unknown","divs":["Sighting DetailsWe were outside awaiting a fireworks display after our arts,crafts and food festival and there were 10 of us when one person looked at the sky that was south of us and the moon was full in the south and this object appeared east of the moon, which it came over the horizon from Beaver County way which is south of Ellwood Ciy and it moved slowly to the north and when it came equal to the east of the moon its speed increased it went higher then it just disappeared. There were no clouds out , someone thought it maybe a medical helicopter but those sounds echo through this valley and I can always tell if a helicopter is coming in , it also had no other lights on it and it was round and did not look like a airplane either , the sun also had already set to our west so it was not a reflection off it , I also plotted a tracking point in the sky and kept watching over head and nothing flew over the house we were at, and no stars were present in the path . This lasted maybe 10 minutes and I know other people were on the roadway and I heard them talking about seeing it to. I felt I saw may first UFO. My reaction was normal I would say since I do believe in UFO's there has to be someone else out there besides us on earth. I did not take any action till now when I was trying to find sightings of this object on the internet that anyone else would have reported so I decided to report tonight one week later because I believe it was a UFO."],"Log Number":"US-07122009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=40.86523,+-80.282802(18034)&iwloc=A&hl=en\"> mufon case (18034) map </A>","Weather Factors":"None","Date Submitted":"07/05/2009 09:30 UTC"}