{"files":["/var/www/straped/mufon/html2text/18033.html.txt","/var/www/straped/mufon/org/18033.html"],"Sighting Duration":"Undisclosed","Source":"MUFON","divs":["Sighting Detailstook dogs out in backyard for bathroom break before bed, they were barking and loud after a object about 10 ft outside our iron fence. Called the dogs back in and our alpha dog would not come. noticed the extemely black object. I thought it was a shadow at first and kept trying to figure out what it might be. We have had 3 cats disapear in the past few years and was trying to figure out if it was a crouching preditorial animal. My son went inside to get a flashlight and the object remained perfectly still and quite when we shown the light on it my son said oh, its just a black trashbag and we continued to walk toward it. then it suddenly moved toward us up to the fence, no head, feet,fur,just sort of like a black hole. we ran inside and locked the door,I looked for a camera and grabbed my cell phone to take a picture. My son didnt want me to go back out so tryed to crack the door to get a picture but it was gone. I was really freaked out about it, as a child my sisters and I found a charred circle behind our house that had been covered with dead grass clipping, the ground under was a perfectly round circle and the dirt was hard and melted, our parents didnt seem to be concerned and we went to the builders office of the developement to tell them. None of the adults seemed to freaked out about it but me and my sisters still talk about it.The charred circle seemed to be much larger than this object,problably 6-10 ft."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.662282,+-97.472495(18033)&iwloc=A&hl=en\"> mufon case (18033) map </A>","Summary":"black,on ground,roundish 1 ft high 3 ft across, silent, still, moved quickly toward us when we approached with flashlight.s","Viewing Distance":"Unknown","Disposition":"Unknown","City":"Edmond","Date of the Event":"07/12/2009 01:45 UTC","Log Number":"US-07122009-0007","Latitude":"35.662282","Longitude":"-97.472495","Object Flight Path":"Undisclosed","Object Shape":"Cylinder","Country":"United States","Tags":"City","Region":"Oklahoma","Weather Factors":"Unknown","trends":["There have been 16 other sightings in Edmond","There were no other sightings in Edmond on or around July 12th 2009"],"Date Submitted":"07/12/2009 01:45 UTC","Object Features":"Undisclosed","Case Number":"18033"}