{"Date Submitted":"06/09/2009 12:00 UTC","Disposition":"Unresolved","Case Number":"18037","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around June 9th 2009","This sighting has never been favorited.",""],"Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=53.551704,+-113.489242(18037)&iwloc=A&hl=en\"> mufon case (18037) map </A>","Longitude":"-113.489242","Object Flight Path":"Straight-line path","Log Number":"CA-07132009-0002","Summary":"Luminescent UFO with surounding orbs.","Country":"Canada","City":"Edmonton","Latitude":"53.551704","Sighting Duration":"Undisclosed","Region":"Alberta","Source":"MUFON","Object Shape":"Circle, Flash, Sphere, Square, Rectagular","divs":["Sighting DetailsJune 9, 2009 at approximately 8 pm MST, while walking through the Alberta Legislature grounds on the descending steps to the bowling green, we noticed a strange flying object moving very slowly overhead northbound from over the river valley coming right toward where we were strolling. It was completely clear outside with the exception there were a few minor clouds. It started out looking almost black and cube-shaped, but as it moved closer overhead, it seemed to appear to be silvery, almost with luminescence. There were tiny little flashes of light around it, but they were difficult to see against the bright blue sky. Those were almost instantaneous. The large one did not flash in and out; it was constant and steady it its movement. It continued to move right over our heads and appeared to have blue and pink bubble-like nodules. It moved slowly, and was completely silent. Its height was about a 150 feet above. I had my camera, and did manage to capture some shaky video. It continued right on over the grounds over the Legislature building and we couldn't see it anymore. It was odd because we had a clear view of the sky coming down the steps at almost eye-level, and had noticed how slow this thing was moving. I was busy staring at it, thinking \"Bizarre! There's no way that's what I think it is...\" when my friend elbowed me to pull out my camera (I'd intended to do some shots of flowers...so I'm glad I had it with me). It was really exciting: we couldn't wait to get back home to the computer to see what we got. Thought I'd share it here."],"Tags":"City","Date of the Event":"06/09/2009 12:00 UTC","Object Features":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18037.html.txt","/var/www/straped/mufon/more/18037_submitter_file1__IMG_3574.JPG","/var/www/straped/mufon/more/18037_submitter_file2__IMG_3575.JPG","/var/www/straped/mufon/org/18037.html"]}