{"Source":"MUFON","Object Flight Path":"Path with directional change","Log Number":"US-07122009-0009","map":"<A HREF = \"http://maps.google.com/maps?q=36.453365,+-100.537367(18035)&iwloc=A&hl=en\"> mufon case (18035) map </A>","Case Number":"18035","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date Submitted":"07/11/2009 11:30 UTC","Region":"Texas","Summary":"slow moving star like object changed directions and took off.","trends":["There have been no other sightings in Booker","This sighting has never been favorited."],"Latitude":"36.453365","Longitude":"-100.537367","Tags":"City","Country":"United States","Date of the Event":"07/11/2009 11:30 UTC","files":["/var/www/straped/mufon/html2text/18035.html.txt","/var/www/straped/mufon/org/18035.html"],"divs":["Sighting DetailsI was riding a motorcycle at about 11:30 pm July 11th 2009. I was headed north between Booker Texas and Elmwood Oklahoma. The skies were very dark and very clear. I was going about 60-65 mph. Off to my right or east, I noticed a bright light, which I thought was a planet I had sort-of identified earlier when I was headed east. It took me a second to realize that the light was brighter than the planet and to the north of the where the planet should have been and was. I checked my mirrors, and down the road in front of me for traffic, there was none so I looked to my right or east, and again looked at the object for a few seconds and realized it was moving across the star-field behind it. It looked like maybe a small airplane with a landing light on, by far the brightest thing in the sky, but the light was just a solid whitish light. It was headed what looked to be straight south, and it was a little north of straight east of me. It also appeared to be one to three miles from me and maybe less than a mile above ground level, don't know hard to tell. I am about half-way between Booker and the Oklahoma state line. I decide to stop to watch it, I'm not in a hurry and I guess it got me curious. I slow down and stop and as I am stopping in the road I notice the light has been getting brighter, just 10 or 15 seconds in this whole deal has elapsed now, and a lot is happening at the same time. This thing is getting very bright, like streetlight bright at about a block or two, I'm riding a motorcycle and trying to look up at the sky and trying to stop at the same time without getting run-over. Okay now for the good part. I have stopped in the road and between me getting stopped and glancing back and forth at the object this thing turns and accelerates. Dramatically. Unbelieveably fast. It goes what appears to be about a 45 degree angle up and maybe due south-east, so now its headed up and away from me, and it got so bright for an instant that it might have lit up the ground around the area. It looked like about half as fast as a shooting star would appear, super fast but watchable. It accelerated from what appeared to be about 150 mph., to maybe 50 thousandish mph or faster. Just guessing only, yes speculation. It stayed on the exact trajectory for about 15 seconds and I watched it until I had to look to each side of it to be able to see it. As it was dissappearing from my sight it appeared to be curving to the south a little, maybe a optical illusion, its possible the thing was now maybe satellite-high, or higher, thats what it looked like as it was dissappearing, maybe a dim satellite. There was a jet in the area that might halve seen this, north of me and headed west. The moon rose exactly as this was happening if you want a exact time. And as I was about to take off a south to north or north to south cant remember...shooting star went across the horizon directly where I was watching. thats it. This all seemed matter of fact to me even though its the weirdest-coolest thing i've ever seen. Thought i'd tell some-one who might be interested. thanks. p.s. had earplugs in and left bike running never heard anything. thanks."],"Object Shape":"Star-like","Weather Factors":"None, Does Not Apply","City":"Booker","Disposition":"Unknown","Object Features":"None"}