{"divs":["Sighting DetailsOn Sat July 10th around 11pm I went to my back deck to see if our dog was ok, she hadn't been fed and I went to feed her. I looked up at the sky because it was such a clear evening at the time it had rained earlier and storms were in the area but at this point it was clear. I looked up and instantly a star I thought made a leap across the sky to me it looked like if I held out my arms straight out from my sides then held them above my head that is the distance it went and I'm sure in the sky that was a long way, it did it INSTANTLY I told myself maybe i am mistaken so I watched and it moved again back instead of from side to side and it started twinkling it went from white to a light orange to red, so I got a chair and sat down and watched it a while then it slowly moved to the west of Nashville where there were 2 more similar to it,. This isn't the first UFO I have seen in my 49 years so I watched them a while then got tired, and went inside to get ready for bed, just before I went to bed about 35mins later I stuck my head outside and looked in that direction and they were gone. So Star-Like moving very fast and with 90 degree turns... M youngblood"],"Case Number":"18030","Sighting Duration":"00:35:00","Disposition":"Unknown","Longitude":"-86.714352","Region":"Tennessee","Source":"MUFON","Date of the Event":"07/10/2009 11:00 UTC","Summary":"Moving Object, that was not a satilite","Viewing Distance":"Unknown","Object Shape":"Star-like, Unknown","City":"Nashville","files":["/var/www/straped/mufon/html2text/18030.html.txt","/var/www/straped/mufon/org/18030.html"],"trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around July 10th 2009"],"Object Flight Path":"Path with directional change","Tags":"City","Country":"United States","Date Submitted":"07/10/2009 11:00 UTC","Weather Factors":"None, Rain, Light","map":"<A HREF = \"http://maps.google.com/maps?q=36.2562,+-86.714352(18030)&iwloc=A&hl=en\"> mufon case (18030) map </A>","Log Number":"US-07122009-0004","Object Features":"Unknown","Latitude":"36.2562"}