{"City":"Tracy","map":"<A HREF = \"http://maps.google.com/maps?q=37.747981,+-121.420453(18046)&iwloc=A&hl=en\"> mufon case (18046) map </A>","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy wife and I were having a late dinner outside on the patio when I noticed what I thought to be a star \"blink out\" to my right. It seemed to be about 15 degrees north of Tracy, so it probably would've been directly above the Discovery Bay area. It was a mostly clear night. What we saw in essence was a light that slowly blinked on and off at irregular intervals. It was about as bright as the star Sirius. The object was not quite stationary; it moved around slightly but not at particularly high speeds. Whatever it was was also pretty high in the air. I could only make out a single white light. We live in southern Tracy, CA so we actually see a lot of flight traffic (usually at about 40,000 feet) so I'm familiar with how airplanes look and move. It didn't seem to be an airplane (it hovered, the lights blinked too slowly & the lights weren't multicolored). It was too high to be a helicopter, there was no noise and also at the end, the light blinked out. The entire sighting lasted for just about a minute (it slowly blinked 3 times total) the light then flashed on then faded out completely. I still can't explain what it was, so I'm reporting it as a UFO in my book."],"Object Shape":"Star-like","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/18046.html.txt","/var/www/straped/mufon/org/18046.html"],"Date of the Event":"07/12/2009 09:30 UTC","Source":"MUFON","Latitude":"37.747981","Tags":"City","trends":["There have been 8 other sightings in Tracy","There were no other sightings in Tracy on or around July 12th 2009"],"Region":"California","Viewing Distance":"Over One Mile","Disposition":"Unknown","Date Submitted":"07/12/2009 09:30 UTC","Log Number":"US-07132009-0011","Case Number":"18046","Weather Factors":"None","Summary":"Slowly blinking \"star\" near Tracy, CA","Longitude":"-121.420453","Object Flight Path":"Stationary"}