{"divs":["Sighting DetailsI was sitting on my front porch with my two dogs facing the Big Dipper. I have limited view due to my porch roof. I saw a shooting star heading from south to north through the dipper. I then noticed a star by the upper handle side of the dipper bowl & thought \"it's so clear that I could see a star that I didnt realize was there\". Then I noticed it was moving. I stepped off my porch to see more sky. The object headed upward by the higher star that forms the dipper bowl & continued se toward Casseopeia. I thought it was a satellite but it was weaving slightly, somewhat changing direction & speed was not constant. I knew it was something different & was excited. It made a slight bend in a star cluster just nw of Casseopeia & went straight upward very quickly away from Earth - I was stunned! I look at the night sky all the time and have never seen anything like it. About 30 seconds after it was out of sight I saw a satellite heading very near the area where the object diappeared that was travelling from s to n. I then went to my back yard & continued to look at the n sky until about 2:30 am. I saw two more shooting stars in the n sky during that time. I believe in ETs & have been envious of those who have seen UFOs. As much as I look at the sky I've always thought I should see one.....now I have!"],"Country":"United States","Tags":"City","Longitude":"-82.674334","Object Shape":"Circle, Sphere, Star-like","Date Submitted":"07/13/2009 01:43 UTC","City":"Pataskala","map":"<A HREF = \"http://maps.google.com/maps?q=39.995619,+-82.674334(18042)&iwloc=A&hl=en\"> mufon case (18042) map </A>","files":["/var/www/straped/mufon/html2text/18042.html.txt","/var/www/straped/mufon/org/18042.html"],"Date of the Event":"07/13/2009 01:43 UTC","Case Number":"18042","trends":["There have been 3 other sightings in Pataskala","There were no other sightings in Pataskala on or around July 13th 2009"],"Viewing Distance":"Over One Mile","Summary":"Star-like object flew high across sky (not straight) & disappeared straight up.","Weather Factors":"Does Not Apply","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-07132009-0007","Object Features":"Unknown","Disposition":"Unknown","Region":"Ohio","Object Flight Path":"Path with directional change","Latitude":"39.995619"}