{"Log Number":"US-07132009-0013","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","trends":["There have been 216 other sightings in Philadelphia","There were 4 other sightings in Philadelphia on or around July 4th 2009"],"Longitude":"-75.154849","Sighting Duration":"Undisclosed","Tags":"City","Latitude":"39.957075","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18048.html.txt","/var/www/straped/mufon/org/18048.html"],"Date Submitted":"07/04/2009 12:00 UTC","Object Features":"None","Disposition":"Insufficient Data","Summary":"Two objects moving fast and erratically north to south","Source":"MUFON","City":"Philadelphia","Object Shape":"Star-like","Case Number":"18048","divs":["Sighting DetailsI was in the park near the Philadelphia Art Museum waiting for the late fireworks display. At about 10PM I saw two lights to the West or Northwest, moving rapidly in a straight line across the sky from North to South, one behind the other. What was most odd was their erratic speeds: The second light kept speeding up and slowing down, like it was playfully chasing the first one; it would nearly catch up to the first, then slow or stop and fall back. I'd guess the sighting lasted about 30 seconds before the lights disappeared behind trees. These lights were not bright -- the sky was very illuminated from the city lights, and only a couple of the brightest stars were visible, and the lights I saw were about the same brightness as those stars. I did not get any sense of their color. They seemed to be at a high altitude and moving at a good clip, but the erratic speeds made made their motion quite distinct from planes or helicopters or satellites. I had a Flip cam with me and attempted to film it, but nothing is visible -- too low-light for the ccd, and too jerky. My girlfriend was with me but she wasn't wearing her contacts and couldn't see what I was pointing at. No one else nearby appeared to be paying attention (there was a concert playing at the time.)"],"Region":"Pennsylvania","Date of the Event":"07/04/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.957075,+-75.154849(18048)&iwloc=A&hl=en\"> mufon case (18048) map </A>","Country":"United States"}