{"Object Shape":"Circle, Oval","Date Submitted":"07/08/2009 10:30 UTC","trends":["There have been 6 other sightings in Gunnison","There were no other sightings in Gunnison on or around July 8th 2009"],"Source":"MUFON","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Case Number":"18057","Sighting Duration":"Undisclosed","Object Features":"None","Region":"Colorado","Log Number":"US-07132009-0022","map":"<A HREF = \"http://maps.google.com/maps?q=38.552695,+-106.923391(18057)&iwloc=A&hl=en\"> mufon case (18057) map </A>","Country":"United States","Summary":"Extremely bright oval shape, brightest object I've ever seen other than the sun or moon.","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Date of the Event":"07/08/2009 10:30 UTC","divs":["Sighting DetailsOn July 8, 2009, at approximately 10:30 p.m., I was returning from a friend's house east of Gunnison, CO, heading west on US 50. When I first noticed the object, I was approximately eight miles east of town. The object was to the northwest, brighter than Venus, and not very high in the sky, maybe 15-20 degrees of elevation, barely above the hilltops. At first, I thought it was a plane with its landing lights on approaching the Gunnison airport. After a few minutes of watching it and watching the road for oncoming traffic and wildlife, I noticed that the light had an oval shape, and that it was indeed getting larger. Because I was moving, I couldn't tell for sure if it was too, so I pulled onto the shoulder and stopped. Yes, it was moving, and moving east at a fair clip, about the speed typical of aircraft around an airport. It then began to arc to the south, actually heading almost in my direction. And, it kept getting larger, and the shimmering more pronounced. At this point, I still thought: a plane. In fact, on the trailing edge, a reddishness, not a distinct point, but a reddishness was visible intermittently, though the reddish color was not cycling regularly, just visible now and then. As it continued arcing in my direction, it grew to an amazing size, say, 20-25 percent as wide as a full moon, and the larger it became, the more it shimmered, but still I thought it was a plane coming in for a landing, or, maybe, I wanted to believe that. I'll confess: a light that bright and big, and arcing in my direction unsettled me just a tad. When the object was about 60 degrees overhead, it abruptly disappeared. At that point, I began to wonder about its being a plane. Had the intermittent reddishness actually been landing lights, at the distance it seemed to be from me, fairly close, I would have seen the running lights. No running lights were visible. The object had vanished. I pulled back onto the highway immediately, thinking that maybe it had dropped behind a nearby hill, though, I didn't really see how that could have been possible because I'd been watching it intently. I guess it's the rational mind looking for a rational explanation. It was nowhere to be found, and at that point I became confident that it was \"unidentifiable,\" at least by me. First, very few aircraft land at the Gunnison airport at night, and no large aircraft land at night. Second, I've lived here 28 years, and have never seen any landing lights as bright or as big as this object. Third, as I approached town, the runway lights were off. And, this is the second such object I've seen this year in this valley. On March 16. at approximately 10 p.m. with clear and starry skies, a friend and I were returning from a meeting in Crested Butte, when I saw a light that at first I thought was an outdoor light on a house up on the slopes of Red Mountain. I watched it wondering why I'd never seen such a bright light before on my numerous trips between Gunnison and Crested Butte. Then, I noticed that it seemed to be above Red Mountain. I pointed it out to my friend who confirmed it was above the mountain. It was night, the road was a bit snowy, and we were ready to be home after a long meeting, so we didn't pull off the highway. It wasn't as bright as last Wednesday's object, though it was about as bright as Venus. In fact, I thought maybe it was Venus (the rational mind again), though I knew Venus probably had set. We watched it for 3-4 minutes before it too disappeared, I mean clicked off abruptly. I am an amateur astronomer, and I've been watching the skies for more than 50 years. I've seen satellites, the ISS, Jupiter and Venus, meteors, several sky-crossing fireballs, aircraft of all sorts, balloons, and yes, geese. lol I've no idea what either of these two lights were, and I've never seen anything in the sky as large as last Wednesday's object, or as bright. Oh, I definitely had a premonition before seeing the light in March. And after Wednesday's light, I feel like I will see another, and, crazy as it sounds, maybe more than just see another."],"Latitude":"38.552695","Longitude":"-106.923391","files":["/var/www/straped/mufon/html2text/18057.html.txt","/var/www/straped/mufon/org/18057.html"],"City":"Gunnison"}