{"Log Number":"US-07132009-0016","Country":"United States","Disposition":"Unknown","Object Flight Path":"Path with directional change,Other","Viewing Distance":"Unknown","Object Features":"Unknown","City":"New Philadelphia","Longitude":"-81.442361","Date of the Event":"07/12/2009 10:37 UTC","Region":"Ohio","Latitude":"40.493437","Sighting Duration":"00:05:00","trends":["There have been 3 other sightings in New Philadelphia","There were no other sightings in New Philadelphia on or around July 12th 2009"],"Weather Factors":"Does Not Apply","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.493437,+-81.442361(18051)&iwloc=A&hl=en\"> mufon case (18051) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/18051.html.txt","/var/www/straped/mufon/org/18051.html"],"divs":["sighting detailsi was out star gazing, as i usually do on a clear night, and within forty-five minutes of my viewing caught sight of peculiar celestial activity. the first two points of light (verry faint) i could have mistaken for satellites, had it not for them moving in unison in the same direction. initially they were close together when i spotted them, and shifted slightly farther apart. then to my surprise, i spotted an even fainter third point of light to the left of the other two moving with the same trajectory and speed as the other. together the three points of light moved due south\\ southeast untill i lost sighting of them, as they drifted into a plume of smoke comming from a fire my neighbors were having. to make matters more interesting still, two new points of light (possibly even the same from the original three)began to fly due north at a higher rate of speed than the original three. i could have mistaken this for another coincidental sattellite crossing had it not been for the second point of light following the northbound trajectory of the first one i seen. these two lights where in the same line (trajectory), however the one behind the first lagged behind and eventually increased speed back to its original form. this event happened withing five to seven minutes. i had spotted a fair number of satellites within the course of the night, with nothing out of the ordinary, save this event."],"Case Number":"18051","Date Submitted":"07/12/2009 10:37 UTC","Source":"MUFON","Summary":"Three faint objects flying in slow formation in the upper atmosphere heading due south"}