{"Case Number":"18059","Object Shape":"Circle, Sphere, Star-like","Summary":"Appeared to be a star but was moving.","Object Features":"Undisclosed","Tags":"City","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"Unknown","Country":"United States","Date Submitted":"07/03/2009 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.100336,+-86.131934(18059)&iwloc=A&hl=en\"> mufon case (18059) map </A>","divs":["Sighting DetailsOn the night of July the 3rd around 10 pm I decided to go out on my back deck and enjoy the country air. I live in Watertown TN in the country. There is nothing behind my house but field ,creek ,tree line and cows. I saw the brightest star I have ever seen so I was watching it then it moved . it moved alot straight up about 10 degrees then stopped. The star would rotate ,looked bigger and brighter on one side than the other you could tell it was spinning. I grabbed my camera and took pictures. I did not see it again until the 6th of july. This time I seen it just pull up to the tree line. I watched it for a few seconds than went and got my tripod this time and my camera. I seen another smaller looking star pull up to it then merge with the bigger one.It rises pretty fast in the sky. I stopped watching it about midnite. The next night it was there and I have not seen it anymore. My sister and son witnessed it also. I have video and still pictures if u would like to see them. It is in the eastern sky."],"Sighting Duration":"Undisclosed","Latitude":"36.100336","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-86.131934","files":["/var/www/straped/mufon/html2text/18059.html.txt","/var/www/straped/mufon/more/18059_submitter_file1__034.JPG","/var/www/straped/mufon/org/18059.html"],"Region":"Tennessee","Date of the Event":"07/03/2009 10:00 UTC","City":"Watertown","Log Number":"US-07132009-0024","trends":["There have been no other sightings in Watertown","This sighting has never been favorited."],"Disposition":"Unknown"}