{"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"07/12/2009 08:45 UTC","divs":["Sighting DetailsIt was around 8:45 at night. The sky was still slightly blue so it was not completely dark. I was sitting at the top of my stairs at my apartment. (Let me just say a week and a half ago I saw the same thing around 4 in the morning, I told my mom about what I saw but she did not believe me. It was a very bright light, white bright light and had a small red light above it moving around, it would be there than vanish than come back.) Anyways back to last night. So I saw something moving in the sky when I looked up. The way it was turning was so quickly and smoothly that there was no way it could be a plane or a helicopter. It made no sound at all. It had 2 blue lights and one red light. I screamed for my mom and she came running out of her room to where I was, I looked up at the object, oh yeah and I couldn't make out the shape because the lights were too bright and it was still a little too dark, anyways, my mom got over there and at this point it was just flying straight and looked pretty normal. My mom was like you called me out here to look at a plane in the sky. I didn't say anything and we both kept staring at it. All of the sudden it started moving up and down like it would drop 100 feet and than go back up again way to smoothly and easily to be anything like a helicopter or plane, it was turning very quickly also, like it'd be going in one direction and in a split second it'd be going the opposite way. Me and my mom were speechless. I looked at her and asked her to explain what that could possibly be and she just laughed. She did not have any idea what that could possibly be. She started nervously laughing. We watched it for another 5 minutes and it started flying away towards the west and all of the sudden it completely vanished. About 2 seconds later it showed up in a completely different part of the sky. So it vanished and than popped up on the opposite side of where it vanished. IMPOSSIBLE thing for a plane or helicopter to do. My mom looked at me and was like how in the world could it do that. We stayed out there for about 10 minutes watching this thing vanish and come back and do turns and smooth flips making no sounds. Than one of our neighbors came out who lives below me. He looked up at me and my mom staring into the sky and was like what are you guys looking at. We didn't say anything so he looked up in the direction we were looking. He was like Oh a plane..? The object was again flying straight so looked kinda normal. Than it started doing those 180 turns and going up and down the guy stared at it and pulled out his camera phone and was freaking out. He tried to take a picture but of course it didn't come out good. Being a cell phone camera. I can't even take picture of a HUGE full moon on my camera phone. Anyways, It started getting far away and vanished behind trees. The guy ran out into the parking lot on the phone telling his friends what he saw, while looking for it. My mom still didn't know what to say, and I went inside to call friend and tell her. I came back out and my mom was still staring in the sky, I looked up and the object was gone but now smaller lights that were further away began to pop up in the sky out of no where. They were sparkly to the point where they looked like they were on fire. Again with red and blue lights around them. I don't know what this was. It was DEFINITELY not a plane or helicopter or a jet or anything like that because those can't vanish and pop back into the sky or morph around like that. It was both fascinating and a little disturbing."],"Latitude":"33.20175","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.20175,+-117.377383(18058)&iwloc=A&hl=en\"> mufon case (18058) map </A>","Date of the Event":"07/12/2009 08:45 UTC","Longitude":"-117.377383","Sighting Duration":"08:45:00","Tags":"City","Object Shape":"Fireball, Unknown","Region":"California","Summary":"Red and blue lights. NOT a plane or helicopter","files":["/var/www/straped/mufon/html2text/18058.html.txt","/var/www/straped/mufon/org/18058.html"],"Case Number":"18058","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around July 12th 2009"],"Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-07132009-0023","Weather Factors":"Unknown","City":"Oceanside","Disposition":"Insufficient Data"}