{"Viewing Distance":"501 Feet - 1 Mile, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/18065.html.txt","/var/www/straped/mufon/org/18065.html"],"Object Flight Path":"Hovering then path","Object Features":"Unknown","City":"Rochester","Latitude":"43.16904","Longitude":"-77.605502","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.16904,+-77.605502(18065)&iwloc=A&hl=en\"> mufon case (18065) map </A>","Summary":"Object appeared then disappeared, then re-appeared and then dimmed down and took off","divs":["Sighting DetailsI was outside smoking a cigerette when I noticed a bright light moving from my left to the right when it went behind a tree so I ran down to the end of my drive way to get a better view of the object but the object was gone. I waited outside for the object for about 10 minutes when my girlfriend arrived home from work. I told her about what I saw and we watched the sky for about 10 minutes. All of a sudden just above the tree tops that are appx. a half mile away a very bright light appeares. The object appeared to be stationary but we noticed it moving in all directions. The object then disappeared and re-appeared in the matter of seconds then it dimmed down to a small white light and took off. I tried moving down the street to keep track of the object but the object was gone. When we saw the object we did not know what to think about it because it was the second time we have seen something similar to this. I also noticed an increased number of airplanes in the sky. They seemed to be flying around the area where my girlfriend and I saw the object. Also after the object took off, we seen a plane moving at a high rate of speed in the direction the object went."],"Weather Factors":"Unknown","Date Submitted":"07/13/2009 10:20 UTC","Log Number":"US-07132009-0030","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","trends":["There have been 53 other sightings in Rochester","There was one other sighting in Rochester on or around July 13th 2009"],"Object Shape":"Unknown","Date of the Event":"07/13/2009 10:20 UTC","Tags":"City","Case Number":"18065","Region":"New York"}