{"Case Number":"18069","map":"<A HREF = \"http://maps.google.com/maps?q=37.988399,+-85.715792(18069)&iwloc=A&hl=en\"> mufon case (18069) map </A>","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/18069.html.txt","/var/www/straped/mufon/more/18069_submitter_file1__UFO070409-2.jpg","/var/www/straped/mufon/more/18069_submitter_file2__UFO070409-3.jpg","/var/www/straped/mufon/more/18069_submitter_file3__UFO070409-7-ZOOMEDIN.jpg","/var/www/straped/mufon/org/18069.html"],"Object Shape":"Blimp, Cigar, Fireball, Sphere","Longitude":"-85.715792","Tags":"City","City":"Shepherdsville","trends":["There have been no other sightings in Shepherdsville","This sighting has never been favorited."],"Weather Factors":"None","Viewing Distance":"Unknown","Source":"MUFON","Summary":"I was outside watching fireworks with my wife and a few neighbors, then BRIGHT ORANGE sphere-like flying objects paraded across the sky, and down our street. 5 TOTAL objects sighted that night by me, my wife, and 4 or so neighbors.","Sighting Duration":"01:00:00","divs":["Sighting DetailsI copied and pasted an email below that I sent to our local news team on WAVE TV3 that very night. I never heard back. Here it is: \"Me, my wife, and at least 4 other neighbors witnessed what can only be explained as unidentifiable flying objects over our neighborhood on the night of July 4, 2009! Over the course of one hour, there were 5 total sightings. On the first wave there were two sighted back to back, then every 10 minutes or so, another one would come by. My description is as follows: - The craft were bright orange in color. On the approach side of the craft, it gave off a very bright, not foggy, but an almost laser precision cut orange glow, then as the vehicle would pass by, the glow dimmed a bit and appeared to morph into three nozzle-like dots, sort of like the afterburners on a fighter jet, yet still deep orange in color! - The vehicles appeared to be just a bit lower to the ground than a typical airline glide slope height, but not knowing how to judge the size of the vehicle, I couldn't give you a good estimate as to the size or distance of the vehicle. Suffice to say, they flew lower to the ground than a typical UPS or commercial airline flight pattern. - No sound was emitted by any of the vehicles, but a lot of fireworks were going off at the time, so it's hard to say, but I will say that with any standard aircraft, or helicopter, flying that low, some kind of sound SHOULD have been very noticeable! - My left hand neighbor got a call from a relative in Mt. Washington, KY, who asked her, \"Did you see that big orange thing in the sky??\" she replied, \"Yeah, we are watching them right now!!\" - Our neighbor Jackie got some video of the object, but didn't think it took, because when she had the object in her camera site, her camera went dead, or white, or some malfunction happened. It wasn't until a few minutes later upon looking at her video again, that she actually did secure some shaky, yet stunning video of the object. - I set up my cellphone camera on standby and waited for the next pass. Sure enough, i got some footage, BUT, when i tried to review it, my phone's software reported \"unrecognizable file format.\", and the clips wouldn't play. Now, HOW does that happen? I've shot, saved, downloaded and converted hundreds of videos off of that phone, and have never had trouble like this before! I'm so glad Miss Jackie and Miss Laura was able to grab something! - I ran across the street and yanked yet another neighbor out of her house, just to see it and have one more eyewitness. - I called WAVE TV3 just to see if anyone else had reported these sightings. No one had, but the lady on the phone had to go because she was due on the air for the 11 o'clock broadcast. - I also called the Bullit Co. Emergency services office, and while I was on the phone with her, another one flew over. I was hollering and trying to explain what I was seeing as she was listening on the phone. She said she'd send a car by, but no one ever showed up. They probably thought it was a joke, or that I was drunk. I was not. I do not drink or use any kind of recreational drugs. I'm willing to be tested on that point in any way necessary to prove my sobriety. My neighbors were sober and very lucid as well. - The flight patterns and turns that these vehicles made would never have been possible by standard commercial or military aircraft. I spent 4 years in the USAF, so i know what I'm talking about. They eventually just flew off into the horizon, and ascended high up into the atmosphere until that orange glow dimmed out of sight. My phone number is ### ### #### if you think this is news worthy. As many people that were outside, lighting fireworks, i just KNOW someone else besides us 5 people saw them, and that 1 lady in Mt Washington too!! Let me know if you received other reports!! I have NO idea what they were, but they were a spectacular and quite scary site to behold!!\" July 04, 2009, from Shepherdsville, KY."],"Latitude":"37.988399","Date Submitted":"07/04/2009 10:00 UTC","Country":"United States","Log Number":"US-07142009-0003","Disposition":"Unknown","Object Features":"Unknown","Date of the Event":"07/04/2009 10:00 UTC","Region":"Kentucky"}