{"Date of the Event":"07/14/2009 01:29 UTC","Longitude":"-118.235725","Case Number":"18072","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.055484,+-118.235725(18072)&iwloc=A&hl=en\"> mufon case (18072) map </A>","Disposition":"Insufficient Data","Summary":"Looked like a disc but all i could see was blue lights and red lights strobing","Log Number":"US-07142009-0006","divs":["Sighting DetailsI was hanging out in my room, when for some reason i felt the need to look out the window, in the northwest sky there were strobing lights i watched this thing for a good 20min as it slowly seemed to drift, they were blue and red and they would change beats. like they were sending a morse code. Luckily i had a pair of binoculars by (not that great but better than nothing). I was able to make out that it had what appeared to be a disc shape. I could see the Colors of the strobe even better.When I first saw it i knew it wasnt a plane or helicopter for the meer fact it was staying pretty much in the same place. However I did notice that it was slowly moving.(there were powerlines in the line of view, when i first saw it, it was above them, then over 20min it moved to where it was below the powerlines. All it did was move real slow and keep strobing. I knew I would see one soon, i think thats what lead me to the window. It eventually went over a building. I was hoping it would move around real quick like the report in Oceanside. But all it did this time was move slowly. I also noticed that there 2 planes that went flying in its direction, i also saw them flying back after. This was not too far from LAX, so i bet they picked something up on the radar."],"Latitude":"34.055484","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 14th 2009"],"Viewing Distance":"Unknown","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/18072.html.txt","/var/www/straped/mufon/org/18072.html"],"Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Date Submitted":"07/14/2009 01:29 UTC","City":"Los Angeles","Object Features":"Undisclosed","Sighting Duration":"Undisclosed"}