{"Region":"New York","Disposition":"IFO","Object Shape":"Sphere","Date Submitted":"07/12/2009 12:00 UTC","Country":"United States","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/18086.html.txt","/var/www/straped/mufon/org/18086.html"],"Case Number":"18086","Summary":"White sphere silently flies by at 50+ MPH near WTC site...","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around July 12th 2009"],"Longitude":"-74.003343","Sighting Duration":"00:00:12","divs":["Sighting DetailsWas out for an evening bike ride with an out-of-town friend on a beautiful Sunday evening. It was still daylight. Stopped to rest at Wagner Park in Battery Park City,which is across from the Statue of Liberty. I was lying down on a bench looking up at the sky and an apartment building (approximately 30 stories)about 200 feet away when I noticed something out of the corner of my eye moving left to right. Before I could tell what it was, it flew (floated?) behind the apartment building. A second later it appeared from the other side of the building and I called to my friend \"What the hell is that?\" Whatever it was was round, all white, and solid looking. It had no lights and made absolutely no sound. I would estimate it to be about 15-20 feet in diameter and it must have been about 300 feet in the air because of the building height. I would have needed a large grapefruit held at arms length away to hide it from view. In five to eight seconds it was far in the distance heading south towards Brooklyn. My guess was that it was traveling between 50 and 100 MPH. Unfortunately, we had no time to grab the camera-- it haunts me that we didn't get to take a photo. My friend thought she saw something spinning on the bottom of the sphere-- I don't remember seeing that. For most of the evening, we discussed what we had seen. Definitely not a plane because it had no wings. I thought it traveled much too fast to be a balloon and later checked the weather to confirm there was a slight wind blowing north-- the opposite direction it was traveling. So it had to be flying under its own power. The thing that impressed me-- and I still think about-- is how smoothly and silently it traveled. BTW, this is my first time I've ever reported seeing a UFO. I would have doubted myself if my friend Haruko wasn't with me to see it. I've not reported this to any radio or TV station. Do you have any other reports?"],"City":"New York","Date of the Event":"07/12/2009 12:00 UTC","Viewing Distance":"101-500 Feet","Latitude":"40.721893","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.721893,+-74.003343(18086)&iwloc=A&hl=en\"> mufon case (18086) map </A>","Object Features":"None","Log Number":"US-07142009-0020"}