{"Longitude":"-92.737129","City":"Camdenton","Object Shape":"Sphere","Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.01081,+-92.737129(18082)&iwloc=A&hl=en\"> mufon case (18082) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/18082.html.txt","/var/www/straped/mufon/more/18082_submitter_file5__case18082picD.JPG","/var/www/straped/mufon/org/18082.html"],"Summary":"Large red glowing spherical object moving slowly about 150 foot above ground right in front of me.","divs":["Sighting DetailsI was taking a motorcycle trip along Route 66 and I was riding my motorcycle to a fellow professor's cabin on Lake of the Ozarks Missouri to stay the night off the Route. I got the directions wrong to his cabin and was heading West on Highway 54 at about 11:00 p.m. CST right on the outskirts of Camdenton Missouri when I noticed a large sphere on the left hand side of the highway above a commercial building (it was South). I thought it was a large dealership type balloon at first, but it started moving very slowly across the highway in a zig zag style fashion. I immediately slowed my motorcycle speed down to about 10 mph, as I was transfixed on the object and could not keep my eyes off of it. I thought it was maybe a hot air balloon ride as I got closer and thought it was amazing that they had hot air balloon rides so late and so low to the ground in the Ozark hills. It was a spherical type object but was not static in shape...it was hard to identify what it was for some reason. I couldn't see any type of hot air balloon basket, but for some reason I felt as if I was being watched while riding on the bike. I kept wanting to pull my bike over to take a picture, but was too amazed at the object that I didn't for some reason. It was large (the size of a small house) and floating about 150 foot above the ground...it was reddish colored with a glow (I thought the glow was the fire for fire for the hot air balloon). It passed right over the top of me along the highway and was hovering along the right side of the highway (the North side). I was trying to find a place to pull my motorcycle over so I could take a picture, but trees were getting in the way, but I could still see the object for another 10 to 15 seconds or so. I finally found an open spot with no trees to take the picture and within seconds of getting off my motorcycle, the object faded extremely fast heading in a 45 degree angle. It was literally gone within a few seconds, but there were no obstructions or trees for it to dissappear behind. It couldn't have been a hot air balloon because of the exit speed and how low to the ground it was. It was definitely sphere-like. The whole experience lasted only a minute or two, but I have tried to rationalize what I saw almost every minute of the day since then (It was 6 days ago). The professor's cabin who I was staying at knew what I had seen, as he had seen the exact same type of object hovering above Lake of the Ozarks 3 years ago in late fall 2006. We are co-workers at a University...both professors...I am a Law professor and he is a Marketing professor. He told me that I could come forward with his information as well. Him and his wife both witnessed the object hovering above Lake of the Ozarks for about 5 minutes...they could not believe their eyes...and were also so transfixed that they didn't capture it on film. He informed me that he kicks himself all the time for not taking a picture or video, but for some reason he was so mesmerized he didn't move. The fellow professor and his wife never told anyone but relatives in the past...but him and I have talked for hours in the past 6 days to try to rationalize what we saw, but there is no rational known explanation of the object, how it moved, it's size, shape, and aura around it. I have never been an avid UFO follower and was not looking for a UFO...it found me...and I completely believe and now intend to spend my summers investigating this phenomenon (as a professor my summers are fairly free). I will help you in any way I can...I am 100% CERTAIN that I witnessed a UFO...as a lawyer and law professor I am very skeptical without evidence...but the evidence was literally about 150 feet right above in front of me...it was the most amazing thing I have ever witnessed in my life. I will remain anonymous for now, but if for proof or other purposes you may request me to come forward, I may at some later time. I also plan to get a tattoo of what I saw on my body...I do not have a photo, sketch or audio or video as of right now, but I intend to have one created for my tattoo."],"Object Flight Path":"Hovering then path","Date of the Event":"07/08/2009 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Disposition":"Unknown","Country":"United States","Log Number":"US-07142009-0016","trends":["There has been one other sighting in Camdenton","There were no other sightings in Camdenton on or around July 8th 2009","This sighting has never been favorited.",""],"Case Number":"18082","Source":"MUFON","Latitude":"38.01081","Viewing Distance":"101-500 Feet","Date Submitted":"07/08/2009 12:00 UTC"}