{"Region":"North Carolina","Disposition":"IFO","Object Features":"Unknown","Country":"United States","Case Number":"18096","Source":"MUFON","Tags":"City","divs":["sighting details07\\14\\09 my son and i went into the backyard about 15:20 to throw baseball, he had a game later in the afternoon and wanted to warm up. while out throwing, we always hear aircraft in the sky, since there is airports near-by, and tend to look up at them briefly when we hear them. on this occasion though it sounded like an \"swooshing\" jet engine noise in the sky that abruptly stopped. i was looking around in the sky for the plane, when to the east i saw what at first looked like a brownish red balloon. when i realized it was too round to be a balloon, the object \"leveled off\" and seemed to reflect in the sun as rotated up and headed north-northeast. no sound was coming from the object. i called to my son, pointing and following the object in the sky. we watched as this object with no sound or a vapor trail sped out of view faster than anything i have ever seen. i am a veteran of the usmc that was stationed on airfields during my service. i have seen a lot of military aircraft. this was something that i have never seen before. thought about calling local media just to see if anyone else had seen this, but at time felt i would be ridiculed and embarrassed. my son seen it after it leveled off, but seen it speed away."],"trends":["There have been 31 other sightings in Winston-Salem","There were no other sightings in Winston-Salem on or around July 14th 2009"],"Object Shape":"Disc","map":"<A HREF = \"http://maps.google.com/maps?q=36.10436,+-80.240756(18096)&iwloc=A&hl=en\"> mufon case (18096) map </A>","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Latitude":"36.10436","City":"Winston-Salem","Longitude":"-80.240756","Date of the Event":"07/14/2009 03:30 UTC","Summary":"Seen round brownish-red object in sky before it leveled off and with no sound, sped away at an incredible rate of speed","files":["/var/www/straped/mufon/html2text/18096.html.txt","/var/www/straped/mufon/org/18096.html"],"Object Flight Path":"Stationary,Straight-line path","Date Submitted":"07/14/2009 03:30 UTC","Weather Factors":"Unknown","Log Number":"US-07152009-0010"}