{"Log Number":"US-07152009-0007","files":["/var/www/straped/mufon/html2text/18093.html.txt","/var/www/straped/mufon/org/18093.html"],"divs":["sighting detailsi was observing the moon overhead and a nearby planet (jupiter, i think) in the western sky when i noticed a small (or very high) bright white star-like object moving west to east, in a straight line and silently, on roughly the same plane as the planet i was observing but below the moon and approximately 75 degrees above the horizon. i instantly identified it, based my personal observations and previous experiences, as a near-earth orbiting object such as the shuttle that is currently in orbit or a satellite. after it had traversed about 3\\4 of the viewable sky it made an instant 90 degree turn south and increased speed by at least 4-5 times it's original rate and disappeared behind the treeline. i felt very shocked and disoriented by the sudden course change as i had already dismissed it as a readily identifiable object. there is no question in my mind that this was not a meteor, conventional aircraft, satellite or terrestrial spacecraft. nothing i know moves like that. the entire event encompassed no more than forty seconds, but i stood, staring at the sky, for several more minutes trying to comprehend or rationalize what i had just seen. it didn't work. it was my first sighting and although i always believed i wanted to see a ufo before this happened, i almost wish i had not seen it at all. it has fundamentally changed what i thought i knew about life and the universe around me and i will never again look into the night sky without thinking about this event. ok, i believe now."],"City":"Mesquite","Source":"MUFON","Object Flight Path":"Path with directional change","Longitude":"-96.593609","Object Features":"None","trends":["There have been 12 other sightings in Mesquite","There were no other sightings in Mesquite on or around July 15th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.776286,+-96.593609(18093)&iwloc=A&hl=en\"> mufon case (18093) map </A>","Date of the Event":"07/15/2009 05:46 UTC","Summary":"White star-like object moves West to East then South after a 90 degree turn.","Region":"Texas","Object Shape":"Star-like","Country":"United States","Date Submitted":"07/15/2009 05:46 UTC","Viewing Distance":"Over One Mile","Disposition":"Unknown","Latitude":"32.776286","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Case Number":"18093"}