{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.431976,+-85.006008(18097)&iwloc=A&hl=en\"> mufon case (18097) map </A>","Date Submitted":"07/07/2009 10:46 UTC","divs":["Sighting Details Myself and 2 others were outside to see the International Space Station pass over. (WLWT news out of Cincinnati announced when this would happen.) We saw the ISS pass over right on schedule, from the SW to NE...Visibility was perfect. After the ISS had passed, about 1 to 2 minutes later a 2nd \"satellite\" like object was on a very similar orbital path that the ISS was on. This object was also star like, but about one third the brightness of ISS. It had a more bluish color than the brilliant white of the ISS. The speed appeared to be similar or possibly a bit faster. The ISS was still barely visible to the NE. It seems that the ISS wouldn't be intentionally put in the same orbit as a satellite, so could this have been a resupply craft ? Are resupply craft ever unmanned as it would take some pretty precise manuvering to get close enough to ISS to transfer supplies ? The shuttle is still on the ground due to storm related launch delays at this time. We observed both objects through binoculars. We did not see any navigation lights or strobes as a plane would have... Any ideas what this may have been ? We lost site of the objects as they continued NE. It wasn't by any means spectacular, but was quite interesting. I'm not saying what it was or wasn't, I'm just asking if you folks know..."],"Disposition":"Unknown","Object Flight Path":"Undisclosed","Case Number":"18097","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Brookville","There were no other sightings in Brookville on or around July 7th 2009"],"Tags":"City","Weather Factors":"Unknown","Summary":"Whatever was following the ISS about 2 minutes behind it.","Log Number":"US-07152009-0011","City":"Brookville","Region":"Indiana","Longitude":"-85.006008","Date of the Event":"07/07/2009 10:46 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18097.html.txt","/var/www/straped/mufon/org/18097.html"],"Viewing Distance":"Unknown","Object Shape":"Star-like","Latitude":"39.431976","Source":"MUFON"}