{"Log Number":"US-07152009-0004","Latitude":"33.31398","Object Flight Path":"Stationary","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.31398,+-111.83195(18090)&iwloc=A&hl=en\"> mufon case (18090) map </A>","Sighting Duration":"Undisclosed","Disposition":"IFO","Object Shape":"Circle","Tags":"City","Weather Factors":"Unknown","City":"Chandler","Summary":"Was practicing my zoom on my camera on the moon when I noticed several bright orb like objects by the moon.","Longitude":"-111.83195","Object Features":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/18090.html.txt","/var/www/straped/mufon/more/18090_submitter_file1__Case18090MontesAlpes3qtrmoon.jpg","/var/www/straped/mufon/more/18090_submitter_file2__MareImbrium.jpg","/var/www/straped/mufon/more/18090_submitter_file3__MareImbrium(Alpen).jpg","/var/www/straped/mufon/org/18090.html"],"trends":["There have been 52 other sightings in Chandler","There were no other sightings in Chandler on or around July 14th 2009","This sighting has never been favorited.",""],"Country":"United States","divs":["sighting detailson 7\\14\\2009 at around 1:30, i was looking at the moon with my video camera. i wa practicing my zoom skills on my camera(it has a 2000x zoom). as i was looking at the lcd panel i noticed 3 bright orbs in a line directly to the right of the moon. the top being the brightest. the 3 orbs changed color and brightness. the lower 2 actually disappearing individually and reappearing. i started to film them. i filmed for about 2 min. i stopped recording to try to adjust the tripod but when i went to refocus in i couldn't get it to focus clearly(some cloud cover). i was very excited to see and capture these orb. at first, i wasn't sure i was really seeing it. my son came out and witnessed what i was filming and was equally excited. after i uploaded the video and had a chance to really look at it further, i notices that there is something else moving on the moon area towards the top right by a crater. you can view it at http:\\\\www.youtube.com\\watch?v=qen_c6ayskm or youtube marlorinaz1 \"amazing footage ufo's by moon\""],"Date Submitted":"07/14/2009 01:33 UTC","Case Number":"18090","Date of the Event":"07/14/2009 01:33 UTC","Source":"MUFON"}