{"files":["/var/www/straped/mufon/html2text/18113.html.txt","/var/www/straped/mufon/org/18113.html"],"Date of the Event":"07/16/2009 01:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.9604,+-1.150846(18113)&iwloc=A&hl=en\"> mufon case (18113) map </A>","Latitude":"52.9604","Disposition":"Unresolved","divs":["sighting detailsme and some friends were on the top of a hill in our town. bingham\\nottinghamshire. we were looking for shooting stars when a strange object came into sight. it was travelling east and although it appeared to be moving slowly. it must of been very high as it was star size. so in reality it was probly moving quickly. it wasnt a plane because it was too high and it was orange without any flashes. it couldnt of been a chinese lantern as it was far too high and didnt seem to flicker at all. i would of mistook this object for a satalite or a piece of space junk etc. but there was something very strange about its movement that we couldnt believe. it seemed the be slowing down slightly and then speeding up slightly and also seemed to move from side to side (very minutely) as if it was drunk or something! it did move in a straight path but it seemed to be moving in a gentle irregular fashion. it continued east towards granthem and went out of sight in cloud. no sound seemed to come from the object. all of this information is 100% true and i would personaly never make a hoax or anything because i am actualy interested in the subject of ufo's and i think hoaxers should be sent to prison! there was five of us that soor it and we were all pretty freaked out by it. unfortunately we didnt have a good enough camera on us to get an image. it would of took a very good camera to get a decent picture as it was so high."],"City":"Nottingham","Object Features":"Unknown","Source":"MUFON","Country":"United Kingdom","Region":"England","Sighting Duration":"Undisclosed","Object Shape":"Star-like","Date Submitted":"07/16/2009 01:15 UTC","Log Number":"GB-07162009-0005","Object Flight Path":"Straight-line path","Case Number":"18113","Tags":"City","Viewing Distance":"Over One Mile","trends":["There have been 4 other sightings in Nottingham","There were no other sightings in Nottingham on or around July 16th 2009"],"Summary":"Orange glowing object very very high up. Moving quite quickly","Longitude":"-1.150846","Weather Factors":"None"}