{"Object Shape":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/18117.html.txt","/var/www/straped/mufon/org/18117.html"],"Latitude":"39.220431","Date Submitted":"07/15/2009 09:30 UTC","trends":["There have been 10 other sightings in Grass Valley","There were no other sightings in Grass Valley on or around July 15th 2009"],"Longitude":"-121.054251","Object Features":"Undisclosed","Case Number":"18117","Summary":"3 blinking bright lights moving in night sky","Date of the Event":"07/15/2009 09:30 UTC","divs":["Sighting DetailsAt 2130 hrs, on Wed. July 15, 09..temp aprx. 85*slight breeze, when I stepped outside and stood on our deck (NW) looking up into the Western sky, I saw a bright light which I thought for a moment was a star though it did not look familiar...I about walked back in the house but stopped when I saw a similar light blinking & heading twoards this one (w)light, the second light stopped at a point to the right of the first one below it. The two lights both now blinked & continuously, then suddenly a third similar light (coming from a South direction)headed in the same direction as the other two.It also stopped below the top one and started blinking, these three lights were stationary and blinking for several seconds looked like a triangle..then the light on the right(North)started up and passed the light on the left and continued in the (s) direction the other light just came from.Then the light left below the top one started up and zipped into the direction the previous light had come from in the North,then the top light zipped off into a North east direction. When I say they zipped, they sped, moved fast...not like air craft we know of like airplane or airliner, helicopter whatever...these objects moved extremely fast when they did move...they continued to blink non stop. It is worthy to note that during this event the dogs in the neighborhood barked the whole time this was going on, my husbands pet bird was twirling around in his cage and making noises like it was scared, our outdoor cat took off again...how did I feel before the experience ?, I was restless, however I thought perhaps at the time it was due to the heat, and being tired.I cannot say how far these objects were, but far enough to say at first they looked like stars, very bright stars, I did not see form or shape other than that."],"City":"Grass Valley","map":"<A HREF = \"http://maps.google.com/maps?q=39.220431,+-121.054251(18117)&iwloc=A&hl=en\"> mufon case (18117) map </A>","Source":"MUFON","Log Number":"US-07162009-0009","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Region":"California","Sighting Duration":"Undisclosed"}