{"Date Submitted":"07/14/2009 09:50 UTC","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=32.82144,+-116.529184(18112)&iwloc=A&hl=en\"> mufon case (18112) map </A>","Date of the Event":"07/14/2009 09:50 UTC","Weather Factors":"Unknown","divs":["sighting detailsi was sleeping outside at the laguna campground, mt laguna, san diego county, on the night of july 14th, 2009 at approximately 9:50pm (21:50). i don't do drugs of any kind, and though on very rare occasions i have a drink or two, that night i hadn't touched any alcohol. i was laying on my back on top of a picnic table, near the foot of a very tall pine tree. my feet were pointing east, my head, west (the base of this picnic table is concrete and securely anchored to the ground, lengthwise, in an east to west (or west to east) orientation. it cannot be moved. i was staring straight up stargazing through the openings at the top of the tree. i suddenly felt disoriented, almost dizzy, as if i could feel the rotation of the earth or something. what was actually happening however was that three of the objects i had thought were stars were moving. they were in a scalene triangle formation (shortest side facing north) and spaced quite far apart. i have no idea how to estimate exactly how far apart they were spaced. if they had been satellites i'd guess the two making up the shortest side of the triangle could have been many miles apart. if they were beyond satellite altitude, they could've been hundreds of miles apart. there's really no way for me to make an estimate. as to their altitude i can only guess. i've seen my share of \"satellites\" and these seemed at least that high if not higher. they were most definitely higher than any fixed winged aircraft could fly (at least to my knowledge). the were moving more slowly than most satellites i've seen though, and they were moving in that triangle formation in a line that ran from the nnw to sse. i kept my eyes on them until they were obscured by the denser part of the tree, but i estimated where they might appear again on the other side, and sure enough they eventually appeared again as they cleared the tree. i followed them until they disappeared at just above the horizon. they never altered formation. when i say \"disappeared\", i'm mean became to dim to see. there was no sound that i could detect associated with these objects. it was a very calm\\peaceful night. i could hear bats above my head using their sonar, it was that quiet. there was no breeze to speak of. all night long i could hear random planes (prop and jet), and helicopters as they'd cross the sky and disappear their sounds fading with them, and distant traffic come and go, as well as people talking in distant campsites from time to time. but most of the time you could hear a pin drop, and i heard nothing coming from these objects."],"Case Number":"18112","Source":"MUFON","Log Number":"US-07162009-0004","Viewing Distance":"Unknown","trends":["There have been no other sightings in Pine Valley","This sighting has never been favorited."],"City":"Pine Valley","Object Features":"Unknown","Region":"California","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Summary":"Three, star-like, star-size, objects in a scalene triangle formation, traveling NNW to SSE","Latitude":"32.82144","Longitude":"-116.529184","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/18112.html.txt","/var/www/straped/mufon/more/18112_submitter_file1__UFOSighting.jpg","/var/www/straped/mufon/org/18112.html"]}