{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.372048,+-75.292676(18120)&iwloc=A&hl=en\"> mufon case (18120) map </A>","Tags":"City","Log Number":"US-07162009-0012","Case Number":"18120","Weather Factors":"Unknown","Date of the Event":"03/31/2009 12:00 UTC","trends":["There have been 5 other sightings in Perkasie","There were no other sightings in Perkasie on or around March 31st 2009"],"City":"Perkasie","Source":"MUFON","Longitude":"-75.292676","Date Submitted":"03/31/2009 12:00 UTC","Object Shape":"Circle","Summary":"Three aligned bright white objects in sky.","divs":["Sighting Details Hey UFO hunters, at first i didn't know who to talk to about this until i remembered that you were on the history channel. I live in Quakertown, Pa. I'm Michelle Erdman, age 20. My mother and I were heading home from eating at a restaurant in Perkasie, Pa, my father was in another car and did not spot them. Going onto the exit to head north on 309 about a month ago, very sorry i do not remember the date, when i should have logged it down. It was on a tuesday, that i remember. My mom spotted it first and i kept an eye on it while my mother drove. There were perfectly three aligned bright white objects in the sky, horizontally equal. It was when the sun was setting and the stars could not be seen well enough, but these objects, hovering at a stand still a few miles away approx. They were gone in 5min, with in a flash. I asked my father when I got home, because he was in the military and was a helicopter pilot so he knew if it would be a helicopter hovering, but he said that the only way they can do that is if they are landing. I know he believes in Extra terrestrial beings, but that heightened our alert. My mother said that there have been sightings at lake Nockamixon, only a 15min drive from where we were at the most. Over in Revere, Pa there is a place called ringing rocks, which is supposedly an odd sight that my have been ET workings. but I did not research that thouroughly. I hope this helps you out. If you have any questions just email me, I will be glad to answer them."],"Sighting Duration":"00:05:00","Latitude":"40.372048","files":["/var/www/straped/mufon/html2text/18120.html.txt","/var/www/straped/mufon/org/18120.html"],"Disposition":"Unknown","Viewing Distance":"Over One Mile","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Object Features":"Unknown"}