{"Sighting Duration":"01:30:00","Latitude":"32.692703","Longitude":"-108.478801","trends":["There have been 5 other sightings in Silver City","There were no other sightings in Silver City on or around July 17th 2009"],"Weather Factors":"None","Object Flight Path":"Straight-line path","Region":"New Mexico","Object Shape":"Triangle","Log Number":"US-07172009-0010","Tags":"City","Source":"MUFON","Case Number":"18138","Date of the Event":"07/17/2009 01:30 UTC","divs":["sighting details it's 2 am, i just came in from ufo sighting similar to the one i saw in the fall!! info: about 1 a.m.-ish i was in the kichen, listening to the tv weather station on satelite... i lost frequency with the satellite about 3 times and it just popped into my thoughts - ufo- go out and look --- sure enough, there it was...just coming over the back yard heading towards phoenix. triangle in shape, yellow\\white, red and then green lights flashing, with a bright white\\yellow at the nose, or point of the triangle. there was no sound, maybe a low, deep sort of slow continual wooshing. it traveled steadily and slowly. i raced indoors for my binoculars and phone, then watched for about 45 minutes as it slowly kept moving west towards phoenix. a few times it went straight down then up again. it was hard to keep my eyes on it. it was just a small orange object with my eyes, but with the binocs i could see the three colors flashing clearly. the white seemed to be on the top always, with the red on the bottom and the green in the middle. it seemed to just stall and stay in one place for quite a while, went down and back up a couple times, went down really low in front of the mountain range, then back up and moved fast to the right. it was constantly getting further away headed towards phoenix and interestingly enough suddenly some other flying objects appeared. one was probably a helicopter with a bright white light. then a small low flying oldish sounding plane. while these other flyers were out in the ufo area it sort of vanished. there was a band of heavy clouds it could have dropped down behind or into, or it just dimmed all its lights, turned off all color and just looked like a star. then a commercial jet going east from west came through this area. i was shivering so hard at this point from chill i had to go in. i went in circles debating who or if to call anyone, but it had vanished at this point. sighting was 07\\17\\09 at approximatly 1230 a.m. to 2 a.m."],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.692703,+-108.478801(18138)&iwloc=A&hl=en\"> mufon case (18138) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/18138.html.txt","/var/www/straped/mufon/org/18138.html"],"City":"Silver City","Date Submitted":"07/17/2009 01:30 UTC","Summary":"Triangle shape with flashing lights","Object Features":"Undisclosed"}