{"Object Flight Path":"Path with directional change","Date Submitted":"07/16/2009 10:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.581273,+-101.846406(18136)&iwloc=A&hl=en\"> mufon case (18136) map </A>","divs":["Sighting DetailsA friend and I were outside having a cigarette when I spotted a bright white light in the western sky. The light did at first appear very much to be a star. I could see no blinking lights. After only a few seconds it became very obvious that the light was moving and heading east, my next thought was it is an airplane. We have an international airport in lubbock so I am accustomed to seeing atleast 10-15 planes on any given night. i saw the object make a sudden sharp change in direction due north, after maybe two or three minutes of moving southeast. At that point i could see what appeared to be a much smaller and different shade of white flashing on what I will call the back end of the object and what appeared to be the bottom. Suddenly the object made another sharp direction change heading back east. within only a few minutes we could see this object growing much larger seemingly flying very low and very slow directly over the loop which it right in front of my apartment. I felt like I would have been able to reach out and touch this object. Definately not any airplane I have ever seen. There was a distinctive set of two rows of lights, a top and bottom row, if you will. The top had a very pronounced set of white beams or bar looking lights. The top had a blue flashing light on the western corner, the bottom had a red flashing light on the eastern corner, the rest were hot white. Even though this object appeared to be flying low and slow, however, based on the original point I first spotted it, this thing was massive and moving very, very fast. For a split second we saw the object make another sharp direction change to the north once again. While the object was turning we could see a very distinctive triangular shape to the object. The very interesting thing was were we could not see a lights it really just looked as though there was nothing there, just sky and the few scattered clouds in the sky. Oh and did I mention that we never heard any kind of sound from this thing! This is one of the best sightings I have had yet. I couldn't explain it. :)"],"Latitude":"33.581273","files":["/var/www/straped/mufon/html2text/18136.html.txt","/var/www/straped/mufon/org/18136.html"],"Country":"United States","Source":"MUFON","Longitude":"-101.846406","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Disposition":"Hoax","Case Number":"18136","trends":["There have been 18 other sightings in Lubbock","There were no other sightings in Lubbock on or around July 16th 2009"],"Sighting Duration":"Undisclosed","Region":"Texas","Object Features":"Other","Weather Factors":"Windy, Lightning, Light, Does Not Apply","City":"Lubbock","Object Shape":"Square, Rectagular, Triangle","Date of the Event":"07/16/2009 10:10 UTC","Summary":"Huge rectangle/triangular object with bars of white light seen over loop 289","Log Number":"US-07172009-0008","Tags":"City"}