{"Date of the Event":"07/17/2009 12:00 UTC","Object Flight Path":"Path with directional change","Weather Factors":"None","Region":"Iowa","Viewing Distance":"Over One Mile","Tags":"City","Object Shape":"Sphere, Star-like","Date Submitted":"07/17/2009 12:00 UTC","divs":["Sighting DetailsWhile taking my dog on a nightly walk from 9:15pm to 10pm, I noticed a bright solid red object that was in the lower eastern horizon. I thought it was Venus at first since I've seen Venus in this area over the past few weeks. As I was walking my dog I noticed the solid red object was in a slightly different area, which I didn't think a whole lot about it, so I kept walking. I initially thought it was an airplane with it's landing lights on flying toward me. A little later while I was still walking that object was again in a different area of the lower to mid eastern horizon. So I started to watch the solid red light periodically. I stopped to see if it was actually moving, so I looked at it through a tree branch and noticed it was indeed moving very, very slowly (about like a hot air balloon speed, but a little bit faster). So I decided I was going to head home and get my binoculars to see just what it was. So at 10pm I was at my house and that solid red light was above my house, but it was way up in the sky. I ran into my house and in 10 seconds or less had my binoculars and was back outside. Now mind you, as I was getting my binoculars I thought to myself, \"you wait, as soon as you get back outside it will be gone\" and I also thought, \"I bet I'm gonna wish I had someone watch it while I get my binoculars.\" Sure enough when I came back outside, the red light had completely vanished from the sky. I looked all around and it was nowhere. So this is what I concluded: 1. The light was not an airplane since it did not have any flashing lights whatsoever and was solid red 2. Not only was I watching that object, but that object must have been watching me and 3. That object somehow knew what I was doing (getting binoculars) and disappeared. I know that maybe jumping the gun as far as a conclusion, but to be watching an object in the sky for half and hour move from the southeast horizon to the northeast horizon and then gradually go above your house, only to disappear within 10 seconds when you go to get something to view it better, that's what I've concluded. I was also very angry after the whole thing because I feel like that light was just messing around with me. It knew I didn't have something to see it up close and when I went to get something, it vanished. I did see a similar bright red object a couple of months ago that was flying in a straight line from west to east while walking my dog. While watching it I was distracted by a light (like a super fast flying firefly) that went above my head towards the object, when I looked back for the red light, it has disappeared. This could have been that same solid red light except it was flying in a straight line from west to east and much faster at the time. I told a couple of friends about it at the time. Tonight it was flying in a random floating pattern. I don't know it it's the same object, but both were solid red lights with no flashing lights like an airplane would have. This also happened to me about 4 years ago in the same area where a solid light was flying over and disappeared when I went to get my binoculars (I don't remember the color of that light anymore, however). I decided to report it this time, because having this happen to me 3 times in the past 4 years or so, it's time to report it. I'm actually getting tired of this happening."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.049196,+-91.681525(18135)&iwloc=A&hl=en\"> mufon case (18135) map </A>","Log Number":"US-07172009-0007","trends":["There have been 2 other sightings in Hiawatha","There were no other sightings in Hiawatha on or around July 17th 2009"],"Latitude":"42.049196","Sighting Duration":"Undisclosed","Object Features":"None","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18135.html.txt","/var/www/straped/mufon/org/18135.html"],"Case Number":"18135","Summary":"Solid RED object about the size of venus that vanished","Source":"MUFON","Longitude":"-91.681525","Country":"United States","City":"Hiawatha"}