{"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=36.296061,+-119.142052(18145)&iwloc=A&hl=en\"> mufon case (18145) map </A>","Region":"California","City":"Exeter","Date of the Event":"05/02/2009 12:00 UTC","Summary":"I see them everynight .","Country":"United States","Log Number":"US-07182009-0001","Object Shape":"Diamond, Flash, Star-like","Longitude":"-119.142052","Weather Factors":"Unknown","divs":["Sighting Details My ufo sighting has been going on for aprox. 3 months. I got interested in quite by accident. One night I went to sit out and observe the skies. Boy! did I ever get a surprise.The skies are full of them. I have observe them both night and day for the last three months. I have a process that I go through to get my eyes accustomed to seeing that far. I estimate they are 200 to 250 miles high. I estimate their speed between 20,000 mile per hour to over 100,000 miles per hour. I get my mph and altitude estimate for the space station as it flies over. They always home in on this one spot. I have counted as high a 50 ( I know that I proberly missed a lot of them ). They come from the east and from the west, and they all stop at the same place each night. It just so happens that the place where they stop is directly above area 51 at groom lake. They have to be connected. I have heard charles hall speak of the alien base in this area. I have got a lots of laughs and redicule from everyone that I tell this to. But it is real and it's my truth. Sincerely Chuck."],"Source":"MUFON","Object Features":"Unknown","Case Number":"18145","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"05/02/2009 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","Latitude":"36.296061","trends":["There have been 2 other sightings in Exeter","There were no other sightings in Exeter on or around May 2nd 2009"],"files":["/var/www/straped/mufon/html2text/18145.html.txt","/var/www/straped/mufon/org/18145.html"]}