{"Latitude":"36.359799","Longitude":"-94.285208","Weather Factors":"None","divs":["Sighting DetailsTonight was the first night of the Perseids meteor shower, so I was in my backyard to see if I could spot any. I was looking almost due north, toward Polaris, when I saw a flash of light close to the big dipper. I watched, because I thought I missed a meteor, and it flashed again. This was not airplane lighting (I live on the approach to XNA and see planes all the time). I've seen satellites go over before, and they're a constant light, not a flashing one. The flash was not fast, and the begining of the flash was slightly dimmer than the end of the flash. As I watched, it flashed five, or maybe six times, moving between the bottom star of the big dipper and Polaris in a straight line. The rate of the flash was maybe once every three to five seconds. I couldn't tell the speed of the object, as I couldn't tell the altitude. Then it stopped flashing. There were no clouds tonight. My feelings, reactions, and actions - Had to text my wife (she's at work). Don't know if it had anything at all to do with it, but about 5 minutes after I saw this, the neighborhood dogs started barking. Usually that doesn't happen unless there's an emergency vehicle siren, and there wasn't. I don't have video on my iPhone - sorry, wish I did because this would have been cool to catch."],"Object Features":"Unknown","Viewing Distance":"Unknown","Region":"Arkansas","Disposition":"IFO","Case Number":"18144","City":"Centerton","Date of the Event":"07/17/2009 09:38 UTC","Tags":"City","Log Number":"US-07172009-0016","Country":"United States","Source":"MUFON","Object Shape":"Flash","Date Submitted":"07/17/2009 09:38 UTC","files":["/var/www/straped/mufon/html2text/18144.html.txt","/var/www/straped/mufon/org/18144.html"],"Summary":"Flashing object traveling west to east","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Centerton","There were no other sightings in Centerton on or around July 17th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.359799,+-94.285208(18144)&iwloc=A&hl=en\"> mufon case (18144) map </A>"}