{"Log Number":"US-07172009-0013","Weather Factors":"None","Disposition":"Unknown","Latitude":"42.323662","Case Number":"18141","Summary":"saw a small disc shaped light transverse the sky, the luminosity from the craft was even and bright the whole time, no wings, no sound, no reflection from sun","map":"<A HREF = \"http://maps.google.com/maps?q=42.323662,+-84.015323(18141)&iwloc=A&hl=en\"> mufon case (18141) map </A>","Date of the Event":"06/19/2009 07:30 UTC","trends":["There have been 7 other sightings in Chelsea","There were no other sightings in Chelsea on or around June 19th 2009"],"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Shape":"Disc, Egg","Longitude":"-84.015323","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18141.html.txt","/var/www/straped/mufon/org/18141.html"],"Object Features":"None","Country":"United States","Tags":"City","Date Submitted":"06/19/2009 07:30 UTC","divs":["Sighting DetailsThe event took place a little north of Chelsea, in Washtenaw County, Michigan-about 8pm sometime in June (it was well before sunset). I did not have internet available or I would have reported it right away. I also feel that this event could have been visible in the counties surrounding since it was so high in the sky. I want to describe the object as an 'almost flattened egg' (or flattened oval shape)**, not a disc or saucer, but an oval that was about three times as long as it was thick. The flattened oval shaped glow of light, which was approximately the length of about three venus's right next to each other, and roughly the same width for that matter, but it was not as bright as venus is, I would say about 60% of the brightness of venus (when it's at it's brightest). It reminded me of the glow seen from one of those daylight compact flourescent lights (but brighter), it was evenly distributed light and it never changed luminosity as it transversed the sky from northwest to southeast. It flew at about the rate that a satellite usually moves across the sky at night. The rate was constant, no acceleration or deceleration, nor was there any sign of sound anywhere near it, or behind it. It caught my eye right as it came over the tree line in the distance over the lake, from having a physics background I expected the light to dim as it moved southeast, since I thought for sure it was the reflection of the sun- however after closer observation I noticed the light never changed the whole time, and the light was dimmer and a different color than what the reflection of the sun would have been on an airliner, etc. Based on my observation the 'flattened oval shaped light' must have been self-illuminated to explain how it looked. The event seemed like it was about a minute and a half, but time was kind of weird for me, since I was in awe. I had time to run in the house and tell my wife, who was a witness as well as we watched it. I personally believe it was some craft in orbit due to the speed and behavior it exhibited overall, but my wife says that it looked like it could have been as high as a jet, so it was definitely in between 30,000 ft and low earth orbit. If anyone has seen this in Michigan, please report it, I am not sure of the exact date, but we deduced it to June 19th, around 7:30pm. Don't just read this and say, 'yeah I saw it too' Please report it. Thanks! ** When I say almost flattened oval, I just mean it wasn't a cigar, since it had more roundess and thickness, but like I said, longer than wider oval, by a ration of 1:3 (width:length)"],"City":"Chelsea","Object Flight Path":"Straight-line path","Region":"Michigan"}