{"Object Flight Path":"Stationary,Straight-line path,Path with directional change,Other","Date Submitted":"03/14/2009 12:00 UTC","Weather Factors":"None","Tags":"City","divs":["Sighting Detailsthe object i've seen flying all over my country area lasted for about 1 week. it was middle of march 2009. those U.f.o. were sometimes groups from 3 to 5 units and just one time i saw just one of them, in single. and it was the bigger one. at the beginning i thought it was a plane or a group of planes because i live near Malpensa (italian international airport) but looking at them better i started to understand that the perspective of those voving objects were incredible. the were moving too fast and they could get lighter and more brillant as they come near and as they go away. i mean...if it was a plane it shuld have got more brilliant coming forward and the contraty. but it wasn't. by the way a plane doesn't have white light back. they didn't show red or green light as planes. and i can see many planes every day and night here. i almost know every international track that pass in here. they were spheres, circle white spheres. one of those nights i tried to follow them because it was so near and big. like a ball over me and as i got closer it started to fasten (i was in my car and driving). at the end i lost it. but i wanna underline that if it was a plane and i was stupidly following it, it was too low and it was flying in reverse. i say again that this unknown objects were present in my skies for about one week. i cannot explain what they were. i sure know they were not planes or gases or some kind of atmospheric penomena. i'm a scientist and i can analyse things."],"files":["/var/www/straped/mufon/html2text/18147.html.txt","/var/www/straped/mufon/org/18147.html"],"trends":["There have been no other sightings in Limido Comasco","This sighting has never been favorited."],"Disposition":"Unresolved","Date of the Event":"03/14/2009 12:00 UTC","Longitude":"8.980944","Case Number":"18147","Object Shape":"Circle, Sphere","Region":"Lombardia","Country":"Italy","Latitude":"45.690167","Log Number":"IT-07182009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=45.690167,+8.980944(18147)&iwloc=A&hl=en\"> mufon case (18147) map </A>","Summary":"u.f.o flying (single or group) for more than one day. fast movement. incredible prospective view.","Viewing Distance":"101-500 Feet, Over 1 Mile","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","City":"Limido Comasco"}