{"Tags":"City","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.670662,+-87.735582(18159)&iwloc=A&hl=en\"> mufon case (18159) map </A>","Date of the Event":"07/18/2009 08:10 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI just came out of the Home Depot in Alsip located on Cicero and 122nd and looked up in the sky at the sunset. I was looking straight west when I saw this black object moving under the clouds and it looked like it was going to fly directly over my head. As it got closer it turned out to be on a southeastern path which was diagonal from my position. I got a pretty good look at it. It was black and it was larger on the top than on the bottom. Kind of like an egg that was upside down. When I saw it in the distance I thought it might be a helicopter because it was flying at the same altitude that helicopters and small planes usually fly in this area. I was waiting for the sound as it got closer and there was none. When it got pretty close to Home Depot I can clearly see that there were no rotor blades or wings of any kind. It was totally silent and maintained the same level the entire time. It looked like it was going to cross just west of the intesection of 127th and Cicero. I watched it until it was too far away to see anymore. It looked like it kept the same flight path until it was out of veiw. I tried to take a picture with my cell phone but, I couldn't get it in view of my cell phone fast enough. The entire sighting took about 3 minutes. It was moving along at a pretty good pace. Probably a little faster than a small plane."],"Object Shape":"Egg","Disposition":"IFO","trends":["There have been 5 other sightings in Alsip","There were no other sightings in Alsip on or around July 18th 2009"],"Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"07/18/2009 08:10 UTC","files":["/var/www/straped/mufon/html2text/18159.html.txt","/var/www/straped/mufon/org/18159.html"],"Object Flight Path":"Straight-line path","Longitude":"-87.735582","Summary":"Looked like a black upside down egg.","Object Features":"None","Latitude":"41.670662","Country":"United States","City":"Alsip","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07182009-0015","Case Number":"18159"}