{"Object Flight Path":"Path with directional change","Latitude":"44.054465","map":"<A HREF = \"http://maps.google.com/maps?q=44.054465,+-82.991314(18151)&iwloc=A&hl=en\"> mufon case (18151) map </A>","Log Number":"US-07182009-0007","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/18151.html.txt","/var/www/straped/mufon/org/18151.html"],"Summary":"We saw a huge translucent triangle which later seperated into several smaller lights.","Sighting Duration":"00:30:00","Date Submitted":"07/08/2009 10:05 UTC","Date of the Event":"07/08/2009 10:05 UTC","Weather Factors":"Unknown","trends":["There has been one other sighting in Port Austin","There were no other sightings in Port Austin on or around July 8th 2009"],"Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","Case Number":"18151","divs":["Sighting DetailsOn July 8th my fiance and I drove to Port Austin to watch the sun set on lake Huron. Her parents live just a few hundred feet from Magraw Park on M-25, so we parked there and walked to the park. They were closing the park gates as we arrived at 10:oo p.m. As far as I knowe we were the only people on that section of beach. As we were watching I started to here a low rumble not unlike a jet engine but much lower in tone. It was a clear cloudless sky. I commented to my fiance about how close the sound was (sounded like it was right above us), we both searched the sky but could not locate the source of the sound. I am familiar with this particular sound because for some time I have heard that very sound in this area and never saw any craft to cause it. As a child I lived on an airforce base in Arizona , so I am also familiar with the sound of jet engines. This was different. More slow and steady. The sound seemes like it came from the south, headed north, and faded away. A few minutes later the sound returned. I looked behind me to the south and in the sky above the tree line I saw a triangle of lights, three points making each side, and four lights in the center making a square. It turned in place and moved forward to the north, right above us and out over the lake. It was approximately 200-300 feet high, very large. As it went over us we noticed you could see the triangle, but whatever was behind it you could see as well, like you could see through it. If it passed in front of a star, you could see the star through it. It continued over the lake until it was out of sight. I would like to add that although the lights made the outline of the triangle it definately appeared that there was a shape independant of the lights. We decided to leave.By now it was around 10:30. WE left and took Kennedy rd. to Oak Beach rd.. As we were traveling on Oak Beach, just a few miles from the beach, I saw out my passenger window the same craft or one just like it right beside us. I told my fiance to stop the car. We got out and watched the craft pass us going toward the beach and as it neared the beach the kights all seperated into pairs. Eacch pair went in a different direction. The pairs, three I think, started blinking their lights as if signalling to eachother blinking in rapid, definate patterns. They were small, white lights. What was odd was that, unlike the beach, we never heard these craft at all. The lights appeared to be doing maneauvers. They would move and change direction in unison. Moving sometimes vertically, sometimes horizontally. After watching for maybe 10 minutes we decided we had seen enough and decided to leave. We got in the car and all of a sudden right above us, straight up and down, very close, four very bright , big lights came on in the sky. We were speechless. It was very strange because the lights looked so bright that they should of lit up everything around us but they did;nt.Everything around us appeared as dark as it was before. The bottom light would disappear and one would appear at the top of the collumn at the same time making it appear as if it were climbing. It did this a few times then one of the small lights appeared at the top of the collumn and it took off straight up and the four bright lights disappeared. We were pretty spooked at this point and left, but when we did the smaller lights were still up there moving around. We both got the impression that when those four lights came on it was a deliberate attempt to get our attention. I have had other experiences in the past. I would like to speak to someone about them but don't know how to go about it. Please contact me asap."],"Region":"Michigan","Source":"MUFON","Object Shape":"Triangle","Longitude":"-82.991314","Disposition":"Unknown","City":"Port Austin"}