{"City":"Sherwood","Sighting Duration":"Undisclosed","divs":["sighting detailsevery night for the last three months i have witnessed the appearance of ufos that my family and i have decided to call \"spinners\" in the night skies over our home in sherwood oregon. to the unaided eye, they have the appearance of very bright stars with a distinct shape and brilliant light, with flashes of color. with binoculars you can see the underside of the crafts spinning. for the most part they stay stationary in specific spots, but lately, as early as 10.00 p.m. we have seen them flying low overhead. they make no noise and flash green, red, and brilliant white-yellow lights. one night i counted 18 in just one area of the sky. i have seen one fly so low and close to me that i could have stood on my balcony and hit it with a rock. there is a weird whooooooosh sound around 5:00 or so every morning when they leave. the last to leave is a brilliant yellowish white object that has the appearance of a huge star over the left hand side of my neighbors roof. i can see it from my bed and many nights just lie there and watch till they are gone. sometimes you can hear a pulsing sound that almost has a musical tone to it.. nearly every night we lay out on the trampoline in the back yard and watch them, and also see oval shaped crafts flying silently overhead, sometimes they just flat out stop, and \"park\" for lack of a better word. one actually parked in the handle of the big dipper the other night! on four occasions i have seen a triangle shaped craft with a light in each corner. i have seen that four times. three times it was just flying silently higher up -it also had multicolor light on the underside of it. when i saw it the first time it was a close encounter. my daughter and i were lying in bed having a girls night a night my husband grabbed a graveyard shift. we were watching a movie and she was dozing when i heard a loud pulsing humming noise, the house actually vibrated. there was a flash of light above our house i jumped off the bed and ran out on the patio and there hovering directly over our neighbors roof,( close enough for me to hit if i threw something at it) was the triangle shaped craft, pulsing and humming then it took off slowly. it was huge. the noise it made as it was leaving woke up my daughter who saw the tail end of it. i have also seen luminous flying things on more than one occasion. that seem to have the same appearance as a jellyfish as far as definite outlines with illuminated transparent insides. my husband and i saw one that was a v shape but had one side a bit longer. there were 7 luminous round objects inside it-3 on one side, 4 on the other. it floated silently through the night sky like a ribbon blowing in the wind. i have also seen something luminous with wins, and very recently i noticed a strange light that came out from the area where the really bright brilliant yellowish white star\\craft was. i stared at it and suddenly got the distinct impression it saw me staring at it because it came straight towards the sliding glass doors off our balcony where i was watching from really fast. (which scared the crap out of me) then started flying figure 8s- at which point i went out on the balcony. i watched it fly loops overhead and then ran down to get my binoculars it was gone. last night we saw 4 flying spinners, three of them flying very low. one at 10:30, another at 1:00 and the last at 3:30. when i saw the 2 flying spinners last night i decided to try to find someone to report this stuff to, because the activity seems to be escalating though the ufos don't scare me, the things i have seen darting in the sky over our house are beginning to freak me out. i hear helicopters much of the time in the middle of the night and we have been bombarded with chemtrails for the last several months. i have one pic of a disc shaped object in a chemtrail. i have no pics or videos because it is too dark for my mac to pick up. i am trying to find some way to record this because it is literally every night and it frustrates me not to have tangible physical evidence other than the members of my family and me. have you had any other reports of similar things in this area? i can't believe my family and i are the only ones noticing! i don't mind if you use my first name but would like you not to publish my last name. thank you so much! sandy"],"Object Shape":"Boomerang, Bullet, Missile, Circle, Disc, Flash, Oval, Star-like, Triangle, Unknown","Weather Factors":"Windy, Light","Date Submitted":"07/17/2009 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.365967,+-122.836118(18156)&iwloc=A&hl=en\"> mufon case (18156) map </A>","Disposition":"Unknown","Viewing Distance":"20 Feet or Less, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Date of the Event":"07/17/2009 10:30 UTC","Object Features":"Dome, Appendage(s), Wings, Unknown","Country":"United States","trends":["There have been 4 other sightings in Sherwood","There were no other sightings in Sherwood on or around July 17th 2009","This sighting has never been favorited.",""],"Latitude":"45.365967","Region":"Oregon","Log Number":"US-07182009-0012","Tags":"City","files":["/var/www/straped/mufon/html2text/18156.html.txt","/var/www/straped/mufon/more/18156_submitter_file1__strangelightsatnight.jpg","/var/www/straped/mufon/more/18156_submitter_file2__3discsinchembank.jpg","/var/www/straped/mufon/more/18156_submitter_file3__3discsinchembankenhanced.jpg","/var/www/straped/mufon/org/18156.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Summary":"We see them every night...","Longitude":"-122.836118","Case Number":"18156"}