{"City":"Independence","Object Shape":"Oval","Source":"MUFON","Country":"United States","Case Number":"18153","Summary":"I glanced up while driving and I saw what appeared to be a very bright, shiny silver metallic object moving slowly southbound at a steady height.","Disposition":"Unknown","Tags":"City","Weather Factors":"None","Longitude":"-94.411627","Region":"Missouri","Object Flight Path":"Straight-line path","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around June 26th 2009"],"Latitude":"39.093046","map":"<A HREF = \"http://maps.google.com/maps?q=39.093046,+-94.411627(18153)&iwloc=A&hl=en\"> mufon case (18153) map </A>","Viewing Distance":"Unknown","divs":["Sighting DetailsIn Independence Missouri, at about 2:35 pm June 26th 2009, in a completely clear, bright sunny day with a wide open blue sky...I saw something like nothing I've ever seen before. I was driving to work, westbound on 23rd St between Noland and Chrysler when I looked up and saw something very silvery and shiny in the sky directly in front of me and about midway between the downtown Kansas City horizon and the roof line of the windshield of my car. It was far away but my first thought was that it didn't appear like any airplane I've ever seen. Being as close as we are to a major airport, most airplanes we see around here are either ascending or descending. This was headed straight south (which from the airport should have been ascending) but kept a steady height. I couldn't see it clearly enough to really give a very detailed description and this entire episode happened within a matter of about five seconds: I glanced up while driving and I saw what appeared to be a very bright, shiny silver metallic object moving slowly southbound at a steady height. My first thought was \"Hmmm...what an odd appearing plane.\" and I glanced down to check the traffic in front of me. I glanced back up, still there, still moving south very slowly. My thought then was \"Hmmm...how strange that it's flying south but it's not assending as it should be, moving in a completely straight, level way. How weird.\" I still thought it might be a far off airplane although I realized that there was something extremely odd about it. I guess my mind was trying to translate what I was seeing into something I was familiar with. I glanced down and back up one more time and the object was completely gone! I leaned forward and searched the sky but could see no hint of the object whatsoever. Again I state...there were NO clouds in the sky, just a clear open blue sky. Twice I leaned forward to check the expanse of sky because I could not believe that this object had just disappeared completely. Then I looked around me to see if anyone else had seen it and was looking as crazed as I was. (They weren't.) This is the first time in my life that I've ever seen anything like this and I would love to know if anyone else saw what I did. I'm not a UFO enthusiast but I've always had an open mind about such things. As a matter of fact, when I was a child I was actually terrified of the prospect of UFOs and aliens. (It was the 70's and I had an older brother that told me terribly frightening stories and I was not yet old enough to not be gullible. lol) My friends and family have treated me with a mixture of chuckling disbelief and incredulity, although they know that it's very unlike me to make something like this up."],"Object Features":"Unknown","Log Number":"US-07182009-0009","Date of the Event":"06/26/2009 02:35 UTC","Sighting Duration":"00:00:05","Date Submitted":"06/26/2009 02:35 UTC","files":["/var/www/straped/mufon/html2text/18153.html.txt","/var/www/straped/mufon/org/18153.html"]}