{"Case Number":"18167","Latitude":"44.764457","Object Flight Path":"Hovering then path,Path with directional change","Log Number":"US-07192009-0005","Object Features":"Window(s), Patterned Surface, Appendage(s), Louvres","Tags":"City","Region":"Michigan","Disposition":"Unknown","City":"Traverse City","Longitude":"-85.613652","Date of the Event":"08/19/2008 11:20 UTC","trends":["There have been 13 other sightings in Traverse City","There were no other sightings in Traverse City on or around August 19th 2008"],"Object Shape":"Star-like, Triangle","files":["/var/www/straped/mufon/html2text/18167.html.txt","/var/www/straped/mufon/org/18167.html"],"Summary":"On multiple occasions, almost every night , floating across sky, tree level in horizon. Hovers, sometimes totally silent ocasionally turns on sound.","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.764457,+-85.613652(18167)&iwloc=A&hl=en\"> mufon case (18167) map </A>","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsWhile driving through Kingsley, Michigan at approx. 11pm in mid. August 2008 My wife and I noticed an object that resembled a plane but was too low, too bright, and did not make a noise, It flew across the sky about a half mile up and North of us, it was heading West at the time. Maybe 20 min. later, we entered Traverse City. At the intersection of Birmley Road and Key Stone Road where we looked up and seen a, what looked like a metal framed, triangular object with a main window in the front center, and red, white, and blue lights, one of each color, with two bright beaming spot lights in the center near the front. This time the object was only about 50 yards in the air hovering straight above our vehicle in the same spot or moving very slowly, it made little to no noise, possibly a light humming noise. I slowed my car down and it sped up a little. The object changed direction from East to North hovering across the trailer park on Birmley Road. We turned around and tried to follow the U.F.O. but it was gone beyond the treeline. we see what looks like the same one occasionally but never as close as the encounter on birmley road. The object looked like it was 20ft. wide x 30ft. long and possibly 4 to 5ft. in height. (it looked thin) it did not seem threatening but rather mysterious and amusing, it looked to be traveling approx. 5-10mph. truth, A.V.N."],"Country":"United States","Weather Factors":"Windy, Light","Source":"MUFON","Date Submitted":"08/19/2008 11:20 UTC"}