{"Date Submitted":"07/18/2009 11:20 UTC","Object Shape":"Fireball, Sphere","Tags":"City","divs":["Sighting DetailsSighted from North Lake apartments around 11:20pm lasting for several minutes. The object emerged from a wooded area across from the apartment complex and ascended in altitude, depending on the actual size of the object it could have been very close. It traveled from the northeast to ESE of our position. The object was luminescent color very similar to the amber color of common streetlights. The object ascended, changed course once it was east of us and travelled away from the planet until it was no longer visible (or obscured by light cloud cover). The first pass lasted approxiamately 2 minutes and the second pass occurred a minute or two after the first. We walked around to get a better vantage point at the northeast side of the complex but there was no third pass. At this very moment i am watching for another occurrence. This is the first report i have made but it is not the first time i have witnessed this same type of object. NO EVIDENCE THIS TIME. SORRY. ~justin"],"files":["/var/www/straped/mufon/html2text/18163.html.txt","/var/www/straped/mufon/org/18163.html"],"Object Features":"Other, Unknown","Latitude":"41.691194","Country":"United States","Date of the Event":"07/18/2009 11:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.691194,+-85.975017(18163)&iwloc=A&hl=en\"> mufon case (18163) map </A>","Source":"MUFON","Summary":"2 objects, or one object passing by twice in elkhart Indiana area.","Region":"Indiana","Object Flight Path":"Path with directional change,Path then hovering,Unknown","City":"Elkhart","Longitude":"-85.975017","Weather Factors":"Unknown","Case Number":"18163","trends":["There have been 12 other sightings in Elkhart","There were no other sightings in Elkhart on or around July 18th 2009"],"Log Number":"US-07192009-0001","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Sighting Duration":"Undisclosed"}