{"City":"Hammond","divs":["sighting detailsmy family and i were sitting around in our backyard on the evening of july 4th watching fireworks when i saw a red\\orange sphere shaped object coming from the south. i knew it wasn't an airplane because of the way it moved in the sky...i didn't mention it. two seconds later my wife noticed the second one and pointed it out to the rest of us;she joked that it was a ufo. we tried to right it off as a firework at first but when it turned right and went straight up into the sky until we couldn't see it anymore, we started to think it might have been something else. a second later a third object came and did exatly what the first and second one did and thats when i asked my aunt and cousin to take a picture. we were in awe. the fourth one came and mimiced the first,second and third. these are the pictures that were taken from a cell phone and camera..."],"Sighting Duration":"Undisclosed","Longitude":"-87.495111","Summary":"Saw four sphere shaped objects,shing red and orange come from the south towards me and stopped briefly before slightly turning to the right and going straight up, one by one.","Date of the Event":"07/04/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.588069,+-87.495111(18161)&iwloc=A&hl=en\"> mufon case (18161) map </A>","Case Number":"18161","Weather Factors":"Unknown","Region":"Indiana","Date Submitted":"07/04/2009 12:00 UTC","Object Flight Path":"Path with directional change","Tags":"City","trends":["There have been 8 other sightings in Hammond","There were no other sightings in Hammond on or around July 4th 2009","This sighting has never been favorited.",""],"Log Number":"US-07182009-0017","Latitude":"41.588069","Object Features":"None","Country":"United States","Source":"MUFON","Object Shape":"Sphere","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/18161.html.txt","/var/www/straped/mufon/more/18161_submitter_file1__1.jpg","/var/www/straped/mufon/more/18161_submitter_file2__twoinonephoto.JPG","/var/www/straped/mufon/more/18161_submitter_file3__Photo00841.jpg","/var/www/straped/mufon/org/18161.html"],"Disposition":"Unknown"}