{"Sighting Duration":"Undisclosed","Object Shape":"Star-like","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around July 18th 2009"],"Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/18169.html.txt","/var/www/straped/mufon/org/18169.html"],"Summary":"3-14 points of dancing white lights visible for ~45 minutes","divs":["Sighting DetailsDuring a walk around Virginia Lake, in Reno, the two of us sat on a park bench and looked SE over the North tower of the Peppermill casino and saw a group of white lights (star point) varying between 3 and ~14 (mostly ~10) \"dancing\" in the eastern sky just under Saturn for at least 30 minutes (estimate 40-50 minutes). The lights each lasted for several seconds to several minutes and moved in smooth arcing patterns erratically back and forth within a a fist sized (at arms length) area of the sky. Toward the end a flashing light on a straight trajectory (probable airplane) approached the area and flew through it. During the approach the lights diminished to just one, then as the plane disappeared 2 more lights appeared, the 3 \"danced\", as had the previous larger group, and over ~ 5 minutes and then disappeared one by one. No further activity was noted for several minutes and we walked the 3 blocks home and entered this report. During this episode a couple (man and woman) walked by and were questioned whether they saw the lights as well. They acknowledged seeing them."],"Latitude":"39.532033","map":"<A HREF = \"http://maps.google.com/maps?q=39.532033,+-119.806273(18169)&iwloc=A&hl=en\"> mufon case (18169) map </A>","Longitude":"-119.806273","Case Number":"18169","Viewing Distance":"Over One Mile","Date Submitted":"07/18/2009 11:15 UTC","Object Flight Path":"Path with directional change","City":"Reno","Log Number":"US-07192009-0007","Date of the Event":"07/18/2009 11:15 UTC","Disposition":"Insufficient Data","Source":"MUFON","Tags":"City","Region":"Nevada","Weather Factors":"Unknown"}