{"Object Flight Path":"Hovering then path","Region":"Nebraska","Latitude":"41.261763","City":"Omaha","Tags":"City","Summary":"circular light","Date of the Event":"07/18/2009 09:30 UTC","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around July 18th 2009"],"Log Number":"US-07192009-0003","Date Submitted":"07/18/2009 09:30 UTC","Object Features":"Unknown","Case Number":"18165","Viewing Distance":"Unknown","divs":["Sighting DetailsWe were at a friends house and noticed what first appeared to be a plane engulfed in flames in the sky just to the north of their house. However we quickly realized that the object was not moving and their was no smoke or discernible trajectory. It appeared like the flames were rolling or cascading from the object. As it moved further away it no longer appeared to be in flames, but had a reddish tint. Then suddenly it started rising very quickly and was gone. No man made object can move that fast. Eight of us witnessed this and were all in disbelief. Personally, I had chills. Much to our amazement, about 20-30 minutes later we saw a second object. At first I thought this was a firework. It appeared as a ball of flames rising in the sky but just as the other one did, it stopped and hovered. It also moved east following the same path as the first. Eventually this one also started rising very quickly and then disapeared. Unfortunately we weren't able to capture and video or pics. We were going to report it to the police just to go on record that we had witnessed this but eventually decided against it. After doing some research I came across this site so I'm reporting it here in hopes that maybe someone else witnessed this."],"Object Shape":"Disc, Fireball","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18165.html.txt","/var/www/straped/mufon/org/18165.html"],"Country":"United States","Weather Factors":"Unknown","Longitude":"-95.994998","map":"<A HREF = \"http://maps.google.com/maps?q=41.261763,+-95.994998(18165)&iwloc=A&hl=en\"> mufon case (18165) map </A>","Sighting Duration":"Undisclosed"}