{"Region":"New York","Longitude":"-73.997243","Log Number":"US-07192009-0011","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.717963,+-73.997243(18173)&iwloc=A&hl=en\"> mufon case (18173) map </A>","Viewing Distance":"Over 1 Mile, Unknown","divs":["Sighting DetailsI was out on my blacony smoking at 9:28AM on July 19, 2009, when my two year old daughter, from behind the screen door, said \"look at the plane daddy\" as she normally does,when she sees an airplane. When I looked up I dropped my cigarette and ran into the house to put on my glasses. When I came back out, in about 8 seconds, I noticed another one. There were now two white-ish objects in the sky appearing to elevate at a seady pace as they moved their ways through the morning sky (neither one changed directions, just a steady course, until they could no longer be seen). They were traveling in two different directions. One headed south, the other headed east. I assume they went into space because they kept getting smaller and smaller. I cannot guage the speed but within a minute or two they had gotten so small I couldn't see them. I couldn't see wings on these objects. I live between JFK and LaGuardia Airports and I have never seen airplanes at that altitude around here (or ever, usually airplaned at their maximum elevation still can be identified on a clear day, easily). If an airplane is landing or taking off from either one of the airports they are very noticible in the sky and pretty low. It should also be mentioned that there are no clouds in the sky, so I could see contrast. It is a surreal feeling seeing something that you cannot identify."],"files":["/var/www/straped/mufon/html2text/18173.html.txt","/var/www/straped/mufon/org/18173.html"],"Date of the Event":"07/19/2009 09:28 UTC","Disposition":"Unknown","Country":"United States","Object Features":"Unknown","Source":"MUFON","Date Submitted":"07/19/2009 09:28 UTC","Tags":"City","Latitude":"40.717963","Summary":"Two objects seen over Queens, NY that elevated into space","City":"New York","Sighting Duration":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 19th 2009"],"Weather Factors":"Unknown","Case Number":"18173","Object Shape":"Disc"}