{"Weather Factors":"Unknown","divs":["Sighting DetailsJust want to say first that nearly every night now since early April, I have been seeing strange objects in the sky. Upon many occassions there have been several witnesses with me, who saw the same thing that I did, so I know I'm not losing my mind. The first object I want to tell you about, appeared early this morning right around 4:40 am. This is also the approx. time that most all of the sightings have occurred. I stepped out for a cigarette, immediately looked up in the sky to the left, about 45 degrees...this rectangle orange glowing lantern shaped object darted out from behind the tree tops, floating almost, but moving at a fast pace, made a zig-zag pattern until it disappeared behind the neighbors tree line. I couldn't try to find out where it went, I had to stay on work grounds. About an hour later, I stepped out for my last look at the brightening morning sky, as I stepped out of the door, I looked up to the right in the north eastern sky, I saw the moon, the morning star...and then there was this very bright light...as bright as the morning star, moving at a slow pace toward the planet...it came to a stop in a wierd motion...and then grew very dim...then it slowly rose higher up in the sky and just stopped. I watched it for a good ten minutes, then I had to go back inside, though I wanted to watch it as the sun rose. A week and a half ago, eerily, I saw this same object appear in the exact same spot in the sky right around the same time. About 3 weeks ago, me and a fellow co-worker were sitting outside talking, this time it was around 2:30 a.m., flying saucers were the farthest thing from our minds at the time, when all of a sudden...right above the tree tops was this squarish, disk shaped flying object, creeping up to us overhead, about 150 feet up in the air a pretty low altitude...it was close enough we could see some strange markings on the craft...almost like symbols with 4 blue lights at each corner and a green light in the center. This object had no propellers whatsoever, no flashing lights, but wierder than that was that it made no sound. No here's another wierd thing... back in April, on a cool cloudy night...my boyfriend was taking me to work. It had been a very stressful day and actually I was dreading going to work that night as I was exhausted. We were already a couple of blocks away from our house when I noticed this same kind of object hovering right beside the t.v. tower. At first we thought it was a helicopter, but when we drove further on and it came in clearer sight, we saw that it wasn't a helicopter or an airplane. It was this rectangle object, with blue and green lights...just hovering in one spot right by the tower, which is a no fly zone by the way. When we came to a stop at the stop sign...we listened for some kind of aircraft noise, there was none, just the sound of cars going by. As we drove away from the tower and the craft... the lights on the craft turned into one solid red light and moved slowely off to the south till it was out of sight. I wish I had had a camera or a camcorder to take pictures of these things, but unfortunately I don't own one, can't afford it right now. Maybe thats why they're showing themselves to me. I feel like they're observing us closely. Seems like Southern Illinois is turning into a hot spot for anomolies. I've never seen anything like these objects before in my life...and to tell you the truth, I'm starting to get a little worried. Thanks for allowing me to share."],"City":"Harrisburg","trends":["There have been 13 other sightings in Harrisburg","There was one other sighting in Harrisburg on or around July 19th 2009"],"Disposition":"Insufficient Data","Tags":"City","Latitude":"37.740721","Log Number":"US-07192009-0015","Date of the Event":"07/19/2009 04:40 UTC","Object Flight Path":"Undisclosed","Longitude":"-88.536827","Case Number":"18177","Country":"United States","Object Shape":"Square, Rectagular, Star-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.740721,+-88.536827(18177)&iwloc=A&hl=en\"> mufon case (18177) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"07/19/2009 04:40 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18177.html.txt","/var/www/straped/mufon/org/18177.html"],"Summary":"orange glowing lantern shaped object passes silently overhead in a zig-zag patttern.","Source":"MUFON","Region":"Illinois"}