{"Latitude":"41.380836","Date Submitted":"07/19/2009 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.380836,+-73.727125(18192)&iwloc=A&hl=en\"> mufon case (18192) map </A>","City":"Mahopac","divs":["Sighting Details3 friends outside. All were witnesses. Object(s): principally a triangle with white lights near the points, but it appeared to be in other configurations too as it (or they) moved. Another smaller object appeared somewhat close to the main object which projected a faint beam between the larger and smaller objects. Lights moved in relation to each other, but the object(s) center point remained somewhat stationary, making it difficult to ascertain a set shape, or whether these lights belonged to one object or were actually multiple objects. The distance of the object(s) appeared to be near cloud level, higher than a private plane but lower than a commercial jet. When in a triangular lighted configuration, the distance between the lights were estimated to be larger than the wingspan of a large plane. At one point a blue beam was seen between the object(s) and the ground, which disappeared quickly. The elapsed time from when the object(s) were first spotted (and were also moving) was about 15 minutes, thereafter it became one light the apparent size of a bright star. The object(s) was observed for about 15 minutes after that as a stationary star-like object and then uncertain as to what happened to it."],"Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Mahopac","There were no other sightings in Mahopac on or around July 19th 2009"],"Longitude":"-73.727125","Summary":"Multiple Witnesses - Triangle, Other Shapes - Lights","Disposition":"Unresolved","Log Number":"US-07202009-0004","Case Number":"18192","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Features":"Undisclosed","Date of the Event":"07/19/2009 11:00 UTC","Country":"United States","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/18192.html.txt","/var/www/straped/mufon/org/18192.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Region":"New York"}