{"trends":["There have been 4 other sightings in Middlesbrough","There were no other sightings in Middlesbrough on or around November 30th 2002"],"City":"Middlesbrough","Disposition":"Unresolved","Date of the Event":"11/30/2002 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=54.57506,+-1.23634(18199)&iwloc=A&hl=en\"> mufon case (18199) map </A>","Log Number":"GB-07202009-0011","files":["/var/www/straped/mufon/html2text/18199.html.txt","/var/www/straped/mufon/org/18199.html"],"Source":"MUFON","divs":["Sighting DetailsI was working for a engineering company at the time either 2003 or 2004 not sure think it was 2004 and i was in an office working out a steel order when a car entered the carpark directly outside and two men in suits got out and approached the main entrance. I then opened the door to these gentlemen who introduced themselves as fraud squad detectives who wished to interview another person in the building who worked for a different company who shared the premises along with ourselves. While discussing the situation with the detectives in the carpark a metre from the front entrance i noticed a object come into view on my left peripheral vision. While chatting my eyes were drawn to this object and one of the detectives noticed, turned and looked in the same direction and who instantly remarked ' What's that\". the three of us then looked at this object with the other detective remarking \"that is weird what the hell is it\" to which i replied \"you're the detectives you tell me\"(i know naughty but i couldn't resist it).My guess is it was maybe 6 or 700 feet above ground level, the sighting was in broad daylight, sunny not a cloud in the sky either just before noon or just after.I then put my finger in my mouth and remarked that the wind was blowing from the east, the object came from the west and was headed in an easterly direction hence against the breeze.The object itself was hard to pin down as to it's profile, i thought maybe a microlight as it was similar shaped and it seemed to be of one colour,a mucky brown bronzy colour with maybe a black spot where a head could be,( i suppose it could have been triangular with a protruberance at the front giving it that appearance). Anyway we watched it for maybe a minute, it could have been less, it flew in total silence but never altered it's height or course and was really strange. A bit later when we were in the office the detective who first seen it with me remarked again \"that was really weird\" as he looked out the window to see if it was coming back. I hope you find this of interest as 2 servivg officers were as baffled as i was and they are trained observers. Oh as for size i would hazard a guess maybe a couple of meters bigger all round than a microlight. Spending 30 odd years in engineering reading blueprints gauging size and distance i think has given myself a pretty good grounding in observation and i,ve lived over airport flightpaths most of my life, whatever the object was i'd never seen it's like before or since. Cheers anyway"],"Latitude":"54.57506","Region":"England","Tags":"City","Weather Factors":"Unknown","Object Shape":"Triangle, Unknown","Case Number":"18199","Summary":"Unusual object seen along with 2 detectives","Object Features":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Country":"United Kingdom","Longitude":"-1.23634","Date Submitted":"11/30/2002 12:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed"}