{"Longitude":"-76.295834","Viewing Distance":"Over One Mile","Disposition":"IFO","Latitude":"40.040826","Object Flight Path":"Stationary,Other","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around July 20th 2009"],"Date Submitted":"07/20/2009 04:30 UTC","Date of the Event":"07/20/2009 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.040826,+-76.295834(18198)&iwloc=A&hl=en\"> mufon case (18198) map </A>","Weather Factors":"None","Summary":"Bright light in sky hovering","Case Number":"18198","Tags":"City","Log Number":"US-07202009-0010","Region":"Pennsylvania","Country":"United States","Object Features":"None","Object Shape":"Star-like","Source":"MUFON","City":"Lancaster","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18198.html.txt","/var/www/straped/mufon/org/18198.html"],"divs":["sighting detailsi woke up because a neighboring farm's cows were being loud and looked out of the window when i went to use the bathroom. i noticed a blurry comet-like light that appeared to be very, very slowly moving it's position. it looked very high, as if in orbit. i wasn't convinced that it wasn't a star at first, but noticed an occasional red blink of light around the edge of it. i also noticed tiny lights (maybe satellites?) moving around the sky, too. it could have possibly been a large star w\\atmospheric distortion making it look like there were lights blinking around it, but the tiny satellite-like lights moving in the vicinity of it made me wonder... plus the subtle way it moved... very tiny movements. very creepy. i tried to visualize it from the edge of my bathroom's window pane to see if it was in fact moving, and it was. a hover-like movement. i woke up my husband and we watched it for a while from our bedroom balcony. he said it was the space station and went back to bed! i totally disagreed since it was so bright. i watched it for about 30 minutes and went to bed, too. i looked online to see if anyone had reported the same thing, but no one has."]}