{"Tags":"City","Case Number":"18190","Date of the Event":"07/18/2009 11:30 UTC","Object Features":"Undisclosed","Disposition":"Insufficient Data","City":"Carson City","Object Shape":"Diamond, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=39.168778,+-119.766183(18190)&iwloc=A&hl=en\"> mufon case (18190) map </A>","Latitude":"39.168778","Sighting Duration":"Undisclosed","Summary":"A light above Carson City, that spilt from one light to two lights, It would lose light and get stronger. It had even flashed a thing of light on the Hill where I had seen it.","files":["/var/www/straped/mufon/html2text/18190.html.txt","/var/www/straped/mufon/org/18190.html"],"Region":"Nevada","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Carson City","There were no other sightings in Carson City on or around July 18th 2009"],"Source":"MUFON","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was with my Girlfriend in the hills outside of carson, We had seen a shooting star above that died out, we had thought it was a shooting star or something of that nature, but after we had seen it it seemeed that the satr around the event were all blinking??? Well, as we left going down the hill we seen a huge thing of ligtht. We had thought it was a plane at first beacause there is an airport in Carson this thing was not moving though. And when we were in the city we seen the light spilt into two lights and back into one. My girlfriend seen a lighte strike the ground of the hill. Well this hill is called prision hill, over next the Prision in carson City. I wanted to see what it was for fun and all that as we got to the hill the light went away as we left a plane what I beilve to be an F-16 circuled the city very quick like and also went off somewhere? As we left we seen the light appear and go. After that I said whatever and went home. I don't belive in things like this but I can not explain what I seen. I have a little video on my phone, it kinda sucks but you can see that that thing is there and not moving???????"],"Weather Factors":"Unknown","Date Submitted":"07/18/2009 11:30 UTC","Log Number":"US-07202009-0002","Longitude":"-119.766183","Country":"United States"}