{"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=34.056434,+-118.240425(18195)&iwloc=A&hl=en\"> mufon case (18195) map </A>","Region":"California","Source":"MUFON","Weather Factors":"Unknown","Tags":"City","City":"Los Angeles","Object Shape":"Triangle","Date of the Event":"07/19/2009 11:50 UTC","Disposition":"IFO","Summary":"Large triangular object, hovering in place at a low altidude. Bright white lights with one small blinking multicolored light. Did not move, it simply appeared and disappeared.","Log Number":"US-07202009-0007","Country":"United States","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around July 19th 2009"],"files":["/var/www/straped/mufon/html2text/18195.html.txt","/var/www/straped/mufon/org/18195.html"],"Object Features":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"07/19/2009 11:50 UTC","Case Number":"18195","Latitude":"34.056434","divs":["sighting detailsthis all happened at around 11:50pm on a sunday 7\\19\\2009. i was leaving my parents home in northridge, ca near the intersection of balboa blvd and nordhoff st. i was driving north bound on balboa blvd. first noticed lights in the sky as soon as i crossed the intersection with nordhoff st. in the sky to my right hand side, to the north east i noticed several solid bright lights and one smaller multicolored light that was blinking. this blinking light is similar to the blinking lights you see on planes. i couldn't see the outline of the object, the lights i observed made it appear triangular. i initially thought it was an approaching plane to van nuys airport but i thought it was strange to see a plane that late in the evening because of the flight restrictions at van nuys airport, loud planes are restricted because of the disturbance to nearby residents. the more i looked i could tell that it wasn't a plane, it was not moving in any direction, the large triangular object was stationary and appeared to be hovering directly over a neighborhood, it was completely silent i did not hear any noise from the object. i kept looking and then briefly took my eyes off the object to pull into the the neighborhood where i thought the object was hovering over. i parked my car and looked up at the same section of sky and it was no longer there, it disappeared. i didn't see it disappear, when i looked again it was simply gone. if it was a plane i would have been able to see it fly away, but it was simply gone. the moment i realized that it was not a plane, helicopter, blimp... i was in shock, disbelief, amazed, and very surprised about what i was witnessing. after the sighting i was trying to rationalize what i had just seen, but i couldn't. i had goosebumps, the hair on the back of my neck stood up."],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-118.240425"}