{"City":"Winchester","Date Submitted":"07/16/2009 03:25 UTC","files":["/var/www/straped/mufon/html2text/18204.html.txt","/var/www/straped/mufon/org/18204.html"],"divs":["Sighting DetailsIt about 3:25pm or 3:30pm on July 16, 2009 in Winchester, Indiana. My mother and I walked out of our front door, which faces east. I heard an airplane flying low overhead, and I just happened to look up at it. The plane was flying northwest-ish, and was flying beneath a cloud. There were a few clouds in the sky, but none straight east, or directly overhead. As I looked at the plane, I shielded my eyes with my hand, and out the corner of my eye, directly overhead, I spotted a moving silver spherical-shaped object. I turned my attention on it and watched as it shot across the sky. It had no backtrail, and it was not shaped like anything I recognized. I don't know if it made noise, because the airplane drowned everything else out. After only a few seconds I managed to ask my mom aloud, \"What the hell am I looking at?\", and she asked me what I meant. She looked up too, but by that time it had shot across the sky and disappeared into the distance, and she didn't see anything at all. The whole event took less than ten seconds, I'd say. I have no idea what it was, but it was not shaped like a plane of any kind. It went too quickly to be a weather balloon, at least I assume it did. I don't know how fast weather balloons go, or even if they can go straight in one direction. I'm not sure how high up it was, but it was at least a mile or more. The only thing that blocked my view of the object were some power lines, but no trees or houses. I've always wanted to see something, but I never expected to. It kind of shocked me, to be honest, and I wish I'd had it on video or something. I'll be keeping an eye out from now on."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.171989,+-84.981355(18204)&iwloc=A&hl=en\"> mufon case (18204) map </A>","Date of the Event":"07/16/2009 03:25 UTC","Case Number":"18204","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Winchester","There were no other sightings in Winchester on or around July 16th 2009"],"Region":"Indiana","Sighting Duration":"00:01:10","Object Shape":"Sphere","Tags":"City","Object Features":"None","Log Number":"US-07202009-0016","Latitude":"40.171989","Longitude":"-84.981355","Source":"MUFON","Weather Factors":"Unknown","Summary":"I saw a silver, spherical object flying east over Winchester, In. It had no backtrail and flew faster than a jet.","Country":"United States","Disposition":"Unknown"}