{"Viewing Distance":"Unknown","Longitude":"-93.607616","divs":["sighting detailsmy fiance and i noticed a bright light in the sky moving from east to west then made an abrupt turn to the nw. there where no blinking lights, going to slow for a meteor and to fast and bright for any known aircraft. it was clear out, so i have know idea of distance. however it was approx 45 degrees above the horizon due north of des moines, iowa. i contacted the nws (kdsm) they had no call reporting the object, but mentioned strange lights have been recently reported in the omaha area recently. also, i contacted the des moines international airport, and they said they also have not heard of any sightings from the tower. both the nws radar and airport radars did not show anything. i have been chasing tornadoes and storms for over 20 years and have seen some odd things, d\\t electric storms, etc. i really have a hard time believing in extra-terrestrial craft. so, personally i feel it is a military object. i'm an aviation enthusiast and understand aeronautics. this thing moved liked no aircraft that i'm aware of and to fast (no sonic boom or blinking lights)and the abrupt turn it made after traveling east to west then the sharp nw turn, i could not even begin to guess the g-forces on that!"],"files":["/var/www/straped/mufon/html2text/18202.html.txt","/var/www/straped/mufon/org/18202.html"],"Summary":"Bright light","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Unknown","Case Number":"18202","Weather Factors":"Unknown","Date Submitted":"07/19/2009 10:02 UTC","Date of the Event":"07/19/2009 10:02 UTC","Region":"Iowa","Log Number":"US-07202009-0014","Object Features":"None","Object Flight Path":"Path with directional change","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around July 19th 2009"],"Source":"MUFON","Disposition":"Unknown","Country":"United States","Tags":"City","City":"Des Moines","map":"<A HREF = \"http://maps.google.com/maps?q=41.606775,+-93.607616(18202)&iwloc=A&hl=en\"> mufon case (18202) map </A>","Latitude":"41.606775"}