{"Country":"United States","Date Submitted":"07/18/2009 07:35 UTC","Longitude":"-85.025964","map":"<A HREF = \"http://maps.google.com/maps?q=33.038187,+-85.025964(18207)&iwloc=A&hl=en\"> mufon case (18207) map </A>","divs":["Sighting DetailsWas driving my family to Atlanta, GA on a vacation Saturday morning up I-85N (very near Mile Marker 34 or 35) just a few miles north of Lagrange, GA ... my wife and I were talking and then suddenly we both saw this bright starlike flash in a general line with I-85 but well above the treeline height (assuming several thousand feet in reality). It was like watching a super bright star in the morning blue sky but this was much much brighter and larger (about 3 times as bright as venus looks in the night sky). Then as quickly as it flashed in its place I could see what appeared to be a silvery bullet or perhaps tear drop shaped object or craft. I could only see this for maybe a few seconds before it completely & totally blended in with the blue sky. We did not see it move it was in the same place as the flash before it but as I stated it just sort of faded into the blue sky. My wife claims all she saw was the bright starlike object but I myself clearly made this silvery craft out before it faded away. I wish I could report more but this is all we saw. Glenn"],"Object Features":"None","Weather Factors":"None","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/18207.html.txt","/var/www/straped/mufon/org/18207.html"],"Latitude":"33.038187","Object Flight Path":"Stationary","Source":"MUFON","Summary":"Starlike Flash to Object then quickly fading into the blue sky....","trends":["There have been 29 other sightings in LaGrange","There were no other sightings in LaGrange on or around July 18th 2009"],"City":"LaGrange","Tags":"City","Region":"Georgia","Object Shape":"Bullet, Missile, Star-like","Disposition":"Unknown","Case Number":"18207","Log Number":"US-07202009-0019","Sighting Duration":"Undisclosed","Date of the Event":"07/18/2009 07:35 UTC"}