{"Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path","divs":["Sighting DetailsAt approximately 11:30 am, I was leaving my office for lunch. While walking to the parking lot, I was starring at a clear patch of sky I stare at on a regular basis. This particular day, there was zero cloud cover. The temperature was unseasonably cool and the sky was much clearer and less hazy than most summer days in AL. In the patch of sky and to my total disblief, I see a bright speck hovering at an extremely high altitude. In this region of the sky it is very common to see jets flying in a square pattern, making their final approach for Birmingham International airport, however, the object I saw was twice the height that planes typically fly. The speck did not move, did not leave a con-trail and did not seem to be gaining altitude. Standing there, I tried to convince myself that the object was a high altitude weather baloon. I even considered the possiblity that it was Mars. I called another person over to see it and she confirmed what I was seeing. Then the object sped away at an extremely high rate of speed. I have personally never seen anything move this quickly. I've never seen anything like this before."],"Object Features":"Unknown","Log Number":"US-07202009-0015","City":"Birmingham","files":["/var/www/straped/mufon/html2text/18203.html.txt","/var/www/straped/mufon/org/18203.html"],"Country":"United States","Disposition":"Unknown","Tags":"City","Region":"Alabama","Summary":"Very bright, extremely high altitude temporarily stationary object, left at high rate of speed.","Weather Factors":"Unknown","Latitude":"33.524571","Case Number":"18203","Object Shape":"Sphere, Star-like","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=33.524571,+-86.79647(18203)&iwloc=A&hl=en\"> mufon case (18203) map </A>","trends":["There have been 48 other sightings in Birmingham","There were no other sightings in Birmingham on or around July 20th 2009"],"Source":"MUFON","Date of the Event":"07/20/2009 11:30 UTC","Date Submitted":"07/20/2009 11:30 UTC","Longitude":"-86.79647"}