{"Weather Factors":"Unknown","trends":["There have been no other sightings in Naguilian","This sighting has never been favorited."],"Case Number":"18216","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/18216.html.txt","/var/www/straped/mufon/org/18216.html"],"Longitude":"120.396944","Tags":"City","Region":"Ilocos","City":"Naguilian","Sighting Duration":"02:00:00","Log Number":"PH-07212009-0002","divs":["Sighting DetailsI was on vacation in the province of Naguilian Philippines. I was staying at my late grandfather's house. I was eating with my aunts, cousin and my mom, after eating me and my cousin decided to go buy cigarettes at a nearby store. So we walk to the store, and decided to sit down, and smoke. As I was looking around and doing smoke circles, a fiery disc approximately, 400-500mph at a 90 degree angle crashes near the rice field of my uncle. which is 800m from where we are. Me and my cousin ran to check. When we arrived at the scene my other aunt and my cousin who lives near the rice field were there with 5 other people i dont know, and people that were walking by were also approaching, as we get closer, we saw, the disc and it was huge it was longer than a bus for sure. it was kinda mettalic, some areas where dented, my cousin took out his phone and took pictures right away, he took 3 pictures, the police and the AFP(armed forces of the philippines) arrived at the scene, and the police were pushing away the people, to a certain distance, we couldnt see the craft anymore but as we were getting pushed, I heard one militiary guy who was talking to the radio, all i can hear was \"clark field..check it out\" as it was really crowded and noisy at the scene. I assume that the US military that is docked in clark field, pampanga are being contacted. I will upload the pictures when i contact my cousin friday. thank you."],"Source":"MUFON","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"04/03/2009 01:10 UTC","Summary":"A disc shaped object crashed near farm field","Disposition":"Unresolved","Country":"Philippines","Date of the Event":"04/03/2009 01:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=16.533889,+120.396944(18216)&iwloc=A&hl=en\"> mufon case (18216) map </A>","Latitude":"16.533889","Object Shape":"Disc"}