{"Latitude":"41.128987","Country":"United States","Date of the Event":"Unknown","Log Number":"US-07212009-0005","City":"North Platte","Weather Factors":"None","Case Number":"18219","divs":["Sighting DetailsSome time after dark my friend and I left from the college dorm in Curits to go spotlighting and road side hunting (illegal!!) north of Curtis on the country roads. During the drive we never saw any wildlife or met any other people driving on the county road (not that common to meet someone else). We ended up far enough north that we were close to North Platte so we decided to go see my friends boyfriend at the Community College there. We had to leave at Midnight as there were no more visitors allowed. We decided to take Highway 83 back to Curtis. The highway into and out of North Platte is two laned each way until you get to the outskirts of town then its single lanes each way. When we hit the one lane going South I looked to the West (I was in the passanger seat) and thats when I saw a light (kinda like a beam coming out of the sky). My friend and I thought it was just a helicopter or something but we had the pickup windows rolled down and did not hear a helicopter or a air plane. SO that got my curiosity going. I watched the light and it would travel across the highway and head East. It appeared to just be hanging out (how far from the highway did it travel, I do not know as it was dark out but it seemed far enough away that the light shining on the ground was not seen at a close distance). The only time the light came down from the sky was when the object stopped and \"huvored\". The light appeared to be in a \"beam\" shape and yellowish whitish colored. Anyways the object kept doing this, it would cross the highway and hang out to the West and then back to the East. It probably hung out in each spot for approx 30 seconds. At this point in time my friend and I were still curious but getting a little concerned as we were not sure what was going on (also we still have not met a single vehicle going North or South on the Highway. We have also not seen any deer along the road and usually you do). I do not know how many miles we have gone at this point but the object starts coming closer and closer to the pickup as goes from one side of the highway to the other. Now my friend and I are getting a little anxious and startled and worried but still curious. At this point in time my friend starts drivg at about 90 to 100 mph to try and lose this object. We are talking about what the object might be and we do mention \"hey maybe its aliens...\" As we are talking I decide to try and take a picture of it. I turn to the right to take a picture of it out of the passanger window but the object has moved again. My roommate is concentrating on the road and I look through the back window of her single cab pickup and theres the object! It appears to be \"hovering\" above the pickup box and I can see a light blue ligh and then a yellowish whitish light and they repeat but there are spaces between each light. I could kinda tell that the shape was like a saucer and I could not tell if the lights were stationary or moving fast like runner lights. I yelled at my roommate to look at it and she looked into the rear view mirror and saw it. She said that it filled up the entire rear view mirror. (I never did get a picture of the object as I was in \"aww\" and almost frozen in movement as I looked at it out the back window). We were totally freaked out and she kept driving as fast as she could. We eventually met a semi truck (it was heading North towards North Platte) and the object stopped following us. It just started to heading off towards the East and after that we went down a hill in the highway past the turn for a feedlot and we never saw the object again. I do not know how many miles the object followed us but I am guessing for about 6 miles."],"Sighting Duration":"Undisclosed","Longitude":"-100.762943","files":["/var/www/straped/mufon/html2text/18219.html.txt","/var/www/straped/mufon/org/18219.html"],"Viewing Distance":"21-100 Feet","Object Shape":"Unknown","Disposition":"Unknown","Object Features":"Unknown","Summary":"My friend and I were driving home from North Platte after road hunting and visiting her Boyfriend at the Community College in North Platte and I noticed it after we started driving south","Tags":"City","Date Submitted":"07/21/2009 03:46 UTC","trends":["There have been 5 other sightings in North Platte","There were no other sightings in North Platte on or around"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=41.128987,+-100.762943(18219)&iwloc=A&hl=en\"> mufon case (18219) map </A>","Region":"Nebraska","Source":"MUFON"}