{"Disposition":"Unknown","Country":"United States","Latitude":"39.103696","Object Shape":"Fireball","Weather Factors":"Does Not Apply","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Source":"MUFON","Date of the Event":"01/17/2009 10:00 UTC","files":["/var/www/straped/mufon/html2text/18210.html.txt","/var/www/straped/mufon/org/18210.html"],"Region":"Missouri","Sighting Duration":"Undisclosed","City":"Kansas City","divs":["sighting detailswhen i originally witnessed this phenomenon i didn't know about mufon (just discoved this site after a similar sighting happened on july 4th 2009) on january 17th around 10pm i was driving south on wyandotte trying to get my daughter to fall asleep when i noticed a cluster of orange glowing lights in the sky over westport. at first i thought they might be airplanes or helicopters but when i stopped and rolled down the window i heard no sound and upon further observation i saw they were too low to be airplanes. the main attraction was a cluster of approximately 5 or 6 orbs within relative close proximity of eachother, outlining an almost triangular pattern. they were all brightly illuminated and pulsing, almost like a fire contained within glass. there was no trail of any kind left behind. in the middle of the cluster i did notice one really faint white light moving steadily at the same speed as the others. when i turned west onto 39th street i noticed three more of these orbs spaced out across the sky almost to the edge of the horizon, also forming the outline of a triangle. all pulsing with the same red\\orange fire-like luminosity. on july 4th, my boyfriend and i witnessed a solitary \"fireball\" move steadily southward, ironically enough during a conversation about my experience in january."],"Tags":"City","Summary":"redorange orbs over Westport","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around January 17th 2009"],"Log Number":"US-07202009-0022","Date Submitted":"01/17/2009 10:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.103696,+-94.574727(18210)&iwloc=A&hl=en\"> mufon case (18210) map </A>","Case Number":"18210","Longitude":"-94.574727","Viewing Distance":"Unknown"}