{"Disposition":"IFO","Object Flight Path":"Path with directional change","City":"Springboro","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/18213.html.txt","/var/www/straped/mufon/org/18213.html"],"Case Number":"18213","Date of the Event":"07/18/2009 10:20 UTC","Longitude":"-84.229902","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Ohio","trends":["There have been 10 other sightings in Springboro","There were no other sightings in Springboro on or around July 18th 2009"],"Summary":"Saw 4 or 5 large, bright balls dancing in the sky","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=39.561852,+-84.229902(18213)&iwloc=A&hl=en\"> mufon case (18213) map </A>","Object Shape":"Other","Log Number":"US-07202009-0025","Tags":"City","Date Submitted":"07/18/2009 10:20 UTC","Latitude":"39.561852","divs":["sighting detailsi was sitting on the front porch smoking when i noticed a light out of the corner of my eye. i looked to the south west and saw 4 or 5 very large, very bright, whitish, orange lights in the sky zig zagging and dancing around one another. i yelled for my boyfriend to come look and we just stood there watching them zig zagging. i told him to go get the camera and he ran in the house to go get it and while he was in there, they sank down behind the treeline and their lights just went out. we saw the same thing the night before around 1:00 a.m. est but there were 5 or 6 that night on july 17, 2009. they did the exact same thing both nights. they made no sounds that we could hear. i have been outside watching for them again with camera in hand and i hope i can get a photo\\video of them. i have lived around wpafb all my life and these were way too large to be any kind of plane or helicopter lights that the air force has. i know the difference between airplane lights and what we saw. our location is about 22 miles south of dayton and our house faces south and the i-75 corridor is very close to our house. i know someone else had to have seen them, especially since they showed up two nights in a row."]}