{"Object Shape":"Star-like","trends":["There have been no other sightings in Hinckley","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"07/19/2009 10:45 UTC","Object Features":"None","Latitude":"41.238387","map":"<A HREF = \"http://maps.google.com/maps?q=41.238387,+-81.74513(18223)&iwloc=A&hl=en\"> mufon case (18223) map </A>","City":"Hinckley","files":["/var/www/straped/mufon/html2text/18223.html.txt","/var/www/straped/mufon/org/18223.html"],"Longitude":"-81.74513","Tags":"City","Summary":"12 total \"starlike\" moving objects very high in sky, some fading/disappearing, some getting much brighter at times","divs":["Sighting Details4 people witnessed total of 12 objects that appear to be moving stars from one horizon to another (no sound). Anomalous actions include one object exhibiting a light cycle of illumination for several seconds and then gradual fade to total black for several seconds then again a gradual illumination as it crossed the sky. Another object began to fade as it crossed the sky then suddenly appeared to drop as it became intensely bright and appeared at least 5x larger than it had ever been. It soon faded to no light. a couple of the witnesses were frightened as this happened. One appeared so low we thought it was a plane since these star-like objects almost always seem to be at very high altitudes (as if literally moving among the stars). However, I commented that it looked exactly like what we were seeing high in the sky because it did not flash and appeared to be a sphere of light- but this one was as low as flight-school altitude. We were baffled when the object, which seemed only about a mile away, began to fade and soon vanish right in the middle of the sky. That's when it started to feel surreal. I've been watching the sky my whole life and I can now see these objects seemingly at will the last few months. They travel in all directions and due to the one that I saw very low in the sky I know what I'm seeing are not satellites. Look for yourself."],"Viewing Distance":"Over One Mile","Log Number":"US-07212009-0009","Case Number":"18223","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Date of the Event":"07/19/2009 10:45 UTC","Region":"Ohio","Disposition":"IFO"}