{"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"07/21/2009 03:44 UTC","Object Features":"Undisclosed","Object Shape":"Circle, Diamond","Tags":"City","Date Submitted":"07/21/2009 03:44 UTC","Summary":"Sitting at stoplight taking photos of a Fire Truck, I took four photos each from 2-7 seconds apart and the object appears in the last photo","map":"<A HREF = \"http://maps.google.com/maps?q=39.984113,+-105.12923(18229)&iwloc=A&hl=en\"> mufon case (18229) map </A>","Country":"United States","divs":["Sighting DetailsI was taking photographs at an intersection in Louisville, Colorado of a fire truck. I take about 275 photos on the way home from work each day and usually about the same amount on the way to work. I had the sunroof open and while stopped simply put my arm through the sunroof and started taking pictures. I was going to delete the photos after looking at them and upon finding a roundish object in the distance I decide to keep all four for reference. The photo taken immediately before this photo was taken at 15:44:02 and seven seconds later at 15:44:09 this object appeared in the next photo submitted. Enlarged it appears to be directly over the low buildings seen in the distance. I did not see this object. I was only taking photographs hoping something would show up and as usually I was not surprised to find something. Since I take on average 7000 photos a week I will always get something interesting. The first photo is original, the second enlarged with color correction."],"Source":"MUFON","City":"Louisville","Disposition":"Unresolved","Viewing Distance":"Unknown","Latitude":"39.984113","Log Number":"US-07222009-0005","Region":"Colorado","Longitude":"-105.12923","files":["/var/www/straped/mufon/html2text/18229.html.txt","/var/www/straped/mufon/org/18229.html"],"Case Number":"18229","Object Flight Path":"Undisclosed","trends":["There have been 2 other sightings in Louisville","There were no other sightings in Louisville on or around July 21st 2009","This sighting has never been favorited.",""]}