{"Case Number":"18220","Weather Factors":"Unknown","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=41.882899,+-88.065592(18220)&iwloc=A&hl=en\"> mufon case (18220) map </A>","trends":["There have been 2 other sightings in Glen Ellyn","There were no other sightings in Glen Ellyn on or around July 18th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/18220.html.txt","/var/www/straped/mufon/more/18220_submitter_file1__IMG00048-20090705-0158.jpg","/var/www/straped/mufon/more/18220_submitter_file2__IMG00063-20090711-2321.jpg","/var/www/straped/mufon/more/18220_submitter_file3__IMG00071-20090718-2120.jpg","/var/www/straped/mufon/org/18220.html"],"Tags":"City","Latitude":"41.882899","Object Features":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-88.065592","Country":"United States","divs":["Sighting DetailsWe had just parked our car and let the kids out to go inside when my son looked up and said what is that dad? I looked up and saw what looked like a white dot moving pretty fast that changed into a glowing bag...like a luminaire thing but with fire melting off of it... I asked my wife what the heck she thought it was and she had no answer. It made no noise at all. I have no idea how high it was because it was dark and really had no reference for it...it travelled from the northwest to the southeast. I grabbed a few pictures with my blackberry and then after about 20 seconds it just dissappeared. The pictures are crappy and only show a white dot and then a reddish glowing dot... I was kind of freaked out because I have never seen such a strange object. My son was freaked out for a day or 2 . Its weird but when I go to view the picture details it shows that the pictures are from different dates and times... they were all taken within seconds of one another"],"Object Flight Path":"Path with directional change","City":"Glen Ellyn","Date Submitted":"07/18/2009 12:00 UTC","Source":"MUFON","Summary":"looked like fire melting out of a paper bag","Log Number":"US-07212009-0006","Disposition":"IFO","Date of the Event":"07/18/2009 12:00 UTC","Object Shape":"Fireball, Square, Rectagular, Unknown"}