{"Date Submitted":"07/22/2009 04:00 UTC","Weather Factors":"None","City":"La Grande","Disposition":"Hoax","Object Shape":"Disc, Oval","divs":["Sighting DetailsI woke up in bed and had my blinds open to get air because it was hot the day before. As I was stretching and waiting to fully wake up I happened to roll over and look out the window. I noticed the regular stars and among them this other flashing object that appeared a little bigger. So I got out of bed and got my binoculars. When they were not strong enough to make out any detail I got my camera with 12X zoom, knowing I can zoom far more on the computer as well. I watched it and took pictures for up to 40 minuets, during which the object meandered about the sky. From my point of view considering scale, it moved about the area over the building out my window. It changed the direction of it's nose and changed colors as well. First moving in a diagonal towards the ground, then up and off to the east. It soon came out of the field of view of my window. I first assumed it to be a helicopter, perhaps performing some service in the desert (as the area it must have been over is semi-desert prairie land which is moderately farmed.)Then when I had a better view with my equipment I may have thought it to be a satellite. Once all the computer zooming was done I had no choice but to admit I do not know that the flying object it. Weather it contains space men or government secrets is also up for debate. I did not feel afraid or anything but I was very curious and exited at the possibility of recording a UFO."],"files":["/var/www/straped/mufon/html2text/18228.html.txt","/var/www/straped/mufon/more/18228_submitter_file1__zoomedspaceship009.jpg","/var/www/straped/mufon/more/18228_submitter_file2__zoomedspaceship002.jpg","/var/www/straped/mufon/more/18228_submitter_file3__zoomedspaceship007.jpg","/var/www/straped/mufon/org/18228.html"],"Latitude":"45.324577","trends":["There has been one other sighting in La Grande","There were no other sightings in La Grande on or around July 22nd 2009","This sighting has never been favorited.",""],"Sighting Duration":"00:37:00","Country":"United States","Date of the Event":"07/22/2009 04:00 UTC","Source":"MUFON","Tags":"City","Object Features":"Other","Viewing Distance":"Unknown","Summary":"A small obgect, possibly disc or oval shaped, flashing diffrent colors, moved around slightly.","Object Flight Path":"Stationary,Hovering then path","Region":"Oregon","Case Number":"18228","map":"<A HREF = \"http://maps.google.com/maps?q=45.324577,+-118.087719(18228)&iwloc=A&hl=en\"> mufon case (18228) map </A>","Log Number":"US-07222009-0004","Longitude":"-118.087719"}