{"Viewing Distance":"Unknown","Sighting Duration":"00:15:00","Date Submitted":"07/21/2009 11:15 UTC","Log Number":"US-07222009-0002","Object Flight Path":"Other","Longitude":"-96.562919","trends":["There have been 5 other sightings in Manhattan","There were no other sightings in Manhattan on or around July 21st 2009"],"divs":["Sighting DetailsTuesday July 21st, 2009. Apx 11:15 PM. Never thought I'd actually say this, but I was looking up at the stars with my friend tonight N by NW of Manhattan, KS and we both saw some type of flying object lit up. It looked like the light was getting bigger, then continued on a straight line for awhile until it went behind the tree in our front yard. I hurried down the steps to the driveway to look more NE. Right as I looked up a greenish boomerang looking light zipped extremely fast away from me. (the boomerang light seemed to be anywhere from 3000- 4000 feet up, zooming up higher). I asked my friend,\"Do you believe I just saw something fly really fast away.\" He told me he saw it too. I started to shake pretty bad and started debating with him if what we had just seen was real. We sat down in the drive way and looked up and started talking, the whole \"What if.\" We then started looking south by south west at this cool star that was flickering like crazy. I stood up to get a closer look, and in my view I saw a very light faded object, somewhat hard to see. I asked Zach to quickly look up and confirm what I saw. It was a massive hang glider looking thing that looked like it was at an extremely high altitude. To us, it looked like it was going really slow, but it must have been going extremely fast. my friend claimed \"It looked kind of brown, but since its dark, you couldn't tell.\""],"Latitude":"39.187748","Object Features":"Unknown","City":"Manhattan","Source":"MUFON","Tags":"City","Case Number":"18226","Region":"Kansas","files":["/var/www/straped/mufon/html2text/18226.html.txt","/var/www/straped/mufon/org/18226.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.187748,+-96.562919(18226)&iwloc=A&hl=en\"> mufon case (18226) map </A>","Date of the Event":"07/21/2009 11:15 UTC","Weather Factors":"None","Object Shape":"Boomerang, Triangle, Unknown","Country":"United States","Disposition":"Unknown","Summary":"2 objects, one Boomerang zipp upwards, massive hang glider type craft very high."}