{"trends":["There have been 3 other sightings in Mancelona","There were no other sightings in Mancelona on or around July 19th 2009"],"Tags":"City","files":["/var/www/straped/mufon/html2text/18231.html.txt","/var/www/straped/mufon/org/18231.html"],"City":"Mancelona","Viewing Distance":"Unknown","Date of the Event":"07/19/2009 11:15 UTC","Case Number":"18231","Weather Factors":"None","Latitude":"44.902229","Region":"Michigan","Sighting Duration":"00:00:30","Object Flight Path":"Path with directional change","Country":"United States","Summary":"Looked like very bright shooting star, then dropped straight down, got really really bright, then changed back to original direction","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=44.902229,+-85.060885(18231)&iwloc=A&hl=en\"> mufon case (18231) map </A>","Date Submitted":"07/19/2009 11:15 UTC","divs":["Sighting DetailsMy Mother in Law(Sharon), her boyfriend(Steve), my Wife(Melissa), and myself were sitting outside around a camp fire at their cabin. Melissa had just gotten up to go inside, and use the bathroom. Steve looked up, and happened to comment that the stars were more visible now that it was later in the night. The time was approx. 23:00-23:30 EST. As soon as he commented on the stars, Sharon, and I looked up. Just then what looked to be a shooting star became visible. But it definitely wasn't. The light was much brighter than any star in the sky. It was about as bright as a planet when they are visible to the naked eye. There was no tail. It was moving as fast as shooting stars I've seen in the past. The light was solid, not blinking. There was no engine noise. No sonic boom. No noise at all. The light was initially traveling along the horizon in the East sky heading North. It dropped 90 degrees, and got very bright. It appeared to be headed right for us. It dropped for approx. 1-2 seconds, then changed course to its original direction of travel until it disappeared in the distance. It was not the Space Shuttle. I've seen it before from the ground with binoculars. My initial thought was something skimmed the atmosphere, then plunged quickly straight through it, and then continued on its original course. My Wife came back outside just after the sighting. We told her what happened, and then we all watched the sky. Several minutes later the object came back from the W heading ENE. It was just as bright, but moving much slower. It appeared to be wobbling slightly side to side. Again, no noise, no tail. We watched it until it disappeared out of sight. That was the last time we saw it. The Cabin is near Camp Grayling. I live right by Selfridge Air National Guard Base. I know what planes in the sky look like. I know what shooting stars look like. I know what planets look like. I know what the Space Shuttle looks like. This was something else."],"Object Features":"Unknown","Log Number":"US-07222009-0007","Source":"MUFON","Object Shape":"Star-like","Longitude":"-85.060885"}