{"Date Submitted":"07/22/2009 12:00 UTC","Case Number":"18239","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=44.059359,+-123.084344(18239)&iwloc=A&hl=en\"> mufon case (18239) map </A>","files":["/var/www/straped/mufon/html2text/18239.html.txt","/var/www/straped/mufon/org/18239.html"],"Weather Factors":"Unknown","Region":"Oregon","divs":["Sighting DetailsI went outside to let the dogs go to the bathroom. I looked up and saw a very bright light that at first I thought was a plane, but it wasn't moving away or in a straight line. It seemed to be hovering. It was flashing lights white, blue, and red. They seemed to light up in succession along the length of it. It stayed in the same position in the sky for 20 minutes or so, then seemed to begin to very slowly move closer to the horizon, getting smaller, moving towards the West. At times the object seemed to sort of quickly slide to the left or right, or up and down. It sort of \"jiggled\" where it was in the sky. At one point, a white light the size of a star suddenly appeared off to the side of it and then disappeared only a split second later. I went and got my wife out of bed who easily saw it and both of us exclaimed how it didn't look or move like a plane. My neighbors were awake in their backyard, I called them up, they came over (we could see it better without the trees in their own backyard) and they all saw it too. There was agreement that it seemed to move from side to side a bit and that at first it seemed like a plane, but it wasn't moving away as quickly as a plane would, and seemed to move back and forth from time to time. Occasionally when it jumped or seemed to move more obviously, I exclaimed out loud how weird it was and \"What the heck is that?\". I tried to film it, but I couldn't find a mini-dv tape, and the 2mp digital camera I had couldn't seem to locate it in the sky. I'm hoping it happens again, I have a tape ready now."],"Longitude":"-123.084344","City":"Eugene","Object Shape":"Unknown","Object Features":"Undisclosed","Disposition":"IFO","Summary":"Wobbly multiple light emitting object seemed to hover and slowly move off to the West","Viewing Distance":"Unknown","Sighting Duration":"01:00:00","Object Flight Path":"Undisclosed","Date of the Event":"07/22/2009 12:00 UTC","Latitude":"44.059359","Source":"MUFON","Tags":"City","Log Number":"US-07222009-0015","trends":["There have been 68 other sightings in Eugene","There was one other sighting in Eugene on or around July 22nd 2009"]}