{"Longitude":"-70.535438","Case Number":"18238","Country":"United States","Sighting Duration":"00:00:08","Latitude":"41.780491","Weather Factors":"Unknown","Disposition":"Unknown","trends":["There have been 2 other sightings in Bourne","There were no other sightings in Bourne on or around July 15th 2009"],"Summary":"Two blue lights traveling northwest along the water at Sagamore beach. Spotted from the beach at about 100 yds away over the water (perhaps 1 light +its reflection?).","Object Shape":"Star-like","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.780491,+-70.535438(18238)&iwloc=A&hl=en\"> mufon case (18238) map </A>","Region":"Massachusetts","Date Submitted":"07/15/2009 11:15 UTC","City":"Bourne","files":["/var/www/straped/mufon/html2text/18238.html.txt","/var/www/straped/mufon/org/18238.html"],"Object Features":"Undisclosed","Source":"MUFON","divs":["Sighting DetailsOn the night of 15 July 2009, my father and I were sitting out by a fire on Sagamore beach, approximately 150 feet west of the Sandwich town line.. Electrical storms and rain were in the area. Strong thuderstorms had passed to the south, and other thunderstorms were to the west, east, and north over Cape Cod Bay. We were sitting by a fire on the beach, and the fire was relatively low . The tide had gone most of the way out. We were possibly the only vacationers on the beach at the time because the rain had been fairly heavy at times (we stayed out because we were under waterproof beach umbrellas). My father told me to look towards the water beause he saw something. Two blue lights seemed to dance on the water from right ot left, and they traveled FAST. Ther was no observable engine noise. They seemed to be over the water so its possible that we were seeing one glowing object and its reflection below it. If that were the case than it seemed as though it might have been \"skippoing\" off the water like a stone. It was probably about as bight as a storebought flashlight. The object seemed to follow the shore. When it got far to the left I lost sight of it. A few minutes later I looked for footprints down by the water, even though the objects seemed to be going much faster than a human could have, and found none. I made the following estimations THAT NIGHT, and recorded them on my cell phone. Distance was 200 yds, water was 100yds away. The lights traveled from right to left in ~10 seconds.The traversed 120degrees of my field of view. If I were looking straight out toward the water, it was from 60 deg to my right, all the way to 60deg to my left. I feel these numbers are probably high. Reducing the numbers is more conservative anyway, so I will use the following: Distance to the water:65ft. Closest approach of object occued at about 100 yds away from the fire, straight out in the direction of the water. It probably took about 8 seconds to travel through 120deg of view from my location. Using two right triangles, with h being the 100yds closest approach distance in the center and two 60deg angles on either side, the object traversed about 346 yards in 8 seconds. (tan(60)*(100yds)*2). That translates to 88mph. This speed is consistant with the visual observation. It looked like it was going at least highway speeds. Using my origonal estimates gives the object a speed of about 142mph. Again, there was no engine noise of any kind. We were truly baffled by the sighting and the only possible explination we could think of was that perhaps it was some form of heat lightning or St. Elmo's Fire or something, but those are definitly not satisfying. I'd also like to note that I am an Aerospace Engineer and I received my BS in 2008. We saw what we saw and have no explination for it, but any explination would be most welcomed and greatly appreciated."],"Log Number":"US-07222009-0014","Date of the Event":"07/15/2009 11:15 UTC","Tags":"City"}