{"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Summary":"A consistent , \"Hum & Buzz\", followed by a visual of a; \"Metallic Sphere\".","City":"Auburn","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/18248.html.txt","/var/www/straped/mufon/org/18248.html"],"Date of the Event":"07/22/2009 06:30 UTC","Viewing Distance":"Unknown","Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"07/22/2009 06:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.898215,+-121.07536(18248)&iwloc=A&hl=en\"> mufon case (18248) map </A>","Region":"California","Sighting Duration":"Undisclosed","Log Number":"US-07232009-0005","Latitude":"38.898215","Longitude":"-121.07536","divs":["Sighting Details My wife had gotten up to prepair for the work day. Upon going outside to get something out of her vehicle, she had noticed one of our trash bags had been torn into by animals sometime in the previous evening. As she gathered the mess she stoped due to a sound. She described the sound as that of a consistent steady,\"HUM\". The sound was enough to grab her attention and realize this was not a common event, something outside our everyday environmental surrounding sounds. This continued for the duration of her 5 mins. or so outside. She moved through the rest of her morning gathered our two young girls in her vehicle and continued the slow drive out of our road. As she hit the main road and through a few, twists, hills, and slopes she had come upon long straight away. It was here where the strange morning was reminded and continued. She said that infront of her some distance up in the sky was a stationary metallic sphere. She observed this for just a few moments, the time the road and direction would let her, but more than enough time to take in the sight and give plenty of thought. Due to the bizzare sound and then bizzare visual of the metallic sphere and the close time in proximity of the two events, she has connected the two together. The event in total time from sound,(HUM), to sight,(METALLIC SPHERE), was within 20 mins."],"Country":"United States","Case Number":"18248","Disposition":"Unknown","trends":["There have been 7 other sightings in Auburn","There were no other sightings in Auburn on or around July 22nd 2009"]}