{"Case Number":"18245","Summary":"Saturn like, bright white, no aviation lights, moves at steady clip, slows, dims, disapears from sky!","Viewing Distance":"Unknown","Date Submitted":"07/22/2009 09:50 UTC","Object Shape":"Saturn-like","Sighting Duration":"00:00:45","Log Number":"US-07232009-0002","trends":[""],"Disposition":"IFO","Object Flight Path":"Straight-line path","City":"Undisclosed","Object Features":"None","Source":"MUFON","Latitude":"40.638305","Weather Factors":"Light","Tags":"City","Date of the Event":"07/22/2009 09:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.638305,+-89.390158(18245)&iwloc=A&hl=en\"> mufon case (18245) map </A>","files":["/var/www/straped/mufon/html2text/18245.html.txt","/var/www/straped/mufon/more/18245_submitter_file1__UFOMap.jpg","/var/www/straped/mufon/org/18245.html"],"Country":"United States","divs":["Sighting DetailsI stepped outside to take out the trash. I looked up as I normally do to see anything out of the ordinary. Tonight there was something unusual about one heavenly body. The object in question was very bright. too bright to be a star or even a planet. Althought, Saturn would be the closest comparison to what I saw. However, it was not in the correct position to be a planet and it was moving ESE. from straight up in the night, slightly west to the ESE, steady pace until the end when it appeared to have slowed down a bit. then when it had traversed 25 degrees of the sky in less than 1 minute it slowed down and got dimmer and dimmer until it complete disapear from the place from which it appeared to have stopped. As if it was not moving ESE anymore but instead moved straight away from me and its final position. When it appeared to be moving away from me it was as if the light was not just turned off but instead it looked as if it was the same light just exponetially further away until it could no longer be seen in the chicago night sky. Very bright object with no blinking aviation lights, no sound althought it appeared to be very high in altitude. no distinguishable shape other than that created by the round appearanece of the white light. Brilliantly white! by far the most luminous object in tonights sky for 45 seconds. I want to call my wife to see it but we have a narrow view of the sky due to buildings and therefore a short viewing time and I didnt want to miss anything by taking my eyes off of it."],"Region":"Illinois","Longitude":"-89.390158"}