{"Source":"MUFON","Latitude":"43.970915","Longitude":"-99.892653","Region":"South Dakota","map":"<A HREF = \"http://maps.google.com/maps?q=43.970915,+-99.892653(18249)&iwloc=A&hl=en\"> mufon case (18249) map </A>","Log Number":"US-07232009-0006","Date of the Event":"07/20/2009 10:15 UTC","Date Submitted":"07/20/2009 10:15 UTC","Object Features":"Other","Object Flight Path":"Straight-line path,Path with directional change","Summary":"4 Star-like objects flying at high alt. and at great speed then slow down etc.","City":"Undisclosed","Case Number":"18249","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsBetween approx. 9pm to 1020 pm a friend and I were sitting on the front porch of my home at Hot Springs SD when I noticed a star-like object moving across the sky west to east. The object appeared to be very high in the sky and moved at varying speeds and would change direction irratically and in an instant. After about 30 seconds the object dissappeared. Approx. 15 min. later another object appeared in approx. the same place as the first traverling north to south, remained visible for 30 to 35 seconds exibiting the same characteristics as the first. Approx. 10 mins. later a third object appeared in the same location in the sky flew in a east to west direction with the same movements and altitude as the other two. Then at approx. 7 mins.later another object appeared flew north to south and then seemed to dissappear as the others had. When I say dissappeared I mean that all of a sudden they were no longer visiable. There were four objects in all untill we went inside for the night. Because my friend smokes and I will not allow it in the house we were again out on the poarch Wed. the 22nd of July 2009 at approx 9:30pm when another object appeared in the sky this one was consiserably lower in altitude was star-like. when it first appeared. It was fairly large flying east to west in a fairly straight line at what appeared to be a moderate speed. As it proceeded across the sky it began to get dimmer untill it finally disappeared into the night sky. About 3 mins. later another object appeared in the sky at about the same altitude and speed in a north to south direction and exibited the same pattern as the first. None of these objects blinked off and on they just appeared brightly and slowley faded from view. When they disappeared they seemed to fade get bright and then go out altogether. None of the objects disappeared over the horizen they just went out. Because we went back inside we didn't see any more objects that night. These did not appear to be aircraft. There were aircraft both nights so we were able to distinguish between the two. In 2007 in Dec.on three consecitive nights I obsereve objects that appeared as the two of 22 July only I watched all of these untill they dissapeared over the horizen. I was an aircraft mechanic in the Air Force so I know the differance between airplanes and UFOs. Thank You, Ron Holtry"],"files":["/var/www/straped/mufon/html2text/18249.html.txt","/var/www/straped/mufon/org/18249.html"],"Country":"United States","Tags":"City","trends":[],"Sighting Duration":"02:00:00","Disposition":"IFO","Weather Factors":"Unknown","Object Shape":"Star-like"}