{"Case Number":"18244","Date of the Event":"07/22/2009 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.456358,+-89.544007(18244)&iwloc=A&hl=en\"> mufon case (18244) map </A>","Tags":"City","Latitude":"44.456358","Sighting Duration":"00:05:00","Country":"United States","City":"Plover","trends":["There have been no other sightings in Plover","This sighting has never been favorited."],"Object Shape":"Circle, Star-like","Log Number":"US-07232009-0001","Longitude":"-89.544007","Weather Factors":"Unknown","divs":["Sighting DetailsTonight my wife and I were taking a walk in our neighborhood. We were walking to the North down our street. Several miles to the north, we had a lot of summer heat lighting taking place, no thunder. When the lighting hit, it lit the clouds up with a nice purple color. Very beautiful. I looked up to the West in crystal clear sky. Overhead, my wife and I saw a very bright light. At first I thought it was an airplane. It looked exactly like a star, only much larger and brighter. It was flying in a straight path, and was silent. The object was flying smooth as silk, almost seemed like it was gliding. No engine noise was heard at all. The brightness was very intense, but did not light up any of the neighborhood. The light did not blink or flicker, but stayed constantly light. The object also seemed to be flying at a very slow rate of speed, and did not change altitude. Compared to the altitudes that you typically see a low flying passenger plane, this felt lower. It flew directly overhead, but no object could be made out, just light. It was extremely easy to track and watch it. My wife and I turned around back towards our home so we could keep watching the object. We followed it as we walked past three houses. At the third house, our view was blocked by two trees. Based on the speed and altitude it was flying, we should have been easily able to see the object once we were past the trees. However, the object was simply gone without a trace. Whether the light simply turned off, or it shot off in the distance, we will never know. The experience was incredible, but we felt a little scared as well when we saw it. I only wish I didn't let it go behind those trees. We live in a newly developed area, and have hardly any trees at all. We should have been able to see it."],"files":["/var/www/straped/mufon/html2text/18244.html.txt","/var/www/straped/mufon/org/18244.html"],"Disposition":"Insufficient Data","Region":"Wisconsin","Date Submitted":"07/22/2009 10:15 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Summary":"UFO looked like a very bright star, flew straight, altitude lower than low-flying planes, and silent.","Object Features":"Undisclosed"}