{"Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Egg, Other","Longitude":"-80.049596","Summary":"UFO was green and moved slowly with a few moments of hovering. no noise maybe a few hundred feet off the ground","Date of the Event":"07/22/2009 10:30 UTC","Source":"MUFON","Date Submitted":"07/22/2009 10:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/18246.html.txt","/var/www/straped/mufon/org/18246.html"],"Tags":"City","Latitude":"26.620502","Object Features":"Dome","Region":"Florida","Log Number":"US-07232009-0003","City":"Lake Worth","Disposition":"Insufficient Data","trends":["There have been 9 other sightings in Lake Worth","There were no other sightings in Lake Worth on or around July 22nd 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=26.620502,+-80.049596(18246)&iwloc=A&hl=en\"> mufon case (18246) map </A>","divs":["sighting detailsi live in palm beach county and my front porch faces lake osborne which would be facing west. i was talking on my cell phone to a friend and first noticed it when i saw green shining from behind a tree which was blocking my vision. i kept moving to get a better view but it was moving east towards my direction anyway. when it moved to the point i could see all of it what i saw was definitly an object and it was glowing green in light. the movements were not that fast, it was moving at a sideways\\forward motion and then it stopped moving and hovered over the john prince park campground. i watched the object that was shapped like a football without the points at the end for many minutes. my friend was still on the phone as i watched to see if it would move again and couldn't even speak while i watched entranced. the green lights seemed to get even brighter than before and after that i just felt fear and went into my house. in the following minutes i continued to look out my window, and perhaps the first three minutes i was in my house the object still remained hovered across the lake, then one time i looked and it was just gone. the whole time i heard no noise for it hovering pretty close."],"Case Number":"18246","Sighting Duration":"Undisclosed"}