{"Summary":"Oval shape in sky discovered in pic NW of Ft Collins","Country":"United States","Disposition":"Unknown","Object Flight Path":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-07222009-0016","Latitude":"40.626371","Sighting Duration":"Undisclosed","Date of the Event":"07/21/2009 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.626371,+-105.171648(18240)&iwloc=A&hl=en\"> mufon case (18240) map </A>","Source":"MUFON","trends":["There has been one other sighting in Bellvue","There were no other sightings in Bellvue on or around July 21st 2009","This sighting has never been favorited.",""],"Weather Factors":"None","City":"Bellvue","divs":["sighting detailswhile out driving around sightseeing and whatnot with my wife on 7\\21\\09 northwest of ft collins, just west of the tiny town of bellvue, i stopped and took several pictures of the somewhat rare greenery of the foothills due to the abundant rain this year. i noticed a commercial airliner contrail headed wsw while taking the picture but paid it no attention. when we got home i popped the camera card into the computer to tweak the light and contrast levels when i noticed a black dot on one of the pics that was facing west towards the foothills. i zoomed in and noticed a black oval. i dismissed the possibility of it being a bird or plane because as you can see in the attached pics, the camera picked up cloud details nearby that are actually smaller than the object. to me this indicates that at that level of magnification, wings would be seen if it was a plane or bird. additionally, if it was a blur of a bird in flight, there still would be areas of lighter or darker shades where light would reflect off wing, head, leg or abdomen surfaces no matter how blurred it may be. there appears to be none of these as the object shows a consistent dark shade. there does however appear to be an area of lighter shade along the top of the object, possibly implying sunlight reflecting off the top surface. no other objects were noticed in any of the remaining pics and no other strange effects or events were noticed at the time. i did not zoom in further in the supplied pics because any detail would just be lost in enlarged pixels."],"Tags":"City","Date Submitted":"07/21/2009 03:30 UTC","Object Features":"None","Region":"Colorado","files":["/var/www/straped/mufon/html2text/18240.html.txt","/var/www/straped/mufon/more/18240_submitter_file1__ufo-bellvue-7_20_09.jpg","/var/www/straped/mufon/more/18240_submitter_file2__ufo-bellvue-7_20_09-closeup.jpg","/var/www/straped/mufon/more/18240_submitter_file3__ufo-7_20_09-xtrme-closeup.jpg","/var/www/straped/mufon/org/18240.html"],"Object Shape":"Oval, Other","Longitude":"-105.171648","Case Number":"18240"}