{"Viewing Distance":"Unknown","Longitude":"-82.346056","map":"<A HREF = \"http://maps.google.com/maps?q=28.179971,+-82.346056(18256)&iwloc=A&hl=en\"> mufon case (18256) map </A>","Country":"United States","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Latitude":"28.179971","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18256.html.txt","/var/www/straped/mufon/more/18256_submitter_file1__July2009055.jpg","/var/www/straped/mufon/more/18256_submitter_file2__July2009059.jpg","/var/www/straped/mufon/more/18256_submitter_file3__July2009060.jpg","/var/www/straped/mufon/org/18256.html"],"Date Submitted":"07/17/2009 11:42 UTC","Tags":"City","Region":"Florida","Log Number":"US-07232009-0013","Date of the Event":"07/17/2009 11:42 UTC","Source":"MUFON","Case Number":"18256","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"It was a 3 pointed triangle with 3 lights on each corner and a 4th light was on the bottom. General Shape - upside down pyramid but with only 3 sides","trends":["There have been 7 other sightings in Wesley Chapel","There were no other sightings in Wesley Chapel on or around July 17th 2009","This sighting has never been favorited.",""],"divs":["sighting detailsat 11:42 pm 7\\17\\2009, my neighbor knocked on my door. it was unusual because it was really late so i thought it was an emergency. she said \"sorry to bother you so late, but my husband is in the back yard looking at some weird lights in the sky and thought you might want to see them too.\" i then said \"ok, i'm out back right now.\" i then opened up my sliding glass door to go to the lanai and i looked up in the eastern sky at about 45 degrees, or the 1 o'clock position, and saw a triangular object in the sky moving from left to right and back left and up and down and it surely didn't look like anything i've ever seen in my life. i then ran back into the house to wake up my wife, who is the biggest ufo skeptic that i know, and said \"wake up! wake up! you've got to come outside and see this thing!!\" she said \"no, i've to go to sleep, i have to work in the morning!\" i preceded to say \"you have to see this thing in the sky, just trust me, you have to come out and see this!\" i then looked for our camera, a casio exilim 10.1 mega pixel camera, and went back outside with my dog and started recording footage of this thing in the sky. i walked over to my neighbors house and we, three of us, watched this thing for 2 and a half hours. my neighbor had binoculars and a telescope, but it was easier to use the binoculars to see the silohuette of this object. it was moving in different patterns, but generally stayed in the eastern sky moving from left to right in a pendulum type pattern, but it would also moved westward a little bit, but still remained at the 1 o'clock to 1:30 position in the sky. if you held a dime towards the sky, the size was a little smaller than the dime. it seemed to be about 1000-3000 feet in the sky hovering over i-75 near sr 54. the feelings i felt was \"what the heck is that?\" we sat on some chairs and watched this thing for a couple hours. i started to feel really sleepy so i went back inside the house to go to sleep, but i kept checking out my window because i wanted to see where this thing will go once it's done hovering over wesley chapel, fl. i found my other battery that was fully charged so i went back outside for a few more minutes and fimed one more video. i don't know what we saw, but it wasn't a plane. matter of fact, we saw 2 planes fly by that night, one was flying from east to southwest. we heard the sounds of the engines as it came closer to us and as it flew past us. the sounds were evident even when the plane seemed to be further to us than the triangular object in the sky. the next plane fly past us from south to north and you could also hear it as it flew past us. but this object made no sounds at all. the night sky was very clear and there was no or very little wind that night."],"City":"Wesley Chapel","Disposition":"Unknown"}