{"Case Number":"18254","Weather Factors":"Unknown","Log Number":"US-07232009-0011","trends":["There have been 2 other sightings in Waterford","There were no other sightings in Waterford on or around July 6th 2009","This sighting has never been favorited.",""],"Longitude":"-72.147022","Latitude":"41.34982","Region":"Connecticut","Sighting Duration":"00:15:27","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.34982,+-72.147022(18254)&iwloc=A&hl=en\"> mufon case (18254) map </A>","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","City":"Waterford","Object Flight Path":"Straight-line path","Source":"MUFON","divs":["Sighting DetailsI was coming home from work amd noticed what looked like lighting in the sky but had a deep red glow to it. As the onject got closer I noticed it was a HUGH triangle that covered my whole apartment complex which is about 1 mile in either direction.It had a dark grey shinny metallic sufaces.It made me feel sick to my stomach, I dont know if it was just nerves or what, but I was shaking. As it got closer I noticed it was about 2 stories thick with a deep red glow coming fron the center at the bottom, with electrical discharges from the rear sparks in you will. The air felt electric like static electricty. It moved so quickly without a sound except for the snaping sounds of the discharges at the rear. I wached it from a dot in the sky and it went right overhead and disappered in about 15min. I could'nt sleep that night and my body has a static charge, anything I touched there was a spark, very weird I have never experinced anything like it in my life. I had a camera in my house but was frozen and could not move to get it. I wish I would of it was so clear just moving in the sky. It was just amazing and I am noe truly a beliver. Could it have been miltary? I just have never seen anything close to that in the sky. It was almost felt like I reach out an touch it. I still have a very strange feeling inside and having problems sleeping. Tony New London, CT"],"Date Submitted":"07/06/2009 11:20 UTC","Tags":"City","Summary":"Large Triagle 1mile each side emitting electrical discharges red glow","Object Features":"Other","files":["/var/www/straped/mufon/html2text/18254.html.txt","/var/www/straped/mufon/more/18254_submitter_file1__personal022.jpg","/var/www/straped/mufon/org/18254.html"],"Disposition":"Unknown","Date of the Event":"07/06/2009 11:20 UTC"}