{"Log Number":"US-07232009-0009","Date Submitted":"07/18/2009 11:00 UTC","Viewing Distance":"Unknown","Object Shape":"Unknown","Latitude":"40.560896","map":"<A HREF = \"http://maps.google.com/maps?q=40.560896,+-85.600504(18252)&iwloc=A&hl=en\"> mufon case (18252) map </A>","Disposition":"Unknown","Object Features":"Unknown","trends":[],"Tags":"City","Date of the Event":"07/18/2009 11:00 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/18252.html.txt","/var/www/straped/mufon/org/18252.html"],"City":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Source":"MUFON","Summary":"Orange lights in the sky","Region":"Indiana","Case Number":"18252","Longitude":"-85.600504","divs":["Sighting DetailsMy husband and son were taking out the trash at 11 pm EST on July 18, 2009. My son (15 yr old) came running into the house to tell myself and my daughter (13 yr old) that there were UFOs and to come look. We didn't believe him and thought they were going to jump out and scare us since it was dark so we didn't go right away. My son came running back in within a few minutes telling us to come look, seriously there were UFO's. Then my husband came inside and said we really needed to see this. All 4 of us stood on our front steps looking north toward CR 6. There were 4 orange lights in the sky in a kind of zig-zag shape. Some of the lights were stationary and some were moving really slowy up in the sky. They were far enough away that we had no idea the shape of the object giving off the light. They just looked like orage balls in the sky. They were maybe, from our location, about an inch big and only a few inches apart. So, I don't know how far away they actually were, or their actual size. That is just what it looked like to us. As we were watching the lights, the upper most light just suddenly disappeared. Then the remaining lights eventually moved up in the sky (one by one - not all at once - and some did remain stationary as others moved) and disappeared. As one disappeared another one would appear below the others. In total, my husband saw 7 lights. I witnessed 4 when I first stepped onto the porch and a 5th one appeared before I watched them all individually disappear. We tried taking pictures with my digital camera but they did not turn out. This was the strangest thing I have ever seen. I don't know if they were planes? But to us they were UFO's simply because we didn't know what they could be. I'm not claiming I witnessed a UFO from outerspace filled with \"grays\" or anything. Just that we saw strange orange lights in the sky that none of us could explain. We have looked toward the sky in the same direction at the same time since then and have not witnessed it again. It was very neat but scared my daughter."]}