{"Viewing Distance":"101-500 Feet","Object Flight Path":"Straight-line path","Log Number":"US-07232009-0014","Weather Factors":"Unknown","Date Submitted":"07/19/2009 10:49 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18257.html.txt","/var/www/straped/mufon/more/18257_submitter_file1__ufo.JPG","/var/www/straped/mufon/org/18257.html"],"Region":"New Hampshire","divs":["Sighting DetailsOn Monday night July 19 around 10:49pm i heard a loud noise coming from the woods in my back yard. This noise was unlike anything i have ever heard befor. I went to my back sliding door and began looking out the screen thinking to my self this is very unusual. Then the lights appeared from the woods. The object seemed to rise from out of nowhere. Then the object began to move and the sound became increasingly louder and louder. This sound it was making is very hard to explain. The best way to explain it is like very low digital frequency but without vibration like a jet would cause. The lights were in a triangle formation with a super bright red light in the center of the triangle. The lights at each point of the triangle were bright white light at a downward facing direction. These lights including the red light did not emit glare or shine like normal lights do at night. The lights looked unnatural. Not man made lights. This triangle was no more than 2000 feet above the ground and moved at an alarmingly slow pace. Conventional air craft such as planes and jets can not fly this slow without stalling and crashing. Commercial jets do not fly this low in my area anyways. The closest airport is 20 miles away. The triangle did not have any blinking lights such as planes have. Planes and jets have green and red lights that blink to let others know if they are approaching or going away. Boats have these same lights. I had my girlfriend come out side to view this object. She was in absolute disbelief at what we were seeing. I told her to grab the camera and take a picture. The picture is very poor quality as many ufo pictures are. We watched this object for 2 to 3 minutes befor it disappeared along with the noise. I then texted my friend who lives a quarter mile down the street and asked him if he had seen the object. He replied he was listening to his radio in his room and this loud noise completely drowned out his radio. I have seen this object 3 times befor with now a total of 4 other people now. the first 3 times were all in 2000 and 2001. All these sightings were in within 10 miles of each other. two days later i went outside to snap a couple pictures of the area we had taken the first picture at so i could get a good refrence point in good light. I took two pictures right after each other without noticing anything at the time. I went inside to view the pictures and realized i had caught something on camera which i can not explain."],"Date of the Event":"07/19/2009 10:49 UTC","City":"Raymond","Source":"MUFON","Summary":"3 bright white lights in triangle formation","Object Features":"Unknown","Longitude":"-71.183395","map":"<A HREF = \"http://maps.google.com/maps?q=43.036196,+-71.183395(18257)&iwloc=A&hl=en\"> mufon case (18257) map </A>","trends":["There have been 2 other sightings in Raymond","There were no other sightings in Raymond on or around July 19th 2009","This sighting has never been favorited.",""],"Latitude":"43.036196","Country":"United States","Case Number":"18257","Object Shape":"Triangle, Unknown","Sighting Duration":"Undisclosed","Tags":"City"}