{"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18251.html.txt","/var/www/straped/mufon/org/18251.html"],"Latitude":"45.386628","Tags":"City","Date Submitted":"07/23/2009 04:38 UTC","Log Number":"US-07232009-0008","Sighting Duration":"00:30:00","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy girlfriend and I were lying in bed watching a movie. We decided to step out onto our backyard for a cigarette. We went outside at about 4:15AM. The sky was mostly clear and could see many stars. I noticed a bright light over head and to the right of us in the north eastern direction. At first I thought it was a star and asked my girlfriend if it was the northern star because it was so bright. She said she wasn't sure and pointed out another group of stars and said it was the little dipper. I then pointed out a group of stars that i thought looked like a kite, She agreed. Then my attention focused back on the very bright light that hadn't moved. I noticed it was much to close and bright to be a star. That's when it began to interest me. I focused on the light and noticed that it was slightly moving but not much. It was very bright and had little rays of light coming out of it like a light shinning into a diamond. I lit up another cigarette and watched the light. it would stay in the same area but move a tiny bit and would dim a bit, then grow brighter. It seemed like it was moving back and forth. I had to keep moving in order to keep it in view from the trees in the neighboring yards. It seemed to be several hundred feet in the air. After 3 cigarettes and about 20 minutes it began to dim and move further away, headed in the north eastern direction. Another cigarette and 10 minutes went by before it faded to a smaller sized light, a little bigger than the other stars i had been looking at earlier. It then began climbing higher into the sky heading strait up. It climbed until it vanished into the clouds high in atmosphere. The time it finally vanished was 4:48AM PST. I have never seen anything like it. I felt overwhelmed, and memorized at the same time. I was very interested in watching it because I have never seen anything remotely similar in what i was whitnessing. There is no way it was an aircraft i have ever seen, and it definitely was moving under its own power. I am not sure what it was but i swear by what i saw and my girlfriend was there and saw it as well. I also called a friend during the sighting and told him to look in the sky. he said he saw a bright light but was not sure if it was the same thing i was seeing. i was unable to take any photos because all i had was my iphone and it was unable to see it, but there must be others who saw it. It as over a pretty populated area. I feel that it was significant enough to try and call any UFO sighting hot line i could on www.google.com at the moment, call the observatory, and wright this detailed description of my experience. I am an educated college student who is known for being very credible by many many people. please take this seriously and look into. please contact me with your findings, i am very interested. this is not a joke! Thank you for your time and effort looking into this sighting. I am very curious in finding out what i saw so please find me an answer. Thanks!"],"Source":"MUFON","Disposition":"Unknown","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 4 other sightings in Tualatin","There were no other sightings in Tualatin on or around July 23rd 2009"],"Summary":"went outside and noticed a bright light in the air. it remained there for about 30 minutes slowly moving around and then dimmed up and into the sky.","Longitude":"-122.761545","map":"<A HREF = \"http://maps.google.com/maps?q=45.386628,+-122.761545(18251)&iwloc=A&hl=en\"> mufon case (18251) map </A>","Case Number":"18251","Object Shape":"Star-like","Weather Factors":"Unknown","Date of the Event":"07/23/2009 04:38 UTC","Region":"Oregon","City":"Tualatin"}