{"Disposition":"Unknown","Case Number":"18255","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=37.998369,+-84.1784(18255)&iwloc=A&hl=en\"> mufon case (18255) map </A>","Summary":"fireball like, w/ blue halo,pulsing, slowly moving south then turn to west,under overcast sky","Object Shape":"Circle, Fireball, Flash","Date of the Event":"07/21/2009 10:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/18255.html.txt","/var/www/straped/mufon/org/18255.html"],"Source":"MUFON","Weather Factors":"None","City":"Winchester","Longitude":"-84.1784","Date Submitted":"07/21/2009 10:30 UTC","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"37.998369","Region":"Kentucky","Object Flight Path":"Path with directional change","trends":["There have been 2 other sightings in Winchester","There were no other sightings in Winchester on or around July 21st 2009"],"Log Number":"US-07232009-0012","divs":["sighting details i stepped out onto back porch and observed what looked to be a ball of fire with a blueish pulsing halo. the object looked like it was on fire,not trailing flame,the surface moved and swirled around giving the look of a fire but contained within the circular shape. it appeared to be about 1\\2 mile north, lower than the overcast,which was about 2 to 3000 ft. at first i thought, an airplane or helicopter on fire, but it moved very slowly and was not descending, appearing to stay at the same altitude. as a pilot and former aircraft owner, with an avid interest in anything aviation related,i knew this was something out of the ordinary. no navigation or landing lights, no sound. about 1\\2 the size of a dime at arms length. after watching for 30 sec. or so and it coming ever closer and increasing in size( due to getting closer) i called sue out to see it. we then went to the upper deck and watched it for another 1\\2 min. or so, sue called miranda,leslie and a visiting friend to come out to see it. the object then made a slow turn to the west, and moved off in that direction. it appeared to climb into the cloud layer and faded as it ascended. i have witnessed other strange lights in the sky through the years but nothing so close ,clear and obviously not a type of conventional aircraft. i went through all the possibilities i could think of and can tell you what it wasn't but have no idea what it was."]}