{"Object Shape":"Fireball, Sphere","Summary":"Fireballs Over Higgins Lake in the Northern the Lower Peninsula Michigan","Weather Factors":"Windy","Log Number":"US-07232009-0020","Viewing Distance":"Unknown","Latitude":"44.421128","map":"<A HREF = \"http://maps.google.com/maps?q=44.421128,+-84.683637(18263)&iwloc=A&hl=en\"> mufon case (18263) map </A>","Longitude":"-84.683637","Sighting Duration":"Undisclosed","Region":"Michigan","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/18263.html.txt","/var/www/straped/mufon/org/18263.html"],"Object Flight Path":"Undisclosed","Source":"MUFON","Date of the Event":"07/22/2009 11:00 UTC","Disposition":"Insufficient Data","divs":["Sighting DetailsMy family was camping at south higgins lake state park in Michigan south of Grayling. We were standing outside our camper when my mom pointed to the sky where there were several balls of fire heading west right over us. at first i had counted six but a few seconds later a few more appeared, there might have been around eight. at first i thought it was a bunch of balloons that were on fire or had candles hanging from them making them glow, a few looked like they had short tales of fire coming from either side. a friend and his family, about 100 feet south of us at another campsite, thought they were helicopters, but they made no sound. it had rained earlier so there were clouds, my mom was sure they were lower then the clouds. they all went in the same direction some seemed to move side to side while heading west it seemed as they were going higher, three started to fly in a triangle. as for my feelings, it mostly was of curiosity. we lost sight of the object after it had gone behind the trees. i do know there is a national guard base very close to there, but if these were aircraft below the clouds they would have made a sound. i regret very much not taking a picture, but i don't think my camera would have made a quality picture"],"City":"Sharps Corners","Date Submitted":"07/22/2009 11:00 UTC","Tags":"City","Case Number":"18263","trends":["There have been no other sightings in Sharps Corners","This sighting has never been favorited."]}