{"Longitude":"-72.943282","Summary":"ufo spotted transfiguring over Brookhaven National Lab","Country":"United States","City":"Middle Island","map":"<A HREF = \"http://maps.google.com/maps?q=40.884909,+-72.943282(18265)&iwloc=A&hl=en\"> mufon case (18265) map </A>","Region":"New York","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cylinder, Flash, Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","Object Features":"Unknown","Sighting Duration":"00:03:00","Date Submitted":"07/11/2009 09:15 UTC","trends":["There have been 3 other sightings in Middle Island","There were no other sightings in Middle Island on or around July 11th 2009"],"Date of the Event":"07/11/2009 09:15 UTC","files":["/var/www/straped/mufon/html2text/18265.html.txt","/var/www/straped/mufon/org/18265.html"],"Log Number":"US-07232009-0022","Source":"MUFON","divs":["Sighting DetailsMe and a close friend of mine were both at our high school the other night(Longwood High School). We were sitting on the bleacher reminissing of our high school track career. The whole time i had been zoning off looking at the stars and airplanes and what not in the sky. Suddenly me and my friend austin noticed a orange light kind of flying upwards over BNL.I started to joke with him that this strange orb was a ufo. The object looked like it was about a mile away when it stopped in its upward path and morphed from a bright orb into a very sharp triangular object. When it had shifted from an orb to a triangle it let off a strong flash. Once done morphing it hovered in place for about a minute and then it headed flying over where me and my friend were. It passed directly over us! When it flew over i knew it wasnt any plane or helicopter or any thing i had ever seen in my life. It was trianlge shaped. It had larger triangle in the middle and 3 trianles on the outside. The lights were a dim yellow and never blinked. When i saw it i was amazed and a bit scarred, but more excited. The object flew out of sight over the horizon once it passed over us. My personal opinion is it was some kind of military craft that was very silent and it might have been flown out of BNL. Im not too convinced it was an alien craft becuase it didnt fly at incredible speed but it did hover for a while then it could change speeds very fast."],"Tags":"City","Case Number":"18265","Object Flight Path":"Hovering then path,Path then hovering","Latitude":"40.884909"}