{"Summary":"brt.yell.orb,slow out of cloud at 4,000ft. ,slower with a rock back n forth, then acended rapidly straight up.","Disposition":"Insufficient Data","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/23/2009 10:05 UTC","Weather Factors":"Light","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.120896,+-115.171736(18269)&iwloc=A&hl=en\"> mufon case (18269) map </A>","divs":["sighting detailsat my home , at 10:03pm,july 23, 2009 sis knocked on my door then left, standing outside i looked up (straight up) and a bright yellow orb at about 4-5,000 ft up heading east,floated out of a cloud, i thought it was a plane but thought it odd no lights blinking at all. i knew imeadiatly what it was and yelled for a friend to come look, at that moment it slowed and began to rock back and forth as if a wind hit it (no wind out, cloudy and humid) then started acending slowly then rapidly straight up until it was no longer visable.no sound at all. my first siteing of an orb\\craft. my guess at size was about as big as 2 cars, or 20-25 ft around. my friend missed seeing it by 2 sec. , watched for an hour after , but no signs of it. it was very exciting,i yelled \"come back\" and wanted to see more or get a picture, but darn. on april 23, 2009 i saw an orb that looked just like a giant firefly about 30 ft. over my house, very fast, and have been watching to see another ever since! didn`t report that one. no biggies as far as siteings i guess. no photos unfortunatly."],"Case Number":"18269","Country":"United States","Object Flight Path":"Path with directional change","Latitude":"36.120896","Region":"Nevada","City":"Las Vegas","Object Features":"None","Date of the Event":"07/23/2009 10:05 UTC","Sighting Duration":"Undisclosed","Longitude":"-115.171736","Source":"MUFON","Object Shape":"Star-like","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around July 23rd 2009"],"Log Number":"US-07242009-0003","files":["/var/www/straped/mufon/html2text/18269.html.txt","/var/www/straped/mufon/org/18269.html"]}