{"Log Number":"US-07232009-0018","City":"Jackson","Case Number":"18261","Date of the Event":"06/28/2009 11:16 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.252649,+-84.393796(18261)&iwloc=A&hl=en\"> mufon case (18261) map </A>","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/18261.html.txt","/var/www/straped/mufon/org/18261.html"],"Source":"MUFON","Region":"Michigan","Summary":"driving E bound on I94 I witnessed a star like object hovering just N of the freeway that changed positions but stayed N of the freeway then blinked out like a light bulb being turned off.","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsThe short description of the event I witnessed a star like object hovering north of I94 east near jackson michigan while driving around 1230am back to detroit. June 28th, The object drew my attention due to it's abnormal brightness and it changed it's location while I tried to watch it while driving then after 10minutes it blinked out like a light bulb being turned off. Myself and other verifiable witnesses have seen this same object over the last two years hovering or operating around metro detroit \"DTW\" airport now it has moved to jackson airport area near I94. We \"my friends and other witnesses\" have dubbed this object the light bulb because it catches your attention as being a very bright star or planet? But maneuvers around if you watch it long enough then eventually \"blinks\" out like a light bulb. Someone other than myself and a bunch of people have had to have witnessed this I hope you have already investigated it. If not then get your cameras ready cause it is here and has been here, I am former military and so are most of the witnesses of this even current Iraq war vets who are still current duty and it is not a planet or helicopter...Please contact me let's find out what this is I need researchers."],"Weather Factors":"None","Country":"United States","Disposition":"Unknown","Date Submitted":"06/28/2009 11:16 UTC","Sighting Duration":"00:10:00","Latitude":"42.252649","trends":["There have been 10 other sightings in Jackson","There were no other sightings in Jackson on or around June 28th 2009"],"Object Flight Path":"Path with directional change","Tags":"City","Object Features":"Unknown","Longitude":"-84.393796"}