{"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/18266.html.txt","/var/www/straped/mufon/org/18266.html"],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Region":"Michigan","Object Shape":"Star-like","Latitude":"41.835449","Longitude":"-86.249177","divs":["Sighting DetailsI was walking in the river-front park with my friend and her son. We were walking north, walked around the northern turn-around of the trail and began heading back toward our car. I glanced up as we were talking and saw five bright orange \"stars\" to the south-southeast at probably 30 degrees off the horizon, just above some orange streetlights (similar color). There were clouds behind these \"stars.\" At first I thought it was some strange reflection of the streetlights, but then I took a longer look and pointed these stars out to my friend. She saw them clearly, as well. Neither of us could figure out what they were. Be began walking to the east so that the lights would no longer be just underneath the stars, and the stars didn't move. We stood there watching them intently for a couple of minutes, at which point two of them began to fade. After about one minute the two faded beyond my range of vision (they were \"gone\") and one by one the other three began to fade as well. None of these objects appeared to be moving at any speed, although I did notice at least two of them move a small amount, slowly, in relation to the position of the others. The formation of these five \"stars\" was like this: * * * * * Hopefully that conveys well as a diagram. My friend and I continued on, there were some people nearby when we saw all of this, but they were hispanic and they didn't respond when I tried to get their attention, I'm guessing they didn't speak english very well. We continued walking south toward the car, when we encountered other people, they were carrying on as if they had not noticed these lights. We felt a little like our sanity would be questioned if we brought it up to others at this point -- you know how the stigma is. So at this point, we saw five bright-orange unidentified objects in the sky. I'm not claiming they are aliens or anything like that, but we very clearly both saw the exact same thing and I've read some other reports on here now describing these same lights in different locations and formations. I absolutely believe my eyes. To answer the inevitable question, no we had not been drinking alcohol or taking any kind of drugs. I don't even smoke cigarettes. I'm a very clean, healthy person. I have a career in computer science, my friend is a housewife with a 2 year old son (who, as I mentioned, was with us). Neither of us is under any unreasonable stress beyond what most people encounter in day-to-day life. I'm sorry, I do not have a camera phone, so I was unable to capture any kind of visual of this :("],"Log Number":"US-07232009-0023","Date Submitted":"07/23/2009 09:30 UTC","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"18266","Date of the Event":"07/23/2009 09:30 UTC","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Niles","There were no other sightings in Niles on or around July 23rd 2009"],"City":"Niles","map":"<A HREF = \"http://maps.google.com/maps?q=41.835449,+-86.249177(18266)&iwloc=A&hl=en\"> mufon case (18266) map </A>","Summary":"Five bright orange \"star\" lights in sky, below clouds"}