{"Region":"California","Viewing Distance":"Over One Mile","City":"San Diego","Source":"MUFON","Weather Factors":"Does Not Apply","Disposition":"Insufficient Data","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around July 21st 2009"],"Case Number":"18268","Longitude":"-117.045533","files":["/var/www/straped/mufon/html2text/18268.html.txt","/var/www/straped/mufon/org/18268.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.563186,+-117.045533(18268)&iwloc=A&hl=en\"> mufon case (18268) map </A>","Log Number":"US-07242009-0002","Sighting Duration":"Undisclosed","Summary":"saw it from a few kilometers away, changed brightness","Tags":"City","Latitude":"32.563186","Object Shape":"Circle, Flash","Date Submitted":"07/21/2009 09:18 UTC","Country":"United States","divs":["sighting detailsi was in my room using my computer. i had the window open because it was to hot inside. i look to my left ,which is east, and i noticed a light in the sky above one of the trees in the horizon. at first i taught it was an airplane. i taught this 'airplane' was going to land on tijuana international airport. sure enough it came down but, for several seconds the object hovered and since i had first noticed it changed brightness. the object then began to move slowly to my left heading north. it then began to go down again slowly and it disapear behind a hill in the horizon. several minutes later a similar if not the same object appeared on a different spot in the horizon. this second object moved to my right and left an like the first object it moved slowly. this objects were anything from 2 miles to 10 miles away. this objects did not have a probe like regular aircraft. their light was white in color, and as i saw them i felt exitement. i taught of getting my binoculars but i didn't because i taught i would miss something. i have lived behind the tijuana airport. i see helicopters from naval outlying field imperial beach 24\\7. i know how naval aircraft look like. what i saw was different. i began to fill this report because those lights came back this time i saw them more than 4 times. the most peculiar of this sightings were that two lights appeared close to each other they descended a small distance then the lower one ascended a small distance and the higher one disappeared. the remainig one whent behind the hill. the last light that i have seen this night dissapeared before descending behind the hill. i would like to be contacted through email first if i am contacted."],"Object Flight Path":"Path then hovering","Date of the Event":"07/21/2009 09:18 UTC","Object Features":"Unknown"}