{"Summary":"UFO hovered over Avon colorado for about 2 and half hours moving from the northeast sky to the easter sky","trends":["There has been one other sighting in Avon","There were no other sightings in Avon on or around July 24th 2009"],"Object Shape":"Cigar, Disc, Fireball, Star-like","Tags":"City","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.645493,+-106.512107(18276)&iwloc=A&hl=en\"> mufon case (18276) map </A>","Region":"Colorado","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18276.html.txt","/var/www/straped/mufon/org/18276.html"],"Date of the Event":"07/24/2009 03:30 UTC","Latitude":"39.645493","Longitude":"-106.512107","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"07/24/2009 03:30 UTC","City":"Avon","Country":"United States","divs":["Sighting Detailsaround 3 30 am on July 24th 2009. my roomate and i were walkng back to the house when we noticed an odd looking star. we had never seen this star before and were not sure what to think of it so we started watching it. as we watched it we noticed that it was moving sparatically so we called a friend on the other side of town and woke him up to verify that we werent hallucinating. he confirmed that he saw the same bright light in the sky that is normally not there. He got his video camera out and briefly filmed the object. The object had flashing lights on it and had blue and green lights flickering from it. It continued moving across the sky slowly but when it moved it would move like it was hovering with sparatic bursts back and forth and up and down. I continued watching the object untill 5:40 am hoping the sun would shed some light on the object. With the morning light the stars behind began to fade however the light that was coming from the object was still just as bright. Above and to the south of it were two more faint blue and red flashing lights that were still shinning even when the little dipper faded. As well as one more set of blue and red flashing lights to the far north of the closest and brightest object. As the morning light got brighter you could vaguely make out a saucer shaped object with bright white lights on the top of saucer shape. I continued watching the object hoping it would be completely visible in the sun light. Around 5 30 am i witnessed two more objects fly by way faster than the object in question. One looked to be a stealth bomber shape high in the air moving rapidly from the northwest to the south east. Shortly after that another aircraft flying from west to east flew by and confirmed for me that this was not an airplane or helicopter of some sort. SHortly after the two aircrafts flew bye the sun rose higher and the object shrunk. It stayed just as bright as it was when it was closer but just seemed to be rising further and further away. I guaged the rising of the object with a telephone wire behind my apartment it started from hovering around 5 inches below the wire {from my perspective} to being 10 inches above the wire within 10 minutes. as it got higher it shrunk but stayed just as bright. AT that time i decided it was time to stop observing the event and went back inside. Only time will tell if what i saw was a confirmed ufo. I still need to watch my friends video camera aswell as check the sky tonight in order see if the object is still there. The entire sighting lasted about 2 and half hours during that time the object had moved from the north east skies to the eastern skies by the time i was unable to clearly make it out."],"Source":"MUFON","Case Number":"18276","Viewing Distance":"Unknown","Log Number":"US-07242009-0010","Object Features":"Undisclosed"}