{"Viewing Distance":"Unknown","Case Number":"18277","Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"37.215097","map":"<A HREF = \"http://maps.google.com/maps?q=37.215097,+-93.282789(18277)&iwloc=A&hl=en\"> mufon case (18277) map </A>","Summary":"Very bright light traveled from NW to SE directly overhead with no flashing lights or sound and proceeded to dissapear right in front of us...","Region":"Missouri","Log Number":"US-07242009-0011","Object Shape":"Star-like","divs":["Sighting DetailsMe and a friend were standing outside on his back porch Thursday night the 23rd. I have always been intrigued by the ufo phenomena and it has become habit everytime i go outside just to give a quick glance to the sky and check it out. On two different occasions i have seen objects that definately were not explainable in the past year in the Springfield area. The funny part is i have always told my friend about it with him always responding with \"I would have to see it to believe it!\" None of them, however, was as close or vivid as this particular one. As soon as we walked outside I glanced up and noticed a light about as bright as the North star but it appeared to be moving. I showed my buddy and he instantly said he thought it was a plane. I laughed at him and pointed out how bright it was yet at this point it was almost directly under us. Not to mention no strobe or pulsating lights. We watched it continue on over our heads until it was just past us and went from VERY bright to a very faint light and steadily decreased in brightness until it was completely gone. I waited about 20 seconds listening to hear something in case it was in fact a plane or helicopter. I have grown up around aircraft and consider myself fairly knowledgeable when it comes to flying objects and I know for a FACT that this was flying low enough that even if it was a small cesna that we would have heard the engines eventually. Long story short my buddy was pretty freaked out and called another friend to hear his story of just about the same exact experience he had another time when he was with me. Both incidents took place within a week of each other and within 5 miles of each other"],"Longitude":"-93.282789","Disposition":"IFO","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","trends":["There have been 31 other sightings in Springfield","There were no other sightings in Springfield on or around July 23rd 2009"],"Date Submitted":"07/23/2009 10:45 UTC","files":["/var/www/straped/mufon/html2text/18277.html.txt","/var/www/straped/mufon/org/18277.html"],"Date of the Event":"07/23/2009 10:45 UTC","City":"Springfield","Object Features":"Undisclosed"}