{"Disposition":"Unknown","divs":["Sighting DetailsThis afternoon between 5 and 5:30p while friend and I were standing in my driveway talking before they went home.I heard and then saw the local police helicopter make a low pass over my house at about 500 feet.I commented to friend that maybe they were looking for someone.After it flew over I noticed something flashing up at a higher altitude at about 1000-2000 feet toward's the east in an area that would be in the general vicinity of San Jose airport about 6 mile's from our position.I thought it was just a mylar type balloon,but is was fairly windy and after observing object it stayed in the same position.It was either pulsating light or reflecting sunlight off of shiny reflective surface.The light flashes seem to be at regular rapid interval's,too fast to be a balloon rotating.Friends and I watched for about 10-15 minute's then freind's had to leave.After they left(couple of minute's) I glanced back to where object was and it was no longer there.I then went to my backyard with binocular's and video camera and watched the sky for about an hour but saw nothing.The weather was pretty clear with very few whispy small cloud's and good breeze during afternoon.If I see object again I will try to video and post.There was a post recently on this recent sighting's in CA. at night in the last few day's that sound's very similar."],"Date Submitted":"07/23/2009 05:10 UTC","Summary":"Spherical object hovering and pulsating or reflecting sunlight while rotating.","Latitude":"36.783251","Country":"United States","Log Number":"US-07242009-0004","files":["/var/www/straped/mufon/html2text/18270.html.txt","/var/www/straped/mufon/org/18270.html"],"Case Number":"18270","Object Flight Path":"Stationary","Sighting Duration":"00:15:00","Source":"MUFON","Region":"California","Object Shape":"Sphere","Date of the Event":"07/23/2009 05:10 UTC","Longitude":"-119.414362","City":"Undisclosed","Tags":"City","Object Features":"Unknown","trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=36.783251,+-119.414362(18270)&iwloc=A&hl=en\"> mufon case (18270) map </A>","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Windy"}