{"Case Number":"18280","Disposition":"Unknown","Weather Factors":"None","Object Features":"Unknown","Date of the Event":"07/24/2009 10:20 UTC","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/18280.html.txt","/var/www/straped/mufon/org/18280.html"],"Tags":"City","Source":"MUFON","Date Submitted":"07/24/2009 10:20 UTC","Longitude":"-82.247343","divs":["Sighting DetailsI walked out the front door to take the dog out about 10:20 and I always look up at the sky to look for shooting stars and constellations. I got to the street and turned around looking NE above my house I saw what I thought at first was an airplane approaching or leaving the local airport which is about 5 miles away to the north. It was moving about the same speed as a very low level jet but seem to be at a much higher altitude and as I looked closer it looked more like a star - Round. It was about 80% above the horizon if 90% is directly overhead. As I walked slowly down the street I kept my eye on it and it continued to move smoothly N to S and I watched it for about 15 seconds until it just shrank into nothing or slowly dimmed to become invisible. There was no trail as with a shooting star and moved too slow to be a shooting star. My eyes followed its trajectory thinking I would see running lights if it were a jet aircraft that had just turned off its landing lights but there were no lights whatsoever and I listened closely for any jet engine or other engine sounds but heard nothing while it was visible or after it became invisible."],"Latitude":"34.744354","Viewing Distance":"Over One Mile","Log Number":"US-07242009-0014","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Simpsonville","There were no other sightings in Simpsonville on or around July 24th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.744354,+-82.247343(18280)&iwloc=A&hl=en\"> mufon case (18280) map </A>","Region":"South Carolina","Object Shape":"Sphere","Country":"United States","City":"Simpsonville","Summary":"White Ball of Light"}