{"Latitude":"39.520638","Object Features":"None","Summary":"I saw a bright blue orb fall STRAIGHT down from the sky, and then hover and zip around over the old dump behind my apartment.","divs":["Sighting Details I was sitting around a fire with my mother, a couple neighbors, and the owner of our complex, when I looked up over my apartment and saw the most brilliant blue orb, looking no larger than five feet in diameter, plummet from the sky as if it had appeared out of nowhere. I proceeded to explain to the people around what I had seen and realized that no one else had been looking in the direction at the time. I decided to walk out to the back area where I saw the light disappear behind my building, and saw the light skipping around the field, which used to be an old trash dump many years ago. Shocked, I went back and told the only person I felt comfortable what I had seen. My mother then went behind the building and saw the orb that now had split into two different and smaller orbs with the same bright blue light. I abandoned the area out of slight fear and confusion; I am not generally the type to see fantastical things. I am generally a write a list and prove your procedure type person. This was really strange and I have never experienced anything like it in my twenty-one years."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.520638,+-84.390456(18289)&iwloc=A&hl=en\"> mufon case (18289) map </A>","Region":"Ohio","Weather Factors":"None","Source":"MUFON","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/18289.html.txt","/var/www/straped/mufon/org/18289.html"],"Case Number":"18289","Country":"United States","City":"Middletown","Longitude":"-84.390456","Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Viewing Distance":"21-100 Feet, 101-500 Feet","Log Number":"US-07252009-0005","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around July 25th 2009"],"Disposition":"IFO","Object Shape":"Circle, Sphere","Date of the Event":"07/25/2009 01:00 UTC","Date Submitted":"07/25/2009 01:00 UTC"}