{"divs":["Sighting DetailsOn July 24th on the Pacific region of Southern British Columbia in Penticton, I was on my Balcony looking for signs of smoke clouds from the 4 fires we have burning aproximetly 60 miles North, North West of my location. After standing in the corner of my balcony stairing to the East I moved my eyes to the South and my eyes caught an object in the sky. Normally when i see somthing shiny in the sky I don't think anything of it, My city lies along one of the flight paths big planes use to fly in between Calgary or Toronto, or back to Vancouver. But in this case my attention was instantly atracted to this object. Normally when i see a Jet flying there is almost always a Con Trail behind it, this was not the case for this object. Now i am aware that this has no significant meaning, however the object did not seem to have a typical flight path or even similar speed compared to that of a normal Jet lyner flying over head. Now the object at first glance was aproximetly 5-10 miles South, South West of my location at aproximetly 10 000ft, flying North, North East. As i noticed the object, I was drawn to its shape, now when i see a jet i immeadietly notice the round shape to the fusilage of the Plane, now with this object i could not determine wether the object was rounded or more Boomerang shaped. More to the point I noticed that there were no wings on the object. By the time i noticed it had no wings it was turning Directly North, no longer heading in an Easterly position, as if it was noticing someone noticing it. So its movement looked like what i would define as an S turn. It was originally heading in an North Easterly position when it then turned to a Northenly position, proceeding North and almost flying directly over my position and then turning back to the North Easterly position it had originally been heading on. Its turn time lasted from start to finish no more then 15 seconds. Now this object made no sound, It had no defineable markings on it or tail which is visible on all Jets when they are turning. The object had two white lights being emited from under the tip and the middle of the object. In comparison to the legnth & width to the object each light was no more then four feet wide, or five. If i had to estimate the legnth of the object it was in between 80 & 150ft in legnth & 50 to 80 feet wide. Now atfer the object began turning East following its original heading it dissapeared in behind the cloud cover. Now from where the clouds were positioned the object should have emerged on the other side of the cloud cover with in 5-10 seconds. But it never did and i never saw it again. Immeadietly after i saw the object i tried phoning the local Air Port and finding out if they saw the object or atleast picked it up on Radar but i could not get in touch with anyone from the tower. So i wound up leaving a message on the Transport Canada 1-800 line with the time, location and question of wether or not there was any object or plane tracked in this location at that time. So right after that i thought of M.U.F.O.N. and new that i had to write down my sighting. I have seen multiple sightings in Penticton, so mabey this is a good spot for sky hunting. So thanks for this opportunity once again. And lets hope that one day soon we are all able to confront the complicated truths that exsist, and that the great mystery and shroud will be unvailed for all to know, and even though some do not want us to know, yet, we will one day."],"Longitude":"-119.588298","Region":"British Columbia","Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Path with directional change","Date Submitted":"07/24/2009 08:32 UTC","Latitude":"49.509118","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.509118,+-119.588298(18285)&iwloc=A&hl=en\"> mufon case (18285) map </A>","Log Number":"CA-07252009-0001","Date of the Event":"07/24/2009 08:32 UTC","Case Number":"18285","trends":["There have been 7 other sightings in Penticton","There were no other sightings in Penticton on or around July 24th 2009"],"files":["/var/www/straped/mufon/html2text/18285.html.txt","/var/www/straped/mufon/org/18285.html"],"Object Shape":"Boomerang, Cigar, Cylinder","Object Features":"Unknown","Summary":"The object was cylindtrical & had 2 white lights eminating from the Underside of the Object. The legnth is aprox.. 150ft","Tags":"City","Viewing Distance":"Over One Mile","Country":"Canada","Sighting Duration":"Undisclosed","City":"Penticton"}