{"Case Number":"18292","files":["/var/www/straped/mufon/html2text/18292.html.txt","/var/www/straped/mufon/org/18292.html"],"Object Features":"Undisclosed","Log Number":"US-07252009-0008","Object Shape":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"07/24/2009 03:39 UTC","City":"Superior","Weather Factors":"Unknown","divs":["Sighting DetailsI was taking random photos with Nikon S630 camera and took 14-15 photos of an intersection in Superior Colorado. One photo shows two objects and the next photo taken four (4) seconds later the two objects are not in the photo. NOTE: I cannot or did not see these two objects. I was looking in the direction of where the camera was pointing and did not notice them in the sky. I take random photos hoping something unusual will show up. I take approximately 7000 photos a week, and I can guarantee anyone taking the amount of photos I take will get photos of UFOs. This is the second time this week I got photos of unknown objects. On Tuesday July 14, 2009 I took a photo of a UFO and it is also submitted to MUFON. I was also sitting an another intersection in Boulder County Colorado waiting for the light to change. I simply have the moon roof open and hold my arm out and take photos. Over and over, as many as I can before the light changes. Of course if one is worried what people in other cars will think then don't do it. I get lots of looks, even from police officers. It is not illegal to take photographs, and remember; photograph everything and anything. Our alien visitors are out there and exist mainly in the IR spectrum which the human (most humans that is) eye cannot see. But digital cameras and video recorders can see IR and this is the secret."],"Disposition":"Unresolved","trends":["There have been 3 other sightings in Superior","There were no other sightings in Superior on or around July 24th 2009","This sighting has never been favorited.",""],"Latitude":"39.954093","Summary":"Two Objects appear in photo, then four seconds later in next photo do not appear","Longitude":"-105.158758","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.954093,+-105.158758(18292)&iwloc=A&hl=en\"> mufon case (18292) map </A>","Country":"United States","Region":"Colorado","Object Flight Path":"Undisclosed","Date of the Event":"07/24/2009 03:39 UTC"}