{"divs":["Sighting DetailsI had just arrived home after attending the Mysteries of the Universe Conference and listening to Stan Romanek's talk. He said that UFOs appear wherever he goes, so the entire assembly had gone outside at 9 PM earlier in the evening to look for UFOs, but no one saw anything. So after I got home I was looking in the sky to see if anything would appear and saw nothing for 15 minutes. Then I got the idea to send a telepathic message out to see if I would get an answer... and immediately upon finishing my sentence a very bright large light blinked on in the NNW sky at approximately 75 degrees up from the horizon. This was three times the size and brightness of Venus. The object stayed still for about five seconds, then moved North slowly for a short distance and stopped, then blinked out. I got the feeling that there was a craft there all along and it just put lights on so I could see it and know it was there, and moved so there would be no question that it was answering my message. Note: we have had a large number of UFO sightings in Independence lately. There is no need to assign this case - I am a field investigator and will close it out myself."],"Latitude":"39.097576","Region":"Missouri","Case Number":"18297","files":["/var/www/straped/mufon/html2text/18297.html.txt","/var/www/straped/mufon/org/18297.html"],"Viewing Distance":"Unknown","Log Number":"US-07252009-0012","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.097576,+-94.407827(18297)&iwloc=A&hl=en\"> mufon case (18297) map </A>","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around July 18th 2009"],"Object Features":"Unknown","Date Submitted":"07/18/2009 11:30 UTC","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Independence","Object Shape":"Star-like","Summary":"UFO appears in answer to telepathic message","Date of the Event":"07/18/2009 11:30 UTC","Object Flight Path":"Hovering then path","Weather Factors":"None","Longitude":"-94.407827","Country":"United States"}