{"City":"Callahan","Log Number":"US-07252009-0017","Object Shape":"Blimp","Date of the Event":"09/22/1975 12:00 UTC","divs":["Sighting Details Event took place in my hometown of Callahan Florida, where I have lived since I was about 12 yrs. old. The dates given above are aproximate, but I was around 15 yrs. old at the time of the sighting. We lived on 20 acres of mostly wooded land with neighbors on either side about eighty to one hundred yards away. Our house was about thirty yards off the small rural road with the front of the house facing the road. On the other side of the road at the time was just wooded land. ( Callahan is a small town with the population at the time of probably a thousand or less ). I'm pretty sure it was the mid 1970's as I was still in Jr. Hihg school. I was sitting on the couch which was against the wall facing the front of the house watching television which was against the oposite wall with a window about three feet to the right of the T.V., when a bright blue light caught my eye moving left to right outside the window. It took a couple of seconds for me to realise this was not an airplane as I always see the blinking lights of planes comming and going from the jacksonville international airport which was only about twenty miles away. I got up to go outside and get a better look from the front porch and it was vanishing behind the treeline on the other side of the road. It was sort of blimp shaped, with no blinking lights, just a bright glowing blue that seemed to move about the same speed as a cruising airplane. Please get back with me soon and let me know if anyone else saw something strange in Callahan or Jacksonville Florida in the mid 70's. This object or phenomenon looked so different from anything i've ever seen, it has stayed with me all these years."],"Country":"United States","Latitude":"30.569981","Disposition":"Unknown","Date Submitted":"09/22/1975 12:00 UTC","Region":"Florida","files":["/var/www/straped/mufon/html2text/18302.html.txt","/var/www/straped/mufon/org/18302.html"],"trends":["There have been 2 other sightings in Callahan","There was one other sighting in Callahan on or around September 22nd 1975"],"Weather Factors":"Unknown","Summary":"judging distance, at least 80 ft. in length, very bright flourescent blue glow moving slowly, vanishing behind treeline","Tags":"City","Case Number":"18302","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Longitude":"-81.825392","map":"<A HREF = \"http://maps.google.com/maps?q=30.569981,+-81.825392(18302)&iwloc=A&hl=en\"> mufon case (18302) map </A>"}