{"divs":["sighting detailsaround 1145 pm on 18 july 2009 i was on my porch smoking a cigeratte when i was looking to the north\\northeast over a bunch of trees ( live right by a culdesac, so not much woods. i saw a craft which i though was a plane moving north by northwest. this craft was just flying in the sky with what i thought were signal lights from a plane. all of a sudden this cfat goes pitch black, then you could almost see an outline of something ( cigar) than it changed it light pattern to where it was green on the bottom, and a redish green on the top. as this is happening a secong craft becomes visable, again with what i thought were lights.. this craft then (2nd craft)shuts down all its lights, then all of a sudden this thing lights up from the bottom with a yellowish white light. it looked like it was not 1 light but 3 or 4 clusters of lights at different segments of the craft. it was in the shape of a triangle. i heard no noise, my dog didn't go nuts. a few minutes later you could hear the faint whisp of helicopter rotors coming from the south. i served in the army, and i served in iraq. i was stationed at one time or another on the largest air bases in iraq, and i know what the air force navy and marines as well as the army uses for avaition... ( no i don't know about the top secret craft, but again i saw more than the regualr civillian. i just got an erie feeling when i saw this. more info.\\.. there is a small regional airport 3 miles from where i live but it is mostly cesnas, and there is no real military in the area. closest military post is naval station newport, 35 miles away, otis afb-- cape code ma-- (reserve af base) 30 miles away and handscome afb just north if boston in bedford ma-52 miles away"],"Date of the Event":"07/18/2009 11:45 UTC","Weather Factors":"None, Does Not Apply","trends":["There has been one other sighting in Raynham","There were no other sightings in Raynham on or around July 18th 2009","This sighting has never been favorited.",""],"Longitude":"-71.073116","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"41.948708","City":"Raynham","files":["/var/www/straped/mufon/html2text/18305.html.txt","/var/www/straped/mufon/more/18305_submitter_file1__Project7.jpg","/var/www/straped/mufon/org/18305.html"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.948708,+-71.073116(18305)&iwloc=A&hl=en\"> mufon case (18305) map </A>","Object Shape":"Cigar, Triangle","Source":"MUFON","Region":"Massachusetts","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"07/18/2009 11:45 UTC","Disposition":"IFO","Case Number":"18305","Summary":"Saw 1 object across sky change colors shape, then 2nd craft appeared","Log Number":"US-07252009-0020","Country":"United States"}