{"Log Number":"US-07252009-0016","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:02:15","Object Flight Path":"Stationary","Country":"United States","trends":["There has been one other sighting in Lawrenceburg","There were no other sightings in Lawrenceburg on or around July 24th 2009","This sighting has never been favorited.",""],"City":"Lawrenceburg","Date Submitted":"07/24/2009 11:30 UTC","divs":["Sighting DetailsAt approximately 11:30pm I was driving home and seen what looked like an airplane at a low altitude facing my way. This object had 3 very bright white lights and was shaped as a triangle. When I pulled up to the traffic light ( which was already red) I noticed it wasn't moving..Maybe a helicopter then? Only thing was is that it was completely still and there were no blinking lights on it. As I sat and looked at it searching for my phone to snap a picture the two lights on the side turned off and were immediately replaced by two lights going straight down. (almost like a rod) Two bright white lights one in the top and one in the middle and one red light at the bottom. The light turned green someone was impatient and started honking their horn and when I looked up again it was gone. This happened about 600 yards to the right of the casino, on U.S. 50. The object from a distance appeared to be hovering over the river or the neighborhood just in front of the river. We do have an airport (CVG) about 15 miles away,but again this object was completely motionless. Also note there are power plants nearby, but there was no blinking lights on this object."],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.097591,+-84.84265(18301)&iwloc=A&hl=en\"> mufon case (18301) map </A>","Summary":"Triangle, motionless, instantaneous light formation change","Date of the Event":"07/24/2009 11:30 UTC","Tags":"City","Object Shape":"Triangle","Latitude":"39.097591","Weather Factors":"None, Does Not Apply","files":["/var/www/straped/mufon/html2text/18301.html.txt","/var/www/straped/mufon/more/18301_submitter_file1__Object.jpg","/var/www/straped/mufon/org/18301.html"],"Object Features":"Unknown","Case Number":"18301","Longitude":"-84.84265","Disposition":"Unknown","Region":"Indiana"}