{"trends":["There have been 5 other sightings in Lacey","There were no other sightings in Lacey on or around July 25th 2009"],"Date Submitted":"07/25/2009 10:26 UTC","Date of the Event":"07/25/2009 10:26 UTC","Source":"MUFON","Object Shape":"Circle, Oval, Sphere","Tags":"City","Weather Factors":"Does Not Apply","Disposition":"IFO","Region":"Washington","Object Flight Path":"Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=47.040383,+-122.813852(18311)&iwloc=A&hl=en\"> mufon case (18311) map </A>","Log Number":"US-07262009-0003","Sighting Duration":"Undisclosed","Longitude":"-122.813852","Object Features":"Dome","Viewing Distance":"20 Feet or Less","Summary":"many unknown lights","City":"Lacey","Case Number":"18311","Latitude":"47.040383","divs":["Sighting DetailsMy mother went outside and saw lights in the sky, and called on to my father, and I eventually came outside to see it At first there were 4 oval lights in the sky that would circle in the sky and come to one exact point altogether. This went on for around maybe 20 minutes and during that time many other ovals than just the four would also appear but not as vividly as the main four lights. The lights in the sky would repeat this motion consecutivly they would form one main oval light break off and make a circular motion in the sky and then form back into one oval light. At the end of this mysterious event, there had then been two sets of four oval lights forming a single oval meaning four lights circulating in the sky and forming one oval light while another four lights would form one oval which were very close in distance together. At the end of the thirty minutes of this phenomenon it completly vanished just stopped altogether. My moms thoughts were maybe angels or ufos, My dads thoughts maybe the northern lights but then he decided it couldn't be since this phenomenon was going on far too long and there were many lights in the sky he also thought that when they formed one oval there could be a mother ship above the one oval they would form. Also this may not make any difference but the clouds in the sky parted away from the area of the ovals. It couldn't be lights from the ground since they converged so perfectly in many forms and covered vast areas, sometimes a oval light would dissapear and form very close again while going in the motion to form the single oval. I tried using my phone to take a video but it wasn't able to capture it the area is populated so there may be other viewers who would of captured it on film or camera."],"Country":"United States","files":["/var/www/straped/mufon/html2text/18311.html.txt","/var/www/straped/mufon/org/18311.html"]}