{"Country":"United States","Longitude":"-154.489962","Summary":"Flashing Light amongst the stars in the sky, didn't follow a straight line, moving fairly fast.","files":["/var/www/straped/mufon/html2text/18313.html.txt","/var/www/straped/mufon/org/18313.html"],"Log Number":"US-07262009-0005","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=63.595453,+-154.489962(18313)&iwloc=A&hl=en\"> mufon case (18313) map </A>","Date of the Event":"07/26/2009 12:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Unknown","Date Submitted":"07/26/2009 12:00 UTC","divs":["Sighting DetailsMy husband and I were outside our house, looking at the stars. We were admiring the belt of the milky way across the sky. Recently, we have become interested in the universe and all its mysteries. We were trying to spot anything out of the ordinary. Then he shouted \"oh!\" I knew exactly what he meant and instantly looked the direction he was pointing. It took my eyes a couple seconds to focus and then I saw it. It was moving across the sky. My first instinct was to try to justify it with something earthly, such as an airplane. But it was defiantly nothing I've ever seen before. First, it would go to the left across the sky, then it would go right, back to left. It made a few circular motions and then started going down. It wasn't following a straight line in any sense. The light was changing colors, red, white-ish (like the stars) and orange. I just kept saying \"wow\" and felt good about having witnessed that there is something out there, whatever it may be. We watched as it danced down behind some trees and out of sight. I kept watching and I saw it briefly as it passed between two tree and then it was gone."],"Case Number":"18313","Tags":"City","Viewing Distance":"Over One Mile","Region":"Alaska","City":"Undisclosed","Object Shape":"Circle, Star-like","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Latitude":"63.595453","trends":[]}