{"Object Flight Path":"Hovering then path","Log Number":"US-07262009-0007","Summary":"False Crescent Moon UFO","Date Submitted":"07/25/2009 10:15 UTC","City":"Tucson","Latitude":"32.223453","Sighting Duration":"00:25:00","Object Shape":"Disc, Egg, Oval, Sphere","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18315.html.txt","/var/www/straped/mufon/org/18315.html"],"Case Number":"18315","Region":"Arizona","Object Features":"None","divs":["Sighting DetailsI was outside waiting for my girlfriend to get off work. I like to wait for her outside so that she doesn't have to walk to the house alone in the dark late at night. Tonight I saw a UFO which appeared to be the Moon at first glance. First it was just a bright spot behind a cloud it seemed. The spot got brighter and appeared to be breaking through the clouds. A disc shape seemed to be travelling into our atmosphere. But over time this changed. It took quite awhile. Eventually it became a moon shape, and had a huge crescent shape that was lit up. It was huge, it was like the Deathstar from Star Wars. It was black it seemed, but a crescent shape appeared and quickly seemed to light up brighter and brighter, almost too bright. I thought either a meteor or a nuclear missile was coming to kill us, I really thought it was the end of my life. I walked inside to check the time of the event, shaking, my knees trembling. I went back outside and dared to look again at the horrible object. Was it the moon? I kept walking down the sidewalk. But after I got past some street lights I could see it so bright. It had to be the moon. Only when I walked back to the area I was waiting in, the moon had appeared to get much lower in the sky, and was turning bright orange! Only the crescent shape seemed to turn orange. I watched it, and it quickly, within seconds, seemed to be plummeting down to earth. It seemed to be very very far away or in space, and it's lights started turning bright orange, then! Another UFO appeared MUCH closer, seemed like it was just behind some trees near me though this huge object was the size of the moon. This new UFO flashed blue lights, about two rows of lights with about 7 blue lights on each row around the center of this second UFO. It went black again immediately, it flashed for literally only a second. The huge UFO then seemed to continue getting lower and lower in the sky, as if it was a setting sun. But this was late at night and surely the moon cannot set in under a minute from a position high in the sky. The descent was ridiculously quick and is what made em realize for the first time that this wasn't the moon and was a UFO! Then the lights began to turn off and inbetween the orange light there appeared black spots, like the spots on a cheetah, and I imagine that this is the lights going off. Over a few seconds the object continued to plummet behind the horizon and the color faded completely to black."],"Longitude":"-110.921579","Viewing Distance":"Over One Mile","Country":"United States","Source":"MUFON","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.223453,+-110.921579(18315)&iwloc=A&hl=en\"> mufon case (18315) map </A>","Date of the Event":"07/25/2009 10:15 UTC","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around July 25th 2009"],"Tags":"City"}