{"Country":"United States","Tags":"City","Source":"MUFON","Summary":"spotted heading south","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date of the Event":"07/22/2009 09:45 UTC","Region":"Kansas","Date Submitted":"07/22/2009 09:45 UTC","City":"Lawrence","Viewing Distance":"Unknown","trends":["There have been 18 other sightings in Lawrence","There were no other sightings in Lawrence on or around July 22nd 2009"],"Log Number":"US-07262009-0015","Latitude":"38.975139","divs":["Sighting DetailsWe were driving south on Alabama street between the 25th and 27th streets and saw an orange light in the sky traveling slow. I noticed it floating beyond some trees and watched it as it traveled at a steady but slow pace. I was with my friend, who was driving, and my boyfriend, who was sitting in the back of a truck. We were going to the movies and were going to the late show. I pointed it out to my companions and said, \"What is that?\" and they noticed it too. We pulled up to the stop sign and watched it. It was still there as we went another 2 blocks south and then pulled over and watched it. We stopped at the corner of 27th Terrace and Alabama street. Once we got out of the truck it seemed to move faster away from us, we were trying to discuss what it could be. It was too slow and had a constant orange glow to be a plane or a helocopter and did not exhibit any flashing or pulsating lights. It was very slow and seemed to be flying in a curve upwards and right. As we watched it, it dimmed so that it almost disappeared and then came back for a few moments and then faded again and was completely gone. The whole thing lasted for about 5 minutes. There were no clouds in the sky and you clearly see stars. We then drove to Louisiana street cutting across westward on 27th terrace and continued south on Louisiana. We were still hoping to see it in the sky somewhere because we couldn't believe that it had disappeared. We drove all the way to N 1250 Rd, where there are less lights and traffic, and continued to look for it in the sky but there was no movement anywhere. If it was a plane or helocopter, we should have still been able to see it from where we were."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.975139,+-95.22673(18323)&iwloc=A&hl=en\"> mufon case (18323) map </A>","Case Number":"18323","files":["/var/www/straped/mufon/html2text/18323.html.txt","/var/www/straped/mufon/org/18323.html"],"Object Shape":"Fireball","Disposition":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-95.22673"}