{"Case Number":"18328","Disposition":"Unknown","divs":["Sighting DetailsWe were on our Honeymoon in Sedona staying at the Wyndham. On the night of July 19, 2009, at 11:10 PM we went on our balcony, which overlooks the mountains, and saw a brilliant light in the sky, above the mountain. At first I thought it could be an airplane or helicopter but then realized it was too high for a helicopter. And that an airplane would not stay still for so long - there were also no red blinking lights that an airplane has when flying at night. There were few stars in the sky, due to some storm clouds and light pollution - it was the only light. After 10 min with it still in one spot we grabbed our camera and took still pictures and video. Attached are photos, and video which we took that night. When we viewed the video enlarged, it appeared to be a gyro sphere shape made of mostly energy. You will see a rotating ball of light in the center of the screen. We left the camera on a tripod so it stayed stationary. As you will see it just hovers in the sky. Then the UFO fades out, due to cloud coverage. We were excited that we saw this UFO on our Honeymoon. Three days later we went to a store in Sedona called \"Ye Olde UFO Store\", they sell UFO items such as T-shirts, bumper stickers etc. We wanted to get a T-shirt for ourselves because of the event. We spoke with the store manager Jen, who told us her boss Bill saw the same object in the sky on the very same night we did. He drew a picture of what he saw, and it was exactly what we had on film - exciting!!"],"Object Features":"Other, Unknown","City":"Sedona","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"None","Region":"Arizona","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around July 19th 2009","This sighting has never been favorited.",""],"Longitude":"-111.75277","Tags":"City","files":["/var/www/straped/mufon/html2text/18328.html.txt","/var/www/straped/mufon/org/18328.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.87112,+-111.75277(18328)&iwloc=A&hl=en\"> mufon case (18328) map </A>","Object Shape":"Circle, Cylinder, Other, Unknown","Country":"United States","Source":"MUFON","Date Submitted":"07/19/2009 11:10 UTC","Summary":"UFO was in the sky for over 20 min in one spot. We took pictures and videos. it appeared to be a gyrosphere shape made of mostly energy","Log Number":"US-07262009-0020","Viewing Distance":"Unknown","Date of the Event":"07/19/2009 11:10 UTC","Latitude":"34.87112"}