{"Longitude":"-79.378144","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy boyfriend and I were laying in the grass in Allen Gardens Park - one of the many parks in the heart of downtown Toronto. It was a clear day with no clouds in the sky and I was laying on my back reading a book. A sudden feeling of peace came over me and I put my book down so I could bask in the feeling more fully. I was looking into the sky when I saw what I thought was a seagull (there were many gulls flying about that day). I thought it strange that a bird fly so high it would appear as a sphere. I then noticed it was not alone. There was an identical sphere traveling next to it. The two objects smoothly glided across the clear sky far above the city. They kept the exact same distance from one another (you could probably fit five of the same sized spheres between the two), almost as if there were an invisible rod separating them. As they glided in what seemed a perfect line, I could see that they were perfect orbs with reflective surfaces. It was strange because I wasn't excited in the least, in fact I was very calm. I had seen objects in the sky as a child but I never trusted the memories because I was so young and I had not experienced anything like it in my adulthood. I mention this only because I found my mood and reaction to be surprisingly uncommon. I got my boyfriend's attention and pointed the objects out to him. He too was strangely calm throughout the sighting. We watched in contentment as they smoothly crossed the open sky, following them with pointed fingers so that anyone else interested in the park could see them too. Just before they were out of sight behind a high rise building, a third shining sphere rapidly flew across the sky with unimaginable speed and stopped abruptly without slowing when it met the other two spheres. Keeping the same distance from its partners as the two original spheres had, the now three spheres (all the same size, same reflective anteriors and same distance from one another) glided together out of sight, forming a seemingly perfect triangular formation. I now look for similar things in the sky whenever there is a clear day (there haven't been many, we've had an uncommonly rainy summer this year) but I haven't seen anything in the daytime like this. Only once more on July 9th, approximately 12:30am. My boyfriend and I were out on a late night walk because we could actually see some stars in the night sky (a very rare occurrence in downtown Toronto). We went to a park that had low light pollution and we were able to see many stars. That is when we saw what looked like stars (they shined the same) moving across the night sky. They all glided quickly and smoothly in perfect lines across the night sky until they were out of sight. They did not leave behind tails of light like comets do and they moved way too quickly to be airplanes or satellites. My assumption is that the objects were out of our atmosphere and they were reflecting sunlight causing them to glow in the night sky as they flew by. We saw four at different times within a twenty minute time frame. The third we saw didn't just fly out of sight. It moved smoothly across the sky then flashed, as if there was a big explosion then it was just gone. Neither my boyfriend or I had the same calm feelings we had when we saw the three orbs in the daytime. We were just excited and skeptical, not really placing too much in the possibility these objects were like the spheres."],"trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around May 31st 2009"],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18322.html.txt","/var/www/straped/mufon/org/18322.html"],"Summary":"Two spheres gliding across the sky, then joined by a third, creating a trianglular form/ four lights in the sky, one flashes before it dissapears","Latitude":"43.660516","City":"Toronto","Object Shape":"Sphere","Object Features":"None","Source":"MUFON","Region":"Ontario","Log Number":"CA-07262009-0014","Tags":"City","Date Submitted":"05/31/2009 03:49 UTC","Date of the Event":"05/31/2009 03:49 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.660516,+-79.378144(18322)&iwloc=A&hl=en\"> mufon case (18322) map </A>","Country":"Canada","Sighting Duration":"Undisclosed","Case Number":"18322","Disposition":"Unresolved"}