{"Disposition":"Insufficient Data","City":"Larabee","Date of the Event":"Unknown","Case Number":"18326","trends":["There have been no other sightings in Larabee","This sighting has never been favorited."],"Object Features":"Other","Summary":"Witness was driving and heard a grinding, swishing, whirling sound. Rolled window down to try and see what it was. Pulled over, got out. Object was about 2 blocks away. Gray wing-like with red and white pulsating lights. When in distance kept driving.","Log Number":"US-07262009-0018","Date Submitted":"07/26/2009 06:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.773758,+-92.337442(18326)&iwloc=A&hl=en\"> mufon case (18326) map </A>","Object Flight Path":"Straight-line path","divs":["sighting detailswitness was north of larabee, ia driving south on hwy 59. 12-1 am. 1968 summer or towards fall, warmer weather. heard sound he compared to a sewing machine; grinding, swishing, whirling. he could see planes and a radio tower in the area. there were many stars. he rolled his window down and tried to see it and almost went into the ditch. he pulled over and got out. gray wing-like object with red and white pulsating lights (couple beats per sec). see drawing. he had heard the sound in the car for about 30 sec and for about 30 sec after he got out. object was about 2 blocks away. object must have passed almost over him. object was at 30 degrees in the west and was moving west. speed approx. 50-60 mph. 40-50 foot diameter. 4-5 foot width or more. 250-300 feet high. watched for 3 to 4 minutes. he continued driving before it disappeared. witness had read a little about flying saucers before the sighting (frank edwards stuff) and said he was a fancier. \"there's something there. i don't know where in the hell they come from or who's got them but there's something there.\" old report. interviewed by paul hicks 6\\30\\1972. at the time mr. weber was 48. paul hicks, iowa. mufon field investigator."],"files":["/var/www/straped/mufon/html2text/18326.html.txt","/var/www/straped/mufon/org/18326.html"],"Object Shape":"Other","Region":"Iowa","Country":"United States","Latitude":"42.773758","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Longitude":"-92.337442","Weather Factors":"None","Sighting Duration":"Undisclosed"}