{"Source":"MUFON","Log Number":"US-07262009-0024","Sighting Duration":"Undisclosed","Date Submitted":"11/30/1995 12:00 UTC","divs":["sighting detailsit was dusk, sometime in the late fall of 1995 or winter of 1996, i think, and i was driving home from my job across the mississippi river in davenport, iowa to my home in moline, illinois. as i drove south on i-74 toward the john deere exits, i saw a ufo hovering just above a clump of trees near a field by the side of the road. i watched it for a minute or so and, at first, thought it was some kind of big advertising balloon. it looked like a \"flying saucer\" but i couldn't believe that it was. i tried to keep it in sight as i took the cloverleaf exit to john deere road east. by that time, i had decided that it wasn't a balloon and had to be a ufo, the first i had ever seen. i drove east on john deere road, trying to keep it in sight as i approached it. at that time, the south side of jd road, was mostly fields, with one large section, near the interstate, which was being graded for construction of a strip mall with a wal-mart. as i got closer to my street (60th street, moline) i saw that the object was lower, now hovering just above a huge sign in front of a gas station\\minimart. the sign said m a r t and was approximately 12'- 15' wide and about 3' high. it was at the top of posts, about 15' tall, so the ufo was about 20' above the ground. it was about the same length of the sign, 12-15' wide and seemed to be made of 2 plates (the top one upside down), with large round windows in between. the windows were glowing. as i drove along, with some other traffic in both directions, i kept repeating to myself \"why aren't we stopping? why isn't everyone pulling over to look at this thing?\" but, like everyone else, i just kept driving and staring. as i drove past it, i bent down and tried to see the back of it through the passenger-side windows. it looked the same all the way around, at least as much of it as i could see. suddenly, i was facing straight ahead and repeating (in my head) \"it's time to go home now. it's time to go home now. it's time to go home now.\" i didn't try to look back and see if the object was still there; i was completely focused on going home and kept repeating \"it's time to go home now\" as i drove home to my apartment building. every time that night, when i started to think about what i had seen, my mind would switch away to something else. i was very uncomfortable whenever i tried to remember what had happened. then, about a year later, in the summer, when there were a number of television shows about ufos, commemorating the 50th anniversary of the crash at roswell, i saw one very short clip of exactly the same object that i had seen. in the clip, it looked exactly the same, including the same size, and was slowly moving above some trees and across the screen. i was very excited because, in all of the tv ufo programs i had seen, this was the first -- and only -- time i had seen anything that looked like \"my\" ufo. that was also the first time in months that i had allowed myself to remember the sighting. prior to that, something had always kept me from thinking about it."],"Case Number":"18332","trends":["There have been 7 other sightings in Moline","There were no other sightings in Moline on or around November 30th 1995"],"Date of the Event":"11/30/1995 12:00 UTC","Viewing Distance":"20 Feet or Less","Summary":"Driving home from work, I saw a small UFO hovering above a very large sign, beside John Deere Road, East.","Latitude":"41.51301","Object Features":"Window(s)","map":"<A HREF = \"http://maps.google.com/maps?q=41.51301,+-90.513944(18332)&iwloc=A&hl=en\"> mufon case (18332) map </A>","Country":"United States","Object Shape":"Disc, Oval","City":"Moline","Longitude":"-90.513944","files":["/var/www/straped/mufon/html2text/18332.html.txt","/var/www/straped/mufon/org/18332.html"],"Object Flight Path":"Stationary,Path then hovering","Tags":"City","Region":"Illinois","Disposition":"Unresolved","Weather Factors":"Unknown"}