{"Viewing Distance":"501 Feet - 1 Mile","Case Number":"18336","Latitude":"28.461508","Region":"Texas","Weather Factors":"Windy","Log Number":"US-07262009-0028","Sighting Duration":"00:00:30","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Circle","Date of the Event":"07/26/2009 10:15 UTC","divs":["Sighting DetailsIt was very windy this night with a strong wind blowing from the SE. I went outside to walk my dog when I noticed something in the sky out of the corner of my eye. I saw what appeared to be something about as bright as a Street light. But here in Tilden, TX we do not have many street lights and this light was pretty high off the ground so I knew this was not what it was. I am guessing it was about a 1000 ft off the ground. I thought it might be the front landing lights of an aircraft but there is not airfield close by here and this was bright orange. We do get military aircraft here due to the bombing range but this was no airplane. This was moving very, very slow from West to East. I was yelling for my wife to get out here to see it but by the time she got there it was fading away. I am not sure if it was gaining altitude or just fading away but it was gone with no sign of it anywhere. I looked for it to reappear off in the horizon, but there was nothing. I am not sure what I saw but I have seen a thousand aircraft in the night sky and this was no aircraft or sattelite. If there was anything else reported like this around this date please let me know. Gabe Spencer"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/18336.html.txt","/var/www/straped/mufon/more/18336_submitter_file2__Case18336map.jpg","/var/www/straped/mufon/more/18336_submitter_file3__Initialsighting.JPG","/var/www/straped/mufon/more/18336_submitter_file4__Finalsighting.JPG","/var/www/straped/mufon/more/18336_submitter_file5__Initialreference.JPG","/var/www/straped/mufon/org/18336.html"],"Summary":"Very Bright Orange Light or Ball","map":"<A HREF = \"http://maps.google.com/maps?q=28.461508,+-98.549378(18336)&iwloc=A&hl=en\"> mufon case (18336) map </A>","Tags":"City","Disposition":"Unknown","trends":["There have been 3 other sightings in Tilden","There were no other sightings in Tilden on or around July 26th 2009","This sighting has never been favorited.",""],"Longitude":"-98.549378","Country":"United States","City":"Tilden","Date Submitted":"07/26/2009 10:15 UTC"}