{"Object Features":"Undisclosed","Country":"United States","Longitude":"-73.468691","Source":"MUFON","Date of the Event":"07/04/2009 04:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.685466,+-73.468691(18337)&iwloc=A&hl=en\"> mufon case (18337) map </A>","Region":"New York","City":"Massapequa","Log Number":"US-07272009-0001","files":["/var/www/straped/mufon/html2text/18337.html.txt","/var/www/straped/mufon/org/18337.html"],"Case Number":"18337","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Disposition":"Unknown","Date Submitted":"07/04/2009 04:00 UTC","trends":["There have been 5 other sightings in Massapequa","There were no other sightings in Massapequa on or around July 4th 2009"],"Weather Factors":"Unknown","divs":["Sighting DetailsAlthough i see many reports posted, my siting was at close range. I was at a party at a bay front house over looking jones beach and at around 4pm i was talking to a gentleman who is a commercial airline pilot.We were talking about cars. All of a sudden his wife says , hey Bob check out that thing in the sky. We both looked. It was a brite red orange light off in the distance heading south.She chuckled and said it looks like a ufo. From where we were sitting we could see a commuter airliner on approach to kennedy airport.The light and the 4 engine jet seemed to be the same distance away.They also seemed to be at the same elevation.The light was as big as the jet from my vantage point.I thought it was strange and when i asked bob what he thought, he said he thinks he sees a flashing strobe.I thought humm, and we went back to talking cars. AT around 10:30 pm i was still at the party and all of a sudden i hear the children on the dock say, what The heck is that ? I looked up and There it was, A huge red orange egg shaped craft comming over the house.It headed due south out to the ocean.There was a cloud out in the distance and it seemed to dissappear into the cloud.A few seconds into this, another one comes from the western side of the house.It went in the same direction.A few seconds later a 3rd one comes over the house and heads out over the ocean just like the other 2. While the 3rd one was heading out i notice to the east that a commuter jet was traveling north west comming from over the ocean and i said to my girlfriend that gauging the jet i thought the ufos were as big if not bigger then the jet. They were moving about as fast as the jets look on approach.I was told that the jets come in at about 4000 feet.There was no way those pilots didnt see these craft. At that elevation these craft were huge.I also should mention that they made no sound.I am sorry that we did not take a picture or have a video camera because i believe this would have been the greatest ufo video ever shot.Some of my friends saw this from 15 miles west of where i was.Another friend was about 7 miles west of me and saw them with her kids.This was an awsome sight. All i can think is that everything i read about ufos came true at that moment.Its a little scary. I even spoke to Stanton Friedman after taking his phone # out of his book Flying Saucers and science. He was generous with his time and seemed interested in the story. Thanks."],"Object Shape":"Egg","Sighting Duration":"00:30:00","Tags":"City","Summary":"multiple ufo sitings","Latitude":"40.685466"}