{"Object Shape":"Triangle, Other, Unknown","Date Submitted":"07/27/2009 01:00 UTC","Log Number":"US-07272009-0002","Source":"MUFON","Object Features":"Unknown","Summary":"Object moving slowly south to north, strobing red, blue, white lights, stops, hovers for 15 min. Slowly rotating lengthwise.","trends":["There have been 4 other sightings in Madison Heights","There were no other sightings in Madison Heights on or around July 27th 2009"],"Longitude":"-83.105203","Date of the Event":"07/27/2009 01:00 UTC","Latitude":"42.485869","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.485869,+-83.105203(18338)&iwloc=A&hl=en\"> mufon case (18338) map </A>","divs":["sighting detailsobserved an object traveling slowly from south to north, flashing a linear row of white bright strobe lights sequentially along its entire length from back to front, a bright red strobe on the front, and a bright large blue white strobe light on it's rear end on one corner, and a large white strobe light on the other corner. object was 15 degrees up from the horizon to the west of my position, 15 to 20 miles away, and an estimated 1\\2 to 1 mile in length. it stopped and hovered in one position, while slowly rotating end to end, for approx. 15 min. it then proceeded to slowly travel in a north westerly direction for 5 min or so until it disappeared behind the trees in the distance. the object was at an estimated altitude of 4000 to 6000 feet. it could be that the lights were rotating and not the object, but when i observed the lights strobe along it's length when i first spotted it, i had the distinct impression that it had a linear shape to it rather than a round shape to it. the lights that strobed along it's length were a very bright white, much brighter and larger than an airplanes lights, and no aircraft have white strobe lights flashing along the length of the craft. it took a good 4 or so min. for the object to travel from south to north before it stopped and hovered, leaving ample time to sort of discern its general shape. i did not observe an outline or actual craft, only the lights strobing. all of the lights strobed without exception, no flashing lights at all were observed. observations were calm and deliberate. i stared at it till my eyes watered, then it disappeared behind the trees."],"City":"Madison Heights","Viewing Distance":"Over One Mile","Sighting Duration":"00:20:00","Case Number":"18338","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/18338.html.txt","/var/www/straped/mufon/org/18338.html"],"Object Flight Path":"Path then hovering","Region":"Michigan","Disposition":"Insufficient Data"}