{"files":["/var/www/straped/mufon/html2text/18343.html.txt","/var/www/straped/mufon/org/18343.html"],"Case Number":"18343","City":"Elmira","Object Shape":"Disc","Disposition":"Hoax","trends":["There have been 6 other sightings in Elmira","There were 2 other sightings in Elmira on or around July 5th 2009"],"Log Number":"US-07272009-0007","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Region":"New York","Tags":"City","Summary":"follow-up from previous report","divs":["Sighting DetailsI have been targeted since the age of 5 is the earliest I can remember. I have encountered the missing time, paralyse (sp) EVEN pulled a piece of metal out of my nose at the age of sixteen! why are these crafts I have seen NEVER the same as any of the thousands of pic I have looked at?? I beleive in my heart and soul there is a tracking device in ME! I will submit to any testing, hypnosis , anything! The more this goes on the more its bothering me ! After seeing the pic of this last one it just brought back all the other memmories I have tried to forget. these are not little Focking gray men! At least, thats NOT the descripton they want me to believe! Also, this second siteing was \"ONE BLOCK\" from the last one !!! Heres another one for you focksticks! I had a scuba diving accident at the age of 16 to which, I had to have my sinuses checked for rupturing!! The Focking Doctor told me I had nasal surguery!!!!!!!!!!! THESE ARE NOT LIZARD PEOPLE AND ALL THIS OTHER BULL !! AT LEAST NOT THE SPECIES THAT COME AFTER ME OR WANT ME TO SEE THEM AS SOMETHING ELSE. FYI FOCKSTICKS- I NEVER HAD A HALUCINATION IN MY LIFE......."],"Viewing Distance":"Unknown","Sighting Duration":"00:00:03","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.099556,+-76.801684(18343)&iwloc=A&hl=en\"> mufon case (18343) map </A>","Date of the Event":"07/05/2009 12:00 UTC","Latitude":"42.099556","Longitude":"-76.801684","Object Features":"Undisclosed","Date Submitted":"07/05/2009 12:00 UTC","Country":"United States"}