{"files":["/var/www/straped/mufon/html2text/18345.html.txt","/var/www/straped/mufon/org/18345.html"],"Date of the Event":"07/22/2009 10:00 UTC","Object Flight Path":"Straight-line path","trends":["There have been 4 other sightings in Elkview","There were no other sightings in Elkview on or around July 22nd 2009"],"Latitude":"38.436471","Country":"United States","Viewing Distance":"Unknown","Longitude":"-81.465503","divs":["Sighting DetailsMy husband has deer permits because they are eating up his fruit trees. he has a chair on the roof with a spotlight. I go up on the roof with him sometimes. well, on July 22, I did not go. He came off the roof about 11:00PM, as he can not shoot past 11 at night. He said, he saw a sattelite then it just 'winked' out. I have been going on the roof every night with him since. Except Saturday, we had thunderstorms. Last night, July 26, I decided to lay down as it crooks my neck to keep looking straight up. The funny thing is, we can only see stars, right over us and some behind us. Some times the 'stars' will blink off and on. Last night one of the 'stars'. just took off. It went for a ways, then blinked out. One went a long ways, by they way, they are silent. As soon as it 'went out', it just seem to come back, exactly the same track it has just went. No plane can do that and they do not strobe like planes do and yes, we do see planes too. One of the nights, a bright light came over the trees with a very small sattelite behind it. It winked out, right away. As the bright light went across the sky, my lines going thru it. Meaning it was in 4 sections. Then, it to blinked out without going all the way across the sky. Last night, just as I got on the roof and stood up, he told me to look and there was another bright light, just going over the trees, out of sight. completely silent. I sure don't know what these things are. I always take a flash light with me, so I can get off the roof safely and down a latter. I thought later, what if I flashed that bright light. I bet it would have shot a beam down at us. So, if I see one again. I probably won't shine my flash light at it. we do talk, as these things are at high. stars are in outer space. but, I suppose these things are not. some times as the cross over they brighten up. it is really weird..."],"Object Features":"Unknown","Log Number":"US-07272009-0009","Tags":"City","Region":"West Virginia","Case Number":"18345","map":"<A HREF = \"http://maps.google.com/maps?q=38.436471,+-81.465503(18345)&iwloc=A&hl=en\"> mufon case (18345) map </A>","Object Shape":"Star-like","Date Submitted":"07/22/2009 10:00 UTC","Source":"MUFON","Summary":"go across the sky and fade out, saw lots of them. like sattelites, but faster","Sighting Duration":"02:00:00","Weather Factors":"None","City":"Elkview","Disposition":"Unknown"}