{"Viewing Distance":"101-500 Feet","Sighting Duration":"00:02:00","Weather Factors":"None","Source":"MUFON","trends":["There have been 2 other sightings in Big Lake","There were no other sightings in Big Lake on or around July 27th 2009"],"Date of the Event":"07/27/2009 03:30 UTC","files":["/var/www/straped/mufon/html2text/18346.html.txt","/var/www/straped/mufon/org/18346.html"],"Case Number":"18346","Country":"United States","Object Shape":"Circle","Object Flight Path":"Straight-line path","Region":"Minnesota","divs":["sighting detailsi was delivering the daily paper this morning and as i put the paper in the last box for the development i was in, i saw a red light in the tree's where there is no red light normally. as i was heading out of the development i was looking to my left and right because there are allot of deer around and i didnt want to hit one. as i looked left i saw through the trees a red\\white light that isnt there normally. it was about 100-150 feet in the air and about 300-400 feet away.as i turned onto a crossroad i saw the object again at left\\center and it was changing from red to light red\\white. i came to the intersection of 169th street and turned right where i lost sight of it. i realized that when i got to hwy 4 where i had another paper to deliver i would be able to see it again so i raced to get to hwy 4. as i turned left onto hwy 4 i saw the object again but it was on my right and allot farther away now so i sped down 4 to deliver the paper as i was watching this thing. i threw the paper in the box and continued down hwy 4 as i watched the object. i stopped and watched as it flew away then i turned around and want back to delivering the rest of my paper i know it wasnt an airplane or helicopter because the thing didnt have any of the white and green strobelights that planes\\choppers have. this thing was glowing light red\\white and then red."],"Date Submitted":"07/27/2009 03:30 UTC","Latitude":"45.336605","Log Number":"US-07272009-0010","map":"<A HREF = \"http://maps.google.com/maps?q=45.336605,+-93.74656(18346)&iwloc=A&hl=en\"> mufon case (18346) map </A>","Tags":"City","Longitude":"-93.74656","City":"Big Lake","Summary":"saw a object this morning as i delivered papers","Object Features":"Unknown","Disposition":"Unknown"}