{"Date of the Event":"07/21/2009 11:47 UTC","Country":"United States","Longitude":"-122.659076","divs":["sighting detailsi live in vancouver, washington, a city of several hundred thousand, vancouver is located across the columbia river from portland, oregon. i live on the eastern side of vancouver well within city limits, i have a top-floor apt with a back porch with a somewhat limited viewing area due to neighboring trees, structures ect. i am located ne of and approx. 10 miles from portlands pdx airport and under a north\\south air corridor. typical air traffic flies at about 10-30,000 ft elevation. on july 21,2009, at 11:47pm i was sitting on my porch stargazing, i had just looked up when i noticed (only because it was moving) a rectanglar shaped object crusing at about 200-300 mi an hour from se to nw at a low altitude, maybe a thousand feet up. its size if drawn on paper and held at arms length was appox. 2\"x 4\". i could not understand what i was seeing as i am aware that rectangles are not areodynamic, i was stuned and strugling to understand what i was watching. it was a clear starry night, no moon, the iss had passed by at 9:56pm and this was absolutely not that, nor was it any other familar aircraft. please contact me; i want to know about any other reported rectangular ufo sightings, recent or past. this sighting is real."],"Date Submitted":"07/21/2009 11:47 UTC","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=45.645458,+-122.659076(18349)&iwloc=A&hl=en\"> mufon case (18349) map </A>","Summary":"Flying RECTANGLE: color: dark/black; no running lights; no other lights; silent; dark line perimeter.","Viewing Distance":"Unknown","Log Number":"US-07272009-0013","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around July 21st 2009"],"Case Number":"18349","Weather Factors":"Unknown","Sighting Duration":"00:01:00","Disposition":"Unknown","Object Shape":"Square, Rectagular","City":"Vancouver","files":["/var/www/straped/mufon/html2text/18349.html.txt","/var/www/straped/mufon/org/18349.html"],"Object Features":"Undisclosed","Latitude":"45.645458","Object Flight Path":"Undisclosed","Tags":"City","Source":"MUFON"}