{"Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was traveling to St.Louis on U.S. 61 and some lights in sky got my attention. I was curious and perplexed at first but as I observed more it seemed there were two or three of them and they were interacting with each other and sometimes even lit up the ground like daylight. I became scared and pulled over to a friends to get off the road for a while. After an hour I returned to my car again the flashing lights,white, were in the sky but I continued my drive to DeSoto. I became lost twice, very unusual for me and frustrated me a great deal. Once I was turned around i drove upon a german shepard just sleeping in the road and I thought how strange as no one in the area owns one and to the right of my car I saw a huge ufo ,disc with one on top of the other ,blue and red lights and my car began to die. I panicked and tried to call 911 on my blackberry but it locked up completely and I could not reach anyone. I remember looking in the rear view and the dog just woke up and walked off the road. I was 4 days later coming home and along the way on 61 again a huge light came upon my car very fast and I was followed by a disc with green and yellow lights for a few minutes and then it flew off. Truly terrified and car has had electrical trouble since. I do have some footage on my blackberry."],"Country":"United States","Case Number":"18359","Object Flight Path":"Stationary","Weather Factors":"Unknown","Object Features":"Unknown","Region":"Missouri","Latitude":"38.635412","Date Submitted":"07/16/2009 01:40 UTC","Longitude":"-90.195974","Summary":"Disc ,one on top of other, red, blue lights","map":"<A HREF = \"http://maps.google.com/maps?q=38.635412,+-90.195974(18359)&iwloc=A&hl=en\"> mufon case (18359) map </A>","Disposition":"Unknown","trends":["There have been 74 other sightings in St Louis","There were no other sightings in St Louis on or around July 16th 2009"],"Object Shape":"Disc","Date of the Event":"07/16/2009 01:40 UTC","Source":"MUFON","Tags":"City","Sighting Duration":"04:00:00","City":"St Louis","files":["/var/www/straped/mufon/html2text/18359.html.txt","/var/www/straped/mufon/org/18359.html"],"Log Number":"US-07282009-0001"}