{"Object Shape":"Star-like","Longitude":"-116.942534","map":"<A HREF = \"http://maps.google.com/maps?q=34.268062,+-116.942534(18350)&iwloc=A&hl=en\"> mufon case (18350) map </A>","Case Number":"18350","Country":"United States","Date Submitted":"07/26/2009 10:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:03:00","Summary":"flashing light started dim... then would burst, back to dim then burst again. high atmosphear. possible satilite?","Weather Factors":"None","City":"fawnskin","Tags":"City","Log Number":"US-07272009-0014","files":["/var/www/straped/mufon/html2text/18350.html.txt","/var/www/straped/mufon/org/18350.html"],"Region":"California","Date of the Event":"07/26/2009 10:00 UTC","trends":["There have been no other sightings in fawnskin","This sighting has never been favorited."],"Latitude":"34.268062","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI was on vacation at big bear lake. I took one family member and my two dogs to hang out at the lake... watch the starts. Currently I have been very interested in UFO's and Alien activity. I wanted to find a UFO. We saw quite a few things. Almost everything we saw I considered to be some kind of satilite. Some were very bright. One that would change color... i felt that was simply a satilite being seen through bad air. One we found interesting. At first we thought it was simply a satilite. It DID hold a consatant course and eventuly disapeared behind the mountain... but the interesting part was that it would start as a dim light... start to slowly get brighter. Then suddenly burts of light then back to a dim color. I knew that I was not just seeing it because my family member and I said \"wow\" at the same second. We counted about 30 seconds between bursts. The event was behind where we were sitting... we had to stand to see it. My family member did see it first. But the first burst that was witnessed we did see at the same time. There was no chance of it being a reflection from the lake as it was far behind the lake... the stars were clear... very little cloud cover (despite the heavy and breif storm in the afternoon that day)."],"Object Features":"Unknown","Source":"MUFON","Disposition":"IFO"}