{"Object Flight Path":"Stationary,Other","Longitude":"-110.969455","Tags":"City","Disposition":"Unknown","Object Features":"None, Unknown","Log Number":"US-07272009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=31.473213,+-110.969455(18351)&iwloc=A&hl=en\"> mufon case (18351) map </A>","Source":"MUFON","Region":"Arizona","Sighting Duration":"Undisclosed","City":"Rio Rico Southeast","Summary":"Greenish Ball of light behind house stationary and moving up and then back down to almost ground level","Date of the Event":"07/22/2009 10:00 UTC","Country":"United States","Latitude":"31.473213","trends":["There has been one other sighting in Rio Rico Southeast","There were no other sightings in Rio Rico Southeast on or around July 22nd 2009"],"Viewing Distance":"101-500 Feet","Object Shape":"Sphere","Case Number":"18351","divs":["Sighting DetailsOn Wednesday, July 22, around 10 pm or so (not sure of the exact time) my step son (will refer as son from now on) had gone out to the back of the house to water the trees (he forgot to do it earlier.)Note** We are on two acres of land and more than half is a slope plus a flat area at the bottom where there are many mesquite trees and a wash. As he reached down to get the water hose, my son noticed a ball of light (from the distance it seemed about the size of a basketball or slightly bigger)at the bottom of the slope and across the wash. As he describes it, the ball of light was very bright and \"pretty\" it made him feel \"at ease\" and the color was something he wasn't quite familiar with....almost a turquoise color. As he watched the light (he said he froze just looking and recalls a strange silence)within a group of relatively small mesquite trees, it turned off but he noticed that something went straight up rather quickly (it went far enough in the sky that he had to almost look straight up from where he was standing). When it got to a certain altitude it \"turned\" back on. he's not sure for how long but then it turned back off and saw the object come back down to where it was first seen just above the ground and then light up again (this happened several times but he can't recall how many. (as if it did not want to be seen going up and going down..)he noticed that it would pulsate (at times slowly and other times a little quicker). One thing he did notice (or remember) was that even though the light was very bright, it did not illuminate its surroundings..at all. he finally lost the object while, he believes, it was still at the bottom of the hill. The next day i asked him to go down there and take a look (i was and still am in california) and he did sometime in the early evening. he took our dog rex with him and as he was nearing the site, he heard footsteps ahead of him. he and rex stopped and looked towards the area of the sighting and noticed 7 or 8 men looking around. he said they were all dressed in black and were wearing gloves because he could not see their hands. they all had short black or dark hair (it was already getting dark). these men seemed to be huddled around the area where the ball of light was the night before. rex also stopped in his tracks and did not want to go further. my son then decided (wisely) to go back to the house and as he reached the top, he noticed the men climbing the opposite hill and then a black suv (he says it was an excursion, from ford) with dark tinted windows, came from the top of the street and all the men got in and left. no other incidents since then. please feel free to call us or email me if you have any questions. we can show the area to you also if you have someone in the area. very strange and exciting."],"Date Submitted":"07/22/2009 10:00 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/18351.html.txt","/var/www/straped/mufon/org/18351.html"]}