{"files":["/var/www/straped/mufon/html2text/18355.html.txt","/var/www/straped/mufon/org/18355.html"],"divs":["Sighting DetailsA few notes....this is getting exceedingly crazier, but honest to god at the house in Briargate, my stereo seriously was having this jumbled, fuzzed talking with voices that did not sound human. I had EVERYONE in the house and my friends listen, and they all agreed they heard it..even when the stereo was unplugged. This may have been a ghost, I don't know. But I do know that there were two distinct voices both male. Also, at one point I swear I heard one say my name. The even weirder thing is that sometimes my friend and I would be laying down to sleep when we would hear these distinct \"whooshing\" sounds in our heads, like a car driving by lamp posts with the window open, and they would get faster and faster until our bodies were paralyzed even though we were awake. Sometimes I would hear the carpet shuffling and hear those same voices from the stereo talking over my bed, again two distinct voices. It would always be the same night for both of us and around 3 to 4 am. We are both kind of psychic and attract ghosts. Psychic isn't what people think it is, we have no conscious effort over it and most people who claim they are are liars. After the incident in 1989 or 90, I thought I would mention I got seriously ill. My eyes were crusted so bad I couldn't open them and I was paralyzed and my voice went out. As soon as the sun came up, my body could move, I was able to open the crust from my eyes tearing my lashes out, and my voice came out. i had been screaming for help for like 3 hours. I never had any weird crap happen until after I had a close call with an abscess that got infected making my head swell 4 times its size on the right side and the infection was going to spread to my brain. I was allergic to penicillin and no doctor would touch me they said I was a liability. Anyways, after I survived I started having ghosts come to me and see UFOs. I don't tell anyone accept my close friend, my husband and my best friend. I also have my husband and best friend document all of my experiences, like my premonitions so I have at least a witness."],"Longitude":"-104.819953","Tags":"City","Latitude":"38.838642","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around November 30th 2002"],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Date of the Event":"11/30/2002 12:00 UTC","Date Submitted":"11/30/2002 12:00 UTC","Region":"Colorado","Source":"MUFON","City":"Colorado Springs","Case Number":"18355","Object Features":"Undisclosed","Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=38.838642,+-104.819953(18355)&iwloc=A&hl=en\"> mufon case (18355) map </A>","Object Flight Path":"Straight-line path","Summary":"Not Provided","Sighting Duration":"Undisclosed","Log Number":"US-07272009-0018","Disposition":"IFO","Country":"United States"}