{"Region":"Arizona","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around July 27th 1986"],"Date Submitted":"07/27/1986 08:20 UTC","Longitude":"-110.921669","Case Number":"18358","City":"Tucson","Country":"United States","Disposition":"Unknown","Viewing Distance":"Unknown","Tags":"City","Latitude":"32.229303","Summary":"bright wobbling orb chased by 7 new semi silent raptor jets in tucson","Weather Factors":"Unknown","Log Number":"US-07272009-0022","Source":"MUFON","divs":["Sighting Detailsi got and odd feeling and was compelled to outside and take a look, which often happens and i see about six military planes along the northern mountain ranges i thought that was odd because the jets from the base only usually train in pairs. i then noticed a very large very bright orb traveling from the north west to the south east. the object seemed unstable traveling at such slow speeds and seemed to wobble as it traveled at about 150 to 200 mph judging on the base that i estimate it was at about 8000ft in the air and looked to be as big or bigger than the new raptor jets that were flying. as the object was overhead it was its brightest. after it was about 2 miles to the southeast another jet came loud and very fast from the west. the other planes seemded to be just trailing it not getting very close. as the latter plane approached the boject seemed to travel faster and them dissapeared into nothing. the light faded to black and the planes contimued on their route as if still following the object. is it weird to dream of things like this before they happen???"],"Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Sphere","Date of the Event":"07/27/1986 08:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.229303,+-110.921669(18358)&iwloc=A&hl=en\"> mufon case (18358) map </A>","files":["/var/www/straped/mufon/html2text/18358.html.txt","/var/www/straped/mufon/org/18358.html"],"Sighting Duration":"Undisclosed"}