{"Object Features":"None","Log Number":"CA-07282009-0005","Sighting Duration":"Undisclosed","trends":["There have been 5 other sightings in Red Deer","There were no other sightings in Red Deer on or around August 14th 1978"],"Country":"Canada","Region":"Alberta","Summary":"Myself and three other friends were standing in a field just outside of town, We looked up and saw three green points of lights in a triangle shape yet independant of each other, behind these were two red lights whipping back and forth, crisscrossing.","Date of the Event":"08/14/1978 12:00 UTC","files":["/var/www/straped/mufon/html2text/18363.html.txt","/var/www/straped/mufon/org/18363.html"],"Date Submitted":"08/14/1978 12:00 UTC","Latitude":"52.273741","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsIn 1978, sometime in mid August about 10 o'clock at night, three friends and I were just outside the city of Red Deer. We were standing in a farmers field, when we all noticed these lights flying right towards us. I suppose I first thought it must be a plane, but that was impossible as I will explain. It looked like they were very close to us, like I could reach up and almost touch them, as they flew right over us. There was three points of green light, flying in a triangle shape but independent of each other, as I could see them so clearly go out of formation ever so slightly. Behind these were two points of red light, flying back and forth in a larger pattern, like they were whipping back and forth. It was over fairly quickly but at the same time it was like I was seeing it in slow motion. Seeing these lights, flying over us was a little unnerving, but what seemed the hardest thing to comprehend was there was no sound what so ever. They just continued on until they were out of sight, which seemed to take less time than seemed possible, if they were going as slow as it had appeared. We all just stood there and everyone was speechless. We said \"what the heck was that\" and with much trepidation, we all described what we had seen. Then none of us really said anything else. We went on with our evening without talking about it again. I never told anyone at first. A few years later I mentioned it to one of the people that witnessed it with me. He just smiled and nodded, but did not want to talk about it."],"Weather Factors":"Unknown","Object Shape":"Triangle","Disposition":"Unresolved","City":"Red Deer","Object Flight Path":"Straight-line path","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.273741,+-113.792815(18363)&iwloc=A&hl=en\"> mufon case (18363) map </A>","Case Number":"18363","Source":"MUFON","Longitude":"-113.792815"}