{"map":"<A HREF = \"http://maps.google.com/maps?q=39.448236,+-84.355533(18362)&iwloc=A&hl=en\"> mufon case (18362) map </A>","Log Number":"US-07282009-0004","Tags":"City","Source":"MUFON","Latitude":"39.448236","Country":"United States","Date of the Event":"07/27/2009 11:05 UTC","Date Submitted":"07/27/2009 11:05 UTC","Region":"Ohio","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","divs":["Sighting Detailsoutside smoking and talking to a friend on the phone .noticed a bright light above the tree line, walked off porch towards the field to get a better look , my first thought was that it was a hot air ballon but realized it was not.had a bright orange light source that at first i thought was fire but it wasnt, it was more \"star like\" it would flare up every now and then and when it did it seemed to light up a translucent or opaque bubble over the top. this \"bubble\" or whatever..did not seem to have a rigid or stable shape or structure...it was like a nebulus gas bag or some thing...much lower than a plane slower than a plane...really bright orange...was about the size of a hot air ballon...ive been in a ballon before this was not a ballon didnt seem like it was controlled. my gut instinct was that it was alive...sounds silly but it was like a jelly fish or something.watched for about 4 or 5 mins. it blinked twice then it was just gone. there were planes in the area at the same time and about 10 mins. after it blinked out a helecopter flew the same path.really freaky. went inside to get my video recorder hung outside another 30 mins. or so, but nothing else, other than some shooting stars.anyone else see this?"],"Sighting Duration":"00:06:00","Disposition":"Unknown","Case Number":"18362","Viewing Distance":"101-500 Feet","Object Shape":"Other","Object Features":"None","Summary":"silent orange glob floating thing","trends":["There have been 7 other sightings in Monroe","There were no other sightings in Monroe on or around July 27th 2009"],"City":"Monroe","files":["/var/www/straped/mufon/html2text/18362.html.txt","/var/www/straped/mufon/org/18362.html"],"Longitude":"-84.355533"}