{"Object Shape":"Sphere","Date Submitted":"07/27/2009 08:25 UTC","Viewing Distance":"501 Feet - 1 Mile","Region":"Arizona","Disposition":"Unknown","City":"Tucson","map":"<A HREF = \"http://maps.google.com/maps?q=32.231393,+-110.922869(18361)&iwloc=A&hl=en\"> mufon case (18361) map </A>","Object Features":"Unknown","Summary":"A very bright light...no multi lights like a plane, just bright white","trends":["There have been 173 other sightings in Tucson","There was one other sighting in Tucson on or around July 27th 2009"],"Sighting Duration":"00:01:30","Weather Factors":"None","Source":"MUFON","Log Number":"US-07282009-0002","Case Number":"18361","Longitude":"-110.922869","Tags":"City","divs":["Sighting DetailsMy son and I were swimming and we were actually talking about UFO's and I looked up and this very bright light (sphere) was traveling from a westerly to south easterly direction overhead. There was no sound...my son thought it was a plane, but it was too low and there were no other lights on it other then the very bright light....we watched it travel slowly across the sky and as we watched it, it wobbled maybe once as it got smaller and then just winked out. It was too low for anything that I would consider the typical excuses for UFO's. It was just freaky because we were talking about UFO's. I've never seen anything like this before. Just thought I would mention it. In the pool We were talking about UFO's so we were looking up into the sky I couldn't even begin to think of what it was, I knew it wasn't a plane or helicopter It flew low, slow, and a little bit wobbly I was amazed because of the timing of the conversation, and it sort of freaked me out, then I was in awe because whatever it was, it was something I've never seen and I guess I was hopeful that it would do something really weird to prove it wasn't an usual aircraft We never took our eyes off of it...we watched it until it dissappeared"],"Date of the Event":"07/27/2009 08:25 UTC","Country":"United States","Latitude":"32.231393","files":["/var/www/straped/mufon/html2text/18361.html.txt","/var/www/straped/mufon/org/18361.html"],"Object Flight Path":"Straight-line path"}