{"Region":"Ohio","trends":["There have been 13 other sightings in Delaware","There were no other sightings in Delaware on or around July 28th 2009"],"Case Number":"18373","Disposition":"IFO","Date Submitted":"07/28/2009 11:35 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/18373.html.txt","/var/www/straped/mufon/org/18373.html"],"Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"Unknown","Source":"MUFON","Country":"United States","Longitude":"-83.065095","Latitude":"40.306072","City":"Delaware","Object Flight Path":"Stationary","Summary":"Star-like object became intense in light then dimmed and disappeared","Log Number":"US-07282009-0015","divs":["Sighting DetailsI was walking my trash container to the curb and looked up at the sky. This is a routine thing for me, as I take a minute to gaze across and enjoy the night view, especially on cloudless or slightly cloudy evenings. I looked up to the northeast and observed a bright, what I thought was, star. As I looked at the star-like object it began to become more intense in brightness. To the point where it really got my attention. The intensity of the light became brighter than any other object in the sky, but the object itself remained the same size. The object then began to dim, appeared as if it turned away from me and completely went black as the night sky. I gazed in the same area for approx. 10 more minutes never seeing anything that matched the previous intensity. Also observed cloud movements to see if, by chance, clouds may have obscured the object, and I observed an airplane fly in the same area as the object and the airplane was clearly visible, however no object. Just prior to observing the object I got an emotion of clarity and awareness of other life forms (we are not alone feeling). As the object became brighter in intensity I felt as though I could not look away, and closeness with the object as though I were not actually thousands of miles away from it."],"Date of the Event":"07/28/2009 11:35 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.306072,+-83.065095(18373)&iwloc=A&hl=en\"> mufon case (18373) map </A>","Weather Factors":"Unknown"}