{"Viewing Distance":"Unknown","Date Submitted":"07/27/2009 10:10 UTC","Log Number":"US-07282009-0014","Case Number":"18372","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Summary":"Circular UFO with orange glow over UMKC campus","Sighting Duration":"Undisclosed","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around July 27th 2009"],"Disposition":"Hoax","Object Features":"Undisclosed","Longitude":"-94.577547","divs":["Sighting DetailsI am a professor at UMKC and was leaving my office last night when I saw a circular or sphere shaped craft in a Southwest direction right over my position at approximately 80 degrees. It looked like it was flying very slowly and very low. I've never seen anything like this and wished that there were other people around to see it with me, but there was no one in sight. I didn't have a camera with me. The craft looked dark but it had an orange glow around the entire thing - there were no other lights on it. I tried to determine the source of the glowing light but it looked like it enveloped the entire craft. There were no lights, wings, or tail and it did not look like an airplane or helicopter. The size was approximately the size of a grapefruit held at arm's length, so it was very large and very close. I heard a very low pitched hum for a couple of minutes when I first spotted the object, then the hum stopped. The object moved very slowly from the Southwest to Northwest, then I lost sight of it behind trees. I've never seen a plane or helicopter move that slow. I watched it for some time - approximately 12 minutes total time. During this time I attempted to call my wife at home to see if she could see it, but my cell phone would not work, giving me a message of \"out of service area,\" but after the craft was no longer visible I tried again and got through just fine. I thought that was very odd, but the entire scene was very odd. I'd be interested in finding out if anyone else saw this."],"Date of the Event":"07/27/2009 10:10 UTC","files":["/var/www/straped/mufon/html2text/18372.html.txt","/var/www/straped/mufon/org/18372.html"],"Latitude":"39.104436","map":"<A HREF = \"http://maps.google.com/maps?q=39.104436,+-94.577547(18372)&iwloc=A&hl=en\"> mufon case (18372) map </A>","Object Shape":"Circle","Region":"Missouri","City":"Kansas City","Source":"MUFON"}