{"Latitude":"41.554753","Country":"United States","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsIt began when i was having trouble sleeping. I had recently moved here from my native UK and my internal clock was all messed up. I was watching a movie and around 2 45 am i decided to head out onto my front porch and have a cigerette. I was walking up and down the path star gazing as I often do at night. I was about to say that suddenly I saw something but there was nothing sudden about anything that night. I looked across the street and in the distance beyond my neighbours house I saw and airplane. No big deal, they pass over frequently. i paid it no more heed. It was a nice pleasent night and decided to have another cigerette. As i lit it I noticed that the aircraft was still coming towards me. I realised that this was odd as it would mean the aircraft was traveling incredibly slowly. I began to study it and becam aware that it had three green lights. I double checked this as i knew that was not nomal aircraft configeration. I continued to watch this crafts progretion towards me and it took almost ten minites to reach me as it made it's slow progression. As it reached my neighbours house across the street I could make out more detail, or to be more specific, the lack of it. It seemed to be a great triangular, featureless slab drifting across the sky. It went on to pass over me and it was only then i realised that it was completly silent. Not only that but everything had gone silent. The crickets had even stopped making a noise. I followed it to my my back yard and continued to watch as it headed away then in the distance it stoped and turned on a dime 45 degrees and headed out towards Joliet. I continued to watch until it was obscured by trees. At this point I sat down lit another cigerette and methodically tried to rationalise what i had seen. It could not be some alien craft because that was all bunk. It must have been an aircraft, it simply could not be anything else. It took me an hour to convince myself and i finally went to bed. Next day I had no recollection of the event. About a year later i was watching a program on UFOs when suddenly an artists impression of the same thing i saw. It was only then i recalled the incident. I am not a credible witness. I am the epitomy of the sci fi nerd. However I am a sceptic if there are two theories 1 earthly and 1 other worldly i would accept earthly more readily. I would very much like to hear from anyone else who saw this. The dates are very approximate...it could have been as early as June or as late as August. I finally decided to submit this to MUFON because i do not beleive i was the only person to see this...sure it was 3 am but it was there for so long and someone somewhere must have seen it too. I agree for my information to be passed onto third parties ONLY for investigative purposes. NOT to comercial mailers and advertisers."],"Viewing Distance":"21-100 Feet","City":"Crest Hill","Disposition":"Unknown","trends":["There have been no other sightings in Crest Hill","This sighting has never been favorited."],"Date of the Event":"07/01/2006 02:50 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Object Shape":"Triangle","Date Submitted":"07/01/2006 02:50 UTC","Region":"Illinois","files":["/var/www/straped/mufon/html2text/18377.html.txt","/var/www/straped/mufon/org/18377.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.554753,+-88.098671(18377)&iwloc=A&hl=en\"> mufon case (18377) map </A>","Object Features":"Undisclosed","Summary":"Slow moving pass over my home and 45 stationary turn","Source":"MUFON","Longitude":"-88.098671","Log Number":"US-07292009-0004","Case Number":"18377"}