{"Log Number":"US-07282009-0013","Object Features":"None, Unknown","Sighting Duration":"Undisclosed","Region":"Nebraska","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/18371.html.txt","/var/www/straped/mufon/more/18371_submitter_file1__100_9092.jpg","/var/www/straped/mufon/more/18371_submitter_file2__100_9096.jpg","/var/www/straped/mufon/more/18371_submitter_file3__100_9097.jpg","/var/www/straped/mufon/org/18371.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.254883,+-95.993878(18371)&iwloc=A&hl=en\"> mufon case (18371) map </A>","Longitude":"-95.993878","Country":"United States","Latitude":"41.254883","divs":["sighting detailsmy first \"official\" ufo sighting occurred at 1:43pm on 12-30-08 while watching a large jet at cruising altitude of 30-40k feet out the east window of our home. i say \"official\", because i had never been inclined to report anything until my 2-16-9 sighting, though i had seen other strange lights over the years. ironically, this object was seen over the same tree located two houses to the south where i would see another much closer object on 7-2-9. as the jet was flying w to e at cruising altitude with full contrail, i perceived another silver-metallic looking object come out from behind some high clouds in the same area of the sky. i have pictures of these clouds since i had asked my girlfriend to take some shots of the beautiful patterns about 20 minutes earlier. for some odd reason, i felt drawn to this area of the sky and had been looking around with binoculars for a few minutes. the ufo literally appeared to drop from behind the more solid looking clouds in 9092 and then make a right angle motion to the east. unlike the jet, it had no contrail whatsoever, yet it was obviously in motion and appeared to be at about the same height. i screamed downstairs for her to bring the camera upstairs as i was actually viewing a ufo! she got off the phone, tripped up the stairs and got me the camera. the ufo then stayed motionless high above the tree in 9092 for approx 4-5 seconds, then simply vanished. i attempted to take photos, but the distance was much too far for my camera to resolve. i shot pics 9096 and 9097 at this time. i did see the ufo through binoculars. but it was still too far away to get a real solid idea of the shape. the best i can state is oval\\disc shaped with no fixed wings of any sort. a much better sighting was to come........ please email me with any other questions: [cms\\tg\\pid]"],"Summary":"12-30-2008 Silver/metallic object quite high in SE sky","Viewing Distance":"Over One Mile","Date of the Event":"12/30/2008 01:40 UTC","Weather Factors":"Unknown","Object Shape":"Disc, Oval","Source":"MUFON","Object Flight Path":"Path then hovering","Date Submitted":"12/30/2008 01:40 UTC","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around December 30th 2008","This sighting has never been favorited.",""],"Case Number":"18371","City":"Omaha"}