{"Latitude":"43.36093","Date of the Event":"05/20/1966 10:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.36093,+-83.885112(18385)&iwloc=A&hl=en\"> mufon case (18385) map </A>","Summary":"Silent, glowing egg shaped object moving south to west.","Longitude":"-83.885112","divs":["Sighting Details This was in 1966 during the Michigan \"Sawmp Gas\"sightings. I have never reported it before but remains fascinating to me today as it was when it actually occurred. I was living at 4233 Shreve Drive at my parents home in Bridgeport just south of Saginaw. Time was about 10:30PM and I know this because we were gathered in the living room watching Payton Place. I was eleven years old and very frightened of what everyone was seeing nightly though most sightings were to the south of where we lived. I was setting on the floor by our front door and sighted a silent, green glowing egg shaped object moving approx. from south east to west. The sky was completely dark, and I do not recall there being any stars out that night. Icannot estimate the distance I was from the object but I remember that it could not have been far, it was quite close and quite large, like if I held a football at arms length would look. I watched the object until it floated out of sight. Not much to go on but felt that it should be part of the record of those most enigmatic 1966 UFO sightings. I'll likely never know what it was but I will always remain happy that I was able to see something so unusual."],"Object Flight Path":"Straight-line path","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18385.html.txt","/var/www/straped/mufon/org/18385.html"],"Country":"United States","Region":"Michigan","Sighting Duration":"00:07:00","Object Shape":"Egg","Source":"MUFON","Case Number":"18385","trends":["There has been one other sighting in Bridgeport Charter Township","There were no other sightings in Bridgeport Charter Township on or around May 20th 1966"],"Date Submitted":"05/20/1966 10:15 UTC","Tags":"City","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","City":"Bridgeport Charter Township","Object Features":"None","Log Number":"US-07292009-0012"}