{"City":"Anahuac","Disposition":"Unknown","divs":["Sighting DetailsOn 7-28-2009 at around 9:25 pm i went outside because i thought the space shuttle was supposed to be making re-entry at around 9:30. I later found it i had the date wrong. Anyway thinking this my wife and i were in the back yard watching the sky and waiting to watch the shuttle come home. Where we live in Anahuac Texas there is a George Bush in Bound flight path that comes right over our home as these planes make there decent for Houston. Therfore we are used to watching and observing all kinds of air traffic and this night was no differnt with inbound flights arriving while we were waiting on the shuttle. At around 9:35 i noticed a bright light to my north and it appeared to be moving. I pointed this out to my wife and she noticed it also. The light was bright and was moving in a south south east direction at a high rate of speed. I then noticed another light just like it maybe 10 miles behind the first one moving in the same direction. Neither light was flashing and both were moving right through the flight path i mentioned. If i had to guess a altitude i would say around 20,000 feet. Both lights were gone from view in about 10 to 15 seconds. About one minute later i observed another one further to the west but at much higher altitude and moving the same direction. The first two light looked low enough that i should have heard the engines if they were military or commercial flights but i heard nothing and observed no flashing lights. All three light where white."],"Sighting Duration":"Undisclosed","Case Number":"18384","Viewing Distance":"Over One Mile","Object Features":"Unknown","Log Number":"US-07292009-0011","Date Submitted":"07/28/2009 09:35 UTC","Region":"Texas","files":["/var/www/straped/mufon/html2text/18384.html.txt","/var/www/straped/mufon/org/18384.html"],"Object Shape":"Star-like","Source":"MUFON","Tags":"City","Weather Factors":"None","Latitude":"29.773","Object Flight Path":"Straight-line path","Summary":"3 small bright non-flashing lights moving south south east at a high rate of speed.","Longitude":"-94.682696","Date of the Event":"07/28/2009 09:35 UTC","trends":["There have been 2 other sightings in Anahuac","There were no other sightings in Anahuac on or around July 28th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.773,+-94.682696(18384)&iwloc=A&hl=en\"> mufon case (18384) map </A>","Country":"United States"}