{"Latitude":"45.062057","Source":"MUFON","trends":["There has been one other sighting in Hillman","There were no other sightings in Hillman on or around July 21st 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.062057,+-83.894276(18392)&iwloc=A&hl=en\"> mufon case (18392) map </A>","Object Features":"Undisclosed","Country":"United States","Case Number":"18392","Summary":"Glowing orange fireball","Date Submitted":"07/21/2009 12:00 UTC","Object Flight Path":"Undisclosed","Log Number":"US-07292009-0019","Region":"Michigan","files":["/var/www/straped/mufon/html2text/18392.html.txt","/var/www/straped/mufon/org/18392.html"],"Tags":"City","Viewing Distance":"Unknown","divs":["Sighting DetailsWhile camping at Lake Superior campground along the shores of Lake Superior between Deer Park and Grand Marais, we, being myself, my two children, my aunt, my cousin, and my grandmother, were sitting around the campfire making smores, when my cousin, who is a weather buff and loves looking up at the stars, noticed an orange glowing ball in the sky that looked like it was slowly descending. It looked like it could have been a meteor although it had no tail, and it wasn't \"falling\" at a fast rate of speed. It lingered in the sky NNW of our campground, It was moving downward for a short period of time, so we all ran out to the beach to catch a better sight of it. We noticed it was just hovering there. It was too big to be a star, but not big enough to be the moon, so we know neither of these was what it was. We watched it for several minutes before clouds covered our view of it. The next day we were talking to other campers who said they had noticed the same thing in the sky the night before but it was moving sideways. They also mentioned that other campers in the campground had told them they'd seen the same one that we did. I am usually pretty skeptical about these kinds of things, but every one in my family witnessed it, and I have to say, I can't explain it, and the fact that other campers out of my family makes it that much more real to me."],"Longitude":"-83.894276","Disposition":"Insufficient Data","Date of the Event":"07/21/2009 12:00 UTC","City":"Hillman","Weather Factors":"Unknown","Object Shape":"Fireball","Sighting Duration":"00:10:00"}