{"Source":"MUFON","Country":"United States","Summary":"same guy here from arizona and we have another one","Latitude":"32.231383","Weather Factors":"Unknown","City":"Tucson","Region":"Arizona","Viewing Distance":"Over One Mile","Object Features":"Unknown","Object Shape":"Disc","Object Flight Path":"Straight-line path","Date Submitted":"07/29/2009 08:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.231383,+-110.922979(18396)&iwloc=A&hl=en\"> mufon case (18396) map </A>","divs":["Sighting Detailsso im starting to feel kind of weird cause another craft flew above my home tonight. first of all i was outside at about 830 and we were watching yet another batch of probably 30 different military craft in the skies again here in tucson. only one commercial jet was seem heading west. i thought why so many of them? they were all heading east and one veered off course and headed our way. it got right above our house and ejected some luminous object which flared and disappeared. all the planes flew on and there were none for about 5 minutes. out of nowhere an object came from above the apartment i live in from the southwest and flew pretty much above us. it looked like a saucer shaped object. the bottom was illuminated and orange hue from the city lights below. below the object a few meters were these greenish dancing lights. they did not reflect on the craft which flew a steady rate in a straight line to the northeast beyond the northerm mountain range. the object was at an altitude of about 10500 ft since that is how high it would have to fly to clear the mountains. i watched it with my gf until it was a faint star like object above and past the mountains. the planes them returned and there were more and they were spread out across the boundries of tucson which is 25 square miles and they are continuing to circle as we speak. kinda freaking me out, ill keep everyone posted on more and try to charge my camera if this is going to keep happening"],"Sighting Duration":"Undisclosed","trends":["There have been 173 other sightings in Tucson","There were 2 other sightings in Tucson on or around July 29th 2009"],"Case Number":"18396","Longitude":"-110.922979","Tags":"City","Log Number":"US-07302009-0001","Disposition":"Unknown","Date of the Event":"07/29/2009 08:50 UTC","files":["/var/www/straped/mufon/html2text/18396.html.txt","/var/www/straped/mufon/org/18396.html"]}