{"Case Number":"18391","Object Flight Path":"Other","Object Shape":"Other","Summary":"The UFO showed up in a photo I took.","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-76.718995","Tags":"City","divs":["Sighting DetailsI was in downtown York, PA, photographing the architecture of the York Court House. I took two previous shots of the same location within 10 seconds of the one in which the UFO appears. Only the third photo shows the anomaly. I remember noticing a black dot seemed to suddenly appear as I snapped the picture. I glanced at my digital camera and verified that, indeed, there was a strange black object in the sky between the two domes. I figured it was a bird and thought nothing further of the photo. But when I reviewed my photos from that day, I realized the black object was unlike anything I have ever seen. It appears far too organic to be a plane or a jet or any other kind of flying machine. I have never seen a bird look like this in any photo that I have ever taken. And if it is a bird, judging from the distance it seems to be from the dome, it would be an awfully large bird. It almost has a dragon-like appearance, with a pronged tail streaming behind it as it flies across the sky. I would have noticed such a creature soaring across the sky before taking the picture, I am sure! So, I don't know what it could be. I don't think it is a UFO in the classical sense--a \"flying saucer\" or some other advanced flying technology. Perhaps it is a rare sighting of some other-dimensional being a la John Keel and the mothman prophecies. Or, maybe it's just a funky photo of a large bird in flight. If you look closely at the sky in the left part of the photo, there are circling birds, probably vultures, in the far distance. None of them, however, are in close proximity to the anomaly reported and none of them have a shape resembling the anomaly."],"Disposition":"IFO","Object Features":"Unknown","Date Submitted":"07/28/2009 05:03 UTC","Sighting Duration":"00:00:01","trends":["There have been 16 other sightings in York","There were no other sightings in York on or around July 28th 2009","This sighting has never been favorited.",""],"Region":"Pennsylvania","Log Number":"US-07292009-0018","Date of the Event":"07/28/2009 05:03 UTC","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/18391.html.txt","/var/www/straped/mufon/more/18391_submitter_file1__20090728_0592.JPG","/var/www/straped/mufon/more/18391_submitter_file2__20090728_0591.JPG","/var/www/straped/mufon/org/18391.html"],"City":"York","map":"<A HREF = \"http://maps.google.com/maps?q=39.964288,+-76.718995(18391)&iwloc=A&hl=en\"> mufon case (18391) map </A>","Country":"United States","Latitude":"39.964288","Source":"MUFON"}