{"Log Number":"MX-07302009-0009","Weather Factors":"Windy","Country":"Mexico","Date Submitted":"07/11/1978 07:15 UTC","Date of the Event":"07/11/1978 07:15 UTC","City":"San Felipe","Summary":"It blasted off from mountains, first it was 1light, then became triangle,3lights.","Viewing Distance":"Unknown","Longitude":"-114.840778","Case Number":"18404","Source":"MUFON","Disposition":"Unresolved","Region":"Baja California","map":"<A HREF = \"http://maps.google.com/maps?q=31.025071,+-114.840778(18404)&iwloc=A&hl=en\"> mufon case (18404) map </A>","Tags":"City","Object Flight Path":"Other","Object Shape":"Triangle","Latitude":"31.025071","Object Features":"Unknown","divs":["Sighting DetailsWe were waiting for our rented beach house near San felipe, we were waithin because there was a family from USA still packing to go back,suddently some body said look at that!, I was 7 yo at that time, there were 11 people from our party, including me and 9 from our American Neighbors, I looked at the Mountains and I saw a Neon Blue Light zig zaging out from the mountain, it left a trail of strange green-blue-white smoke it must have zig-zag at least a \"W\" and a \"V\" as it gained more altitude, then the neon blue light seemed to split in 3 blue lights, but they were conected by what woud seem like a laser of the same color, when they separated they formed a perfect triange and the strange green-blue-white smoke stoped, but you couldn't see the color of the sky inside the tringle,inside the triangle was the darkest black you can imagine, the spacecraft as it gained more altitude, the triangle looked smaller but the blue lights looked brighter, allmost as if the lights were becoming one again, when I couldn't see the darknes inside the triange any more, It simply disappeared. All 20 people there saw the triangle ufo, San Felipe is a very small town in Baja, there are no Military bases, after it was over I remember my Grandfather,my Dad and my Uncle talking to the 2 American Men that wher there, and they all agreed on one thing, that what we saw was Not Man Made! The American Family left,and I remember that night was the windiest night I have ever seen, wee stayed for 2 days more but did not see anything more."],"files":["/var/www/straped/mufon/html2text/18404.html.txt","/var/www/straped/mufon/org/18404.html"],"trends":["There have been no other sightings in San Felipe","This sighting has never been favorited."],"Sighting Duration":"Undisclosed"}