{"Viewing Distance":"Unknown","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Star-like","Region":"New Mexico","City":"Albuquerque","Summary":"daylight observation of star-like white object moving across sky at very high rate of speed/high altitude","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:06","Date of the Event":"07/12/2009 12:10 UTC","Source":"MUFON","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around July 12th 2009"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/18408.html.txt","/var/www/straped/mufon/org/18408.html"],"divs":["Sighting DetailsI was on my roof repairing my swamp cooler when I spotted a star-like white object (small dot in sky) moving in a straight line at what appeared to be a very high rate of speed. This object covered over 100 degrees of the sky in 5-6 seconds, and must have been way higher than any commercial airplane would appear to be in the sky. I'm not a good judge of the altitude but it was such a tiny dot of light it must have been way up there. I witnessed no contrail or tail of whatever comes from jets flying through the sky. This object moved from east to west, and I lost sight of it only when it seemed to speed so far away to the west that it got smaller and smaller until it disappeared. There was no noise or any other phenomenon associated with this sighting that I can report. I was so amazed by how fast it seemed to move, I am no expert on these things but I judged it's travel through the sky by imagining the entire sky as 180 degrees of the whole earths 360 degrees of a circle, then estimating from where I first saw the object to the east and then lost sight of it to the west. I don't know what a super-sonic military jet would look like if it were to take the same kind of path though the sky in front of me, but I've never seen an object move that fast though the sky except maybe when I saw the space station move though the dusk sky from the south west to the north east last year. I think the object I saw in this report appeared to moved even faster than the space station travel I witnessed then."],"Date Submitted":"07/12/2009 12:10 UTC","Longitude":"-106.648987","map":"<A HREF = \"http://maps.google.com/maps?q=35.086401,+-106.648987(18408)&iwloc=A&hl=en\"> mufon case (18408) map </A>","Tags":"City","Country":"United States","Latitude":"35.086401","Log Number":"US-07312009-0003","Case Number":"18408"}