{"Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-07302009-0008","trends":["There have been no other sightings in Lido Beach","This sighting has never been favorited."],"Object Shape":"Disc, Oval","Date Submitted":"07/30/2009 01:10 UTC","Object Flight Path":"Stationary","Region":"New York","Object Features":"Undisclosed","Source":"MUFON","Latitude":"40.588993","Summary":"Stationary Oval Object in midair, no sound, lights flashing fro one end to the other","Country":"United States","Weather Factors":"Unknown","Date of the Event":"07/30/2009 01:10 UTC","Longitude":"-73.625407","divs":["Sighting DetailsI was driving off the Loop Parkway onto Lido Blv West Bound, between 1am and 1:15am, very light traffic. I looked to the ocean and saw in the air, about the height of an approaching plane, an oblong shaped object that looked like the size of an airbus -- it appeared to be just beyond the beach over the water. It had lights on either end, and a light moving from one end to the next across its entire mid-section, and a light below. I came to realize that it didn't seem like a plane, which in Long Beach I see leaving and departing JFK many times. Unlike an approaching or departing plane, it remained stationary, neither taking an approach toward JFK nor ascending away. For 2-3 minutes I kept watching it while watching the road, slowly driving westbound on Lido Blvd. The object did not change position. I lost view of it, obstructed by trees as I reached the end of the beach area of Lido toward the residential area. I circled back Eastbound on Lido blv toward Point Lookout. The sky was empty, I could not find it where I had originally spotted it. I went back West Bound, and saw no sign of it again or thereafter."],"Case Number":"18403","Viewing Distance":"501 Feet - 1 Mile","City":"Lido Beach","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.588993,+-73.625407(18403)&iwloc=A&hl=en\"> mufon case (18403) map </A>","files":["/var/www/straped/mufon/html2text/18403.html.txt","/var/www/straped/mufon/org/18403.html"]}