{"Tags":"City","divs":["Sighting DetailsI was sleeping in my room on my parents farm. It was very early in the morning, and all through the night my dog had been barking making it very hard to sleep. I yelled out my window numerous times to get the dog to shut up but to no avail. Normally the dog would bark at nothing but would cease after a stern scalding. This night was different. I finally conceded defeat and decided to go outside for a cigarette and to see what was going on. The dog stopped barking once I got outside. I lit my cigarette and looked out into the sky as I normally did. The sky was starting to brighten, but it was dark enough that a few stars were still visible. I glanced to my right, which would have been west, and noticed what looked like an orange star moving in the distance. At first I wrote it off as a plane, but it did not have the flashing lights that I have seen many times before in the open Saskatchewan night sky. My second thought was a helicopter, but it was very quiet outside and a chopper can be heard coming from miles away. As it moved from the west to the south it suddenly stopped, immediately dropped it's altitude, and continued heading south. By my estimation it must have dropped fifty to one-hundred feet, and would have been about one and half to two miles away at about four-hundred to five-hundred feet in the air. I watched it until I could no longer see it. The next day I told my Dad, my Mom, and a friend who I worked with. A year later I told my girlfriend who I'd just started dating at the time of the incident. I've kept it to myself until I could find a suitable place to report it. I've always been a firm believer in UFOs. This incident shocked the hell out of me, but it excited me even more so. I could not take my eyes off of this object for fear of losing it. I don't know if this is what my dog was barking about, but I'm glad she was making noise that night or I might not have witnessed this UFO passing by my parents acreage."],"Object Features":"Unknown","Weather Factors":"Unknown","Country":"Canada","Date Submitted":"05/31/2008 04:30 UTC","files":["/var/www/straped/mufon/html2text/18405.html.txt","/var/www/straped/mufon/org/18405.html"],"City":"Yorkton","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"51.222889","Disposition":"Unresolved","trends":["There has been one other sighting in Yorkton","There were no other sightings in Yorkton on or around May 31st 2008"],"Region":"Saskatchewan","Summary":"Bright orange sphere glowing","Object Flight Path":"Straight-line path","Log Number":"CA-07302009-0010","Source":"MUFON","Date of the Event":"05/31/2008 04:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.222889,+-102.460218(18405)&iwloc=A&hl=en\"> mufon case (18405) map </A>","Case Number":"18405","Longitude":"-102.460218","Object Shape":"Sphere, Star-like"}