{"map":"<A HREF = \"http://maps.google.com/maps?q=32.68888,+-117.017741(1841)&iwloc=A&hl=en\"> mufon case (1841) map </A>","divs":["sighting detailsi happened to be sitting in the backyard over at my parents house and looked upin the air while finishing a can of soda. it was then that i saw the dot in thesky. at first i thought that it was just a balloon that had escaped from somecar lot or such, but though the clouds around it and above it were moving, theobject remained static. i watched it for about 20-30 seconds, and then asked myfather to go into the house to get his binocularsi maintained eye contact so as not to lose sight of it. he returned with thebinoculars and i examined the object through them and was able to tell that itwas round and metallic, appearing a golden color presumably from the sunsreflection. i then gave my father the binoculars and he saw the object too. weasked my mother to come back for a third opinion and while she was coming back,the object simply vanished. we have seen this sort of object before, and imyself have witnessed over a half-dozen objects of various sizes and shapes andbehavior over the last 15 years since moving to san diego, but this is the mostrecent one. feel free to contact me about more details, but be prepared to leavea message on our answering machine, as we screen our calls and work odd hours.if you do call and have to leave a message, please leave your name and contactinfo\\time to contact you so that i can return your call."],"Source":"MUFON","Sighting Duration":"00:05:00","Region":"California","trends":["There has been one other sighting in Bonita","There were no other sightings in Bonita on or around September 1st 2002"],"Date Submitted":"09/01/2002 03:30 UTC","Object Flight Path":"Stationary","Summary":"A spherical shape, golden in color, very shiny, ho","Viewing Distance":"Over One Mile","Log Number":"","Tags":"City","Country":"United States","City":"Bonita","Case Number":"1841","Latitude":"32.68888","Disposition":"Hoax","Object Shape":"Sphere","Longitude":"-117.017741","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/1841.html.txt","/var/www/straped/mufon/org/1841.html"],"Date of the Event":"09/01/2002 03:30 UTC","Object Features":"Unknown"}