{"Log Number":"US-07312009-0010","Object Flight Path":"Unknown","trends":["There have been no other sightings in Allenwood","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18415.html.txt","/var/www/straped/mufon/more/18415_submitter_file1__SDC11061.JPG","/var/www/straped/mufon/org/18415.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.107582,+-76.898297(18415)&iwloc=A&hl=en\"> mufon case (18415) map </A>","Viewing Distance":"Unknown","Date Submitted":"05/15/2009 09:15 UTC","Disposition":"IFO","Longitude":"-76.898297","Date of the Event":"05/15/2009 09:15 UTC","divs":["Sighting DetailsMy friend and second witness to this event (who wishes to remain totally anonymous) and I were taking some pictures after dark in the Allenwood gamelands with my new digital camera. On our way out, at exactly 9:15 pm, I decided to test the dis mode on the camera (compensates for movement and takes a more still picture). From the passenger side of the truck at 15 MPH, I held my arm out, bottom of the camera towards the front of the truck, top facing the back. Held it up above the trucks mirror and away from the windshield, and snapped a picture of the branches overhanging the road. When I pulled the camera back in I saw this picture and immediately we stopped the truck, got out, and looked all around for a few minutes for anything in the sky that would have made this image. It was a perfectly clear night, with no airplanes in the sky. We tried to recreate this picture by taking pictures of the few stars that were out with no luck, all the pictures came out black. The picture shows the branch of the tree perfectly still, with the 4 lighted objects apparently moving at a very high rate of speed from right to left, horizontally to the direction we were traveling in the truck."],"Case Number":"18415","Object Features":"Unknown","City":"Allenwood","Weather Factors":"Unknown","Country":"United States","Latitude":"41.107582","Region":"Pennsylvania","Object Shape":"Bullet, Missile, Cylinder","Summary":"Streaking lights","Tags":"City","Source":"MUFON"}