{"Viewing Distance":"Unknown","Disposition":"Insufficient Data","Summary":"oronge top white bottom","Object Features":"Undisclosed","Latitude":"34.555649","divs":["Sighting Detailson my way home from work spotted object that grabbed my att. had been rainy and overcast all day and sky was clearing in the eastern sky still some clouds where i was and thought maybe what i saw was a plane coming in to littlerock airport as they come in lower when weather is rainy or overcast. I was just down the street from my house when I could not stop looking at this object. I stopped in the road to keep looking when I noticed the object was capsull shaped sideways. It was orange on top half white on bottom half and seemed fuzzy. It was close to me and seemed to be floating like a balloon butt very steady. It kept coming my way then stopped and reversed direction. I tried to think maybe it was a hellicopter or something I could make sense of but it just seemed wrong and kind of hypnotised me. So finaly I drove like hell home to get my family to see this thing and my son came out with me honking my horn all the way up the driveway he watched it with me as it faded out in the sky and asked me what it was. I have no idea what it was and asked him what he saw and he said he saw an orange and white tear drop object. I have no idea what I saw butt it wasnt normal had no strobes and I just felt it was odd hard to explain the feeling I had watching this object butt it was just strange,"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.555649,+-92.52127(18425)&iwloc=A&hl=en\"> mufon case (18425) map </A>","Date of the Event":"07/30/2009 08:52 UTC","Source":"MUFON","Longitude":"-92.52127","Log Number":"US-08012009-0002","Object Shape":"Oval","Tags":"City","Region":"Arkansas","Country":"United States","trends":["There has been one other sighting in Bauxite","There were no other sightings in Bauxite on or around July 30th 2009"],"Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18425.html.txt","/var/www/straped/mufon/org/18425.html"],"Date Submitted":"07/30/2009 08:52 UTC","City":"Bauxite","Case Number":"18425"}