{"Disposition":"Hoax","Viewing Distance":"Unknown","Summary":"FOLLOW-UP 4 - LAST ONE PERIOD!","Date of the Event":"07/05/2009 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.092306,+-76.800674(18427)&iwloc=A&hl=en\"> mufon case (18427) map </A>","Latitude":"42.092306","Region":"New York","Object Flight Path":"Undisclosed","Date Submitted":"07/05/2009 08:00 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsI SPOKE WITH YOU 5 DAYS AGO TODAY , AND AM DEFINATELY NOT INTO HAVING SMOKE BLOWN UP MY ASS! AFTER FURTHER REVIEW OF MY PICS. I DISCOVERED A SECOND PICTURE! ADDITIONALLY, THE OTHER ODD NOTE IS THERE IS A RED AND A GREEN DOT IN MANY OF THE PICTURES ALONG WITH CRAFT. IT APPEARS AS IF THE RED DOT PICTURED IS FOLLOWING THE CRAFT? I ALSO TOLD YOU, THERE ARE MANY STREAKS OF LIGHT NOT WITNESSED BY ME OR MY FRIEND THAT ATTENDED THIS FUNCTION. I WAS BEGINNING TO THINK I WAS LOSING MY MIND UNTILL THE SECOND PIC VERIFIED MY SANITY. IF I HAD THE SOFTWARE TO ANALYZE THESE PICS I'D DO IT MYSELF WITHOUT YOUR AND DAVENPORTS BULLSHIT! SO , SINCE YA TOLD ME YOU WERE SENDING SOMEONE OUT ?? ITS AWFULL COINCINDENTAL THAT DAVENPORT AND I PLAYED E-TAG SHORTLY AFTER YOUR CALL? SO, I MAY NOT GET FAR BUT I AM CONTINUING MY OWN INVESTIGATION.. PERSONAL NOTE: YA KNOW, I RARELY GET OUT TO MANY FUNCTIONS DUE TO A FUCKED UP BACK FOR THE LAST 17 YEARS! I DONT NEED THIS BS AS I HAVE ENOUGH OF MY OWN PROBS. IF I DO FIND ANYTHING OUT YOU GUYS WILL BE THE LAST TO KNOW ! I HOPE YOUR NOT FUNDED BY THE TAX PAYER IN ANY WAY SHAPE OR FORM EITHER! I WILL NOTIFY THE PROPER AUTHORITIES ACCORDINGLY! MARK C. ZAWKO N2MAF MASTERMCZ7@AOL.COM (AS FAR AS THE RELEASE ON THE BOTTOM, IF IT ISNT SOMEONE \"IN THE KNOW\" ??? I DONT WANT SOME FUCKSTICK COMING HERE!!) WHEN MY INVESTIGATIONS ARE DONE MY REPORTS ON YOU AND DAVENPORT WILL BE FILED."],"Longitude":"-76.800674","Sighting Duration":"00:00:03","Country":"United States","Object Shape":"Sphere","City":"Elmira","trends":["There have been 6 other sightings in Elmira","There were 2 other sightings in Elmira on or around July 5th 2009"],"Log Number":"US-08012009-0004","Object Features":"Undisclosed","Case Number":"18427","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18427.html.txt","/var/www/straped/mufon/org/18427.html"],"Tags":"City"}