{"Summary":"Glowing Red/Orange UFO.","files":["/var/www/straped/mufon/html2text/18421.html.txt","/var/www/straped/mufon/more/18421_submitter_file1__Cannon110.jpg","/var/www/straped/mufon/more/18421_submitter_file2__Cannon111.jpg","/var/www/straped/mufon/org/18421.html"],"Latitude":"39.109266","trends":["There have been 134 other sightings in Kansas City","There were no other sightings in Kansas City on or around July 31st 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Case Number":"18421","Source":"MUFON","Date of the Event":"07/31/2009 09:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.109266,+-94.576157(18421)&iwloc=A&hl=en\"> mufon case (18421) map </A>","Log Number":"US-07312009-0016","Sighting Duration":"Undisclosed","Object Shape":"Sphere","Viewing Distance":"Unknown","Longitude":"-94.576157","divs":["sighting detailsmy friend and i where standing outside our work building approximately 9:00pm cdt. we saw a very strange low flying spherical object,glowing bright red\\orange, the lights never blinked. we watched it from 1700 walnut kcmo and it appeared to be above the and around the at&t building. it then started to head towards the airport and we lost sight of it. i went up to the roof to see if i could get another glimpse of the object. suddenly it was back and i snapped a couple of photos of it passing around the at&t building before heading north again. its movement was not like an airplane or a helicopter. it passed right in front of the at&t building right below the sign, which is less than a mile from where i was standing. all i saw was a spherical object, very bright, glowing red and orange. my camera time lapse didn't focus quick enough to get a good shots in front of the building. its a new cannon powershot and doesn't take photos all that well at night. it took less than 2-5 seconds from the first photo, pass in front of the at&t building, and then head north. second photo is after the pass of the building. i thought this would have been some kind of light rotating or reflection of some sorts but kept looking around with not finding anything at all. there were several helicopters and planes we could see in the distance that did not compare to this spherical glowing object. my clearest photo was in the 20x digital zoom. 12.1 megapixel."],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","City":"Kansas City","Region":"Missouri","Weather Factors":"Unknown","Tags":"City","Date Submitted":"07/31/2009 09:30 UTC"}