{"files":["/var/www/straped/mufon/html2text/18437.html.txt","/var/www/straped/mufon/org/18437.html"],"Latitude":"39.476238","divs":["Sighting DetailsALIENS MAKE PEOPLE DO WHATEVER THEY WANT SO THEY MADE ME WANT TO GO TO MY ROOF TO LOOK THE STARS AND THEN A SPACESHIP APPEARED ABOUT 984 FEET OF HEIGHT AND THEN TURNED INTO A LITTLE CLOUD AND THE CLOUD ENTERED IN ANOTHER BIGGER CLOUD THAT WAS THERE. THERE WAS NO WIND. THE CLOUDS WERE STILL. AND I HAVE SEEN A LOT OF UFOS BUT I DONT WANT TO TELL ABOUT THEM. THEY KNOW WHERE I AM CONSTANTLY AND THEY MAKE ME SIGNALS TO KNOW THAT. AND PROBABLY THEY ARE WATCHING YOU RIGHT NOW IF YOU ARE READING THIS. THIS IS NOT A JOKE AND I AM NOT CRAZY. I JUST WANT THAT PEOPLE KNOWS THAT THEY ARE CONTROLLING US BUT THEY DO IT IN A WAY THAT WE DONT REALIZE THAT THEY ARE CONTROLLING US. I FIRST SAW IT BECAUSE A NOTICED SOMETHING MOVING. AND I DIDNT LIKE IT BECAUSE I DONT WANT ALIENS TO BOTHER ME BUT THEY HAVE BEEN BOTHERING ME ALL MY LIFE. I HAVE SEEN LIGHTS LIKE IF THEY WERE STARS OF ALL COLORS. AND CIGAR SHAPE WITH FEET ALTHOUGHT IT SEEMS STRANGE THAT SHAPE BUT I HAVE SEEN A SHAPE TRANSFORM INTO ANOTHER SHAPE SO THEY CAN CHANGE THE SHAPE LIKE THE BAD TERMINATOR OF TERMINATOR 2. I DONT KNOW WHAT IS THE USE OF THE REPORTS BUT HERE IS ONE OF MINE. AND ME AND A LOT OF FRIENDS WHEN WE WERE 13 YEARS OLD SAW AN OVAL SHAPED UFO FLYING ABOUT 900 FEET OR LESS OF HEIGHT ABOUT 1 MINUTE LONG. AND IT WAS TRANSPARENT LIKE THE FILM OF ARNOLD SCHWARZENEGGER PREDATOR. LIKE A CAMALEON, THE UFO A MEAN. THIS SIGHTING WAS IN 1995 ON AUGUST BUT I AM NOT SURE OF THE MONTH. AND WAS DURING THE DAY. IT SEEMED LIKE IF THERE WAS A GIGANTIC LASER FLYING THROUGH THE SKY OF VALENCIA(SPAIN) AND THAT IS MY STORY. I KNOW THERE IS A LOT OF PEOPLE THAT IS CRAZY AND LIKE TO TELL LIES. BUT I AM NOT ONE OF THOSE. AND I WANT TO TELL YOU SOMETHING THEY CONTROL THE BODIES OF THE PEOPLE I SUPPOSE THEY DO WITH A VERY ADVANCED TECHNOLOGY MACHINES OR WHATEVER. AND THEY ARE CLOSER THAN YOU THINK, THEY ACT STRANGE, I SUPPOSE THEY WOULD HAVE LAWS LIKE DONT INTERACT HUMANS IN A FORM THAT THEY NOTICE IT BUT THEY ARE WITH US SINCE THE BEGINNING OF TIME. I HAVE SEEN HOW THEY CONTROL MACHINES, COMPUTERS, CARS, AND THEY CAN TELETRANSPORT THINGS ALTHOUGHT IT SEEMS INCREDIBLE. BUT I COULD BE WRONG, MAYBE THEY MADE ME SEE APPEAR THINGS AND MIGHT THEY WERE THERE BEFORE AND DIDNT LET ME SEE THEM AT FIRST AND THEN THEY LET ME SEE THEM. MAYBE THEY DONT TELETRANSPORT THINGS, BUT THAT IS WHAT I HAVE SEEN. I HAVE SEEN THINGS APPEARING OF NOTHING, CARS INCLUDED. YOU CAN THING THAT I AM CRAZY BUT THEY ARE WATCHING YOU FOR SURE, BELIEVE ME. I DONT WANT YOU TO BE TIRED OF READING SO, BYE. BY THE WAY I DONT WANT TO TAKE PHOTOS ALTHOUGHT IF I WANTED I WOULD HAVE A LOT. BYE."],"Object Shape":"Other","Source":"MUFON","Region":"Valencia","Log Number":"ES-08022009-0002","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Mislata","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.476238,+-0.419306(18437)&iwloc=A&hl=en\"> mufon case (18437) map </A>","Disposition":"Hoax","Summary":"A SPACESHIP TURNS INTO A CLOUD","Object Features":"Patterned Surface","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/04/2009 01:07 UTC","Tags":"City","Longitude":"-0.419306","Date Submitted":"07/04/2009 01:07 UTC","City":"Mislata","Weather Factors":"Unknown","Country":"Spain","Case Number":"18437"}