{"Case Number":"18430","trends":[],"files":["/var/www/straped/mufon/html2text/18430.html.txt","/var/www/straped/mufon/org/18430.html"],"Tags":"City","divs":["Sighting DetailsMy husband and I were in the swimming pool for a late night swim, when I noticed lights in the sky coming over the house behind us. At first I thought it was a plane, because our house is in a flight path, but the lights making the triangular shape were bigger than a plane, you could see sky through and around them. They were orange, and looked extraordinarily similar to the smallest stars we could see in the sky except of course that they were moving, and fast, flying in what appeared almost like a flock of geese formation, except with two rows instead of one. I instantly pointed them out to my husband and we watched them as they passed almost directly overhead and past our house from Northwest to Southeast. There was no sound whatsoever either before, during or after they passed. As they passed one of them moved out of the V formation and away and then back into it. Once we realized they were separate lights, I was afraid they might even be missiles, they were going so fast and their color was so uniform. The whole thing only lasted 20-25 seconds or so traveling from the horizon of one rooftop to the horizon of the opposite rooftop. I've never reported anything like this before in my life. It was a truly unbelievable experience and I would love to find out what it was that we saw."],"Summary":"Approx 17 orange lights in triangular pattern","Latitude":"51.261755","Date of the Event":"07/31/2009 11:45 UTC","Object Features":"Unknown","Country":"Canada","Object Shape":"Bullet, Missile, Triangle","Source":"MUFON","Sighting Duration":"00:00:20","map":"<A HREF = \"http://maps.google.com/maps?q=51.261755,+-85.321464(18430)&iwloc=A&hl=en\"> mufon case (18430) map </A>","City":"Undisclosed","Disposition":"Unresolved","Viewing Distance":"Unknown","Log Number":"CA-08012009-0007","Longitude":"-85.321464","Region":"Ontario","Date Submitted":"07/31/2009 11:45 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path"}