{"Date of the Event":"04/14/2009 07:30 UTC","Object Features":"Patterned Surface","files":["/var/www/straped/mufon/html2text/18435.html.txt","/var/www/straped/mufon/org/18435.html"],"Disposition":"Unknown","Tags":"City","divs":["sighting detailsit was dark and i was leaving my house to meet w\\ friends. as i walked onto the drive to my car something caught my eye. i turned to the right and saw a rotating bright white ball of light w\\ red, blue and green lights. it appeared as though it was rolling up hill just above the treeline on the property next to ours, northwest to southeast. it moved quickly and then it was out of my sight line. it was the size of a basketball from my vantage point. there was absolutely no sound from it. i was stunned but quite excited .. i just stood there questioning whether i had really just witnessed it and desperately wanted it to come back. this week i read another report from pa and they described something very similar to what i saw. i now feel more confident to report this and that my eyes and mind weren't playing tricks on me! i don't know if this has anything to do with what i saw but our neighbors tree came crashing down in the back yard sometime in early june. i called my neighbor to report it since they were away. i remember thinking it had died rather quickly and it seemed to be in the same location where i first caught sight of this object before it rolled out of view. in the past month, we also have had a maple tree that is dying and needs to be taken down. it seems it lost leaves at the top this spring and is dying down from the top instead of up from the trunk. our property is heavily wooded w\\ an easement that runs along the expressway."],"Country":"United States","Longitude":"-75.349077","trends":["There have been 2 other sightings in Township of Radnor","There were no other sightings in Township of Radnor on or around April 14th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.037332,+-75.349077(18435)&iwloc=A&hl=en\"> mufon case (18435) map </A>","Viewing Distance":"101-500 Feet","Source":"MUFON","Region":"Pennsylvania","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Object Shape":"Circle","Case Number":"18435","Summary":"Round bright white w/ red, blue and green lights.","Log Number":"US-08012009-0011","Date Submitted":"04/14/2009 07:30 UTC","Latitude":"40.037332","Weather Factors":"Unknown","City":"Township of Radnor"}