{"trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around July 31st 2009"],"Region":"Nevada","Latitude":"39.534403","City":"Reno","Object Flight Path":"Stationary","Object Features":"Other","Case Number":"18432","Summary":"Super bright white light with red twinkle effect","Source":"MUFON","divs":["Sighting DetailsI was star gazing in my yard, as I often do. I noticed a very bright light to the south west, just east of the Sierra Nevada mountains. I grabbed my binoculars (10x50) and steadied myself across the hood of my truck to get a better look at the light. It just hung in the sky, not moving at all. It was partly cloudy and the moon was out, about half a moon. This light was much brighter than the moon or any other object in the sky. I brought the binoculars into the house with me to show my wife, through the window. As I pulled up my \"night sky\" program on the computer, to check for a possible planet that was clearly visable (and large looking). I looked out the unobstructed window through my binocs and watched the bright white \"ball\" vanish right before my eyes. This is the second such object I have seen in a week. I am very confident that this was no plane or satellite. I am getting ready to view the persiad meteor shower this month, and have been seeing alot of \"stray\" meteors here and there. My wife and I reported the same type of sighting last October, but that one was moving from NW to SE. I'm surprised that nobody else from my area has reported this strange \"light in the sky\" We are very close to Lake Tahoe, and I have to wonder if the lake has something of interest to ETs. I will be watching the sky closely for the next few weeks anyway, with camera at my side! Hope to see more, and hope others in the area will do the same."],"Log Number":"US-08012009-0009","Country":"United States","files":["/var/www/straped/mufon/html2text/18432.html.txt","/var/www/straped/mufon/org/18432.html"],"Date of the Event":"07/31/2009 09:46 UTC","Object Shape":"Sphere, Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.534403,+-119.811933(18432)&iwloc=A&hl=en\"> mufon case (18432) map </A>","Longitude":"-119.811933","Sighting Duration":"00:06:00","Date Submitted":"07/31/2009 09:46 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Disposition":"Insufficient Data"}