{"divs":["Sighting DetailsI'm outside at about 3:45am. I looked up in the sky and I saw two stars (the same color as stars) moving in unison one following the other. They were traveling South to North almost exactly. They appeared very high up in the atmosphere. I thought planes, but there was no flashing lights or noise. But, the planes would be breaking FAA regulations flying too closely. I thought satellites, wondering why they would put satellites following close to each other. The leading star momentarily stopped followed by the second star, then went back into motion. They could have just been gaining altitude and appeared to slow down or stop from my vantage point. They remained the same distance apart. I thought they almost appeared to be one object. The stars proceeded together just out of my view when it appeared that search lights on the objects went off like you would see at some grand opening event. At that same time they were gone. What happened next truly amazed me. A shooting star crossed over horizontally in front of my view no more than 1000 feet off the ground. I thought this shooting star could be a light bug, but it zoomed across about 100 feet in a split second faster than any light bug I've seen. I don't know what I observed, but it was odd. I've never seen aircraft flying so close together. If they were military they made no noise."],"files":["/var/www/straped/mufon/html2text/18439.html.txt","/var/www/straped/mufon/org/18439.html"],"Sighting Duration":"Undisclosed","Log Number":"US-08022009-0004","Region":"North Carolina","Object Flight Path":"Straight-line path","Tags":"City","City":"Statesville","Summary":"2 star like objects following each other","Date Submitted":"07/23/2009 03:45 UTC","Country":"United States","Object Features":"Unknown","Weather Factors":"Unknown","Longitude":"-80.879936","Disposition":"Insufficient Data","Date of the Event":"07/23/2009 03:45 UTC","trends":["There have been 5 other sightings in Statesville","There were no other sightings in Statesville on or around July 23rd 2009"],"Case Number":"18439","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.787956,+-80.879936(18439)&iwloc=A&hl=en\"> mufon case (18439) map </A>","Object Shape":"Star-like, Unknown","Viewing Distance":"Over One Mile","Latitude":"35.787956"}