{"Date Submitted":"07/27/2009 12:00 UTC","Tags":"City","Weather Factors":"None","Longitude":"-121.282306","map":"<A HREF = \"http://maps.google.com/maps?q=38.759494,+-121.282306(18443)&iwloc=A&hl=en\"> mufon case (18443) map </A>","Date of the Event":"07/27/2009 12:00 UTC","Object Features":"Wings","files":["/var/www/straped/mufon/html2text/18443.html.txt","/var/www/straped/mufon/org/18443.html"],"Country":"United States","Case Number":"18443","Sighting Duration":"Undisclosed","Latitude":"38.759494","Region":"California","Source":"MUFON","City":"Roseville","Log Number":"US-08022009-0008","trends":["There have been 31 other sightings in Roseville","There were no other sightings in Roseville on or around July 27th 2009"],"Object Shape":"Other","Disposition":"Unknown","Summary":"It looked like it had a round body with a boomerang sitting on top of it.","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","divs":["sighting detailswe live in west roseville near the fairgrounds. me and my wife and kids were enjoying the hot weather in our swimming pool. at approximately 7:40pm pst i noticed an airplane flying from left to right (i believe southwesterly). when the plane passed by, i noticed an object hovering in the sky, completely stationary. i estimate it was about 2 miles up considering the plane that passed by was significantly lower, but i can't be sure. it was completely still in the air for about 10 minutes. it was white\\silver in appearance and was definitely not any kind of balloon, helicopter, blimp, or airplane i have ever seen before. i grew up on air force bases so i am very familiar with all known modern aircraft. my wife and i both saw this object and she suggested i take pictures of it after watching it for about 5 or 6 minutes. i retrieved my camera, a canon rebel xti with a 28-235mm is lens. i took two pictures of the object but they did not show up for some reason. all you see when you look at the pictures is clear blue sky. after about 10 minutes the object appeared to slowly move off at an angle in a northwesterly direction. i don't know what the object was. my wife doesn't know what it was. however, we're pretty sure what it wasn't. if anyone else saw this object, please let me know. i waited a week to report this to see if anyone else made a report on it."]}