{"Object Flight Path":"Hovering then path","trends":["There have been 10 other sightings in Ellicott City","There were no other sightings in Ellicott City on or around August 1st 2009","This sighting has never been favorited.",""],"Object Features":"Appendage(s)","Log Number":"US-08022009-0005","Viewing Distance":"Unknown","divs":["sighting detailson the way to carroll county airport (15 miles west !) from our 1st maryland mufon meeting, held in the 9000 block baltimore national pike, i snapped 4 shots of this. rolling road looking north at security blvd. i noticed this at a stop light. jumped out and got camera out of trunk. this object caught my attention as it was hovering. altitude est 1500-2000 feet agl. it has 4 distinct protrusions out all sides. i shot it with sony power shotsx1015 . this was the closest first shot through windshield of car. we pulled off asap and i shot 3 more. we followed noiseless object about 3 miles north speed estimated at 30 mph. no noise. object on a straight line trajectory at times motionless consistently ascending. winds at carroll county 160* @ 5 knots. this objects trajectory was on a 330*-360* heading. as a commercial jet approached (160*-180* heading)on a divergent course (at rolling and windsor mill), object just vanished. i was passenger in front seat of vehicle and had visual contact with object at all times. right after our first meeting. what struck me were the protrusions (4)and motion. there is a video shot by 2 men in bahama's (youtube) almost identical. camp david restrictions were in effect 45 miles nnw. this object was in the outer class b veil of bwi 2500\\10000 see attached pictures. (this object's trajectory would have put it very close to our meeting area at the time. just putting that statement out there.) this case will be deposed by david lyle and don borton. i am the state director for maryland mufon. therefore would prefer unbiased investigation."],"Date Submitted":"08/01/2009 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.267328,+-76.798307(18440)&iwloc=A&hl=en\"> mufon case (18440) map </A>","Case Number":"18440","Object Shape":"Unknown","Summary":"Unknown Aerial Vehicle","Latitude":"39.267328","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unknown","Longitude":"-76.798307","Source":"MUFON","City":"Ellicott City","Date of the Event":"08/01/2009 06:00 UTC","files":["/var/www/straped/mufon/html2text/18440.html.txt","/var/www/straped/mufon/more/18440_submitter_file1__IMG_0295.JPG","/var/www/straped/mufon/more/18440_submitter_file2__IMG_0297.JPG","/var/www/straped/mufon/org/18440.html"],"Region":"Maryland","Weather Factors":"Unknown","Country":"United States"}