{"Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-08022009-0006","Country":"United States","Region":"Connecticut","Summary":"Extremely fast moving light in the distance. Moved clearly in a loop, telepathic experience too.","Longitude":"-73.408546","trends":["There have been 4 other sightings in New Milford","There were no other sightings in New Milford on or around May 3rd 2007"],"Sighting Duration":"Undisclosed","divs":["Sighting DetailsI went down to my neighborhood beach on Candlewood Lake a couple years back, as I would most nights at the time. Just looking at stars, and beyond them...wondering big things. I walked out to the end of the boat docks, where the best view of the universe is ( floating on water at the end of a dock) Something strange started happening a few minutes after I got down to the end of the dock. I started feeling like something with me. but not physically. It was the strangest feeling I've ever had and I can't really remember what it was like. I Can't really describe it, except that it was like someone was talking to me...but without speaking. It wasn't really saying anything at first, aside from \"this form of communication exists\". ie. talking is not the only way to communicate. Now, I'm not talking about voices in the head or something like that. This was a different level of communication. There was a communication of concepts and understandings without the use of words. Sort of like, the ultimate form of communication. It was telling me that this form of communication was possible, that was the first concept it addressed. The second was basically, \"watch this\". and a streak of light flashed through the air, miles off in the distance North of my position where I was looking. It did a loop faster than anything I've ever seen move, about as fast as a common house fly appears to be moving when it's right in front of your face...which is really fast for something miles away. The light appeared, and dissappeared, I did not watch it approach, I did not watch it fade away. The feeling of it's telepathic presence or whatever you would call my experience of communication, left too. and I was left with a very empty feeling. I wonder if anyone else saw this light, early in May 2007, or if it was just me."],"Object Features":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Unknown","Disposition":"IFO","City":"New Milford","Latitude":"41.577043","map":"<A HREF = \"http://maps.google.com/maps?q=41.577043,+-73.408546(18441)&iwloc=A&hl=en\"> mufon case (18441) map </A>","Date Submitted":"05/03/2007 12:00 UTC","Date of the Event":"05/03/2007 12:00 UTC","files":["/var/www/straped/mufon/html2text/18441.html.txt","/var/www/straped/mufon/org/18441.html"],"Source":"MUFON","Case Number":"18441"}