{"Region":"Michigan","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/18444.html.txt","/var/www/straped/mufon/org/18444.html"],"Object Features":"Unknown","Longitude":"-86.205087","Date of the Event":"07/31/2009 11:15 UTC","Object Flight Path":"Straight-line path","trends":["There have been no other sightings in Onekama","This sighting has never been favorited."],"Country":"United States","Tags":"City","City":"Onekama","Date Submitted":"07/31/2009 11:15 UTC","Source":"MUFON","Case Number":"18444","Latitude":"44.363613","Log Number":"US-08022009-0009","divs":["Sighting DetailsOn the last night of our vacation we went outside and I noticed an orange object moving towards us from the south, I pointed it out to my husband, we watched it for a minute then called to my brother in the house he called to our kids to come out so this didn't happen too fast. I would have to describe the shape as round to oval and the light it emitted was definitely orange. The center of it had solid color whereas the outer area appeared diaphanous and pulsing a bit, this effect went away when the object was directly above and as it went away to the north with the shape becoming smaller and round till it was just a dot of orange the size of a star. When we first spotted it coming towards us from the south, the shape was very large--the size of the head of a golf tee held at arms length. The object would have been traveling along the eastern coast of Lake Michigan. It moved steadily as a plane would but looked nothing at all like the lights of a plane and it made no noise. We were hoping that others had seen it and reported it, we haven't seen anything in the news that would explain it, but we are home in PA now so if others in MI saw it and are reporting on it, we won't know. I wish that we had tried to get a picture of it, as the event lasted several minutes but I just didn't want to stop watching it."],"Weather Factors":"Unknown","Summary":"orange object moving north slowly and silently","map":"<A HREF = \"http://maps.google.com/maps?q=44.363613,+-86.205087(18444)&iwloc=A&hl=en\"> mufon case (18444) map </A>","Sighting Duration":"Undisclosed"}