{"Longitude":"-86.121019","Source":"MUFON","Object Shape":"Blimp, Cigar","Case Number":"18453","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","divs":["Sighting DetailsI was driving on Indiana 47, toward Westfield, Indiana, last night. Spotted a UFO at 10:30. I'm not a professional. This is my first sighting. It was left of my visual of the moon, in the center of my line of vision, large, brightly lit, white light, dead still, and very high up. I could see planes occasionally fly over, and under it. They seemed to be observing it. I hope that means you have reports from skilled aviators this morning.. It looked to be about one fourth the width of the moon. I imagine it to be a round craft, but what I saw was a straight line, brightly lit, about one fourth of the width of the moon, left of the moon in my line of vision. The light was very bright and steady. I came home, and watched it until almost midnight, dead still in the sky. It was an amazing sight! I understand you try to track all activity, so I wanted to report to you. Thank you for your work. I know we all need to know and understand the true nature of your universe better. I've learned a lot of valuable information from MUFON. Hope this is helpful to your work. Please share this report with any other organization that it would be useful to."],"Latitude":"40.047105","Country":"United States","Region":"Indiana","Summary":"Bright white light, large, high, and still for at least an hour.","Viewing Distance":"Over One Mile","Disposition":"IFO","trends":["There have been 8 other sightings in Westfield","There were no other sightings in Westfield on or around August 2nd 2009"],"Date of the Event":"08/02/2009 10:30 UTC","Log Number":"US-08032009-0002","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/18453.html.txt","/var/www/straped/mufon/org/18453.html"],"City":"Westfield","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.047105,+-86.121019(18453)&iwloc=A&hl=en\"> mufon case (18453) map </A>","Tags":"City","Date Submitted":"08/02/2009 10:30 UTC"}