{"Region":"New York","Tags":"City","Object Features":"None","Log Number":"US-08032009-0004","Country":"United States","Weather Factors":"None","Summary":"Unknown triangular object flies over my house.","divs":["Sighting DetailsIt was approx. 12:15am and I went out to walk my dog. I looked up at the stars as I usual do at night and noticed a 2 lights coming towards me. This didn't seem to unusual to me considering I live in Staten Island, NY and we have 3 big airports in the vicinity.(JFK, LAG, NWK) As the craft got closer it seemed odd to me so I asked my wife to look out the window at the object. Within seconds she ran outside to get a better look. The unknown object was moving rather quickly. Like I said airplanes fly over my house all day and night and they are usually on approach so they are not traveling full speed, but this object was moving very fast thru the sky. At this point it was close to overhead and we noticed it it was actually 3 lights in a triangular shape with a blinking red light dead in the center. I could not see the outline of the object, but it was blocking out the stars above it. As far as the lights seemed, the object was somewhat larger than a plane, but this was because it was at a lower altitude than the planes that usually fly over. What was even more amazing was the fact there was no noise, even though it was low in the sky. As it passed over of us we just couldn't take our eyes off of it. Then we noticed a 4th light in between the 2 lights in the back of the craft. It seemed very odd that a 4th light would just illuminate suddenly. My wife and I were puzzled as to what it could be and before we knew it it was gone and out of sight. We decided to watch 2 planes that flew over minutes afterward and not too surprising was the fact that there was no comparison. When the planes flew over you could not only hear them loud and clear, but we could actually see the outline of the airplane. And the airplanes had one bright light and 2 blinking lights on either side of the main light. They looked nothing like the object we saw. Now I won't pretend to be an expert on airplanes, but I have seen planes flying overhead everyday my entire life leaving in the NYC area and this was different. If anyone can supply me with some opinions as to what it maybe or know of any sightings of similar craft around this area or date please let me know. I do know it wasn't a balloon, kite, satellite, space debris, or a helicopter, so please do not give me some lame excuse. Tank you and I appreciate it."],"Date Submitted":"08/03/2009 01:00 UTC","Case Number":"18455","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Unknown","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.586062,+-74.148521(18455)&iwloc=A&hl=en\"> mufon case (18455) map </A>","Sighting Duration":"00:02:00","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 3rd 2009"],"files":["/var/www/straped/mufon/html2text/18455.html.txt","/var/www/straped/mufon/org/18455.html"],"Longitude":"-74.148521","Object Shape":"Diamond, Triangle","City":"New York","Latitude":"40.586062","Date of the Event":"08/03/2009 01:00 UTC","Object Flight Path":"Straight-line path"}