{"Object Features":"Other","Object Shape":"Circle, Disc","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 3rd 2009","This sighting has never been favorited.",""],"Source":"MUFON","Summary":"white colored UFO disc like shape that wasn't visual to the human eye but available to a camera.","map":"<A HREF = \"http://maps.google.com/maps?q=34.153369,+-118.512818(18464)&iwloc=A&hl=en\"> mufon case (18464) map </A>","City":"Los Angeles","Viewing Distance":"Unknown","Date Submitted":"08/03/2009 12:00 UTC","Country":"United States","Case Number":"18464","Longitude":"-118.512818","Log Number":"US-08042009-0001","Disposition":"IFO","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18464.html.txt","/var/www/straped/mufon/more/18464_submitter_file1__100_0197.JPG","/var/www/straped/mufon/more/18464_submitter_file2__100_0198.JPG","/var/www/straped/mufon/org/18464.html"],"Object Flight Path":"Straight-line path","Date of the Event":"08/03/2009 12:00 UTC","Latitude":"34.153369","Region":"California","Weather Factors":"Unknown","divs":["Sighting Details I was in my den looking at the beautiful sun set in the clear sky. I look at my wife to tell her what a wonderful night it was. Thats when i decide to go grab my camera and race outside to snap a few pictures to keep as memories. When i was taking a picture of the sunset my eye shifts to the moon in the south-east of the sky. I decide to take a picture. Once the picture is captured in my camera i view the picture and I notice that in the upper conner I notice that I caught a light besides the moon. I tell my wife i found a UFO. Right after I take another picture to make sure that there is nothing wrong with my camera and to reassure my self. I rush to my office and download the pictures into my computer. There it was i noticed that the UFO had distanced between the two shots it had traveled in the speed of light. Photo's are available. They are very clear and feel free to zoom in!"],"Tags":"City"}