{"Case Number":"18463","files":["/var/www/straped/mufon/html2text/18463.html.txt","/var/www/straped/mufon/more/18463_submitter_file1__DSC00672.JPG","/var/www/straped/mufon/more/18463_submitter_file2__DSC00674.JPG","/var/www/straped/mufon/more/18463_submitter_file3__DSC00667.JPG","/var/www/straped/mufon/org/18463.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"saw multiple red lights rising steadily one after another, up and off to our left. aproximately 7 differnt lights all the same.","Viewing Distance":"Unknown","Latitude":"38.157061","Sighting Duration":"00:09:00","divs":["Sighting DetailsWe (myself and two friends were doing some night fishing on Lake of the Ozarks on the Grand Glaize Arm. As we are boating along at aprox. 30 mph, I noticed a red soda can shaped deep red light slowly moving across the sky at a low altitude. We didnt think much about as I pointed it out. As we start to make a turn around an \"arm\" of the lake we see another rising in the sky and starting to move off in the same direction as the one we saw on the other side of the arm. Not but a few seconds later we saw one rise from over the trees to our right (like a ballon being released)and steadily move more away from us and to the right where the first couple seemed to just move straight to our right. At this point we were confused because they seem to be rising from the trees from pretty close by. As I looked over to see if we could see the first few.....we noticed that the lights were disapering after about 15 to 20 seconds and seemed to be covering a bit of ground quickly. One was becoming very dim and diasapering directly to our right and a couple others moved to the right but almost directly away from us. They were clearly not planes nor helicopters, as they made no sound. We estimated to see about 7 or 8 of these objects in total. My only guess would be some extreemly bright, big, deep red ballons but seemed to be moving far to quickly for the wind to be blowing them not to mention there was almost no breeze and what breeze there was was hitting us directly in the face....not out to our right and away from us. I took some digital pictures with a sony cybershot 8.1mp camera. I must have about 10 pics and one video. It dosnt show up on the video but does clearly on about 6 pictures. I zoomed in using Corel snapfire plus and you can see different colors light around the outside of the object. I hope someone can tell us what it was..... The pictures are the red light in the center of the picture and the lights to the lower right are of a house right on the lake with a lot of lights on....they looked to be having a party. We were wondering if they could see these objects as they went right over the house."],"Disposition":"Unknown","Tags":"City","Date Submitted":"08/01/2009 12:00 UTC","trends":["There have been 2 other sightings in Osage Beach","There was one other sighting in Osage Beach on or around August 1st 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","City":"Osage Beach","Date of the Event":"08/01/2009 12:00 UTC","Log Number":"US-08032009-0012","Country":"United States","Longitude":"-92.611112","map":"<A HREF = \"http://maps.google.com/maps?q=38.157061,+-92.611112(18463)&iwloc=A&hl=en\"> mufon case (18463) map </A>","Object Shape":"Cone, Cylinder, Sphere","Region":"Missouri"}