{"Region":"Louisiana","Longitude":"-90.910219","files":["/var/www/straped/mufon/html2text/18466.html.txt","/var/www/straped/mufon/org/18466.html"],"Latitude":"30.243649","Date of the Event":"08/03/2009 12:00 UTC","Summary":"two showed up close as others stayed star-like in distance","Log Number":"US-08042009-0003","Date Submitted":"08/03/2009 12:00 UTC","divs":["Sighting DetailsThis time, I was alone. I was expecting nothing. After about an hour or so of standing outside (alone) my wife decided to head to the store. A few minutes after she left one of them showed up a few thousand feet up or so and moved along the sky and disappeared. 20 more minutes go by and as I looked up I saw one high and to my south (light up and then disappear) really quick, but headed back in my direction. I got my camera ready, but what was about to happen; in all honesty I was not ready for. Within just a few seconds, very close the craft lit up out of nowhere. I started filming, which is difficult when they fly directly above you, as it went out of view over the tops of the trees in my yard, I ran out to finish filming it as it left the area. I was a little shook up this time, mostly because they surprised me. After returning from a short break, several minutes went by and to my west, one lit up out of nowhere for a split second and out of of the corner of my eye to the south I filmed another craft, very beautiful and brightly lit slowly traveling just above the tree lines. After these two, I stopped for the night, I had enough for one evening. :)"],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 7 other sightings in Gonzales","There were 2 other sightings in Gonzales on or around August 3rd 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Object Features":"Undisclosed","Country":"United States","City":"Gonzales","Object Shape":"Disc, Star-like, Triangle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.243649,+-90.910219(18466)&iwloc=A&hl=en\"> mufon case (18466) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Case Number":"18466","Weather Factors":"Unknown"}