{"map":"<A HREF = \"http://maps.google.com/maps?q=41.506897,+-74.006998(18467)&iwloc=A&hl=en\"> mufon case (18467) map </A>","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18467.html.txt","/var/www/straped/mufon/org/18467.html"],"trends":["There have been 8 other sightings in Newburgh","There were no other sightings in Newburgh on or around October 29th 1977"],"Latitude":"41.506897","Log Number":"US-08042009-0004","Date of the Event":"10/29/1977 12:00 UTC","Longitude":"-74.006998","Case Number":"18467","Object Flight Path":"Stationary","Date Submitted":"10/29/1977 12:00 UTC","City":"Newburgh","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Region":"New York","Tags":"City","Object Features":"Unknown","Summary":"private property that bordered the Central Hudson Power Plant, Traprock","divs":["Sighting DetailsI lived in a remote area of Traprock property that bordered the Central Hudson power plant property and the Hudson River, It was October 29, 1977, I had been told by my boyfriend never to turn the lights out, outside or inside at night. I was home with my son who was 2 years old. It was a ranch house, and it had heating vents in the ceilings. I heard a loud rumbling noise, that I had heard before, it was so strong that it shook the vents out of place in the ceiling. I was tired of climbing up and fixing them. It was 7pm, my son was asleep and I turned on the TV and it was all scrammbled. I heard the rumbling and humming noises and turned all the light out. I went to the front bedroom window, opened it, and was kneeling down looking out towards the river area. I heard what sounded like a horse whinning in the distance, and could see beyond the woods flashing lights close to the ground in a circle pattern.I saw closer to the house my boyfriends dog and cat shaking from fright under a bush, near the house. I looked up in the sky and saw a aerial display of lights, one large main flying light surrounded by smaller ones. It looked like the smaller flying things were protecting the larger one. The sky was clear, I thought I could just watch all their darting and moving around and who would care.I even pinched myself to make sure I was seeing what I was seeing. Then a glowing object left the formation and started coming closer to my location, I watched it fly towards the house closer and closer, I was experiencing great fear, but was frozen and could not move, the dome,a red glowing thing hovered outside my window area, to the height of the roof eave, I was staring into a red fireball hovering, could not move or speak, only think words. I told them that I would not watch any more. A flash of red light and I was gone. When I found myself back, maybe 30 minutes or longer, I had a stiff neck, and I was bleeding internally.My boyfriend came home and told me the truth, and he told me that he had seen them and was doing things for them by the Hudson River. They would tell him to collect things and he would bring the things to them. He described them as 4ft high, slanty red eyes, they were sub human and knew everything he was thinking and doing. They gave him large vegetables to eat. The next morning the local paper had many stories about people calling the police, and reporting sightings, their animals were going crazy. Central Hudson Electric would not allow any investigators on that property. I thought it was over for me but it was not, too make it short, I had to go to a Doctor I did not know, and he told me that I had a perforated uterus. During the exam, which was a few months later he told me that I was not pregnant. I was being told that when something happened I was suppose to wrap it up and put it outside in a certain spot. I had no idea why they had told me that until one more month had passed and one day out of nowhere something came out and I did what they told me to do, wrap it up and put it in a certain place. For the next five months I ignored them, and then we were told that all the houses were going to be demolished, and my boyfriend was given the job to demolish them. I remember that they told me that 3 of them would come to ask me for assistance at some time later.I know what they did, an experiment to find out if they could impregnate humans. They had me reading all these different books for information. I know that they get you with fear, and mind control. They are very intelligent. It was October of 1987, Monroe NY County of Orange, I was listening to the tv about a black man that said he was abducted, he was illerate prior to the abduction, and when I heard him describe the aliens I went to watch and hear what he was saying, he said there time is not our time, it is 10 years difference. My boyfriend was visiting and woke me one night afraid and said that he heard flying noises and looked and saw UFOS. I told him okay, don't worry. When he had left for a business trip and I was alone with the kids, one night I was woken up at 3am, October of 1987 and I looked out my two story front window. Below on the ground in full light were 3 of the same aliens, 4ft tall, gray bodies, no segmentation of their bodies, and slanty red eyes. They were calling my name and asking me to come out. I told them no, and went to bed. There was no fear any longer. I never looked for them any longer, and figured that they were gone forever. In 2003 while shopping a strange lady approached me and invited me a stranger, to have tea at her house. She said it was important and I had to come. I will not name her, but I went because I was curious. She told me that she was a physhic and read for The Queen of England, she needed to warn me about the UFO people. I had never said a word to her about what happened to me in 1977 and in 1987. She told me that they are evil, and they are not done with me yet. I told her that I was done with them and she they are not done with me. That was in 2003. I knew that day in the store, when this strange lady was following me around for hours, was odd, but she was really a very gifted person. That happened in Naples, Florida. I lived in Port Charlotte, Florida from 2003 to 2009, and I ignored the flying objects I would see. I saw that news article about Rowley in North Port, Fl.I knew it was all made up. Any person, that is taken against their free will, in fear, with their power of mind control, they have no mouths, who is awake the entire time, not asleep or dreaming, or taking medication, or drinking, does not consider the long term effects to be funny. I read later on about the guy in Middletown NY, he was telling the truth, the Halls, they were telling the truth. It is understandable, unless you experience it for your self, that you can not believe that it exists. I think the UFO crafts need the electric from the water and power plants, they experiment, they try to breed their people with humans, and perhaps that is what they want to show me. I do know, if they want to make contact they can, but if you show no fear it lessens their power. I can tell if a person has really been affected by the trama that such an encounter causes. I lived it. I have seen UFOS on Alligator Alley coming from Fort lauderdale to Naples, the craft flew directly over our car, you could see the bottom and all the lights, my husband saw it, my kids saw it. My kids believed what they saw as unusual, my husband did not. My sons father, who has passed away, told me back in Newburgh NY, that the alliens think it is funny how stupid we are, and how the cause and cure for cancer is so simple yet we can not figure it out. You can check the records for the dates I have written, A lady in Maybrook NY on the morning of October 30, 1977 saw A UFO, was so scared she had heart pains and the Middletown Record had a story about it. Why did Traprock want all those houses in that private area demolished without much notice? I do believe that they are not good but they are evil, like the woman told me, and to stay far away from them........."],"Disposition":"Unresolved","Object Shape":"Cylinder, Fireball, Sphere, Square, Rectagular, Triangle","Sighting Duration":"Undisclosed"}