{"Log Number":"US-08032009-0010","map":"<A HREF = \"http://maps.google.com/maps?q=38.794053,+-85.65279(18461)&iwloc=A&hl=en\"> mufon case (18461) map </A>","trends":["There have been no other sightings in Deputy","This sighting has never been favorited."],"Source":"MUFON","Longitude":"-85.65279","Latitude":"38.794053","Date Submitted":"07/03/2009 12:00 UTC","Tags":"City","Date of the Event":"07/03/2009 12:00 UTC","divs":["Sighting DetailsI am reporting this for the person who saw the object (but declined to either report it, or be identified as having seen it) exactly as the witness related it to me; therefore, this report is hearsay, and I am only relating this in case others will read and confirm. If MUFON would like to confidentially interview this witness and he is willing, I can pass on your contact info and have him call you on my phone. Friday, July 3, 2009, witness was driving in car with daughter. Sky was overcast and it was dusk (time 2100 aprox). In vicinity of Deputy, IN, driver did not at first see object, and daughter says, \"Daddy, what is that?\" He looks and sees a round, glowing object ...and also noticed that others were looking up at it. It was stationary most of the time, but after a short period of time - exact time not noted, but it was seconds, not minutes - it ascended into the overcast and was not seen again. There was a short conversation as to whether or not they had seen a UFO. Witness was convinced that what he and his daughter had seen was not a conventional aircraft and was an anamalous aerial object, because of the unuausl flight characteristics, lack of sound, and luminous appearance. Witness unable to describe aprox height or size of object. As noted, there were other witnesses to this event, but the number of people was not given. It should also be noted that there was not any convective activity ()with lightning in the vicinity at the time. Deputy is near a former military proving ground (Jefferson), now used for urban warfare training."],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Object Features":"Undisclosed","Object Shape":"Circle, Sphere","Case Number":"18461","Weather Factors":"Unknown","Summary":"round lighted object, not aircraft","Region":"Indiana","files":["/var/www/straped/mufon/html2text/18461.html.txt","/var/www/straped/mufon/org/18461.html"],"City":"Deputy","Country":"United States","Sighting Duration":"Undisclosed"}