{"Log Number":"US-08042009-0011","files":["/var/www/straped/mufon/html2text/18475.html.txt","/var/www/straped/mufon/org/18475.html"],"Case Number":"18475","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","Date of the Event":"08/03/2009 11:00 UTC","City":"Dover","Latitude":"43.201922","Summary":"Erractic and jerky-moving non-blinking white light in clear night sky, brighter than Venus, observed for several hours while stars nearby appeared normal.","Object Features":"Undisclosed","Source":"MUFON","Object Flight Path":"Undisclosed","trends":["There have been 3 other sightings in Dover","There were no other sightings in Dover on or around August 3rd 2009"],"Region":"New Hampshire","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Longitude":"-70.86722","Tags":"City","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=43.201922,+-70.86722(18475)&iwloc=A&hl=en\"> mufon case (18475) map </A>","divs":["sighting detailson the night of tuesday, 7\\28\\09 i, along with several other witnesses (including hampton, nh police officer matt dion), observed an unusual light in the eastern sky while standing on hampton beach. it was an erratic and jerky-moving non-blinking white light in the clear night sky, brighter than venus. i, myself, observed it from approximately 9 p.m. to 11 p.m. it defied the flight characteristics of any conventional aircraft in that it sometimes moved in very quick start and stops, quick up and downs, sudden diagonals, and rapid left to rights. it was aproximately 30-40 degrees above the horizon facing almost exactly due east. then last night, monday, 8\\3\\09, i saw the same type of light from dover, nh. using my cell phone i called foster's daily democrat, the local newspaper, and a reporter came out who also observed the unusual object. i then drove back to my apartment in rochester, nh and continued to watch it do its unusual movements until approximately 4 a.m. on 8\\4\\09 when i was too tired to continue watching. before i retire, however, i used my compass to determine it was in the south-southwest area of the night sky (205-220 degrees on compass) and i also estimate it was between 30 and 45 degrees above the horizon (with zenith being 90 degrees, for example)."],"Date Submitted":"08/03/2009 11:00 UTC"}