{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.761147,+-98.89996(18473)&iwloc=A&hl=en\"> mufon case (18473) map </A>","Object Features":"Unknown","divs":["Sighting DetailsJuly 28, at approx. 8:15 p.m. There was a storm approaching from the Southwest and the cloud tops were magnificent. I could see rain and lightning to my WSW. I decided to grab my little Sony digital camera and take a few shots and some video, hoping to catch the lightning. What showed up in 2 of the stills is a mystery. I was watching the sky and not the camera view screen. I never saw anything but clouds. I did not hear or see any jets, airplanes, or helicopters. While I took the shots, some pics blurred. I had set the camera on auto and the camera would refuse to focus, then it just shut off. I checked and still had half a charge on the battery but every other time I'd turn the camera on and point at the sky, it would switch off. My spouse called me 15 minutes later (I looked at my clock), from the west end of town, saying that it was pouring down rain, with pea to marble sized hail. I could hear the clatter in the background as we spoke. Moments later the rain reached our home, so my picture taking came to an end. In the 2 photos I have attached, I cropped and enlarged the objects. I have the untouched originals if you need them. Then on August 2, 2009 at 0200 hrs., I stepped outside with my little dogs. I was facing south admiring the bright moon, when a flash of bright red light caught my eye. I turned to my left and there was another red flash of light at 50 degrees above the ESE horizon. At first I expected it to be a jet but 3-5 more seconds passed before another flash occurred. It was in the exact same spot as the first 2 flashes. I motioned for my spouse to come see but as we watched, no more flashes occurred. We searched the sky for another 15 minutes but no sign of the flashes and no jet. The only way that I can describe the incident, would be that the flashes were more like a burst or pulse, which seemed to radiate out from a fixed position in the sky. It was a mostly clear night, with abundant stars visible. I could not determine size or distance, as I had nothing to compare it to, other than to say that the burst of light covered at least 5 degrees in all directions from a central point, reminding me of an exaggerated \"lighthouse effect\". I agree to the release of my contact information to third parties (ONLY) as part of the investigation into my report of a UFO sighting."],"Longitude":"-98.89996","Country":"United States","Source":"MUFON","Weather Factors":"Windy, Lightning, Light","Region":"Texas","Case Number":"18473","Log Number":"US-08042009-0009","Summary":"2 reports- 1 for July 28, 2009: Objects appear in photos of storm clouds; 2nd report: Aug. 2, 2009: Red burst of light in night sky.","City":"Breckenridge","Tags":"City","Latitude":"32.761147","Date Submitted":"07/28/2009 08:15 UTC","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around July 28th 2009","This sighting has never been favorited.",""],"Object Shape":"Cylinder, Disc, Other","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18473.html.txt","/var/www/straped/mufon/more/18473_submitter_file1__SW1174-7-28-09M.jpg","/var/www/straped/mufon/more/18473_submitter_file2__SW1184-7-28-09M.jpg","/var/www/straped/mufon/org/18473.html"],"Object Flight Path":"Stationary,Unknown","Date of the Event":"07/28/2009 08:15 UTC","Sighting Duration":"Undisclosed"}