{"Latitude":"45.46813","Date of the Event":"08/04/2009 09:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.46813,+11.183444(18476)&iwloc=A&hl=en\"> mufon case (18476) map </A>","divs":["Sighting DetailsOn evening of 4 august 2009 from 21:53 till 21:55 me and my girlfriend were walking in Illasi (verona ITALY) after a coffe. During the walk we spot on the sky an orange light, at NW of Illasi, fliing to NE of illasi. After few seconds appears to us was going too slow to be an airplane. Even also, after few seconds we were looking it, it start to seems fixed in the sky, and moving on his left after 10 seconds about. understood that was something really strange, we start to record it with our mobile phones, film is'nt good (nokia N73 mobile phone) and filmed in hand . in about 2 minutes that supposed UFO went left, right and back in really fast movement. Also,in same time , was flying a common airplane from Est to WEst (illasi point reference) and while that airplane took about 1 min and half to do all the sky from east to west, that object was moving fast in little space and in direction so different that we think impossible to be done by human veicle. At begin we thought of an airplane, but after we see the movement and the velocity in short space we discard it; also we discarded copter idea, couse was so hight altitude for a copter; least as at naked eye seems dark orange light, instead on the movie seems 2-3 light of red, blue and green. stimate altitude over 6000 meters. Our feeling at begins was curiosity, when we understood wasn't an airplane a bit of scare mixed of much more interesting and we startto film it; after more scared, couse that object disappeared in 2 min about, istantanely. Sky was really random and spaced small clouds, but in that part was clear ( the common airplane we keep in sight till too far)"],"City":"Illasi","Object Shape":"Blimp, Sphere","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","Disposition":"Unresolved","Log Number":"IT-08042009-0012","Date Submitted":"08/04/2009 09:53 UTC","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","Summary":"light orange color, looklike an airplane but too slow, and too high altitude as copter.","Longitude":"11.183444","files":["/var/www/straped/mufon/html2text/18476.html.txt","/var/www/straped/mufon/org/18476.html"],"Case Number":"18476","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Veneto","Country":"Italy","Object Features":"None","trends":["There have been no other sightings in Illasi","This sighting has never been favorited."]}