{"Country":"United States","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=32.643554,+-117.079696(18471)&iwloc=A&hl=en\"> mufon case (18471) map </A>","Longitude":"-117.079696","Weather Factors":"Unknown","Date Submitted":"08/03/2009 10:30 UTC","Latitude":"32.643554","files":["/var/www/straped/mufon/html2text/18471.html.txt","/var/www/straped/mufon/org/18471.html"],"divs":["Sighting DetailsI picked up a friend from their house in SD, and we were on our way downtown. We got on the freeway heading north and about one or two minutes later the sighting occured; I believe it was between 10 and 1030 if I'm not mistaken. A light had caught my eye and I couldn't help but notice it as it was right above the horizon directly in front of us. First there was one orb, then two more, and the one on the right side of the triangle started moving around. It was moving in a circular fashion around the central orb, although I'm not positive about the orb on the left side, as I had to pay attention to the road. This thing was MASSIVE. It took up a chunk of the horizon, and there is no way that someone could have missed this. I can't really estimate the size, but it looked like it could have been 1000 ft. on each side. (Again, just an educated guess). Since this was not my first ufo sighting, I didn't freak out or lose my composure, but my friend was only conviced that they were helicopters, because he doesn't buy the whole 'little green men' thing. At first I thought that this was the most amazing thing I have ever seen. I still feel that way. The entire way home I kept thinking about it and how magnificent it was to see something so spectacular and rare, and I consider myself lucky I got to see this. Eventually the orbs just kind of 'turned off' as if a candle was blown out in a room. I can't really think of a way to describe it- it was just too perfect the way they disappeared. Usually I have my video camera on me, but tonight I didn't think I would see this so sorry no pics or vids."],"Date of the Event":"08/03/2009 10:30 UTC","Object Shape":"Triangle","Tags":"City","Summary":"Triangle composed of individual orbs rotating around a central orb (3 orbs total)","Case Number":"18471","Region":"California","Sighting Duration":"Undisclosed","Log Number":"US-08042009-0008","trends":["There have been 11 other sightings in Chula Vista","There were no other sightings in Chula Vista on or around August 3rd 2009"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Object Features":"None","City":"Chula Vista","Disposition":"Hoax"}