{"Summary":"Star shaped object seen starting July 31, also seen August 2, 3 and 4 at same location and same approximate time.","Region":"Pennsylvania","Country":"United States","Disposition":"Insufficient Data","Source":"MUFON","City":"Lancaster","Log Number":"US-08042009-0020","Date of the Event":"08/04/2009 10:00 UTC","divs":["Sighting DetailsUpon returning from a movie in Lancaster, PA on Friday, July 31 at around 11:30PM EST, I was taking my dog out when I was attracted to a bright, star-like object to the southeast. There were other stars in the sky and this was much larger and brighter than any star in the sky (it looked approximately 5-10 times the size of the closest star), and it was much closer and lower in the sky than a star would be. I watched it for approximately 10 minutes during which time it did not appear to move. It was NOT an airplane or helicopter. I also observed a very small blinking light moving in the sky from east to west. I watched the blinking light move very slowly directly at the white light and then past it continuing to the west. The light flashed blue and red at a rapid pace. These did not blink at the same pace as traditional aircraft lights. I was very curious and confused but I took my dog inside and shrugged it off. I did not look on Saturday night, August 1, but on Sunday, August 2 between 10-10:30 PM I saw the same light in the same location. When I had gotten home around 10 I had specifically looked in the same direction and had not seen anything. I observed that it was very cloudy and not one star could be seen in the sky. I came out 2 minutes later with my dog and it was there again in the same location! It was the same size and brightness as before. Again, I observed it for about 10 minutes and it did not appear to move. I showed my brother and he agreed it was not a star and not an airplane or helicopter. I was a little freaked out so I went inside. I checked it again about 15 minutes later and it was gone. On Monday, August 2, I again witnessed the same object at the same approximate time between 10-10:30. This time it was in the same approximate direction but lower and further to the east. It was right above the neighbors tree line in the far distance. This night I showed 2 other members of my family as well as my girlfriend. No one could explain what they were seeing. On this night my younger brother, girlfriend and I also witnessed the same blue and red flashing lights. This time there were two and they both moved slowly through the sky in different directions. At one point one of them passed directly over our heads and we could not identify the object. It is very hard to estimate how high these objects were. We watched the star-like object for about 15 minutes and it did not move at all. We all went inside but checked it about every 10 minutes for the next 30 minutes. Every time we checked it after being inside the light had moved higher in the sky. Each time it had moved clockwise, notably higher in the sky like an arc. When we would go out to check it never appeared to move, it would always appear fixed in the sky. The next night, Tuesday, August 4, I got home around 10 PM from a night class. As I drove up I looked but did not see the light. However, upon parking the car and walking to the front door I noticed that it was indeed there. It was in the same spot as Monday night. I again showed my mother and younger brother and they agreed it was very odd. We again saw the same blinking blue and red light moving from the east to the west. My mother could not explain what it could be. I viewed it through binoculars and it just appeared to be a bright, ball of light. I tried to record it with a digital camera but could not get a could look at it. My brother and I followed the same routine of checking it every 10 minutes and it again moved in the same pattern as Monday, clockwise in a high arc. The change in location were very noticeable, yet when we watched it always appeared to be fixed. After about 30 minutes it was gone again. This is all very strange and it is freaking me out because it appears to show up just as I return from being somewhere. It only moves when I am not watching and it always disappears when I am not watching. I would like someone in the Lancaster area to get a telescope on this thing to try and identify it. I am contacting Mufon so they can identify this thing and get me some answers. If you are in the Lancaster area check the sky around 10-11 PM. Tonight August 4 the moon was very visible and it appeared to be to the east of the moon and lower in the sky. This star-like object is definitely not a tower of any kind as it moves in the sky. It is also not a conventional aircraft or a star (again because it moves and disappears and is much larger and brighter than any star)."],"Object Flight Path":"Stationary","Object Shape":"Star-like","Case Number":"18484","map":"<A HREF = \"http://maps.google.com/maps?q=40.046686,+-76.298514(18484)&iwloc=A&hl=en\"> mufon case (18484) map </A>","Latitude":"40.046686","Sighting Duration":"00:30:10","files":["/var/www/straped/mufon/html2text/18484.html.txt","/var/www/straped/mufon/org/18484.html"],"Tags":"City","Viewing Distance":"Over One Mile","Longitude":"-76.298514","Weather Factors":"Unknown","Date Submitted":"08/04/2009 10:00 UTC","Object Features":"Unknown","trends":["There have been 22 other sightings in Lancaster","There were no other sightings in Lancaster on or around August 4th 2009"]}