{"files":["/var/www/straped/mufon/html2text/18482.html.txt","/var/www/straped/mufon/org/18482.html"],"Weather Factors":"Unknown","City":"Victoria","Date of the Event":"07/26/2009 10:09 UTC","Case Number":"18482","Object Shape":"Star-like","Date Submitted":"07/26/2009 10:09 UTC","trends":["There have been 8 other sightings in Victoria","There were no other sightings in Victoria on or around July 26th 2009"],"Viewing Distance":"Over One Mile","Log Number":"US-08042009-0018","Longitude":"-96.995048","Region":"Texas","Latitude":"28.807597","Country":"United States","Disposition":"IFO","Object Features":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=28.807597,+-96.995048(18482)&iwloc=A&hl=en\"> mufon case (18482) map </A>","divs":["Sighting DetailsI went out skywatching taking my night-vision binoculars and digital camera which I've done only 6-7 times lately. I sat watching maybe 30 minutes after seeing a couple falling stars and a plane when I spotted a brighter object out of the NW headed somewhat towards me going SE. I first looked at it through my night-vision binoculars, but I didn't notice strobe lights. I then got my video recorder ready and started filming. I could not see anything in the lcd lens so I just pointed in the direction it was and hoped I was catching this just in case. The object made no sound whatsoever. The object was almost past me when it did some pulsating or something and disappeared, but I want to call it \"flickering out.\" The object stayed in a straight line with plane-like speed. I did manage to catch some video but the quality isn't great cause it's shaky and I played the video to my TV and recorded that with my Iphone so it's a video of a video. I did upload the video to youtube.com from my Iphone and if you search (possible ufo near victoria,tx) or search my username (JoshTX1) you should find it. I do have the original video that I need to upload to the computer but I have to upgrade and pay for nerophoto if that's what it's called. This is a correction from the last almost identical report. In the last report I typed that someone else saw a similar object on the same night as me but it turns out it was 6-26-09 not 7-26-09 and 11:50pm. After this I am going to look up reports again but with the right date..."],"Summary":"Bright object near Victoria, TX. Video on youtube. Correction of original report","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed"}