{"files":["/var/www/straped/mufon/html2text/18480.html.txt","/var/www/straped/mufon/org/18480.html"],"Region":"Texas","Case Number":"18480","Country":"United States","Latitude":"28.812177","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-08042009-0016","Date of the Event":"06/26/2009 10:09 UTC","City":"Victoria","map":"<A HREF = \"http://maps.google.com/maps?q=28.812177,+-96.997278(18480)&iwloc=A&hl=en\"> mufon case (18480) map </A>","Disposition":"IFO","trends":["There have been 8 other sightings in Victoria","There was one other sighting in Victoria on or around June 26th 2009"],"Sighting Duration":"00:01:00","Object Flight Path":"Undisclosed","Summary":"Saw bright object moving from NW to SE near Victoria, Tx","divs":["Sighting DetailsI went out skywatching taking my night-vision binoculars and digital camera which I've done only 6-7 times lately. I sat watching maybe 30 minutes after seeing a couple falling stars and a plane when I spotted a brighter object out of the NW headed somewhat towards me going SE. I first looked at it through my night-vision binoculars cause it wasn't moving irregularly but I didn't notice strobe lights. I then got video recorder ready and and started filming. I could not see anything in the lcd lens so I just pointed in the direction it was and hoped I was catching this just in case. The object was almost past me when it did some pulsating or something and disappeared, but I want to call it \"flickering out.\" I did manage to catch some video but the quality isn't great cause it's shaky and I played the video to my TV and recorded that with my Iphone so it's a video of a video. I did upload the video to youtube.com from my phone and if you search (possible ufo near victoria,tx) or search my username (JoshTX1) you should find it. I do have the original video that I need to upload to the computer but I have to upgrade nerophoto if that's what it's called. I first tried to report my sighting through my Iphone and got all the way through it all and it wouldn't let me do it so.. Tonight (8-4-09)I was searching through Texas sighting because I found a link about June being hot ufo month for Texas and I went there to find a report from Victoria, Tx on the same night I saw something (6-26-09). My video recorder reads 10:09pm, their report is like 11:43pm. I thought that was really strange so it pushed me to come on and give my report."],"Date Submitted":"06/26/2009 10:09 UTC","Object Features":"Undisclosed","Object Shape":"Star-like","Viewing Distance":"Unknown","Longitude":"-96.997278","Tags":"City"}