{"Weather Factors":"Unknown","Disposition":"Unresolved","Summary":"3 flying objects in horizontal flight","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/1849.html.txt","/var/www/straped/mufon/org/1849.html"],"Sighting Duration":"00:10:00","Date of the Event":"09/02/2002 11:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.160322,+4.493926(1849)&iwloc=A&hl=en\"> mufon case (1849) map </A>","divs":["Sighting DetailsI was in an park called Leidse Hout, on the border of the cities of leiden enOegstgeest in Holland, with three friends. we were watching the sky for shootingstars, as one of us noticed a satelite flying. in order to see more satelties,we became very alert . tehn suddenly, we saw a formation of three lights flying.now what makes us think they werent satelites? three things: a) they werethree, flying in formation b) ive seen many satelites, but neve one so faintand therefore high above the earth, and c), which is the hardest evidence: theselights were flying in one direction, i think it was SE, for more then fiveminutes. as they approached the horizon, they appeared to be flying closertogether. this may mean two things: either they broke formation, but as far as iknow, satelites never do, or, it means they were flying horizontaly, and not, assatelites do, on a steady distance of the earth-surface, in other words,following the curve of the earth. when we first saw the formation it was likethis5B. .5D later like this5B:.5D. please have a dutch(-speaking) member of your organization e-mail me, sothat i can report more acurately in my own language."],"Latitude":"52.160322","Country":"The Netherlands","Log Number":"","Object Shape":"Undisclosed","Region":"Zuid-Holland","Longitude":"4.493926","City":"Leiden","Tags":"City","Date Submitted":"09/02/2002 11:15 UTC","Source":"MUFON","Object Features":"Undisclosed","Case Number":"1849","trends":["There has been one other sighting in Leiden","There were no other sightings in Leiden on or around September 2nd 2002"],"Object Flight Path":"Straight-line path"}