{"Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18497.html.txt","/var/www/straped/mufon/org/18497.html"],"City":"Indianola","Log Number":"US-08052009-0013","Longitude":"-93.557438","Latitude":"41.358048","map":"<A HREF = \"http://maps.google.com/maps?q=41.358048,+-93.557438(18497)&iwloc=A&hl=en\"> mufon case (18497) map </A>","trends":["There have been no other sightings in Indianola","This sighting has never been favorited."],"Source":"MUFON","Date of the Event":"08/01/2009 06:45 UTC","divs":["Sighting Detailsme and two other friends went out to Pickard Park in Indianola, IA on Saturday Aug. 1st at about 6 or 6:30pm, to play frisbee golf. Many Spectators were at the park and were awaiting a hot air balloon launch that was taking place at the balloon field neighboring the park . My Friends and I started playing the course and got far enough into the course where we were seperated from the balloon spectators by alot of trees and wooded area. The Balloons had not yet taken flight but our eyes were in the sky becase there was a plane flying above circling the balloon field which is about a mile away to the north east, we saw it on its southern pass aound the balloon field. I cannot remember who saw it first but i do remember that we saw one small white dot up and to the east in the very very far distance not moving. At first we thought that it might be a (very) high altitude balloon, but the more we thought about it, we came to the concultion that it was just too high up even for a plane let alone a high altitude balloon. The small white ball did NOT give off its own light, it was very faint and hard to keep you sight on it so we had to focus hard on it. If It had not been a clear evening it wouldn't have been seen, as we looked at it closer we noticed that there was not just one ball but three in a triangle formation. We watch the three balls for about 15 to 20 mins before we just seemed to loose sight on them. The strangest part of this all was that the balls seems to get slightly closer and further away very slowly changing the angles between the three balls but always keeping a triangle shape, as though they were all connected by somthing unseen."],"Country":"United States","Weather Factors":"None","Object Shape":"Circle, Sphere, Triangle","Summary":"very faint, white balls, three of them in V or triangle shape, hoverd very high","Object Flight Path":"Stationary,Other","Tags":"City","Object Features":"None","Region":"Iowa","Disposition":"IFO","Date Submitted":"08/01/2009 06:45 UTC","Case Number":"18497"}