{"map":"<A HREF = \"http://maps.google.com/maps?q=32.863062,+-116.919249(18490)&iwloc=A&hl=en\"> mufon case (18490) map </A>","City":"Lakeside","Object Features":"Undisclosed","Tags":"City","Region":"California","divs":["Sighting DetailsIt was almost 7:30 and I was waiting for my friends to show up so we could go egg houses. I walked outside on my front porch and looked out toward the local mountain ranges. To my suprise I saw something, at first I was taken back by it, I was always a believer in UFO's but I never thought I would see one myself. It was a large, elongated triangle, with lights on the bottom. It blacked out the sky behind it. At first it was just slowly moving, hovering over the mountains. I went inside to try and find a camera and tell someone, my camera had dead batteries and no one ever believed me. When I came back outside, the UFO had turned almost completely vertical toward the sky, I went back inside to tell my father, since he just got out of the shower and was the only one who could possibly believe me. But when I went to show him, it was gone. I've included a sketch, of when it turned toward the sky."],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/18490.html.txt","/var/www/straped/mufon/more/18490_submitter_file1__IMG00372.JPG","/var/www/straped/mufon/org/18490.html"],"Sighting Duration":"00:05:00","Date of the Event":"10/31/2006 07:23 UTC","Source":"MUFON","trends":["There have been 5 other sightings in Lakeside","There were no other sightings in Lakeside on or around October 31st 2006","This sighting has never been favorited.",""],"Object Shape":"Diamond, Triangle","Log Number":"US-08052009-0006","Longitude":"-116.919249","Country":"United States","Viewing Distance":"Unknown","Latitude":"32.863062","Weather Factors":"Unknown","Date Submitted":"10/31/2006 07:23 UTC","Case Number":"18490","Object Flight Path":"Undisclosed","Summary":"On Halloween night when I was a teenager I walked outside and saw a triangular UFO in the sky"}