{"Date of the Event":"07/11/2009 12:00 UTC","Log Number":"US-08052009-0009","Longitude":"-106.417397","Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/18493.html.txt","/var/www/straped/mufon/org/18493.html"],"Object Shape":"Square, Rectagular, Other","City":"Placitas","map":"<A HREF = \"http://maps.google.com/maps?q=35.309184,+-106.417397(18493)&iwloc=A&hl=en\"> mufon case (18493) map </A>","Object Features":"None","Object Flight Path":"Straight-line path","Tags":"City","Case Number":"18493","Region":"New Mexico","Summary":"semi-translucent 6' x 6' ululating wave","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"35.309184","trends":["There have been 2 other sightings in Placitas","There was one other sighting in Placitas on or around July 11th 2009"],"Weather Factors":"Unknown","Viewing Distance":"21-100 Feet","divs":["sighting detailsthis report is being filed by paul ciano, field investigator #16907 on behalf of the witness. this was a separate incident which was included in the initial report, case #18056 that occured on 7\\10\\09. case #18056 was investigated & completed. the witness statement is as follows: the following evening (7\\11\\09) at 9:30pm, i had just pulled out of my driveway and and was about 200 ft. east of my house going about 15 mph, when the same object was caught in my headlights - same size, still \"ululating\" like a wave w\\ a tinge of the dark red color, crossing the dirt road in front of me by about 25 ft again, this time heading north towards the blm (bureau of land mgmt property) into the darkness. outside of my headlights, you could not see it. i was surprised to have seen this \"thing\" twice and my experience from the prior evening was validated. both times the \"thing\" seemed to take no notice of me and therefore did not stop or do anything other than go on its way. i've returned to the places where i saw it and saw no evidence the \"thing\" had adversely affected the terrain. lastly, these events occurred w\\in 1 mile from each other."],"Date Submitted":"07/11/2009 12:00 UTC"}