{"Tags":"City","Case Number":"18492","Date of the Event":"08/04/2009 07:41 UTC","files":["/var/www/straped/mufon/html2text/18492.html.txt","/var/www/straped/mufon/more/18492_submitter_file1__ufo3.jpg","/var/www/straped/mufon/more/18492_submitter_file2__ufo1.jpg","/var/www/straped/mufon/org/18492.html"],"divs":["Sighting DetailsI parked my car at the boardwalk in Belmar N.J. Walked up onto the boardwork to take a couple of pictures at 7:41 a.m., of the sun reflecting on the ocean, I do this all the time when I'm working at the shore. I took 3 pictures, looked at them briefly and deleted one because the sun wasn't centered in the one pic, (the first one). Then got back in the car and drove to the house I was working on. About 2 hours later, I decided to look at the pics I took at that time, That's when I noticed a spot under the sun and over the horizon. I then zoomed in on the pics and relized I had caught a round object out there in the sky. I didn't see it when I shot the pics because of sun glare and the fact that I wasn't looking for anything. The pics were shot within a few seconds of each other. You can see that object is in a different position from each pic. I feel terrible that I deleted the one! But I do have 2. After seeing the pics I knew I had something that looked very different than an airplanes reflection or a planet or a boats light or reflection. Don't know what it is."],"Longitude":"-74.019384","Object Shape":"Sphere","Latitude":"40.187377","Disposition":"IFO","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-08052009-0008","Object Features":"Unknown","Source":"MUFON","Date Submitted":"08/04/2009 07:41 UTC","Object Flight Path":"Straight-line path","City":"Belmar","Viewing Distance":"Unknown","Region":"New Jersey","Summary":"Sphere shaped brite object above the horizon at the sea shore.","trends":["There have been 2 other sightings in Belmar","There were no other sightings in Belmar on or around August 4th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.187377,+-74.019384(18492)&iwloc=A&hl=en\"> mufon case (18492) map </A>"}