{"Source":"MUFON","Date Submitted":"08/05/2009 09:50 UTC","Tags":"City","Object Flight Path":"Path with directional change","trends":["There have been 5 other sightings in Grove City","There were no other sightings in Grove City on or around August 5th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.167618,+-80.08077(18501)&iwloc=A&hl=en\"> mufon case (18501) map </A>","Summary":"We saw a red light dart across the sky, turn around, rotate to show a white light , and dart in the opposite direction.","Date of the Event":"08/05/2009 09:50 UTC","Weather Factors":"Unknown","Log Number":"US-08052009-0017","Longitude":"-80.08077","Viewing Distance":"501 Feet - 1 Mile, Unknown","divs":["Sighting DetailsMy wife and I were driving on Rte 173 South toward Grove City, PA when we I saw a red light in the sky at the top of the hill near the intersection of George Jr. Rd. I thought nothing of it as the Grove City Medical Center (GCMC) is right up the road where they have Life Flight helicopters in and out frequently. As we crested the hill and rounded the bend near Gasper Rd., we both noticed the red light again. It was moving very quickly from West to East. It slowed and then began to turn as it ascended for a banked 180 degree turn. As it was turning, a white light appeared on the left side of the craft as if it were rotating clockwise to set itself up to speed off. It then moved very rapidly to the West. My wife and I lost sight of it behind the trees near the GCMC. We both looked at each other and asked each other if we saw \"it\". We both saw the same thing. My wife says she could see the shape of the craft similar to a \"stingray\" as she put it, or similar to the Stealth Bomber. She also thinks, but is not sure she saw a blue light on it as well. I only saw a red light on the right side and a white light on the left side. It moved very smoothly and quickly and I could not hear it at all."],"Case Number":"18501","Object Shape":"Boomerang, Chevron","Region":"Pennsylvania","Latitude":"41.167618","Sighting Duration":"Undisclosed","Country":"United States","Object Features":"Appendage(s), Louvres","files":["/var/www/straped/mufon/html2text/18501.html.txt","/var/www/straped/mufon/org/18501.html"],"City":"Grove City","Disposition":"Insufficient Data"}