{"City":"Santa Rosa Beach","Region":"Florida","divs":["sighting detailswe were standing on grayton beach at sunset watching the full mon rise and my mom asked what was in the sky, we saw 4-5 lights moving in front of distant clouds high over the ocean, at first it appeared to be airplanes\\helicopters because they would sometimes make a formation but they began to move sporadically and then multiplied into about 9 lights and also a sort of 'bobbing' orange light. as they moved across the sky they went from 4 lights to 6 to 9 then to 1 large fire ball that streaked with trailing sparks and then they all disappeared and the fireball left a 'smoke' trail. we were pretty freaked out about it because there was no explanation and the movements were too fast to be planes at that distance. by the time we had sense to take a picture the lights had formed one ball and the photo shows the ball (small light right in middle of photo, taken with iphone) right before it exploded and trailed off to the left."],"Date Submitted":"08/05/2009 07:45 UTC","Summary":"moving lights and fireball","Object Features":"Undisclosed","trends":["There have been 2 other sightings in Santa Rosa Beach","There were no other sightings in Santa Rosa Beach on or around August 5th 2009","This sighting has never been favorited.",""],"Object Shape":"Star-like","Log Number":"US-08052009-0018","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/18502.html.txt","/var/www/straped/mufon/more/18502_submitter_file1__IMG_0871.JPG","/var/www/straped/mufon/org/18502.html"],"Date of the Event":"08/05/2009 07:45 UTC","Source":"MUFON","Weather Factors":"None","Tags":"City","Disposition":"Unknown","Latitude":"30.396032","Longitude":"-86.228832","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.396032,+-86.228832(18502)&iwloc=A&hl=en\"> mufon case (18502) map </A>","Case Number":"18502"}