{"Date Submitted":"04/27/2009 02:55 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.87275,+-111.75866(18510)&iwloc=A&hl=en\"> mufon case (18510) map </A>","Case Number":"18510","Source":"MUFON","Object Shape":"Flash","Viewing Distance":"Unknown","City":"Sedona","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around April 27th 2009"],"Country":"United States","divs":["Sighting Details3.5second long flash While driving to Sedona Arizona southbound from Flagstaff the flash appeared in front of the vehicle. After realizing it couldn't be an oncoming vehicle because the light was different, it brightened the area like a glowing beam and seemed to move south east. I asked others in the vehicle if they saw that, they confirmed, as did others in the caravan after reaching Sedona. It disappeared. It just happened like anything else that day, but being a special day (occuring during the return of the ancestors gathering), it felt like a key to reality itself. I just kept driving, sober, alert, and with no increased tension. There was another flash the next evening the 28th, 5:09PM in another part of Arizona heading back to Dead Horse Ranch from Crystal peak sort of near Safford. It almost seemed like it was coming from a hardware store rooftop ruffled sheet metal overhang. Perhaps it was coming from the space betwixt the air itself in that direction. Me and my passenger felt like it was just another run-o-the-mil otherworldly occurance that week. This was the same kind of flash but it was only two seconds and didn't seem to change direction. EACH FLASH SEEMED TO COME FROM A BUILD UP OF SOME SORT, I ALMOST GOT A SENSE THAT IF THEY DIDN'T OCCUR I COULD HAVE GOTTEN A TERRIBLE NERVE PINCH IN MY NECK AND CRASHED THE RENTAL VAN."],"Date of the Event":"04/27/2009 02:55 UTC","Latitude":"34.87275","Object Features":"Undisclosed","Weather Factors":"Unknown","Summary":"Near blindingly bright flash of light that didn't hurt the eye at all, compared to meteorite landing.","Log Number":"US-08062009-0008","Region":"Arizona","files":["/var/www/straped/mufon/html2text/18510.html.txt","/var/www/straped/mufon/org/18510.html"],"Tags":"City","Object Flight Path":"Undisclosed","Longitude":"-111.75866","Disposition":"Unknown"}