{"Object Flight Path":"Path with directional change","Source":"MUFON","Region":"West Virginia","Log Number":"US-08072009-0001","Tags":"City","Case Number":"18517","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.271622,+-81.553004(18517)&iwloc=A&hl=en\"> mufon case (18517) map </A>","files":["/var/www/straped/mufon/html2text/18517.html.txt","/var/www/straped/mufon/more/18517_submitter_file1__Diagram.jpg","/var/www/straped/mufon/org/18517.html"],"divs":["Sighting DetailsThis is almost identical to what the three Navy vets from Floyd county, Virginia saw. I was out walking the dog, looking skyward, and spotted what I thought to be a satellite passing overhead, not unusual, I thought. It was moving straight from south to north until it reached approx. 45 degrees of the horizon. At that point, it made an abrupt u-turn and came back a short distance alongside it's original track. I became very excited, naturally, and was thinking \"this is it and it cannot be explained away\". The object appeared to make some short moves to the northwest and southeast, then either stopped or disappeared. If it stopped, I couldn't discern it from the stars. I was very excited, my wife was on the porch but wasn't able to see due to lights and I couldn't get her to join me in the yard. At that time, I reported it to Brian Vike, where I have reported other objects similar to those posted on MUFON this year. I regularly watch for the ISS and Shuttle, and also spot satellites and Cosmos or other rocket bodies. As far as I know, satellites and space junk do not make abrupt u-turns."],"Date of the Event":"05/28/2009 11:28 UTC","Latitude":"39.271622","trends":["There have been 7 other sightings in Parkersburg","There were no other sightings in Parkersburg on or around May 28th 2009","This sighting has never been favorited.",""],"Object Shape":"Star-like","Object Features":"None","Country":"United States","Weather Factors":"None, Does Not Apply","Summary":"Satellite made a u-turn, then either stopped or disappeared. Same as the three Navy vets reported from Floyd county, Virginia.","Disposition":"Unknown","Viewing Distance":"Over One Mile","City":"Parkersburg","Date Submitted":"05/28/2009 11:28 UTC","Longitude":"-81.553004"}