{"files":["/var/www/straped/mufon/html2text/18514.html.txt","/var/www/straped/mufon/org/18514.html"],"Region":"Connecticut","Date of the Event":"02/29/1988 12:00 UTC","Log Number":"US-08062009-0012","Longitude":"-73.354216","Tags":"City","trends":["There have been 2 other sightings in Westport","There were no other sightings in Westport on or around February 29th 1988"],"divs":["Sighting DetailsI had gotten out of Catechism class at St. Luke's in Westport, and everyone else had gone home, while I waited for my parents to pick me up. They were late, and being bored, and an amateur astronomer, I decided to do some naked eye astronomy. While I was looking up, a diamond shaped array of lights appeared over the steeple and slowly flew overhead. The configuration was a white light in the nose, a while light in the tail, and two red lights, one on the left, and one on the right. As it flew overhead, it seemed to be only a few hundred feet up at most. The dark area between the lights occluded the stars as it passed. There was no engine noise or any noise at all, it was perfectly silent. I kept watch on the object as it crossed the parking lot, and at one point I could see far above a passing passenger jet, with its white, green and red running lights and its engine noise; which was quite a contrast to the UFO's silence and unorthodox running light configuration. Eventually the object disappeared behind the trees on the other side of the parking lot. The whole passage of time was short, a minute, maybe two. The object was not moving very fast. I've been an amateur astronomer for years, and have engaged in telescopic and naked-eye astronomy. I'm also an airplane spotter, and am quite familiar with most aircraft; and their lighting configuration. This object was not like any aircraft I have ever seen. It was not a simple light in the sky, a meteor, planet, or balloon. It was a solid object that occluded the stars with its dark body. I've never reported this sighting to any UFO agency before, and only mentioned it to close friends for fear of ridicule. After hearing Stanton Friedman on Coast to Coast last night mention that few of the people who admit to seeing UFOs actually reported them, I decided that it was time to make a change. The only other object I've seen that behaved strangely could have been a meteor (though it didn't behave like any meteor); but this sighting was definitely of some sort of craft and worthy of reporting."],"Country":"United States","Weather Factors":"Unknown","Latitude":"41.142796","Summary":"Diamond shaped shadow and lights flew overhead at night","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.142796,+-73.354216(18514)&iwloc=A&hl=en\"> mufon case (18514) map </A>","City":"Westport","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"02/29/1988 12:00 UTC","Object Features":"Undisclosed","Disposition":"IFO","Case Number":"18514","Object Shape":"Diamond"}