{"Case Number":"18512","Object Shape":"Other","Date Submitted":"08/05/2009 08:45 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.471733,+-104.24553(18512)&iwloc=A&hl=en\"> mufon case (18512) map </A>","Country":"United States","Latitude":"34.471733","Summary":"Very large bright orange lights lighting up to the eastward like Knight riders front bumper","City":"Fort Sumner","Weather Factors":"Unknown","Object Flight Path":"Stationary","Log Number":"US-08062009-0010","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Fort Sumner","There were no other sightings in Fort Sumner on or around August 5th 2009"],"Date of the Event":"08/05/2009 08:45 UTC","Object Features":"Undisclosed","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/18512.html.txt","/var/www/straped/mufon/org/18512.html"],"Longitude":"-104.24553","Disposition":"Unknown","divs":["sighting detailsmy brother and i witnessed the most amazing thing i have ever seen in my 32 years of life!! ant 8:45 pm while coyote hunting 15 miles north of roswell, my brother said \"look at the ufo!\" due north was a horizontal string of lights around 10,000 ft up and around 60 miles away near ft. sumner area. the light were very large and very bright orange. the city lights of roswell could be seen to the south, and they were 1\\6 of the size of the lights we witnessed to the north. the lights were square\\oval shaped and lit up in an easterly direction (like the front of knight riders car, best explained)this lasted around 35 seconds then disappeared. 5 minutes later a fighter jet (from kirkland?) was seen scrambling to the area and headed east around 30,000 ft. i don't know what it was, but it was huge, and i did not believe until last night! i used to think people that came to visit roswell, and seen ufo's were idiots, not anymore. my brother was here visiting from antlers, oklahoma, he didn't believe in this stuff, but now he does. i'm still in shock from what i see. i have lots of experience with aircraft, astronomy. we cant make something that large fly."],"Source":"MUFON"}