{"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around October 2nd 1997"],"Date of the Event":"10/02/1997 12:00 UTC","Log Number":"US-08062009-0011","City":"Indianapolis","Longitude":"-86.150024","map":"<A HREF = \"http://maps.google.com/maps?q=39.772366,+-86.150024(18513)&iwloc=A&hl=en\"> mufon case (18513) map </A>","Sighting Duration":"Undisclosed","Object Features":"Louvres","Country":"United States","divs":["sighting detailsfinished mowing the grass and was putting the riding mower in the barn when something caught my eye that was moving. this was a round ball which had three sections with faint glowing violet\\purple \"windows\". imagine a ball that is divided in four sections... the top forward section, top rear and bottom rear were faintly lit. the bottom rear section was not, and it could be seen against the light grey sky of twilight. what actually caught my eye was more of the unusual \"jaw\" or \"shutter\" looking device that was located on the bottom front section. this \"jaw\" was moving up and down in a \"mechanical\" type of rhythum. i estimate that this object was about a half a mile away from me. it appeared to be about 50 feet above the ground and was slowly moving above the treetops. i estimate that this object could have been moving at the most about 20 mph. my location was in the southeast corner of marion county west of acton, indiana and this object was moving east, very slightly southward toward the little town of acton. as it moved along, the \"shutter\" device was moving up and down and no details could be seen as far as the details or construction of either the moving jaw or the entire object. i first thought that this object was type of ballon until i was able to focus on the shutter moving and the silloutte against the grey glowing sky of indianapolis. at that time (1997) the southeast corner of indianapolis was being newly developed and farmland was common. the object was moving toward less populated areas to the east and tha darker regions allowed this object more clarity. my feelings were that of \"awe\"... similar to my first sighting of a tornado. i finally lost sight as this object moved eastward out of sight."],"Latitude":"39.772366","Case Number":"18513","Summary":"Saw purple ball with moving shutter in Indiana.","Source":"MUFON","Object Shape":"Circle","Region":"Indiana","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Disposition":"Unresolved","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/18513.html.txt","/var/www/straped/mufon/org/18513.html"],"Date Submitted":"10/02/1997 12:00 UTC"}