{"Object Shape":"Fireball, Star-like","Date of the Event":"10/08/1998 09:30 UTC","divs":["Sighting DetailsI was in San Francisco on twin peaks looking over the East Bay area it was around 9-9:30 PM although the camera clock was set wrong the date was correct it was Oct 8Th 1998. Suddenly out of no where this star like fire ball appeared in the sky. It flew in circles and around the sky in various directions but no one new what it was. I have never seen anything like this before or since. At first I was scarred then I just wanted to get it all on film then I started asking people questions but no one really new what it was. I am from N.H. and have had several UFO sightings and of Holy Beings but I never had a camera until this time. I did not report this before now for no real reason I just kept it and would show it to friends now and then. No one has explained it yet. What do you think? I have many stories to tell about sightings with family and friends alike and also some I have had alone. I even have a memory from childhood being taken away. I never thought It really mattered if anyone really new or believed but I know from what I have seen there are most defiantly others with abilities higher than my own at this time. Although this may be true for most human beings there are some Holy Beings who are in human form and have abilities beyond your imagination. I am a Buddhist Monk and have met some of these Holy Beings and I still am communicating with them today. I have always known one day a Holy one would show me the way so I too can attain their abilities. Whether this video can be explained or not would be irrelevant because there has been so much more that none who have witnessed with me can explain. I think you will explain my video with no problem. But some unexplained phenomena is truly from the Holy realm. Best Regards From a Buddhist monk"],"Latitude":"36.784141","Region":"California","Date Submitted":"10/08/1998 09:30 UTC","Country":"United States","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.784141,+-119.412782(18529)&iwloc=A&hl=en\"> mufon case (18529) map </A>","Log Number":"US-08072009-0013","Weather Factors":"Fog, Medium","Summary":"Star like fire ball flying in circiules","City":"Undisclosed","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Viewing Distance":"Over One Mile","Tags":"City","Longitude":"-119.412782","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18529.html.txt","/var/www/straped/mufon/org/18529.html"],"Case Number":"18529","trends":[""]}