{"Object Shape":"Triangle","Country":"United States","Date of the Event":"08/04/2009 03:54 UTC","Sighting Duration":"00:01:00","divs":["sighting detailsmurrysville, pa: august 6, 2009 at 3:54 am. i had been asleep on my couch in the livingroom since we've seen so many ufos from that room, which is surrounded on 3 sides by mostly windows. we live in a quiet, heavily wooded rural area, with not many houses, in a bowl-shaped valley near the top of a really high hill (or small mountain). my sister and niece from colorado were at my vacation place at the river. since the first night here last thursday night when my niece witnessed an orange-ish\\red ball of light whiz past the window, she doesn't want to stay here anymore. i admit, i was home ufo hunting that night since being called by a guy in irwin, pa who's filmed a replicating star-like ufo dropping orbs on several nights. http:\\\\www.youtube.com\\watch?v=bzbgbfjmkyy he saw it again this night. i also saw a moving star-like\"dot\" about 30 degrees on the east side of my house on the 3rd around 11 pm, that responded to my laser pointer by increasing in size from a dot to the size of a nickel at arm's length in a split second! i should've started filming before doing so, because after i started filming, it didn't respond to it again and continued traveling south, fading out. also 'busted' the ufos pretending to be planes--finally caught them doing something weird--a white orb shot into one--caught on film, will post that also on youtube today hopefully. a blow up from that one revealed non-plane structures too. anyway, back to the story. i had only been asleep for about 2 hours. i awoke to a high-pitched \"heeeeeeee\" sound (not very loud, but i'm a light sleeper) and looked out the front window to see a craft with flashing lights not far above the treeline on the other side of the valley. the valley is approximately 500 feet to highest trees. it was travelling from east to west. even though i didn't have my glasses on, i grabbed the hdr-xr500 sony camcorder off the coffee table and ran to the patio door and opened it. the screen door was also closed and i did a face plant right into it, ripping the screen! started filming from the deck in same spot as my other videos. never heard a sound from the other ufos and wondered what this was. since i've filmed several other triangle type ufos around here, i figured i'll find out when i blow up some stills from the hd video, which is posted on my youtube channel: seeingufospa http:\\\\www.youtube.com\\watch?v=9su3nh1t3gc i've uploaded some stills here. there is a structure under the red light and a pole-type structure holding the upper white light that defies a conventional craft explanation. also, since it was travelling to the right, a green right side navigation light should have been visible. the right side white light has a small red ball light on it instead. i also just heard from someone in toledo, ohio who said they saw the exact same thing at around 1:30 am this morning (august 7th). by altoona, pa also--80 miles east of here. the cat had been next to me on couch but ran downstairs and hid for the rest of the night. it usually likes to go outside to hunt, but has been wanting to stay inside and sleep downstairs lately. i find it unusual for a 7 year old cat to change her habits like that. thunderstorms were the only things that would scare her into hiding downstairs before. nothing was turned on previous to the sighting so nothing strange detected there. the camcorder worked, obviously, except for some autofocus & manual focus problems when first filming (cut those out of video). the video would have been longer if not for those. the 'heeeeee' sound on video is almost like cicadas sound and sounds different than what my ears heard. you guys on the star team should bring some high tech equipment here and camp out while this area is still hot with sightings. a 24-hour watch--especially at night, should bring you some good sightings of your own within a week. weekdays seem to be best. never any sightings to speak of on the weekend nights, usually. you can \"bust\" the fake plane ufos here--but hey, they might be in your neighborhood too."],"files":["/var/www/straped/mufon/html2text/18525.html.txt","/var/www/straped/mufon/more/18525_submitter_file1__20090804035413_c11.jpg","/var/www/straped/mufon/more/18525_submitter_file2__20090804035413_c3.jpg","/var/www/straped/mufon/more/18525_submitter_file3__20090804035413_c12.jpg","/var/www/straped/mufon/org/18525.html"],"Object Features":"Undisclosed","Case Number":"18525","Date Submitted":"08/04/2009 03:54 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.433422,+-79.694275(18525)&iwloc=A&hl=en\"> mufon case (18525) map </A>","Latitude":"40.433422","Weather Factors":"Unknown","City":"Murrysville","trends":["There have been 31 other sightings in Murrysville","There was one other sighting in Murrysville on or around August 4th 2009","This sighting has never been favorited.",""],"Tags":"City","Summary":"Murrysville: Another weird TRIANGLE with flashing lights at 3:54 AM","Object Flight Path":"Undisclosed","Disposition":"Hoax","Log Number":"US-08072009-0009","Source":"MUFON","Viewing Distance":"Unknown","Region":"Pennsylvania","Longitude":"-79.694275"}