{"Tags":"City","Date Submitted":"08/07/2009 01:15 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/18524.html.txt","/var/www/straped/mufon/org/18524.html"],"Source":"MUFON","Case Number":"18524","City":"Toledo","Disposition":"Hoax","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=41.667358,+-83.546192(18524)&iwloc=A&hl=en\"> mufon case (18524) map </A>","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","divs":["sighting detailsi live in the country side of toledo, ohio and my friends and i were on our way home for the night at 1:15 am on august 7, 2009. we were driving east on st. route 579 and we were actually talking about ufos and aliens. we saw some bright lights in the sky off in the distance straight ahead of us. we didn't think too much of it but we kept an eye on it since we were already watching the skies. we began to notice this object was coming straight at us, and it was very large. there were two visible white lights to the left and right sides of the craft, and one light in the middle and higher up, making a triangle. it was flying very low to the ground, we are guessing 500-700 feet in the air. we turned left onto reiman road and the craft was still coming straight at us since the road curved back to the same direction we were heading. i stopped the car and opened up my sunroof while my friends michael and aaron stuck their heads out the window to get a better look. the craft was very large and was triangular shaped and was moving at a steady course at approximately 75 mph. it was completely silent. it flew directly over us. we tried to get it on camera or video with our phones but we were in complete awe. we couldn't take our eyes off it to even handle our phones. it looked similar to a stealth bomber at first, but it was much larger and flying way too low and silently and slow to be one of those because i've seen those before and trust me this was nothing from this world. as it passed over us we then saw a glowing red light that was pulsing. aaron suggested maybe it was a plane because of the light, however, there was no white blinking light that most planes have on their wings. it looked like it began to pick up speed and the road we were on turned left. we were then traveling north as the craft was to the left of us traveling west. we were keeping up with it but after about thirty seconds we lost sight of it in the distance as we came up to some trees. we didn't see it again. michael went home and researched recent sightings and found a link posted on youtube of a ufo that looked exactly like the one we encountered. it was seen on the morning of august 4, 2009 just east of here outside of pittsburgh, pennsylvania. we know what we saw, and that video on youtube looks exactly like what we saw, except we had an even better look since it went right over us. http:\\\\www.youtube.com\\watch?v=9su3nh1t3gc&feature=channel_page this is exactly the kind of craft we witnessed."],"trends":["There have been 35 other sightings in Toledo","There were no other sightings in Toledo on or around August 7th 2009"],"Log Number":"US-08072009-0008","Summary":"Triangular UFO flying low and silently over Northwest Ohio countryside.","Country":"United States","Date of the Event":"08/07/2009 01:15 UTC","Sighting Duration":"00:04:00","Longitude":"-83.546192","Latitude":"41.667358","Weather Factors":"Unknown","Region":"Ohio"}