{"Weather Factors":"Windy","trends":["There have been no other sightings in Red Mountain","This sighting has never been favorited."],"Source":"MUFON","Date Submitted":"08/05/2009 03:00 UTC","Longitude":"-117.616726","files":["/var/www/straped/mufon/html2text/18526.html.txt","/var/www/straped/mufon/org/18526.html"],"City":"Red Mountain","Viewing Distance":"Over 1 Mile, Unknown","Sighting Duration":"Undisclosed","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=35.358297,+-117.616726(18526)&iwloc=A&hl=en\"> mufon case (18526) map </A>","Summary":"Saw unmanned aircraft then saw white circular UFO","Case Number":"18526","Country":"United States","Date of the Event":"08/05/2009 03:00 UTC","Object Features":"Other","Latitude":"35.358297","Object Flight Path":"Unknown","Region":"California","Disposition":"IFO","Log Number":"US-08072009-0010","Tags":"City","divs":["Sighting DetailsI am in the process of building a large radio controlled airplane so I decided to look for a dry lake bed to fly it off of. A friend from Randsburg suggested I try Cuddeback dry lake bed as it's only about 25 miles away. After driving 7 miles of dirt road ( off of highway 395 )I finally came to the dry lake bed. As I started to get out of my truck, something caught my eye. I looked up and saw an all white unmanned aircraft flying right above my truck and only about 200 feet high. It looked like a Global Hawk. I grabbed my camera but it was too late to get a picture of it. Since I had my camera out, I decided to take some pictures of the lake bed and surrounding mountains. I took a total of 5 pictures in about a 2 minute period. That evening when I got home, I downloaded the pictures and sent them to some of my friends. Then, later that night, I was reviewing one of the pictures and was startled at what I saw. I looked in the blue sky in the upper right corner of the picture and saw what looked like the moon. The problem was that the moon should not be in that location of the sky. So, I zoomed in on the object and couldn't believe what I saw. It's some sort of large circle with another circle inside of it. It almost looks like a petroglyph. Then, I looked at another picture and it has the same object but in a different location and farther away. If I were to go back to the lake bed with these pictures, I could easily see where these objects were taken. The pictures are great and have many mountains etc. for reference points. A good expert could easily tell the distance and heights of these objects. What bothers me is that I am 57 years old and have never seen a UFO or unmanned aircraft but on this day I see both in only a 2 minute period. A UFO, an unmanned aircraft and a miltary base just a few miles away. Scary! You have to see these 2 pictures! They are no joke and look awsome! Everyone who has seen them are baffled. After looking at your website, I don't know how to attach pictures but if you give me an e-mail address, I can send them."]}