{"map":"<A HREF = \"http://maps.google.com/maps?q=39.741654,+-104.975133(18533)&iwloc=A&hl=en\"> mufon case (18533) map </A>","Tags":"City","Source":"MUFON","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around August 7th 2009"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-08082009-0003","Object Flight Path":"Path with directional change","Summary":"Multiple bullet shapes all in a row; orange.","Object Features":"Unknown","Case Number":"18533","Region":"Colorado","Date Submitted":"08/07/2009 09:48 UTC","Object Shape":"Bullet, Missile","files":["/var/www/straped/mufon/html2text/18533.html.txt","/var/www/straped/mufon/org/18533.html"],"City":"Denver","Disposition":"IFO","Longitude":"-104.975133","Country":"United States","Date of the Event":"08/07/2009 09:48 UTC","Viewing Distance":"Unknown","divs":["Sighting DetailsThis evening my friends and I went to Cheesman Park to view \"Jurassic Park.\" My fiance went to a poker game instead, so I had put my phone on silent and left it by my side, so I could check if I had any calls. I checked my phone at 9:48 pm. About 30 seconds later, this extremely fast object shot across the sky. By guesstimate, probably 7-8 bullet shaped orange items all in a row. They almost looked like one object, not individuals - although it moved so fast I couldn't be sure. It just seemed to disappear as quickly as it appeared. It did not fade away. It just vanished. I was facing North (towards Colfax) and the item was far up in the sky, above the television monitor that was set up. The object moved from East to West. As it went to the West, it seemed to go higher in the air, as it vanished. The entire audience saw it and people were whispering, \"did you see that?\" and \"what was that?\" I thought that the bullet shaped items were too structural looking to be a comet, but I could be wrong. I would be very interested to know if this was a UFO or some naturally explained phenomenon. Thank you, Heather p.s. I used the term \"bullet\" because it was in the list of choices on the website. The bullet description seemed to fit the best out of all the choices, but I could be wrong as it was moving so fast, and I did not think to classify it's shape as I was viewing it."],"Latitude":"39.741654"}