{"Disposition":"Unresolved","trends":["There has been one other sighting in Geneseo","There were no other sightings in Geneseo on or around May 31st 1959"],"Date of the Event":"05/31/1959 03:00 UTC","Region":"Illinois","City":"Geneseo","Weather Factors":"None","divs":["Sighting DetailsI was approximately 12 years old living on a farm. My brothers and sister all slept in the basement in different rooms. One night I awoke in a strange room which was approx. 10'X10' with a two windows and \"door\" in one wall below which was a metal bench attached to the wall.There were really two windows with the door between them and two benches. The windows were slanted outward and into a hall way which appeared to be about four or five feet wide. In the room in which I found myself was a man, about 25 to 30 years old sitting on the metal bench with his legs spread and his head bent down looking between his legs at the floor. The door did not have a handle or means to open the door from what I could see or figure out. I was walking around the room trying to find some way which to get out of it thinking that I must be sleeping and dreaming as I did so and I would wake soon. About the time I turned toward the man and was getting ready to ask him why he was just sitting there a being which was so tall its head almost rubbed the ceiling walked past the window. The being was covered with reddish orange hair and was not wearing anything else. I was so afraid that I almost got sick however I though that if I was afaid maybe I could \"attack\" or at least appear to be dangerous so that the being would not come into the room. I jumped onto the bench then stepped onto the ledge in which the window was inset and started growling, scratching & pounding on the glass in an effort to show the being how \"dangerous\" I was. All the time while I was doing this the man in the room with me never moved or made a sound. The being walking past the window without even turning to look at me and I was so happy. I got down off the window frame and sat down on the bench. I do not recall anything after that point until I awoke in my bed at about 5 AM when it was time to get up and do the morning chores. I do not know who the man was, I had never seen him before nor did I ever recall seeing him again. I do not recall being taken to the craft nor returned from the craft to home. I do recall that I was wearing only my underpants, my normal sleeping wear while the man was wearing jeans and a plaid shirt."],"Latitude":"41.44809","map":"<A HREF = \"http://maps.google.com/maps?q=41.44809,+-90.154285(18532)&iwloc=A&hl=en\"> mufon case (18532) map </A>","Country":"United States","Object Shape":"Unknown","Log Number":"US-08082009-0002","Object Features":"Unknown","Summary":"\"Woke up in a holding cell aboard ship\"","Longitude":"-90.154285","files":["/var/www/straped/mufon/html2text/18532.html.txt","/var/www/straped/mufon/org/18532.html"],"Case Number":"18532","Sighting Duration":"Undisclosed","Date Submitted":"05/31/1959 03:00 UTC","Object Flight Path":"Undisclosed","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown"}