{"Case Number":"18530","Summary":"3 bright white light's evenly spaced pulsating then strobbing or ripple effect","Disposition":"Unknown","divs":["Sighting Detailsaround 9:30p.m.I was sitting in my back yard looking south when I noticed 3 bright white lights moving slowley to the south. At first I thought it was a plane either taking off or landing at hobby airport which is app.10to15 miles from my location.But as I watched, the lights began to pulse in unison and then started to strob or a ripple like effect like a police car. it was no airplane because there were no navigation lights on what would be the wings or fusalage. All the while the 3 bright light's nevermoved like they were part of a solid object.It looked like a rectangle from my vantage point.I noticed the object turn more to the south south east.All the while the light's never stopped pulsating and strobbing.The object moved slowley because I watched it for about 3 min. Before disappearing behind my neighbor's roof line.I am curiouse if anyone else noticed it.I do not think it was a plane, at least a conventional plane, because of the lack of navigationl (green and red)light's.I can draw it or be willing to talk about it with someone.I've had several sighting's over my 52 yrs. of life so I wasn't scared just really curious. You can contact me by phone or e-mail if you like. This happened wendsday night 8-5-09."],"Object Shape":"Square, Rectagular","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=29.762163,+-95.36436(18530)&iwloc=A&hl=en\"> mufon case (18530) map </A>","Longitude":"-95.36436","Date of the Event":"08/05/2009 09:30 UTC","Date Submitted":"08/05/2009 09:30 UTC","Sighting Duration":"Undisclosed","City":"Houston","Object Flight Path":"Path with directional change","Source":"MUFON","Viewing Distance":"Over One Mile","Country":"United States","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around August 5th 2009"],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/18530.html.txt","/var/www/straped/mufon/org/18530.html"],"Latitude":"29.762163","Tags":"City","Region":"Texas","Log Number":"US-08072009-0014"}