{"Latitude":"37.743333","Disposition":"Hoax","Case Number":"18553","trends":["There have been 2 other sightings in Yosemite National Park","There were no other sightings in Yosemite National Park on or around August 22nd 2008"],"Longitude":"-119.575833","Tags":"City","Object Shape":"Triangle","Log Number":"US-08092009-0003","Sighting Duration":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Weather Factors":"Unknown","Region":"California","Country":"United States","Date Submitted":"08/22/2008 08:43 UTC","City":"Yosemite National Park","Date of the Event":"08/22/2008 08:43 UTC","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18553.html.txt","/var/www/straped/mufon/org/18553.html"],"Summary":"just like ones now on Examiner site - triangle beautiful blue circles","divs":["Sighting DetailsI was out on Glacier Point in Yosemite, actually I can't remember the exact date. I believe it was a Monday or Teusday. We had gone up to show how beautiful it was to my son's fiance. We were actually laying down on the rocks right near the point. There were a thousand stars out the sky was so clear but I am sure I would have never seen it. My son has always been an \"eagle eye\" He said look at those three jets flying in a perfect V. I knew immediately what it must be. I stood up and looked. I said. those are not jets that's a UFO and it is what people have been seeing all over the world. We were so awestruck. I was impressed with the beautiful blue color. It remeinded me of phosphoresence I had onc seen in the ocean. There was a jet tailing it very closely. Then I thought maybe the jet was projecting an image, and I said that. My son said no it's blocking out the stars behind it. I am pretty familiar with Yosemite and I calculate it was 60 miles away and flying the same height 40.000 feet that jets travel. It took just a few minutes to go from the left side (this would be as far left of Half Dome till your vision is blocked by the moutain) and then we watched it till it went out of site to the far right. My son said it looked like it was several footbal fields in size. It was certainly much much bigger than the jet. We just didn't say much, we were so stunned. None of us had ever seen anything like this before. I have always believed people that say they saw something but my son is a complete skeptic and was not a believer at all. I think he would rather forget he saw anything. There was another family up there at the same time. We didnt' talk to them and when we left the point it was a little scarey walking back as there really are bears and mountain lions up there and I was just hoping nothing strange would happen."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.743333,+-119.575833(18553)&iwloc=A&hl=en\"> mufon case (18553) map </A>"}