{"Object Flight Path":"Path then hovering","files":["/var/www/straped/mufon/html2text/18550.html.txt","/var/www/straped/mufon/org/18550.html"],"Sighting Duration":"Undisclosed","trends":["There have been 21 other sightings in Queen Creek","There were 2 other sightings in Queen Creek on or around August 8th 2009"],"Weather Factors":"None","City":"Queen Creek","Viewing Distance":"Over One Mile","Source":"MUFON","Case Number":"18550","Date of the Event":"08/08/2009 08:05 UTC","Object Features":"Unknown","Tags":"City","Latitude":"33.253414","Country":"United States","Summary":"red light traveling very slow from west to east then south to north","Disposition":"Unknown","divs":["Sighting Detailsa red light that appeared to be a tail light from a plane taking off from williams gateway airport, formerly williams afb flew over my laft shoulder as i was walking my dog from west to east. I didnt pay much attention at first, but thought it was odd that the light wasn't flashing. I kept on walking looking from time to time as it went over me to the towards tucson. as it got further away i started thing that something didn't seem right. It was still bright red and now appeared to have stopped moving, it just stayed in one fixed position for about 10 minutes. as i turned to make my way home, i kept on looking back to see if was still there, as i reached my house, i put the dog inside and called for my wife. she came out as did my father, we stood and watch it for 10-15 more minutes it did start moving again only this time it headed north at a very slow rate of speed, i came in the house to call mufon but couldn't and but the time i got back outside it had started head east again and then shortly there after faded out as the light got smaller. any ideas as to what this may have been? any other reports?"],"Longitude":"-111.632499","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=33.253414,+-111.632499(18550)&iwloc=A&hl=en\"> mufon case (18550) map </A>","Log Number":"US-08082009-0020","Region":"Arizona","Date Submitted":"08/08/2009 08:05 UTC"}