{"Object Flight Path":"Undisclosed","Log Number":"-08092009-0008","Date Submitted":"07/25/1991 08:15 UTC","City":"New Braunfels","Case Number":"18558","Date of the Event":"07/25/1991 08:15 UTC","trends":["There have been 12 other sightings in New Braunfels","There were no other sightings in New Braunfels on or around July 25th 1991"],"Source":"MUFON","Latitude":"29.705982","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.705982,+-98.116313(18558)&iwloc=A&hl=en\"> mufon case (18558) map </A>","Longitude":"-98.116313","files":["/var/www/straped/mufon/html2text/18558.html.txt","/var/www/straped/mufon/org/18558.html"],"Weather Factors":"None","Disposition":"Unknown","Object Shape":"Triangle","Object Features":"None","Region":"Texas","Tags":"City","Summary":"Not Provided","divs":["Sighting DetailsHello, > > > > Not sure who this email will find, but i thought i would send an > > email out to talk to someone. First a little about myself, my name > > is William and i am 28 from New braunfels, born in San Antonio, > > raised in NB. I have lived all over the country, and at the age of > > 17 i joined the Marines, after getting out, eventually i came back > > home and started a beautiful family here in NB. Recently a local > > friend of mine here got me back into UFO's, as he told me of a > > incident that occurred with him late last year in Wisconsin while he > > was up there for the winter. As a youth here in NB I lived with my > > brother and mother. Just us three, and about every 18 months we > > would move locally here in NB. And while the incident i'm about to > > relay happened years ago it was and still is very vivid in my mind, > > especially since i actually own my home not 4 miles from where my > > incident occurred. In late July 1991, i was 10 years old, my little > > brother was 7 and my mother was 31. At dusk one evening i was out > > mowing the front yard, and at the time there was only 1 other home > > in the vicinity. Near the front corner of the yard, i looked up and > > about 300 yards away, and about 75 or so feet up above a livestock > > pond was a massive triangular shaped UFO. It had three red lights at > > each corner and what appeared to be a fourth light, going from what > > looked like the dead center to almost trailing it. I ran inside got > > my mother and brother and we stood there watching it move in circles > > around the perimeter of the pond, making no sound whatsoever and at > > times it seemed like you could almost make out the actual detail of > > the craft and what appeared to be some sort of running or cabin > > lights from time to time. As we stood there, we decided to get in > > the car and hop on the road that ran parallel with our home, and the > > craft was responsive to our driving, it started moving alongside us > > about 300 or so yards away parallel with us in the car, and this > > happened for roughly 5-7 minutes as it turned south towards San > > Antonio and instantly disappeared. > > > > Now i always have remembered this as did my brother and mother. And > > while i have told a select few i figured there was no real point in > > filing a report because it did happen 18 years ago. But recently as > > my friend has moved me to get more involved and active in what > > happened, i began to do some research, and up until this point i > > knew next to nothing about actual sightings and haven't been a big > > follower in the movement. But only recently did i realize that at > > the same point in time there was the same crafts appearing in larger > > numbers as you may well know in Belgium, and as i have read their > > stories from those incidents i too have realized that it appears it > > was the same or very similar style crafts. > > > > Well about 10 or so days ago, at the urging of my friend, we decided > > to go up to that pond so close to my home, and now there is about 5 > > or 6 newer homes on that cul-de-sac, but we parked at the end of the > > cul-de-sac and went up the little hill to where the pond is, and it > > is now drained,what looks to be for about a year or so, but then we > > noticed something in the pattern of the grass in what was the bottom > > of the pond, and in the middle in 3 semi distinct lines, sort of > > forming a triangle there is absolutely nothing or very little > > growing, now i'm pretty level headed, and realize its been nearly 2 > > decades, but my friend and i did find that to be unusual. We are > > skeptical it has anything to do with what i've seen years ago but > > nonetheless it was interesting, but probably nothing. > > > > I will close, as i stated in the beginning i am not sure if this has > > any bearing on what goes on know, but at least i thought i would > > share my story with an organization with the reputation and clout > > ya'll have, so thank you very much, > > > > > > William Locke > >"],"Country":"United States","Sighting Duration":"00:45:00"}