{"map":"<A HREF = \"http://maps.google.com/maps?q=34.421205,+-84.11908(1855)&iwloc=A&hl=en\"> mufon case (1855) map </A>","Longitude":"-84.11908","Summary":"Had a very close encounter with a Black Triagular","files":["/var/www/straped/mufon/html2text/1855.html.txt","/var/www/straped/mufon/org/1855.html"],"Disposition":"Hoax","Tags":"City","Object Flight Path":"Stationary,Other,Unknown","Weather Factors":"Unknown","Date of the Event":"12/15/2000 07:40 UTC","Date Submitted":"12/15/2000 07:40 UTC","Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Dawsonville","There were no other sightings in Dawsonville on or around December 15th 2000"],"Country":"United States","Case Number":"1855","Sighting Duration":"00:05:00","divs":["Sighting DetailsMy 11 yr. old son26 I were returning home from my mothers house in Dawsonville, Ga at approx7:40p.m. I was driving my truck down Shoal Creek Rd. I remember vividly tellingmy son that we needed to get home as this was a Sunday night26 he had to get a bath when we got home26 get ready for school the next day. Suddenly, we rounded a curve,26 to our amazement, there was this Black Triangle shaped craft right in frontof us about 50 yards at tree top level. It was really weird, the way it moved orfloated, almost like a puppett on a string or a floating leaf. The craftappeared to be positioned upright on its side. It was very black with dark blueflourescent lights at each corner. We could also see what looked like a marking.5B ll5D on the bottom right in the center of this thing. My son26 I could not beleive what we were seeing. I swerved off the road26 came to slight stop. We were both stunned, unable to talk. we just kind oflooked at each other26 then back to this craft. All of sudden, it was as if someone just flipped aswitch26 this thing disappeared right in front of our eyes. There was another car thatcame past26 it was if they did not see anything! Afterwards, on the way home, we wereboth dead silent the rest of the way home. As I pulled into our carport, Istopped the truck, turned it off26 just staired ahead for 5 - 10 minutes. I was then able to simply ask my sonif he saw what I did? He was adamant about seeing this too. Without furtherconversation I told him to go immediately inside26 draw what he saw26 I did the same. Then we swapped pictures26 compared. It was exactly the same, we had not talked about it the whole wayhome. Please respond to this in some way as I have had other experiences beforemy son was born. At least 2 different times. Once as a child, another as anadult. Me26 my wife saw some type of enteties one night at about 3:00a.m. PLEASE CONTACTME ASAP!!!Home Telephone is 770-664-1430Cell Phone is 404-862-9872Email is :TJakesx4@aol.comEmail #2 is : Jakeskeno3852@aol.com Respectfully submitted,TomJakes"],"Latitude":"34.421205","Log Number":"","Object Shape":"Triangle","City":"Dawsonville","Source":"MUFON","Object Features":"Patterned Surface","Region":"Georgia"}