{"Source":"MUFON","Tags":"City","Log Number":"GB-08092009-0013","Object Features":"Undisclosed","Object Shape":"Other","Summary":"unknown spectators at Red arrows display","Sighting Duration":"Undisclosed","Date Submitted":"08/09/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/18563.html.txt","/var/www/straped/mufon/org/18563.html"],"divs":["Sighting DetailsRed arrows display over our town today and it seems we were not the only ones enjoying there mental flying skills. three different types of unknown craft are in pics on my phone camera and two in my friends two of them ive seen befor in photos ive taken weeks apart. one looks like a giant sort of dragonfly at distance would be to big to fly if insectoid this is in previous pic on july 25th.two looks fuzzy very far off but plain to make out through arrows formation previously seen 5th august in pic more stuby fighter craft look from bs galactica not one of ours. three is new seems very far away in pic also and is night stick shaped similar to craft in STS88 stills if there not fake.friends cam picked up the other two first is bullit shaped with tail fin. silver and gold in colour and is passing through a formation or just in front not visible at the time but clear in the photo if they saw it they would have to take avoiding action.the last is very far awy high up and maybe triangular or boomerang type.the human eye seems easyly fooled most ufos go unseen until you see the pics things have been seen in the area most of my life here just not all at the same time but i am shure they whoever they are would enjy all types of displays as much as all of us!"],"Disposition":"Unresolved","City":"Plymouth","trends":["There have been 3 other sightings in Plymouth","There were no other sightings in Plymouth on or around August 9th 2009"],"Region":"England","Country":"United Kingdom","Viewing Distance":"Unknown","Latitude":"50.374326","Object Flight Path":"Undisclosed","Longitude":"-4.13328","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=50.374326,+-4.13328(18563)&iwloc=A&hl=en\"> mufon case (18563) map </A>","Date of the Event":"08/09/2009 12:00 UTC","Case Number":"18563"}