{"Country":"United States","Viewing Distance":"Unknown","Region":"Arizona","Sighting Duration":"Undisclosed","Longitude":"-111.75779","Date Submitted":"09/22/2008 09:45 UTC","Summary":"Two UFO's over Sedona, Arizona. One fairly still the other very active.","files":["/var/www/straped/mufon/html2text/18564.html.txt","/var/www/straped/mufon/more/18564_submitter_file2__068(54).jpg","/var/www/straped/mufon/org/18564.html"],"Log Number":"US-08092009-0014","Weather Factors":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsMy wife and I were on the patio of the Best Western Hotel Inn of Sedona just sitting and drinking coffee. My wife for whatever reason looked over her shoulder and saw an object in the sky behaving strangely. When we first saw it we did not know what it was (we still dont). It was not a plane, helicopter, star, or planet. It was moving and changing its shape and colour in all directions, including moving towards us and away from us. We also saw another object which was always south east of the main object, further away and had more colours on it. I got my Camcorder and filmed non-stop for about an hour, and was concentrating so much at the time on filming, that it was only this year when I got round to downloading the DVD and watching it I realised the significance of what I had. The following night I again used the DVD, but this time the main object was not there, but the other smaller one was, it was also in the same position. On the first night we did not lose sight of the objects, but after holding the Camcorder for an hour or so in the same angled upright position I could no longer continue to film them. I enclose a sketch of the event, and two photos taken from the DVD."],"Date of the Event":"09/22/2008 09:45 UTC","Object Flight Path":"Undisclosed","City":"Sedona","Object Shape":"Boomerang, Bullet, Missile, Cigar, Circle, Cylinder, Disc, Sphere","trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around September 22nd 2008","This sighting has never been favorited.",""],"Tags":"City","Disposition":"Unknown","Latitude":"34.87169","map":"<A HREF = \"http://maps.google.com/maps?q=34.87169,+-111.75779(18564)&iwloc=A&hl=en\"> mufon case (18564) map </A>","Case Number":"18564","Source":"MUFON"}