{"Region":"California","Log Number":"US-08092009-0017","trends":["There have been 28 other sightings in Irvine","There was one other sighting in Irvine on or around August 8th 2009"],"Source":"MUFON","Object Features":"Unknown","Longitude":"-117.786944","Tags":"City","Disposition":"IFO","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.685957,+-117.786944(18567)&iwloc=A&hl=en\"> mufon case (18567) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","divs":["sighting detailsi was walking in our local entertainment district in irvine, ca. with a friend, we were there eating\\shopping. we were headed towards the merry-go-round which was brightly lit up and i looked up because the moon caught my attention and i immediately saw the two objects. i told my friend to look up at them as well. they were probably at the height of a plane, we were near an airport, and they were distinct circles. the one on the left was white and seemed stationery and the one on the right was red. the red one kept moving like a back and forth motion towards the white one. it was cool to watch because i knew what it was. then my friend and i wanted to back away from the bright merry-go-round to look at it w\\out the brightness around us. so, we turned our heads for a moment to watch our step to back up and when we looked again they were gone. at first i thought it went in to clouds or something but there wasn't any. you could see the moon perfectly. it was my first ufo siting! i have been waiting for years to see one and finally did. awesome! as i drove home shortly after that i kept looking to the sky to see if they would reappear but no luck and i couldn't keep looking to the left as i was driving. i was so excited and wondered if they knew that we saw them. my other friend told me a while ago that she too saw a ufo(actual craft) above a super market parking lot in irvine also. but it was there for her not just in general. it paralyzed her momentarily and she couldn't walk to her car. it freaked her out!"],"Weather Factors":"None","City":"Irvine","Case Number":"18567","Date of the Event":"08/08/2009 10:17 UTC","Date Submitted":"08/08/2009 10:17 UTC","files":["/var/www/straped/mufon/html2text/18567.html.txt","/var/www/straped/mufon/org/18567.html"],"Object Shape":"Circle","Latitude":"33.685957","Object Flight Path":"Stationary","Summary":"2 Circular lights, one white, one red, separate because the red one moved towards the white back and forth."}