{"divs":["Sighting DetailsWas on the deck having a beer with my wife and sister-in-laws. We get a lot of airplane traffic and we like to identify planes. My wife pointed out the object and directed my attention to it. I looked to the south and east and saw a black object in the sky. Part of the object moved and hung low like an 's' shape. I was like what the heck is that?! What is that. I noted the time on my watch at 6:15 pm CST. The unusual shape peaked our interest and we grabbed the binoculars. It looked like a big black hanger drifting and floating. It would erratically change shape from a hanger like boomerang to a triangle and then back to a boomerang. It would undulate and become disc-shaped and then elongate into a cylinder with a big sphere on the end. We saw a southwest airline plane take off past it. The object would have been visible on their left side. It drifted higher and farther away while continuing to change shape. It went out of our line of sight and I went around to the front of the house with the binoculars it continued to drift and change shape. It was positioned about ten o'clock high and I gave it's location to my sister-in-law's fiance' over the cell phone and he saw it change shapes too. Based on it's drifting movement I think it could have been some sort of cylindrical balloon. I could see light through it as if it was segmented when it was 's' shaped. It floated off past the line of trees and out of my line of sight."],"Disposition":"Insufficient Data","Log Number":"US-08092009-0016","Object Shape":"Boomerang, Cylinder, Disc, Sphere, Triangle","Tags":"City","Date Submitted":"08/09/2009 06:15 UTC","Country":"United States","Region":"Minnesota","Object Features":"Undisclosed","Latitude":"44.892198","Case Number":"18566","Weather Factors":"Unknown","Viewing Distance":"Unknown","Source":"MUFON","Summary":"Saw black object cylinder shape changed to boomerang, triangle, s, disc, and sphere.","map":"<A HREF = \"http://maps.google.com/maps?q=44.892198,+-93.277202(18566)&iwloc=A&hl=en\"> mufon case (18566) map </A>","trends":["There have been 3 other sightings in Richfield","There were no other sightings in Richfield on or around August 9th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Undisclosed","Date of the Event":"08/09/2009 06:15 UTC","Longitude":"-93.277202","City":"Richfield","Sighting Duration":"00:15:00","files":["/var/www/straped/mufon/html2text/18566.html.txt","/var/www/straped/mufon/more/18566_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/18566.html"]}