{"Longitude":"-117.908869","Viewing Distance":"101-500 Feet","Weather Factors":"None","trends":["There have been 17 other sightings in Costa Mesa","There were no other sightings in Costa Mesa on or around January 6th 2009"],"Date of the Event":"01/06/2009 12:00 UTC","divs":["Sighting Detailsok well here it is! I had just recently came back to my school from an away basketball game. It was around 8 pm and me and a group of friends were walking to the varsity game at the gym when all of a sudden my friend is like holy sh*t! and we looked up we saw it.. It was a giant disc with a light that traveled across it and came back around( i can draw it better to describe it) and a red blinking dot at the bottm. It wasnt making any noise or anything it was hovering about 100 ft in the air! yeah that low! and was traveleing at a estimated rate of 5mph!I wasnt seeing stuff because all my friends saw it! And i called my friend and he told me he was at a stater bros like around a mile away and he said he saw the same exact thing. But i never heard anything on the news that night like really i dont know how people didnt see it! It was so low and was going really really slow. Like it was literally the most amazing thing i have ever seen like i mean why would it be flying so low? and why so slow? I awlays ask myself this and the explanation i can think of is... our government!!! well im going to the convention this month in costa mesa where it happened! I really just want to hear more people come out and say what they saw because i was astonished and im scared for life im never gonna forget it! if you can get back at me at caicedo_fernando@yahoo.com and i will respond!"],"Object Flight Path":"Hovering then path,Other","Date Submitted":"01/06/2009 12:00 UTC","Source":"MUFON","Latitude":"33.648332","Log Number":"US-08092009-0015","Summary":"It had a light that traveled acrossed it with red dont blinking at the bottom","Case Number":"18565","Region":"California","City":"Costa Mesa","Disposition":"IFO","Country":"United States","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18565.html.txt","/var/www/straped/mufon/org/18565.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.648332,+-117.908869(18565)&iwloc=A&hl=en\"> mufon case (18565) map </A>","Tags":"City","Object Shape":"Disc"}