{"Region":"Michigan","trends":["There has been one other sighting in Greenbush","There were no other sightings in Greenbush on or around August 6th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/18573.html.txt","/var/www/straped/mufon/org/18573.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.58778,+-83.31639(18573)&iwloc=A&hl=en\"> mufon case (18573) map </A>","Summary":"A bright orange circle appeared. It seperated into two, then leap froged across the night sky for a few seconds. It then reappeared and split into two again.","Log Number":"US-08092009-0023","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Hovering then path","City":"Greenbush","divs":["Sighting Detailsi was standing on the shores of lake huron with my family. we were watching the camp fire. we all saw it at the same time. i said \" oh my god, what is that!\" there was a large orange light or fire ball just over the lake. it split into two then leap froged across the night sky. it was around 10:30pm or so. after about 5 min or so it vanished. it reappered twice that night, but only for a few seconds. after the first sighting we saw many, thousands of small sparkles across the sky. not stars. they were much smaller. they disappated after a few minutes. while the small sparkles were showing, at least 2 planes flew into the area. they appeared to be fighter jets. there was at least 1 helicopter as well. a lot of unusual air traffic for sure.the jets circled the area for about an hour. this is very unusual for this area , for this time of night,mid week. the orange light apperaed the next night at the same time. it did not leap frog across the sky, but did split into two. it vanished after a few minutes. it did not reappear."],"Source":"MUFON","Disposition":"Unknown","Latitude":"44.58778","Date of the Event":"08/06/2009 11:00 UTC","Object Shape":"Circle, Fireball, Flash","Date Submitted":"08/06/2009 11:00 UTC","Weather Factors":"Unknown","Country":"United States","Case Number":"18573","Longitude":"-83.31639"}