{"map":"<A HREF = \"http://maps.google.com/maps?q=51.147789,+-100.049134(18579)&iwloc=A&hl=en\"> mufon case (18579) map </A>","Log Number":"CA-08102009-0005","Disposition":"Unresolved","Region":"Manitoba","Object Features":"None","Date Submitted":"08/02/2009 12:00 UTC","Object Shape":"Circle","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/18579.html.txt","/var/www/straped/mufon/org/18579.html"],"Sighting Duration":"Undisclosed","Country":"Canada","Latitude":"51.147789","City":"Dauphin","Longitude":"-100.049134","divs":["Sighting DetailsWe were at Dauphin lake. There were 6 of us that witnessed the actual event. I have it on video tape, although due to the camera not having been on night vision or anything like that, we are unable to see the object on the video. Although the audio of what happens works just fine. The UFO was a large orange light that was going the direction of the shore line, and then it stopped, and went off in the direction away from us. It moved very slowly before it shot off away from us. At a speed I've never seen a plane move at. Dauphin lake is not on any flight paths. The craft made absolutely no sound. We were all pretty shocked. No one suffered loss of time or anything like that though. It was simply just a sighting of well we don't know what. I live very close to the airport here in Winnipeg, and I've seen many planes fly over the house. They all make noise, if you can see them, you hear them. This was completely silent. There weren't even any animals making noises that night. It was silent but for all of us well freaking out. It was bright orange, not red like plane lights are red, white, blue even. This was definitely orange, and a lot larger than plane lights are. It wasn't a fire ball, there wasn't a storm, or any rain happening at the time of us seeing it. I can be reached at my email address and can forward you a copy of what the camera did have on it. I unfortunately do not know how to edit it to get whats on it to show up. I just know that the lens cap was not on when he was shooting the video. My husband had to run to the cabin to get the camera in the first place, but even though it said the cap was on, he had made sure it was not. It was extremely dark out at the lake that night. We were just sitting around by the camp fire. I'm unsure of who noticed it first, but once we noticed it, we were all looking at it. We knew it was not a plane, and well that makes it an unidentified flying object. It was orange, moved very slowly, came to a stop and shot off in a zig zag pattern away from us. Faster than any plane I've ever seen it was gone from our sight in a couple of seconds. Our reactions are all on the video audio. My feelings now are of this is important to tell people about. That something not normal does exist. Was that man made? I do not know, I'm leaving that up to professionals."],"Source":"MUFON","Case Number":"18579","Date of the Event":"08/02/2009 12:00 UTC","Tags":"City","trends":["There have been no other sightings in Dauphin","This sighting has never been favorited."],"Summary":"It was orange moved slowly did a 90 degree turn and sped off away from us.","Object Flight Path":"Stationary,Straight-line path","Viewing Distance":"Unknown"}