{"Object Shape":"Other, Unknown","Disposition":"Unresolved","Date Submitted":"08/09/2009 12:00 UTC","Case Number":"18574","Summary":"Invisible object seen travelling through clouds, leaving cloud trail behind it.","Longitude":"-88.206757","Weather Factors":"Unknown","divs":["Sighting DetailsI took my dogs out for the last time of the night. As I looked up at the sky to see what stars were visible, something I do every night, I noticed movement out of the clouds (which were wispy and numerous since we had an all day rain) slightly to the left of where I was looking. I never saw an object or any light source, but something moved out of the clouds at a high speed and made the clouds trail behind it, like a con trail. In fact, I saw the cloud trail forming behind the \"object\", but never saw the object. Normally, This could easily be explained by a plane or something mundane and I simply didn't have a view of the lights; however, this \"object\" made a right turn as it moved between the clouds. What's odd (and why I'm reporting this) was that the speed and angle it turned at. Since the object moved through the clouds, I have an idea on the height it was at. Not only was the object moving 4-5 times (at least) faster than a normal airplane, it made a 80 degree, sharp turn. The whole thing took less than 3 seconds and was completely silent. There were other breaks in the clouds, so I kept looking to see if the \"object\" continued its movement, but could no longer see it anywhere. It was as if it vanished. Don't know what it was, but it was pretty darn cool to see. I would compare the speed the object was travelling at to a fighter jet going full throttle, but that's a guess. Based on the height of the object and the trail it left behind it, I would guess it was the size of a car (but this is also a guess)."],"Date of the Event":"08/09/2009 12:00 UTC","Log Number":"US-08092009-0024","Object Flight Path":"Path with directional change","Object Features":"Unknown","Region":"Wisconsin","Viewing Distance":"Unknown","Latitude":"42.881403","City":"Big Bend","Source":"MUFON","Country":"United States","trends":["There have been no other sightings in Big Bend","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/18574.html.txt","/var/www/straped/mufon/org/18574.html"],"Tags":"City","Sighting Duration":"00:00:02","map":"<A HREF = \"http://maps.google.com/maps?q=42.881403,+-88.206757(18574)&iwloc=A&hl=en\"> mufon case (18574) map </A>"}