{"map":"<A HREF = \"http://maps.google.com/maps?q=34.050558,+-111.087521(18589)&iwloc=A&hl=en\"> mufon case (18589) map </A>","files":["/var/www/straped/mufon/html2text/18589.html.txt","/var/www/straped/mufon/org/18589.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"09/30/2008 12:00 UTC","divs":["Sighting Detailslate evening sometime in October,maybe in the early part of Nov of 2008. my long time girlfriend and I stayed up late. weather had been odd lately. she stepped outside for her cigarette. I stayed inside watching T.V. She called me outside,she seemed excited. I assumed I was going to see a falling star or something. We stood and watched a white ball hanging over the North east sky. at first it didn't seem to be moving. then we realized it was moving slow. as it got closer it changed into a red circle not a disc that was made up of small red spheres. seemed kind of large really. Didn't know what to think. it got closer overhead. it began to act as if it knew we were watching it.not sure if it really did know. shape changed again while I was uttering \"what the hell is that?\" it began to resemble a small cargo plane or a two engine passenger plane. I said oh it's just a plane. Although We had seen the shape change before that one for some reason this seemed logical. fuzzy headed really. I was shrugging it off and began to walk in. she stayed to watch ..just to be sure. The loud noise of a small plane engine suddenly came on. I said \"see it just a freaking plane.\" She was open mouthed \"saying no way,no way is that a plane\". I started acting cocky about it. I stood next to her again looking. making lame jokes. then it shot something green from the front end. it moved out fast like a rocket. the plane looking object stayed at the same speed for a about 3 seconds more then shifted into a straight line of white lights and caught up to the little green burning ball it had shot ahead of itself. then recollected into a small white ball. the grew a bit bigger all the while it moved slowly again toward the south east mountain line. the sound of the plane still present. almost as if the object forgot the sound behind itself leaving the sound over our house. then the object drifted behind the mountain line out of view. a month later a burning ball of white fire over those mountains appeared hovering. I saw it about 2 am while going to the bathroom I had an urge to look out the window. I went to the children's room to do that since their window is bigger. that is when I saw it. I watched it for about 5 minutes hanging there I was making sure it wasn't a star. then I ran down the hall to my Girlfriend asleep in our bed. I woke her up and had her follow me to the boys room to see. I got her fast it seemed like maybe 30 seconds to 1 minute at the most. she got there and the object was gone. later I read on an online article that we had a UFO crash here in the 50's or 60's."],"Region":"Arizona","Date of the Event":"09/30/2008 12:00 UTC","Latitude":"34.050558","trends":["There have been no other sightings in Flagg Staff","This sighting has never been favorited."],"Source":"MUFON","Longitude":"-111.087521","Log Number":"US-08102009-0015","Sighting Duration":"Undisclosed","Summary":"N.E. Sky, night. Seen unexpectedly. sphere. Changed shape.circle,changed shape,mimic shape of airplane (Cargo) loud sound. moved oddly for aplane. changed shape again,flew away over the mountain S.E.","Tags":"City","Disposition":"Unknown","Case Number":"18589","Object Features":"Unknown","Weather Factors":"Does Not Apply","Country":"United States","Object Shape":"Circle, Fireball, Sphere, Star-like, Other","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","City":"Flagg Staff"}