{"Log Number":"US-08102009-0009","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/18583.html.txt","/var/www/straped/mufon/more/18583_submitter_file1__IMG_0255.jpg","/var/www/straped/mufon/more/18583_submitter_file2__IMG_0254.jpg","/var/www/straped/mufon/more/18583_submitter_file3__IMG_0253.jpg","/var/www/straped/mufon/org/18583.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.252014,+-111.631879(18583)&iwloc=A&hl=en\"> mufon case (18583) map </A>","divs":["sighting detailslast evening as i was outside in my driveway talking to a friend on the phone, i looked in the sky to the north, and saw a very strange bright red light. it was moving to the northeast at a very slow rate, and was definately moving slower than any aircraft than i have ever seen. it seemed to flicker at times, but mostly was just a solid red\\orange glow. at about 10:15 the sphere seemed to flash a little, and then a smaller sphere (same color as first) dropped from the first sphere and slowly descended to the ground. i lost sight of the smaller one as it dropped over the horizon. at that point the main sphere began to move in a more direct northwest direction, still moving slowly, and then it appeared to ascend for a second or two, then flashed bright white and dissapeared completely. i couldn't exactly determine how far this thing was, but it appeared to be between 5 to 10 miles away, and about 4000 feet above the ground. to say the least, it was a very strange event, and i have never seen anything like it before. i have attached pictures to this report, but they are from a digital camera, and not very close to the object. hopefully other people in this area saw the object as well. my wife took the photographs."],"Tags":"City","Sighting Duration":"Undisclosed","City":"Queen Creek","Summary":"Bright Red Sphere moving slowly N/E then dropping smaller sphere.","Source":"MUFON","Latitude":"33.252014","Disposition":"Unknown","Object Shape":"Circle, Sphere","trends":["There have been 21 other sightings in Queen Creek","There were 2 other sightings in Queen Creek on or around August 9th 2009","This sighting has never been favorited.",""],"Date of the Event":"08/09/2009 10:00 UTC","Weather Factors":"None","Object Features":"None","Date Submitted":"08/09/2009 10:00 UTC","Country":"United States","Longitude":"-111.631879","Region":"Arizona","Case Number":"18583","Viewing Distance":"Over One Mile"}