{"Sighting Duration":"Undisclosed","Disposition":"IFO","divs":["Sighting DetailsI reported a sighting last week to the national MUFON site, of what I believe to be the same craft. It was in the same place in the night sky last night, and looked the same. I watched it for about 2 hours. It was a bright white light in the southern night sky, hovering. It looked to be in our atmosphere, very big. I called 4 of my neighbors out to see. Some cell phone video, and photos were taken. They looked very low quality. It was definately the biggest, brightest thing, not a star, not a plane. It was stationary. It got brighter at times, creating a halo effect. At it's brightest it looked bright white,cigar shaped, with a white aura. In my last sighting I didn't report it dimming, but it noticably dimmed this time. When dimmed it was still very bright, but looked more like three light balls, the center slightly higher than the sides, sort of chevron shape. It moved to the right and higher at one point. I never saw it move again. After that it stayed stationary. I came in and filed a MUFON report on the national site, and went back out to observe. I watched for about two hours, and that is all I observed. I called my friend, in Indianapolis, and she observed it. She also filed a report with MUFON. When I went to bed, I could look out the window, through the trees and still see the light hovering. I don't know how long it was there, either sighting."],"Case Number":"18580","City":"Undisclosed","Region":"Indiana","Country":"United States","Tags":"City","Longitude":"-85.593594","Latitude":"40.552326","Object Flight Path":"Stationary","Object Features":"Unknown","Weather Factors":"None","Viewing Distance":"Unknown","Object Shape":"Cigar, Chevron, Star-like","Date of the Event":"08/08/2009 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.552326,+-85.593594(18580)&iwloc=A&hl=en\"> mufon case (18580) map </A>","trends":[],"Summary":"Bright white light, southern, hovering, at brightest cigar shaped with light halo, dimmed looked like 3 light balls","Source":"MUFON","Date Submitted":"08/08/2009 10:30 UTC","files":["/var/www/straped/mufon/html2text/18580.html.txt","/var/www/straped/mufon/org/18580.html"],"Log Number":"US-08102009-0006"}