{"Sighting Duration":"Undisclosed","Latitude":"48.144077","Viewing Distance":"Over One Mile","Log Number":"US-08112009-0005","Date of the Event":"07/30/2009 04:00 UTC","Weather Factors":"None","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=48.144077,+-123.730876(18597)&iwloc=A&hl=en\"> mufon case (18597) map </A>","City":"Joyce","Date Submitted":"07/30/2009 04:00 UTC","Object Features":"Unknown","Source":"MUFON","Country":"United States","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"IFO","trends":["There has been one other sighting in Joyce","There were no other sightings in Joyce on or around July 30th 2009"],"Summary":"On July 30 2009 I was forced to sleep in my car with my wife. I noticed un unusually bright star in the southwest sky above Joyce WA. I watched the object for 2 hours.","Longitude":"-123.730876","files":["/var/www/straped/mufon/html2text/18597.html.txt","/var/www/straped/mufon/org/18597.html"],"divs":["Sighting DetailsOn July 30 2009 I observed an unusually bright star in the southwest sky above Joyce. I was forced to sleep in my car with my wife because there was no room to sleep in our friends trailor. I looked towards the sky, as I normally do, to look for UFOs around 4:00 a.m. and there it was a bright star like light, about as bright as Venus at its brightest. This was not Venus though because I identified it in another part of the sky. What caught my attention was that the light was slowly moving. At first it moved down. I ran into the trailor and got a pair of binoculars. This confirmed to me that this was a single light and definetely not a plain or helicopter. A helicopter would have ran out of gas after the more than two hours I watched it. My wife and I watched the object move all directions. But it seemed to go back in forth in the same general area of the sky. We kept asking ourselves what they could possibly be doing. It look as if it was collecting air or possibly gaining energy from something. We knew that this was either extraterrestrial life forms or a secrest government agency using extraterrestrial technology. No known craft could have been doing the things we witnessed and would not have been doing them. We couldn't tell how large the object was or far away it was because it just looked like a star. We were completely intrigued by the UFO and could not take our eyes off it for the rest of the night. The only reason we lost track of it was because the light of the sun. The UFO was above the Olympic Mountain range in WA state where there is a suspected top secret underground military base. Stewart WA"],"Object Shape":"Star-like","Case Number":"18597"}