{"Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"08/05/2009 12:00 UTC","Disposition":"Unknown","Latitude":"38.342033","Date Submitted":"08/05/2009 12:00 UTC","Viewing Distance":"Over One Mile","Case Number":"18590","City":"Ocean City","map":"<A HREF = \"http://maps.google.com/maps?q=38.342033,+-75.076326(18590)&iwloc=A&hl=en\"> mufon case (18590) map </A>","Longitude":"-75.076326","divs":["Sighting DetailsOn Aug 5, 2009 I was sitting outside on the dock organizing fishing gear for a trip the next day. This was around the White Marlin Open Tournament, I looked towards OC feris wheel and observed 3 lights in a triangular formation. I usually glance that way when outside at night. The lights appeared to move horizontaly at a very slow rate above the ferris wheel as a point of reference. I then went inside, and got my buddy and his wife. They too saw the lights. They thought it was weird. They thought it was a aircraft. Being familiar with aircraft I explained that those did not appear to be aircraft. I then thought they were military flares like the ones I have used, but the lights moved horizontally. After watching the lights for approx 20 min they faded out together. We all just looked at each other and shrugged our shoulders. We then went back to loading fishing gear when I looked back up to see the lights again in the same spot. The remained for about 10 min and dissapeared together. The night was clear with very little cloud cover. I was stunned to see something like that in Ocean City . I was reluctant to report this at first. The Inlet area was crowded, and thought somone else saw this too. I could not find any reports of this. However a few days later(Friday) I did see a military boat on a trailer at the commercial docks in West Ocean City. Maybe they are flares, but I just don't know .My wife thinks I am crazy!"],"Weather Factors":"None","Region":"Maryland","Log Number":"US-08102009-0016","Country":"United States","Object Shape":"Triangle","Tags":"City","files":["/var/www/straped/mufon/html2text/18590.html.txt","/var/www/straped/mufon/org/18590.html"],"trends":["There have been 16 other sightings in Ocean City","There were no other sightings in Ocean City on or around August 5th 2009"],"Source":"MUFON","Summary":"Triangular shaped orange lights","Object Features":"Unknown","Sighting Duration":"Undisclosed"}