{"Weather Factors":"Unknown","divs":["Sighting DetailsI HAVE ALLWAYS BEEN ON THE FENCE ABOUT THE SUBJECT TRYING TO STAY AS OBJECTIVE AS I CAN. BUT IN MY HEART OF HEARTS I DO THINK THIS IS A REAL PHENOMENOM.NOW I KNOW. I HAVE SEEN SOME CRAFT IN THE ARMY SO I CAN DIFFERENTIATE WHAT IS WHAT. I WAS IN FRONT OF MY HOUSE AND SMOKEING A CIGARETTE I SEE A CRAFT COMEING FROM MY WEST HEADING EAST NORTH EAST IT WAS MOVEING FASTER THEN NORMAL BUT NOT FAST ENOUGH FOR ME TO ASSUME IT WAS OUT OF THIS WORLD. YET!!! IT SUDDENLY TURNS HEADING BACK EAST TOWARD ME AND IT THEN PROJECTED TWO WHITE LIGHTS ONE ON EACH SIDE. THEY BOTHGO SEPERATE WAYS ONE NORTH ONE SOUTH.THENLIKE A FLASH OF LIGHTING APPEARS AND THE TO SMALLER CRAFT DISAPPEAR. I SWEAR ON MY CHILDRENS LIFES THEY DISSAPEAR I CALL MY WIFE OUT WHO THINKS I AM NUTS THEN THE LARGER CAFT MOVES NORTH SO FAST IF I BLINKED I WOULD HAVE MISSED IT COMES BACK TOWARDS ME AND THE SAME FLASH DISSAPEARS. I NOTICED A COMMERICAL PLANE OVER IN THE DISTANCE AND YOU COULD CLEARLY DISTINQUISH THE TWO TO BE DIFFERENT. IVE NEVER HEARD OF A SIGHTING HERE IN A HUGE POUPULATED AREA LIKE LONG ISLAND BUT IM TELLING YOU IT WAS CLEAR AS DAY. I HAVE NOTHING TO BENIFIT FROM TELLING MY STORY I DONT WANT MY NAME OUT THERE I JUST FEEL THIS WAS MY ONLY OUTLET TO TELL HE TRUTH. SORRY FOR MY SPELLING AND GRAMMER ERRORS I AM A BLUE COLLAR CONSTUCTION WORKER LOL."],"Summary":"WAS ROTATEING DIFFRENT LIGHTS.","Longitude":"-74.002753","Object Shape":"Star-like","Viewing Distance":"Unknown","Case Number":"18592","Country":"United States","Log Number":"US-08102009-0018","map":"<A HREF = \"http://maps.google.com/maps?q=40.722493,+-74.002753(18592)&iwloc=A&hl=en\"> mufon case (18592) map </A>","Date of the Event":"Unknown","Disposition":"Insufficient Data","Region":"New York","City":"New York","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around"],"Source":"MUFON","Latitude":"40.722493","Date Submitted":"08/10/2009 11:28 UTC","files":["/var/www/straped/mufon/html2text/18592.html.txt","/var/www/straped/mufon/org/18592.html"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed"}