{"Summary":"Yellow-orange star-like object move in a straight line across the night sky with no sound.","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","Case Number":"18593","Object Shape":"Circle, Sphere, Star-like","Date Submitted":"08/10/2009 10:25 UTC","Disposition":"Unknown","divs":["sighting detailsi was walking across my parking lot, from my car to the door, and i looked up and saw an orange-yellow bright object moving in a straight line across the sky from the west to the east. i have a tendancy to look up at the sky at night to look at the stars and the night sky. i was not alerted to it by any noise. i would describe it as being a bright, star-like circle or sphere. it moved fairly quickly and made no noise. it was calm outside, no wind, and no traffic on the near-by street or in the parking lot to drown out any possible noise. about a minute after we started watching the object, it began blinking a reddish-orange light, but this was not visible until it was quite a distance away, leading me to believe the blinking light was located directly on top of it. it still made no noise, and there were no other lights associated with it. it did not appear to be an airplane or helecopter, because those generally have white, green, and\\or red blinking lights. this object did not have any of that. i also could not identify a tail or rotating blades that i normally see with an airplane or helecoptor, even when spotted after dark. it was also very stable and smooth in its movement, meaning it did not appear to move side to side or up and down at all. it just went in a straight line. i'm not sure how high up it was, because all i could see was the sphere of light. when seen from a 90 degree angle, it was probably a quarter of an inch in diameter. we eventually lost sight of it over the trees across the parking lot."],"Log Number":"US-08112009-0001","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/18593.html.txt","/var/www/straped/mufon/org/18593.html"],"City":"Omaha","map":"<A HREF = \"http://maps.google.com/maps?q=41.254273,+-95.991308(18593)&iwloc=A&hl=en\"> mufon case (18593) map </A>","Longitude":"-95.991308","Weather Factors":"None","Source":"MUFON","Object Features":"None","Sighting Duration":"00:01:30","Date of the Event":"08/10/2009 10:25 UTC","Region":"Nebraska","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around August 10th 2009"],"Latitude":"41.254273"}