{"map":"<A HREF = \"http://maps.google.com/maps?q=36.333012,+-119.95208(18596)&iwloc=A&hl=en\"> mufon case (18596) map </A>","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-08112009-0004","Object Flight Path":"Path with directional change","Case Number":"18596","Weather Factors":"None","Longitude":"-119.95208","files":["/var/www/straped/mufon/html2text/18596.html.txt","/var/www/straped/mufon/org/18596.html"],"divs":["Sighting Detailswhile driving north on hwy 41 in Kings county north, close to Fresno county line and about 10 miles south of Lemore NAS... I saw light as i was driving north in my car and those lights looked from a distance to be dancing and moving in a circular fashion... flying vertically and 'dancing' with each other in a circular fashion...lights i saw were two of them on each ufo and the color was there...one on each side for each ufo.... they would dance around in vertical fashion and move herky jerky in a circular flight path.... not a smooth flight path but quick movements and vertical to horizontal etc and back and forth...etc. awesome.... In conclusion, i feel that the ET ufo were waiting for me and put on a show for me at the time..I opened the window on the passenger side and waved to the lead craft. As soon as i waved to the lead craft the lead craft turned on another lite in the center of the craft and it was a large circular white light, pointed directly at me. I smiled and greeted the craft with my meditation. The two craft then left the area. They seemed to join together and flew off north or up toward the NAS. They became one light and flew away. the whole experience lasted about two minutes..."],"trends":["There have been 3 other sightings in Lemoore","There were no other sightings in Lemoore on or around August 8th 2009"],"Object Features":"Unknown","Summary":"two craft...withh lights on each end....i did not see any craft only lights..","Date Submitted":"08/08/2009 09:45 UTC","City":"Lemoore","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"IFO","Tags":"City","Latitude":"36.333012","Region":"California","Source":"MUFON","Date of the Event":"08/08/2009 09:45 UTC"}