{"Object Shape":"Circle, Flash, Star-like","Object Features":"Undisclosed","Source":"MUFON","Latitude":"38.629642","Summary":"Bright, flashing object - bright enough to be seen when other stars can't be seen.","Object Flight Path":"Other","City":"St Louis","Date of the Event":"08/11/2009 04:30 UTC","Longitude":"-90.189544","Disposition":"Hoax","Weather Factors":"Unknown","divs":["Sighting DetailsI woke up at approximately 3:30 am and couldn't go back to sleep (not an unusual occurrence for me). I looked at my window, and through a crack in one of the blinds, I noticed what appeared to be a very bright star. This was interesting to me, because I live in a highly populated city and I never see any stars at night (and I have looked). I looked at my window and there was a very bright, small object that looked quite far up in the sky. When I saw it through my window, I thought it was a star, but when I looked more closely, I thought it might have been a plane because it was flickering and changing colors. I mean, BRIGHTLY changing colors. Red, blue, white, yellow...I've never seen a plane do that before. It also appeared to move a little,in small circles, but I couldn't be sure. It also appears to glow brightly and then fade within the space of a few minutes. If this is a star, I have never seen a star behave or appear that way before. My city is so well-lit that I can never see stars at night - I am skeptical that this is star. Perhaps it's a satellite or something, but I felt scared and nervous and disbelief at the sight of this object. I just looked at my window and the object is still there, flickering away."],"Case Number":"18598","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around August 11th 2009"],"Region":"Missouri","map":"<A HREF = \"http://maps.google.com/maps?q=38.629642,+-90.189544(18598)&iwloc=A&hl=en\"> mufon case (18598) map </A>","Tags":"City","Log Number":"US-08112009-0006","files":["/var/www/straped/mufon/html2text/18598.html.txt","/var/www/straped/mufon/org/18598.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"08/11/2009 04:30 UTC","Country":"United States"}