{"Viewing Distance":"Unknown","Date of the Event":"08/11/2009 10:40 UTC","Disposition":"Unresolved","Log Number":"GB-08112009-0010","Weather Factors":"Unknown","divs":["Sighting DetailsI went outside at about 10.38 pm because apparantly there were going to be shooting stars that night. After a minute or two i noticed a bright blue light above the opposite hill. I assumed it was a light in a house. After a while i realized it couldnt be on the house, it was too high and it just didnt look right. It started to move in a straight line in my direction and as it came closer i noticed two things- What i could see was a bright blue light, sphere shaped. Also the noise this thing was emmitting, it was like heavy machinery, a drill perhaps. This was all very strange so I ran inside to get a torch, to have a better look. I couldn't find one so I went back out, but by this time the ufo was almost gone. I could still see and hear it though. After about 15 seconds, it was gone. I was eager to find out what it could be, the glowing blue light(which didnt blink btw) and strange,grinding,sound had got me thinking this wasnt any normal aircraft. When I went back inside I felt quite scared, I thought maybe an alien was coming to get me!"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.948947,+-3.391463(18602)&iwloc=A&hl=en\"> mufon case (18602) map </A>","Region":"Wales","Object Features":"Undisclosed","Summary":"Saw it hovering above hill and as it came closer I heard a loud noise like a drill. It is a bright blue light.","Source":"MUFON","Country":"United Kingdom","Longitude":"-3.391463","files":["/var/www/straped/mufon/html2text/18602.html.txt","/var/www/straped/mufon/org/18602.html"],"Object Shape":"Sphere","Sighting Duration":"00:01:20","Tags":"City","trends":["There have been no other sightings in Brecon","This sighting has never been favorited."],"City":"Brecon","Date Submitted":"08/11/2009 10:40 UTC","Latitude":"51.948947","Case Number":"18602","Object Flight Path":"Undisclosed"}