{"Log Number":"US-08122009-0005","Source":"MUFON","Longitude":"-83.402523","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was at fiends house in waterford mich. less than 2mi from the airport. We had been playing croquet and we were sitting on the deck talking. I looked up and noticed a stationary object in the sky. I usually keep an eye to the sky. I called everyones attention to it, there were four of us at the time. It was clearly not moving, there were trees near enough to the line of sight to judge by. We watched it for 5 or 6 minutes and it never moved, we started to think it could have been a star or planet but we were looking almost due north, I knew it was not a planet. There were a few very high clouds and one was drifting toward it. I thought this would give us a reference to its height. When the cloud reached it, we could see that it was lower than the cloud. The main part of the cloud passed over and we could see that the lower, wispier parts of it were below the object. I am not a good judge of distance. A northwest jet passed over (orange tail) and I would say it was about half as high as the object. I went to the car and got my binoculars, we passed them around and all agreed it was a round object. It finally started drifting to the east, almost across the wind, then it would move north. It zig-zagged like that for while until it was behind the trees and we lost track of it. It could have been a weather balloon but that does not explain it remaining stationary for so long. It sort of made me feel happy to see it, like it was beneficent or something."],"Summary":"bright white (luminous?) appeared elongated but was round through binoculars","Date of the Event":"08/11/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.700384,+-83.402523(18617)&iwloc=A&hl=en\"> mufon case (18617) map </A>","Latitude":"42.700384","City":"Waterford","Region":"Michigan","files":["/var/www/straped/mufon/html2text/18617.html.txt","/var/www/straped/mufon/org/18617.html"],"Disposition":"Unknown","Country":"United States","trends":["There have been 7 other sightings in Waterford","There were no other sightings in Waterford on or around August 11th 2009"],"Date Submitted":"08/11/2009 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"18617","Weather Factors":"None","Object Flight Path":"Hovering then path","Object Shape":"Sphere","Tags":"City"}