{"trends":["There have been 6 other sightings in The Woodlands","There were no other sightings in The Woodlands on or around August 11th 2009"],"Weather Factors":"Unknown","City":"The Woodlands","Disposition":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsWe were outside watching for meteors as it's supposed to be a fantastic display tonite. I saw a diamond or triangular moving shape in the sky - there were no lights on it, but it seemed to blocking out the starlights behind it - it seemed to be very high in the sky. At first, I assumed it to be an airplane and thought I just couldn't see the running lights clearly as it was behind a very light cloud cover. As it emerged from the cloud cover (traveling from the north to the south)I expected to see lights - there were none. I pointed it out to my husband and kids, and no one else could tell what it was either...it was something we had never seen before. The only illumination seemed to be a very faint reflection from the surrounding ambient light. It took a turn to the southwest and we continued to watch as it moved across the sky. It continued on to the southwest and we lost sight of it when it was at about 30 or 40 degrees above the horizon. It just got too faint to see. The entire trip across the sky took about 2 minutes - movement was at a consistent speed. There was no sound, but we didn't expect any as it seem to be at a high altitude. Hard to judge the size, as we could not easily judge the altitude, but if it was as high up as it seemed, it would had to have been very large."],"Tags":"City","Object Features":"Unknown","Region":"Texas","Country":"United States","Summary":"Triangular or diamond shape moving across the sky - changed direction once - no lights","Log Number":"US-08122009-0001","map":"<A HREF = \"http://maps.google.com/maps?q=30.171921,+-95.451432(18613)&iwloc=A&hl=en\"> mufon case (18613) map </A>","Date Submitted":"08/11/2009 10:18 UTC","files":["/var/www/straped/mufon/html2text/18613.html.txt","/var/www/straped/mufon/org/18613.html"],"Sighting Duration":"Undisclosed","Date of the Event":"08/11/2009 10:18 UTC","Source":"MUFON","Viewing Distance":"Unknown","Latitude":"30.171921","Longitude":"-95.451432","Object Shape":"Diamond, Triangle","Case Number":"18613"}