{"divs":["Sighting DetailsAt approx 22 45 pm Myself and four over witnesses who at the time where all out in our own gardens and are all next door to each other. We where all outside looking for meteors the sky was clear apart from a few passing clouds as I was looking up to the north I glanced West wards and noticed a very bright Orange Red glowing light quite high in the sky as a few clouds did obscure the object once or twice but we all had a very clear view for the most part. The object then seemed to be heading closer to us and desending in an easterly direction, I then ran into the house to grab a camera which is digital when I turned it on i had no memory on the sd card left due to a weekend away. I had another sd card in the house but if i had gone back to get it I would have missed the Object coming over so I stayed outside with the other witnesses disapointed not to get the picture but shocked in the moment and what I thought we saw. When I arrived back in the garden seconds later it had stopped glowing and was banking off to the North towards Pontypool this is when we could all make out the underbelly of the craft, Disc shaped with lots of dim white lights close to the outer edge. It was dim probably because of the distance and the Object was starting to head away from us while it banked but you could still see it and to me it seemed to have a gray underbelly with a slight transluesence. As it disappared over the rooftop we all ran out to the front of the houses and ran north up the main road to see if we could spot it but it had gone. I cant believe what I have seen having had a interest in U.F.O's for many years I never thought in a million years would I ever see anything but we all saw this thing and we are all shocked and stunned none of the witnesses can explain what we have all seen with our own eyes, the sighting lasted maybe three to four minutes we where all running around the gardens in total disbelieve of what we had just seen. Myself i could not sleep much that night and we all stayed out until cloud cover stopped us viewing at around midnight. There was no sound from the object it just drifted slowly off north just above us at around 45 degrees maybe a little higher. We where all shouting oh my god oh my god what is that, look at the shape of it ? What is it. Now for myself after seeing that in the air I have to now believe something is in the skies flying around silently at night and it does not look like anything myself or the other witnesses had ever seen before."],"Object Shape":"Disc, Fireball, Oval, Other","Log Number":"GB-08122009-0003","Case Number":"18615","Region":"Wales","Source":"MUFON","Summary":"Orange Red glowing object from west, banked north, disc shapped belly","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=51.585521,+-2.994264(18615)&iwloc=A&hl=en\"> mufon case (18615) map </A>","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Country":"United Kingdom","Date of the Event":"08/11/2009 10:45 UTC","Date Submitted":"08/11/2009 10:45 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/18615.html.txt","/var/www/straped/mufon/org/18615.html"],"Disposition":"Unresolved","Longitude":"-2.994264","Sighting Duration":"Undisclosed","Latitude":"51.585521","City":"Newport","trends":["There has been one other sighting in Newport","There were no other sightings in Newport on or around August 11th 2009"],"Object Flight Path":"Straight-line path,Path with directional change"}