{"Disposition":"Unknown","Summary":"UFO flies in from East, right over highway in front of car, on to the West, and out of sight","Country":"United States","trends":["There have been no other sightings in Hardwood","This sighting has never been favorited."],"divs":["sighting detailsmy family and i were traveling south on highway m69 in the upper peninsula of michigan. it was approximately 11pm central time in around 1986 when from the east, out of nowhere came this dark\\black disc shaped object-it flew directly in front of our car, approximately 50-100feet from the car. it flew very slowly as it passed by us. we had stopped the car by this time. it then continued on west through an open field and disappeared as fast as it appeared. there was no sound, just lights. there were approximately 3-4 lights, which were bright. i wish today that i had had a camera at the time, as memory only lasts so-long. but i wanted to share this story in case someone else knows of a sighting in the same area. it was about 10-15 miles south of hardwood, michigan. when we first saw the object we all knew right away that it was definitely a ufo. no one else was on the highway at that time. my family consisted of my father, who was driving, my mother, my brother, and myself. i was about 12 years old at the time. it is something that has stuck in my memory ever since it happened. during the whole sighting, which lasted about five minutes or less, i remember all the hair on my neck sticking up...i had goosebumps and was really scared. after the object left our sight, i said to my family, \"was that what i think it was?\" my mother answered, \"yes\". we all saw it and still talk about it on occasion yet today. the only thing that the object did was come in fast from just over the tree-tops, to in front of our car. it slowly crossed the highway, in front of us and went into the field to the west and like a flash of lightning, it was gone! never to be seen again by any of us. i do think that there is other forms of life out there- who are we to think we are the only ones?? thanks for listening!"],"Viewing Distance":"21-100 Feet","Longitude":"-87.691243","Region":"Michigan","Latitude":"45.961622","Date of the Event":"05/31/1986 12:00 UTC","Object Features":"Unknown","Date Submitted":"05/31/1986 12:00 UTC","Source":"MUFON","Object Shape":"Disc","Weather Factors":"None","Object Flight Path":"Other","Case Number":"18611","map":"<A HREF = \"http://maps.google.com/maps?q=45.961622,+-87.691243(18611)&iwloc=A&hl=en\"> mufon case (18611) map </A>","Log Number":"US-08112009-0019","City":"Hardwood","files":["/var/www/straped/mufon/html2text/18611.html.txt","/var/www/straped/mufon/org/18611.html"],"Tags":"City","Sighting Duration":"Undisclosed"}