{"Sighting Duration":"Undisclosed","Object Features":"Dome, Unknown","Weather Factors":"None","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around August 11th 2009"],"Date Submitted":"08/11/2009 08:55 UTC","Tags":"City","Region":"Arizona","Date of the Event":"08/11/2009 08:55 UTC","City":"Tempe","Viewing Distance":"Unknown","Latitude":"33.42981","Source":"MUFON","Object Shape":"Boomerang, Cigar, Chevron, Fireball, Saturn-like, Sphere, Star-like, Unknown","Log Number":"US-08132009-0006","Country":"United States","divs":["sighting detailswent out to my back yard to see if i could get any meter footage around 9:50 pm. was cloudy night due to dust from wind i think? but, one \"star\" to the south east very high in the sky caught my eye right away! this star\\ufo\\? seemed to move higher in the sky and get very small then, it seem to come closer as if it was zooming in like a camera would and get bigger and bright to the naked eye? so i started to video tape it with my sony mini dvd 80x zoom. i taped this thing for a good 30 min-45min zooming in and out, in both night shot mode and regular mode! what i have on tape is incredible to say the least to the naked eye this thing looks like just another big bright star but on tape it has a distinct chevronie\\diamond shape from about 30\\40x zoom but at 80x zoom this thing takes on a whole different shape, color, and life! it dance like a worm then splits and criss.\\crosses itself the energy and speed of the light\\lights it puts out is unexplainable, then in part of the footage you can see blackshadows on the top and bottom of this thing and the lights seem to dance in between the 2 shadows? i would like to have someone take a look at my footage and either tell me that my camera was malfuctioning or that my footage is just normal footage of a regular star and that zooming in on star will cause what i have on tape. or that the footage i have is truly unexplainable footage of something not yet known or identified? computer is a mac and my camera is a sony i have tried in the past to download video from my camera to my computer but have never been successful can someone please help me or point me in the right direction to someone who can take a look at what i have! i am not a some crackpot trying to pull a prank, i am a college educated school teacher who would just like to try and find out what the hell i saw and have on tape?"],"Case Number":"18637","files":["/var/www/straped/mufon/html2text/18637.html.txt","/var/www/straped/mufon/org/18637.html"],"Object Flight Path":"Stationary","Longitude":"-111.935495","Summary":"Can't explain in 25 words","map":"<A HREF = \"http://maps.google.com/maps?q=33.42981,+-111.935495(18637)&iwloc=A&hl=en\"> mufon case (18637) map </A>","Disposition":"Unknown"}