{"Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-08122009-0019","divs":["Sighting DetailsMy children and I were visiting my mother and stayed overnight on July 14, 2009, in Everson, PA. That evening I went outside to get some fresh night air around 9 pm EST. I love to stargaze so looking into the night sky is common nature to me. I was looking into the southeastern corner of the sky when i noticed a triangular object that was not twinkling like a star would. I stood there watching it hover. I watched it for a good 20 minutes as i continued to walk the block. It was definitely not a star as i noticed it would move just ever so slightly, but not quick, nor did it twinkle. After watching it stay within the same area of the sky and thinking it may be a UFO i decided to go back inside. I didn't say anything to my teen girls at the time, thinking they may call me crazy. a couple hours later they went to bed, but were still up talking and apparently they were also looking out the bedroom window and spotted this bright hovering object as well. By this time it was nearly midnight. I was in the living room watching tv when my girls come running downstairs and through the house to go outside and they were both gitty with excitement and chanting \"There's a UFO\", repeatedly. So i follow them outside to let them show me and they point to the very same area of the sky i had found the UFO at least 2 to 3 hours prior. We all agreed it was not a star and not shaped like an airplane, or any type of human created aircraft. It was to us a UFO. Unfortunately i do not own a video camera, nor does my mother so i was not able to record this on film. My youngest daughter said to me that i need to report this to our mutual friend and avid UFO fanatic from Chicago. So i did and he told me to come here to the website to officially report the siting. I have to thank Roger Marsh for informing me of this website and for his latest posting of Allison Cruse's Murrysville UFO siting that she witnessed and videotaped on July 10, 2009. Everson is just a 45 minute drive southeast of Murrysville."],"Date Submitted":"07/14/2009 09:00 UTC","Weather Factors":"Medium","Date of the Event":"07/14/2009 09:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"40.091184","map":"<A HREF = \"http://maps.google.com/maps?q=40.091184,+-79.587539(18631)&iwloc=A&hl=en\"> mufon case (18631) map </A>","Object Features":"None, Unknown","Summary":"UFO spotted first by me , then hours later by my kids.","Object Flight Path":"Stationary","Country":"United States","Region":"Pennsylvania","Object Shape":"Star-like, Triangle","Longitude":"-79.587539","City":"Everson","Disposition":"IFO","Case Number":"18631","files":["/var/www/straped/mufon/html2text/18631.html.txt","/var/www/straped/mufon/org/18631.html"],"trends":["There have been no other sightings in Everson","This sighting has never been favorited."]}