{"Region":"California","Source":"MUFON","Sighting Duration":"00:02:00","Object Features":"Undisclosed","Country":"United States","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around August 12th 2009","This sighting has never been favorited.",""],"Log Number":"US-08132009-0007","map":"<A HREF = \"http://maps.google.com/maps?q=37.77781,+-122.413346(18638)&iwloc=A&hl=en\"> mufon case (18638) map </A>","Date Submitted":"08/12/2009 08:20 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Case Number":"18638","Longitude":"-122.413346","Latitude":"37.77781","Date of the Event":"08/12/2009 08:20 UTC","Object Flight Path":"Undisclosed","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/18638.html.txt","/var/www/straped/mufon/more/18638_submitter_file1__IMG_5472.JPG","/var/www/straped/mufon/more/18638_submitter_file2__IMG_5478.JPG","/var/www/straped/mufon/more/18638_submitter_file3__IMG_5480.JPG","/var/www/straped/mufon/org/18638.html"],"divs":["Sighting Details I decided to go on my roof to take photos of the brilliant red sunset. After a few minutes shooting up there I noticed a dark object moving across the sky from west to east. It was not moving in a straight line and was changing speeds. At first, with my bare eyes, i couldn't really make out the shape. It kind of looked like a chopper at first, but did not move like one, nor did it make any noise. I took as many shots of the object as i could in the 20 seconds or so that I had. It was so high up that i lost it for awhile, but in the end I managed to get 15 photos of the object. After, I took a closer look at the photos on my computer and quickly realized that I was dealing with 2 UFO's. Another object, even higher and further away, was also captured in the background. Also moving, but appeared just as a bright white light. I could tell it was moving from the landmarks on the ground in the photos. I took all the photos in the same position. So i know it wasn't a star. Anyway, the object i focused in on was black in color and shaped like an upright cylinder with asymetrical limbs off the sides. The top of the object had a multi pointed surface like cones or pyramids. There also appeared to be a single reddish light on it as well, but it might have been from a reflection of the sunset. I only noticed these features after zooming in on the computer. I will send 3 of the 15 photos to you guys so you can judge for yourself. I can send the rest on your request. I am hoping that I'm not the only one to have seen this. There must have been tons of people shooting that amazing sunset. Anyway, keep up the good work. The truth is out there."],"Disposition":"Unknown","City":"San Francisco","Summary":"odd shaped cylinder with pointed parts and limbs.","Tags":"City"}