{"Region":"South Carolina","Log Number":"US-08132009-0002","Country":"United States","Case Number":"18633","Weather Factors":"None","Tags":"City","Latitude":"34.227371","Object Shape":"Unknown","Viewing Distance":"Unknown","Object Features":"Unknown","City":"Lugoff","map":"<A HREF = \"http://maps.google.com/maps?q=34.227371,+-80.689249(18633)&iwloc=A&hl=en\"> mufon case (18633) map </A>","divs":["Sighting DetailsI went outside to my back porch to see if the sky was clear enough to view the meteor shower later that night. At the time the skies were clear. To my the NNW I saw what appeared at first to be a large twinkling star, but I knew I had not seen it before. I thought maybe it was an aircraft, or possibly a sattelite, but it was remaining stationary. I almost shrugged it off, but just before I turned to go back inside it began moving in a southward direction fairly slowly. As it moved closer the twinkling I thought I saw earlier was clearly lights. At first they seemed to be flashing, as lights on a plane would, but I knew it clearly could not have been a plane because it remained stationary for several minutes when I first saw it. As it came even closer I could see that the lights were actually rotating around the object. The lights were red, green, blue, yellow and white. The object never got close enough to make out an actual shape, but from the way the lights rotated it appeared to be round at the edges. At that point it stopped briefly, but after a few seconds it began to go back in the direction it had just came from. It went almost all the way back to where I had first spotted it and stopped again. At that point I caught a glimpse of a small, but bright white light out of the corner of my eye to the east. I turned to look thinking it might be one of the Persied meteors, but it was moving too slow, and the light was pulsing. It was moving directly toward the first object and continued until it was just below and to the right of the first object. It appeared to be considerably smaller thatn the first object, but I believe both objects were very far away and were definitely at a very high altitude making it hard to determine the size of either object. The second object remained in that position, below and to the right of the first object for probably nearly a minute or so. At that point the light from the second object stopped pulsing and just seemed to fade out. A few minutes later the first object moved quickly to the north and disappeared."],"Date Submitted":"08/11/2009 10:15 UTC","Disposition":"Unknown","Summary":"2 objects, largest one w/ rotating lights","Date of the Event":"08/11/2009 10:15 UTC","trends":["There have been no other sightings in Lugoff","This sighting has never been favorited."],"Longitude":"-80.689249","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/18633.html.txt","/var/www/straped/mufon/org/18633.html"],"Object Flight Path":"Path with directional change","Source":"MUFON"}