{"Tags":"City","trends":["There have been 7 other sightings in Aurora","There were no other sightings in Aurora on or around August 12th 2009"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I were sitting on our deck looking in the direction of Cassiopeia for the perseids meteor shower. It was a clear sky with a lot of ambient background light. We had been out for about 15 minutes and had just seen a good long meteor trail traveling east to west. I picked up my cell phone to call my son to tell him what we saw since he was watching too, from his porch in another state. While on the phone with him I noticed something moving in the sky traveling almost overhead roughly SSW from just above Cassiopeia. I blurted out, \"What the heck is that?\" I told my son that I was looking at a UFO. My wife saw it at the same time. We both followed it for about 10 seconds until it disappeared just above the horizon. It was triangular in shape and moved very smoothly with no noise. It did not change directions. There were 4 dim, non-flashing lights on the bottom of it; one in each corner of the triangle and one in the middle. The lights illuminated enough of the bottom to make out the shape. It seemed very low in the sky to me. From where we live, there is continuous airline traffic into O'Hare and out of Midway, and we are also close enough to DuPage County airport to see private jets and props go in and out. We are very familiar with what planes look like at night and saw many of them during our meteor shower watching, but this UFO was nothing like any of them. The elevation of the UFO seemed about the same as the jets queueing up over Aurora for O'Hare, maybe a little lower. Both of us were a little spooked because we have never seen anything like this before and never imagined that we would ever see a UFO. I would like to know if anyone else saw this in our area. If it becomes indentified, please let me know what it was."],"Summary":"Triangular UFO with 4 dim, non-flashing lights traveling from N to S; no noise","files":["/var/www/straped/mufon/html2text/18635.html.txt","/var/www/straped/mufon/org/18635.html"],"Sighting Duration":"00:00:10","map":"<A HREF = \"http://maps.google.com/maps?q=41.764215,+-88.314812(18635)&iwloc=A&hl=en\"> mufon case (18635) map </A>","Date of the Event":"08/12/2009 10:30 UTC","Object Flight Path":"Straight-line path","Longitude":"-88.314812","Log Number":"US-08132009-0004","Object Shape":"Triangle","Case Number":"18635","Object Features":"Patterned Surface","Date Submitted":"08/12/2009 10:30 UTC","Latitude":"41.764215","Disposition":"Unknown","Source":"MUFON","Country":"United States","City":"Aurora","Region":"Illinois"}