{"Summary":"Noticed a large metallic staionary object in the sky","Case Number":"18630","Date of the Event":"08/12/2009 12:00 UTC","Region":"California","files":["/var/www/straped/mufon/html2text/18630.html.txt","/var/www/straped/mufon/org/18630.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.957939,+-117.389886(18630)&iwloc=A&hl=en\"> mufon case (18630) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"08/12/2009 12:00 UTC","divs":["Sighting DetailsI was on my way home from work, and stopped at the grocery store which is one street over and two blocks down from my house. I left the grocery store and drove those two blocks, then just before my turn, I noticed something large, metallic and STATIONARY in the sky. It was some distance from my location to the west. I'm about 100 miles eastish from LAX, and maybe 15 miles westish from March AFRB, so I frequently see planes. The object I saw just now appeared to be 2-3 times the size of airplanes I would normally see in that part of the sky. However, I simply have no way of judging how far away the object really was, it may have appeared larger because it was closer, I don't know. It was metallic, that's what caught my eye - it was shiny. It was not a disk, it appeared cigar shaped. It was NOT moving. I did not hear any noise. So I'm now about a block away from my house. I pulled over to look at it, to make sure it didn't just appear stationary because I was moving. It was NOT moving. So I jumped into my car and quickly drove the block home, ran into the house for my camera - and my son as a witness - when I came back out, it was gone :( This occurred during daylight hours. I am going to start carrying a camera and binoculars in my car for sure!"],"trends":["There have been 38 other sightings in Riverside","There were no other sightings in Riverside on or around August 12th 2009"],"Object Shape":"Cigar","Tags":"City","Log Number":"US-08122009-0018","Source":"MUFON","Disposition":"IFO","Sighting Duration":"Undisclosed","Latitude":"33.957939","City":"Riverside","Weather Factors":"Unknown","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Stationary,Hovering then path","Longitude":"-117.389886"}