{"Longitude":"-97.749006","map":"<A HREF = \"http://maps.google.com/maps?q=32.242347,+-97.749006(18636)&iwloc=A&hl=en\"> mufon case (18636) map </A>","trends":["There have been 8 other sightings in Glen Rose","There were no other sightings in Glen Rose on or around October 1st 2002"],"Sighting Duration":"Undisclosed","Date of the Event":"10/01/2002 11:00 UTC","Disposition":"Unknown","Summary":"Traingle shaped UFO spotted over Highway 67","Object Features":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-08132009-0005","Object Shape":"Triangle","Tags":"City","Case Number":"18636","Latitude":"32.242347","Weather Factors":"None","Region":"Texas","divs":["Sighting DetailsI was 12 at the time of this event. It was a clear texas sky night with little to no breeze. I live in a rural area about ten miles outside of the nearest town (Glen Rose, Tx). I feel this is a relevant sighting especially since a nuclear power plant is located a short ways from where I take residence (Comanche Peak Nuclear Power Plant). The plant is in fact in veiwing range of my residence since I live on a hill. My house is located just off Highway 67. I was outside shooting basketballs for a short time while I noticed an unfamiliar humming noise. I dont think the noise was being emmited from the object directly but actually coming from the object breaking through the thick air. The object was clearly triangle in shape as it blocked out the bright stars and much of the night sky. Small lights could be seen flickering as would a light on an airliner's wing tip. There were only blue, red, and white lights emmiting from the objects underside. It was flying directly perpindicular to the highway as it slowly made its way out of sight. As to its hight off the ground, I could safely say it was about 60-70 feet up. I feel this is a good estimate in correlation to my house and it seemed to be just above the roof. I felt no emotional distress nor anxiety as the object passed over my head, only intrigue. The object flew in a straight line. In a mere five minutes the object faded out of sight, oddly in a direction that would pass within a few miles of the nuclear power plant. I have spoken to many members of our community about my sighting and most can tell me about their own strange occurences in the region. The object was clearly solid and made of a metallic substance. It flew apprx. 40 miles an hour and very smoothely. It had no apparent struggle to keep airborne. It was around 60 feet long and at its tail 60 feet wide, a perfect equalateral triangle. It very well could have been a military designed craft as jet fighters frequent the airspace around my house and the power plant. Just recently a string of UFOs were reported and recorded in Stephenville, Tx. These sightings were covered in depth by media sources around the state and even the nation. Simply typing in \"Stephenville UFO\" on Google will result in a barrage of pages covering the event. Strangly, UFOs around here are not uncommon. If anything, they can be considered almost normal. For any UFO fanatic or skeptic, this area should be labeled a definate hot spot. I researched my sighting on the internet and found that triangle UFOs are spotted quite frequently on major highways such a mine. Some call them \"black triangles\". Research should definately be done on these occurences. My own belief is that these are simply goverment contolled crafts thats existence has not yet been released to the public."],"Date Submitted":"10/01/2002 11:00 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18636.html.txt","/var/www/straped/mufon/org/18636.html"],"Viewing Distance":"Unknown","Country":"United States","City":"Glen Rose"}