{"Object Flight Path":"Stationary","trends":["There have been 43 other sightings in Arlington","There was one other sighting in Arlington on or around August 8th 2009"],"Weather Factors":"Windy, Rain","Latitude":"32.736877","files":["/var/www/straped/mufon/html2text/18645.html.txt","/var/www/straped/mufon/org/18645.html"],"Longitude":"-97.099866","Object Features":"Unknown","Viewing Distance":"20 Feet or Less","Tags":"City","Summary":"UFO on the back of a 18 wheeler","Object Shape":"Cone, Disc, Oval","Log Number":"US-08132009-0014","City":"Arlington","Disposition":"IFO","divs":["sighting detailsreader details from ufo case book internet file time: 9:00 pm - 9:30 pm on i-20 in dallas. weather was clear. there were numerous witnesses but no names as people were calling into the radio station i was listening to as well as others after i switched stations. my name is jg. i was actually listening to the radio in irving, tx, when the dj said that a lot of people where calling in and saying that there was a truck on i-20 with a ufo on the bed of the truck. it was being followed by what looked like miltary and police.this was kind of like what they do when a big name politician comes into town where they close the highway down for them. i remember they did that for donald rumsfeld when he was here about 2 1\\2 years ago. i then switched to another radio station since the one i was listening to went to commerical, and after awhile of listening they said they were getting calls in about the same thing. i don't know if it was for a movie or what, but if it was wouldn't they have closed the highway down before hand? there were still civilians on the road at the time. i would have sent this sooner, but i don't have internet at home and have to do it at work. in a later e-mail, the reporter also told me that several of the callers said that they could see smoke or steam coming from the ufo on the flatbed truck."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.736877,+-97.099866(18645)&iwloc=A&hl=en\"> mufon case (18645) map </A>","Source":"MUFON","Region":"Texas","Date of the Event":"08/08/2009 12:00 UTC","Country":"United States","Case Number":"18645","Date Submitted":"08/08/2009 12:00 UTC"}