{"Disposition":"Unknown","Country":"United States","Date of the Event":"08/12/2009 10:15 UTC","divs":["sighting detailsi was outside on the deck watching the aug.12, 2009 perseid meteor shower. it was around 10:15pm and my wife and i were facing due east. we both saw something flying w to e(mistakenly stated e to w in original report)in a straight line over us, and a little to the n of us. when it first came into view it was about 45deg. above the horizon. my 1st thought was that it looked like a spotlight when it hits the clouds but it was crystal clear outside. my wife's 1st thought was that it was an angel, and then that it was a bird of some kind. we both jumped out of our chairs and pointed at the thing and started asking each other, \"what is that?! what is that?!\". as it flew over head it didn't look solid to me. it was hazy-white in color, gave off it's own glow\\light, and it was silent. it appeared to have wings that looked similiar to butterfly wings that extended out from the center but with \"feathered\" edges on the wings. there was a central body where the wings met but it was small in relation to the size of the wings. based on the idea that it resembled a spotlight i would have to say that it was at least 1000ft up and traveling around 300-400 mph. if you stuck your thumb up and held your hand out in front of you, it was about the size of a thumbnail. it was much larger than the stars and aircraft that were in the sky at the time. we live in the flight path of port columbus and are familiar with what a plane looks like during takeoff and landing. we saw multiple meteors and satellites the same night. this was something else and left us both wondering what we just saw. i have seen a similar object traveling that same path last fall, but in the reverse direction. it was around 4pm, sunny with a few puffy clouds. it also looked like a feathery, whispey, winged thing traveling in a straight line, against the wind, and at about the same height and speed."],"City":"Pataskala","Log Number":"US-08132009-0009","Summary":"Winged form traveling East to West during Perseid meteor shower","Object Shape":"Other","Case Number":"18640","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/18640.html.txt","/var/www/straped/mufon/org/18640.html"],"Region":"Ohio","Longitude":"-82.670524","Date Submitted":"08/12/2009 10:15 UTC","trends":["There have been 3 other sightings in Pataskala","There was one other sighting in Pataskala on or around August 12th 2009"],"Latitude":"39.998539","Object Features":"Wings","Object Flight Path":"Straight-line path","Weather Factors":"None, Does Not Apply","Sighting Duration":"00:00:05","map":"<A HREF = \"http://maps.google.com/maps?q=39.998539,+-82.670524(18640)&iwloc=A&hl=en\"> mufon case (18640) map </A>","Source":"MUFON","Tags":"City"}