{"Longitude":"-97.104636","Case Number":"18643","Tags":"City","Weather Factors":"Unknown","Summary":"UFO being transported down I-20 Arlington area","files":["/var/www/straped/mufon/html2text/18643.html.txt","/var/www/straped/mufon/more/18643_submitter_file1__22035801.jpg","/var/www/straped/mufon/more/18643_submitter_file2__22035993.jpg","/var/www/straped/mufon/org/18643.html"],"divs":["Sighting DetailsTo Whom it may concern, There is a situation here that has been unfolding since last Saturday. I was curious if MUFON was aware of this case. There has been a report filed with UFO Casebook by the person that took the photos of what appears to be a saucer shaped object on a flat bed trailer going down I-20. There were many witnesses and many called the local radio station 97.9 The Beat. People were allegedly forced off the highway by police and the on ramps were blocked. Some witnesses said there were military present and that some of the escort cars were black SUV's and Hummers. Supposedly, the audio has disappeared, and the radio station refuses to play it again. There also seems to be police reports made that night about flashes of light and loud booms. There were fireworks that night, but some are saying it was not fireworks. I also had a very odd experience approximately 24 hours prior to these photos. I will file a report if you think this story is worthy of your attention. I recommend someone there take a look at this on the UFO Casebook website as well as the photos I have attached. I would just like to point out something odd about the photos. All wide load transports are required to have a \" Wide Load \" sign, there is not one. The photos are blurry, but I can see that there is no sign. We need your experts to investigate this, because there are conflicting reports being spread around, and we need someone to get the real facts. Please let me know what you think,so I can file a report on my experience, because I think it could have relevance to the investigation. Thank you very much. Christian Smith Arlington, Tx"],"Country":"United States","Viewing Distance":"101-500 Feet","Source":"MUFON","Date of the Event":"08/08/2009 03:30 UTC","City":"Arlington","Log Number":"US-08132009-0012","Date Submitted":"08/08/2009 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.745527,+-97.104636(18643)&iwloc=A&hl=en\"> mufon case (18643) map </A>","Region":"Texas","Object Flight Path":"Undisclosed","Object Shape":"Disc, Oval","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","trends":["There have been 43 other sightings in Arlington","There was one other sighting in Arlington on or around August 8th 2009","This sighting has never been favorited.",""],"Latitude":"32.745527"}