{"Date of the Event":"08/10/2009 12:00 UTC","divs":["Sighting DetailsI was headed home on friday 7th aug 2009 and witnessed 3 groups of 2 helicopters flying about 800 ft high 1 trailing the other directly behind at about 100 yards at a airspeed of no greater than 20 knots. First this is very hard on a chopper as it is a hover with slow foward movent, also helos always fly at about 30 degrees trailing because of blade area safty. I didn't think much about it till I came over a hill and spotted a highly modified HumV. It had a large com trailer attached to it with several odd antena. They were painted about the color of wet cardboard and had no markings. There was a white Ford Crown Vic setting there also and three men in civilen clothing standing outside and watching the helos. There were 2 sets of Hueys and 1 set of Apache gun ships but all were flying the north to south grid. Up on my return monday the 10th of August I witnessed the same thing about 5 miles north west on the same highway. State Hwy 71 between Llano and Brady. Oh and I almost forgot on Friday you can see from the inclosed picture the had traffic down to on lane arround this military ground equipment. I had forgotten it till I check my phone pictures."],"Source":"MUFON","Date Submitted":"08/10/2009 12:00 UTC","Log Number":"US-08132009-0019","Longitude":"-99.113384","Latitude":"30.932116","Viewing Distance":"Over One Mile","Object Features":"Other","Sighting Duration":"Undisclosed","Region":"Texas","Country":"United States","trends":["There have been no other sightings in Fredonia","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","Disposition":"Hoax","files":["/var/www/straped/mufon/html2text/18650.html.txt","/var/www/straped/mufon/more/18650_submitter_file1__IMG00021-20090804-1151.jpg","/var/www/straped/mufon/org/18650.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.932116,+-99.113384(18650)&iwloc=A&hl=en\"> mufon case (18650) map </A>","City":"Fredonia","Tags":"City","Case Number":"18650","Object Shape":"Other","Summary":"Witnessed 3 groups of helicopters searching a tight grid","Weather Factors":"Unknown"}