{"Date Submitted":"08/14/2009 09:00 UTC","Object Shape":"Star-like, Triangle","Log Number":"US-08142009-0003","City":"McAllen","Latitude":"26.210617","Longitude":"-98.224442","Disposition":"Unknown","divs":["Sighting DetailsJust today, August 13 2009, at about 9:30pm I witnessed a strange aircraft hovering above Ware Rd. and Dove. It had a blinding light pointed at my car that resembled the spotlight from a helicopter. This particular aircraft however did not have the signature lights a chopper would so I followed it. It begun to move north at the speed of a jet airplane; I followed behind northbound on 29th off of Dove. When I approached Lark it was already passed 5mi and decided to hover. It was at that point, looking from lark and 29th, that I could tell it was no chopper. This aircraft seemed to be in a triangular shape with lights on the edges and bright lights on the 3 corners. The lights blinked in an odd sequence and in multiple colors. It seems this aircraft masks itself as a chopper but from certain angles its cloak is rendered useless. To get a better view I turned westbound on Lark as It decided to travel west as well. As I turned north on Ware Rd. the aircraft seemed to change shape slowly. I turned west again on Trenton off of Ware rd. to follow the aircraft that seemed to be hovering further south west from Trenton and Ware Rd. Once I came within what seemed to be a mile of the aircraft on Bentson and Trenton the aircraft changed to camouflage perfectly in the sky; it seemed as though I was looking at a star. Within the same moment the craft's lights came back on and it started moving southbound and so did I. This craft was moving so fast there is no way in hell it was a chopper, at least not one I have ever heard of. By the time my car traveling at 45mph reached 4mi line the craft was clear into Mexico and hovered until it either disappeared or landed. 20 min later, 9:50pm, I spotted a second aircraft hovering just next to the radio towers on Dove in between 23rd and 10th St. Being within 200yrds, I thought the craft clearly resembled a chopper for sure. By the time I approached the canal eastbound I could see in my mirror that it was no chopper; It was the same type of aircraft from before. I hit my breaks and turned into the parking lot just west of Gold's Gym to get a better look at the craft traveling south west from that point. Why would a chopper hover right next to a radio tower in low viability? They wouldn't. What was that craft doing? Was it government or something else? Why did they fly off into Mexico? I was finally traveling East on Fern off of 2nd St. and had a 3rd sighting, this time at a distance. I saw a third craft hovering next to another radio tower just a few miles east of the second sighting. This craft resembled the previous 2 in light patterns and flight. None of the 3 crafts were flying in a point A to point B pattern as a chopper would, police or otherwise. These crafts few as one would for a joyride or sightseeing. Cloaked as a chopper at that. Any explanations? Anybody who has lived in McAllen, TX as long as I have knows you will never see 3 choppers flying within the same 30 min and within a few square miles of visibility. I feel as dumb as those cooks that come on TV saying they saw a UFO. I make fun of those guys; now I am one."],"map":"<A HREF = \"http://maps.google.com/maps?q=26.210617,+-98.224442(18656)&iwloc=A&hl=en\"> mufon case (18656) map </A>","Region":"Texas","trends":["There have been 11 other sightings in McAllen","There were no other sightings in McAllen on or around August 14th 2009"],"Weather Factors":"None, Does Not Apply","Country":"United States","files":["/var/www/straped/mufon/html2text/18656.html.txt","/var/www/straped/mufon/org/18656.html"],"Summary":"Hovering triangle craft flys fast and changes shape above McAllen, TX before disappearing into Mexico","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Case Number":"18656","Sighting Duration":"00:03:00","Object Features":"Undisclosed","Date of the Event":"08/14/2009 09:00 UTC","Tags":"City","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering"}