{"Disposition":"Unresolved","divs":["Sighting DetailsI've read an exceptional amount of material on the specific UFO that my brother and I saw, but none have described the level of detail that we were able to discern. We never reported it. I figured I'd finally put it out there and see what others can make of it. The exact date was either April 12th or April 13th, 1997. My old diary has an entry detailing the event, dated April 12th, though I'm not sure if I wrote about it on the actual night or the day after the event occurred. It was around 8:00pm. We had to be inside by 8:30, so it couldn't have been after that. My older brother and I were playing Hide and Seek in the back and front yards. My brother had just caught me and we were getting ready to start another round. What made us turn our heads towards the sky was the noise. It was an almost inaudible humming, very low pitched and oscillating or pulsing slightly in volume. I remember the pitch and tone with perfect clarity, even after all these years. It was very quiet. I doubt we would have noticed it had we been in the back yard. What we saw was a dark, triangular object, around the length of a bus. It was flying VERY slowly -- we could have easily outrun it had we tried. It was directly above the road at an extremely low altitude, so low that its belly was illuminated as it passed over the street lights. We could see in the light that it was, in shape, a perfect triangle with sharp points that curved as they receded towards the top of the craft. The material that it was constructed from was very dark, non reflective and completely smooth. There was a large, spherical object embedded in its center and similar (though smaller) spherical objects near each tip of its triangular frame. These were, in contrast to the rest of the craft, shiny and lighter in color. The finest detail that we noticed were beveled lines that moved out from the center orb to the orbs at each tip. The first emotion I felt was fear. It was overwhelming. The crafts appearance, in conjunction with the strange noise that it made, was extremely ominous. The thoughts that passed through my mind were things like \"Shouldn't be seeing this, can't be seeing this, aren't seeing this.\" After it passed, my brother told me he'd never felt so frightened in his entire life. It was so close that we could have easily thrown and hit it with rocks. My brother, immediately after seeing it, grabbed me from behind and wrapped his arms around my chest in a tight bear hug. He told me that if they take me, they'd have to take him as well. He later told me that he'd seen \"Fire in the Sky\" weeks before the incident and he thought we were going to be abducted. Very humorous in hindsight, though it wasn't funny in the slightest at the time. The words sent a shiver down my spine. We watched as it slowly made its way down the street. It disappeared from our view when it passed over a group of trees, heading in the direction of a large, wooded creek area that led to a primary school. That was the last we saw of it. We were shocked. When the fear of its close proximity and presence passed, we were completely awe struck. We wanted to see it again. We stayed on our front porch looking at the sky until our parents called us inside. We agreed not to tell anyone about it, including our parents. The reasoning my brother gave that made me come to this conclusion was that \"they\" might not come back and we won't ever see it again if we tell people about it. We've talked about it many times since the event. My brother believes that it's a military black project. I beg to differ in opinion as I can see no logical reason why the military would fly such technologically advanced aircraft at low altitude and speed over a heavily populated suburban area. It goes against the operating procedure of all previously top secret military aircraft. I've attached two pictures of a 3D model that I created. It's as close as I can get to what we saw. Also attached is a sample (in .mp3 format) that I created in an audio editing program. It is a reproduction of the sound that the craft made."],"Summary":"Black, Triangular UFO over Campbelltown, Australia","Viewing Distance":"Unknown","Country":"Australia","City":"Campbelltown","Weather Factors":"Unknown","Object Features":"Undisclosed","Longitude":"150.821912","Sighting Duration":"00:00:30","Date of the Event":"04/13/1997 08:00 UTC","files":["/var/www/straped/mufon/html2text/18653.html.txt","/var/www/straped/mufon/more/18653_submitter_file1__Triangle001.jpg","/var/www/straped/mufon/more/18653_submitter_file2__Triangle002.jpg","/var/www/straped/mufon/org/18653.html"],"Region":"New South Wales","Log Number":"AU-08132009-0022","map":"<A HREF = \"http://maps.google.com/maps?q=-34.064864,+150.821912(18653)&iwloc=A&hl=en\"> mufon case (18653) map </A>","Tags":"City","Case Number":"18653","trends":["There have been 2 other sightings in Campbelltown","There were no other sightings in Campbelltown on or around April 13th 1997","This sighting has never been favorited.",""],"Object Shape":"Triangle","Source":"MUFON","Object Flight Path":"Undisclosed","Latitude":"-34.064864","Date Submitted":"04/13/1997 08:00 UTC"}