{"Date Submitted":"08/13/2009 02:09 UTC","Region":"Idaho","divs":["Sighting Details as mars is easy to view at this time i was looking at mars with my telescope i got tired of looking though the scope and started to view the sky in other areas with my binoculars when i noticed strange lights being flashed from what i thought was a star when viewed with bino it was apparent this was no star the altitude was not high enough to be a star ,the lite was very plasma like in nature it was a lot like a welding light but much more colorful,i ran in the house to wake my wife who at 2 00 in the a.m. was not pleased,but got up to look because i was so excited,together we couldnt believe what we were seeing ,the object was darting around in weird movements almost like it was trying to spell out something or signal type movement this is when i turned the telescope on the lite,this was incredible the lite being omitted was so intense you couldnt always make a form out of it it almost seemed to morph along the light band like a inch worm? hard to describe something you have never seen before.it was at this time my wife noticed that other much lighter colored objects(binoculars had wider field of view) were doing fly bys at increasing speeds and could be seen flying out of atmosphere in different directions this lasted for 45 minutes and the light got less intense as time progressed with the lights suddenly disappearing in to thin air,we were both excited and a little scared at this weird experience,one further note and maybe this can explain a little a military base is located around this area, but no jets heard, no navigation lights ,no sound and there were planes in air prior to sighting (with in minutes)BUT none during the sighting its self including commercial aircraft or after"],"Disposition":"Unknown","Object Shape":"Triangle","Date of the Event":"08/13/2009 02:09 UTC","Weather Factors":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.570186,+-114.607821(18664)&iwloc=A&hl=en\"> mufon case (18664) map </A>","Source":"MUFON","Summary":"multi color lights looks pure in color almost like plasma","Case Number":"18664","files":["/var/www/straped/mufon/html2text/18664.html.txt","/var/www/straped/mufon/org/18664.html"],"Tags":"City","Longitude":"-114.607821","trends":["There have been no other sightings in Filer","This sighting has never been favorited."],"Latitude":"42.570186","Object Features":"Unknown","Sighting Duration":"Undisclosed","City":"Filer","Object Flight Path":"Path then hovering","Viewing Distance":"Unknown","Log Number":"US-08142009-0011"}