{"Object Flight Path":"Path with directional change","Viewing Distance":"21-100 Feet","City":"Winnipeg","Object Features":"None","trends":["There have been 43 other sightings in Winnipeg","There were no other sightings in Winnipeg on or around May 21st 2008"],"Summary":"Three glowing ovals floated up into the wind over my car while I was on the bridge crossing the river.","Case Number":"18668","Source":"MUFON","Longitude":"-97.132114","Date of the Event":"05/21/2008 11:12 UTC","Log Number":"CA-08142009-0014","Disposition":"Unresolved","Object Shape":"Oval","Tags":"City","files":["/var/www/straped/mufon/html2text/18668.html.txt","/var/www/straped/mufon/org/18668.html"],"Date Submitted":"05/21/2008 11:12 UTC","divs":["Sighting DetailsI had been visiting my boyfriend downtown and left to go home at 11pm. It was a nice night and because I had my dog with me I had the car windows open as I drove back to my house. I was headed north east and as I turned a corner to start going over the bridge I noticed two glowing ovals lifted into the air and going upwards. They weren't going straight upwards, they were going at a 30 degree angle (to the right) into the sky. The ovals were a soft golden color with a white light in the center. They were rising from close to the bottom of the street. I kept driving but tried to keep an eye on them at the same time so I could figure out what they were. My fist (and only guess) was that they might be Japanese paper lanterns and the glowing center might be a candle. The more I thought about this the less likely it seemed as it was definitely not the neighborhood for anything like that and they were also floating North East, into the wind, there was no flickering if it was a candle and the floated so effortlessly and smoothly againt the wind. By now I had driven halfway up the bridge. The orbs were just above the bridge now in height but they had crossed above it and were still gaining height over the river below. They were about the size (not shape) of a football. At this point I had grabbed my camera to take a picture but it would not turn on. There was no low battery signal and it had been working eariler that night but it didn't respond when I tried to turn it on while on the bridge. I keep driving because I did not want to stop on the bridge even though no one else was driving on it. Out of the corner of my eye I notice a light and turn my head to the left. Right beside my open car window is a third oval floating faster than the others trying to 'catch up'. I could see it through the railings of the bridge until finally it was passing over the two lanes, over my windsheild, past the last lane and then over the river like the other two. It made no sound as it came over the car. Close up it looked like a box paper lantern with rounded edges. It looked gelatinous with a white glowing center, almost like a jellyfish without a tail or tentacles. I started getting anxious and I was crying. Once I got to the bottom of the bridge I turned right around because I wanted my boyfriend to see what I had seen. I drove back downtown where on Ellice Street there were four cars pulled over on the side of the road. The drivers and passangers were standing on the side of the road looking at the lights. I didn't get out because I was in a rush to get my boyfriend but no one could figure out what exactly was floating in the air. The orbs had gone significantly higher in the sky but were still much larger and brighter than stars. My boyfriend and I could not see them by the time I got him so I went to leave again once I had calmed down. When I got home after midnight and got out of my car I scanned the sky for them. Far in the distance now to the North West they were still in the sky."],"Sighting Duration":"Undisclosed","Latitude":"49.902914","map":"<A HREF = \"http://maps.google.com/maps?q=49.902914,+-97.132114(18668)&iwloc=A&hl=en\"> mufon case (18668) map </A>","Region":"Manitoba","Weather Factors":"Unknown","Country":"Canada"}