{"City":"Wilkes-Barre","Source":"MUFON","Longitude":"-75.881308","map":"<A HREF = \"http://maps.google.com/maps?q=41.245915,+-75.881308(1867)&iwloc=A&hl=en\"> mufon case (1867) map </A>","Tags":"City","Viewing Distance":"Over One Mile","Region":"Pennsylvania","Case Number":"1867","Log Number":"","Sighting Duration":"00:05:00","Latitude":"41.245915","Disposition":"Insufficient Data","Date of the Event":"09/09/2002 08:45 UTC","Country":"United States","Weather Factors":"Unknown","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around September 9th 2002"],"divs":["Sighting DetailsI was outside on my deck with my telescope. I had been outside for about anhour. I was looking in the direction of the Andromeda Galaxy with the telescope.I decided that I would look for the Andromeda galaxy with a pair of binoculars.As I was searching, I noticed three craft flying in a triangle formation. Oneforward and two a equal distance behind. The objects looked like points oflight. I noticed them between Polaris and the Andromeda galaxy. I moved to thewall of my house so I could steady the binoculars. I believe it took about 3minutes for the craft to fly by. The craft were headed in an easterly directionand flew from my prospective from left to right. I lost sight of the craft whenthey flew behind some trees.The craft flew past several stars. I was able to seethe space between the craft, so I believe I was seeing three separatecraft.There are a lot of aircraft that fly over here, but these craft did notresemble airplanes. One reason was the craft were much higher in the sky andsecond they had no shape. They didn92t have any flashing lights. I thought I was seeing 3 satellites flying information. I checked the Nasa satellite tracking site and didn92t find anything that matched what I saw."],"Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Summary":"three craft in triangle formation","Date Submitted":"09/09/2002 08:45 UTC","Object Shape":"Undisclosed","files":["/var/www/straped/mufon/html2text/1867.html.txt","/var/www/straped/mufon/org/1867.html"]}