{"Date of the Event":"08/11/2009 10:10 UTC","Object Shape":"Other","Country":"United States","divs":["Sighting DetailsI was walking my dogs Eastward along the sidewalk and above the tree line across the street was a bright orange ball. It appeared to be stationary and I thought to myself that it was strange that I never noticed that object before. Then it occurred to me that this object had never been there before so I began to try to determine if it was moving. Initially, it appeared to me to have three streaks of orange light emanating from the bottom. At no time did I hear any sounds except for those of the cars driving along the street. If I had to compare it to a real life object, I would compare it to a bright orange, luminous hot air balloon. I walked Southward and could not discern if it was moving in the opposite direction than I was walking or if it was stationary. I continued to look away in the direction I was walking and then look back. During this process of my looking away and looking back, it seemed as if the object changed it's position in the sky by about 100 feet during the moments that I was not watching it. The object continued to be about parallel with me as I walked. I would continue to turn my head and check on it every few feet and it did appear to be moving very, very slowly. Then, when I turned to check again, it was so far away that it only appeared as if three small points of light consisting of two red and one yellow. I figured that the experience had concluded and I began walking back toward my street. It was not much more than one to two minutes later that I felt the urge to turn around and there it was again hovering over the treetops of the houses across the street. As before, it was either stationary or moving very slowly. I watched as I walked and kept trying to find a plausible explanation for this orange light. As I continued on my route back home I lost sight of it due to trees obscuring my view."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.127632,+-84.419893(18674)&iwloc=A&hl=en\"> mufon case (18674) map </A>","Weather Factors":"Unknown","Summary":"The shape was like an upside down horseshoe and it was bright orange, with the quality, brightness, and color of a neon light","Case Number":"18674","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around August 11th 2009"],"Source":"MUFON","Tags":"City","Date Submitted":"08/11/2009 10:10 UTC","Region":"Ohio","Longitude":"-84.419893","Object Features":"None","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18674.html.txt","/var/www/straped/mufon/org/18674.html"],"Latitude":"39.127632","Viewing Distance":"101-500 Feet","Log Number":"US-08142009-0019","City":"Cincinnati","Object Flight Path":"Stationary,Other","Disposition":"Insufficient Data"}