{"trends":["There have been 59 other sightings in Tulsa","There were no other sightings in Tulsa on or around August 13th 2009"],"Region":"Oklahoma","Object Shape":"Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.161562,+-95.982845(18675)&iwloc=A&hl=en\"> mufon case (18675) map </A>","Log Number":"US-08142009-0020","Summary":"Stationary UFO with flashing white light sighted in South Tulsa, Oklahoma on August 13, 2009.","Source":"MUFON","Longitude":"-95.982845","Country":"United States","files":["/var/www/straped/mufon/html2text/18675.html.txt","/var/www/straped/mufon/org/18675.html"],"Case Number":"18675","Latitude":"36.161562","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I were driving home from an engagement, going south on South Lewis Avenue to the intersection of 51st Street and South Lewis. We stopped at the traffic light for a few minutes and both noticed a bright flashing white light, about the intensity of a commercial aircraft landing light but it appeared to be a tad brighter. It was just over the power lines in the distance, slightly to the east of Lewis Avenue. My first thought, because of altitude and where it appeared (near Jenks airport and close to flight path for Tulsa airport), that it was a commercial jet on approach but upon seeing the white flashing light, I knew it was something else. The light appeared to be stationary in the sky. Our next thought was it could be a antenna light on top of a building, but they are always red and I had never seen this light before at night. It was flashing on and off every 2 seconds. The flashing pattern was similar to a light at the top of a tower. As we continued driving towards home, we watched the light and it was not moving. So we decided to check it out. We drove south on Lewis toward East 61st Street and the light appeared to be stationary just in front and above us, at the west edge of the Southern Hills golf course and slightly east of Lewis Avenue. A helicopter flew underneath the light at a lower altitude from east to west and began a circle to the south. As we got closer, the light appeared to have projections (wings?) on both sides of the light. At the end of each projection was a red light with a green light beside it. Keeping an eye on the light, which was now directly above us and slightly to our left, I opened my window and we pulled into the bank parking lot just south of 61st as I opened the sunroof for a better look. We stopped in the parking lot within a few seconds after turning off Lewis and looked up at the light. Nothing. It was gone. We scanned the sky around us and saw nothing. We heard no sound from it. After setting for a few minutes trying to figure out where it went and what we saw, we noticed the helicopter flying by in the distance and heading north, leaving the area. The weather was clear and I don't think the moon had risen yet. But this is not the end of the story. I was laying in bed at about 11:00pm later that night and couldn't sleep. The blinds were open. With the blinds open, I have a good view of the southwest portion of the sky. I have seen, at night, helicopters flying overhead, some using search lights (probably police helicopters), and an occassional plane going to Jenks airport. They are easily heard as they pass overhead. Well, this time I saw something I haven't seen before. At a very low altitude, I saw what looked like two bright headlights of a car, with a space between the lights (like a car) and a faint blinking red light between the bright lights. It flew over the house at a relatively slow speed, but faster than, say, a helicopter. And unlike other craft I've seen passing by, it was completely silent. I hopped up and ran to the backyard but it was gone and it did not return while I was awake. End of report."],"Tags":"City","Sighting Duration":"00:07:00","Date of the Event":"08/13/2009 09:20 UTC","City":"Tulsa","Date Submitted":"08/13/2009 09:20 UTC","Object Features":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Undisclosed"}