{"divs":["Sighting Details I was sitting on a bench at Alexander Park here in Windsor which faces Belle Isle in Detroit, with my Shiu-Tzu after her walk, and was watching the 8:33 P.M. sunset!! About 5 minutes later I noticed what appeared to be a star glowing brightly through the blue of the sky. I noticed it because a jet flew above me and I watched it as it passed to the left side of the bright object. I thought at first I was seeing the Planet Venus because it was just that bright, but realized that Venus would have been in the western sky had it been setting, but I was facing roughly NNE. I watched the object for about 2-3 minutes to see if it might have been a satellite or something but it was stationary. I watched it for about 10 minutes or so and looked down for a few seconds as a Boat passed, and when I looked up again it was gone. I found this to be very odd because it should have still been there if it was a star or planet. I even waited until the sky began to darken to see if it would pop out into the deeper darkness of the sky but it was just simply gone. I went back to the same spot today Saturday August 15 and watched the sunset again and there was no sign of the star like object anywhere to be found. I used two radio towers in Detroit as markers and the altitude was about 35 degrees up almost directly in front of me, so if it was a star it should have been there again tonight!! I don't know why I am so caught up in this but for some strange reason it has me feeling odd!! Being an Amateur Astronomer I even looked up the area on a star chart and there is nothing of this magnitude that would have been in that area of the sky at that time. The fact that it would have outshone Venus or Jupiter is what prompted me to make this report!!"],"Sighting Duration":"00:10:00","Object Flight Path":"Stationary","City":"Windsor","map":"<A HREF = \"http://maps.google.com/maps?q=42.297896,+-82.988265(18689)&iwloc=A&hl=en\"> mufon case (18689) map </A>","Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/18689.html.txt","/var/www/straped/mufon/org/18689.html"],"Weather Factors":"Unknown","Log Number":"CA-08162009-0001","Summary":"Very Bright Star Like spot in NNW clear blue sky!!","Object Features":"None","Case Number":"18689","Country":"Canada","Region":"Ontario","trends":["There have been 18 other sightings in Windsor","There were no other sightings in Windsor on or around August 14th 2009"],"Date Submitted":"08/14/2009 08:38 UTC","Object Shape":"Star-like","Date of the Event":"08/14/2009 08:38 UTC","Longitude":"-82.988265","Latitude":"42.297896","Tags":"City"}