{"trends":["There have been 5 other sightings in Sheridan","There were no other sightings in Sheridan on or around August 14th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.136148,+-86.212049(18682)&iwloc=A&hl=en\"> mufon case (18682) map </A>","Disposition":"Unknown","Object Shape":"Star-like","Summary":"Baby star dimly shining and moving like the space station does, then WOW, SURPRISE SURPRISE.","Log Number":"US-08152009-0006","Case Number":"18682","Date of the Event":"08/14/2009 12:00 UTC","City":"Sheridan","Weather Factors":"Unknown","Region":"Indiana","Country":"United States","Latitude":"40.136148","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Date Submitted":"08/14/2009 12:00 UTC","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18682.html.txt","/var/www/straped/mufon/org/18682.html"],"divs":["Sighting DetailsMe and my neighbors were sitting on my porch last evening visiting on a beautiful night. They (neighbors) have a habit since my last sighting that was close and so so mind blowing, of watching the sky. Took me a bit of time to come back outside and scan the skies after the triangle sighting few months ago..Kinda gives you a WOW moment to see a strange craft closer than you think it should be. Had to deal with that experience in my adult life. I also had one when I was a child but that one was easier to take. I have already shared those experiences with MUFON. Had a strange strong weird feeling I should look up at the sky. The feeling was like I was being asked to. That definately was a weird feeling. I looked up and saw a little star moving at a good rate of speed. It was very tiny. Not something someone would notice because it was so dim but moving. Out of all the big expansive sky, I looked directly at this tiny tiny moving light and just kept staring at it..It was way way up there like it was meant to fit in with the stars. All of a sudden it stopped directly within my sight and morph up with light brighter than the largest brightest star in the sky at the time. I thought it was coming down towards us and that is why it was getting brighter but it wasn't..After a minute of putting on a good show of pulsating blinding light, it dimmed out and went on towards the southeast. I had this happen to me couple months ago and we started waiving to the craft way up there thinking it would never know we were waving and saying hello. That way up sighting was followed up with a low low triangle slow slow fly over 30 minutes later the very same evening. My neighbor said last night, are they saying hello again as this seems weird for things like this to happen right in front of your face. Guess they could be saying hello..Last night the star was like the craft that fly over the James Gilliland ranch in WA state and get very bright and huge..Just wanted you to know I am back outside and have accepted what I see and I can't explain is no reason for fear. The lady I originally spoke with from MUFON via email couple months ago really helped me ease my fear of what I witnessed then and suggested I give myself time. I did."],"Object Flight Path":"Undisclosed","Longitude":"-86.212049"}