{"Log Number":"VN-08152009-0007","Case Number":"18683","Summary":"Bi-pedal creature found after B-52 bombing run","Region":"Wyoming","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"09/01/1968 12:00 UTC","Country":"United States","Weather Factors":"Unknown","divs":["sighting detailsthe alleged swamp creature in the florida ever-glads area seen over the years may be accounted for by the following incident per investigations and the u.s.navy. allowing for a bombing run vietnam by b-52's a alleged creature now matching the description was found in the area of the bombing run apparently, deceased. now, it is assumed for the following reasons, that the creature was in shock due to the percussion of the bombing run and later dilivered to a military base (or facility) in florida. while the creature was un bagged and laid out on the slab or room, perhaps pictures were taken? and\\or discussions began as to what this creature could be? apparently, over the next few days persons began to examine the creature and discuss the matter, then, after a few days apparently, the creature disappeared one morning. it was assumed that some one had taked it but due to subsequent inquiries and investigation's and piecing of the puzzle,over a period of years, it was determined that perhaps the swamp creature and the missing creature from the military base in florida captured from vietnam are one in the same. the descriptions are very similiar.mufon could solve this case somewhere. per bernard mendez mufon field investigator#1038"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.764119,+-109.027454(18683)&iwloc=A&hl=en\"> mufon case (18683) map </A>","Object Features":"Undisclosed","Latitude":"44.764119","Source":"MUFON","Longitude":"-109.027454","Date of the Event":"09/01/1968 12:00 UTC","files":["/var/www/straped/mufon/html2text/18683.html.txt","/var/www/straped/mufon/org/18683.html"],"Object Shape":"Undisclosed","trends":["There have been 5 other sightings in Cody","There were no other sightings in Cody on or around September 1st 1968"],"Tags":"City","Disposition":"Unresolved","City":"Cody","Object Flight Path":"Undisclosed"}