{"Source":"MUFON","divs":["sighting detailsi was taking a really late drive through pleasanton at 4 in the morning, and on my way back home i saw two brightly shining orbs in the distance to my right. they were vertically parallel, and the bottom one was slightly bigger (ie. closer). because i'm deathly curious and and a ufo\\alien fanatic, i immediately turned in that direction. gradually the bottom orb increased in size as i twisted through the neighborhood i'd entered, and before i knew it i was almost directly beneath it. no longer appearing as an orb, the ufo was extremely close enough to the ground; i'm not great with measuring distances, but to give you an idea, to my vision it was about the size of making circle with your index finger and thumb. it was rather egg-shaped, if the egg were on its side, and it appeared to be black, although it's hard to distinguish color at night. i remember the arrangement of the ship's lights looking rather like three, bright bug-eyes. as i raced through the suburban streets to keep pursuit, the ufo slowly flew overhead at a constant pace. eventually it decided it was done there (or as i like to believe, wanted to lose me) and picked up speed so it was impossible to continue the chase. i watched it fly away from me, and suddenly it was above the hills on the far side of town. hopeful to see more, i drove in that direction, and during this drive i saw two more very shiny orbs hovering on either end of town. after waking up another space-loving friend of mine to watch the two, i changed course for a nearby set of hills one of them seemed to be over. when the orb didn't get any bigger after a short hike, i gave up, but from that hill i had a fantastic view of one of the ufos directly above the center of the valley. as the sun was coming up around 6am, i finally drove back to my home on the outskirts of town only to clearly see one of the ufos directly above the neighboring town of livermore in the morning sky."],"Date of the Event":"08/14/2009 12:00 UTC","Date Submitted":"08/14/2009 12:00 UTC","Log Number":"US-08152009-0004","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Egg","Tags":"City","Object Features":"Undisclosed","Region":"California","Country":"United States","Case Number":"18680","City":"Pleasanton","Viewing Distance":"Unknown","Summary":"Three or more UFOs observe Pleasanton and the Tri-Valley area; I observe them right back.","files":["/var/www/straped/mufon/html2text/18680.html.txt","/var/www/straped/mufon/org/18680.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.669251,+-121.866879(18680)&iwloc=A&hl=en\"> mufon case (18680) map </A>","trends":["There have been 5 other sightings in Pleasanton","There were no other sightings in Pleasanton on or around August 14th 2009"],"Disposition":"Hoax","Longitude":"-121.866879","Latitude":"37.669251","Object Flight Path":"Undisclosed"}