{"map":"<A HREF = \"http://maps.google.com/maps?q=41.318255,+-81.432633(18688)&iwloc=A&hl=en\"> mufon case (18688) map </A>","Case Number":"18688","Object Flight Path":"Undisclosed","Date Submitted":"08/15/2009 09:45 UTC","Region":"Ohio","Date of the Event":"08/15/2009 09:45 UTC","trends":["There have been 5 other sightings in Twinsburg","There was one other sighting in Twinsburg on or around August 15th 2009"],"divs":["Sighting DetailsAugust 15, Appx 9:45 pm We had just gotten home from eating dinner out and were making last minute packing adjustments for an out of town trip first thing in the morning. Lexi T. arrived at our house, XXXX Cannon Road in Twinsburg After pulling into the driveway she called Stephen F. on his cellphone as she was engrossed in watching the lights. She told Stephen F. that there were strange lights in the sky. Stephen F. and Laurie S. F. went outside and observed a diagonally ascending row of approximately 10 orange colored lights proceeding from E. NE. to W. NW. at a steady pace. Laurie S. F. came in and told me, Chris K. to come outside. I ran outside onto Cannon Road at approximately 9:50 or perhaps a few minutes earlier and observed approximately 7 orange colored fiery (illuminated) lights moving across the sky to the north at approx 20 degrees above the horizon. At first I thought the lights were military helicopters on manouvers but shortly after beginning to watch them they began to \"wink\" out, turning off whatever illumination was being used. Once the orange illumination was extinguished there was no light remaining on the objects. We stood around talking about it in disbelief and then I ran inside to get my 35mm camera. Unfortunately I'm unfamiliar with the settings for night use so when I came back outside I wasn't able to take any photos of what happened next. The orginal lights were gone but there was a single orange light approaching our location from the NE at a steady pace. I was sure that it would shortly reach our location but before doing so the light went out. No noise was heard in association with any of the objects. After this we discussed what had happened and Lexi T. informed us that when she first pulled in the driveway and got out of her car the lights were very closely clumped together in a spherical shape. Once she summoned others the lights were already arranged in the diagonally \"ascending\" line from East to West. No one involved ever heard any sound associated with what was seen."],"Weather Factors":"Unknown","Country":"United States","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18688.html.txt","/var/www/straped/mufon/org/18688.html"],"Latitude":"41.318255","Log Number":"US-08152009-0012","Tags":"City","Summary":"Multiple orange lights moving across the night sky and then \"winking\" out.","City":"Twinsburg","Object Shape":"Fireball","Object Features":"Undisclosed","Longitude":"-81.432633","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}