{"Sighting Duration":"Undisclosed","Object Shape":"Oval","trends":["There have been no other sightings in Perth","This sighting has never been favorited."],"Object Features":"Undisclosed","Latitude":"44.898795","Viewing Distance":"Unknown","City":"Perth","Log Number":"CA-08162009-0002","Summary":"At first, thought object was a satalite, but was moving too fast and color was clear & brighter and a lot lower in attitude. The object took about three minutes to clear the sky line. No sound was heard. No blinking lights was seen.","Tags":"City","Source":"MUFON","divs":["Sighting DetailsWhile camping at a cabin in Long Lake near Perth Onatrio, my wife and I were sitting by the lake at a low burning camp fire looking at the stars, when I noticed a moving bright object( oval shape) moving from the North west moving to the South West. At first, I thought the object was a satalite, but it was moving too fast and the color was clearer, brighter and a lot lower in altitude. The object took about three minutes to clear the sky line start to finish. No sound was heard. No blinking lights was seen. The object appeared the following night at the same time but with a different projectory and below overcast clouds. No stars were showning at that time because of the clouds.It was travelling at a high speed but again with no sonic boom or jet engine noise. This sighting was at Long lake in Ontario by Perth and witness by my wife and myself on both nights. I did manage to video tape the object on the second night but unfortunaity the video is low grade. I am a retired military person with experience within avaition field and if this was military type aircraft, I only hope it was ours."],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18690.html.txt","/var/www/straped/mufon/org/18690.html"],"Disposition":"Unresolved","Date of the Event":"07/24/2009 09:22 UTC","Weather Factors":"Unknown","Region":"Ontario","Case Number":"18690","map":"<A HREF = \"http://maps.google.com/maps?q=44.898795,+-76.248566(18690)&iwloc=A&hl=en\"> mufon case (18690) map </A>","Country":"Canada","Date Submitted":"07/24/2009 09:22 UTC","Longitude":"-76.248566"}