{"trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around July 29th 2009"],"Log Number":"US-08162009-0004","Date Submitted":"07/29/2009 10:25 UTC","Summary":"Light in sky not flashing.","Date of the Event":"07/29/2009 10:25 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Star-like","Latitude":"39.852537","map":"<A HREF = \"http://maps.google.com/maps?q=39.852537,+-86.392074(18692)&iwloc=A&hl=en\"> mufon case (18692) map </A>","files":["/var/www/straped/mufon/html2text/18692.html.txt","/var/www/straped/mufon/org/18692.html"],"City":"Brownsburg","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Disposition":"Insufficient Data","Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Indiana","Longitude":"-86.392074","divs":["Sighting DetailsWent out on back deck to see the stars and look for meteorites before bed. Saw big dipper and counted approx. distance to morth star as I have done since I was a kid. As I was looking at north star another star? became visible approx. 1\" held at arms length westerly from north star and gradually became brighter untill it was as bright as sirius. Then this star started moving slowly towards west approximately 2\" @A.L. and gradually disappeared. I yelled to my friend but she was unstairs with her daughter and did not hear me. 2to3 minutes later the star reappeared stationary near big dipper and did repeat performance but this time when at it hightest brightness it made a small U motion and flashed off as if a switch had been turned off. I am 58 years old and have been watching the sky my entire life, grew up with telescopes as a child and adolescent and have never seen anything like it before. Definitely not normal and wished my girlfriend had seen it. Extremely high in sky thus thinking it was star but stars do not move stop and move again. Conditions very clear great sky watching. Told some of my neighbors and they did not think I was crazy. We are all watching now."],"Country":"United States","Case Number":"18692","Viewing Distance":"Over One Mile"}