{"Case Number":"18696","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around August 16th 2009"],"Latitude":"33.43334","Sighting Duration":"01:30:00","Date Submitted":"08/16/2009 02:00 UTC","Source":"MUFON","Longitude":"-111.932285","Log Number":"US-08162009-0008","Weather Factors":"None","Summary":"ball of light flying fast around valley, Luke AFB jets (6-8) chase it","Tags":"City","Object Features":"Undisclosed","City":"Tempe","Disposition":"Unknown","Region":"Arizona","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18696.html.txt","/var/www/straped/mufon/org/18696.html"],"divs":["Sighting DetailsNo airplanes were allowed in airspace since Barrack Obama is flying into phoenix. i was up late looking through my sky scout and noticed a ball of light streaking accross the sky, just like a satellite would. I notice that it was moving and flying in pattern that satellites don't. It from southeran sky to the north then erratic flying including altitude changes. This lasted for 15 minutes before it disappeared. I sat back down in my lawn chair and started to notice flashing lights from a plane, they were jets from LAFB. There was at least 6 jets flying in teams of two very high and very fast towards the north sky, I stood up and looked at them and then noticed that they were following the ball of light that had returned. Another interesting thing i observed, the fighter jets would turn off their blinking light when they were trying to chase this ball of light. The ball of light, from my perspective appeared to fly out into space. I would lose track the jet but after 30 minutes I could see them in pairs of two flying around the valley. Not much too describe about the ball of light. It appeared to be the same size as Jupiter but had an orange tint to it's light. It was able fly really fast and several times it flew out of sight and would reappear. I quickly learned that by watching the fighter jets, I could spot the ball of light. They would break their pattern, so I would just look in the direction they were flying. Very interesting night :)"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.43334,+-111.932285(18696)&iwloc=A&hl=en\"> mufon case (18696) map </A>","Date of the Event":"08/16/2009 02:00 UTC","Viewing Distance":"Unknown","Object Shape":"Circle, Oval","Country":"United States"}