{"Disposition":"Unknown","Region":"Ohio","Log Number":"US-08162009-0009","files":["/var/www/straped/mufon/html2text/18697.html.txt","/var/www/straped/mufon/org/18697.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.315705,+-81.436563(18697)&iwloc=A&hl=en\"> mufon case (18697) map </A>","Longitude":"-81.436563","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["Sighting DetailsAfter taking my sister home at 10 p.m. and stepping out to help her into her home, we noticed 3 fast moving objects-moving side by side, that appeared to come from NW.They were very high in altitude.We at first thought they might be satellites or something of that nature. While watching for 2 or 3 min., they stopped.The one on the left just disappeared, and then the middle one shot straight up and began to dart around left to right and up and down. The one on the right sat perfectly still and had a red, dome shaped top and brilliant white lights around the outside of the round or disc shaped bottom. The middle one rejoined this one and they flew off headed NE. My husband, my sister and I talked about it for a while. We were on Ravenna Rd. near Glenwood Dr. I asked my husband if we could go to Liberty Rd. where it is near a park and less bright lights, etc. for a better view. We pulled into a driveway near the visitor's center,turned our car off and got out. 2 object came up very suddenly from the west. They were flat and oblong and each had 3 very bright round lights on them. They were traveling slower than the first things we saw. They headed NE at a height that most small planes fly at.They stopped suddenly and the one on the left banked off to the left and headed slightly upward. It turned, came back down and beside the rt. one and they flew off to the east. None of us felt afraid, which is strange. We were all very calm. We headed home and got there about 10:45p.m."],"Object Shape":"Circle","Case Number":"18697","Date of the Event":"08/15/2009 12:00 UTC","Date Submitted":"08/15/2009 12:00 UTC","City":"Twinsburg","trends":["There have been 5 other sightings in Twinsburg","There was one other sighting in Twinsburg on or around August 15th 2009"],"Object Features":"Undisclosed","Latitude":"41.315705","Summary":"This was definately not an imagined or false sighting.We saw objects and lights that did not come from ordinary aircraft.","Source":"MUFON","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown"}