{"Date Submitted":"08/16/2009 07:15 UTC","divs":["sighting detailsabout 7:15 pm sunday , a smoggy(visibility still good) but sunny north view from my 15th floor apartment, i am talking on the phone to a friend , and i look out the window to the horizon. to the left ahead i notice a ball descending from the sky towards the roof of factory#1. i take out my mini binoculars that i have on my window and look. it is a dark grey metal ball about 21\\2to 3 feet in diameter that is reflecting sunlight on the left portion of it, (west side).it slowly makes its way across the horizon to factory #2(east) where it descends as if it was going to land, but it hovers over the roof momentarily, then goes up again and continues eastward to factory #3 where it slows down and hovers momentarily , then continues over the factory edge into the treed valley below. the factories are between 12 to 15 blocks away.it was not a bird or remote control plane. i never see it emerge from the valley. i have never seen an object descend like that. i have seen hospital emergency helicopters and many, many airplanes of all sorts, but this was a metal ball. i couldn't figure out what it was. it wasn't a bird. it wasn't a plane. then iconsidered a remote control plane, but the distance was too far and high for that, besides, it was a metal ball."],"Country":"Canada","map":"<A HREF = \"http://maps.google.com/maps?q=43.662866,+-79.374984(18704)&iwloc=A&hl=en\"> mufon case (18704) map </A>","Object Features":"None","Source":"MUFON","Summary":"A dark grey metal ball about 3 feet in diameter descended slowly out of the sky and makes its way across three factory roofs(descending and ascending) eventually disappearing into a treed valley below","Object Shape":"Sphere","Longitude":"-79.374984","Tags":"City","Case Number":"18704","files":["/var/www/straped/mufon/html2text/18704.html.txt","/var/www/straped/mufon/org/18704.html"],"Weather Factors":"Unknown","City":"Toronto","trends":["There have been 136 other sightings in Toronto","There were no other sightings in Toronto on or around August 16th 2009"],"Region":"Ontario","Object Flight Path":"Hovering then path,Path then hovering","Latitude":"43.662866","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Date of the Event":"08/16/2009 07:15 UTC","Log Number":"CA-08162009-0016"}