{"City":"Jessup","Longitude":"-75.552771","Region":"Pennsylvania","Object Flight Path":"Stationary","Object Features":"Dome","Tags":"City","Date Submitted":"08/01/2009 10:00 UTC","Summary":"Saw blinking stationary light. Took 3 pics 2 while light on and one with lights off","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Unknown","trends":["There have been 2 other sightings in Jessup","There were no other sightings in Jessup on or around August 1st 2009"],"Case Number":"18701","map":"<A HREF = \"http://maps.google.com/maps?q=41.472652,+-75.552771(18701)&iwloc=A&hl=en\"> mufon case (18701) map </A>","Weather Factors":"Unknown","Latitude":"41.472652","files":["/var/www/straped/mufon/html2text/18701.html.txt","/var/www/straped/mufon/org/18701.html"],"Country":"United States","Viewing Distance":"Over One Mile","divs":["Sighting DetailsA friend and I were running up to the top of the hill in Jessup Pa (church St). I was going to a friends house because earlier we had thought we saw a UFO. It turns out it was not a UFO. While walking down the hill, my friend who is slightly skeptical saw a \"star\" appear out of nowhere. There were no clouds that night. I took 3 pics. One while light blinked off, this shows an obvious solid object in the sky the fits the normal description of a UFO. It is plain as day to me, but others may have their doubts. The pics while the lights were on were odd-shaped, and different both times. The object, though, is still lit up maybe from inside or the light was dimmed for some reason. I am an avid \"sky-watcher\" and that is why I got a digital camera. This is great for me, however, I have a computer from 1999 or 2000 and none of the software works so I cannot send the pics. What should I do about that? I am going to try a friend's computer and see if I can send the pics from there. It is important to me to get this out so if it is okay I will fill out another form here if I need to. I was astonished the an hour later when i noticed it JUST MAY BE a UFO! Everyone knows I would not make this up, so the picture is true and so is the story, and that makes me watch the sky even longer now! I will go to the nearest photo shop tomorrow and get these printed out. There is also another pic I JUST NOTICED of a gray orb with almost symmetrical designs in it, it was in the sky, so I doubt it was a dust particle in front of the camera or anything like that. Ill include all personal information, contact me anytime between 11Am -11Pm 7 days a week. These pics will be mailed within the week. Also, the work number listed is my mother's, I left it there in case I am not around, and I look forward to hearing from someone"],"Log Number":"US-08162009-0013","Object Shape":"Circle, Oval, Sphere, Other, Unknown","Date of the Event":"08/01/2009 10:00 UTC"}