{"files":["/var/www/straped/mufon/html2text/18708.html.txt","/var/www/straped/mufon/org/18708.html"],"Longitude":"-79.988576","City":"Pittsburgh","divs":["Sighting DetailsI moved to Trafford, Pa. in late January of this year. Since doing so I have seen some very strange things. First it was the chemtrails. The spraying here has just slowed down in the last few weeks, but it has been constant and heavy since about mid February. I was really alarmed by it and the only reason I know the term \"chemtrail\" is because I started looking into what these planes were spraying. I had never even heard the term before this year. I have lived in Pittsburgh my entire life. On the heaviest day of spraying in May I stopped for lunch at Burger King in Haymaker Village. I decided to eat in my car and watch the planes as the sprayed an enormous grid over Trafford and Monroeville. I was sitting there and trying to figure out what the hell they were doing when something caught my eye near the top of the tree line. It was a dull gun metal black sphere about the size of a large beach ball. It was slowly moving along the tree line straight across from Haymaker Village. It was not a balloon or some sort of toy. It was controlled and its movement was very smooth and straight. There was no wind that day. I thought this occured in May, but it must have been earlier than that, because there weren't leaves on the trees yet. I kept looking around to see if anyone else saw it and I fwelt like I was going crazy. It appeared to have weight to it, I can't explain it...but I think if it fell out of the sky and hit you on the head you'd have a crushed skull. It was no balloon. I am asuning that it was under military control and that it was a surveliance drone of some kind. Maybe to monitor the chemtrail activity ? It really affected me. I used to love walking my dog at night. I have not walked him at night since this event. I walk him in the morning and take him in the yard aty night. I don't like to be out at night for fear one of those things will be around and I won't even know it. I also took down the sheer drapes I had in my apartment and replaced them all with thermaback block out drapes. I have seen the big chemtrail X's and tic tac toe boards. I have seen heavy spraying in Monroeville, Trafford, Murrysville, White Oak and North Versailles. I have seen black beams of light ( partical beams? )One with a military jet seemingly folllowing the path of the beam across the sky. I have seen pure white unmarked planes and military jets criss crossing the sky. I have watched the military aircraft create the giant X's. I have seen the chemtrail spray turned on and off in mid air-these ARE NOT CONTRAILS. I also saw one of the white planes vanish in front of my eyes in a clear blue cloudless sky. Poof...gone. Like it had been erased. I have seen upside down oily rainbows in the sky. There have been alot of UFO reports out of the area. If anyone would like to talk to me about all or any of this I'd love a sounding board. You can email me at melissaanncan@yahoo.com. It has been driving me crazy for months. I was so happy to see that someone else has posted about the sphere, although theirs was gray and mine was black. At least I know I'm not losing my mind. I intend to walk my dog at night again...I just have to work up a little more courage!"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.441935,+-79.988576(18708)&iwloc=A&hl=en\"> mufon case (18708) map </A>","Case Number":"18708","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Date of the Event":"05/15/2009 12:30 UTC","Object Features":"None","Country":"United States","Object Shape":"Sphere","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around May 15th 2009"],"Log Number":"US-08172009-0004","Weather Factors":"None","Date Submitted":"05/15/2009 12:30 UTC","Summary":"Black \" ball \" slowly moving along top of tree line across from Haymaker village,","Source":"MUFON","Latitude":"40.441935"}