{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.17158,+-86.782583(18703)&iwloc=A&hl=en\"> mufon case (18703) map </A>","Source":"MUFON","Log Number":"US-08162009-0015","Date Submitted":"08/13/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/18703.html.txt","/var/www/straped/mufon/org/18703.html"],"Object Features":"Undisclosed","City":"Nashville","Disposition":"Unknown","Tags":"City","Summary":"UFO swarm","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around August 13th 2009"],"Object Shape":"Circle","Weather Factors":"Unknown","Date of the Event":"08/13/2009 12:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was in Nashville, TN by the river (100 1st Ave. N) listening to Old Crow Medicine Show. I saw a lady sitting in front of me point toward the sky, and when I looked up I saw four or five orbs of white light flying through the sky. It looked like an air show would, with the objects criss crossing each other and flying around each other but in no noticable formation. The orbs increased in number as I watched, at most there were twelve all flying together. There was no sound and the lights did not flash but dimmed and then brightened again. The lights were fairly dull and appeared to dim when the object was turning. The objects would make 90 degree angles at full speed and drop very quickly. There were also planes in the sky flying overhead toward the airport, but no aircraft flew through the circular lights. I kept waiting for the objects to collide, because they were flying so closely past each other. I thought the objects may have been private planes or test flights, but the more I looked at them, there were too many and they were flying to dangerously to be test flights. I also thought maybe it was some kind of laser or light show, but it was very cloudy and I saw no beams. The movement of these objects reminding me of the movement of fireflies. I was curious but not afraid and I wondered why no one else was watching these lights. No one seemed to notice them or think it was strange. The lights continued for over an hour, an hour and a half at most. The lights gradually disappeared a few at a time. I looked up and saw that two remained and the next time I looked they were all gone."],"Country":"United States","Region":"Tennessee","Object Flight Path":"Undisclosed","Latitude":"36.17158","Case Number":"18703","Longitude":"-86.782583"}