{"Tags":"City","divs":["Sighting DetailsI have insomnia,so I often find myself outside on my back porch, smoking a cigarette, and staring up at the night sky. My love for stargazing dates back to early childhood with my father. Around 6 a.m. this morning, I was outside, looking at the sky, hoping to see a falling star. We have had some really nice ones lately. I was looking in a particular cluster of stars when I noticed a very dim \"star\" that was moving. It moved across the sky from left to right. As it neared the right side of my viewing area I saw a second dim \"star\" moving equally fast coming from the opposite direction. They passed each other coming quite close together. At that time, they both abruptly changed directions. The first \"star\" flew sraight up for a short distance, where it became a very bright flash of light (like a flash bulb on a camera), and then disappeared. The second \"star\" looped around, flying a short distance, and then stopped. It remained still for about two seconds, then took off in a diagonal direction, disappearing in a bright flash just like the first one. Unfortunately, I had no camera. After the lights disappeared, I knew I had seen something unlike anything I have ever seen in my 40 years. It flew too fast and changed directions too quickly to be a known aircraft. The lights seemed very high up in altitude and I was unable to ascertain a shape. It looked like a dim white star and did not fluctuate in its intensity. I also heard no sounds associated with it. There were no other planes or anything in the air at that time. I'm not sure what it all was, but I was certainly impressed by it."],"Longitude":"-82.470655","Case Number":"18718","map":"<A HREF = \"http://maps.google.com/maps?q=28.997477,+-82.470655(18718)&iwloc=A&hl=en\"> mufon case (18718) map </A>","Date of the Event":"08/17/2009 06:00 UTC","Object Flight Path":"Path with directional change","Object Shape":"Flash, Unknown","files":["/var/www/straped/mufon/html2text/18718.html.txt","/var/www/straped/mufon/org/18718.html"],"Disposition":"Insufficient Data","Viewing Distance":"Unknown","trends":["There have been no other sightings in Citrus Springs","This sighting has never been favorited."],"Log Number":"US-08172009-0014","Summary":"I saw two lights in the early morning darkness that moved independently of each other and unlike anything I've ever seen.","Source":"MUFON","Region":"Florida","Country":"United States","Weather Factors":"None","Latitude":"28.997477","Object Features":"Unknown","City":"Citrus Springs","Date Submitted":"08/17/2009 06:00 UTC","Sighting Duration":"Undisclosed"}