{"City":"Valley","Case Number":"18719","Latitude":"32.912405","Sighting Duration":"Undisclosed","Log Number":"US-08172009-0014","Weather Factors":"None","Region":"Alabama","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"08/09/2009 04:10 UTC","Summary":"Noticed a flash in the sky , watched it move slowly ,it was very shinny, reflecting sunlight ,videoed several minutes of it.","Tags":"City","files":["/var/www/straped/mufon/html2text/18719.html.txt","/var/www/straped/mufon/org/18719.html"],"Date Submitted":"08/09/2009 04:10 UTC","Object Flight Path":"Path with directional change","Longitude":"-85.353615","trends":["There have been 3 other sightings in Valley","There were no other sightings in Valley on or around August 9th 2009"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.912405,+-85.353615(18719)&iwloc=A&hl=en\"> mufon case (18719) map </A>","divs":["Sighting DetailsMy self and my neice's boyfriend were going to move a few hay rolls ,and while walking to the area where the forks were to put on the tractor I looked up to the sky and seen a flash, first I thought it was the sun reflecting off of a airliner which I have seen before, but this was not the case, I estimate the object to be about 2,000 feet up and about 1,000 feet north of me and the size of a large car ,sort of spinning and twisting , it reminded me of a silver mylar baloon because of the way it was shinny and reflective. I stoped my neice's boyfriend , he was on the tractor, he said what the hell is that ? and how did you see it ?.He watched it for a few seconds and said ,it's probably a weather baloon and started the tractor up and continued. I stood there watching it for about 30 seconds and thought , I need to be videoing this, my truck was 100 yard away but I didn't even think about it and took off running to my house , it was about 500 yards away. I got in the house ,grabed the camera and tripod and got outside and noticed the camera didn't have the mount for the tripod on it! so instead of wasting time looking for it I left the tripod and ran another 100 yards to a pasture behind my house. It took me a few minutes to locate it again. It seemed to have moved futher north but was still flashing and turning in all directions, then it started slowly desending and moving southeast. At times it seemed to change shapes .I have reported ufo's to mufon before and I'm not totally convinced this one is extraterrestrial but I have no idea what it could be.I have several minutes of video but I could'nt figure out how to upload it to you .I've got it on dvd and I'll keep it on my hard drive on the camera if you want to see it."],"Country":"United States","Object Features":"Unknown","Object Shape":"Disc, Sphere, Teardrop, Triangle"}