{"Disposition":"IFO","Source":"MUFON","divs":["Sighting Detailsmy girlfriend and i were on the patio cleaning crabs for dinner, this has a western exposure, i went inside to get a pair of polarized sunglasses. after putting them on i looked west and noticed what i thought was a vapor trail above the clouds had not moved or dissapated. this was about 5 pm. if i removed the glasses this \"object\" was difficult to see. we continued to clean and continued to watch. i got our digital camera, aimed it thru the lens of the sunglasses and snapped a few pictures (theyare date and time stamped. the indicate where this \"object\" was in relation to the rooftops and other fixed reference points. maybe 15 - 20 minutes passed and still no dissapation. it remained as i first saw, a thin sliver of light, brighter in the center, but the left and right ends less brillant in appearance. however, it moved vertically but not diagonally or horizontally. i went to our neighbors and asked if they have seen this too. all did and were equally as perplexed. one of them confirmed that it was more visiable and defined by the use of polarized glasses. over the period of about an hour its brillance and angle remained constant, just moving up and down very slowly, contrary to the receding clouds. a vapor trail could not have remained intact for the dur ation of this event! i have seen other curios sights in past, this event now is number one on the list."],"Region":"New Jersey","Date of the Event":"08/16/2009 05:11 UTC","Country":"United States","Longitude":"-74.192009","Date Submitted":"08/16/2009 05:11 UTC","Object Flight Path":"Other","Object Shape":"Square, Rectagular, Other","Object Features":"Unknown","trends":["There have been 13 other sightings in Toms River","There were no other sightings in Toms River on or around August 16th 2009"],"Sighting Duration":"Undisclosed","Log Number":"US-08172009-0012","Case Number":"18716","Tags":"City","Latitude":"39.958779","Summary":"outside on patio, looking @ western clouds saw thin sliver of light above clouds","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/18716.html.txt","/var/www/straped/mufon/org/18716.html"],"City":"Toms River","Weather Factors":"Windy","map":"<A HREF = \"http://maps.google.com/maps?q=39.958779,+-74.192009(18716)&iwloc=A&hl=en\"> mufon case (18716) map </A>"}