{"Case Number":"18722","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/18722.html.txt","/var/www/straped/mufon/org/18722.html"],"Disposition":"Insufficient Data","Date Submitted":"08/17/2009 09:14 UTC","Object Shape":"Star-like","Latitude":"47.688488","Viewing Distance":"Over One Mile","divs":["Sighting DetailsLaying on a blanket in the backyard at dusk (staying cool on a warm evening). Very thin layer of clouds patchy over the sky, some stars show through. Spotted a satellite tracking from northwest to southeast about five minutes before. Noticed a bright white flash low (20 degrees?) in the sky to the northeast. Some trees in the way. I saw the flash again about 30 seconds later, approximately ten degrees further south from original flash. Called to my wife, who came outback. We watched it flash about five more times. The intervals between flashes seemed to vary between 30 and 60 seconds, maybe as long as two seconds. The light source appeared to track toward the south east for the duration of the sighting. After I lost sight of it in the southern sky--blocked by house and trees--I went to the front yard and picked it up again. Several airliners were visible on the southern horizon. Their familiar lighting configurations and strobing patterns were nothing like the flashing object. I caught two more flashes over a couple of minutes, and then could no longer spot the object. It was very bright, and appeared both brighter and larger (maybe twice as large) than Jupiter, which is currently visible to the south. The light, when flashing, was very bright. Almost like someone standing fifty feet away in the dark shining a bright flashlight directly at your face."],"Source":"MUFON","Weather Factors":"Unknown","Longitude":"-122.202085","Tags":"City","Summary":"Bright white flash, intermittent and irregular interval, crosses eastern sky","Country":"United States","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=47.688488,+-122.202085(18722)&iwloc=A&hl=en\"> mufon case (18722) map </A>","Log Number":"US-08182009-0001","Object Features":"Unknown","City":"Kirkland","trends":["There have been 8 other sightings in Kirkland","There were no other sightings in Kirkland on or around August 17th 2009"],"Region":"Washington","Date of the Event":"08/17/2009 09:14 UTC"}