{"Sighting Duration":"Undisclosed","Date Submitted":"08/16/2009 09:30 UTC","Summary":"Oval orange in color most closely resembled the color of flame","Log Number":"US-08172009-0016","Longitude":"-71.849791","divs":["sighting detailsi was cooking outside for my family. my nephew was on the top deck with me and he said to me what is that, a ufo? my sister and i laughed at him then my son yelled from the guest house \"look at the sky\" when we did we saw a bright orange object passing over us and headed east at a slowish rate of speed. now there were 5 of us gathered and we watched a total of 4 of the object following each other at a distance immeasurable to us. the object had no blinking lights at all. it reminded me of looking at a chinese latern in the dark. what really got me was the straight line it flew, as did those that followed it. it was not erratic at all. my feeling was we were seeing something never seen by us before. and i had no guess at what they could be. the objects eventually disappeared in the distance. when i got home i wanted to see if there were any sights that reported these events and i found you. i was shocked to find this report with pictures. http:\\\\mufoncms.com\\cgi-bin\\manage_sighting_reports.pl?mode=view_long_desc&id=18711&rnd=890281250563702 it is 100%, without a doubt the same as the sighting in france. the picture is absolutely accurate. my son has much smaller pictures. again we are 5 and all saw the very same thing."],"City":"Westerly","Case Number":"18721","Object Shape":"Oval","Weather Factors":"None","trends":["There have been 2 other sightings in Westerly","There were no other sightings in Westerly on or around August 16th 2009"],"Tags":"City","Region":"Rhode Island","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18721.html.txt","/var/www/straped/mufon/org/18721.html"],"Object Features":"Undisclosed","Disposition":"IFO","Date of the Event":"08/16/2009 09:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.313711,+-71.849791(18721)&iwloc=A&hl=en\"> mufon case (18721) map </A>","Latitude":"41.313711"}