{"Weather Factors":"Unknown","Log Number":"GB-08182009-0004","Object Shape":"Circle, Fireball, Flash, Oval, Sphere, Star-like, Other","Region":"England","divs":["Sighting DetailsI was in my front garden, in hove,UK, when i saw 10 or so yellow and orange glowing lights above the houses opposite, and were quite low. These lights hovered in the sky and stayed there for around twenty minutes then some disapeared hgiher and higher while some went over my house at spped. i thought these lights were planes at first however they were too close together and were the wrong colour. They looked very much like the lanterns you can get, which was my second thought however lanterns would not travel at a really fast speed. i was shocked and amazed when i saw these lights and ran into the house to show other witnesses.. The lights later came back, after i had a sleep around 2 hours and hovered there for another 20 minutes and instead of flying away they just got dimmer and dimmer and vanished. These orange and yellow glows look so similar to the ones on your home page, more or less identical, and was amazed that they were so close together,like i said i thought they were a group of planes but planes usually flash red or white lights ... which these did not. I first noticed them when i looked up and saw how low they were."],"Date of the Event":"07/27/2009 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18725.html.txt","/var/www/straped/mufon/org/18725.html"],"Case Number":"18725","Latitude":"50.852791","Country":"United Kingdom","Date Submitted":"07/27/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=50.852791,+-0.130252(18725)&iwloc=A&hl=en\"> mufon case (18725) map </A>","Source":"MUFON","Longitude":"-0.130252","Object Flight Path":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","City":"Hove","Disposition":"Unresolved","Summary":"10 Yellow glowing lights above my house and others in brighton and hove.","trends":["There have been no other sightings in Hove","This sighting has never been favorited."],"Object Features":"Undisclosed"}