{"Disposition":"Unknown","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Weather Factors":"Unknown","Object Shape":"Cylinder, Sphere","Log Number":"US-08182009-0003","Case Number":"18724","Tags":"City","Latitude":"40.448325","Longitude":"-79.987076","City":"Pittsburgh","Country":"United States","divs":["Sighting DetailsI was in my back yard cleaning my grill when I looked up saw what I thought was an airplane, as many travel overhead to land at the Morgantown Airport. It was very clear evening, I felt more compelled to watch and the shape was cylindrical and bright, no wings nor flashing lights, very much like an elongated zeppelin with flat ends. The craft was moving at about the same speed as an airplane, which is why it didn't occur to me that it was a UFO. The craft was traveling well above 3000ft by my estimate, and was heading South West at approx 200degrees on a compass pointing north. While trying to make out the craft, a large brown sphere materialized behind and to the right of the craft, moved to be directly behind the craft, then did a little dance or 'juke' the headed toward the left side of the craft and 'de-materialized'. The main craft the continued on it's 200 degree direction until it went over the horizon. I could not tell if the main object was reflective or emitting it's own light. The second object emmited no light and appeared solid for a brief time. There was no sound at all from either craft. While the craft was still traveling, I went into my home to get my spouse to witness but unavailable. So I waited until later in the night before I told my wife my what happened."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.448325,+-79.987076(18724)&iwloc=A&hl=en\"> mufon case (18724) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18724.html.txt","/var/www/straped/mufon/org/18724.html"],"Summary":"1 craft was cylindrical and reflective, 2nd was brownish orb","Date of the Event":"08/18/2009 07:30 UTC","Object Features":"Undisclosed","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around August 18th 2009"],"Date Submitted":"08/18/2009 07:30 UTC","Viewing Distance":"Unknown"}