{"Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"40.139138","Country":"United States","Disposition":"Unknown","Date Submitted":"08/18/2009 12:00 UTC","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.139138,+-86.216629(18731)&iwloc=A&hl=en\"> mufon case (18731) map </A>","Tags":"City","Object Features":"Undisclosed","trends":["There have been 5 other sightings in Sheridan","There were no other sightings in Sheridan on or around August 18th 2009"],"Longitude":"-86.216629","Date of the Event":"08/18/2009 12:00 UTC","Weather Factors":"Unknown","Region":"Indiana","divs":["sighting detailssomething woke me up at 5am this morning before my alarm went off. i mean right at 5am..don't have any idea what it was that woke me up but i jumped out of bed. for a 57 year old woman, jumping out of bed at 5am is not part of my physical fitness routine..i felt i was still in a waking up mode but went directly to the front door in my pj's and stepped outside onto my porch. the dogs followed me and went into the yard to do their morning thing. i thought what the heck am i doing out here in the dark on my porch. i looked at my insulin pump to see what time it was and i thought to myself, wow, what the heck, i could have sleep another 45 minutes or so. couldn't help but notice the sky was so beautiful, 1\\4 moon in the lower eastern sky, you could see the earth's shadow over the moon making it a quarter moon also a bright star not far from the moon. i was in ahh of the sky that early in the morning and felt totally focused on it for some reason. just staring out into the lower sky..sky looks totally different at that time of the early morning than when around midnight. you see all clusters of stars and what looked like orion's belt. i seen my older dog sit in the middle of the yard again, as he done this once before with something strange, and he was looking west at something in the sky. just sitting there he was with no movement. that blew my mind. i yelled at him to tell him to hurry up and do his business. all of a sudden, i felt somebody was speaking to me and was told to look up again..this look up stuff is getting old..the most beautiful whatever was cruising over approx. couple thousand ft. directly over my home. no noise at all, blinding blinding light. no pulsating lights, just a constant radiating blinding ball of light..totally white like a brilliant diamond shining. couldn't even distinguish a shape as it was so bright. whatever it was was certainly huge. if i had to estimate a size to the object in the sky it would be 10 times the size of jupiter when she is visible. i know that i recently had a sighting over the weekend and this is getting more and more strange to me. i feel pretty stupid sending in another report but i feel possibly something is breaking me in for some reason. i am not frightened now at all thanks to mufon but this year has certainly been a sighting year for me and feel you may find me a nuisance. i don't like to tell people about these sightings because most are closed minded and believe you are nuts after awhile. i am a very spiritual woman and have been for 17 years. i don't share that info much either but i feel it has something to do with all this. my spiritual growth is very important to me at this stage in my life. it seems the more spiritual i become, the more what i use to believe was strangeness and superficial is not strange and superficial at all. this year has been the real big growth year for me and now all this extracurricular activity is happening to me. i don't know if a camera with take what i see in the dark sky but i am going to start carrying one with me. at 5am with a sudden wake up, i would have never thought to grab a camera. can you tell me what the heck is happening to me?"],"Viewing Distance":"Unknown","Summary":"Looked like the HOPE DIAMOND cruising in the sky","Log Number":"US-08182009-0010","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18731.html.txt","/var/www/straped/mufon/org/18731.html"],"City":"Sheridan","Case Number":"18731"}