{"files":["/var/www/straped/mufon/html2text/18739.html.txt","/var/www/straped/mufon/org/18739.html"],"divs":["Sighting Detailsthis happened some time in mid april of 1998. dont remember the exact day. i was living in a small town called Lake Morena Village just outside of Campo, CA. its along the mexican border midway between san diego and the arizona border. it was around 4a.m. and i had just left my house on a short walk to lake morena to do some early morning fishing. while walking down the street i noticed what i first assumed was the moon between some nearby tree tops. it was very big, as the moon often apears here in the mountains. as i looked i noticed it had an odd shape to it. intrigued, i left the road and climbed a small hill with a rock-pile atop it to get a better look. what i saw was a well defined craft. it was V shaped and was luminous. the same color as the moon. it was the most immense thing i have ever seen. iam guessing its distance from me at 20 miles and its altitude at 10,000 feet, iam giving these estimations because it was flying in roughly the same flight path as that used by the commercial airlines that i have seen fly past for years. comparing it to the commercial airliners, iam guessing it was as thick as 5 airliners stacked atop eachother, and ATLEAST 1000 feet long. aside from being luminous it had what appeared to be a luminous mist of some kind which surrounded it and tapered to a point maybe a half mile below it. (it was like a classic tornado shape)which didnt trail behind it but moved along with the craft.(very strange) it moved very slowly from the west to the east, towards arizona. it took about 20 minutes to cross the horizon and was quite a sight to behold. thank you for your time and God bless"],"Summary":"I witnessed a very large luminous V-shaped craft cross the horizon","Country":"United States","Longitude":"-116.459992","Sighting Duration":"Undisclosed","Log Number":"US-08182009-0017","map":"<A HREF = \"http://maps.google.com/maps?q=32.60938,+-116.459992(18739)&iwloc=A&hl=en\"> mufon case (18739) map </A>","Latitude":"32.60938","Object Shape":"Boomerang","Object Features":"Undisclosed","Case Number":"18739","Viewing Distance":"Over One Mile","Source":"MUFON","Region":"California","Weather Factors":"Unknown","City":"CAMPO","trends":["There have been 4 other sightings in CAMPO","There were no other sightings in CAMPO on or around April 15th 1998"],"Date of the Event":"04/15/1998 12:00 UTC","Date Submitted":"04/15/1998 12:00 UTC","Tags":"City","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path"}