{"trends":["There have been 8 other sightings in Palm Desert","There were no other sightings in Palm Desert on or around August 17th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy husband and I were watering our garden in our desert home and as it was dark outside, except for the small garden lights, when I decided to take a photo of my husband he held his flashlight under his chin, to make sure so he said I had enough light. He then took one of me. Later when I transferred these digital photos from my camera onto the computer there was this large round greyish blue object in the right hand corner in the sky. I asked my husband what it could be and at first he thought the moon but then changed his mind as he looked closer. We noticed from a prior photo that this same object only much smaller was high in the sky, and then on the one he took of me after I took his the object seemed to be hurtling through space and was getting smaller. I might be wrong but there is no explanation for this object in my photos which I am including below. Sincerely Jean martino"],"Object Flight Path":"Unknown","Weather Factors":"None","Sighting Duration":"Undisclosed","Country":"United States","Disposition":"IFO","Object Features":"None","Date Submitted":"08/17/2009 09:30 UTC","Case Number":"18730","City":"Palm Desert","Source":"MUFON","Latitude":"33.731564","Summary":"a large round greyish blue object which looks like it had heiroglyphics on it and a roun rim edge","Region":"California","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=33.731564,+-116.367236(18730)&iwloc=A&hl=en\"> mufon case (18730) map </A>","Longitude":"-116.367236","Tags":"City","Log Number":"US-08182009-0009","files":["/var/www/straped/mufon/html2text/18730.html.txt","/var/www/straped/mufon/more/18730_submitter_file1__P1020653.JPG","/var/www/straped/mufon/more/18730_submitter_file2__P1020657.JPG","/var/www/straped/mufon/more/18730_submitter_file3__P1020658.JPG","/var/www/straped/mufon/org/18730.html"],"Viewing Distance":"Unknown","Date of the Event":"08/17/2009 09:30 UTC"}