{"Date Submitted":"08/18/2009 02:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.380348,+-75.285056(18737)&iwloc=A&hl=en\"> mufon case (18737) map </A>","Latitude":"40.380348","Object Shape":"Triangle","Date of the Event":"08/18/2009 02:15 UTC","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/18737.html.txt","/var/www/straped/mufon/org/18737.html"],"Source":"MUFON","City":"Perkasie","Country":"United States","divs":["Sighting DetailsI was driving my date home last night around 2am or shortly after. We were less than 5 minutes from her house when I spotted a bright object in the sky about a half mile off, directly ahead of us. I thought nothing of it at first, thinking it was simply a helicopter or a plane. I immediately noticed how bright the object was, and that it had a pulsating red light. At this point I could also see there were two or three seperate white lights. I drove on, and as we got closer, I could tell the object was not moving. I asked my friend what she thought about it, and she said she didn't know. At this point we were almost right next to it. It was hovering above a barn about 100 ft in the air, and we could see a white light shining down on the barn. We came to a crawl. I turned the music off. We didn't hear any noise, such as a helicopter whirl, but I regrettably did not open the windows. We were kinda freaked out. A truck drove by in the oncoming lane and it appeared to slow down but I do not know if the driver noticed the object. We drove a little further, and we kinda just looked at each other nervously. I didn't want to believe what I was seeing, but the whole setting just reminded me of something out of the twilight zone or some other 50's era sci-fi movie. She suggested we turn down the first street we saw, so I turned right onto a small country road. At this point we lost visual sighting of the object and the barn due to houses and foliage. When we came to a clearing, we saw the barn, but the object was no longer there. This was no more than a minute after we slowed down to view the object up close. She said she thought she saw it far away, but I wasn't sure that was the same object. We turned around and decided not to go back to the barn. It was late and I wanted to get her and myself home. The whole sighting lasted about 3-5 minutes. I have heard about the sightings in recent years in bucks county and figured I should submit this. As a matter of fact, I hope this report is helpful to any locals that may have seen the object."],"Object Features":"Unknown","Object Flight Path":"Hovering then path,Other","Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Case Number":"18737","trends":["There have been 5 other sightings in Perkasie","There were no other sightings in Perkasie on or around August 18th 2009"],"Disposition":"Unknown","Log Number":"US-08182009-0016","Longitude":"-75.285056","Summary":"Unusual object spotted hovering over a barn silo on route 113","Tags":"City"}