{"map":"<A HREF = \"http://maps.google.com/maps?q=52.530558,+13.41253(18747)&iwloc=A&hl=en\"> mufon case (18747) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/18747.html.txt","/var/www/straped/mufon/org/18747.html"],"City":"Berlin","Object Shape":"Star-like","Log Number":"DE-08192009-0003","Weather Factors":"Unknown","Summary":"Triangle Formation","Longitude":"13.41253","Latitude":"52.530558","Case Number":"18747","Disposition":"Unresolved","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Berlin","There were no other sightings in Berlin on or around December 24th 2001"],"Source":"MUFON","Date of the Event":"12/24/2001 03:28 UTC","Region":"Berlin","Object Features":"None","Date Submitted":"12/24/2001 03:28 UTC","Country":"Germany","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn the Night of December 24, 2001 I woke up at around 3:25am to \"spend a penny\". When I went back to bed a minute later I watched the passing clouds. My bed stands directly at the window. From there I have a nice panorama-view into the sky. I love watching the clouds and stars at night. Even when i wake up at night as I did on December 24. Suddenly I realised three tiny spots in the sky. They looked like passing satellites. What was strange was that there were three of them im a triangel formation. At first i thought it was the space station plus space shuttle and something else from nasa they might have deployed there. These spots flew from East to West. I know that because my window lies in the western direction. It looked like this: One spot in the first place. Another one dioganally right behind and the third one diagonally left behind the second one (triangle). What changed my mind about the Space station was that the third spot suddenly changed his position. It made a turn behind the second one and back behind the first one. It was so fast I had to rub my eyees just to be sure I wasn't slepping. With a puzzling look I watched them disappear behind some clouds in the far. The place where I live at this time is so quiet that u can hear a needle drop on the floor. There was no sound at all. Usually you can hear planes flying by in heights up to 10 km. But there was no sound at all. Just to make clear there were no fighters or something like that, I worked for the German Air Force. I know that it's strictly forbidden in Germany to fly over big cities like Berlin. And i re-emphasize there was no sound at all. Fighter turbines scare the hell out of you. Even in big heights! Until today I don't know what that was. For me no proof for an alien explanation at all, but unkown... a U.F.O."]}