{"Case Number":"18743","Longitude":"-116.467872","divs":["Sighting Detailsi was returning home from a fishing trip at lake morena (which is along the mexican border about half way between san diego and arizona border) and was on a dirt road which winds behind the lake when my car bottomed out in a gully at the edge of a large meadow and got stuck. the time was about 10 p.m. and the date was some time early July of 1999. i got out of my vehicle, grabbed a small shovel out of my trunk and began the task of digging my back tires out of the rut. after about 20 minutes i stopped to take a break and smoke a cigarette. as i did this i noticed a bright light zig-zagging up and down along the side of a nearby mountain, shining a spotlight in a sweeping motion across the side of the mountain. at first i didnt give it a second thought, as i assummed it was a border patrol helicoptor searching for illegal immigrants. they are a common sight here, since we are so close to the border of mexico. after finishing my cigarette and a bottle of water i went back to work with the shovel and after about 15 minutes more i decided to get behind the wheel and try to drive out of the gully. as i opened the drivers door my eye caught something in the air just to my right. it was a bright white orb that was maybe 4 or 5 feet in diameter. it made no sound whatsoever, and was hovering stationary, making no movements at all. it was only about 40 or 50 feet away from me and was about 25 feet from the ground. (and let me make one thing clear, IT WAS NOT A HELICOPTOR)I stared at it for maybe 10 seconds or so and then for reasons i still dont understand, i began to walk towards it. i do remember not feeling threatened in any way. and i believe i took about 10 steps toward it when suddenly a blue beam of light shot straight down below the orb and in a sweeping motion shot right into my eyes. (it had the characteristics of a laser and i could see particles swirling inside it, and iam guessing it was maybe 2 inches in diameter). i put my hands in front of my face to protect myself and for a second saw nothing but blue all around me. when i coud tell it wasnt directly in my eyes any more i lowered my hands in time to see the beam do something very strange, it did not cut off or wink out like a normal light would, it actually retreated back into the bottom of the orb as if it was on a string. i know it sounds crazy and light is not capable of doing this, but nontheless i witnessed it, and i dont think my description is doing it justice. as soon as the beam retreated back into the orb it began to slowly glide to my right which was southeast. i watched it until it began to round a bend with a lot of tree cover, but before it went out of sight it shot out a brilliant spotlight towards the south that momentarily lit everything up brighter then daylight and then it dissappeared behing the trees. iam fairly certain now that the light i saw zig-zagging up and down the side of the mountain was the same orb that i witnessed in the meadow. as the years have passed and i have had lots of time to go over this event in my head, one thing that puzzles me about it was my complete lack of excitement immediately after it happened, i just felt tired and kind of \"blah\". in fact i dont recall even thinking twice about it until the next day. i told a couple friends and they just laughed and kind of rolled their eyes and thats when i decided i wasnt going to say anything about it after that. i cant really explain it but as i thought about it more and more as time passed the whole event began to remind me of looking at a jigsaw puzzle with a piece missing. i know what happened to me but i feel like something is missing. its an odd feeling that i cant really explain the way i'd like to. anyway, thank you again and god bless"],"Country":"United States","files":["/var/www/straped/mufon/html2text/18743.html.txt","/var/www/straped/mufon/org/18743.html"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=32.6153,+-116.467872(18743)&iwloc=A&hl=en\"> mufon case (18743) map </A>","Tags":"City","Object Flight Path":"Hovering then path","Latitude":"32.6153","trends":["There have been 4 other sightings in Campo","There were no other sightings in Campo on or around July 7th 1999"],"Source":"MUFON","City":"Campo","Log Number":"US-08182009-0021","Date Submitted":"07/07/1999 11:00 UTC","Summary":"i witnessed a glowing white orb at close range which emitted a blue beam that struck me momentarily","Weather Factors":"None","Region":"California","Date of the Event":"07/07/1999 11:00 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Viewing Distance":"21-100 Feet"}