{"Weather Factors":"None","Country":"United States","Tags":"City","Longitude":"-112.068037","Log Number":"US-08192009-0001","Object Features":"None","Date of the Event":"08/16/2009 09:00 UTC","Object Shape":"Circle, Sphere","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"08/16/2009 09:00 UTC","Sighting Duration":"Undisclosed","Region":"Arizona","files":["/var/www/straped/mufon/html2text/18745.html.txt","/var/www/straped/mufon/org/18745.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.449727,+-112.068037(18745)&iwloc=A&hl=en\"> mufon case (18745) map </A>","Case Number":"18745","Disposition":"Unknown","City":"Phoenix","divs":["Sighting DetailsThis is the first time I have seen this type of thing and I don't know what to make of it. It boggles the mind. I live in Phoenix Arizona and I was looking southeast at Jupiter with binoculars around 9 p.m. when flashing lights came across my field of view. I looked up and saw something moving with red,white and bluish strobing lights. I looked through the binoculars and it was not an airplane. All you could see were the flashing lights and it moved a little erratically--in other words not a real straight path. I followed it as it moved from south to north. Then, suddenly, it stopped, turned a pinkish orange and began moving south ! This was not a helicopter either. I lost view of it because my patio cover was in the way. As I began looking for it again I noticed more than one of these strobe like things moving through the sky. The lights would flash in groups of 6 or more and then stop and start again--unlike airplanes. When they started again they had moved. I called Ray out to watch with me. He didn't believe me at first, but now he does !! My neck was getting strained, so I pulled out a lounge chair and laid on it looking up with the binoculars. Now this really freaked me out--a white orb looking thing, (did not seem solid) much bigger than the stars I was looking at and closer, moved across my field of vision. \"Oh my God, what's that?\" I said. I followed it through the binoculars as it moved from east to west and then it suddenly turned into these flashing lights right in front of my eyes !!! I was utterly amazed !!! What was I seeing? Ray and I watched the lights move around the sky--unsure if it was a few that kept moving to different spots or if there were many. We saw them in every direction at one time or another. My grown son came home around 9:30 pm and watched with us. He has been seeing ALOT of these same lights late at night when he comes home between 2-4 am and had told us earlier in the day he saw them in groups or clusters in the east and west the night before. I went inside to get my telescope but I just couldn't adjust it fast enough to take a closer look. When we saw two of them follow an airplane that was heading west from the airport, we got a little worried. There was never any sound coming from them. It was so hard to judge their distance. Around 10 p.m. all of the activity stopped. I have looked the last two nights and have seen nothing like it. I was just so glad that someone was home with me to watch. Ray said he felt priveleged to see such a thing. I thought it was exhilerating and scarey at the same time. Next time---we'll bring out the video camera. If there is a next time !!! Did anyone else see this??? Listen folks, we have visitors, and I felt like they wanted us to see them. Thanks for letting me share my experience."],"Summary":"White orb gliding through sky turns into strobing lights. Flashing lights seen moving across the sky.","Latitude":"33.449727","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around August 16th 2009"]}