{"Date Submitted":"09/23/1993 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=52.594763,+-2.12042(18757)&iwloc=A&hl=en\"> mufon case (18757) map </A>","Region":"England","Viewing Distance":"21-100 Feet","Tags":"City","Log Number":"GB-08192009-0013","Date of the Event":"09/23/1993 12:00 UTC","Weather Factors":"None","Latitude":"52.594763","Object Flight Path":"Stationary,Hovering then path,Straight-line path","City":"Wolverhampton","files":["/var/www/straped/mufon/html2text/18757.html.txt","/var/www/straped/mufon/more/18757_submitter_file1__t2.jpg","/var/www/straped/mufon/org/18757.html"],"trends":["There has been one other sighting in Wolverhampton","There were no other sightings in Wolverhampton on or around September 23rd 1993","This sighting has never been favorited.",""],"Object Features":"None","Sighting Duration":"00:02:00","Country":"United Kingdom","divs":["Sighting DetailsOne night i went to the local shops. It was late. On the way home about 40 yards away from my house i noticed a small humming sound and a smell of burnt out pc board. I stop'd dead in my tracks and folowd the sound up. There in front of me about 40 foot above the house's across the road from me was a Huge Jet Black Triangle. I knew strait away this was nothing to be scared of but there was no feeling from me but awe and amazement. I looked left then right and scanned the craft absorbing every detail. after my 3rd eye sweep it started moving to my right and up. speed was around 0-700mph+ in 2 seconds.It moved with a increasing speed from stand still to 50mph 0.3seconds 50mph to 150 0.5seconds 150+ 0.5 seconds. It moved front of craft single point first and yawed strait up like a earth craft will point its noise up to go up. Until the craft was vertical. There was a moon out and a little cloud. The craft moved through a cloud and made a small hole in it. The moon was in the right place to show me through the craft when it was hovering over the house's and highlight the clouds so i can see them clearly. I walked to my house. I think? The craft was jet black around 300ft long 200wide maybe 150ft thick.probably bigger. There was no marks on the craft and no lights. Every edge and angle was perfect. No sound expect the low level electric hum.One tone.and a feeling of energy and a smell like electric. AS i looked at the craft i noticed a deadly silence in the air.I noted this because you can always hear the main roads and a ambient sound of city life. two final things that scare me more then the event.one. I had a feeling that they(craft) was reading my mind. Then a feeling of oh hes watching us(they thought this) wofted across my mind.Then the craft shot off at huge speed. Second. Some how and i don't know how i managed to block all events from the night out of my mind for few years. My partner cannot remember me coming in saying anything about triangle craft.Or anything like that.About 3 to 4 years after me and my partner was watching tv when a program came on about a huge triangle ufo over some military base's in uk. It all came back instantly.every detail except what hapend after when i entered my house. I have not seen anything before this or after this."],"Source":"MUFON","Disposition":"Unresolved","Case Number":"18757","Object Shape":"Triangle","Summary":"Huge black triangle hovered over fordhouses wolverhampton","Longitude":"-2.12042"}