{"Tags":"City","Date of the Event":"08/19/2009 03:50 UTC","divs":["Sighting DetailsI was walking my dogs in my neighborhood at 3:50 AM (I get up a 3:30 AM to get ready for work). And as I do every morning, I was looking up in the sky admiring the large number of stars. As I came rounded the corner, I noticed a bright object in the sky that I hadn't seen earlier. It was in the North Eastern sky, and was flashing different colors. At first I thought it was an airplane, but then a much smaller round blue object came out from the bottom of it. The smaller object moved down and around the larger object and then disappeared. Thinking this could not be a plane, I watched the object for about 2 more minutes, then continued my walk - looking up every now and then to see if the object was still in the sky. It never left its position. When I got back to my house at 3:55 AM, the object was still visible. The whole time I was watching the object, I was more curious than anything else as I had seen similar objects just last week at the Little Mount Hoffman Lookout, near Mount Shasta, CA (I stayed there for two nights). However, none of these objects ejected anything like this one did."],"Longitude":"-121.530234","trends":["There have been 4 other sightings in West Sacramento","There were no other sightings in West Sacramento on or around August 19th 2009"],"Object Flight Path":"Stationary","City":"West Sacramento","Country":"United States","Log Number":"US-08192009-0007","Object Features":"Unknown","Region":"California","Summary":"Multi-color, flashing circular object","Sighting Duration":"Undisclosed","Disposition":"IFO","Object Shape":"Circle, Star-like","Case Number":"18751","Viewing Distance":"Over One Mile","Latitude":"38.580461","Source":"MUFON","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=38.580461,+-121.530234(18751)&iwloc=A&hl=en\"> mufon case (18751) map </A>","files":["/var/www/straped/mufon/html2text/18751.html.txt","/var/www/straped/mufon/org/18751.html"],"Date Submitted":"08/19/2009 03:50 UTC"}