{"map":"<A HREF = \"http://maps.google.com/maps?q=33.453606,+-112.348824(18756)&iwloc=A&hl=en\"> mufon case (18756) map </A>","Source":"MUFON","Object Features":"Unknown","Date of the Event":"04/19/2008 10:05 UTC","Log Number":"US-08192009-0012","Case Number":"18756","Tags":"City","divs":["Sighting DetailsI walked out into my back yard and noticed what I thought was a very bright star. As I looked at it, it was flickering all kinds of colors. I watched it for a moment and noticed it was moving south to northwest very slowly. I realized it was moving way too slow to be an airlplane. It didn't make any noise so I knew it wasn't a helicopter, and obviously it wasn't a star. I ran inside and grabbed my camcorder and my wife and we watched it slowly move away. At times it appeared to have stopped and then continue moving again. My wife doesn't believe in anything and this got her attention. She watched it through binoculars as I taped. I proped the camcorder on a nearby table so you can see just how slowly it was moving without me shaking the camera. I have attached a couple of pics from the video for your review. I have the original video if anyone wants to analyze it."],"trends":["There have been 8 other sightings in Goodyear","There were no other sightings in Goodyear on or around April 19th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Summary":"Saw flashing light lin sky, grabbed cam corder and taped for about 45 minutes","Longitude":"-112.348824","Weather Factors":"None","Object Shape":"Disc, Star-like","Region":"Arizona","Viewing Distance":"Unknown","Date Submitted":"04/19/2008 10:05 UTC","files":["/var/www/straped/mufon/html2text/18756.html.txt","/var/www/straped/mufon/more/18756_submitter_file1__DSC00956.JPG","/var/www/straped/mufon/more/18756_submitter_file2__DSC00958.JPG","/var/www/straped/mufon/more/18756_submitter_file3__DSC00959.JPG","/var/www/straped/mufon/org/18756.html"],"Country":"United States","Object Flight Path":"Straight-line path","City":"Goodyear","Disposition":"Unknown","Latitude":"33.453606"}