{"Date Submitted":"09/14/2002 03:00 UTC","Summary":"Nightime Residential black triangle capture on vid","trends":["There have been 2 other sightings in Leduc","There were no other sightings in Leduc on or around September 14th 2002"],"Weather Factors":"Unknown","City":"Leduc","Object Flight Path":"Unknown","Object Features":"Undisclosed","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Sighting Duration":"00:00:59","Country":"Canada","Tags":"City","Log Number":"","Latitude":"53.259434","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=53.259434,+-113.549041(1875)&iwloc=A&hl=en\"> mufon case (1875) map </A>","Case Number":"1875","Region":"Alberta","Source":"MUFON","divs":["Sighting DetailsLeduc is a relatively small town with a population of around 15,000 situatedjust south of Edmonton. The area is dominated by residential housing, schools,religious centers and surrounded by farmlands. At roughly 2:45 am I decided tostep outside for a breath of fresh air. The night was clear and windless. As Igazed upon the stars a grouping of them began to move. My first thought was thatI was having a dizzy spell so I gave my head a shake and refocused my gaze uponthe sky. I soon realized that I wasn92t dizzy at all when three points of light, forming a triangle made their wayfrom south to north. The triangle of lights moved at a speed similar tosatellites but unlike satellites this grouping changed directions 30 secondsinto the sighting. The triangle began to move east. The object was either verylarge or very low and appeared to blot out passing stars. The object wascompletely silent. The lights on each tip were solid white but of very lowintensity. There was a distinct impression that this object was doing its bestnot to be seen as it moved across the star field. As I realized what I wasseeing It occurred to me that I should attempt to make record of the sighting.Very quickly I entered the house and grabbed my digital video camera. I returnedto the front of the house and began filming the object as it made its waytowards the northeast. I soon lost sight of the object behind a neighbor"],"Date of the Event":"09/14/2002 03:00 UTC","files":["/var/www/straped/mufon/html2text/1875.html.txt","/var/www/straped/mufon/org/1875.html"],"Longitude":"-113.549041"}