{"Region":"South Carolina","Tags":"City","Date of the Event":"08/16/2009 11:00 UTC","Sighting Duration":"00:04:00","Object Shape":"Oval","City":"Liberty","trends":["There has been one other sighting in Liberty","There were no other sightings in Liberty on or around August 16th 2009","This sighting has never been favorited.",""],"Log Number":"US-08192009-0021","Case Number":"18765","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.794931,+-82.689189(18765)&iwloc=A&hl=en\"> mufon case (18765) map </A>","Longitude":"-82.689189","Weather Factors":"None","Latitude":"34.794931","Object Features":"Unknown","Disposition":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","divs":["Sighting DetailsI was trying to take photos of the meteor shower in my backyard. Right after the bright meteor hit the atmosphere I starting taking pictures with my camera. I noticed what looked like a star getting closer, so I assumed it was another meteor. I realized when it darted in a unusual path and left this kind of star dust behind it that something was off. I kept taking pictures and then something got closer that was kinda oval shaped and it had two bright lights. It reminded me of star wars because they were so brightly white. Then it was gone. I was so amazed at what I had seen, I ran inside the house to pull the pictures up on my computer. When I zoomed in I realized that I had caught it on camera. The only thing I didn't catch was the meteor. I am still not sure what I saw that night, it was out of this world for sure. I decided to ask some of my friends who I could talk to about this event and they directed me to this website."],"files":["/var/www/straped/mufon/html2text/18765.html.txt","/var/www/straped/mufon/more/18765_submitter_file1__UFO3.jpg","/var/www/straped/mufon/more/18765_submitter_file2__UFO2.jpg","/var/www/straped/mufon/org/18765.html"],"Summary":"almost like a shooting star but different trail pattern kinda oval shaped with two bright lights","Viewing Distance":"Over One Mile","Date Submitted":"08/16/2009 11:00 UTC"}