{"trends":["There have been 3 other sightings in Crosby","There were no other sightings in Crosby on or around August 19th 2009"],"Region":"Texas","Weather Factors":"None","Source":"MUFON","Date of the Event":"08/19/2009 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=29.911888,+-95.062151(18769)&iwloc=A&hl=en\"> mufon case (18769) map </A>","Log Number":"US-08202009-0004","Tags":"City","Latitude":"29.911888","Summary":"Triangular, Hovering, Silent Craft Over Crosby, Texas.","Case Number":"18769","Country":"United States","Object Features":"Undisclosed","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","City":"Crosby","divs":["Sighting DetailsI was in the car with two friends on the way home to Silsbee, Texas from Houston after a comedy open mic night. When we approached Crosby, Texas my friend Justin said something about UFOs. When I asked him about he said that he had seen them there before. The other friend in the car, Kody said he had seen them also. I did not believe them at first, but as we drove down Hwy. 90 we began to see a light. As it came into focus it became clear that it was a triangular craft with white lights on the bottom as well as smaller blinking blue, green, and red ones. The craft hovered very slowly and would make random changes in direction and have sudden bursts of speed. My friends and I decided to follow the craft which we did for nearly an hour and it continued this behavior. At one point we were chasing it and had to stop for a train when the craft suddenly changed direction and flew very low, directly over us. My friend Kody got out of the car to look and I rolled down the window and looked up. Eventually we lost the craft in the treeline and began to head home. When we hit the highway, we saw it again! This is the oddest experience of my life. I have no idea what the craft could be. I also don't know how everyone doesn't know about this, especially if it is common enough that my friend could say \"Hey there are UFOs here\" and then we end up seeing and chasing one. The craft and its prescence had no negative effects on my physical condition but it really gave me the creeps"],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Longitude":"-95.062151","files":["/var/www/straped/mufon/html2text/18769.html.txt","/var/www/straped/mufon/org/18769.html"],"Sighting Duration":"Undisclosed","Object Shape":"Triangle","Disposition":"Unknown","Date Submitted":"08/19/2009 11:00 UTC"}