{"Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc, Sphere, Triangle","Date of the Event":"08/13/2009 12:00 UTC","divs":["sighting detailswitness over 30 minutes of real ufo sighting recorded august 13 2009 right in the front of our home in kissimmee, florida. this exclusive real ufo sighting can very well be some of the best ufo footage ever caught on tape. this real ufo sighting all started on our way to taco bell to pick up some dinner to eat. when we were driving all of a sudden we spotted several ufo's which sparked our curiosity so we followed them for 15-20 minutes until we lost them or they disappeared. then upon arriving back home pulling in our driveway we spotted several more real ufo's which resembled energy orbs\\spheres right outside our house coupled with what looked like to be hi-tech looking military aircraft. i then ran inside the house and grabbed my canon zr960 video recorder which has a 2,000x digital zoom allowing us to capture some of the most incredible real ufo footage ever recorded. real ufo sighting august 13th 2009 - real ufo sighting over 30 minutes caught on video you will also notice these real ufo energy orbs\\spheres materialize forming new ufo's from thin air. this is absolutely amazing and possibly some of the most mind-numbing in your face real ufo footage ever caught on film. link to youtube video playlist of 30 mins of ufo footage: http:\\\\www.youtube.com\\view_play_list?p=768c9b49fce67801"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.295766,+-81.403211(18762)&iwloc=A&hl=en\"> mufon case (18762) map </A>","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around August 13th 2009"],"Latitude":"28.295766","Weather Factors":"Unknown","Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Region":"Florida","Country":"United States","Longitude":"-81.403211","Date Submitted":"08/13/2009 12:00 UTC","Summary":"Real UFO Sighting August 13th 2009 - Real UFO Sighting Over 30 Minutes Caught On Video","City":"Kissimmee","Disposition":"IFO","Log Number":"US-08192009-0018","Case Number":"18762","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18762.html.txt","/var/www/straped/mufon/org/18762.html"]}