{"City":"Doraville","divs":["Sighting DetailsWas driving East on an access road parallel to 285 in doraville around 5 30 pm saw a silver object over the high way it came over the access road and hovered for a 5 minute period of time then went South over what use to be the GM plant then came back over the access Rd next to the highway. It stayed in this position for awhile then began moving forward and the traffic which had stopped began moving with the object. It was moving along very slowly, then as we approached Buford Hwy., It took off at an enormous speed. It was a silver disc pretty large about the size of two cadillac's. It's center was a combination of lights, blue, green, yellow, orange, that were rotating in a clockwise position with the body of the disc. At the bottom was also smaller disc which was rotating counterclockwise, also with colored lights. It was odd because how can something which is hovering and standing still in the air have colored lights also spinning clockwise when it's bottom is spinning counterclockwise? Also in the middle with the lights appeared to be a door that you could see, flashing lights then a door. It was cool and it excited me alot and I went immediatley to my brother's house and told him about it. He believed me and got in his car, but I am sure it was gone, because it was accelerating at such a fast rate, that it would have already been In South Carolina by then. It made a believer out of me. I saw a Show Monday night about the abductee's and I decided to write and tell you about this experience. Some one has already called me about this, but I need someone to send me an address, so I can send a drawn picture of the craft. I have been deliquent about doing this. I didn't want to appear to be a kook which is what the guy was ridiculed for in the Monday show of abductions. I live in a suburb of Atlanta and feel I wouldn't be ridiculed for sharing, if it is not published. Thanks Ed Norman"],"Date of the Event":"11/27/1977 05:30 UTC","Latitude":"33.906738","files":["/var/www/straped/mufon/html2text/18775.html.txt","/var/www/straped/mufon/org/18775.html"],"Longitude":"-84.281166","Object Shape":"Disc","Date Submitted":"11/27/1977 05:30 UTC","Log Number":"US-08202009-0010","trends":["There have been 15 other sightings in Doraville","There were no other sightings in Doraville on or around November 27th 1977"],"Tags":"City","Region":"Georgia","map":"<A HREF = \"http://maps.google.com/maps?q=33.906738,+-84.281166(18775)&iwloc=A&hl=en\"> mufon case (18775) map </A>","Viewing Distance":"20 Feet or Less","Summary":"Silver disc with flashing lights in middle going clockwise, base counter","Source":"MUFON","Weather Factors":"None","Case Number":"18775","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Dome","Object Flight Path":"Hovering then path,Path with directional change"}