{"files":["/var/www/straped/mufon/html2text/18777.html.txt","/var/www/straped/mufon/org/18777.html"],"Latitude":"34.688495","Log Number":"US-08202009-0012","Date of the Event":"08/12/2009 09:00 UTC","Case Number":"18777","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.688495,+-76.886051(18777)&iwloc=A&hl=en\"> mufon case (18777) map </A>","Weather Factors":"None","Source":"MUFON","Summary":"Disc shaped object with red and white lights observed for 45 minutes over the ocean","City":"Salter path","Date Submitted":"08/12/2009 09:00 UTC","Object Flight Path":"Other","Object Features":"Unknown","Region":"North Carolina","divs":["Sighting DetailsMy family and I were sitting on the beach at Salter Path, North Carolina. I noticed what I thought was a very bright star, but it was moving and appeared to be blinking. It was followed for about 15 seconds by a smaller looking red dot, which disappeared. The first star-like object was making very erratic movements, which appeared to be twirling. It came close enough to shore that I could make out the outline of a disc shaped object which was clearly spinning, with red and white lights around the edges of the middle section of the disc. The UFO then flew further away, but we could still see the light from it which seemed to blink from the rotation of the craft. A second one joined it, and began to follow it very erratically. The second one then began to ascend to the upper part of the sky very rapidly. After a few minutes, two military planes tore across the sky in pursuit of the craft, which took off. At this point both crafts disappeared. By now, we had all been following the crafts for 45 minutes. When the two planes (clearly planes, as the flight pattern was very straight and had no inexplicable, rapid fluctuations unlike the other two lights) came in pursuit the two discs took off. A very low flying plane closely followed the two jets. About 20 minutes later, we witnessed something hovering stationary over the water for roughly 30 seconds, then slowly move forward towards the beach. Once it reached the shore, it flew sideways, and then began to move forward again. It had two red lights, one on the left and right sides of the front of the craft, and a white light in the middle of the two red ones. There was also a white or orange light possibly on the underside of the craft flashing downwards. My family and I have been going to this same part of Salter Path for 19 years. Never before have we seen anything like it. All of us are used to seeing planes and helicopters flying at night, as there is a military base in the vicinity (Johnson Air Force Base). The motions of the lights were such that it would be impossible for a plane or a helicopter. Furthermore, we identified a disc shaped object to be the source of the lights."],"trends":["There have been no other sightings in Salter path","This sighting has never been favorited."],"Longitude":"-76.886051","Disposition":"IFO","Country":"United States","Sighting Duration":"00:45:00","Tags":"City","Object Shape":"Disc"}