{"Case Number":"18773","Weather Factors":"None","Disposition":"Unknown","Viewing Distance":"101-500 Feet, Over 1 Mile","Tags":"City","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around June 30th 1974"],"Date of the Event":"06/30/1974 08:00 UTC","Summary":"Sighted UFO and observed for 15 minutes, Disappeared into the West into space at an extreme speed eventually.","Object Shape":"Circle, Sphere","Source":"MUFON","Country":"United States","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=38.841002,+-104.817643(18773)&iwloc=A&hl=en\"> mufon case (18773) map </A>","Latitude":"38.841002","Date Submitted":"06/30/1974 08:00 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Features":"Dome","City":"Colorado Springs","divs":["Sighting DetailsMy friend and I were driving and had stopped at a stoplight when I observed an object across the street, near a state park, which appeared to be a paper bag that was on fire drifting slowly back and forth and upward. It was extremely bright orange on the bottom and the top half appeared to be a bright florescent light color that was transparent. It was difficult to tell what size it was. I drove across the street and drove into the park and parked the car as the object was now lifting and right over my head. I got out of the car and stood under it and watched it lift slowly. The bottom was extremely bright orange and there was absolutely not sound coming from object. It was now on a path travelling to my right, or North. A small Cessna aircraft passed overhead and this object followed the craft staying right at its outer wing for a moment, going the exact same speed as the plane. Now it appeared to be about half the size of the Cessna wing, if I were to compare it in size of the aircraft. From below, it was now appearing as beautiful dayglow orange, the brightest I have ever seen. The object then made an immediate 90 degree turn upward and to the West. The mountains were to the west and we observed the object for 2 or 3 minutes longer as it sped away at an enourmous rate of speed. It went into the stars which were just beginning to appear in the sky. It did not go over the mountains, but into space and eventually turned a deep red color as it finally disappeared into the stars until we could no longer see it. I called the CS Police Dept. as I was on my way out, from a McDonald's. They asked for my phone number and I told them I would be home around midnight. When I returned home at 12:30 that night, my babysitter told me the police had been there and asked that I contact them right away. I called immediately and they asked if they could come right over. Two police men came to the door within 15 minutes and one took me into one room, and one took my friend into another room for complete details of what we saw. UFO's were taken very seriously at that time, especially in lieu of all the cattle mutilations, etc. in the area. There were even mutilations at the local Colorado Springs Zoo at the foot of Pikes Peak of Buffalo in the zoo, which were under lights. The next day, I was on a tour, consequently, at the NORAD facility in CS. I spoke to an officer there during the tour of the radar area, and he told me there were hundreds of calls of the sighting and it was considered a UFO as it was not on radar and had been unidentified. I felt extremely honored to have sighted the object. I have seen other UFO's. One prior in Sedona Arizona during the morning while fishing in Oak Creek Canyon with my son. We were far into the Canyon in Oak Creek around 10:00 a.m. in 1970, summer. I noticed a large clear snow-white circular object moving just over the canyon edge. Based on the sizes of the pine trees at the top of the canyon, this was an extremely large object. It moved slowly off the edge of the canyon and I could only see half of the disc shape. It then moved very slowly back. At first I thought it must be a bulldozer, but realized that was a wilderness area and no one was up there. I watched carefully, it moved outward over the canyon again, then slowly disappeared and I never saw it again. It was at least 60 feet across, if not more. I was most astunded at how beautifully white it was. Another instance was in Tucson, Arizona in 1985 in the summer. I was with friends in a hot tub overlooking Tucson and an object flew over our head very silently and then over the city and disappeared. My friends had seen it before and said they were sure it wasn't a blimp at it made no sound at all. I did appear to be cigar shaped. Again, I just feel honored to have seen these objects. I am a great believer in UFO's and pray that when we do encounter the beings we do not approach them with weapons, but with arms open to share information and understanding."],"files":["/var/www/straped/mufon/html2text/18773.html.txt","/var/www/straped/mufon/org/18773.html"],"Longitude":"-104.817643","Log Number":"US-08202009-0008","Sighting Duration":"Undisclosed"}