{"Summary":"Star like objects moving in every direction","Region":"Alberta","City":"Hanna","Longitude":"-111.927675","trends":["There has been one other sighting in Hanna","There were no other sightings in Hanna on or around August 20th 2009"],"Source":"MUFON","Log Number":"CA-08212009-0001","divs":["Sighting DetailsWell, to start from the beginning I'll have to go back a little over a year ago. The first weekend in August of 2008 I received a phone call from a friend of mine at about 10:30 PM MST. He told me that he was all of a sudden a believer like me. I couldn't believe what I was hearing because he was as much of a sceptic as anyone. He told me he had just witnessed two bright objects in the sky, which at first he thought was an airplane, that was until they spread apart and one became brighter than the other. I got pretty excited and I went out onto my deck to see if I could observe this and it wasn't three minutes later that I spotted something high in the sky. Now this event occurred in Duchess Alberta, the object was moving south to North and it looked like a satellite; only without blinking lights. All of a sudden another object with the very same characteristics crossed the first objects' path going west to East, as I looked around the clear starry sky I spotted no less than six of these objects in a 15 minute span moving in every possible direction. I was so amazed that I woke up my 7 month pregnant wife (who is also a sceptic) to come take a look. At first she tried to pass it off as a plane, but when a real plane flew over head she could clearly see the difference. We watched these things almost every night for the whole month of August, not even exaggerating, and then we moved an hour north to my current resident in Hanna. The recent sighting I'm reporting is the same objects, a couple of peculiar things happened on this night, my wide and I were out on the deck again and watching the very starry sky and not to our surprise we spotted a lot of these star like objects flying around, one crossed flight paths with a jet, it was obviously at a higher altitude, but as it crossed the path of the plane it lit up brighter than every other star in the sky, then it went dim and carried on. A few minutes later I witnessed two of these objects moving from South to North in unison, always keeping the same distance between them, I was curious to know if it was two ends to the same object, so I watched it until I could see a star in between them and I did. I know this is long winded, but I've witnessed probably 200 or more of these things over the past year and I have no explanation. The night I am reporting about, I counted 18 in less than 30 minutes."],"Latitude":"51.646915","Country":"Canada","Disposition":"Unresolved","Date Submitted":"08/20/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.646915,+-111.927675(18779)&iwloc=A&hl=en\"> mufon case (18779) map </A>","files":["/var/www/straped/mufon/html2text/18779.html.txt","/var/www/straped/mufon/org/18779.html"],"Tags":"City","Object Shape":"Circle, Star-like","Object Flight Path":"Straight-line path","Object Features":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"08/20/2009 12:00 UTC","Sighting Duration":"Undisclosed","Case Number":"18779"}