{"Country":"United States","Tags":"City","divs":["Sighting DetailsMe and 3 other people were sitting on a beach in Milford CT, with houses along it, when all of a sudden I saw a huge, orange, glowing ball rise straight up in the air from the distance of about a mile. I gasped and everyone turned and looked. There was another group of people on the beach sitting several yards away, and they also saw it and began yelling. At first I thought it was a meteor on fire, although it didnt have a tail, and began gaining, rather than losing altitude. After rising into the air, it began travelling parallel to the beach, heading directly towards us. It must of been at a very high altitude because a commercial plane passed beneath it, and you could tell the object was much higher than the plane, but still massive. It soon was directly overhead, and you could see the bottom of it, shaped like a disc, and lit up entirely orange. The light seemed to be pulsating. After it passed over head it took a sharp upward turn, and we watched go higher and higher, so high that it was the size pinprick when it dissapeared. When we first saw it it was bigger than a beach ball. When kit began travelling towards us we were all freaked out, and I ran towards it so I could see it from a different angle, to see if it was possibly a plane,which it was pretty obvious it wasnt ( the light was orange as opposed to white, and once I saw it from directly beneath it it was clearly some sort of circle). Simply put, it was a huge glowing ball, with what appeared to be a sold epicenter that was giving off the light."],"City":"Milford","Region":"Connecticut","files":["/var/www/straped/mufon/html2text/18778.html.txt","/var/www/straped/mufon/org/18778.html"],"Disposition":"IFO","Log Number":"US-08202009-0013","Date Submitted":"08/20/2009 09:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.23176,+-73.05672(18778)&iwloc=A&hl=en\"> mufon case (18778) map </A>","Latitude":"41.23176","trends":["There have been 8 other sightings in Milford","There were no other sightings in Milford on or around August 20th 2009"],"Longitude":"-73.05672","Date of the Event":"08/20/2009 09:30 UTC","Summary":"large orange glowing","Object Shape":"Disc, Sphere","Case Number":"18778","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed"}