{"files":["/var/www/straped/mufon/html2text/1877.html.txt","/var/www/straped/mufon/org/1877.html"],"Tags":"City","Longitude":"-84.418384","divs":["Sighting DetailsWitness 2s Narrative:Back of ___s home faces south. He was in the hot tub between 9:45 and 9:55p.m. It was twilight and only the brightest stars were out. It took between twoand a minute and a half to cover the sky which ____ could see. It went west toeast, toward Detroit.It was a bunch of lights, which would flicker and go out, then others wouldlight up, like a cloud pulsating with heat. Reminded him of fireworks, and itwas moving horizontally across the sky, not on a descent. About the speed asmall prop driven airplane would travel, or a little slower. Parts would flameout, fluctuating and dying out and other parts would light up. Reminded him ofhow fireflies flicker on and off.It was a yellow or match-flame color, but he didnt notice any blue colors. Itwas about 1 thumb height above the treeline, and his two large fists clenchedand held side by side would about cover the size of the object, at arms length. It left a vapor trail which seemed to be a part of the cloud.Witness 1s Narrative:Driving south on U.S. 31, somewhere south of Grand Haven. Clear night, someground fog. Family was looking at stars. Saw bright light in southwestern sky,looked like a plane and was moving no faster than an airplane.Viewed it for at least 15 seconds, maybe longer. It was a small light, nobigger than a planes landing lights would look at a distance. As they watchedit, it developed a long red trail, looked like a light beaming at them throughfog or cloud. Then they viewed 7 or 8 bright lights behind the main light, andthese were glowing brightly in the vapor trail.The object suddenly disappeared. I asked Mr. ____ if they simply lost sight ofit behind trees or something, and he said \"No, it just disappeared.\"He is a reporter for a west Michigan newspaper and he said the paper receivedseveral reports of this sighting."],"Object Shape":"Oval","Log Number":"","City":"Meridian Charter Township","Date Submitted":"05/20/1984 10:00 UTC","Latitude":"42.726457","Case Number":"1877","Summary":"IFO - Probable Re-Entry seen across Michigan","Sighting Duration":"00:00:59","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"05/20/1984 10:00 UTC","Weather Factors":"Unknown","Disposition":"Unresolved","trends":["There have been 9 other sightings in Meridian Charter Township","There were no other sightings in Meridian Charter Township on or around May 20th 1984"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.726457,+-84.418384(1877)&iwloc=A&hl=en\"> mufon case (1877) map </A>","Source":"MUFON","Object Features":"Undisclosed","Object Flight Path":"Straight-line path","Region":"Michigan"}