{"Weather Factors":"Unknown","Log Number":"CA-08212009-0003","Region":"British Columbia","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Country":"Canada","files":["/var/www/straped/mufon/html2text/18781.html.txt","/var/www/straped/mufon/more/18781_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/18781.html"],"Case Number":"18781","Source":"MUFON","trends":["There have been 3 other sightings in Cranbrook","There were no other sightings in Cranbrook on or around May 5th 2006","This sighting has never been favorited.",""],"Object Features":"None","Object Shape":"Disc, Oval","Summary":"taking photo of a bird","Date of the Event":"05/05/2006 12:38 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=49.518088,+-115.76387(18781)&iwloc=A&hl=en\"> mufon case (18781) map </A>","Longitude":"-115.76387","Object Flight Path":"Hovering then path","Disposition":"Unresolved","City":"Cranbrook","Latitude":"49.518088","Tags":"City","divs":["Sighting Details I actually think this is a flying bug that went by my lense. But is does look interesting. When I took this photo I only seen the bird. but I do remember lots of bugs flying around, so that is what I figure it was. And possably many photo's are the same if I'm right. I shot this with a Panasonic DMC-FZ30 Focal length 43.3mm. I know this for fact because I looked up the details in the photo today to find the proper date and it also had some other info in the photo. Although I do believe in UFO's I really don't think this is more then a fly or something in that nature. But back in 1978 or 79 my exwife and I seen an incredible amount of flying lights of Crows nest lake in Alberta Canada. I was going to pull over and have a look but my exwife reached over with her foot and laid on the gas. This took place at about 2am I believe it was the fall of 78 or spring of 79. I son't quit remember. But our son was under a year old and we traveled to Alberta to see a eye specialist for him. I have always wondered what we seen. There were hunderds of light flooting in the sky made it look like it was just about daytime. This is why I do believe but never was able to see a shape of what I saw so how knows. But I truly believe the object in the bird photo is nothing more then a bug flying by. I actually named this photo UFO. And I posted it on Rendersity under the user name michif. I also said in that posting that I believe it to be a bug flying by. My time zone is mountain time, was'nt to sure of the of the abrv. on that"],"Date Submitted":"05/05/2006 12:38 UTC"}