{"map":"<A HREF = \"http://maps.google.com/maps?q=32.548815,+-82.897604(18784)&iwloc=A&hl=en\"> mufon case (18784) map </A>","Date Submitted":"10/06/1999 12:00 UTC","Object Shape":"Other","Log Number":"US-08212009-0006","Longitude":"-82.897604","Country":"United States","Weather Factors":"Unknown","Region":"Georgia","Summary":"Chased by UFO 1999","Latitude":"32.548815","trends":["There have been 3 other sightings in Dublin","There were no other sightings in Dublin on or around October 6th 1999"],"City":"Dublin","Object Features":"None, Other","Sighting Duration":"Undisclosed","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"10/06/1999 12:00 UTC","divs":["Sighting DetailsMy wife, young son and i were headed towards Macon Georgia from Savannah Georgia, west on on I-16 at about 1 am back in 1999. I was working as an apprentice in Savannah a few days of the week, and had brought my family along this time. The highway was very quiet, only a few cars and big trucks headed east, and we felt very alone heading west for some reason. There were a few cars headed west ahead of and behind us for a while, and then we were all alone. I could see tail lights about a mile or so in front of me. We were just outside of Dublin Georgia when Suddenly, i see what i think are bright lights from someone's head lamps shining into my eyes through the rear view mirror. It looked like one solid large white light, but i was assuming that the two headlamps were blurred together at such a distance. As it slowly got closer, the light just got bigger rather than distinguishing itself as headlamps. It was one solid light. The wife and i start going over what it could be, when suddenly, it changes into the east bound lane of the interstate, HEADED WEST! We start to think that maybe it is a train, with one large light on the front, but then realize that a train wouldnt cross the INTERSTATE. It stays in the eastbound lane HEADING WEST for about 10 minutes or so, and then comes back into the westbound lane behind me once again. At this time, we're totally baffled by what it can be. I tell my wife that i'm going to stop the car and see if it catches up to us. She tells me this isnt a good idea on an Interstate, but i stop the car anyway, against her wishes. It had been following us for so long, and hadnt gained on us much at all. So i stop the car, in the middle of the interstate, and the huge light appears to stop as well. We turn in our seats and stare out the back wind shield. We're TOTALLY baffled by what it could be at this point. I was still clinging to the idea of \"TRAIN\" until i stopped the car and it stopped behind us. At the stopped position, i'd estimate that it was a mile or so behind us, and HUGE. and BRIGHT. The light never blinked or faltered. Constant and very bright. I start moving again, and it maintains this distance for 5 or 10 more minutes. It shoots back across the interstate into the east bound lane HEADED WEST a few more times, before it shoots back into the west bound lane behind me, and then off into the trees that line the interstate and it was gone. We didnt see the object again until about 15 minutes later when we were exiting I-16 onto Highway 96. Upon exiting, while driving up the exit ramp, a HUGE LIGHT flashed on and back off very quickly about three times. It was so bright that EVERYTHING was light. It was as if someone was playing with the Stadium Light switch, only the stadium lights were positioned in the trees along side the exit ramp and aimed directly at my car. FLASH FLASH FLASH in succession, very quickly. And then it was gone. We talked about this with one another, my wife and i, for the next week or so. We couldnt wrap our mind around it then, and still cant today. I wish i would have been paying closer attention to the clock. If there was any missed time, i'm unaware, and if we were contacted, i cant remember. These are the actual events and i have been very reluctant to talk about it until now. I would be willing to recount this story to a MUFON investigator."],"Case Number":"18784","files":["/var/www/straped/mufon/html2text/18784.html.txt","/var/www/straped/mufon/org/18784.html"],"Object Flight Path":"Hovering then path","Tags":"City","Viewing Distance":"501 Feet - 1 Mile"}