{"Log Number":"US-08212009-0009","Summary":"orb shape object above Austin Texas","map":"<A HREF = \"http://maps.google.com/maps?q=30.273803,+-97.736661(18788)&iwloc=A&hl=en\"> mufon case (18788) map </A>","Object Features":"None","Case Number":"18788","Source":"MUFON","Object Shape":"Sphere","Weather Factors":"None","Disposition":"IFO","Country":"United States","files":["/var/www/straped/mufon/html2text/18788.html.txt","/var/www/straped/mufon/org/18788.html"],"Tags":"City","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"08/20/2009 11:50 UTC","Viewing Distance":"Over One Mile","Latitude":"30.273803","City":"Austin","Longitude":"-97.736661","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around August 20th 2009","This sighting has never been favorited.",""],"divs":["sighting detailsi saw a bright object over downtown austin texas last night around midnight 20090820. the object was hovering around, i took a 30 second shutter speed picture on my camera to take a view of downtown and noticed the object. i though it was an aircraft at first but couldn't see any faa lights, and flight pattern is different from a plane or helicopter. the object just got brighter and when i went to get a timestamp for the tv, came out it was gone. when i first saw the object, i ran inside to grab my camera and call my girlfriend out, she said she had to see to believe, she and believe now. she couldn't control her feeling, saying scared and excited at the same time. i was just excited, didn't feel scared at all. if you look at dsc_0042.nef you will see the shutter speed was set at 30 seconds, and dsc_0045.nef was set at 18 seconds. the object in the right of the picture, just hovers straight line back and forth and when towards the left a bit more. i can see planes and helicopters in the background, didn't come up right on the camera. i'm a n00b with cameras. give me a weapon and i can snipe a person in between their eyes at over 600m away. so basically i gathered everything i can on video to *fill out a dd* form, what information is needed to make a report, timestamp, date, location\\area and what happened."],"Region":"Texas","Date Submitted":"08/20/2009 11:50 UTC","Sighting Duration":"00:10:00"}