{"Date of the Event":"08/19/2009 09:30 UTC","Tags":"City","Case Number":"18792","files":["/var/www/straped/mufon/html2text/18792.html.txt","/var/www/straped/mufon/more/18792_submitter_file1__UFO.930PM.8.19.09.jpg","/var/www/straped/mufon/org/18792.html"],"Object Flight Path":"Path with directional change","Region":"Colorado","Log Number":"US-08212009-0014","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=37.624179,+-104.780264(18792)&iwloc=A&hl=en\"> mufon case (18792) map </A>","trends":["There have been 2 other sightings in Walsenburg","There were no other sightings in Walsenburg on or around August 19th 2009","This sighting has never been favorited.",""],"Object Features":"Dome","Source":"MUFON","Viewing Distance":"Over One Mile","Disposition":"Unresolved","Date Submitted":"08/19/2009 09:30 UTC","City":"Walsenburg","Summary":"Triangular Craft seen over Huerfano County CO 8.19.09 at app. 2130 HRS","Longitude":"-104.780264","Country":"United States","Latitude":"37.624179","Sighting Duration":"Undisclosed","divs":["sighting detailswe live about 150 yards from i-25 at the eastern extreme of walsenburg, co. i was walking out my friend's back door at about 9:30 pm wednesday night, and noticed a strange craft off flying to the east. this craft headed was originally southbound, about 10 miles east of walsenburg, at about 30,000 feet. it changed direction about the time i first spotted it... towards the southeast, or pinyon canyon. it was good size... as big or bigger than a jumbo... and i could hear it... about same noise as a jumbo. i knew it was not a \"faa legal\" aircraft because of lack of red\\green wingtip lamps. my dad was a naval aviator, and i was trained as an amateur astronomer starting at at age 13... i am 54 now. i always watch the skies carefully. i called my friend out of his house, and he saw it also. the craft's \"nose\" was a \"bubble,\" seemingly lit from within... and amorphously so. the bubble was somewhat bigger than the grey area depicted on the sketch. one bright nav light was starboard and aft of that bubble... and the other white lights were at the rear of an isosceles triangle. only one other lamp, a red flashing belly strobe light, could be seen. it was moving only at about 500 mph... rather slow i thought. it gradually flew out of sight aftar 3-5 minutes. i felt it was not alien... but was maybe it was a us gov r&d craft. will anderson"],"Weather Factors":"Unknown"}