{"divs":["Sighting Details Hi My name is Steve, I and some friends were outside at our shop in rural SW Florida. It was a very clear night & as I tended to my work I kept noticing a white streak pointing due west. I did not (at first) notice the movement until I stopped and called attention to the object high in the sky. We watched for a while and no one had any idea as to what it was. We have occasionally witnessed the silver clouds pass by after a shuttle launch ( The fuel leaves an aluminum residue from launch rockets fuel) but this was nothing like that. I called my brother eight miles away to go and look as well. We both got out binoculars and watched as it flew by. It took about forty or so minutes in all before it was out of my sight. I did not even think to get my camcorder and get pictures as I was spellbound by what everyone was seeing. The sighting was NOT what affected me but what was going on in the fantail ( for lack of a better word)of the craft or crafts as we ( my brother & I) saw white or silver dots moving rapidly about within the plume behind the point or front. As one moving dot matched the front for a short time and did a 270 degree about face back into the plume and immediately returned to its previous position at the front. I have been around aircraft all my life and I do not know of anything capable of these abrupt and very quick direction changes much less the speeds they were going. At that time a cluster of flashing lights or explosions went off where the large part of the plume or fantail was. There were other smaller moving white dots in the Frey going in all different directions (I can relate this to a scene from Star wars when Luke was watching his fleet get annihilated). Sort of what a cluster bomb would look like when exploding in air. My brother and I saw this through 70 power binoculars and could see very sharp details. Everyone else had no visual augmentation but could see clearly what was up there. Whatever was happening had nothing to do with this planet as it was so large and so far out. We could see other local aircraft from the airport at different altitudes. I'm no dummy and I KNOW some truth about reality. I file this report to get this off my chest. I want everyone to know. Thank You, Steve"],"Object Features":"Undisclosed","Object Shape":"Other","Viewing Distance":"Unknown","Longitude":"-81.505874","Date of the Event":"12/24/2007 09:30 UTC","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.666917,+-81.505874(18797)&iwloc=A&hl=en\"> mufon case (18797) map </A>","Region":"Florida","City":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18797.html.txt","/var/www/straped/mufon/org/18797.html"],"Disposition":"Unknown","Date Submitted":"12/24/2007 09:30 UTC","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Case Number":"18797","trends":[],"Latitude":"27.666917","Weather Factors":"Unknown","Log Number":"US-08212009-0019","Summary":"It appeared as a fanned out double sided horizontal plume with much actitity about it as it traveled."}