{"Longitude":"-94.574117","Disposition":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.102236,+-94.574117(18800)&iwloc=A&hl=en\"> mufon case (18800) map </A>","Country":"United States","divs":["Sighting DetailsI was driving home on 71 Highway traveling North from Blue Ridge exit headed toward the Grandview Triangle.I was traveling with my son, daughter, and a friends son. Looking forward. I noticed what looked like a shooting star coming down high in the sky and possibly twenty to thirty miles North of our location( Possibly close to Worlds of Fun). I pointed the object out to the kids as a shooting star. As it descended at a steady rate I slowed down to observe the object. The object the appeared to split into three separate lights that began to descend side by side. The distance appeared to be equal between each light. Pulling off the exit I looked up again to see them in a triangle formation. They then began to change formation as a forth light appeared at the top of the new crescent formation. I continued to drive toward 435 and Bannister Rd. I could get a glimpse of a bright light at each opening that wasn't blocked by the roadways or lines of trees in the horizon. I exited 435 an 87th Street. I stopped and stared at the light that I could see for approximately 45 seconds.It did not move. I began to continue to search for the light, but turned around toward home, as a request of my son. I could not identify what I saw, so I thought it would be wise to report it in case others have seen the objects as well."],"Object Features":"None","Summary":"Star like and teardrop shaped that broke into three, then a triangle, the a cresent with four lights.","Case Number":"18800","Log Number":"US-08212009-0022","Date Submitted":"08/21/2009 08:41 UTC","Source":"MUFON","Region":"Missouri","Object Shape":"Sphere, Teardrop, Triangle","City":"Kansas City","Tags":"City","Date of the Event":"08/21/2009 08:41 UTC","Viewing Distance":"Unknown","Object Flight Path":"Other","Weather Factors":"Unknown","Latitude":"39.102236","trends":["There have been 134 other sightings in Kansas City","There were 2 other sightings in Kansas City on or around August 21st 2009"],"files":["/var/www/straped/mufon/html2text/18800.html.txt","/var/www/straped/mufon/org/18800.html"]}