{"Source":"MUFON","Log Number":"US-08222009-0001","Latitude":"41.252905","City":"Wilkes-Barre","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"Orange Star-like light passes over Wilkes Barre from west to east","map":"<A HREF = \"http://maps.google.com/maps?q=41.252905,+-75.877208(18801)&iwloc=A&hl=en\"> mufon case (18801) map </A>","divs":["Sighting DetailsAt aproximately 0500 hrs on 08.16.2009 while unsecureing factility doors i was mentioning to a co-worker about how bright jupiter was in the sky, southern sky of my location. I had a set of binoculars in the crusier. Moments later I noticed out of the corner of my eye when i was returning the binoculars to the cruiser that what apeared to be a star but it was moving, upon a second look i could determine that the star-lit object was at an extremely high altitude, i want to say at a normal airliner cruseing altitude(30,000feet?). about a mile to the right of the object was a commercisal airliner traveling in the same direction, althought it's identification lights were clearly visable. The object quickly passed the airliner and moved from west horizon to east horizon in aproximately 4 minutes. The object made no noise, even the airliner at crusing altitude made some noise as it passed overhead. The object made no turns, or altitude changes to our knowledge. The night was cloudless with no moon untill 0530hrs. The object even thru the binoculars could not be distingushed to have a fuselage or identifying parts. it was an orange glowing starburst. no pulseing just a steady light as it passed. We lost sight of the object as it went over the horizon line. attempts to capture images of the object proved futile on a camera-phone. FLIR was unable to pick out the object from the night sky."],"Date of the Event":"08/16/2009 05:05 UTC","Weather Factors":"Unknown","Case Number":"18801","Country":"United States","Object Shape":"Star-like","Date Submitted":"08/16/2009 05:05 UTC","Tags":"City","Longitude":"-75.877208","Object Features":"Unknown","Region":"Pennsylvania","trends":["There have been 14 other sightings in Wilkes-Barre","There were no other sightings in Wilkes-Barre on or around August 16th 2009"],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/18801.html.txt","/var/www/straped/mufon/org/18801.html"]}