{"divs":["Sighting DetailsI was walking my dog accross a small open field near our home i was ten years old at the time, the hair on the back of my neck stood up and the dog ran under a bush. Out of the corner of my eye i saw something or somebody near the bush, suddenly i was bathed in light from above, there was a small lighted orb darting above that seemed to change size and shape 'it got bigger and the light was blinding and i felt heat. It hovered right above me and i remember thinking how quiet it was. Then the thing by the bush turned into a smaller orb about the size of a basketball and shot into the air towards the big orb which started pulsing they merged, pulsed real bright,then vanished in a streak.then my dog came out it was trembling and had a round burn on his nose like a car lighter would leave and the tip of his ear was missing but not bleeding. When i pulled myself togeather we RAN home and told my family and everyone laughed even when they saw the dogs was hurt. My parents tried to convince me that the dog tangled with a raccoon but i know what i saw and the dog would pull back and refuse to walk that way also the scars remained until he died at a very old age. about a week after I saw the orb i started feeling things, and even now i can sit in a crowded restaurant and haer what everyone at the tables around me are talking about. I also can play the piano and organ by ear and can see auras and the list goes on. i also have had this feeling of expectation which grows stronger the older i become, i am now 57 years old now and there is not enough room to write all the things that have happed since tha night."],"Longitude":"-73.997883","Source":"MUFON","Country":"United States","Log Number":"US-08222009-0005","files":["/var/www/straped/mufon/html2text/18805.html.txt","/var/www/straped/mufon/org/18805.html"],"Latitude":"40.720593","City":"New York","Case Number":"18805","Summary":"orb","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around July 18th 1965"],"Disposition":"Unknown","Weather Factors":"None","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet","Region":"New York","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.720593,+-73.997883(18805)&iwloc=A&hl=en\"> mufon case (18805) map </A>","Date of the Event":"07/18/1965 10:30 UTC","Object Features":"None","Date Submitted":"07/18/1965 10:30 UTC","Tags":"City","Sighting Duration":"Undisclosed"}