{"Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in South St Paul","There were no other sightings in South St Paul on or around November 30th 1974"],"Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/18819.html.txt","/var/www/straped/mufon/org/18819.html"],"Country":"United States","divs":["sighting detailswe were sitting outside on the hood of marks sisters car watching falling stars. that day we were watching tv, on the news they said there would be a nice light show in the sky...all the falling stars. so thats what we did. about 30 min. later mark saw a light in the sky, he said look a flying saucer. i looked over at it and said it was a plane with its lights on. then it stoped moving,he said can planes do that i told him it was a helicopter. at this time it was around 1\\4 mile away from us flying around then in a flash it was gone. we didnt know what to think. im not sure maybe 10 min.later thats when it started one after another at least 10 or more flew close by us, one came around 20 feet from us and about 3 feet off the ground. i asked mark too come over and look at it with me he wouldnt get off the car. i walked over only to stop 10 feet from it. i dont remember seeing any markings on it or windows it looked to be around 15 feet long. what i thought was strange it didnt make any noise im still trying to remember if lights were flashing on the side. it stayed there maybe 2 min. then moved away slowly behind a garage and trees. i walked around the garage only to see it was gone. i walked back to the car where mark was, sat on the hood and talked about what we saw. at that time it was getting really dark out think it was around 10:00.there was a big field across marks sisters apt. and we saw a huge ufo it had to be at least 300 feet long. at this time we were getting a little scared. we ran inside to wake up marks brother inlaw he walked out to the back door looking at this large ufo. he didnt say one word turned around and went back to bed. we called one of our friends and told him what we saw. he thought we were making fun of him... he was into ufo's reading books and all, we used to tease him about it. anyway mark told him to go outside and watch for flying saucers. we went back outside they were all gone we sat outside for awhile longer but didnt see nothing. nor did our friend dave. the next day we told everyone what we had seen. i dont have to tell you what they thought... but the next day people started calling in about ufo's they saw the night before. jim r. this happend in 1975"],"Object Features":"None","Longitude":"-93.036111","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.891944,+-93.036111(18819)&iwloc=A&hl=en\"> mufon case (18819) map </A>","Latitude":"44.891944","Disposition":"Insufficient Data","Log Number":"US-08222009-0019","Date of the Event":"11/30/1974 12:00 UTC","Date Submitted":"11/30/1974 12:00 UTC","City":"South St Paul","Case Number":"18819","Source":"MUFON","Summary":"a friend told me there would be lot's of falling stars that night. So we sat outside to watch. Thats when Mark saw the first one.","Region":"Minnesota"}