{"files":["/var/www/straped/mufon/html2text/18814.html.txt","/var/www/straped/mufon/org/18814.html"],"City":"Forest","Latitude":"43.104209","Case Number":"18814","Object Flight Path":"Undisclosed","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"Sighted small sphere maneuvering around airplane.","Region":"Ontario","map":"<A HREF = \"http://maps.google.com/maps?q=43.104209,+-81.997103(18814)&iwloc=A&hl=en\"> mufon case (18814) map </A>","trends":["There have been 2 other sightings in Forest","There were no other sightings in Forest on or around January 9th 2009"],"Date Submitted":"01/09/2009 02:30 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-81.997103","Tags":"City","Source":"MUFON","Log Number":"CA-08222009-0014","Country":"Canada","Disposition":"Unresolved","Date of the Event":"01/09/2009 02:30 UTC","divs":["Sighting DetailsForest, Ontario. January 9, 2009. 14:30 hrs. EST. Witness (C.C.) was outside walking her dog along the old railway track trail, when she noticed a small plane approaching over the nearby field and trees. There was a small (size of a car tire) dark silver ball near the wing of the plane, which she first thought might be an attached camera. As the plane flew low overhead (100 feet?), the ball flew or \"rolled\" around the wing of the plane, then moved behind the plane and became stationary. C.C. started to feel strange (movement and thinking impaired)as if inside some kind of \"bubble\". Her dog also appeared \"dazed\". Time seemed to stand still. The plane made a U turn to come back towards the ball. When the plane approached to within a couple hundred feet, the ball \"blinked out\". The witness watched the plane search for the ball for a while, then went home. She was tired and had trouble standing when she arrived home at approximately 15:45 hrs. C.C. called her mother on a cell phone to report her experience. The witness and her dog are now afraid to return to the location of the sighting."]}