{"Latitude":"39.025628","Weather Factors":"None","Region":"Kansas","Object Shape":"Triangle","Disposition":"Unknown","Sighting Duration":"Undisclosed","City":"Shawnee","Country":"United States","Source":"MUFON","trends":["There have been 6 other sightings in Shawnee","There were no other sightings in Shawnee on or around August 21st 2009","This sighting has never been favorited.",""],"Date Submitted":"08/21/2009 08:48 UTC","files":["/var/www/straped/mufon/html2text/18813.html.txt","/var/www/straped/mufon/more/18813_submitter_file1__0821092048.jpg","/var/www/straped/mufon/org/18813.html"],"Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.025628,+-94.713546(18813)&iwloc=A&hl=en\"> mufon case (18813) map </A>","Longitude":"-94.713546","Tags":"City","divs":["Sighting DetailsMy friends and I (6 of us total) were visiting the neighborhood pond when one of us called out to point out a lighted object far off in the dark sky. We watched the object circle around and one of my friends and i had jokingly called out, \"Haha look it's a UFO!\" Two of the guys with us decided it looked like a blimp judging on the lights positioning. I snapped a pic of the aircraft on my cell phone while it was still visable. The object had flown just out of sight behind some trees. We all were stunned at the thought of what that could have been. Finally everyone agreed that it had to have been a blimp. Approx. 2 min later the lights from before were much brighter now and behind us. We all turned around to see the object from before up close and right in front of us but just above the tree line. The aircraft, about the size of a small house, hovered while continuing to move right above our heads. At this point we could see the distinct outline of a very thin triangular shaped black object. Numerous lights lit up the underneath and a slight hum could be heard, but nothing like an airplane or a jet engine. My friends and I just watched it pass and as we were all in shock, nobody could get out their phone for a closer picture. Just after passing us and the small pond, the triangular aircraft increased speed and took off. The object disappeared within the blink of an eye. I was in complete shock as I had never seen anything like this before in my life."],"Date of the Event":"08/21/2009 08:48 UTC","Summary":"Triangular shaped thin black object (about the size of a small house) with numerous lights underneath passed directly over my friends and I just above treetop height.","Case Number":"18813","Log Number":"US-08222009-0013","Viewing Distance":"Unknown","Object Features":"Undisclosed"}