{"City":"Azusa","Object Shape":"Sphere","Summary":"Circular flying object over San Gabriel Valley in Los Angeles","Disposition":"IFO","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"18824","Source":"MUFON","Log Number":"US-08232009-0001","Date Submitted":"08/21/2009 10:15 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/18824.html.txt","/var/www/straped/mufon/org/18824.html"],"Date of the Event":"08/21/2009 10:15 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","trends":["There have been 9 other sightings in Azusa","There were no other sightings in Azusa on or around August 21st 2009"],"Tags":"City","Longitude":"-117.907563","map":"<A HREF = \"http://maps.google.com/maps?q=34.133619,+-117.907563(18824)&iwloc=A&hl=en\"> mufon case (18824) map </A>","Region":"California","Weather Factors":"Unknown","divs":["Sighting DetailsI live in Glendora, California. On August 21, 2009, As I was about to go to bed around 10:15pm, a bright light outside my west facing window caught my attention. It was a bright orange colored round light that was fairly slow moving. I told my wife that it might be a UFO sighting, she thought I was crazy, so I told her to take a look as well. It seemed like it was about 1-2 miles away from where we live (maybe over Azusa, California) and it went from north to south. It was flying at slow pace for about 10-15 seconds going south, then it stopped. It stayed at that same location for another 30-40 seconds or so. I went and grabbed my camera but when I came back, it started moving southwest and higher into the sky. As it proceeded in that direction, the brightness of the object went out from time to time until it finally disappeared. The whole sighting lasted about 1-2 minutes. I am not sure what to make of this event. I have never seen a UFO before, but I have always believed that there are other beings out there in the universe. Maybe that was a visit from the outer universe... Maybe."],"Latitude":"34.133619"}