{"Object Shape":"Undisclosed","Sighting Duration":"00:05:00","divs":["Sighting DetailsWitness 1 Form 1 dated October 24, 1978I was walking on Rock Way Drive somtime after 8 oclock on Saturday night when Isaw looked like a plane with short stubby wings coming toward me real slow fromMt. Hope avenue. When it was almost over me I could see that the bottom wastransparent with a lot of metal squares in rows. They looked like machineryparts. There were also lots of little red and blue lights around the edge. Ithovered for half a minute then it went backward toward Mt. Hope avenue and Ilost sight of it behind some trees and houses.Primary witness 2 form 1 is partly unreadable and is reproduced here to the bestof my ability.We were coming back from the movies on S. Washington. It was Saturday at 9:45pm. When I turned west onto Mt. Hope Avenue the kids began shouting, \"Look aUFO\" I stopped the car and all five of us got out and looked. It was shapedlike two saucers, on one top of the other. There were windows across the bottomhalf and a ring of lights around the top half, no lights around the rim. Itrotated while it hovered over this small factory. It was rocking back and forthover about four feet. After about 5 minutes or so it suddenly took off veryfast."],"Latitude":"42.738195","Country":"United States","files":["/var/www/straped/mufon/html2text/1882.html.txt","/var/www/straped/mufon/org/1882.html"],"trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around October 21st 1978"],"Summary":"Multiple wit. see large UFO in Lansing","Weather Factors":"Unknown","Date of the Event":"10/21/1978 09:45 UTC","Disposition":"Unresolved","City":"Lansing","map":"<A HREF = \"http://maps.google.com/maps?q=42.738195,+-84.549765(1882)&iwloc=A&hl=en\"> mufon case (1882) map </A>","Case Number":"1882","Object Features":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"10/21/1978 09:45 UTC","Log Number":"","Longitude":"-84.549765","Object Flight Path":"Undisclosed","Source":"MUFON","Tags":"City","Region":"Michigan"}