{"Disposition":"Unknown","Region":"Iowa","Summary":"Three orange UFO sightings in two months.","City":"Mason City","Source":"MUFON","Longitude":"-93.201037","Sighting Duration":"Undisclosed","Date of the Event":"09/23/2009 01:00 UTC","Object Shape":"Fireball, Sphere","Object Flight Path":"Undisclosed","Latitude":"43.153573","Object Features":"Undisclosed","Viewing Distance":"Unknown","Case Number":"18825","divs":["Sighting DetailsI was on the lake (Clear Lake) and we were about ready to watch the fireworks and I looked up and saw two orange lights. they were stagered. One started to fade and disapeared and the other started to fade and before it disapeared it shot strait up into the sky. Then a week or two later I was on the boat at the coralville dam and I saw another orange light but this time it was flying in a steady path I would say from north to south and it faded and disapeared shortly before the horizong. Then just tonight (08-23-09) I was on my couch at about 12:30 a.m. and I heard a noise outside. It sounded like a truck idling. So I went outside and saw what looked like three jet engines in a triangle shape moving directly away from me and it sounded like the woosh of a blow torch but was constant and loud. It looked like the back of a space shuttle. It was one craft. But its tregectory was horizontal and it just kept going. IT was traveling norht east. I watched it until it was out of sght due to the horizon. The first two sightings did not make any noise. They were completely silent. This last one had a flashing light on top it appeared but the three lights were the part that confused me and I have never heard this sound before. It was also very low to the ground."],"files":["/var/www/straped/mufon/html2text/18825.html.txt","/var/www/straped/mufon/org/18825.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.153573,+-93.201037(18825)&iwloc=A&hl=en\"> mufon case (18825) map </A>","Log Number":"US-08232009-0002","Tags":"City","trends":["There has been one other sighting in Mason City","There were no other sightings in Mason City on or around September 23rd 2009"],"Country":"United States","Date Submitted":"09/23/2009 01:00 UTC"}