{"Longitude":"-86.111294","Country":"United States","Object Shape":"Disc","Object Features":"None","Latitude":"39.983151","map":"<A HREF = \"http://maps.google.com/maps?q=39.983151,+-86.111294(18821)&iwloc=A&hl=en\"> mufon case (18821) map </A>","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","City":"Carmel","Log Number":"US-08222009-0021","Summary":"Horizontal black line became a silvery disc on its edge holding its position notwithstanding wind.","Date of the Event":"08/07/2007 09:15 UTC","Tags":"City","Date Submitted":"08/07/2007 09:15 UTC","Region":"Indiana","Source":"MUFON","Case Number":"18821","trends":["There have been 10 other sightings in Carmel","There were no other sightings in Carmel on or around August 7th 2007"],"files":["/var/www/straped/mufon/html2text/18821.html.txt","/var/www/straped/mufon/org/18821.html"],"divs":["Sighting DetailsAs a newly licensed school bus driver for Carmel Clay Schools, I exited my parked bus at the Westside transportation facility at 12400 Shelborne, Carmel, Hamilton County, Indiana. I stood in the parking lot and looked north to watch a turboprop twin engine Beechcraft King Air flying south at 1000 feet above ground level (AGL) .25 mile to the east of my position. It turned from south to west and flew over my position, then, when .25 mile west of my position it turned to a heading of approximately north and lowered landing gear and flaps and began a 3 degree descent presumably to Executive Airport located four miles north of my position. I am a commercial pilot certificate holder, airplane single and multi engine land and instruments. I also hold a Certified Flight Instructor, Instruments certificate for single engine airplanes. It was pleasant to watch the aircraft execute its approach. The airplane was about a mile north of its turn onto final approach when I observed a straight black horizontal line .25 mile directly west of the aircraft at a slightly higher level than the aircraft. The aircraft was descending through approximately 750 feet AGL. The black, crisply shaped, thin rectangle could be called a thick black line about one inch long when seen from my position. I thought it was a large black bird with its wings outstretched flying on a thermal. The line was too perfectly straight to be a bird, however. Birds on thermals have a slight dihedral or upswept or downswept wingtips, and their bodies make small adjustments to dynamic flight conditions. This bird had no flex to the wings, nor a body. I ignored the airplane and stayed fixed on the bird to see what it would do next. I blinked my eyes and the straight line \"bird\" was completely, abruptly, and suddenly gone and seemingly replaced by a thin flat disc on its edge! That it was smooth, flat, and of an unpainted metal color was very obvious by the fact that it accurately reflected the color of the sky and the scattered cumulus clouds enveloping it as they passed from west to east at 1000 to 1500 feet AGL. There was no convex character of the surface. It was perfectly and precicely flat. I believe the black line was the appearance of the edge of the object when it was positioned parallel to Earth's surface like a coin placed placed flat on a surface. My estimation of dimensions is that the black line was three feet thick. Its diameter, when seen while in its vertical position like a coin placed on its edge, was fifty feet. That it was a controlled machine was perfectly obvious in that, despite the wind, it stayed in exactly one position over the ground. Further, it was perfectly stable with no wobble, bobble or oscillation. It was precisely fixed in the vertical attitude and in one location. After many moments, it released its hold on its position and drifted leisurely eastward with the wind. I did not want to blink again for fear that it would change yet again. I did not want to lose sight of it. I had to blink, however, so I did so as quickly as possible. During my blink the object dissappeared. My eyes searched and searched for it and were unable to locate it again. When I realized it was gone I felt I had been treated with contempt by the operators of the machine. I felt and still feel that I saw it quite clearly, that I can probably deal with the reality and agenda of its operators, and that the operators of the machine underestimate observers and are disrespectful to us in making the apparatus suddenly dissappear without explanation, or movement, or a trail to satisfy our sense of logic. On the other hand, what if they are hostile to us? Frankly, this sequence of events makes more sense to me if this was a hostile use of our airspace."],"Object Flight Path":"Hovering then path"}