{"files":["/var/www/straped/mufon/html2text/1883.html.txt","/var/www/straped/mufon/org/1883.html"],"divs":["sighting detailstonight 9\\20\\2002, at approximately 7:49 pm central time, i had stepped outsideand i observed what appeared to me to be a orb type ufo that was almost directlyover my house here in elk city, oklahoma. (100 miles west of oklahoma city oni-40).i noticed the object was perfectly round, and it was extremely bright-almost too bright to look at directly at first. i also noted a unusual whiteflorescence to it. on closer examination with my 10 x 50 binoculars, it appearedto have 2-3 internal lights of some kind that were clearly visible, similar to ahot air balloon would have. however, it was not a balloon. no other details werenoted. it flew in a westerly direction roughly following i-40 toward amarillo.after it flew from overhead, and at about a 45 degree angle to the horizon, itstarted to rapidly change colors to a yellow, then a bright red and finally to adeep blu!e-purple internal glow that it maintained until it disappeared.i was able toestimate the object to be at about 5,000 feet, and moving at about 25-30 milesper hour, and it was moving steadily to the west.at the time of the sighting wehad a se wind at 5-7 mph. the object was in sight until about 8:15 pm when itwinked out as i was watching it through binoculars. it went from about a 80degree overhead angle to about 20 degrees above the horizon in that time. atits closest it was about 1\\2 the size of the full moon, or about the size ofyour thumb at arms length.i have eliminated weather balloons, planets, stars,aircraft and blimps as a possible explanation. i did notice venus in thesouthwest sky about 10-15 degrees above the horizon. the object did not resemblevenus or a star. there were no aircraft in the area at the time of thesighting.if anyone else saw this object contact me at:jim@thehickmanreport.comjim hickmanmufon- research specialist- media operations"],"Date of the Event":"09/20/2002 07:49 UTC","Region":"Oklahoma","Longitude":"-99.404259","Disposition":"Unknown","Tags":"City","Log Number":"","trends":["There have been 2 other sightings in Elk City","There were no other sightings in Elk City on or around September 20th 2002"],"Object Flight Path":"Straight-line path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"35.411994","Weather Factors":"Unknown","Country":"United States","Summary":"Orb UFO Report","Object Shape":"Sphere","Source":"MUFON","Object Features":"Other","City":"Elk City","map":"<A HREF = \"http://maps.google.com/maps?q=35.411994,+-99.404259(1883)&iwloc=A&hl=en\"> mufon case (1883) map </A>","Case Number":"1883","Date Submitted":"09/20/2002 07:49 UTC","Sighting Duration":"00:30:00"}