{"files":["/var/www/straped/mufon/html2text/18838.html.txt","/var/www/straped/mufon/org/18838.html"],"Weather Factors":"Unknown","Object Shape":"Unknown","Date Submitted":"08/17/2009 11:00 UTC","Viewing Distance":"Unknown","Longitude":"-85.599304","Object Flight Path":"Undisclosed","Country":"United States","Date of the Event":"08/17/2009 11:00 UTC","Disposition":"Unknown","trends":[],"Tags":"City","Case Number":"18838","divs":["Sighting DetailsIt was Monday night August 17th, 2009 at around 11pm to Midnight sometime. I didn't have a watch on. My brother, his girlfriend and her sister and I where all in the row boat, my brother was driving the boat with the motor. We made our way around for probably 20 min and slowed down and decided to drift. We sat there for a bit, and I began to look up and saw 2 white lights round and looked unusual to anything else I normally see in the sky. So I was like huh. I let everyone on the boat know and as I watched it, at that point it started moving. It was right above us when I first saw it, and had a feeling it had been there. The 2 lights where round and fixed apart and the light was the same brightness as the moon is. So, as all of us became aware of it, it moved to our right or the west very slowly and very slowly dimmed its lights off. This whole experience was probably about 20 to 40 seconds. I was unable to see any shape to the object, it was dark but the stars where out, but it had been hazy in the evening before but was still clear out. The height of the object in the sky appeared to be up there a bit but not super high or super low, maybe 5 to 10,000 feet, not sure. It was strange how it was above us and then when we became aware if it it dimmed its lights very slowly and moved slowly but surely to the West. There was no noise. It was an unusual experience."],"Log Number":"US-08232009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=44.317314,+-85.599304(18838)&iwloc=A&hl=en\"> mufon case (18838) map </A>","Latitude":"44.317314","Object Features":"Undisclosed","City":"Undisclosed","Summary":"Sighting over Lake Huron.","Sighting Duration":"Undisclosed","Region":"Michigan","Source":"MUFON"}