{"files":["/var/www/straped/mufon/html2text/18836.html.txt","/var/www/straped/mufon/more/18836_submitter_file3__videopicsharpened1.jpg","/var/www/straped/mufon/org/18836.html"],"Latitude":"49.891152","Summary":"Silver object spotted in binos recorded through my telescope with handheld video camera","Date of the Event":"08/21/2009 02:30 UTC","Weather Factors":"Unknown","Case Number":"18836","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around August 21st 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsTwo days ago I was looking for unidentifiables, expecting to see nothing I watch the clouds laying in my lawn chair recliner with binocs glued to my head scanning the sky, high in the north western sky I noticed a very small shinny objects travelling in front of the clouds on a slow consistent south west path. I observed it for a good 20 minutes when my neighbour startled me to ask to check why the sink leaks. about 10-15 minutes later I was outside again trying to find where it had gone. from my first observation I predicted that if on the same path it would be somewhere in front of it(obviously) after looking all over, to my excitement I had found it again. It appeared much farther away. In the back of my mind from when I frist saw it I had been telling myself to grab my telescope and have a look, but hesitated. I figured I would lose it and never see it again doing so. after a long viewing of the object through binoculars and not seeing much more than a point of silver light I took my telescope out and tried to find it. it took me a while to find. by now it was low in the west travelling what seemed to be farther away and creeping north. I took about 30 pictures through my telescope in magnifications ranging from 48x96x and 120x the pictures were quite blury due to my lack of camera skills. I then used the cameras video recording option and recorded 3 clips 2 in 120x mag and 1 in 48x magnification. The object was perfect round. On the clips the scope is bouncing slightly due to wind and shifts when I attempt to center the object. The picture I am sending is taken from the third video and sharpened with paint shop pro, and is my fav image from the event so far. I would like to think it is a weatherballoon but the characteristics of the objects and what I have been seeing on the internet, leed me to think otherwise. maybe someone can debunk this."],"Disposition":"Unresolved","Longitude":"-119.486771","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","Region":"British Columbia","Country":"Canada","Date Submitted":"08/21/2009 02:30 UTC","Object Flight Path":"Undisclosed","City":"Kelowna","Tags":"City","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=49.891152,+-119.486771(18836)&iwloc=A&hl=en\"> mufon case (18836) map </A>","Log Number":"CA-08232009-0013","Object Features":"Undisclosed"}