{"Region":"California","files":["/var/www/straped/mufon/html2text/18832.html.txt","/var/www/straped/mufon/org/18832.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.109355,+-117.280565(18832)&iwloc=A&hl=en\"> mufon case (18832) map </A>","Object Shape":"Flash","Sighting Duration":"Undisclosed","Date of the Event":"08/22/2009 10:30 UTC","divs":["Sighting DetailsWhen driving home on north Little Mountian road I noticed approximately 6 blue colored lights hovering together in a northern location from my residence and remained in same position for approximately 15-20 minutes. I first noticed them just as I was preparing to turn into my complex. I pulled over to watch them and attempt to video them with my camera phone. The objects then seperated slowly first moving in an east direction and then 3 continued in a northern direction towards the Cajon Pass and 3 headed in a northeastern direction towards lake arrowhead. The event lasted approximately 30 minutes or more. There were numerous persons in the area observing the same incident. The objects appeared small and blue and often had a flash coming from them. When I first observed these things I though that they must be some kind of toys as there are persons who fly remote control airplains from the top of Little Mountian, but realized this was not possible as they were hovering and in formation. I then thought that it must be some kind of military operation, but it is nothing like I have ever seen before. I live in the flight path for civilian aircraft of Ontario Airport and there are jets that fly over my location. During the time of these object appearing one ject flew over right at the start and no further aircraft flew by while I was trying to observe these objects (unusual jets fly by every 5-10 minutes)."],"Weather Factors":"None","Country":"United States","Longitude":"-117.280565","Date Submitted":"08/22/2009 10:30 UTC","Log Number":"US-08232009-0009","Object Features":"Unknown","Disposition":"Unknown","trends":["There have been 17 other sightings in San Bernardino","There were no other sightings in San Bernardino on or around August 22nd 2009"],"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Latitude":"34.109355","Tags":"City","Case Number":"18832","Viewing Distance":"Unknown","Source":"MUFON","Summary":"6 light objects hovered over area and then seperated","City":"San Bernardino"}