{"Country":"United States","Date of the Event":"05/31/2006 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.140836,+-73.261262(18837)&iwloc=A&hl=en\"> mufon case (18837) map </A>","Viewing Distance":"Unknown","Weather Factors":"Unknown","City":"Fairfield","trends":["There have been 7 other sightings in Fairfield","There were no other sightings in Fairfield on or around May 31st 2006"],"Case Number":"18837","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18837.html.txt","/var/www/straped/mufon/org/18837.html"],"Object Shape":"Circle, Star-like","Summary":"A large star was observed around sunset at the beach. We then watched it 'dim' out","Object Features":"Unknown","Longitude":"-73.261262","Latitude":"41.140836","Object Flight Path":"Stationary","Tags":"City","divs":["Sighting DetailsAbout three years ago my friends and I were at the beach. The sun had set and the sky was getting darker but was still quite blue. My twin brother and I were looking towards the parking lot at the western sky and noticed a bright 'star'. We were quite surprised by it, we are frequent star gazers and have never noticed a star this bright at this time of night. We decided it must be a planet, because the object was brighter than a star, but what planet could it be? It was a perfect circle and bigger than stars are but it was still quite small. I think we both were thinking 'UFO' but it was not moving and for all we knew it could be a planet, as no star would be that bright. We pointed it out to our friends who thought it strange but were not as interested in it. We pulled ourselves away from observing the 'star' and followed our friends down the beach a bit. We returned to the spot about 10 to 20 minutes later and the 'star' was still there. My twin and I stopped to watch it before returning to our car. It was in the same spot, you couldn't miss it. We then watched it do something amazing - it winked out! It was as if someone had a lightswitch dimmer and dimmed it until it disappeared. This shocked my brother and I, we both exclaimed, \"did you see that!?\" but no one else was watching the object. My twin and I were very excited and kind of shocked at what we had just seen, deciding among ourselves that we had just seen a UFO."],"Source":"MUFON","Region":"Connecticut","Disposition":"IFO","Log Number":"US-08232009-0014","Date Submitted":"05/31/2006 12:00 UTC"}