{"Region":"Texas","Case Number":"18835","Country":"United States","files":["/var/www/straped/mufon/html2text/18835.html.txt","/var/www/straped/mufon/org/18835.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Disposition":"Unknown","divs":["sighting detailsthis is 1 of 3 sightings i had on august 19, 2009. i will post each one separately, as requested by the local mufon field investigator. i am sending her completed sights report forms, so contacting me will not be necessary. please not: the time on this report is erroneous. your online form would not accept 00:35 hours. my report is as follows: it was august 19, 2009, at 00:35 (12:35 a.m.). i opened my front door (facing north) and saw what at first appeared to be a commercial jet, heading west to east. however, it looked to be at least 3 times the size of a jumbo jet, if it were at the same cruising altitude. all i could see was a string of perhaps 15 red and white lights (like a string of beads) all the way across, from what would be wingtip to wingtip. two of the center white lights seemed to flash alternately, once every second. there were no lights fore or aft, no green nav light. if there was a fuselage, i could not see it, there just weren't any other lights. the string of lights appeared to be moving at about the same or slower speed as a commercial jet. the object(s) continued on to the east and i stepped back inside to grab my camera, which took all of 5 seconds. when i looked again, the object was gone. just before this sighting i had seen a jet far to my ne, putting it far ahead of the unidentified object. i hear jets passing overhead all the time, as we are in the flight path to dfw. there is also a local airport not far behind our property, with an aviation museum. i have video of a vintage military airplane flying directly over my house (close) and then landing at the airfield. i hear the normal aircraft activity each day but i did not hear any sound from the lights. 1. i was at home and opened my door to look outside. 2. i noticed a jet (far to my ne) and then saw what appeared to be a string of lights in the sky directly north of me. 3. i first thought it was an odd jet but it had way too many lights and none fore, or aft. could not see a structure\\frame\\fuselage. 4. up to 15 alternating red and white lights in a row, like string of beads. they were in a perfect line (north to south), moving west to east. 5. i felt perplexed, then i knew this was not a normal aircraft. 6. the lights disappeared while i grabbed for my camera."],"Latitude":"32.759807","trends":["There have been 16 other sightings in Breckenridge","There was one other sighting in Breckenridge on or around August 19th 2009"],"Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=32.759807,+-98.8937(18835)&iwloc=A&hl=en\"> mufon case (18835) map </A>","Object Features":"Unknown","Object Shape":"Other, Unknown","Date of the Event":"08/19/2009 01:00 UTC","Date Submitted":"08/19/2009 01:00 UTC","Source":"MUFON","Longitude":"-98.8937","City":"Breckenridge","Log Number":"US-08232009-0012","Object Flight Path":"Straight-line path","Tags":"City","Summary":"I saw a string of red and white lights traveling West to East"}