{"Viewing Distance":"Over One Mile","Sighting Duration":"00:00:10","files":["/var/www/straped/mufon/html2text/18844.html.txt","/var/www/straped/mufon/more/18844_submitter_file1__8-19-09_DisappearingPlane.jpg","/var/www/straped/mufon/org/18844.html"],"Weather Factors":"None","Region":"Texas","Object Flight Path":"Straight-line path","Source":"MUFON","Object Shape":"Diamond, Other","Log Number":"US-08232009-0021","divs":["Sighting DetailsAug. 19, 2009 13:00 Location: Archer City, TX Archer City is located near Shepperd AFB in Wichita Falls My spouse and I were on our way to Wichita Falls. We stopped in at the Dairy Queen off of Hwy 79 in Archer City. I was sitting at a booth by a North facing window, sipping on a malt and watching what I assumed was a small white plane. The plane (?) was moving from my NE to ENE (West to East) at approx. 5,000 ft AGL. It appeared to bank it's wings to the right, then there was a brilliant flash of light which I assumed was a refection from the sun. However, at that instant the object took on a diamond like shape. It flew a short distance further and vanished, as if it flew into a hole in the sky. I looked all around that area of the sky and never saw it again. I told my spouse \"after the fact\", after his having seen the perplexed look on my face. At the time of sighting, my mind was trying to process what I was seeing, so I didn't say anything. My spouse could not see the object, as he was seated facing me and had a wall to his right. I was facing him, with a clear view out the window, North and East. I assumed it was a plane, because the object 'appeared' to be a small plane. I should have been able to view the object for quite some distance, as the sky was clear, with just a few puffy clouds. The object was in open sky and not near any of these clouds. I was inside the Dairy Queen and could not hear any outside noises, except for occasional traffic on Hwy 79 and inside the Dairy Queen. This sighting lasted at most, 10 seconds. 1. Having lunch at the Dairy Queen in Archer City. 2. I noticed a small solid white plane headed East. 3. I thought it was a Piper Cub. 4. The supposed plane was traveling West to East, banked to the right, flashed a brilliant white, then took on a diamond shape. 5. My feeling during sighting was one of wishing I was piloting the plane and after, astonishment. 6. I lost sight of the object when it simply vanished, like flying into a hole in the sky. I am sending a depiction of what the object looked like from my perspective (looking through the window at object), just as it began to tilt to the right."],"trends":["There have been 2 other sightings in Archer City","There were no other sightings in Archer City on or around August 19th 2009","This sighting has never been favorited.",""],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.600919,+-98.617253(18844)&iwloc=A&hl=en\"> mufon case (18844) map </A>","Latitude":"33.600919","Summary":"I saw what I thought was a plane, that changed into a diamond shape and disappeared.","Date Submitted":"08/19/2009 01:00 UTC","Tags":"City","Date of the Event":"08/19/2009 01:00 UTC","Longitude":"-98.617253","City":"Archer City","Object Features":"Wings, Other","Case Number":"18844","Disposition":"IFO"}