{"Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"08/23/2009 01:30 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-117.151865","Country":"United States","Log Number":"US-08242009-0013","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=32.718019,+-117.151865(18858)&iwloc=A&hl=en\"> mufon case (18858) map </A>","divs":["Sighting DetailsI was driving east on the 52 just two miles east of the 805. I glanced our my driver side window and saw a huge rectangular object in the sky. It was hovering or moving pretty slowly. Shocking thing was the size of it and the shape of it. My brain just couldn't compute what it could be, it just didn't belong in the sky. I wondered could it be something being used at Merimar air station for target practice. It floated like a blimp but a totally different shape and size. It was rectangular, but almost squar. It looked like maybe it had a ring around it's middle but i couldn't make out the details. It was probably a dull grey color similar to a battleship. I estimated it at about 1 mile (5,000 ft) and moving very slowly. it was hard to judge the size but I'd guess it was over 300 feet wide and over 200 feet tall. I think I got a picture on my cell phone camera, but only after it had traveled a ways away. I might load it on my computer and see if this is what I saw. Did anyone else report this? I wish someone could tell me what it was. I was freaked out to say the least. I called my wife about 5 minutes later and told her what I saw. I had left my Sony hybred camera at home with a 60 power zoom lense. So the one time I didn't have my camera with me, sure enough, I see something that would of made an incredible picture..."],"Object Shape":"Square, Rectagular","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around August 23rd 2009"],"Viewing Distance":"Unknown","Case Number":"18858","Tags":"City","files":["/var/www/straped/mufon/html2text/18858.html.txt","/var/www/straped/mufon/org/18858.html"],"Summary":"Huge rectangular object just north of the 52 and two miles east of the 805","City":"San Diego","Weather Factors":"Unknown","Region":"California","Latitude":"32.718019","Date of the Event":"08/23/2009 01:30 UTC"}