{"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.275468,+-84.262026(18859)&iwloc=A&hl=en\"> mufon case (18859) map </A>","Country":"United States","Object Flight Path":"Undisclosed","Tags":"City","Date Submitted":"08/24/2009 08:25 UTC","divs":["Sighting DetailsTonight (August 24th 2009) at 8:10pm my daughter told me there was a bright object in the sky. Thinking it was an early star I went outside to look. It was still very light out so I was suprised to see this very bright white object, so I told her it was probably Venus or another planet. just to be sure I had brought my binoculars for viewing. I watched this oject for about 15 minutes and it was motionless the whole time then I noticed a west bound commercial plane approaching close to the object so I kept on viewing the object and at one point I could see the object and the plane within the view of my binoculars. The plane appeared to be at cruising alttitude so I'm guessing 30-35,000 feet. The plane didn't react to the object so this further bolstered my belief it was a star or planet. At that moment the object became very fuzzy and dimmer. Thinking I had fogged up my binoculars I cleaned the optics and returned to viewing the object. At this point there was a whispy plume coming off of the now dimmer object and within the plume I could see smaller white orbs shooting through. I instantly thought this reminded me of a YouTube UFO video from Mexico where an object was shooting orbs out of it, I mean it looked almost exactly like that. I ran in to get my video camera and by the time I got back the event was over I swear to everyone who reads this that I actually saw this event as described."],"Longitude":"-84.262026","Viewing Distance":"Unknown","Object Features":"Undisclosed","Region":"Ohio","Summary":"As bright as Venus then dims while ejecting plume and smaller orbs","files":["/var/www/straped/mufon/html2text/18859.html.txt","/var/www/straped/mufon/org/18859.html"],"Disposition":"Unknown","Object Shape":"Star-like","Log Number":"US-08242009-0014","trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around August 24th 2009"],"Date of the Event":"08/24/2009 08:25 UTC","Weather Factors":"Unknown","Latitude":"39.275468","City":"Loveland-Madeira Corridor","Case Number":"18859","Source":"MUFON"}