{"Case Number":"18853","map":"<A HREF = \"http://maps.google.com/maps?q=42.482316,+-122.796268(18853)&iwloc=A&hl=en\"> mufon case (18853) map </A>","Date of the Event":"07/15/2008 02:00 UTC","Latitude":"42.482316","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"07/15/2008 02:00 UTC","Country":"United States","trends":["There has been one other sighting in Eagle Point","There were no other sightings in Eagle Point on or around July 15th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/18853.html.txt","/var/www/straped/mufon/more/18853_submitter_file1__Sphere.jpg","/var/www/straped/mufon/org/18853.html"],"divs":["Sighting DetailsI was standing on my front porch. The sky was absolutely clear, except for a tiny cloud over the valley. Because of that I looked up and watched the cloud grow as if it were in a speeded up time frame (very fast). I watched it grow speedily for a few seconds then looked to the side (about at 2 o'clock) and saw a tiny round object sitting in the sky. It was white, light gray, or silver. I moved my eyes back to the little cloud that was still expanding quickly. A second cloud had sprung to being and was also growing quickly. I reached inside my screen door and got my binoculars that I keep there (I'm an avid bird watcher), and looked at the sphere thru them. It had no unusual features even seen thru the binoculars, just like a little round ball. I looked back at the clouds, then back at the sphere only to realize it was no longer there. I hadn't seen it leave, and don't know where it went. The clouds began to fade and were soon gone, leaving the sky absolutely clear again. I saw nothing further. I'm sorry I didn't have time for photos, but I did a quick recreation in Photoshop. Linda Matusich"],"Log Number":"US-08242009-0008","Object Flight Path":"Stationary","Weather Factors":"None","Object Shape":"Sphere","Disposition":"Unknown","Summary":"Sphere near small cloud","Region":"Oregon","City":"Eagle Point","Longitude":"-122.796268","Tags":"City"}