{"City":"Auburn","Object Features":"Dome","Country":"United States","Case Number":"18856","Longitude":"-122.218953","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Disc, Star-like","Viewing Distance":"Unknown","Object Flight Path":"Path then hovering","Latitude":"47.308383","divs":["Sighting DetailsAt the time of the sighting, two adult males (My son and my nephew) and two adult females (My daughter and myself) were walking outside in Auburn, Washington at 1:39 AM as my daughter was going home next door. Since we are in a rural location and it was dark out, we were seeing her home safely. She happened to point out that the stars looked different - We are all avid sky watchers - and all looked up to consider what she said. She then said that she had never seen a certain tiny constellation in the Southwestern sky and we all looked to the area she was indicating. My nephew asked if it had changed shape, and all four of us noted the change from a 'ladle' shape to a square and then a triangle. Stunned, we watched the shape chnage further into a rounded heart shape, a line, a zig zag, and I told my daughter to get her camera which she had left inside my house. While she was trying to video tape the object, I went into the house, got my camera, and turned all the lights out. I went back outside and we watched and did our best to document what we were seeing. If the ground were at 0 and directly above us were a 10, the object would have been near the 7. As we stared towards the South South East, the Pleiades was at a 9 and to our left (East). At arm's length, it would have taken a nickel to cover it. At first we thought the lights were shifting into the repeating shapes, but as we watched over 2 hours, we realized it was a saucer shaped object with the lights along the edge and the ship was rotating, causing the light pattern to shift. The object drifted to the East very slowly, and then drifted back to the West. We could not judge the size very well, but for some reason we all thought it was huge. We watched a Sattelite go from the south west to the north east and I would guess that the object was about the same level as it, as the lights were of a similar size. It could have been smaller and much closer - It was impossible to tell. We also noted several shooting stars, including one that 'shot' slower and did not fade as it curved from the area of the object and went East. We tried very hard to remain calm, but we all felt a sense of awe and gratitude. We all sent mental messages of thanks, for what it may have been worth - and we all felt excited and nearly euphoric. We all agreed that what we were seeing was beautiful. Although we took dozens of pictures and videos, which we will gladly send in if requested, the lights were apparently not strong enough to be picked up by our cameras. Maybe someone has a program on their computer that can help see what may have been picked up in the videos. We will continue to sift through them. I am still rather blurry, as I am a bit old for dawn patrol, and I did not actually get to bed until nearly 4:30 in the morning."],"Log Number":"US-08242009-0011","Region":"Washington","Summary":"Amazing saucer shaped ufo with lights that made changing patterns in the sky","Date Submitted":"08/24/2009 01:39 UTC","trends":["There have been 12 other sightings in Auburn","There were no other sightings in Auburn on or around August 24th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=47.308383,+-122.218953(18856)&iwloc=A&hl=en\"> mufon case (18856) map </A>","files":["/var/www/straped/mufon/html2text/18856.html.txt","/var/www/straped/mufon/org/18856.html"],"Tags":"City","Source":"MUFON","Date of the Event":"08/24/2009 01:39 UTC"}