{"Tags":"City","Date of the Event":"08/23/0001 02:30 UTC","Date Submitted":"08/23/0001 02:30 UTC","Country":"United States","Viewing Distance":"101-500 Feet","trends":["There have been 2 other sightings in Monahans","There were no other sightings in Monahans on or around August 21st 0001"],"Latitude":"31.602279","Weather Factors":"None","Region":"Texas","files":["/var/www/straped/mufon/html2text/18854.html.txt","/var/www/straped/mufon/org/18854.html"],"Object Flight Path":"Hovering then path","Object Shape":"Sphere","Longitude":"-102.886934","Case Number":"18854","Log Number":"US-08242009-0009","divs":["Sighting DetailsI was at a friends house, attending a cook out. We were all sitting around talking and having a few cold ones, when we all heard this loud whoosh sound, that got louder and louder. From about 200 yards away, we say four bright red spheres rise out of the brush one by one. The speheres were about the size of a large pickup truck and were glowing a bright red that lit up the surrounding area, including the back of the house we were at. My friends horse all began rearing up and nervously whinnying and runnning around the corral as the objects rose. They all rose quietly into the sky, when the last one got to about 100 feet off the ground they slowly headed off to the east, towards the electric plant that sits outside of Monahans. They then seemingly hovered over the plant for about 4 minutes. Then they all rose in unison and zoomed off in a near vertical ascent, About 3 seconds later, there was a loud clap of what sounded like thunder, but sounded like a sonic boom. It took about 15 minutes before the animals all calmed down and quiet returned to the countryside. We all watched in completely and utter amazement, about 1 minute passed by before someone said anything, even then we couldn't come up with a reasonable explanation. Alot of us grew up in Monahans and many of us have seen the strange glowing lights that seem to be attrated toward the plant, but we've seen them from a long way off, usually at night as we are driving back home from Odessa or Kermit. They usually are seen only rising up and disappearing into the night sky. We stayed up most of the night talking about it and we still couldn't come up with an explanation to what we witnessed. But I know that I would have doubted what I would have seen if there had not been 8 other people there with me that night."],"Object Features":"None","Sighting Duration":"Undisclosed","Summary":"4 Red Glowing Spheres","Disposition":"Hoax","City":"Monahans","map":"<A HREF = \"http://maps.google.com/maps?q=31.602279,+-102.886934(18854)&iwloc=A&hl=en\"> mufon case (18854) map </A>","Source":"MUFON"}