{"divs":["Sighting DetailsI was attending at 6 a.m. exercise class at Black Rock Road Park in Collegeville, PA (montgomery county). I ended the class for myself at 6:30 a.m. but the rest of the class continued until 7 a.m. At 6:30 a.m. I went to my car and put on my shoes to walk on the walking path at the park. As I was walking, I looked to the western sky (maybe south western) and saw a large object hovering in the air. I thought it was odd since it was not shaped like a hot air balloon. In stead of being tall vertically as a balloon is it was wide and thin in a horizontal direction. I kept walking but lost sight of it. While walking I did see a plane pass overhead (right over the 422 highway) but that looked very different than what I saw. After I was done with my walk I got in my car, the clock read 6:49 a.m. and left the park. As I was leaving the park I saw the object again. It seemed to be in the same location as I originally saw it. That seemed odd to me since I should have been able to see it in that position the entire time I was walking. It was again not moving. I stopped and looked for under a minute since there was traffic. It looked long and retangular. It seemed grey in color. It was still hovering in the same place that I thought I saw while walking. I also thought that I saw piers or tower type structure on it but wasn't certain. It was a little too far away for me to see clearly. It seemed to be over the towns of Mont Clair, PA and Phoenixville, PA. I turned right out of the park entrance, drove a few feet, turned left into an area that I could park to see if I could observe it again. There were too many trees to see it from that position. I called my husband on my cell phone to tell him what was going on and I looked at the clock in my truck, it read 6:51 a.m. I took route 113 home hoping to be able to see it again since there is less traffic on that road then my normal route home but I didn't see it again. I also noticed that, at the park,no one else seemed to see it. But, I was the was the only person on the walking path at the time. This whole experience made me feel really wierd. I had a paper route for several years where I saw lots of odd things between 2a.m.-7a.m. but never anything that I couldn't logically explain. This didn't seem like any airplane, hot air balloon, or helicopter that I have ever seen. The most possible explanation would be a balloon but then why could I not consistently see it in the sky? I feel foolish submitting this but maybe someone else saw it as well."],"Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18865.html.txt","/var/www/straped/mufon/org/18865.html"],"City":"Collegeville","Source":"MUFON","Viewing Distance":"Unknown","Summary":"spotted retangular object floating in sky that didn't move for several minutes","trends":["There have been 4 other sightings in Collegeville","There were no other sightings in Collegeville on or around August 25th 2009"],"Object Features":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.18757,+-75.446441(18865)&iwloc=A&hl=en\"> mufon case (18865) map </A>","Log Number":"US-08252009-0004","Region":"Pennsylvania","Latitude":"40.18757","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Weather Factors":"None","Object Shape":"Square, Rectagular","Date Submitted":"08/25/2009 06:40 UTC","Longitude":"-75.446441","Case Number":"18865","Date of the Event":"08/25/2009 06:40 UTC"}