{"Source":"MUFON","Object Shape":"Disc","City":"Port Richey","Date Submitted":"06/01/2005 12:00 UTC","divs":["sighting detailsi sent a link to this video over 2 yrs ago. don't believe you guys took any time to look at it. it is by far the best ufo video ever. now the video link i'm including is not the best video, but the original is available to someone who has the means to acquire it. i have tried to acquire a copy of this video to no avail. now the way i originally viewed this video was thru my tv's high quality dvr. had this video on my dvr for over 1 yr., and it got erased by mistake. when viewed on a high quality dvr you will have (62) frames of this ufo (3.5sec) i'm sure if you can get access to a dvd of this video you will be able to professionally observe and prove this object is a silver disk that shoots out of the water and changes direction like no terrestrial vehicle. in my opinion this silver disk accelerates from 100 or 200 mph to 1000 or 2000 mph in less than 1 sec. please do not dismiss this msg. i had been in contact with the president of your co. years ago. ok here is the link http:\\\\www.mtv.com\\videos\\the-duel-full-episode-ep-15\\1549313\\playlist.jhtml yes it is a reality tv show (real world road rules), this makes it much more reliable video with higher definition than any camcorder. please, please review this video very carefully. the time frame is 4:25-4:28. you will see this vehicle accelerates so fast that it actually echos on the video, this isn't cause of the poor quality online, it happens in high quality dvr at (62 frames in 3 sec). the 1 disk echos up to 2 times in (1) frame, that is damn fast!!!"],"Case Number":"18863","Summary":"Video of silver disk coming out of the water and accelerating to over 1000mph.","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/18863.html.txt","/var/www/straped/mufon/org/18863.html"],"Weather Factors":"Unknown","Longitude":"-82.719545","Region":"Florida","Latitude":"28.271676","Log Number":"US-08252009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=28.271676,+-82.719545(18863)&iwloc=A&hl=en\"> mufon case (18863) map </A>","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Tags":"City","trends":["There have been 8 other sightings in Port Richey","There were no other sightings in Port Richey on or around June 1st 2005"],"Object Features":"Undisclosed","Date of the Event":"06/01/2005 12:00 UTC"}