{"Object Features":"Patterned Surface","Object Flight Path":"Stationary","Case Number":"18862","Date Submitted":"08/17/2009 08:28 UTC","Object Shape":"Disc, Unknown","trends":["There has been one other sighting in Yelm, McKenna","There were no other sightings in Yelm, McKenna on or around August 17th 2009","This sighting has never been favorited.",""],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/18862.html.txt","/var/www/straped/mufon/more/18862_submitter_file1__DSC00078.JPG","/var/www/straped/mufon/more/18862_submitter_file2__DSC00086.JPG","/var/www/straped/mufon/more/18862_submitter_file3__DSC00142.JPG","/var/www/straped/mufon/org/18862.html"],"Weather Factors":"None","divs":["Sighting DetailsI received a email from my realtor on a 2.5 acre property that I could get really cheap as in 120,000.00 on a owner contract. I went to see the property outside Yelm Wa. near McKenna's border. The first shot I took caught me off guard as it looked like a brief look at a leif or bird flying by. When I looked up I only saw sky but the camera saw it. The camera is new andI bought it from Fred Meyer a week before- Sony Digital. Thinking that was just a bird or leif I went into the Mobil that was trashed out and the camera shot even more things. That afternoon I took friends over to the place after showing them the pictures and shot pictures of a bunch of funny round bubble lights that only showed on the camera. Our hair on our arms stood on end like static electricity. Then to make sure that I didnt have a broken camera, I took shots at home and at the neighbors. The neighbor is a Thrston County Sherrif who said he too had those bubbles show up on his camera when he checked into buying the same place. Needless to say I am not buying that place as too many friends as well as myself were creeped out by all this. If it was a UFO why dont they just make themselves known instead of being so secretive? You would think that with all that technology they would feel a bit safer but No, They just zip in and out. Wierd Huh?"],"Longitude":"-122.550952","Region":"Washington","Viewing Distance":"20 Feet or Less, Unknown","Country":"United States","Latitude":"46.940201","map":"<A HREF = \"http://maps.google.com/maps?q=46.940201,+-122.550952(18862)&iwloc=A&hl=en\"> mufon case (18862) map </A>","Date of the Event":"08/17/2009 08:28 UTC","Source":"MUFON","Tags":"City","Log Number":"US-08252009-0002","City":"Yelm, McKenna","Summary":"Looking at a piece of property and my digital camera caught it in the sky.","Sighting Duration":"Undisclosed"}