{"Summary":"Light orb like which seemed to give off smaller light orbs.","trends":["There have been 67 other sightings in Louisville","There were no other sightings in Louisville on or around August 25th 2009"],"City":"Louisville","Object Features":"Other, Unknown","Date Submitted":"08/25/2009 12:00 UTC","Latitude":"38.259645","Log Number":"US-08252009-0017","Object Shape":"Sphere, Star-like, Other, Unknown","Case Number":"18877","Longitude":"-85.749306","Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.259645,+-85.749306(18877)&iwloc=A&hl=en\"> mufon case (18877) map </A>","Source":"MUFON","Object Flight Path":"Stationary,Other","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/18877.html.txt","/var/www/straped/mufon/org/18877.html"],"Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Disposition":"Unknown","Date of the Event":"08/25/2009 12:00 UTC","divs":["Sighting DetailsWhile working the late shift August 24th , 11 to 7 am I took a break to go outside after finishing the bulk of my work. I was smoking while looking up to the southeast sky I saw what I was sure was Venus. IT wasnt real bright but visible. I have been fooled by Venus before so I took time to note the behavior. It seemed like a faint light moving slightly. much like venus does seem to do .. I stood for a minute to look at exactly the location and the behavior. After about 2 minutes I noticed what seemed like smaller light balls or orbs being projected from the larger light. I was certain that it was my eyes playing tricks. I stood behind a support column to see if I could line up the object to actually see if it was moving but it didnt help much. This light seemed to gain in intensity then fade. IT did this a few times but It did seem to emit smaller lights and cast them in different locations. If Venus was in the southeast sky around 2 am early this morning I feel thats what it was , If not It could be something else..? I wasnt realy going to post this but I noticed the exact same discription of something seen from Loveland Ohio on Aug 24th. It seems almost exactly like what I had seen."]}