{"Region":"Connecticut","Viewing Distance":"101-500 Feet","City":"Guilford","Latitude":"41.288987","files":["/var/www/straped/mufon/html2text/18872.html.txt","/var/www/straped/mufon/org/18872.html"],"Summary":"Observed large triangular object with pulsating multi-colored lights hovering and departing at very high rate of speed.","Object Shape":"Triangle","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Log Number":"US-08092011-0026","trends":["There has been one other sighting in Guilford","There were no other sightings in Guilford on or around August 24th 2009"],"Date Submitted":"08/24/2009 10:50 UTC","Tags":"City","Case Number":"18872","Date of the Event":"08/24/2009 10:50 UTC","divs":["Sighting DetailsI am a private investigator. I was performing a surveillance when I turned onto a street and observed approximately 100 yards in front of, and approximately 500-750 feet above my vehicle, a large object hovering motionless in the sky. It was flat and triangular, with rounded corners and sides, and several lights that were yellowish-white, red, blue and green and which were pulsating in no particular pattern. I stopped immediately, grabbed my camcorder and exited my vehicle. As soon as I was out of my vehicle, the object darted away at a \"bullet-like\" speed, and in a southerly direction. As it darted away, all of its lights went out. Due to its immediate departure, I was unfortunately unable to obtain any video. The object was approximately the size of half a football field. Its surface appeared to be black or dark gray. It emmited no sounds whatsover. The sky was clear with no light pollution, and countless stars were visible. I remained at that location for approximately two additional hours, but did not see the object again. I am also a licensed pilot and I am familiar with the look of most aircraft. This object looked unlike any aircraft I know and was much larger than any aircraft I have ever seen."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=41.288987,+-72.681762(18872)&iwloc=A&hl=en\"> mufon case (18872) map </A>","Longitude":"-72.681762"}