{"Sighting Duration":"10:32:13","Case Number":"18884","Longitude":"-79.692715","Summary":"Murrysville: Close up shots of Triangular Craft w/multi-colored lights","map":"<A HREF = \"http://maps.google.com/maps?q=40.432222,+-79.692715(18884)&iwloc=A&hl=en\"> mufon case (18884) map </A>","Log Number":"US-08262009-0003","City":"Murrysville","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around July 16th 2009","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown","Disposition":"IFO","Object Features":"Undisclosed","divs":["sighting details10:32 pm -almost deleted this video. at the time it was taken, i had dismissed it as 'ours' because i heard a quiet engine noise. playing with newly found x150 zoom and trying to unstick tripod, i really didn't pay attention to what i was filming at the time. i can't see detail in the small lcd screen and usually wait to blow up footage to see what i have. went to make room on hard drive and glad i viewed it, however, before deleting. it is the same triangle ufo i filmed on august 4, 2009! you can see it coming, a side view and changing into a \"fake plane\" ufo complete with it's non-faa flash pattern (both wing tip white lights are to strobe, not one side only). also, although the light pattern is classic 'triangle' the shapes shown are not flat & a light pole is visible with holes in it's design. i do believe it is probable that recent report from colorado indicating a 'bubble nose' is this same craft. the video is in hd and too large to upload here. see it and others on my youtube channel name: seeingufospa http:\\\\www.youtube.com\\watch?v=mzos7lk8_dw the program i use for videos takes too much detail out of the stills, so here's some good shots for you here so others seeing these things have something to show people what they saw. p.s. your upload field should allow more than 3 so i can send more shots with varying views."],"Date Submitted":"07/16/2009 10:32 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","Region":"Pennsylvania","Object Shape":"Triangle","Latitude":"40.432222","Date of the Event":"07/16/2009 10:32 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/18884.html.txt","/var/www/straped/mufon/more/18884_submitter_file1__20090716223050_10BIGc.JPG","/var/www/straped/mufon/more/18884_submitter_file2__20090716223050_12BIGc.JPG","/var/www/straped/mufon/more/18884_submitter_file3__20090716223050_42c.JPG","/var/www/straped/mufon/org/18884.html"],"Country":"United States"}