{"Latitude":"41.915219","Date Submitted":"08/25/2009 09:00 UTC","Log Number":"US-08262009-0001","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.915219,+-71.671416(18882)&iwloc=A&hl=en\"> mufon case (18882) map </A>","City":"Glocester","Viewing Distance":"Unknown","Summary":"I spotted a gray rectangular domino like object with 5 spotlights on the front hovering above the trees on the side of the road.","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Case Number":"18882","Country":"United States","Tags":"City","Object Shape":"Square, Rectagular","Longitude":"-71.671416","files":["/var/www/straped/mufon/html2text/18882.html.txt","/var/www/straped/mufon/org/18882.html"],"Region":"Rhode Island","divs":["Sighting DetailsI was driving west on Route 44 towards my home and spotted what appeared to be 5 bright spotlights just over the trees approximately a quarter of a mile ahead. The area is residential and there are no street lights. I continued driving toward the lights, past the turnoff to my road, because I was curious as to what this could be. My first reaction was that these were huge spotlights on a post such as you might see in a football stadium. When I neared the lights I slowed the car to get a better view and realized the lights were on the front of a large rectangular grayish object that was hovering above the trees. I stopped my car and rolled down the window to get a better view. I estimate I was about 150 feet away. The object made no noise. There were several white lights on the side, no wings,approximately 50-75 feet in length. I was astounded to say the least. Several seconds after I stopped, the object sped away in a southeasterly direction and I noticed a red light on the back. It was gone in an instant. There was no other traffic on the road at the time and the sky was clear. I was scared to say the least, and am totally perplexed."],"Disposition":"IFO","trends":["There has been one other sighting in Glocester","There were no other sightings in Glocester on or around August 25th 2009"],"Object Flight Path":"Undisclosed","Date of the Event":"08/25/2009 09:00 UTC"}