{"Region":"Pennsylvania","Viewing Distance":"Unknown","Longitude":"-79.688125","City":"Murrysville","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.435942,+-79.688125(18889)&iwloc=A&hl=en\"> mufon case (18889) map </A>","Date Submitted":"08/03/2009 09:12 UTC","Latitude":"40.435942","Log Number":"US-08262009-0008","Tags":"City","Weather Factors":"Unknown","Summary":"Murrysville: \"Fake Plane\" UFOs regularly seen - one retrieved an Orb","files":["/var/www/straped/mufon/html2text/18889.html.txt","/var/www/straped/mufon/more/18889_submitter_file1__20090803223055_11c.JPG","/var/www/straped/mufon/more/18889_submitter_file2__20090803223055_13contrastc.JPG","/var/www/straped/mufon/more/18889_submitter_file3__20090803223055_Ed2c.JPG","/var/www/straped/mufon/org/18889.html"],"trends":["There have been 31 other sightings in Murrysville","There was one other sighting in Murrysville on or around August 3rd 2009","This sighting has never been favorited.",""],"Disposition":"IFO","Country":"United States","Object Shape":"Triangle","Date of the Event":"08/03/2009 09:12 UTC","Object Features":"Undisclosed","Sighting Duration":"00:30:00","divs":["sighting detailsthese are regularly occurring and always silent flying. usually only what appears to be rear of a small plane is seen. two white steady 'wing' type lights, red blinking one in the middle. only one side strobes. this is the clue that they aren't ours besides the silent part. as seen on my triangle ufo video shot on july 16, 2009, the triangle turns off all lights and turns into this \"fake plane\" ufo as i call it. it also shows the non-faa compliant flash pattern of only one side white light strobing. around here they are always flying a pretty low altitude (like a cessna would) and slow. they sometimes have other lights on them that usually don't stay on all the time too. the ones in this picture show a similar structure under the red light that is visible on close ups of the larger triangle ufos under the red light. not known if this is same craft or a smaller version. one picture shows hook-like appendage under the red light's holding structure that is level with the ground, not tilted as the white lights are. hd video i put together of multiple sightings of this kind and also showing it retrieving an orb (or probe?) is on my youtube channel name: seeingufospa http:\\\\www.youtube.com\\watch?v=hg6ykfn5px4 also the video shows footage from local guy who filmed where they are probably coming from (shot in my direction too)."],"Source":"MUFON","Case Number":"18889"}