{"Log Number":"US-08252009-0020","Sighting Duration":"Undisclosed","Date of the Event":"10/31/2004 12:00 UTC","Summary":"Boomerang-shaped object flying North to South","Date Submitted":"10/31/2004 12:00 UTC","divs":["Sighting DetailsIt was a clear fall night in November or December while I was stargazing on the outskirts of Pahrump at my house. I was sitting down in the middle of the backyard, looking in a south-southeasterly direction when I saw the craft out of the corner of my eye. It seemed to be a gray-ish boomerang that was thicker at the back curve and tapered thinner to the front. As it passed over I saw four blue jets that emmited no sound on the back. There were two of the jets on each side of the inside of the curve. As it moved further south at an altidue of maybe several thousand feet, flying slowly, the blue jets turned off in pairs. First the two outside jets and then the two inside jets, within 10-20 seconds of eachother. After that it became harder to watch it as it moved farther away and seemed to turn slightly east until fully disappearing. I didn't tell anyone about it until about a month later when I told one of my best-friends because I doubted anyone would believe me. He just chuckled and mocked my story a bit but didn't say anything else. I think the craft could have been a test plane from Area 51, as it was moving from that general direction."],"Object Features":"Other","Case Number":"18880","Longitude":"-115.982515","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/18880.html.txt","/var/www/straped/mufon/org/18880.html"],"City":"Pahrump","Tags":"City","Region":"Nevada","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Flight Path":"Path with directional change","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.213334,+-115.982515(18880)&iwloc=A&hl=en\"> mufon case (18880) map </A>","trends":["There have been 12 other sightings in Pahrump","There were no other sightings in Pahrump on or around October 31st 2004"],"Country":"United States","Object Shape":"Boomerang","Latitude":"36.213334"}