{"Latitude":"40.432822","Log Number":"US-08262009-0009","City":"Murrysville","Country":"United States","Date Submitted":"08/13/2009 10:30 UTC","trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around August 13th 2009","This sighting has never been favorited.",""],"Tags":"City","Source":"MUFON","Object Features":"Undisclosed","Region":"Pennsylvania","Sighting Duration":"00:03:00","Longitude":"-79.689475","files":["/var/www/straped/mufon/html2text/18890.html.txt","/var/www/straped/mufon/more/18890_submitter_file1__CrescentUFOfootage2_11.JPG","/var/www/straped/mufon/more/18890_submitter_file2__CrescentUFOfootage2_13.JPG","/var/www/straped/mufon/more/18890_submitter_file3__CrescentUFOfootage2_14.JPG","/var/www/straped/mufon/org/18890.html"],"Case Number":"18890","Disposition":"IFO","Summary":"Murrysville: CRESCENT shaped UFO caught on surveillance cam-cloaked","Date of the Event":"08/13/2009 10:30 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.432822,+-79.689475(18890)&iwloc=A&hl=en\"> mufon case (18890) map </A>","Object Shape":"Other","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","divs":["sighting detailsfilmed either night of meteor shower (12th) or the next night. unmounted clover hdc501 surveillance cam recording various places (where i aim it) recording in ep (low quality mode) for 6 hours to a dvd recorder. the cam was sitting on a ladder on my deck outside facing south. jupiter is visible in the shot on the left side. what it picked up that was not visible to the naked eye in darkness is what appears to be a crescent shaped ufo that suddenly appears in the right side of the screen. this would place it within the 500 foot circumference of the valley in front of my house. bugs, a bat and numerous other things seen flying too. then, something cloudlike swoops down from above and goes into it. it then vanishes, right on the spot. the shutter speed is not at 30 fps and so detail of that cloud isn't the best. reminds me, though, of the possible \"sky critter\" brown cloud in the august 17th chase video. i wonder if these 'clouds' contain the radioactive radon gas that is so high in my area and they gather them up for fuel or ??? i have a feeling that this one is the 'bottom' of this one also photographed in westmoreland county by guy on myspace.com http:\\\\viewmorepics.myspace.com\\index.cfm?fuseaction=viewimage&friendid=446757377&albumid=1184142&imageid=12423343#a=1184142&i=14991713 see the video of it on youtube, channel name: seeingufospa http:\\\\www.youtube.com\\watch?v=agczktm2lvs"]}