{"Weather Factors":"None","Viewing Distance":"21-100 Feet","Summary":"large Object came up quickly, stopped abruptly, then took off","Object Flight Path":"Path then hovering","Latitude":"29.820022","Source":"MUFON","Country":"United States","Date of the Event":"08/24/2009 10:30 UTC","Object Features":"Window(s)","Region":"Florida","City":"Port St Joe","Longitude":"-85.289972","Sighting Duration":"00:00:10","Case Number":"18896","files":["/var/www/straped/mufon/html2text/18896.html.txt","/var/www/straped/mufon/org/18896.html"],"Date Submitted":"08/24/2009 10:30 UTC","Tags":"City","Log Number":"US-08262009-0015","trends":["There have been 6 other sightings in Port St Joe","There were no other sightings in Port St Joe on or around August 24th 2009"],"Object Shape":"Square, Rectagular, Other","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=29.820022,+-85.289972(18896)&iwloc=A&hl=en\"> mufon case (18896) map </A>","divs":["sighting detailsthis report is being made by state section director, barbard delozier. witness has asked to remain anonymous. incident was reported to delozier by witness, who is personally known by delozier to be an upstanding citizen in the community and a very credible witness. witness described occurrence as follows: witness walks through his quiet neighborhood every night before retiring. sometimes, his wife walks with him. on monday, august 24, 2009, he was by himself. witness was walking near brake park in the highlandview section of port saint joe at approximately 10:30 pm. out of the corner of his eye, he 'thought' he saw a low flying plane approaching him from the south east. witness looked in the direction the object was coming from at a very high rate of speed and realized that it was not a plane at all. the object stopped abruptly about 75' away from him, and about 100' above the tops of the trees (approx. 150-200' in the air). object stayed there long enough for witness to get a good description of it before it took off in what he described as a 'nano-second ... just poof disappeared' in the same direction it was originally heading from southeast to northwest. he said that object was much larger than an aspirin held at arms length and was larger than a mini-van. witness desbribed the object to look 'like a mini-van without wheels' with three floor to ceiling windows. there were lights in the windows, the middle light\\window being the brightest. no sounds were heard, no beings were seen. he did not report lost time. no physical manifestations were visible on his face or arms, and he acknowledged that he did not see any bruises, blood spots or injuries to his body after the incident. witness also said that he was not bothered by loss of sleep or strange dreams, so far. witness reported that he has never, ever believed in ufos and has never, ever seen anything like this before. witness made a drawing of the object he saw, which is attached to this report."]}