{"Log Number":"US-08262009-0010","Source":"MUFON","Latitude":"40.432752","Tags":"City","Region":"Pennsylvania","Object Flight Path":"Undisclosed","Case Number":"18891","map":"<A HREF = \"http://maps.google.com/maps?q=40.432752,+-79.691485(18891)&iwloc=A&hl=en\"> mufon case (18891) map </A>","Viewing Distance":"Unknown","Date Submitted":"08/25/2009 03:52 UTC","Country":"United States","Summary":"Harmar(ville): 3 light Triangle over Oakmont Country Club","files":["/var/www/straped/mufon/html2text/18891.html.txt","/var/www/straped/mufon/more/18891_submitter_file1__20090825035255_1c.JPG","/var/www/straped/mufon/more/18891_submitter_file2__20090825035255_8c.JPG","/var/www/straped/mufon/more/18891_submitter_file3__20090825035255_16c.JPG","/var/www/straped/mufon/org/18891.html"],"trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around August 25th 2009","This sighting has never been favorited.",""],"Object Shape":"Triangle","Longitude":"-79.691485","Object Features":"Undisclosed","Disposition":"IFO","Sighting Duration":"00:04:00","divs":["sighting detailssame flight path as other sightings--coming from easterly direction from pa turnpike area 1\\4 mile away. flew over famous oakmont country club golf course as viewed from across the allegheny river 2000 feet away. multicolored flashing lights, flying too low for any plane, totally silent. skimming the tops and even flying behind the treeline. when over the golf course low, it turned on only 3 white lights to reveal that it is same triangle craft filmed in murrysville on july 16th and august 4th. after it came out of trees, it turned them off and put back on the \"fake plane\" lights, multiple colored and flashing to try and blend in as one of 'ours'. it crossed over the allegheny river just made it over the treeline on ridge on other side of river. here are some shots of before it did the triangle light thing with some weird structures, plus the nightshot view of it with the triangle light formation (note the center upper light appears to be 2 separate lights--this is seen in july 16th triangle ufo sighting also). i feel they are interested in our progress of the pa turnpike reconstruction and the building of a new \"cutting edge design\" bridge over the river. both this location and murrysville, pa is close to the pa turnpike. i just hope they observe the \"no fly zone\" over pittsburgh during the g-20 summit next month! could get ugly if they don't. the hd video of it flying can be seen on my youtube channel: seeingufospa http:\\\\www.youtube.com\\watch?v=jgsn29reqls"],"City":"Murrysville","Weather Factors":"Unknown","Date of the Event":"08/25/2009 03:52 UTC"}