{"Country":"Canada","files":["/var/www/straped/mufon/html2text/18902.html.txt","/var/www/straped/mufon/org/18902.html"],"Latitude":"48.485621","Viewing Distance":"501 Feet - 1 Mile","City":"Timmins","Object Flight Path":"Path then hovering","Disposition":"Unresolved","Region":"Ontario","Weather Factors":"None","divs":["Sighting DetailsSo I started out by jogging down Brousseau ave in Timmins Ontario. As I crossed the Mclean intersection heading west I happened to look up quickly. I thought I seen something shiny in the sky so I took a second glance. I stopped jogging to steady my vision. It seemed to be hovering from north to south. It was moving very slowly and did not make a sound. Although it was at least 1000 feet up and maybe a mile away. Usually even a plane will make that kind of noise, especially the small prop planes that leave our airport. The other thing that got me thinking that it wasnt a plane was the fact that it did not appear to be landing or taking off. It was very bright and shiny. I found it odd that when i took my sunglasses off I could hardly see it. It had more of a brightness with my sunglasses on. It was cigar shaped but oval at the same time. It did not change shape, it was just in between. I looked down to my cell phone to activate the camera in it. As soon as I went to point it to take the picture the object disappeared. Immediately after this I knew it wasnt a conventional aircraft. It was something else. I scanned the whole sky immediately after and it was no where to be seen. I have had a few odd sightings here in timmins but nothing odd enough to report. I hope you get more on this. Please email me if anyone else has reported anything in my area! Thanks Dave"],"Date Submitted":"08/26/2009 02:15 UTC","Object Features":"Unknown","Tags":"City","Longitude":"-81.324995","Case Number":"18902","Log Number":"CA-08262009-0021","trends":["There have been 5 other sightings in Timmins","There were no other sightings in Timmins on or around August 26th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.485621,+-81.324995(18902)&iwloc=A&hl=en\"> mufon case (18902) map </A>","Sighting Duration":"00:01:00","Summary":"Shiny silver object","Date of the Event":"08/26/2009 02:15 UTC","Source":"MUFON","Object Shape":"Cigar, Oval"}