{"Case Number":"18903","files":["/var/www/straped/mufon/html2text/18903.html.txt","/var/www/straped/mufon/org/18903.html"],"Date Submitted":"12/11/1997 12:00 UTC","Object Flight Path":"Other","Sighting Duration":"Undisclosed","City":"Bristol","Object Shape":"Triangle","Viewing Distance":"21-100 Feet","Object Features":"None","Source":"MUFON","Weather Factors":"Unknown","Log Number":"GB-08262009-0022","Date of the Event":"12/11/1997 12:00 UTC","Longitude":"-2.58381","Tags":"City","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=51.459213,+-2.58381(18903)&iwloc=A&hl=en\"> mufon case (18903) map </A>","Summary":"Black triangles rotating in the sky then forming shapes","Country":"United Kingdom","trends":["There have been 11 other sightings in Bristol","There were no other sightings in Bristol on or around December 11th 1997"],"Latitude":"51.459213","divs":["Sighting DetailsI was living in Bristol UK at the time and working on the construction of a new gas turbine power station. I arrived home around 6pm from work, I had brought a powerful torch previously that week and decided to go into the back garden to test it out. I was with my stepson at the time who was about 7 years old, anyway I was using the torch all over the garden and then started reflecting the light beam off the scattered clouds (It was a very clear night with broken clouds) I was making patterns in the sky like number shapes circles, squares and triangles etc.. Then my stepson said 'Whats that there'? He was pointing at a cloud directly above us and then what looked like a hole forming in the middle of this cloud. We were both fascinated by what we saw next, it was a black triangle shape that was slowly rotating in an anticlockwise direction, I would estimate the height around 1000-1500 feet. I flashed the torch at this object a few times end then, I can only describe what happened like this.. Imagine a stack of casino chips and you where looking at them from underneath, maybe you can only see one right? Well at first we thought that there was only one of theses objects but then others began pealing off from above this object all of the same shape and size from our perspective. (there were about +50 in my estimation) These objects then incredibly, shot across the sky in our complete view and made the shape of the number 7 but with the strike in it, they then made a square shape and others. There was no light from theses objects but they were distinct in shape and colour-black, a black that stood out from the night sky. Whilst we were watching this amazing sight I noticed that all the wind chimes in neighbouring gardens were sounding quite loudly and dogs started barking. The next thing that happened i had an urge to look to my right, above me I estimate 100-150 feet one of these objects was just rotating there completely silent. (it was massive! aprox the size of a 747x2) I must admit that when I saw this and my stepson also saw it I was afraid I can't describe the exact feeling except I think it was the fear of the unknown! We both at that point ran inside the house and locked the door. About 10 minutes later I went back outside and there was no sign of these mysterious triangular objects, I was glad but also sad at the same time if that makes sence because I really wanted to know what they were. After that incident I only told my parents and close family, but even they thought I must have had one to many! I tell you no lie this happened and I can even draw the whole thing as from start to finish it is that clear in my mind even after all this time. I never reported the objects because as I'm sure you are well aware of the stigma attached to such reporting of these sightings but, I am so pleased to be able to report to you and maybe this information will be useful in some way to others studying this phenomenon. I just have to say that I have no reason to lie or exaggerate what I saw that night, I seek no reward or fame, I also just want to know the truth about these Objects that are the skies above us."],"Region":"England"}