{"Country":"United States","Longitude":"-117.149055","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around August 24th 2009"],"City":"San Diego","Tags":"City","Viewing Distance":"Over One Mile","Object Features":"Unknown","Object Shape":"Cigar","map":"<A HREF = \"http://maps.google.com/maps?q=32.719829,+-117.149055(18901)&iwloc=A&hl=en\"> mufon case (18901) map </A>","Log Number":"US-08262009-0020","divs":["Sighting DetailsWatching air traffic from my yard looking south at 12:30 p.m, Wednesday, August 24, 2009. Location: La Mesa, CA. We live under the flight paths for Lindbergh Field in San Diego and always have commercial jets overhead. I'm familiar with the landing patterns for both Lindbergh and Tijuana International having lived in this location for twenty-five years. Observed what I thought was a white commercial jet moving southeast. Based on my judgment of international border location and distance and height of object, it was flying from U.S. into Mexico at a shallow angle. At first thought it was heading for Tijuana International but realized it was too high. It also wasn't in the usual landing pattern for Lindbergh Field in San Diego. As I kept watching, a bright flash enveloped the object for less than a second and then it was no longer there. Weather condition: blue sky, no clouds. I considered possibility of sun reflection on tail section, but that didn't explain disappearance. Also, sun angle (almost directly overhead) made sun reflection unlikely. I also considered the plane descending and turning, but it was moving in a straight line heading southeast when the flash happened."],"Date of the Event":"08/24/2009 12:30 UTC","Date Submitted":"08/24/2009 12:30 UTC","Latitude":"32.719829","Sighting Duration":"Undisclosed","Case Number":"18901","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Summary":"White fuselage traveling southeast disappeared in bright flash","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/18901.html.txt","/var/www/straped/mufon/org/18901.html"],"Region":"California","Source":"MUFON"}