{"files":["/var/www/straped/mufon/html2text/18907.html.txt","/var/www/straped/mufon/org/18907.html"],"Log Number":"US-08262009-0026","Longitude":"-92.332572","Weather Factors":"None","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around August 11th 2009"],"Object Flight Path":"Stationary","Source":"MUFON","City":"Columbia","Sighting Duration":"Undisclosed","Latitude":"38.953175","Country":"United States","Date of the Event":"08/11/2009 03:30 UTC","Tags":"City","divs":["Sighting DetailsAs I often do, I spent the evening playing video games between the hours of 12am and 4am. I am also a smoker, but I do not smoke inside my house. At approximately 3:30 am I stepped out on my back patio (which faces south) to smoke a cigarette. It is a ritual for me to locate the moon and Venus in the southern sky as soon as I step outside. When I lit my cigarette, there was nothing unusual to report. After about 3-4 minutes, I bent down to put out my cigarette. When I stood back up, something caused me to look up again. At this time, Venus was hanging low to the southwest. The moon was a little higher in the sky, and positioned east of Venus. Further east of the Moon, and directly south of my point of view and a little higher in the sky than the Moon were two brilliantly bright lights sitting one above the other. They were bright white (brighter than Venus) and appeared to be a great distance away (possibly in outside our atmosphere). For the time I observed them they were completely static in the sky. They did not move in relation to objects on the ground, the stars in the sky, or in relation to each other. They lights did not twinkle or change color or change in brightness. It was a clear night with no clouds as all other stars were visible. I watched the two objects for about two minutes. Then without moving, they faded from the sky in about 10-15 seconds. They faded away at the same rate at the same time. The fading can be described as if they moved behind progressively thickening clouds. However there were no clouds and other dimmer stars in the same area were still visible. The only logical explanation I can come up with is that the two objects were indeed above our atmosphere, and as I watched they passed into Earth's shadow, thereby disappearing. I stayed looking at the same spot in the sky for about ten minutes hoping the lights would reappear. They did not, and I have not seen anything remotely similar in the southern sky at anytime of night. As I viewed the objects I felt only intrigue and curiosity. After they disappeared I felt a great deal of uncertainty, but not fear. That is the extent of my story. If anybody else saw anything similar on 8-11-09, I would love to hear about it."],"Object Shape":"Star-like","Viewing Distance":"Unknown","Disposition":"IFO","Date Submitted":"08/11/2009 03:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.953175,+-92.332572(18907)&iwloc=A&hl=en\"> mufon case (18907) map </A>","Summary":"Two bright lights (brighter than Venus) that disappeared within a few minutes","Case Number":"18907","Region":"Missouri","Object Features":"None"}