{"Case Number":"18908","Longitude":"-123.325052","Viewing Distance":"Over One Mile","Summary":"Pulsating light in the north that circled and then moved east.","divs":["Sighting DetailsMy wife and I were sitting on the back porch while I had a cigar. I told her that I felt as if something was coming as I looked at the stars and satellites that flew by. I told her I felt it in the pit of my stomach. She then noticed a pulsating light in the north that seemed to circle over the city of Grants Pass. This light remained steady except for a bright pulsating light that emanated from it. No matter where it went it stayed constant and pulsing. After it circled in the north, it slowly went east and disappeared over the mountains. During this time, after we were deciding that this looked highly unsual and compared it to a couple jets flying overhead, we decided to get our little digital camera that can take movies. What I caught on camera was completely different than what we saw. At 7 secs & 34 secs white lights flash around the screen that we did not see at the time. We were also both stumped as to why we didnt see the pulsating light in the sky at the time on the camera. In the video there is a constant red light which is from a radio tower on the eastern mountains. We didnt get a closer shot of this thing because we wanted to make sure it was truly unusual before we got over-excited. There was no noise from this light either and it couldn't have been more than a mile or so away from us. I am still in a bit of shock as to my feelings that came just before we saw this thing and am a bit shaky. My dog even was attentive to it and had her ears perked straight up. I am including a pic of my dog, a movie, and a very grainy pic that I use on \"pic\" mode. On the picture there is a a white-yellow light matching what we saw at the bottom of the picture. The movie is different from the picture and I dont know why."],"Source":"MUFON","Object Flight Path":"Path with directional change,Path then hovering","City":"Grants Pass","Date Submitted":"08/26/2009 09:40 UTC","Region":"Oregon","files":["/var/www/straped/mufon/html2text/18908.html.txt","/var/www/straped/mufon/more/18908_submitter_file2__DSCF0165.JPG","/var/www/straped/mufon/more/18908_submitter_file3__DSCF0164.JPG","/var/www/straped/mufon/org/18908.html"],"Log Number":"US-08272009-0001","Object Features":"None","Disposition":"Unresolved","Date of the Event":"08/26/2009 09:40 UTC","Weather Factors":"None","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.442827,+-123.325052(18908)&iwloc=A&hl=en\"> mufon case (18908) map </A>","Latitude":"42.442827","Country":"United States","Tags":"City","Object Shape":"Circle, Flash","trends":["There have been 35 other sightings in Grants Pass","There were no other sightings in Grants Pass on or around August 26th 2009","This sighting has never been favorited.",""]}