{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.628462,+-90.194254(18904)&iwloc=A&hl=en\"> mufon case (18904) map </A>","trends":["There have been 74 other sightings in St Louis","There was one other sighting in St Louis on or around August 13th 2009"],"Date of the Event":"08/13/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/18904.html.txt","/var/www/straped/mufon/org/18904.html"],"Object Features":"Unknown","Disposition":"Hoax","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","divs":["Sighting DetailsMy dogs were stirring around 4 a.m. which ussally means they had to go out. I let the dogs out, not paying much attention to my surroundings. I then look out to the west. There's a tree line about 300 hundred yards from my home. I suddenly see a perfectly round amber colored object just hanging there, just slightly below the tree line. I would venture to say that it was the size of a small car. It wasn't small. It didn't move either, it just hung there. It quickly got my attention; trying to discern what it could be. I quickly ruled out the moon or a street lap since it was above the tree line. It was not a solid amber color. there were some darker shades along the edges. Of course, I kept telling myself, it was my imagination. But when I looked back up it was still there. It hung there for about 5-minutes, without moving. I turned around and let my dogs back inside. When I turned back around from inside the house, it gone. Last week I took some digital photos of the tree line from my house, with the intention of drawing the object. If you're interested in these, let me know and I will forward. I've been procrastinating."],"Longitude":"-90.194254","Region":"Missouri","Object Flight Path":"Stationary","Case Number":"18904","Weather Factors":"Unknown","Date Submitted":"08/13/2009 12:00 UTC","Sighting Duration":"Undisclosed","City":"St Louis","Log Number":"US-08262009-0023","Latitude":"38.628462","Country":"United States","Summary":"Round, amber colored object above a tree line. It was stationary","Object Shape":"Circle"}