{"Country":"United States","divs":["Sighting DetailsWe were almost afraid to report this since we just did yesterday another incidence. Thought you might think we were acouple of kooks. But like I said we saw 2 round star like shapes flying high up in the stars side by side coming from the southwest and turning towards the east. Thats when we noticed a 3rd one following behind about 10 feet behind kind of between then only behind them. They were moving fairly fast and we watched then for about 8 to 10 minutes untill we could'nt see them any more. But we did noticed the 3rd on sort of caught up with the other two before dissapearing towards the Casecade Mts. WE have nothing to gain from telling you this but wanted to let you know that we have seen acouple of others things happen over the months. If you want to know about those also we would gladley tell you. But we think it's awfully weird that these things have been happening around here. Why here? We are always outside in the middle of the night because we wake up early and can't go back to sleep so we just get up and go outside with a ciggarete and watch the stars. We feel very weird to have seen so many things in our area. That's why we really didn't want to report them but my husband said we should so maybe you could research the night sky that night and maybe have a logical explination. I don't know what else to tell you but we did see this."],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Case Number":"18911","Weather Factors":"Does Not Apply","Region":"Washington","trends":["There have been 8 other sightings in Burlington","There was one other sighting in Burlington on or around August 27th 2009"],"Disposition":"Unknown","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=48.477832,+-122.322288(18911)&iwloc=A&hl=en\"> mufon case (18911) map </A>","Date Submitted":"08/27/2009 03:40 UTC","files":["/var/www/straped/mufon/html2text/18911.html.txt","/var/www/straped/mufon/org/18911.html"],"Date of the Event":"08/27/2009 03:40 UTC","Source":"MUFON","Tags":"City","City":"Burlington","Summary":"saw 2 star like objects flying high side by side then noticed a 3rd one flying about 10 feet behind them but in the middle of them in the back Came from southwest and turned towards the east towards the casecade MTs.","Longitude":"-122.322288","Log Number":"US-08272009-0004","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Latitude":"48.477832"}