{"Sighting Duration":"Undisclosed","Region":"Washington","Object Features":"None","Date of the Event":"08/03/2009 12:00 UTC","Country":"United States","Log Number":"US-08272009-0005","Longitude":"-122.338918","Weather Factors":"Unknown","Date Submitted":"08/03/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=47.758343,+-122.338918(18912)&iwloc=A&hl=en\"> mufon case (18912) map </A>","files":["/var/www/straped/mufon/html2text/18912.html.txt","/var/www/straped/mufon/org/18912.html"],"Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsThe interesting thing about this for me - is that I was with someone else that I don't know very well at the time of this occurrence. They saw these starlike objects first and then pointed them out to me. This happened at about 8:30am looking west over the Olympic Mountains from the Shoreline area. It was a very clear day not a cloud in the sky, the sky was a light bright blue. I would estimate these star-like objects to be appox. 35,000 feet and literally skipping like stones skip on water, then they would change directions, loop around each other and then straighten out into what appeared to be a straight line but, slightly off-set from each other, there were 3 of them - at times the last one would skip ahead to the first position and then the second would skip ahead of position 1 and so on... it was like they were playing leap frog. Both myself and this other person just stood there and watched them for several minutes - sometimes we'd both lose site of them and then regain visuals on them - these objects were faster than our eyes could follow at times - almost appearing to blink off and then reappear several thousand feet away - but still moving in a grouping. They moved from North to South either above the Puget Sound or The Olympic Mountain range.. Eventually we both lost visual contact with the skipping star like objects- it was pretty amazing. I just read another Washington report of similar objects over the Cascades and wanted to share my experience. Sorry no photo and honestly would not have shown up anyway- too high, too fast"],"trends":["There have been 3 other sightings in Shoreline","There were no other sightings in Shoreline on or around August 3rd 2009"],"Object Flight Path":"Path with directional change","Latitude":"47.758343","Summary":"Skipping starlike objects","Object Shape":"Star-like","City":"Shoreline","Source":"MUFON","Case Number":"18912","Disposition":"IFO"}