{"map":"<A HREF = \"http://maps.google.com/maps?q=39.443427,+-84.195022(18919)&iwloc=A&hl=en\"> mufon case (18919) map </A>","Tags":"City","Weather Factors":"Unknown","City":"Lebanon","trends":["There have been 6 other sightings in Lebanon","There were no other sightings in Lebanon on or around August 27th 2009"],"Log Number":"US-08272009-0012","Case Number":"18919","Longitude":"-84.195022","Date Submitted":"08/27/2009 01:00 UTC","Object Features":"Unknown","Object Shape":"Circle, Fireball, Star-like","Disposition":"Insufficient Data","divs":["Sighting DetailsSometime after midnight on the 27th of August, 2009 I went outside on the patio to have a cigarette. I am not sure of the exact time, but I estimate that it was around 12:30 to 1:00 am. I noticed 2 red lights in the sky southeast of North Rt 48. Their brightness and size caught my attention. At first I thought it was an airplane, but I wondered why the fiery red lights on an aircraft. They appeared to be throwing off sparks; but much too large to be fireworks, and sort of \"hanging\" in the same location. No movement except flickering. The lights then separated somewhat, a larger one on top and the smaller one on bottom, and I realized this was not an airplane. The lower light then fizzled out and disappeared. In a second the larger light went out. There was no trail, no \"shooting star\" characteristics. This was only around 1-2 minutes at the most. I have seen \"shooting stars\" but this was nothing like that. They fizzled out without moving in any direction, just separated. I waited to see if this would reappear. I thought it may have gone behind a cloud or something, but that was it. I was baffled as to what I had seen."],"Country":"United States","Source":"MUFON","Object Flight Path":"Stationary","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Date of the Event":"08/27/2009 01:00 UTC","Summary":"Red Lights in Sky Near Lebanon, Ohio","Latitude":"39.443427","Region":"Ohio","files":["/var/www/straped/mufon/html2text/18919.html.txt","/var/www/straped/mufon/org/18919.html"]}