{"trends":["There have been 26 other sightings in Manchester","There were no other sightings in Manchester on or around October 31st 1973"],"Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None, Does Not Apply","Object Flight Path":"Stationary","Longitude":"-2.239796","City":"Manchester","map":"<A HREF = \"http://maps.google.com/maps?q=53.483341,+-2.239796(18923)&iwloc=A&hl=en\"> mufon case (18923) map </A>","Date Submitted":"10/31/1973 12:00 UTC","files":["/var/www/straped/mufon/html2text/18923.html.txt","/var/www/straped/mufon/org/18923.html"],"Object Shape":"Disc","Region":"England","Country":"United Kingdom","Date of the Event":"10/31/1973 12:00 UTC","Log Number":"GB-08282009-0004","divs":["Sighting DetailsI am writing this on behalf of my mum who i am going to get her to redo this report with sketches. My mum was about 10, it was her sisters birthday and everyone was inside when her brother and friend called them all outside (it was daytime). Everyone thought it was just some cool car or something so they went outside and saw 7 black disk shape objects 3 on each side and one in the middle and they were a bit higher than tree hight and had lights around them. My mum said they were like the ufos you see in the movies. Everyone was silent and was watching these things in shock. It happened for a fare few minutes, people were stopping their cars and getting out of their cars and my mum said about 40 people were watching these things. My mums sister called the air control place to ask if they had a air show on or something but they said no. While they were watching it the middle disk let out a lightish blue colour beam close to a old swim bath place for a few moments before disappearing. Thanks, and i will get my mum to do a report and sketck herself."],"Object Features":"Unknown","Summary":"7 disk shaped ufos , one lets out blue beam.","Source":"MUFON","Case Number":"18923","Latitude":"53.483341","Viewing Distance":"Unknown","Disposition":"Insufficient Data"}