{"trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around August 27th 2009"],"Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=32.719989,+-117.156155(18920)&iwloc=A&hl=en\"> mufon case (18920) map </A>","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"None","Date Submitted":"08/27/2009 07:40 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18920.html.txt","/var/www/straped/mufon/org/18920.html"],"Latitude":"32.719989","Case Number":"18920","Longitude":"-117.156155","City":"San Diego","Log Number":"US-08282009-0001","Summary":"Star-like objects (2) between 1940 and 1955hrs","Source":"MUFON","Object Shape":"Star-like","Date of the Event":"08/27/2009 07:40 UTC","Tags":"City","Country":"United States","divs":["sighting detailsjust before 1940hrs i went outside my condo to see if our hottest day of the year had started to cool. in the same location as i reported a sighting on 7\\15\\09 i spotted what i thought was a satellite traveling from se to nw high in the evening sky. it was still light enough that i could not see any stars at that time. as i watched it slowly move, it suddenly turned to the west and increased acceleration until it disappeared. i continued looking at the sky and within the next five minutes two f-18s from miramar flew overhead about 30 - 45 seconds apart at an estimated altitude of 1.0 to 1.5k feet heading out to the east desert training area. very loud! i continued to sky-watch and about 5 minutes later i spotted a similar satellite object flying from e to w at a very slow speed. after it moved about three fists at arms length distance, the object hovered and then moved in an irregular circle for at least a minute. it suddenly disappeared and i did not see it again. it's a question if this was the same object being seen twice or two different objects. no way to tell."],"Object Features":"Unknown","Object Flight Path":"Path with directional change,Path then hovering"}