{"Latitude":"39.433715","Object Features":"None","Tags":"City","Longitude":"-86.418728","Date Submitted":"06/30/1990 12:00 UTC","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/18931.html.txt","/var/www/straped/mufon/org/18931.html"],"Disposition":"Insufficient Data","Log Number":"US-08282009-0012","Case Number":"18931","City":"Martinsville","trends":["There have been 7 other sightings in Martinsville","There were no other sightings in Martinsville on or around June 30th 1990"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.433715,+-86.418728(18931)&iwloc=A&hl=en\"> mufon case (18931) map </A>","divs":["sighting detailsmy parents lived on one of the flight paths between wright patterson afb and scott afb. we were accustomed to seeing jets\\carriers\\helicopters of all sorts flying over. always west to east or, east to west. one day me and my mom were outside and an a-10 flew over heading due south. then seconds later, 3 fighter jets in a trigangle formation chased after it. we thought nothing of it at the time and assumed it was training. that night everyone happened to be outside and a large, silent object flew over, very low, north to south. it had no lights, no sound. the only way we knew it was there was becasue it went under the stars and blocked them out. it covered the aproximatly 5 miles of skyline we could see in about 3-4 seconds of time. as soon as it was out of our view, 3 jets (again in a triangle formation) chased after it. once they were out of sight nothing else happend. the instant it happened, me and my mother looked at each other in surprise, because we had see almost the exact same thing earlier that day, but with an a-10 in the front."],"Region":"Indiana","Summary":"Dark, silent, fast object being chased by 3 jets.","Date of the Event":"06/30/1990 12:00 UTC","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Object Shape":"Unknown"}