{"Source":"MUFON","Longitude":"-88.686754","map":"<A HREF = \"http://maps.google.com/maps?q=41.988917,+-88.686754(18938)&iwloc=A&hl=en\"> mufon case (18938) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unknown","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Summary":"orange ovalish thing going east to west at a norming rate of speed","Date of the Event":"07/04/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/18938.html.txt","/var/www/straped/mufon/org/18938.html"],"Object Shape":"Fireball, Oval","Case Number":"18938","Object Flight Path":"Undisclosed","Date Submitted":"07/04/2009 12:00 UTC","divs":["Sighting Detailsmy friend george was out behind the house as we were listening to the idiots blowing off fireworks when he came back in and asked if i saw the ufo. i was like what? so i went out to the front of the house and saw an orange ballish object going through the sky from the east heading west. i told george to grab my recorder and i shot as much of it as i could in a short period of time. it appeared to be somewhat round but yet somewhat oval or fireish. it traveled at a basic normal speed and did not appear to be to high in the sky, not more than a plane might be but did not have any flashing lights but did appear to be fluctuating to a point. it was deffinetly not a plane or jet, as ohare airport is the pattern it was coming from i questioned myself but knew it could not be a plane unless it was on fire. i watch a lot at night as they fly over daily or nightly as it were. the film i have just shows a white light in the night sky as it disappeared into the clouds. i am sure that enhansment would bring out the true color as we observerd that night. i resently called our county sheriff to see if there were any reports that night but only the usual illegal fireworks going on. the only thing i have is the shots i took and george as seeing them as well. but trust me, i gre w up in indiana as a kid and i can say, this isn't the first for me. i cant send photos as it is an old recorder that apparently itsn't compatable to my pc. but if i can figure out how to do i will or u may pick up thr tape. i have other things on it so i don't want to lose those. the object we saw we observed for at least a 20 mile span or more or about.as the sky miles go anyway."],"trends":["There have been 2 other sightings in Sycamore","There were no other sightings in Sycamore on or around July 4th 2009"],"Region":"Illinois","Latitude":"41.988917","Object Features":"Undisclosed","Log Number":"US-08292009-0002","City":"Sycamore"}