{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.737392,+-104.82869(18936)&iwloc=A&hl=en\"> mufon case (18936) map </A>","Latitude":"39.737392","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"08/28/2009 06:45 UTC","City":"Aurora","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/18936.html.txt","/var/www/straped/mufon/org/18936.html"],"Longitude":"-104.82869","divs":["Sighting DetailsEarlier this evening, I went out to the back deck around 6:35pm to start the BBQ and took my binoculars with me to pass the time while cooking. I was just going to look at the moon. It was still fairly light out so I started to scan the sky and within a few minutes I spotted a good sized white sphere or orb in the southwestern sky looking towards the mountains. It was not moving very much but was rather luminous and bright white as if lit from within. I told my husband about it and he said it could be a weather balloon. I have never seen a weather balloon but I thought they were usually grey or silver in color. I watched the object for at least 6 to 8 minutes as some light clouds passed in front of it but I managed to keep sight of it. It was large enough that I could see it even without the aid of the binoculars. It continued to move slowly towards the west and mountains staying bright white. After about 10-12 minutes another group of clouds began to pass in front of it but I could still see it and then suddenly it just disappeared! In thin air it just disappeared. If it was a balloon of some type - could it have just popped? About 30 seconds later a commercial jet came from the east flying towards the west. I continued to watch the sky for at least another 10 minutes but I never saw it again."],"Case Number":"18936","Summary":"Large white sphere luminous","Date Submitted":"08/28/2009 06:45 UTC","Source":"MUFON","Country":"United States","Sighting Duration":"00:15:00","Region":"Colorado","Object Features":"None","Weather Factors":"None","trends":["There have been 48 other sightings in Aurora","There were no other sightings in Aurora on or around August 28th 2009"],"Object Shape":"Sphere","Log Number":"US-08282009-0017","Object Flight Path":"Stationary,Straight-line path"}