{"divs":["Sighting DetailsI was on vacation with a friend. We spent the day in the Florida Keys and while driving back to Miami, somewhere in the middle of the everglades, we spotted ahead of us and off to the side of the highway a beam of sparkles (or 'glitter', as I just saw a lady on the Discovery channel describe it as). I have always recounted this event as calling them sparkles, as if they were sparklers from those stick sparklers that you lite and hold in your hand, or sometimes I have seen them in a birthday cake. We saw this on the right side of the highway, approx. 100 yards from the highway. We had no idea at all what it is we were looking at, apart from it being sparkly things slowly falling from the sky in a similar fashion as snowflakes might fall from the clouds. We immediately pulled the car over and got out and watched. There were 2-3 other cars that also pulled over and had got out to watch. There was no sound at all coming from whatever was up above. There was nothing visible at all that would indicate where the beam of sparkles was emminating from, ie: a ufo craft of any sort. I estimate the beam of sparkles to be about 75-100 yards high. Everyone that had pulled over and was standing beside there vehicles were all saying to each other, \"what the heck IS that??\" The sparkles seemed to almost be in a structured cylindrical 'beam' which I would guess to be about 15 feet in circumference. At first the beam was stationary, maybe for a minute or two, then it slowly started to drift towards the highway and behind our vehicle. It drifted for about 30 seconds with a full beam of sparkles still falling, at which point it crossed the highway. At one point the stream of sparkles seemed to be disrupted, as if the beam was momentarily broken, but within a few seconds it continued as a full beam again. We stood and watched it as it continued to slowly drift further away, pausing briefly once or twice, until either the beam vanished completely or had gone out of eye sight. The entire event took place over a period of 4- 5 minutes. We stood there dumbfounded asking everyone what that was! Soon after we got back in our car and continued on to Miami, all the while in amazement as to what we just witnessed and quizzing each other as to what it was we just saw. The striking thing besides the sparkles was that there was no sound at all, none! Once back at our hotel, we questioned each other about whether that was something we should report to someone. Ultimately we did not report it. I have told this story many times to people over the years, and am totally convinced that what we saw was something not of this world. After watching the Discovery program on tv tonight and hearing the lady on the show talk about the 'glitter' falling down and onto the tree in her backyard (then rising back up again), I knew she and I had witnessed the very same thing, (with the exception being that what I saw never rose back up into the sky)."],"Latitude":"25.790919","Date Submitted":"03/31/1986 12:00 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/18939.html.txt","/var/www/straped/mufon/org/18939.html"],"Object Flight Path":"Undisclosed","Summary":"Driving from Florida Keys to Miami, spotted sparkles falling from the sky","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Unknown","Source":"MUFON","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around March 31st 1986"],"Sighting Duration":"Undisclosed","City":"Miami","Date of the Event":"03/31/1986 12:00 UTC","Region":"Florida","Disposition":"Unknown","Longitude":"-80.216869","Case Number":"18939","Log Number":"US-08292009-0003","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=25.790919,+-80.216869(18939)&iwloc=A&hl=en\"> mufon case (18939) map </A>"}