{"Region":"Alabama","City":"Belle Mina","trends":["There have been no other sightings in Belle Mina","This sighting has never been favorited."],"Log Number":"US-08292009-0013","divs":["sighting details my wife and i were just leaving a friends house at about 5am app. 1 mile north of the small town of bell mina in limestone co. alabama as we were driving down a long field road,(my friend lives next to a cotton field) i noticed the object hovering above a perpendicular road which we were about to turn on about a quarter of a mile away. as we approached the object, i noticed it was traveling at about the speed of a human walking. by the time we reached the road it seemed to be traveling beside, it had already traveled along that road to the next road we were to turn on. at that intersection we had a fairly clear view of what seemed to be a shiny cylinder rotating slowly as it hovered some 75 to 100 feet off the ground. it was traveling from west to east from bell mina to greenbrier. two small towns just north of decatur,al, and just west of madison\\huntsville,al. the cylinder was shiny like chrome with what appeared to be some flat black squares on it. from that intersection, my wife insisted that we take the right to go home instead of following it because it was \"freaking her out\". i never thought i would have this kind of emotion about a ufo if i ever saw one, but i felt uncomfortable too so i didn't argue with her. she was driving so i turned around in my seat and continued watching it until it was out of my sight. it seemed to continue down that road at the same speed and direction."],"Case Number":"18949","Object Shape":"Cylinder","Viewing Distance":"21-100 Feet","Object Flight Path":"Straight-line path","Latitude":"34.656758","Disposition":"Unknown","Date Submitted":"08/29/2009 08:15 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18949.html.txt","/var/www/straped/mufon/org/18949.html"],"Weather Factors":"Unknown","Summary":"I spotted something hovering at about 100 feet heading from west to east along a country road just north of Belle Mina.","Date of the Event":"Unknown","Longitude":"-86.879171","Source":"MUFON","Country":"United States","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=34.656758,+-86.879171(18949)&iwloc=A&hl=en\"> mufon case (18949) map </A>","Tags":"City"}