{"trends":["There have been no other sightings in binghampton N.Y.","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/18945.html.txt","/var/www/straped/mufon/org/18945.html"],"Object Flight Path":"Hovering then path","Date Submitted":"08/15/1993 12:00 UTC","Object Features":"Unknown","divs":["Sighting DetailsStood on porch around 9:30 or so , saw a brite light low in the eastern sky. Light was not moving, just sitting there. 15 minutes went by and my wife came out and stood next to me. I said , do you see that light? she said yes. Then i asked , is it moving ? she said no . So now i confirmed that what i was seeing was what i was seeing. I said, ok! A few minutes went by and it started moving in our direction. I asked again, is that moving to you? She said, yes! We just stood there infatuated and captivated at what ever it was , and coming in our direction ,very very slow! As it got closer all i could think of , what is that!!!! I could not put it in any catagory.It seemed my mind was stuck on , what is that . Thats all i could think of. Now it is real close and we both started walking toward the back of our house slowly all while this thing floated slowly closer and closer toward us. I kept saying over and over to my wife , what is that? When it got almost above our heads we could not see a shape , all we could see is a bright light infront and a couple of re lights around the bottom and back. None were blinking and it had to of matched the sky , cause we could not see a shape at all. And all this 30 feet above our heads. Also the craft ,what ever it was made no noise AT ALL ! Then as it got maybe 10feet passed us as we were looking at it, all of a sudden we were looking at eachother in the same spot but the thing had disapeared . It was like something was missing. We walked back into the house slowly and just kept asking what was that? And her saying I don't know to my questioning of what was that. The best way i can describe it , it was like i was in a dream , but not , and totally DISMAYED!!! Very BLASE' , We came in the house sat down and started watching tv. and clouded asked every once in awhile , what was that? The more i always thought about it the more strange it gets. It actually had the power to go that slow with no sound and did something to us to make us not know what happened. Because we, my wife and i, can not finish the story. We can not finish the story of then it kept going and took off in so and so direction or anything. We just can't finish the story. I always kid saying i would like to know if it came in the house and raided our fridge or maybe messed with the kids or us., WE JUST DON'T KNOW!"],"Date of the Event":"08/15/1993 12:00 UTC","Source":"MUFON","Tags":"City","Case Number":"18945","Sighting Duration":"Undisclosed","Weather Factors":"Medium","Region":"Pennsylvania","Summary":"came out of the east very low , 30 feet over our heads and very slow with NO sound, just floated. can't finish story. Next we were looking at eachother and walked in house.","map":"<A HREF = \"http://maps.google.com/maps?q=42.235302,+-75.992765(18945)&iwloc=A&hl=en\"> mufon case (18945) map </A>","Longitude":"-75.992765","Viewing Distance":"20 Feet or Less, 21-100 Feet","City":"binghampton N.Y.","Latitude":"42.235302","Object Shape":"Unknown","Country":"United States","Log Number":"US-08292009-0009","Disposition":"Insufficient Data"}