{"Log Number":"US-08292009-0011","Region":"Arkansas","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.272849,+-94.4826(18947)&iwloc=A&hl=en\"> mufon case (18947) map </A>","Latitude":"36.272849","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18947.html.txt","/var/www/straped/mufon/org/18947.html"],"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","divs":["Sighting Details I was going to the store just a few mins from my house. I drove down my street headed south. When reached the stop sign i noticed a red light I thought it was a plane or sumthing. I turned left still keeping my eye on it cuz i figured a plane would have flashing light so it was different looking. I couldnt tell the distance until it moved. I drove a lil futher maybe 150 yards looking back at it. Then i realized it was over the baseball field about 60 yards from the stop sign i was at. I stoped my car right away and got out. It was still hovering over the B-ball field. I listened closly I was wondering if it was a small helicopter... It made no sound at all. The light pulsed with with no certain rythem. it also would go out completly then turn back on. I watched it hover very slowly to the left & then it started in my direction but never got closer than 100 yards maybe a little less. I could not see a shape just light. It made circular movements going back & forth. from left to right slowly. I call my mom who works for the police dept. She called a officer on duty. I drove to the high school which is by my house to get closer to the object. as I enter the parking lot it went south farther away from me. about the same distance from me sitting on the road. I knew at this point it was awear of my presence & interest. I decided to see if it was for sure so I started driving my car back & forth through the parking lot. This light followed my every move. I would stop quickly & it stoped on a dime. I would set for a second then reverse quickly then stop. It was moving exactly as I was. it would hover in one spot when I was setting still. The officer came to the school & seen it himself. hes said it was a helicopter in stealth mode. But he & I drove towards it he took the big light on his car shining it at the object driving towards it. It was keeping distance from us. when he left being a bit sceptical he said \"I dont know what it is\". I stayed for a bit longer then decided to go to the store. as I drove away from the school it followed me followed me bout quarter mile. I made my way back towards my house when I turned onto pioneer lane towards the school. I could see it still over the school. I went back to the school & continued seeing if it would copy me & it did. I was interested in see more of it. I drove to the back on the parking lot where it was really dark nothing around. I turned my car off. At this time it was about 80 yards or so south of me & about 100ft of the ground hovering in one spot. There was no sound at all, it changed it light to a soft white,yellow color not super bright. about the same strenght as the red i would say. I got out of my car turning my engine if & lights. I walked about 30 feet from my car towards it & didnt move. I was scared to go any closer. I stayed back there staring at it for another 10 mins i think. it went slowly south after that. Ive seen it one more time about a month ago. Also my mother & I seen a day time UFO here about a month ago. She got a very good look at it. she called me & said look in her direction she was east of me about half mile. she desrcibed is as a boomer-rang making a loud humming sound. I looked I heard the loud humming sound it was very loud. I seen a very very flat object & it looking like it had a configuration of poles on top if it. It was strange & my mother still cant figure it out. I consider myself very rational person & my mother is also. Im a facts kinda person I saying without a dout this is what happen. I would like too know if someone could help determine what it was. I stay curious about it & ivve been keeping my eye towards the sky. I could dscribe in better detail i think over the phone."],"Object Shape":"Unknown","Date of the Event":"06/20/2009 01:20 UTC","Disposition":"Insufficient Data","Case Number":"18947","Date Submitted":"06/20/2009 01:20 UTC","Object Features":"Undisclosed","City":"Gentry","Longitude":"-94.4826","Summary":"Red pulsing light about 100ft off the ground no sound.","Source":"MUFON","trends":["There have been 2 other sightings in Gentry","There were no other sightings in Gentry on or around June 20th 2009"]}