{"divs":["sighting detailson 8\\28\\09 and 8\\29\\09 myself and my wife saw a glowing orange ball of light almost like fire because it was emitting sparks a little bit ..now keep in mind we live next to an airport and are use to seeing air planes..also i was a deputy for 5 years and my wife was a jailer so we are used to reporting things in detail..the light moved from the southwest to the north east. last night it was exactly 55 minutes after the space shuttle went off.. it emitted a steady amber glow and sometimes would get real bright and spark like fire is the best way i can describe it..is it possible we are seeing something else like a satellite or space station? both times there was no noise at all and it kept a steady pace and then just would vanish completely..there were also a few others on the same street of mine that was watching this object in wonder.. the first night we tried to catch it on camera but of course the batteries were dead. we will try to be ready to capture it again if we can..we walk our k-9 dog at night alot so its possible we will see it again..we are both skeptics as to what this thing is.."],"Tags":"City","Object Features":"Unknown","Object Flight Path":"Straight-line path","Object Shape":"Circle, Star-like","Source":"MUFON","Case Number":"18957","Summary":"orange or looked like it was fire burning","trends":["There have been 14 other sightings in Vero Beach","There were no other sightings in Vero Beach on or around August 29th 2009"],"Latitude":"27.644343","Date Submitted":"08/29/2009 11:05 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/18957.html.txt","/var/www/straped/mufon/org/18957.html"],"Region":"Florida","City":"Vero Beach","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.644343,+-80.395574(18957)&iwloc=A&hl=en\"> mufon case (18957) map </A>","Country":"United States","Date of the Event":"08/29/2009 11:05 UTC","Viewing Distance":"Over One Mile","Log Number":"US-08292009-0021","Weather Factors":"None","Longitude":"-80.395574"}