{"City":"Edmonton","Object Flight Path":"Undisclosed","Date Submitted":"01/10/2009 06:10 UTC","Summary":"Two Star-like object in the night sky","Disposition":"Unresolved","Log Number":"CA-08292009-0018","divs":["sighting detailsi was standing on the patio smoking a pipe. i enjoyed the unusual mild night, lit with a few stars. i was facing south\\southeast. venus was to the right (high in sw) and the full moon was just climbing high in the ne. then, out of nowhere, i saw two star-like shapes appear, as if someone would turn on two lights using a dimmer switch. they both had the same magnitude in brightness, but not quite as bright as venus, i'd say. at first i thought i'm seeing satellites, but those objects did not move at all - just sitting there like stars. just then i got my wife to witness this event and she too thought this was awesome (it did look really pretty as it looked like two stars underneath each other in close proximity). both those objects seemed to have the same strength in brightness. the event didn't last longer than a minute and a half, two max. we watched them slowly fade away, just like they first appeared: slowly being dimmed down until they blended in with the darkness. and i haven't seen them since. to give you a bit of an orientation: the constellation orion was low in the east, one could clearly see the 'belt'. if you stretch your arm to full length, make a fist and 'line it up' with the belt of orion - approximately two adult fists to the right, this was where these objects were. i also saw a plane fly passed these objects, slightly underneath from my point of view ... so, i'm almost certain the pilots must have seen them too. so, no satellite, no stars, no planets, it didn't move, nor did it blink or radiate - just two plain, bright white objects. they slowly faded in, hung there for not quite two minutes and then slowly faded out again. what could that have been?"],"Source":"MUFON","Latitude":"53.551124","files":["/var/www/straped/mufon/html2text/18954.html.txt","/var/www/straped/mufon/org/18954.html"],"Object Features":"Undisclosed","Longitude":"-113.482392","Case Number":"18954","Region":"Alberta","Object Shape":"Star-like","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around January 10th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=53.551124,+-113.482392(18954)&iwloc=A&hl=en\"> mufon case (18954) map </A>","Date of the Event":"01/10/2009 06:10 UTC","Weather Factors":"Unknown","Country":"Canada","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown"}