{"Weather Factors":"None","City":"West Hartford","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"18951","Log Number":"US-08292009-0015","map":"<A HREF = \"http://maps.google.com/maps?q=41.764074,+-72.737545(18951)&iwloc=A&hl=en\"> mufon case (18951) map </A>","Region":"Connecticut","Object Shape":"Flash, Other, Unknown","Object Flight Path":"Undisclosed","Date of the Event":"08/29/2009 08:15 UTC","Longitude":"-72.737545","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsDriving down Mountain Rd towards Simsbury, all area lights went out - each street light went out one after the other, extremely dim then completely out. The traffic light went out and any homes we could see did not seem to have any lights. The power outage startled us slightly but we drove with caution approaching the traffic light. As we turned left onto route 185, there was suddenly a brilliant horizontal blue light across the sky as far as we could see. Though the area has many trees, the blue light was a shade like we've never seen in the sky and it seemed to span well beyond the trees, like the entire sky had changed. The center was the brightest and deepest shade of blue and the further from the center the shade seemed to lighten but was just as bright. The light remained brilliant in the sky for just a few seconds. Within a few short seconds of the light disappearing, all of the area lights came back on. A few seconds after that, the sky lit up again of a strobe effect that was bright white but with many colors flashing inside it - mostly reds and blues but also green. That lasted maybe 10 seconds and as soon as it abruptly stopped the lights all went back out again. We speculated the possibility of weather activity or even the rare event in our area of the aurora borealis. We pulled down a side street to pull over and watch the sky. There were no sounds or noises, it had been raining that day and night so no fireworks events would be scheduled. The activity seemed to be over with so we continued on our path of travel. We were stopped for maybe 1-2 minutes. As we came back to the main road, all the lights and traffic lights were working again. As we continued to travel home, we noticed that there appeared to be an interesting horizon to the east. This was approx 8:15-8:30 and after the rain the sky had been pitch black. The moon was barely visible through the clouds so the bright horizon was definitely unusual. Sometimes it seemed to be just like a sunset and other times it was just very bright and white-ish. The forecast had predicted thunderstorms but the steady beam of light was not lightening or anything like we've ever seen before. After returning home, we tried to research any similar reporting or activity. In doing so, we found a handful of very similar reports in NY and a few other states too over the last 9 months or so. It was unlike anything either one of us have ever seen or experienced."],"Summary":"Horizontal Blue Light and many colored flashes","trends":["There have been 4 other sightings in West Hartford","There were no other sightings in West Hartford on or around August 29th 2009"],"files":["/var/www/straped/mufon/html2text/18951.html.txt","/var/www/straped/mufon/org/18951.html"],"Source":"MUFON","Date Submitted":"08/29/2009 08:15 UTC","Disposition":"IFO","Latitude":"41.764074"}