{"divs":["Sighting DetailsDate of Sighting: May 24, 2009 Time of Sighting: 3:15 PM PDT Location of Sighting: On I-82 Highway Near Yakima, Washington NOTE: I did not know the accurate duration of sighting because I did not even see the UFO visually. I noticed it when I was downloading the pics onto my computer. Description: I was randomly taking pictures over a ridge in Yakima (actually just outside the city) through my sunroof (left hand on the wheel and right hand taking pics through the sunroof). I had just left my mom's to go back to Seattle. In this area, there is a \"Military Base\" as you ascend I-82 that seems completely invisible. There is never any activity going to and from the freeway exit to this base - you never see people, military aircraft or any vehicles. This area is highly suspicious for UFO sightings and is considered a \"hotspot\". I was taking pictures of my boyfriend's white truck ahead of me (both of us drove separate to and from Yakima that weekend) and for some reason, I decided to take pictures as we went over this ridge, but just past the military sign. I was not thinking of anything in particular as I had my boyfriend's son was with me in the car and we were just messing around with the camera. This UFO was not visible until after the picture was taken and I was viewing pictures later that evening."],"Tags":"City","Object Features":"Undisclosed","Disposition":"IFO","trends":["There have been 15 other sightings in Yakima","There were no other sightings in Yakima on or around May 24th 2009","This sighting has never been favorited.",""],"Country":"United States","City":"Yakima","Object Shape":"Disc","Viewing Distance":"Unknown","Region":"Washington","Longitude":"-120.501209","Sighting Duration":"00:01:01","Weather Factors":"Unknown","Log Number":"US-08292009-0017","Source":"MUFON","Latitude":"46.610641","map":"<A HREF = \"http://maps.google.com/maps?q=46.610641,+-120.501209(18953)&iwloc=A&hl=en\"> mufon case (18953) map </A>","Case Number":"18953","Date Submitted":"05/24/2009 03:15 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/18953.html.txt","/var/www/straped/mufon/more/18953_submitter_file1__Picture053.jpg","/var/www/straped/mufon/more/18953_submitter_file2__UFO2edited.jpg","/var/www/straped/mufon/org/18953.html"],"Summary":"Taking random pics of truck in front from outside sunroof. UFO not seen visually, only when downloaded.","Date of the Event":"05/24/2009 03:15 UTC"}