{"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=51.900517,+-8.470089(18973)&iwloc=A&hl=en\"> mufon case (18973) map </A>","Latitude":"51.900517","Case Number":"18973","Country":"Ireland","Object Flight Path":"Stationary,Path with directional change","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/18973.html.txt","/var/www/straped/mufon/org/18973.html"],"Weather Factors":"Unknown","Source":"MUFON","City":"Cork","Log Number":"IE-08312009-0002","Viewing Distance":"21-100 Feet","trends":["There have been 4 other sightings in Cork","There were no other sightings in Cork on or around May 20th 1961"],"Date Submitted":"08/31/2009 02:16 UTC","Object Shape":"Circle, Flash, Star-like","divs":["Sighting Detailsi am describing a few happenings. as a child going to school a light shone down on me from above a few times one morning even though i changed my position on the road, not long after, just around the corner a few of us kids saw a big light in the sky which was reported in the local newspaper the next night, the cork echo. it said that strang lights were seen in the sky over the north side of cork city. about 15 years ago i saw 5 lights about 5 miles east of here, formation flying. a year later, or so, a light the size of three houses, which started as a pinprick in the south sky and flew at a phenominal pace towards me and stopped about 30 feet over my head for about 20 seconds and then it scrambled and headed northeast. in 1992 about iwas playing swingball with a friend from america 5 miles east again at night time and a light shone down on us for about 2 seconds, a dull light.whEn i think back on all this i find it amazing. and obout 11years ago 5 small balls of light came into my flat and flew around and left again and then a big search light shone in my window from the sky and i looked out my window right away and there was not a soul in sight. my life was saved a few times in my life.i used to get blood noses as a kid and is not this a sign of alien abduction, according to one of the sights. i filled in a questionaire one time and i answered positive to most of the symptoms. you are free to send me an e mail if you wish to shed some light on the subject if you will pardon the pun. yours john ."],"Summary":"on numerous occasions in my life lights have appeared over my head. could you explain","Region":"County Cork","Longitude":"-8.470089","Date of the Event":"05/20/1961 08:10 UTC"}