{"map":"<A HREF = \"http://maps.google.com/maps?q=43.053342,+-76.142994(18972)&iwloc=A&hl=en\"> mufon case (18972) map </A>","Case Number":"18972","Latitude":"43.053342","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Circle, Star-like","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/18972.html.txt","/var/www/straped/mufon/org/18972.html"],"Date of the Event":"08/22/2009 01:00 UTC","Weather Factors":"Light","Region":"New York","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around August 22nd 2009"],"divs":["Sighting DetailsMy daughter and I were swimming after midnight in our pool and as I floated on my back, at first I saw a regular airplane (I believe it to be one since it had green and red lights like one and flew like one) which was very high up and as I was watching it... what appeared to be 1 or 2 smaller bright white round lights showed up around it but I couldn't tell if they came from it or if they were way high above it or what since they were going so quickly. In my opinion, these lights were surely UFO related because I have never seen anything like it before. I called to my daughter and pointed up (not taking my eyes off of this) saying, \"I wonder if the plane sees it! Am I seeing what I think I'm seeing... what do you see?\" She looked up and said, \"It's a light doing figure eights zipping around real fast, Oh my God...it's a UFO!.\" She says it was 1 light but I thought it was 2 because it looked that way to me since the light was zipping so fast. My sight is much poorer than hers, but I am positive that I saw UFO activity. The airplane flew off normally, but the light stayed as it was when I first saw it, making a couple zig zags at first and then several semi circular patterns in what seemed like a small span of space until it just disappeared. If you stand outside and point up into the sky and make a letter \"C\" (both forward and backward) with your pointer finger a few times in a row very fast... this is about the span of measurement it works out to be while looking up. That is a good example to me because I'm not good at determining these distances. This is the first time either of us ever saw anything \"weird\" like this. It's my estimate that the whole thing lasted about 10-20 seconds. We waited about 15 more minutes in case it came back but we didn't see anything else. I searched on my computer right away for local area sightings and hadn't seen anything. Thanks for the chance to report it."],"City":"Syracuse","Summary":"Bright white round lights high up zig zags and cicular motions for 15 secs","Tags":"City","Longitude":"-76.142994","Viewing Distance":"Unknown","Country":"United States","Log Number":"US-08312009-0001","Object Flight Path":"Path with directional change,Other","Source":"MUFON","Date Submitted":"08/31/2009 01:41 UTC"}