{"Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Monument","There were no other sightings in Monument on or around August 19th 2009"],"Source":"MUFON","Case Number":"18971","Object Features":"None","divs":["Sighting DetailsOn Wed. Aug 19th, about 9:30 at night, I was sitting outside with some friends on their deck in Monument, Colorado, west of the I-25 interstate. We were looking at the sky, saying how bright the stars were that night. I said,\"Look, there's a satellite.\" Far above where planes fly, was a small,bright, blinking light. It was moving at a steady pace, and so high up I thought it was a satellite. Then, it got brighter and bigger, so I said, \"Oh. Maybe it's a plane after all. It's too bright to be a satellite.\" As soon as I said that, it got HUGE. It became this large, elliptical(like a football) light-incredibly bright and white. It stayed where that way-like a huge, bright eye looking directly at me- for several seconds. Then, it became the size and brightness of a plane again, and seconds afterwards, a small, blinking light continuing in it's high orbit, looking just like a satellite, until it continued out of sight. I was amazed at what I saw, and told my friend about it, but he just laughed and said I was imaging it. I know I didn't imagine it. It went from being a speck of light, to this huge,bright, white light object in the sky. I have never seen anything like it before."],"Latitude":"39.095359","City":"Monument","Summary":"A bright, white light; ellipitcal in shape-like a football. Huge in the sky.","Longitude":"-104.871588","map":"<A HREF = \"http://maps.google.com/maps?q=39.095359,+-104.871588(18971)&iwloc=A&hl=en\"> mufon case (18971) map </A>","Country":"United States","Log Number":"US-08302009-0013","Tags":"City","Date of the Event":"08/19/2009 09:30 UTC","files":["/var/www/straped/mufon/html2text/18971.html.txt","/var/www/straped/mufon/org/18971.html"],"Weather Factors":"None","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Flight Path":"Path then hovering","Disposition":"IFO","Date Submitted":"08/30/2009 10:36 UTC","Region":"Colorado"}