{"Date of the Event":"04/10/1997 11:30 UTC","Object Flight Path":"Path then hovering","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/18979.html.txt","/var/www/straped/mufon/org/18979.html"],"Log Number":"NZ-08312009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=-41.124433,+175.070783(18979)&iwloc=A&hl=en\"> mufon case (18979) map </A>","Longitude":"175.070783","Region":"Wellington","trends":["There have been 2 other sightings in Upper Hutt","There were no other sightings in Upper Hutt on or around April 10th 1997"],"Latitude":"-41.124433","Object Shape":"Triangle","Disposition":"Unresolved","Weather Factors":"Unknown","divs":["Sighting DetailsOn the evening in question I was at a friend's home watching a cricket match on TV. I went out to his large, grassy back year. I looked up at the overcast sky and saw a perfect triangular shaped hole in the clouds 1-200 metres above and around 50 metres ahead of me. The hole was slowly moving with the clouds in my general direction. The thought jokingly crossed my mind that this could be a hole for a UFO to enter through. Within the space of 5 seconds after this thought a clock-wise spinning black triangular shaped object entered at a 45 degree angle from above the clouds near, but exactly through, the above mentioned hole in the clouds. It stopped just as it had made it below the clouds for a moment, then spun in reverse (anti-clockwise) and moved away retracing the path it had arrived on. The sighting took a total of about 2-3 seconds. It was'nt until the object had stopped spinning that I could see it was a triangle, as while it was spinning down from above, it had resembled a boomerang in flight. The event was over so quickly that I didnt have much time to respond emotionally or intellectually. I just observed it passively and was left somewhat bewildered as I had never heard of a triangular UFO. Also, the fact that I had \"thought\" it first, seemed to suggest a psychological aspect to the sighting, which was further grounds for bafflement. However, suprisingly to myself, I didn't mention it to my friend when I reentered the house. In fact, I half forgot about for the rest of the evening, only pondering it further when I was later alone."],"Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"08/31/2009 12:05 UTC","City":"Upper Hutt","Case Number":"18979","Object Features":"None","Summary":"clockwise spinning dark triangular UFO approached through over cast skies at 45 degree angle from left to right 100-200 metres ahead and above me, stopped momentarily, then spinning anticlockwise moved away via the same path it had arrived, total 2-3 secs","Country":"New Zealand","Tags":"City"}