{"Region":"Iowa","Case Number":"18985","Viewing Distance":"Over One Mile","Object Flight Path":"Other","Date Submitted":"08/31/2009 05:16 UTC","trends":["There have been 8 other sightings in Dubuque","There were no other sightings in Dubuque on or around August 31st 2009"],"files":["/var/www/straped/mufon/html2text/18985.html.txt","/var/www/straped/mufon/org/18985.html"],"Sighting Duration":"Undisclosed","Longitude":"-90.661812","Country":"United States","Disposition":"IFO","Latitude":"42.503938","Log Number":"US-08312009-0014","Date of the Event":"08/31/2009 03:35 UTC","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=42.503938,+-90.661812(18985)&iwloc=A&hl=en\"> mufon case (18985) map </A>","Tags":"City","Object Features":"Unknown","divs":["Sighting DetailsAt 3:30 a.m. on August 31, 2009, I took my puppy outside in my back yard to go potty. As I was walking in my yard I looked up in the western sky and saw a very bright light high and far away that I thought was a star. I was going to make a wish and started to stare at it saying \"Star light, star bright, first star I see tonight\" when I noticed it looked like it was changing colors. I thought to myself, it wasn't a star afterall, it must be a plane. I walked up to the top of the small hill in my back yrd to my fence line to try to get a better look. I kept staring it to try to figure out for sure what it was and that's when I saw it move. It moved around like a bee flying, in every which direction. It was very strange. I had never seen anything move like that, so I kept watching it. It would move like that and then seemed to just hover. The size of the light never changed and it never moved far from where I first saw it. After a couple of minutes I noticed flickering or twinkling lights pop up around it and the big bright light would move quickly toward them. I watched this go on for about 15 minutes. I thought my eyes were playing tricks on me. I have no explanation for what I saw. It made me feel uneasy because I couldn't explain it. It was bizarre and as I write this it soundsa crazy, but I know what I saw. After about 15 minutes I went inside because my puppy was pestering and I was cold. It was very chilly outside."],"Weather Factors":"Unknown","City":"Dubuque","Source":"MUFON","Summary":"Bright light that seemed to change colors and moved quickly in ALL directions, like how a bee flies, towards several other \"twinkling\" lights near it."}