{"Weather Factors":"Unknown","City":"Fairfield","Viewing Distance":"Unknown","Date of the Event":"08/30/2009 11:15 UTC","Region":"California","Latitude":"38.256618","Case Number":"18980","trends":["There have been 15 other sightings in Fairfield","There were no other sightings in Fairfield on or around August 30th 2009"],"Disposition":"Hoax","Object Features":"Undisclosed","Summary":"3 amber orbs and glowing extremly bright to nothing and one red flashing light","map":"<A HREF = \"http://maps.google.com/maps?q=38.256618,+-122.037066(18980)&iwloc=A&hl=en\"> mufon case (18980) map </A>","Log Number":"US-08312009-0009","Longitude":"-122.037066","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/18980.html.txt","/var/www/straped/mufon/org/18980.html"],"Country":"United States","divs":["Sighting DetailsThere were 3 glowing amber orbs and one red flashing light on southern horizon of fairfield ca. The orbs were all seperated by a large distance and at all differnt altitudes but they were all close enough to eachother to be seen within the same glance. The large orbs looked like when a plane is flying at you with its main ligt pointed at you, how ever these lights were much brighter when they were fully illuminated. These lights would start off as dull lights then fade into being extermly bright amber colored orbs. The lights were all stationary and they would light up into view then fade back to nothing. they would not be visible for about 3-4 minutes then come into view for about 30-40 seconds at a time. They continued to do this for abotu one and a half hours. these orbs stayed in the same formation throughout the entire duration that i observed them. Only one time did they change formation when they apperaed all together in a line at a 45 degree angel. Also during the time of this sighting there was a constant flashing red light about 100-200 feet below these lights. This red light was small and weak and would flash on for 1 second then remain off for one second then continue to repeat that pattern."],"Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"08/31/2009 12:08 UTC","Object Shape":"Star-like"}