{"Log Number":"US-08312009-0017","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/18988.html.txt","/var/www/straped/mufon/org/18988.html"],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Region":"Indiana","City":"Evansville","Longitude":"-87.56248","map":"<A HREF = \"http://maps.google.com/maps?q=37.974759,+-87.56248(18988)&iwloc=A&hl=en\"> mufon case (18988) map </A>","Latitude":"37.974759","Summary":"long,thin, irregular outline. Flat area on the side toward the front","Weather Factors":"None","Date of the Event":"08/28/2009 06:15 UTC","Object Features":"Other","Tags":"City","Date Submitted":"08/31/2009 08:16 UTC","Country":"United States","Case Number":"18988","divs":["Sighting DetailsDriving northbound on Cross Pointe blvd, Between SR62 (Morgan ave.) and Sr66 (Lloyd Expressway). The object didn't attract my attention at first, due to the location of the airport a few miles away. It was traveling south at an altitude of a few hundred feet... not unusual in the area. the speed was about that of a small plane. The thing that caught my attention was a flash of reflected light off a rather large flat area on the side of the nose. I was convinced that it was a small plane, but I thought \"What sort of plane has that flat spot?\". It was at that point that I noticed the lack of wings or horizontal tail surfaces. It was a rather indistinct shape... long and dark, with a \"segmented\" appearance (the outline was not smooth, but looked as though it was several parts married together into one vehicle). I did not see any evidence of a propeller, nor did I hear the sound of a jet. By the time I realized what I had (I've hoped to see a UFO since a sighting I had as a child) and had turned eastbound to get a better look, it was gone. I have lived near this airport for 51 years and am quite familiar with the aircraft that arrive and depart. I do not recognize this one. I am not making any claims of extraterrestrial origins, little gray guys or reptilians. I am just reporting an Unidentified Flying Object."],"trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around August 28th 2009"],"Source":"MUFON","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:15"}