{"Longitude":"-82.00502","Tags":"City","Log Number":"US-08312009-0016","Viewing Distance":"501 Feet - 1 Mile","Summary":"White/silver light with a blue green and red light moving around it. Stationary in sky.","Object Shape":"Circle, Flash, Star-like","Case Number":"18987","map":"<A HREF = \"http://maps.google.com/maps?q=33.481546,+-82.00502(18987)&iwloc=A&hl=en\"> mufon case (18987) map </A>","Disposition":"Unknown","Source":"MUFON","City":"Augusta","Latitude":"33.481546","trends":["There have been 20 other sightings in Augusta","There were no other sightings in Augusta on or around August 29th 2009"],"files":["/var/www/straped/mufon/html2text/18987.html.txt","/var/www/straped/mufon/org/18987.html"],"Date of the Event":"08/29/2009 08:30 UTC","Weather Factors":"Unknown","Country":"United States","divs":["sighting detailscoming out of a local cvs store, i noticed several other people watching something in the sky. it was a bright white or silver light. around this lite, and a good distance out from it, was a red, a blue and a green light spinning rapidly around it. every few seconds the 3 colored lights would go back into the original white\\silver light. then the whole process would repeat. i have actually seen this several times dating back to 2004, and filed reports with cufon. there has been a local news story about a similar sighting on our local abc affiliate. i am certain that this is not man made. during other times i have seen it i have seen it change places in the sky several times over the course of a night. i have had people claim it is advertsing lights, satelittes and other things i am certain that it couldnt be. during this saturdays sighting, the other people around all commented that it was unlike anything that should be in the sky. i am more than willing to talk to a feild investigator about this and my past sightings. i have read and seen similar reports of this object in this area and others. i also heard a caller on coast to coast am call in from waynsboro ga and report a very similar sighting. that was back in 2004. the sky was fairly clear here sat night, some clouds were visible. i noticed it because of the others around. i do not know any of the other witnesses. my reaction was to contact georgia mufon about it this time, being about the 6th time ive seen it."],"Date Submitted":"08/31/2009 07:38 UTC","Object Features":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Region":"Georgia"}