{"map":"<A HREF = \"http://maps.google.com/maps?q=43.809156,+-91.235981(18982)&iwloc=A&hl=en\"> mufon case (18982) map </A>","Date of the Event":"08/14/2009 01:00 UTC","trends":["There have been 3 other sightings in La Crosse","There were no other sightings in La Crosse on or around August 14th 2009"],"Tags":"City","Log Number":"US-08312009-0011","Weather Factors":"Does Not Apply","Object Shape":"Triangle","Summary":"sighted 4 triangle shaped craft during aug. meteor event","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Viewing Distance":"Over One Mile","Object Features":"Unknown","Country":"United States","Case Number":"18982","Longitude":"-91.235981","Region":"Wisconsin","divs":["Sighting Detailslet me start by saying that i am an \"inactive\" but certified field investigator for wisconsin mufon, so i have a fair knowledge of the difference between meteors, planes, or other conventional craft. during the aug. meteor shower my daughter and i went to a local park to watch the show. we saw several mereors despite the high level of city lighting it was about 45 min into our time viewing that we saw what i first believed to be the space station, however it moved to slowly and at times STOPPED moving across the sky. at this point i ignored the meteors and focused on the blinking object. it stayed in the southwest, aprox. hight of a small plane, but was easy to make out the triangle shape as it passed below areas of the sky when it finally began a slow direction to the northeast. it passed directly overhead and as the rear of the craft became visible 3 horizontal lights were quite visible, blinking in no notecibal pattern of blue, green, and and orangish-red we watched it continue northeast untill out of sight. using the \"asprin test\" from the mufon handbook and knowing that standard triangle craft are football field sized, i accertained this craft to be very high up. at this point i decided to leave the city to get a better view of the sky so we drove to the top of the bluff, high above the city lights. it was then we witnessed 3 more of the same objects, in the the southwest area moving in changing patterns,switching spots with one another and after about 10 min or so one craft again moved overhead from the sw to the ne untill out of sight. (this actually frightened my 14 year old daughter because she believed they were \"watching\" us). aprox 10-20 min after the first craft left sight the remaining 2 slowly left in oppisite directions, 1 to the east, 1 to the west. i took several pictures and video with my phone camera but the resolution was so poor nothing showed up upon review. i did not bring along a quality camera because i was expecting to only be viewing meteors, which are too fast and too unpredictibal to catch on camera unless your REALLY lucky. feelings or reactions after the sightings? i was elated, bieng a devout ufologist, my daughter was at first amazed having never seen a ufo, but then became worried and now does not talk about it, trying to convince herself what she saw was a star or planet. (these objects were neither. stars do not move across the sky that rapidly and planets do not blink or twinkle. also, the only visible planets that night were jupiter and mars). that about sums it up, if more detail is needed you may reach me at the number provided. if no answer, please leave a message and i will return your call. i would also be intrested to know if you recieved any other reports of craft bieng spotted during the shower. anyone that went out to watch the shower should have seen them as they were not easily missed! thanks for your time, i hope wisconsin mufon has an active investigator available to review and prusue this."],"Sighting Duration":"03:00:00","Latitude":"43.809156","Disposition":"Unknown","City":"La Crosse","files":["/var/www/straped/mufon/html2text/18982.html.txt","/var/www/straped/mufon/org/18982.html"],"Date Submitted":"08/31/2009 02:34 UTC"}