{"Source":"MUFON","Date Submitted":"09/01/2009 03:21 UTC","Case Number":"18999","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"47.983935","divs":["sighting detailsi didn't even realize i had captured anything unusual on film the day this happened. i was at paine field in everett photographing some flybys of historic aircraft that are kept at the airfield there. i was going back through my photos yesterday when a cigar shaped object caught my eye in my images. i enlarged the images considerably to get a better look and i simply cannot explain them or their cigar-like appearance. the easiest explanation would be that its an aircraft at high altitude, but there are no contrails evident. in these two shots i was panning the camera to follow the aircraft as it flew parallel to the runway at paine field from south to north. i was viewing the aircraft while looking towards the west. both images were shot at 1\\250th of a second using a canon 70-200 f4 \"l\" lens. the aperture was set to f13. the focal length was racked all the way out at 200mm. the type of camera used was a canon eos 50d. i took images in both .jpg and canon raw format. i have no idea what i caught on my camera, but i have an open mind about these matters and wanted to share what i had with you folks to see if you could make heads or tails of it."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.983935,+-122.193299(18999)&iwloc=A&hl=en\"> mufon case (18999) map </A>","Disposition":"Unknown","Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-09012009-0003","trends":["There have been 30 other sightings in Everett","There were no other sightings in Everett on or around June 27th 2009","This sighting has never been favorited.",""],"Region":"Washington","Date of the Event":"06/27/2009 12:25 UTC","Object Flight Path":"Undisclosed","Summary":"Metallic Cigar Shape","Object Shape":"Cigar","Object Features":"Undisclosed","City":"Everett","Longitude":"-122.193299","files":["/var/www/straped/mufon/html2text/18999.html.txt","/var/www/straped/mufon/more/18999_submitter_file1__IMG_7262.JPG","/var/www/straped/mufon/more/18999_submitter_file2__IMG_7263.JPG","/var/www/straped/mufon/org/18999.html"]}