{"Date of the Event":"08/31/2009 09:50 UTC","Tags":"City","City":"Bridgeport","divs":["Sighting DetailsAt 9:45 I stepped outside to bring some stuff in, it was so crisp and clear I figured I'd check out the stars for a few mintues. (I own a telescope and have some experience with the night sky) I looked up and saw something flash, not thinking much of it because I had just turned my head to the sky. I kept looking and saw what I figured was a satelite because it was just a single tiny pin point of yellowy orangish light which I could see slowly move from the south to N.E. I did not think this is what I saw flash until as I watched, it instantly pulsed to where it appeared bigger and brighter than Saturn in the night sky only it was moving south to N.E. I kept watching and it did it again. The pulses only lasted a split second. I began counting the seconds between pulses and it ended up to be 7 or 8 pulses, just about 8 seconds apart. As it traveled to the N.E. it (the object not the flashes) got dimmer and disappeared from my view as it passed through Cassiopeia. I have seen a few satelites and the ISS and shuttle passes. This did not look like any of those. I understand that the ISS and shuttle will brighten up and fade away as they make their passes but pulsating like that is new to me. I visited NASA.gov and the tracking map did not show either being visible to me at that time, unless I read it wrong, which is possible. But like I said, the pulsating is something I have never seen before. To pulsate from a dull pin point to such a large bright ball of light was very alarming. Airplanes pass by all the time, this was not an airplane. This object was at such a high elevation-well, I shouldn't even say elevation; it was in orbit, it was clearly not an airplane. I hope this helps! I'd love to know if anyone else saw it. It was awesome!"],"Sighting Duration":"Undisclosed","Disposition":"IFO","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.192358,+-73.189867(18992)&iwloc=A&hl=en\"> mufon case (18992) map </A>","Object Features":"Undisclosed","Longitude":"-73.189867","Weather Factors":"Unknown","Date Submitted":"08/31/2009 10:34 UTC","trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around August 31st 2009"],"Region":"Connecticut","Source":"MUFON","Object Shape":"Fireball, Flash, Sphere, Star-like","Country":"United States","Summary":"appearance of a sattelite but pulasting very bright light every 8 seconds or so","Case Number":"18992","Log Number":"US-08312009-0021","files":["/var/www/straped/mufon/html2text/18992.html.txt","/var/www/straped/mufon/org/18992.html"],"Latitude":"41.192358","Object Flight Path":"Undisclosed"}