{"map":"<A HREF = \"http://maps.google.com/maps?q=39.788043,+-85.762933(18994)&iwloc=A&hl=en\"> mufon case (18994) map </A>","Source":"MUFON","Case Number":"18994","files":["/var/www/straped/mufon/html2text/18994.html.txt","/var/www/straped/mufon/org/18994.html"],"Disposition":"Insufficient Data","Longitude":"-85.762933","divs":["Sighting Detailsi was driving on north on c.r. 100 east when i seen what appeared to be a sparkling star low on the horizon, but the longer i looked ,i realized that it was heading almost directly towards me.my friend called it out before i could because i didnt want to seem like i was an idiot.he broke the silence first and i am glad he did because he asked me to stop.after i stopped we both got out and looked about 45 degrees forward and up and it dissappeared,couldnt see it because of low cloud cover.then the clouds lit up as if a plane was heading straight towards the ground but the clouds actually showed movement like someone was up in the cloud with one of those cheap spinning party lights.whatever it was came out of the clouds for a split second just above us ,in a swooping type of flight path,tumbling end over end then it went right back out of sight in the clouds.it had no apparent shape that i could tell because the lights made it hard to see any detail on the object.the strangest thing ,outside of just seeing a friggin ufo ,is that there was no sound and i could actually feel a vibration or pulse in the atmosphere all around when it passed.we ,after having seen that are now absolutely without a doubt believers now.i havent had a good nights sleep since."],"Log Number":"US-08312009-0023","Latitude":"39.788043","Object Shape":"Unknown","Date of the Event":"08/29/2009 08:37 UTC","Region":"Indiana","Date Submitted":"08/31/2009 10:52 UTC","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Greenfield","There were no other sightings in Greenfield on or around August 29th 2009"],"Tags":"City","Object Features":"Unknown","City":"Greenfield","Summary":"tumbling end over end with red,green, and blue lights.","Weather Factors":"None","Viewing Distance":"101-500 Feet, Over 1 Mile","Country":"United States","Object Flight Path":"Path with directional change"}