{"Region":"California","Object Shape":"Disc","Object Flight Path":"Path with directional change","Object Features":"None","Disposition":"IFO","Viewing Distance":"Unknown","Summary":"Dual identical lighted disks","Longitude":"-117.600094","Date of the Event":"10/19/2007 10:23 UTC","files":["/var/www/straped/mufon/html2text/19009.html.txt","/var/www/straped/mufon/org/19009.html"],"Latitude":"33.649755","Log Number":"US-09012009-0013","Case Number":"19009","Tags":"City","trends":["There have been 2 other sightings in Rancho Santa Margarita","There were no other sightings in Rancho Santa Margarita on or around October 19th 2007"],"Country":"United States","Date Submitted":"09/01/2009 04:05 UTC","City":"Rancho Santa Margarita","divs":["sighting detailsi was just going to bed when a light outside caught my eye. i went to the window and saw 2 lit objects dancing in the air towards the north. for a moment i thought they were remote control planes that people use in the park by my home. but i quickly realized their ability to maneuver matched no rc toys or human piloted craft. within moments, i admitted to myself that i was seeing 2 ufo's. they were round and flat like a disk. their shape was defined by 6 greenish-bluish white lights along their edge. (the color of the lights is hard to describe because it was primarily white, with a lime green tint, but at the same time also a blue tint.) both were identical. as they turned, their lights spun, making them look like a wheel. they could roll on their side or parallel to the ground. however, when they executed a steep dive, their green lights vanished and a single, brilliant, rich, ruby-red light in the middle of the object came on instead, for the duration of the dive. they were remarkably clear and defined, so i don't think they were far away. yet there was absolutely no sound. the feeling i got watching them was that they were being playful. i grabbed my camera, and dashed outside, calling my roommate. she joined me and we watched them together. we agreed that they were ufo's. i took a series of pictures which shows the colors, but came out blurred: http:\\\\www.atlas9.com\\mykecollins_ufo_wolf\\myke_collins_ufo_sighting.htm the 2 craft executed a set of maneuvers, sometimes mimicking each other and sometimes not. after about 5 minutes, they vanished by plunging suddenly towards the ground."],"Source":"MUFON","Sighting Duration":"00:05:00","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.649755,+-117.600094(19009)&iwloc=A&hl=en\"> mufon case (19009) map </A>"}