{"Latitude":"34.100279","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"19000","Object Shape":"Triangle","Weather Factors":"Unknown","Object Features":"Undisclosed","Source":"MUFON","Summary":"Large triangle shaped formation of lights that appeared connected...","Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/19000.html.txt","/var/www/straped/mufon/org/19000.html"],"Date Submitted":"09/01/2009 04:00 UTC","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 31st 2009"],"Log Number":"US-09012009-0004","City":"Los Angeles","Longitude":"-118.325491","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.100279,+-118.325491(19000)&iwloc=A&hl=en\"> mufon case (19000) map </A>","Date of the Event":"08/31/2009 10:20 UTC","Disposition":"IFO","Region":"California","divs":["Sighting DetailsI was heading south on the 101 freeway at approx. 10:20pm nearing Highland Blvd. exit... facing south on my way to Cahuenga Blvd Exit... through my windshield as I was driving, off to the right a little, I saw three bright lights that looked like starlight except they were gliding over Hollywood heading east towards the Hollywood sign and hills (moving to the left as I was viewing it). I have seen video footage of triangle lights like this before, but never thought I would see one myself. I almost thought I saw a reflection of the entire triangle's surface as it tumbled through the sky gracefully over the edge of the city... it almost appeared as if it was 90% transparent but not fully. None of the lights were ever obscured, but they did appear to be locked together and tumbling across the sky. It was amazing. I wondered if the other cars on the road were seeing it too. I thought maybe these were helicopters but the lights were too bright and constant. I've seen plenty of helicopters in LA and I know the difference... and I know these things covered a good distance pretty quickly. These things connected, glided and tumbled and made movements that are not what a helicopter is capable of or that three would ever do together... these lights covered a few miles a minute and they appeared about 30 degrees above the horizon as I drove up the hill. Trees began to obscure my view... Once I got to my exit on Cahuenga Blvd... they were completely out of sight. This looked genuine to me."]}