{"Object Shape":"Diamond, Sphere, Triangle","Log Number":"US-09012009-0022","Longitude":"-76.269517","files":["/var/www/straped/mufon/html2text/19018.html.txt","/var/www/straped/mufon/more/19018_submitter_file1__insane.JPG","/var/www/straped/mufon/org/19018.html"],"Latitude":"37.849574","map":"<A HREF = \"http://maps.google.com/maps?q=37.849574,+-76.269517(19018)&iwloc=A&hl=en\"> mufon case (19018) map </A>","trends":["There has been one other sighting in Reedville","There was one other sighting in Reedville on or around May 9th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Region":"Virginia","Date Submitted":"09/01/2009 04:46 UTC","Tags":"City","Date of the Event":"05/09/2009 10:00 UTC","Case Number":"19018","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Reedville","Weather Factors":"None","Summary":"Floating Light, Multi-Colored, Hovering in a in a non-specific pattern.","divs":["Sighting DetailsMy girlfriend and I were at her parents house for mothers day weekend. We went out to her back porch at around 10 O'clock. I noticed a light in the sky and assumed it was a plane or helicopter. After looking at it for a minute or two, I noticed it moved up and down, and also left to right. For over half an hour it floated up and down, in and out of the low cloud cover, right beyond the treetops. It disappeared into the clouds for a few moments. We had gotten the camera out by this point; hoping for the object to return. It came back out of the cloud cover only a minute or two after it vanished. At this point my girlfriend took a couple photos. Afterward, thinking we had only gotten a distant shots, just decided we were crazy and to deleted the pictures. However, a few remained and after a week or so, she was looking back over all the pictures that weekend. After zooming in on the 'white light' we saw this bluish-gray, metallic looking, 'emerald shaped' OBJECT, with a greenish-yellow orb around it. Its absolutely shocking to see the amount of detail the picture shows."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Country":"United States"}