{"City":"Wittenberg","Weather Factors":"Unknown","divs":["Sighting DetailsI had an old mobile home on a small plot of land, in the woods, located, near Shawano, Wisconsin, that I used as a vacation home, at the time. The long trailer would make noises as the wind would slightly move it and the brush outside would rub against it. When it would get dark there; it would get really dark. It was a little scary being there by myself. I used to turn on the tv and radio just to help mask the background noise. One night in July of 2005, I decided that I needed to go out someplace, where I would be with other people. I decided to go to a bar near Birnmwood; which is about 40 miles from where I was staying. I did have a few drinks and I had a great time talking with other people. When it was close to closing time, I decided it was time to make the long trip back. I was heading east-bound on Highway 29. At that time of night you have the road to yourself. You can set the cruise control at 65 MPH and just drive. If your lucky, you may see one other car between west of Wittenburg and Shawano; about a 30 plus mile trip. Even thou it gets dark up here, the moon must have been out that night; because it was light enough for me to see the object. About 5 miles east of Wittenburg is when I encountered the object. When I first noticed the object, it was off to my left at windsheild height. It was about the size of a small car; I'm guessing about 10 feet long and 5 foot wide. It was a tan color, like a deer. I could not tell if it was a craft or animal. I knew that it was neither. As it looked like it was going to hit the car, I ducked down. It went over my hood and cleared the car. I slowed the car down and watched it travel over an open field, at the same height. As it went to my right the rectangual shape would change shape to an S-shape. It retained most of the retangular shape; but looked like a snake would look like as it moved over the ground. I was really shook up after it was gone. I had a good time at the bar that night and before this incident, I thought that I would go back the next night. It scared me so much that I didn't go back to the bar for about 3 months. I didn't tell too many people about what I saw that night; because the first thing that they would say to me is; how much did you have to drink? I did not want to become part of a joke. I did have a good friend that lived not too far away from where I saw the object. I told him some basic information; without telling him the whole account, at first. He told me that, at that time, for about the last two years, people saw strange sightings over the stepple of an old church on highway 29. This is where I saw the object. The open field is across from the church. I know that a lot people have reported seeing triangluar objects; but I was wondering if anybody ever reported seeing what I saw."],"Viewing Distance":"Unknown","Region":"Wisconsin","trends":["There have been no other sightings in Wittenberg","This sighting has been favorited 1 time."],"Longitude":"-89.169557","Date Submitted":"09/01/2009 04:43 UTC","files":["/var/www/straped/mufon/html2text/19017.html.txt","/var/www/straped/mufon/org/19017.html"],"Summary":"Large Rectangual-Shaped Object, the size of a small car,the color of a deer","Disposition":"Insufficient Data","Case Number":"19017","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.827195,+-89.169557(19017)&iwloc=A&hl=en\"> mufon case (19017) map </A>","Tags":"City","Source":"MUFON","Latitude":"44.827195","Object Shape":"Square, Rectagular","Log Number":"US-09012009-0021","Date of the Event":"06/30/2005 02:40 UTC","Country":"United States"}