{"files":["/var/www/straped/mufon/html2text/19011.html.txt","/var/www/straped/mufon/more/19011_submitter_file1__DSC03779.JPG","/var/www/straped/mufon/org/19011.html"],"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=36.560139,+32.002121(19011)&iwloc=A&hl=en\"> mufon case (19011) map </A>","City":"Alanya","trends":["There have been no other sightings in Alanya","This sighting has never been favorited."],"Source":"MUFON","Latitude":"36.560139","Case Number":"19011","Object Shape":"Disc, Oval","Object Features":"Undisclosed","Country":"Turkey","divs":["Sighting DetailsDuring our holiday in Turkey last year (the 5th of august 2008 at 14:16 PM), at the end of a jeepsafari, we were riding up one of the hills surrounding Alanya in the south of Turkey. The driver stopped for a minute , almost halfway up the hill and I stood up in the jeep. I quickly took three pictures of the vieuw and we drove off. Only now, after a year, I was looking at the internet to some sites about UFO pictures and thought well, look in my personal files, maybe... And to my surprise there is one and maybe more ( the following two pics after this one also show a little strange white light in the sky at different hights) caught my attention. I really can't explain why I noticed it before!! Please take a look. It can be anything but I really can't explain what it is. Again, when I took the picture I didn't notice anything strange in the sky above Alanya that day. The weather was very good, no clouds, 35 degrees Celsius. Only now this evening ( 1st of September 2009) I looked at the pics and noticed. I am open for suggestions. Looking forward to your reaction.... With the kindest regards"],"Date Submitted":"09/01/2009 04:18 UTC","Region":"Antalya","Sighting Duration":"Undisclosed","Tags":"City","Log Number":"TR-09012009-0015","Disposition":"Unresolved","Summary":"Not noticed when taken the picture...","Date of the Event":"08/05/2008 02:16 UTC","Longitude":"32.002121"}