{"Longitude":"-98.335612","Viewing Distance":"Unknown","Case Number":"19012","Date Submitted":"09/01/2009 04:19 UTC","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Object Features":"Unknown","Region":"Nebraska","Source":"MUFON","Disposition":"Unknown","Date of the Event":"08/15/2009 05:55 UTC","Latitude":"40.930456","files":["/var/www/straped/mufon/html2text/19012.html.txt","/var/www/straped/mufon/org/19012.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.930456,+-98.335612(19012)&iwloc=A&hl=en\"> mufon case (19012) map </A>","Tags":"City","City":"Grand Island","Country":"United States","divs":["Sighting DetailsOn Friday evening, the 14th, I set the alarm on my cell phone for 5:30 AM. At roughly around 4 AM of the 15th my wife woke up and asked me if I had to work that day (Sat.), I replied yes, but I didn't have to be to work until 7 AM. She took Sasha (one of 3 pet dogs) downstairs and let them out for their morning potty (she remained downstairs on the couch). At 5:30 AM my phone alarm went off (I looked at the phone and it said it was 5:30 AM). I went downstairs and tuned the TV to The Weather Channel to get the \"local on the 8's\" (approx. 5:34 AM). I forgot to grab my ipod so I went back upstairs to retrieve it, subsequently missing the 6:38 time of local on the 8's. I watched the 5:48 time, after which I kissed my wife goodbye (I awakened her briefly for that). I estimate I left the house at about 5:50 AM. As I was driving North on Blaine Street, approaching highway 34, I noticed what I thought was a commercial jet heading East, off to my left (West), behind it was a white light following and passed the jet like it was standing still. At that time I was thinking to myself that either I was witnessing a UFO event, or I was seeing an airforce jet that \"doesn't exist\". As I approached the intersection I tried to \"look past\" the street lights there to continue observing the light, but what I saw was what appeared to be to white lights, kind of oval shaped, not blinding, but I couldn't see past them (at the time I just figured that it was the street lights, and continued on my way to a local restaurant that was about 2 miles from my home). Approximately 3 or 4 blocks from the restaurant my cell phone alarm went off, and when I pulled it from my front pocket (I was wearing bib overalls) it said it was 5:30 AM. I went on to the restaurant where my cell phone time matched the time at the restaurant. It was several days later when I realized the the street lights were the sodium arc type and not white as I remembered. There is no way that I can prove what happened, but I swear on a stack of Bibles that is exactly what happened."],"trends":["There have been 9 other sightings in Grand Island","There were no other sightings in Grand Island on or around August 15th 2009"],"Object Shape":"Sphere","Log Number":"US-09012009-0016","Summary":"Object passed a commercial jet, apparently came down to see me."}