{"trends":["There have been 6 other sightings in Bellevue","There were no other sightings in Bellevue on or around August 30th 2009"],"Disposition":"Unknown","Date Submitted":"09/01/2009 04:14 UTC","divs":["sighting detailsi was initially hesitant to report this incident, since i'm wanting something closer to ground like the 7-2-9 craft. but when i read report 18992, i had to document that my partner and i saw the exact same object as witnessed by the ct resident. however, we saw this on 8-30-2009 at approx 945-950pm ct and they stated it was 8-31 at 9:45pm et. perhaps they made a typo-error on the date? we were standing in back of a strip mall on about 25th and capehart rd. in bellevue, ne. as usual these days, we proceeded to scan the sky for anomalies. a very bright silver-white flash caught my eye in the ne corner of sky in the area of cassiopeia. like the ct witness, i thought it was likely just a plane strobe, but then realized there were no other standard nav lights. i then asked her to check this thing out, and we both perceived it was moving steadily in a ne direction and pulsating at regular intervals. unlike the ct person, we couldn't see any other regular pin point of light or other object d\\t city lights. my estimate was that it pulsated every 10-12 seconds for about 6-7 times, then left our view. i have no idea at what height it traveled. i would say it moved faster than most satellites i've seen or the iss, which was nowhere near us at that time. this will probably be found to be a new type of satellite or maybe space debris. but i've never seen one that flashed this brightly at regular intervals and there was no burn trail that one would expect with debris. it was also odd that it didn't seem to cross the whole sky, just the ne quadrant."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.163671,+-95.924397(19010)&iwloc=A&hl=en\"> mufon case (19010) map </A>","Longitude":"-95.924397","Log Number":"US-09012009-0014","Tags":"City","Case Number":"19010","Summary":"VERY BRIGHT pulsating object moving S to NE","Date of the Event":"08/30/2009 09:45 UTC","Viewing Distance":"Over One Mile","Object Shape":"Other","City":"Bellevue","Weather Factors":"None","Latitude":"41.163671","Object Features":"None","Object Flight Path":"Straight-line path","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Nebraska","files":["/var/www/straped/mufon/html2text/19010.html.txt","/var/www/straped/mufon/org/19010.html"]}