{"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path","Disposition":"Insufficient Data","Tags":"City","divs":["Sighting Details I was home frome work. Having a beer on my front pourch, like i'd done on many night where the weather was good. I was a natural star gazer. Not a proffesional astraunomer. I just used to look up and wonder if any other life is really out there. I got up from my chair, and started looking at the stars, because the night was so clear. I was looking up for about 3-4 min and I saw what looked like a star moving across the sky. I thought, is that a shooting star? No. I said shooting stars are burn by really fast and burn out. Then I thought it's a sattelite orbiting the earth. But with that though the star started to move in the other direction. I thought that was funny. so I went into the house and told my wife at the time to come and take a look at this. After I had been watching for a while. She came out and we both relocated the star looking object in the sky and started looking at it. Some how we lost the star looking object in the sky, so we started to look around to see if we could relocate this small object. AS WE TURNED OUR HEADS AND BODIES COMPLETEY TO THE OTHER DIRECTION WE SAW A ROUNDED TRIANGULAR SHAPED OBJECT FROM THE BOTTOM. IT WAS ALMOST DIRECTLY OVER US.IT WAS A DARK METALIC LOOKNG CRAFT WITH CIRCULAR LOOKING VENTS MAYBE. THEY APPEARED TO BE IN THE CLOSED POSITION. THIS CRAFT SHOWED NO LIGHTS AT ALL. IT WAS CLOSE ENOUGH TO US THAT IF I HAD TAKEN MY BEER BOTTLE AND TOSSED IT UP I WOULD HAVE HIT THIS OBJECT. THE TRIANGULAR SHAPED OBJECT MOVED BY US VERY SLOWLY, VERY CLOSE, AND WITH NO SOUND WHAT SO EVER. ALL WE HEARD WAS A SLIGHT RUSSEL OF THE LEAVES ON THE TREES. We both ran in the house checked on our child and I don;t kow about my ex-wife now but I have never looked into the sky the same. I regret not having a video camera or something back then. My time and date of sightting maybe 1998 or 1999 around sept-nov It has been so long that i don't fully remember. Lots of things have changed in my life since then and I just have not kept good records for anthing. So thats my story. thanks. call me with any questions."],"Object Shape":"Triangle","Object Features":"Louvres","map":"<A HREF = \"http://maps.google.com/maps?q=44.775872,+-93.276353(19016)&iwloc=A&hl=en\"> mufon case (19016) map </A>","Date Submitted":"09/01/2009 04:39 UTC","Longitude":"-93.276353","Source":"MUFON","Date of the Event":"11/22/1998 10:31 UTC","Country":"United States","Viewing Distance":"21-100 Feet","trends":["There have been 3 other sightings in Burnsville","There were no other sightings in Burnsville on or around November 22nd 1998"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19016.html.txt","/var/www/straped/mufon/org/19016.html"],"City":"Burnsville","Summary":"dark metal rounded triangular shape with what looked like 3 round circles in each point of the triangle like vents of some sort.","Case Number":"19016","Latitude":"44.775872","Log Number":"US-09012009-0020","Region":"Minnesota"}