{"Summary":"We saw large metallic disc with lights hovering about twenty or thirty feet off the ground. It didn't move or make a sound but you could feel pulsations or vibration of some kind that wasn't audible.","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19013.html.txt","/var/www/straped/mufon/org/19013.html"],"Object Flight Path":"Stationary","Disposition":"Unknown","trends":["There have been no other sightings in Mt Sterling","This sighting has never been favorited."],"Object Shape":"Cigar, Oval","Weather Factors":"Unknown","Date Submitted":"09/01/2009 04:33 UTC","Object Features":"Window(s), Patterned Surface","Log Number":"US-09012009-0017","divs":["Sighting DetailsWhile attending Morehead State University one Thursday evening a friend and I set off to blow off steam in Mt. Sterling (Morehead was in a dry county and there were bars in Mt. Sterling). It was still daylight when we left. We got on I-64 headed westbound, then stopped for soft drinks at the Convenient station at the second bath county exit (Owensville, KY). It was still daylight with the sun in our eyes when we got back on the interstate with aproximately sixteen miles until our destination. We were joking and having a good time as we drove along anticipating our little night on the town. At some point I felt like we weren't in the right place and said to my friend we needed to pay closer attention because I thought maybe we had missed the first Mt. Sterling exit ... but no big deal because the second exit was only another four miles past the first. That's when I realized how much was really wrong because within a few miles it was obvious we'd passed both exits without realizing it and it was dusk going into full dark. Even if we were past both exits that only put us twenty or twenty-five miles west of Owensville ... a mere twenty minute drive at interstate speeds yet it was already dark, but that didn't sink in fully until later. We were still perplexed at how we'd driven by both exits, but had no choice but to go on into Clark County to exit 101 (which is out in the middle of nowhere) so that we could turn around and head back for Mt. Sterling. That's what we did, joking about what ditzy broads college was turning us into, but it was too weird to take serious. Unfortunately it got much weirder once we turned around and started eastbound back toward Mt. Sterling. Somehow it was full dark and at the very next overpass off the right shoulder by about fifteen or twenty yards was this big, oval mettallic thing floating in mid-air twenty or twenty-five feet off the ground. It was a big long straight stretch and we could see it as we approached for a long time. I remember thinking at the time that from a distance it was cigar shaped but the closer we got until we could see it from the bottom it looked saucer shaped, so it depended on the angle you were seeing it from exactly what shape you might think you saw. It was solid silver and all around the top side from what I could see looked like window shaped indentions but they were silver too. The lights were all around the outer edge and on the bottom. There was a vibration, sort of rythmic, that you could sort of feel reverberating through your chest but there was no sound, no air displacement stirring up the nearby vegetation, nothing to suggest a propulsion system we might be familiar with. It didn't have any markings or emblems either and I looked carefully because a nice big American flag emblem would have been really reassuring about that time. After all, we were out in the middle of nowhere on a totally empty stretch of interstate. It was almost like I was hypnotized by it because I had slowed almost to a stop as we approached it and started pulling off the highway to the shoulder (although I have no idea what I intended to do except get out and look at it some more). That's when my friend screamed \"hit the gas, hit the gas.\" I did and we sped off down the highway, thinking she saw something I didn't that was inherently dangerous ... but it turns out seeing a flying saucer that close up was something she considered inherently dangerous. I watched it in the rearview mirror until we were all the way out of sight, but it still didn't do anything at all. It was all very confusing because I was more than a little ticked off, a lot more relieved, very jittery and almost shellshocked in a sense for the rest of the night. There were many years I had a burning curiosity ... who or what was in that aircraft? Was it human or other? Maybe military ... except by now they should be as common as helicopters if it was advanced technology we mastered that well almost thirty years ago. How did we miss those exits? Was it all a coincidence that led us to be there and see whatever the saucer looking thing was? Is there something more? Why do I feel like there's more to it? What was my friend so afraid of that night and for at least twenty years afterwards? I tried to get my friend to go be hypnotized with me years ago just to settle the mystery in our own minds but she was terrified at the thought. We came to the conclusion that we somehow zoned out for maybe forty-five minutes but were still on the highway several miles past the last spot we clearly remember, it was just too dark for us to have driven it without stopping, but we don't remember another stop after we passed Owensville. About five years ago she brought it up again and now she wants to try it, but now I'm not so sure ... could it better to let sleeping dogs lie? My friend and I both are professionals with reputations to protect ... but we're approaching the age where we're so established professionally that's not such a big deal anymore. It doesn't matter what we do, nobody else was with us that night so it wouldn't prove anything to anybody else, but it might just give us the rest of the story. Then again we may learn nothing more than we've always known."],"Case Number":"19013","map":"<A HREF = \"http://maps.google.com/maps?q=39.719505,+-83.265193(19013)&iwloc=A&hl=en\"> mufon case (19013) map </A>","Latitude":"39.719505","City":"Mt Sterling","Date of the Event":"Unknown","Region":"Ohio","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Longitude":"-83.265193"}