{"Source":"MUFON","Summary":"4 beings moving across interstate.","map":"<A HREF = \"http://maps.google.com/maps?q=30.189676,+-82.63929(19019)&iwloc=A&hl=en\"> mufon case (19019) map </A>","Log Number":"US-09012009-0023","files":["/var/www/straped/mufon/html2text/19019.html.txt","/var/www/straped/mufon/org/19019.html"],"Date of the Event":"09/30/1985 12:00 UTC","Case Number":"19019","Date Submitted":"09/01/2009 04:56 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsWe had gone to Miami for a meeting and took our children. On the way home, I was driving into the night and everyone in the car was asleep. We were coming to a overpass-and I saw something in the road and I kept trying to figure out what it was and I was driving about 70 miles per hour and I started slowing down because I could not see what it was-then all of a sudden I slammed on the brakes because I saw 4 alien beings- they were moving in a straight line from one side of the highway going to the other side. (There was 2 tall ones and 2 much shorter ones) It looked like they had on a one piece skin tight outfit that even went over their heads. When I slammed on my brakes they all turned their heads toward the car and vanished. They all had oval heads with large eyes. I saw something out of the corner of my eye on the other side of the road and it was gone. Maybe like a flash. My family picked themselves up off the floor and asked what was going on and I told them. They made fun of me and I had tried to dismiss it, but I know what I saw. When we got back to Richmond they asked that I not tell that story to anyone. I did tell my Pastor and he said no other beings could be on this earth, everyone else I told did not laugh but they did look at me really strange. I have told a few people along the way, but not many. About 5 years after that incident my husband and I went through Roswell New Mexico and I asked if we could go through the museum. I was in total shock because I then knew that someone else had seen the same beings. I was watching the UFO show on TV today and the show was about a man who had been abducted. His son and several others also saw the flying objects.I felt really bad for the man because the lie detector test was inconclusive. He said he was not sure he saw it, but he would stake his life on what he saw. I understand that perfectly-you yourself do not want to believe it because no one believes you. Once you have seen something like that it never goes away."],"Longitude":"-82.63929","Latitude":"30.189676","Disposition":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Country":"United States","Region":"Florida","trends":["There have been 4 other sightings in Lake City","There were no other sightings in Lake City on or around September 30th 1985"],"Weather Factors":"Unknown","City":"Lake City","Object Shape":"Unknown","Object Features":"Undisclosed"}