{"Disposition":"Insufficient Data","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-09012009-0024","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around June 30th 1992"],"Date Submitted":"09/01/2009 05:15 UTC","Weather Factors":"Unknown","Longitude":"-83.680916","Object Flight Path":"Undisclosed","Object Shape":"Disc","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=43.018867,+-83.680916(19020)&iwloc=A&hl=en\"> mufon case (19020) map </A>","Country":"United States","divs":["Sighting DetailsI was 12 yrs old and had a good friend of mine spending the night with me. We went to walk to the neighborhood corner store that evening. We were only about 2 blocks from my house, when I looked back right behind us and seen a UFO. It was very low to the ground literally just above the tree line and during the few seconds we was looking at it, it was perfectly still!! When we both realized what it was we both started to panic and turned back toward my house and ran. When we got to my house my Mother and Step-Father was sitting outside on the porch. We ran all the way and asked them did they see that... My Step-father say's see what? I said a UFO!! He sarcasticly said yes. But later admited they seen nothing, they thought we were screwing around I guess. My Mother said we were gone for much longer than we whould have been and thats why they were waiting outside. I cant even begin to say how long we were gone but it was almost dark out when we got home and we only walked 2 blocks from my house. We really didnt have any in depth discussion about what we seen about that until about 5 yrs later. Infact I guess over time I even started to second guess what we seen until we had talked about again years later. Now I am 30 yrs old and have another strange story to tell you about. About 3 yrs ago, I went to the Dr. because my shoulder was bothering me. They took an x-ray and when the Dr. came in to look at the x-rays with me, he said something very strange to me. He said exactly this to me.. \"I have a question to ask you and you dont have to tell me if you dont want to, but what is this?\" He pointed to the x-ray at a round quarter shaped thing in my arm. I looked at it and said \"I have no idea, you tell me\" Then he acted strangely like I didnt wanna tell him or something and didnt say anything else about it. It took some time for me to digest what I saw and when I told my Mother about my appointment she mentioned the UFO inciedent. I think its a lil far fetched but I would like to know what possiably could be in my arm. Very strange!!"],"Viewing Distance":"Unknown","Latitude":"43.018867","Object Features":"Undisclosed","Date of the Event":"06/30/1992 12:00 UTC","Source":"MUFON","Summary":"It was a disc shape with lights on the bottom","files":["/var/www/straped/mufon/html2text/19020.html.txt","/var/www/straped/mufon/org/19020.html"],"Case Number":"19020","City":"Flint"}