{"Date Submitted":"09/02/2009 04:54 UTC","City":"Naples","Sighting Duration":"00:10:00","Country":"Italy","Object Flight Path":"Path with directional change,Path then hovering","Summary":"dozens of balls of light that hover in and out of the clouds","Object Shape":"Sphere","Disposition":"Unresolved","Latitude":"40.839983","Log Number":"IT-09022009-0005","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.839983,+14.252542(19034)&iwloc=A&hl=en\"> mufon case (19034) map </A>","Date of the Event":"04/03/2009 11:45 UTC","Object Features":"Undisclosed","divs":["Sighting Detailson April 3, 2009 at 23.40 I was in my car waiting at traffic lights in Via Galiani, in Naples. The road (via Galiani) The street is perpendicular to the sea, so the look was turned towards the hill. You could not see stars or the moon. The wind was calm. I looked up to sky and saw many fireballs out of the clouds. Some, after a few seconds, fell in the clouds hiding from view. Have seen the fireballs also my wife and daughter who were traveling by car with me. I have seen other people who were parked at the lights as I find out what were those balls. I exchanged information with two people that I have the phone number. We were unable to explain what those objects were flying. The balls were moving from the north-west to north-east, they were faster than the clouds that seemed to have stopped. Objects had spherical shape and were red. Outlines were not well delineated, like a real ball of fire. I talked with people stopped at traffic lights and their first impression was that they were ufo. Have passed dozens of fireballs, then passed the emotion, I took the phone and I took a picture with a nokia N96. Items disappearing right in my view because it passed over a building that covered the view of the sky. New objects appeared on the left hand and continued to fly. 10 minutes after the objects have disappeared completely."],"Viewing Distance":"Unknown","trends":["There have been no other sightings in Naples","This sighting has never been favorited."],"Longitude":"14.252542","Case Number":"19034","Region":"Campania","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19034.html.txt","/var/www/straped/mufon/more/19034_submitter_file1__UFO-03042009066.jpg","/var/www/straped/mufon/org/19034.html"]}