{"divs":["Sighting DetailsWas at work since I work third shirt. Went outside for my break to have a cigarette. My coworker was standing outside too and said, \"Sarah, look at that light!\" I looked up towards the left and saw a very large white light. You could tell it was very high up and was not making any noises. It was moving fast and in a straight line. No lights were blinking on it like on aircrafts. Was almost perfectly circular but the bottom of it looked like it had a little line of light that extended from the main mass. But was very small in comparision to the ball of light. I also about 10 minutes later saw a shooting star but that was obvious, esp since I have seen those before. This was completely different. Moving in straight line, fast but still took maybe three minutes until I lost sight of it as the building blocked its path. Did not appear to blink or twinkle or any flickering. My first thought was maybe the space station? But each time I've seen that it was much higher and smaller and dimmer. This was very big in comparison to all the stars up there. Largest light in the sky but it was very high up and must have been very large to still look so big. Now thats it over I keep thinking about it and picturing it in my head. I have never witnessed anything looking like that and I have a telescope and star watch quite frequently. Don't really have much belief in UFO's but this has got me wondering. Going to research to see if there were any meteors or satellites or even the space station overhead tonight."],"trends":["There have been 2 other sightings in Green","There were no other sightings in Green on or around September 2nd 2009"],"Country":"United States","Viewing Distance":"Unknown","Log Number":"US-09022009-0006","Sighting Duration":"Undisclosed","City":"Green","Date Submitted":"09/02/2009 06:49 UTC","Tags":"City","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.94936,+-81.482011(19035)&iwloc=A&hl=en\"> mufon case (19035) map </A>","Weather Factors":"Unknown","Date of the Event":"09/02/2009 05:36 UTC","Object Shape":"Circle, Egg, Oval, Teardrop","files":["/var/www/straped/mufon/html2text/19035.html.txt","/var/www/straped/mufon/org/19035.html"],"Object Flight Path":"Undisclosed","Summary":"Large white light in sky moving in straight line, very high and very fast.","Case Number":"19035","Disposition":"IFO","Latitude":"40.94936","Region":"Ohio","Longitude":"-81.482011"}