{"Longitude":"-84.50297","Latitude":"39.109708","Viewing Distance":"101-500 Feet","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around March 4th 1999"],"Object Flight Path":"Path with directional change","Log Number":"US-09022009-0007","Region":"Ohio","Tags":"City","Date Submitted":"09/02/2009 07:50 UTC","divs":["Sighting Detailstwo friends and I went to the parking lot to have a smoke break. it was about 400 am in the morning as we worked night shift. A front was coming in and it was windy, low clouds moving briskly and cold. as we stood there smoking our cigaretts, i happed to look past my friends as i saw something moving in the area over the rail yards behind our docks. at the time it looded to me as a giant foil pillow ballow that you buy, but it was at least 25 feet in diameter. it was about 600 ft above the lights of the railroad yard, and it was moving in a erratic slow pace as it was fighing the windy conditions. but then it stopped short of the post office parking lot,changed directions and moved south toward the union terminal. we watched as it moved toward the terminal, it then stopped directly behind the terminal, as it started to ascend straight up and through the low flying clouds . we lost sight of it as it entered the clouds, but then the clouds lite up as if the object must have turned into a bright lite. at this point all we could see was a bright lite through the clouds. It then reversed direction and traveled directly into the oncoming wind, we watched the illuminated light travel mybe three quarters of a mile back against the wind, it stopped and then started moving directly towards us. we then got scared and started walking briskly back to the steps of the loading dock. as we hit the loading dock steps we stopped and looked up at the approaching light, it was almost straight overhead, i could make a visual sighting of a outline of the lighted object and i noticed that there were three small red lights on the bottom as it passed overhead. scared and shaken i mumbled to my friend (what the hell was that} as we walked onto the dock he said back to me {You know what it was}. we told a few friend was we saw, but i didn't say to much to anybody i did't know to well."],"Summary":"Spotted bright metallic object over railroad yard behind post office truck terminal.","Sighting Duration":"Undisclosed","Weather Factors":"Windy","Object Shape":"Oval","Disposition":"Unknown","Case Number":"19036","map":"<A HREF = \"http://maps.google.com/maps?q=39.109708,+-84.50297(19036)&iwloc=A&hl=en\"> mufon case (19036) map </A>","Country":"United States","Date of the Event":"03/04/1999 04:00 UTC","City":"Cincinnati","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/19036.html.txt","/var/www/straped/mufon/org/19036.html"]}