{"Latitude":"49.266166","Object Flight Path":"Stationary","Log Number":"CA-09022009-0011","Disposition":"Unresolved","Summary":"Moon looking disk seen over Vancouver (south) BC Canada with blood orange color","Source":"MUFON","Date of the Event":"08/31/2009 01:30 UTC","Viewing Distance":"Over One Mile","Longitude":"-123.109347","Object Shape":"Circle, Disc","files":["/var/www/straped/mufon/html2text/19040.html.txt","/var/www/straped/mufon/more/19040_submitter_file1__01-09-09_UFO_sighting.jpg","/var/www/straped/mufon/org/19040.html"],"City":"Vancouver","Region":"British Columbia","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around August 31st 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","divs":["sighting details1:30 a.m: i was about to take my dog for a walk when i noticed what i thought was a very large moon with a deep orange\\red color, and a very sharp edge. it was hanging just above the roof line of the homes on 16th street(south of where i was standing). it reminded me of a beautiful moon i had seen some years ago and i rushed to get to a clearing so i could get a better look at it.when i tried to spot it again after 5 minutes it was no longer there. there was scattered cloud so i figured it was behind the clouds and no longer visible. but, just to make sure i returned to the same exact spot after walking the dog. still no 'moon'. the next night i went out at exactly the same time just to make sure. the moon was out, but not perfectly full, nor in the spot i had seen the orange disk. i took a night picture from were i was standing the night before at 1:30 on the 1st of september. it shows the moon where it should have been on the 31st of august, and where i saw the disk. the disk was at an elevation of 60 degrees from where i was standing and the size of a quarter with my arm stretched out at my fingertips. i was facing south."],"Country":"Canada","Date Submitted":"09/02/2009 02:26 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"19040","map":"<A HREF = \"http://maps.google.com/maps?q=49.266166,+-123.109347(19040)&iwloc=A&hl=en\"> mufon case (19040) map </A>"}