{"City":"Port Charlotte","map":"<A HREF = \"http://maps.google.com/maps?q=26.982241,+-82.086955(19047)&iwloc=A&hl=en\"> mufon case (19047) map </A>","Longitude":"-82.086955","Region":"Florida","Source":"MUFON","Date Submitted":"09/02/2009 10:02 UTC","Date of the Event":"09/02/2009 09:10 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Object Shape":"Diamond","Viewing Distance":"101-500 Feet","Object Features":"Patterned Surface","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19047.html.txt","/var/www/straped/mufon/more/19047_submitter_file1__UFO9-22.jpg","/var/www/straped/mufon/org/19047.html"],"Country":"United States","trends":["There have been 11 other sightings in Port Charlotte","There were no other sightings in Port Charlotte on or around September 2nd 2009","This sighting has never been favorited.",""],"Case Number":"19047","Summary":"Witnessed elongated diamond-shaped object, Appeared to be glowing red on the bottom, with three strong lights in the middle making a broken circle.","Log Number":"US-09022009-0018","Latitude":"26.982241","Weather Factors":"None","divs":["Sighting DetailsAs I was driving home, North on Coliseum Blvd, I noticed an object which appeared to be an elongated diamond-shaped box, fairly thick and long. The object was ahead of me, over my road, heading North West. 2 cars sped by, who appeared to be others chasing the item. (A white SUV and a yellow sports car) I followed, driving through the neighborhood. I quickly lost sight, but continued following the other cars, and saw it again, this time headed South West. I separated from the other cars (there were 3 by this point, a maroon SUV joined us at some point) and took what I thought was a quicker route, and soon came to a dead end against a canal, to see the object go beyond the trees to the south west. I then headed home, and once I was out of my car in my driveway, I saw a helicopter flying the same path as the object had originally been flying, and then abruptly turned in the south west direction after it had gone further out. (see attachment) When I first saw the object, I didn't know what to think, I just remembered wondering why a plane or a helicopter was so bright. I immediately realized it was moving far too slow for a plane, and with such a quiet neighborhood, I would have expected to hear something. Seeing the other cars chasing it from what seemed to be the direction the object was coming from made me really take a closer look, and noticed the odd glowing bottom which I had at first dismissed as a trick of the light on my windshield or a low cloud. Upon looking at it, there seemed to be lines all over the object, like sharp grooves along the surface, and the bright glowing red center which were three thick arch-shaped points of light that together formed a circle which had gaps between them, appearing almost like supports between each piece. It was the shape of a diamond, but its thickness was probably a sixth of the length, which struck me as oddly thick. There were only very few clouds very high up, far above the constant height of the object. Other than being shaken by what I saw, no other physical symptoms were noticed."]}