{"Source":"MUFON","Country":"United States","Longitude":"-112.177227","divs":["Sighting DetailsI don't think it was a UFO. I think it might have been a meteor, but just want to be certain. I called an organization that I believe was Ground Saucer Watch at the time. They suggested a meteor had split at the time and that's like what it was. I was driving to work before sun-up. Driving north on 59th Ave, north of Camelback Rd and before I reached Montebello Ave. I saw a giant green ball with a broken red tail. The ball seemed to be as big as a beach ball at arm's length. It was low in the sky, traveling horizontally. It was not spinning and it maintained its circular shape without losing size as it moved across my frontshield. I didn't have to bend my head to see it. There were no flames or anything like that coming from the green ball. As it reached moved across the road, it was low enough in sky that it disappeared behind some large trees on west side of road. I remember thinking I would see it once it cleared the trees, but it never cleared the trees as I never saw it again. It puzzled me because it didn't diminish in size through the duration. I want to say my car was less than half a mile from the trees when I first noticed the ball. The one thing that stands out is it never diminished in size as it moved across my windshield, which perhaps took about 10-15 seconds. It wasn't moving downward. It was horizontal and remained that way until I lost sight. I don't recall thinking what it might be. Just was amazed at the sight. I'm just hoping someone could tell me that, yes, it does sound like the description of a meteor."],"Date Submitted":"09/03/2009 06:21 UTC","Summary":"Giant green ball with red broken tail","Tags":"City","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19056.html.txt","/var/www/straped/mufon/org/19056.html"],"Latitude":"33.542802","map":"<A HREF = \"http://maps.google.com/maps?q=33.542802,+-112.177227(19056)&iwloc=A&hl=en\"> mufon case (19056) map </A>","Object Flight Path":"Straight-line path","City":"Glendale","Log Number":"US-09032009-0008","Sighting Duration":"Undisclosed","Object Shape":"Circle, Oval","trends":["There have been 52 other sightings in Glendale","There were no other sightings in Glendale on or around October 31st 1977"],"Weather Factors":"None","Region":"Arizona","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"10/31/1977 05:00 UTC","Object Features":"None","Case Number":"19056"}