{"Weather Factors":"None","Case Number":"19052","Date Submitted":"09/03/2009 05:59 UTC","Object Flight Path":"Path then hovering","Source":"MUFON","Latitude":"34.235857","Tags":"City","Date of the Event":"09/02/2007 10:30 UTC","Log Number":"US-09032009-0004","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Summary":"UFO on call","files":["/var/www/straped/mufon/html2text/19052.html.txt","/var/www/straped/mufon/org/19052.html"],"Sighting Duration":"Undisclosed","Object Features":"None","Region":"California","City":"Los Angeles","map":"<A HREF = \"http://maps.google.com/maps?q=34.235857,+-118.436225(19052)&iwloc=A&hl=en\"> mufon case (19052) map </A>","Object Shape":"Disc","divs":["Sighting DetailsOn Sept 3,2007 At 10:30PM I was outside having a cigarrette in my appartment building when I got a cellphone call from a friend. As I'm speaking to this friend, I first noticed a squiggle of light and thought my eyes played a gag on me. About 5 minutes later, I noticed a white balloon floating away and it suddenly stopped. I started telling the friend on the phone what I was seeing. The object looked as though it knew it was being watched and stayed within my view. Now it seemed like I gave it telekenetic messages. I thought blink and it did it. I thought move back and forth and it did. All the while I'm on the phone with the friend telling them what it was doing. I was so freaked out my heart was racing. Then once the phone call with my friend ended. It began to head east till it was gone. Like it had listened to my cellphone call through some sort of device on thier ship. I went outside the building, but did'nt see it. It looked like a flying CD walkman. Silver underneath and black on the top and flat. The next morning, my dad reported seeing a contrail that suddenly ended with a tiny flash."],"trends":["There have been 404 other sightings in Los Angeles","There were 2 other sightings in Los Angeles on or around September 2nd 2007"],"Longitude":"-118.436225","Country":"United States"}