{"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/19050.html.txt","/var/www/straped/mufon/org/19050.html"],"Case Number":"19050","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Latitude":"31.581827","City":"Albany","Date of the Event":"09/30/1999 02:15 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was up due to back pain and walked around the house to check to make sure doors were locked. When I went into the bedroom I noticed a bright light in the distance. The light a round ball made some very interesting navigational directional changes and then began to huver over a local base. I ran and got my sony digital canmer and shot footage of the incident. Iam an engineer by trade and have worked on jet aircraft, this was not easily explained. I filmed inside my home and then went outside and filmed from my back porch.... I never reported this to anyone other then my wife who I woke up and my son who was fourteen at the time. I was watching your shows on the history channel and thought this may be a good time to give you this evidence.....I firmly believe that there is life other then ours in the universe...Even when I was in the air force stationed in Arizona, a remote camping, hunting expediton with six or seven airman had abruptly ended when a large orb, a glowing orange and yellow light had descended =the time was about midnight, we became disorented and felt we had somehow lost time....we packed up and left the area..we felt as though we were hypnotized...Sone of the guys thought the beer we brought may have had an impact on us, but I only had two beers I was driving....when I transfer the image of the event over Albany, marine logistic base, which is thought to have some neuclear weapons, i will send it to you."],"Tags":"City","Disposition":"Insufficient Data","Longitude":"-84.148061","Log Number":"US-09032009-0002","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Albany","There were no other sightings in Albany on or around September 30th 1999"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.581827,+-84.148061(19050)&iwloc=A&hl=en\"> mufon case (19050) map </A>","Date Submitted":"09/03/2009 01:38 UTC","Summary":"Bright light hovering over Marine logistics base.","Weather Factors":"Unknown","Source":"MUFON","Country":"United States","Region":"Georgia"}