{"map":"<A HREF = \"http://maps.google.com/maps?q=34.054944,+-118.236565(19051)&iwloc=A&hl=en\"> mufon case (19051) map </A>","files":["/var/www/straped/mufon/html2text/19051.html.txt","/var/www/straped/mufon/org/19051.html"],"Weather Factors":"None, Does Not Apply","Longitude":"-118.236565","Source":"MUFON","Date Submitted":"09/03/2009 03:21 UTC","Log Number":"US-09032009-0003","Date of the Event":"08/14/2008 06:00 UTC","divs":["Sighting DetailsI live in South Central Los Angeles California. Every Morning, at 5 am, I would drive to Kenneth Hahn Park to do walking with Ben. It is six miles from our house and elevation 400 feet. A park about 300 acres with running track, fish lake, lots of trails and small walking tracks. It is between La Cienega Bl and La Brea Ave. By the time we are there, usually is about 5:20 am and we would start walking, jogging or warm up immediately. Ben is 67 years old but walks faster than me, I am 64 and walk a smaller loop than him. The loop I walk is about 150 yard, on one end facing the panaramic view of Los Angeles from San Gabriel Valley to Beverly Hills - many miles across. I would sit on the park bench enjoying the beautiful scenery. Few people come to this park at this hour, total no more than 3 or 4 people visible. On that particular morning (the day I don't remember anymore, the day I filled in is not correct, I filled in because needed to go forward, but the time of the day is correct)There was not a star in the sky. It was twilight time, the sun still way under horizon. I sat on the bench comfortably and looking up in the sky. I found one single star right on top of me. It is a star, it is bright and way up in the sky. I gazed at it for a while, and felt I am being watched and the same time, I noticed this star is weird. It was moving in a very small circle. I thought, may be my eyes are not good. I looked carefully, still circling. It was moving, not stationery. I deducted - it is not airpline, because airplane would not move like that. It was not a helicopter, it is too high and helicopter don't move in a circle for more than 5 minutes. I felt I was communicating with whatever being inside, but no particular idea. This time, another jogger walked by, I stopped him, and asked him to pay attention to this star. This jogger listened to me and politely said some nice words and continued jogging. In order to break the deak lock, I had a thinking that, If I walk away, showing no interest anymore, the being up there might have some reaction. So I stood up follow follow the track walk seven to eight steps and stopped. and slowly I walk back to the bench and looked up in the sky. The star disappeared. Nowhere to be found. So I extended my search area (there was no star anywhere on that morning). I found this star had moved 25 miles north East on top of San Gabriel Valley. I am an ethic Chinese. San Gabriel Valley have concentration of Chinese there. It still move in a circle. I did not know what else I could do. So I continue my execise. But this incident stayed on my mind ever since. To-day, I found this website, so I just report it like a good citizen should. The reason I take my time to report this, partly, I just watch UFO on history channel that some astronault reported found things they knew not a star but don't know what. I have the same experience."],"Object Features":"Unknown","City":"Los Angeles","Country":"United States","Tags":"City","Disposition":"IFO","Summary":"Unknown object seen in the morning sky","Object Flight Path":"Stationary,Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.054944","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Unknown","trends":["There have been 404 other sightings in Los Angeles","There was one other sighting in Los Angeles on or around August 14th 2008"],"Case Number":"19051","Region":"California"}