{"Object Shape":"Sphere","Weather Factors":"Unknown","Source":"MUFON","Disposition":"IFO","Date Submitted":"09/03/2009 09:25 UTC","Object Features":"Unknown","Latitude":"37.433173","Region":"Virginia","files":["/var/www/straped/mufon/html2text/19058.html.txt","/var/www/straped/mufon/org/19058.html"],"Summary":"huge white sphere exploding in Va. Beach","Country":"United States","Longitude":"-78.653434","Object Flight Path":"Straight-line path","trends":[],"Date of the Event":"03/30/2009 12:00 UTC","Case Number":"19058","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsI am wondering if there was any investigation of the event that took place in Virginia Beach March 30, 2009.There was a huge blue white sphere that exploded over my area which I reported the next day. Although it has been said that it was probably a meteorite, I can tell you that no professional astronomer I am aware of has said that, for a matter of fact there has been no explanation at all. I witnessed the entire event and I am wondering how it is possible to have such an explosion of something so big and so hot that was seen in four states leave no evidence including the obvious tidal conditions had it hit the ocean. I never thought I was seeing a meteor, I guess I would expect it to be smaller and fit the meteor description. This thing flew past my neighborhood horizontally and then exploded. I reside in the largest military installation in the world we have several navy bases clustered together, marines, army ,coast guard, Langley air force base and Nasa research center Langley, and you can bet we are crawling with homeland security so I wonder how is it this huge sphere zooms into the center of all these bases and explodes and their is no photos or video (except for a security video from a local business) and no investigation or explanation has come about.I am no conspiracy theorist, I really could care less but this is strikingly strange, the whole thing from the explosion to the lack of information, to the jets and helicopters that combed the area for weeks.I don't know.... maybe a piece of space junk fell and caught a weather balloon, hit some swamp gas then blew up a Chinese lantern ."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.433173,+-78.653434(19058)&iwloc=A&hl=en\"> mufon case (19058) map </A>","Viewing Distance":"101-500 Feet","City":"Undisclosed","Log Number":"US-09032009-0010"}