{"Date Submitted":"09/03/2009 10:49 UTC","Country":"United States","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=57.79,+-152.407222(19060)&iwloc=A&hl=en\"> mufon case (19060) map </A>","Longitude":"-152.407222","Case Number":"19060","Object Shape":"Egg, Oval, Sphere, Other","Date of the Event":"02/17/1966 12:00 UTC","Tags":"City","Object Features":"Other","files":["/var/www/straped/mufon/html2text/19060.html.txt","/var/www/straped/mufon/org/19060.html"],"Weather Factors":"Unknown","Latitude":"57.79","Log Number":"US-09032009-0012","Summary":"Elmendorff AFB, several over large area, cluster-like.","Viewing Distance":"Over One Mile","Source":"MUFON","divs":["sighting detailshave entered report before. times and dates questionable or may vary. only eafb knows for sure. good luck trying to concur any info. four on our watch. el. afb teletypes ring off with bogey accounts of cluster-like object that deployed or changed shape or ?. rec. msgs for hours and hours of stat and posi reports. others joined us on our watch shortley (about) one hr.(never happens) into reports and relieved us of our duty w\\afb teletype monitor, so we were freed up to handle routine traffic from various white alice sources, hono, japan, and lower 48. were advised of our mission as personnel pertaining to all details of security clearances and some,zip-lip crap from some leiutentant with bad breath, so we never discussed any of it. i for one never even wrote home about it and frankly zobbed the whole idea. i liked to bivouac on my 72's and witnessed a light, blueish hazy oval shaped object over buskin lake some months later at dusk. watched it, no noise etc. and just laid down in a wrapped poncho and went to sleep. didn't report it. who to? military authorities? i just can't understand how \"authority\" goes day to day with whatever knowledge \"they\" have about this stuff in an aloof, unattached fashion until the rubber meets the road. at this point, any attempts to mention this to family or anyone at any point is met with harsh contempt because i waited so long to say anything. who am i? clark kent? thanks for the memories. wanna hear about missing time? x-file stuff? about five or six years ago, i started getting little mental snippets of being somewhere not my home in 1953? \\\\ portland oregon in a dark place sitting closely too an extremely beautiful blonde lady who was more comforting than anyone i have experienced. across from us in the dark haze was a military guy in khakis just sitting silently. these are the earliest memories i have in my life, oh yeah, something went up my nose, i could \"hear\" twisting and grinding and pressure but no pain. i am sure that the blonde lady was there to comfort me. there was no panic or trauma and certainly no memory of it until the above mentioned time. why the hell would i remember things like that? you're in the business; be my guest."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"Kodiak","trends":["There has been one other sighting in Kodiak","There were no other sightings in Kodiak on or around February 17th 1966"],"Disposition":"Unknown","Region":"Alaska"}