{"divs":["Sighting DetailsI met a co-worker at a nearby Irish bar not far from where we work in downtown Seattle. We sat outside as it was a warm and sunny summer day. I had only 2 or 3 drinks from my beer when I sat back into my chair to relax and take in the nice afternoon. I looked up at the blue sky and surrounding buildings, one of which is a still in construction 40 story high rise condo development only one block east of where we were sitting, when I noticed a white object to the left (north) of the new building. What caught my attention was that it was not moving, stationary. For a moment, I thought it was something attached to the building, like a string of balloons perhaps. However, upon further observation, I realized it was not a string of balloons, but something else entirely. It was an object triangular in shape, white, and upon further observation, moving slowly to the south. I pointed out the object to my friend asking \"what is that\"? We both observed the object as it slowly moved south, becoming hidden behind the new building. I need to add the fact that the object also seemed to change shape from what we originally observed as triangular. It seemed to \"morph\" into a nondescript shape; maybe roundish, oval or kind of circular, then back to triangular, then back to whatever shape and so on. It also seemed to have a strange and very faint, fuzzy \"filter\", so to speak, surrounding the object which made it all the more difficult to discern the shape(s) of. Both my friend and I commented about this observation. It was as if it, the \"filter\", was meant to obscure, or blur ones vision, and that is what it felt like too, oddly enough. The height of the building is 40 stories in total, and the object appeared to be at an altitude of perhaps 15 to 20 stories up and approximately only 3 to 5 blocks behind (to the east) of the building. Two other patrons were outside as well and we pointed out the object to them when one of them stated \"that's something you don't see everyday in Seattle\", and that was about it for their interest in the object. However, my friend and I were very intrigued by this point, and lamented for not having binoculars handy. At any rate, the object moved slowly from view behind the building. We sat back down, continued on our beers all the while looking for when the object would reappear from behind the right (south) side of the building. 5 maybe 10 minutes went by when I noticed the object was now above the building, and still exhibiting the same strange shape morphology. The object now seemed to travel on a very slow south-west direction toward the Puget Sound. It also appeared to slowly gain altitude as well. In fact, the object remained on this direction and altitude gain until we could no longer see it. The total observation time was approximately 20 minutes. The objects' size is difficult to discern;I'd say maybe the size of a compact car."],"Sighting Duration":"00:30:00","Log Number":"US-09042009-0007","files":["/var/www/straped/mufon/html2text/19069.html.txt","/var/www/straped/mufon/org/19069.html"],"Disposition":"Insufficient Data","Date of the Event":"08/31/2009 03:30 UTC","Country":"United States","City":"Washington","Date Submitted":"09/04/2009 01:13 UTC","Region":"Washington","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around August 31st 2009"],"Longitude":"-77.034536","Weather Factors":"Unknown","Summary":"Daylight UFO sighting from downtown Seattle.","Case Number":"19069","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"38.899122","Source":"MUFON","Tags":"City","Object Shape":"Triangle, Other","map":"<A HREF = \"http://maps.google.com/maps?q=38.899122,+-77.034536(19069)&iwloc=A&hl=en\"> mufon case (19069) map </A>","Object Features":"Unknown"}