{"Sighting Duration":"Undisclosed","trends":["There have been 17 other sightings in Sydney","There were no other sightings in Sydney on or around August 15th 1970"],"divs":["Sighting Detailsin 1964 i was working as a fitter and turner at a mining repair work shop, late in the afternoon i was asked to help a mate we had to go to the next building .as we went out side i noticed something in the sky the sun was reflecting off it, it was a large cigar ufo, I called the men in the workshop out and aprox 30 men saw this craft.this craft was motionless in the sky, we watched for aprox 5min and then one end raised about 15 deg and it sped off at a huge speed from the size in the sky about a meter to a speck in a micro second. everyons jaw dropped.this was the first cigar ufo that i have wittnessed but not the last. when i was about 12yrs old i was in the boy scouts my dad was the scout master, one night my dog was barking like i had never heard before, my dad came into my room and got hold of my scouts wooden staff i had behind my door and went out side as he thought there was an intruder in our yard. next thing was my dad calling me outside i went outside it was about 1am in the morning and a still clear night. my dog had its paws on the front gate barking at the sky my dad said look graeme a ufo, there was a large yellow glowing disc hovering over our home, slowly it moved away to the east and dissapeared. my dad told me not to say anything as people would think i was mad.In 1969 i had built a new home south of Sydney, over looking the ocean. as i was putting the milk bottles out that night i wittnessed a cigar ufo very low and close to where i lived i called my wife out and she also saw it. only about200ft above the sea travelling north towards sydney at only 40mph (aprox)no noise.I told my engineer at work Arthur . he told me to keep an eye out, maby you will see more.Arthur told me what happened in the north sea during ww2 he was on a destroyer that a large disc had hit all the radar and radio anteners every one ran to deck to see this large disc mooving away So i kept a watch from 1969 to 1971 i wittnessed dozens and dozens of orange glowing discs all travelling the same way and on certain nights they would land at a remote spot in a bassalt quarry.on one occassion there was seven discs three landed and the others hovered above them. with the naked eye they glowed yellow to orange but through bonoculars it became a heat spectrum the faster the disc moved the hotter the heat spectrum (towards the blue end)when they hovered the glow would go out. three yrs running i wittnessed a huge mother ship probably 10 to 15 miles to the east of me over the sea,this craft always came in the same month september. these discs i have mentioned aprox 70 ft in dia would come out of the top of this mother craft,about three quarters along from the frontI counted at least80 discs come out of her and travel in file to land where they hovered above homes when a area was done they moved to another and so on. I could tell more if you are interested. I was threatened in 1971 and 1997 not to talk to anyone. I have had some trouble all ready so dont give my email adress etc to anyone.ps when i first started to wittness these events i would phone the naval base I was told on one occassion yes we have them on the radar but what can we do.my brother was in the navy he suvived the voyager sinking when the aircraft carrier run them down in 1964, the h.m.a.s melbourn. i was on leave from the air force that fatefull day.my brother has told me that even in 1964 they had a eletronic unit that could discriminate earth craft and et craft flick a switch and the ufos would go off the screen. regards."],"Disposition":"Unresolved","Source":"MUFON","Object Flight Path":"Undisclosed","City":"Sydney","Case Number":"19066","Latitude":"-33.868841","Region":"New South Wales","Longitude":"151.20796","Weather Factors":"Unknown","Log Number":"AU-09042009-0004","Object Shape":"Cigar, Disc","map":"<A HREF = \"http://maps.google.com/maps?q=-33.868841,+151.20796(19066)&iwloc=A&hl=en\"> mufon case (19066) map </A>","Date of the Event":"08/15/1970 12:00 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19066.html.txt","/var/www/straped/mufon/org/19066.html"],"Country":"Australia","Summary":"for three yrs i watched discs landing, on three occassions i wittnessed at least 80 to 90 discs comming out of a huge mother craft cigar shapped, through my telescope i could see that this mother ship hadsix to eight floors aprox 50 lights shon through th","Tags":"City","Date Submitted":"09/04/2009 08:55 UTC"}