{"Disposition":"Insufficient Data","Object Features":"Undisclosed","Object Flight Path":"Other","Weather Factors":"Unknown","Longitude":"-85.595764","City":"Undisclosed","Log Number":"US-09042009-0003","divs":["Sighting Detailsi was laying in bed after takeing a shower. i had just got home from work. i was watching TV when i heard a loud jet like noise outside of the window< which seemed to last longer than a single jet equipped aircraft flying by normally would sound. it caused me to look out the window and in the direction i saw 2 aircrafts high in the sky, and off to the right above a tree i could see off in the distance a twinkleing light which i had neer seen there before in that position. i opened my window and watched it very carefully and with my naked eye i could see that it was changeing colors. i watched the other 2 aircrafts to see where they were headed but the were out of sight. i quickly ran to the other room which was closer cause it was on that corner of the house and opened the window and watched it for a few minutes about 4. i realized i should grab my mothers 10 mega pixel camera and take pictures with all different kinds of setting and take a movie of what i was seeing. i ran in her room, grabbed the camera and headed back and could still see the object in the sky.i began shooting picture after pictture, movie after movie. i could see clearly in the picture the many different colors. i tried to capture pictures of the constelation orion that was higher in the sky, but being as bright as they were to the naked eye, they were not as easy to capture on camera as the object, or UFO. i returned to my room to look at it through my window again after about 15 mins. of watching it in the other room from a different angle, and by the time i came back the UFO had moved higher and further in the sky, but not by too much from my point of view.i called the police and asked if they had heard of any object in the sky in the southeastern direction and the lady sad no, not that she knew of. i came back upstairs from looking at in from my driveway and contacted MUFON. while notifying them, and glanced back out the window about 25 mins. later and the object was still there changeing colors in the sky, moveing in the same direction very slowly, further now, but still changeing obvious random colors of the rainbow."],"Tags":"City","Region":"Michigan","Date of the Event":"09/04/2009 05:24 UTC","Source":"MUFON","Country":"United States","Object Shape":"Star-like","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19065.html.txt","/var/www/straped/mufon/org/19065.html"],"trends":[],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.323014,+-85.595764(19065)&iwloc=A&hl=en\"> mufon case (19065) map </A>","Latitude":"44.323014","Date Submitted":"09/04/2009 06:24 UTC","Case Number":"19065","Summary":"small light in sky, brighter than a star, changeing random colors of the rainbow. moving very slowly"}