{"Date Submitted":"09/05/2009 02:25 UTC","Country":"United States","trends":["There have been 173 other sightings in Houston","There were 2 other sightings in Houston on or around March 2nd 2009"],"Object Features":"Undisclosed","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/19079.html.txt","/var/www/straped/mufon/org/19079.html"],"Summary":"Numerous Abductions","Longitude":"-95.36776","Latitude":"29.767253","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Tags":"City","Region":"Texas","Log Number":"US-09052009-0004","Disposition":"Unknown","Source":"MUFON","Date of the Event":"03/02/2009 12:00 UTC","Object Flight Path":"Other","Weather Factors":"Unknown","divs":["Sighting Details The events involve many abductions over a 3 year period. I have never seen a UFO per say, and I believe this is intentional. Why? I can only guess the reason is they don't want me to categorize them. There are many accounts of ships and how they are associated with various species. My only conclusion is they want to hide their origins or if you like the faction they belong to. The first abduction I recall was vague, and at first I believed it was merely a dream. I would like to mention that over the years I have never been able to recall my dreams very well, and if I do the memory of them fades quickly. These however are vivid, and the memory of them persist years later. The first abduction I recall I was sitting at a round table with other people surrounding it. An adult male in his 40s asked me if I would join them. I replied 'join what, what is it you want me to join?' He more or less broke it down and described them as a group of decision makers. From his description the impression I got was that they were a think tank. When I asked if they were a think tank he laughed and said 'sort of'. He then ask a few people at the table to describe to me what their responsibilities were. He asked a very young look girl sitting on his left to describe her \"job\". It consisted of making sure that people were happy and had fun things to do that made them happy. I suppose someone in charge of moral. I replied that I liked that, and it seemed to please her a great deal. He then ask another woman sitting three chairs to his left to describe her responsibility. It consisted of something like an efficiency officer. She more less described something like insuring maximum productivity at all costs. Now I use that description, because it is hard for me to describe exactly what it is she does. My visceral reaction to what she said, was 'that is fascist!' This seemed to anger her, and she acted a bit put out. There is more to the abduction and borders on the fantastic, but what I did account more or less covers the event. Another abduction involved me waking up with 2 beings standing over me on either side. The one on my left looked to the other one and asked 'is he waking up?' All I saw were vague shapes, with a sort of halo effect around their heads. Like intense lighting from above. I was laying on my back, and didn't appear to be strapped down or anything. I went back to sleep at that moment. This is the moment that permeated every incident after that. I realized I was not asleep and from a subconscious to a conscience level I realization that I was awake and not alone. In the back of my mind I conceptualized how I should react. 'How I should react to someone doing something to me without my permission?' My reaction was to choke the person on my right. I reached up and made contact with someone's chest. I was surprised and preceded to feel this person next to me. It felt artificial and yet organic at the same time. To try and articulate what I felt it was like pot marks. These were not crude pot marks like scaring, it was more like organized pores. The person did not stop me or even flinch. I felt enough to realize whoever it was was humanoid and then proceeded to try and choke them. The throat felt like there was nothing underneath, just some sort of skin covering a void. After that I fell back asleep. The next abduction involved me waking up to a man asking me questions. I am going to omit the questions simply because they are frightening and I don't think they will be understood. Needless to say I reacted obstinately. If you knew me you would understand. I replied angrily that they should be doing something a different way. And all he replied was if they could do it the way I described, that they wouldn't need to do the other. So I said 'don't you think that is what you need to be working towards?' A large person sitting on my right kind of looked back at me worried. From what I gathered he was an abductee as well. *To note, during these abductions my vision was obscured. By that I mean blurred. Not to the point of totally blurring my vision, just enough to make it hard to make out detailed features. Although I don't recall specific events about my dreams, I never experienced something like this. There were many abductions after these and at one point I held conversations with one in particular. They told me things, some I believe to be true and others I am not so sure about. They played on my assumptions and clearly saw me as inferior. Now that is not to say they didn't like me, I got the feeling they saw me as cute. I appears that their 'attachment' to humanity seems to run deeper than superficial. A few of the things they told me? Well, they claimed their species is 30 billion years old. When I replied in astonishment that our current universal expansion was only 15 billion years old they laughed and said 'we know'. They said that they are very similar to us socially... love, family, culture, even crime. Needless to say I was floored. I am not the only person to have been abducted and experienced something like this. I am not special, I am just one of millions on earth who have been contacted. There are others on earth who have had the same thing happen to them, and are afraid to repeat it. Although some are not and have bravely come forward and recounted their experience. I applaud these brave people. The aliens clearly asked me not to mention this to anyone, and in reality I haven't recalled even a quarter of my experience. Whether they were concerned about how I would be perceived by my peers or merely didn't want their existence to be known, I am not sure. I suspect it is the later. They want to keep their presence hidden, that much is clear. And when I told them I wouldn't keep my mouth shut about it, they didn't seem surprised. I told them if they really didn't want me to say anything they might as well kill me now. Needless to say I am still here and do not fear them. I saw six different species and interacted with four of them. Now I know our universe is more diverse and wonderful than we ever imagined. I do not expect people to believe me. It doesn't matter, I know in my heart and mind that what I experienced was real and I will never forget it."],"City":"Houston","map":"<A HREF = \"http://maps.google.com/maps?q=29.767253,+-95.36776(19079)&iwloc=A&hl=en\"> mufon case (19079) map </A>","Case Number":"19079"}