{"files":["/var/www/straped/mufon/html2text/19075.html.txt","/var/www/straped/mufon/org/19075.html"],"Summary":"bright; shaped more vertical than horizontal","City":"Eureka","Object Features":"None","Tags":"City","divs":["sighting detailsapprox 8:00 pm i'm at the computer looking out the front window. in the east s\\e sky i see what looks like a bright star. it was 45 to 50 degrees up from the horizon. you hardly ever see stars here in eureka, so i watched it for 15 minutes, and it was moving very slowly first a bit to the right, then a bit to the left, etc. i went outside to view it. it actually looked like two objects, one on top of the other. after 40 minutes it had slowly moved south behind a redwood tree, out of my sight. i tried to find a number for mufon, but was unsuccessful, so i called nuforc. the yo-yo i spoke with told me it was jupiter. now, i'm not an astronomer, but there's no way that was jupiter. jupiter doesn't move that fast, and even if it did, it doesn't go south, north, and south again. it wasn't an airplane, helicopter, blimp, or satellite, of that i'm positive. it was moving too slow to be anything i'm familiar with, but too fast to be a planet or star. i'll watch to see if it ever comes out from behind the tree, and if it does, i'll send in another report."],"Date of the Event":"09/04/2009 08:05 UTC","Latitude":"40.808531","Sighting Duration":"Undisclosed","Source":"MUFON","Case Number":"19075","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=40.808531,+-124.162003(19075)&iwloc=A&hl=en\"> mufon case (19075) map </A>","Country":"United States","Weather Factors":"Unknown","Viewing Distance":"Unknown","trends":["There have been 12 other sightings in Eureka","There were no other sightings in Eureka on or around September 4th 2009"],"Log Number":"US-09042009-0013","Date Submitted":"09/04/2009 11:57 UTC","Object Shape":"Star-like","Region":"California","Disposition":"IFO","Longitude":"-124.162003"}