{"Latitude":"43.322233","Country":"United States","Log Number":"US-09042009-0008","Weather Factors":"Unknown","trends":["There has been one other sighting in Wells","There were no other sightings in Wells on or around August 28th 2009"],"City":"Wells","Region":"Maine","divs":["sighting detailstwo of us were driving north on the maine turnpike near wells when we witnessed a strange sighting of lights. we came over a rise and could see a singular bright light, rather large, hanging low in the sky to left of the highway's south bound lane (due west). as we approached we could see it was not moving but hovering a good 700-1000 ft (estimate) in the air. as we came upon it we could hear no noise of a helicopter since all the windows\\sunroof were open and we slowed a bit to look at the light. as we began to pass by the lights we could clearly see three red lights forming a visual isosceles triangular shape with the bright white light in the middle with an erratic set of smaller lights flashing on one \"side\" in white. the lights themselves had an odd way of being bright yet not illuminating the hull of whatever it was attached to - hard to explain. i really couldn't tell if other cars could see it but it would have been nearly impossible to miss. our return trip home during the day proved there were no radio tower lights in the area. interestingly we saw another set of lights very similar but much lower to the ground on near the hampton, nh tolls last year in august. the array of lights were also triangular and much more craft revealing (dark greyish) being a scant 500ft off the ground (estimate). many more lights were seen on this sighting attached to the craft. again, no radio tower nearby. both accounts have been also reported at nuforc. as a side, i am also the deputy news editor at the anomalist (website) so i am very familiar with the \"black triangle\" phenomena seen by thousands of people."],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=43.322233,+-70.580521(19070)&iwloc=A&hl=en\"> mufon case (19070) map </A>","Disposition":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Longitude":"-70.580521","Summary":"Large triangular lights, low to ground, off of Maine Turnpike.","files":["/var/www/straped/mufon/html2text/19070.html.txt","/var/www/straped/mufon/org/19070.html"],"Date Submitted":"09/04/2009 02:45 UTC","Tags":"City","Date of the Event":"08/28/2009 08:05 UTC","Viewing Distance":"501 Feet - 1 Mile","Case Number":"19070","Object Shape":"Triangle"}