{"map":"<A HREF = \"http://maps.google.com/maps?q=40.932517,+-74.510047(19073)&iwloc=A&hl=en\"> mufon case (19073) map </A>","Summary":"I can only ask you to look at the pictures I have enclosed.","Object Shape":"Bullet, Missile, Fireball, Sphere, Star-like, Teardrop","Disposition":"IFO","Object Flight Path":"Undisclosed","Case Number":"19073","Date Submitted":"09/04/2009 09:35 UTC","Region":"New York","Weather Factors":"Unknown","Date of the Event":"09/18/2003 12:00 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was watching T.V. one night on Sep. 18, 2003. Frist let me explain that I live in Rockaway, where planes fy over my area day and night but on this night there where no planes. I wondered why there won't any noise from the planes. I went and stood on my balcony and saw a large what look like the sun but it was a ball that seemed to falling into the water at the beach and on the right side there seem to be the moon. I ran back into the apt to get my camara. If you enlarge some 0f the pictures you will see something that looks like tear drops and something that looks like it flying across the sky. I put the pictures on a CD. I also send them to my sister and brother. My sister was afraid and told me to destory the pictures but I needed answers so I kept the CD. My brother was shocked at the pictures but he was at a lost for words. I even emailed the newpaper out here called the Wave but no one ever contacted me. I was afraid so I took as many pictures as I could and I ran back into the house and called my sister and brother. I also notice that on some of my pictures the time and dates are wrong."],"Source":"MUFON","Longitude":"-74.510047","City":"Rockaway Township","Log Number":"US-09042009-0011","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/19073.html.txt","/var/www/straped/mufon/org/19073.html"],"Country":"United States","Viewing Distance":"Unknown","Latitude":"40.932517","Tags":"City","trends":["There have been no other sightings in Rockaway Township","This sighting has never been favorited."]}