{"trends":["There have been 2 other sightings in Pinole","There were no other sightings in Pinole on or around September 4th 2009"],"Latitude":"38.004367","Source":"MUFON","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.004367,+-122.298859(19077)&iwloc=A&hl=en\"> mufon case (19077) map </A>","Sighting Duration":"00:00:30","Object Flight Path":"Straight-line path","City":"Pinole","Summary":"Super bright pulsating UFO seen on I-80W","Object Shape":"Square, Rectagular, Unknown","files":["/var/www/straped/mufon/html2text/19077.html.txt","/var/www/straped/mufon/org/19077.html"],"Tags":"City","Viewing Distance":"Unknown","Longitude":"-122.298859","Object Features":"Unknown","Date Submitted":"09/05/2009 01:32 UTC","Disposition":"IFO","Weather Factors":"None","Date of the Event":"09/04/2009 08:00 UTC","Case Number":"19077","Log Number":"US-09052009-0002","Country":"United States","divs":["Sighting DetailsIt was around 8pm when I was driving down I-80W towards Pinole when I noticed a bright glowing object heading northeast. From far away the blinking lights were similar to a jetliner except much brighter. However I noticed that the frequency of the blinking was much faster than a normal plane. At one point the object got close enough to see that the strobing white light was giving off an immense star-like glare effect. It was difficult to make out the shape of the object because it was getting dark, however the 4 lights on it indicate it was a rectangular shaped object, with the longer side moving forward. The four lights from left to right were white, red, white and red. The first white light was incredibly bright while the remaining three were much less so. Also, I'm not 100% sure but I think the white and red lights were alternating. I lost sight of the object as it flew past over Hercules. About 5 seconds after, I spotted a normal plane flying along the same path with normal navigation lights and the difference between the lightning was quite distinct. The placement of the lights on the object makes this seem very much like the wings on a plane. However, I only took particular notice of this because of just how bright the light was. Does anyone know what this may have been?"]}