{"Date Submitted":"09/05/2009 08:26 UTC","Longitude":"13.187507","Source":"MUFON","Sighting Duration":"00:02:00","Disposition":"Unresolved","Viewing Distance":"Unknown","Date of the Event":"09/01/1959 12:00 UTC","Log Number":"LY-09052009-0013","divs":["Sighting DetailsThis happened about 50 years ago and I'm reporting this just to get it off my chest. My event happened in the late summer, early fall of 1959, when I was in the Air Force stationed at Whellus AB, Libya, North Africa. I was an Airman Second Class, a Radio Intercept Operator with the 6938th Radio Squadron Mobile. I had no experience with aircraft identification but did see fighter jet aircraft from Europe which came down to use the gunnery range at Whellus. The only \"strange\" aircraft I saw was the British Vulcan, which we watched taking off almost straight up. Anyway, another airman and I were walking back to the barracks after watching a movie on our side of the base (We had our own outside and indoor theatre inside a metal roof building). I don't remember who he was but I wish I could. As we were walking back, a light flew over our heads and disappeared over the tree line. Total time was less than 15 seconds. We both thought we had just seen \"Sputnik\" or anothe satellite and commented as such. No sound! That was until the bright light came back over the tree line travelling right to left and disappeared over the horizon. That was a real suprise! When we returned to our barracks, we asked other airmen if they had seen anything. No. We called the Control Tower and asked if they had seen anything. No. One other \"strange\" thing is time. I don't know but someone said the time and we answered \"No, it can't be that late.\" Just an aside but it is something I remember. No idea how late is late and no idea what the time was. Thank you for listening. Raymond Tompkins"],"Case Number":"19088","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/19088.html.txt","/var/www/straped/mufon/org/19088.html"],"Region":"","Object Flight Path":"Straight-line path","Object Features":"None","City":"Tripoli","Weather Factors":"None","Summary":"LIghted object came over our heads and disappeared over tree line. Surprised us when it came back awhile later.","Country":"Libya","map":"<A HREF = \"http://maps.google.com/maps?q=32.876174,+13.187507(19088)&iwloc=A&hl=en\"> mufon case (19088) map </A>","trends":["There has been one other sighting in Tripoli","There were no other sightings in Tripoli on or around September 1st 1959"],"Latitude":"32.876174","Tags":"City"}