{"City":"Murrysville","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.431882,+-79.694515(19082)&iwloc=A&hl=en\"> mufon case (19082) map </A>","Summary":"Jeannette: Plasma Orb turns into Fake Plane \"UFOs & other shapes","Disposition":"IFO","Log Number":"US-09052009-0007","Viewing Distance":"Unknown","divs":["sighting detailsfor the previous two nights i witnessed and filmed over a dozen orange and\\or yellow orbs coming out of the woods in front of my valley. having seen them before flying over our house on may 13, 2009 and coming up from that same area on may 18, 2009, i kept watching that area. one after another came up from the woods, turned on what appears to be plane faa lights, then they speed up and fly off. some appear to start flashing only out of nowhere higher up from this area without the orb appearance first. knowing no one is believing this phenomenon is actually occurring, i looked on google maps to determine the best location of its origination. that area is a patch of woods and trees at the edge of a private community golf course in jeannette, pa, just past the murrysville line where i live. at dusk, i first took photographs of the area at 1600 iso with flash towards the area as i could see faint flashes. those pictures reveal multiple orbs, several of which are orange or yellow (didn't look at them till next day). i drove to the maintenance road by the golf course and could see pretty close an active plasma ball orb hovering above the golf course (and perhaps its pond--i never walked it to know for sure). started shooting... it moved to the right behind some trees. backed out of there and drove around to where the houses where to the highest point which was the job trailer (new community- not finished being built yet). saw from opposite angle and started filming (so you can't say it's a plane's approach lights). it did the usual transformation into a fake plane by starting blinking a colored light on each side of the big orb, which tones down into a headlight type appearance usually, then turns off to reveal what appears to be regular wing-tip navigation red\\green lights with flashing white strobes. as it flys over, the white strobes illuminate what, with the naked eyes, appears to be a tail. upon blow up of each still of those flashes, however, the \"tail\" is a structure that changes and transforms a little between each flash. this is not the first ufo i've filmed to do so, so i'm not surprised. nasa has photos from sts88 mission on their website labeled as \"space debris\" that changes the same (link to those pictures on my youtube channel page: seeingufospa) several of those crafts are identifiable to those i am video taping. the video is in hd and is viewed here: http:\\\\www.youtube.com\\watch?v=qgrz0vfvqiw here is a couple of stills--first two of the orb and its fake plane appearance (one of many) and the third is just one of the many i saw after that (over a dozen total). they only seem to be most active from monday night through thursday night--not much activity usually on weekends, but i suppose with the increase in sightings lately... that could change."],"trends":["There have been 31 other sightings in Murrysville","There were no other sightings in Murrysville on or around September 3rd 2009","This sighting has never been favorited.",""],"Source":"MUFON","Date Submitted":"09/05/2009 05:04 UTC","Region":"Pennsylvania","Object Features":"Undisclosed","Tags":"City","Case Number":"19082","Object Shape":"Sphere","Latitude":"40.431882","Country":"United States","Longitude":"-79.694515","files":["/var/www/straped/mufon/html2text/19082.html.txt","/var/www/straped/mufon/more/19082_submitter_file1__20090903203257plasmaball_20C.jpg","/var/www/straped/mufon/more/19082_submitter_file2__20090903204709PlasmaPart2-3_18C.jpg","/var/www/straped/mufon/more/19082_submitter_file3__20090903205729diamond_11C.jpg","/var/www/straped/mufon/org/19082.html"],"Date of the Event":"09/03/2009 12:00 UTC","Object Flight Path":"Undisclosed","Weather Factors":"Unknown"}