{"Object Flight Path":"Stationary,Unknown","Tags":"City","Date of the Event":"09/05/2009 04:45 UTC","Object Features":"Undisclosed","Object Shape":"Circle, Cylinder, Disc, Oval","files":["/var/www/straped/mufon/html2text/19089.html.txt","/var/www/straped/mufon/org/19089.html"],"Case Number":"19089","Country":"United States","Longitude":"-79.751831","Region":"Pennsylvania","City":"Tarentum","Latitude":"40.608056","Summary":"Circular UFO seen above Pittsburgh Mills, transparent then shiny via binocs.","Date Submitted":"09/05/2009 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.608056,+-79.751831(19089)&iwloc=A&hl=en\"> mufon case (19089) map </A>","Source":"MUFON","Weather Factors":"None","Log Number":"US-09052009-0014","trends":["There have been 2 other sightings in Tarentum","There were no other sightings in Tarentum on or around September 5th 2009"],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsI was sitting in the car, waiting on my family to return to the vehicle at the Pittsburgh mills mall.. facing the entrance on the movie side (probably SW in general direction). I had the sunroof of my car open.. I was just watching the clouds and happened to notice a dark circle, pea size in dimensions from the distance it was, maybe a little bigger. I figured the object to just be a balloon, but decided to take a closer look. Unfortunately i didnt have a high powered camera with me (zoom) or my camcorder, only an iphone, so i knew a photo wasnt going to work. I had my binoculars with me and sat in the car observing this object for about 20 minutes. Through the binoculars it appeared to be shiny at times, then go semi-transparent, then more cylindrical. I knew this wasnt a childs balloon at this point. I was able to observe it for a great while, even still seeing it with the naked eye. I am anxious to see if anyone else may have seen this or know what it might be... It could very well have just been a transparent weather balloon, perhaps the NWS would have data and trajectory on anything released on this day? If not a weather balloon then i am not sure. Based on angular size and the fact that the cloud deck was approximately 6500 feet.. the object was probably between 40 and 100 feet in size and guessing about 5000 feet high (not sure on the distance in front of me ground-wise, maybe the same).. This is all a guess, my college physics is a bit rusty."]}