{"Region":"Massachusetts","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.270563,+-71.800603(19080)&iwloc=A&hl=en\"> mufon case (19080) map </A>","Source":"MUFON","Country":"United States","City":"Worcester","Log Number":"US-09052009-0005","Tags":"City","Date of the Event":"09/05/2009 04:40 UTC","Object Shape":"Star-like","trends":["There have been 18 other sightings in Worcester","There were no other sightings in Worcester on or around September 5th 2009"],"divs":["Sighting Detailsi got home from mohegan sun at about 4:30 am and im pulling into my driveway. across the street from my house over the eastern horizon i saw 2 extremely bright lights like 20 times brighter than a normal star. i got out of my car and sat in my front yard watching them and i could see they were moving ever so slightly back and forth i thought i was seeing things and a few times the objects appeared to move closer to me getting much brighter. it was nuts at one point one the the object which seemed the closest to me the entire time got unbeleivably bright and looked like it was moving towards me pretty low in the sky and i actually got scared and got out of the chair i was sitting in and started walking towards my house. then a 3rd and forth similar looking bright light appeared in a different location. they were all almost sliding around the sky not really moving in a certain direction. every few minutes the lights would fade out then reappear even bighter than before. this is the 4th or 5th time ive seen something like this in the same location in the past 3 weeks. everytime ive seen these objects they get more dramatic, i was baffled thinking of someone i could call that late to go outside and check this out. i seriously want someone to set up a camera crew and videotape this footage in the next week or so its unbelievable. i live surrounded by farms in a real rural area and the whole event lasted till about 5:40 am right when the sun started to come up thats when the lights faded out. at that point i literally looked up to scan the sky and saw like 5 star like lights moving westerly in the sky above zig zagging. and another thing it was a partly cloudy night and these light were infront of the clouds they didnt block out the light which makes me think they were really close."],"Case Number":"19080","files":["/var/www/straped/mufon/html2text/19080.html.txt","/var/www/straped/mufon/org/19080.html"],"Longitude":"-71.800603","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"3-5 bright white lights appearing then dissapearing and moving in a controlled but erratic motion","Object Features":"Undisclosed","Latitude":"42.270563","Date Submitted":"09/05/2009 06:23 UTC","Object Flight Path":"Undisclosed"}