{"files":["/var/www/straped/mufon/html2text/19084.html.txt","/var/www/straped/mufon/org/19084.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.715363,+-74.004373(19084)&iwloc=A&hl=en\"> mufon case (19084) map </A>","Date Submitted":"09/05/2009 05:14 UTC","Weather Factors":"Unknown","Log Number":"US-09052009-0009","divs":["sighting detailsthese symbols and related symbols have been interperted since the brooksville incident,circa 1965. note attached picture and symbols; line one: hear pyramid planet understand\\though's\\thinking\\transmissions\\interpertations your transmissions\\communications? you three plants from ra i visit cross-over hear a little hear a lot (few hear and many hear) you i hear from a far ( we are far apart) line two: language barrier\\ questions the visit of our two planets questions the pyramid planets and peoples (many question's we each have) line three: you hear all a little and hear all visit i we cross-over (few hear message then many) the two planets question me i everyone from far away we hear the stars from the stars line four: we are similiar peoples\\visit our two planets i cross-over star's from a far, star peoples of the planet of the pyramids unknown everyone and i our two pyramid planets this is a partial interpertation of a partial message. being has no pretense, is hiding nothing, and has learned the language's, the histories and has passed the test and is probably the equivilent of a doctorate. note smile and symbol, is indication of said doctorate and voluntary. much has been said of these issues and contact and societies, apparently all are not worthy or invited. their's more some-where but i do not have the time, money or inclination to persue. i am quiet confident of the partial interpertation. i am mufon field investigator #1038,in the state of new york, i request you forward this cms case number to my e-mail address; ufoqanda@si.rr.com"],"Sighting Duration":"Undisclosed","Tags":"City","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Region":"New York","Summary":"Partial Interpertation of Symbols","City":"New York","Source":"MUFON","Disposition":"Hoax","Object Features":"Undisclosed","Case Number":"19084","Latitude":"40.715363","Object Shape":"Unknown","Longitude":"-74.004373","Object Flight Path":"Undisclosed","Date of the Event":"Unknown","Country":"United States"}