{"trends":["There have been no other sightings in Edom","This sighting has never been favorited."],"Case Number":"19081","Date Submitted":"09/05/2009 01:25 UTC","Tags":"City","Longitude":"-95.60885","Object Flight Path":"Stationary,Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19081.html.txt","/var/www/straped/mufon/more/19081_submitter_file1__MDGC0049.JPG","/var/www/straped/mufon/more/19081_submitter_file2__MDGC0055.JPG","/var/www/straped/mufon/more/19081_submitter_file3__MDGC0058.JPG","/var/www/straped/mufon/org/19081.html"],"Region":"Texas","City":"Edom","Disposition":"IFO","Log Number":"US-09052009-0006","Country":"United States","Summary":"Appears to be lit, cylinder about the size of a skinny bowlingpin","divs":["Sighting DetailsI have a wild game camera set up on some property that I hunt on. It is set to go off about every 12 minutes after 3 pictures have been taken. I have had this camera set up watching my feeder for about 3 months and the camera has taken over 1,000 pictures. When I checked out one set of pictures looking to see wild game I came across 9 pictures that appeared to have some sort of light that was in the air and it was there while a wild boar was around the feeder. The light never changed it's plane and didn't seem to bother the boar. The light started from right to left coming up an old path that comes from a creek. The first set of pictures shows the light coming from behind a branch, thus showing that it couldn't be on the front of the camera, also there are times when it is close to the camera and you can see a definite size difference by measuring the size of the object. The location of the camera is such that a hill is behind the deer feeder so that there is no way that a light source from a road or plane might be the cause. The first set of three pictures starts at 11:05 and ends at 11:05 the second set of three pictures starts at 11:17 and ends at 11:18 the third set of three pictures starts at 11:28 and ends at 11:29. When I first started to look at the pictures I almost deleted the pictures but then I noticed the light. I tried to figure out what the picture might be but I just couldn't explain what the light could be. After showing the picture to several people not one person could explain the lights. I have done a lot of research on the internet and have not been able to find anything that looks anything like this light. Th fact that the boar is around the entire time really puzzles me because they spook easily. The size of the light appears to be about the size of a bowling pin. Unfortunately I personally never see the light so I can give no personal testimony. I am going to attach 2 pictures with the light and one picture in daylight without for review."],"Object Features":"Undisclosed","Latitude":"32.372368","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Shape":"Teardrop","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=32.372368,+-95.60885(19081)&iwloc=A&hl=en\"> mufon case (19081) map </A>","Date of the Event":"12/01/2008 11:05 UTC"}