{"Object Features":"Undisclosed","divs":["Sighting DetailsMy husband and I went camping this past Saturday. Sunday morning,(August 30th) around 4:00, I woke up to go the the restroom. (There was a building near the campsites that provided restroom and shower facilities.) It was pitch black outside, except for the light from my lantern and the lights from the building. I went in, did my thing, and as I started to leave to walk back to my tent, I stopped because I felt there was someone behind me. I turned around and I saw three gray aliens standing in the woods behind the building, near another campsite on the hill in the back. They didn't seem to be doing anything but standing there. I thought it could have been the people from the campground on the hill, but why would they just be standing in the middle of the woods at 4am for no apparent reason? When one of them turned and looked at me, I realized they weren't human. For one thing, the arms were too long and the bodies were too thin. Their skin had a pale glossy look, and they had a very large cranium with lumps all over the top of the scalp. They had huge black eyes that seemed to pierce right through me. I stand 5'3\" tall, and they looked about one or two inches shorter than me. The one that saw me started to inch toward me, but I bolted back to my tent. When my husband asked me what was wrong, all I could say was \"There's (expletive) aliens back there!\"When he finally calmed me down enough, he had me stay in the tent while he went to go see what it was. He found nothing. I don't know if I had any missing time or not. It was around 5:00 when I was finally calm enough to leave the tent, with my husband, of course. We had a cigarette and talked about my sighting. Then around 6:00 we got a fire going and cooked breakfast. That's really all I remember from that morning. Later that night,(I'm not sure what time it was. We kept waking up off and on.) he said he saw a shadowy figure move outside. He didn't hear any footsteps. He looked up and saw the top cover on the tent move, as if someone pulled it aside to look in at us from above. When we woke up again later that night, the blankets on his side of the tent were wet. (It started raining that night.) My side was dry for the most part. I can't remember exactly which campsite we used, but I'm pretty sure it was lot #60. It was located directly across from the parking lot. I didn't see any signs of a craft nearby, but I did see the creatures. I know what I saw was real, as I was wide awake when I saw them."],"Region":"Georgia","Object Flight Path":"Undisclosed","Latitude":"34.708394","Weather Factors":"None","Object Shape":"Other","Summary":"Alien sighting in Unicoi State Park, GA.","City":"Helen","Disposition":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-09062009-0002","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19097.html.txt","/var/www/straped/mufon/org/19097.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.708394,+-83.729658(19097)&iwloc=A&hl=en\"> mufon case (19097) map </A>","Longitude":"-83.729658","trends":["There have been 3 other sightings in Helen","There were no other sightings in Helen on or around August 30th 2009"],"Tags":"City","Date Submitted":"09/06/2009 12:48 UTC","Country":"United States","Date of the Event":"08/30/2009 04:00 UTC","Case Number":"19097"}