{"Date Submitted":"09/05/2009 11:24 UTC","Tags":"City","Latitude":"39.524018","map":"<A HREF = \"http://maps.google.com/maps?q=39.524018,+-84.392796(19094)&iwloc=A&hl=en\"> mufon case (19094) map </A>","Source":"MUFON","Summary":"Typical V flight formation then scattering into mutiple objects and random colors","files":["/var/www/straped/mufon/html2text/19094.html.txt","/var/www/straped/mufon/org/19094.html"],"divs":["Sighting DetailsMe and the Driver of the Car were driving to a local store in our area and on route on the store i looked out the window of the passenger side and on a hill next to AK steel ( heading east at this time )on Roosevelt Blvd.I along with the driver which was my mom looked up toward the moon cause it was so big and noticed several lights in a strange formation they were in a v shape. My mom was complaining about the other cars around us cause they kept stopping in front of us and we finally figured out that they were watching the same thing that we were. It was strange so we decided to try and go in the direction of these lights to see if we could tell more about them then all of the sudden they all scattered in different directions then disappeared. Then all at once we saw airplanes coming in and circling around where we saw the other bright lights. After the airplanes were there the other bright lights were scattered out away from where the planes were circling. The bright lights that we saw were moving up and down and from place to place to quick to be a regular plane. And when we spotted the planes we could tell from the red and blue lights on them that were the real planes . we both couldn't believe that we were seeing this strange sight and we really wanted to find out what it is. We still can't figure it out that it was so bright and one minute there in one spot then a second later scattered. It was like \"wow, did you see that? \". We even came home and got my dad to go with us to try and see them . From the time we first spotted them it was just eerie and strange. Was it UFO or military?..."],"Disposition":"IFO","Log Number":"US-09052009-0019","trends":["There have been 13 other sightings in Middletown","There were no other sightings in Middletown on or around September 5th 2009"],"Weather Factors":"None","Viewing Distance":"Unknown","Case Number":"19094","Sighting Duration":"Undisclosed","City":"Middletown","Object Features":"Unknown","Object Shape":"Boomerang, Sphere, Unknown","Longitude":"-84.392796","Date of the Event":"09/05/2009 09:39 UTC","Region":"Ohio","Object Flight Path":"Hovering then path,Other","Country":"United States"}