{"Case Number":"19107","City":"Springboro","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.555072,+-84.224732(19107)&iwloc=A&hl=en\"> mufon case (19107) map </A>","Object Shape":"Circle, Fireball, Oval, Teardrop","Longitude":"-84.224732","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Sighting Duration":"00:03:00","Log Number":"US-09062009-0012","Date Submitted":"09/06/2009 08:21 UTC","Latitude":"39.555072","Region":"Ohio","Summary":"Saw what I thought was a meteor or bomb or something falling","Date of the Event":"09/05/2009 09:25 UTC","trends":["There have been 10 other sightings in Springboro","There was one other sighting in Springboro on or around September 5th 2009"],"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["sighting details i was on my way home from work last night (spet. 5th) and was coming south on interstate 75 when off to my left i noticed a large, teardrop-shaped object appearing to come slowly down out of the sky. it was reddish-orange in color. as i continued to watch, it split into two distinct parts, also reddish-orange in color and teardrop shaped, but soon after splitting, winked out- whether due to cloud cover or something else. however, perhaps less than 20 seconds later, i began to see lights winking on, one by one, almost as if they were splitting from one another. these were not reddish-orange, but were more the color of lights one would expect from a helicopter; that is to say they were bright and had a white-yellow color to them. these objects appeared to also be moving downward at a slow rate while also spreading out a bit. i watched as they descended toward a tree line (as this was just after i had exited the highway at the springboro\\franklin exit) and i attempted to drive down a side street which headed in the general direction of these objects to see if i could learn more. i soon lost sight of them, however, as trees blocked my view. i turned around and headed back the way i had come, and cannot be certain, but thought i heard the distant sound of a helicopter."],"Disposition":"IFO","files":["/var/www/straped/mufon/html2text/19107.html.txt","/var/www/straped/mufon/org/19107.html"]}