{"Date Submitted":"09/06/2009 08:57 UTC","Tags":"City","Log Number":"US-09062009-0013","Date of the Event":"09/04/2009 10:00 UTC","Object Flight Path":"Straight-line path","Summary":"very low flying, triangular, strange chem trail, completely silent","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19108.html.txt","/var/www/straped/mufon/org/19108.html"],"trends":["There have been no other sightings in Marion","This sighting has never been favorited."],"Country":"United States","Longitude":"-85.146984","Latitude":"44.102515","Viewing Distance":"501 Feet - 1 Mile","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.102515,+-85.146984(19108)&iwloc=A&hl=en\"> mufon case (19108) map </A>","City":"Marion","Case Number":"19108","Object Features":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsI have been watching two other glowing, multi-colored, extremely slow moving, lights for about a month now and I can't explain them either but, on Sept. 4, 2009 I had stepped out to see if the sky was clear and if these same lights were out. They were but, a white, flashing, moving, light caught my eye in the western sky. As I looked at it it didn't look like a plane but, I couldn't tell because of the distance. I ran inside, grabbed my Sony DCR-TRV18 120Xzoom with super nightshot, and raced back outside. It was closer by now and I could see there were 3 bright white lights on the rear section of it and there seemed to be another white light at the front of it but it was difficult to capture at the angle and direction it was moving in. There was also a blinking light that was located under the object. It did not seem to have a set pattern to how often it flashed. It was a full moon, clear skies, and no noticeble wind, night which helped with what I witnessed. I was able to capture it in super nightshot, nightshot, and without nightshot. As it came closer I could see that it appeared to be in a triangular shape and had a very wide chem trail. It was COMPLETELY silent. The only noise was the crickets and a couple passing cars. It was MUCH LOWER in the sky than any commercial planes or jets. It almost seemed to be as high as a helecopter would be. At times the light on the bottom of the craft would blink a red color instead of white. It flew in a straight line towards town and appeared to be passing over town. I filmed it until it went out of sight and I did return back outside without my video camera later on to see if the chem trail was still there, up to an hour later it was still there. We have no airports around this area that support large aircraft so when I do see them, day and night times, they are very high in the sky. I also have a neighbor who owns and flies his own plane from his corn field so I do see that plane and this did not match his plane either. I have debated with myself whether to submit this because I know you have a very large number of cases. I am a paranormal investigator with my own team and we have been together since 2001. I have shot thousands of hours of video, and taken thousands of photos, so I do have some background in videography and photography. I can promise you that the video I have has never been doctored in any way and can be tested to prove it. I was totally caught off guard when this craft passed over my home and I am still amazed at the event. I hope to hear from your organization soon. I do not want to put it on YouTube or any other website without your scrutiny first. I will have to mail you a copy of the video because as soon as I put it on the computer the resolution is lost as well as the color. You can see the craft at times but not the chem trail and I feel you need the whole clip as it was seen in order to determine what it is. I will more than gladly either burn it to DVD or transfer it to another mini-DV tape and mail either one of them to you. Sincerely, Michelle Hajdu"],"Source":"MUFON","Sighting Duration":"00:04:12","Object Shape":"Triangle"}