{"Region":"Pennsylvania","Case Number":"19104","Date of the Event":"07/17/2009 12:00 UTC","Source":"MUFON","City":"Pittsburgh","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"Hot summer night, 3-4 a.m., looked like North star but brighter. Kept moving, and caught it in pictures.","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around July 17th 2009","This sighting has never been favorited.",""],"Country":"United States","Longitude":"-79.994406","files":["/var/www/straped/mufon/html2text/19104.html.txt","/var/www/straped/mufon/more/19104_submitter_file1__100_1188.jpg","/var/www/straped/mufon/more/19104_submitter_file2__100_1193.jpg","/var/www/straped/mufon/more/19104_submitter_file3__100_1194.jpg","/var/www/straped/mufon/org/19104.html"],"Latitude":"40.441825","Log Number":"US-09062009-0009","divs":["Sighting DetailsI live in the garage apartment next to my parent's house. It was a little after 3 a.m. and my father let the dog out to use the bathroom. He was telling her to go out into the yard and I yelled out the window at him to say hello and to see why he was awake. As we were talking, he pointed up in the sky and said, \"Look at that big star. I never saw a star so bright\". My dad used to always joke with me when I was young and tell me that he saw UFOs. I told him that he was goofy, but he begged me to go look at it, so I walked outside onto my front porch and there it was. It looked like the North star except brighter and more yellow. My dad told me to go get my digital camera so I did. At first I was scared to take pictures of it because I didn't want whatever it was to come down and get me like you see in the movies. My heart was beating fast and my hands were shaking. After a while, nothing happened, so I just kept watching it and taking pictures. I had trouble finding it at first because it kept moving. When I would place the screen up to the sky to find the object, two lights were visible. There were red and blue lights shaped in the form of a triangle and they kept moving around the bright \"star\". My dad and I couldn't believe what we were seeing because we liked to watch this sort of stuff on TV, but never imagined we'd see it in real life! To the naked eye, nothing was moving. When I put my camera up to it, the objects would move side to side and up and down very fast. My dad even went and got his telescope, but we couldn't find a visual because it kept moving. After about an hour or so, nothing else happened so we both went to bed. I went to bed about 5:30 a.m. and before I laid down, I felt a little freaked out, so I walked outside on the porch and it was still in the sky. I have not seen it since that night. In the pictures on my digital camera, you can see the red and blue lights around the object. If I were to zoom in on them, you could not see them anymore. I also noticed that there was another set of red and blue lights on the other side of the object. When I uploaded the pictures to my computer, the lights were no longer visible. I wish I would have kept them on my digital camera so I could still show people the lights. I have shown many people and every time I show them, they get freaked out. Hopefully, maybe someone can lighten the pictures up or something so the red and blue dots show. Also, the pictures of where it looks like a boomerang, I zoomed in as far as my camera would let me and I put the camera on \"objects in motion\". As you can see, the object changes ways. The other picture is just a plain zoomed in picture of it in motion."],"Object Shape":"Star-like, Triangle","Date Submitted":"09/06/2009 05:00 UTC","Object Flight Path":"Other","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.441825,+-79.994406(19104)&iwloc=A&hl=en\"> mufon case (19104) map </A>","Tags":"City","Object Features":"None"}