{"divs":["Sighting Detailshadnt had exercise for a number of days so i decided to take a short walk toward the airport in manteo, nc. it was a pure black night and i couldnt see the road in front of me. as i came out from behind a large tree that lines the airport property i looked up and say a round yellow light with a thin gray uneven film on the surface moving to the left, slowly. the round light was bigger than a full moon but i could not make out the rest of the craft. as i said before the night was pitch black. i smiled and laughed, my heart jumped for joy because i had been looking for just such a sight ever since i have heard of ufo,s i stood transfixed because i knew that this was the real thing and up close. i also knew what was transpiring within the ufo. they were punching in cordinates for their journey. as i watched the light became intensly white and i wiped my eyes, looked up again and that light was already almost out of sight. it took 3 seconds to disappear.it went directly east over the atlantic ocean. there was no sound at any time, it hovered perfectly still until it moved east. i have been down there on dark nights hoping to see another of the same but no luck. thank you for your time. robert john vernier i felt very blessed that i had decided to take a walk that evening."],"Viewing Distance":"101-500 Feet","Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-75.617902","Summary":"taking a late night walk toward the manteo airport passing a tree on the edge of the airport property i looked up at a light and i knew what it was.","Log Number":"US-09062009-0010","Weather Factors":"None","Date of the Event":"09/30/2008 12:00 UTC","Latitude":"35.965192","Date Submitted":"09/06/2009 06:06 UTC","trends":["There have been 3 other sightings in Nags Head","There were no other sightings in Nags Head on or around September 30th 2008"],"Object Features":"Unknown","Country":"United States","Source":"MUFON","Region":"North Carolina","Disposition":"IFO","City":"Nags Head","Case Number":"19105","Object Flight Path":"Hovering then path","Object Shape":"Circle, Unknown","files":["/var/www/straped/mufon/html2text/19105.html.txt","/var/www/straped/mufon/org/19105.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.965192,+-75.617902(19105)&iwloc=A&hl=en\"> mufon case (19105) map </A>"}