{"Object Features":"Unknown","Source":"MUFON","Longitude":"-80.955924","Object Flight Path":"Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.308389,+-80.955924(19116)&iwloc=A&hl=en\"> mufon case (19116) map </A>","Object Shape":"Circle, Fireball","trends":["There have been no other sightings in Southington","This sighting has never been favorited."],"Region":"Ohio","Case Number":"19116","Date of the Event":"09/06/2009 09:30 UTC","Tags":"City","Summary":"small orange circle, 3 separate times","Log Number":"US-09072009-0007","Date Submitted":"09/07/2009 12:16 UTC","Disposition":"Unknown","Latitude":"41.308389","files":["/var/www/straped/mufon/html2text/19116.html.txt","/var/www/straped/mufon/org/19116.html"],"Viewing Distance":"Unknown","Country":"United States","divs":["Sighting DetailsMy son and I were visiting my sister in Southington. Their neighbors invited us over for a bonfire around 9:30-10ish pm. We were sitting around the bonfire, and, all of a sudden this orange ball started going over us. At first we thought it was a plane, but, then realized it wasn't because of the speed and, just the way it was flying didn't seem like a plane, nor did the color. Then, it was gone. A couple of minutes another one came by and just as it was above us, it shot straight up in the air leaving an orange trail of some sort. We were absolutely amazed. Then, when the third one appeared my sister got her camera phone out and videotaped it. Same thing, was there one minute, and, shot out of nowhere into space in an instant. But, she did get it on video and when she sent it to my computer email and I showed my husband and my other son, they were absolutely in awe! The exact same thing happened in our neighborhood about 2 weeks ago. We were coming home from somewhere around 10ish at night, and, all of our neighbors were outside telling us what we had just missed. It was EXACTLY the same thing as what my son and I witnessed on Sept. 6th. At that time, we thought they were nuts, but, have now come to realize that they were not! I'm glad we got to witness something like this. It really makes you think and wonder just who is out there besides us on earth!"],"Sighting Duration":"Undisclosed","City":"Southington"}