{"divs":["Sighting DetailsI was working, I work for a local taxi service. I was taking a customer from Medina to Brunswick Ohio at 9Pm on Sunday September 6,2009, . As we approached the intersection of fenn rd, and pearl rd (42), my customer said \"dude, What the hell is that\" I pulled over in a empty parking lot. We both got out of the vehicle, when i looked up, the best description I can give is, 7 to 10 of these glowing orange balls of light were traveling from east to west fairly slowly. These Things were very high up, the only reason i am sure of this was because they seemed to be in the clouds,the clouds made a very hazy circle around them, they were in a weird pattern. there were 3 objects that made a straight line, then directly behind them was four more in an almost triangle shape,there were two seperate lights from the pattern one was about 100 feet or so off the back and 1 was a lot higher than the rest and was the last to dim out. the customer who was with me was just as shocked as i was. The line of these things was huge i can guess that it was about 300 feet long, maybe more. We watched them for about 3minutes before i realised i had my camera phone on me. I video taped them on my camera phone for about another 2 minutes and 30 seconds. As they moved west they seemed to just fade out, or dim out. But i just was not sure if it was from moving through the clouds or if they just vanished . I was very excited and kind of weirded out by the whole thing.I never have seen anything like that."],"Object Shape":"Fireball, Other","Country":"United States","files":["/var/www/straped/mufon/html2text/19117.html.txt","/var/www/straped/mufon/org/19117.html"],"Sighting Duration":"Undisclosed","Date Submitted":"09/07/2009 01:14 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Case Number":"19117","Tags":"City","Latitude":"41.138388","Viewing Distance":"Unknown","Summary":"7 to 10 Fire colored spheres in a pattern, east to west.","Disposition":"Unknown","Longitude":"-81.863747","Object Features":"Undisclosed","Source":"MUFON","Log Number":"US-09072009-0008","Date of the Event":"09/06/2009 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.138388,+-81.863747(19117)&iwloc=A&hl=en\"> mufon case (19117) map </A>","trends":["There has been one other sighting in Medina","There were no other sightings in Medina on or around September 6th 2009","This sighting has never been favorited.",""],"Region":"Ohio","City":"Medina"}