{"Longitude":"-86.583454","Disposition":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=34.733799,+-86.583454(19115)&iwloc=A&hl=en\"> mufon case (19115) map </A>","Date of the Event":"09/05/2009 08:10 UTC","Country":"United States","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19115.html.txt","/var/www/straped/mufon/org/19115.html"],"Object Features":"Unknown","Tags":"City","Object Shape":"Unknown","divs":["Sighting DetailsMy wife and I had just come out of the Publix grocery store at the intersection of Highway 53 and Jeff road, about 8 to 10 miles north-northwest of Huntsville Al. After we had loaded our groceries into the car, I was facing west and noticed a group of red and white lights slowly moving from north to south at treetop level. It appeared to be no more than a mile away. Some of the lights were blinking, we could not see any structure between the lights and it did not make any sound. At first I thought it must be an airplane, probably approaching the huntsville airport which is probably 15 miles away. My wife and I watched it for approximately 3 minutes as it drifted at a speed that seemed much too slow for an airplane. At one point it almost appeared to stop just before it descended behind the tall trees on the west side of Hwy 53. It also appeared to be quiet a bit larger than an airplane maybe 3 or 4 times the length of an average passenger jet. It had more lights than I expect to see on a single plane maybe 6 to 8 lights. If it was more than one plane, they would have been flying extremely close to one another and in a fixed relationship. The lights were blinking at varying intervals. My wife noted that the lights appeared too large for airplane lights. After it disappeared we drove south along Hwy 53 for about a mile but we did not see it again. The things that make this event so odd are the very slow speed, the apparent large size, and silence."],"City":"Huntsville","Latitude":"34.733799","Date Submitted":"09/07/2009 11:28 UTC","Viewing Distance":"Over One Mile","Log Number":"US-09072009-0006","Weather Factors":"None","Region":"Alabama","Case Number":"19115","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around September 5th 2009"],"Source":"MUFON","Summary":"Observed a formation of lights slowly drift along and disappear behind trees"}