{"Sighting Duration":"Undisclosed","Log Number":"US-09072009-0003","map":"<A HREF = \"http://maps.google.com/maps?q=35.47004,+-97.513508(19112)&iwloc=A&hl=en\"> mufon case (19112) map </A>","files":["/var/www/straped/mufon/html2text/19112.html.txt","/var/www/straped/mufon/org/19112.html"],"Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-97.513508","Object Flight Path":"Stationary,Straight-line path","Object Features":"None","divs":["Sighting DetailsFirst off i just want to say that this incident is the second UFO i have witnessed. The first was in 2000 or '01 and myself and 4 others witnessed a huge triangle object very close to the ground near Burns Flat AFB. Since that sighting i have been an avid skywatcher but it took 8 years untill i saw something truly unidentifiable. On the evening of Dec. 24 '08 (Christmas Eve) i was traveling north on Rockwell Ave between NW Expressway and Britton Rd. heading to meet family for the holiday and i happened to notice a starlike amber light at about a 40 degree angle directly in front of me almost directly in line with Rockwell which runs north and south. Now my first impression when i noticed the light was that it was a light on an airplane coming in for a landing at Wylie Post Airport which is 2-3 miles to my southwest from the location i witnessed the lights and i remember thinking the plane had mud or dirt inside the light because of the amber color without any glare or flicker, but the color was just so strange i kept looking while driving north and in just a few seconds after first seeing the light a smaller light of exactly the same color and with no glare or flicker whatsoever eminates from the first light. The second light slowly falls to earth and when it appears to reach ground at the exact same instant the larger light in the sky winks out. When i first saw the second light eminate out of the first light my heart jumped because i felt at that moment that i was witnessing a spark come from one of the small planes that land at Wylie, until i noticed the light was identical to the larger one and fell too slow to the earth without losing any intensity of its light. I pulled over in a store parking lot as soon as the second light reached the ground and the other winked out so i could see if it indeed was an airplane but there was nothing there it was just like the light vanished. Even though the lights were starlike i had the impression that they were very close. I stayed and watched that area of the sky for apprx 15 min without seeing so much as an airplane and i went to my family and told them of my experience, i was very excited. I just cant believe nobody else in Oklahoma City saw these lights but since ive been searching extensively for another witness but havent found one. I hope these lights sound familiar to somebody else. Thank you MUFON for letting me share my experience!"],"Weather Factors":"Windy, Light","Disposition":"Unknown","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around December 24th 2008"],"Tags":"City","Case Number":"19112","Date of the Event":"12/24/2008 05:30 UTC","Country":"United States","Region":"Oklahoma","City":"Oklahoma City","Source":"MUFON","Date Submitted":"09/07/2009 02:37 UTC","Latitude":"35.47004","Object Shape":"Star-like","Summary":"On Dec. 24 '08 i witnessed a starlike amber light over a large residential area and while watching a smaller light of same color eminates from larger light and fell slowly to the ground and as it appeared to hit the ground the larger light winked out."}