{"files":["/var/www/straped/mufon/html2text/19125.html.txt","/var/www/straped/mufon/org/19125.html"],"Viewing Distance":"Unknown","trends":["There have been 21 other sightings in Brandon","There were no other sightings in Brandon on or around September 7th 2009"],"Latitude":"27.946701","Longitude":"-82.280835","Region":"Florida","Summary":"boomerang shape with single row of lights on underside","Object Shape":"Boomerang","Weather Factors":"None","Disposition":"IFO","Sighting Duration":"Undisclosed","Log Number":"US-09072009-0016","Object Flight Path":"Straight-line path","Object Features":"None","Tags":"City","City":"Brandon","Country":"United States","Date Submitted":"09/07/2009 10:07 UTC","divs":["sighting detailsi was walking toward my apartment on monday night, 9\\7\\09 at about 9:15 pm with my son. i happened to look up because the night was clear and there were a lot of stars. a boomerang shape set of lights was moving directly over our heads and i told my son to look up and as i looked closer i could see the outline of a boomerang shaped object. it silently glided across the sky heading toward the south. it took about 5 seconds before it was blocked from sight by the treeline. my initial reaction was shock and i was stunned because i never thought i would ever see anything like that. my son verified that he saw it also, although his first reaction was it was geese. while geese may fly at night, they fly in more of a v formation, and i've always seen them with one side shorter than the other. this was not a very narrow v (less than 90 degree angle), it was wider, more like a boomerang. and to me there were definite points of light. macdill airforce base is not that far from here, so it may have been some kind of craft from there, but it was nothing i have ever seen fly over before this, day or night."],"Case Number":"19125","map":"<A HREF = \"http://maps.google.com/maps?q=27.946701,+-82.280835(19125)&iwloc=A&hl=en\"> mufon case (19125) map </A>","Date of the Event":"09/07/2009 09:15 UTC","Source":"MUFON"}