{"Weather Factors":"Unknown","Latitude":"36.598686","Viewing Distance":"Unknown","Object Features":"None","divs":["Sighting DetailsAbout 11;30 pm I had just went to bed and was looking out the window toward the north, stars were out but no moon, I was listening to the radio, I was almost 15 years old at the time so I wasn't really sleepy and as i looked out the window this light, a neon blue colored light lite up and in the middle i could make out a brighter white flat shaped disc as it flew over our house going north, I first was amazed at the neon light that flooded the whole area an the bedroom too. I thought maybe aa air force jet but there was no sound at all. My dad was outside when this occured and i heard him come back in and he came to my door, because he figured i was still awake as i had just went to bed and he asked me \"did you see that?\" and that was it. We lived at the end of a county road in east Tenn. near Virginia and North Carolina at foot of a mountain, way back. Id seen lots of jets and low flying air force doing training i suppose many times thru the years as the tried to evade radar toward oak ridge etc.. or so my brothers would say so I was familiar with such stuff and this fit none of the above. I have seen other things that i won't include here but if your profilers are interested in them i would gladly relate them. There had been other type's of events that would require alot more typing on my part but may be worth relating. Possible close contact \"things\" have occurred but don't want to be seen as \"another one of those\" because it did occur and sometimes i do feel like they're still around if you know what i mean. I know it's been a long time since this report happened and i never contacted anyone but its been in my mind since then and the events since then and now have added to my curiosity of what it all means and i guess you guys have heard it all and may have a clue or two that i can add to the mix to get a better understanding of what is happening and especially why. No Ive never seen, talked too or knowingly been in contact with any alien being but I do know what I have seen is not from our technology or anyone else's...just impossible, especially in 1969 or today. I had been interested in \"ufo's\" prior to this event and as a young kid was facsinated at the idea but was kinda scared to acually see something this grand, eerie spooky sort of feeling at the time. But as i said other things happened afterwards and my brothers and neighbors have seen some things too and they could verify some of the same occurances. Im much older now and more concerned than curious, Ive seen and read through the years and I keep an open mind reguarding people's accounts, some are obvious illusion's and attention device's, hoax's etc.. but a few are the real deal, don't ask me how i know but it seems to me I just feel when its truthful and it gives me a twinge when I read or see such a report."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.598686,+-82.187614(19129)&iwloc=A&hl=en\"> mufon case (19129) map </A>","Summary":"flat round with neon blue light passed overhead, low altitude, no sound","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"08/31/1969 12:00 UTC","files":["/var/www/straped/mufon/html2text/19129.html.txt","/var/www/straped/mufon/org/19129.html"],"Longitude":"-82.187614","Tags":"City","Region":"Tennessee","Date Submitted":"09/08/2009 02:19 UTC","Object Shape":"Disc","trends":["There have been 20 other sightings in Bristol","There were no other sightings in Bristol on or around August 31st 1969"],"Case Number":"19129","Source":"MUFON","Country":"United States","City":"Bristol","Log Number":"US-09082009-0002"}