{"Country":"United States","Date Submitted":"09/07/2009 07:41 UTC","Weather Factors":"None","Region":"California","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.381402,+-119.012452(19120)&iwloc=A&hl=en\"> mufon case (19120) map </A>","Case Number":"19120","Date of the Event":"09/07/2009 04:30 UTC","files":["/var/www/straped/mufon/html2text/19120.html.txt","/var/www/straped/mufon/more/19120_submitter_file1__1.jpg","/var/www/straped/mufon/more/19120_submitter_file2__3.jpg","/var/www/straped/mufon/more/19120_submitter_file3__6.jpg","/var/www/straped/mufon/org/19120.html"],"Object Flight Path":"Stationary","Log Number":"US-09072009-0011","divs":["Sighting DetailsMy husband and I were up at about between 4:30 am to 6:00 am this morning 9-7-2009 and we saw in the east sky a large pulsating sphere. It was very bright and in constant motion. It looked very close as if it was in our atmosphere not in space like a star. We had a great view with my husbands scope. I'll do my best to describe it. It was a large round ball contantly turning, sometimes it would turn and have a flat bottom and round top or flat side and round on the other side, like I said it is constantly in motion, but yet hovering. I took pictures with my digital camera and two of the pictures look like its a planet, but the rest of the pictures were streams of light. Every image is a different stream of light or some type of symbol. I thought there was something wrong with my camera so I shot a couple of other things and there was no stream of light. Every time I shot at this ball of light, it was a different stream of light or symbol. I am not sure what this is, as I am no expert on anything relating to the sky. I have 25 pictures if you are interested. I would really like to know what this is if anyone has an opinion. Star, satellite,planet,comet,ufo, I just don't know. Thanks."],"Longitude":"-119.012452","Sighting Duration":"01:30:00","Tags":"City","trends":["There have been 32 other sightings in Bakersfield","There were no other sightings in Bakersfield on or around September 7th 2009","This sighting has never been favorited.",""],"City":"Bakersfield","Source":"MUFON","Object Shape":"Fireball, Sphere","Disposition":"IFO","Summary":"Sphere constantly in motion, but yet hovering and also changing shape periodically.","Object Features":"Dome, Unknown","Latitude":"35.381402"}