{"Sighting Duration":"Undisclosed","Date of the Event":"09/07/2009 08:45 UTC","Case Number":"19128","Log Number":"US-09082009-0001","Tags":"City","Object Shape":"Cigar","Weather Factors":"Rain, Light","Summary":"Driving home in Littleton, facing east, north east we saw cigar shaped bright very large object, it was orange when we first saw it, it turned to two white lights in about a minute as we entered our home, went our back & took photo. It left North East.","Object Features":"Unknown","Latitude":"39.744174","files":["/var/www/straped/mufon/html2text/19128.html.txt","/var/www/straped/mufon/org/19128.html"],"City":"Denver","Object Flight Path":"Stationary,Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.744174,+-104.982883(19128)&iwloc=A&hl=en\"> mufon case (19128) map </A>","Date Submitted":"09/08/2009 12:37 UTC","Country":"United States","trends":["There have been 185 other sightings in Denver","There were no other sightings in Denver on or around September 7th 2009"],"Source":"MUFON","Longitude":"-104.982883","Disposition":"Unresolved","Region":"Colorado","divs":["sighting detailswe were coming home from a movie at 8:45 heading north and noticed to our right (east) a bright large object. it took us about 10 seconds to enter our street toward our home heading east and saw that it was cigar shaped and light orange. one person thought it appeared more white than light orange. it was cloudy out and had rained\\drizzled so we thought this could not be the moon as the moon would have been blacked out by clouds and not a perfect shape as this was. we both said that is no plane, not the moon and is that a ufo? then, in less than a minute we ran into our house grabbed a cell phone and took a couple of shots. one party saw by the time we took photo it had turned white. the other party grabbed batteries for another camera, and in about one minute it was two lights. it did not move like the planes we often see that direction as dia is east\\ north east of us. we went upstairs and looked out east and one person saw it faintly head north\\north east. this all happened in about 5 minutes. we also noticed there were no blinking lights as the airplanes have. it was very very large to us, but was far away. we were calm, a little surprised to see this and it all happened so very fast."],"Viewing Distance":"Over One Mile"}