{"Date Submitted":"09/07/2009 08:34 UTC","Source":"MUFON","Region":"Ohio","Country":"United States","divs":["Sighting DetailsOK, I will try to quote our actual conversation as much as possible since this just happend 1 hour ago. The Wind was blowing east to west. Me (Derek), my Girlfriend Amber, and my younger Cousin Jordan, were standing outside of my home watching and feeling a large storm come in. The lightning strikes were very close to my house and we could hear fire trucks leaving two stations. Seconds after another very close strike, Amber points out to us there is a object in the sky to the north over the baseball fields across the street. She said \"Hey guys, what is that?\". Me and Jordon look over and see the object. It was dark in the middle and seemed to get lighter at the edges. It looked football shaped. Our best estimate is that it was 500 yards away. It seemed to Slightly bigger than a helicopter. We watched for 15-20 sec. in silence then Amber says \"That's not a helicopter...\" and then i said, \"and its not a plane\". My cousin said something like \"holy crap dude\" and we watched again. We then notice that the area around this object seems kind of hazy, or wavy. It looked like there was some kind of energy around it. We all confirmed that to each other but i can't remember what we said. This is when it seemed to start changing shape. About 1 min after we all first see it, the object started to wane like the moon on the right side, which would be east side from our viewpoint. The sky was completely overcast because of the storm, grey and and lighter grey shades over the whole sky. the area that seemed to disapear was the same color as the sky. It then moved into the middle of the object and created a horseshoe shape. A crescent with the opening at the top. The spot then moved up and to the left, which is the west side from our viewpoint. The object is now back to its original shape. We all Get very excited at this point and we have been watching now for 2:30. My cousin says i should get a camera. I hesitate for about 30 secs and watch the object inestead. The whole time it has been moving from east to west at a constant rate. It was climbing in altitude slightly as it moved. It had been dirctly north when we firts seen it, and by now it had moved to north west of our view point. at 3min 15sec I decide to go grab my cellphone and take some pictures. I run in and scramble to find my phone for about 20 secs. when i get back outside my cousin Jordon says it has started moving faster after i ran in to get my camera, and it did. It was now far off in the northwest moving closer to due west, but still visible to our eyes. I take 4 pictures as fast as i can, then i take a short video. I take 1 more picture and stop to watch what little we can see still for the last 1min and 30 seconds until it moves into the Overcast clouds to the west-northwest of our viewpoint. Then that was it. We looked at the pictures i took and you can barely tell it is there. Its just a speck of pixels when you zoom in but i will send them to you just the same. I can't even see the thing in the video. I was just too late to take good pictures. Feel free to contact me if you need anymore info. I am interested to know if anyone else reports this same object which is why i am reporting it. Thank you for your time, Derek Milner"],"Date of the Event":"09/07/2009 07:04 UTC","Summary":"3 Witness Object That Changes Shape from Football to Crescent and Back with Energy Field Around it","Sighting Duration":"00:05:20","Tags":"City","Object Shape":"Blimp, Oval, Saturn-like, Other","Log Number":"US-09072009-0013","files":["/var/www/straped/mufon/html2text/19122.html.txt","/var/www/straped/mufon/more/19122_submitter_file1__0907091903.jpg","/var/www/straped/mufon/more/19122_submitter_file2__0907091904.jpg","/var/www/straped/mufon/org/19122.html"],"Latitude":"41.44894","Case Number":"19122","map":"<A HREF = \"http://maps.google.com/maps?q=41.44894,+-82.70796(19122)&iwloc=A&hl=en\"> mufon case (19122) map </A>","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Lightning, Rain, Light","trends":["There have been 3 other sightings in Sandusky","There were no other sightings in Sandusky on or around September 7th 2009","This sighting has never been favorited.",""],"Object Features":"Other, Unknown","Longitude":"-82.70796","Object Flight Path":"Path with directional change","Disposition":"Unknown","City":"Sandusky"}