{"Date Submitted":"09/07/2009 09:00 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMy boyfriend and I were outside across the street from his house talking with his neighbor. All the while I was looking up at how beautiful the clear night sky was. No fog, or clouds, and I could see a lot of the milky way. From the east(over the ocean) a super bright white light, round, and fifteen times the size of the brightest objects in the sky (stars), flew silently and somewhat bumping left and right(very slightly) to the west towards some low hills, as I saw it I told my boyfriend to look up, and we watched it move quickly toward a hill and it dimmed out into a red dot and dissapeared. It wasnt an airplane, there would have been a sound. It was lower than an airplane. His neighbor has bad vision so he only saw a bright blur. I knew I might be seeing something strange because I have seen \"u.f.o's\" before, only a few times, and nothing like this. The fact that it was silent, fast, BRIGHT AS HELL, and disappeared makes me think it wasn't \"ours.\" I have an intrest in these and usually my eyes water when I see them but this one was warm and bright and felt different. I believe it was checking us out. I love astronomy and I have a good capability of knowing what I am looking at."],"Sighting Duration":"Undisclosed","Latitude":"35.365808","Region":"California","Country":"United States","Date of the Event":"09/06/2009 08:45 UTC","City":"Morro Bay","map":"<A HREF = \"http://maps.google.com/maps?q=35.365808,+-120.849901(19124)&iwloc=A&hl=en\"> mufon case (19124) map </A>","Viewing Distance":"101-500 Feet","Case Number":"19124","trends":["There has been one other sighting in Morro Bay","There were no other sightings in Morro Bay on or around September 6th 2009"],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19124.html.txt","/var/www/straped/mufon/org/19124.html"],"Log Number":"US-09072009-0015","Source":"MUFON","Object Features":"None","Object Shape":"Star-like","Longitude":"-120.849901","Summary":"Brighter than anything in the sky, a white light with no sound flew straight yet bumpily over my head","Disposition":"IFO","Tags":"City"}