{"Source":"MUFON","Longitude":"-121.888726","divs":["Sighting Details On the evening of 7 SEP 09 at 21:10, a friend from work and I saw a very bright red object in the sky approximately 10 degrees below the planet Jupiter. We had been on a bike ride along Los Gatos Creek Trail and had finished on the bridge in Campbell Park. We had been here several times before learning the Constellations and watching for satellites after sunset. I noticed a bright red object which was stationery in the sky. I realized it couldn't be Mars, it wasn't a plane's tail light (it didn't move, but it was that brightness and color), and it couldn't be a helicopter as there was no sound or movement. Very small white moving dots (pin points of light) became visible near it. They seemed to be interacting with it. My friend took picture with iPhone. After a few minutes it began to pulsate in brightness, then it began changing from red to white and back to red every 10 secs or so. At about 21:22 it faded out completely and did not return. The small white dots continued to be visible for a few minutes after the red object vanished. We were stunned and did not know what to do. I wanted to notify someone but whom? Found MUFON on-line."],"Weather Factors":"Unknown","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around September 7th 2009","This sighting has never been favorited.",""],"Date Submitted":"09/08/2009 08:33 UTC","Summary":"Bright, Red, star-like object pulsated in sky 12 mins turned white,then faded","Tags":"City","Region":"California","City":"San Jose","Latitude":"37.342956","Object Features":"None","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Stationary","Disposition":"Hoax","map":"<A HREF = \"http://maps.google.com/maps?q=37.342956,+-121.888726(19131)&iwloc=A&hl=en\"> mufon case (19131) map </A>","files":["/var/www/straped/mufon/html2text/19131.html.txt","/var/www/straped/mufon/more/19131_submitter_file1__IMG_0086.JPG","/var/www/straped/mufon/org/19131.html"],"Log Number":"US-09082009-0004","Case Number":"19131","Sighting Duration":"Undisclosed","Date of the Event":"09/07/2009 09:10 UTC"}