{"map":"<A HREF = \"http://maps.google.com/maps?q=44.958157,+-93.109889(19130)&iwloc=A&hl=en\"> mufon case (19130) map </A>","Latitude":"44.958157","City":"St Paul","Summary":"Fast moving UFO headed south at about 20,000 - 30,000 FT or greater.","Sighting Duration":"00:00:15","Source":"MUFON","Date of the Event":"09/08/2009 04:15 UTC","Case Number":"19130","Longitude":"-93.109889","Region":"Minnesota","Log Number":"US-09082009-0003","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19130.html.txt","/var/www/straped/mufon/org/19130.html"],"Object Features":"Unknown","Object Flight Path":"Path with directional change,Unknown","divs":["Sighting Details1. I was getting ready to go to sleep. 2. Every night before I go to sleep I sit in bed and watch Airliners fly to and from the Minneapolis-St.Paul Airport. I thought it was just an Aircraft traveling along. But the thing that struck the object to be odd was the fact that it had no blinking lights. 3. I thought it was nothing but the fact that there was no blinking lights that struck it to be odd. 4. It first looked to be an Aircraft at about 20,000 - 30,000 FT. It was traveling at 400-500 MPH. Then out of no where it just increases to tremendous speeds. It looked as if it hit the speed if light or even greater. Because as it increased in speed it left a light trail that looked like it was in the shape of an Arch. The light was a cobalt blue with a white hue. And as it disappeared it released a very bright light. The light was looked as if you starred at a star for awhile and you saw the light rays. I could say it looked like the star in the stories of the northern star in the stories of Jesus being born. And the Arch of light vanished into the light explosion. What was also weird was the fact that the light Arch followed its shape into the light explosion. Also if you are familiar with Star Wars and the Millenium Falcon. It looked like what the Millenium Falcon looks like when it hits Hyper Space. It was beautiful. 5. I felt as if it was other worldy. Also I have the feeling that I shouldn't go to sleep. Also as a note; I was in the Air Force and I have seen some pretty amazing stuff but nothing like that. I also felt amazement. I also felt sadness as to the point that no one else would probably ever see that. It was awe inspiring. 6. It disappeared."],"Country":"United States","Weather Factors":"None","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","trends":["There have been 22 other sightings in St Paul","There were no other sightings in St Paul on or around September 8th 2009"],"Date Submitted":"09/08/2009 06:27 UTC","Object Shape":"Circle, Flash, Star-like, Other"}