{"Log Number":"US-09082009-0007","files":["/var/www/straped/mufon/html2text/19134.html.txt","/var/www/straped/mufon/org/19134.html"],"Country":"United States","Date of the Event":"01/10/2005 04:13 UTC","Tags":"City","Object Shape":"Other","Longitude":"-84.546733","Object Features":"Undisclosed","Weather Factors":"None, Does Not Apply","Latitude":"33.960082","map":"<A HREF = \"http://maps.google.com/maps?q=33.960082,+-84.546733(19134)&iwloc=A&hl=en\"> mufon case (19134) map </A>","Region":"Georgia","divs":["Sighting DetailsMy late husband and I were leaving for Hartsfield AIrport at 4am from our home in Marietta Ga.(Bridgegate Dr.) as we backed out of the driveway my husband asked who could be walking at that time of the morning. I just glanced and said it must be some middle eastern or arabic woman that can't walk around in the day time.This (thing) was compeletly shrouded in full length black garments from head to toe. He remarked on the height and the fact that the light from the street light in the background could be seen between this being and the ground. There was total space between it and the road. It was not touching the ground? It wasn't flying per-sa it just didn't touch the ground!! It was coming toward us at a slow deliberate pace. We made a decision not to stick around until it got close to the car and sped off. We also decided not to call the police because they wouldn't have believed us. I called the police from the airport and they said maybe it was DARTH VADERand the ignorant redneck laughed at us. They also laughed at our neighbors later. When we returned from our business trip six weeks later my husband was on the driveway when a neighbor stopped to talk to him and warn him about a peeping tom. Apparently their son was up watching tv very late one night and noticed a movement on the outside of the window in the den. As he looked up he said he saw an enormous hand. He discribed it as being a huge human hand. He also said he couldn't see a face but a large black hooded figure. Our next door neighbor Ray got a ladder and was climing on his porch roof to see how someone could get up there! He confided in my husband that he thought he was seeing things when he looked up in the middle of the night and saw someone watching him. That is when my husband told him he saw someone on his porch roof and ours as well. Instead of telling me and scaring me he kept this to himself.He didn't sleep well and kept the blinds open in the room ne insisted on staying in alone. When my husband called me outside to listen to this story I became realy frightened because on several occassions I woke up with the sensation that something? was watching me through the open blinds on the second floor bedroom. Also at night and very early in the morning when I was waiting for a towncarto pick me upI had an erie sensation of being watched closely in the dark. I left before daylight a lot. There is more to the story , I saw a show on sightings and they showed a large humanoid figure in the sky over Brazil or Argentina same being same dress with several smaller ones flying into it's (cape?) I had surpressed this memory after my husbands sudden death.When I saw this show on the history channel or travel? I was in shock for two days and couldn't think of anything else. It ALL CAME BACK. HE PASSED IN OCT.05"],"City":"Marietta","Sighting Duration":"00:05:00","Date Submitted":"09/08/2009 03:31 UTC","Case Number":"19134","Summary":"A VERY LARGE SEVEN FEET TALL AT LEAST DRESSED IN BLACK NO FEET TOUCHING GROUND, BOTTOM OF ATTIRE SWRLING IN MOTION.","Disposition":"Unknown","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around January 10th 2005"],"Source":"MUFON","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}