{"Country":"United States","Tags":"City","Longitude":"-79.990116","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"09/06/2009 08:29 UTC","divs":["sighting detailsharmar(ville), pa- 8:29 pm: observed a dim red orb or sphere heading upriver over oakmont country club golf course. height a little higher than jupiter. moving fairly good pace as can be seen in nightshot video posted on youtube.com\\user\\seeingufospa. video shows the screen shot from n2y0.com to verify it wasn't a satellite. this may be the same type as the one reported over pittsburgh mills mall on september 5th. it did appear transparent at times. i was on phone while filming with a pilot (infinitysends on youtube) from atlanta (who is originally from this area) who's volunteered to try and catch one closer in the sky with me on the ground as spotter. jimmy wenger in new kensington is also on the phone watch list, as well as energeeeresearch from north irwin. the night before, pilot missed an orb rising from the edge of oakmont's country club's golf course woods that line the riverside edge of course( he was over murrysville at that time). it rose slowly straight up, transformed into two white lights with blinking red one in middle--trying to mimic a plane. it then suddenly disappeared or turned off all its lights while on film (not uploaded yet). on this night, however, he chased something that showed on radar that was not visible to the naked eye until it stopped showing on radar. he also had his plane's computer reset while he was flying--something it never did before. i was glad that was all as i had warned him not to go within 500 feet--because after an orange orb was 500 feet away, the next morning i found my car stereo's station presets wiped out--like the battery was disconnected. he saw other orange lights on the ground around pittsburgh area but couldn't confirm anything since they were too far away. he also saw a strange looking 'something' that flew overhead of him with pulsing red lights that was silent. i believe it was the same one that flew up river (and captured on my video) at 8:54 pm. this is also included in my video: http:\\\\www.youtube.com\\watch?v=tbuytwbut1s"],"Log Number":"US-09082009-0009","Object Shape":"Sphere, Unknown","Summary":"Harmar(ville): Dim RED Sphere heading upriver over Oakmont Country Club","map":"<A HREF = \"http://maps.google.com/maps?q=40.442235,+-79.990116(19136)&iwloc=A&hl=en\"> mufon case (19136) map </A>","City":"Pittsburgh","Weather Factors":"Unknown","Disposition":"Hoax","Region":"Pennsylvania","Case Number":"19136","Latitude":"40.442235","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around September 6th 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Date Submitted":"09/08/2009 04:34 UTC","Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/19136.html.txt","/var/www/straped/mufon/more/19136_submitter_file1__20090906202909_3C.jpg","/var/www/straped/mufon/more/19136_submitter_file2__20090906202909_4C.jpg","/var/www/straped/mufon/more/19136_submitter_file3__20090906202909_6C.jpg","/var/www/straped/mufon/org/19136.html"],"Object Flight Path":"Undisclosed"}