{"Date Submitted":"09/08/2009 09:58 UTC","Country":"United States","Weather Factors":"Does Not Apply","Date of the Event":"09/08/2009 09:35 UTC","Sighting Duration":"Undisclosed","Case Number":"19149","divs":["sighting detailsmy wife and i have been seeing odd things in the night sky for the past couple weeks here in the livingston county area. this is the first sightings we have ever seen in our life, and it has been a wild summer watching the night sky. all of these objects seen have been seen low to the ground around 1000 feet up or so. 1. three weeks ago over brighton we saw four large orange glowing lights in the sky, they were scanning the ground and moving slowly towards the south east, and a few went north. they were about the size of a full moon. 2. twice in the past two weeks we have seen odd\\fake looking meteorites hitting the ground to the north\\east of us. they come down slow, are a brilliant white firey disc. i know these are not meteorites becuase the speed they are traveling and they are fully ignited and do not burn out, and they are much larger. 3. tonight while walking our dog outside, we saw what looked like two planes comming our way. both were lit up white like a star, once they passed over (slowly) we relized thses two objects were way to close to be planes (they would have hit each other) and they were moving in a fixated form, and the wildest thing is that they looked like big stars in the sky moving together. one in front one in back about 300 feet. the catch here is that this was one object because as it passed over it covered up the stars behind it. once it passed us the first light went out follwed by the second. we thought a cloud had covered it up, but relized that the stars were still visible. all we can say is there are alot of objects in the night sky, that are fake looking, or shall i say do not fit the description of aircraft,helicopters,typical meterites, are all silent,slow mowing,scanning like,and why is this happening over brighton\\howell area?"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/19149.html.txt","/var/www/straped/mufon/org/19149.html"],"Source":"MUFON","Region":"Michigan","trends":["There have been 8 other sightings in Brighton","There were no other sightings in Brighton on or around September 8th 2009"],"City":"Brighton","Log Number":"US-09082009-0022","map":"<A HREF = \"http://maps.google.com/maps?q=42.533677,+-83.777991(19149)&iwloc=A&hl=en\"> mufon case (19149) map </A>","Viewing Distance":"Over One Mile","Longitude":"-83.777991","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Latitude":"42.533677","Summary":"What is going on in Livingston County?!","Object Shape":"Star-like","Tags":"City"}