{"Date Submitted":"09/08/2009 09:49 UTC","Tags":"City","Viewing Distance":"Over One Mile","Log Number":"US-09082009-0021","Source":"MUFON","Weather Factors":"None","Case Number":"19148","City":"Fort Worth","Country":"United States","files":["/var/www/straped/mufon/html2text/19148.html.txt","/var/www/straped/mufon/org/19148.html"],"Latitude":"32.619477","Region":"Texas","divs":["Sighting DetailsI was camping in a state park and sitting around the campfire. With me were my son who is 26 year old stockbroker in colorado and his girlfriend. While watching the sky I noticed two normal satellites pass by and one aircraft (anticollision lights on). Then I noticed what appeared to be a satellite but it was not moving in a straight line. The movement just appeared to be tiny zigags, almost unnoticeable. I yelled at my son and his friend to watch. The object was moving N to S at about 40 degrees above the horizon. Suddenly it got very bright and then it appeared to turn away and then vanished while still high above us. It did not disappear on the horizon, it was still high in the sky. I am familiar with aircraft as I have flown as a student pilot about 45 hours and also flown commercially over 100 times. I was not looking for a UFO and have never even contemplated seeing one. But the route the light was taking was not normal and then when it got extremely bright it was just very odd and the altitude had to be very high. It really appeared to turn away. I was not drinking nor intoxicated by any other methods. Just a dad and his son out camping in Colorado after going up there to play golf for week while the weather was hot in Texas. we were near the Garden of the Gods and the sky was clear with no rain and no clouds. The object was flying in a straight or smooth pattern."],"Date of the Event":"08/08/2009 09:20 UTC","Sighting Duration":"00:02:15","Object Features":"Unknown","Object Shape":"Other","Summary":"Blip of light crossing N to S on front range of Rockies.","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around August 8th 2009"],"Longitude":"-97.379356","Object Flight Path":"Path with directional change","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.619477,+-97.379356(19148)&iwloc=A&hl=en\"> mufon case (19148) map </A>"}