{"Longitude":"-121.890986","Log Number":"US-09082009-0016","files":["/var/www/straped/mufon/html2text/19143.html.txt","/var/www/straped/mufon/org/19143.html"],"Date Submitted":"09/08/2009 08:30 UTC","City":"San Jose","Case Number":"19143","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.340526,+-121.890986(19143)&iwloc=A&hl=en\"> mufon case (19143) map </A>","Date of the Event":"09/07/2009 08:55 UTC","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around September 7th 2009"],"Latitude":"37.340526","Source":"MUFON","Object Shape":"Circle","Sighting Duration":"Undisclosed","Disposition":"Hoax","Region":"California","Object Features":"Unknown","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Stationary","Tags":"City","Summary":"Bright solid color (red-orange) light 1/2 size of Jupiter ~15deg west of Jupiter","divs":["sighting detailsmonday evening we went outside at 20:50 to view the iss, noticed jupiter but the iss was to appear on the other side of the sky. after a few minutes we looked back at jupiter and saw this very bright light (about 20:55), it was about 15deg west of jupiter and about 10deg lower in the sky. i'm pretty sure we would have noticed it when we first went out, it was very noticable. if it were on the ground it would look like someone shining a red flashlight at you. the brightness was like no other star i've ever seen, it was about as bright as jupiter and 1\\2 to 3\\4 the size of jupiter. we thought it was maybe an aircraft, but it didn't move. the color was pure and solid, an orangey-red. it didn't twinkle like a star, but it varied in brightness, not much at first but after about 10 minutes it faded and flickered as it faded. after about 15min, it had all but disappeared, then it started getting brighter over about 2 minutes, maybe only reaching 1\\2 of the original brightness. after a few more minutes it faded away and never came back. i didn't stay outside waiting for it to return, but over the next 90 minutes i checked for it 4 or 5 times, it was gone. i viewed this in my suburban backyard in san jose, there is plenty of light pollution from streetlights, but this was a very profound bright object that couldn't be missed. the brightest star that i can see is probably only 10% the intensity of this object, so i don't believe it was a star."]}