{"Sighting Duration":"Undisclosed","Latitude":"44.027606","Region":"Michigan","files":["/var/www/straped/mufon/html2text/19157.html.txt","/var/www/straped/mufon/org/19157.html"],"Summary":"2 ufo's passed closely over head. seen by 5 peopl.","Object Shape":"Circle","Log Number":"US-09082009-0030","Disposition":"Insufficient Data","trends":["There have been 3 other sightings in Harrison","There were no other sightings in Harrison on or around September 8th 2009"],"Source":"MUFON","Object Features":"None","Tags":"City","Weather Factors":"None","Case Number":"19157","Country":"United States","Object Flight Path":"Straight-line path","Longitude":"-84.795368","divs":["Sighting DetailsI was walking from my niehbors and it was very clear, so i was looking at the stars. and i seen a brightly lit object(star like orb)flying at high speed from south to north.i watched it for a minute then when i noticed it wasent a plane of any kind i ran home to tell my family to come look. when they came out into the yard, it was just fadeing out of sight, when my niehbor matt came up and asked what we were doing.i told him looking for a ufo we just seen,i told him what it looked like.and just then he turned round and said 'HEY WAS THAT IT'and sure as im alive there were 2 more, but much lower heading from S.W to N.E...as they flew silently by,one leading the other,between us and the stars you could clearly see that they were orbs or circular shape,and bighly iluminated. we watched them for maby 4-5(seemed like longer,but i dont think so) minutes,and then the first one faded out and then the second did the same.they were gone.no sound or disturbance... in all they were seen by myself my wife my youngest son 11,my doughter 4,my friend matt and his girlfreind.we were all very excited,but my kids were frightend..."],"Viewing Distance":"501 Feet - 1 Mile","City":"Harrison","Date of the Event":"09/08/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.027606,+-84.795368(19157)&iwloc=A&hl=en\"> mufon case (19157) map </A>","Date Submitted":"09/08/2009 10:31 UTC"}