{"Summary":"They looked like two stars.","files":["/var/www/straped/mufon/html2text/19154.html.txt","/var/www/straped/mufon/org/19154.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI was outside smoking a cigarette on my back porch,when I looked up and I saw two stars,and I noticed that they were moving,they were following each other,they didn't look no higher than the average flying passenger jet,following each other more than a few hundred feet apart.They weren't traveling at real high speed either,because I watched them for a few minutes,my neighbor and his son was outside at the same time,I told him to look at that and he told me that it was the space station and space shuttle going across the sky,now I know it doesn't seem possible that the space shuttle could follow the station,because it would be docked to it,I do know that the shuttle undocked from the station today,but don't you think that the shuttle will be going one way and the station the other,for the shuttle to come back home?I know they weren't meteors or a shooting star because I have seen those and they go across the sky very fast and fade out,this was very much in a controlled speed,I look up at the sky every night hoping to see one of these things,I didn't get to see no shape or nothing,they just looked like bright stars in the sky,I tried to get a picture of them,because my fridge is next to my porch door and there's a camera on top of it,but it didn't come out,So I do have a question for MUFON Is it possible to see the space station from the gound? and if the shuttle detached from the station would it look like it was following the station and can you see that from the ground? If you can E-mail me back a reply I would appreciate it.Thank you for taking the time to read this."],"Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=41.879284,+-87.620318(19154)&iwloc=A&hl=en\"> mufon case (19154) map </A>","Tags":"City","Longitude":"-87.620318","Source":"MUFON","Date of the Event":"09/08/2009 08:10 UTC","Case Number":"19154","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Star-like","Date Submitted":"09/08/2009 10:15 UTC","Latitude":"41.879284","City":"Chicago","Region":"Illinois","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Log Number":"US-09082009-0027","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around September 8th 2009"],"Country":"United States"}