{"Weather Factors":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"09/08/2009 11:24 UTC","Log Number":"US-09082009-0037","Object Flight Path":"Straight-line path","Region":"Wisconsin","files":["/var/www/straped/mufon/html2text/19164.html.txt","/var/www/straped/mufon/org/19164.html"],"divs":["Sighting DetailsI was sitting in my backyard on the phone with my Dad. I glanced at the sky to my right and saw what looked like two moving stars. I thought I was seeing things, as it appeared to be like two stars from a constellation just moved. So I squinted my eyes and realized I was not seeing things, but that there were two star like objects flying in perfect unison. They were extemely bright and whitish in color. There was no blinking, just the constant bright white. There was no sound. They flew slower than planes do. One was in front of the other, but this is the strange thing. They kept the same distance between them the etire time. It was too perfect. They flew from my right crossing over my house and my neighbors to my left. I then ran in front to continue watching until they disappeared over some trees that then blocked my sight. The entire time I was in awe at what I was seeing. I was describing it all to my dad who I was on the phone with. I have never in my life seen anything like this and am pretty perplexed. After visiting this site I have seen that other people are decribing the same thing being seen at the same time. How could this be? How could I be seeing the same thing someone in Nebraska, New York, and Illinios saw and all at the same time?!!!"],"Longitude":"-88.231481","Summary":"Two star like objects flying in silent unison","Object Features":"None","Tags":"City","Date of the Event":"09/08/2009 08:15 UTC","Latitude":"43.011678","Case Number":"19164","Country":"United States","Disposition":"Unknown","Object Shape":"Star-like","trends":["There have been 6 other sightings in Waukesha","There were no other sightings in Waukesha on or around September 8th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.011678,+-88.231481(19164)&iwloc=A&hl=en\"> mufon case (19164) map </A>","City":"Waukesha"}