{"Log Number":"US-09082009-0042","Region":"Illinois","Date Submitted":"09/08/2009 11:51 UTC","Disposition":"Unresolved","Country":"United States","Longitude":"-88.833487","Weather Factors":"None","Case Number":"19169","files":["/var/www/straped/mufon/html2text/19169.html.txt","/var/www/straped/mufon/org/19169.html"],"Object Features":"Unknown","trends":["There have been 8 other sightings in Ottawa","There were no other sightings in Ottawa on or around September 8th 2009"],"Object Shape":"Star-like","City":"Ottawa","Tags":"City","divs":["Sighting DetailsI was outside working on my truck between 8:30pm and 9:00pm. I got a weird feeling and needed to look up. When I did I was in awe. A very bright point of light brighter than Jupiter was directly over head. To the right and in front of the light was a smaller point of light. Both objects were moving northeast and had no flashing strobes or any red or green lights. I ran inside to get my wife and grabbed my binoculars, Simmons model 1107 10x50. I looked through the binoculars at the brighter object. It still had the same shape but a little hint of red was evident. The smaller object was starting to fade out. Within a minute the smaller light vanished. The large and still bright object was gradually dimming but could still be seen very clearly with the naked eye. An airliner was approaching the large light from the southwest. As the airliner got closer, the light would fade even more. Eventually the light vanished. The airliner stayed on its course. My wife and I watched the area for about 2 minutes. Then directly above us another light appeared out of nowhere. It was just as bright as Jupiter. It sat still for about 2 seconds and then started moving north slowly. I watched through my binoculars for maybe 10 seconds until it faded out. It appeared to fade out not from moving north but from moving up away from Earth. I sat outside for one hour and saw many jets but no other bright lights."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.354869,+-88.833487(19169)&iwloc=A&hl=en\"> mufon case (19169) map </A>","Date of the Event":"09/08/2009 08:45 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Latitude":"41.354869","Summary":"Very bright star-like point of light with smaller light next to it moving northeast","Object Flight Path":"Hovering then path","Source":"MUFON"}