{"Object Features":"Unknown","Latitude":"38.069884","Source":"MUFON","Object Shape":"Blimp","Date of the Event":"11/30/0001 10:05 UTC","Weather Factors":"None","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/19170.html.txt","/var/www/straped/mufon/org/19170.html"],"Country":"United States","Longitude":"-103.221628","trends":["There has been one other sighting in Las Animas","There were no other sightings in Las Animas on or around November 28th 0001"],"Case Number":"19170","Date Submitted":"09/08/2009 11:57 UTC","Region":"Colorado","City":"Las Animas","Tags":"City","Log Number":"-09082009-0043","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=38.069884,+-103.221628(19170)&iwloc=A&hl=en\"> mufon case (19170) map </A>","Object Flight Path":"Hovering then path","divs":["Sighting DetailsShe indicated that she has had one previous very dramatic sighting at the age of 18 and occurred in December 1989 or 1990. She also indicated that she is an accomplished medium and partially supports herself by giving readings for individuals in the community. She is acutely aware of the realities outside of the traditional three-dimensional world. Her original sighting occurred at the approximate age of 18 when she was driving home late at night on the road between La junta and Los Animas Colorado at approximately 10:00 PM. She noted a great light hovering over an abandoned farmhouse and observed a large line of cars stopped on the side of the road watching the spotlight. She got out of her car to watch along with the other observers and watched this spotlight moving toward them silently. It abruptly shut off its spotlight and she was able to observe multicolored lights around its large oblong dimension of approximatly 40 yards. She remembers remarking to the truck driver standing near her that she had a camera in the car and was going to get it out. At that point there is a blank episode and she came to an unknown time later with the unknown object approximately a half a mile away and moving off into the distance. She had no way of explaining why she did not get her camera out of the car. She has no recollections of any other events happening to her in the blank interval. She drove onto the next town and stopped at a pay telephone to call her mother and report the incident. She remembers she was crying while talking to her mother. She reported no health problems during or after the incident. She gave me the name of her mother and her phone number so that I would be able to call her mother and get more details."],"Sighting Duration":"00:05:00","Summary":"Bright search light hovering over an abandoned farmhouse."}