{"Object Flight Path":"Path with directional change,Path then hovering","Summary":"Watching Orb coming from South - headed North. It slows down to a stop, moves a little more, and seems to turn into Jupider.","Log Number":"US-09092009-0007","Date Submitted":"09/09/2009 01:11 UTC","Latitude":"39.533563","Disposition":"Insufficient Data","divs":["Sighting DetailsSo, there I was walking down a dark path outside of my apartment complex. I do this often. I happened to look up at the sky (As I do seemingly do wndlessly nowadays) and spot a bright white orb coming from the South. This is no surprise to me, for I have seen them often, yet I still become excited. It's coming from the far South, traveling at a steady speed to the North. As it gets closer, I watch it wobble a bit. I decided to sit down on the path and watch it hover over my head, but soon realize that it it slowing down. It's traveling at such a slow speed, that it's difficult to detect any movement at all. It then speeds up again, travels about an inch (From my perspective), stops again, repeats, then moves about an inch to the left. This is when it suddenly hit me. I thought, \"wait a minute, where is Jupider?\" I had seen Jupider every night-gazing at it's bright presence. This is where it is extremely difficult to explain. I realized that the entire time that I was watching this orb move from the South, that it was the only light in the sky. When it stopped, it stopped exactly where Jupider has been every night. There was no Jupider present at the time of the sighting. As far as my mind in concerned, the orb stopped right where Jupider should have been. I can look out of my window right now and see Jupider in it's normal spot. My head was tinkered with at that moment what happened. This isn't my typical orb sighting. I still feel extremely confused right now! ;) Part of my brain is saying that Jupider, at this time, is indeed itself. The other half is saying that it's still the orb that stopped there 30 minutes ago. I have been getting frequent \"Brain buzzes\" ever since."],"Date of the Event":"09/08/2009 09:15 UTC","City":"Reno","Weather Factors":"None","Case Number":"19177","Tags":"City","Country":"United States","Source":"MUFON","Longitude":"-119.804303","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around September 8th 2009"],"Sighting Duration":"00:08:00","Region":"Nevada","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.533563,+-119.804303(19177)&iwloc=A&hl=en\"> mufon case (19177) map </A>","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/19177.html.txt","/var/www/straped/mufon/org/19177.html"]}