{"files":["/var/www/straped/mufon/html2text/19173.html.txt","/var/www/straped/mufon/more/19173_submitter_file1__TrajectoryMap.JPG","/var/www/straped/mufon/org/19173.html"],"divs":["sighting detailswent out on back patio for a smoke and looked up overhead to see two bright stars but they moving in a ne direction toward edwards afb. one behind the other, maintaining the same distance from each other, as if being \"towed\". i called my son outside to look when the \"stars\" light was not strobing, getting dimmer or changing in any way as they moved away. several planes were in the area with visible strobes, and i could hear the other planes, but these stars were silent from directly overhead to disappearing on the horizon. i believe this is what was seen at fort dodge earlier? case number: 19160 log number: us-09082009-0033 submitted date: 2009-09-08 22:40 event date: 2009-09-08 20:05 city: fort dodge region: iowa country: us longitude: -94.2531 my longitude:118.375460n latitude: 42.5075 my latitude:34.111250w shape: star-like description: was outside this evening talking to some neighbors. i looked up into the sky and saw two objects that appeared to be large stars. one was following the other as they traveled nw at a moderate speed. several of us witnessed the event. at first i thought they might be satellites, but they seemed to be too low. space station\\shuttle passing way overhead? i don't think it was up that high as reported above. the track would take them through the middle of van nuys airport, the middle of hollywood\\burbank airport, then over some foothills to edwards afb. the strange thing about the objects white glow was it continued to be bright even after it passed overhead, planes have very directional landing lights, they dim as they head away from you."],"Object Flight Path":"Straight-line path","Source":"MUFON","Case Number":"19173","Longitude":"-118.50578","Tags":"City","Date Submitted":"09/09/2009 12:19 UTC","Sighting Duration":"Undisclosed","Disposition":"IFO","City":"Los Angeles","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 8th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=34.202467,+-118.50578(19173)&iwloc=A&hl=en\"> mufon case (19173) map </A>","Date of the Event":"09/08/2009 07:20 UTC","Viewing Distance":"Over One Mile","Region":"California","Log Number":"US-09092009-0003","Latitude":"34.202467","Object Features":"Unknown","Country":"United States","Weather Factors":"None","Summary":"Matches Fort Dodge Event Today Except Direction Of Flight NE","Object Shape":"Star-like"}