{"Longitude":"-82.130792","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19186.html.txt","/var/www/straped/mufon/org/19186.html"],"Sighting Duration":"Undisclosed","Log Number":"US-09092009-0016","Tags":"City","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","trends":["There have been 21 other sightings in Ocala","There were no other sightings in Ocala on or around September 9th 2009"],"divs":["Sighting DetailsWas disturbed from sleep at 4am by a feeling of urgency to be outside. Made my coffee and proceded outside with the dogs. Sitting on the trunk of the car and viewing the sky, upon first sight nothing seen. Then, coming in fast from Southwest approximately 3 to 4 miles out (from Haunted Woods), appears to be a saucer like craft heading East - Southeast. Stopping and hovering approximately 3 to 4 miles from my location, 2 beams of light radiating from what then became a Star-like object (because of distance) with rotating colors of red, blue, yellow, green and brilliant white. Object was moving eradically in all directions but, staying in close proximaty to (Ocala National Forest) bombing range. Hound dogs in the neighborhood started whining and howling and barking, while my dogs ran about in all directions and whined alot. The horses in the field next door were acting strangely also. There were no sounds of insects or birds except, that of an owl hooting. My reactions are as they always are and have been for many years, saying to myself, it's about time. It seems that throughout my life they come every 3 years. I'm an old veteran at this. Since I was 3-years-old, up to now and I'm sure years to come. I have worked with M.U.F.O.N. before and have been requested to go on investigations of other reports in my area because, I am tuned in to whatever THEY are. I have in the past worked with Alien Abductees, was for awhile a Crop-Circle interpretor and have come in contact with the Men-in-Black. I was an advisor on UFO landing sites in various areas across the nation and have given lectures on the subject. I lost sight of the object by coming back inside to report the info to you. I thought since it had been 3 years since my last sighting that you would be most interested hearing from me again. NOTE: Haunted Woods, a place where a lot of very strange activities happen. Two unpaved roads run through it from East to West and drivers have reported to the local Sherrifs Department, sightings during day light and after dark of phantoms, ghost, aliens, strange crafts flying at tree top levels, creatures, cryptids, brilliant ORBs floating along sides of road and sometimes seen crossing, voices, screams, sounds of running and people going missing. This is where my last encounter was. I was traveling west with some friends, a saucer craft followed along the north side of the car a little over a hundred feet away, when I stopped it stopped, when I proceded it proceded, when I went faster it went faster. But, when I reached the edge of the woods, it vanished. All in the car witnessed the sighting. Local Sherrifs Department tries to deter people from stopping or wondering in these woods. This is a continous ongoing event."],"Object Features":"Unknown","Source":"MUFON","City":"Ocala","map":"<A HREF = \"http://maps.google.com/maps?q=29.194649,+-82.130792(19186)&iwloc=A&hl=en\"> mufon case (19186) map </A>","Region":"Florida","Summary":"Moving eradically with beam of light and aray of colors, E-SE, 3-4 miles","Object Shape":"Star-like","Date Submitted":"09/09/2009 07:00 UTC","Latitude":"29.194649","Case Number":"19186","Date of the Event":"09/09/2009 04:30 UTC","Country":"United States"}