{"Source":"MUFON","Date of the Event":"09/08/2009 04:15 UTC","Object Shape":"Circle, Cylinder","files":["/var/www/straped/mufon/html2text/19180.html.txt","/var/www/straped/mufon/org/19180.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.224593,+-110.918469(19180)&iwloc=A&hl=en\"> mufon case (19180) map </A>","Summary":"Green undulating object inside clear circle.","Region":"Arizona","Date Submitted":"09/09/2009 02:16 UTC","Longitude":"-110.918469","City":"Tucson","Object Flight Path":"Path with directional change,Other","Log Number":"US-09092009-0010","Object Features":"None, Unknown","Sighting Duration":"02:15:00","divs":["Sighting DetailsStorm, cumulus clouds were gathering over me. As I happened to look up, I noticed a green, undulating shape, which was causing the clouds to appear to be breathing. As it moved, so did the clouds. It moved from a storm cloud, which had had some lighting activity, over to another cloud. Then it moved to some cirus cloud, which were more transparent, allowing it's shape to become more discernable. It then began to move around behind many of the clouds and before I knew it, it was out in the open. The green activity, which look remarkably like that of a Tesla coil, was enclosed in a clear, circular object, which appeared to be, at least, one mile in diameter. Remaining at a high altitude, it moved directly over me. I felt that it knew that I was following it's movements. It then moved slowly over to another set of cirus clouds, and then it completely zoomed out of sight. I had a distinct feeling that it knew that I could see it, especially when it moved directly over me and then into the small cirus cloud. I saw the object several more times throughout the day as the electrical storm continued. The lighting was spectacular and the object seemed to be drawn to the energy being put out by the lighting producing clouds. The outter membrane of this object remained clear, at all times. The internal Tesla looking activity, was emerald green in color, looking remarkably like a flat, clear tesla coil."],"Latitude":"32.224593","Tags":"City","Disposition":"Unknown","Country":"United States","Weather Factors":"Windy, Lightning, Rain, Light","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 8th 2009"],"Case Number":"19180","Viewing Distance":"Unknown"}