{"Object Features":"None","Date of the Event":"09/08/2009 09:18 UTC","Latitude":"40.444545","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/19188.html.txt","/var/www/straped/mufon/org/19188.html"],"divs":["sighting detailswhile setting in the living room of my apartment watching t.v., i heard what sounded like someone outside talking loudly, so i steped out on the balcony to see who it was. there was nobody outside, but i concluded that it must have been the downstairs neighbors. it was a cool but comfortable evening, so i decided to stand outside for a few minutes. the sky was mainly clear with some clouds low in the eastern sky, but the stars were easily observed. having a background in artillery survey and land navigation in the military, its normal for me to look for survey\\navigational stars and constellations in the sky. as i looked up at the big dipper(ursa major) i noticed two star like objects traveling about three finger widths apart at arms distance moving from west to east on a steady course and maintaining a constant interval passing just below the north star(polaris). the two objects were of about the same brightness(magnitude) as the pointer stars in the big dipper. they did not blink or sway as they moved through the sky. i called out to my girlfriend who was working on her computer in the living room to come as a witness and to get her perspective. we observed as they continued on a steady course until they faded away. they did not go beyond the horizon, but looked as though they were climbing out of the atmosphere. i noted the time and date on my wrist watch as 9:18pm 09-08-2009. the observation lasted approximatly two minutes from beginning to end."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.444545,+-79.994696(19188)&iwloc=A&hl=en\"> mufon case (19188) map </A>","Object Flight Path":"Straight-line path","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Summary":"Two star like objects moving from W. to E. in Northern sky over Pittsburgh","Region":"Pennsylvania","City":"Pittsburgh","Tags":"City","trends":["There have been 122 other sightings in Pittsburgh","There was one other sighting in Pittsburgh on or around September 8th 2009"],"Case Number":"19188","Date Submitted":"09/09/2009 09:34 UTC","Longitude":"-79.994696","Log Number":"US-09092009-0018","Country":"United States","Weather Factors":"Unknown"}