{"map":"<A HREF = \"http://maps.google.com/maps?q=39.291545,+-76.604669(19181)&iwloc=A&hl=en\"> mufon case (19181) map </A>","Date of the Event":"04/30/1999 12:00 UTC","Source":"MUFON","Object Shape":"Sphere, Triangle","Sighting Duration":"Undisclosed","Viewing Distance":"20 Feet or Less","Tags":"City","Date Submitted":"09/09/2009 02:25 UTC","Weather Factors":"Unknown","Summary":"It was shape like the Millary Plane F-117 Night Hawk, and Also on top it had a lit pan cake shape.","Country":"United States","files":["/var/www/straped/mufon/html2text/19181.html.txt","/var/www/straped/mufon/org/19181.html"],"Region":"Maryland","City":"Baltimore","Object Features":"Patterned Surface, Other","Case Number":"19181","Object Flight Path":"Stationary,Straight-line path,Path with directional change","Longitude":"-76.604669","Disposition":"Unknown","Latitude":"39.291545","divs":["Sighting DetailsFirst I must say, I never did Believe in U.F.O s Coming From a christian family,we were taught there was not such a thing. That GOD created man and the universe,which I know He did. But on that night it change my thinking, that in this vast universe GOD could have made other Beings. Well Back to the sighting.I have not share this experience with much people,Because the thing, they think your crazy.Well to the sighting. My nephew and I were siting on buckets,fishing off the Boat ramp in Port Deposit Md, at the Park at the end of town. Siting there for about a hour,my nephew ask me, uncle Rodney what are those lights at the other side of the river. The river is about a mile wide. So I said to him, it's Probably a Helicopter. And being at night,the thought hit me,you can hear voices across the river. Then no soon I thought that,I hear like this humming noice. I look to my right, and about 50 feet up along the bank ling we see this U.F.O. hoveing. Then it came very slowley coming toward us,and when it got right above our Heads, It stay there hoveing for a minute or so.Then I said to my nephew,do you see what I see? He couldn't say nothing.You coudn't feel nothing,and it didn't,it didn't do anything to the water.So I just stood there looking up and in,all what this U.F.O. look like. First I notice it was shape like a F-117 Night Hawk. But the metal wasn't smooth. It look like something you would see in Starwars. In the Milltary they have a Helicopter called the Apache,which has a LongBow on top. This U.F.O. had something like thaton top,but it was lit up,with different colors.And it had two big lights,under,say the wings like,which were about a foot in diameter.Which were very bright.Then it just slowley went down the bank a little further,and you could hear like it kit in gear in went toward the middle of the river,and went up and shot over Route 95 Bridge.I wish we would have had a camera or something, because just 50 feet over our heads,we would had some interesting pictures.When I see Our LORD, that's one of the questions I will be asking HIM."],"trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around April 30th 1999"],"Log Number":"US-09092009-0011"}