{"divs":["Sighting DetailsWhile walking my dog in Demarest NJ (Wakelee field), I looked up and saw what at first looked to be a very bright star. As I stopped to watch, I noticed that it was moving very very slow, in a northwesterly direction, as I continued to observe the object, another object flew directly behind it, and directly overhead. On the same course as the first object. As I stated in the short description, both objects were extremely bright and looked like extremely bright stars; except alot larger and much closer. The conditions were partly cloudy, and the height of the clouds was approximately 3600 - 5500 feet above sea level according to the weather station that I logged into. These 2 objects were flying below the cloud coverage, and directly overhead, and made absolutely no sound at all. I know this is a busy airspace, as planes are constantly flying into Stewart Airport, and going to Newark Airport. I can say without a doubt that these were not aircraft, nor were they helicopters. The sighting lasted from 20:11 to 20:13. When I noticed the first object I looked at the time, and when the second object disappeared behind the trees, the time was 20:13."],"Summary":"While looking up saw extremely bright light followed by another bright light","Date Submitted":"09/09/2009 10:09 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.95732,+-73.963471(19199)&iwloc=A&hl=en\"> mufon case (19199) map </A>","Weather Factors":"None","Log Number":"US-09092009-0027","Tags":"City","Object Features":"Unknown","Latitude":"40.95732","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Shape":"Star-like","Sighting Duration":"Undisclosed","City":"Demarest","Source":"MUFON","trends":["There have been no other sightings in Demarest","This sighting has never been favorited."],"Disposition":"Unknown","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/19199.html.txt","/var/www/straped/mufon/org/19199.html"],"Longitude":"-73.963471","Case Number":"19199","Object Flight Path":"Straight-line path","Date of the Event":"09/09/2009 08:11 UTC"}