{"Log Number":"US-09102009-0003","Weather Factors":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/19209.html.txt","/var/www/straped/mufon/org/19209.html"],"Object Flight Path":"Undisclosed","Latitude":"37.346876","Region":"California","Object Shape":"Unknown","Date of the Event":"09/07/2009 12:00 UTC","Tags":"City","trends":["There have been 106 other sightings in San Jose","There were 2 other sightings in San Jose on or around September 7th 2009"],"divs":["Sighting DetailsDate and time of observation: Monday, Sept. 7, 2009, 9:05 pm. Viewing location: San Jose, California Direction observed: looking towards the southwest Elevation of object: about 30 degrees Distance of object: estimate very high altitude or low earth orbit Description of object: bright red light, not quite steady and slightly unstable. Direction of travel of object: lateral across the horizon towards the south Speed of object: unable to determine without knowing distance. Much slower than a passing satellite. Duration of sighting: ten minutes. During that time the object slowly dimmed out and became barely visible to the unaided eye. About a minute later it came on bright again and continued so for several more minutes as it continued to move very slowly to the south. Distance covered: about 15 degrees of a 360 degree circle. Witnesses at my location: five including me. Witnesses at other locations: none. I called a friend in San Mateo which is 30 miles to the north, and another person 60 miles to the south during the event. Neither person could see the red light. The person 60 miles to the south could easily see Jupiter which I used as a nearby reference point (almost the same elevation although Jupiter was about 45 degrees to the south of the red light). Tools used: 10-40x60mm binoculars without a tripod. No camera or video. What I ruled out. Mars or any planet. Just too bright. Aircraft didn't seem likely to me either. I've seen both day and night missile tests before and know how they appear, and this didn't look like a missile on re-entry. When satellites move across the sky their movement is apparent. The red light was barely moving when compared to background stars as seen through binoculars. Possibility: space station and shuttle activity related. The shuttle is currently docked to the station, and according to the sightings page for my area they had just passed that area of the night sky ten minutes prior. However, I have seen the space station pass on numerous past occasions and it's orbit is much much faster than the red light I observed. The proximity and timing are close and I think it's likely related. Maybe something was either accidently or intentionally dropped from the space station that burned up on entry with the atmosphere."],"Sighting Duration":"Undisclosed","Source":"MUFON","City":"San Jose","Object Features":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=37.346876,+-121.890026(19209)&iwloc=A&hl=en\"> mufon case (19209) map </A>","Longitude":"-121.890026","Summary":"Red light, almost steady, possibly high altitude or low earth orbit","Viewing Distance":"Unknown","Case Number":"19209","Date Submitted":"09/10/2009 03:21 UTC"}