{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.501158,+-82.933011(19202)&iwloc=A&hl=en\"> mufon case (19202) map </A>","files":["/var/www/straped/mufon/html2text/19202.html.txt","/var/www/straped/mufon/org/19202.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Date of the Event":"09/09/2009 09:41 UTC","Latitude":"42.501158","Case Number":"19202","Date Submitted":"09/09/2009 10:22 UTC","Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"Space Shuttle with hooked shape cloud or exhaust tail- followed by ISS.","Log Number":"US-09092009-0030","Disposition":"IFO","Country":"United States","trends":["There have been 14 other sightings in Roseville","There was one other sighting in Roseville on or around September 9th 2009"],"divs":["sighting detailsi was waiting for the space shuttle to cross the sky according to the human space flight website at 9:41 pm, at about 24 degrees altitude started from the nnw and faded out almost due north. what was unusual about it was that i could see that there was a cloud or exhaust trail that appeared to be hooked shaped and changing shape. the plume must have been many hundreds of yards long because the shuttle was a tiny dot and this plume was about 4 degrees wide. it was beautiful. i imagine the plume was the result of a burn to change orbit, because the cloud was only visible for about 85% of the sighting and changed shape. the trail looked almost like a comet tail. the iss passed by about one minute later with no plume. i decided to report this because of all the 'two moving stars that followed each other' sightings reported yesterday across the country, which was in all liklihood, the space shuttle followed by the iss. check out this website for current sighting info on the space station and shuttle. http:\\\\spaceflight1.nasa.gov\\realdata\\sightings the shuttle and the iss appear as rather bright stars, brighter than jupiter, and if the angle is high enough, the sighting can last several minutes. the objects will appear to travel straight or with a slight arc, moving a bit faster than a passenger jet, but will not have abrupt zig zag movements. this sighting ranks up there with real ufo sightings i have seen due to the beauty and unexpectedness. fastest cloud i ever saw, over 17,000 mph following the tail end of the shuttle. keep your eyes to the sky!"],"Longitude":"-82.933011","Object Shape":"Fireball","Tags":"City","City":"Roseville"}