{"Date Submitted":"09/10/2009 12:20 UTC","divs":["sighting detailson 9 \\ 06 \\ 2009, i was in the adirondack mountains, in the back yard of a house that borders on a small lake known as sherman lake, in the town of warrensburg. i was gazing up at the sky in an effort to spot a ufo. after about a half hour of looking - at about 2:00 am, i observed what i thought was simply one among many stars, suddenly begin to move. it moved slowly for about ten seconds, before taking a 45 degree turn and disappearing behind the treetops. on that same night - again at a great height - what appeared as a \"cluster\" of dim lights that were not as clear or as bright as the stars were, began moving very slowly. the vaguely lit object or objects had a shape that i could not determine, but it must have been quite large. as it moved, i was trying to contact it with a light from a lantern that i kept turning on an off. the sighting itself kept appearing and disappearing, as if it were turning it's own lights on and of, and it finally dawned upon me that it may have been responding to my signals. when this thought enterred my head, what impressed me was it's extreme \"clarity.\" the thought did not seem to come from me, but instead, seemed to have been placed there. i don't recall exactly how i lost sight of this object. i hesitate to tell this story to anyone because, when i do, i get the feeling that they think i'm a nut. the fact is, that i would guess that in about 30% to 40% of the times that i go the adirondacks, i see what appears to be a legitimate extraterrestrial sighting. my wife didn't believe me until, one night i called her out and she saw for herself. i believe that these were both ufo sightings.? please send me your opinions. i will follow this e-mail up with descriptions of other sightings that i experienced - most of them in the adirondacks. i have never experienced a sighting on long island, howwever, which is where my home is. mike"],"Sighting Duration":"02:00:00","City":"Lake George","Country":"United States","Case Number":"19208","Object Shape":"Star-like, Other","Disposition":"Unresolved","Summary":"I saw two things in the night sky in the Adirondacks. One appeared star like, the other appeared as a dim \"cluster\" of lights.","Region":"New York","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/19208.html.txt","/var/www/straped/mufon/org/19208.html"],"Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.435301,+-73.705331(19208)&iwloc=A&hl=en\"> mufon case (19208) map </A>","Tags":"City","Longitude":"-73.705331","Object Features":"Unknown","Weather Factors":"Unknown","Date of the Event":"12/06/2009 02:00 UTC","trends":["There have been 6 other sightings in Lake George","There were no other sightings in Lake George on or around December 6th 2009"],"Log Number":"US-09102009-0002","Latitude":"43.435301"}