{"Disposition":"IFO","Date Submitted":"09/10/2009 02:03 UTC","Weather Factors":"Unknown","Log Number":"US-09102009-0013","Longitude":"-121.834638","files":["/var/www/straped/mufon/html2text/19219.html.txt","/var/www/straped/mufon/org/19219.html"],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.731494,+-121.834638(19219)&iwloc=A&hl=en\"> mufon case (19219) map </A>","Region":"California","Tags":"City","Source":"MUFON","Object Flight Path":"Undisclosed","Country":"United States","divs":["Sighting Detailswas standing outside in my backyard at approx. 8:00 pm, smoking, staring at the stars as always, looking NW towards Mt. Shasta direction. First noticed this huge bright star drop down from my left. It kinda flashed, then started slowly moving NW low in the sky. As I was watching it, another one dropped down from I believe my right side, did the same flash, and fell in behind the other on in the same course. Both were glowing very bright yellowish white, no pulsations, and not a sound at all. I know they could not have been planes, as I live near the city airport, and all planes have strobes. These were larger that any plane I've ever seen. They were very low, probably as low as some of the planes passing over, but the size of them dwarfed anything else I've seen in the sky here. I wanted to go get my camera, but was afraid they would be gone, so I kept watching them move their straight course NW. slowly, the second one following the first by approximately 30-45 seconds. They never turned, or made any sound. I just kept watching them until they disappeared from my view due to trees in the distance. I got a great view for about 3-4 minutes. I was so excited, as my first reaction was that it was 09-09-09, and they were headed towards MT. Shasta, where the OM crystal was to be activated that day. I am certain they were not anything from this world, I just kept feeling wonder, and love feelings from seeing them."],"Latitude":"39.731494","trends":["There have been 24 other sightings in Chico","There were no other sightings in Chico on or around September 9th 2009"],"Sighting Duration":"Undisclosed","Case Number":"19219","Viewing Distance":"Unknown","Summary":"saw 2 huge starlike objects drop from sky-then slowly move NW","Object Shape":"Star-like","City":"Chico","Date of the Event":"09/09/2009 12:00 UTC"}