{"Region":"Michigan","Weather Factors":"Medium","Tags":"City","divs":["Sighting DetailsMy Friend and i walked down to the beach at the Rosy Mound Natural Area just a couple miles south of Grand Haven Mi to watch the sunset.The sun set around 2030 (8:30). We decided to stay a while longer to see the stars come out. After about an hour or so of talking and looking at the stars i noticed that there was an unusually bright light out over Lake Michigan going west to east. At first i thought it was a plane with its landing lights on coming thru the clouds. Then I realized that there were no clouds in that direction. As it flew closer i asked my friend if she saw what i saw. She confirmed that she also saw it and asked me what it was. I told her i had no idea. It had no green or red marker lights to distinguish it as a commercial jet nor did it have a strobe light. It was just a bright white light with a unusual Aura surrounding it. It gave me chills and the hair on my arms stood straight up as it got closer. I called my Mom who lives a few miles away and told her what i was seeing and to ask if she could see it also. She could not due to the area she lives in being a wooded area. It was flying on a straight path. It almost looked like it was speeding up and then slowing down then speeding up again. As it neared the shore line i noticed another light following about 10 to 15 seconds behind the first one. This object was emitting the same color light but did not have the unusual aura surrounding it.Both lights made no noise as they flew by which made it all the more creepy. As they crossed over land and flew farther east the lights eventually went out of site. After they were out of site we stayed there for another hour or so to see if they would come back or see if more would follow but nothing else was seen."],"Summary":"two ufo's flying over Lake Michigan.","trends":["There have been 9 other sightings in Grand Haven","There were no other sightings in Grand Haven on or around September 9th 2009"],"files":["/var/www/straped/mufon/html2text/19215.html.txt","/var/www/straped/mufon/org/19215.html"],"Country":"United States","Case Number":"19215","Disposition":"IFO","Date of the Event":"09/09/2009 12:00 UTC","Latitude":"43.064373","Object Features":"None","Source":"MUFON","Sighting Duration":"Undisclosed","City":"Grand Haven","Object Shape":"Oval","Date Submitted":"09/10/2009 11:12 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.064373,+-86.218506(19215)&iwloc=A&hl=en\"> mufon case (19215) map </A>","Viewing Distance":"Over One Mile","Longitude":"-86.218506","Log Number":"US-09102009-0009"}