{"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Object Shape":"Oval, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=43.860064,+-76.005478(19214)&iwloc=A&hl=en\"> mufon case (19214) map </A>","Viewing Distance":"Unknown","Latitude":"43.860064","City":"Adams Center","Object Features":"Undisclosed","divs":["Sighting DetailsOur Friend was over. She was leaving after stoping by to see our new puppy. I was looking up into the sky. Like I usually do on a clear night. I noticed a big ..bright starlike object that blinked out. the blinking caught my eye, then I was looking in direction where it was , when it blinked on again. But now a Blue light. like neon blue. also starlike but alot closer. It was slowly moving. when i started to tell the two people that were with me. They saw it too. It moved quicker , With no lights blinking only a blue neon type. it moved across the entire sky in 3 minutes... No noise. it was quiet and we also live in the country..no other sounds No blinking airplane lights either. Just a neon light. My Fiancee said there was another way ahead of it..\"which i didnt see bad eyesite or was too small for me\" she has better vision though. Big blue.. it was huge not like a lil dot..but rather large it had shape...like a orb or star I would say. It finally was out of my site cause it traveled the entire night sky.. My friend amy.. kept repeating its has no noise ...and its not no plane. Fiancee thought maybe expermental craft. but we all agree it wasnt a plane or a jet. helicopter, military or anything we ever seen before. Including drones.... we have them locally because of ft drum and canada border for patroling. This was no wings no body of any sorts.... Just a big blue light."],"Sighting Duration":"Undisclosed","Date Submitted":"09/10/2009 10:30 UTC","Log Number":"US-09102009-0008","Date of the Event":"09/09/2009 09:01 UTC","Case Number":"19214","trends":["There have been no other sightings in Adams Center","This sighting has never been favorited."],"Longitude":"-76.005478","Summary":"BLUE LIGHT ,NO flashing. big.","Region":"New York","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/19214.html.txt","/var/www/straped/mufon/org/19214.html"],"Tags":"City","Source":"MUFON"}