{"Object Flight Path":"Path with directional change","Latitude":"52.9602","Date of the Event":"09/09/2009 09:18 UTC","Date Submitted":"09/10/2009 04:21 UTC","City":"Nottingham","files":["/var/www/straped/mufon/html2text/19211.html.txt","/var/www/straped/mufon/org/19211.html"],"Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Nottingham","There were no other sightings in Nottingham on or around September 9th 2009"],"Disposition":"Unresolved","Region":"England","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=52.9602,+-1.157076(19211)&iwloc=A&hl=en\"> mufon case (19211) map </A>","Sighting Duration":"Undisclosed","Case Number":"19211","divs":["Sighting DetailsI was sitting in my back garden last night for some fresh air. Now I have seen strange glowing lights before out in my garden so because my girlfriend was out thought id sit outside for a bit. After about 20mins or so I saw 4 red lights in a square formation moving quite quickly in the distance. they went out of view so i ran through my house to the front and onto the street and saw one of them move away fromt he formation and move quickly in another dorection while the remaining 3 lights vanished into the distance. I was amazed with this sitting because it was such a clear night and the way they throbbed was amazing! To be honest, im getting kinda used to seeing these things. Me and my girlfriend have witnessed them 3 times this year, including 2 orange lights dancing around each other. I tried to take video (which is why i know the exact time of the event) but you cant see anything. All you see is me running through the house going \"OMG!\" lol. An amazing sighting I thought I should report to see if any one can shed any light on it. thanks"],"Weather Factors":"Unknown","Country":"United Kingdom","Log Number":"GB-09102009-0005","Object Features":"None","Object Shape":"Other","Longitude":"-1.157076","Source":"MUFON","Summary":"red throbing lights in square formation"}