{"Latitude":"33.451177","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/10/2009 03:37 UTC","divs":["Sighting DetailsMy 12 year old daughter went to check the mail box and as she walked outside our house she witnessed floating above our street a round object not too far in the distance. she quickly grabed her cell phone in her pocket and snapped off two photos. This happened on a school day approximately around May 2009 around 430 to 530 pm. Sorry, I do not remember the exact dates. What is interesting is she managed to capture the object as it tilted and moved off. You can see the landmarks of the houses and the trees to get a distance measurement and size approximation of the object. she was very excited when she showed me the pictures. I think the whole event lasted only for a few seconds Look at the second attached photo first The object should be seen stationary Entitled ufo jpg. The other photo entitled ufo 1.bmp should be the object moving away from the camera over the trees. I had a little difficulty downloading the images If you do clean them up I would like to see them, please I hope thiis is helpful to your investigations"],"Region":"Arizona","Source":"MUFON","Disposition":"Unknown","Date of the Event":"04/30/2009 04:00 UTC","Object Features":"Dome","Weather Factors":"None","Log Number":"US-09102009-0004","Longitude":"-112.069037","trends":["There have been 417 other sightings in Phoenix","There were 2 other sightings in Phoenix on or around April 30th 2009","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=33.451177,+-112.069037(19210)&iwloc=A&hl=en\"> mufon case (19210) map </A>","Country":"United States","City":"Phoenix","Summary":"round squart object flat on bottom with thicker midsection and tapering top","Tags":"City","files":["/var/www/straped/mufon/html2text/19210.html.txt","/var/www/straped/mufon/more/19210_submitter_file2__ufo.jpg","/var/www/straped/mufon/org/19210.html"],"Object Shape":"Blimp, Circle, Cylinder, Disc","Case Number":"19210","Sighting Duration":"00:00:10"}