{"Weather Factors":"None","Longitude":"-84.100706","Date Submitted":"09/10/2009 09:21 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.746661,+-84.100706(19227)&iwloc=A&hl=en\"> mufon case (19227) map </A>","Tags":"City","Latitude":"40.746661","City":"Lima","Case Number":"19227","Date of the Event":"09/09/2009 09:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Lima","There were no other sightings in Lima on or around September 9th 2009"],"Disposition":"Unknown","Log Number":"US-09102009-0021","Region":"Ohio","divs":["Sighting DetailsI went outside just to smoke and saw what I thought was a large bright star or planet in the sky. I was looking at it when I noticed that it had what looked like dim orbs shooting away from it and fading quickly. I then noticed that the object was growing dimmer and then brighter, and at times would appear wider. I moved out to the darker area of my driveway for a better look, when it appeared that something shot straight up from ground level to the bright object. The best way to describe it was like a shooting star in reverse. Next, it moved a fairly good distance in my direction, and that scared me after the backwards shooting star beam-me-up looking thing I had just seen, so I quickly came in and watched it from the door. Soon it stopped again, so I went out again to look. At this time I had a friend come to my house, and I asked her to look at it. She noticed it's movement and change of shape as well. We also noticed two planes that were flying in a large circle around where the object was located. As far as I know it is still out there, and it is now 9:21."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/19227.html.txt","/var/www/straped/mufon/org/19227.html"],"Country":"United States","Object Features":"Unknown","Summary":"Thought it was a star or planet but it moved and has smaller objects coming in and away from it.","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Object Shape":"Star-like"}