{"Country":"United States","Date Submitted":"09/10/2009 07:11 UTC","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19224.html.txt","/var/www/straped/mufon/org/19224.html"],"Disposition":"IFO","Object Features":"Undisclosed","Longitude":"-100.545117","Summary":"car electrical problems of unknown origin","Date of the Event":"08/12/2007 05:32 UTC","Case Number":"19224","Region":"Nebraska","trends":["There has been one other sighting in Valentine","There were no other sightings in Valentine on or around August 12th 2007"],"Latitude":"42.873963","Object Flight Path":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.873963,+-100.545117(19224)&iwloc=A&hl=en\"> mufon case (19224) map </A>","Source":"MUFON","Weather Factors":"Unknown","Log Number":"US-09102009-0018","divs":["Sighting DetailsOn Sunday August 12, 2007 my sister and I were traveling North on Hwy 83. We were between North Platte and Valentine, Nebraska. This is a familar route to us. We had passed through Thedford and had planned to stop at a rest stop called Ballard's Marsh. A few miles before we arrived there, we noticed the car's dome lights going on and off. It was broad daylight,timeline was around noon. We pulled into the rest area on the west side of the road and got back into the vehicle. We did not see any object. The transmission refused to go into gear. Luckily, the car was a Hyundai Sonata which has an alternate to the automatic transmission. It is a semi-standard model. We managed to get the vehicle into first gear and limped up onto the highway and babied it to Valentine, Nebraska where it quit completely. The other thing is a little yo-yo that was in the car with us began to activate spontaneously at strange times. The yo-yo produced lights and sounds when you would play with it but it was laying stationary in the car. This went on for months after. It had never done it previously. At this point we noticed that the cell phone which had been completely charged had lost all of its power. The phone resisted charging and actually took two attempts before holding a charge. The car had to be towed 200 miles to a dealership in North Platte where they discovered an electric sensor had gone out. We could not help but realize that we had experienced some kind of phenomenon. We do not think we had any missing time."],"City":"Valentine","Sighting Duration":"01:00:00","Object Shape":"Unknown"}