{"Longitude":"-82.996842","Region":"Ohio","Tags":"City","Summary":"Was travelling eastward very slowly above treetops","files":["/var/www/straped/mufon/html2text/19221.html.txt","/var/www/straped/mufon/org/19221.html"],"Object Shape":"Triangle","Case Number":"19221","Object Features":"Patterned Surface","City":"Lucasville","Weather Factors":"Unknown","Date Submitted":"09/10/2009 04:46 UTC","Latitude":"38.879518","divs":["Sighting DetailsMy son and I were in my car, driving to meet friends at a pizza joint one night in April of '97. It was approximately between 2000 and 2100 hours. Hale Bopp had been visible in the sky for several nights by this time, however, this night was different. On our way to meet friends, we kept noticing orange lights glowing in the sky in a vertical line. These lights would glow briefly, then go out, then glow again at different intervals with no dicernable pattern. (We later heard that these were alleged \"flares\" that the \"military were practicing\" in the sky.) So we arrived at our destination and upon exiting our vehicle, something above us caught my eye. I looked up and saw this HUGE craft, triangular in shape with small orangish-red lights on the under side, (which also appeared to have the pattern similar to that of a computer chip or motherboard) moving very, very slowly through the sky, appearing to be just above the treetops directly above where we were standing. It literally flew over my son and I in an eastward direction. I didn't know what to think of it at first. I just stood there frozen and stared with my chin hitting the ground. My son saw it also, however he was more interested in getting inside to have pizza, as I continued to stand outside in the parking lot until it flew out of sight. What struck me as being so eerie was the fact that it was moving so slowly, right above me and that there was absolutely NO sound or vibrations coming from the craft. One of my friends had actually come outside the door of the establishment to see what was taking me so long. She stood by the door at the railing yelling to me and then when I could no longer see this object, I walked up and told her what I had seen. We proceeded to go inside, eat pizza with friends and sing some kareoke songs, not bringing the issue up again at that time. Upon leaving and later returning home, I told my spouse at the time about my experience. Of course he thought I was crazy and I never really spoke much about it again. I have attempted to contact persons about this experience one other time, but never followed through with it until now. Only because I saw your program on television, and thought maybe someone would take me seriously. I know what I saw and would stand by it no matter what; even if it resorted to taking a polygraph test."],"map":"<A HREF = \"http://maps.google.com/maps?q=38.879518,+-82.996842(19221)&iwloc=A&hl=en\"> mufon case (19221) map </A>","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Country":"United States","Source":"MUFON","Date of the Event":"04/08/1997 08:30 UTC","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Lucasville","This sighting has never been favorited."],"Disposition":"Unknown","Log Number":"US-09102009-0015"}