{"Longitude":"-88.762323","Viewing Distance":"Unknown","Date of the Event":"09/10/2009 09:25 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.620535,+-88.762323(19236)&iwloc=A&hl=en\"> mufon case (19236) map </A>","Log Number":"US-09112009-0002","Latitude":"44.620535","Tags":"City","trends":["There has been one other sighting in Clintonville","There were no other sightings in Clintonville on or around September 10th 2009"],"Date Submitted":"09/11/2009 12:31 UTC","City":"Clintonville","Country":"United States","Sighting Duration":"Undisclosed","Disposition":"Unresolved","Object Shape":"Chevron","files":["/var/www/straped/mufon/html2text/19236.html.txt","/var/www/straped/mufon/org/19236.html"],"Summary":"saw series of red lights chevron shaped moving then stationary in sky at about 9:15pm","Case Number":"19236","divs":["Sighting DetailsI went outside to have a smoke. I was on the phone with my husband having a serious discussion. The lights caught my eye for a moment, but I thought it was a plane moving thru the night sky,at about 9:15pm. I disreguarded it and continued talking. A few minutes later, I saw it again near the same position, and thought boy it sure must be high up as it appeared to be moving so slowly. I noticed the shape and the red lights, five I think. Then it seemed to stop. Stay in one position, I continued to talk to my husband, and didn't even mention it to him, but I couldn't stop staring at it waiting for it to continue on it's path. My husband kept saying, \" hello!\", and we spoke a short while longer, but when I looked up again it was gone! I am not the best judge of time but we were on the phone for about forty minutes. The time between his getting my attention and me looking up again was perhaps three minutes. The lights ; if it were a plane could not have transitted the sky so quickly. A satellite would still have been visible. The lights seemed too close together to have been separate objects, but now I'm not certain. I am at a loss for an explanation. I have seen strange lights in the sky before, but not like this. Does anyone have any answers?"],"Object Flight Path":"Path then hovering","Region":"Wisconsin","Weather Factors":"None","Source":"MUFON"}