{"Country":"United States","Latitude":"42.888667","Weather Factors":"Unknown","Object Features":"Unknown","trends":["There have been 56 other sightings in Buffalo","There was one other sighting in Buffalo on or around September 10th 2009"],"Log Number":"US-09112009-0001","Tags":"City","Date of the Event":"09/10/2009 08:23 UTC","Sighting Duration":"Undisclosed","Date Submitted":"09/11/2009 12:12 UTC","Case Number":"19235","Region":"New York","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=42.888667,+-78.875189(19235)&iwloc=A&hl=en\"> mufon case (19235) map </A>","Disposition":"Unresolved","Longitude":"-78.875189","files":["/var/www/straped/mufon/html2text/19235.html.txt","/var/www/straped/mufon/org/19235.html"],"City":"Buffalo","Summary":"Four orangish hazy lights, three in a row, one to the side, traveling very fast.","Object Shape":"Cylinder, Unknown","Viewing Distance":"Unknown","divs":["sighting detailsmy wife and i went outside to watch the space shuttle at 8:21pm. it was a clear night at this time and we could see the stars very clearly. we realized that it was cool outside and went back into the house and i put on pants, a coat and a pair of boots. she went in to grab a coat. we both went out the back door and looked directly up and immediately saw these 4 hazy orangish to amber color objects flying from the south to north direction. we could only observe this\\these object\\s for about 4 seconds before it\\they went out of sight over the tree tops. let's just say \"they\" for simplicity of writing and describing, seemed to be flying low, faster than i have ever seen anything before and in constant tight formation. and by the way there was no sound of any kind. let's see if i can draw a replica of what i saw off the computer. n o o o o s my wife says she saw the same thing i saw, but also thought she saw two cylinder shapes side by side with one little offset from the other. we went into the house thinking that the space shuttle was flying very fast, then we realized this couldn't have been the space shuttle. we went back outside at about 8:26pm and saw the actual space shuttle, which looked like a bright star flying from the sw to the ne direction. this lasted about minute or so."]}