{"Object Features":"Unknown","divs":["Sighting DetailsI was sitting on an outdoor deck in the back yard of a home, the property of which, borders on Sherman Lake, in the town of Warrensburg, in the Adirondacks. At about 1:00 AM the sky was clear and the stars were out when suddenly I saw what appeared to be two fireballs - one following the other along the same general path. What struck me was the brightness of the objects and the fact that they were traveling in a horizontal path, parallel to the ground, and did not appear to be at any great altitude. There did not seem to be a tail following them, and if I recall correctly, they may have made a swishing sound as the sped through the air. Abouy twenty minute late, another similar object sped directly over my head, going in the same direction as the others. My son had come outside, and he saw it too. He claims that when it finally disappeared over the tree tops, at that point, he saw another bright light move vertically straight down. I also saw this. A few minutes later, another bright object zoomed directly overhead. following in the path of the last one. Paths of all four sightings were parallel to the ground, and did not appear to be too high up. Perhaps a thousand feet at most? I'm only guessing."],"Weather Factors":"None","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"09/11/2009 07:19 UTC","Summary":"Saw two fireballs traveling in close proximity to each other, then about fifteen minutes later, saw another and then another.","Country":"United States","trends":["There have been 6 other sightings in Lake George","There were no other sightings in Lake George on or around July 15th 2008"],"Source":"MUFON","Date of the Event":"07/15/2008 01:00 UTC","Case Number":"19240","Object Shape":"Fireball","Disposition":"Unknown","Object Flight Path":"Straight-line path","Region":"New York","Latitude":"43.427781","Log Number":"US-09112009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=43.427781,+-73.708201(19240)&iwloc=A&hl=en\"> mufon case (19240) map </A>","files":["/var/www/straped/mufon/html2text/19240.html.txt","/var/www/straped/mufon/org/19240.html"],"Longitude":"-73.708201","City":"Lake George"}