{"Summary":"aeros craft photos","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"34.053564","Tags":"City","Log Number":"US-09112009-0010","files":["/var/www/straped/mufon/html2text/19244.html.txt","/var/www/straped/mufon/org/19244.html"],"trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 11th 2009"],"Date of the Event":"09/11/2009 12:00 UTC","Object Shape":"Unknown","Longitude":"-118.241085","Weather Factors":"Unknown","Region":"California","Viewing Distance":"Unknown","City":"Los Angeles","divs":["sighting detailsdear friends, here is a link to info i received today from a mjor govt contractor under darpa and immediately posted, including a full pdf file and two photos. http:\\\\www.utopiasprings.com\\aeros.htm aeros has been around a while and yet not fully able to do black triangles that we know of, they are certainly capable! http:\\\\www.utopiasprings.com\\bt.htm their small saucer craft reveals some structural secrets they are not supposed to tell. see the thin curved rod structurals protruding from the mylar? the structural secret of extremely lightweight support is in curved springy carbon fiber rods, much like those in common tents, just a little bigger. carbon fiber \"bows\" are the secret to the structure of the large black triangles as well. these bows allow a very taught flat under surface that can hold the central rail for equipment mounting, and overall flat profile for the triangles. some are just 3 to 4 feet thick! just enough to lay back on lightweight patio furniture like the kettlar lucca ergonomic recliner ! with full avionics and gps, gas\\water valves and electical switches right over head, it really takes off ! once fully airborne, starting the fuel cell driven electric motor system is easy, but really expensive, the simpler hydrogen fuel injected combustion engine sputters along quite fast actually, although makes a slight silly noise. the nice carbon fiber propellar works great like any swamp boat, and the long tail surface allows for great aerilon control. see bt.htm page for more details and fun onboard stuff. if you know someone who wishes to build one please let me know. we do a lot of hydrogen research here and it way overdue to reveal these craft. sincerely steve davis"],"Object Flight Path":"Undisclosed","Disposition":"IFO","Object Features":"Undisclosed","Date Submitted":"09/11/2009 01:54 UTC","Case Number":"19244","map":"<A HREF = \"http://maps.google.com/maps?q=34.053564,+-118.241085(19244)&iwloc=A&hl=en\"> mufon case (19244) map </A>"}