{"Date Submitted":"09/11/2009 10:53 UTC","Object Shape":"Star-like","Disposition":"IFO","Longitude":"-77.026606","Tags":"City","files":["/var/www/straped/mufon/html2text/19242.html.txt","/var/www/straped/mufon/org/19242.html"],"Log Number":"US-09112009-0008","Source":"MUFON","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Summary":"A bright light, that looked like a landing light on aircraft, silently over my home nosedown and then shop space","trends":["There have been 82 other sightings in Washington","There were no other sightings in Washington on or around September 10th 2009"],"divs":["Sighting DetailsI went outside to turn off my water sprinkler and saw a bright light coming through a maple tree next to my house. It simply looked like a landing light on an aircraft and as I saw it move through the trees I realized that it was quite low. When it was directly over my house, out of the leaves of the trees and in clear view, I could see that there were no navigation lights. As a former helicopter pilot I know what a commercial aircraft looks like in the night sky and there were no navigation lights at all. Just one bright light about 1000-1500 feet off the ground. It's hard to estimate the height at night but it was clearly very low. It traveled for about half a mile or so towards Liberty Lake Washington, the next town over, and then it appeared to either fly out to space or the light simply slowly turned off and disappeared. The light was at least was 3-4 times larger than the brightest star in the sky. When I first saw the light, out of trees, I realized that this was not a commercial aircraft and called my wife saw who saw the light as well. I ran to the other side of the house to get a better view of the craft as it traveled towards Liberty Lake where again I watched it travel a short distance and then disappear. I continued to stay outside and watch the night sky and saw a similar pattern of the lights coming into view 4 more times. They would be bright and fade to dark within a short span of the night sky and again with no sound our navigation lights. One was quite close to my house and literally became a bright light out of nowhere and then traveled a short distance and faded out again with no navigation lights or sound at all. I have seen this pattern before in the night sky around Spokane. But nothing so close that I could truly be identified as a unidentified flying object. I have seen a craft up close before (30-35 yards away) in 1977 which made me a believer in UFO's. At that time, I didn't know there was a formal way to make a statement about the incident so it went un-reported. I am however, a true believer and have done a lot of research and I am an avid listener of Coast-to-Coast, which is probably the best and most informative (only) real media that addresses UFO's at all. It would be great if our government would \"Fess-UP\" and tell us the truth...we can handle the truth."],"Object Features":"Undisclosed","Case Number":"19242","map":"<A HREF = \"http://maps.google.com/maps?q=38.901212,+-77.026606(19242)&iwloc=A&hl=en\"> mufon case (19242) map </A>","Object Flight Path":"Undisclosed","Date of the Event":"09/10/2009 09:15 UTC","Latitude":"38.901212","Region":"Washington","City":"Washington","Country":"United States","Viewing Distance":"Unknown"}