{"Latitude":"48.432631","Summary":"2 UFO's as if launching into space","Object Features":"None","Date of the Event":"09/09/2009 12:00 UTC","Date Submitted":"09/11/2009 12:10 UTC","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=48.432631,+-123.359616(19243)&iwloc=A&hl=en\"> mufon case (19243) map </A>","Object Shape":"Star-like","divs":["Sighting DetailsI was outside on my back deck on September 9, 2009 after 9pm with my partener looking at the night sky like we do every night. I am a very amateur astronomer and always look up in the night sky, as well as can easily identify the difference between stars, planets, airplanes, helicopters, satellites, etc. I was looking towards the south-east and noticed a starlike bright object moving at a strange pace upwards. I watched and tried to identify as a plane but nothing indicated that that is what it was. I followed it for 20 seconds then watched it moved high in the sky and simply disappear. I asked my partner if she saw that and she said no. Then 15 seconds later another one went up in the same direction- my partner saw this one and we followed it up. This one got very bright (neither had a trail) then dimmer then brighter again, went straight up then faded and disappeared. It seemed to both of us as if they were moving up out of the atmosphere. I kept watching the sky, saw some planes and satellites but nothing like what we had just seen. It really seemed as if something were being launched into space from the same trajectory as the first one. I thought to look on the internet if there were space launches that night but haven't looked into yet. Then I realized that launches are never done in quick succession of each other. The whole event lasted about 2 minutes and neither of us could say what it was, even though we can always identify objects in the sky. My partner doesn't look up in the sky as much as I do but we both agreed that what we saw was truly unidentified, therefore we called it a UFO as the most appropriate description."],"Case Number":"19243","Longitude":"-123.359616","Source":"MUFON","Disposition":"Unresolved","Country":"Canada","Tags":"City","Log Number":"CA-09112009-0009","Weather Factors":"None","Sighting Duration":"00:02:00","Object Flight Path":"Straight-line path","trends":["There have been 14 other sightings in Victoria","There were no other sightings in Victoria on or around September 9th 2009"],"City":"Victoria","files":["/var/www/straped/mufon/html2text/19243.html.txt","/var/www/straped/mufon/org/19243.html"],"Region":"British Columbia"}