{"City":"Richmond","Object Flight Path":"Undisclosed","Date of the Event":"09/09/2009 08:12 UTC","Case Number":"19250","Longitude":"-71.668889","Viewing Distance":"Unknown","Region":"Rhode Island","divs":["Sighting DetailsSkywatching in Richmond, RI, my girlfriend and I were waiting for a possible flyby of the space station and Discovery shuttle because I saw an official NASA website that listed the flybys in our zip code. The station was supposed to, I believe, fly by at 8:28-8:30pm. We were looking at the stars when then we saw what looked like a very close, bright, whitish yellow star fly into view. Its flight path was following the curvature of the earth. I looked away and my girlfriend saw the object turn different colors and grow larger. The colors included vivid orange and green. She then witnessed it explode. I saw a flash and heard her scream. I looked up and noticed just the star like object, but now it had a translucent bubble, oval in shape, surrounding the object. The bubble expanded. It was hard to see. The object then followed on its course across the curvature of the horizon. A second star like object at the same slow speed then followed the first objects path exactly to the same location, this one did not change colors or explode. I have seen satellite and shuttle flybys but these looked too large and traveled too slowly. My girlfriend was genuinely terrified by what she saw and I had to calm her down, which took a while. I was also very surprised to see that and I do not know what to think about it! Hopefully someone can contact me with some sort of alternate explanation. Thank you for reading and happy star gazing to the MUFON network. a.robert00@live.com"],"Date Submitted":"09/11/2009 08:45 UTC","Country":"United States","Object Shape":"Circle, Sphere, Star-like, Other","Weather Factors":"Unknown","Summary":"Looked like a bright star, white-yellow.","Source":"MUFON","Disposition":"IFO","Latitude":"41.494167","Tags":"City","files":["/var/www/straped/mufon/html2text/19250.html.txt","/var/www/straped/mufon/org/19250.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.494167,+-71.668889(19250)&iwloc=A&hl=en\"> mufon case (19250) map </A>","Object Features":"Undisclosed","trends":["There has been one other sighting in Richmond","There were no other sightings in Richmond on or around September 9th 2009"],"Sighting Duration":"00:03:00","Log Number":"US-09112009-0016"}