{"Date Submitted":"09/12/2009 12:22 UTC","Viewing Distance":"101-500 Feet","Date of the Event":"08/31/1976 08:30 UTC","Object Features":"Patterned Surface","Case Number":"19256","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Texas","Country":"United States","Disposition":"Unknown","Object Shape":"Disc","Weather Factors":"Unknown","divs":["Sighting DetailsIt was after August 1976, but I am not sure of exact year or month. We were returning from dinner - the sun was down but it was summer and it was still light out. We pulled up on York Drive and noticed a whole bunch of people standing in the street all looking in the same direction (to the west) - upwards of 30 or so people I'd say. We walked down and asked what was going on. They pointed up to the sky. There was a large, stationary disc-shaped object just hovering there in the sky, with white lights around the edges and four larger lights on the bottom. It's hard to describe exactly but I remember being aghast, like you can't believe what you're seeing. My mother ran inside to call the most trusted weatherman and newsperson in the DFW area, Harold Taft at Channel 5, to report it and see if anyone there knew about it. I was running back and forth between her and outside. Her fingers were shaking as she dialed. They didn't know of anything in the sky that could cause that and said they'd gotten several other calls about it. I remember them scrambing to find a camera, but back then they weren't kept on the ready like they are now. Military fighter jets arrived and chased it. The object would move to a different point in the sky with incredible speed, then again just hover there while the jets had to make a traditional turn to try and pursue the object. It moved so much faster than the jets that it was almost comical. It was almost like it was toying with the jets, playing with them or teasing them or something as it darted here and there, making the jets try to follow. Finally it appeared to tire of the game and took off to the northwest and disappeared from sight within seconds due to the sheer speed it was travelling at. There was a short article in the Star Telegram the following day, and about six months to a year later there was a follow up article saying they had done research and still had not been able to determine what the object actually was. I've always wanted to do the research at the Star Telegram archives or have the other neighborhood residents interviewed just to see if any of them had movies or film. My father also saw it and is still alive, and I'm sure there are other people still in the neighborhood who could testify what they saw. I just thought I should document this in case anyone else could benefit from the info somehow, especially since it was documented in the newspapers. Feel free to contact me with any questions - thank you."],"City":"San Antonio","files":["/var/www/straped/mufon/html2text/19256.html.txt","/var/www/straped/mufon/org/19256.html"],"Sighting Duration":"Undisclosed","Log Number":"US-09122009-0001","Summary":"Entire neighborhood saw UFO chased by jets from Carswell in 1970s","map":"<A HREF = \"http://maps.google.com/maps?q=29.45547,+-98.587406(19256)&iwloc=A&hl=en\"> mufon case (19256) map </A>","Longitude":"-98.587406","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around August 31st 1976"],"Latitude":"29.45547","Source":"MUFON","Tags":"City"}