{"Tags":"City","Case Number":"19251","map":"<A HREF = \"http://maps.google.com/maps?q=40.569547,+-74.632936(19251)&iwloc=A&hl=en\"> mufon case (19251) map </A>","Weather Factors":"Heavy","divs":["Sighting Detailsthis event happened in Raritan NJ. my brother and i journeyed from NE Pa. to Raritan NJ in order to attend the wake and funeral of our aunt who just passed away. The wake was held at a funeral home in Raritan. about 9:00Pm it was getting pretty warm in the funeral home so i decided to go and stand on the steps outside to get some air. The first thing i noticed was that the sky was very overcast and the clouds were rather low, not a star to be seen. By the way, I AM a member of MUFON and i have had a previous sighting over 15 years ago. as i turned to my left i noticed what seemed to be one lone star in the sky. the first thing that entered my mind was how totally devoid the sky was of stars except for just this one. it was orangish and about the size of a BB (as in BB gun). i turned my head back to the front just enjoying the cool air. about a minute later i turned toward the star again but this time i noticed it was moving toward me. i followed its movements from my left until it was right over my head but somewhat in front of me. suddenly the orangish \"star\" just blinked out and no sooner did 2 lites ,one bright white and the other a ruby red appear, each just a short distance from each other. each of these lights were half the size of the \"BB\". they continued in the direction of the original light for a few seconds then they also blinked out, not to be seen no matter how i strained my eyes to glimpse them. through out the entire sighting the lights emitted nothing but total silence as far as sound was concerned. i was told that this area is a busy corrider for commercial aircraft. later that nite we all gathered on my cousin's patio and i observed a number of aircraft fly over which were immediately recognizable as such going by lite pattern and engine sound. what i observed earlier was totally different as far as sound (lack of) and lite pattern , not to mention behavior."],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19251.html.txt","/var/www/straped/mufon/org/19251.html"],"Object Features":"None","Object Flight Path":"Straight-line path","Date Submitted":"09/11/2009 08:57 UTC","Summary":"size and shape of normal star. blinked out and 2 smaller lights appeared half the size of original star sized light.","Region":"New Jersey","Latitude":"40.569547","trends":["There have been no other sightings in Raritan","This sighting has never been favorited."],"Date of the Event":"09/08/2009 12:00 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09112009-0017","Country":"United States","Viewing Distance":"Unknown","Longitude":"-74.632936","Object Shape":"Star-like","Source":"MUFON","City":"Raritan"}