{"Summary":"Stationary airborne object reflecting light of setting sun","Longitude":"-110.918779","Latitude":"32.225913","Country":"United States","Object Shape":"Star-like","Weather Factors":"None","Region":"Arizona","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.225913,+-110.918779(19254)&iwloc=A&hl=en\"> mufon case (19254) map </A>","Date of the Event":"09/11/2009 06:35 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Case Number":"19254","City":"Tucson","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 11th 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsAt approx. 1825 hrs I received a call from a friend advising me to look at a bright airborne object in the Northwestern sky. I went outside and entered the street to the immediate left of my home and faced North. I observed what I thought at first was a planet since it didn't twinkle like a star would. With my friend still on the line I told him what I thought it was and we ended the call. I proceeded to get my binoculars (Celestron UPCLOSE 10X50). I was able to locate the object and found I couldn't focus it in easily. With the sun going down I quickly located something in the distance I could test my focus on and found that everything came through clearly. I again located the object and found that it didn't resolve in focus like a star or planet and that it was gradually getting dimmer. It color was going from white like a star to dimmer orange and that's when it occured to me that it was reflecting sunlight rather than emitting its own light. At no time during my obervation did it move. I called my friend back and advised him of what I was seeing. I also retrieved my digital camera (Kodak Easyshare C613) and snapped off one shot. It soon became too dim to observe even through binoculars. I called it quits at approx. 1855 hrs. I felt odd viewing it once I realized it was reflecting sunlight and remaining stationary. I've viewed stars and planets as well as aircraft through my binoculars and this felt different. I just don't know what it was. The total time of my observation was approx. 30 mins."],"Date Submitted":"09/11/2009 10:40 UTC","Disposition":"IFO","Log Number":"US-09112009-0020","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/19254.html.txt","/var/www/straped/mufon/more/19254_submitter_file1__Picture005.jpg","/var/www/straped/mufon/org/19254.html"],"Source":"MUFON"}