{"Object Features":"Other, Unknown","Date of the Event":"04/21/2009 08:00 UTC","Country":"United States","Viewing Distance":"Unknown","Latitude":"28.539596","Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.539596,+-81.376666(19258)&iwloc=A&hl=en\"> mufon case (19258) map </A>","Weather Factors":"None","Date Submitted":"09/12/2009 12:42 UTC","divs":["Sighting DetailsOn April the 21st I decided to catch a ride with my mother to go spend time with some friends. She drove to her job at Lowe's and departed from me in the parking lot of the store, I remained in the car with the plan of staying there until it was a little later on in the day when my friends would be awake. I noticed that all around me it grew strangely dark and the sun shone so brilliantly and some feeling or force took hold of me and made me grab my cell phone and jump out of the car and start to take pictures of the event. Suddenly two objects appeared out of the sun moving in complete unision with each other and I was in awe unbelieving I was actually witnessing this, I looked all around me and no one else seemed to be aware. One object appears to be an eye and the other is a sort of sphere or U.F.O., these objects moved as if they had life. The sun clearly has a sword piercing through it. The eye went all around moving incredibly fast and the other object followed in the same manner as the eye seemed to be looking upon the earth. Also above the eye appeared what looked like a face of fire looking down from the heavens. The objects then went back into the direction of the sun and dissapeared back into the heavens. I still cannot believe it but it happened to me, I would be much obliged if anyone can shed light on the images I have taken because from that day I have been perplexed as to what the event meant for my sake and for the sake of the human race."],"Object Shape":"Sphere, Other, Unknown","Tags":"City","Log Number":"US-09122009-0004","Sighting Duration":"Undisclosed","Longitude":"-81.376666","City":"Orlando","Summary":"Sun becomes extremely bright yet everything around grows dark, objects appear from sun.","Case Number":"19258","files":["/var/www/straped/mufon/html2text/19258.html.txt","/var/www/straped/mufon/more/19258_submitter_file1__eeaa3fc8263a__1240313778000.jpg","/var/www/straped/mufon/more/19258_submitter_file2__b2c58ce2642f__1240313854000.jpg","/var/www/straped/mufon/more/19258_submitter_file3__1a281728c55c__1240311124000.jpg","/var/www/straped/mufon/org/19258.html"],"trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around April 21st 2009","This sighting has never been favorited.",""],"Disposition":"Hoax","Source":"MUFON","Object Flight Path":"Other"}