{"Longitude":"-111.937995","Source":"MUFON","Summary":"Stationary bright white light Northeast of Tempe/Scottsdale","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.43311,+-111.937995(19267)&iwloc=A&hl=en\"> mufon case (19267) map </A>","Date of the Event":"09/11/2009 05:50 UTC","Latitude":"33.43311","City":"Tempe","Log Number":"US-09122009-0012","Weather Factors":"None","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Region":"Arizona","Tags":"City","files":["/var/www/straped/mufon/html2text/19267.html.txt","/var/www/straped/mufon/org/19267.html"],"Sighting Duration":"Undisclosed","Case Number":"19267","Object Shape":"Circle, Triangle","Disposition":"IFO","Country":"United States","Date Submitted":"09/12/2009 11:13 UTC","trends":["There have been 36 other sightings in Tempe","There were 2 other sightings in Tempe on or around September 11th 2009"],"divs":["sighting detailsapproximately 5:50pm on 09\\11\\09, i was sitting in the front yard of my house looking north\\northeast at an approaching plane, when i noticed a circular object that had a white\\grey light to it. the house sits facing north, and from this point one can see all the airplanes coming and going from sky harbor airport. as reference, the object in question was as big and bright as the lights on the approaching planes but it was further way. it almost looked like a very small moon. it was odd enough that it grabbed my attention and i ran inside to get my cheap binoculars and i was able to make out a triangular shaped blob, but it was fuzzy around the edges. my binoculars only focus up to 1000 meters. i observed this object for 20 minutes as clouds from an approaching storm started to pass in front of it. it was bright enough to see it through some of the thinner clouds. too me it seemed to be above and beyond the mcdowell mountains east of scottsdale. i lost sight of it once the storm clouds approached. this object stayed in the same place during my sighting. later in the evening, after the storm moved away, i went back outside to see if it was still there, but it was gone. nothing similar to that was present in the sky."]}