{"Weather Factors":"None","Country":"United States","Object Features":"Other","trends":["There have been 4 other sightings in Coolidge","There were no other sightings in Coolidge on or around September 11th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Date Submitted":"09/12/2009 12:22 UTC","Date of the Event":"09/11/2009 06:20 UTC","files":["/var/www/straped/mufon/html2text/19269.html.txt","/var/www/straped/mufon/more/19269_submitter_file1__IMG_2460.JPG","/var/www/straped/mufon/more/19269_submitter_file2__IMG_2466.jpg","/var/www/straped/mufon/more/19269_submitter_file3__IMG_2508.JPG","/var/www/straped/mufon/org/19269.html"],"Object Shape":"Star-like, Teardrop","map":"<A HREF = \"http://maps.google.com/maps?q=32.984109,+-111.512124(19269)&iwloc=A&hl=en\"> mufon case (19269) map </A>","Tags":"City","Source":"MUFON","Summary":"Prominent stationary luminous object observed prior to and during sunset in sky north of Coolidge AZ","Region":"Arizona","Latitude":"32.984109","Longitude":"-111.512124","Log Number":"US-09122009-0014","Sighting Duration":"01:30:00","divs":["sighting detailsobject was first observed while traveling south on azhwy 87 through the gila indian reservation in the vicinity of the blackwater trading post, at approximately 1815 hrs. the object was significantly brighter than anything else appearing in the northern sky at this time. the initial impression was that it could possibly be the landing lights of a commercial aircraft on approach (which frequently fly over the area). however the size and brightness of the object would have indicated that the aircraft would have been flying much lower than usual. given the time of day, there was still a significant amount of sunlight which should have made the shape of any aircraft visible, none was observed. upon closer inspection the object seemed to maintain a stationary position. the initial color of the observed object was a very bright \"clean\" white light. the exact shape of the object was difficult to determine due to its luminescence, but was roughly circular\\spherical. the object was observed further upon arriving in coolidge az, approximately 5-10 minutes later. the object had not seemed to change position, luminosity or color during this time frame. the object remained stationary in the sky north\\nw of coolige az for the next 25-40 minutes. the brightness of the object remained constant with the exception of a slight dimming effect when occasional clouds seemingly passed between the object and observers. the color of the object changed from a \"clean\", bright white light to an orange\\yellow to an orange to a red color during the 25-40 minutes it was observed. this change in color seemed directly proportional to the degree with which the sun past below the horizon. during this time, while the color changed, the brightness did not seem to change. as the sun dropped below the horizon the object had taken on a distinctly red coloration. a few minutes later a cloud seemed to pass in front of the object which remained visible, though slightly less bright. during this time behind the cloud, the object steadily faded in brilliance until it was no longer visible. when the clouds passed and clear sky appeared the object was still not visible. the object did not reappear. no sounds, sensations or movements were associated with the object. the only feelings were those of curiosity as to the nature of the object."],"Case Number":"19269","City":"Coolidge","Disposition":"IFO","Object Flight Path":"Straight-line path"}