{"divs":["sighting detailsstepped outside @ 3:28 to have a smoke & noticed object, thougt it most likly a star or distant aircraft in se sky about 30 degrees above horizon, made note of time. went outside again at approx. 5:15, object was still there, watched with naked eyes(5 min.) then with 15x binoculars. managed to get my mother out to observe it and she was as intrigued as i (unusual in itself). object was distant (at lest 5 miles to low orbit) and appeared round or possibly elongated diamond about 1\\2 the size of venus which was also visible to the left in the east. at times a small, \"steady\" white light would briefly appear right under the object(for 15 to 30 sec.)object seemed to flash a bright white light at irregular intervals and had prismatic like sparkle- emiting beautiful bright-vivid colors across the visible spectrum. i took several pictures with a sony handi-cam but object just looks like a regular star -exactly like the picture sent in by previous wa witness. i watched the object until it faded - like a star does with the rising sun. i plan on creating a graphic to relay what i saw soon, and might submit later if anyone is interested perhaps a satellite in geo-sync. orbit? it was beautiful to watch - needless to say i'll be looking for it to show up again. thank you"],"Longitude":"-122.658866","Tags":"City","Weather Factors":"None","Source":"MUFON","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"IFO","Date of the Event":"09/12/2009 03:39 UTC","files":["/var/www/straped/mufon/html2text/19266.html.txt","/var/www/straped/mufon/org/19266.html"],"Country":"United States","Date Submitted":"09/12/2009 10:45 UTC","Summary":"Star-Like(1/2 size of Venus), stationary, multi-colored-spakling like a diamond.","Object Flight Path":"Stationary","Region":"Washington","Log Number":"US-09122009-0011","City":"Vancouver","Object Features":"Unknown","Case Number":"19266","trends":["There have been 54 other sightings in Vancouver","There were no other sightings in Vancouver on or around September 12th 2009"],"Latitude":"45.646068","map":"<A HREF = \"http://maps.google.com/maps?q=45.646068,+-122.658866(19266)&iwloc=A&hl=en\"> mufon case (19266) map </A>","Object Shape":"Diamond, Star-like"}