{"Country":"United States","Source":"MUFON","Date of the Event":"09/11/2009 06:48 UTC","Longitude":"-111.936815","City":"Tempe","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/19261.html.txt","/var/www/straped/mufon/org/19261.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.4306,+-111.936815(19261)&iwloc=A&hl=en\"> mufon case (19261) map </A>","Viewing Distance":"Unknown","Log Number":"US-09122009-0007","Object Flight Path":"Stationary","Latitude":"33.4306","Date Submitted":"09/12/2009 02:52 UTC","Tags":"City","divs":["sighting detailsmy wife and i drove up to my mom's house in tempe, az and as i exited the passenger side of the car i looked up in the sky. a bright circular light in the north east, that resembled a little moon, caught my attention. the closest i can describe the size of the circular light is the size of a traffic light from across street. it was much too big for an airplane or a star\\planet. this was at 6:48pm pacific\\mountain time. the light was about as bright as the moon on a clear day and didn't seem to move the entire 13 minutes or so that we watched it. within the first few seconds of me watching this light i asked my wife what it was and she replied that she didn't know. so i told her to call my brother who has binoculars. as she went inside to call him i remained outside watching the light as clouds would pass in front of it yet i was still able to see it quite clearly from behind the scattered dark clouds. for a brief moment i wondered if it were just the moon hiding behind the clouds but then i remembered that when i first seen it there were no clouds in front of it. my brother and mom had come out to see this light and luckily got to witness it as well. unfortunately though as soon as we were able to find the binoculars the clouds had covered the light which was barely visible from behind the clouds yet still visible. eventually at about 7:02 pm the dark clouds had covered the light completely and when there was an opening in the clouds we no longer seen the light. i'm very aware that there was a space shuttle landing this evening but it landed in california at 5:53 pm as to where i witnessed this ufo at 6:48 pm. not to mention the light was stationary for nearly 15 minutes, from what i had seen. needless to say, all of us that had seen it, were very baffled and would like to know what it was that we had seen."],"Region":"Arizona","Weather Factors":"Unknown","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Features":"Unknown","trends":["There have been 36 other sightings in Tempe","There were 2 other sightings in Tempe on or around September 11th 2009"],"Case Number":"19261","Summary":"At 6:48 my wife, my brother, my mom and I all saw what looked like a very small moon in the North East sky in Tempe, AZ."}