{"map":"<A HREF = \"http://maps.google.com/maps?q=36.593762,+-79.388933(19262)&iwloc=A&hl=en\"> mufon case (19262) map </A>","divs":["sighting detailsit was a very clear night. i was lying outside in my yard gazing at the stars, when i saw the first flash which was due north. the flash was so quick i chalked it up to my eyes just playing tricks on me, but a few seconds later another blue\\white flash which appeared to go just from above the horizon, to straight into the ground. the weird part is, it seemed to be within a couple of hundred feet of me. i grabbed my cell phone to check the radar and local lightning data for my area(i have weather service on my phone) and all was clear. this all happened around 01:30 a.m. i'm a photographer, so i decided to go inside and grab my camcorder and camera to see if i could get something strange on video. as soon as i got up and started walking to the house(02:07 a.m.) i saw a cobalt blue flash toward the ene. it only lasted as long as say a camera flash, but it had a fairly distinct shape to it, like a cigar. a few seconds later an even bigger blue flash in the shape of a square on a slight uphill tilt towards me. it lit up the same area for about 1.5 seconds and then just disappeared as if someone cut off a switch . everytime it appeared to be semi-transparent. i know it is not likely that it was some kind of power failure due to no lights inside or out flickered, dimmed, etc at the time of said event, or shortly after. 10 minutes later another white flash, but no definite shape. i am a huge skeptic when it comes to ufo's, ghost, esp, etc. i don't believe in any of it. i know there has to be a logical explanation for this phenomena."],"Object Flight Path":"Stationary,Straight-line path","City":"Danville","Latitude":"36.593762","Source":"MUFON","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/19262.html.txt","/var/www/straped/mufon/org/19262.html"],"Disposition":"Unknown","Summary":"Huge blue flash. Lit up entire ENE quadrant of the night sky.","Sighting Duration":"00:40:00","Country":"United States","trends":["There have been 7 other sightings in Danville","There were no other sightings in Danville on or around September 12th 2009"],"Region":"Virginia","Log Number":"US-09122009-0008","Date of the Event":"09/12/2009 02:08 UTC","Tags":"City","Date Submitted":"09/12/2009 04:58 UTC","Case Number":"19262","Object Shape":"Cigar, Flash, Square, Rectagular, Other","Weather Factors":"Unknown","Longitude":"-79.388933","Viewing Distance":"101-500 Feet, Over 1 Mile"}