{"Date of the Event":"04/30/2009 11:30 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had typed a full report but when I submitted it, the data had cleared because it told me I had forgotten to put my last name. Now I don't feeling like going into that much detail because I spent a lot of time on that and it had disappeared. To sum this up, it was night and I was walking my dog at 11:30 PM along Beach Ave. in La Grange Park and I stopped near the Cook County Highway Department. It was a perfectly clear night and I had looked up and saw an object in the sky at some distance North northwest of my position and it was bright and star-like. I had never seen anything like that and I knew what was in the sky because of my position so close to O'Hare airport. There was also commercial airliners outside the vicinity of it and imagined that the pilots and passengers could probably have a good view of it. It was very strange indeed but I didn't want to be anywhere close it. I watched it for about 15 minutes as it just hung there glowing brightly and looked around to see if anything else was going on in the sky at the same time. I hoped that there would be some kind of explanation of this like a flare or something. Just as that crossed my mind two fighter jets going around Mach 1 came screaming out of the left corner of my view and passed the object. I watched if the fighters had circled around but my vision was blocked by the tops of the trees in the forest nearby. When I had turned to watch the object again I got to see it for about 2 more minutes and it had suddenly winked out. I knew that night something was going down because Air Force fighter drills with flares are not usual around my parts and the jets came later than the glowing light so It couldn't have been a flare. I was way too bright and way too big. I tried to figure this out in my head as I walked my dog home. I am 18 years old and I had been living in the neighborhood most of my life but I hadn't seen anything like that and I had chills going up my spine for the rest of the night. I decided to post this because this has to coincide with a sighting report I found near my area in Chicago in 2007 where a man named Alex Newton reported a star-like objects over Lake Michigan while waiting for a Metra train in the city during a storm in which fighter jets had chased the objects away. I hadn't reported it because I feared criticism that I had got from my friends because of it and that people would think I was crazy or joking around. I was always skeptical of UFO's and things like that but this recent experience has made a believer out of me and I want to know the truth."],"Country":"United States","Object Flight Path":"Undisclosed","Case Number":"19273","Weather Factors":"Unknown","Date Submitted":"09/12/2009 03:37 UTC","Summary":"Large, bright Star-like object","Source":"MUFON","Disposition":"IFO","Log Number":"US-09122009-0018","map":"<A HREF = \"http://maps.google.com/maps?q=41.839994,+-87.857776(19273)&iwloc=A&hl=en\"> mufon case (19273) map </A>","Object Features":"Undisclosed","Latitude":"41.839994","Region":"Illinois","Longitude":"-87.857776","Viewing Distance":"Unknown","Tags":"City","trends":["There have been 2 other sightings in La Grange Park","There were no other sightings in La Grange Park on or around April 30th 2009","This sighting has never been favorited.",""],"City":"La Grange Park","files":["/var/www/straped/mufon/html2text/19273.html.txt","/var/www/straped/mufon/more/19273_submitter_file1__Sightinglocationandview.jpg","/var/www/straped/mufon/more/19273_submitter_file2__Overview.jpg","/var/www/straped/mufon/org/19273.html"],"Object Shape":"Star-like"}