{"Tags":"City","Longitude":"-97.496474","Log Number":"US-09122009-0019","Source":"MUFON","Country":"United States","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=25.907447,+-97.496474(19274)&iwloc=A&hl=en\"> mufon case (19274) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsOn the above mentioned date and time, I was on duty outside my facility. I work for the local law enforcment agency. Im always stargazing because there have been alot of activity recently. Last night, I noticed what appeared to be a very high altitude object moving from north to south at about my 12 o'clock position or directly overhead. I would estimate it to be flying at about 30K feet. Very small dim, no strobes or anticollisionlights. Soon after I noticed it, There was a flash infront of this dim object. The flash took shape of an even bigger sphere, I would calculate it to be 5 times as big and brighter then the first. I started moving away from the first dim object also in a southern direction. As soon as it was visible, 4 seconds later in a flash it was gone. The first dim object continued on its souther direction until it was not visible. A minute later, the first dim object was seen moving back north in its original flight path that it took going south. Still moving very fast. Within 2 minutes it was no longer visible. 40 minutes later when I arrived home, again I noticed this dim object kind of flying in a skipping motion or zig zagging motion from north to south over again its original flight path. No reported a month ago, my wife and I saw a dim object no collision lights following a bigger sphere from South to north directly overhead at about 20 thousand or so feet. Very high altitude craft. The first object or sphere was very bright and moving extremely fast. It covered roughly from the 9 oclock position to the 3 oclock position overhead in less than 3 minutes. The second object much dimmer was a bit slower, it made a 90 degree right bank then 3 seconds later again a 90 degree left bank to its original course north. We did not see either again."],"Summary":"Fighter interceptor(s) chasing object","City":"Brownsville","Object Shape":"Flash, Sphere","Latitude":"25.907447","Weather Factors":"Unknown","Region":"Texas","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19274.html.txt","/var/www/straped/mufon/org/19274.html"],"Date Submitted":"09/12/2009 04:06 UTC","trends":["There have been 17 other sightings in Brownsville","There was one other sighting in Brownsville on or around September 12th 2009"],"Case Number":"19274","Sighting Duration":"Undisclosed","Date of the Event":"09/12/2009 05:45 UTC","Object Flight Path":"Undisclosed"}