{"Source":"MUFON","Weather Factors":"None","Region":"Arizona","Country":"United States","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Latitude":"33.663914","Longitude":"-114.229949","Case Number":"19270","divs":["Sighting DetailsA fireball traveling at an amazing rate of speed headed towards the earth from outer space. I was seated in the passanger side of a big rig, and my friend Sherry was driving and Lili was sitting in the middle of us. I saw a huge fireball going through the sky, and as we drove I yelled at Sherry to pull over and stop the truck because it looked like it was headed straight towards us. Sherry pulled the truck over and we got out to witness this amazing event unfolding before our very eyes. There were other vehicles that were traveling on I-10 that night who also pulled over. We watched this fireball getting closer, and closer to us and we just stood in awe. As it approached the ground, it stopped dead in its tracks and just hovered there. It felt, and sounded like it was pulsing and it just hovered there for a long time. It then split into two balls of fire and started moving in and out of each other, and as it continued to move its speed accelerated by the second. It looked like two rays of light moving in and out of each other, and then it formed together as one and stood dead in its tracks. Hovering there pulsing, and then it landed on the ground. From the time that it landed on the ground to the time that we all just got into our vehicles and just drove away, I cannot remember anything. The next thing that I remember after it landed on the ground is all of us getting into the vehicles and driving away. Sherry, Lili, and me did not say a word to each other all the way to Phoenix. I would like to be regressed so that I can get back that time that is missing and remember what happened. I have been looking for it ever since in the night sky, and during the day. I felt an intelligence from it that is amazing. To this day I am still in awe of what I saw and experienced. It changed my life forever. I am extremely intelligent, and I will never forget the parts that I do remember from that night. I would like to be regressed so that I can recollect the entire event that unfolded before my eyes. I do not think that I lost sight of the object, I think that for whatever reason, we all just left."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.663914,+-114.229949(19270)&iwloc=A&hl=en\"> mufon case (19270) map </A>","Date of the Event":"08/17/1983 01:00 UTC","Log Number":"US-09122009-0015","Object Features":"Unknown","Disposition":"Unknown","City":"Quartzsite","files":["/var/www/straped/mufon/html2text/19270.html.txt","/var/www/straped/mufon/org/19270.html"],"trends":["There have been 3 other sightings in Quartzsite","There were no other sightings in Quartzsite on or around August 17th 1983"],"Summary":"A huge fireball travelling at an amazing speed","Tags":"City","Date Submitted":"09/12/2009 01:43 UTC","Object Shape":"Fireball","Object Flight Path":"Path with directional change"}