{"Viewing Distance":"Unknown","Date Submitted":"09/13/2009 02:10 UTC","trends":["There have been 21 other sightings in Bethlehem","There were no other sightings in Bethlehem on or around September 3rd 2009"],"City":"Bethlehem","Log Number":"US-09132009-0005","Latitude":"40.633572","Case Number":"19287","Object Features":"Unknown","Longitude":"-75.364248","Summary":"My son spotted a shape in the sky as we sat in traffic.","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19287.html.txt","/var/www/straped/mufon/org/19287.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.633572,+-75.364248(19287)&iwloc=A&hl=en\"> mufon case (19287) map </A>","Object Flight Path":"Path with directional change","Date of the Event":"09/03/2009 07:52 UTC","Tags":"City","Object Shape":"Cigar","Disposition":"Unknown","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving my son to school on Schoenersville Road in Bethlehem, heading North. We were late, so I was aggravated when we got stuck in traffic and I kept looking at the clock. Suddenly, when we were stopped at a red light on the bridge that spans rte. 22, my son shouted \"Mama, a UFO!\" At first I couldn't see it, then the light changed and I drove the car a few more feet before being stopped in traffic again. I said, \"Sweetie, are you sure that it's not an airplane? The airport is over there (I was talking about Lehigh Valley International Airport, which is located about a mile from our location).\" He said, \"No, it was moving in circles.\" As he said this, I finally spotted it in the sky. It was small from my perspective, maybe the size of a passenger plane, and I said again \"It looks like a plane coming in for a landing,\" when it abruptly stopped in mid-air, and started moving in the opposite direction. I got a good look at it, it was cigar shaped and it was a bright silver color that reflected the sunlight on that very clear and sunny morning. From my perspective, it was on my left, and it moved back and forth several times. I checked the clock, and it read 7:55. I watched it move over route 22 for as long as morning rush hour permitted, then traffic started moving again, and my son gave me updates as to it's behavior. He shouted \"It's getting bigger!\" and then, \"It cloaked!!! It cloaked!!!\" cloaked of course meaning that it disappeared, and I apologize that I cannot confirm this, since there was no convenient place to pull over and watch."],"Country":"United States","Region":"Pennsylvania","Source":"MUFON"}