{"Weather Factors":"Unknown","Source":"MUFON","Longitude":"-122.901894","Date of the Event":"09/12/2009 07:58 UTC","Sighting Duration":"Undisclosed","Summary":"Unreal UFO over I-5 looking NW near Kelso, exit 38","files":["/var/www/straped/mufon/html2text/19289.html.txt","/var/www/straped/mufon/org/19289.html"],"Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=46.155699,+-122.901894(19289)&iwloc=A&hl=en\"> mufon case (19289) map </A>","City":"Kelso","Disposition":"Unknown","divs":["Sighting DetailsDriving North on I-5 at about milemarker 38. I noticed a very white sphere hovering just west of the freeway, northbound, at about 20 degrees above the freeway. It was very bright and stationary. In about 10 seconds it moved around the sky, but not streaking, it was just in one place, then another, all within about a 5 inch range of my vision. I tapped my wife who was in the passenger seat sleeping, and i pointed to it. Just as I pointed to it, it started to move around faster, from one place to another. Then, quickly, it started to move from east to west at a very high speed, then went at a 45 degree angle to the ground. At no time was there any other colors in the object, and there was no apparent streak as seen with a meteor. My wife doesn't believe in UFO's. She said \"What was that\" I said \"UFO\". she said, no way, that had to have been a rocket or something, is there military bases in the area?... Shortly after, I noticed two airplanes in the vicinity with police lighting on them. It was a very wild experience. At the time, the sun was set, but the area was getting thick with thunder storms. Where the object was seen, it started in a dark part of the sky, but ended in the more lit area of the sky."],"trends":["There have been 5 other sightings in Kelso","There were no other sightings in Kelso on or around September 12th 2009"],"Latitude":"46.155699","Log Number":"US-09132009-0007","Tags":"City","Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change,Path then hovering","Case Number":"19289","Object Shape":"Disc","Object Features":"None","Date Submitted":"09/13/2009 02:25 UTC"}