{"files":["/var/www/straped/mufon/html2text/19286.html.txt","/var/www/straped/mufon/org/19286.html"],"Object Features":"None","Longitude":"-123.422011","Viewing Distance":"Unknown","Tags":"City","Summary":"we were in the back yard watching skys when we saw in the eastern skys a bright star but it was moving at a fast speed we watched it got so bright it was blinding and then it was gone in a flash","Log Number":"US-09132009-0004","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=48.124846,+-123.422011(19286)&iwloc=A&hl=en\"> mufon case (19286) map </A>","Date Submitted":"09/13/2009 01:43 UTC","Object Shape":"Star-like","divs":["Sighting DetailsWe were out in our back yard sitting around the burn pit about eight pm and just watching the skys cause it was so bright and clear. My daughter and I were just talking and looking at Mars and the Milky Way. When the fire started to go out we decided to come in so we were picking up our cushion when we both turned to the south eastern skys, we both saw a bright star but it was moving at a fast pace all of a sudden it got brighter and brighter, it got so bright it was blinding and then it was gone in a flash. We watched it, it lasted about five to ten minutes. It lite up the field behind our house. We just stood there looking at each other and said we just saw a UFO. We stayed out there and kept watching. Then we came in and we were shaking, scared, excited and bewildered. I then called the police department and asked if anyone had report seeing a bright light in the sky, they said no but gave me a number to call in Seattle to report UFOs, so I called and reported it and they said something happened over Seattle tonight."],"Date of the Event":"09/12/2009 09:05 UTC","Latitude":"48.124846","Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Washington","City":"Port Angeles","trends":["There have been 6 other sightings in Port Angeles","There were no other sightings in Port Angeles on or around September 12th 2009"],"Country":"United States","Object Flight Path":"Straight-line path","Case Number":"19286","Source":"MUFON"}