{"trends":["There have been 36 other sightings in Tempe","There were 2 other sightings in Tempe on or around September 11th 2009"],"City":"Tempe","map":"<A HREF = \"http://maps.google.com/maps?q=33.43293,+-111.931175(19280)&iwloc=A&hl=en\"> mufon case (19280) map </A>","Longitude":"-111.931175","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-09122009-0025","Case Number":"19280","files":["/var/www/straped/mufon/html2text/19280.html.txt","/var/www/straped/mufon/org/19280.html"],"Object Features":"None","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Latitude":"33.43293","Summary":"High Northeast Sky, Large White Object floating in place.","Date Submitted":"09/12/2009 08:58 UTC","Object Shape":"Teardrop","Weather Factors":"Unknown","Region":"Arizona","divs":["Sighting DetailsMy co-worker asked me to come out and see this. She was notified by a customer. I met her out front of our store and there was the image. The sun was setting so the sky was getting darker. The image was roughly the quarter the size of the moon. Almost looked like a projection image (probably because of it's great distance. It was as bright as the moon. My guess is that it sun light was reflecting off it. It didn't appear to move at all. Often was blocked by clouds. We could not tell if it was outside the atmosphere or in the stratosphere. It looked like a tear drop but almost seemed like a perfect half circle with smaller tail pointing down. When holding my arm outstretched next to the image, it looked to be slightly smaller than my pinkie nail. This must've been massive. No way could this be a weather balloon. The light reflected was not like a star, but like the moon. A woman standing with us said she had watched the object from Downtown Phoenix, which would've mean with traffic, that this had been in the sky for 45 + minutes. I called Fox 10 news desk to report it and to get a reaction and the man on the phone said that he had received a few calls about the object. When I asked him, \"What is it? I have to know!\" He said, \"Don't know, we'll let you know.\" There was no news broadcast of the sighting that evening. This truly was like nothing I had ever seen in the sky before. It was something new to me. I felt anxious and wished that I could see through a telescope. I and those around me agreed that this was something never seen before and extraordinary."],"Tags":"City","Disposition":"IFO","Date of the Event":"09/11/2009 06:50 UTC"}