{"Date of the Event":"09/12/2009 11:15 UTC","Object Features":"Unknown","Object Shape":"Circle, Flash, Star-like","Object Flight Path":"Hovering then path","Case Number":"19288","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","divs":["sighting detailsthis started around 11:15pm at night. i noticed an extra bright star in the the western sky. it appeared to be flashing. i went to get my telescope to see if i could get a better view. i noticed once i looked through the telescope that there were flashing lights. the colors i was seeing were red, white and what appeared to be an aqua blue. the object appeared to stay in the same location for a while and then slowly began heading north\\northwest. i noticed when it was in the northwest sky another one seemed to appear. it could have been there the whole time and i just didn't see it. the second one seemed to be further away. this lasted for about an hour. i decided to scope out the sky and i noticed another cluster of stars that didn't seem right. this time i was looking in the southern sky. i found the same object, i stopped counting after i found 10 of them. the characteristic was the same as the original object i observed. about the same distance away....well maybe just a little further, same flashing lights. it's still going on right now, it's difficult to see with the naked eye, you'd be better served if you had a telescope. i was able to spot the second cluster with the naked eye. what caught my attention was the odd placement of these objects in the sky, it just didn't seem like a pattern i was use to seeing. this is still going on right now...it's 12:15am on sunday, sept.13. would love to know if anyone else reported this."],"Weather Factors":"Does Not Apply","City":"Boise","Summary":"Looked like a Star, but had flashing lights, saw 2 first, then a cluster of five in different part of the sky","Longitude":"-116.207066","Latitude":"43.620631","Region":"Idaho","Date Submitted":"09/13/2009 02:16 UTC","files":["/var/www/straped/mufon/html2text/19288.html.txt","/var/www/straped/mufon/org/19288.html"],"Tags":"City","Log Number":"US-09132009-0006","Disposition":"Insufficient Data","trends":["There have been 69 other sightings in Boise","There were no other sightings in Boise on or around September 12th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.620631,+-116.207066(19288)&iwloc=A&hl=en\"> mufon case (19288) map </A>","Country":"United States","Source":"MUFON"}