{"Sighting Duration":"Undisclosed","Date Submitted":"09/13/2009 12:29 UTC","files":["/var/www/straped/mufon/html2text/19283.html.txt","/var/www/straped/mufon/org/19283.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.865947,+-122.406207(19283)&iwloc=A&hl=en\"> mufon case (19283) map </A>","Weather Factors":"None","divs":["Sighting DetailsAt approximately 8:10 pm on Saturday, September 12, 2009 my husband and I were returning to our home in Yacolt, Washington from Portland, Oregon. We had just entered the city limits of Yacolt and were driving North on Railroad Avenue when a very bright light zoomed across the sky from east to west at a 45 degree downward angle. When we first saw the light we thought it was an extremely bright and large meteor shooting across the sky. It was very low in the sky a few hundred feet above the tree tops. Just as it was about to disappear from our view the object seemed to turn a bit and the setting sun shone on it. We could then see that it was not a huge meteor but a triangular shaped object with lights underneath. The lights were very large and we both saw five lights. It was going very fast and was gone in seconds. It was definitely not an airplane or other 'normal' light in the sky. We were surprised at seeing this object and compared our observations. We then drove toward the west to see if we could see anything more but did not see anything but the normal night sky."],"Disposition":"Unknown","Object Features":"Unknown","Region":"Washington","Object Shape":"Triangle","Source":"MUFON","Date of the Event":"09/12/2009 08:10 UTC","Longitude":"-122.406207","City":"Yacolt","Log Number":"US-09132009-0001","Tags":"City","trends":["There have been 4 other sightings in Yacolt","There were no other sightings in Yacolt on or around September 12th 2009"],"Case Number":"19283","Summary":"Bright Light streaking across sky turning and triangular shape w/lights visible","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Country":"United States","Latitude":"45.865947"}