{"Log Number":"","Summary":"Object in Vermont","map":"<A HREF = \"http://maps.google.com/maps?q=43.844444,+-72.646111(1929)&iwloc=A&hl=en\"> mufon case (1929) map </A>","Sighting Duration":"01:59:00","Disposition":"IFO","Weather Factors":"Unknown","Tags":"City","City":"Bethel","Region":"Vermont","Object Flight Path":"Undisclosed","Country":"United States","divs":["Sighting DetailsMonday October 14th at 815 PM we were camping in Gaysville Vermont, next toBethel Vermont. We were inside our trailer eating supper. Jarrod finished firstand went outside for a smoke. We have been camping in the same place for 10years. He suddenly noticed a stationary object in the NE sky at an altitude ofless than 2,000 feet, in an area of the sky that has no other objects in it. Mywife Ann went out and saw the same object. I was then called outside to lookalso. I saw an object in the distance that was stationary. At first it lookedlike a star, then I could see that the object was flashing. We had a pair ofbinoculars in the car and went and got them. Ann looked first and said, what inthe world is that, Jarrod looked at the object and said I have never seenanything like this before. I looked at the object and was amaised at what I saw.It appeared to be cone shaped and had extremely bright strobe like flashinglights. The colors werered, white, green, blue, and yellow. They were flashing quickly and seemed to bein a pattern. The object stayed in the same location for about one hour. Shortlythere after it moved slightly south and stayed in that location for about 12hour. It vanished after that. We were all stunned by the sighting, and havenever seen anything like that in the sky."],"Object Shape":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been no other sightings in Bethel","This sighting has never been favorited."],"Latitude":"43.844444","Longitude":"-72.646111","files":["/var/www/straped/mufon/html2text/1929.html.txt","/var/www/straped/mufon/org/1929.html"],"Date Submitted":"10/14/2002 08:15 UTC","Object Features":"Undisclosed","Source":"MUFON","Case Number":"1929","Date of the Event":"10/14/2002 08:15 UTC"}