{"Log Number":"US-09132009-0013","City":"Denver","Object Flight Path":"Unknown","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around September 10th 2009"],"Source":"MUFON","Case Number":"19295","Date Submitted":"09/13/2009 01:56 UTC","Tags":"City","Latitude":"39.742544","Date of the Event":"09/10/2009 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.742544,+-104.982483(19295)&iwloc=A&hl=en\"> mufon case (19295) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19295.html.txt","/var/www/straped/mufon/org/19295.html"],"Weather Factors":"Unknown","Object Features":"Patterned Surface","Summary":"Rectangular black object north of Denver International Airport","Region":"Colorado","Disposition":"Unknown","Country":"United States","divs":["sighting detailsmy friend was driving me to the airport 9\\10\\09. we were on pena blvd when i turned to look at her and saw a very large dark rectangular shape in the sky north\\northwest of dia. it appeared fairly stationary and i my first thought was that dorothy wasn't in kansas anymore. when she saw it she said what i had been thinking. it looked like a huge house--with no roof. the bottom and sides were very straight and squared off. the top was straight but not as linear as the other sides and was a bit fuzzy on the top and right. there were low clouds being built from chemtrail grids at the time as well, but the object was below those clouds. the object was a good distance away--ten or more miles, hard to tell--and the perspective on size was difficult until a plane appeared adjacent to it. the plane was very bright silver and very small in perspective to the rectangle (maybe 100 to 1 or greater). other planes landing and taking off that day did not have the same appearance as the silver plane near the object. my friend and i watched the object as we drove and it may have begun to move, but we were moving so can't be sure of that. when we looked back, it was gone. we had sight of it for a minute or so. i would love to know if anyone else saw this object as well."],"Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","Longitude":"-104.982483"}