{"Case Number":"19291","Tags":"City","Viewing Distance":"501 Feet - 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/19291.html.txt","/var/www/straped/mufon/org/19291.html"],"Country":"United States","Region":"New York","Date Submitted":"09/13/2009 04:57 UTC","Latitude":"40.582822","Source":"MUFON","Object Features":"Unknown","Weather Factors":"Windy","Summary":"2 separate cones with red sphere on bottom which looked like it contained fire.","Log Number":"US-09132009-0009","Sighting Duration":"Undisclosed","divs":["sighting detailsi was on phone with my sister and looked out kitchen window to view pond in yard. towards the north i spotted at first what i described to my sister as a plane on fire but one i exited house an viewed it from yard it looked more like a cone\\triangle shaped object that shifted forms somewhat as i viewed it. it was sometimes more triangle shaped than cone but the light on bottom remained what looked like a sphere of fire. after about 30 seconds i got off phone and told my sister to call my mom and tell her to look outside. i then called up my neighbor and talked to him for the duration of event. unfortunatly he was not home at the time but wanted to listen to my descriptions. i was honestly so amazed and scarred at what i was seeing i was glad to have his presense over the phone. i watched the 1st object for 2-3mins move slowly eastwards and hover before it slowly moved upwards and northeast gradually going over horizon. i rememeber telling my neighbor it was gone but i couldn't stop watching sky. my skygazing was rewarded about 30-45 seconds later when another similiar object appeared. this one hovered in sky near the location where 1st one did for about 1 minute before moving north and upwards thru the clouds. my feelings during this event were that i was seeing something i wasn't supposed to be seeing. a ufo here? how come theres not hundreds of other people able to see this. i left event deluding myself into writing it off as a flare and maybe it was. i'm no expert in non commercial aircraft. lately i'm feeling that i was lucky to see it. glad to share."],"City":"New York","Date of the Event":"08/15/2009 09:30 UTC","Disposition":"Unresolved","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around August 15th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.582822,+-74.143491(19291)&iwloc=A&hl=en\"> mufon case (19291) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Unknown","Longitude":"-74.143491","Object Shape":"Cone, Diamond, Triangle, Unknown"}