{"Longitude":"-117.937668","Tags":"City","Object Features":"Unknown","City":"Garden Grove","Case Number":"19292","Latitude":"33.777185","Disposition":"Unknown","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/12/2009 09:10 UTC","Weather Factors":"Unknown","Summary":"Bright lights from south-west appeared with tracer tail, and traveled north in steady path to show moving lights in horizontal stream.","Object Flight Path":"Undisclosed","divs":["Sighting DetailsAt 2110 Pacific standard time in SW sky appeared a tracer tail of yellow lights and there IT WAS !! Like something out of the movies. A disc shaped lighted object heading to the north. I could see it at roughly a 45 degree angle, hovering as lights in a horizontal line were moving in a chaser stream. . . . . . . . . . . . . . . as if it was rotating as it moved to the north. All I could do is FEEL it's presence. Not to be cheesy, but \"you just know\" when you see something like this. I was looking for green-blue lighted \"stars\" with occasional red light beacon flashes in the distance, as I had seen on August 24, 2009 from the same location at roughly 2200 hours.( that sighting, it hovered as a star for 30- 60 minutes as it faded into the western sky ). But THIS thing was close, at the tree tops, and yellowish lights. At first I thought it was the GoodYear Blimp with the lighted sign on the side promoting tires, or something ? First off, Goodyear couldn't travel that fast, and second, it wouldn't have a tracer tail ( as if entering the atmosphere, as does the space shuttle when it leaves the atmosphere ). This thing was more disc to oval shaped, with lights on the underside as I got a few seconds to see the underside. My girlfriend thought there were two objects, as the angle of decent could be mis construed as such if the lights were around the perimeter, and not just the one side, ( rotating)? Mysterious stars and direction-changing lights have been observed in recent weeks, as was the Aug. 24 sighting. I just wanted to submit this information, in case there were other sightings in this area, or other flap areas to validate... I'm new to all this, and really am telling the truth. Do \"they\" know that I just finished UFOs: Operation Trojan Horse by John A. Keel (1970)? Great book !! I didn't expect to actually \"SEE ONE\", although it was shockingly exciting."],"Region":"California","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19292.html.txt","/var/www/straped/mufon/org/19292.html"],"Log Number":"US-09132009-0010","Date Submitted":"09/13/2009 05:26 UTC","Country":"United States","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around September 12th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.777185,+-117.937668(19292)&iwloc=A&hl=en\"> mufon case (19292) map </A>","Object Shape":"Blimp, Circle, Cylinder, Disc, Flash, Oval"}