{"Object Features":"Unknown","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/19308.html.txt","/var/www/straped/mufon/org/19308.html"],"trends":["There have been 52 other sightings in Myrtle Beach","There was one other sighting in Myrtle Beach on or around September 10th 2009"],"Case Number":"19308","Date of the Event":"09/10/2009 11:00 UTC","Object Flight Path":"Stationary","Summary":"Orange lights over the ocean appear disappear then reappear as I watch off of hotel balcony.","Date Submitted":"09/14/2009 09:26 UTC","Source":"MUFON","Weather Factors":"Windy, Light","City":"Myrtle Beach","Log Number":"US-09142009-0007","Country":"United States","Tags":"City","Disposition":"Unknown","Region":"South Carolina","divs":["Sighting DetailsWhile I was on vacation at Myrtle Beach,S.C I was in our hotel room getting a book that I had been reading when out of the corner of my eye an orange light, outside the balcony of our hotel, caught my attention. At first I thought it was fireworks that I had heard someone shooting further down the beach. However something didn't seem right about it. I walked out on the balcony to get a better look and as I did more lights appeared about twenty feet up from where I was standing on the eighth floor and a hundred feet out over the ocean. They were rectangle in shape with a pale orange glow. One light at first, then two light. They flashed out then reappeared as three set close together, then a gap and another light. Four lights altogether. I called for my husband to come look. As he stepped through the door a helicopter started approaching and the lights went out. I watched for a long time afterward but they never reappeared. As I looked off of the balcony I noticed that a pier a long way down the beach had similar lights. I wondered if the craft was invisible but was reflecting those lights. It was late in the evening around 11:00 p.m. The sky was very dark and I couldn't see a craft only the lights. Or possibly it just happened to fast for me to be able to pick out a shape in the dark sky. I heard no sounds over the roar of the ocean waves. I am sure of what I saw and it wasn't fireworks. Fireworks don't appear as rectangle lights that flash off and on like a flash light cutting on and off."],"Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.6961,+-78.882514(19308)&iwloc=A&hl=en\"> mufon case (19308) map </A>","Latitude":"33.6961","Sighting Duration":"Undisclosed","Longitude":"-78.882514"}