{"Object Flight Path":"Other","Date of the Event":"09/13/2009 11:45 UTC","trends":["there have been no other sightings in snowshoe\\slaty fork","This sighting has never been favorited."],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.414151,+-80.034135(19304)&iwloc=A&hl=en\"> mufon case (19304) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19304.html.txt","/var/www/straped/mufon/more/19304_submitter_file1__100_6930.JPG","/var/www/straped/mufon/more/19304_submitter_file2__100_6930.contrast-brightnessadjusted.jpg","/var/www/straped/mufon/org/19304.html"],"Country":"United States","Weather Factors":"Unknown","Latitude":"38.414151","Disposition":"Insufficient Data","Object Features":"Undisclosed","Longitude":"-80.034135","City":"Snowshoe/Slaty Fork","Source":"MUFON","Summary":"A white starish object in the sky near Snowshoe WV","Object Shape":"Star-like","Case Number":"19304","divs":["Sighting DetailsIt's a clear night, and I was spending some time in the hot tub with my wife checking out the sky. We noticed a object that appeared to be making little circles in the sky. It was brighter than most other objects in the sky, and it's movements started and stopped in a odd way. One moment it would look like a bright white star or planet, next it looked like it was being wizzed around in a food processor. So I jumped out of the hot tub, grabbed my camera, set up the tripod...and set its exposure to 8 seconds, and set the self timer (to avoid shaking). I tried to take several pictures, but as I started to take pictures the object seemed to disappear and reappear. In the matter of a minute or so, I was able to snap about 5 pictures before the object had disappeared for good. I only caught one picture of the object. But upon looking at the picture, it seemed to not be making \"little circles\" but a zig zag shape movements. I have attached the orginal photo. I also attached the photo, with adjusted contrast and brightness. In terms of my orientation of N, E, S, W...I'm not sure of that fact. My camera was faced pretty much straight up in the sky. And as for the amout of time that I saw it, it wasn't but just a couple of minutes from the time we first saw it, until it disappeared for good."],"Log Number":"US-09142009-0003","Sighting Duration":"Undisclosed","Region":"West Virginia","Date Submitted":"09/14/2009 12:23 UTC"}