{"Weather Factors":"None","Sighting Duration":"00:01:00","Date of the Event":"09/04/2009 10:05 UTC","Summary":"Bright orange lights not chineese lanterns","Longitude":"-2.58676","Tags":"City","Country":"United Kingdom","Object Flight Path":"Straight-line path,Path with directional change","Source":"MUFON","Date Submitted":"09/14/2009 10:21 UTC","Log Number":"GB-09142009-0008","map":"<A HREF = \"http://maps.google.com/maps?q=51.462193,+-2.58676(19309)&iwloc=A&hl=en\"> mufon case (19309) map </A>","Viewing Distance":"101-500 Feet","Case Number":"19309","files":["/var/www/straped/mufon/html2text/19309.html.txt","/var/www/straped/mufon/org/19309.html"],"Latitude":"51.462193","Region":"England","Disposition":"Unresolved","City":"Bristol","divs":["Sighting DetailsHi Here is what we saw on the 4-09-2009 at approximately 22.05 hours me my wife and our neighbour witnessed the event- the night sky was completely clear and little to no breeze when I notice a flying object bright orange in colour and sphere shaped come from behind the tree line from behind the tree line ( I was standing in are back garden ) my neighbour came rushing out of her house as she had noticed it from her window. I quickly called my wife and grab the video camera when a second object appeared following the exact flight path as the first the were travelling at quite some speed and making no sound what so ever. I have got some HD footage of the objects and hope some one can shed some light on what these are please find attached. One other point is that our local paper had printed a article on what sounds like the same objects just 2 weeks previous but no explanation has been given for the event in which several people In 2 different locations reported seeing the objects. I look forward to your response Also I would estimate the objects to be at about 700 feet Parkend Gloscestshire England Regards Mark"],"Object Shape":"Fireball, Oval, Sphere","trends":["There have been 11 other sightings in Bristol","There were no other sightings in Bristol on or around September 4th 2009","This sighting has never been favorited.",""],"Object Features":"Unknown"}