{"trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around August 9th 2004"],"Disposition":"Unknown","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/19302.html.txt","/var/www/straped/mufon/org/19302.html"],"Date of the Event":"08/09/2004 11:05 UTC","Viewing Distance":"101-500 Feet","Date Submitted":"09/14/2009 12:00 UTC","Summary":"UFO stopped in flight was caught by two white vapor streams.","Object Shape":"Unknown","Tags":"City","Weather Factors":"Unknown","Log Number":"US-09142009-0001","Region":"Indiana","Longitude":"-86.152204","Country":"United States","Object Features":"Undisclosed","City":"Indianapolis","map":"<A HREF = \"http://maps.google.com/maps?q=39.773236,+-86.152204(19302)&iwloc=A&hl=en\"> mufon case (19302) map </A>","divs":["Sighting Detailswife and my self and another couple were camped at the lion club park in clermont.the day of the brick yard 400 the year 2004. Iwent for a walk on the bike path'as i came back to our motorhome . IDUCKED under a tuliptree limb as ilooked up past the post office i saw a plane,it looked odd .all i could see were the two wings,it was covered with a white fog that made the wings get fatter as it encircled wings kind looked like bubble wrap.i horrered up at the plane ,what the hell goin on up there, i then looked to see where the fog was coming from,i steped out to entrence road and across the street about100 feet abovethe house ,two vapor came streames came out no where,clear bluesky above.i then hollered that plane cant fly like that,i watched the planefor about five minutes, as i watched the secondstream enveloped the whole plane i said to myself, that plane is going to crash,i am going to be eye witness.i watched for five minutes. then in the blink of an eye, the plane was gone the twovapor trails were gone the only thing left was clear blue sky thats my story."],"Sighting Duration":"Undisclosed","Case Number":"19302","Latitude":"39.773236","Source":"MUFON"}