{"Date of the Event":"10/13/2002 04:45 UTC","Object Features":"Dome","Object Flight Path":"Unknown","Longitude":"-86.66301","Latitude":"30.409922","trends":["There have been no other sightings in Mary Esther","This sighting has never been favorited."],"Disposition":"Unresolved","Country":"United States","Date Submitted":"10/13/2002 04:45 UTC","Viewing Distance":"Over One Mile","Log Number":"","files":["/var/www/straped/mufon/html2text/1931.html.txt","/var/www/straped/mufon/org/1931.html"],"Source":"MUFON","Object Shape":"Triangle","Summary":"Triangle with lights that looked like a planet fro","City":"Mary Esther","divs":["Sighting DetailsWhile observing shooting stars in the north western sky in the early A.M., wenoticed a planet like object, that was very bright and pulsing. The reason wenoticed the object was that we had been staring at that part of the sky and theobject just faded into our field of view.Our initial reaction was shock Theobject came into view, stayed in one spot for about 2-3 minutes, then startedheading twords our position. As the object got closer we were able to determine that as opposed to being one large pulsing light, the object seemed to have a triangular shape to it with 3 smaller lights in the triangle corners and one large clearly pulsing light in the center. The center light seemed to be suspended inside the object.The center light pulsed from red-orange-violet-blue-green- and yellow.The center light seemed to be really fluid, where as the 3 outside lights hadthe same rainbow colors, but were less fluid looking they seemed to be timed.The object made no sound. It was the silence of the object that caused the mostdiscomfort for myself and the 2nd witness. We couldnt believe something that bigcould be completly silent.The object appeared looking like an artificially bright planet or star from thenorth west. It approched, passed over our position and headed south east. Theobject stopped in the approximate location of Eglin AFB. The object decendedslowly, as it decended, the object became obscured by trees in our line of view.This craft is almost impossible to see in the night sky unless it moves.I can recall many occasions seeing similer bright artifical planet like objectsin the skythe combination of timed and pulsing colored lights seems to fool yourvisual senses, but since they stayed stationary, I would not pay as muchattention to them. With this sighting, we got the opportunity to see the craftmove and manuver."],"Region":"Florida","Tags":"City","Case Number":"1931","map":"<A HREF = \"http://maps.google.com/maps?q=30.409922,+-86.66301(1931)&iwloc=A&hl=en\"> mufon case (1931) map </A>","Weather Factors":"Windy","Sighting Duration":"00:30:00"}