{"Object Shape":"Star-like","trends":["There has been one other sighting in Denbigh","There were no other sightings in Denbigh on or around September 14th 2009"],"Summary":"object performing high speed change of direction and acceleration.","files":["/var/www/straped/mufon/html2text/19313.html.txt","/var/www/straped/mufon/org/19313.html"],"Weather Factors":"Unknown","Region":"Wales","Case Number":"19313","Object Features":"Unknown","divs":["Sighting DetailsViewing the hills that surround Denbigh hospital, I observed an object at a distance of approximatley 8 - 10 miles on a clear day with few clouds. The object which looked like a bright light, which on first viewing I felt was probably an aircraft with the sun shining on its fuselage, was flying at an approximate height of 500 feet following the contour of the hills, when it very suddenly made a 45 degree change of direction and acceleration to very high speed, with its new direction being upwards and contrary to the direction I was facing....giving me the impression its heading was \"towards\" me, though out into the atmosphere. I lost sight of it very quickly due to its acceleration. there was no accompanying sound or other phenomena before or after the event. The object had the appearence of a bright star, which became brighter as it sped away. I am unsure as to the compass heading of the object as I was in an unfamiliar location. However I felt I was facing south south east. there were no witnesses. I have served in the Royal Airforce, and have experience in observation, recording and identification of areial phenomena."],"Log Number":"GB-09142009-0012","Tags":"City","Longitude":"-3.423962","Disposition":"Unresolved","Date Submitted":"09/14/2009 04:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.192066,+-3.423962(19313)&iwloc=A&hl=en\"> mufon case (19313) map </A>","Viewing Distance":"Over One Mile","Latitude":"53.192066","City":"Denbigh","Country":"United Kingdom","Date of the Event":"09/14/2009 02:35 UTC","Source":"MUFON","Sighting Duration":"00:00:07","Object Flight Path":"Path with directional change"}