{"files":["/var/www/straped/mufon/html2text/19319.html.txt","/var/www/straped/mufon/org/19319.html"],"Latitude":"32.634217","Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Object Shape":"Circle, Fireball, Star-like","Tags":"City","Weather Factors":"None","Date of the Event":"04/21/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.634217,+-114.396536(19319)&iwloc=A&hl=en\"> mufon case (19319) map </A>","City":"Fortuna Foothills","Case Number":"19319","Disposition":"Hoax","divs":["Sighting DetailsMyself and my now ex-girlfriend were driving home after work. We were eastbound on I-8 from downtown Yuma to the Yuma Foothills near Wellton. Over the mountains separating Yuma from Wellton I seen 4 lights rise above the mountains. I had lived in Yuma for 4 years during which I've seen every piece of hardware and equipment the military sends into the air. My girlfriend and I both knew these 4 objects were nothing we had seen before. They resembled the moon but much smaller but that is what the coloring reminded me of was the moon on a smokey night. The large size of these objects was very apparent. In order for the objects to appear as they did while we were driving meant they had to be large, flying low, and a distance away. I believed the lights to be in the direction of Phoenix. We were both quite excited by the sighting. It was like being a little kid again, seeing something for the first time. There were some poor quality pictures of the objects which are no longer in my possession. We lost sight of the objects as we neared the mountains and I never seen them again. The next day I was at my father's house and he was watching tv and a commercial for the local news came on and I seen the video of what I had seen the night before. I told him Chanel \"my ex\" and I had seen those ufo's the night before. I sat down to watch the report and it said it was a Phoenix sighting and some air force goon had said it was his neighbor who had tied flares to balloons and released them. I thought the report was laughable because I had witnessed this from Yuma! This is my first report I've made about the incident. I have only told close friends up to now."],"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Source":"MUFON","Longitude":"-114.396536","Date Submitted":"09/15/2009 12:15 UTC","Region":"Arizona","Log Number":"US-09152009-0001","Summary":"UFO Sighting from Yuma","trends":["There has been one other sighting in Fortuna Foothills","There were no other sightings in Fortuna Foothills on or around April 21st 2008"]}