{"Longitude":"18.07362","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=59.33039,+18.07362(19321)&iwloc=A&hl=en\"> mufon case (19321) map </A>","Sighting Duration":"00:00:30","Object Shape":"Unknown","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19321.html.txt","/var/www/straped/mufon/org/19321.html"],"divs":["Sighting DetailsI was at the movie premiere of the swedish movie \"Flickan som lekte med elden\", and me, my mom and her bodyguards were walking home. Just when we go out of the cinema, I looked up in the sky. Two spotlights were shooting up in the sky from the cinema. I love spotlights in the sky, because it looks so cool. So, I kept looking at the pillars of light while slowly walking across the marketsquare. Then suddenly, I see a light that flies by very fast. I thought it was a meteorite or something, because I only saw it for a second, and then it disappeared over the roof of the mall called \"PUB\". I was really happy, because I love rare events such as meteorites. But then, still looking at the sky, I see a new object! However, this one gets hit by the spotlight and reflects the light like it was a mirror! I quickly realise that a rock doesn't reflect light that well, satellites are too far up, airplanes are also too far up to cause the size of the reflection and so on. When the reflection was at it's biggest, it was probably... a little smaller than my pinkynail. Both objects were flying at the same direction I think, and if so, both were west-bound. The second object came approximately 5 seconds after the first one. I was really shocked afterwards, because I realised that this was my first sighting were I actually had a clue about the material it was made from. Another maybe important note; At the premiere there were MANY swedish celebrities, and I saw 5 or more highly ranked politicians, most from the current government. There were also actors, movie-makers, famous journalists etc. I don't know, but it just seems a little intended that two objects flew above the cinema just when a huge number of famous and loved people were starting to exit the building."],"City":"Stockholm","Region":"Stockholm County","Source":"MUFON","Case Number":"19321","Object Features":"Undisclosed","Summary":"2 objects, one with a shiny surface, flying on \"low\" altitude.","Latitude":"59.33039","Country":"Kingdom of Sweden","Date Submitted":"09/15/2009 01:48 UTC","Log Number":"SE-09152009-0003","Date of the Event":"09/14/2009 11:23 UTC","Weather Factors":"None","Object Flight Path":"Straight-line path","Disposition":"Unresolved","trends":["There have been 4 other sightings in Stockholm","There were no other sightings in Stockholm on or around September 14th 2009"]}