{"Source":"MUFON","Case Number":"19327","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Object Features":"Undisclosed","Country":"United States","files":["/var/www/straped/mufon/html2text/19327.html.txt","/var/www/straped/mufon/more/19327_submitter_file1__IMG_0695.JPG","/var/www/straped/mufon/more/19327_submitter_file2__IMG_0699.JPG","/var/www/straped/mufon/org/19327.html"],"Weather Factors":"None","divs":["Sighting DetailsMe and my boyfriend were vacationing in Myrtle Beach, SC. I was sitting out on the balcony of our hotel, which was ocean front. I was looking up at the sky and saw a flash of orange light. It appeared instantly like a flash, then faded away. I yelled at my boyfriend to come watch. About 5 minutes later we both saw it, and this time it had a second light that flashed after the first one disappeared, but the second light was positioned farther down and to the right of the first light. He said \"oh it's just landing gear on a plane.\" Then I asked where the other lights were if it was just a plane...he agreed with me. About 15 minutes later we saw it appear again, except it was in a different part of the sky. The light was definately orange, and definately brighter and bigger than any of the stars. We could also see one of the planets, and the orange light was bigger than the glowing planet. This all happened between 10-10:30pm. We went to bed. My boyfriend woke up around 4am to go to the bathroom and he stepped outside and saw the light flash again....which was 6 hours later, which threw the whole idea of \"it might of been a plane\" out the window. He grabbed his dsl-r camera and set it on the tripod. The flashing light came back and he was able to snap a couple of pictures before it went away. The next couple of nights that we were there, I went outside to see if the light came back, but we never did see it again."],"Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=33.69207,+-78.878234(19327)&iwloc=A&hl=en\"> mufon case (19327) map </A>","Log Number":"US-09152009-0009","City":"Myrtle Beach","Summary":"Orange flashes in sky seen 3 times over a period of 7 hrs.","Longitude":"-78.878234","Region":"South Carolina","Latitude":"33.69207","trends":["There have been 52 other sightings in Myrtle Beach","There was one other sighting in Myrtle Beach on or around September 10th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Date of the Event":"09/10/2009 10:30 UTC","Date Submitted":"09/15/2009 10:35 UTC","Tags":"City","Object Shape":"Flash"}