{"divs":["Sighting DetailsI awoke at approximately 4:45 a.m. due to a burning pain in my right arm at the elbow nearest my body. I felt an area of skin that seemed hot and burning. I noticed some whitish substance on my arm that easily came off when I touched it. There was a single line about 1 inch long where the skin was broken in a very neat line like a razor blade would make. This opening in the skin seemed very shallow and there was no bleeding. Around this line was an approximate 4 inch area of skin that was slghtly reddened with streaks of white tissue (no redness) that were raised from the normal level of skin almost like an allergic reaction. Between these white raised lines was reddened skin. No pain or itching was present. The only discomfort was in the area of the single line \"break\" in the skin which burned when I touched it. I had a somewhat similar episode about 4 months ago on the outer part of my left thigh. On this occasion, again in the early morning hours, I took a photo of the skin which had a large red spot in the middle of two small puncture marks that were all lined up in a straight line spaced about 3 or 4 inches apart but directly on line. A friend of mine who is a Mufon member suggested that I report these events."],"Log Number":"US-09152009-0016","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/19334.html.txt","/var/www/straped/mufon/more/19334_submitter_file1__HPIM0150.JPG","/var/www/straped/mufon/more/19334_submitter_file2__HPIM0147.JPG","/var/www/straped/mufon/org/19334.html"],"Case Number":"19334","City":"Hollywood","Source":"MUFON","Date of the Event":"09/08/2009 04:45 UTC","Region":"Florida","Longitude":"-80.14628","Object Shape":"Unknown","Latitude":"26.016671","trends":["There have been 18 other sightings in Hollywood","There were no other sightings in Hollywood on or around September 8th 2009","This sighting has never been favorited.",""],"Date Submitted":"09/15/2009 07:29 UTC","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Country":"United States","Tags":"City","Summary":"Possible visitation or abduction","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.016671,+-80.14628(19334)&iwloc=A&hl=en\"> mufon case (19334) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unknown"}