{"Sighting Duration":"00:00:07","Longitude":"-122.671317","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around September 15th 2009"],"Summary":"Solid white light followed by jet (military?)","Latitude":"45.525212","files":["/var/www/straped/mufon/html2text/19337.html.txt","/var/www/straped/mufon/org/19337.html"],"Case Number":"19337","Object Shape":"Star-like","Object Features":"Undisclosed","Disposition":"Unknown","City":"Portland","Object Flight Path":"Path with directional change","Tags":"City","Country":"United States","Date Submitted":"09/16/2009 12:15 UTC","Date of the Event":"09/15/2009 09:34 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.525212,+-122.671317(19337)&iwloc=A&hl=en\"> mufon case (19337) map </A>","Source":"MUFON","Region":"Oregon","Log Number":"US-09162009-0001","Weather Factors":"None","divs":["Sighting DetailsApproximately 4 weeks ago, my wife and I saw a solid white light floating across the skies of Portland to the SE, it made no noise we could detect. Knowing regular air traffic used blinking lights and were normally accompanied by a noise, and being used to often times heavy regular air traffic, we found this particular object to be a bit odd. Not being one to report strange things in the sky, we let it go. However, on the night of September 15th, 2009, I walked into the front yard to smoke a cigarette, looked to the SW and saw what appeared to be a plane moving in a southerly direction, it had a white light in the front and two red lights trailing behind it. As I watched, I noticed the white light, which did not flash or blink, start to move further out in front of the two red lights. After a few more seconds, I realized they were two separate craft. The white light being the same white light as witnessed by my wife and myself about 4 weeks earlier, the red lights trailing it appeared to be a jet. I heard the sounds of jet engines in the direction of the red lights. I continued to watch for several seconds as the white light extended it's distance from the following jet until both lights disappeared behind the trees. I don't usually involve myself, or my family, in these things, but my wife and I agreed this warranted some attention and we felt that MUFON could, and would, handle this with discretion. I am willing to be interviewed by one of your representatives, and then proceed from there."],"Viewing Distance":"501 Feet - 1 Mile"}