{"Country":"United States","Object Features":"Undisclosed","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around August 15th 2009"],"Date Submitted":"09/15/2009 04:21 UTC","Object Flight Path":"Undisclosed","Disposition":"Hoax","Viewing Distance":"Unknown","Source":"MUFON","City":"Minneapolis","map":"<A HREF = \"http://maps.google.com/maps?q=44.985155,+-93.256366(19333)&iwloc=A&hl=en\"> mufon case (19333) map </A>","Longitude":"-93.256366","Weather Factors":"Unknown","divs":["Sighting DetailsIt was a beautiful clear blue sky day except for one puffy white cloud high in the sky. I was laying in a private swimming pool on a raft looking up at the sky with a friend. Out of the center of the cloud drouped what looked at first to me like a parachutte with someone dangeling at the bottom. In a short time we could see that it was not a person, but a metal colored cylinder. It appeared to be attached close to one end of the chutte and dangled erratically. At first I thought it was because it was too heavy for the chutte, because it was coming down fast and the parachutte seemed to be indented on either end as if was being pulled down too fast. No plane was seen in the sky. The parachutte however, did not sway or move in any way erratically, but came down swiftly and straight as if it was guided. When it got approximately 100 to maybe 175 yards over the tree line. It vanished; but vanished instantly as if it hadn't been there. Then the cloud started to come down very quickly, as if it was coming right at us. We started to get out of the pool and head in to the house, because we got the strange feeling the cloud was coming right at us. Then, just over our heads, the cloud dispursed."],"Case Number":"19333","Latitude":"44.985155","Tags":"City","Date of the Event":"08/15/2009 12:00 UTC","Sighting Duration":"Undisclosed","Region":"Minnesota","files":["/var/www/straped/mufon/html2text/19333.html.txt","/var/www/straped/mufon/org/19333.html"],"Object Shape":"Other","Log Number":"US-09152009-0015","Summary":"parachutte shape with attached metal-colored cylinder at bottom of chutte"}