{"Object Shape":"Cylinder","Sighting Duration":"00:10:00","trends":["There have been no other sightings in High Level","This sighting has never been favorited."],"Date of the Event":"04/07/2003 09:15 UTC","Case Number":"19331","map":"<A HREF = \"http://maps.google.com/maps?q=58.510343,+-117.132954(19331)&iwloc=A&hl=en\"> mufon case (19331) map </A>","Latitude":"58.510343","Country":"Canada","Region":"Alberta","Log Number":"CA-09152009-0013","Longitude":"-117.132954","Weather Factors":"Unknown","Summary":"Pure white cylinder, no seams or windows or doors. About 150 feet above me","Viewing Distance":"Unknown","City":"High Level","Date Submitted":"09/15/2009 03:48 UTC","Source":"MUFON","Object Features":"Undisclosed","divs":["Sighting DetailsI was working on an oil pipeline about a half hour drive in the woods from High Level, Alberta. It was a bright, beautiful morning, and not a cloud in the sky. I woke up late for work, so I jumped in a work truck and headed for my co worker who was a back hoe operator. It was about 8:30 in the morning. I was waiting for the back hoe driver to finish digging out a hole in the ground. I sat in a truck in a huge clearing in the woods. I was about 200 feet away from the back hoe. The clearing was huge, and was made to build a particular part of the pipeline. I seen something in the distance just over the treeline, around 9:10am. It was a small white object. Moving very slowly, maybe 5 feet a second. I thought it might be a plane or helicopter, but it was too close to the ground, so I kept watching. It was coming closer and closer, and right in my direction. I jumped out of the truck to see it more clearly. I turned the truck off to see if it was making any noise, but it wasn't. My heart started pounding as hard as ever, when I realized it wasn't a plane or helicopter. Soon, it was right above the clearing, and right above the back hoe and the operator inside it. I waved and yelled as loud as I could to get his attention, since the back hoe was loud itself. He noticed me for a second, so I pointed above him. He looked up for a second, but didn't see anything, because of the cage that was built around the operators area for safety, and not seeing anything, he kept on working. Then the slow moving cylinder was exactly right above me. It was about 100 feet long, and 20 feet wide. A perfect, pure white cylinder. I couldn't see any seams, doors or windows. It was travelling in a perfectly straight line. It's like they wanted me to see them. It kept on slowly creeping in the sky away from me to the opposite side of the clearing and I watched until it left my field of sight. When I couldn't see it any more, I franticly ran to my co-worker I asked him if he noticed anything, but he didn't. I told him what I seen, and he said, \"It's probably Jesus!\" since he was a devout religious man. This stuck with me, because since then, I found out that it was written in the bible that Moses followed a giant white cylinder,(but Moses's cylinder was emitting flames) to where the 10 Commandments were written and Moses also followed one for 40 years through the desert. I also found many videos on the internet of white cylinders, including a video from the Russian army. They chased it with super sonic jets, and couldn't keep up with it. In that video, they have a CGI comparison of a russian jet to the cylindrical object. I think that it is about the same size and description of exactly what I saw. I have been watching the skys ever since."],"Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/19331.html.txt","/var/www/straped/mufon/org/19331.html"],"Object Flight Path":"Undisclosed"}