{"Disposition":"Insufficient Data","Object Shape":"Other","Viewing Distance":"Over 1 Mile, Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.345486,+-121.890306(19339)&iwloc=A&hl=en\"> mufon case (19339) map </A>","Weather Factors":"Unknown","Region":"California","Object Features":"Wings","Longitude":"-121.890306","trends":["There have been 106 other sightings in San Jose","There were no other sightings in San Jose on or around September 14th 2009","This sighting has never been favorited.",""],"Summary":"looked like the swallow crop circle flying across the sky","City":"San Jose","Latitude":"37.345486","Date of the Event":"09/14/2009 09:30 UTC","files":["/var/www/straped/mufon/html2text/19339.html.txt","/var/www/straped/mufon/more/19339_submitter_file1__ufo_san_jose_9_14_09.jpg","/var/www/straped/mufon/org/19339.html"],"divs":["Sighting Detailssitting in the hot tub watching the sky as i do most nights, i witnessed the most novel sight: a slightly blue, transparent 'swallow' moving across the stars. it covered about 80 degrees of a sky in less than 5 seconds, and was large beyond measuring (see graphic for relation to star field). it moved from west to east. as it crossed, i looked away for a split second, returning to see it still there. it was faint, easier to see out of the corner of your eye than trying to focus on it. it was very distinct in shape, and i immediately recognized it as a recent crop circle (which moved my brain in a different direction). it was not a movie premiere light, nor plane (moving too fast). it did not arc or bend; moved straight off towards horizon and faded in a blink. being my second 'official' UFO (after giving it a moment of serious thought and continued observation), i felt relieved, as if the human charade had taken a break, and i glimpsed beyond."],"Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Log Number":"US-09162009-0003","Case Number":"19339","Country":"United States","Date Submitted":"09/16/2009 02:35 UTC","Tags":"City"}