{"Tags":"City","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"07/16/2009 09:07 UTC","Region":"Minnesota","Object Flight Path":"Hovering then path,Path with directional change","Object Features":"None","Case Number":"19330","Log Number":"US-09152009-0012","Latitude":"45.188854","Longitude":"-93.397454","Object Shape":"Circle, Fireball, Oval","City":"Champlin","Disposition":"Insufficient Data","Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There have been no other sightings in Champlin","This sighting has never been favorited."],"divs":["Sighting DetailsComing to traffic light headed north on 169 in Champlin, Mn near daughters dance studio near elm creek parkway intersection. Look up to see what appears to be something on fire over head. It is not that large and looks firey white or super pale silver with a solid core (Metallic?) but a shadow framing it, sort of like a fried egg that is a bit off center. appears to hover a bit then moves slowly to the west? then goes in a kind of short zig zag then seems to take off or fade away. Thought it was a small plane on fire. I told my daughter to try to follow it as I had to drive since the light changed but it just seemed to disappear. Have spent weeks trying to debunk it and looking on net for rational explanation but can't so decided to report it. I've seen helicopters with search lights. planes on foggy nights etc, this wasn't that. Also rolled down window to hear any sound and it was silent other than traffic sounds. It was exciting because it was different and not a plane etc, at first worrisome because at first glance I thought it was something on fire. Curious."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19330.html.txt","/var/www/straped/mufon/org/19330.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.188854,+-93.397454(19330)&iwloc=A&hl=en\"> mufon case (19330) map </A>","Summary":"Thought it was a small plane on fire over a busy highway (169) at stop light. Moved at angel then erradict then zipped off.","Date Submitted":"09/15/2009 01:24 UTC"}