{"Country":"United States","Case Number":"19344","Summary":"Conical/egg shaped craft landed in woods near nature center/pond","Disposition":"Unknown","Source":"MUFON","Longitude":"-73.078997","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19344.html.txt","/var/www/straped/mufon/more/19344_submitter_file1__craft.JPG","/var/www/straped/mufon/more/19344_submitter_file2__Map.JPG","/var/www/straped/mufon/org/19344.html"],"Object Features":"Dome, Window(s), Patterned Surface","Date of the Event":"03/31/2009 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.346208,+-73.078997(19344)&iwloc=A&hl=en\"> mufon case (19344) map </A>","Tags":"City","Latitude":"41.346208","Viewing Distance":"101-500 Feet","City":"Ansonia","trends":["There has been one other sighting in Ansonia","There were no other sightings in Ansonia on or around March 31st 2009","This sighting has never been favorited.",""],"divs":["Sighting DetailsI was walking in the woods near my house during the month of April at approximately 2 in the morning. There are many trails for people to travel along and I walked into a clearing. The clearing is just down a path from the Ansonia Nature Center in Ansonia, CT. I was simply meandering through the clearing aimlessly gazing around when I noticed an object towering above some trees. The part of the object I saw was conical or the pointy end of an egg. There appeared to be geometrical shaped paneling that was gray and a black panel, maybe a window or viewing bay roughly at the center of the side of craft. The object was stationary and apparently was on the ground roughly 100 yds away. I only saw the top half of the craft as there were trees blocking the lower portion. At first I didn't think much of the sighting at all and continued to meander around a bit more as if the object had always been there or was nothing of significance. After a double-take I walked back to a spot where I could see the craft and found myself in rather a state of disbelief, mystified, scared, in awe, shocked, and a eerie sort of sinister feeling came over me that the object wasn't from earth and just didn't quite belong here. I continued to move around a bit and strangely found myself stopping and putting my nose up against an errant plant limb. I stood there with my nose touching the limb for roughly two minutes as if I was frozen or unable to move and as I was doing so something very lightly and gently began to rub up against my nose as if trying to comfort me or something. After this occurrence, I began to move again and decided to get away from the area and walked back home rather quickly and scared."],"Sighting Duration":"Undisclosed","Region":"Connecticut","Object Flight Path":"Stationary","Date Submitted":"08/09/2011 10:51 UTC","Log Number":"US-08092011-0048","Object Shape":"Cone, Egg"}