{"Latitude":"28.627777","Country":"United States","Weather Factors":"None","City":"Maitland","Object Flight Path":"Path with directional change","Date of the Event":"09/16/2009 09:45 UTC","Longitude":"-81.363124","Summary":"Triangular shaped object with three lights, front light shut off, moving slow","Disposition":"IFO","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Date Submitted":"09/16/2009 10:53 UTC","Region":"Florida","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was leaving the Publix Grocery store (near 434 and Maitland Blvd) and as I was leaving in my car, I stopped at a stop sign and saw an triangular object flying towards Maitland Summit Blvd just over the tall building under construction there. First thing I noticed was the two white lights in the back of the object and one white light (which looked to be in the middle of the two lights in the back but in the front of the object). It was nighttime and I couldn't make out any form between those lights, so I came to the conclusion that it was triangular from the configuration of the lights alone. It also had a red blinking light right smack dab in the middle of the two lights in the back. It seemed to blink on cue, same interval each time (every two seconds or so). Shortly after viewing the object, the front light shut off and I didn't see it come back on the rest of the time I viewed the object. It didn't pass in front of any clouds when the light went out so nothing was obstructing my view of the light. It was moving away very slowly, and at this point, I shut my music off and rolled down the window and couldn't hear any sound coming from it. It seemed to be close enough that I would have heard something. I lost a visual of the object when I had to pull up to an intersection with my car facing in the opposite direction the object was traveling in. I live less than a mile away in the direction the object was moving and I couldn't see it on my way home. While driving home, I called my wife to see if she could see it and she couldn't. She had brought our dogs outside to use the bathroom while looking in the sky and we noticed that all the dogs in the neighborhood seemed stressed out and they were very noisy. My own dogs were very upset and stressed when they came outside too. I don't know if it was related at all, but it sure seemed quite strange. It's possible that this was a plane I guess, but it was flying slow enough and looked strange enough for me to want to report it at least."],"trends":["There has been one other sighting in Maitland","There were no other sightings in Maitland on or around September 16th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=28.627777,+-81.363124(19351)&iwloc=A&hl=en\"> mufon case (19351) map </A>","Log Number":"US-09162009-0015","Case Number":"19351","Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/19351.html.txt","/var/www/straped/mufon/org/19351.html"]}