{"Date of the Event":"09/16/2009 08:00 UTC","Object Flight Path":"Stationary","Latitude":"40.254147","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/17/2009 03:39 UTC","Object Features":"None","divs":["sighting detailsi was walking my dog on a clear night at about 8pm. it had just gotten dark. i was headed toward a \"t\" intersection and on the far side of the intersection, on the lot of an unoccupied and unlit home, i noticed a vivid red circle. this circle appeared perfectly round with zero distortion on the edges and uniformly lit or colored. i did not perceive it as a ball. the distance was in the area of 125 yards or so. the red circle appeared to be 6 ft off the ground and stationary. i kept my eyes on the as i walked in that direction, thinking it was some sort of light. i felt curious, nothing more. it seemed as if my viewing angle changed slightly as i thought a branch from a tree on the property was in front of the object. the object appeared to get fuzzy and fade within a second. there were some teens walking on the other side of the street i was on, in the opposite direction with their backs to the circle. i looked at them to see if they noticed it but there was no indication of that. i walked to the intersection and looked at the property from about 30 yards and there were cars, lights, people or anything. there were no cars driving on either street and no traffic lights are anywhere near the area. i returned to the location\\distance i observed the circle from about 4 minutes later, thinking it was an ocular trick on my eyes, but could do nothing to repeat the event."],"Longitude":"-75.130454","trends":["There have been 5 other sightings in Warrington","There were no other sightings in Warrington on or around September 16th 2009"],"Log Number":"US-09172009-0007","Disposition":"IFO","Case Number":"19359","files":["/var/www/straped/mufon/html2text/19359.html.txt","/var/www/straped/mufon/org/19359.html"],"Summary":"Clear well defined red circle 6ft. off ground. Est. Distance of 125 yards. Est. diameter of 4ft. 10 second duration then faded rapidly.","Source":"MUFON","Object Shape":"Circle, Sphere","City":"Warrington","Tags":"City","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.254147,+-75.130454(19359)&iwloc=A&hl=en\"> mufon case (19359) map </A>","Sighting Duration":"Undisclosed","Country":"United States"}