{"Tags":"City","divs":["Sighting DetailsI walked out to my paio for a smoke and above the building North of me was a very large object. It was a cloudless early evening, not even twilight yet. Not a cloud anywhere....and off to the north was this very, very WHITE object with a shape to it. It was almost a box at one end and a tappering of the rest of it. It never moved in any direction for the 10 to 15 minutes that it was there. It also had a shimmering effect to it. At one point a commercial jet passed in front of it and seemed to veer away from its normal flight path. Almost evasive in nature, while the object never moved. I was in the military for six years....This was no weather ballon. I also never heard a sound from it (like a helicopter). My first thoughts were of great interest. There where no clouds in the sky. If you ever look at Venus and how bright that can be.....times that brightness by 5 but whiter than anything I've ever encoutered. Finally, the object moved a bout 20 yards to my right (East) and vanished. I'm wondering if you've had any other reports from people in the Phoenix Metro area. Thank You For your time. Yours, Jon Marini P.S. I'm sorry but I don't know how to send drawing and or pictures on my computer yet. But if you wish, I'd be happy to mail you a drawing of it. P.S.S. I'm very SANE"],"Case Number":"19358","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around September 8th 2009"],"Disposition":"Unknown","Latitude":"33.465654","Summary":"Walked on my patio and there it was","map":"<A HREF = \"http://maps.google.com/maps?q=33.465654,+-111.900674(19358)&iwloc=A&hl=en\"> mufon case (19358) map </A>","Log Number":"US-09172009-0006","Object Shape":"Square, Rectagular","files":["/var/www/straped/mufon/html2text/19358.html.txt","/var/www/straped/mufon/org/19358.html"],"Object Flight Path":"Stationary","Weather Factors":"None, Does Not Apply","Viewing Distance":"Over One Mile","Date of the Event":"09/08/2009 06:10 UTC","Country":"United States","Date Submitted":"09/17/2009 12:04 UTC","Region":"Arizona","City":"Scottsdale","Object Features":"Unknown","Source":"MUFON","Longitude":"-111.900674","Sighting Duration":"00:15:00"}