{"Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/19353.html.txt","/var/www/straped/mufon/org/19353.html"],"Case Number":"19353","Object Features":"None","Longitude":"-118.030975","trends":["There have been 6 other sightings in Cypress","There were no other sightings in Cypress on or around September 16th 2009"],"Date Submitted":"09/17/2009 01:42 UTC","Region":"California","Object Shape":"Circle, Star-like","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.8196,+-118.030975(19353)&iwloc=A&hl=en\"> mufon case (19353) map </A>","Summary":"Star-like objects moving slowly west - northwest","Weather Factors":"Windy, Light","Disposition":"IFO","Country":"United States","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"09/16/2009 02:40 UTC","Latitude":"33.8196","divs":["Sighting DetailsI went outside work for a break around 2:40 pm & just looked up & happened too see the objects which were hard to see at first but my eyes adjusted quickly. The sky was perfectly clear. I only saw one at first & thought it was a mylar balloon but it was stationary for about 2-4 minutes & I thought it was very odd. Not sure what altitude it was at. Then suddenly at it's 4 o'clock position a short distance away another identical object appeared out of nowhere. This object was the same size & brightness. The second object then moved towards the original object in a counter-clockwise spiral-like direction until it reached the area around the original objects 12 0'clock position & it disappeared completely. At that point the original object began moving slowly in a straight line in a west-northwest direction. I watched until It was blocked out by the building & it was moving into brighter sunlight. The whole sighting was about 6-8 minutes. Afterwards I thought it was very strange but certainly there would be a rational explanation. I don't believe in UFOs in the sense that they are alien craft."],"City":"Cypress","Log Number":"US-09172009-0001"}