{"Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Date of the Event":"09/15/2009 09:30 UTC","Longitude":"-97.31624","Tags":"City","Object Features":"Undisclosed","Disposition":"Unknown","Country":"United States","City":"Fort Worth","Case Number":"19352","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around September 15th 2009"],"Latitude":"32.726899","map":"<A HREF = \"http://maps.google.com/maps?q=32.726899,+-97.31624(19352)&iwloc=A&hl=en\"> mufon case (19352) map </A>","Region":"Texas","Sighting Duration":"00:00:08","files":["/var/www/straped/mufon/html2text/19352.html.txt","/var/www/straped/mufon/org/19352.html"],"Summary":"BLACK TRIANGULAR SHAPED CRAFT FLYS OVERHEAD","Object Shape":"Triangle","Log Number":"US-09162009-0016","divs":["Sighting Details So last night I was outside talking on my phone and laying on the trunk of my car looking straight up at the sky. Its partly cloudy but you can still see stars, especially overhead. Suddenly something caught my eye moving from behind a cloud that was in the northern part of the sky. I turned to focus on the object and for the first few seconds I couldn't make out what it was, only that it was an object traveling from north to south, when it got directly over head I could see that it was a huge black triangle, except that the back part of the triangle was concaved toward the front point. All black except for the dim light that it produced from the center front middle of the under belly. The dim light was what had originally caught my eye when I first noticed the object, it was completely silent as it glided overhead. I watched it for a few more seconds until I lost sight of it in cloud cover as the craft travelled south in a straight line same altitude. I'm not sure how high it was, only that it was flying a lot higher than say a cesna airplane but not as high as a commercial airliner. I'm not sure how fast it was traveling, only that it took about to 6-8 seconds to fly over from one side of the sky to the other, but that is including the clouds that were on the horizons. It was about the size of what a half dollar would look like if it were in your hand with your arm fully extended toward the sky. It was big, it was fast, it was silent and it was an awesome experience!!!"],"Date Submitted":"09/16/2009 11:20 UTC","Source":"MUFON","Weather Factors":"None"}