{"Country":"United States","Date of the Event":"09/03/2002 10:00 UTC","Sighting Duration":"00:05:00","Tags":"City","divs":["Sighting DetailsWhile camping at Bottomless Lakes State Park outside of Roswell, NM, mygirlfriend and I heard a strange, high-pitched, oscillating sound coming fromthe west. We heard the sound for about 30 seconds and got up from our campsiteout from under some trees to investigate. The sound was making area coyotesdogshowl like crazy. The object had a red light on one side and a green light on theother, and white lights on the front and back. The red and green lights wereabout a third of the way between the white lights-- if you connected the lights,it would look like a kite. So basically, not terribly unlike a small prop planeif it had lights at its extremities, but it sounded nothing like one. The red green lights were flashing and the white ones at he front and back stayed litconstantly.It was traveling relatively slow and low and went directly over us. As it did,due to the Doppler effect, the sound became lower and the oscillations slower.We followed it until it disappeared into the horizon. We couldnt actually seethe object, only the lights, so we have no idea about the actual shape, color orsize.We suspected it might be a B-2, but saw one the flying the next day outside ofAlamogordo and it did not sound the same at all. Based on subsequent Internetresearch, were pretty sure it wasnt one. Actually, when we logged onto thispage, the sound of opening pop up window is very simnilar. It sounded somewhatjet-like, but it oscilated unlike any jet I have ever heard.We reported this on the NUFORC site when we got back from our trip, but haventgotten any kind of response, so I thought I would report it here as well. Somefeedback would be much appreciated, even if it is just to tell us it was someplane we are unfamiliar with.Thanks in advance."],"Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/1936.html.txt","/var/www/straped/mufon/org/1936.html"],"trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around September 3rd 2002"],"Log Number":"","Case Number":"1936","Region":"New Mexico","Object Flight Path":"Straight-line path","Longitude":"-104.520564","map":"<A HREF = \"http://maps.google.com/maps?q=33.398916,+-104.520564(1936)&iwloc=A&hl=en\"> mufon case (1936) map </A>","Summary":"Humming, oscillating sounds and lights outside of","City":"Roswell","Latitude":"33.398916","Date Submitted":"09/03/2002 10:00 UTC","Weather Factors":"Windy","Object Features":"Unknown","Object Shape":"Diamond, Unknown"}