{"Case Number":"19377","Latitude":"41.336174","Region":"Pennsylvania","Object Shape":"Circle, Fireball","Summary":"Fireball tracks across sky on two different dates","Source":"MUFON","Longitude":"-75.971673","files":["/var/www/straped/mufon/html2text/19377.html.txt","/var/www/straped/mufon/org/19377.html"],"Date Submitted":"09/18/2009 08:50 UTC","Disposition":"Unknown","Date of the Event":"06/26/2009 10:30 UTC","Country":"United States","Object Flight Path":"Straight-line path","Log Number":"US-09182009-0011","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.336174,+-75.971673(19377)&iwloc=A&hl=en\"> mufon case (19377) map </A>","divs":["Sighting Details1. Where were you and what were you doing at the time? Location: Dallas Pennsylvania (10 miles outside of Wilkes-Barre). Driving South on PA Route 309, pulled over at a local gas station for a better vantage point. 2. What made you first notice the object? Bright orange fire ball off horizon (approx 45degreese off horizon), barely moving. 3. What did you think the object was when you first noticed it? A balloon or a piece of debris on fire, not moving in the sky. 4. Describe the object and its actions and motions. The object was circular, distinct flame like qualities tracking very slowly from north to south toward the City of Wilkes-Barre. 5. Describe your feelings, reactions and actions, during and after sighting the object. We (a group of 4 firefighters) did not think anything of it until we spoke to friends of ours about a month later a group of (6) firefighters at a Fire Department 10 miles away, who noticed the EXACT same object 1 month later over Swoyersville. This object was tracking west to east. At the sighting over Swoyersville, the firefighters scrambled for a pair of binoculars, but they were unable to focus on the object. After speaking with them I began research into what this might have been, not once did I think of a UFO. The same type object, different people, different date & time. 6. How did you lose sight of the object? The object was out of plain sight when it went over a mountain, continuing south toward Wilkes-Barre."],"Viewing Distance":"Unknown","Object Features":"Unknown","City":"Dallas","trends":["There have been 2 other sightings in Dallas","There were no other sightings in Dallas on or around June 26th 2009"],"Sighting Duration":"00:30:00","Weather Factors":"None"}