{"Date Submitted":"09/18/2009 01:44 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.224535,+-123.339148(19371)&iwloc=A&hl=en\"> mufon case (19371) map </A>","Weather Factors":"Unknown","Object Flight Path":"Stationary,Path with directional change","Disposition":"Insufficient Data","Source":"MUFON","Object Features":"Unknown","Summary":"White, green, red, flashing rotating lights.","trends":["There have been 8 other sightings in Roseburg","There were no other sightings in Roseburg on or around September 17th 2009"],"Object Shape":"Disc, Unknown","Region":"Oregon","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19371.html.txt","/var/www/straped/mufon/org/19371.html"],"Latitude":"43.224535","Longitude":"-123.339148","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsMany nights in August my wife and I noticed a strange light in the western night sky when it was dark. The lights seemed to change from white to green and then red like it was rotating. There was also a light in the northern skydoing the same thing. We looked at it through binoculars and it looked very mechanical the way it rotated and the lights changed in patterned color. We looked it up on the web and it was explained as the atmosphere making a star change color. We questioned that explanation and noticed the lights a few more nights in a row and then they were no longer visible. Tonight on Sept 17. 2009 at 10:00 pm I was laying o the couch watching a movie and my wife walked past the kitchen window and noticed a bright light coming from the western sky again so she stopped to look at what it was. She told me to come and look, so we stepped out into the backyard and noticed that it was the same light as before, but as we looked at it it started to fall very quickly and move left to right and then it would rise. The whole time this was going on it seemed to be moving farther away from us. The previous months sighting they did not noticibly move. We could tell the were moving because the neighbors tree line is visible and the lights would fall to just above the tree line and then rise again. I know for a fact that it was not a star. Whatever it is seems to like the area it flies over. I would welcome someone to come and witness this for themselves. We are going to borrow a telescope from my wifes parents so we can see it up close. I would take a lie detector test. My wife is someone who does not have an active imagination, so to have her see the same thing really tells me that it is a UFO. Sorry I dont have anything that would take a good picture or video or I would have."],"Tags":"City","City":"Roseburg","Date of the Event":"09/17/2009 12:00 UTC","Case Number":"19371","Log Number":"US-09182009-0005"}