{"Object Features":"Unknown","Source":"MUFON","Date of the Event":"12/10/1989 12:00 UTC","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 10 other sightings in Napa","There were no other sightings in Napa on or around December 10th 1989"],"Tags":"City","Case Number":"19379","divs":["Sighting DetailsOn December 10, 1989 in Napa California, I saw a very unusual \"thing\" in the early morning sky. While it was years ago, I remember the day and date vividly, December 9, 1989, the day before my sighting, I got married, so it's easy for me to remember the date. We stayed at home after our wedding, and my husband left early December 10 to run an early morning errand, so unfortunately I was home alone. I smoke cigarettes, so I was sitting out on the patio enjoying the morning sky, smoking a cigarette. My view was towards the west. I saw an egg shaped haze, (about the size of an egg if you held it up to the sky with your arms extended), and the best way I can explain it is, it looked like an \"out of focus\" patch of blue sky, as though you were looking thru a gas haze. This patch moved from the southwest toward the northeast. The intersting thing was the points of light within the haze. They were in a haphazard pattern, (a least 10 of them) but as the shape moved they remained stationary. As the haze moved, more tiny lights would appear in the front of the haze, and the lights in the back would disappear. It was as if you were shining a flashlight against a wall in a dark room, as you move the light across the wall, the pattern in the wall remains stationary, but as the light of the flashlight moves, whats in front lights up and whats in back of it fades out. It didn't move fast, just slowly moved across the sky, until it was out of my range of vision. I was very upset no one else was at home to witness what I saw. Just as it moved out of view my husband returned home. Dang! I really didn't know what it could be, but my gut feeling was, and still is, that it was something that was cloaked. Possibly a craft that has the capacity to reflect back what is surrounding it, (and on this day, it's cloaking abililty was just kinda out of whack). I know this sounds like I've watched to many movies, but it just makes the most sense to me. At the time I called the local radio station, hoping maybe someone else saw it and made a call, but no, I was told no one else had reported any usual sightings. I still think about it, and wonder. That's why I needed to record what I saw with this email. Maybe it will make sense to someone else. Sincerely, Kathy Hamberis"],"Weather Factors":"Unknown","Longitude":"-122.289649","Object Shape":"Egg","Region":"California","Date Submitted":"09/18/2009 11:00 UTC","Sighting Duration":"Undisclosed","Latitude":"38.306722","Log Number":"US-09182009-0013","files":["/var/www/straped/mufon/html2text/19379.html.txt","/var/www/straped/mufon/org/19379.html"],"Object Flight Path":"Straight-line path","City":"Napa","Summary":"Egg shaped haze in bright blue sky, with points of light in a haphazard pattern.","map":"<A HREF = \"http://maps.google.com/maps?q=38.306722,+-122.289649(19379)&iwloc=A&hl=en\"> mufon case (19379) map </A>","Disposition":"Insufficient Data"}