{"trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around September 18th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.76625,+-106.481871(19372)&iwloc=A&hl=en\"> mufon case (19372) map </A>","Region":"Texas","Disposition":"Unknown","divs":["Sighting DetailsAt 6:40 am on Friday September 18, 2009 I stepped out the front door to get car ready to take daughter to school. My door faces north and I looked up to see Venus fade with the sun coming up in the eastern sky. I unlocked the car and then looked due north and up as if to stretch. I noticed what looked like another star appear almost straight up from my location. I watched this star for about 5 minutes and found that it was moving slowly to the south. I opened my front door and asked my wife and daughter to come see what I was seeing. We watched this object for about 5 more minutes and noticed that it hade a dark see through haze about the exterior of it. It had appeared to be at about 10,000 to 20,000 feet high. The light then began to fade then flicker then bright flash then go out. at that exact moment another light just to the left but lower lit up then flickered and flashed then went out and the again but further to the left and higher about level with the first light another light appeared then flickered and flashed and the went out. Then the dark haze faded away and looked kind of like dissipating heat waves. The weather was nice no clouds no wind no rain. Visibility was unlimited. We felt fine although a bit bewildered at the site."],"Date Submitted":"09/18/2009 11:39 UTC","Weather Factors":"None","Source":"MUFON","Object Features":"Unknown","Tags":"City","Object Shape":"Diamond, Flash, Star-like, Triangle, Other, Unknown","Country":"United States","Date of the Event":"09/18/2009 06:42 UTC","Object Flight Path":"Hovering then path","Latitude":"31.76625","City":"El Paso","Longitude":"-106.481871","Case Number":"19372","Viewing Distance":"Over One Mile","Summary":"After sun up and Venus vanished as another star like object appeared.","Sighting Duration":"00:10:00","Log Number":"US-09182009-0006","files":["/var/www/straped/mufon/html2text/19372.html.txt","/var/www/straped/mufon/org/19372.html"]}