{"Summary":"A flashing light emitting anomaly over the sky of","Region":"Tennessee","Date of the Event":"10/21/2002 08:23 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/1937.html.txt","/var/www/straped/mufon/org/1937.html"],"Source":"MUFON","Country":"United States","Date Submitted":"10/21/2002 08:23 UTC","Object Flight Path":"Stationary","Weather Factors":"Unknown","City":"Martin","trends":["There has been one other sighting in Martin","There were no other sightings in Martin on or around October 21st 2002"],"Object Features":"Other","Log Number":"","Disposition":"Unknown","divs":["Sighting DetailsI first dismissed the light at 730PM as the same lights that I always observedin the sky for the last 4 years over Martin, but this time the light has notmoved at all except for a few minor course adjustments I would surmise. Inoticed it out of the corner of my eye, because it was flashing. I thought itwas a plane travelling away from my exact position in relation to the stars, butother planes have past by it in relation to me on the ground and it persist toremain in the exact area. I am excited and want someone to explain exactly whatit is. Man-made Gravitational Distortion Debris Burning EtcI have not lost sight and it will be back tomorrow night in the same place.This is low atmoshperic anomaly or object that remains in the same point in thesky in relation to the moon,stars and aircraft. It pulsates and flashes andemits beams of light and pieces of it shoot off the top of it. I observed thisphenomenom for 2 hours and it is 918PM and it is still in the same place.And I have gotten visual confirmations from countless other witnesses in thelocal business area on University Avenue from Papa Johns, Java Central Cafe, andcustomers.Tomas B. Woodyno1stunna@themail.com"],"Object Shape":"Undisclosed","Viewing Distance":"Over One Mile","Sighting Duration":"01:59:00","Longitude":"-88.850338","map":"<A HREF = \"http://maps.google.com/maps?q=36.343396,+-88.850338(1937)&iwloc=A&hl=en\"> mufon case (1937) map </A>","Case Number":"1937","Latitude":"36.343396"}