{"Log Number":"US-09182009-0008","Source":"MUFON","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was in my car and had just turned North onto US 19 from Curlew Road, in Palm Harbor and as I drove North in the inside lane, I observed what I first thought was a blimp to my west, and slightly ahead of me. I imagined it was flying over the Gulf, but as I drove further North, I could see there was no roundness or ovalness to it and it was white and seemed completely rectangular. My next thought was that it was a small plane pulling a banner (we see those frequently, flying over the beaches) but I could see no lettering, nor could I see a wavelike motion a banner makes as it is pulled through the air. As I stopped at the traffic light at Tampa Road, I put on my distance glasses to see it more clearly, but there was no plane or banner. The object appeared to be a flat rectangle, always ahead of me but growing smaller as it moved slowly across US 19, seemingly toward the North East. I saw a red helicopter fly toward the west, either over it or behind - I took the helicopter to be from The Coast Guard, since we see them frequently too. As I turned left (West) onto Nebraska Avenue the object was disappearing into the clouds behind the trees on the horizon. The object moved very slowly and steadily always staying parallel to the ground - I kept looking for a side to show up but it seemed to have no depth. I could see light reflecting across it and I thought it might be made of panels. I stopped by the BB&T Bank then went to Walgreen's, and all the while kept searching the sky but did not see it again. My feeling was that it just might be a UFO. (I am 81 and have seen several in my lifetime - I feel sure they are there.) Betsy Bertolino"],"City":"Clearwater","map":"<A HREF = \"http://maps.google.com/maps?q=27.969653,+-82.795923(19374)&iwloc=A&hl=en\"> mufon case (19374) map </A>","trends":["There have been 31 other sightings in Clearwater","There were no other sightings in Clearwater on or around September 18th 2009"],"Country":"United States","Viewing Distance":"Unknown","Case Number":"19374","Object Features":"Unknown","Weather Factors":"Unknown","Disposition":"Unknown","Date Submitted":"09/18/2009 04:10 UTC","Sighting Duration":"Undisclosed","Summary":"Looked similar to rectangle in Filer's Files, #37","Latitude":"27.969653","files":["/var/www/straped/mufon/html2text/19374.html.txt","/var/www/straped/mufon/org/19374.html"],"Object Shape":"Square, Rectagular","Date of the Event":"09/18/2009 02:00 UTC","Longitude":"-82.795923","Region":"Florida","Tags":"City"}