{"City":"Casper","Country":"United States","Weather Factors":"Windy","Object Features":"Window(s)","Longitude":"-106.303951","Date of the Event":"11/14/2008 02:45 UTC","trends":["There have been 10 other sightings in Casper","There were no other sightings in Casper on or around November 14th 2008","This sighting has never been favorited.",""],"Tags":"City","Disposition":"Unknown","Date Submitted":"09/18/2009 11:27 UTC","Log Number":"US-09182009-0014","Viewing Distance":"21-100 Feet","Region":"Wyoming","Object Shape":"Square, Rectagular","Object Flight Path":"Straight-line path","Case Number":"19380","Sighting Duration":"Undisclosed","Summary":"darkened ufo passed over, blocking out the stars","map":"<A HREF = \"http://maps.google.com/maps?q=42.875512,+-106.303951(19380)&iwloc=A&hl=en\"> mufon case (19380) map </A>","Source":"MUFON","Latitude":"42.875512","divs":["Sighting DetailsI let the dog out and stood on the back step and looked up at the stars as i allways do. I noticed that part of the sky was blacked out and at first it didn't register why. Then i noticed the windows in the craft and two people or beings looking right at me. They were so close that i could see the one was wareing a baseball style cap or what appeared to be one. That guy or being waved at me and my first thought was he must realize it's too late to try and do anything else but wave. As it passed over i was to stupified to do anything but sit there and watch. I thought to myself this is interesting, \"must be an Air Force recon ship.\" As i passed the event through my brain i think that the ship was a lighter than air ship and that it was manouvered by electric motors, I could here just a slight buzz of some kind. My second thought was, \"they did it, the U.S. has developed a hydrogen gel,\" (like that of aero-gel used to capture particles from commets.) Anyway, this thing and those in it seemed to me to be human and human made. It was just a little freaky seeing this thing at 2:45 in the morning. The reason i haven't said anything until now is that i didn't know any place like your website exsited. I just happened to catch your show on the tube and thought i'd check it out. Well, that's it in a nut shell, not triing to punn that because i know how these thing must sound. However it sounds your can take it for what it's worth."],"files":["/var/www/straped/mufon/html2text/19380.html.txt","/var/www/straped/mufon/more/19380_submitter_file1__ufo2.jpg","/var/www/straped/mufon/org/19380.html"]}