{"Tags":"City","Longitude":"-83.678916","Disposition":"Insufficient Data","Object Shape":"Fireball, Sphere","Sighting Duration":"Undisclosed","Summary":"IT LOOKED LIKE A FIREBALL IN THE SKY BUT DID NOT FALL OR STREEK ACROSS THE SKY LIKE A METEOR.","Country":"United States","divs":["Sighting DetailsHELLO MY NAME IS GREG HENRY.I WAS INTERESTED IN FINDING OUT IF ANYONE ELSE REPORTED THIS SIGHTING TO MUFON. BECAUSE IT WAS SEEN FROM AS FAR AWAY AS WISCONSIN. THIS SIGHTING TOOK PLACE ON JULY,4 2009 BETWEEN 9PM 10PM AN WAS SEEN BY ABOUT 4 PEOPLE WHO WERE AT MY HOME SHOOTING OFF FIREWORKS.THIS THING TO ME LOOKED LIKE A PLANE ON FIRE,BUT IT DIDN'T MOVE LIKE AIRPLANE,AND IT WAS NOT FALLING EITHER. WHAT I NOTICED WAS THAT IT MOVED ACROSS THE SKY FROM ONE PLACE TO ANOTHER IN LIKE FIVE SECONDS. THEN IT CONTINUED EAST TOWARDS PORT HURON.SO WE KIND OF JUST ALL JOKED ABOUT IT. BUT LATER ON THE NEXT FEW DAYS OR SO IT JUST STAYED ON MY MIND SO I WENT ON YOUTUBE AND TYPED IN UFO SIGHTING OVER MICHIGAN ON THE FOURTH OF JULY AND WE WERE'NT THE ONLY PEOPLE THAT SAW THIS THING. SO I WOULD LIKE TO KNOW IF THIS WAS INVESTICATED YET OR IF IT NOW. THIS IS NOT THE FIRST TIME THAT I HAVE SEEN SOMTHING STRANGE IN THE SKY OVER MICHIGAN. I HAVE VERY INTERESTING STORY IF ANYONE OUT THERE WANT TO HEAR ABOUT IT. FEEL TO CONTACT ME AT MY EMAIL ADDRESS TURBO39622@AOL.COM"],"trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around July 4th 2009"],"City":"Flint","files":["/var/www/straped/mufon/html2text/19387.html.txt","/var/www/straped/mufon/org/19387.html"],"Region":"Michigan","Weather Factors":"Unknown","Log Number":"US-09192009-0004","Latitude":"43.013577","Date of the Event":"07/04/2009 09:30 UTC","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Case Number":"19387","Source":"MUFON","Viewing Distance":"20 Feet or Less","Date Submitted":"09/19/2009 01:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=43.013577,+-83.678916(19387)&iwloc=A&hl=en\"> mufon case (19387) map </A>"}