{"Summary":"orange orbs","Date Submitted":"09/19/2009 02:04 UTC","Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"None","Object Shape":"Sphere","Case Number":"19388","Object Flight Path":"Stationary","Tags":"City","Country":"United States","Log Number":"US-09192009-0005","Disposition":"Unknown","divs":["Sighting DetailsMy husband and I have seen two UFO sightings in the past two days. The one which I will report here took place on September 17, at 9 pm (the other happened the following day at 9:45 pm). We have seen several UFOs before, as we look in the sky nearly every night, these incidences were the first two that I've not been able to rationalize or write off as possible known military crafts, or other possible known objects(though, this doesn't mean they were). We were driving home from Wickenburg, Arizona, east bound on 93. At roughly 9 pm I (the passenger) looked up at the sky and saw a large, bright orange orb directly ahead of us, somewhat low on the horizon. I responded with a shock in my voice and my husbands said, \"you see that too then? I've been watching it a for awhile now.\" We both continued to watch this orb. It slowly pulsed, it would be bright orange and then it would disappear completely and reappear again. After it did this a few times, suddenly there was another bright orange orb to the left of it, lower down the horizon. They both flashed in then out, and then the original one appeared to be two, right next to each other, so now there were three. All three flashed and then appeared to be five. The final formation was two on top, two to the left on a downward diagonal and one parallel the bottom left on a diagonal to the right - looking much like a pyramid with two top points, one on the left side, one on the left bottom, and one on the right bottom. Then all the orbs disappeared completely."],"Longitude":"-112.724202","Region":"Arizona","map":"<A HREF = \"http://maps.google.com/maps?q=33.973501,+-112.724202(19388)&iwloc=A&hl=en\"> mufon case (19388) map </A>","Sighting Duration":"Undisclosed","trends":["There have been 7 other sightings in Wickenburg","There were no other sightings in Wickenburg on or around September 17th 2009"],"Object Features":"Undisclosed","City":"Wickenburg","Date of the Event":"09/17/2009 09:00 UTC","Latitude":"33.973501","files":["/var/www/straped/mufon/html2text/19388.html.txt","/var/www/straped/mufon/org/19388.html"]}