{"Weather Factors":"Unknown","Disposition":"Unknown","Source":"MUFON","Region":"Arizona","files":["/var/www/straped/mufon/html2text/19389.html.txt","/var/www/straped/mufon/org/19389.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.081855,+-111.303815(19389)&iwloc=A&hl=en\"> mufon case (19389) map </A>","Object Flight Path":"Hovering then path","Tags":"City","Country":"United States","Longitude":"-111.303815","trends":["There has been one other sighting in Three Points","There were no other sightings in Three Points on or around September 18th 2009"],"divs":["Sighting DetailsI was driving from Tucson to Sells to drop off my girlfriend who lives in a tiny community south of Sells and I was just past the community of Three points and was driving towards the Border Patrol checkpoint that is permanently stationed there. Just above Kitt Peak which was to the left of me on the road my girlfriend commented that a light in the sky was a UFO that she had seen many times in the past. The light was brighter than a star, a planet, or an airplane light. We stopped and looked at it for a few minutes. She said that it typically has multiple lights, that the lights would strobe, that the object sometimes would move great distances in the sky almost instantaneously, and that she could make out that it was elliptically shaped sometimes. What I saw confirmed some of the phenomenon that she described. It started out as being one bright light, then became two, then three, then four, the lights were in a straight line configuration and then were in an isosceles triangular pattern. Then the lights were in a straight line again and began quickly strobing. Then the lights appeared to be rotating fairly quickly in the sky. The object moved like a precision machine. Then I saw the back of the object. It looked like it was leaving and the afterburners were briefly illuminating the back of the object. The back looked like it was trapezoidal in shape with the bottom of it being wider than the top. It had some detailing on the back that looked like a protruding metal feature on the back of it. It had a dull grey color and looked very solid. There were no wings on the object and it was completely silent. It definitely was not one of the surveillance blimps that are in the sky in this area at times and are used by the border patrol. It looked too mechanical and moved too fast to be a blimp. It was also very large. As big as a 747. After I saw the back of the object it disappeared. My girlfriend says that she sees it near her home on a frequent basis and it moves to different parts of the sky. It really freaked me out I can tell you that."],"Case Number":"19389","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09192009-0006","Date of the Event":"09/18/2009 09:30 UTC","Object Shape":"Square, Rectagular, Star-like, Triangle","Date Submitted":"09/19/2009 02:23 UTC","Object Features":"Appendage(s)","City":"Three Points","Latitude":"32.081855","Summary":"saw up to 4 lights moving, strobing and then rotating and then saw a solid trapezoidal object"}