{"Latitude":"43.634856","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19385.html.txt","/var/www/straped/mufon/org/19385.html"],"Country":"United States","Date of the Event":"08/10/2006 07:00 UTC","Longitude":"-73.189693","Summary":"Looked like a shooting star but was way too fast large and bright to be one.","Object Shape":"Bullet, Missile, Flash, Star-like","City":"Castleton","Date Submitted":"09/19/2009 12:23 UTC","Tags":"City","trends":["There have been 2 other sightings in Castleton","There were no other sightings in Castleton on or around August 10th 2006"],"Disposition":"IFO","Viewing Distance":"Over One Mile","Region":"Vermont","Sighting Duration":"Undisclosed","Log Number":"US-09192009-0002","divs":["Sighting DetailsI was sitting with my friend, talking and relaxing behind her house. We were sitting on a small hill in the grass. The slope we sat on had a clearing about 500 meters from where we were. The trees were fairly low so that did not hinder our view of this event. We both saw what looked like a very bright star at first, it then glowed 10 times brighter than it was at first and shot strait up in the air. It was hard to judge exact distance but I would say the trail it left in the sky had to be at least 4 feet ( If I was measuring right in front of me ) Again it's hard to judge exactly how long it really was but if I had to guess I would say it shot out a least a mile. I have been told that I saw a shooting star, but I have seen many shooting stars before and for one they usually go from side to side they are usually small and hardly visable - at least the ones I have seen. This object I saw went strait up and it was very large. It's hard for me to judge size with out seeing a re-creation of the event but it was much bigger than a star ( probably because it was a lot closer? ) . The really weird thing about this was the light trail it left in the sky and the speed of which the object shot up. The light it left stayed visable for at least two minutes afterwards. Also the rate of which this object moved was beyond me... I have NEVER seen anything like this before. I am just hoping that maybe someone around the same time ( I AM SORRY I FORGET THE EXACT DATE ) saw the same thing I did. The object never made any noise and I never felt like it could be a threat. Although I would love it if someone could explain this to me. I would have never taken this long to come out and say something but I just saw a TV show where MUFON was refered and they seem very legit, unlike some of these other groups that \"investigate\""],"Source":"MUFON","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=43.634856,+-73.189693(19385)&iwloc=A&hl=en\"> mufon case (19385) map </A>","Case Number":"19385","Object Features":"None"}