{"Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting Detailsi was inside the house at about 4pm the day i witnessed the object. my uncle was outside laying on a lawn ottoman or chair when i walked outside he said to me \"look up\" so i did, and there it was, a shiny chrome triangle just hovering there, and i was like \"what the heck is that\".i asked my uncle how long he had been looking at it he said for about 10 or 15 min. so i looked back up at it and its still hovering right there at about a mile up it seemed, but it was very clear that it was not man made. then i heard my mom coming into the kitchen, i looked down to tell my mom \"look at this thing\" as soon as i said that my uncle said \"whoop there it went\"(in spanish). he said \"it just took off\"(west).from a hovering position to just take off, that was just strange. i was 11yrs old and i know what i had seen. to this day i think i am very lucky to have witnessed this object. i now am 35yrs old living in utah for the last three years and i have seen some things out here.my daughter and i witnessed something strange together up in the skies of utah. thats another story i will let you in on next time. thanks for this opportunity to tell my(true)story."],"Object Flight Path":"Stationary,Hovering then path","Summary":"chrome triangle sitting very still.","files":["/var/www/straped/mufon/html2text/19382.html.txt","/var/www/straped/mufon/org/19382.html"],"trends":["There have been 4 other sightings in Spring Valley","There were no other sightings in Spring Valley on or around November 14th 1984"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.754014,+-116.990106(19382)&iwloc=A&hl=en\"> mufon case (19382) map </A>","Date Submitted":"09/18/2009 11:35 UTC","City":"Spring Valley","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-116.990106","Object Features":"None","Weather Factors":"None","Region":"California","Case Number":"19382","Disposition":"Unknown","Date of the Event":"11/14/1984 04:22 UTC","Latitude":"32.754014","Tags":"City","Object Shape":"Triangle","Log Number":"US-09182009-0016"}