{"Longitude":"-75.121534","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/19395.html.txt","/var/www/straped/mufon/org/19395.html"],"Date Submitted":"09/19/2009 03:06 UTC","Disposition":"Hoax","Region":"Pennsylvania","divs":["Sighting DetailsI went out of my house with 3 people, 4 including myself to smoke a cig around the time of 3 am. We went to this feild right by my house less then 50 feet away where we normally come to smoke our cigs. One of our friends pointed into the sky at this circle shapped object in the distance right above the tree line and it was flashing blue, red, and white. We all looked at it an agreed that it was a plane, but we then realized that this thing wasn't moving at all. We all looked at this thing for probably 10 mins. and during that time not any movement at all just staying still which we all thought was weird. Then when we all were gonna had back to my hosue this thing starts moving up and down at some pretty incrediable rates of speed. It went up and down and left to right. Once we saw this we all were stunned. I live right next to an airport and i have never seen anythng like this that could move the way this object was moving. As we all watched this thing got higher in the sky but now it was moving a little more slow. We watched for about an hour and went back into my house. Around 430 am when it was time for another cig we come out and see the same thing in the sky excepte this time much brighter and it had a small ball at the bottom of it blinking blue, red, and white. This thing was massive im talking big at least a football feild this thing just didnt move just stayed in the sky. At this point we called our friends which got up and looked out the window and saw the same thing about 6 or 7 miles down the road. I woke up my mom and see saw the object to and see said first thing to me that its not a plane. While we were watching this we could pick out the planes in the sky at the time. At least 3 planes were in the sky and those pilots had to of seen this in the sky it was impossable to miss brighter then the stars and head turning that simple head turning. We watched intil the sun started to come up and this thing moved up in the sky and disappared so quickly. What ever we saw was indefinitly not a plane or any plane i have ever seen, this thing i saw was unbelievable."],"Source":"MUFON","trends":["There have been 17 other sightings in Doylestown","There were no other sightings in Doylestown on or around September 19th 2009"],"Object Flight Path":"Stationary,Path with directional change,Other","Weather Factors":"None, Does Not Apply","Sighting Duration":"03:00:00","Summary":"huge object in the sky with flashing lights and speed","Object Features":"Unknown","Date of the Event":"09/19/2009 03:10 UTC","Object Shape":"Circle, Flash, Sphere, Star-like, Other","Latitude":"40.318016","Log Number":"US-09192009-0012","Viewing Distance":"Over One Mile","City":"Doylestown","Case Number":"19395","map":"<A HREF = \"http://maps.google.com/maps?q=40.318016,+-75.121534(19395)&iwloc=A&hl=en\"> mufon case (19395) map </A>"}