{"trends":["There have been 12 other sightings in Silver Spring","There were no other sightings in Silver Spring on or around November 25th 2006"],"Summary":"UFOs Retaliate Against Silver Spring, MD, Man for Polonium Alert","City":"Silver Spring","divs":["Sighting DetailsI was personally attacked by two \"UFOs\" in the very early morning hours of November 25, 2006, just a few days after I had sent an email to British authorities (London's University College Hospital, where Litvinenko was being treated and later died) on the afternoon of November 23, informing that Alexander Litvinenko was poisoned with polonium. The panicked polonium culprits decided to attempt retaliatory action while I was asleep: I was awoken by a disturbing sensation in my head, somewhat like abnormal pressurization being applied to the brain. When I opened my eyes in the dark room (it was still night), all my surroundings including the sky visible through the uncovered windows appeared neon yellow. I shut my eyes hard to shake off the illusion, but when I opened them again I saw the same effect. This moved me to mentally counteract the sensation, and the false-color vision gradually faded until I could see normally. At that moment I saw two blinking points of light that did not resemble aircraft beacons in both color (electric blue-white) and manner of flashing (LED-like). It was apparent that they were two separate bodies, but they were moving in slow and perfect unison, one trailing the other no more than a few hundred feet apart, and both blinking at identical but not simultaneous intervals. Radar archives will show that no civilian or other conventional aircraft were in that location and at that time (around 3am probably over Bethesda, MD, less than five miles from my location at perhaps 1 or 2 miles altitude), on that flight course (curving from southwest to west and then northwest)."],"Object Flight Path":"Hovering then path,Path with directional change","Latitude":"38.996226","Source":"MUFON","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Case Number":"19398","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Date of the Event":"11/25/2006 03:00 UTC","Weather Factors":"Unknown","Log Number":"US-09192009-0015","Disposition":"Insufficient Data","Date Submitted":"09/19/2009 04:45 UTC","Longitude":"-77.022708","files":["/var/www/straped/mufon/html2text/19398.html.txt","/var/www/straped/mufon/org/19398.html"],"Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=38.996226,+-77.022708(19398)&iwloc=A&hl=en\"> mufon case (19398) map </A>","Region":"Maryland"}