{"Case Number":"19393","Summary":"lights seen and then disappearing","Log Number":"US-09192009-0010","Weather Factors":"Unknown","Date of the Event":"09/18/2009 12:00 UTC","Latitude":"36.202959","Tags":"City","divs":["Sighting DetailsAround 11 pm (I didn't think to check the exact time) on Sept. 18th, 2009, I saw what at first appeared to be an airliner (we are in the McCarren fight path for planes that have taken off from McCarren airport going east bound), it had 5 rectangle white lights from left to right in a straight line with a white strobe flashing on the bottom center. What made me pay attention was there was no sound from the jets (at that time of night you can hear the jet engines for a very long time) and it wasn't moving away like a airliner, it was stationary. I watched the lights for like 30 to 45 seconds and then it just disappeared. I mean disappeared, poof, it was just gone. It wasn't like it went into a cloud, it just vanished, like faster than a blink of the eye and I didn't see it again. I had the strangest feeling that I saw something that I wasn't ment to see. The lights I saw were east of Las Vegas near Nellis Air Force Base, over what we call Sunrise Mountain (real name is Frenchman Mountain), kind of low in the sky, maybe a 45 degrees from the horizon. A plane at that degree would have been very high and far away and just a dot. This looked to be only about 10 miles away. I was just wondering if anyone else saw the same thing and reported this sighting? This isn't the first weird sighting I've seen, I've reported to Mufon before a few years ago. Of course Area 51 isn't that far away. Another weird light I saw was few months ago at night, I didn't record the date and time, sorry, I saw what looked to be a star but it was moving slowly in the sky. If you had just looked upward in the night sky you would have thought it was just another star, but I was gazing at the stars and saw it moving, then a very bright light came off of it for about 3 seconds, like it was taking a night time photo, then it went back to being a slow moving star then it disappeared. I watched this for about 30 seconds. This was moving from north to south, was in the eastern sky, around 60 degrees (guessing) from the horzon. Anyway, let me know if anyone else saw these latest lights too so that I know I'm not seeing things. Alan Brunson"],"Region":"Nevada","Object Shape":"Other","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=36.202959,+-115.110781(19393)&iwloc=A&hl=en\"> mufon case (19393) map </A>","trends":["There have been 18 other sightings in North Las Vegas","There were no other sightings in North Las Vegas on or around September 18th 2009"],"Disposition":"IFO","Date Submitted":"09/19/2009 02:24 UTC","files":["/var/www/straped/mufon/html2text/19393.html.txt","/var/www/straped/mufon/org/19393.html"],"Sighting Duration":"Undisclosed","Longitude":"-115.110781","Country":"United States","City":"North Las Vegas","Source":"MUFON","Object Features":"Unknown"}