{"Date Submitted":"09/19/2009 06:45 UTC","Sighting Duration":"Undisclosed","Case Number":"19390","Latitude":"37.123466","trends":["There have been 2 other sightings in Poquoson","There were no other sightings in Poquoson on or around September 19th 2009"],"files":["/var/www/straped/mufon/html2text/19390.html.txt","/var/www/straped/mufon/org/19390.html"],"Disposition":"Insufficient Data","Region":"Virginia","Weather Factors":"Unknown","City":"Poquoson","Object Shape":"Square, Rectagular, Star-like","Date of the Event":"09/19/2009 12:00 UTC","Longitude":"-76.340677","Tags":"City","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=37.123466,+-76.340677(19390)&iwloc=A&hl=en\"> mufon case (19390) map </A>","divs":["Sighting DetailsI experienced a local blackout at my apartments, which didn't seem to affect all apartments so I am unsure of at this time the extent of it but I am quite sure it affected at least four buildings (each one has 24 residences). As of this morning, Dominion Power did not list anything on it's real-time outage map. I may contact them to get more information on the outage. During this blackout I awakened a couple times in hopes that the power had come back on. Around 1am in the morning I woke up and walked around to check on things. I walked over to the bedroom window to look out the window blinds briefly and as soon as I did I spotted what looked like 4 or 5 bright lights *Star-like\" right next to one another or overlapping each other creating a rectangular-object effect. From my window, this object was sitting in the visible sky just above the roof of the apartment building right next to mine. It seemed like it was probably a good couple miles at the least in the distance. No more than a few seconds later this object just vanished in the spot it appeared to be hovering in as if covered by a quickly moving invisible cloud or if the lights came off quickly one after another. To me, it was not your typical aircraft in the distance light signature and I have never seen that type of signature before. I believe it is possible it could have been an aircraft with a particular light formation that I am not used to seeing, maybe even a few F-22's flying very close together or hovering together during an unknown night exercise from the nearby Langley AFB. We are near Newport News International Airport and do have maybe a medium-level of aircraft traffic in the sky. Not sure what to make of this one however. And afterwards, I couldn't help but feel like it knew I was watching it and disappeared so I at the very least could no longer see it."],"Source":"MUFON","Summary":"Bright rectangular star-like object hovering in sky during a local blackout","Object Features":"Unknown","Country":"United States","Log Number":"US-09192009-0007"}