{"Disposition":"Unresolved","Country":"United Kingdom","Region":"England","Viewing Distance":"Unknown","trends":["There have been no other sightings in Royal Tunbridge Wells","This sighting has never been favorited."],"Longitude":"0.263695","files":["/var/www/straped/mufon/html2text/19402.html.txt","/var/www/straped/mufon/org/19402.html"],"Object Flight Path":"Undisclosed","Object Shape":"Star-like","Log Number":"GB-09192009-0019","City":"Royal Tunbridge Wells","divs":["Sighting DetailsWhile walking to my front door from my car, i noticed a single red point of light moving across the sky. The object looked similar to how Jupiter looks on a clear night only much more red in colour. I at first thought it was a plane but as i watched it with my sister we quickly realised that it was not. I then thought maybe a satellite but having seen many of these before as an avid stargazer i decided i couldnt be. As we continued to watch the object slowly move across the sky, it gradually dimmed in brightness and vanished. We then waited to see if the bright light would return only to realise that 3 more red lights were moving across the sky in different directions! As we watched them move at the same slow speed as the previous one, these to gradually dimmed and vanished. I recalled while watching that i had read a story in the news a few months earlier, that a similer sighting had been recorded in which people were told that the phenomenon could be put down to paper lanterns. The lanterns had apparently been released close by from a party. The lights my sister and i observed were NOT paper lanterns! They were way to bright and moving much to quickly to be lanterns."],"Summary":"Four bright red star like objects moving across the sky.","Weather Factors":"Unknown","Date Submitted":"09/19/2009 07:21 UTC","Sighting Duration":"00:20:00","Tags":"City","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=51.132377,+0.263695(19402)&iwloc=A&hl=en\"> mufon case (19402) map </A>","Date of the Event":"09/19/2009 11:45 UTC","Case Number":"19402","Latitude":"51.132377"}