{"trends":["There have been no other sightings in Punxsutawney","This sighting has never been favorited."],"Summary":"we saw it hovering in the sky not making a sound . it was high enough to look the size of a softball","Source":"MUFON","Object Shape":"Sphere","divs":["Sighting Detailsthe first time we saw one of these chrome balls it was in 2006 about 4pm in Dubois Pa. It was being escourted by two fight jets one in front and one in back of it as they flew through the sky heading north. the second time was in august 2008 about 3 miles from my house. we were coming home from a day of 4 wheeling and as we came to the end of a dirt road , it was just sitting in the sky , plain as day looking like the chrome balls on the movie phantasim. no sound , no smoke. as we watched it , it seemed to just fade into the sky like a mirage. At first it was bold , vivid, very shiny looking and then it just started fading out till it was gone . the reason I am telling you now is because I watched the ufo's ove earth about the bucks county incidents and I realized I saw the same ball they described. It could be something military though I never saw anything like it but I KNOW the fighter jets the first one we saw . just thought you'd like to know . Sincerely Robin Dixon P.S. I am a great fan and a true believer we are not alone."],"Tags":"City","Latitude":"40.943675","Log Number":"US-09192009-0033","City":"Punxsutawney","Country":"United States","files":["/var/www/straped/mufon/html2text/19416.html.txt","/var/www/straped/mufon/org/19416.html"],"Weather Factors":"None","Object Flight Path":"Stationary,Straight-line path","Region":"Pennsylvania","map":"<A HREF = \"http://maps.google.com/maps?q=40.943675,+-78.970867(19416)&iwloc=A&hl=en\"> mufon case (19416) map </A>","Viewing Distance":"Unknown","Date Submitted":"09/19/2009 09:03 UTC","Longitude":"-78.970867","Object Features":"None","Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"07/31/2008 12:00 UTC","Case Number":"19416"}