{"City":"Elmira","Region":"Pennsylvania","Longitude":"-76.779817","Latitude":"42.136207","files":["/var/www/straped/mufon/html2text/19430.html.txt","/var/www/straped/mufon/org/19430.html"],"trends":["There have been no other sightings in Elmira","This sighting has never been favorited."],"Date Submitted":"09/19/2009 09:40 UTC","Weather Factors":"Unknown","Tags":"City","Country":"United States","Source":"MUFON","Date of the Event":"09/19/2009 07:30 UTC","Case Number":"19430","Summary":"Very large bright white light was shining and below it was a cone shaped fog which remained illuminated in the sky after the white light vanished.","divs":["Sighting DetailsVery large bright white light was shining and below it was a cone shaped fog which remained illuminated in the sky after the white light vanished. We saw the white light with the cone shape illumination under it for about 3 to 4 mins. the fog remained for another couple of mins then simply vanished. I've never seen anything like this before. It almost looked like a street light in the sky. I kept looking at the stars in the sky which seemed so dim next to this bright light which didn't move, just disappeared, leaving the fog illuminated. I've seen airplanes in the sky before, this was much, much larger with no blinking lights. My boyfriend and I were just getting into our hot tub, which is in our back yard. I started looking at the stars in the night sky. When I first looked at it, I could not figure out what it was. I've never seen anything like it. No motion. It just hung in the sky for a few mins and I noticed the illuminated fog under it. My boyfriend was trying to talk to me and I didn't answer so he looked up and saw this as well. We do not know what to make of it. Wish we had our camera."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.136207,+-76.779817(19430)&iwloc=A&hl=en\"> mufon case (19430) map </A>","Log Number":"US-09192009-0047","Viewing Distance":"Over One Mile","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Disposition":"IFO","Object Features":"Unknown"}