{"City":"Altoona","Date of the Event":"09/19/2009 07:45 UTC","Object Flight Path":"Stationary","Log Number":"US-09192009-0048","Summary":"Star-like object with flashlight-like beam","divs":["Sighting Details My two month old son was going to his grams for the night so I decided to sit on my front porch with him and wait for her. On my way out the door my three year old daughter asked where we were going and I explained we were just going to sit on the step and wait for their gram to pick up her brother for the night. She wanted to come with rather than stay inside with my mother. I proceded out the door with my son in my arms and my daughter following behind. She neglected to shut the door so I turned back and grabbed it. I then made my way to our single step to our porch and sat down. My daughter was still behind me as I fussed with my son's hoodie. As my daughter came up beside me to my right I happened to look directly up in the sky. Right above the tree in my next door neighbors yard was a star and to the left of the star was the object. The object looked like another star but it had a light coming down from it that reminded me of that of a flashlight. I looked at it for a moment in shock, blurted out a few choice words, and hurried up and back into the house to get my mother before it disappeared. My very confused daughter ran behind me. My mother was sitting on the couch eating a plate of spagetti as I yelled at her to hurry up and come outside to look at the object before it disappeared. We hurried back outside and the object was fading away. My mother is colorblind and can't see sligt differences in shades so she could not see the object's light. Within a matter of moments the object was completely gone. Strangely enough, at the same time a flock of geese could be heard freaking out but stopped when the object vanished. I believe that the commotion made my the geese was connected with the appearance and disappearance of the object. I remained outside with my son, daughter, and mother after the incident. I was still freaking out about the incident when my mother-in-law arrived. I'm not sure if she believed me. My mother-in-law shortly left with my son for the night and my daughter went back to the house with my father. My mother remained outside with me looking up at the night sky. The object did not return."],"Country":"United States","Object Shape":"Star-like, Other","Disposition":"IFO","Case Number":"19431","Longitude":"-78.389846","Source":"MUFON","Weather Factors":"None","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.526021,+-78.389846(19431)&iwloc=A&hl=en\"> mufon case (19431) map </A>","Sighting Duration":"00:02:00","Latitude":"40.526021","Tags":"City","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/19431.html.txt","/var/www/straped/mufon/org/19431.html"],"trends":["There have been 20 other sightings in Altoona","There were 2 other sightings in Altoona on or around September 19th 2009"],"Object Features":"None","Date Submitted":"09/19/2009 09:42 UTC"}