{"Weather Factors":"None","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date Submitted":"09/19/2009 09:53 UTC","Source":"MUFON","City":"North Kingstown","divs":["Sighting DetailsI was at the beach down the street of my house with my parents and my cousin we were going fishing and we were eating smores. i was sitting near the fire eating smores when we were admiring the stars all of a sudden we looked around and my cousin and i both said look at that it was a extreamly bright light facing toward the the right where we were sitting. so i yelled over to tell my mom across the street and she saw it too. then we noticed it got bigger and bigger i couldnt believe it. it was the biggest thing i had ever seen and it looked like a huge church bell shape. We were starring at it for about 30 secconds and then it startted to disolve in a way and about 2 minutes later it was totally gone. We were talking about for 20 minutes after that saying nobody will believe us then we called my nana and she couldnt believe it either. Then we were getting ready to go back home around 8 a truck drove by and stopped in the place where you park they were 3 fisherman and we were saying hello and being friendly then one of the 3 men said did you see that light about 30 minutes ago? we of course said yes knowing we werent the only ones who saw it we were happy. It ended up they were our neighbors and they saw it while they were fishing over the newport bridge and they came back because they noticed it was closer to our house they were happy we had saw it also. we were too but we know we not the only witnesses. that is my story on my UFO sightin."],"Region":"Rhode Island","Disposition":"IFO","Sighting Duration":"Undisclosed","Tags":"City","Case Number":"19439","Latitude":"41.586536","files":["/var/www/straped/mufon/html2text/19439.html.txt","/var/www/straped/mufon/org/19439.html"],"Longitude":"-71.447629","Object Features":"Dome","Summary":"A small bright light turned into a huge light that was bell shaped and then disapeared.","Country":"United States","Date of the Event":"09/19/2009 07:23 UTC","trends":["There have been 2 other sightings in North Kingstown","There was one other sighting in North Kingstown on or around September 19th 2009"],"Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=41.586536,+-71.447629(19439)&iwloc=A&hl=en\"> mufon case (19439) map </A>","Log Number":"US-09192009-0055"}