{"Latitude":"38.904722","Region":"Virginia","Viewing Distance":"Unknown","Longitude":"-77.26349","Tags":"City","Object Flight Path":"Stationary","divs":["Sighting DetailsAt approximately 7:50 pm eastern time on 19 September, I was sitting in my car in a parking lot in Vienna, Virginia. I looked out the driver side window, to the southeast toward Merrifield or Annandale, and noticed an unusual light source. At first, I thought it was a star or planet, then realized it was closer and larger, and most importantly, it appeared to be casting a triangular beam of light downward like a flashlight in the fog. I then thought it might be a helicopter, as Fairfax County police and military often fly in this area, but then realized that the light source was not moving. The source and it's beam remained for about thirty seconds, then the source shrunk (not faded, or moved off) until it was no longer visible. However the triangular \"beam\" remained for about thirty seconds to a minute until it diminished. I immediately phoned my wife and relayed the incident. When I returned home I searched the web for some place to report the sighting. I ended up at MUFON (a site and organization that I have had no knowledge of previously) and began reading reports that match mine exactly, at almost the exact same time, from Virginia to Maine. I am an aerospace engineer with alot of experience. I cannot explain what I and many others saw tonight."],"Date of the Event":"09/19/2009 07:50 UTC","trends":["There have been 5 other sightings in Vienna","There was one other sighting in Vienna on or around September 19th 2009"],"Log Number":"US-09192009-0059","Date Submitted":"09/19/2009 10:02 UTC","Object Shape":"Star-like, Triangle","Weather Factors":"None","City":"Vienna","Source":"MUFON","Country":"United States","Disposition":"Insufficient Data","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19443.html.txt","/var/www/straped/mufon/org/19443.html"],"Summary":"Light source casting downward triangle beam","Case Number":"19443","map":"<A HREF = \"http://maps.google.com/maps?q=38.904722,+-77.26349(19443)&iwloc=A&hl=en\"> mufon case (19443) map </A>"}