{"Summary":"Cone light pointing towards ground in the south sky looking towards Philadelphia","Case Number":"19447","Log Number":"US-09192009-0064","Latitude":"40.069704","divs":["sighting detailsabout 7:45 pm on saturday 9\\20\\2009 my wife and i noticed a cone shaped light in the southern sky 5 miles north of philadelphia looking south. we were at a church event and stepped outside for some fresh air. it started out as a small light that wasn't moving - almost like a star, though much lower than the night sky. very quickly the light grew into a large cone shaped light hovering in the sky. there was no sound at all. the object was much higher than a helicopter would be with it's spot light on. i could see airplane lights in the far distance to the east and those lights were much higher in altitude than this light. the cone light zigzagged left and right a few times then slowly diminished to nothing. there was no noticable movement from a starting point to an end point. the light completely faded and gave the sense of being blocked out by clouds but it was an absolutely clear night with no clouds at all for miles. again there was no noise whatsoever related to the light. it was unnatural and like no other aircraft we had ever seen. this sighting seems to match very closely with the sight mentioned in mufon case # 19335."],"Region":"Pennsylvania","Disposition":"IFO","Country":"United States","City":"Elkins Park","Date of the Event":"09/19/2009 07:45 UTC","Object Shape":"Cone","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:01:30","Tags":"City","Longitude":"-75.125349","map":"<A HREF = \"http://maps.google.com/maps?q=40.069704,+-75.125349(19447)&iwloc=A&hl=en\"> mufon case (19447) map </A>","trends":["There have been no other sightings in Elkins Park","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/19447.html.txt","/var/www/straped/mufon/org/19447.html"],"Weather Factors":"None","Object Flight Path":"Stationary","Object Features":"None","Source":"MUFON","Date Submitted":"09/19/2009 10:32 UTC"}