{"Region":"California","divs":["Sighting DetailsMy bird and I were getting some sun when she became fixated on something. Thinking it was a hawk I looked and she was starring at an extremely bright white light in the sky, just about 2 o'clock from straight up. My first thought was that it was a planet. But, it was much brighter and larger than I have seen. I asked my husband to get the binoculars to take a better look. In the 2-3 minutes it took him the light started to very slowly move away like it was going down south but not seeming to change how high-up it was. When we looked at it with the binoculars it was just a bright pure white light, no outline or other colors. If I had to give it a shape it would be round, like the light of a flashlight, but I could not call it a sphere. In the past we have seen metallic balloons, the bird hates them, and they move bouncy with the air and tend to flicker with the light reflection, so I am pretty sure it was not a balloon. We took turns looking with the binoculars and watched it for approx 10-15 minutes before it became to small to see. No matter what it was it was a unique experience."],"Object Features":"None","Source":"MUFON","Log Number":"US-09192009-0056","Date of the Event":"09/19/2009 04:20 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.855917,+-118.130076(19440)&iwloc=A&hl=en\"> mufon case (19440) map </A>","Tags":"City","Longitude":"-118.130076","Date Submitted":"09/19/2009 09:54 UTC","City":"Lakewood","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Object Shape":"Unknown","Country":"United States","trends":["There have been 5 other sightings in Lakewood","There were no other sightings in Lakewood on or around September 19th 2009"],"Case Number":"19440","Viewing Distance":"Unknown","Summary":"Bright white light","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19440.html.txt","/var/www/straped/mufon/org/19440.html"],"Latitude":"33.855917"}