{"Latitude":"40.083015","trends":["There have been 6 other sightings in Brick","There were no other sightings in Brick on or around September 19th 2009"],"divs":["sighting detailsthis light my wife and i both saw was incredible ! this was not man made no way the way this thing had a beam of light underneath it too! i wonder if i watched an abduction from afar because this inverted beam of white light underneath the teardrop looking super bright light was wide then it closed\\narrowed and as it did the aura around it all got wiredly brighter... this \"hover\" at about 1000 feet underneath and left of the the orion constellation (the first obvious grouping i could locate) the haze around it began to glow... it was a stark obvious difference than all the rest of the clear sky.. i was freaking out! i was asking my wife is she seeing it... i freaked out so much i didnt think to grab my camera and ill hate myself forever for that. but i plan to recreate what i saw ... when the narrowing inverted v \"closed\" the light rose a bit ( i have no idea what a bit is lol) just subtlely and then voom vanished ! the haze that was glowing began to decipate and fell closer to us and dissolved decending upon us about 300 feet toward us as it lost its \"glow\" ... it was unnatural i thought... beautiful fraky wild but beautiful! no noise and there was no aircraft in the entire clear sky !"],"Longitude":"-74.127616","Tags":"City","Case Number":"19449","Sighting Duration":"00:02:15","Disposition":"IFO","Object Shape":"Circle, Diamond, Star-like, Teardrop","Weather Factors":"None, Light","Object Features":"Unknown","Summary":"teardrop light hovers gets BRIGHTER rises and VANISHES","City":"Brick","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.083015,+-74.127616(19449)&iwloc=A&hl=en\"> mufon case (19449) map </A>","Country":"United States","Log Number":"US-09192009-0066","Date of the Event":"09/19/2009 08:05 UTC","Date Submitted":"09/19/2009 11:02 UTC","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/19449.html.txt","/var/www/straped/mufon/org/19449.html"],"Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Hovering then path"}