{"Region":"Virginia","City":"Chester","map":"<A HREF = \"http://maps.google.com/maps?q=37.356816,+-77.44165(19446)&iwloc=A&hl=en\"> mufon case (19446) map </A>","Object Flight Path":"Stationary,Hovering then path","Summary":"Big bright light shining down - disappeared almost instantly","Latitude":"37.356816","Tags":"City","Source":"MUFON","Longitude":"-77.44165","files":["/var/www/straped/mufon/html2text/19446.html.txt","/var/www/straped/mufon/org/19446.html"],"divs":["Sighting DetailsAt approximately 8:00 pm, my family and I were at our friend's house celebrating 3 birthdays and were standing on the back porch (uncovered) of their house while the children were playing in the yard. Six of us were chatting and I happened to look up and noticed a really big light hovering in the sky directly above the trees across the street. I asked (shouted) everyone what is that? It was a bright beam of light lasting about 10 seconds or so and had a light mist after it disappeared where the bright light was. Whatever it was had to have disappeared instantly going directly up. My husband mentioned a cone shaped beam of light. It basically looked like a giant floodlight. One of the ladies with us thought it was a helicopter at first and realized the light was much bigger and there was no noise whatsoever. We would have heard if it was a helicopter and it was too high for a helicopter. There were airplanes in the sky but very far off in the distance. We also could see stars in the distance, so it wasn't cloudy. It disappeared in front of our eyes going straight up. All of us were shocked by what we saw and knew it was nothing we could explain logically. We were all in agreement that it was a UFO. My husband was grabbing for his iPhone but it disappeared before he could get the camera function on. It would have been an unbelievable thing to get on camera!!!"],"Country":"United States","Log Number":"US-09192009-0062","Date of the Event":"09/19/2009 08:00 UTC","Sighting Duration":"00:00:15","Viewing Distance":"101-500 Feet, Unknown","Case Number":"19446","Object Shape":"Cone, Circle","Date Submitted":"09/19/2009 10:26 UTC","Disposition":"Unknown","Object Features":"Unknown","Weather Factors":"Unknown","trends":["There has been one other sighting in Chester","There were no other sightings in Chester on or around September 19th 2009"]}