{"Tags":"City","Object Shape":"Circle, Sphere, Star-like, Other","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19442.html.txt","/var/www/straped/mufon/org/19442.html"],"Object Flight Path":"Path then hovering","Region":"Michigan","Country":"United States","Longitude":"-85.25719","trends":["There have been 5 other sightings in Charlevoix","There were no other sightings in Charlevoix on or around September 19th 2009"],"Date of the Event":"09/19/2009 09:15 UTC","Sighting Duration":"Undisclosed","Log Number":"US-09192009-0058","divs":["Sighting DetailsI was driving home from a fishing trip on Ellsworth Lake. I came north on Marion Center RD in Marion twp. I turned East onto Ferry rd coming onto Loeb rd. I then again turned North to head out to M-66. As I got near M-66 I noticed these 5 very brightly colored lights in the shape of a backwards #7. I lost them for a minute or two behind the treeline. I turned south onto M-66 when I saw them again almost directly over the Highway. I began to notice other motorists pulled over and some were out of their cars watching this event. I looked up again and the lights moved into a v-like formation. And then back out into the previous formation. They didn't look very high up at all. I pulled over to see if maybe it was a group of helicopters or planes. I then got out of my truck and looked up in that direction again and they vanished. I stood there in utter disbelief and I watched the other people get back in their vehicles and leave. I came home told my wife what I saw and now I am contacting you. I have never seen anything like that ever. I just wanted to share my story. It happened just minutes ago and I am trying to get it all down the way I saw it. The time was 9;10 pm. It lasted about 7 minutes."],"City":"Charlevoix","Disposition":"Unknown","Source":"MUFON","Object Features":"Unknown","Case Number":"19442","Latitude":"45.323183","Date Submitted":"09/19/2009 09:58 UTC","Summary":"sighted 5 lights in abackward 7 shape changing into an almost v shape and fading out to nothing","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=45.323183,+-85.25719(19442)&iwloc=A&hl=en\"> mufon case (19442) map </A>"}