{"Weather Factors":"None","Object Flight Path":"Stationary","City":"Mahopac","Object Features":"None","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19450.html.txt","/var/www/straped/mufon/org/19450.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.379036,+-73.732065(19450)&iwloc=A&hl=en\"> mufon case (19450) map </A>","Viewing Distance":"Over One Mile","trends":["There have been 3 other sightings in Mahopac","There were no other sightings in Mahopac on or around September 19th 2009"],"Date Submitted":"09/19/2009 11:08 UTC","divs":["Sighting DetailsWhile sitting around a campfire on Cherry Hill Rd Mahopac, NY I noticed what appeared to be a small blue street light in the southwest sky behind the smoke of the fire. It projected a blue light in a cone shape as though from a recessed fixture. As I alerted the others in the group of the object I stood and walked toward the object. I could at first see the source of the light and the cone of blue brightness that protruded from that source toward us, however it was at a much higher altitude. The light and cone was visible but never close to the earth and never cast light upon us. Then the source of the light started to rotate away from us to the south and then all we could see was the conical shaped beam and not the source of the light. Another peculiarity to me was the shape of the cone of light. The night was so clear that I was surprised that we would see a cone of light if it was a spotlight and what perplexed me more was that it ended with definition instead of gradually fading out. It came from its source, protruded out a certain distance, then stopped and did not radiate further. We watched this for about a total of 45 seconds, 10 to 15 seconds seeing the source and cone and 30 to 35 seconds just seeing the conical shaped beam which eventually faded to black. The sky was completely clear and you could see the milky way. Jupiter was very bright to the southeast of the end of the milky way and 15 to 20 degrees to the left of the object we witnessed. The event was witnessed by myself, two attorneys, a court reporter, a plumbing contractor, and a general contractor as well. I am a State Trooper with over nineteen years experience and have seen many aerial spotlights. This was not that. We also live in a very active flyway for all New York City airports as well as the Westchester County Airport. This was no plane either. When the object's light rotated there was nothing but the blackness of the sky. No strobes or beacons of any sort. When the light faded to black there was nothing there at all. I watched against the stars behind where the object was last seen to possibly see it block some of the stars as it traversed but nothing was witnessed, it just disappeared."],"Disposition":"Unresolved","Tags":"City","Case Number":"19450","Object Shape":"Cone, Star-like","Region":"New York","Date of the Event":"09/19/2009 07:52 UTC","Summary":"Bright blue light cone shaped protruding","Longitude":"-73.732065","Log Number":"US-09192009-0066","Country":"United States","Latitude":"41.379036"}