{"Object Features":"Unknown","Summary":"Small triangle formation blinking","Object Shape":"Flash, Triangle","Case Number":"19455","Weather Factors":"Unknown","Disposition":"IFO","Region":"Pennsylvania","Source":"MUFON","Sighting Duration":"Undisclosed","trends":["There have been 6 other sightings in Stroudsburg","There were no other sightings in Stroudsburg on or around September 19th 2009"],"files":["/var/www/straped/mufon/html2text/19455.html.txt","/var/www/straped/mufon/org/19455.html"],"City":"Stroudsburg","divs":["Sighting DetailsI was walking out to my garage this evening when I witnessed three blinking lights in a triangle formation to the Northwest of my home. The lights were distant, however they were in the direction of Bangor Mtn and the Borough of Stroudsburg (approx 10 miles away). I called my wife outside who witnessed the lights as well. Our 16 yr old son joined us as well and attempted to vire the blinking objects with his telescope. In the over 10 years that we have lived in our home, we have never witnessed such an event. The blinking lights would become dull for a few minutes, then they would all begin to blink in tandem. Additionally, the triangle formation remained in one location while the stars moved as the Earth rotated. After viewing the lights for about an hour, we noticed that two additional blinking light were to both the right and left of the triangle in the distance. All the lights would blink together then become stationary. My wife is an Assistant Principal at a local High School, I am a retired police officer, and now a Federal Agent with the IRS. Our son is a honor student. We are not mentally unfit or challenged. Both my wife and I possess MS degrees, and my wife is nearly complete with her Ph.D. I am providing our backgrounds because I can't stress enough of what we witnessed. I would be happy to assist with any questions you may have. Additionally, there was a news report on the 10PM news of odd lights in the sky over the Lehigh Valley and Berks Co, areas of PA. This was seen on WFMZ TV Chan 69 in Allentown, PA. Thank you!"],"Log Number":"US-09192009-0071","Tags":"City","Date Submitted":"09/19/2009 11:29 UTC","Date of the Event":"09/19/2009 10:40 UTC","Latitude":"40.989131","Longitude":"-75.192595","map":"<A HREF = \"http://maps.google.com/maps?q=40.989131,+-75.192595(19455)&iwloc=A&hl=en\"> mufon case (19455) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Stationary","Country":"United States"}