{"files":["/var/www/straped/mufon/html2text/19458.html.txt","/var/www/straped/mufon/more/19458_submitter_file1__MUFONIMG_0293MadisonUFO.jpg","/var/www/straped/mufon/org/19458.html"],"Tags":"City","Source":"MUFON","Country":"United States","City":"Ennis","Date of the Event":"08/27/2009 03:30 UTC","Region":"Montana","trends":["There have been no other sightings in Ennis","This sighting has never been favorited."],"Log Number":"US-09192009-0074","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.348816,+-111.729697(19458)&iwloc=A&hl=en\"> mufon case (19458) map </A>","Latitude":"45.348816","divs":["Sighting DetailsMy husband and I were on a road trip for two weeks. When visiting in Montana, we stopped at a cute B&B called Old Kirby Place Fishing Lodge near Ennis, MT on the Madison River in Madison County. I'm a photographer and wanted to take some photos of an iron bridge near the B&B. We were there on August 27, 2009 and it was mid afternoon. We spoke to the inn keeper, and he let us walk around and take photos of the property. I took some photos of one of the lodges on the property. It wasn't until I was home and editing my photos that I noticed something in this photograph. To the right and above the rustic lodge is something that appears to be white and maybe metallic or gray on the bottom that is slanted at a 45 degree angle. It somewhat looks like saucer shape because the bottom metalic side is slightly longer than the white top part. It somewhat appears to be rectangular in shape too. Anyway, I can't figure out what it is, and thought I would send it to you guys to tell me what you think it is. I grew up near Seguin, Texas, and am familiar with MUFON, so you guys were the first organization I thought of contacting to help me identify this object. Could you please help me identify the object?"],"Case Number":"19458","Object Features":"None","Weather Factors":"None","Object Shape":"Square, Rectagular","Viewing Distance":"Unknown","Object Flight Path":"Unknown","Longitude":"-111.729697","Date Submitted":"09/19/2009 11:39 UTC","Disposition":"Insufficient Data","Summary":"I was editing photos when I arrived home from vacation, and noticed something in this photo that I can't explain."}