{"Log Number":"US-09192009-0075","City":"Newton","Summary":"Short Flash Downward From Light Source That Gave Appearance Of A Comet Tail","Source":"MUFON","Country":"United States","Tags":"City","Region":"New Jersey","divs":["Sighting DetailsI was outside with my wife and children enjoying a very clear evening just past dusk. The stars were mostly visible, but there was still a faint light from sunset left. Off to the South approx. 30-40 deg elevation appeared a bright light shining downward that was illuminating a cone directly underneath. The night was crystal clear without any clouds so it seemed very odd that the sky should \"glow\" under the light almost as if there was some powder released just before the light began. The light lasted about 20-30 sec before extinguishing. All the while it remained motionless and did not change position or direction. It was then extinguished, but left a very faint glimmer of a cloud in it's wake - a white area of the sky that was barley visible and seemed to keep dropping slowly earthward. The light appeared in the vicinity of skydiving activity (a local airport serves as its base of operations), but even though I recall seeing a jump plane drop off jumpers just around dusk, that was over 30 min prior. In fact it would have been too dark to skydive safely at the time the light was spotted and I remember looking very closely for any nearby airplane activity that might explain the light (I am a private pilot) and did not see anything nearby. Due to the position in the sky and the brief appearance, it was almsot impossible to judge distance. It could have been a 2000-3000' in the air, but at first glance looked to be much higher in the atmosphere. I have never seen anything that looked like this and could not think of any explaination for its occurence. Unfortunately I missed getting a photo shot by mere seconds."],"Object Flight Path":"Stationary","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19459.html.txt","/var/www/straped/mufon/org/19459.html"],"Date Submitted":"09/19/2009 11:41 UTC","Date of the Event":"09/19/2009 08:45 UTC","Viewing Distance":"Unknown","Latitude":"41.062343","map":"<A HREF = \"http://maps.google.com/maps?q=41.062343,+-74.747525(19459)&iwloc=A&hl=en\"> mufon case (19459) map </A>","Sighting Duration":"Undisclosed","Longitude":"-74.747525","Object Features":"Unknown","trends":["There have been 2 other sightings in Newton","There were no other sightings in Newton on or around September 19th 2009"],"Object Shape":"Cone, Flash","Case Number":"19459","Disposition":"IFO"}