{"Sighting Duration":"Undisclosed","Log Number":"US-09192009-0069","Weather Factors":"Unknown","Date of the Event":"09/18/2009 08:50 UTC","divs":["Sighting DetailsWe were driving down the highway and saw what looked like a meteor streak across the sky. It seemed to break of into pieces and fizz out It had an orange color much like fire. I just thought it was a meteor or firework, and shortly thereafter my wife saw another one in the distance. She was driving so I continued to watch the sky. As we approached Preston I noticed a flashing white light just off the road over a farmer's field. It wasn't very bright and had almost a box shape and would slowly flash on and off. It looked like it had square compartments which weren't as brightly lit. At first I thought it was just a radio tower or something similar. While staring at it I noticed that it was actually at the center of a huge black triangle. It seemed to be as if it was the size of a football field and dwarfed our van. It seemed to block out the stars and was a little bit darker than the sky. At each point was a light about the same size and brightness of a star and they were flashing. The color of these three lights were also the same of a star, that same white color. I couldn't make out any details on the triangle it just seemed to be a black mass and I couldn't gauge it's thickness or height, because it seemed like we were almost driving under it. It also seemed as if there were stars around it and they seemed to crackle flashing on and off like crazy all around it very quickly at random points. We kept diving because there was no shoulder to really pull over on and the car behind us was close to our bumper. We passed a radio tower and stopped at a gas station close to it. (There are only two gas stations in Preston). I hope more people saw what we saw. It was truely awe inspiring. It just hovered no movement or sound."],"Longitude":"-93.207695","Latitude":"37.940866","Source":"MUFON","Region":"Missouri","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"Preston","Disposition":"Hoax","Country":"United States","Date Submitted":"09/19/2009 11:14 UTC","trends":["There have been no other sightings in Preston","This sighting has never been favorited."],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/19453.html.txt","/var/www/straped/mufon/org/19453.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.940866,+-93.207695(19453)&iwloc=A&hl=en\"> mufon case (19453) map </A>","Case Number":"19453","Summary":"UFO in Preston, Missouri.","Object Shape":"Fireball, Square, Rectagular, Triangle","Tags":"City"}