{"Sighting Duration":"00:01:00","Object Flight Path":"Undisclosed","Longitude":"-77.034726","Date Submitted":"09/20/2009 01:53 UTC","Weather Factors":"Unknown","Date of the Event":"09/19/2009 07:55 UTC","City":"Washington","Latitude":"38.897622","Case Number":"19467","Summary":"Cone shaped object over eastern part of Maryland.","files":["/var/www/straped/mufon/html2text/19467.html.txt","/var/www/straped/mufon/org/19467.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.897622,+-77.034726(19467)&iwloc=A&hl=en\"> mufon case (19467) map </A>","divs":["Sighting DetailsI stood facing East or South East from a friend's yard looking over the clear horizen. About 7:55 PM i looked back as my friend was exiting his house, i then repostioned my eyes from once they were and saw a glow of a white triangle coming down from Venus. At that point, a neighbor who was sitting on his porch down the street got up in atsonishment from what i could tell, as he then went back inside and appearently told his family as they then came out with him to view the sky. The light lasted for about 30 seconds to a minute, the source looked like it Venus but i noticed a small source of light vanished below ,That point I knew it wasnt Venus ,the glow faded in another 10-20 seconds into the night time sky. From that point I just tried walking around to calm my excitment and gather my thoughts and just reply the event to find any faults or what it could've been. Later on, I looked up fellow reports such as these on MUFON and local news to discover that many reports matched my experience. Which surprised me that people from Virginia and the state New York also witnessed this. Which also prooved it wasn't just a cloud but either a UFO or an atmoshperic event. Anycase, it was very interesting."],"Object Shape":"Star-like","Log Number":"US-09202009-0007","trends":["There have been 20 other sightings in Washington","There were no other sightings in Washington on or around September 19th 2009"],"Tags":"City","Country":"United States","Source":"MUFON","Region":"Maryland","Object Features":"Undisclosed","Disposition":"IFO","Viewing Distance":"Unknown"}