{"City":"Altoona","Object Flight Path":"Hovering then path,Straight-line path","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Disposition":"IFO","Summary":"Large, round ball of white light that had what looked like a spot light shining down on the mountain.","divs":["Sighting DetailsMy family and I (including my mother) were sitting on our back deck enjoying a campfire and looking at the stars. It was somewhere right around 9 PM and my son said \"momma, look up at that light\". We looked up to see what looked almost like a helicopter search light only a lot bigger and it was coming from a large ball of white light. My husband is a private pilot and I know from flying with him for over 20 years, that was this was not a plane or helicopter. There were no emergency lights, nothing, and this was higher than a helicopter could fly and much bigger. It hovered for about a minute or so and then started to go straight up in the sky. It left behind a misty type light as it ascended but there wasn't a cloud in the sky! This object did not make any noise either, it was dead silent. I posted my story on Facebook to friends and have had several responses back that other people in several nearby towns saw what we did tonight. I would love to know if anyone else out there saw it or if there was a documented flight mission, etc over our area that could explain it. Never in my life have I seen anything like this. If anyone would like to contact me, they are free to do so. I am excited to hear stories of anyone who saw what i did tonight. Sincerely, Lisa Perry"],"Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=40.521231,+-78.387076(19466)&iwloc=A&hl=en\"> mufon case (19466) map </A>","Object Shape":"Other","Date of the Event":"09/19/2009 12:00 UTC","Date Submitted":"09/20/2009 01:44 UTC","Longitude":"-78.387076","Case Number":"19466","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19466.html.txt","/var/www/straped/mufon/org/19466.html"],"Region":"Pennsylvania","Tags":"City","Latitude":"40.521231","Weather Factors":"Unknown","Country":"United States","Log Number":"US-09202009-0006","trends":["There have been 20 other sightings in Altoona","There were 2 other sightings in Altoona on or around September 19th 2009"]}