{"Summary":"An orb of light emanating a fog appeared in the sky.","Object Flight Path":"Undisclosed","Tags":"City","Longitude":"-73.257542","divs":["Sighting DetailsSo around 8 o'clock tonight I was working with the children I nanny. We had gotten back from dinner, I put the rental movie in the DVD player and went out to my car to look for the book I brought to read. It was a crisp, clear September night in Fairfield, CT with not a cloud in the sky and a million stars. I looked all around the front and back seats and even checked in the trunk before I realized that I had left the book at home. As I was walking back to the house, about three feet in front of the door, I happened to look up and stopped in my tracks. About 150 feet above the treeline a bright circular orb of light hung in the air. It looked like a meteor but stopped in its tracks, really low to the ground and as bright as the moon would have been. What was really strange was that it seemed to be emanating a fog just around that area. That was what first caught my attention, not the light, but this patch of fog, connected to nothing, 400 feet in the air. Underneath the orb, the fog was catching the light so a cone (like from a flashlight beam) appeared underneath the orb. The orb started to descend until it cleared the patch of fog and was visible just by itself and then ascended up into the fog again. The fog was transparent enough that I could still plainly see it was an orb. It did this twice before finally pulling deeper into the mist so I couldn't make out any shape and it just backlit the mist. (The way the moon looks when you can't see it at all but you can see its light in the clouds around it.) I ran inside to tell the boys I nanny to come and look for maybe all of ten seconds, came out and it had vanished. Not only had it vanished but there wasn't ANY fog anywhere. The sky was perfectly clear and there was no trace of where it had been. It didn't make any sound. There were no colored lights. It moved very smoothly and specifically. The fog remained after the light seemed to start pulling away from it. The size of the planet Venus is the equivalent I'll use and it looked like five or six of those combined. Also, it was VERY bright. I didn't actually see it disappear as I went inside. It didn't look like a machine, a plane or any kind of craft. It looked like a big star that seemed to be moving vertically up and down. I was never afraid, just really curious and trying to figure out what on earth it was. I've never seen anything like it in my life!"],"Date Submitted":"09/20/2009 01:44 UTC","Date of the Event":"09/19/2009 07:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.144486,+-73.257542(19465)&iwloc=A&hl=en\"> mufon case (19465) map </A>","Object Features":"Undisclosed","trends":["There have been 7 other sightings in Fairfield","There were no other sightings in Fairfield on or around September 19th 2009"],"Object Shape":"Cone, Circle","files":["/var/www/straped/mufon/html2text/19465.html.txt","/var/www/straped/mufon/org/19465.html"],"City":"Fairfield","Weather Factors":"Unknown","Region":"Connecticut","Disposition":"IFO","Country":"United States","Sighting Duration":"Undisclosed","Source":"MUFON","Log Number":"US-09202009-0005","Viewing Distance":"Unknown","Case Number":"19465","Latitude":"41.144486"}