{"Latitude":"39.299465","files":["/var/www/straped/mufon/html2text/19476.html.txt","/var/www/straped/mufon/org/19476.html"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","Country":"United States","Object Flight Path":"Undisclosed","trends":["There have been 65 other sightings in Baltimore","There were no other sightings in Baltimore on or around September 19th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.299465,+-76.610439(19476)&iwloc=A&hl=en\"> mufon case (19476) map </A>","Object Shape":"Cone, Star-like","Case Number":"19476","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"00:00:27","City":"Baltimore","Disposition":"IFO","Log Number":"US-09202009-0016","Region":"Maryland","Longitude":"-76.610439","Summary":"White comet like cone lasts for only 30 seconds and disappears in a slow diming vanish.","divs":["sighting detailswhat first appeared to be the search light from a helicopter was actually more comet like on close inspection..though it seemed much closer. the cone shaped light seemed to shower down from a bright spot at the apex of the cone. i began to consider if it was a search light from a craft, falling space debris, a comet, or an alien portal. then the light blinked out and the cone of light started to very slowly vanish\\dissipate\\dissolve\\fade from the apex to the base which still had a very distinct outline though it was fading in intensity of light. when the light began to fade i thought it was a cloud obscuring the object\\light, but again closer inspection showed it was murky\\hazy from the city lights\\pollution, yet still clear of obscuring clouds...though i can't be 100% sure of that detail. i have read one report from the other side of the state that was exactlyish the same. that report cited other sightings of this event in virginia at about the same time last night. the position of the light was directly overhead in my experience, and they said that it was in western sky i believe. also i am pretty sure that it was 7:48 at the latest, and this sighting report from eastern maryland said 7:55pm. the apex of the triangle\\cone shape pointed to the west and the light did not seem to move at all. i am sure that i will not be the last to report this sighting."],"Source":"MUFON","Date of the Event":"09/19/2009 07:48 UTC","Date Submitted":"09/20/2009 10:02 UTC"}