{"Disposition":"IFO","Longitude":"-76.233268","Summary":"Central circular bright light casting a downward triangular foggy beam, then dissipating into its own fog for almost the next minute","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=41.054529,+-76.233268(19471)&iwloc=A&hl=en\"> mufon case (19471) map </A>","Date Submitted":"09/20/2009 08:32 UTC","files":["/var/www/straped/mufon/html2text/19471.html.txt","/var/www/straped/mufon/org/19471.html"],"Viewing Distance":"101-500 Feet","City":"Berwick","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Pennsylvania","Log Number":"US-09202009-0011","divs":["sighting detailsi was at a friend's house near hill road in shickshinny, pa. i was sitting in my car, which was on top of a hill facing south towards jonestown mountain, when a friend of mine noticed the object and asked us to look at it. i got out of my car at 7:52 pm et, so i didn't see how it first appeared. there was a central circular object, very bright and larger than a star, casting a triangular beam light directly down towards the ground. this circle\\light lasted in full strength, with no movement, sound, or flashing, for about 30 seconds. then the light seemed to shrink in its own fog (whereas the rest of the night sky was completely clear) until it completely disappeared. this disappearance occurred over the course of a minute. three of us saw this object and were stunned by its presence. none of us even thought to take a picture with our cell phones. we just watched to see what would happen next, and yelled to our friends to come see it, although they didn't hear us over their music."],"Date of the Event":"09/19/2009 07:52 UTC","trends":["There have been 2 other sightings in Berwick","There were no other sightings in Berwick on or around September 19th 2009"],"Tags":"City","Latitude":"41.054529","Object Features":"Undisclosed","Country":"United States","Object Shape":"Circle, Triangle","Case Number":"19471","Weather Factors":"Unknown"}