{"Viewing Distance":"Unknown","Country":"Canada","Object Flight Path":"Undisclosed","Log Number":"CA-09202009-0013","City":"Undisclosed","divs":["Sighting DetailsTo begin I have to say that never in my life would I have thought twice about reporting a UFO event. I've always thought the subject interesting but I never gave any of it much thought. That was before last night. My family and I were driving home from a dinner with my grandparents. It was dark with many stars in the sky. I was listening to my ipod when my brother said that there was something weird in the sky. This was at 8:50 pm (atlantic time, 7:50pm eastern). Everyone in my family including myself was transfixed on this light emanating from the sky. At first I thought it was a search helicopter or so but at a second glance i realized how far up it was and the light was too intense. There were no sounds that would have indicated it was a helicopter. The source of light began with the point in the sky and broaden as it descended to earth. It had a cone shape. Also unlike a helicopter this light did not move. It was completely still which gave the eerie sense that it was not of human creation. Then all of a sudden the light disappeared in a fog (remember that there was not a cloud in the sky). The whole time this event was occurring my heart was racing with excitement that maybe I had seen a UFO. The one thing I can say apart from the evidence is that my gut feeling the whole was telling me that it was a UFO. Many would call me crazy, but I'm sure of this."],"Summary":"Cone of light. disappeared in fog.","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Region":"Nova Scotia","Weather Factors":"Unknown","trends":[],"Longitude":"-63.739961","Object Shape":"Cone","map":"<A HREF = \"http://maps.google.com/maps?q=44.685527,+-63.739961(19473)&iwloc=A&hl=en\"> mufon case (19473) map </A>","files":["/var/www/straped/mufon/html2text/19473.html.txt","/var/www/straped/mufon/org/19473.html"],"Date of the Event":"09/19/2009 08:50 UTC","Date Submitted":"09/20/2009 09:13 UTC","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Latitude":"44.685527","Case Number":"19473"}