{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19481.html.txt","/var/www/straped/mufon/org/19481.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","trends":["There have been 5 other sightings in Walled Lake","There were no other sightings in Walled Lake on or around September 19th 2009"],"Date Submitted":"09/20/2009 11:56 UTC","Longitude":"-83.481048","Country":"United States","Object Features":"Undisclosed","divs":["Sighting Detailswe were driving down benstein a road in walled lake michigan it was about 9:00pm and we saw a formation of about 7 reddish orange lights hovering in the sky like if the big dipper just came down it was so noticable. we pulled down a astreet to see if qwe could see them better. we lost sight of them for a few minutes and there was a tree kind of blocking are sight. them I saw them again, they were strange orange lights,glowing and kind of teardrop shaped, they were not airplains or helicoptors. they were flying around and kind of staying in this one area. I decided to get back in the car and drive further down to get beyond the trees to get a better look. I lost sight of them for a few minutes and I thought they were gone. all of sudden one went strait up in the air, it looked like a ball of fire,it went straight up and them headed north, we jumped back in the car and followed it. we had it in sight for alittle while and then it just disappeared. I wondered if someone was sending something up in the air? but it was fire, it looked like fire, I dont know what ou could send up in the air that would look like that. it literally looked like it was burning, when we saw it up close. I was freaking out and my son was so scared he was crying, it was the strangest thing I have ever seen and I cant explain what we saw. I called the police dept to see if anyone else reported seeing anything. they said no one had. I watched the news and didnt see anything. I dont know how no one else saw them. the formation was as plain as day and I dont know how someone else driving down benstein behind me didnt see them."],"Region":"Michigan","Object Flight Path":"Undisclosed","Log Number":"US-09202009-0021","Tags":"City","Case Number":"19481","Object Shape":"Cone, Fireball, Teardrop","Latitude":"42.537811","City":"Walled Lake","Date of the Event":"09/19/2009 09:00 UTC","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.537811,+-83.481048(19481)&iwloc=A&hl=en\"> mufon case (19481) map </A>","Summary":"a formation of about 7 orange-red lights"}