{"Date of the Event":"09/19/2009 07:50 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19482.html.txt","/var/www/straped/mufon/more/19482_submitter_file2__Acadia-NightSkyWorkshop2-Ray.jpg","/var/www/straped/mufon/more/19482_submitter_file3__Acadia-NightSkyWorkshop3-Lindsay.jpg","/var/www/straped/mufon/org/19482.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.396282,+-68.193942(19482)&iwloc=A&hl=en\"> mufon case (19482) map </A>","Longitude":"-68.193942","Tags":"City","Object Flight Path":"Other","Weather Factors":"Unknown","Latitude":"44.396282","divs":["sighting detailsi was participating with friends in a nightsky photography workshop at acadia national park. there were 15 adults: 12 participants, 2 park service employees to drive van and assist, plus tyler nordgren,phd astronomer and artist, teaching the workshop. after an introduction and instructions, we all set up our cameras on the edge of eagle lake, most of us aiming southwest hoping to capture the milky way as the evening progressed. (the workshop was scheduled from 6:30-9:00pm et.) at approximately 7:50pm et, we all observed a bright object that appeared suddenly directly in front of us. it seemed to come down in the sky, burn brightly creating a cone of light shining towards the ground much like a streetlight and fog-like light around it. the \"streetlight\" did not make it the ground. after a few seconds, the object disappeared. the fog and \"streetlight\" slowly disappeared after about 45 seconds. it just seemed to fade from the cone shape to a smudge in the sky. at least 3 participants' cameras captured the event. (a series of 3 photos are attached, hopefully.) not knowing where else to share such an event, we are posting it here. a description of photography workshop can be found here: http:\\\\www.nightskyfestival.org\\festival\\home_.html"],"Country":"United States","Object Features":"Undisclosed","Summary":"During Acadia Nightsky Photography Workshop, an unidentified bright object appeared and then disappeared.","Log Number":"US-09202009-0022","Viewing Distance":"Unknown","trends":["There has been one other sighting in Bar Harbor","There were no other sightings in Bar Harbor on or around September 19th 2009","This sighting has never been favorited.",""],"Region":"Maine","Case Number":"19482","Disposition":"IFO","Sighting Duration":"Undisclosed","City":"Bar Harbor","Date Submitted":"09/20/2009 12:00 UTC","Object Shape":"Cone"}