{"Object Features":"Unknown","Weather Factors":"None","Disposition":"IFO","Log Number":"US-09202009-0023","Date Submitted":"09/20/2009 12:11 UTC","Summary":"Bright stationary light shining down from an undiciperable object in cone shape pattern that just faded from sight without movement.","Longitude":"-71.863739","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.472634,+-71.863739(19483)&iwloc=A&hl=en\"> mufon case (19483) map </A>","Latitude":"41.472634","Viewing Distance":"Unknown","Region":"Connecticut","files":["/var/www/straped/mufon/html2text/19483.html.txt","/var/www/straped/mufon/org/19483.html"],"Tags":"City","divs":["sighting detailsmy parents, my fiance and i were sitting around our firepit in our yard at approximately 8pm saturday, september 19, 2009. my mom was facing the southern sky and said quite calmly, \"what is that in the sky?\" we all looked directly into the southern sky, up high, not low or near the horizon, and saw a very bright light in a cone shaped pattern, narrow at the top and wide near the bottom, hard to say how big, but larger that what you would expect for an airplanes landing lights. which is of course what we thought it was at first, but it was very, very bright, then just slowly faded to nothing-gone. did not move at all, in any direction at any time. we never could see what was producing the light, there weren't any other lights with it, such as navigational red and green lights as on an airplane. the entire episode lasted probably about 1 to 2 minutes, from first noticeing it to it fading away. did anyone else see anything similar? i would love to know, there is much debate among the four of us, but we do agree, to us it is an \"unidentified flying\\hovering object\". sorry no photos! no one thought of it, nor did any of us have a camera anywhere nearby."],"Object Shape":"Cone, Unknown","trends":["There has been one other sighting in North Stonington","There were no other sightings in North Stonington on or around September 19th 2009"],"Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Stationary","City":"North Stonington","Case Number":"19483","Date of the Event":"09/19/2009 08:00 UTC"}