{"Longitude":"-80.224519","Tags":"City","Date of the Event":"10/22/2002 01:15 UTC","Summary":"Miami morphing object","Case Number":"1949","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Other","Log Number":"","City":"Miami","Sighting Duration":"00:30:00","files":["/var/www/straped/mufon/html2text/1949.html.txt","/var/www/straped/mufon/org/1949.html"],"Country":"United States","Latitude":"25.790429","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around October 22nd 2002","This sighting has never been favorited.",""],"Object Features":"Other","Source":"MUFON","Weather Factors":"Unknown","Object Shape":"Other","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=25.790429,+-80.224519(1949)&iwloc=A&hl=en\"> mufon case (1949) map </A>","Date Submitted":"10/22/2002 01:15 UTC","Region":"Florida","divs":["Sighting Details Narrative description(From audio tape of witness, \"Tony\" Moreno)\"I was in my backyard at approximately 1:15 P. M. in the afternoon. I wasgetting a sun tan and starting to do setup exercises in my backyard, I waslooking up towards the sky. Beautiful sunny day, to sunny, my eyes weresquinting, I couldnt see clearly. All the sudden I I see a sparkle up in thesky, way, way, up high. I mean really high. And as I looked, kept looking, Isaw it was like a stick, so I figured it was a satellite, or a space station orsomething way up above in space. As I kept looking at it I saw the it kind ofmoved or twisted or curved and that drew my attention to several other littleobjects that were around it, then I thought, hmmmm, maybe its a bunch of loosekites or something strange. And as I kept looking I noticed it was way to highto be kites and they were more or less stationary with clouds moving underneaththem and through them. So that made me freak out; I jumped into my house and I,for some stranger reason had a video camera with half the battery left in it,rushed outside, could not find the object with my plain eye, I looked in theviewfinder and I started finding it through the viewfinder of the camera. Andthats when I started noticing the details like all the other objects and laterI saw a triangle shape and I think some of the objects were jetting around,moving around, it seemed others were \"morphing\". I saw the candy cane-cane turninto a \"T\" into a \"J\", into a weirs \"S\"and I saw one of the objects underneathturn into a delta configuration by itself and um, I could not believe what I wasseeing; I lost it in a cloud. I put my camera away and thought \"Wow\". That wasincredible that will never happen again and about five minutes later I looked upand saw the same sparkle! So once again I got my camera; this time I rememberedto put the date and time program into the camera. I got a lot of referencepoints between my roof and other little birds that were flying around.\"\"To me, the most incredible thing was that although it was very high up in thesky it seemed to be over the flight path of incoming jets to Miami InternationalAirport, since I live there i see that all the time. Of course the jets aremuch, much lower. Sometimes they are up high, but believe me, not even half ashigh as well as what I saw. And I just thought it was pretty strange. This allhappened at about 1:30 PM on Tuesday, Oct. 22nd, 2002. My name is Tony Moreno.\"Investigators notes"]}