{"files":["/var/www/straped/mufon/html2text/19490.html.txt","/var/www/straped/mufon/org/19490.html"],"Tags":"City","City":"Brookville","Source":"MUFON","Object Features":"Undisclosed","Disposition":"IFO","Sighting Duration":"00:00:09","Latitude":"41.169145","divs":["Sighting DetailsI was on a private farm just outside of Brookeville, PA for a music concert, standing around waiting for the band to begin at 8:00 PM. I was facing the barn (where the music was about to begin), facing due West. My friend tapped me on the shoulder and said \"UFO, UFO, UFO!\" I turned around (facing due East) to see a very bright point of light, much brighter in magnitude than a star. From this point came a cone shapped beam of light that descended to the ground, much like a fan, but with extremely well defined, sharp edges. Once it filled the sky between what would be the ground and the origin, the area appeared to become even brighter, before retracting back to the point of light, leaving a smokey or cloudy sky in its wake. I remember thinking, \"It got cloudy\" because it had been a clear blue sky all day. As I looked closer at the area from which the beam had emerged, I noticed a shimmering section of the sky (like you would see on a hot day above a long road surface on the horizon), above the cloudy section, and this space began to slowly move from left to right. The entire episode lasted about 9 seconds, no time to even think about grabbinng a camera. It immediately became apparent that others had seen the same thing, so I began to talk to others, confirming my report above. There were at least 50 witnesses to this event. One final note is that as we stared at the sky just seconds after, we noticed a few private planes in in the sky in the general area, so these pilots could have seen the light and reported it to a control tower. It was really amazing to see."],"Date Submitted":"09/20/2009 01:19 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.169145,+-79.078662(19490)&iwloc=A&hl=en\"> mufon case (19490) map </A>","Region":"Pennsylvania","Country":"United States","Longitude":"-79.078662","Log Number":"US-09202009-0030","Date of the Event":"09/19/2009 07:52 UTC","Object Shape":"Cone","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Brookville","There was one other sighting in Brookville on or around September 19th 2009"],"Case Number":"19490","Summary":"Cone Shaped Beam of Light Descends From Sky"}