{"Country":"United States","Source":"MUFON","trends":["There have been no other sightings in Campton Hills","This sighting has never been favorited."],"Date of the Event":"12/31/1996 11:10 UTC","files":["/var/www/straped/mufon/html2text/19494.html.txt","/var/www/straped/mufon/org/19494.html"],"Latitude":"41.932557","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=41.932557,+-88.429298(19494)&iwloc=A&hl=en\"> mufon case (19494) map </A>","Case Number":"19494","Date Submitted":"09/20/2009 02:05 UTC","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Summary":"Hovering object @ >200' above surface w/ 3 lights in triangular formation","Object Shape":"Triangle","divs":["Sighting DetailsA Friend and I were traveling East bound on Rt 38, east of La fox Rd. We had just passed the Juvenile Detention Center. I should note that in this location there is a large field with no towers of any kind between Rt 38 and Campton Hills Rd. So, just in the course of driving I had looked to the left (north) and noticed 3 lights across the field, seemed to be above the subdivision of upper class homes. Now, there was no other traffic on the road at this moment, we were the only vehicle. So, I figured maybe it was a helicopter really low for some reason, we started to slow down and roll the windows down to see if we could hear it but there was no sound. In the course of traveling on the road, and moving slower now, the perspective of the object began to change, as to say that the lights appeard to be getting closer to one another. This is where it seemed odd because that would mean the object is hovering (not moving). Moving at about 20 mph now, the object did not move or change brightness or anything, there were no flashing aviation lights of any kind, the brightness could be compared to street lights from a mile away. Eventually the lights disappeared as we traveled like we passed the view of something that is facing in the opposite direction. During these moments we were inquisitive at first but as we realized that we were looking at an unknown object, and being the only vehicle on the road visible to what ever it was, we became a little on edge for as we did not what to be abductees. No joke, so I stomped on the gas and we continued traveling and never saw it again. We were both positive we saw something off the ground, it could not have been street lights or house lights, it was to high up. That area where we saw the object is heavily wooded and saw no other lights except for the objects."],"City":"Campton Hills","Object Features":"Unknown","Tags":"City","Log Number":"US-09202009-0033","Weather Factors":"None","Region":"Illinois","Disposition":"Unresolved","Longitude":"-88.429298"}