{"Viewing Distance":"Unknown","Case Number":"19499","Country":"United Kingdom","Object Shape":"Sphere, Other","Latitude":"54.983452","Longitude":"-1.6135","Summary":"noticed what i thought to be two balloons circling each other","City":"Newcastle Upon Tyne","Tags":"City","Date of the Event":"09/19/2009 01:19 UTC","Source":"MUFON","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"09/20/2009 03:29 UTC","trends":["There have been 13 other sightings in Newcastle Upon Tyne","There were no other sightings in Newcastle Upon Tyne on or around September 19th 2009","This sighting has never been favorited.",""],"Disposition":"Unresolved","divs":["Sighting Detailsi was standing chatting with a friend in newcastle city center (monument area) .we were looking at the que of about 500 people waiting to get books signed outside waterstones, when i noticed what i thought were two balloons blowing across the top of the buildings. but when i moved to get a better look i could see they were not balloons as they did not seem to be solid objects and the way they were moving could not have been achieved by the wind. they were circling each other moving apart and then toghether again and there was nothing between them to cause this. i tried for 10 seconds or so to get a picture but unusually my camera would just not focus properly on the objects. i have not had this problem before so i focused on the roof of a nearby building just to get some kind of shot, before they dissapeared behind the roof in the picture."],"Sighting Duration":"Undisclosed","Region":"England","files":["/var/www/straped/mufon/html2text/19499.html.txt","/var/www/straped/mufon/more/19499_submitter_file1__DSCF1670.JPG","/var/www/straped/mufon/more/19499_submitter_file2__DSCF1670E.jpg","/var/www/straped/mufon/org/19499.html"],"Log Number":"GB-09202009-0039","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=54.983452,+-1.6135(19499)&iwloc=A&hl=en\"> mufon case (19499) map </A>"}