{"Country":"United States","Source":"MUFON","City":"Missoula","Summary":"My son and I were photographing chemtrails when I saw an object in my view screen.","Object Flight Path":"Undisclosed","Log Number":"US-09202009-0047","files":["/var/www/straped/mufon/html2text/19507.html.txt","/var/www/straped/mufon/more/19507_submitter_file1__doos(3).jpg","/var/www/straped/mufon/org/19507.html"],"Object Shape":"Circle","Object Features":"Undisclosed","Weather Factors":"Unknown","Latitude":"46.873426","Region":"Montana","Date Submitted":"09/20/2009 06:59 UTC","trends":["There have been 5 other sightings in Missoula","There were no other sightings in Missoula on or around December 1st 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=46.873426,+-113.991498(19507)&iwloc=A&hl=en\"> mufon case (19507) map </A>","Disposition":"IFO","divs":["Sighting DetailsThe day had been very bad for chemtrail spraying. Many times the trails were accompanied by low flying helicopters that morning (not military) so my son and I had gone outside to take photos. This was around 7:45 or so and it was very light out. We have deep blue skies when the mountain winds blow in Missoula and it makes for a very clear photo, especially in the morning, even with the trails crisscrossing like they were. I first noticed the object because I was focused in on a large jet chemtrail that was in the process of being sprayed directly in front of us. On the camera screen I saw a shadow and took the photo, thinking it was just a part of the spreading chemtrail. When I pulled the camera down from the shot, I noticed something zoom off to my right really fast but only saw a deep blue blur at the edge of my vision. Whatever it was, it streaked off very fast and it left an impression in my vision like when you look at the sun or a light and look away-for a few moments you still see the light. That was what it was like. We went back into the house, uploaded the pictures we had taken of all the jet activity and were shocked at the photo I had of the object. Jon told me he had been looking up when I was shooting and had seen a large blue object come from the chemtrail and then shoot off towards the mountain. I didn't see anything myself except the round object as I was focusing and the blur and light afterwards. I didn't know what it was in my shots but we kept them. I've tried to deepen the color and lighten the colors to get a better look at the object but othetrwise, except for the color and crop, these are untouched. We've never mentioned it to anyone but I read a story by Roger Marsh at the Honolulu Examiner based on a sighting reported at MUFON case 19339 (according to his website) that shows an illustration very similar (I believe) to what we photographed back in December 2006. The photo has always bothered me and I think maybe someone else may have seen it now. Somehow, that makes me feel better. I have a couple more photos of whatever it was."],"Tags":"City","Viewing Distance":"Unknown","Longitude":"-113.991498","Date of the Event":"12/01/2006 07:45 UTC","Sighting Duration":"Undisclosed","Case Number":"19507"}