{"Weather Factors":"Unknown","Case Number":"19509","files":["/var/www/straped/mufon/html2text/19509.html.txt","/var/www/straped/mufon/org/19509.html"],"Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Latitude":"40.60979","Object Flight Path":"Straight-line path","Date Submitted":"09/20/2009 08:11 UTC","trends":["There have been 45 other sightings in Allentown","There were 2 other sightings in Allentown on or around September 19th 2009"],"divs":["Sighting DetailsI was walking down the street near my home in a south-south east direction. I was looking towards Jupiter and the sorounding stars when I noticed the stars looked distorted as though I was looking at them through water. I then noticed a triangular object. The object had 6 round \"lights\". 1 light at each angle and 1 light on each side. The lights were very dim. The color of the lights was a whitish orange. They seemed more like they were glowing or reflecting light from the ground. The object was moving very smoothly in a straight line. No sound. I could not tell the approximate altitude it was at. If the object was a low altitude, It was probable traveling at 20 - 30 MPH. I watched the object for about 10 seconds before it went behind a building. I ran back down the street in the opposite direction to get a look at the object on the other side of the building.I watched it as it moved away in a north east direction. I've been watching the skies for UFO's for about 45 years. I never seen anything like this. Even though I was always looking forward to seeing something like this, I found it a bit disturbing. During and after the sighting, I felt a bit shaken up."],"Region":"Pennsylvania","City":"Allentown","Log Number":"US-09202009-0049","Disposition":"IFO","Tags":"City","Summary":"Saw a triangular shaped UFO with 6 \"lights\"","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.60979,+-75.487153(19509)&iwloc=A&hl=en\"> mufon case (19509) map </A>","Longitude":"-75.487153","Date of the Event":"09/19/2009 08:30 UTC","Viewing Distance":"101-500 Feet","Country":"United States"}