{"Latitude":"38.042644","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19508.html.txt","/var/www/straped/mufon/org/19508.html"],"Disposition":"IFO","Object Shape":"Blimp, Square, Rectagular, Star-like, Other, Unknown","Summary":"Driving on the road I saw a black object hovering in the air.","Viewing Distance":"Unknown","Date Submitted":"09/20/2009 07:12 UTC","Tags":"City","Case Number":"19508","Weather Factors":"None","Longitude":"-84.496066","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","divs":["Sighting DetailsI was driving on new circle road going north and between exit 2 (harrodsburg rd.) and exit 5 (Versailles rd.) The time was roughly 6:32 give or take a few minutes. I spotted a black hovering object past the tree-line. I tried to look at it as much as I could, but that's pretty hard when you're driving and having to turn. I lost sight of it when I came to the tree line, but I managed to see it a few more times in gaps but was unable to get a very close look. I know it was definitely black, not that high in the air, had no lights on it (at least none that were on), and hovered very smoothly. I kept sight of it until I had to get off my exit 5B. I believe the object was hovering to the east of new circle. The object was, as far as I could tell, completely motionless. It was mostly a black blob at first, but it looked like it had parts coming out of it. I know it couldn't have been on a plane unless it was very big and very far away to give the illusion of hovering. It couldn't have been balloons because this object was not wavering or swaying as far as I could tell and definitely seemed like 1 solid object. The only thing I can think of it being would be a helicopter but for some reason I really don't think it was."],"Date of the Event":"09/20/2009 06:33 UTC","City":"Lexington","trends":["There have been 43 other sightings in Lexington","There were no other sightings in Lexington on or around September 20th 2009"],"Object Features":"Appendage(s)","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=38.042644,+-84.496066(19508)&iwloc=A&hl=en\"> mufon case (19508) map </A>","Country":"United States","Log Number":"US-09202009-0048"}