{"Tags":"City","Summary":"UFO followed by a military jet at low altitude","Viewing Distance":"501 Feet - 1 Mile","City":"Onaway","divs":["Sighting DetailsMy husband and I headed outside to close up the chicken pen as they were all in the coop for the night. I had to take a flashlight out with me as it would be dark inside the coop but it wasn't quite dark outside yet. I closed and locked the door and my husband was standing on the back porch and I looked up and seen a BRIGHT triangular shaped object followed by a large military jet. They seemed to only be at an altitude of 2000 ft and were traveling at a very low speed. So slow my husband commented on how are they staying up? We watched them travel directly from south to north and they were directly over top of us and we could see clearly a triangular shape with two lights on the \"underbelly\" and it also glowed very brightly white. It was followed by the jet approximately 100 ft behind. We could see both as plain as day. We live on top of a hill and had a clear view of it for several minutes, and at the last sight of it it turned and headed more in a north westerly direction. I hesiated about reporting this event until my mother was told by someone there was a jet reportedly following an \"ice ball\" ??? This was no ice ball, we could hear the jet plainly but no sound from the larger triangular shaped object in front of it. It was flying, no ice ball can do that! It was seen in northern lower Michigan."],"Log Number":"US-09202009-0043","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=45.357512,+-84.223903(19503)&iwloc=A&hl=en\"> mufon case (19503) map </A>","files":["/var/www/straped/mufon/html2text/19503.html.txt","/var/www/straped/mufon/org/19503.html"],"trends":["There have been 3 other sightings in Onaway","There were no other sightings in Onaway on or around September 15th 2009"],"Region":"Michigan","Weather Factors":"Unknown","Date of the Event":"09/15/2009 08:45 UTC","Country":"United States","Case Number":"19503","Latitude":"45.357512","Longitude":"-84.223903","Disposition":"Unknown","Date Submitted":"09/20/2009 04:35 UTC","Object Shape":"Triangle","Object Flight Path":"Path with directional change"}