{"Latitude":"36.013555","Disposition":"IFO","Source":"MUFON","Country":"United States","Date Submitted":"09/20/2009 04:13 UTC","Object Shape":"Sphere, Star-like","Viewing Distance":"Over One Mile","Tags":"City","divs":["Sighting DetailsWent outside at 6:30 this morning and saw a extremely large starlike object in the eastern sky over Santa Fe, it looked pretty far away. I went back in the house and got binoculars and continued looking, at about 6:40 I saw it blow up into a cloud of light, it started to take on a balloon shape, but then another star (light object) pulled away and seperated from it, alot smaller and stayed stationary in the sky, then a bunch of little lights shot out of the top of it and disappeared. The cloud slowly deflated and looked like a string of light hanging in the sky until it disappeared. The smaller ball of light that had pulled away and emergered stayed about 5 minutes longer getting fainter then disappeared. At one point while looking at it with binoculars it looked matallic. They all seemed to stay in the same place in the sky, nothing looked like it fell to the ground and it was completely silent."],"files":["/var/www/straped/mufon/html2text/19501.html.txt","/var/www/straped/mufon/org/19501.html"],"Longitude":"-106.057118","Case Number":"19501","Summary":"Went outside at 6:30 am and saw an extremely bright light that looked like a star, I got binoculars and contunued looking, at 6:40 it looked like it exploded into a cloud of light, another light emerged from it from the bottom","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.013555,+-106.057118(19501)&iwloc=A&hl=en\"> mufon case (19501) map </A>","Region":"New Mexico","City":"Espanola","Object Flight Path":"Stationary,Other","Date of the Event":"09/20/2009 06:30 UTC","trends":["There has been one other sighting in Espanola","There were no other sightings in Espanola on or around September 20th 2009"],"Object Features":"None","Weather Factors":"None, Does Not Apply","Log Number":"US-09202009-0041"}