{"Weather Factors":"None","Object Shape":"Circle, Sphere","Region":"Vermont","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.81268,+-73.14727(19515)&iwloc=A&hl=en\"> mufon case (19515) map </A>","Longitude":"-73.14727","Disposition":"IFO","Object Features":"Unknown","Latitude":"44.81268","trends":["There have been 7 other sightings in St Albans","There was one other sighting in St Albans on or around September 20th 2009"],"divs":["sighting detailsmy boyfriend and i went out on my front porch to smoke a cig, we don't smoke in our home. i was facing outward towards the main road that we live on here in sheldon, vt. i could only see so much of the sky because of the roof of my front porch. between the roof of my porch and the trees across the road from us i only had 3 ft of sky view. (that was from my perspective from my front porch) as we were standing there talking he was facing me and i was facing the road. all of a sudden i just saw this round glowing ball moving quickly then it disappeared beyond the treeline. i said look! 3 times and by the time he had turned around to see what i was seeing it had already disappeared. to me it looked as if it was falling. there was no tracers, no sounds, just the object. i thought at first that it was some sort of flare or it reminded me of fireworks being shot up in the sky before they actually explode in the air. the thing is, the object was traveling across rather than up and stayed a solid green\\blueish glowing color. i came in my house maybe 1 minute after and my clock said that it was 12:55 am. i immediately got on my laptop and e-mailed a person that i know who works for a paranormal investigating team based out of south burlington, vermont. he emailed me back and said that they were on the road coming back from a reported ufo sighting area and he could not believe that i had seen it from my home because him and his team had seen the samething in the sky from essex, vt. essex is about 30 miles from me. his team of investigaters were in separte cars, one car was ahead of him and one was behind him and they all had seen the samething. i am very interested in finding out how many people had actually seen this, or if anyone else reported this to you. it was a great experience i am very anxious to find out what i and others saw. thank you for your time, danielle benoit, sheldon, vt, 05483 this event occured at 12:50am on sept 20 2009 this form wont except my time. again thank you for your time. contact me with any questions you may have!"],"Date of the Event":"09/20/2009 11:50 UTC","Viewing Distance":"Unknown","City":"St Albans","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Log Number":"US-09202009-0055","files":["/var/www/straped/mufon/html2text/19515.html.txt","/var/www/straped/mufon/org/19515.html"],"Case Number":"19515","Source":"MUFON","Summary":"Veiwed it from my front porch it was a glowing green circle or sphere.","Country":"United States","Date Submitted":"09/20/2009 09:43 UTC"}