{"Disposition":"IFO","Region":"Pennsylvania","Sighting Duration":"Undisclosed","Date of the Event":"09/19/2009 12:00 UTC","Tags":"City","Date Submitted":"09/20/2009 09:55 UTC","Case Number":"19516","Object Shape":"Cone, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.564526,+-77.237208(19516)&iwloc=A&hl=en\"> mufon case (19516) map </A>","Log Number":"US-09202009-0056","Weather Factors":"Unknown","Source":"MUFON","Latitude":"40.564526","files":["/var/www/straped/mufon/html2text/19516.html.txt","/var/www/straped/mufon/org/19516.html"],"Longitude":"-77.237208","City":"Thompsontown","divs":["Sighting DetailsWe looked up in the sky, The sky was clear with no clouds, and noticed a sphere or circle that was and intense whit light, The light made a cone that fanned out below the sphere, sort of like a spotlight that radiated down towards the ground, but not into the trees. Within this fan of light there was dust that glowed. The sphere remained the same intensity the whole time. The entire event lasted 20-25 seconds. 1 I was outside my car in the driveway at the time. 2 The person I was with said you \"look up in the sky!\" 3. It was not an airplane or helichopter. It looked like a spot light looking for something. No sound whatsoever. 4. Pretty sure it was stationary, light pointing striaght down, but not to the ground. Also the light adjusted 1-2 times sort of like focusing. Within the spotlight was a dust that was sparkling and luminating dust. After thirty seonds or so it just diasappeared. But the dust was still lit up. 5.I have never seen anything as this before. I had my camera phone in my hand, thinking I should film this, but for some reason I juts stood and starred til it disappeared. 6. I just disappeared."],"trends":["There have been no other sightings in Thompsontown","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Object Flight Path":"Stationary","Country":"United States","Summary":"I looked up in the sky and we noticed a glowing sphere or white globe, It had a cone like light that fanned outword"}