{"Object Shape":"Cone, Fireball, Flash, Star-like","City":"Sea Isle City","Object Flight Path":"Straight-line path","Region":"New Jersey","Latitude":"39.153448","divs":["sighting detailsat approximately 8 pm on saturday 9\\19\\09, my wife and i were on the front deck of our house in sea isle city, nj when we both witnessed a bright white light in the southeast sky over the ocean approximatley 45 degrees off the horizon. the light appeared larger than any star visible in the clear sky, and was much larger than a light typically seen on an aircraft. at best, it might have been the size of a helicopter search light, but there was no sound to indicate that any such craft was in the vicinity. the light then reflected a cone-shaped aura, shining downward for approximately 10 seconds. a mist then developed first below, then surrounding the light source. the light then gradually dissipated (~5 seconds), disappearing while the mist remained visible for approximately 2 minutes. there were no clouds in the otherwise clear sky. we both questioned whether\\not we might have witnessed a ufo....not certain of what else it could have been....i later reasoned that it might have been a distress flair from a ship, but there were no such reports that we could find in that locale. we were surprised to find, however, a number of similar reports of sightings along the east coast and middle atlantic states around the same time."],"Sighting Duration":"Undisclosed","Disposition":"IFO","Log Number":"US-09202009-0057","files":["/var/www/straped/mufon/html2text/19517.html.txt","/var/www/straped/mufon/org/19517.html"],"Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","Case Number":"19517","trends":["There has been one other sighting in Sea Isle City","There were no other sightings in Sea Isle City on or around September 19th 2009"],"Summary":"Large bright white cone-shaped light shining downward over ocean south east of sea isle city","Date Submitted":"09/20/2009 10:05 UTC","Longitude":"-74.692939","Object Features":"None","Date of the Event":"09/19/2009 08:00 UTC","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.153448,+-74.692939(19517)&iwloc=A&hl=en\"> mufon case (19517) map </A>","Country":"United States"}