{"Latitude":"36.122136","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around September 20th 2009"],"Object Flight Path":"Path then hovering","Source":"MUFON","Viewing Distance":"Over One Mile","City":"Las Vegas","Object Features":"None","Date of the Event":"09/20/2009 08:22 UTC","Log Number":"US-09212009-0004","Region":"Nevada","Date Submitted":"09/21/2009 01:04 UTC","divs":["sighting detailsat 8:22 pm sept 20th was outside skywatching as usual. my boyfriend and i both saw this happen.i prayed for a week he would see something, his eyes are not as sharp as mine so i prayed for a bright light to show up for him. it appeared in the no. sky about 1\\4 way up from the so. skyline ,dimly lit, a orb trying to be a star, amber color, when it was half way across the sky it stopped and flared up very bright, (dime sz. if the moon is a silver dollar). a very white light, 10 times the size of the brightest star and just as brillant. it then moved a little further so. then disappeared. a few min. later at 8:28 reappeared overhead wavering as if to wave good-bye then dissapeared again. my feeling was it was a special sighting because i prayed for it and also it came right after flashing a flashlite in the sky while thinking these thoughts. i felt it was showing the love :) and a promise of a better future. well its a nice thought even tho it may not be the case. the timeing was perfect tho. my boyfriend was very happy as well and commented he was now a believer and had never seen anything like it. he has some pilot experience and stated it could no way have been any lind of regular aircraft.a small note here he had a bad headache before seeing this and after. also before the flareing orb i saw orbs at 5:40 am, 7:28pm, 8:12pm, and 1 other after the event at 8:35 which went no. then ne then no again avoiding a plane but keeping its semi-bright light where most of the time i see them disappear. i would love to hook up with others here in las vegas that are shareing their experiences, if any. one other note, i tried to take a picture with my phone camera but it didn`t come out good enough, still working on getting that night film!"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.122136,+-115.164206(19529)&iwloc=A&hl=en\"> mufon case (19529) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere, Star-like, Other","Country":"United States","files":["/var/www/straped/mufon/html2text/19529.html.txt","/var/www/straped/mufon/org/19529.html"],"Disposition":"Unresolved","Case Number":"19529","Tags":"City","Weather Factors":"None","Longitude":"-115.164206","Summary":"star like orb shines its light bright then dissapears, reappears overhead and disappears again."}