{"Object Shape":"Sphere","Country":"United States","Date of the Event":"09/04/2009 12:00 UTC","Summary":"Orange Ball in the sky near Traverse City, MI, Sept 4","Date Submitted":"09/20/2009 11:07 UTC","files":["/var/www/straped/mufon/html2text/19521.html.txt","/var/www/straped/mufon/org/19521.html"],"Region":"Michigan","Tags":"City","Log Number":"US-09202009-0061","Viewing Distance":"Unknown","Case Number":"19521","Disposition":"Insufficient Data","Latitude":"44.962223","Source":"MUFON","trends":["There have been no other sightings in Old Mission, MI","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=44.962223,+-85.485356(19521)&iwloc=A&hl=en\"> mufon case (19521) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsWe have a cottage on Grand Traverse Bay, at Old Mission, MI. Vacationing for Labor Day weekend, Friday night, we were at a beach bonfire with some other neighbors. At the beach were myself, my wife, three kids age ranges 9-11, two neighbors. I noticed a glowing orange ball of light basically floating in toward us at tree top level, moving slowly west to east. I pointed it out to the gathering, and it moved right past us, over the water, even lighting up the water below. We were all rather astounded as to what it could be. My son got frightened and ran into the cottage. At first I thought it was some kind of weird firework on a balloon, but the ball of light did not flicker or drop sparks as a firework would, did not zig or zag, just moved in a smooth directionally straight line, but was gradually gaining altitude. There was zero wind that night. It just kept on heading in the same direction, out over the lake toward Elk Rapids. It was a perfect sphere of orange light, fire color, made no sound, and very faintly above it appeared to be a dark red dome. Then suddenly the light simply disappeared out over the lake."],"City":"Old Mission, MI","Object Flight Path":"Undisclosed","Longitude":"-85.485356","Weather Factors":"Unknown"}