{"Log Number":"US-09212009-0007","divs":["Sighting DetailsI was listening to my iPod with headphones in, upstairs at my desk. I had the window open and then I heard and felt, even through the headphones, what I knew to be a jet (F-15) flyby at a fairly low altitude at 9:20 pm. I threw off my headphones and ran down stairs and grabbed my jacket and went out the front door. Standing in the driveway of my apartment building, facing west, I saw four big bright red lights in a row, horizontally. There was a small white light that was flashing on and off over to the side a bit. The craft was not traveling as fast as a F-15 would, but proceeded to fly at a moderate speed towards me. I watched it fly over head (90 degrees) and saw between seven to nine red lights in a triangular formation underneath this craft. I was confused by what I was seeing because I have never seen a craft that had that kind of light configuration before. As it went over me, I could hear the roar of an engine but not what an F-15 would sound like. I watched it travel in the ESE direction before I lost it in the trees. The sighting lasted about a minute and a half. I stayed outside for another 5 minutes, but saw nothing else unusual."],"files":["/var/www/straped/mufon/html2text/19532.html.txt","/var/www/straped/mufon/org/19532.html"],"Summary":"multiple red lights made a triangle under an object","Latitude":"45.528852","trends":["There have been 158 other sightings in Portland","There was one other sighting in Portland on or around September 17th 2009","This sighting has never been favorited.",""],"Region":"Oregon","Sighting Duration":"Undisclosed","Tags":"City","Date Submitted":"09/21/2009 01:40 UTC","City":"Portland","Longitude":"-122.674767","Weather Factors":"None","Object Shape":"Triangle","Disposition":"Unknown","Object Features":"Unknown","Source":"MUFON","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Case Number":"19532","Date of the Event":"09/17/2009 09:20 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.528852,+-122.674767(19532)&iwloc=A&hl=en\"> mufon case (19532) map </A>","Object Flight Path":"Straight-line path"}