{"Longitude":"-79.991466","Object Shape":"Circle, Disc","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"04:00:00","Region":"Pennsylvania","Country":"United States","Case Number":"19533","Log Number":"US-09212009-0008","Object Features":"Undisclosed","divs":["Sighting Details I received a text from my on and off again girlfriend. It must of been about 7 or 8p.m. when she texted me. She sent me a few texts that I didn't respond too, but the last one was far too enticing not to respond too. She wrote \"There's a space ship near my back yard.\" I thought this was a joke to get me to come over to see her but we did encounter a U.F.O. maybe 5 months before hand that was like a jet but it was vibrant yellow, moved so slow, and made no sound. That one looked identical to the old toy model of the Roswell U.FO. I decided I'd bring my laptop & webcam just in case. When I got there I asked her if it was one of the stars in the sky that I was pointing too. She said no and led me to her back porch. about 2 miles away just above the trees & above the mountainside there was a circular red light. It didn't even seem to move. So I hooked up my webcam and tried to adjust the visual. Unluckily it wouldn't capture anything more then around 100 yards away. My camera on my phone is broken & my girlfriend couldn't find her moms camera that she uses occasionally. We looked for her camera for about 10 minutes. Nothing. At that moment I was excruciatingly frustrated because I saw a U.F.O. that was maybe 100 feet above my back yard and now I'm seeing one in my girlfriends backyard and I couldn't capture it with anything. I opened the door and peeked out side again. Now it was below the tree line. I stared at it for a good minute and it didn't move at all. I was mad. I closed the door and decided to watch the movie \"Point Break\". About an hour later I looked outside again and it was still there but now there was a large amount of red light to the right of the craft and it was pitch-black outside. The light looked like it went all through out the trees but only in the area directly beside the craft. The crafts light around it seemed to intensify a little as well. Seeing the large amount of the light beside the craft made me shut the door. It was just too bizarre. I finished watching the movie then looked outside again. I thought it was gone. But my girlfriend said no look closely. I stared for maybe 10 seconds to get a good focus & now there where 2 lights that where extremely small and maybe 2 football fields apart. I was still extremely mad because I wanted to capture the object on some kind of film but I didn't. I left her house last night then I just asked her if it was still there a few hours ago. She said no, it's gone. I'm going to buy a camcorder that has decent focus as soon as I get a few dollars in case something like this ever happens again. So far in the past 2 years I've seen 2 real bizarre U.F.Os and 3 or 4 others that weren't as scary."],"Latitude":"40.448855","Tags":"City","trends":["There have been 122 other sightings in Pittsburgh","There were no other sightings in Pittsburgh on or around September 21st 2009","This sighting has never been favorited.",""],"Date of the Event":"09/21/2009 02:20 UTC","Summary":"Night time abnormal space craft behind girlfriends back yard.","files":["/var/www/straped/mufon/html2text/19533.html.txt","/var/www/straped/mufon/more/19533_submitter_file1__ChelseasHouseU.F.O.ya2.jpg","/var/www/straped/mufon/org/19533.html"],"Source":"MUFON","City":"Pittsburgh","Disposition":"Insufficient Data","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.448855,+-79.991466(19533)&iwloc=A&hl=en\"> mufon case (19533) map </A>","Date Submitted":"09/21/2009 03:50 UTC"}