{"map":"<A HREF = \"http://maps.google.com/maps?q=42.893847,+-78.876379(19537)&iwloc=A&hl=en\"> mufon case (19537) map </A>","Source":"MUFON","Region":"New York","Viewing Distance":"Unknown","Tags":"City","Sighting Duration":"00:00:30","Date Submitted":"09/21/2009 09:43 UTC","Summary":"Spherical light with cone shape glowing mist. Remained motionless. Light slowly vanished.","Country":"United States","Latitude":"42.893847","Disposition":"Unknown","Date of the Event":"09/19/2009 10:26 UTC","Longitude":"-78.876379","Object Features":"None","Case Number":"19537","Log Number":"US-09212009-0012","Object Shape":"Cone, Sphere","divs":["Sighting DetailsThere were three of us at a campfire outside the eastern edge of Buffalo NY. Surrounded by trees except for one spot where we could see a bright star in the sky. At about 10:26pm I looked into the sky and just to the right of the star I saw a round or spherical light that had a cone shaped glowing beam below it. I remember thinking it must be some kind of light shining through the clouds. I pointed and said \"What is that?\" to my friends, and they were already looking. The light made no movements at all, and no sound. We watched and it slowly went out, starting at the lowest part of the cone, also the largest part, almost like it was retracting back into the source. Then it went out, it looked to me like the clouds had simply moved into the veiw of the light to cover it. We still did not see any movment or hear any sound, and there were not any clouds. The whole time was only about thirty seconds, and looked to be very far away, and maybe a little to high in the air for a helicopter. The light that it shined was extremely bright but not blinding, and I don't understand how it could be motionless, with no sound, and still seem so bright. All three of us saw it, and could not stop watching. It was amazing"],"files":["/var/www/straped/mufon/html2text/19537.html.txt","/var/www/straped/mufon/org/19537.html"],"Weather Factors":"None","trends":["There have been 56 other sightings in Buffalo","There were no other sightings in Buffalo on or around September 19th 2009"],"Object Flight Path":"Stationary","City":"Buffalo"}