{"Object Flight Path":"Stationary","Log Number":"US-09212009-0024","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.478162,+-74.016266(19549)&iwloc=A&hl=en\"> mufon case (19549) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19549.html.txt","/var/www/straped/mufon/org/19549.html"],"Country":"United States","Tags":"City","Longitude":"-74.016266","Region":"New Jersey","Source":"MUFON","Summary":"3 sitings of Triangle UFO, lit up entire night sky then vanished","Weather Factors":"None","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"09/19/2009 11:30 UTC","Latitude":"40.478162","trends":["There have been no other sightings in Sandy Hook","This sighting has never been favorited."],"Case Number":"19549","Date Submitted":"09/21/2009 01:25 UTC","divs":["sighting detailstrianglular ship lit up over sandy hook, nj. the light that it emitted was so bright that it lit up the sea like daytime.the entire craft was lit in a triangular shape, emitted a cloud of smoke after it lit the ocean then disappeared. gone! this was 11:30pm saturday night. this is the 2nd siting in the same area within the past month. the first one that i saw was during the daytime and i sent in a photo of this to you in a prior report. (i have heard nothing back from this prior report). this triangular ship was seen by my neighbor that doesnt\\didnt believe in ufo's. he said the ship sent out a light that was so bright that it lit up the entire ocean. the craft emitted a cloud of smoke from underneith then disappered. i just spoke to a highlands police officer who called into headquarters to ask if there were any other reports. there were two other sitings of this craft reported. we live on the new jersey shore overlooking the water. earle ammunition base is not far from us withing a 5 mile radius. i know they have nuclear subs that pass under the bridge. two sitings of different shape crafts is unusual withing a months time. these were just the ones that we happened to notice. please contact me at your convenience. i would like to help research if you need my help. i sit at the beach at night on clear nights but have only seen satallites (stars moving very slowly across the night sky but in different directions). i can be reached at the 908 cell number. frank can be reached at the above 732 cell number. fondly, helaine camacho ps- i would be happy to resend the photos that i have of my daytime ufo siting. maybe you have the ability to zoom in better. i took the photo of the boat party on an island not noticing anything in the sky. when i cropped away the extra sea and sky the object appeared clear as day. this occured on aug 18th 2009."],"Object Shape":"Triangle","City":"Sandy Hook"}