{"Date of the Event":"09/19/2009 08:00 UTC","Latitude":"40.064574","Disposition":"IFO","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19548.html.txt","/var/www/straped/mufon/org/19548.html"],"City":"Undisclosed","Log Number":"US-09212009-0023","map":"<A HREF = \"http://maps.google.com/maps?q=40.064574,+-74.402641(19548)&iwloc=A&hl=en\"> mufon case (19548) map </A>","Object Features":"Unknown","Object Shape":"Boomerang, Sphere","Date Submitted":"09/21/2009 12:55 UTC","Tags":"City","Country":"United States","Weather Factors":"None, Does Not Apply","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","divs":["Sighting DetailsAt about 8pm on September the 19th, 2009, I was outside talking to my neighbor across the street. I noticed out of the corner of my eye, this brightness in the sky, bright enough to catch my attention. I looked at it directly and said to my neighbor....oh my, do you see what I see? She said \"Oh my god\"..... It was a VERY bright sphere looking object that was sitting there hovering in the sky. There was NO sound as far as we(people) could hear. This night was absolutely cloudless and dark except for the stars in the sky. It had a beam shining down from under it that looked like an upside down flashlight coming from it, but this light never touched the ground. Then...it formed this misty cloud around it. It then wobbled or spun so that it was brighter and a little less bright, this is how I knew it was wobbling. While this was happening, it almost seemed to take a shape, kind of boomeranging or bending from sphere to boomerang. After this and right after this....the light went away instantly as if it tore a hole in the sky and went in. The mist remained for about 10 seconds or so....then disappeared itself. I know what I saw....and I am certain that the government will cover it up with some story. Unlike other counties that tell the truth to there people, our government chooses to lie as if we are all children and can't handle the truth.......I would love to be contacted by professionals if I'm needed. This is incredible and does answer some questions for me but makes me want more.... John"],"Summary":"strong white bright light with cone shaped light shining down under it...not touching the ground.....","Case Number":"19548","Region":"New Jersey","Longitude":"-74.402641","trends":[]}