{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19561.html.txt","/var/www/straped/mufon/org/19561.html"],"Log Number":"US-09212009-0036","Region":"New York","Date Submitted":"09/21/2009 07:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.60427,+-73.655408(19561)&iwloc=A&hl=en\"> mufon case (19561) map </A>","Source":"MUFON","Tags":"City","divs":["Sighting Detailsthe first person to notice the object was my uncle as he was leaving my aunts house, which is located on the south shore of long island. the back yard faces west, the object was observed by myself and 7 other people moving slowly from west to west by northwest. on occasion the object moved towards the east. the object was in the sky for more than two hours. unfortunately no visible evidence was captured due to the fact the object was more than 10 miles away, at first it seemed to be parachute or a plastic bag, but once we found a pair of binoculars I and others saw that it was a flying object, hovering in place and moving on its own will. also noted was the fact that the object did not follow any type of pattern or destination. once seen through the lenses, I saw that the object was somewhat triangular in frame but with very soft edges giving it a round structure, the center of the object was open, with the exception of three columns going through it. on occasion i saw that the object \"wiggled\", the feelings at first were of course of skepticism and curiosity. admittedly i was annoyed that the only camera available didnt have enough zoom to capture the object, but once we found the binoculars the first reaction came from my aunt who shouted out \"es una nave\" meaning its a craft!, once i saw through the lenses i was immediately shocked at what i was looking because i couldnt explain it. there is no known device that ive read, seen, or heard about that closely resembles the structure of the fact that there was no evidence of propulsion even through it flew and hovered with ease. i tried to stay watch over the craft but unfortunately night fell and the object being dark in color faded into the back drop and although it did show a beacon of light twice from what I would assume to be the nose of the object it didnt shine again after that. this was an exciting and scary event, exciting because it is something i cant answer, and scary because its something I cant answer."],"Sighting Duration":"Undisclosed","City":"Island Park","Latitude":"40.60427","Object Features":"Other","Summary":"dark object round in shape, no lights, or propulsion visible.","Country":"United States","trends":["There has been one other sighting in Island Park","There were no other sightings in Island Park on or around September 20th 2009"],"Longitude":"-73.655408","Viewing Distance":"Over One Mile","Object Shape":"Circle, Oval","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"19561","Date of the Event":"09/20/2009 06:30 UTC"}