{"trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around September 21st 2009","This sighting has never been favorited.",""],"Date of the Event":"09/21/2009 05:00 UTC","files":["/var/www/straped/mufon/html2text/19565.html.txt","/var/www/straped/mufon/more/19565_submitter_file1__lightinsky.jpg","/var/www/straped/mufon/org/19565.html"],"Disposition":"Insufficient Data","Viewing Distance":"Unknown","Region":"New York","Object Shape":"Unknown","Summary":"blinking light in orion constellation","Case Number":"19565","Country":"United States","Tags":"City","Object Features":"Undisclosed","Date Submitted":"09/21/2009 09:14 UTC","Longitude":"-75.911984","Object Flight Path":"Undisclosed","City":"Binghamton","Latitude":"42.104887","Source":"MUFON","Sighting Duration":"00:20:00","map":"<A HREF = \"http://maps.google.com/maps?q=42.104887,+-75.911984(19565)&iwloc=A&hl=en\"> mufon case (19565) map </A>","Log Number":"US-09212009-0040","divs":["Sighting DetailsI was in my backyard setting up my telescope getting ready to view mars as it rose over the roof of my house. I noticed a flash and just wrote it off I thought it was just a meteorite or trick of my eyes as I hadn't been outside very long at that point. Then I noticed a flash in the same place, I stood very still watching the same region I thought I saw it and then I saw a flash of light, just a bright blink a lot like a plane strobe. I continued watching that region for another 5-10 minutes, it was blinking sometimes every 4 seconds or so, sometimes over 10 seconds between blinks. I know the difference between planes and satellites in the sky at night, I've been an amateur astronomer for nearly 20 years. this was neither of those. It was in the sky for at least 20 maybe 30 minutes, it appeared to be moving east into Orion constellation. The light was white colored, I was unable to view it directly through the telescope, but I could see it in my view finder. I could see no body that would have been emitting the light, no actual source, only the light itself, and it was very slow moving in an eastern direction. I had gotten my girlfriend outside to witness it with me. Before i she was outside with me i had seen what appeared to be a satellite, red colored and moved straight through the sky, it was also headed east. upon looking up satellites for these times im unable to find any that were moving through the sky in that direction at all that time. As my girlfriend was viewing this light through my telescopes view finder, she was startled by what she said was another light that had crossed through the view scope very close to the blinking light. I included a graphic using starry night program for visual aid."],"Weather Factors":"Unknown"}