{"Latitude":"37.334309","Date Submitted":"09/21/2009 08:36 UTC","trends":["There have been no other sightings in Castro Marim Municipality","This sighting has been favorited 1 time."],"Object Features":"Unknown","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Source":"MUFON","Case Number":"19563","Object Flight Path":"Stationary,Other","Log Number":"PT-09212009-0038","Tags":"City","Longitude":"-7.487735","Country":"Portugal","Summary":"10 meters diameter Pink Bright Revolving Orb at Ground Level 2 witness","Disposition":"Unresolved","City":"Castro Marim Municipality","Region":"Faro","divs":["sighting detailsin a hot summer night went for a remote area 5 km north of odeleite - algarve with my ex-girl and we parked the vehicle in a desert zone ( we get off road with the vehicle to the right corner of the mainroad and went 300 meters inside the trees after staying there chating for swhile and listen to some music we start feeling static in the radio but the zone is near spain and often occures interferences in frequency signals. we put on a tape and then we passed to the back seats. when we both were, you imagine..., naked and were starting we were surprised by a bright light that first was too intense (until eyes kepting use to ). we both jumped to the front seats thinking of someone that catch us or other car then immediatly we saw something ! the light couldn't be a car or something known - we were seeing a revolving (moving on is axle ) pink great orb light ( not a ufo altghought i may admit that a triangular red\\pink one rotating fast could do something like that ). the orb was behind and occuping 4 trees large and half middle high and seemed far from the ground. we could see ray's getting out of middle in the rotation. the estimated diameter could be far from 10 meters diameter, also the proximity to the vehicle. we didn't seen much more....we start the car immediatly and do a inversion and get out fast off there. i then returned thru the mainroad to odeleite and stopped the car about 1 km down in it. get off and tried to calm down ( also dress up ), taked out a cigar and tried to see at distance some kind of light, but nothing more have been seen. i think i really seen somekind of orb anomality, i probably believe of somesort of timelapse, because it seemed to us that ( without no more stops ) we taked to long to arriving to the next city..."],"Date of the Event":"08/25/1999 01:20 UTC","Object Shape":"Fireball","map":"<A HREF = \"http://maps.google.com/maps?q=37.334309,+-7.487735(19563)&iwloc=A&hl=en\"> mufon case (19563) map </A>","files":["/var/www/straped/mufon/html2text/19563.html.txt","/var/www/straped/mufon/org/19563.html"],"Sighting Duration":"00:00:20"}