{"Longitude":"-117.686908","City":"Lake Forest","trends":["There have been 7 other sightings in Lake Forest","There were no other sightings in Lake Forest on or around September 20th 2009","This sighting has never been favorited.",""],"Object Features":"None","Object Flight Path":"Stationary","Latitude":"33.652196","Log Number":"US-09212009-0039","Region":"California","Weather Factors":"Unknown","Date of the Event":"09/20/2009 11:30 UTC","Tags":"City","Object Shape":"Star-like","Sighting Duration":"01:00:00","Date Submitted":"09/21/2009 08:50 UTC","Case Number":"19564","map":"<A HREF = \"http://maps.google.com/maps?q=33.652196,+-117.686908(19564)&iwloc=A&hl=en\"> mufon case (19564) map </A>","Summary":"Looked like star but flashed more quickly and with different colors: red, blue, white, green, yellow and purple","Disposition":"IFO","Source":"MUFON","Viewing Distance":"Over One Mile","divs":["sighting detailswhile looking at the stars from my back patio last night, 9\\20\\09, at approximately 23:30 hours, i saw what appeared at first to be a star in the north east sky. what struck me as odd was it was flashing more quickly and more strongly than a typical star and that the flashing was in different colors. i was able to discern white, red and blue flashing with my naked eye. i called my wife to come see this object so that i could get a second opinion. she too agreed it didn't appear to be a typical star nor a plane or helicopter as it didn't move at all over several minutes. the object was stationary so i had her continue to watch it while i went to get our digital camera. i was able to take some pictures and some video of the object. i went out again a couple of times later, and the object was still there. the last time i checked was around 00:30 on 9\\21\\09 and the object was still there, maybe a little dimmer but still there. upon reviewing the video in slow motion the next day, my son showed to me that it was actually changing into more than three colors. since it was stationary for at least an hour and changed colors unlike a star, plane or helicopter, we feel it is most likely a ufo because it defied us being able to determine what it was. note: the object seemed to be completely stationary the whole time we observed it. in the video i am posting, the movement was all me as i didn't have the camera on a tripod."],"Country":"United States","files":["/var/www/straped/mufon/html2text/19564.html.txt","/var/www/straped/mufon/more/19564_submitter_file1__FourPics.png","/var/www/straped/mufon/org/19564.html"]}