{"map":"<A HREF = \"http://maps.google.com/maps?q=39.953565,+-75.162759(19568)&iwloc=A&hl=en\"> mufon case (19568) map </A>","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.953565","Summary":"bright cone shaped light appeared from the sky then dissapeared .","Country":"United States","Source":"MUFON","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/19568.html.txt","/var/www/straped/mufon/org/19568.html"],"City":"Philadelphia","Object Shape":"Cone","Object Flight Path":"Straight-line path","Sighting Duration":"00:04:00","Date Submitted":"09/21/2009 09:50 UTC","Log Number":"US-09212009-0043","Tags":"City","Longitude":"-75.162759","trends":["There have been 216 other sightings in Philadelphia","There were 2 other sightings in Philadelphia on or around September 19th 2009"],"divs":["Sighting DetailsI was at my community garden, with a fellow gardener We were at Benjamin Rush State Park , Philadelphia,Pa. It was about 8:30 pm. It was dark , and a very, clear stary night.Above what is a field for flying remote contol airplanes, in the sky about 300 yrds above our heads, was a cone shaped, bright light comming from the sky towards the earth. It was a white lite not intensely, bright, but very bright. I didnt have to squint , or it didnt blind me. The \"cone top\" was pointing towars the sky and the light got bigger and brighter as it came towards the earth. I did not see a ship of any kind. Although, we both saw a cloudish substance that the light was shining through. There were no clouds in the sky that night. The light came from the clouds or a fog as it looked like to us. I have a gut feeling that it was a cloaking or invisability type of camo that made us think we are seeing nothing or a cloud There was no noise associated with what we saw that night. I would like to know if Phila North East airport, wich is 5 min from this place noticed anything on radar at around 8:30 that night . It was not a plane, a helicopter, or lightning , or a meteor falling. It was a bright cone shaped light that came from the black sky towards the earth, did not quite reach the earth then faded away invisibly into the nighht. When I first saw it I said what the f is that, I wasnt scared as i was wondering to myself, what is that light? As it grew larger and brighter I thought , Oh my God, here we go Im going to see something crazy. Then it sarted to fade away , and I was freeking out , telling the guy I was with that was crazy.. I asked him what he saw and he told me exactlly what I saw, I wasnt crazy.. Im not sure if what I saw was a natural phenominom, or a ufo light comming down. But we did see it, and it was not a usual thing it was totally out of everyday life and the ordinary. I have seen hundreds of planes, satellites,heat lightning, shooting stars, etc, and this was none of them. This is what the both of us saw on sat night sept 19 2009 in ben rush state park in philadelphia pa .."],"Object Features":"None","Region":"Pennsylvania","Date of the Event":"09/19/2009 08:30 UTC","Weather Factors":"Unknown","Case Number":"19568"}