{"Region":"New York","Country":"United States","Date Submitted":"09/21/2009 09:19 UTC","trends":["There have been 14 other sightings in Poughkeepsie","There were no other sightings in Poughkeepsie on or around August 15th 1987"],"Longitude":"-73.9171","Object Shape":"Circle, Sphere","Source":"MUFON","divs":["Sighting DetailsWhen I was at my great uncle's lake house on Hillside Lake in Hopewell Junction, NY my great uncle Louie, great uncle Ed, and myself were sitting by the water. I was throwing rocks into the water nd noticed an intense bright light reflected from the surface. I thought it was the Sun, but noticed the sun being reflected in another part of the lake. My uncle Louie said, \"What is that bright light?\" I responded that I did not know. We turned and looked into the sky to find the object being reflected from the water's surface and saw the bright light had become a black sphere. We called my uncle Ed over to see the object. We witnessed the sphere moving slowly and silently from behind us (West) pass overhead, and continue East over the lake. My uncles told me to run up to the house for the binoculars they keeps by the door for bird watching. Still without sound the sphere continued flying. We all saw the object closely and clearly through the binoculars. A sphere with 3 lights flashing on the back end, no wings, no engine noise, no jets, no props. From the West 3-5 (my memory on the exact number is cloudy at this point) prop planes flew over our heads possibly from Dutchess County Airport and approached the object. The object was at least a mile away at this point. All of the airplanes flew out toward the object and turned back toward the airport in one pass each. The sphere and planes were at the same altitude, or so it appeared. From this inference I would assume the object was approximately the size of a single engine private prop plane and only a few hundred feet in the air. The object disappeared from view as it went over the trees and horizon. Uncle Louie and I thought that was had seen a strange flying object that appeared to have no means of staying aloft. Uncle Ed seemed shaken and did not want to discuss the object. I'm certain it was in late July or mid August of 1987. There were no news accounts that I have been able to find."],"Disposition":"Unresolved","Summary":"Sphere with 3 lights, 3 ground witnesses, 3-5 airplane witnesses.","Sighting Duration":"00:05:00","map":"<A HREF = \"http://maps.google.com/maps?q=41.703351,+-73.9171(19566)&iwloc=A&hl=en\"> mufon case (19566) map </A>","Object Features":"Other","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/19566.html.txt","/var/www/straped/mufon/org/19566.html"],"City":"Poughkeepsie","Weather Factors":"Does Not Apply","Date of the Event":"08/15/1987 03:00 UTC","Case Number":"19566","Tags":"City","Log Number":"US-09212009-0041","Latitude":"41.703351"}