{"Object Shape":"Star-like","Source":"MUFON","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.608709,+-75.436848(19573)&iwloc=A&hl=en\"> mufon case (19573) map </A>","Object Flight Path":"Stationary","Log Number":"US-09222009-0002","Case Number":"19573","Longitude":"-75.436848","Disposition":"IFO","Date Submitted":"09/22/2009 01:23 UTC","trends":["There have been 45 other sightings in Allentown","There were 2 other sightings in Allentown on or around September 19th 2009"],"divs":["Sighting DetailsI was camping out on my property that sits along the Allegheny River in N.W. Pennsylvania. Around dusk, approx. 7 pm, I noticed the 1st star in the East, southeast sky. It was just coming over the mountain top across the river. That mountain's elevation is approx. 1400 ft. It was very bright. I've seen this star many times before, but for some reason as it was only dusk, this star was bright white. I then thought of the wise men and the star that led them to Christ, then wondered if that star had meaning for me. I was cooking at the time and kept going to my fire and the picnic table and always checking the star. Then one trip I looked up and did a double take. I saw another 'star' next to the bright star, only this 'star' had a triangular beam coming down from it. I will refer to the 'star' as the object from here out. The object was 'headlight yellow' as compared to the white star. The triangular beam appeared to be made up of many rays. I thought possibly the atmosphere may have caused these to appear as rays. The height of both star and object was about 15-20 min. above the mountain top from when the star rose. The object and the star were closer to each other then they were to the mountain top. I could see both easily without moving my head to compare the two...just slight eyeball shifts. It was an awesome sight. I then thought to myself I have to go grab my camera and get a picture of this, turned but made a decision not to as I was afraid the object would disappear and I'd miss looking at it,so I turned back to watch the object. Just as I refocused on the object, it then disappeared, but the triangular light was still there and it then too disappeared in sections from top to bottom. All disappeared quickly, but it was noticable there was lapse of time from disappearence of object to the bottom beam of light. I wondered if light travel had anything to do with how far the object was from the bottom beam of light!? I thought of an airplane or helicopter casting light, but when the objects light went out, there was not plane or helicopter in sight. It was a beautiful sight. I felt priviledge to have witnessed it. I was never afraid or scared. Probably the distance away had much to do with not being afraid. Thanks for providing this outlet so I may share my experience."],"Object Features":"Unknown","Date of the Event":"09/19/2009 07:15 UTC","Weather Factors":"Unknown","Latitude":"40.608709","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/19573.html.txt","/var/www/straped/mufon/org/19573.html"],"Sighting Duration":"Undisclosed","Region":"Pennsylvania","Summary":"Object appeared as a star but cast a triangular beam to the ground.","City":"Allentown"}