{"trends":["There have been 129 other sightings in Albuquerque","There were 3 other sightings in Albuquerque on or around September 19th 2009","This sighting has never been favorited.",""],"Latitude":"35.086791","Longitude":"-106.644257","Object Flight Path":"Stationary","divs":["Sighting DetailsSaturday, September 19th, 2009, I was taking my daily walk around the neighborhood. It was about 6:00 p.m. and the sun was almost setting. I often look up into the sky when I walk, and as I turned a corner and faced in a northeast direction, I saw a bright white, highly reflective teardrop shaped object stationary in the sky about 40-45 degrees above the horizon. I couldn't say how high it was, but a plane coming in for a landing at the ABQ Sunport was lower than the object. I was already returning home, and did not have a camera with me, so I hurried, thinking I could get home and with my camera, zoom in closer and get a better look at what it was. It never bobbled, but remained perfectly in place the whole time I observed it. I got home and told my husband to take a look. He got the binoculars out and I got my camera and we went out in the backyard. He said it was teardrop shaped, and could possibly be a weather balloon, but neither of us saw any tethers, ropes,or payload boxes underneath such as weather balloons usually carry. It did not drift with the wind, or bobble, or otherwise move at any time during the approximately hour and a half of observing it. I did take some pictures with my camera, but strangely enough, could not make the camera focus on it. It hardly even showed up at all with a regular daylight setting on the camera. However, with a night time setting on the camera I managed to get some pictures, even though they don't do justice to what I could see with the naked eye. My husband and I have seen weather balloons before, since they are seen in this area sometimes, and this was significantly different because of its brightness or high reflectiveness, as well as because it did not move at all for the hour and a half or so that we observed it. There were some clouds that drifted by, obviously moved by some wind, but the object did not drift or move in any way. After I attempted the pictures of it, we went in the house. We looked again about a half hour later (around 7:30 p.m. by then) and it was gone."],"City":"Albuquerque","Case Number":"19572","Disposition":"IFO","Summary":"Bright white, highly relfective teardrop shaped","Weather Factors":"Windy, Light","Tags":"City","files":["/var/www/straped/mufon/html2text/19572.html.txt","/var/www/straped/mufon/more/19572_submitter_file1__2009-09-19UFOORWEATHERBALLOON006.JPG","/var/www/straped/mufon/more/19572_submitter_file2__2009-09-19UFOORWEATHERBALLOON013.JPG","/var/www/straped/mufon/more/19572_submitter_file3__2009-09-19UFOORWEATHERBALLOON011.JPG","/var/www/straped/mufon/org/19572.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=35.086791,+-106.644257(19572)&iwloc=A&hl=en\"> mufon case (19572) map </A>","Date of the Event":"09/19/2009 06:30 UTC","Source":"MUFON","Log Number":"US-09222009-0001","Country":"United States","Viewing Distance":"Unknown","Object Features":"None","Region":"New Mexico","Date Submitted":"09/22/2009 12:50 UTC","Object Shape":"Teardrop"}