{"Object Flight Path":"Stationary","Object Features":"Patterned Surface","Date Submitted":"09/22/2009 06:56 UTC","Region":"Istanbul","Country":"Turkey","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unresolved","Date of the Event":"09/20/2009 06:30 UTC","Case Number":"19587","divs":["Sighting DetailsHello Friend; I was on vacation in Istanbul,Turkey for a month. Was taking a pic. of the sunset over the skies of Istanbul with my brother,from our balcony at 18:30 hours. the pic.(one)that was taken,at first glance seemed to show the targeted sight and the moon. After a closer look,my husband told me it was not the moon,and thought it was not of this earth. The shape was a perfect sphere,with what we could see with our cave age eye's were two or three belts going around the bottom of it. When the pic. was taken,it was floating at an angle it seemed(compared to the structures in the pic.). It also had kind of a round door hatch on the very bottom of the craft. The outside of the sphere had a very bright,white colored,lace like surface,and as mentioned before,the belts going completely around its' round shape. The belts seemed to represent windows or different levels or floors of the craft. My husband told me,that if we took and set a tripod with a camera out in the balcony and waited for the special shots,we still could not get what we have here. I know this for a fact,....that this craft (as large as it is),was not in my viewing screen of my camera,when I was taking the pic. of the sunset. My husband said,that these crafts are very hard to take pics. of,he thought and to have one frozen in time and space,in a pic.,is almost like a miracle,for our generation of: Non believers and Believers alike. I would appreciate your feedback on this letter of mine; and if there are possibly a few photo's taken,of the same craft as I described in my letter,(Re: the sphere seen in Istanbul,Turkey). Taken anywhere else,I would pls. like to have them confirm the incident,time and place. Thx. S.K. (9.22.09) -COPY-"],"Tags":"City","Log Number":"TR-09222009-0016","City":"Istanbul","Latitude":"41.01385","map":"<A HREF = \"http://maps.google.com/maps?q=41.01385,+28.98085(19587)&iwloc=A&hl=en\"> mufon case (19587) map </A>","files":["/var/www/straped/mufon/html2text/19587.html.txt","/var/www/straped/mufon/org/19587.html"],"trends":["There have been 4 other sightings in Istanbul","There were no other sightings in Istanbul on or around September 20th 2009"],"Sighting Duration":"Undisclosed","Weather Factors":"Rain, Medium","Object Shape":"Circle, Saturn-like, Sphere","Summary":"A big sphere;looked like the moon or a planet,at first glance.","Longitude":"28.98085","Source":"MUFON"}