{"City":"Longmont","Tags":"City","divs":["Sighting DetailsWas sitting in my living room on my couch with the lights all out and had just turned off the tv. I sat there for at least one minute after turning the tv off and saw what appeared to be a very bright light, circle first through the lower windows of my living room and then the upper level windows. I have a high rise vaulted ceiling. I am usually a night owl and I go outside from time to time for a short bit. My first thought was that was really strange especially because I do stay up and had not seen anything like that in this house (lived here almost 4 years). I looked out through the blinds and did not see any vehicles (I did do this immediately after seeing the light) and looked for people who may had been on the sidewalk or for any sign of anything to explain the light. I kind of shrugged my shoulders and thought it was strange and was a spooked but I just couldn't explain it so I sat back down for a moment to gather my thoughts and things that I wanted to bring up to my bedroom. I probably sat there about 3 to 5 more minutes when it happened again and this time it was brighter and circled through the room at least twice, going from all the lower level windows to the upper level back to the lower and then again to the upper. I didn't wait to see what else was to happen and that is when I ran up my stairs to my bedroom. I arrived to the bed panting out of breath and scared. My husband had already gone to sleep so he had no clue as to what had gone on and why I came in the bedroom so frightened. I can guarantee I had not fallen asleep yet and as I've said I tend to stay up late so to see those bright lights was indeed unusual. I can't say for sure that it was a UFO but I did not see anything to explain it and the motion of the lights that circled my living room certainly seem unexplainable. I am very skeptical of the paranormal but I guess when an event can't be explained it's time to admit that it can't be explained."],"Object Features":"Unknown","Date Submitted":"09/23/2009 04:51 UTC","Summary":"Bright spot light into windows of home","Log Number":"US-09232009-0006","map":"<A HREF = \"http://maps.google.com/maps?q=40.173527,+-105.099538(19597)&iwloc=A&hl=en\"> mufon case (19597) map </A>","Sighting Duration":"Undisclosed","Date of the Event":"09/23/2009 01:47 UTC","Disposition":"Unresolved","Viewing Distance":"Unknown","Weather Factors":"None","Object Shape":"Other","Latitude":"40.173527","files":["/var/www/straped/mufon/html2text/19597.html.txt","/var/www/straped/mufon/org/19597.html"],"Case Number":"19597","Longitude":"-105.099538","Country":"United States","Object Flight Path":"Unknown","Region":"Colorado","Source":"MUFON","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around September 23rd 2009"]}