{"Date of the Event":"09/21/2009 08:40 UTC","Country":"United States","Log Number":"US-09232009-0002","Summary":"3 separate orang balls of light within a 30 minute time frame","Case Number":"19593","Object Features":"None","trends":["There has been one other sighting in Mulberry","There were no other sightings in Mulberry on or around September 21st 2009"],"Longitude":"-86.663152","Source":"MUFON","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19593.html.txt","/var/www/straped/mufon/org/19593.html"],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.35272,+-86.663152(19593)&iwloc=A&hl=en\"> mufon case (19593) map </A>","Viewing Distance":"Unknown","Tags":"City","City":"Mulberry","Object Shape":"Fireball","Object Flight Path":"Stationary,Hovering then path","Region":"Indiana","Latitude":"40.35272","divs":["sighting detailson 9\\21\\2009 at approximately 8:40 pm i was driving on south county road 1000 east near mulberry, indiana and i noticed an orange light, about the size of a pencil eraser, in the northern sky. i was driving on a bend in the road at the moment and there were trees to my right so i left sight of it for about 5 seconds. after i made it through the bend and past the trees the light was still there but quickly faded. i continued to drive on 1000 e for a few minutes and then stopped and stepped out of my car for approximately 10 minutes to make a phone call. after i was done talking on the phone, approximately 8:52 pm, i saw another orange light in the northern sky, slightly smaller in size to the first. i was working at the time and needed to leave the area to head for dayton, indiana. i was driving for approximately 5 minutes on 900 e. i stopped at the st rd 38 east and 900 e intersection at about 8:57 pm, i saw yet another orange light, about the size of an pencil eraser in the northern sky. the light appeared to make a short dart to the south and then faded. i was very excited and wanted to stay in the area to see if more would appear but i also was very disappointed i couldn't remain in the area to watch to see if the lights were caused by planes as the air traffic that night was very heavy."],"Date Submitted":"09/23/2009 12:44 UTC","Disposition":"IFO"}