{"Object Flight Path":"Stationary","divs":["Sighting DetailsI went to lock the patio gate to my apartment around 3.45am when I noticed a very large and very bright object out my patio window. The object was round but not perfectly round and first glanced look like it was a bright twinkling star. I looked closer outside at the object and could observe it flashing different colors \"red blue green white\". The object looked like it was no more then 10,000 feet up, and about the size of a grape as if held out with arms extended. I woke my wife up out of bed and we both watched the object for good five minutes. She was freaked out and went back to bed wanting no part of what I was watching, but I stayed up and kept observing this thing. I would say a good 20 minutes passed without any movement from the object, however it continued to strobe colors. To my amazement the object vanished and was gone. No movement whatsoever and there was not a cloud in the sky. I want to reiterate the object did not fade out, it vanished! I had a remarkable ufo sighting when I was 12, and the sighting I had on this night gave me the same feelings of excitement and fear combined."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.117358,+-88.20198(19606)&iwloc=A&hl=en\"> mufon case (19606) map </A>","trends":["There have been 3 other sightings in Urbana","There were no other sightings in Urbana on or around September 20th 2009"],"Country":"United States","Date of the Event":"09/20/2009 03:45 UTC","Region":"Illinois","Longitude":"-88.20198","Latitude":"40.117358","Tags":"City","Object Shape":"Sphere","Object Features":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Summary":"round object very bright flashing red, green, blue and white.","files":["/var/www/straped/mufon/html2text/19606.html.txt","/var/www/straped/mufon/org/19606.html"],"Weather Factors":"None","City":"Urbana","Source":"MUFON","Date Submitted":"09/23/2009 05:23 UTC","Viewing Distance":"Over One Mile","Case Number":"19606","Log Number":"US-09232009-0015"}