{"divs":["Sighting DetailsWe were awaiting a fireworks display at the Annual Wine and Harvest \"Grape\" festival, when suddenly 3 of these objects appeared. The first took the lead and proceeded from a North-Easterly direction moving at a fairly slow nice pace towards the South West, then went west towards the Lake Michigan direction before slowly disappearing out of sight. After the first one made it's pass through, two others then appeared at closer together distance between each other. One after the other, they followed the same path as the first, as if they were observing the crowd gathered for the fireworks display. Others saw it and were remarking, \"what is that\" It was obvious they were not balloons because of the manner that they were traveling. It was a \"no fly\" zone area due to the pending fireworks, so that ruled out a plane. They emmitted no noise of any kind. The first passed through shortly before and at the start of the display, while the other two traveled through during the display. It was evident at that time, that they were up much higher and further off from the display area than what it seemed like. The fireworks display had no effect on them and they did not react. It was as though they wanted to be seen as they moved just fast enough to draw attention, but not fast enough to not be noticed. The lights were mostly reddish-orange and were moving in what seemed in a circular motion around the circular ship. The videos I took were zoomed in as far as I could zoom the camera. I used a Casio Exilim camera."],"Disposition":"Unknown","Source":"MUFON","Date of the Event":"09/11/2009 12:00 UTC","files":["/var/www/straped/mufon/html2text/19609.html.txt","/var/www/straped/mufon/org/19609.html"],"Summary":"Reddish-Orange Glowing circular object moving at medium pace from North to South, then went west towards Lake Michigan","Viewing Distance":"Unknown","Sighting Duration":"00:30:00","Country":"United States","Log Number":"US-09232009-0018","Date Submitted":"09/23/2009 08:34 UTC","City":"Paw Paw","trends":["There have been 2 other sightings in Paw Paw","There were no other sightings in Paw Paw on or around September 11th 2009","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Case Number":"19609","Longitude":"-85.883225","Object Features":"Unknown","Region":"Michigan","Object Shape":"Circle","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.222317,+-85.883225(19609)&iwloc=A&hl=en\"> mufon case (19609) map </A>","Latitude":"42.222317"}