{"Object Flight Path":"Stationary,Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Object Features":"Window(s)","Case Number":"19600","Date of the Event":"09/22/2009 08:30 UTC","Object Shape":"Circle, Oval","Region":"Washington","map":"<A HREF = \"http://maps.google.com/maps?q=47.193378,+-122.285897(19600)&iwloc=A&hl=en\"> mufon case (19600) map </A>","Log Number":"US-09232009-0009","Latitude":"47.193378","Viewing Distance":"101-500 Feet","trends":["There have been 13 other sightings in Puyallup","There was one other sighting in Puyallup on or around September 22nd 2009"],"files":["/var/www/straped/mufon/html2text/19600.html.txt","/var/www/straped/mufon/org/19600.html"],"Source":"MUFON","Weather Factors":"None","City":"Puyallup","divs":["sighting detailsthere was a huge, brilliant bright ufo hovering 500 feet with a probe sticking out to the left of the craft and a dark image below it. it was visible for 2+ hours and moved a total of 1,000 feet west during 2 hours. we watched with our binoculars and night vision goggles. we also saw 4 ufo's (east, west, southwest). they were all identical, pulsating red, green, red, green. they remained stationary, not moved, except the one south of us that went up\\down and side to side. when i looked through normal binoculars, i could see a black spacecraft with 6 lights tilted sideways next to the brilliant bright one. it must have been 1\\2 mile long. it would have been camouflaged, but i saw the dense of the black ship as it was solid black and the lights were positioned as a massive ufo. called the national mufon and told her if a local person came, they could witness something fantastic. the local person didn't call back. this is the 3rd time in less than a week, but growing in quantity seen and intensity."],"Date Submitted":"09/23/2009 03:31 UTC","Longitude":"-122.285897","Tags":"City","Country":"United States","Summary":"5 UFO's over Fort Lewis Military Base (3 were green/red flashing and one bright, large ones)","Disposition":"Unknown"}