{"Viewing Distance":"Unknown","Date of the Event":"07/08/2009 09:30 UTC","Object Shape":"Sphere","Summary":"large one and small one large one shot across the sky small one shot upward","Longitude":"-97.743471","map":"<A HREF = \"http://maps.google.com/maps?q=32.059308,+-97.743471(19603)&iwloc=A&hl=en\"> mufon case (19603) map </A>","Object Features":"Unknown","Tags":"City","divs":["Sighting DetailsOur paranormal group was on a bridge doing a paranormal investigation to test our ghost hunting equipment. While filling out our paperwork and had looked up to see weather or not there were any clouds to make note of the weather conditions. One of the spectators that was there watching had said that she had gotten a strange picture with lights behind another spectator. We were trying to determine if maybe it were lightening bugs so, we stood him against the wall of the bridge in the same location to see where the light could have come from. We had looked up to see if we could see lightening bugs and we noticed that there was a large spherical light and a small star behind it. We thaught that it was a plane at first but were wondering what sort of plane would be that large and we couldn't see it's flashing lights on it's wings. It was moving slowly from south to north. It was then that the smaller light, that we thought at first was a star, dropped down, made a \"U\" and shot straight up rapidly and dissapeared. The larger object quickly shot accross the sky(from south to north) and slowed dramatically. It remained in that location in the sky for about 15 - 20 minutes. It then made a \"U\" and shot straight up and dissapeared. I looked at the man standing next to me and said \"did you see that?\" I heard a voice from behind me say \"yes, and what the hell was it?\" I turned around to see that the entire group (with the exception of one member who was putting up equipment and making notes) had looked up to see what we were looking at and had witnessed the entire event. We were all shocked and were unsure what to make of this."],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Date Submitted":"09/23/2009 04:19 UTC","Sighting Duration":"Undisclosed","Latitude":"32.059308","files":["/var/www/straped/mufon/html2text/19603.html.txt","/var/www/straped/mufon/org/19603.html"],"Disposition":"Hoax","Case Number":"19603","City":"Walnut Springs","trends":["There has been one other sighting in Walnut Springs","There were no other sightings in Walnut Springs on or around July 8th 2009"],"Region":"Texas","Log Number":"US-09232009-0012","Source":"MUFON","Weather Factors":"None"}