{"divs":["Sighting DetailsI was in my front yard star-gazing with a pair of field-glasses when I noticed a satellite traveling generally south to north at approximately 70 degrees. As I watched it, a flashing light appeared in that general vacinity of the sky,and although it was still very high up, it was clearly much closer than the satellite I had beeen watching. This light was moving at a fairly high rate of speed, comparable to a jet liner. The light was yellowish and flashed very brightly. This light flashed five times as it moved across the sky, and then it simply stopped flahing, and was no longer visible - this occured on a very clear night, so there was nothing to obstruct my line of sight to the light. Within two or three seconds of this flashing light \"going off\", another light appeared in the same specific area of the sky, but much higher, and travelling at an incredibly high rate of speed. Soon after this light appeared it split into two lights and continued at the same relative speed as they angled away from each other. I had to choose to watch one through my field-glasses as they split up, and it was hard to follow as it was moving so quickly - it crossed the sky in no more than 2 seconds; an then faded out of my vision. After the one faded out, I tried to find the other, and could not. But; as I was searching the sky around the area where the first light had faded out, I saw what appeared to be two lights travelling in unison but separated by a considerable distance - these lights were perhaps 100-150 feet high in the sky and were at least hundreds of feet apart. These \"two lights\" were moving in tandem and were travelling incredibly slowly; just creeping across the sky, and making no apparent noise. It wasn't until I noticed the neighborhood dogs barking like crazy that I noticed a low, but very potent, hum. As I watched these lights, not sure what they were, I realized that the area between these lights was literally blocking out the stars as it moved between them and my perspective. It was huge! The shape appeared triangular, but my perspective and the pure blackness of the object against the black night sky made this difficult to be sure of. This shape travelled slowly across the sky for perhaps three minutes and then vanished, or at least became no longer visible to me."],"Region":"Washington","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Triangle","Summary":"series of lights and shapes at different altitudes trajectories","Country":"United States","Weather Factors":"Unknown","Longitude":"-122.484785","Viewing Distance":"Unknown","Date of the Event":"09/23/2009 08:55 UTC","Source":"MUFON","Case Number":"19612","Object Flight Path":"Other","Date Submitted":"09/24/2009 02:05 UTC","trends":["There have been 27 other sightings in Bellingham","There were no other sightings in Bellingham on or around September 23rd 2009"],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=48.761723,+-122.484785(19612)&iwloc=A&hl=en\"> mufon case (19612) map </A>","Latitude":"48.761723","City":"Bellingham","Log Number":"US-09242009-0002","files":["/var/www/straped/mufon/html2text/19612.html.txt","/var/www/straped/mufon/org/19612.html"],"Disposition":"Unknown"}