{"Tags":"City","Case Number":"1962","Disposition":"Insufficient Data","Longitude":"-78.238624","map":"<A HREF = \"http://maps.google.com/maps?q=40.670618,+-78.238624(1962)&iwloc=A&hl=en\"> mufon case (1962) map </A>","Region":"Pennsylvania","Country":"United States","Date Submitted":"10/20/2002 07:30 UTC","Summary":"UFO over Ice Mountain. Central Pennsylvania","Log Number":"","files":["/var/www/straped/mufon/html2text/1962.html.txt","/var/www/straped/mufon/org/1962.html"],"Object Shape":"Sphere","Object Flight Path":"Straight-line path","Sighting Duration":"00:05:00","divs":["Sighting DetailsI was doing a little pre-season scouting for deer on Ice Mountain, near Tyrone,PA late Sunday afternoon. I had spent more time out in the woods than I hadplanned on, and the sun had already set as I made my way back to my Jeep, when Inoticed a bright light in the sky moving in my direction.At first I thought it was just an airplane and thought nothing of it. But thenit suddenly stopped moving and began to pulsate, getting brighter and thenfainter. I noticed at this time that there appeared to be a slight hazesurrounding the object. The pulsating increased in tempo until the object wasflickering at a very rapid rate, when suddenly, a bright beam of light shot downfrom the bottom of the object to the ground below. This was no searchlight. Evena well focused searchlight tends to diffuse with distance, but this light was atight, bright beam from top to bottom.As suddenly as the pulsating began, it stopped, and the beam also turned off.The object just sat there motionless in the sky. My Jeep was only about 100yards away when all this happened, so I ran to it to get my camera. I took apicture of the object as it hovered, and as I got ready to take another picturethe object it began moving around slowly in a tight circle. I took anotherpicture, but before I could take a third, it suddenly shot straight up in theair at fantastic speed and was gone from sight Ill attach the two pictures I gotto an email message and send them in. I cropped them down a bit to reduce thefile size. I dont know what this thing was, but I know Ive never seen anythinglike it before"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"10/20/2002 07:30 UTC","trends":["There has been one other sighting in Tyrone","There were no other sightings in Tyrone on or around October 20th 2002"],"Latitude":"40.670618","Source":"MUFON","City":"Tyrone"}