{"Sighting Duration":"00:02:00","divs":["Sighting DetailsI was outside having a cigarette and was skywatching as I usually do when I go outside at night. I witnessed a triangle UFO a few months ago and have looked for UFOS in the sky ever since. I saw a white light coming towards me very slowly from the north. When it came closer, I realized it was an sphere and not a plane or heli. The object was very bright and about the size of a baseball to my point of veiw. I would say it was about 1000 feet in the air. The object slowly traveled from my left to right and lasted about two minutes. I called for my wife to come out and see it to give me another point of view on what it could be. I decided to go into the house to get my camera and when I came out, the object accelerated very fast to the east and disappeared into the sky. I would of had a great picture if I acted sooner but I was in awe of what I was seeing. The object made no sound at all and it was much closer than planes that fly over which can be easily heard. This is my second close up sighting that I have had in 6 months and I look foward to seeing more."],"Date Submitted":"09/25/2009 12:11 UTC","Date of the Event":"09/24/2009 08:00 UTC","Object Flight Path":"Path with directional change","Region":"California","Object Features":"Unknown","Object Shape":"Sphere","Summary":"Bright white orb floated in sky and vanished","Longitude":"-121.211623","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","files":["/var/www/straped/mufon/html2text/19629.html.txt","/var/www/straped/mufon/org/19629.html"],"Log Number":"US-09252009-0001","Source":"MUFON","Latitude":"37.804287","trends":["There have been 6 other sightings in Manteca","There were no other sightings in Manteca on or around September 24th 2009"],"Disposition":"Hoax","City":"Manteca","Weather Factors":"Unknown","Case Number":"19629","map":"<A HREF = \"http://maps.google.com/maps?q=37.804287,+-121.211623(19629)&iwloc=A&hl=en\"> mufon case (19629) map </A>"}