{"map":"<A HREF = \"http://maps.google.com/maps?q=45.793086,+-108.49137(19621)&iwloc=A&hl=en\"> mufon case (19621) map </A>","Longitude":"-108.49137","Date of the Event":"Unknown","City":"Billings","Tags":"City","Log Number":"US-09242009-0011","Sighting Duration":"Undisclosed","Latitude":"45.793086","trends":["There have been 13 other sightings in Billings","There were no other sightings in Billings on or around"],"Case Number":"19621","divs":["Sighting DetailsI've had numerous sightings right from the backyard of my home. It's only now that I've decided to come forth. I have also been contacted & I have a \"chip\" or something in my left hand that they have put in me in order to know where I'm at. Wherever I go they are there. I have a photo already developed in which I can't duplicate over the internet. I wish to remain anonymous and don't want to be put on TV. I just want help. The time of contact happened when I was very young but you can still see the chip in my left hand. I do have a few photos - we do have a lot of aircraft due to the Billings airport but we've been here long enough for me to know the difference. Also when I see the UFO's there's no sound and we can always here the airplanes overhead. And the objects always just move straight up and down or side to side like they are trying to stay hovered and are watching. I have more photos but can't put them all on this form. If you need more please feel free to email me or contact me and I will send them to you. Thank you for your time and consideration in helping me."],"Region":"Montana","Country":"United States","Object Flight Path":"Hovering then path,Other","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/19621.html.txt","/var/www/straped/mufon/org/19621.html"],"Object Shape":"Circle, Diamond, Fireball, Flash, Oval","Date Submitted":"09/24/2009 03:03 UTC","Object Features":"Unknown","Viewing Distance":"Unknown","Summary":"numerous UFO sightings"}