{"Disposition":"Unknown","Log Number":"US-09242009-0018","Case Number":"19628","divs":["Sighting DetailsJust stepped out on to the porch to talk with the wife and looked up to see this object about 800-1000' feet up. Said hey thats pretty bright for a plane and kept waiting for flashing lights or something. The brightness never changed even though it was moving and never saw the red or blue and white flashing lights. Also there was not one bit of sound I thought I would hear something with it being that low but not one sound. There was another plane about cruising altidude that you could make out its flashing lights it was headed in a more southern direction. This object was more like dead South-East. We had crickets chirpping before I spotted the object but during it there was nothing and about a minute or two after it was out of sight they started chirpping again. No smells. We did have a military jet take off yesterday around 9-930pm out of Eugene Airport it took off with only it's underbelly red light flashing, maybe has something to do with it? And for photos Just my luck this thing was bright enough you could have used a plain old video cam and picked this thing up but I just happened to have my batteries in a flashlight. KEEP THEM BATTERIES IN THE CAMERA> Thank You<"],"Weather Factors":"None","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.053759,+-123.084504(19628)&iwloc=A&hl=en\"> mufon case (19628) map </A>","Tags":"City","trends":["There have been 68 other sightings in Eugene","There was one other sighting in Eugene on or around September 24th 2009"],"Date Submitted":"09/24/2009 11:32 UTC","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"None","Longitude":"-123.084504","Date of the Event":"09/24/2009 08:02 UTC","Viewing Distance":"501 Feet - 1 Mile","Latitude":"44.053759","Object Shape":"Star-like","Region":"Oregon","City":"Eugene","Sighting Duration":"00:02:00","Summary":"Passed Over hwy 99 and roosevelt","files":["/var/www/straped/mufon/html2text/19628.html.txt","/var/www/straped/mufon/org/19628.html"]}