{"Date of the Event":"09/05/2009 10:40 UTC","divs":["Sighting DetailsI was driving alone from Ocean City, NJ heading west on the Atlantic City Expressway towards Philadelphia and was about 5 miles west of the Egg Harbor Toll Plaza. It was about 10:40 on the morning of Saturday, September 5 and it was a beautiful sunny day with a mostly cloudless clear blue sky. At about a 45 degree angle in the sky directly in front of me (looking west) I observed a small, flat-white object, shaped like a little tophat, appear out of nowhere in the sky. It descended in an erractic flight pattern for a couple of seconds then disappeared. A couple seconds later, it reappeared as before, descended in the sky in the same erractic manner for a couple seconds, then disappeared for good. I watched the local news that evening to see if there was any coverage of strange UFO-like sightings, but there was none. I tried to contact the astronomer at the Franklin Institute to discuss with him, but couldn't find a listing of his email address. I told my wife of this event and she later happened upon your website from something she had seen in the paper about an upcoming convention. What did I think the object was when I first noticed it? I don't know, but I sure couldn't identify it. I had seen something like this about 40 years ago when I was about 13 or 14. Ron Moser"],"Weather Factors":"Windy, Light","files":["/var/www/straped/mufon/html2text/19622.html.txt","/var/www/straped/mufon/org/19622.html"],"Disposition":"Unknown","Tags":"City","Viewing Distance":"Over One Mile","City":"Philadelphia","Object Features":"Dome","Latitude":"39.91778","Summary":"I saw a small white object against a clear blue sky. It was shaped like a tophat and flew erratically for a moment, disappeared, then reappeared before disappearing again.","Object Shape":"Other","Date Submitted":"09/24/2009 03:51 UTC","Country":"United States","Longitude":"-75.22833","Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=39.91778,+-75.22833(19622)&iwloc=A&hl=en\"> mufon case (19622) map </A>","Object Flight Path":"Path with directional change","Case Number":"19622","Log Number":"US-09242009-0012","Sighting Duration":"00:00:10","Source":"MUFON","trends":["There have been 11 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around September 5th 2009"]}