{"Object Flight Path":"Stationary,Straight-line path","Summary":"Looked like a cloud","files":["/var/www/straped/mufon/html2text/19638.html.txt","/var/www/straped/mufon/more/19638_submitter_file1__ufoaafb.jpg","/var/www/straped/mufon/org/19638.html"],"Longitude":"-76.749691","Disposition":"Unknown","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Upper Marlboro","There were no other sightings in Upper Marlboro on or around September 22nd 2009","This sighting has never been favorited.",""],"Object Shape":"Other","Viewing Distance":"Unknown","Case Number":"19638","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsI work next to AAFB and I went outside on the deck for a break. I noticed alot of clouds in the sky but one in particular was not moving. It stayed in the same position as the other clouds moved by. I kept watching it and one of the jets from AAFB flew below it. At this time it was like it released a mist underneath it. I could not take my eyes off of it because it was so strange. I noticed an object silver in color and moving very fast over it. It was round. When this moved over it it looked like a mist came from the top of it. More clouds started coming by and it stayed in the same position. I went to see if I could find a camera, but when I went back outside it was like it was disappating itself. I have seen round silver objects above this area before and watching them at first thought they were balloons, but one would disappear and then reappear and then the other would do the same. I was reading on the recent ufo cases and found a picture that I will attach of the cloud that I saw that someone else caught on film from Korea. I could not believe how much it looked like what I had seen."],"Date of the Event":"09/22/2009 10:22 UTC","Region":"Maryland","City":"Upper Marlboro","map":"<A HREF = \"http://maps.google.com/maps?q=38.815947,+-76.749691(19638)&iwloc=A&hl=en\"> mufon case (19638) map </A>","Date Submitted":"09/25/2009 02:46 UTC","Weather Factors":"Unknown","Latitude":"38.815947","Log Number":"US-09252009-0010"}