{"Case Number":"19632","Object Features":"Unknown","City":"Castle Rock","Tags":"City","Object Shape":"Circle, Fireball","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path with directional change","Log Number":"US-09252009-0004","Country":"United States","Date Submitted":"09/25/2009 02:15 UTC","trends":["There have been 11 other sightings in Castle Rock","There were no other sightings in Castle Rock on or around September 24th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.374682,+-104.85494(19632)&iwloc=A&hl=en\"> mufon case (19632) map </A>","Region":"Colorado","Source":"MUFON","Weather Factors":"None, Does Not Apply","Longitude":"-104.85494","Latitude":"39.374682","files":["/var/www/straped/mufon/html2text/19632.html.txt","/var/www/straped/mufon/org/19632.html"],"divs":["Sighting DetailsDriving NW on Factory Shops Blvd coming home from the grocery store and saw a big ball of light moving fast towards me, then reversed course without turning around to do so. It jogged quickly between north and south directions and resumed its path headed south. It was only about 200 feet at most above the Meadows subdivision. There weren't any blinking lights or any clear outline, just a very bright ball of light,without any sound whatsoever, about dime-size in the sky. I noticed a cop sitting at Santa Fe and Atrium drive, facing Santa Fe, seemingly watching it. He was sitting there with his lights on, without anyone pulled over, facing the whole thing. I couldn't see if it was a Douglas County cop or a Castle Rock cop. I called my wife as I pulled into our parking lot and she went onto our deck and saw it for about 5 seconds as it zoomed by. Then it just seemed to completely disappear, but stayed low the entire time. Funny enough, we just came back from New Mexico this past weekend and caught another strange occurence on film (we've already submitted that report and photos). So, to see two very strange things so close together in the same week is exciting and unnerving. I wish I would've had a camera so I could've gotten a picture, but even if I had, it was so quick I don't think it would've mattered. Thanks."],"Viewing Distance":"501 Feet - 1 Mile","Summary":"Low, fast-flying fireball, changing directions mid-air","Sighting Duration":"Undisclosed","Date of the Event":"09/24/2009 11:35 UTC"}