{"files":["/var/www/straped/mufon/html2text/19630.html.txt","/var/www/straped/mufon/org/19630.html"],"City":"Tucson","Weather Factors":"None","Region":"Arizona","Object Flight Path":"Stationary,Path with directional change,Path then hovering","divs":["Sighting DetailsI went outside with dog. When I looked up I saw 1 bright sphere and light,green in color heading northwest towards me. The were two other dimmer lights converging on the sphere. Direction of objects 40 mi southeast of Tucson and Davis Monthan AFB. I initially thought it was an airliner heading for the \"Suns Arrival\" into Phoenix airport. I had noticed that there were no additional position lights, and the two other ojects were dimly lit with a slight reddish silver tint. As a trained airline pilot, I found it odd that there was no starboard green or port side red, and the white marker beacon was non-existent. This got my attention. Once the objects converged upon the brightest, the two dimmer spheres encircled it several times, and then dramtically increased in brightness. After several \"spins\" at a high rate of speed (and it seemed they were accelerating in the rotations)in extremely close proximity to one another, the brightest (Green) remained stationary, while the two other spheres accelerated to what appeared to be \"pre-set points\" to form a perfect right triangle in unison. Once the other two spheres broke from the green, the green sphere went dim. The spheres were stopped on \"points\" estimated at 40 miles apart. Estimated altitude of objects 60,000 feet. Size of all objects at estimated altitude would approximate the visible size of an MD80 at 30000 feet of altitude. The spheres remained stationary, yet the right triangle began to rotate slowly in a clockwise motion while maintaining spacing and triangular shape. Once the sphere encircled the green, and broke for the \"points\" the neighborhood dogs, coyotes, and even my dog began to howl, bark, and whine. This was also pretty strange. The dogs and coyotes continued to howl for about 8 minutes, my dog was very nervous and \"whining\" and wanted to go in. I watched for several minutes, and called my son out to look. He immediately spotted the triangle and noticed a slow clockwise rotation of the triangle using the green object as a reference point. The objects maintained what appear to be a perfect formation. I went inside, and came out about 10 minutes later and the \"Triangle of objects\" was gone. There were 3 very distinct objects, and very discernable as \"spheres\". There was no sound audible to my ears, and the neighborhood was void of city noises, but \"something\" clearly agitated every dog and coyote around for 8 minutes or so. After the objects disappeared, the animals quited down. My feelings after watching these objects are of wonderment. I was amazed at the sheer speed and the acceleration of these objects. It took them maybe 4 seconds to travel from the green object to \"set points\" estimated at 40 miles apart, and then come to a very distinct \" on a dime\" stop. The precision and timing of the maneuver was nothing short of amazing. The only odd feeling that had was the reations of the animals. The noises that they were making were not your \"normal\" barks and coyote \"yips\". It was just odd."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.231143,+-110.920659(19630)&iwloc=A&hl=en\"> mufon case (19630) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"09/25/2009 12:24 UTC","Summary":"3 spheres encircle each other and split to form right triangle, 40 miles Southeast Tucson","Log Number":"US-09252009-0002","Country":"United States","Object Features":"Unknown","Latitude":"32.231143","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around September 24th 2009","This sighting has never been favorited.",""],"Object Shape":"Sphere","Longitude":"-110.920659","Source":"MUFON","Tags":"City","Case Number":"19630","Disposition":"Unknown","Viewing Distance":"Over One Mile","Date of the Event":"09/24/2009 07:53 UTC"}