{"Source":"MUFON","Viewing Distance":"21-100 Feet","Tags":"City","Object Flight Path":"Undisclosed","Date Submitted":"09/25/2009 03:09 UTC","divs":["Sighting DetailsSEPTEMBER 20, 2009 @ APPROX. 8:00 P.M. THE SKIES WERE DARK AND CLEAR. MY WIFE AND I LEFT THE HOUSE TO WALK THE DOG AS USUAL. WE GOT TO THE CORNER OF THE STREET AND BEGAN TO WALK ACROSS. I WAS HALF WAY ACROSS WHEN I HEARD THE THRUST OF AN ENGINE WHICH SEEMED TO BE TWICE AS LOUD AS USUAL. I LOOKED UP IN ALL DIRECTIONS THINKING THAT IT WAS A LOW FLYING PASSENGER JET AND SAW NOTHING. THE ENGINE THRUST LASTED 5 TO 7 SECONDS. I THEN LOOKED STRIGHT UP AND SAW A BRILLIANT WHITE LIGHT THAT SEEMED NARROW IN DIAMETER. BEST DESCRIPTION OF LIGHT-TAKE A LASER POINTER, CHANGE COLOR TO WHITE, ELIMINATE BEAM OF LIGHT AND LOOK DIRECTLY INTO LIGHT. THERE SEEMED TO BE WHAT LOOKED LIKE STATIC ELECTRICITY FORM POSIBBLY UNDERNEATH FOR ABOUT 3 TO 4 SECONDS THEN STOPPED.THE OBJECT STARTED TO SLOWLY MOVE AND I CAUGHT A SPLIT SECOND LOOK AT WHAT SEEMED TO BE A WING. I YELLED AT MY WIFE TO LOOK AT THE OBJECT AS IT STARTED TO ACCELERATE. AS IT STARTED TO MOVE 3 LIGHTS CAME INTO VIEW. AS IN A JET AIRLINER, LEFT BLINK FOLLOWED IMMEDIATELY BY RIGHT BLINK. THE COUNT 1 MISSIPPI FOR THE 3RD LIGHT. THIS CONTINUED AS IT CROSSED THE HORIZON. THE OBJECT WAS NOISELESS AS IT MOVED. IT MOVED FROM A CRAWL AND WITHIN 5 SECONDS IT MOVED LIKE A JAPANESE SUPER TRAIN. IT CAME TO A STOP AT A CERTAIN POINT, BUT BEFORE IT DID, WHAT SEEMED TO BE STATIC ELECTRICITY WAS FLASHING FROM LEFT TO RIGHT SIDE. THE OBJECT APPEARED TO STOP AND HOVER AND HAD A BLINKING LIGHT AS IT STAYED IN THAT POSITION. I TOOK A STEP DOWN FROM THE CURB TO CROSS BACK TO THE OTHER SIDE OF THE STREET. WHEN I STEPPED DOWN, I LOOKED OVER AND SAW THAT THE OBJECT HAD MOVED WHAT SEEMED TO FROM A 45 TO 90 DEGREE ANGLE AND STILL HAD A BLINKING LIGHT. WHEN I GOT TO THE OTHER SIDE OF THE STREET, I LOOKED BACK AND NOTICED THAT THE LIGHT CHANGED FORM A BLINKING TO A SOLID LIGHT, THE SAME AS I INITIALLY OBSERVED. I TALKED THINGS OVER WITH MY WIFE AND SHE MENTIONED THE FACT THE FOR SOME REASON, THERE WAS NO TRAFFIC DURING THIS OBSERVATION. THE STREET THAT INTERSECTS AS WELL AS OUR STREET HAS A GOOD AMOUNT OF TRAFFIC AT ANY GIVEN TIME. IT SEEMS AS IF WE WERE IN A TIME WARP, IF THERE IS SUCH A THING. ALSO, IN THE HORIZON WHERE THE OBJECT STOPPED IS WHERE I ALWAYS SEE PLANES TAKING OFF FORM THE AIRPORT. NEITHER MAY WIFE OR I REMEMBER SEEING ANY FLIGHTS TAKING."],"Sighting Duration":"00:00:30","Weather Factors":"None","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.426352,+-98.486018(19639)&iwloc=A&hl=en\"> mufon case (19639) map </A>","Log Number":"US-09252009-0011","City":"San Antonio","files":["/var/www/straped/mufon/html2text/19639.html.txt","/var/www/straped/mufon/org/19639.html"],"trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around September 20th 2009"],"Summary":"ENGINE NOISE, BRIGHT LIGHT, INCREDIBLE SPEED, HOVERING BEFORE ACCERLERATION.","Object Features":"Undisclosed","Disposition":"Unknown","Date of the Event":"09/20/2009 08:00 UTC","Case Number":"19639","Object Shape":"Triangle, Unknown","Latitude":"29.426352","Longitude":"-98.486018","Country":"United States"}