{"Disposition":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.273346,+-84.604476(19635)&iwloc=A&hl=en\"> mufon case (19635) map </A>","Latitude":"45.273346","Date of the Event":"09/20/2009 09:00 UTC","Object Flight Path":"Stationary,Path then hovering","Date Submitted":"09/25/2009 10:46 UTC","Case Number":"19635","Region":"Michigan","Summary":"Multiple objects sighted over a half hour to 45 min time frame.","Object Shape":"Flash, Sphere, Star-like, Other","Viewing Distance":"Over One Mile","Log Number":"US-09252009-0007","Sighting Duration":"Undisclosed","Longitude":"-84.604476","Source":"MUFON","Object Features":"None","City":"Wolverine","files":["/var/www/straped/mufon/html2text/19635.html.txt","/var/www/straped/mufon/org/19635.html"],"Weather Factors":"None","divs":["Sighting DetailsOn Sunday evening Sept 20 2009 I had just reached my destination in Wolverine Michigan and opened up the cottage. At 9:00 PM I stepped out on the deck to call my wife to let her know I had arrived all right and while I was talking to her I was gazing at the stars as I do often in the clear north sky. While I was looking I spotted what I thought was a satellite running from southwest to northeast. As I watched it seemed to have a slight wobble to its pattern that I figured was do to a spinning motion in orbit and the reflection from the sun like an optical illusion. This all changed in my mind when the object I was watching stopped just above the horizon (Maybe if you used your hand in front of you and stacked four fingers from the horizon line to the object you would have the rough area.) This object stopped briefly and then reversed along the same line to rise in the sky up a short distance and then stop again. This object stayed in this location for at least a half hour but this is not the only one I saw. I spotted what I thought (and may have been) another Satellite moving in the same area in the northern sky near this object. It moved from the west to north and just as it reached a parallel (from my perspective) it vanished. I know that this is not unusual with satellites as they cross they will lose the reflection of the sun but this object was still high and centered enough to be getting the solid reflection. While I was watching the object a very bright intense flash from behind me distracted me. I turned and spotted this flash in the south sky. This flash was not regular, I would see like one flash then a pause then three quick flashes. This was at 9:20PM and only lasted a minute or two and then the flash moved directly east of me in a heartbeat. There were a couple flashes than it stopped. So I went back to keeping an eye on the original object that was still in the same location. At 9:30PM while I watched the original object I kept scanning the sky for the flash or now anything else. After a couple planes went overhead I took a glance at the west and spotted a much lower very bright white spot. This object moved in from the west to the east and I thought it may be a plane but there were no navigation lights. This object moved slowly in a straight path to directly overhead and then faded out and gone. This was not a satellite as it was way to low in the lower atmosphere. I am also convinced it was not a plane as the final view was solid white and I was under it so I would have seen the navigation lights easily. This was a glowing orb! With this a few moments later the original object vanished. While all this was going on my wife logged on and found some similar reports on the net of these objects located in northern Michigan at the same time. Very ODD! I was sober and it was a very odd experience!"],"Tags":"City","trends":["There have been no other sightings in Wolverine","This sighting has never been favorited."]}