{"Weather Factors":"Unknown","Longitude":"-76.719745","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Date Submitted":"09/25/2009 03:36 UTC","Sighting Duration":"Undisclosed","City":"York","Log Number":"US-09252009-0012","Source":"MUFON","Summary":"2 lights vertical to each other approx 25 ft apart above neighbors house, lights moved in unison horizontally and object grew in size","Object Shape":"Unknown","Viewing Distance":"21-100 Feet","divs":["Sighting DetailsIt was about 8:30 pm York PA My daughter saw bright lights out the living room window and went to the door. She called me saying \"WHAT IS THAT?!\" No sound at all. When I went to the front door, there were two orangish lights in a vertical position with approx 25 ft of space between them, but to the eye in looked much closer. Then the lights turned in unison to a horizontal position, while in the same spot in the air. It was not moving, it was hovering I told my daughter to grab the video camera. By the time she got outside the lights were in the horizontal position and my son grabbed the phone for me to call my parents who live down the street. I told then to go outside and look up. They went out and they both saw it too. The exact same thing we were seeing. The lights began moving apart as if whatever was between them was getting bigger, growing in size It was still hovering and turned so that one light was pointed south and the other was pointed north The lights kept spreading apart (or getting bigger) and very slowly moved south Then one light went out and then the other went out No sound the entire time it was there We have the lights on video. All that is visible is the lights unless some sort of enhancement can be done to reveal more of what we could not see. The video was shot by my 13 year old and she was scared and shaking the camera, as well as zooming in and out, so it looks different than the details of what we saw in person."],"trends":["There have been 16 other sightings in York","There were no other sightings in York on or around September 24th 2009"],"Date of the Event":"09/24/2009 08:30 UTC","Object Features":"Unknown","Disposition":"Unknown","Region":"Pennsylvania","Tags":"City","Case Number":"19640","Latitude":"39.970258","files":["/var/www/straped/mufon/html2text/19640.html.txt","/var/www/straped/mufon/org/19640.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.970258,+-76.719745(19640)&iwloc=A&hl=en\"> mufon case (19640) map </A>"}