{"Sighting Duration":"Undisclosed","Log Number":"US-09262009-0009","Country":"United States","Summary":"Strobing light through cloud cover, throbbing noise accompanied the pulse","divs":["Sighting DetailsI was awakened from a sound sleep at 1:00am give or take a few minutes. The indoor lights were going on and off and there were popping noises, the smoke alarms were beeping. It was raining a light rain, no thunder or lightening. After the indoor lights died, I noticed a strobing light coming in through my bedroom window accompanied by a throb similar to a bass speaker with the volume too loud.I got out of bed and crept to the window. I peered out and whatever it was, was above my condominium complex. The light and noise was coming through the cloud cover, it was bright enough to illuminate the Broad River and the bushes growing on the riverbank on the other side.I walked across the hall to wake my grown son but he wouldn't co-operate. I was frightened, so I stayed in his room observing the strobing light outside through the slats of the shutters on his window. They were not the street lights out front pulsing, this was coming from overhead. I got the courage to walk downstairs to the kitchen to get my blackberry. The time said 1:18am. I called my brother who lives in the townhouse three doors down from me. He had fallen asleep on the couch, when the power went out it woke him up. After that, he went outside on his back deck to see where the light was coming from before I called him. He also got the impression that it, whatever it was, was above the cloud cover. He came over to my townhouse and we stood on the front stoop to observe and listen. By this time the light and throbbing sound had drifted southeast of us and we could here sirens from every direction coming from police and EMS vehicles in different parts of the town.By this time, my son was awake and came downstairs to join us on the stoop. We all went inside and watched as the light and thrumbing noise drifted southeast towards Charleston. I called the police the next morning to inquire as to what happened and at first, I was told that they had no reports of anything going on at that time. I described the lights and noise and the officer put me on hold. He came back several minutes later and told me that a transformer had blown. I thought that was very odd. I have never seen a blown transformer oscillate like that. I did not call SCEG because there is no direct person to speak with, you leave a series of touch tone prompts to report outages, and they call back to verify that your power is working again. Can you verify that this was a transformer, do transformers behave this way ( I don't think so), could the cloud cover have reflected a pulsing transformer's light to that extent? Thanks for any enlightenment that you can provide."],"Region":"South Carolina","City":"Columbia","Case Number":"19659","Date of the Event":"09/26/2009 12:00 UTC","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19659.html.txt","/var/www/straped/mufon/org/19659.html"],"trends":["There have been 22 other sightings in Columbia","There were no other sightings in Columbia on or around September 26th 2009"],"Source":"MUFON","Object Features":"Unknown","Weather Factors":"Rain, Medium","Disposition":"Unknown","Longitude":"-81.029774","Tags":"City","Object Shape":"Unknown","Date Submitted":"09/26/2009 07:11 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.00912,+-81.029774(19659)&iwloc=A&hl=en\"> mufon case (19659) map </A>","Latitude":"34.00912"}