{"Longitude":"-93.372241","trends":["There have been 3 other sightings in Warsaw","There were no other sightings in Warsaw on or around September 24th 2009","This sighting has never been favorited.",""],"Tags":"City","Date of the Event":"09/24/2009 08:31 UTC","Country":"United States","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Disposition":"IFO","Date Submitted":"09/26/2009 03:42 UTC","Object Shape":"Circle, Unknown","Case Number":"19656","Summary":"Bright White Light that Dims and Brightens. Went out. Turned Red.","Log Number":"US-09262009-0006","Object Flight Path":"Straight-line path","City":"Warsaw","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.250981,+-93.372241(19656)&iwloc=A&hl=en\"> mufon case (19656) map </A>","files":["/var/www/straped/mufon/html2text/19656.html.txt","/var/www/straped/mufon/org/19656.html"],"Latitude":"38.250981","Region":"Missouri","Source":"MUFON","divs":["sighting detailsthursday night. 9\\24\\09. truman lake, missouri. northwest of warsaw, mo. northeast of tightwad, mo. i was night fishing. about 1\\4 moon. i only caught a few small ones prior to dark. i put submersible lights down under my small boat at 7:30pm. (it makes my boat look like it's floating on a green light.) beautiful evening. party cloudy, but could see the stars. so quiet i could hear commercial jets flying high overhead. earlier that day, i saw an apache helicopter fly over. i waved to them and they flew directly over me. not unusual to see as the afb is not too far away. however, about an 1.5 hrs later (precisely 8:31pm), to the north of me, i saw a light flying from north (nnw) to south (ssw). i was just star-gazing when it happened. at first, i thought it was a very bright star. but it moved. it was high enough to be above the clouds. it looked like a car headlight on bright. while traveling on a straight course, about every 15 seconds, it would go dim for about 15 seconds, then bright again. no sound at all. that was very strange, because, i can always hear everything flying over. i was slightly afraid, so i prayed that god would protect me from it. then, i grabbed my digital camera and tried to video record it. the video didn't turn out well. i can barely see it upon replay, unfortunately. :( after flying almost directly above me, the light turned off and the object turned a reddish-orange in color. it had no blinking lights. then, it suddenly disappeared. or it completely went dark before flying away. if it continued on the same path, it would have gone over warsaw, mo. it flew in a relatively straight path. my feeling afterward was somewhat disbelief and wonder. i've never reported anything like this before and wish to remain anonymous. but i thought you all might be interested."]}