{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19653.html.txt","/var/www/straped/mufon/org/19653.html"],"trends":["There have been 9 other sightings in Lapeer","There were no other sightings in Lapeer on or around September 25th 2009"],"Object Features":"Unknown","Viewing Distance":"Over One Mile","Date Submitted":"09/26/2009 11:43 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.04736,+-83.352215(19653)&iwloc=A&hl=en\"> mufon case (19653) map </A>","Date of the Event":"09/25/2009 09:04 UTC","Sighting Duration":"00:00:03","divs":["Sighting DetailsI was driving east on Lapeer road in Davison, MI, between Irish rd and M-15(state street), at 9:04pm eastern time on Friday, September 25th, 2009. Suddenly I saw a 4 point star shaped object that had a bright orange center surrounded by a hue that was mostly blue but looked green for a moment. It appeared high in the sky, very far up (I have no idea of how high it was) and fell in a slight arc, going slightly left to right across my vision, straight down, out in the direction of Lapeer (east of me). It seemed to pulse slightly, although that detail is a little hazy. The entire event lasted just under 3 seconds. It was one of those situations where I didn't realize what I was seeing until it was already over. The shape was a 4 point star, with points at 0,90,180 and 360 degree points. It seemed to have a curve going from point to point. The object had to be pretty good size, I would estimate it to be at least 200 feet around given how large it looked to my eye. It seemed to only be about 30-50 miles in the distance, but that could be perception playing tricks on me. I have seen shooting stars, I can promise this was not one of those. It could have been a meteorite or \"space junk\" or whatever, but the 4 points I saw distinctly and at night seemed to not just be a piece of random junk. I hope someone else saw this and can give their description of what was seen, it gave me chills!"],"Tags":"City","City":"Lapeer","Object Flight Path":"Straight-line path","Region":"Michigan","Country":"United States","Case Number":"19653","Longitude":"-83.352215","Object Shape":"Diamond, Star-like, Other","Latitude":"43.04736","Summary":"A star shaped (4 points) object fell from the sky and landed somewhere around Lapeer, MI!!","Weather Factors":"Unknown","Log Number":"US-09262009-0003"}