{"Disposition":"Insufficient Data","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"09/26/2009 08:22 UTC","Log Number":"US-09262009-0002","Date of the Event":"09/20/2009 08:30 UTC","Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Raiford","There were no other sightings in Raiford on or around September 20th 2009"],"files":["/var/www/straped/mufon/html2text/19652.html.txt","/var/www/straped/mufon/org/19652.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=30.06385,+-82.2365(19652)&iwloc=A&hl=en\"> mufon case (19652) map </A>","Tags":"City","Object Shape":"Sphere","Summary":"Large, bright, blinking, slowly moving object whose light lit up the night surroundings.","Latitude":"30.06385","Object Features":"Undisclosed","divs":["Sighting DetailsI was returning to Jacksonville with my brother, sister-in-law and a couple of friends after having gone tubing at Ginnie Springs. About 45 minutes into our drive, my brother, sister-in-law and I (the friends were passed out) noticed that the inside of our van was being lit from the outside. We were on route 121 (a dark, lampless country road with trees on either side), somewhere between the cities of HIgh Springs and Raiford. Eventually, my sister-in-law got of a glimpse of a light up in the sky from the corner of her windshield, but she was driving and couldn't get a long look. However, she got a good enough glimpse to be puzzled since she noticed it didn't have the same light or movement pattern of regular aircraft. My brother was in the passenger seat and on the wrong side of the road and only experienced the flashing in the inside of our vehicle. I happened to be sitting in the very back and was able to swivel around and stare out of the back window. What I saw was a large, round blue-white light which seemed a bit brighter and condensed at the center and had a diamond-like brilliance. It blinked steadily every few seconds and I would have thought it was a navigation light except for the fact that it was much too big (about the size of a full moon), much too bright (its flash lit up the night sky and the ground below as much as a full moon) and it was not stationary (it moved slowly in the same direction as ourselves and the road but we eventually left it behind). I stared at the object for the several minutes it was in view and I could not figure out what it was. As my sister-in-law observed, it did not move as fast as a plane would, there was no noise of a helicopter or steady helicopter beam, I don't think weather balloons have such a bright light source nor move so steadily. Even after the object was lost to curves, distance and trees, I could still see its blue-white flash light up the sky for a few more miles. The entire encounter lasted about 10 minutes."],"City":"Raiford","Longitude":"-82.2365","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Case Number":"19652","Region":"Florida"}