{"divs":["Sighting Detailsas we sat on the porch,my daughter saw 3 disc shapes in he sky about 10,000 ft. as we sat on the rear porch.not knowing what could move tike they did we then saw them (one at a time) travel in a straight downward angle at an incredible speed, and then at a right angle into a single cloud in the sky and then dissappearing after sitting in the cloud for about 3 minutes.They were bright metalic with the sun reflecting. I am a naval veteran and I have seen many aircraft, I have been a passenger on many in the service. I do know how conventional aircraft travel and this did not travel in a conventional way! There was also a C140 in the sky and it was barely moving(350 to 500 mph) comparing it to the ufo's we observed. I, as many others, have heard many stories about UFO's and don't know any more about them other then what I have seen, heard and read. I now believe that there are other \"things\" that occupy our air space and have taken the stand of believing that they are real!No one can tell me otherwise. If you are a non believer,you had better wake up.If you don't,you are not learning to grow with our knowledge, and believe the skeptic's and there rediculous beliefs. They also thought that we could not travel over 25 mph without dying from the \"G\" force (after the invention of the train and auto). They also thought we(Earth) was the center of the universe. Now Galaleo is a revered astronomer! An open mind is a necessary to go foreward. Yes it is possable for the Government to have secret technology, but remember,they are now able to travel in a way that is unexplainable.Does that mean that we are in store for more technology. I thing so. The Dogfather"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.614138,+-119.248735(19658)&iwloc=A&hl=en\"> mufon case (19658) map </A>","Latitude":"39.614138","Object Shape":"Disc","Region":"Nevada","City":"Fernley","Tags":"City","files":["/var/www/straped/mufon/html2text/19658.html.txt","/var/www/straped/mufon/org/19658.html"],"Longitude":"-119.248735","Date of the Event":"06/22/2009 02:30 UTC","Log Number":"US-09262009-0008","Weather Factors":"Light","Country":"United States","Object Features":"Dome","Disposition":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"3ufo's traveling straight down and then a sudden 90 degree turn into a single cloud(no other clouds) and dissappeared","Viewing Distance":"Over One Mile","Date Submitted":"09/26/2009 03:54 UTC","Case Number":"19658","Object Flight Path":"Path with directional change","trends":["There have been 4 other sightings in Fernley","There were no other sightings in Fernley on or around June 22nd 2009"]}