{"files":["/var/www/straped/mufon/html2text/19660.html.txt","/var/www/straped/mufon/org/19660.html"],"Object Shape":"Unknown","Region":"New Hampshire","Tags":"City","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"09/28/2009 07:18 UTC","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.045996,+-71.176675(19660)&iwloc=A&hl=en\"> mufon case (19660) map </A>","Date Submitted":"09/26/2009 07:37 UTC","Object Flight Path":"Undisclosed","Longitude":"-71.176675","City":"Raymond","Latitude":"43.045996","Disposition":"Hoax","Log Number":"US-09262009-0010","Case Number":"19660","Summary":"Bright ball, whitish-blue light","trends":["There have been 2 other sightings in Raymond","There were no other sightings in Raymond on or around September 28th 2009"],"Weather Factors":"None","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI live on a lake and was looking at the geese fly in moments ago and then it happened. A bright, like big meteor came into my vision from the NW and then it almost faded away(8-10 sec). Suddenly it became brighter and appeared to slow down. I saw no blinking lights and it appeared to (sway) a little. ( I was in the army, this thing didn't move like anything I have ever seen before. I know it wasn't a plane sat ect, it appeared kind of oval shaped and had some size to it. the object stayed pretty high up but you could tell it was big 747+! The movement of it as it slowed across the sky was fluid-like ( weird ). All that happened in 40 seconds and I ran inside my home to retrieve the camera and my woman. We went out and it slowly came into view above our yard, she sawit, I saw it. We watched for about a minute before it left our field of view. It left us both with a pretty strange feeling and were both easy going open-minded individuals. I apologize I am not the best typist. I just thought you guys should know. Maybe someone else witnesses it, who knows. Keep up the quest guys. J"]}