{"Longitude":"-94.444878","Log Number":"US-09262009-0013","Date Submitted":"09/26/2009 10:33 UTC","Tags":"City","City":"Gravette","Region":"Arkansas","Object Flight Path":"Straight-line path","Source":"MUFON","Latitude":"36.429911","Disposition":"IFO","Summary":"Bright Moving Object","files":["/var/www/straped/mufon/html2text/19663.html.txt","/var/www/straped/mufon/org/19663.html"],"Date of the Event":"09/26/2009 07:45 UTC","Object Shape":"Star-like","Country":"United States","Object Features":"Unknown","divs":["Sighting DetailsI was standing in our front yard in the dark, walking my dog. I always make it a habit to look into the night sky, especially when there are stars visable. I saw a moving object, just a continuous bright white object moving through the sky at a constant rate. Infact, the bright white object looked exactely like Saturn in the night sky...the exact same, but since saturn was out in the night sky and very bright at this time of year and not too far from the actual moving object, I know it wasn't saturn. My thought was that it looked like a moving star because it didn't flicker or blink at all. I questioned myself about it being a satelite and though it could have been, I don't think so because the object was way too bright and looked to be closer to the surface of the planet then satelites usually get when they fly by up in the sky. The object made it's appearence from a northwesterly to a southeasterly direction, never changing speed or direction the whole time I saw it. I called my husband outside and after the second time of calling him, he came out and looked at the object flying by, we both watched it travel through the night sky towards a southeastern direction. It stayed the same constant bright white light the whole 2 minutes or so that I saw it, no blinking light of any kind and no sound of any kind. Just as it appeared to be heading out of sight beyond the tree line, before it disappeared...the bright white light went out (before it reached the tree line). I said to my husband, \"It's disappearing\", and he replied, \"Yeah, I see that\". We both kept our eye in that spot until we felt it was gone and both of us made mention how strange it was. He is 49 and I am 43 and neither of us has ever seen lights in the night sky quite like that. The whole thing lasted roughly about 2 minutes. Unless they make aircraft that fly at night without a blinking light of some kind, but which show a steady white light on it's underbelly that no matter which direction you see it from, shines brightly, then this was no air plane. And, I saw the light come from the tree line and fly ovwer head until it's light just faded out before it hit the other tree line and usually with air planes the headlight will disappear when it moves position and as well, some kind of blinking light are revealed as it travels on...but there was nothing but a constant bright white light that went out before it hit the tree line. Later, I went out again and saw three high flying sircraft or satelites and two air planes with their red blinking lights, so whatever it was, it wasn't like anything else that's usually in our night sky."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 2 other sightings in Gravette","There were no other sightings in Gravette on or around September 26th 2009"],"Case Number":"19663","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.429911,+-94.444878(19663)&iwloc=A&hl=en\"> mufon case (19663) map </A>"}