{"Date of the Event":"09/26/2009 11:30 UTC","Viewing Distance":"Unknown","Latitude":"48.301886","files":["/var/www/straped/mufon/html2text/19668.html.txt","/var/www/straped/mufon/more/19668_submitter_file1__picture1.JPG","/var/www/straped/mufon/more/19668_submitter_file2__Picture2.JPG","/var/www/straped/mufon/org/19668.html"],"Date Submitted":"09/27/2009 03:56 UTC","City":"Oak Harbor","divs":["Sighting DetailsWent outside to get something out of the car. I am an amateur in astronomy but noticed an object that was the size of a star but changing colors very quickly. Didn't really care and finished what I was doing then looked again and notice it had move just a tiny bit but not in alignment with the other stars. Pulled out my telescope (Celestron CR-150 HD) to have a look. I assumed it was an airplane. When I looked through the scope and resolved on the target it was shocking. It was a ring of smaller lights with large flashes of light (kinda like lightning) shooting between the ring of lights. I have seen aircraft many times though the scope but never anything like this. There was no detail of aircraft surfaces or structure. The object apeared to be a perfect circle. It was very far away and was not really that significant against the background constellation unless you knew the constellation. I tried to get as many photos and video as possible but my camera isn't great at night and under very dark settings. The target was ~265 degrees at about 10 - 20 degress elevation. The sky was very clear and the seeing was pretty good. I got a picture of Jupiter to compare if you want it. I don't know if it would help or not. 1) At home, unpacking the car after a camping trip. 2) It isn't normally there. 3) Airplane or satellite 4) It didn't move fast at all but it didn't move with the stars around it. It was moving slightly faster and on a different course. 5) I was pretty shocked and awed since I never seen a UFO and don't believe in Aliens. 6) I was trying to get a good shot through the telescope so I was focusing on trying to get the picture more clear when I looks back and it was gone. The sky was still very visible and no clouds were anywhere near that area. End All: It was an extra star in the night sky I didn't recognize and it was a circle of lights with considerable \"lightning\" cris crossing from star to star though the circle. Picture 1: The object photographed through telescope. Picture 2: The night sky it was in. Video 1: The object in the telescope. This was the best captures I have of the object. If it is slower and cleaned up a bit you can see what I was talking about."],"trends":["There have been 8 other sightings in Oak Harbor","There were no other sightings in Oak Harbor on or around September 26th 2009","This sighting has never been favorited.",""],"Longitude":"-122.635384","map":"<A HREF = \"http://maps.google.com/maps?q=48.301886,+-122.635384(19668)&iwloc=A&hl=en\"> mufon case (19668) map </A>","Object Features":"Undisclosed","Region":"Washington","Log Number":"US-09272009-0003","Weather Factors":"Unknown","Source":"MUFON","Summary":"Distant object in sky out of place. Looked with telescope and found it was not a star.","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Sphere","Case Number":"19668","Object Flight Path":"Undisclosed","Disposition":"Unknown"}