{"divs":["Sighting DetailsI live in a wooded area between the town of Sterlington and the community ofSpencer, Louisiana. The other night I walked outside for a breath of fresh airit has been raining a lot here and I caught a break in the rain to walk outsideI happened to notice that the clouds were lighter and I could see some stars. When I looked to the N-NE, across the Ouachita River toward Morehouse parish, Isaw a round star-like light moving slowly back and forth at about 30 degreesabove the horizon. The light was white and steady, not pulsatingfrom time to time the light would show a hint of red. I could see it between abreak in the trees. It would hover more or less still for a while, and thenmove to the right or left. Occasionally it would move faster upward or downwardat a 90 degree angle. It also would make little, tight circles. I first saw itabout 800pm and watched it for fifteen or twenty minuntes. I went inside for awhile and came back out around 930 and watched it for a few more minutes. I didnotice there seemed to be a jet in the sky making large circles at a much higheraltitude. I went back inside and went to bed. I dont know if it could havebeen some sort of weather baloonit did kind of remind me of a baloon the way it just floated around making nonoticeable sound. It did not behave like a jet, a helicopter, or an airplane."],"Tags":"City","Country":"United States","Region":"Louisiana","City":"Sterlington","Object Shape":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Weather Factors":"Rain","Latitude":"32.695648","files":["/var/www/straped/mufon/html2text/1967.html.txt","/var/www/straped/mufon/org/1967.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.695648,+-92.084194(1967)&iwloc=A&hl=en\"> mufon case (1967) map </A>","Case Number":"1967","Date of the Event":"11/02/2002 08:00 UTC","Longitude":"-92.084194","Summary":"Bright Light Floating in Louisiana Night Sky","Object Features":"Undisclosed","Log Number":"","Disposition":"Insufficient Data","Date Submitted":"11/02/2002 08:00 UTC","Object Flight Path":"Other,Unknown","Sighting Duration":"01:59:00","trends":["There has been one other sighting in Sterlington","There were no other sightings in Sterlington on or around November 2nd 2002"]}