{"divs":["Sighting DetailsI have today been Sitting in the garden at my girlfriends house as the weather is nice and had been looking at various planes circling for Heathrow over past few hours with my 8 x 40 binoculars, while she was reading a book. No I am not a spotter but was just bored. Anyway, I went to put the garden chair away as the sun was sinkin lower in the sky and we were losing the sunlight and had a last look up to spot any planes but saw a stationary disc or sphere in the blue sky that was reflecting the sun brightly, so then looked with binoculars and could see a craft that looked first like a half see throgh (fluorecent) and half metal object but as it was so high I couldnt focus right in on it.Hard to explain but with naked eye it was definitely a ball or sphere. I Called my girlfriend to have a look and she saw it to. She thought there was a few balls spheres or discs close together. Then while she was still lookin at it ,I could see with the naked eye that it had gone from stationary to the other side of the sky across the neighbours house in 5 0r 6 seconds. I know from watching aircraft occasionaly that it would take a cruising plane at 30, 000 feet + some 1 minute to cover, so that means it was awesome in speed and it was definitely 40,000 + feet up. The poor girlfriend was sayin where has it gone while it was probably several miles away!Wish we had more time to view it. A weird sighting it was. Yes I am a believer but I have never seen any object move like that or at such height!"],"Object Shape":"Disc, Oval, Sphere","Tags":"City","files":["/var/www/straped/mufon/html2text/19671.html.txt","/var/www/straped/mufon/org/19671.html"],"Disposition":"Unresolved","Summary":"Silver sphere or ball, stationary and high, then shot off at immense speed","Source":"MUFON","Longitude":"0.248894","Date of the Event":"09/27/2009 03:40 UTC","Country":"United Kingdom","Object Flight Path":"Stationary,Hovering then path","Date Submitted":"09/27/2009 11:30 UTC","Object Features":"Unknown","Sighting Duration":"00:02:30","City":"Upminster, Essex","Latitude":"51.555914","trends":["There have been no other sightings in Upminster, Essex","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.555914,+0.248894(19671)&iwloc=A&hl=en\"> mufon case (19671) map </A>","Weather Factors":"Unknown","Case Number":"19671","Region":"England","Log Number":"GB-09272009-0006","Viewing Distance":"Over One Mile"}