{"Disposition":"Unknown","Latitude":"34.873252","Log Number":"US-09272009-0013","files":["/var/www/straped/mufon/html2text/19678.html.txt","/var/www/straped/mufon/org/19678.html"],"Viewing Distance":"Unknown","City":"Blue Ridge","Date Submitted":"09/27/2009 06:38 UTC","Source":"MUFON","divs":["sighting detailshey guy's. i will say, this is my first encounter. i was standing at my kitchen sink fixing mom's breakfast when i looked up and something in the sky caught my eye. i looked and said \"what is that\" and then said \"no way\" so i went out the back door to spot it to see if there was any sound...no sound, so i went back in, grabbed my binoculars, went back out and got a good look at my first ufo. isn't it funny how when something like this happens your camera isn't right beside you. i watched it for approximately 1 1\\2 to 2 minutes, gliding saliently across the sky just below the clouds. it started getting behind my roof so i repositioned myself to watch it more. i was too shaky to see it so i repositioned myself again against my gas grill, but it disappeared. that's my story. would you please let me know if anyone else reports something near my location. thanks a bunch. ( \"an avid sky watcher\") it was approximately 2 inch's long in the binoculars (reference) it was what i would call oblong oval shaped. almost cigar like. it was very shiney and silver in color. traveling south west."],"Summary":"Thin Oval, Shiney, Silvery, Satin Finish","Weather Factors":"Unknown","Country":"United States","Object Features":"Unknown","trends":["There have been 4 other sightings in Blue Ridge","There were no other sightings in Blue Ridge on or around September 27th 2009"],"Region":"Georgia","Tags":"City","Longitude":"-84.322857","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=34.873252,+-84.322857(19678)&iwloc=A&hl=en\"> mufon case (19678) map </A>","Object Flight Path":"Straight-line path","Case Number":"19678","Object Shape":"Oval","Date of the Event":"09/27/2009 10:18 UTC"}