{"Disposition":"IFO","Object Flight Path":"Path with directional change","Longitude":"-92.329112","Sighting Duration":"00:01:00","Region":"Missouri","Date Submitted":"09/27/2009 10:36 UTC","Log Number":"US-09272009-0005","Object Shape":"Saturn-like, Star-like","Case Number":"19670","Latitude":"38.952865","City":"Columbia","Source":"MUFON","Tags":"City","divs":["Sighting DetailsMy wife, two daughters (Madison and Jade) and I were at a girl scout event Saturday night just outside of Columbia. The function was being held at the University Of Missroui's Bradford Farms. It is an annual event which includes roasting hot dogs and walking through a corn maze with flashlights. We walked to the corn maze and entered it as a family with a friend (Noni) who has a child in the same scouting troop. As we were trying to find our way through the maze, my wife looked up and saw what at first we thought was a satelite. I am an amature astronomer so we have looked for and seen many iridium flares. At first we thought, \"oh wow, we just caught one by accident\". We watched it waiting for it to fade out as they do, but it never did. I also noticed how much brighter it was compared to other satelites I have seen. The light seemed to give off points as in the star on top of a christmas tree. The points at the top and sides of equal length and the points at the ene, ese, wnw and wsw point a little shorter. This may have been a trick of light, but it was something that I took note of. The friend that was with us said it must be an airplane and I stated that it had no flashing lights, red or white as seen on normal air craft. I was in the air force and have seen hundreds of different air craft, if not more. This did not look like any terrestrial air craft I have ever see. Then she said I can here an air plane. We then noticed an air plane flying over us and yes we could hear it. It gave us a perfect contrast to what we were seeing. The plane had visible lights flashing and we could hear engine noise. The bright white light had no flashing light and made no audible noise. Another characteristic was that it seemed to meander through the sky. Not a straight line. Like it was taking it's time. It was heading from the west north west to the east south east direction and flew directly over the top of us. I would estimate it's altitude at roughly 3,000 to 5,000 feet. Maybe lower. The contrasting airplane we saw seemed to be higher than the object. After we watched it go out of sight we continued to walk through the maze and returned to where the others were. We could see Jupiter in the night sky to the south and this object seemed to be a little brighter than that. About a half an hour later a helicopter flew by making noise and again show visible flashing lights giving us one more example of what it definately was not. This has been my third sighting in the last 2-3 years of something that I could not identify. Two were lights at night and my first was a daytime sighting."],"Date of the Event":"09/26/2009 07:30 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19670.html.txt","/var/www/straped/mufon/more/19670_submitter_file1__UFO092609.jpg","/var/www/straped/mufon/org/19670.html"],"Summary":"Bright Light moving quickly across the night sky","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.952865,+-92.329112(19670)&iwloc=A&hl=en\"> mufon case (19670) map </A>","Country":"United States","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around September 26th 2009","This sighting has never been favorited.",""],"Weather Factors":"None"}