{"Sighting Duration":"Undisclosed","Object Features":"Unknown","Date of the Event":"09/12/2009 12:00 UTC","Object Shape":"Flash, Unknown","Longitude":"-104.699806","trends":["There have been 11 other sightings in Fountain","There were no other sightings in Fountain on or around September 12th 2009"],"Viewing Distance":"Over One Mile","Case Number":"19673","Latitude":"38.686669","Source":"MUFON","Summary":"Bright Light high speed dimming and changing directions.","Date Submitted":"09/27/2009 11:53 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.686669,+-104.699806(19673)&iwloc=A&hl=en\"> mufon case (19673) map </A>","Weather Factors":"None","Tags":"City","Object Flight Path":"Path with directional change","Disposition":"Unresolved","Log Number":"US-09272009-0008","divs":["Sighting DetailsI cannot remember the exact date of the event, but it was approximately 9:00 pm and the moon was at about the 10:00 position in the southeastern evening sky. I was sitting on my back porch relaxing smoking a cigar. No alcohol or drugs were being used whatsoever. I was looking towards the moon and from directly above my head at a considerable altitude, I saw a bright white light that was moving from the northwest to the southeast which appeared to be going at a significant speed. The object did not have any tail or stream. It went from an extreme bright light to a dim light which I could barely see because of the light of the moon. When it went dim, it took a sharp \"right\" turn towards the south. I watched as long as I could until it disappeared. At first I thought it may be a satellite, but I have never seen a satellite be extremely bright, turn dim, and change direction. I am 44 years old and have never seen a UFO in my life. I have always believed in the possibility of UFOs. I am retired Air Force and am very familiar with common aircraft movements and lighting in the night sky. I have never seen such a thing before."],"Country":"United States","Region":"Colorado","files":["/var/www/straped/mufon/html2text/19673.html.txt","/var/www/straped/mufon/org/19673.html"],"City":"Fountain"}