{"Disposition":"Unknown","Longitude":"-97.757134","map":"<A HREF = \"http://maps.google.com/maps?q=35.515432,+-97.757134(19685)&iwloc=A&hl=en\"> mufon case (19685) map </A>","Case Number":"19685","files":["/var/www/straped/mufon/html2text/19685.html.txt","/var/www/straped/mufon/org/19685.html"],"Date Submitted":"09/27/2009 09:52 UTC","Date of the Event":"09/27/2009 08:10 UTC","Region":"Oklahoma","Weather Factors":"Unknown","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Tags":"City","divs":["Sighting DetailsI went to my backyard to take my dogs outside and was looking at the sky when I noticed a very bright starlike light coming toward the house. At first I thought it may be a small plane, but realized it was silent and there were no flashing lights on it. As it got closer I ran into the house and got my husband to go out to the front yard to look and see what I was seeing. We both watched it quietly go over the house traveling slower than a jet would but faster than a small plane would go. It slowly got smaller as it traveled away from us and then it suddently disappeared either into a cloud (slightly hazy night) or it blinked out. The entire event probably took about 5 minutes. It may have been about 1500 feet in the sky. We have skywatching equipment and watch the skies as often as we can, but really didnt have enough time to get out the night vision monoculars. We both are MUFON investigators and feel we were watching a UFO. Other than unusual lights and shapes using our night vision equipment my husband has never seen a UFO real and upclose. I have seen 4 other sightings in the past and each time they did things that I felt wasnt a part of our technology."],"Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Log Number":"US-09272009-0020","trends":["There have been 6 other sightings in Yukon","There were no other sightings in Yukon on or around September 27th 2009"],"Object Shape":"Star-like","Summary":"Bright light going going northwest to southeast single bright light, no sound","City":"Yukon","Latitude":"35.515432"}