{"Latitude":"33.451717","map":"<A HREF = \"http://maps.google.com/maps?q=33.451717,+-112.072847(19689)&iwloc=A&hl=en\"> mufon case (19689) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/19689.html.txt","/var/www/straped/mufon/org/19689.html"],"Date Submitted":"09/28/2009 01:24 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-09282009-0002","Country":"United States","Weather Factors":"None","Disposition":"Unknown","Summary":"Blimp/disk with rotating lights low altitude southbound above I-17 at Bell Rd","Date of the Event":"09/27/2009 08:55 UTC","Region":"Arizona","divs":["Sighting DetailsMy mother and I were driving home from my grandmother's house just before 9:00 PM Sunday Sept. 27, 2009 when I noticed something in the air travelling on a nearly parallel couse with us in the general direction of \"11 O'Clock\". I asked my mom (who was driving the car) to look at it. We both noticed lights (yellowish-white in color) that appeared to be flashing in a rotating pattern around the object (which was dark and hard to see;but appeared to be blimp or disk shaped). For a moment, all of the lights lit up at once in a 'solid' belt around the object. The lights began flashing again as the object continued its slow course. This pattern repeated about every three seconds or so. I estimate it happened about ten times; maybe more... The object continued to move along the I-17 corridor at low altitude (about the same or lower than some helicopter traffic I've seen in the area). The object appeared to be very slow compared to an any aircraft I've seen around this area as well. We continued our trip home and also continued to watch the object. Upon arriving home, I went in my house to get my dad and a pair of binoculars; but when we went outside the object was gone. I had a hard time understanding how something moving so slow could disappear that fast. My dad and I scanned the sky for a few minutes; but didn't see anything else unusual. We decided to report the incident; but think it may be possible that the object was a 'blimp'. My mom disagrees and thinks it wasn't a blimp; but says she doesn't have any explanation for what it could be. My dad did not see the object."],"Longitude":"-112.072847","Sighting Duration":"00:03:00","Object Shape":"Blimp, Disc","Case Number":"19689","Object Flight Path":"Straight-line path","Source":"MUFON","Object Features":"Unknown","City":"Phoenix","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around September 27th 2009"]}