{"City":"Bluefield","Weather Factors":"Unknown","Case Number":"19681","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.27419,+-81.22118(19681)&iwloc=A&hl=en\"> mufon case (19681) map </A>","divs":["Sighting DetailsAt approximately 11:30pm; I felt a sudden and striking urge to go outside onto the side deck of Hooligans Pub and look up at the stars. This I frequently do to flex my minor in astro-physics. I sat on top of one of the wooden outdoor picnic tables and was instantly drawn to a vertically compressed and horizontally stretched smallish \"U\" letter shaped cloud. The sky was mostly clear; this was one of a handful of small visible clouds that particular night. I stared at it for about 1-2 minutes. No more than 120 seconds. Right around the 120 second mark, I was wondering why I was so deliberately staring at this smallish cloud. Then suddenly two glowing light-blue; what I can only describe as blue-nozzles ignited and burned for about 10-20 seconds. Then whatever it was jumped and was gone. As if it was building up some version of critical velocity. Instantly it vanished through the small \"U\" shaped cloud. I never saw the body of the object. I used the hand-method to estimate that it was about 10 degrees in apparent aperture. (per nozzle I mean) The object was sighted close to due East. Call it about an 80 degree azimuth measured from the North. Just short of 3'oclock; or just left and above one of the local radio booster beacons. It was on a declination of about 30 degrees or so, though a background hill obscured my true line of sight. 3. The description of \"nozzle\" that I am using is analogous to something of terrestrial origin. Though even the hand method confirms that said nozzles (2) were much wider than the Saturn Rocket or any Soviet or NASA heavy-lifting traditional chemical propulsion system. The possibility of an X (eXperimental) or skunkworks sighting has occurred to me as well. 4. Motion appeared to be perfectly linear or along a straight line out of my line of sight. 5. I felt exhilarated. My third U.F.O. sighted. This one I was unable to debunk. (one of the other three was completely explained) 6. Hmmmm, my best take is that whatever it was nearly instantly accelerated away so far that it was gone in a second or so."],"Latitude":"37.27419","Source":"MUFON","Object Features":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path","Region":"West Virginia","Longitude":"-81.22118","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/19681.html.txt","/var/www/straped/mufon/org/19681.html"],"trends":["There has been one other sighting in Bluefield","There were no other sightings in Bluefield on or around September 8th 2009"],"Viewing Distance":"Over One Mile","Date of the Event":"09/08/2009 11:30 UTC","Date Submitted":"09/27/2009 08:17 UTC","Sighting Duration":"00:02:00","Summary":"Twin nozzle looking U.F.O.","Log Number":"US-09272009-0016","Tags":"City"}