{"Date Submitted":"09/28/2009 12:17 UTC","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Region":"California","Weather Factors":"Unknown","Source":"MUFON","Longitude":"-116.956025","divs":["Sighting DetailsI was outside throwing the football around by myself. About 10 minutes later i notice a star like object next to a mountain. I watched for awhile as it slowly moved to the west getting dimmer and dimmer. I know its not a plane because theyre was a plane about as far out as the object that i could see blinking the UFO wasn't blinking. I watched it slowly about 45 seconds before it dissapeared behind the treeline i ran inside to get a camera. After 3o seconds i ran out back out side without the camera(couldn't find it) and it was gone. My brother had ran out with me but it was gone. I think it might have got so far away it wasn't visible or it disspeared under the treeline. During the event everything was completely silent. 1. I was outside throwing my football to myself. 2. I noticed the object as i was throwing the football around. 3. I thought it was a star or planet. 4. It was a bright white light that slowly moved to the west getting dimmer and dimmer. 5. My feelings were what the heck is this, and i'd better get a camera, and afterwards i was disspaointed it was gone. 6. I lost sight because it either got so dim it wasn't vivsible anymore or it dissapeared behind the treeline."],"Log Number":"US-09282009-0001","files":["/var/www/straped/mufon/html2text/19688.html.txt","/var/www/straped/mufon/org/19688.html"],"Sighting Duration":"Undisclosed","Date of the Event":"09/27/2009 09:03 UTC","Disposition":"IFO","Case Number":"19688","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.787078,+-116.956025(19688)&iwloc=A&hl=en\"> mufon case (19688) map </A>","Country":"United States","Tags":"City","Object Flight Path":"Straight-line path","City":"San Jacinto","trends":["There have been 6 other sightings in San Jacinto","There were no other sightings in San Jacinto on or around September 27th 2009"],"Latitude":"33.787078","Summary":"Ball of light, Slowly moving to the west getting dimmer and dimmer."}