{"divs":["Sighting DetailsThis was on the last day of school May 1984.My parents had spent the week packing the travel trailer to go to San Diego to help out my Grand Parents.So my Brother and I decided to ride our dirt bikes and were going through the check list of things we both asked of each other.I had to stay cause of summer school and I hoped of spending the fourth through the rest of the summer in California.So we started South on Lovelake rd. and croseed the cattle guard between our land and Ralph H. jr and Leonard M. property(The road was gravel back then).We saw Ralph in his apple tree orchard and tending to his potatos that he had tried to grow that summer.All of a sudden I got a real creepy feeling worse than the ghosts I've encountered and I had gone from feeling great that vacation had started to dread like I was going to die.I looked up the road and down and saw no cars and I stopped my Brother and we sat their on our bikes for a while looking around, when I spotted a cigar shaped object a mile away and about a thousand feet to a thousand five hundred in the air.We thought it was a plane or jet liner but after ten minutes it was not getting any closer and now we could detect heat waves coming off of it whenever it moved left to right or went up or down I told my Brother I thought it was a U.F.O. He watched for a while before saying he agreed.Our neighbor Ralph looked where we were looking and watched for a while and yelled at us that he thought it was a plane.We ignored him and what he said cause now about twnety minutes elapsed and the damn thing still was bearly moving from it's original position.At this time I really had a sick feeling to my stomach but I could not stop watching it.It was about four-thirty then and a jet liner was approaching from the East and heading West and the skies were clear and no wind.It suddenly disappeared I looked South toward the White Mountains toward Sunrise which is visible from our house.I spotted what seemed to be a rectangeler mirror reflecting the sun light.Once the jet liner had cleared the area the object returned,by now I estimated the size to be about thirty feet in diameter and about twelve to fifteen feet thick and was a dark gray (It looked like two saucers put lip to lip)but when it would shoot off it looked like it was reflecting the sun light.It started to go up and down and circle some place I would guess was East of Snowflake.Now a small plane approached from the west from the Taylor airport (about the same height as the object and heading toward St. Johns)) once again the object shot off (I never did see it till it was over Sunrise where it seemed to be brighter) once the small plane was gone it returned and continued in that same pattern for the next hour.At about five-thirty we headed to the house and told my Mom who got a friend to bring the binoculars and we watched as a jet liner appeared from the east again and the U.F.O. silently followed it while gaining altitude up behind it and followeed it into a dark cloud the jet liner emerged but the saucer did not.All the grown ups involved in this said it was a plane but they did not watch it like me and my Brother for two hours.Plus the bad vibe I got from this thing was real bad.It's still is the most amazing thing I've ever seen! My Father arrived about five minutes later and he usually arrived home at Six P.M.."],"Weather Factors":"Unknown","Date of the Event":"05/25/1984 04:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Country":"United States","Disposition":"Unknown","City":"Taylor","files":["/var/www/straped/mufon/html2text/19693.html.txt","/var/www/straped/mufon/org/19693.html"],"Object Shape":"Cigar, Disc, Square, Rectagular","Summary":"Daylight sighting near Taylor, Arizona.","Viewing Distance":"Over One Mile","Date Submitted":"09/28/2009 01:49 UTC","Latitude":"34.465037","Sighting Duration":"02:00:00","Source":"MUFON","trends":["There has been one other sighting in Taylor","There were no other sightings in Taylor on or around May 25th 1984"],"Log Number":"US-09282009-0005","Tags":"City","Object Features":"Dome","Longitude":"-110.091226","Region":"Arizona","Case Number":"19693","map":"<A HREF = \"http://maps.google.com/maps?q=34.465037,+-110.091226(19693)&iwloc=A&hl=en\"> mufon case (19693) map </A>"}