{"Summary":"Unknown object moving through nightime sky","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-80.045795","files":["/var/www/straped/mufon/html2text/19695.html.txt","/var/www/straped/mufon/org/19695.html"],"trends":["There have been 27 other sightings in West Palm Beach","There was one other sighting in West Palm Beach on or around September 28th 2009"],"City":"West Palm Beach","Log Number":"US-09282009-0008","Latitude":"26.722242","Disposition":"Insufficient Data","Source":"MUFON","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Country":"United States","Region":"Florida","Date Submitted":"09/28/2009 02:43 UTC","Date of the Event":"09/28/2009 02:05 UTC","Case Number":"19695","Object Features":"None","Tags":"City","Object Shape":"Bullet, Missile, Oval, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=26.722242,+-80.045795(19695)&iwloc=A&hl=en\"> mufon case (19695) map </A>","divs":["Sighting DetailsOkay so the second one this year... crazy. I was in bed and about to go to sleep when my cat bothered me to feed her. So I got up and fed the cat, and went outside for a smoke. Almost as soon as I lit my cigarette I looked up at the stars and noticed one was moving. It looked as though it were a star at first then I noticed an oblong shape to it. I carefully watched to see if there were any flashing lights on it but there were none. I listened for it, but there was no sound whatsoever. I watched for a few seconds as it headed south. It couldv'e been anything... was my initial response, there was nothing special about it, until it kind of veered to the right, then backwards and then back on course. Freaky. If you ask me, whatever these things may be know more than we do. I swear each time I have wittnessed this occurence it was almost as though they saw me looking and wanted to make their presence known by manuevering in some odd manner. My heart raced as I watch this phenomenon, but something in me told me that everything was okay. Crazy crazy crazy, thats all I can say. The funny thing is that this object flew very near, if not right over a major airport near me, they had to have seen something. I was unable to get any photos, even if I had a camera it was way to far to pick it up."]}