{"Case Number":"19699","Log Number":"US-09282009-0012","Latitude":"42.462536","Date of the Event":"08/01/2007 12:00 UTC","Tags":"City","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.462536,+-83.104091(19699)&iwloc=A&hl=en\"> mufon case (19699) map </A>","City":"Hazel Park","divs":["Sighting Details Me and my wife were on our way to my parents house. Driving south, I noticed a bright red light motionless in the sky. I pointed it out to my wife, who also seen the object. It took approximately ten minutes to drive to my parents, and we visited for roughly a half an hour. Leaving their house, I noticed the object was still visible, and in the same location. I decided that if it was still there by the time we got home, I would take my camera and try to get a photo. Arriving home, I ran into the house and grabbed my camera. By this time the object had been in the sky, and in the same location about fifty minutes. I drove west, to a grocery store parking lot, and snapped a couple of photos. I could only get two, because the clouds were rolling in. The photos show what I seen, a bright red light. I have tried to zoom in on the photos, but cannot make out a solid shape. This could just be some sort of light reflecting off of something, I don't know. I would be interested in your opinion."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19699.html.txt","/var/www/straped/mufon/more/19699_submitter_file1__SD530982.JPG","/var/www/straped/mufon/more/19699_submitter_file2__SD530983.JPG","/var/www/straped/mufon/org/19699.html"],"Weather Factors":"Unknown","Longitude":"-83.104091","Source":"MUFON","Object Features":"Unknown","Country":"United States","trends":["There have been no other sightings in Hazel Park","This sighting has never been favorited."],"Date Submitted":"09/28/2009 07:50 UTC","Object Shape":"Square, Rectagular","Summary":"Noticed a red triangular object in the sky, NNW. It was motionless for at least an hour.","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Disposition":"Unknown"}