{"divs":["Sighting Details This UFO was seeing first by my son Andrew whom in turn call my Wife Yolanda and I (Edgardo) to see it. It seems like each one of us saw something similar. Andrew's account: \"a group of starlike objects followed by one large red colored amorphous appearing object. all objects moved across the sky as one then the starlike objects stopped and began moving in different directions\" Yolanda's account: When my son called us, we run to the door and he pointed at the sky, asking: do you see that: what is it? and I saw some bright lights, that I first thought were stars, but soon realized they were moving very fast in a north-east direcction, and behind them was this huge red \"blob\", with an amorphous shape, moving and then seemed to stop right above us, still changing shapes constantly, then the bright lights in front of the \"blob\" for a moment only, seemed to start dancing around it, then, disapeared on top of the roof, continuing in NE direcction. The \"blob\" was red, not bright but it seemed to have its own light, and there were more lights inside it, also not so bright, but we could clearly see them. Then the \"blob\" disapeared in the same direction of the lights. I rushed to the kitchen window at the other side of the house but I did not see the bright lights or the blob anymore. I think we watched this for 90 seconds or so. Edgardo's account: Last Saturday night, in San Pedro California and around 8;15PM. My son,my wife and I saw several groups of lights traveling northbound(only my son saw that), when my wife and I came out the front door the movement was eastward. The main or the largest group was an amorphous figure that look like a transparent net with about seven not so bright red octagonal pieces trapped inside and moving around the net thus making continuous changes to the shape of the figure.It was pretty and geometrical. The other groups were more like single lights following the big Medusa described above."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.737272,+-118.287436(19707)&iwloc=A&hl=en\"> mufon case (19707) map </A>","files":["/var/www/straped/mufon/html2text/19707.html.txt","/var/www/straped/mufon/org/19707.html"],"Longitude":"-118.287436","Case Number":"19707","Date Submitted":"09/28/2009 05:24 UTC","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around September 26th 2009","This sighting has never been favorited.",""],"Latitude":"33.737272","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","City":"Los Angeles","Object Shape":"Star-like","Sighting Duration":"00:02:00","Disposition":"Insufficient Data","Summary":"group of red lights in the sky moving first northbound and then eastward.","Region":"California","Tags":"City","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"09/26/2009 08:15 UTC","Weather Factors":"None","Country":"United States","Object Features":"Unknown","Log Number":"US-09282009-0020"}