{"Object Shape":"Boomerang, Cigar, Cylinder, Fireball, Sphere","files":["/var/www/straped/mufon/html2text/19701.html.txt","/var/www/straped/mufon/org/19701.html"],"divs":["Sighting DetailsI have seen since February of this year on several different occasions strange unidentified objects in the sky at the end of dusk and night. The last occurring 22nd of September. I reported the first object seen to the sheriffs department via the phone. I did not report any of the events after since the first time there was no action taken or any alertness raised by the call. I drew pictures and described the events and dates so I would not forget any important detail to the strange things I have seen. A lot of activity has been happening you need nothing more than wait and watch. They don't appear so frequent or come on specific times to which you can expect them on any given evening. I have had 5 sighting in the last 9 months and each one have been spectacular and defy any knowledge I have a human aviation. The crazy thing about it is I have this internal belief like a subliminal message that they want me to notice them when I see these objects. One more point that I may have failed to mention is that no 2 events have ever been the same they always appear as something different as far as craft type."],"Object Features":"Undisclosed","Region":"Indiana","Sighting Duration":"Undisclosed","Log Number":"US-09282009-0014","Date Submitted":"09/28/2009 11:31 UTC","Disposition":"Insufficient Data","Source":"MUFON","Longitude":"-85.594364","Tags":"City","Date of the Event":"01/31/2009 12:00 UTC","Country":"United States","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","City":"Undisclosed","trends":[],"Summary":"Multiples","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.557836,+-85.594364(19701)&iwloc=A&hl=en\"> mufon case (19701) map </A>","Case Number":"19701","Weather Factors":"Unknown","Latitude":"40.557836"}