{"Case Number":"19712","trends":["There have been 37 other sightings in Fort Lauderdale","There were no other sightings in Fort Lauderdale on or around September 28th 2009"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=26.123628,+-80.136569(19712)&iwloc=A&hl=en\"> mufon case (19712) map </A>","Object Features":"None","Longitude":"-80.136569","Latitude":"26.123628","Region":"Florida","Country":"United States","Object Flight Path":"Undisclosed","divs":["Sighting DetailsIt was 8.05 PM when i was outside with my friend nex house sitting and smoking when my friend told me look this plane it s not suppose to pass this way.cause we are just by the airport amd the runaway go to est-west and no airplane can cross north south or south north it s forbidden. This with light was very bright all around and under not just on the front. We noticed it was moving from NW sky headind SE. It was moving at a steady pace and past just over the Fort Lauderdale airport and crossing the runaway at maybe around 4 or 5000 feet in a steady slow motion size of the object was almost about half size of a regular commercial air line plane. No noise no green light no red light no withe strobe. Someting strange there s normaly always many airplanes around that we can see but during all the time about 3 minutes that this object was passing there was no airplane around son after this object reach this ocean we can see many airplane star to come around again. It was like if they were advise to not come around during the object was passing. Thanks for reading. Jack scott"],"Weather Factors":"None","Sighting Duration":"Undisclosed","City":"Fort Lauderdale","Date Submitted":"09/28/2009 09:20 UTC","Tags":"City","Date of the Event":"09/28/2009 08:05 UTC","Viewing Distance":"Over One Mile","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19712.html.txt","/var/www/straped/mufon/org/19712.html"],"Summary":"White sphare or light ball very bright over Fort Lauderdale Airport","Source":"MUFON","Log Number":"US-09282009-0025"}