{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.530981,+-87.358313(19713)&iwloc=A&hl=en\"> mufon case (19713) map </A>","Object Shape":"Disc","Longitude":"-87.358313","City":"Clarksville","Disposition":"IFO","Summary":"Live Web Cam overlooking Great Lakes-lake Huron","Region":"Tennessee","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"09/28/2009 09:37 UTC","Case Number":"19713","Object Features":"Unknown","trends":["There have been 12 other sightings in Clarksville","There were no other sightings in Clarksville on or around September 13th 2009","This sighting has never been favorited.",""],"Weather Factors":"None","Latitude":"36.530981","Viewing Distance":"Over One Mile","Date of the Event":"09/13/2009 05:38 UTC","Tags":"City","divs":["Sighting DetailsThe event began a few days prior to the live webcam experience at which time browsing through your website I noticed that in the month of September there were a number of ufo sightings in the Great Lake area. This prompted me to limit my live webcam search to the Great Lake area specifically Lake Huron whose live webcam located on the shores of the city of Lexington of Michigan gave me a clear view of the lake. That Sunday afternoon 4:30 in Clarksville and 5:30 Pm in Lexington, MI the weather forecast for that area was clear with sunny skies with a reported temperature of 70 degrees. Like all live webcam cameras this one would refresh every few minutes which showed clear skies and it was in one of those refresh frames that I spotted a white object around the 1 or 2 o'clock position on the image. My first thought that came into mind that was a bird or a plane that was photographed by the camera. Needless to say, I opted to save the image into \"My Pictures\" window media and using the zoom tool it immediately became obvious to me that the white object in the image was not a bird nor of a plane. It appeared to me that this white object had a saucer disc with a faint shadow on the bottom of the object. I am not sure what it is and for this reason I respectively submitt this report for your analysis. Attached is the original downloaded image."],"files":["/var/www/straped/mufon/html2text/19713.html.txt","/var/www/straped/mufon/more/19713_submitter_file1__camera_13.jpg","/var/www/straped/mufon/org/19713.html"],"Object Flight Path":"Unknown","Log Number":"US-09282009-0026"}