{"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/19717.html.txt","/var/www/straped/mufon/org/19717.html"],"divs":["sighting detailsgoing home. at about 9pm central. on zero street in fort\\smith almost in barling. 3 bright orange-white-yellow? lights in a triangle shape appeared above our car about 800 yards in the air approaching from the south. we thought it was a missile or meteor about to hit us. but the object stayed hovering in the air. we were shocked at the brightness of it. and we both wondered out loud \"what is that\". no sound, object lowered and rose and veered off at an angle. continuing to rise the lights turned out. we followed with our eyes approx. where it should be and saw it light up again about a half-mile ahead and higher. it seemed to be tailing two warthogs that were doing night maneuvers at local airbase. we pulled over and never saw the object again. the two warthogs split way off in the distance and circled back towards fort smith. we went home. stayed out side a bit and watched the warthogs do several touch and takeoff maneuvers, but that is all we saw of the triangular lights. flares? craft? the lights came on suddenly, kind of like lights at a baseball field. and seemed to be a solid object that could control itself."],"Weather Factors":"Unknown","Latitude":"35.387274","Tags":"City","Log Number":"US-09282009-0029","Summary":"3 bright lights in triangle shape appeared above car as driving, lowered, and rose and disappeared.","Object Shape":"Triangle","Source":"MUFON","Object Flight Path":"Undisclosed","trends":["There have been 12 other sightings in Fort Smith","There were no other sightings in Fort Smith on or around September 25th 2009"],"Longitude":"-94.389108","Region":"Arkansas","Disposition":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.387274,+-94.389108(19717)&iwloc=A&hl=en\"> mufon case (19717) map </A>","City":"Fort Smith","Date Submitted":"09/28/2009 11:36 UTC","Country":"United States","Case Number":"19717","Date of the Event":"09/25/2009 12:00 UTC","Sighting Duration":"Undisclosed"}