{"Disposition":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Longitude":"-82.318936","files":["/var/www/straped/mufon/html2text/19715.html.txt","/var/www/straped/mufon/org/19715.html"],"Sighting Duration":"Undisclosed","City":"Gainesville","Summary":"White circular light","Log Number":"US-09282009-0028","Latitude":"29.653974","Case Number":"19715","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around September 28th 2009"],"Date of the Event":"09/28/2009 08:00 UTC","divs":["Sighting DetailsWhile taking out the trash I noticed a bright circular light traveling from NW to SE at the speed you might expect a Cessna 172 to travel at about 1,000 feet. I noticed it because it was so bright. What was odd was it appeared so close because of it's size, but was completely silent. It was dark, so I could not correctly assess altitude, but it seemed very close and was about 3 times the size of Jupiter. Jupiture and the Moon appeared to be 45 degrees from the horizon and this craft was approximately 10 degrees SE of Jupiter. When I first saw it I thought it had to be a satellite because it was silent, but it was about 10 times the size of any satellite I've ever seen and was obviously much closer. It traveled in a straight line, but did not curve with the horizon as it continued on its path. Instead of losing sight of it on the horizon or tree tops as I would most aircraft, it continued traveling straight into the clear night sky and disappeared into the sky. It appeared pretty bright until right before it disappearedy, at that point it went from a relatively large circle to a very small dot in a small about of time. Imagine its path like a ruler hovering directly over a basketball - the basketball being the earth and the point at which the craft's path came closest to the earth was mid point on the ruler where I saw it."],"Viewing Distance":"Unknown","Region":"Florida","Source":"MUFON","Object Features":"Undisclosed","Date Submitted":"09/28/2009 10:30 UTC","Object Shape":"Circle","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.653974,+-82.318936(19715)&iwloc=A&hl=en\"> mufon case (19715) map </A>","Weather Factors":"Unknown"}