{"Longitude":"-70.660722","Summary":"Bright silvery-bronze oval shaped craft (not a disc).","map":"<A HREF = \"http://maps.google.com/maps?q=41.962836,+-70.660722(19710)&iwloc=A&hl=en\"> mufon case (19710) map </A>","Tags":"City","Latitude":"41.962836","Country":"United States","trends":["There have been 15 other sightings in Plymouth","There were no other sightings in Plymouth on or around September 20th 2009"],"Disposition":"IFO","Source":"MUFON","Log Number":"US-09282009-0023","Date of the Event":"09/20/2009 12:00 UTC","City":"Plymouth","Date Submitted":"09/28/2009 08:45 UTC","divs":["Sighting DetailsWe were driving south to Cape Cod. My friend was directly behind me on Rt. 3 just outside of Plymouth MA. The sky was gorgeous and clear. I noticed the craft (as described above)at the 1 o'clock position and watched it for a few minutes as it was stationary. I knew it was not a plane from previous experience. I then called my friend on my cell phone to ask if she could see it and agreed it was really there. I continued driving and it blinked out but then showed up again at the 11 o'clock position and only for about a minute and then was gone. My friend witnessed this also and it was her first sighting. I was on vacation and away from computers or I would have written sooner. I spent 52 years in my homestate of Colorado with my last residence in the San Luis Valley. I did witness 3 seperate craft events and had different people with me to validate those sightings. I also found a mutilated cow outside of Hooper in 1996-'97(?) and reported it to Chris O'Brien. One of my photos is on his site. I was very excited to witness this craft here in MA. All previous 3 sightings were disc shaped and this one was different."],"Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Case Number":"19710","Object Shape":"Oval","files":["/var/www/straped/mufon/html2text/19710.html.txt","/var/www/straped/mufon/org/19710.html"],"Weather Factors":"Unknown","Object Features":"Undisclosed","Region":"Massachusetts"}