{"Sighting Duration":"00:00:00","Viewing Distance":"21-100 Feet","Tags":"City","Object Flight Path":"Unknown","Region":"California","Disposition":"Unresolved","Object Shape":"Sphere","Longitude":"-117.939323","Source":"MUFON","Country":"United States","Summary":"orange globe u.f.o. experience in La Habra ca. 1","Case Number":"1972","Weather Factors":"Unknown","Date Submitted":"01/31/1975 08:00 UTC","Latitude":"33.936768","City":"La Habra","divs":["Sighting Details1975 800 p.m. La Habra, california. I was 13 years old and my father hadconverted our detatched garage into a bedroom. the garage was located appx. 20yards from the house in our backyard. I was walking from the house to thegarage with my head down just looking at the ground. about half way between thetwo structures I stopped dead in my tracks. I had an overwhelming feeling that Iwas being watched. Never before or since this incident have I ever had such astrong feeling of dread. I lifted my head and looked out the corner of my eyesnot wanting to turn my head and look directly toward who or what was watchingme. I was frozen with fear. I saw a large house size orange sphere hoveringover a large tree in my neighbors backyard. the instant I looked up at it, theobject emmitted a large plume of steam. The object was totaly silent and beganto ascend in a north east direction. Even at this young age of 13 I feltimmediatly that this craft was under the control of intelligent beings. becauseof the strong feeling that I was being watched and also the feeling that I hadscared them away. Just as the object began to rise I ran as fast as I couldfrom my backyard, through the house, yelling to my family to come outside. I ranout the front door and onto the lawn. This dash through the house could nothave taken more than six seconds. but in that short time the object had risen toseveral thousand feet high. and now appeared to be more oval on shape and hadwhat appeared to be windows across the middle of the object. the objectcontinued to rise as several members of my family and some neighbors watched. my brother and I looked at the object through a pair of binoculars and could seethe windows in more detail. they seemed to be black indentations in the body ofthe object that ran from end to end and parallel to the ground. we observedthe object for appx. 6-8 minutes until it seemed to enter the upper atmosphereif not outer space. It finally just became to faint to see even with thebinoculars. Today I am 40 years old, and can still recall the overwhelmingfeelings of fear, dread and excitement of that night. This incident did not seemto effect the other wittnesses as severely as it has me. they did not have theclose one on one encounter that I had. If the object was a balloon as some havesuggested to me. then why did I have such a strong feeling of being watched Idont know what this was but I will never forget that night."],"Object Features":"Other","Log Number":"","trends":["There have been 4 other sightings in La Habra","There were no other sightings in La Habra on or around January 31st 1975"],"files":["/var/www/straped/mufon/html2text/1972.html.txt","/var/www/straped/mufon/org/1972.html"],"Date of the Event":"01/31/1975 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.936768,+-117.939323(1972)&iwloc=A&hl=en\"> mufon case (1972) map </A>"}