{"Date of the Event":"09/22/2009 08:35 UTC","Object Features":"Unknown","Latitude":"41.328454","Source":"MUFON","Weather Factors":"None","Viewing Distance":"101-500 Feet","trends":["There have been no other sightings in Transfer","This sighting has never been favorited."],"Tags":"City","Object Shape":"Triangle","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19722.html.txt","/var/www/straped/mufon/org/19722.html"],"divs":["Sighting DetailsI was driving up to a stop sign at an intersection out in the country along the border of PA and Ohio, when my passenger and I noticed 2 objects clipping along around 1000 ft AGL. It was 8:35pm. My first thoughts were that the 2 objects were Lifeflight helicopters, because they were a little fast for the altitude and the one was right behind the other. I shut off the radio and put my window down and stopped before the stop sign to hear. They were definitely not helicopters. I noticed the one in front was triangular-shaped with 3 red lights, one on each corner. The one behind it was an airplane. I'm not sure what kind of plane it was, but i could tell it was because of the wingtip lights and the strobe. This plane was (to me and my passenger) obviously in pursuit of the triangular-shaped aircraft. I ran the stop sign to prevent our view from being obstructed by a tree. We could only hear the sound of one plane, the UFO being silent. Ten seconds later, the UFO vanished or \"cloaked\" right in front of our eyes. The airplane kept its course, and we followed it until we lost sight of it because of its speed, and the fact that it was not traveling entirely parallel to the road we were on. We lost it behind the trees. My passenger and I were amazed. This was the first time I had ever seen a UFO. He lives out in the area and has told me he has seen triangular-shaped objects before, none of them ever being quite this convincing to him. I've been skeptical of the times he told me about UFOs, until that evening. I must add, it was dusk, but not entirely dark. We could see the outline of the airplane. We could see the outline of the triangle UFO. I have pilot training. It was definitely something I, myself could not identify. Incredibly odd, nothing short of amazing."],"Summary":"triangular, single red solid light on each corner","map":"<A HREF = \"http://maps.google.com/maps?q=41.328454,+-80.432859(19722)&iwloc=A&hl=en\"> mufon case (19722) map </A>","Case Number":"19722","Sighting Duration":"00:00:20","City":"Transfer","Log Number":"US-09292009-0005","Date Submitted":"09/29/2009 05:02 UTC","Region":"Pennsylvania","Longitude":"-80.432859","Object Flight Path":"Straight-line path,Other","Country":"United States"}