{"Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Disposition":"Unknown","Summary":"Star-like object above 20,000 feet moving rapidly from west to east","Date Submitted":"09/29/2009 04:29 UTC","files":["/var/www/straped/mufon/html2text/19732.html.txt","/var/www/straped/mufon/org/19732.html"],"Tags":"City","Date of the Event":"09/29/2009 06:45 UTC","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=25.796019,+-80.221459(19732)&iwloc=A&hl=en\"> mufon case (19732) map </A>","Longitude":"-80.221459","Object Flight Path":"Straight-line path","trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around September 29th 2009"],"Log Number":"US-09292009-0015","Viewing Distance":"Over One Mile","Latitude":"25.796019","Region":"Florida","Case Number":"19732","Object Features":"Unknown","divs":["Sighting DetailsArriving to work on my motorcycle, I looked up to check out the weather. It was still dark outside although the sun was just comming up and beginning to illuminate the eastern sky. I saw what I thought was a star directly overhead yet it was moving quickly in a straight line in a west to east direction. I thought it might be a satellite or even the space shuttle until another smaller glowing object broke away from the main object and began traveling in a northern direction at a hight rate of speed. The main object continued east at an extremely high altitude and had covered the distance from directly overhead to the eastern horizion in less than 10 seconds! This made me believe that it was no satelite or space shuttle because of the immense speed at which it traveled. As it neared the eastern horizon, it briefly illuminated brightly as if it were metallic and reflecting the rising sun. There was no vapor trail or anything to make me believe it was a jet or shooting star. The smaller object breaking from the main object, both travelling in straight trajectory, and both travelling at extremely high rates of speed made me believe I may have been witnessing some form of experimental aircraft or spacecraft."],"Object Shape":"Star-like, Unknown","City":"Miami"}