{"files":["/var/www/straped/mufon/html2text/19736.html.txt","/var/www/straped/mufon/org/19736.html"],"Object Flight Path":"Stationary","Longitude":"-81.24633","map":"<A HREF = \"http://maps.google.com/maps?q=41.031471,+-81.24633(19736)&iwloc=A&hl=en\"> mufon case (19736) map </A>","Case Number":"19736","Sighting Duration":"01:00:00","Country":"United States","Weather Factors":"Unknown","Region":"Ohio","Tags":"City","Summary":"It was a red, green and white sparkling object in the northeast sky","Source":"MUFON","Object Shape":"Egg, Oval, Star-like","Date of the Event":"09/10/2009 11:30 UTC","divs":["Sighting DetailsI had heard coyotes howling in the woods behind my house at 11:30 P.M. on Thursday, September 10, 2009, and I went out on my deck to investigate. I glanced at the rare, clear northeast Ohio sky and noticed a very bright sparkling object in the northeast sky at least twice as bright as Venus. It was approximately two fists at arms length above the horizon and two fists at arms length on a 30 degree angle to the left of a very bright moon. It looked like a plane with green, red and white flashing lights, but it was a lot brighter than a plane or jet would be. We are near Akron-Canton airport and see many jets coming in for landings. This object stayed stationary in the sky for over 5 minutes. I called my 21 year old son to the deck to see if he could tell what it might be. He suggested I get the binoculars to get a closer look. When I focused the binoculars I could see an undetermined shaped object with sparkling red and white flashing lights across the bottom and a flashing green light on the top. It sort of had an egg shape or oval. The lights were interesting because they seemed to brightly sparkle like a pyrotechnic device and not just blink on and off. The white light would hold for a moment now and then and seem to light the adjacent night sky near the object like a glow. We watched the object for 45 minutes, and then I thought I would call the airport to see if they had anything on radar, but the airport information line was closed. My son called his friend at Hiram college to the north to see if he could see anything unusual, but he reported negatively. My son also called another friend straight east of our location in Atwater (about 4 miles away) and he did not sight anything. My wife (who does NOT believe in UFO's) came to the deck to see what the commotion was all about, and even she questioned what it could be as she looked at it through the binoculars. Later, my son said he thought he saw another faint sparkling object in the binocular frame to the lower left, and sure enough, there was another dim sparkling object similar to the original off in the distance. The space station had orbited at approximately 8:30 P.M. that evening. This object stayed stationary for the hour that we observed it. I finally had to go to bed, but I just wanted to know if there were any other sightings that evening in northeast Ohio."],"trends":["There have been no other sightings in Randolph, Ohio","This sighting has never been favorited."],"Log Number":"US-09292009-0019","Latitude":"41.031471","Object Features":"Unknown","City":"Randolph, Ohio","Date Submitted":"09/29/2009 10:01 UTC","Disposition":"Unknown","Viewing Distance":"Unknown"}