{"Tags":"City","files":["/var/www/straped/mufon/html2text/19739.html.txt","/var/www/straped/mufon/org/19739.html"],"Latitude":"47.479191","trends":["There have been 4 other sightings in Bemidji","There were no other sightings in Bemidji on or around September 25th 2009"],"Longitude":"-94.873508","Object Flight Path":"Straight-line path","Log Number":"US-09302009-0001","Case Number":"19739","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Date Submitted":"09/30/2009 12:18 UTC","Object Shape":"Triangle","Disposition":"Unknown","Object Features":"Undisclosed","divs":["Sighting DetailsI was standing outside my apartment (address listed) at around 10:30pm on the 25th of September, 2009 talking with my neighbor and my room mate. I was facing south and just so happened to look up out of bordom and I noticed the 5 lights passing over coming from the north north west direction and went strait in a southeasterly direction. I made a double take on it before I realized what I looked at was not normal. I then alerted my room mate by yelling \"holy Sh*t! Look at that!\" right before it passed behind a large tree. I was extremely worked up because my room mate missed it so I ran out to the street where the tree wouldnt be blocking the view of the sky in the direction the object was going. When I got out to the street the lights were gone. Size of an object in the sky at night is hard to judge with nothing to compare it to but it may have been very large. A light on a plane is relativly small at night only about compareable to a bright star but these were all large and circular. They were in the formation of a slightly acute triangle, aranged in 3 rows; one in the leading row and 2 in each of the other 2 rows. It was totally silent as is passed, we have planes pass over the apartments all the time and we can hear them even from indoors."],"Viewing Distance":"Unknown","Region":"Minnesota","map":"<A HREF = \"http://maps.google.com/maps?q=47.479191,+-94.873508(19739)&iwloc=A&hl=en\"> mufon case (19739) map </A>","City":"Bemidji","Source":"MUFON","Date of the Event":"09/25/2009 10:30 UTC","Summary":"5 lights in a triange passed over and behind a tree then disapeared"}