{"trends":["There have been 3 other sightings in Columbia","There were no other sightings in Columbia on or around September 26th 2009","This sighting has never been favorited.",""],"Region":"Kentucky","Sighting Duration":"00:00:02","Object Shape":"Oval","City":"Columbia","Longitude":"-85.30635","map":"<A HREF = \"http://maps.google.com/maps?q=37.102841,+-85.30635(19738)&iwloc=A&hl=en\"> mufon case (19738) map </A>","Date Submitted":"09/29/2009 10:54 UTC","Log Number":"US-09292009-0021","Object Features":"Unknown","Latitude":"37.102841","Date of the Event":"09/26/2009 05:14 UTC","divs":["sighting detailsthis past saturday afternoon, it had rained most of the day, and shortly after 5:00pm (cdt), the clouds started to break. my wife noticed a rainbow as she looked out the front (east) of the house. i walked outside to see it closer, and was able to see the \"end\" of the rainbow in the field across the street. i called for her to bring her camera (which we didn't have on us), so she took a couple of pictures with her blackberry. when she started to look at the first picture she took, she noticed an unidentified image right above the treeline (to the left of the rainbow) that neither of us saw when she took the picture. the second picture she took (immediately after the first picture) did not show that image. ironically, no more than 15 minutes later, we heard a jet\\jets in the distance. this is in a part of kentucky where it's rare to see (or hear) any kind of aircraft in the sky. we're having a hard time determining what this object is. just kind of eerie."],"Disposition":"Unknown","Country":"United States","Tags":"City","Source":"MUFON","Case Number":"19738","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19738.html.txt","/var/www/straped/mufon/more/19738_submitter_file1__Rainbow.IMG000151.jpg","/var/www/straped/mufon/org/19738.html"],"Object Flight Path":"Unknown","Weather Factors":"Rain, Light","Summary":"Unknown object appears in picture."}