{"Object Features":"None","Disposition":"IFO","Weather Factors":"None","Date of the Event":"12/12/1998 10:15 UTC","trends":["There have been 8 other sightings in Fernandina Beach","There were no other sightings in Fernandina Beach on or around December 12th 1998"],"Tags":"City","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was visiting my friend Julie, who lived in Fernandina Beach, FL, at the time. Her condo was located across the street from the beach so instead of going to bed I went to sit on the beach as it was unseasonably warm and there was no moon that evening and given Fernandina Beach is 30 miles north of Jacksonville, there was hardly any light pollution making the stars seem brighter than I'd seen them in a long time having lived in a large city for so long. A few minutes after sitting down and gazing east at all the stars over the ocean, something unusual caught my eye. Over the sea - I estimate it was approximately 1 mile away (it seemed to be above some fishing boats moored off-shore) and about 35-40 degrees above the horizon, was something that resembled a 55 gallon drum (not so long as to qualify as a cylinder - but it was the only shape that fit) shaped object having alternating red and blue lights studded on it, slowly rotating counter-clockwise. Of course, at first I thought it was a satellite, but as I watched, it started moving up, down and around enough to indicate it was not a satellite. Still scanning the sky, I spotted another object exactly like the first - north of it, except this one was a bit smaller or perhaps further out, I don't know. The objects were spaced just far enough apart that I couldn't watch them together. After approx. 15 minutes, I returned to the condo to get Julie so she could come witness these objects with me and to see what, if anything, they would do. At about 11:30, the smaller UFO to the north disappeared when we were not looking so we concentrated on the larger object. Finally, a little after 1 a.m., the object started rotating faster and faster until the blue and red lights became a blur of purple. The purple light then got brighter and brighter in color until before our very eyes - it turned into a star!! I was dumbfounded. I asked Julie, \"Did you just see that UFO turn into a star?\" \"Yes,\" she said. The UFO turning into the star took less than a minute. The crazy thing was this thing now looked exactly like all the other stars in the universe and I've never looked at stars the same way since always wondering, \"Are you really a star?\" Too, when I got back to work at the law-firm on Monday, I related my experience to an attorney I worked with and she said she'd seen something similar happen in Florida years earlier, whereby a UFO turned into a star. Unfortunately, my camera would have never picked up on this object."],"files":["/var/www/straped/mufon/html2text/19749.html.txt","/var/www/straped/mufon/org/19749.html"],"Date Submitted":"09/30/2009 02:12 UTC","City":"Fernandina Beach","Summary":"saw 2 spinning cylinders over Atlantic ocean in Fernandina Beach, FL","Case Number":"19749","Object Shape":"Cylinder","Log Number":"US-09302009-0011","Region":"Florida","Viewing Distance":"Over One Mile","Source":"MUFON","Latitude":"30.672382","Country":"United States","Longitude":"-81.452632","map":"<A HREF = \"http://maps.google.com/maps?q=30.672382,+-81.452632(19749)&iwloc=A&hl=en\"> mufon case (19749) map </A>"}