{"Latitude":"25.791859","map":"<A HREF = \"http://maps.google.com/maps?q=25.791859,+-80.220279(19741)&iwloc=A&hl=en\"> mufon case (19741) map </A>","Object Features":"Unknown","Disposition":"Unknown","divs":["sighting detailsat approximately 8:15pm on 9\\28\\09 i walked out and as usual i looked up into the evening sky. i observed a very bright light in the northeastern sky moving in a southerly direction. what made this unusual was the fact of how bright the light was. my first impression that is was an aircraft, since i live about 6 miles from the miami international airport. the best description of intensity of the light that i can describe is that of venus in the night sky. as i looked at it more closely, i could see no navigational markers (red, green or flashing strobe) visible. during the duration of the sighting i heard no noise from the object. the speed of the object was that of a jet flying at altitude, but the altitude was much lower, maybe 10000 ft (but that is just a guess since it was difficult to determine since it was dark). living as close to the airport as i do, i am familiar with the flight patterns of aircraft. this object appeared to fly directly over miami international airport which is unusual again based on the objects apparent altitude. another oddity observed was during the sighting no aircraft were visible either landing or taking off. the object continued on its southerly course and made a turn to the east. even when it made its turn the intensity of the light remained constant. if it had been an aircraft i would have noticed its national markers. one other note was as i watched it make its easterly turn; i noticed an aircraft to the southeast and its navigational beacons where quite visible. once it made its turn, i moved to follow the object but lost it between tress and other houses."],"Country":"United States","Summary":"Bright white light flying in a southerly direction.","Date of the Event":"09/28/2009 08:15 UTC","Longitude":"-80.220279","Object Shape":"Star-like","Weather Factors":"None","Log Number":"US-09302009-0003","Source":"MUFON","Case Number":"19741","Tags":"City","Sighting Duration":"Undisclosed","Date Submitted":"09/30/2009 08:32 UTC","Object Flight Path":"Straight-line path","trends":["There have been 97 other sightings in Miami","There was one other sighting in Miami on or around September 28th 2009"],"Region":"Florida","City":"Miami","files":["/var/www/straped/mufon/html2text/19741.html.txt","/var/www/straped/mufon/org/19741.html"],"Viewing Distance":"Over One Mile"}