{"Region":"Kansas","Object Features":"Undisclosed","Sighting Duration":"00:30:00","Longitude":"-94.922464","files":["/var/www/straped/mufon/html2text/1974.html.txt","/var/www/straped/mufon/org/1974.html"],"Object Shape":"Sphere","divs":["Sighting DetailsAs best as I can remember it was a saturday night and around the year of 1982,It must have been after 11pm or so, because the t.v. had went off the air. I wasin the second story bedroom of my grandmothers farmhouse in Leavenworth Kansas. I was the only person in the house that was still awake. I wasnt real tired butthere wasnt anything to do so i layed down in bed next to the window. Watchingthe storm through the window i noticed that in the field next to my grandmothershouse were several balls of light darting all through this field. They movedwithin the paremeters of this field like pin balls. I was looking downward froman angle but from what i noticed they were fairly large, bright, and very fast.The lights were easy to see through the rain, but i cannot say whether theyhovered or were touching the ground. I would have to say that they were at least3ft by 3ft. My first reaction was that i was witnessing some sort of electricalstorm or maybe somekind of ball lightning. It was truly an amazing sight to see.I tryed to wake my brother and my uncle but had no luck, so,I watched them for along while then eventually i fell asleep. That monday I asked my scienceteacher about them and he did not respond. He only looked at me as if i werelying about what I had seen. Honestly, I did see this. One thing that sticks inmy mind the most was the fact that these things did not leave the boundries ofthis field. when they reached the end of the field they would bounce like apinball as if there were something it was bouncing off of. there was no fencethat i can remember and if there were, i dont think it was completly fenced. Andit wasnt just one that I saw, there were several of them. Alot of time haspassed and i have never met anyone who has seen the same thing. Nor has thereever been anyone who could tell me what it might have been that I seen thatnight in the field."],"Object Flight Path":"Other","Summary":"Lights on the ground","map":"<A HREF = \"http://maps.google.com/maps?q=39.311111,+-94.922464(1974)&iwloc=A&hl=en\"> mufon case (1974) map </A>","Tags":"City","Weather Factors":"Rain","Date Submitted":"11/30/1980 11:00 UTC","Case Number":"1974","Log Number":"US-08092011-0051","Source":"MUFON","Date of the Event":"11/30/1980 11:00 UTC","Latitude":"39.311111","Disposition":"Unknown","trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around November 30th 1980"],"Country":"United States","Viewing Distance":"21-100 Feet","City":"Leavenworth"}