{"Country":"United States","Date Submitted":"09/30/2009 09:35 UTC","Sighting Duration":"00:00:20","Date of the Event":"09/22/2009 10:15 UTC","divs":["Sighting DetailsThe object she described was a cube shape that was flashing white inside it. She told me that she freaked out because it was traveling toward her at about 75 Mph and would only flash every 10 seconds. The object passed over them at approx. 15 feet above the vehicle. When the vehicle passed right above her she was able to see inside the vehicle because it flash at that time and could only see an L shaped orange colored seat or something that looked like a seat inside it. They had passed a 18 wheeler that was stopped about by a DPS trooper a mile back and said that if the object kept going on the same path, they would have surely seen it also. I don't have the exact date, but it was about the second week of Sept. My niece did not report the sighting to local authorties because it happened on a barron stretch of road. She told me that when she got home she told her husband, but that he didn't seem intrested. They were back in town last night and told me the story, so me being intrested in the subect decided to tell you and maybe find out if anyone else had seen something similar in that area. She was very sure of what she saw and is not known to exaggerate. Please write back and let me know if this is a common sighting or not."],"files":["/var/www/straped/mufon/html2text/19743.html.txt","/var/www/straped/mufon/org/19743.html"],"Object Flight Path":"Straight-line path","City":"La Pryor/ Uvalde","Longitude":"-99.946508","Region":"Texas","Disposition":"Unknown","Viewing Distance":"20 Feet or Less, 501 Feet - 1 Mile","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.002068,+-99.946508(19743)&iwloc=A&hl=en\"> mufon case (19743) map </A>","Object Shape":"Square, Rectagular, Other","Weather Factors":"Windy","Latitude":"29.002068","trends":["there have been no other sightings in la pryor\\ uvalde","This sighting has never been favorited."],"Summary":"While traveling back to her home in Eagle Pass Texas, my niece and my sister in law saw a cube shaped object traveling toward them on on the path of the road","Log Number":"US-09302009-0005","Case Number":"19743","Object Features":"Window(s)","Tags":"City"}