{"Date of the Event":"09/10/2009 09:10 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=46.987136,+-123.598583(19740)&iwloc=A&hl=en\"> mufon case (19740) map </A>","Log Number":"US-09302009-0002","trends":["There has been one other sighting in Montesano","There were no other sightings in Montesano on or around September 10th 2009"],"divs":["Sighting Detailsi was cleaning up the campsight by firelight and solar light when my companion said \"mike...look, and pointed into the wnw sky. My first though was that it was a shooting star, but the light stopped in the sky. The object was moving very fast before it cane to a complete halt, the object then moved right...to the ssw at a very rapid pace and again came to a hault. The object was just as bright as the planet to it's right which i think was saturn. The hovering object then moved in a manner to trace out the left side of and octogon...pausing briefly at each turn. After tracing the left side of an octogon, the object continued to move in a WNW direction until it passed the hills on the horizon. During this event, the object never changed intensity, never pulsated, and it lasted about 2 minutes. I live in a military flight area in remote coastal washington state. I have seen many chinooks, blackhawks, c-141s c-5's f-18's flying over my homeon occasion. I am a military vet and have seen everything from fixed wing fighters like the f-15, f-16, f-18, a-10, toranado, mirage, harriers.....cargo transports as well as b52, rotars include cobra, apache, huey, kiowa, chinook, blackhawk.....nothing moves like what i saw..nothing I have no doubt that the object move in crisp angles, as I used a tree a frame of reference from a seated position. I will be happy to add other credentials to validate my unique understanding of the object to put this into perspective, as i have crossed the 20 year point, and my oath."],"Viewing Distance":"Over One Mile","Object Flight Path":"Path with directional change,Path then hovering","Region":"Washington","Tags":"City","Longitude":"-123.598583","Latitude":"46.987136","Object Features":"Unknown","Case Number":"19740","Source":"MUFON","Country":"United States","Sighting Duration":"Undisclosed","Summary":"zig zagger","Object Shape":"Star-like","Weather Factors":"None","City":"Montesano","files":["/var/www/straped/mufon/html2text/19740.html.txt","/var/www/straped/mufon/org/19740.html"],"Date Submitted":"09/30/2009 12:46 UTC"}