{"divs":["Sighting DetailsLast night, 9-29-09, I stepped outside into my front lawn not long after dark where my husband was watering the grass. I am always looking up hoping to see something extraordinary. This time, I was pleased to see what first appeared to be just a rather large star in the sky. I was facing toward the north east, and the \"large star\" I had barely noticed was actually moving. It seemed to be heading towards me. I looked for blinking lights. None. I would say it was at about a 75 degree angle or so from the horizon. With no blinking lights, and a similar sighting to this back in May, I was betting it wasn't a plane either. After about 5 seconds of traveling in a south westerly direction, it veered to the left (my left) and turned around, going back in the direction it had come from. Then, moments after that, it started getting dimmer and dimmer and smaller and smaller until it completely disappeared. The whole experience only lasted a few seconds, and after having done one MUFON report during the summer, I thought quickly and looked at my watch which said 7:29 pm. As far as my feelings go, I was excited to see a similar object to the one I saw in May. Wished my husband had seen it, too. Other than that, neutral."],"Tags":"City","Viewing Distance":"Over One Mile","Date of the Event":"09/29/2009 07:29 UTC","Summary":"Star-like object changed direction then slowly disappeared.","Weather Factors":"None, Does Not Apply","Object Shape":"Star-like","Object Flight Path":"Path with directional change","Latitude":"34.97566","map":"<A HREF = \"http://maps.google.com/maps?q=34.97566,+-105.026274(19747)&iwloc=A&hl=en\"> mufon case (19747) map </A>","trends":[],"files":["/var/www/straped/mufon/html2text/19747.html.txt","/var/www/straped/mufon/org/19747.html"],"Log Number":"US-09302009-0009","Source":"MUFON","Case Number":"19747","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"09/30/2009 01:53 UTC","City":"Undisclosed","Region":"New Mexico","Country":"United States","Disposition":"Unknown","Longitude":"-105.026274"}