{"Summary":"Solid pale light moving across sky","Date of the Event":"09/29/2009 08:25 UTC","Latitude":"40.008096","Disposition":"Unknown","Weather Factors":"Unknown","Date Submitted":"09/30/2009 05:32 UTC","Log Number":"US-09302009-0013","divs":["Sighting DetailsI was out on my deck looking up at the sky. I noticed the object because it was different than the aircraft I had been seeing. It was a solid light, no blinking. It was as faint and as small as the more distant stars you would see in the night sky. It moved quickly across the sky, diagonally across the air traffic lanes I had been seeing, in a straight line, and in my opinion, very high in the sky. A few minutes later I noticed it coming back on the same path it had taken. I thought maybe it was a satellite but I wasn't sure if satellites moved that quickly across the sky and if they would have one moving in the opposite direction of another ones path. It was different than anything else I had seen in the night sky, ever. I lost sight of it the first time when its path was blocked by trees and on its return trip when it was blocked by my house. I watched for approx. 30 minutes longer but saw nothing coming from either direction the object had traveled from. In the sky over me, aircraft were moving from NE to SW in various lanes. This object moved first from N to S and then from S to N."],"Object Shape":"Circle","Sighting Duration":"00:04:00","Case Number":"19751","map":"<A HREF = \"http://maps.google.com/maps?q=40.008096,+-75.701194(19751)&iwloc=A&hl=en\"> mufon case (19751) map </A>","Country":"United States","City":"Downingtown","Viewing Distance":"Unknown","Longitude":"-75.701194","Source":"MUFON","Region":"Pennsylvania","Object Features":"None","trends":["There have been 8 other sightings in Downingtown","There were no other sightings in Downingtown on or around September 29th 2009"],"Tags":"City","Object Flight Path":"Straight-line path,Path with directional change","files":["/var/www/straped/mufon/html2text/19751.html.txt","/var/www/straped/mufon/org/19751.html"]}