{"Region":"Delaware","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.555112,+-75.650207(19755)&iwloc=A&hl=en\"> mufon case (19755) map </A>","Viewing Distance":"Over One Mile","Date Submitted":"09/30/2009 08:23 UTC","Object Features":"None","Object Shape":"Cone, Circle","Summary":"Cone-shaped burst of light accompanied by slight haze.","Disposition":"Insufficient Data","Weather Factors":"Unknown","Date of the Event":"09/19/2009 08:30 UTC","Longitude":"-75.650207","Tags":"City","City":"St. Georges","files":["/var/www/straped/mufon/html2text/19755.html.txt","/var/www/straped/mufon/more/19755_submitter_file1__light.jpg","/var/www/straped/mufon/org/19755.html"],"Log Number":"US-09302009-0017","Object Flight Path":"Stationary","Latitude":"39.555112","Case Number":"19755","Sighting Duration":"Undisclosed","Country":"United States","divs":["Sighting DetailsI work at a haunted house in Middletown, DE on rt. 13 south of the St. Georges Bridge. Several of the Hayride actors (including myself) boarded the tractor to take us to our positions along the route. As we waited I heard someone said, \"Hey look at that\". What I saw was a cone-shaped burst of light accompanied by slight haze. It looked like a light from a helicopter beaming towards the earth, however it was to high to be a helicopter. Then I was struck by the mist, because it was an remarkably clear night, not a cloud in slight. The light was extremely bright, then I thought maybe it was a shooting-star, but the tail always follows these phenomena not the other way around. There was no sound, and the light didn't appear to move. The light was visible for at least four minutes then the brightness vanished, but there was still a trace of light the lingered a faded. The only thing I could come up with is maybe an experimental aircraft (because of Dover AF base located about 25 miles away), but the still does not explain the fog and the strange light. After serving in the Marines for 5 years I seen a lot of aircraft, I've never seen anything like this. There were at least 20 of us who all saw the same thing. None of us were scared, more intrigued than anything. We all joked about seeing a UFO, but after looking back, it's my only explanation. I including a sketch of what it looked like, and the direction I was viewing it from."],"trends":["There have been no other sightings in St. Georges","This sighting has never been favorited."]}