{"divs":["Sighting DetailsAccount of Amber Timberlake: I saw an object travel from the sky in front of us to the left side of our car very rapidly. It then hovered, disappeared, and reappeared numerous times before flying off over a hillside. Account of Steven Biars: I was driving Amber's car back from Ashland when we saw a bright object lighting up and then disappearing. The object appeared to hover on the right side of the road, near Mountain Enterprises, perhaps a few hundred feet in the air. I initially thought it may have been a parachute plane because there are several local flyers in this area. It quickly became apparent that this wasn't a plane. The object lit up brightly before disappearing. It then reappeared and shot across the road before stopping and hovering again. A small white light on the underside and a brilliant blue light on the upper side began to flash. A pinkish colored light on the front of the craft also brightly lit, but it wasn't flickering like the white and blue lights. Shortly thereafter, the craft disappeared before reappearing yet again. I pulled over to attempt to get a picture with my iPhone. As I was trying to take a picture, the craft shot over a hillside. I got back on the highway and turned around to follow the craft, but it was gone. I believe it must have followed Industrial Parkway or stayed invisible. I have reported a previous event with Cathy Richards from MUFON of Ohio. This craft was very similar to the craft I reported to her. Having had experience with MUFON in the past, I told Amber that we should file a report after seeing the craft."],"Log Number":"US-09302009-0018","City":"Wurtland","Date of the Event":"09/30/2009 08:47 UTC","Longitude":"-82.777944","Tags":"City","Object Shape":"Triangle","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.550358,+-82.777944(19756)&iwloc=A&hl=en\"> mufon case (19756) map </A>","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Object Features":"Unknown","Region":"Kentucky","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/19756.html.txt","/var/www/straped/mufon/more/19756_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/19756.html"],"Case Number":"19756","trends":["There have been no other sightings in Wurtland","This sighting has never been favorited."],"Source":"MUFON","Latitude":"38.550358","Date Submitted":"09/30/2009 09:56 UTC","Summary":"UFO near intersection of US 23 and Industrial Parkway (near Wurtland, KY)","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed"}