{"Longitude":"-91.442088","Tags":"City","divs":["Sighting DetailsI was taking several pictures, so took several in succession, because the subject was interesting to me. Anyway, I was walking down Highway 35 about 3 miles away from Trempealeau, WI, USA. So today I used my camera for something else and looked over the pictures one by one on my computer that I had taken just a couple days before. ( Trempealeau Mountain has been considered sacred to the ancient people around here.) It is the mountain you see in the pictures. I did not notice any such object until I looked at the pictures on my computer. I thought that maybe it could be a leaf blowing by, however the shapes seemed quite odd to me and I thought that maybe you all could look at these and tell me what you thought. There was alot of energy coming in with the storm, but I don't remember a lot of wind at this time, and the other pictures that I took do not show any wind either. What do you all think? I am sending pictures of all 3 pictures, which have the same exact time on all of them (I think the camera says A.M., but it should say P.M. as the pictures were taken in the afternoon."],"Object Features":"Appendage(s)","Region":"Wisconsin","City":"Trempealeau","Sighting Duration":"00:00:00","Date of the Event":"09/26/2009 02:49 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.005518,+-91.442088(19753)&iwloc=A&hl=en\"> mufon case (19753) map </A>","files":["/var/www/straped/mufon/html2text/19753.html.txt","/var/www/straped/mufon/more/19753_submitter_file1__DSCF2494.JPG","/var/www/straped/mufon/more/19753_submitter_file2__DSCF2495.JPG","/var/www/straped/mufon/more/19753_submitter_file3__DSCF2496.JPG","/var/www/straped/mufon/org/19753.html"],"Weather Factors":"Unknown","Log Number":"US-09302009-0015","Case Number":"19753","trends":["There have been no other sightings in Trempealeau","This sighting has never been favorited."],"Date Submitted":"09/30/2009 06:23 UTC","Disposition":"Unknown","Summary":"I was taking pictures of a storm but when I looked at them today, there were 3 unusual objects in only one of the pictures! The objects were not in the other 2 pictures taked at the same time...","Object Shape":"Bullet, Missile, Oval, Teardrop","Object Flight Path":"Unknown","Latitude":"44.005518","Country":"United States","Source":"MUFON","Viewing Distance":"Unknown"}