{"Summary":"Trailcam ghost.","Date Submitted":"10/02/2009 02:34 UTC","Source":"MUFON","divs":["Sighting DetailsBought and put out new Trail Camera's on leased property. The first time I pulled the SD card and took it home and plugged it in to my computer I noticed that 2 pictures taken had objects in them that I could not explain. In one of the pictures it does appear that a raccoon \"Triggered\" the camera to go off and caught what appears to be an object with 5 \"Orbs\" in a vertical position above the Raccoon. Then the next picture the object is photographed again about 41 seconds later moving to the right of where the raccoon was. After carefully reviewing the second picture I can see that the raccoon triggers the second picture. The camera's are Wildgame IR camera's with 4.0 megapixels. They were brand new. The SD cards were also new. My first reaction was that it was a bug or something. However the object moves right to left and I do not believe it is a bug based on the size and shape. I do not know what it could be. The object moves along what could be considered a trail in the woods. I left the camera there for another week. No more photo's of that object. I am including a daytime picture of the area so you can see what it looks like."],"Region":"Wisconsin","Latitude":"43.79139","Weather Factors":"Unknown","Date of the Event":"Unknown","trends":[""],"Log Number":"US-10022009-0003","Object Features":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.79139,+-88.781458(19769)&iwloc=A&hl=en\"> mufon case (19769) map </A>","Case Number":"19769","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-88.781458","Object Shape":"Cylinder, Sphere, Unknown","City":"Undisclosed","files":["/var/www/straped/mufon/html2text/19769.html.txt","/var/www/straped/mufon/more/19769_submitter_file1__PICT0007_2.JPG","/var/www/straped/mufon/more/19769_submitter_file2__PICT0006_3.JPG","/var/www/straped/mufon/more/19769_submitter_file3__PICT0008_1.JPG","/var/www/straped/mufon/org/19769.html"],"Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown"}