{"Region":"Florida","Sighting Duration":"00:03:00","Date Submitted":"10/01/2009 09:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.328518,+-80.719336(19764)&iwloc=A&hl=en\"> mufon case (19764) map </A>","Date of the Event":"09/30/2009 07:30 UTC","Country":"United States","Object Features":"Unknown","Log Number":"US-10012009-0006","Summary":"One star like shaped object falling from the sky turning into four as it descended .","Disposition":"IFO","Longitude":"-80.719336","Tags":"City","Case Number":"19764","divs":["Sighting DetailsThe one star like shaped object fell downward through the sky and turned into 2 as they were getting brighter and dimmer. The two star like objects began to fall and turned into a total of 4 bright star like shapes which were not falling directly to the ground but were slowly zig zagging in the air. As I was observing them they were starting to dissapear slowly one by one. It did not appear to be a falling star or a shooting star which I have seen throughout my life nor did it appear to be any type of fire work or air plane. I must add that another friend of mine saw the same thing in another city. I was not the only person to witness this activity in the sky as it was happening. It was brought to my attention by another fisher that was on the bridge I was fishing off of. As I was watching this in the sky I couldnt help but think there must be something else out there in our universe. I've never seen anything like this before. The way they moved through the sky and how they were getting brighter and dimmer didnt make any sense. I've never believed in any UFO sightings or anything in that category but tonight has changed my mind...."],"trends":["There have been 9 other sightings in Rockledge","There were no other sightings in Rockledge on or around September 30th 2009"],"Source":"MUFON","City":"Rockledge","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Star-like","Latitude":"28.328518","files":["/var/www/straped/mufon/html2text/19764.html.txt","/var/www/straped/mufon/org/19764.html"],"Object Flight Path":"Path with directional change"}