{"Country":"United States","Object Shape":"Oval","Source":"MUFON","Log Number":"","files":["/var/www/straped/mufon/html2text/1976.html.txt","/var/www/straped/mufon/org/1976.html"],"trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around March 31st 2002"],"Viewing Distance":"Over One Mile","Region":"Oklahoma","Longitude":"-97.514258","Weather Factors":"Unknown","Latitude":"35.46966","Case Number":"1976","City":"Oklahoma City","Sighting Duration":"00:30:00","Object Features":"Undisclosed","Disposition":"Insufficient Data","Tags":"City","Object Flight Path":"Unknown","Date Submitted":"03/31/2002 08:00 UTC","Date of the Event":"03/31/2002 08:00 UTC","Summary":"STRANGE PULSATING LIGHT","divs":["Sighting DetailsMY HUSBAND AND I WERE AT A GAS STATION BY I-35 OFF SE 59TH ST. IN OKLAHOMA CITYWE WERE PUTTING AIR IN HIS TIRES WHEN HE NOTICED THE LIGHT. HE BROUGHT IT TO MYATTENTION WHAT WAS STRANGE ABOUT THIS LIGHT IS THAT IT WAS PULSATING BUT ATFIRST IT DIDNT APPEAR TO BE MOVING AND AS WE LEFT THE STATION WE NOTICED ITSTARTED MOVING IN A SW DIRECTION WE FOLLOWED IT DOWN THE SERVICE ROAD BY THEINTERSTATE AS IT MOVED EVERYTIME IT WOULD PULSE IT WOULD APPEAR IN A DIFFERENTSPOT IT HAD ZIGZAGGING MOVEMENT TO IT WE FOLLOWED IT TO 74TH STREET AND SHILDSBLVD. WE TURNED LEFT ON SHIELDS AND CONTINUED TO FOLLOW IT IT WAS STILLPULSATING AND MOVING IN A ZIG ZAG TYPE PATTERN IT JUST SEEMED TO JUMP EVERY TIMEIT PULSED WE COULD NOT SEE IF IT HAD A SHAPE OR NOT IT WAS ABOUT THE SIZE OF ABASEBALL MAYBE JUST A LITTLE SMALLER WE FOLLOWED IT ABOUT 3 OR 4 MORE MILES BUTIT WAS TRAVELING FASTER BY THEN AND WE WERE LOSING SITE OF IT BECAUSE OF TREESAND BUILDINGS BUT IT CONTINUED IN A SW DIRECTION WE FINALLY GAVE UP AND WENTHOME. BUT ABOUT TWO DAYS LATER AT NIGHT I WAS GOING TO THE STORE AND NOTICED ITAGAIN EXCEPT IT WAS TRAVELING E TO W BUT WAS PULSATING LIKE BEFORE EXCEPT THISTIME IT WOULD JUMP QUITE A DISTANCE ACROSS THE SKY IT WENT SO FAR AND SEEMED TODISAPPEAR. WE LIVE BETWEEN THE AIR BASE AND A AIRPORT SO WE ARE USE TO PLANESAND THERE FLIGHT PATTERNS I HAVE NEVER SEEN ONE LIKE THIS BEFORE IT WASDIFFENTLY SOMETHING DIFFERENT BUT WHAT I DONT KNOW."],"map":"<A HREF = \"http://maps.google.com/maps?q=35.46966,+-97.514258(1976)&iwloc=A&hl=en\"> mufon case (1976) map </A>"}