{"Summary":"Two Army Tan elongated \"Blackhawk Type\" Helicopters fly-by.","Source":"MUFON","trends":["There have been 18 other sightings in Dana Point","There was one other sighting in Dana Point on or around April 19th 2009","This sighting has never been favorited.",""],"Log Number":"US-10012009-0003","Case Number":"19761","Longitude":"-117.693578","Latitude":"33.473942","Object Flight Path":"Straight-line path","Date Submitted":"10/01/2009 06:06 UTC","Tags":"City","files":["/var/www/straped/mufon/html2text/19761.html.txt","/var/www/straped/mufon/org/19761.html"],"City":"Dana Point","Disposition":"IFO","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Cylinder, Other","Date of the Event":"04/19/2009 12:50 UTC","Sighting Duration":"00:01:10","Country":"United States","divs":["sighting detailsapril 19, 2009, sunday, 12:50 p.m.,doheny state beach,dana point, ca blue \\ hazy sky . as i stood on the beach with other beachgoers, i heard a helicopter propellar engines sound to my right, and i saw two helicopters approaching sse, 50 m.p.h. coming around the main harbor breakwater, and i immediately took this photo with my cingular lg c2000 mobile phone camera (.jpeg, 320 x 240 pixels, 23 kb). two identical helicopters (h-11 \\ h-12), 50 foot lenght x 4 foot height, two horizontal propellars: front, 2 foot diameter, rear, 5 foot diameter, appeared to have four-five, one-foot black square, side-center windows,speed 40 m.p.h.,sse, altitude 400 feet above sea level, distance 700 yards. close encounter of the first kind. it has a very vanilla-threatening appearance, no questin. clearly seen in the photo are below-center platforms which correspond to the window locations. six beachgoer witnesses, (see \"celestial phenomena\" second electronic edition, 41 vols., (c) 2000-09 by vincent p. tobias,vol. 17, video clip 46, clock time 13:09, vol. 3 book 1, table 11, pp. 177 \\ 78. i am the author \\ discoverer of spaceships and extraterrestrial (eti) form of life on earth as documented in my book, above, websites www.celestialphenomena.net \\ com and blog."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.473942,+-117.693578(19761)&iwloc=A&hl=en\"> mufon case (19761) map </A>","Region":"California","Weather Factors":"Unknown"}