{"Date Submitted":"10/03/2009 06:04 UTC","Summary":"Flattened V-shaped lights on a boomerang object","Latitude":"33.50103","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.50103,+-111.921512(19778)&iwloc=A&hl=en\"> mufon case (19778) map </A>","divs":["Sighting Details I got off the bus with a backpack of books in the middle of the evening after a few hours' visit to ASU's library . The neighborhood of small businesses and offices was dimly lit at that time of evening, and no people or cars were moving in the vicinity, nothing distracting my thoughts or vision. As I walked eastward, a phalanx of seven lights came directly overhead from behind me, flying very low, maybe 60-80 ft., it seemed. My first thought that it was strange that a jet would be flying so directly eastward at such a height; but there was no noise at all accompanying the lights. I strained to make out a shape, but couldn't make out anything between the lights. But they moved with completely uniformity. I felt confusion for several moments as my mind instinctively sought for a familiar pattern, and then I experienced apprehensiveness and a growing thrill as I realized that this thing that was moving just a bit above me, slowly and silently, was completely foreign to anything I'd ever witnessed. It moved with an uncommon slowness, so that at walking speed I was not being rapidly outpaced. I had an impression of its bulk and smoothness of motion; the mere visual description can't capture the feeling that it was moving in a different KIND of space, which gave it a sort of presence. I don't mean a sensed intelligence or something of that kind; though there was a kind of leisureliness about it, the sort we associate with a car of sightseers. There was nothing upsetting about it, but a kind of exhiliration and curiosity as I began to follow it more closely; I expected the lights to shift, to take on a more familiar mechanical motion or in some way show that this was an ordinary phenomenon, maybe several small craft, viewed from an unusual perspective. It wasn't. It's speed remained constant, and after a few minutes, never altering its course, it was lost to view. It took about as many minutes to get to my home & I told my family about the experience, but didn't think to report it to anyone. A couple of days later, the 'Phoenix lights' sightings took place, and I recognized a difference between the sighting of the lights over the south Valley & those reports of an object that corresponded to the one I'd witnessed."],"Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Country":"United States","Date of the Event":"03/10/1997 09:30 UTC","Source":"MUFON","Region":"Arizona","Object Shape":"Boomerang","Disposition":"Insufficient Data","trends":["There have been 42 other sightings in Scottsdale","There were no other sightings in Scottsdale on or around March 10th 1997"],"City":"Scottsdale","Viewing Distance":"21-100 Feet","Longitude":"-111.921512","Tags":"City","Object Features":"Unknown","Log Number":"US-10032009-0003","files":["/var/www/straped/mufon/html2text/19778.html.txt","/var/www/straped/mufon/org/19778.html"],"Case Number":"19778"}