{"Object Flight Path":"Straight-line path","Date Submitted":"10/02/2009 03:47 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"Bright white round light moving silently, SW to NE","Object Features":"Unknown","Country":"United States","Tags":"City","City":"Sonoma","Latitude":"38.298629","map":"<A HREF = \"http://maps.google.com/maps?q=38.298629,+-122.448836(19773)&iwloc=A&hl=en\"> mufon case (19773) map </A>","Region":"California","Case Number":"19773","files":["/var/www/straped/mufon/html2text/19773.html.txt","/var/www/straped/mufon/org/19773.html"],"Viewing Distance":"Unknown","Object Shape":"Sphere","divs":["sighting detailssitting outside in my lawn chair enjoying the evening as it was just becoming dark. live in a rural area with open skies, good visibility ... often look at the evening sky, watch celestial bodies, airplanes, man-made satellite, owls, etc. take notice of all moving objects, but this one more intently because the light seemed brighter than other airplanes, and it made no noise. when i first spotted it, assumed it was just another airplane; but after a few seconds, wondered if it was a satellite. it was a bright white, round light, about the size and brightness of venus or jupiter. moving from nw to se at about the same speed and altitude as a plane. deduced that it was not a plane because (1) no flashing red or other lights; (2) never heard a noise coming from it; (3) moved more like a satellite ... gliding, floating ... propulsion seemed different than that of a plane. possibly a hard body \\ craft beneath the light, but hard to distinguish in the dark. although it moved like a satellite, it was too low and too bright to be one. it was out of the ordinary ... i questioned if a plane would be flying without the red blinking lights ... and the silence was definitely odd. i lost sight of it when it seemed to vanish before reaching the horizon in the se, probably due to cloud cover."],"Date of the Event":"09/27/2009 07:37 UTC","Disposition":"IFO","trends":["There have been 4 other sightings in Sonoma","There were no other sightings in Sonoma on or around September 27th 2009"],"Longitude":"-122.448836","Weather Factors":"Unknown","Log Number":"US-10022009-0007"}