{"City":"Stephens City","map":"<A HREF = \"http://maps.google.com/maps?q=39.08344,+-78.218057(19776)&iwloc=A&hl=en\"> mufon case (19776) map </A>","Region":"Virginia","Object Features":"Unknown","Object Shape":"Disc, Sphere","Weather Factors":"Snow, Medium","divs":["Sighting DetailsI was Ten years old, I made a walk about every other day approx 3 miles to get 5 gallons of kerosene for our stove. There was snow on the mountain road. As I was about one mile into my trek with the kerosene heading back to our small mountain home, I noticed a bright light following me through the trees. I got scared and tried to run, but the 5 gallon can of kerosene was slowing me down. It was just about dark and I was surrounded by mountain treeline with no neigbors. The light followed me for about half a mile to one mile, then finally disapeared behind a hill. I could not tell what the light source was and that made me even more scared. When I returned home, there was a friend of my Father's at the home. He was talking to my Father stating that he was approaching the house after using the \"Outhouse\" and noticed a large object above the house. I overheard the conversation, and explained what I saw. We all joked and said that we saw a \"UFO\". To this day, I am not sure what it was. My Father claimed that the house had lost all electricity for a few moments at the same time his friend was using the Outhouse. We were country and seemed like another mountain event at the time. Carl Shaw"],"Case Number":"19776","Tags":"City","Longitude":"-78.218057","Source":"MUFON","Date of the Event":"10/28/1978 04:00 UTC","Sighting Duration":"Undisclosed","Summary":"UFO sighting while walking home.","files":["/var/www/straped/mufon/html2text/19776.html.txt","/var/www/straped/mufon/org/19776.html"],"Log Number":"US-10032009-0001","Latitude":"39.08344","trends":["There have been no other sightings in Stephens City","This sighting has never been favorited."],"Country":"United States","Date Submitted":"10/03/2009 12:16 UTC","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Object Flight Path":"Path with directional change"}