{"Viewing Distance":"Unknown","Log Number":"US-10032009-0002","Latitude":"39.404938","trends":["There has been one other sighting in McGill","There were no other sightings in McGill on or around October 2nd 2009"],"Tags":"City","files":["/var/www/straped/mufon/html2text/19777.html.txt","/var/www/straped/mufon/org/19777.html"],"Case Number":"19777","Summary":"Strange lights in the NV sky","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Country":"United States","Date Submitted":"10/03/2009 01:06 UTC","Region":"Nevada","map":"<A HREF = \"http://maps.google.com/maps?q=39.404938,+-114.778628(19777)&iwloc=A&hl=en\"> mufon case (19777) map </A>","Object Flight Path":"Stationary,Hovering then path,Other","divs":["Sighting DetailsMy husband, son and I were driving home last night, we were 50 miles north east of McGill Nevada (home) and saw a big, bright orange ball of light appear out the front window of the truck directly in front of us (east) it just hung there for about 10 sec then disappeared. We all asked each other if we had seen it, we had. about 30 sec later it showed up again out the drivers window (north) and we all started yelling and I pulled over, by the time I had stopped it was gone. We got out of the car and it popped up in front of us again. So I took out my little camera and waited, a few sec later saw it way far off to the north east, really dim then it kind of blinked out and it was right in front of us again but there was 2 of them. They just hung there for about 10 to 20 sec, I got some video of them then they just disappeared. All the cars that had been behind us had pulled over and were watching, and a man pulled up next to us and asked if we were seeing this. While we were talking they re-appeared but this time there were 3 of them, they just hung there then kind of bounced up and down, hung there again, then they were just gone. I also go a little of that on camera. All of a sudden it seemed there were jets coming from all directions, there had been no sound until the jets showed up, and after the jets came we didn't see the lights again. They were very large and bright orange, similar to looking a street lamp from about 50yards away. It really was the most awesome thing I have ever seen. I have the footage on my camera but have not downloaded it yet, I also drew a pic but I have no scanner. My son was scared out5 of his mind, my husband and I were both really excited, as was the man that pulled up next to us. The whole thing lasted about 20 min or so we stayed and watched for nearly half an hour more and saw nothing else except lots of jets flying around. My family watched out the back window of my truck the whole way home and saw nothing else."],"Disposition":"Unknown","City":"McGill","Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-114.778628","Object Features":"None","Date of the Event":"10/02/2009 10:00 UTC"}