{"Object Features":"Undisclosed","Weather Factors":"Unknown","Date of the Event":"10/02/2009 10:05 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=38.007058,+-122.987942(19788)&iwloc=A&hl=en\"> mufon case (19788) map </A>","Region":"California","Summary":"Bright star like object","Latitude":"38.007058","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Circle, Diamond","Disposition":"IFO","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19788.html.txt","/var/www/straped/mufon/org/19788.html"],"Log Number":"US-10032009-0013","City":"Point Reyes","Source":"MUFON","divs":["Sighting DetailsI was out in my front yard admiring a beautiful night, the sky was bright due to a full moon and there was a giant white cloud covering a large portion of the sky. to the northeast, which looked to be somewhere (possibly) over Point Reyes, I saw what looked to be a very bright star. I was going out to empty the trash. i went back into the house & returned the garbage can & decided after a few minutes to go out and take another look. i look to the sky at night quite a bit & I had no memory of anything being in that position before. As I watched it, I noticed it was multi-colored with red, blue and green lights \"streaking\" out of it. I ran into he house and got my binoculars and I could see the lights much better. The shape was star like with glistening lights. What was odd is is that it never moved. It stayed in that position for probably ten minutes and then, unfortunately, the call of nature turned into a roar and I had to go inside. When I returned, it was gone. I know for a fact it was not a plane or a helicopter as it stayed in an exact position for the fifteen minutes that I watched it."],"Longitude":"-122.987942","Viewing Distance":"Unknown","Case Number":"19788","Date Submitted":"10/03/2009 11:07 UTC","trends":["There has been one other sighting in Point Reyes","There were no other sightings in Point Reyes on or around October 2nd 2009"]}