{"Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsWe were headed to New Braufels for a 5-day getaway for our anniversary. As we were nearing our destination, we were driving through Round Rock, TX on I-35 South, and I saw these lights ... about 3 white ones, and 2 red ones just hanging there above the interchanges. At first, I thought it was just a slow-moving plane; however, as we came closer, I said to my husband, \"Look! It's just hanging there!\" He said, \"It's just a plane.\" I responded that planes \"just don't hang\" in the sky; they must keep moving. He said that it could just be \"one of those military planes that can do that.\" I said, \"What exactly type of military plane can do that?\" He said he didn't know, but he was sure there was one. The entire time we were having this conversation, I was watching this thing, and I kept telling him that it was STILL THERE, and it was NOT moving. I said, \"It's a UFO!\" He said he didn't think so. I said, \"If God can create our world and all of these people and give us the intelligence to create all that is around us, do you think he just did it for only EARTH? I don't think so.\" He said, \"Maybe; I don't know.\" As we continued to drive, we couldn't see it any longer. I am a believer in UFOs as my family saw them on a trip to Colorado hovering over us for miles, darting back and forth. I was about 10 years old at the time, but it is a vivid memory. Now, some years later, I see this thing just sitting stationary over a very busy city and interstate; it is something to think about!!"],"Object Shape":"Boomerang","Latitude":"30.513835","Log Number":"US-10032009-0006","Region":"Texas","City":"Round Rock","Source":"MUFON","Weather Factors":"Does Not Apply","Date of the Event":"10/02/2009 08:20 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/19781.html.txt","/var/www/straped/mufon/org/19781.html"],"Tags":"City","Summary":"It was just hovering/stationary over the interstate as we drove S on I-35","map":"<A HREF = \"http://maps.google.com/maps?q=30.513835,+-97.668946(19781)&iwloc=A&hl=en\"> mufon case (19781) map </A>","Object Features":"Unknown","Case Number":"19781","Date Submitted":"10/03/2009 08:29 UTC","Longitude":"-97.668946","trends":["There have been 11 other sightings in Round Rock","There were no other sightings in Round Rock on or around October 2nd 2009"],"Country":"United States","Object Flight Path":"Stationary"}