{"City":"Norfolk","Log Number":"US-10032009-0014","Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","Sighting Duration":"Undisclosed","Case Number":"19789","Country":"United States","Longitude":"-76.280703","Region":"Virginia","Date Submitted":"10/03/2009 11:15 UTC","Source":"MUFON","Date of the Event":"10/02/2009 04:30 UTC","divs":["Sighting DetailsOn the night of October 2, 2009 at 8:30 PM a friend and I were driving down Virginia Beach Blvd. towards Military Hwy. To my left (I was driving) I noticed bright flashing lights (five in total, and in the shape of a pentagon when all were on). Initially, I assumed that they belonged to a tall antenna, however, I found their rapid, random pattern of flashing to be unusual. It soon became apparent that it was not an antenna, but a craft of some kind, moving toward the horizon to my NE in a rather erratic up & down motion. I pointed the object out to my friend, who noticed it immediately, since it was quite bright (the lights had roughly the same color as an LED). Eventually, the object disappeared behind a line of trees, we attempted to locate it without success. Though my friend and I both had cell phones equipped with cameras, we were too awed to think of taking a picture. I myself was quite stunned, since I had, up till that point, considered myself a skeptic and scoffed at the idea of UFOs. Though our area is one that is well known for the many aircraft that inhabit the sky, both the light patterns and its erratic flight behavior have caused me to classify this as a UFO."],"Summary":"Five unidentified lights (probably belonging to one craft), flashing in a rapid, random pattern.","Tags":"City","files":["/var/www/straped/mufon/html2text/19789.html.txt","/var/www/straped/mufon/org/19789.html"],"Object Features":"Unknown","Latitude":"36.856219","Object Shape":"Flash, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=36.856219,+-76.280703(19789)&iwloc=A&hl=en\"> mufon case (19789) map </A>","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around October 2nd 2009"],"Weather Factors":"Windy, Light","Viewing Distance":"501 Feet - 1 Mile"}