{"Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"bright white odd shaped light heading straight upwards towards outer space","divs":["Sighting DetailsI was sitting on my front porch smoking a cigarette and I just happened to look up and I saw a bright white light headed directly upwards. It was going slow, as a matter of fact I couldnt see it moving it seemed to move while I was not looking. I watched for about five minutes as the light moved even more and I thought it could just be a star but it was too bright and visibility was not good and I had to look really hard to see any stars. This was shaped like a five point \"stick\" star and was irregularly bright. I came inside to get my camera and when I went back outside to take a picture, I aimed my camera and I could see the craft through my screen but when I actually took the picture I couldnt see the light anywhere. I changed my settings on my camera and took pictures with every kind of flash so that it wasnt \"poor flash\" and I managed to get a picture with a view of the light but it was much smaller than what it should have been."],"Longitude":"-81.813616","Region":"West Virginia","Date of the Event":"10/03/2009 05:30 UTC","Country":"United States","Source":"MUFON","trends":["There have been 2 other sightings in St Albans","There were no other sightings in St Albans on or around October 3rd 2009","This sighting has never been favorited.",""],"Tags":"City","Object Shape":"Flash, Unknown","Object Features":"Unknown","Case Number":"19782","Date Submitted":"10/03/2009 09:27 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.38275,+-81.813616(19782)&iwloc=A&hl=en\"> mufon case (19782) map </A>","files":["/var/www/straped/mufon/html2text/19782.html.txt","/var/www/straped/mufon/more/19782_submitter_file1__ufo1.JPG","/var/www/straped/mufon/more/19782_submitter_file2__ufo2.JPG","/var/www/straped/mufon/org/19782.html"],"Disposition":"Insufficient Data","Sighting Duration":"00:09:00","City":"St Albans","Log Number":"US-10032009-0007","Latitude":"38.38275","Object Flight Path":"Straight-line path"}