{"Latitude":"39.964634","Log Number":"US-10042009-0005","Disposition":"Unknown","Object Features":"Undisclosed","Longitude":"-75.601528","Country":"United States","Summary":"\"Christmas Lights\" in a cluster of trees about 50' in diameter; same as reported by Bucks County woman","Date of the Event":"06/20/2004 12:00 UTC","Case Number":"19794","Tags":"City","Date Submitted":"10/04/2009 10:44 UTC","divs":["Sighting DetailsFrom our back deck at our townhouse on Amber Lane in West Chester, PA., my boyfriend and I witnesses sparkling whitish lights in a cluster of trees that buts up against a small waterway. We wrote the insident off initally as being a mating territory for lightning bugs, which it resembled, however we both never saw anything like it before and found that this explanation to be questionable. When we saw the UFO special where the woman in Bucks County described the \"Christmas lights\" we both got goosebumps because her description was uncanny to our experience. What we witnessed was what appeared to be hundreds of thousands of lightning bugs hovering and floating on and around the tree branches. The lights were twinkling, but not blinking intermittently like lightning bugs do. It looked like sparkles all over the leaves. We didn't think to grab the video camara. We sat on the deck for several minutes watching from about 60 ft length. It's odd to me in hindsight that we wrote it off as lightning bugs and didn't try to film. I seemed so convinced at the time it was lightning bug mating but after researching lightning bugs, it is clear to me that it was not them. I wanted to share this because I was compelled to contact you after watching the Bucks County woman share her description of what she witnessed. The simulated images that were generated we're exactly the same thing we saw. It gets even stranger for us because this same woman also saw lights in the sky that were the same as something we a few years after this event at my house on North Concord Rd. in West Chester. We saw from our back deck what I can easily describe as exactly the same thing the Bucks County woman saw in the sky. Three, then four round lights moving slowly in geometric patterns, sometimes coming together and then merging back with one another. The simulated video of what she witnessed was exactly what me, my boyfriend and his brother saw. The lights appeared to be attached to something which was oddly shaped. It was close to us at one point, maybe 30'. Again, we stood there watching it intently but never grabbed a camara. I didn't have a video camara available at my house anyhow and a still photo wouldn't have done it justice anyhow. It was just the movement of the lights in what appeared to be a planned, geometric pattern that convinced us of it not being a typical aircraft. This happened in the early summer of 2007 around 9 or 10pm."],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","City":"West Chester","map":"<A HREF = \"http://maps.google.com/maps?q=39.964634,+-75.601528(19794)&iwloc=A&hl=en\"> mufon case (19794) map </A>","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/19794.html.txt","/var/www/straped/mufon/org/19794.html"],"Region":"Pennsylvania","trends":["There have been 10 other sightings in West Chester","There were no other sightings in West Chester on or around June 20th 2004"],"Object Shape":"Other","Source":"MUFON"}