{"files":["/var/www/straped/mufon/html2text/19797.html.txt","/var/www/straped/mufon/more/19797_submitter_file1__ufo.jpg","/var/www/straped/mufon/more/19797_submitter_file2__lightsinyard.jpg","/var/www/straped/mufon/org/19797.html"],"Longitude":"-121.012739","Summary":"Oval craft scared my cat / Strange blinking lights in my yard later that night.","Object Flight Path":"Straight-line path","Object Features":"None","Object Shape":"Oval, Other, Unknown","Disposition":"Hoax","trends":["There have been 6 other sightings in Nevada City","There were no other sightings in Nevada City on or around September 30th 2009","This sighting has never been favorited.",""],"City":"Nevada City","Weather Factors":"None","Latitude":"39.269781","Source":"MUFON","Tags":"City","Case Number":"19797","Sighting Duration":"00:00:05","divs":["Sighting DetailsAround 3:00pm I was watching my cat sitting in the yard from inside my house, looking out a sliding glass door. He was looking out into a field and then looked straight up. His ears went flat and his eyes were big and he ducked down and quickly ran to a tree to climb but stopped halfway looking up all around. At that moment a saw a reflection of a black oval (off of a camper shell window in the driveway) moving away to the left. I have tall trees all around the house but only the sky can be seen in the reflection. I went and picked up the cat and he was trembling and shaking. Later that night at exactly 9:50 I went outside to feed the cat, as I stepped out of the door I saw something flashing colorful lights just off the porch steps in the yard no bigger than a baseball. It was very dark and I took 2 steps towards it and noticed that it was being held by \"something\" about 1 to 2 feet tall. I was startled and jumped back and at the same time the \"thing\" was startled too and dropped the flashy thing and ran away super fast. I looked where \"it\" dropped the flashy light thing cause it was right in front of my pumpkin patch. I heard it hit the ground and later believe it bent a pumpkin leaf stem. Nothing there. I was terrified by then and went inside to collect my self."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.269781,+-121.012739(19797)&iwloc=A&hl=en\"> mufon case (19797) map </A>","Country":"United States","Date Submitted":"10/04/2009 03:08 UTC","Viewing Distance":"21-100 Feet","Log Number":"US-10042009-0008","Date of the Event":"09/30/2009 09:45 UTC","Region":"California"}