{"Log Number":"US-10042009-0007","Object Flight Path":"Undisclosed","divs":["Sighting DetailsMy friend Brad was getting ready to tape a marching band compitition in Brownsberg Indiana and was worried about the rain that was moving into the area. As he looked up to check the sky for the impending weather he caught a glimpse of 4 sphere's in the sky that did not appear to be moving. Puzzeled he started asking the guy in front of him if he could see the objects and the guy replied that he also saw the objects. Brad turned on his camera,still trying to come up with an explanation as to why these things were there video taped about 43 seconds of the objects before a fast moving cloud bank covered them up. We have let some airport people see the video and they say it's not aircraft. This sighting occured at 3:30 in the afternoon with Blue skys. The first idea Brad had is that it could be the big dipper,but at 3:30 in the afternoon with blue skys? We have also ask a few people that we know about that theory and no one that we know thought that was right either. The skys were blue that day except for the clouds that you can see rolling in quickley in the video. We don't have an explanation and thought you guys might interested in seeing the video. We would appreciate you letting us know what your conclusions are if any, Thanks, David Webb"],"Object Shape":"Sphere","Weather Factors":"Unknown","Country":"United States","Date Submitted":"10/04/2009 01:02 UTC","City":"Brownsburg","Source":"MUFON","Date of the Event":"09/26/2009 03:30 UTC","Tags":"City","Case Number":"19796","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/19796.html.txt","/var/www/straped/mufon/org/19796.html"],"Longitude":"-86.396774","Summary":"While at a marching band competition the camera man for the band video taped 4 UFOs?","Viewing Distance":"Unknown","Object Features":"Undisclosed","trends":["There have been 9 other sightings in Brownsburg","There were no other sightings in Brownsburg on or around September 26th 2009","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.850877,+-86.396774(19796)&iwloc=A&hl=en\"> mufon case (19796) map </A>","Latitude":"39.850877","Region":"Indiana"}