{"City":"Whitmore Lake","Object Features":"Undisclosed","Disposition":"Insufficient Data","Region":"Michigan","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.371489,+-83.470478(19798)&iwloc=A&hl=en\"> mufon case (19798) map </A>","Log Number":"US-10042009-0009","Longitude":"-83.470478","Date Submitted":"10/04/2009 03:24 UTC","Object Flight Path":"Undisclosed","Country":"United States","trends":["There have been no other sightings in Whitmore Lake","This sighting has never been favorited."],"Source":"MUFON","Case Number":"19798","Summary":"Large orange-red sphere came down over us","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19798.html.txt","/var/www/straped/mufon/org/19798.html"],"divs":["Sighting DetailsMy husband had taken the dog out to do his nightly business. I was standing on the balcony of the house that attaches to our bedroom. My husband said to me \"Hunny come down here. There's a weird planet. Youll probably know what it is\". Then he asked me if I knew if there was a cellphone tower nearby and I replied that I thought there was indeed one nearby and that could be it. When I came down and met him outside,I realized that the direction where he was pointing there was no cellphone tower. I did see the large globe on the horizon. It pulsed and glowed a very bright red,but when it got closer(coming from the West) to us,it seemed to pulse back and forth between red and orange almost at the same time. I agree with my husband that it seemed to have some intelligence about it,because it seemed to come toward us once we started focusing on it and talking about it. When it got above the tree next to our house and was coming down over top of us ,I said to my husband \"Thats it! Show's over! These things can give you cancer!\" I don't know why that was the first thing that came to my head,but as soon as I said that,the thing disappeared. My husband and I have differing viewpoints on this part of the experience,because he thinks it just faded down to a pinpoint,but to me it seemed to shoot straight up in the air into a pinpoint. Then it completely disappeared and has not returned since. Our family has had several strange encounters over the years. I've always wondered if they're tied into one another somehow."],"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Latitude":"42.371489","Tags":"City","Date of the Event":"08/07/2009 12:00 UTC"}