{"Summary":"Observed a silver \"BB\" high in the sky for several days, it did not move.","Case Number":"19800","Object Flight Path":"Stationary","Disposition":"Unresolved","City":"Honolulu","files":["/var/www/straped/mufon/html2text/19800.html.txt","/var/www/straped/mufon/org/19800.html"],"Country":"United States","Log Number":"US-10042009-0011","Weather Factors":"Windy","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsThis happened approximately in 1997. I was laying on a beach on the north shore of Oahu Hawaii. Since I was laying on my back I was looking up at the sky otherwise I would never have noticed this object. I was looking at the clouds when suddenly I noticed what appeared to be a silver object that looked like a \"BB\" just hanging far up in the sky. It was very small and if I looked away I had to look very hard to find the object again. it was almost noon and it was a very suuny day with light clouds passing over. I watched the object for at least thirty minutes and it did not move. At this time I went home and got a video camera and returned to the exact spot on the beach. I layed down in the same spot and again found the object still in the same area. I was able to video about one minute before cloud moved in and covered the area. I work in law enforcement and the next day while on the job I told my beat partner about the sighting. He was laughing about it until as we were looking up in the sky we both spotted the object again! We were in the Ewa Beach area of the island about 20 miles from where i had seen the object the day before. After watching the object for some time we decided to go to the Pacific Tsunami Warning center which is located in the sector and see if they had any type or radar that might be able to detect the object. Upon our arrival at the center we were met by a gentleman who claimed to be a phyicist and the director of the facility. It was close to noon and very hot outside but the Doctor and several other workers came outside to look at the object. We all spent at least an hour looking at the object even to the point of using my sniper rifle with a very high power scope to observe it. The Doctor seemed truely fascinated by the object and commented that he might contact Cheyenne mountain to see if they had it on radar. Since it was very hot outside we finally left and the Doctor told us that he would make some calls and for us to come back in a day or two so he could tell us about his findings. So the next day we came back and met with the doctor agian but this time he seemed to be in a big hurry and didn't want to give us the time of day. He quickly told us that what we had seen was Venus and that he had to go to a meeting. It seemed like he was just brushing us off. I also contacted all the agencies in the area that launch weather ballons and learned that there were none up during the time we same the object (most are launched at night and explode by 0200 to 0300 hours). A few years later I was getting my pilots license and while walking out to the plane at the Honolulu International airport I saw the object again! This time it was earlier in the morning, about 0900 hours. It appeared to be a little lower this time and was almost over the tower (as seen from the general aviation ramp side). My instructor and another pilot saw the obect. My instructor contact the tower and asked if they had the object on radar, their answer was negative. After taking off we were no longer able to find or see the object. I found it hard to beleive the doctors explaination that this object was Venus. I have never heard of being about to see planets with the naked eye in the middle of the day with the sun burning bright. This object appeared to be sphirical in shape and looked mettalic like a BB. It was not bright and if you looked away from it you had to look really hard to find it again, so it must have been really high or really small. Since the airport radar did not pick it up I am guessing that it was higher that the class B radar could detect or it was undetectable."],"Object Shape":"Sphere","Longitude":"-157.851713","Tags":"City","Region":"Hawaii","trends":["There have been 17 other sightings in Honolulu","There were no other sightings in Honolulu on or around November 30th 1996"],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=21.312704,+-157.851713(19800)&iwloc=A&hl=en\"> mufon case (19800) map </A>","Date Submitted":"10/04/2009 04:34 UTC","Date of the Event":"11/30/1996 12:00 UTC","Latitude":"21.312704"}