{"Date Submitted":"10/04/2009 06:07 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.170179,+-85.493152(19803)&iwloc=A&hl=en\"> mufon case (19803) map </A>","Date of the Event":"10/01/2009 10:30 UTC","Object Shape":"Cigar","trends":["There have been 10 other sightings in Cookeville","There were no other sightings in Cookeville on or around October 1st 2009"],"Weather Factors":"None","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19803.html.txt","/var/www/straped/mufon/org/19803.html"],"Source":"MUFON","Country":"United States","Latitude":"36.170179","Tags":"City","Disposition":"Unknown","Longitude":"-85.493152","Summary":"Object was long and slender, reflecting light.","Case Number":"19803","Log Number":"US-10042009-0014","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was outside taking my dog for a walk, and noticed some crows circling around. I thought that was odd, because I rarely see them so close, but while I was looking up at them, I noticed this long and skinny looking object flying. First, I thought it was an airplane, as the sun was fairly bright and I couldn't see too well, but I listened and did not hear anything. So I stared at it until I could see it better, and saw there were no wings or flashing lights as a plane would have. From where I could see, the whole side of it looked \"flat\", or at least there were no obvious bumps to cast shadows.. it looked white on the side, from where the sun was shining on it. I thought maybe it was a blimp, but it moved too fast to be that, so, I'm not really sure what it was.. I wanted to run inside and grab my camera, but I didn't think I would have time before it dissapeared. The object was flying in a straight path, it didn't seem to waver up or down. I lost sight of it when it flew out of my view. I've often seen black military helicopters flying in the same direction. There are no military bases around here, but we are located between two major cities. I've never seen anything such as this, and thought I should report it. It would be nice to know if someone else spotted the same thing. Thank you."],"Region":"Tennessee","City":"Cookeville","Sighting Duration":"00:00:45","Object Features":"Unknown"}