{"Object Shape":"Unknown","trends":["There have been 12 other sightings in Ypsilanti","There were no other sightings in Ypsilanti on or around October 4th 2009"],"Viewing Distance":"Unknown","Region":"Michigan","Summary":"extremely quick moving orange light","Case Number":"19806","Longitude":"-83.609864","Object Flight Path":"Undisclosed","Date Submitted":"10/04/2009 11:02 UTC","Disposition":"Insufficient Data","Latitude":"42.2503","Log Number":"US-10042009-0017","Date of the Event":"10/04/2009 10:35 UTC","City":"Ypsilanti","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"00:02:00","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.2503,+-83.609864(19806)&iwloc=A&hl=en\"> mufon case (19806) map </A>","divs":["sighting detailsas i looked (west) out the window, a rising orange light caught my eye. at first i wondered if it was a planet. i stepped out side to take a closer look, and noticed that it was moving. i watched the orange light quickly move upward arching slightly. my first reaction to this object was , that it was moving abnormally quick. after watching it for a few seconds, i went inside to find my roommate, (who was asleep) i noticed that the object had blinking lights of two different colors (i cant remeber which colors) , as it moved closer to me. the object was headed east. i watched the object move across the sky, until it moved outside of my sight. i am not sure if it was in space, our inside earth. it passed right above the mooon, -right above it so its silhouette was not reflected. :\\ *im not sure if this was a true ufo. i was just extremely bewildered about its speed. not only was this aircraft moving very fast, but as it had passed over me, it produced hardly any sound\\noise. because i have never seen anything like this before i figured that i should at least tell someone about it."],"Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/19806.html.txt","/var/www/straped/mufon/org/19806.html"]}