{"Viewing Distance":"Over One Mile","divs":["sighting detailsi've been very reluctant about posting this, but after watching \"i know what i saw\" tonight, i decided it's time. i like to sit outside when the sun is setting and watch for things in the sky (hubble, iss, satellites, ect....), this one night, i was sitting in my chair looking due west when from the north appeared 2 extremely large ufos heading southwest. they appeared to be somewhere near the edge of the atmosphere and if i had to guess, each would be approx. 3-5 miles across. as they headed from the north to southwest, they were crisscrossing with each other and then just vanished! the whole event lasted about 4 seconds. they were silver in color with a black center and had what looked like multiple cracks on the underside. the sun was also reflecting off of them, giving them a gold\\yellowish\\orange appearance. a month or so later i was watching ufo hunters and realized that what i had seen was done in an animation for the show.you can view it on youtube \"ufo hunters giant ufo's 1\\5 :25\". pause at the 25 sec mark. i've had 2 sightings prior to this and 1 since, all different, but this is the most vivid of them all!"],"Region":"Arizona","files":["/var/www/straped/mufon/html2text/19809.html.txt","/var/www/straped/mufon/org/19809.html"],"Disposition":"Unknown","Object Shape":"Disc","Country":"United States","Longitude":"-111.749632","Source":"MUFON","Date of the Event":"09/28/2008 06:45 UTC","Case Number":"19809","Weather Factors":"None","Date Submitted":"10/04/2009 11:49 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.884532,+-111.749632(19809)&iwloc=A&hl=en\"> mufon case (19809) map </A>","Summary":"2 GIANT Ufos","City":"Casa Grande","trends":["There have been 35 other sightings in Casa Grande","There were no other sightings in Casa Grande on or around September 28th 2008"],"Object Flight Path":"Path with directional change","Tags":"City","Latitude":"32.884532","Object Features":"None","Log Number":"US-10042009-0020"}