{"Weather Factors":"Unknown","Date Submitted":"10/04/2009 11:40 UTC","Disposition":"Unknown","Date of the Event":"01/28/1991 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=32.777846,+-79.926772(19808)&iwloc=A&hl=en\"> mufon case (19808) map </A>","Source":"MUFON","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19808.html.txt","/var/www/straped/mufon/org/19808.html"],"Object Shape":"Other","Log Number":"US-10042009-0019","Country":"United States","Latitude":"32.777846","Case Number":"19808","Longitude":"-79.926772","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","trends":["There have been 20 other sightings in Charleston","There were no other sightings in Charleston on or around January 28th 1991"],"City":"Charleston","Summary":"My Experience","divs":["Sighting DetailsIt was on a Sunday evening and I was in my home in Charleston, S.C.I was in my art studio doing a commissioned painting of the Blessed Virgin Mary. All of a sudden, I saw three real old little men in the corner of my studio. They were wrinkled and I knew they must be at least 90 years old. They looked at me with deep compassion in their eyes as if they were anxious to see how I would react to their appearance. They immediately started talking to me through mental telepathy. I was at that time teaching about 75 people at a fitness center. I was teaching them meditation. These were there words, \"The most important thing your world can learn is meditation because it will lift your vibrations to a higher consciousness. Thank you for teaching this to your people.\" I cried and thanked them for thanking me and then before I could look up and wipe the tears from my eyes, there was sort of a flashing light and they were gone.\" No one will believe me, even though I am well known and well respected by my students and clients all over the world. When I see persons talking about UFOs and their experiences on television, I never see anyone who has had a face to face meeting with these wonderful people and who has had a conversations with them. I have reason to believe that I will be contacted again soon. I can't tell you how or why I feel this, but Dr. Hynek's name has been brought to my attention many times in the last several weeks. I am not a kook; I am a very respected medium. www.elizabethbaron.com I believe there are good and bad aliens and this is not the only encounter I have had but I won't bore you with the other, but I believe they are here to warn us of coming disasters and they want to make that disaster a less catastrope because the greater our devastation, the more it will affect all the planets. If you know of someone who has had this same experience or if you could communicate with me, I would appreciate it. My email is ldylion112@aol.com Love and Light, Elizabeth Baron"]}