{"Case Number":"19807","Latitude":"38.536747","Weather Factors":"Fog, Light","Log Number":"US-10042009-0018","Object Features":"Patterned Surface","Tags":"City","files":["/var/www/straped/mufon/html2text/19807.html.txt","/var/www/straped/mufon/org/19807.html"],"divs":["Sighting DetailsAll the times and the date are approximate it was in the middle or late summer and I had got off work at about midnight and was going to Ironton to cruise with my friends. As I was driving east on old us 52 I noticed a blue chevy cavilere in front of me hit his breaks and slow down then take off like a shot about that time my car started acting like it was stalling out and I pulled onto an old access road to the Dow chemical company in Lawrence county where my car finally died and I couldn't get it started. I got out of the car and raised the hood not knowing what to do because it was dark and very desolate on that streatch of road at that time of night. I remember there was a high fog bank and it was near the treetops. As I was looking at my car I started getting an eerie feeling that I wasn't alone out there and I figured it was just my nerves then I notice a hum..not hearing it more feeling it in my body like a vibration. Then I notice a \"strobe\" thats how it looked over the road I had just came down. I slowly looked up and my whole outlook on life suddenly changed. There was a light there..It was on constantly yet ever few seconds it would strobe flash. It was in this fog bank but I could make out the edges because they were darker than the rest of the sky above me then as the light flased again I noticed another light out of the corner of my eye do the same. This thing was HUGE!! almost as big as the field it was hovering over. And as I looked around I saw another light off in the distance but it didn't flash. I stood there staring with my jaw dropped thinking how insignificant I was, how small and unimportant everything I did or ever will do was I wanted to laugh and cry at the same time. I stood there for a few minutes in shock then the thing MOVED! the lights as one unit move together up deeper into the fog and all I can see is the lights. There is another flash of the lights and it heads off to the north east at a pretty good rate of speed never making a sound but the fog swirled around it as it pulled up and away. Not thinking I jump in my car and turn the key and it starts right up as if nothing had happen. I back out of the access road and start driving fast back to my home so I can tell someone about this as I look out my window to the east I see this thing topping the hills near US 52 and as it does it flashes again and is gone. This event is something that I will never forget. The size of this thing was impossible to be flying. I've only told a few people about this and of course they all act the same way so I never reported this until now and only because I watched the show on History I know what I saw and there are people there that are reporting something like what I saw. The one I saw didn't have the red light in the center but those pictures they show on the program was it..You can't tell the size of the object in the picture but thats it. I don't have any ideas as to what I saw I just know that on that night I changed, I had no fear of the object just awe and to this day I still catch myself looking up into the sky and especially in that area I still slow down and look around."],"Summary":"Triangular shaped object over a chemical plant","Disposition":"Unknown","trends":["There have been 2 other sightings in Ironton","There were no other sightings in Ironton on or around August 15th 1989"],"Longitude":"-82.682941","map":"<A HREF = \"http://maps.google.com/maps?q=38.536747,+-82.682941(19807)&iwloc=A&hl=en\"> mufon case (19807) map </A>","Sighting Duration":"00:15:00","Date of the Event":"08/15/1989 11:30 UTC","Region":"Ohio","Country":"United States","Source":"MUFON","City":"Ironton","Date Submitted":"10/04/2009 11:29 UTC","Object Shape":"Triangle","Object Flight Path":"Hovering then path","Viewing Distance":"21-100 Feet"}