{"Case Number":"19815","Tags":"City","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/19815.html.txt","/var/www/straped/mufon/org/19815.html"],"Summary":"It had flashing lights, and kind of a dull grey color, and spinning.","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around September 26th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.347996,+-121.887526(19815)&iwloc=A&hl=en\"> mufon case (19815) map </A>","divs":["Sighting DetailsAt the time I was at work, and was getting ready to take lunch. As I was walking to my car I looked up as I always do, and saw something in the sky,at first I thought it was just a balloon. But I decided to take a second look, and it no longer looked like a balloon, it was spinning, and flashing a light, moving very slow across the sky. I saw a co-worker and called out to him, and asked him want is that? he said that he was not sure what it was, but it sure looks strange. After watching for a while, I was walking back to my car, and another one of those things showed up, and by the time I reached my car there was a third one. They all faded away from my view. Later on during the day I called my husband and informed him of the incident, he then told me that he was in the area, and saw 4 Apache Helicopters circling the exact area where I saw the 3 objects. I don't have any pictures to prove my story, but my husband has pictures of the helicopters. I was wondering if any one else might of seen these 3 objects? Thank You"],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-121.887526","Object Features":"Undisclosed","Disposition":"Insufficient Data","Source":"MUFON","Latitude":"37.347996","Object Shape":"Flash, Unknown","Log Number":"US-10052009-0006","Country":"United States","Sighting Duration":"Undisclosed","Date Submitted":"10/05/2009 12:44 UTC","Date of the Event":"09/26/2009 01:06 UTC","Region":"California","City":"San Jose"}