{"City":"New York","Weather Factors":"Unknown","Summary":"Circular bright light suspended what seemed to be about ten thousand feet in the air","Date of the Event":"08/15/2006 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.721873,+-74.000333(19812)&iwloc=A&hl=en\"> mufon case (19812) map </A>","Tags":"City","Viewing Distance":"Unknown","Region":"New York","Country":"United States","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around August 15th 2006"],"Case Number":"19812","Object Flight Path":"Path with directional change","Longitude":"-74.000333","Disposition":"Insufficient Data","Object Features":"Undisclosed","divs":["Sighting DetailsI was out with a female friend of mine at a park in North Long Island called Caumsett. We were there to view the Persiads meteor shower. It was probably just after 12am when a bright large light caught my eye. I was laying on my back and I viewed it just for a moment; As soon as I saw it I yelled LOOK AT THAT! Before I could get my friends attention it vanished. It was the manner in which it had vanished that has me writing about it now. It was transmitting light smaller than the size of the moon but much larger than a star. In addition I could see the light glare that made the object look probably bigger than it was. It genuinely felt as if I had scared it away. That it was my bringing attention to it that provoked its disapearence. Lastly but most importantly....... it seems that it was somehow vacuumed out from the inside out. This will take explaining. it didn't vanish by a sudden burst of speed, at least not seemingly, imagine looking up through a glass ceiling with a circular napkin placed on it and directly over your head, than drawn through a circular napkin holder which is centered on top of it. To the viewer below you would see the napkin being pulled up and out through the center, than imagine it being done in less than an instant. I believe that evening I was under observation. just recently I was back there with my fiance and I meet three individuals who were at the same location as my initial siting and they had explained to me that a good friend of their's had seen a similar thing at the same park twice before. Daniel Jackman MA,."],"Date Submitted":"10/05/2009 01:18 UTC","Sighting Duration":"00:00:01","Log Number":"US-10052009-0003","Source":"MUFON","Latitude":"40.721873","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/19812.html.txt","/var/www/straped/mufon/org/19812.html"]}