{"Region":"Oklahoma","Sighting Duration":"Undisclosed","City":"Shawnee","Disposition":"Unknown","Latitude":"35.327293","Tags":"City","Longitude":"-96.9253","Weather Factors":"None","divs":["sighting detailsjust before 3 a.m. i looked out the window to check for skunks that had been bothering our house. i looked up into the sky just above the roof line of neighboring house (but in the distance maybe a mile to the north\\northest) and saw a jellybean shaped object that was flat on the bottom. it was glowing pure white, but no haze around it like from car lights or street lights. it sat there a few seconds and then zipped straight east as if being pulled along the edge of a ruler. never saw anything move like that. it had no lights except that internal glowing of the whole object. i moved quickly to the next window to the east in my house (5 feet away), but by then it had disappeared. it was not a car, as i observed for quite some time on several occasions to compare what i saw to car lights. definitely different. when i first saw it, i thought it was a ufo. i told my husband about it. later that year or next year, we were watching a ufo show and one wasa featured that looked exactly like what i saw. it was not an airplane, no blinking lights."],"Date Submitted":"10/05/2009 01:34 UTC","Object Flight Path":"Hovering then path,Straight-line path","Log Number":"US-10052009-0007","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.327293,+-96.9253(19816)&iwloc=A&hl=en\"> mufon case (19816) map </A>","Date of the Event":"09/23/2006 02:45 UTC","Object Shape":"Oval","Summary":"Bright white internally glowing flat bottomed oval zipped across sky just above roof line","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/19816.html.txt","/var/www/straped/mufon/org/19816.html"],"Source":"MUFON","Country":"United States","trends":["There have been 4 other sightings in Shawnee","There were no other sightings in Shawnee on or around September 23rd 2006"],"Case Number":"19816"}