{"City":"Broadstairs","Source":"MUFON","Date of the Event":"07/26/1955 12:00 UTC","Summary":"encounter","Object Flight Path":"Undisclosed","Log Number":"GB-10052009-0001","Latitude":"51.360163","Case Number":"19810","Object Features":"Appendage(s)","Sighting Duration":"Undisclosed","Tags":"City","Region":"England","Object Shape":"Other","trends":["There have been no other sightings in Broadstairs","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=51.360163,+1.432038(19810)&iwloc=A&hl=en\"> mufon case (19810) map </A>","Longitude":"1.432038","Date Submitted":"10/05/2009 12:02 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19810.html.txt","/var/www/straped/mufon/org/19810.html"],"Viewing Distance":"20 Feet or Less","Country":"United Kingdom","divs":["Sighting DetailsMy father was in the US Airforce stationed at Mansfield. My parents would go out in the evening leaving me with a sitter. I would be asleep when they returned. One such night, I awoke to my ceiling light being on in my room. I got up to turn off the switch and noticed all the lights upstairs were on. I walked out of my room to the upstairs landing and turned to see a figure in front of me. I was afraid but the figure mentaly told me not to be afraid, everything was alright, and to turn off the lights and go back to bed. I turned to my parents room to turn of the light and my parents were sprawled across the bed like they had been thrown there. They drank alot so who knows. I turned off the light and noticed the downstairs lights on and the front door wide open. I didn't see the figure anymore. I went downstairs, turned off the lights, closed the door and went back to bed. In the morning I tried to describe what happened, my mother thought I saw a mouse. I was frustrated at her not understanding me. A few days later we found out that a close relative, also in the AF had been killed in a car accident in Alaska. From then on I always assumed that I had seen a ghost. The figure looked like a ghost but had bright blue eyes. I was 5 years old at the time. In the past few years I have wondered if this was an alien encounter. When my dad was alive I asked him about UFOs. He never saw any but did say he had made a delivery to Area 51. He was at that time stationed at Nellis AFB near Las Vegas. He was a chief master sargent. He and another guy delivered an aircraft engine. They were surrounded by armed guards and not allowed to dismount. The engine was unloaded and they left."],"Disposition":"Unresolved"}