{"files":["/var/www/straped/mufon/html2text/19819.html.txt","/var/www/straped/mufon/org/19819.html"],"divs":["Sighting DetailsI was in New Dorp Plaza on Staten Island when I noticed three clouds in a triangle formation heading in a south west direction which would bring them almost over my head. These three clouds were blood red on the bottom, and what appeared black smoke on the top. They were about 400 feet in alittude. Ther sky was mostly blue with a wisp of white and gold clouds, which made these \"clouds\" stand out. I could see they were leaving small puffs of black behind them. Fortunately, I had my camera with me as they approached. I took three photos one right after the other. Two as they approached me, and one after they passed me. Unfortunately, I gave someone the last of the pictures years ago, and then lost the negatives. I would like to send you copies of these pictures. As I took them, I made sure I had some ground references showing When they were almost overhead, I could feel tingling on my arms as my hair stood up. Not from fear, but from static. I was too happy to be scared that I got the pictures. The bottom of the three clouds was a frightening blood red, and it churned from the outside, into itself in the middle. The speed at which it churned was violent(very fast) but the tops of these clouds had very little movement. There had to be something in those clouds to slow down the upper part of the clouds. Try to imagine a big gas explosion where the vapor cloud as it climbs folds in on itself. These clouds were not climbing, they were straight and level. When they passed over Hylan Blvd, they made a slight change in direction, turning a little more to the south, following along side of Hylan Blvd. I believe the speed limit on Hylan Blvd was 45 miles and hour and as it followed Hylan Blvd, I could see it was traveling slightly faster then the cars on the blvd or 50 to 55 miles an hour. I told friends and family, but I got the usual disbelief. Years later, when I saw the movie Independence Day, I almost fell out of my seat, knowing I had seen a UFO that appeared to be a cloud. The ones I saw werer about 150 feet wide, and cigar shaped. I am sending you copies of the two photos I have. Look at the \"clouds\" and notice how they changed slightly in various places, and this was within seconds of each photo being taken. Also, look at the puffs of black behind and in the distance."],"Disposition":"Unresolved","City":"New York","Object Shape":"Cigar, Fireball","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 31st 1988","This sighting has never been favorited.",""],"Weather Factors":"None","Summary":"Three unusual clouds traveling at about 45 miles an hour.","Region":"New York","Date Submitted":"10/05/2009 08:12 UTC","Tags":"City","Longitude":"-74.144091","Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Case Number":"19819","Object Flight Path":"Path with directional change","Date of the Event":"07/31/1988 04:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.580552,+-74.144091(19819)&iwloc=A&hl=en\"> mufon case (19819) map </A>","Log Number":"US-10052009-0010","Country":"United States","Latitude":"40.580552"}