{"Country":"United States","Case Number":"19811","City":"Rollin","trends":["There have been no other sightings in Rollin","This sighting has never been favorited."],"Summary":"Two distinct objects, One Rectagular & One Disc","Log Number":"US-10052009-0002","Date of the Event":"10/04/2009 11:03 UTC","Object Features":"Dome","Longitude":"-84.308333","divs":["Sighting DetailsFull Moon, Mostly Clear Sky. I went out on the Balcony of the cottage overlooking Round Lake to smoke a cigarette. As soon as I stepped outside I noticed a bright Tall Box shaped object moving accross my view from the left. I saw it very clear. It had three sets of multi color blinking lights. It suddenly mad a sharp right turn and the lights went out and I could not see it. I went inside to tell my wife what I had saw then grabbed my cellphone to use its camera in case I saw it again. I went back onto the balcony and almost instantly noticed another very bright object moving in the night sky towards where I was at. This object was a bright white disc shaped object that had a round center. I was able to get a picture of this object before it turned and then went straight up and at a high rate of speed. I have attached the picture I took. Please let me know if anybody else has reported seeing these objects. I have seen many airplanes in the air and can tell you that these were not planes or helicopters. Thank you"],"Region":"Michigan","Object Flight Path":"Path with directional change","Latitude":"41.969722","map":"<A HREF = \"http://maps.google.com/maps?q=41.969722,+-84.308333(19811)&iwloc=A&hl=en\"> mufon case (19811) map </A>","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Tags":"City","Object Shape":"Disc, Square, Rectagular","files":["/var/www/straped/mufon/html2text/19811.html.txt","/var/www/straped/mufon/more/19811_submitter_file1__RoundLake11PM10-4-09.jpg","/var/www/straped/mufon/org/19811.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Date Submitted":"10/05/2009 12:08 UTC","Disposition":"Insufficient Data","Source":"MUFON"}