{"Source":"MUFON","Region":"California","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.615094,+-118.053245(19820)&iwloc=A&hl=en\"> mufon case (19820) map </A>","Latitude":"36.615094","Country":"United States","Date Submitted":"10/05/2009 08:33 UTC","Case Number":"19820","Viewing Distance":"Unknown","divs":["Sighting DetailsThe evening of September 26 at 19:17. Four friends and I were at a cabin in the Whitney Portal area 10 miles West of Lone Pine CA. We witnessed a bright blueish light traveling South East, or parell to the Eastern Sierra mt. range. I saw it first and mention to my friends \"I see satalite\" as it was traveling as fast as many of satalites that we have seen from the same location. We all looked and commeneted on how bright it was and said that it was because the sun had set an hour before and was really getting a good refelection off of it. We all agreed that it wasn't an airpane because we could not see any ID lights. Jets that normaly cross the sky in that area are very identifible by the flashing lights on the wings and then the sound as they pass over going East or West. Some one said that the object looked to be lower than a commerical jet but made no noise. I made a comment that it might be the space station. At that moment it made a course change to the East. The change was slight enough that we had to asked each other it it had changed direction. We watched it for about 1 minute until it went out of our sight behind 12,000' ridge. The speed didn't change at all. By the time I got the camera the object was gone. To me the object was 2x brighter than Venus and had the same glow as Venus. No shimmer as with a star. The light did not fade as it turned to the East."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/19820.html.txt","/var/www/straped/mufon/org/19820.html"],"Tags":"City","Log Number":"US-10052009-0011","Weather Factors":"Unknown","Object Shape":"Saturn-like","City":"Lone Pine","trends":["There have been 2 other sightings in Lone Pine","There were no other sightings in Lone Pine on or around September 26th 2009"],"Object Flight Path":"Path with directional change","Disposition":"Insufficient Data","Summary":"Very bright satrun-like object traveling SE over Whitney Portals then turned to the East.","Longitude":"-118.053245","Date of the Event":"09/26/2009 07:17 UTC"}