{"Longitude":"-72.07271","Latitude":"41.530265","Sighting Duration":"Undisclosed","Date Submitted":"10/05/2009 10:58 UTC","Case Number":"19823","Object Shape":"Cross","Log Number":"US-10052009-0014","Disposition":"IFO","Region":"Connecticut","trends":["There have been 2 other sightings in Norwich","There were no other sightings in Norwich on or around September 30th 2009","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19823.html.txt","/var/www/straped/mufon/more/19823_submitter_file1__BALTICUFO.jpg","/var/www/straped/mufon/org/19823.html"],"Summary":"SIMILAR TO A TIC TAC TOE DESIGN FLEW WEST TO EAST","Date of the Event":"09/30/2009 07:45 UTC","Weather Factors":"None","City":"Norwich","divs":["Sighting DetailsAT 7:45 PM IT WAS RATHER DARK OUT, IN BALTIC CT. [EASTERN CENTRAL CONNECTICUT] NEAR THE CITY OF NORWICH. MY FRIEND AND I ARE BOTH PILOTS AND AVIATION MAINTENANCE TECHNICIANS. JUST BEFORE WE QUIT WORKING ON MY RV., WE WATCHED THIS OBJECT FOR ABOUT 2 MINUTES. IT CONTINUED ON ITS PATH AND DISAPEARED BEHIND THE HILLS. IT IS POSSIBLE THE OBJECT WAS THE ISS, MOVING FROM WEST TO EAST. IF NOT, ALTITUDE APPEARED TO BE LOW IN AROUND 1500 TO 2000 FT. NO SOUND, NO CONTRAIL. OBJECT TRAVERSED SLOWER THAN AIRCRAFT AND SEEMED VERY LARGE AS IN A LARGE JET AT LOW ALTITUDE. COLOR WAS BRIGHT YELLOW WHITE. THERE WERE NO NAV LIGHTS OR PULSATING COLLSION STROBES. ONE EARLY CONCLUSION OF MINE AND MY FIRST THOUGHT WAS, IF THIS WAS THE ISS., IT NOW APPEARS INCREDIBLY LARGER THAN IT DID 3 YEARS AGO. I ADMIT IT SHOULD APPEAR LARGER BUT IT SEEMED MUCH LARGER THAN I EXPECTED. ADDITIONALY, I HAVE SOME RATHER MORE INTERESTING SIGHTINGS, FROM OVER THE LAST 42 YEARS, HOWEVER THIS IS FIRST OFFICIAL REPORT SINCE THAT TIME. I HOPE ILL HAVE THAT OPPORTUNITY TO SHARE MY OTHER SIGHTINGS IN THE NEAR FUTURE."],"map":"<A HREF = \"http://maps.google.com/maps?q=41.530265,+-72.07271(19823)&iwloc=A&hl=en\"> mufon case (19823) map </A>","Tags":"City","Source":"MUFON","Object Flight Path":"Straight-line path","Country":"United States","Object Features":"Patterned Surface"}