{"divs":["Sighting DetailsI was driving home from class at about 9:30 pm on October 5th, 2009. As I was driving on highway 340, I saw what looked like an airplane in the sky. About a minute later, I was getting closer to it and it looked to be unusually low flying. Like perhaps only 150-200 feet in the air. It was triangle shaped, had green and red flashing lights, and one bright white light. As I looked at it, the white light got brighter and brighter. I did not hear any type of engine. Then it floated slowly behind the tree line so I couldn't see it. I then drove about a mile down the road and parked at the local middle school. I sat there for about 5 or 6 minutes and observed several of these objects on the horizon. They were farther away than before so they were not as bright. I observed one of them increase its altitude by a few hundred feet in a short amount of time and then disappeared. It may have just turned its lights off. I then continued on my way home on some back roads. About 5 minutes later, I was driving down a back road when I entered a clearing. I then observed the same thing I saw back on highway 340.. although I assume it was a different object since there were several in the sky. It was triangle shaped, green and red flashing lights, and a bright white light.. only a few hundred feet in the air. I also saw another car parked on the road with two men looking at the same object. After a few minutes, it floated off and I drove a few more miles home. At home, I saw a few more objects in the distance but nothing as close as before."],"Longitude":"-87.122315","Date of the Event":"10/05/2009 09:30 UTC","trends":["There have been 7 other sightings in Brazil","There were no other sightings in Brazil on or around October 5th 2009"],"Summary":"Saw multiple triangle shaped UFOs with green/red/white lights. Some were low flying and very bright.","Log Number":"US-10052009-0017","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Country":"United States","Region":"Indiana","City":"Brazil","Tags":"City","Latitude":"39.524772","map":"<A HREF = \"http://maps.google.com/maps?q=39.524772,+-87.122315(19826)&iwloc=A&hl=en\"> mufon case (19826) map </A>","Object Shape":"Flash, Triangle","Case Number":"19826","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19826.html.txt","/var/www/straped/mufon/org/19826.html"],"Date Submitted":"10/05/2009 11:54 UTC","Disposition":"Insufficient Data"}