{"files":["/var/www/straped/mufon/html2text/19828.html.txt","/var/www/straped/mufon/org/19828.html"],"City":"Utica","Weather Factors":"None","Disposition":"Insufficient Data","Region":"New York","Case Number":"19828","Object Shape":"Fireball","divs":["Sighting DetailsI've seen this UFO a handful of times around 2001-2002 and I was a fairly light sleeper due to this first encounter. I was 14 or 15 yrs old when it first happened. In this particular encounter I woke up around 3 AM and noticed the radio station I was listening to was tuning in and out so I got out of bed to adjust the tuning. I noticed that there was a light outside my bedroom window and I thought it was probably from the headlights of a car coming down the hill. After I realized the light wasn't going away I looked out the window to notice a large sun colored object above the horizon. It was slightly smaller than the moon and was the same color as the sun. It hovered on the horizon staying in the same place for a half an hour to 45 min. During that time the radio was just static. I had no idea what it could have been, the closest military base was legitimately decomissioned over five years prior, and having previous experiences with UFO's I was partialy biased to assume what it could have been. It did not move the entire time and was not changing color or making any noise. The interference from the radio was the only other marker of its presence. After 45 minutes The glowing object was gone. I did not witness how it left, I was just happy that it was gone. I was terrified by the sighting. There were several times after this that I noted a similar bright light outside my window for and extended period of time in which I suffered from sleep paralysis and was fully concious but unable to move or look out the window. These episodes occured around the same hour of the morning with the same effect on the radio but I was physically unable to move and I could barely open my eyes. I felt extremely drowsy but was still aware of my surroundings."],"Source":"MUFON","Object Flight Path":"Stationary","Tags":"City","Date Submitted":"10/06/2009 01:57 UTC","Viewing Distance":"Unknown","Country":"United States","trends":["There have been 16 other sightings in Utica","There were no other sightings in Utica on or around September 19th 2001"],"Longitude":"-75.231164","Object Features":"None","Summary":"Fireball Over The Horizon in Clinton, NY","Latitude":"43.104603","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.104603,+-75.231164(19828)&iwloc=A&hl=en\"> mufon case (19828) map </A>","Log Number":"US-10062009-0002","Date of the Event":"09/19/2001 03:15 UTC"}