{"Date Submitted":"10/05/2009 11:19 UTC","Case Number":"19825","Object Shape":"Triangle","Date of the Event":"06/18/1990 10:33 UTC","Country":"United States","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19825.html.txt","/var/www/straped/mufon/org/19825.html"],"trends":[],"Object Features":"None","Weather Factors":"None","Tags":"City","Sighting Duration":"00:06:00","divs":["Sighting DetailsI was on my break from my job at a movie theater in what used to be a big empty desert that backed up to where I used to work. I was sitting in my car eating my lunch and I noticed a light in the distance that was brighter than the rest of the stars. It slowly moved from far off in the distance and got closer to where I was. Other people who were leaving after a movie got over were parked next to me and when they saw the object, they stopped with their doors open and watched with me. As it got even closer, it must have been less than a quarter mile a way and slowly made its way above us and we watched as it went overhead. It was a large black triangle that moved too slow to be a aircraft. It made a slight humming sound as it got overhead. It continued above and turned slightly to the north. I remember the next day I was channel surfing and while flipping through the channels, I saw a story coming on the local news with a picture of what I saw. I was flipping channels so fast that I missed the story. I tried to go back and find the channel but it was too late, I had missed the news story. This has always made me angry that was unable to catch the news story, as I know I am not the only one who saw this. As the object traveled overhead, I got in my car and followed it around a little. Other people did the same, we drove around real slow just starring at it and each other. I am not a crazy person and I believe that most of the sighting are actually explainable. This however, I don't believe can be explained away. As years went on, I saw news reports and shows on television that show what I saw."],"Longitude":"-111.091061","Region":"Arizona","Log Number":"US-10052009-0016","map":"<A HREF = \"http://maps.google.com/maps?q=34.058068,+-111.091061(19825)&iwloc=A&hl=en\"> mufon case (19825) map </A>","Summary":"This was a black triangle which made a slight humming sound.","City":"Undisclosed","Latitude":"34.058068","Object Flight Path":"Path with directional change","Disposition":"Unknown"}