{"Summary":"Triangle. Slight illumination at all three points","City":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Florida","Date Submitted":"10/06/2009 07:23 UTC","Log Number":"US-10062009-0012","Object Shape":"Triangle","Object Flight Path":"Straight-line path","Latitude":"27.671377","Case Number":"19838","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/19838.html.txt","/var/www/straped/mufon/org/19838.html"],"Source":"MUFON","Country":"United States","divs":["Sighting DetailsWe had just had the first front of the season and the night was very clear and free of humidity. there was a full moon in the east. My girlfriend and i were walking our dogs in the side yard (double lot) I was looking up and to the west at the stars, as i said it was a super clear night when movement caught my eye...it looked almost like a wisp of a cloud or mist. I focused on it and realized i was looking a a craft of some sort. i watched it all the while trying to get my girlfriend to come over and see it. by the time she had, all she saw was a white hue (she also did not have her contacts in)..which at that point is what it looked like to me. it was moving north to south. i got a very good look at the craft, it was a triangle, of that i am sure. If i had not been looking right at it, it would have been hard to see ...no lights, it was illuminated by my guess from the full moon and the ambient light from below...it was clearly defined and a triangle..moving fairly slow..also quiet, not a sound, the corners seemed to have a bit more illumination. this was not a glimpse of something far off. it was just west and almost above. i watched it for a good 10-12 seconds..i of course looked up this sort of thing online and thought it important to note that our house in approx 200 yards from I-75, because it was traveling parallel to it, seems to be a trend. also would like to note that even though I'm 41 i just had on eye doctor visit and my vision is still 20 20. An amazing experience and i feel very lucky to have witness such a thing. if it was ours...we have some very advanced technology. But I truely feel it was something else, as crazy as that sounds...it just had that feel."],"map":"<A HREF = \"http://maps.google.com/maps?q=27.671377,+-81.514094(19838)&iwloc=A&hl=en\"> mufon case (19838) map </A>","Tags":"City","trends":[],"Longitude":"-81.514094","Disposition":"Unknown","Date of the Event":"10/01/2009 10:00 UTC","Object Features":"None"}