{"City":"Road E95(?)","Date Submitted":"10/06/2009 07:48 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.100582,+31.166437(19830)&iwloc=A&hl=en\"> mufon case (19830) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/19830.html.txt","/var/www/straped/mufon/org/19830.html"],"Disposition":"Unresolved","Object Shape":"Disc","Country":"UA","Date of the Event":"11/30/1997 12:00 UTC","Object Features":"Dome","Region":"","Viewing Distance":"Unknown","Latitude":"51.100582","Source":"MUFON","divs":["Sighting DetailsI believe it happened in 1998 as it was long ago and I can't simply remember the exact year, but it was in the late 90s. My parents and me were going from Kiew to Odessa, on the road which i believe is named E95. It is hard to say what could be the nearest town or village because there was just nothing around there: no houses, no trees, simply nothing. My dad was driving a car and mom sat next to me. I remember she talked to him and I turned my head and looked at the window as I always do during any travelling (just like pretty anyone I guess). And then I spotted THIS. It was approx. 11.00am, summer, awesome weather, blue clean sky (not a single cloud), so it could be nothing else but ufo. There was nothing else around... I've seen this object which looked like a gray saucer. It didn't look flat, not 2d-like, it looked absolutely 3-D. It wasn't that high in the sky. Somewhat at the same hight like you usually see a helicopter but I would say it looked much bigger than that, so I've clearly seen the shape which was very sharp, btw... No lights, nothing like that. I shaked my mom's hand and said \"look!\" then she saw it and we understood we have seen the same exact thing (I just wanted someone else to see it as well). My both parents have seen it with me. It was in a sky for about 20 min \"hanging\", just not moving at all. I remember that we sat smiling but reaction was very calm while we were observing it. I didn't turn my head a single time, i couldn't... I wanted to remember every single moment. Then after 20 min it moved higher which was so fast... about a second, def. not longer. Then it stopped for a few seconds and moved much higher even faster... It was something beyond my vision abilities, I must say, i felt like it wasn't even a second... Then it became really tiny (size of a small pearl) and just disapperead. We discussed our emotions about it afterwards. Since then there was a tiny amount of people who knew that we have seen it. We had no pictures of it, no tape, so no avidence... Who would believe that? I know def. what it was, me and mom still remember this moment. At the time I lived for a long time next to the airport so I know how planes look like, Ive seen them very often in a day time and at night. And this object was nothing like I've ever seen before. I didn't know where could I report it and was rather scared to do so, because people might think I'm crazy... I must say I don't say that UFOs are all about aliens. Who knows what is that. I'm afraid we will never know and it will always stay a secret, but that \"event\" sort of changed my life..."],"Log Number":"UA-10062009-0004","Case Number":"19830","Object Flight Path":"Straight-line path,Path with directional change","Longitude":"31.166437","Weather Factors":"Unknown","Sighting Duration":"00:20:03","trends":["There have been no other sightings in Road E95(?)","This sighting has never been favorited."],"Summary":"\"saucer\" in the sky above the field, day time (Ukraine)"}