{"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.315244,+-83.475476(19833)&iwloc=A&hl=en\"> mufon case (19833) map </A>","Latitude":"42.315244","Object Shape":"Triangle","Tags":"City","Date of the Event":"10/01/2009 09:30 UTC","Date Submitted":"10/06/2009 02:18 UTC","Summary":"Hovering triangle shaped object at cloud level with lights at corners.","Country":"United States","Sighting Duration":"01:00:00","divs":["Sighting DetailsMy dad is 82 and this is what he told me just recently. He seemed excited and this was his first ever sighting. On approx. Tues, Weds or Thursday of late Sept or early Oct of 09 he saw an object. He can give you better details if contacted. He was not going to call or write but I told him that I would. At about 9:30 am he was sitting in living room of condo and saw odd lights thru skylight in roof. It was a fairly sunny morning and he wondered what this could be. It was not a reflection thru skylight. He watched the lights and decided to get out binoculars. Looking up he saw a triangular shaped object, tilted at and angle with lights at the corners. They were very bright. The object appeared to be gray in color and it remained in the sky above his home for approx. 1 hour. He told me that it was cloud level, fairly high up but he could definatley see the object pretty well. He watched on and off over the hour and eventually it was gone. Said it wasn't a plane, blimp or anything else he'd ever seen. Too high for most smaller, known aircraft. No vapor trail or movement, just stayed in one place. He made a drawing of this. He is 82, pretty level headed and a smart man. He seemed kind of excited for seeing this. I looked on internet and asked around but nobody else seems to have seen this that day. Thanks-Doug (son)"],"Case Number":"19833","Region":"Michigan","Longitude":"-83.475476","Viewing Distance":"Unknown","Disposition":"Unknown","Log Number":"US-10062009-0007","files":["/var/www/straped/mufon/html2text/19833.html.txt","/var/www/straped/mufon/org/19833.html"],"Source":"MUFON","City":"Canton","trends":["There have been 16 other sightings in Canton","There were no other sightings in Canton on or around October 1st 2009"],"Weather Factors":"Unknown"}