{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/06/2009 09:24 UTC","trends":["There have been 15 other sightings in San Clemente","There were no other sightings in San Clemente on or around October 5th 2009"],"Sighting Duration":"Undisclosed","Longitude":"-117.609572","files":["/var/www/straped/mufon/html2text/19840.html.txt","/var/www/straped/mufon/org/19840.html"],"Latitude":"33.436093","divs":["Sighting DetailsCamp Pendleton, San Diego County, 8:15 p.m., October 5, 2009 - We were driving north on the San Diego Freeway (Interstate 5) through Camp Pendleton when all of a sudden a bright red light caught my attention to the left out over the ocean, maybe about a mile or so ahead of our car. It was so unusual I could not stop staring at it. I did not know what it was and it did not appear to be like any aircraft such as a helicopter or plane of any sort. It glowed very intensely and pulsated at a regular interval, maybe 1 or 2 seconds apart. The intensity of the light was strong and constant. The color was ruby-like or light reddish. My instinct told me this was not any regular flying craft that I knew of. The light was much too intense to be of any known aircraft lighting system and there were no other lights blinking or stationary on it as you would normally see on a plane or helicopter. The object was stationary for several seconds and then began to move eastward toward the San Onofre Nuclear Generation Station which was on the beach side of the freeway as we travelled north. As it approached the nuclear plant it disappeared and faded away and then I knew this was no regular or military aircraft. As its light disappeared I intently kept watching to see if it would appear again and only a few seconds later IT REAPPEARED ON THE OPPOSITE SIDE OF THE FREEWAY ACROSS FROM THE NUCLEAR PLANT NEAR THE MOUNTAIN RIDGE where it moved eastward for a few seconds and then disappeared behind the mountain ridge into the valley behind it. Its light appeared to fade as it moved right behind this edge of the mountain. I'm wondering if this object was flaunting itself as it could be clearly seen by anyone on the busy freeway, and then all of a sudden, it wanted to travel over the freeway unseen and then reappear on the other side in clear view. Now, here you have a military base AND a nuclear generating station together where an unusual flying object is seen hovering and flying, could it be attracted to these for some reason? Also, when it reappeared, it was near the several high voltage power lines emanating from the nuclear power plant. Could it have been attracted to the large magnetic fields of these power lines running up the mountain or could these have disrupted it power source as it faded away? I used to be a skeptic but I am a firm believer now. This is the real deal."],"Tags":"City","Weather Factors":"None","Date of the Event":"10/05/2009 08:15 UTC","Object Shape":"Flash, Sphere, Other","Source":"MUFON","Log Number":"US-10062009-0014","City":"San Clemente","Object Flight Path":"Hovering then path","Disposition":"Insufficient Data","Country":"United States","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.436093,+-117.609572(19840)&iwloc=A&hl=en\"> mufon case (19840) map </A>","Summary":"Intense Pulsating Ruby-Colored Orb Appears, Disappears, Then Reappears, Then Disappears","Case Number":"19840","Object Features":"None"}