{"map":"<A HREF = \"http://maps.google.com/maps?q=35.886478,+-84.502225(19842)&iwloc=A&hl=en\"> mufon case (19842) map </A>","divs":["Sighting Details I was working at the church trimming a hill side. I was in a lighted area, while I was trimming there was something blocked the light behind me. when I turned scared, there would be nothing there, then I went back to work trimming, then it happens again there was nothing there. when I turn around so I went back trimming again after I finish I walk back to my truck. I put my trimmer in the back of my truck. Then I open my truck door and got my HD camera. I set my camera on low light setting then I started taking pictures. I was testing my camera out it was a new camera then I notice a light in a distance so I took a picture of it. UFO pictures are hard to get most of the time I never have a camera with me when I had a UFO sighting. then I went back and got into my truck and went home. after I got home. I was in my living room my wife was setting on the love seat she yelling at my son he was in the other room. I was standing in the living room. There was a small red light appeared inside of my house inside of my picture window in between the curtains. it got real bright, then it disappeared while I was looking at the light, then I told my wife to stop yelling at Jimmy. then I told my wife there was a red light appeared behind her while she was setting on the love seat. The next morning I was up watching TV in the living room. I was seating on the floor in front of the TV it was daylight outside. I turn and looked at my curio cabinet as soon as I turn and looked at the cabinet the lights inside of the cabinet came on by itself I don't know why it came on, but it did. I got up and cut the lights off. I am sending two pictures the two pictures is the same picture but one of them is crop so you can see the UFO better"],"Disposition":"Unknown","City":"Kingston","Log Number":"US-10072009-0002","Object Shape":"Disc","Viewing Distance":"Unknown","Region":"Tennessee","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/19842.html.txt","/var/www/straped/mufon/more/19842_submitter_file1__ufopic180.jpg","/var/www/straped/mufon/more/19842_submitter_file2__ufopic181.jpg","/var/www/straped/mufon/org/19842.html"],"Summary":"i was working at a church i got a picture of a ufo while i was at the church","Latitude":"35.886478","Case Number":"19842","Source":"MUFON","Tags":"City","Date of the Event":"09/11/2009 09:10 UTC","Date Submitted":"10/07/2009 01:06 UTC","Country":"United States","Object Features":"Undisclosed","trends":["There have been 5 other sightings in Kingston","There were no other sightings in Kingston on or around September 11th 2009","This sighting has never been favorited.",""],"Longitude":"-84.502225","Weather Factors":"Unknown"}