{"Longitude":"-81.867908","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=26.642958,+-81.867908(19849)&iwloc=A&hl=en\"> mufon case (19849) map </A>","Object Shape":"Sphere","Tags":"City","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Date of the Event":"01/04/2006 12:00 UTC","Country":"United States","Weather Factors":"Unknown","Object Features":"None","Viewing Distance":"101-500 Feet","Latitude":"26.642958","divs":["Sighting Details While fishing at night on a pay per person boat out of the Fort Myers Beach area the boat was circled by a glowing light. The captain was positioning the boat over a fishing spot, he had dropped the anchor and backed the boat over the spot. Just as he rang the bell to signal everyone to drop their lines down, the mate on the back of the boat who was there to help us untangle lines and tie on new hooks, etc, pointed up and said \"Look, a ufo.\" Thinking he was joking I looked up and saw a glowing ball of light coming down the left side of the boat from the front. It continues past the boat, after it was maybe 100 yards away it turned left, went across the back of the boat, made a left turn and went up the right side of the boat. As it went up the right side of the boat it gained altitude, then accelerated rapidly up at a slight angle and went out of sight. it made no sound at all. I looked back at the mate, said \"That was a ufo.\" He said, \"We see them out here all the time.\" He was not excited at all, he went back to work helping take fish off lines as the fishermen caught them. It made me believe he probably did see a lot of them, he never mentioned it again. It didn't seem to be a big deal to him at all. The ball of light we saw was not very big. It was hard to tell exactly how far it was from the boat but I'd guess it was 100 to 150 yards away and about the size of a beach ball. It made a straight pass down one side of the boat, turned 90 degrees to the left , made a straight pass across the stern, turned 90 degrees to the left again and went in a straight line up the right side, except as it went up the right side of the boat it gained altitude and accelerated. It was not exceptionally bright, I would think if it had been during the day we might not have seen it at all. The night was very dark, perfectly clear but with no moon. The object seemed to be under control since it stayed the same distance from the boat all the time. It was like the object was looking the boat over. I am not certain of the exact date this event happened but if necessary I could check with friends who were on the boat with me. They were visiting from out of state, would probably be able to help me pin down the date and time very closely. I have been in touch with Morgan Beall from MUFON in Fort Myers, Florida. He suggested I make this report. I'll be happy in any way I can to help him investigate this."],"Case Number":"19849","Date Submitted":"10/07/2009 03:01 UTC","Log Number":"US-10072009-0009","Region":"Florida","Summary":"A small light, maybe 2 feet across circled a fishing boat.","City":"Fort Myers","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around January 4th 2006"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/19849.html.txt","/var/www/straped/mufon/org/19849.html"]}