{"Latitude":"38.591052","Date of the Event":"10/06/2009 11:15 UTC","Log Number":"US-10082009-0001","Longitude":"-121.48598","Summary":"Blackish/Grayish Triangular object/ looked like there was some kind of cloaking enabled- Kind of like the movie Predator","Disposition":"Insufficient Data","Viewing Distance":"Unknown","divs":["sighting details i was sitting on my front porch talking on the phone with a friend from back east. it was late in the evening; quarter past 11 or so when i looked up in the sky and as soon as i did, i saw a damn ufo. i knew exactly what it was when i saw it. it was blackish\\greyish with...some kind of cloaking devic. it resembled the camo of the alien in the movie predator. it was moving very fast and in a straight line. i lost sight of the ufo in a couple of seconds. i was traveling westbound in a straight line. i know it was relatively close to the ground because because of its size. i did not hear anything though or see any lights of any kind. when i saw it, i knew exavtly what it was and a sence of pure honor\\luckieness came over me. i never doubted it for a second that it was not a ufo.it was unmistakeable! i told the person on the phone what i saw and she thought i was nuts. it sounds nuts, i know. i hope to see something like that again in my lifetime, but probably won't. it was such a blessing to see. thank you"],"trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around October 6th 2009"],"City":"Sacramento","Object Shape":"Triangle","Tags":"City","Region":"California","Country":"United States","Date Submitted":"10/08/2009 12:19 UTC","Sighting Duration":"00:01:03","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.591052,+-121.48598(19855)&iwloc=A&hl=en\"> mufon case (19855) map </A>","files":["/var/www/straped/mufon/html2text/19855.html.txt","/var/www/straped/mufon/org/19855.html"],"Object Features":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Case Number":"19855"}