{"divs":["Sighting DetailsAlright.. hands down i have possibly the best daytime u.f.o pictures in the world right now. the pictures were taken with a 1.3 mega pxl lg camera phone. I sent the pictures to e-mail then enhanced the three pictures on photo paper the size of a 22 inch flat screen t.v. they are breath taking to look at and i feel they are worth alot of money. I consider myself a ufologist. When i see all the folklure and fake images it really really irritates me because people can be so ignorant. It's been said by a million people that we are not alone. my three pictures even show movement, the tree line, clouds, the sun, and i zoomed in on one shot which shows deapth perception. The orb huvered underneath the sun on a tilt resembles a fire bright yellow orange color that was almost as bright as the sun. when i took these pictures the camera picked up a redish ora pulsating off this E.V.T.that the naked eye could not see. To whom this may concern feel free to contact me because i would love for someone to try and debunk my siting.I am currently in scottsdale Arizona for the next three weeks. Once again i would like to sell my only copies for a reasonable price. They are just astonishing to look at.the pictures are not yet certified waterloo or whatever you call it. I was in a field playing soccer. i walked from the soccer feild through to another feild on my way to a friends and saw what i thought was a bright reflection of something. It stayed huvering on a tilt about 200 feet off the ground. I got goose bumps, chills, i was wishing there were people around to see this phenomena. I am allways taking pictures of things with my phone so i pulled it out immediatly hit the button on the side of the phone that turns on the camera, i had like 2 or 3 minutes to take three pictures one on zoom. The ufo pulsated and moved under the sun now looking like an firey oval shape huvering horizontal. It became blinding to look at considering it was blending right into the sun. Next was the disapearance into the sun. The pictures also tell a story."],"Date of the Event":"08/03/2008 06:28 UTC","Log Number":"US-10082009-0004","Date Submitted":"10/08/2009 08:21 UTC","Source":"MUFON","Summary":"I have the most amazing day time photos.I've seen similar e.v.ts","Latitude":"42.833774","Tags":"City","Region":"New York","City":"half moon","Country":"United States","Case Number":"19859","Longitude":"-73.721041","trends":["There have been no other sightings in half moon","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/19859.html.txt","/var/www/straped/mufon/org/19859.html"],"Weather Factors":"Light","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=42.833774,+-73.721041(19859)&iwloc=A&hl=en\"> mufon case (19859) map </A>","Sighting Duration":"Undisclosed","Object Shape":"Egg, Oval, Saturn-like","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}