{"Log Number":"US-10082009-0002","Country":"United States","Case Number":"19857","Date of the Event":"09/12/2009 09:15 UTC","Sighting Duration":"Undisclosed","Tags":"City","Object Shape":"Circle, Other","Weather Factors":"Unknown","Summary":"Saw three bright orange lights in sky that moved in relation to each other.","Date Submitted":"10/08/2009 04:35 UTC","Source":"MUFON","divs":["Sighting DetailsI clean a small office on the NW corner of Lilly Road and Capitol Drive. I was working with my son. Stepped out to the truck to get some furniture polish. Out of the corner of my eye I saw three lights that looked like lights on a TV broadcast antenna. I got the polish and was thinking \"I don't remember there being an antenna there in the middle of a residential area. So I looked again and noticed the lights were moving slowly. (Looking East-North East. I looked to see if there were blinking lights which would identify the lights as an airplane or helicopter. No blinking lights - just bright glowing orange kind of light. I went inside the office and called my 19 year old son out. By that time the lights were descending and disappeared behind the tree line. We thought they were gone but we could see the lights close to the ground through spaces in the trees. Then the three lights started to rise. My son had his little video camera in the truck and he started recording the movements of the lights. He didn't have a tri-pod so it was hard to stay on target. But you can see that these lights were definitely not planes or a helicopter. They made no noise. The three lights may have been part of a triangular shaped object but we couldn't see any structure between the lights. I will try to attach the video. The next week we went to the cleaning job early while there was daylight. The area about a half a mile in the direction we saw the lights is a large highschool yard right next to some low wet lands. It looked to be about 100 feet lower than the location where we had observed the lights. This would explain how the lights would look like they were almost at ground level behind the trees but if they were over the swampy area they would have been as much as a 100 ft. in the air. We watched the objects until they suddenly disappeared. There is a bright gas station across the street that didn't affect the visibility of the objects. Also the noise is because its a very busy highway. It was traffic noise not the objects. I have since watched planes fly over that area and you could hear them. These craft made no noise whatsoever. The attached media can be opened in Windows Media Player."],"Longitude":"-88.103419","Disposition":"Unresolved","City":"Brookfield","trends":["There have been 5 other sightings in Brookfield","There were no other sightings in Brookfield on or around September 12th 2009","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Straight-line path","Region":"Wisconsin","Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.067037,+-88.103419(19857)&iwloc=A&hl=en\"> mufon case (19857) map </A>","Latitude":"43.067037","files":["/var/www/straped/mufon/html2text/19857.html.txt","/var/www/straped/mufon/org/19857.html"]}