{"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/1985.html.txt","/var/www/straped/mufon/org/1985.html"],"Date of the Event":"11/24/2002 07:25 UTC","Region":"Texas","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.802955,+-96.769923(1985)&iwloc=A&hl=en\"> mufon case (1985) map </A>","Case Number":"1985","Weather Factors":"Unknown","divs":["Sighting DetailsLike a blob of round objects, almost w shaped, silent and moving at about 100 -200 miles and hour. Not a plane. Totally silent, moving from Southesta Dallasto NW Dallas towards I 75 Centarl Expressway. Neighbors were across the steetfrom 6244 Highgate Lane in Dalls. I walked out front after watching the UFOwith my roomate in back Facing South, and then I went to the North front yardand saw my neighbors looking at the sky. Did you see that They acknowledgedand thought it was like a big black handglider or baloon, but not really. I andSteve saw a light, dim but in the front of the shape. The neighbors did notreport seeing a light, or remember seeing one. Eeirre. My first thought wasthat it was a huge clump of black baloons, but the cold front is coming intonight from the north and winds are out of the northwest, The shape washeading Northwest. Very large and undefinable. Very very black. Tinyintermittent white light in the fore of the shape. Heading for North CentralDallas at an elevation of about 500-900 feet. Black shape clearly definedagainst white night clouds coming in from the nortwest. 4 Searchlights wereshining a 4 split configuration to the north of the object, shining against theclouds, converging and sepaerating into 4 lights, then reconverging. Lookedlike an open house lighting searchlight display. This continued past the UFOsighting. After about 10 minutes after the sighting , a small jet was seenfllowing the same trajectory as the UFO. Very weird. Very Creepy. Neighborsand roommate saw it at the same time."],"Summary":"UFO","Latitude":"32.802955","City":"Dallas","Object Features":"Undisclosed","Sighting Duration":"00:00:59","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around November 24th 2002"],"Longitude":"-96.769923","Country":"United States","Date Submitted":"11/24/2002 07:25 UTC","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":""}