{"Weather Factors":"Unknown","Case Number":"19868","Tags":"City","Longitude":"-118.238725","Date of the Event":"07/07/1994 10:30 UTC","Disposition":"IFO","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/19868.html.txt","/var/www/straped/mufon/org/19868.html"],"Latitude":"34.062094","divs":["Sighting DetailsThee diamond shaped craft flying in very close formation traveling from South towards the North. On my birthday, I received a pair of binoculars and would spend about a half hour per night viewing the night sky in my back yard. Having heard the clearest way to view stars in a bright city is to look straight up. I was viewing night sky on the day of the incident for about 10-15 minutes when three diamond shaped craft flew in my viewing field. There were no lights emanating from craft and the objects were much darker than the sky around allowing one to see the shape of the craft. Objects flew in very tight formation with no noticeable deviation in flight path nor deviation in flight formation. Each object clearly outlined due to contrast between the objects and the sky and stars could be clearly seen between the objects. The sighting took only a handful of seconds and the objects appeared to be, in my estimation, 3500-5000 feet in altitude and traveling about 200-250 mph. Since binoculars have a small field of view, objects were easily lost never to again to be seen. Highly excited, ran inside to tell family member."],"Sighting Duration":"Undisclosed","Source":"MUFON","Summary":"Three diamond shaped craft with no lights over Los Angeles.","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around July 7th 1994"],"Region":"California","Country":"United States","Object Features":"None","Log Number":"US-10092009-0002","Object Shape":"Diamond, Other","Date Submitted":"10/09/2009 01:33 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.062094,+-118.238725(19868)&iwloc=A&hl=en\"> mufon case (19868) map </A>","Viewing Distance":"Unknown","City":"Los Angeles"}