{"Object Features":"Unknown","Weather Factors":"None","Object Shape":"Fireball, Star-like","Date of the Event":"10/08/2009 07:10 UTC","trends":["There has been one other sighting in Bexhill","There were no other sightings in Bexhill on or around October 8th 2009"],"Tags":"City","Latitude":"50.84378","files":["/var/www/straped/mufon/html2text/19869.html.txt","/var/www/straped/mufon/org/19869.html"],"City":"Bexhill","Case Number":"19869","Country":"United Kingdom","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=50.84378,+0.482568(19869)&iwloc=A&hl=en\"> mufon case (19869) map </A>","divs":["sighting detailsa colleague and myself had just arrived at the local pub after work and had sat down in the garden at the back. it was a perfectly clear night and we had not yet begun drinking! my friend pointed to the sky and said 'hey, what's that'. we both observed a bright, orange\\gold light heading towards us from the north. the object was brighter than a star, had no other lights as a plane would and moved quickly and silently towards us. the light appeared to have some movement in it, almost as though it was rotating. bearing in mind that it was a very clear, very still night with no wind, the light passed overhead and appeared to be moving not only south but also straight up. as it faded, it's flashing became more apparent - being visible for a second, then invisible for a second, regularly repeating. this flashing was only just perceivable as it approached as the light was brighter. definitely not a plane, helicopter or satellite etc. it traversed the whole visible sky in a smooth arc in just 20 second or so and then was gone. once again, it was completely silent. we both discussed it for some time and could find no prosaic explanation for the object or its movement. also worth mentioning perhaps is that for several hours after the sighting, my mobile phone (iphone) had no signal whatsoever and told me my carrier was no longer available. i usually get full signal in this area. the signal returned to full about 3 hours after the sighting."],"Source":"MUFON","Disposition":"Unresolved","Sighting Duration":"00:00:20","Summary":"Golden light, appeared to be rotating, passed overhead silently and quickly.","Longitude":"0.482568","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/09/2009 04:18 UTC","Log Number":"GB-10092009-0003","Region":"England"}