{"Longitude":"-120.991058","Sighting Duration":"00:10:00","Country":"United States","files":["/var/www/straped/mufon/html2text/19865.html.txt","/var/www/straped/mufon/more/19865_submitter_file1__PIC-0108.jpg","/var/www/straped/mufon/more/19865_submitter_file2__PIC-0109.jpg","/var/www/straped/mufon/more/19865_submitter_file3__PIC-0110.jpg","/var/www/straped/mufon/org/19865.html"],"divs":["Sighting DetailsI was driving down Tully Rd from Kiernan to Bangs when I noticed two blue lights in the distance moving in sporadic patterns. The light on the right was more active at this time. I took three photos. After the second photo the lights stopped in midair. I drove to the stop sign and turned left on Bangs headed east. My hope was to get a closer look and a better photo. I gauged the distance to be past McHenry Blvd to the east but when I got to the train tracks just before McHenry my vehicle was converged on from the fields from the north and the south (just before the autodealership on my right). I could see them from my front window approximately thirty to fifty feet with one being above the other. My two year old began to cry and my six year old said \"daddy, I'm afraid.\" I continued to the stop light and made a right. I traveled for almost two blocks through Pelandale when my daughter said \"daddy, it is following us.\" I told her to pray and not to worry. As we approached the next light there was construction going on. (many workers repaving the road and a police car) I asked her if she still saw it and she said yes. By the time we reached Standiford she said that it went away. I did not get a close look but would guess that it was not much larger than a vehicle. My daughter told me that she saw a window at the top with light coming out of it but she could not see anyone inside of the object. The light to the right is from a barn or house. You can see the difference is clearly in the type of lighting and how the camera picks up the illumination from it. I have been told already that it was Venus or Mars, but I received an award in high school for Astronomy having received straight A's in the course and I know this was not a star. I checked with the Central Valley Citizen's for Liberty and a member told me that he saw the blue lights where he lives in South Modesto. His thought was that perhaps the Modesto PD had obtained a drone craft like Ripon has done. I am not certain that is the case as whatever this was did not give off any sound."],"Date Submitted":"10/08/2009 06:22 UTC","Object Flight Path":"Path then hovering","Tags":"City","Date of the Event":"10/07/2009 08:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.648067,+-120.991058(19865)&iwloc=A&hl=en\"> mufon case (19865) map </A>","Region":"California","Source":"MUFON","Case Number":"19865","Object Shape":"Other","Disposition":"IFO","Weather Factors":"Unknown","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around October 7th 2009","This sighting has never been favorited.",""],"City":"Modesto","Summary":"Blue Lights in the night","Latitude":"37.648067","Object Features":"Window(s)","Viewing Distance":"20 Feet or Less","Log Number":"US-10082009-0010"}