{"Tags":"City","divs":["Sighting DetailsWe dropped Dad off at the airport (Stewart) really early in the morning on the 10th or 11th september. On our way home it was still dark. We drove north on NY thruway 87 and I looked out my front passenger window and saw a really bright star in the skye. In a second the star moved really close, got a little bigger and brighter and I said to my mom \"what's THAT!?!!\" MOM: I was driving and when my daughter yelled out I looked where she was pointing in the sky. In the moments I glanced away from the road I saw a bright light quite close, about 2000ft high- below cloud level, basketball sized at arms length. The amazing thing was that it was changing as we looked at it. Although it started out as a bright star-like object, it became surrounded by a dark-greyish mist or smoke and within, the single white light became a group of lights that flashed in series around an oval shape- the lights flashed around this oval object at least 2 times- I kept glancing back at the road as I slowed down. The mist around it began to dissipate and at the same time the object changed shape again from oval to triangular, but a strange triangle that was very dark with slightly swept back wings. The light configuraton changed at the same time to two large bright lights underneath and slightly back from the tip of the triangle shape- like two bug eyes close together. The mist was almost completely gone now. The object rotated so those lights faced us (west) and then suddenly a small light on the end of each wing appeared and began to blink alternately- one reddish, one white. So fast, so amazing was this transformation. I finally pulled over to watch and the object just seemed to 'float' in a westward direction toward pennsylvania over the thruway and behind a hill and trees. Didn't hear any noise, no sudden bursts of speed, but it disappeared rather quickly- I glanced away for a moment to put the car in park and it was gone. On the way home I tried to figure out what it could have been- such as a plane making its approach for landing, maybe we saw various orientations as it dropped lower and lined up with the airport runway- but I've seen hundreds of planes, day and night and it didn't make sense with all the mist and light changes. My husband was a pilot and expert on aircraft through the vietnam war. Has anyone else seen similar morphing objects recently in the area? When I first saw the object I said- \"Wow! , That's a ufo!\"- but I became unsure of what I saw on the drive home."],"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Object Features":"Wings, Other","Country":"United States","Source":"MUFON","Weather Factors":"None","Date Submitted":"10/08/2009 10:23 UTC","City":"Newburg","Date of the Event":"09/10/2009 04:45 UTC","Object Shape":"Chevron, Disc, Oval, Star-like, Triangle, Other","Latitude":"42.693117","Disposition":"Unresolved","Region":"New York","Summary":"At mile marker 66 of the NY State Thruway 87 my mom and I saw a bright light that morphed into an object with blinking lights then changed again.","Log Number":"US-10082009-0006","files":["/var/www/straped/mufon/html2text/19861.html.txt","/var/www/straped/mufon/org/19861.html"],"Case Number":"19861","Viewing Distance":"Unknown","trends":["There have been no other sightings in Newburg","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=42.693117,+-78.119732(19861)&iwloc=A&hl=en\"> mufon case (19861) map </A>","Longitude":"-78.119732"}