{"Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 52 other sightings in Minneapolis","There were no other sightings in Minneapolis on or around October 9th 2009"],"Latitude":"44.987755","Case Number":"19877","divs":["Sighting Details I was at school in my last hour history class. The teacher told us to move our desks back. Once, I was in my own desk again I looked out the window. The clouds were so beautiful, just like me to love the little things in life as simple as the clouds. Then I notice a black dot moving across the sky. At first I thought it was the eagle I had seen the day before. I quickly realized that this was not the case. It didn't change coarse and had nothing I could discribe as wings. I will admit, I have made the mistake of misidentifying objects (never a plane) so ever since then when I've been identifying an object, I go down a list until a UFO is all it could be. It's not an eagle, is it a plane? Just then in changed color- from black to siver! This surprised me, of coarse. It couldn't be a plane, unless it had changed angles slightly and reflected the sun different. Then, it turned black again, then silver, and it repeated this about three or four times. Then I noticed something else. Some rather large flashes were occuring aroud it. They were far enough away from the object to say that they were different objects. Soon, I noticed that it was angling downward and vanished beyond the distant trees. Realizing that I wouldn't see anything else, I refocused to my teacher. I remained pretty calm during the entire expeariance (except for the fact that I wished I could jump out of my chair and yell, \"WHAT IS THAT!?!). Of, coarse, I'm pretty used to seing UFOs, because I've seen them my entire life! Also, I'm not sure if this had anything to do with it, but before I saw the UFO, it felt like my desk (it could have been just me) was shaking."],"Longitude":"-93.255516","Sighting Duration":"Undisclosed","Tags":"City","City":"Minneapolis","Region":"Minnesota","Object Shape":"Flash, Oval, Sphere, Star-like, Unknown","Country":"United States","Disposition":"Insufficient Data","Date Submitted":"10/09/2009 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.987755,+-93.255516(19877)&iwloc=A&hl=en\"> mufon case (19877) map </A>","Summary":"A color-changing object with lights flashing around it.","Log Number":"US-10092009-0011","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/19877.html.txt","/var/www/straped/mufon/org/19877.html"],"Weather Factors":"Light","Source":"MUFON","Object Flight Path":"Straight-line path","Date of the Event":"10/09/2009 02:30 UTC"}