{"Weather Factors":"Rain, Light","files":["/var/www/straped/mufon/html2text/19872.html.txt","/var/www/straped/mufon/org/19872.html"],"Object Features":"None","Date of the Event":"10/09/2009 06:30 UTC","Region":"Michigan","City":"Plainfield Township","Tags":"City","Longitude":"-85.609199","Date Submitted":"10/09/2009 11:19 UTC","Object Shape":"Disc","Latitude":"43.075582","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsThis morning my partner woke me up around 6:30 all excited and out of sorts (but mostly excited). She said she thought she saw something. I was having difficulty waking up fully. I was in a very deep sleep. Anyway...here's what happened. She was sitting at her computer this morning. It was still very dark, just a little before 6:30. Out of the corner of her eye she saw a light outside my window where my desk is sitting. At the same time she noticed the light she also became aware of a deep humming noise. Kathy said she could actually feel the hum in her belly. What she saw out the window was a light (not a flash) that was as bright as lightening lighting up the area of sky below what looked to be some sort of aircraft. The light was not a narrow beam of light straight down but more like a reverse funnel, the widest end facing Earth. The craft itself was not very far away, probably not even a mile. The craft was more glowing than lit. She didn't see any lights on the craft just the craft itself glowing. I asked her if she could describe the size and all she could say was if she had wrapped her finger around it while she saw it from where she was sitting, it would be about 2 inches. It wasn't very high in the sky. The lights turned off once and the humming stopped at the same time. She could still see the craft glowing once the light coming below the craft had been distinguished. Then they came back on within a couple seconds with the same low humming. The craft had not moved at all. This last time (the 2nd time) that the light disappeared, the craft vanished as well. And I slept thru the whole thing....bummer!!! Who knows...maybe I was in the aircraft and I was being returned when the whole visitation took place. Kathy said it probably took all of 5 seconds for the entire visitation to transpire. She has no doubt that it was a UFO."],"Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"00:00:05","Case Number":"19872","trends":["There have been 2 other sightings in Plainfield Township","There were no other sightings in Plainfield Township on or around October 9th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.075582,+-85.609199(19872)&iwloc=A&hl=en\"> mufon case (19872) map </A>","Summary":"Deep low hum and bright beaming light from bottom of craft. Craft never moved and then vanished into thin air. Took about 5 seconds.","Disposition":"Unknown","Source":"MUFON","Log Number":"US-10092009-0006"}