{"Object Shape":"Circle","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around October 9th 2009"],"Longitude":"-82.322626","Object Features":"None","divs":["Sighting DetailsStanding on my back porch in a very rural area little light pollution , and a very good view of the sky appox 80% the time was 8:05 pm est and as I watched the commercial airlines taking their usual routes I noticed a light maybe 5 times larger than a commercial jet but with the regular flights in the same area I could tell it was at a higher altitude. The speed was maybe 4 or 5 times faster than the regular planes and it took only 20 or so seconds to clear most of the sky. The object started speeding up and the flight path went up at about a 45 degree angle, The lights started getting smaller fast and then split into 2 lights in a Y going northwest and northeast at an approximate angle of 30 degrees then in 2 seconds they sped off and disappeared. the light stayed bright white no flashing or different colors during the entire flight. when the object split into 2 the brightness diminished as if the total mass was split and each carried half the illumination. Sorry no time to get a camera and I doubt if a good picture would have resulted snyways it was too far away. I was cooking a rather horrid meal at the time and stepped outside for a little air. Never try deep fried corn on the cob. My wife daughter and I are all nite time sky watchers as we frequently stay up all night watching meteor showers and we have all had some very interesting sightings of anomolies in the nite skys. I was in a good state of mind it had been a long hot tiring week and had a chance to relax for several hours after work so I was mentally sharp at 8 pm and was eagerly awaiting the arrival of the wife and grandson whom is spending the weekend with us so a great mood was present. I noticed the light right away and trained my eyes on it, I was looking for points of reference as I usually do to put things in perspective and followed it to it's disappearance. I am not an FAA expert nor am I a pilot, but I am fair at judging relative height and comparing speed from a know to the unknown."],"Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change","Latitude":"29.655574","Viewing Distance":"Over One Mile","Case Number":"19879","Source":"MUFON","City":"Gainesville","Weather Factors":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.655574,+-82.322626(19879)&iwloc=A&hl=en\"> mufon case (19879) map </A>","Region":"Florida","Date Submitted":"10/09/2009 11:36 UTC","Log Number":"US-10092009-0013","Summary":"round light heading south to north higher then commercial flights faster sped up split into 2 and dissappeared","Country":"United States","files":["/var/www/straped/mufon/html2text/19879.html.txt","/var/www/straped/mufon/org/19879.html"],"Date of the Event":"10/09/2009 08:05 UTC"}