{"Country":"United States","Source":"MUFON","Log Number":"US-10092009-0008","divs":["sighting detailswas driving home on my lunch break. while heading west at approx. 11:15 i looked up into a cloudless section of the sky and a metalic \\ reflective surface caught my attention. i immediately thought of a plane until i realized that it was not moving, and had no markings. i looked immediatly to my watch to memorize the time. i continued to observe the object for approx. 1 minute and it instantly disapeared. i quickly scanned the sky to see if maybe it had turned and i some how missed it. there were no clouds in this section of the sky so what ever it was had completely disapeared. i had to slow my vehicle down because the person in front of me appeared to be leaning over the steering wheel of his 2000-2001 (approx) toyota tundra to figure out where the object went as well. he was point to the same section of sky to his passenger, after a few moments he sped back up to the speed limit of 45. i cannot verify if the occupents were for sure looking at the same object, but as there was nothing else in that section of the sky it leads me to my conclusion. i have never seen this type of ufo before. but it appears to the the cigar shaped ufo that has been reported countless times. i did not have any strange feelings or reactions upon seeing the object."],"Longitude":"-95.925937","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Summary":"Bright metallic cigar shaped object.","Region":"Nebraska","Date of the Event":"10/09/2009 11:14 UTC","Disposition":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Cigar","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.162221,+-95.925937(19874)&iwloc=A&hl=en\"> mufon case (19874) map </A>","Date Submitted":"10/09/2009 02:39 UTC","City":"Bellevue","Tags":"City","Latitude":"41.162221","Weather Factors":"None","trends":["There have been 6 other sightings in Bellevue","There were no other sightings in Bellevue on or around October 9th 2009"],"Case Number":"19874","files":["/var/www/straped/mufon/html2text/19874.html.txt","/var/www/straped/mufon/org/19874.html"]}