{"Weather Factors":"Windy, Unknown","Date of the Event":"11/19/2002 10:00 UTC","Latitude":"32.721629","files":["/var/www/straped/mufon/html2text/1987.html.txt","/var/www/straped/mufon/org/1987.html"],"Region":"California","Longitude":"-117.148355","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.721629,+-117.148355(1987)&iwloc=A&hl=en\"> mufon case (1987) map </A>","City":"San Diego","Object Features":"Undisclosed","Summary":"erratic star during last weeks meteor shower","Date Submitted":"11/19/2002 10:00 UTC","Log Number":"","Disposition":"Hoax","Tags":"City","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around November 19th 2002"],"Viewing Distance":"Over One Mile","Sighting Duration":"01:59:00","Country":"United States","Object Flight Path":"Stationary,Other","Case Number":"1987","divs":["Sighting DetailsTuesday night the 18th of November I went out into my backyard at approximately1000pm to observe some of the meteor shower as I would not be able to be up at230 in the morning for the most active period. I live in San Diego, CA. Thesky was very very clear as the entire southwestern US was under a high pressureridge at that time. I was looking to the northeast as the news had indicatedthat that would be the most likely direction to see meteors. It was a full moonwhich was, at that time, to the southeast near Orion. There was a constellationalmost directly overhead and slightly to the northeast that looked like anupside down W Cassiopeia. At about 5 degrees below the W was that I thought wasanother star. It was about the same brightness but was more yellow,as opposedto blue-white of the nearby stars. At first I thought that my eyes were playingtricks on me. The star appeared to be jumping around or jiggling. I know thatthe stars will appear to do that if you move your eyes around quickly especiallyif you dont have a stable ground reference point in your peripheral vision. Ikept blinking and trying to focus but I finally realized that it was the onlyobject in the sky doing that. It moved in very small, quick pulse motions withoccasional circles and S patterns thrown in. It moved towards the west over aperiod of about 45 minutes. It would pulse 3 or 4 times forward thenoccasionally move back one or two pulses. It was so subtle that if you hadglanced up you wouldnt even noticed but observed over time it was almost likewatching the motion of a milling fly. The kind that seem to gather under ashaded porch in the summertime. It moved to the west until in was about 20degrees above the horizon then moved north about 30 degrees before I stoppedwatching it. I had observed it for over an hour. I finally had to go to bed asI had work in the morning. I have seen satellites, high flying aircraft,meteors and other regular objects in the sky. I have never seen one move aboutin this manner. I dont know if it was extraterrestrial in orgin just that itwas a flying object that was unidentifiable to me."],"Object Shape":"Undisclosed"}