{"Tags":"City","Date of the Event":"10/09/2009 08:30 UTC","Date Submitted":"10/10/2009 11:13 UTC","Summary":"Different colored flashing lights","City":"Aspermont","Disposition":"Unknown","Object Shape":"Star-like","Object Flight Path":"Stationary","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting DetailsAt approximately 2030, I went into my backyard to smoke a cigarette. The skies were clear, and the evening was very cool. I looked to the west, and thought I saw an aircraft at altitude, as it flashe red, blue, and white colored lights. The evening was quiet, but I could hear no sound. Further, the object didn't appear to be moving. I changed my position to confirm that the \"flashing\" wasn't caused by leaves on a nearby tree and stood watching for several more minutes. I then went to the door, and told my 13 year old son to put a jacket on, and come look at something, warning him not to look at any streetlights so as to preserve his night vision. I pointed the object out to him, and asked him what he saw (so as not to \"lead\" him). He first thought it was an airplane, but then also realized it wasn't moving. He is studying astronomy in school, and suggested it might be a \"nova\". We watched for a few minutes more, and I asked him to go and get our digital camera. I attempted to take several pictures, but nothing was captured. Several more minutes of watching, and it never seemed to move, not even like a star would set. It was cold, so we decided to go inside, and I would check it later. About 30 minutes later, I went outside and could find no sign of it...not even lower towards the horizon. I plan to go back out tonight at the same time to look for it."],"Case Number":"19883","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.133431,+-100.227328(19883)&iwloc=A&hl=en\"> mufon case (19883) map </A>","Object Features":"Undisclosed","Longitude":"-100.227328","Log Number":"US-10102009-0004","Region":"Texas","files":["/var/www/straped/mufon/html2text/19883.html.txt","/var/www/straped/mufon/org/19883.html"],"Sighting Duration":"Undisclosed","trends":["There has been one other sighting in Aspermont","There were no other sightings in Aspermont on or around October 9th 2009"],"Weather Factors":"Windy","Latitude":"33.133431"}