{"map":"<A HREF = \"http://maps.google.com/maps?q=36.785461,+-119.412922(19882)&iwloc=A&hl=en\"> mufon case (19882) map </A>","Summary":"Picture of Hitler was FROZEN on local TV channel for 28 minutes. I went outside afterwards, and saw distinct FAST moving light. Left, right,up, down, then DISAPPEARED ??","Object Shape":"Flash","City":"Undisclosed","Tags":"City","Date of the Event":"10/05/2009 08:26 UTC","Date Submitted":"10/10/2009 09:32 UTC","Longitude":"-119.412922","files":["/var/www/straped/mufon/html2text/19882.html.txt","/var/www/straped/mufon/org/19882.html"],"trends":[],"Object Flight Path":"Path with directional change","Country":"United States","Weather Factors":"Does Not Apply","Log Number":"US-10102009-0003","Viewing Distance":"501 Feet - 1 Mile","Disposition":"IFO","Object Features":"Unknown","Latitude":"36.785461","Case Number":"19882","Sighting Duration":"00:28:00","Source":"MUFON","Region":"California","divs":["Sighting Details I was watching TV on Monday, October 5, 2009 and turned on KOCE, a local station in Huntington Beach, CA and saw a picture of Hitler with his arm up, giving a speech. I thought it was frozen, so I changed the channel, and turned it back, and it was STILL THERE, with a clicking sound. The thing is, there were still news headlines moving at the bottom of the screen. The picture was there for 28 minutes, and I took a picture of it. I just finished a book that described people in England in 1953 watching the BBC channel and they picked up a KLEE station from Texas...that had gone OFF THE AIR , THREE YEARS BEFORE ??? So at 9:00 P.M. I went out for a smoke, and saw a Distinct light cruising like a plane, AND THEN....jittered left, right, up, down, left, right FAST. Then DISAPPEARED ?? I contacted the TV sation, and am still waiting for a response. It was pretty trippy though. Does anyone know if that (Hitler) image was one of the first images we broadcast into space when technology permitted ? Maybe it was a communication atempt ?? Another object I saw in the sky (on another night) was RED, and blinked slowly only twice...next to a radio tower with a red blinking light on top. Was it possibly trying to send some sort of message to the red tower light ??"]}