{"Latitude":"35.788491","Viewing Distance":"Unknown","trends":["There have been no other sightings in Pinetops","This sighting has never been favorited."],"Case Number":"19899","Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Object Features":"None","Region":"North Carolina","Date Submitted":"10/11/2009 09:07 UTC","Longitude":"-77.637752","City":"Pinetops","Summary":"On my way to work I noticed the object intermediately approaching from the SW and our paths crossed.","map":"<A HREF = \"http://maps.google.com/maps?q=35.788491,+-77.637752(19899)&iwloc=A&hl=en\"> mufon case (19899) map </A>","divs":["Sighting DetailsAbout 1995 at 0500 or so I was on my way to work. Once I had left the city and entered the country I noticed an object which because of its size and forward speed I thought it may have been a blimp. Leaving in Eastern North Carolina I am used to seeing military aircraft of all types and at this time I was quite an aviation buff I knew this was not a military aircraft. I continued traveling and our paths crossed. I was early that morning so I was able to pull my truck over, turn it off and watch the object pass directly over me at which time I saw that it was delta shaped. It was totally silent and it had no lights internally or externally. It was hard to approximate its altitude, it was very large but did not totally blot out the stars. Once the craft passed over and continued out of my sight I heard jet aircraft approaching form the SW and I thought someone else must be interested in this too. Stranger than seeing this is how it made feel. I really felt nothing at all and I don't think I told a soul until now. Even now I find it strange that I never mentioned it to anyone."],"Object Flight Path":"Straight-line path","Log Number":"US-10112009-0011","files":["/var/www/straped/mufon/html2text/19899.html.txt","/var/www/straped/mufon/org/19899.html"],"Date of the Event":"05/20/1995 04:00 UTC","Country":"United States","Weather Factors":"Unknown","Disposition":"Unknown","Object Shape":"Triangle"}