{"Weather Factors":"Unknown","Disposition":"Insufficient Data","Tags":"City","Object Shape":"Other","Log Number":"US-10112009-0009","Sighting Duration":"Undisclosed","Latitude":"44.324344","divs":["Sighting DetailsMy wife, sister-in-law and I were returning home from Madison, wi. we had just left Iron Mountain and were heading north on rt. 95. My wife was in the back seat sleeping, her sister was driving and I was in the rt. passenger seat,when I noticed four lights above the rt.tree line.OOOO I brought them to the attention of my sister-in-law. They appeared to be coming from the northeast towards us. I first thought the objects might be connected to one of the towers in the area. But I had never seen lights like that on any of the towers that are near rt. 95 to rt 41.Approx. 45 mi. stretch.The lights stood out in the dark night. As we watched them get closer to the car the four lights changed into two cresent moons facing each other..( ) We lost sight of the objects when they passed over the vehicle. We knew we had seen something very strange. I have traveled that road the last 22 years and never saw anything like that.During the next two months I traveled the road both in daylight and dark and saw there wasn't a tower in the area let alone white lights. The towers that have lights, have red lights. We heard no noise from the lights and they we not very bright. Just about what a full moon would look like. After it passed over our car I was sorry we didn't stop the car to see if we could see more. The real kicker was when four went to two and very different shapes. Sorry about crescent but I am new on the computer and don't want to lose page."],"trends":[],"map":"<A HREF = \"http://maps.google.com/maps?q=44.324344,+-85.596004(19897)&iwloc=A&hl=en\"> mufon case (19897) map </A>","Region":"Michigan","Object Features":"Undisclosed","Case Number":"19897","Longitude":"-85.596004","Source":"MUFON","Date of the Event":"12/18/2008 12:00 UTC","Object Flight Path":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"10/11/2009 07:25 UTC","files":["/var/www/straped/mufon/html2text/19897.html.txt","/var/www/straped/mufon/org/19897.html"],"Summary":"they looked like four silver dollars aside one another.","City":"Undisclosed"}