{"Object Shape":"Flash","map":"<A HREF = \"http://maps.google.com/maps?q=30.054981,+-95.186755(19898)&iwloc=A&hl=en\"> mufon case (19898) map </A>","files":["/var/www/straped/mufon/html2text/19898.html.txt","/var/www/straped/mufon/org/19898.html"],"Disposition":"Unknown","Source":"MUFON","Region":"Texas","divs":["Sighting DetailsAt approximatley 7:50 p.m. I was traveling north bound on West Lake Houston Parkway in Kingwood, Texas (about 30 miles northeast of Houston, Texas). It was dark, overcast, and had been raining throughout the day. While approaching a stop light I suddenly saw a green light flash across the sky to the north of us. It was not lightening and in some ways it ressembeled the aurora lights in that it lingered for a second and seemed to wave in the sky. As soon as the flash of light happened the stop light that we were appraoching started flashing red extremely quickly, much faster than a normal flashing red traffic signal. I asked my wife if she saw it and she stated that she did not. The light turned green and as we proceeded forward there was another flash of light up in the sky, this time it was orangeish in color. Other than the color the light had the same qualities as the first flash and once again the stop light began flashing quickly. On this second occasion both my wife and I and our 6 year old daughter witnessed the flash. My wife and I agreed that it was unlike anything we had ever seen. Has anyone else reported this?"],"Case Number":"19898","Log Number":"US-10112009-0010","City":"Houston","Object Features":"Unknown","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around October 10th 2009"],"Tags":"City","Date Submitted":"10/11/2009 08:01 UTC","Country":"United States","Latitude":"30.054981","Longitude":"-95.186755","Summary":"Two quick colored flashes in the sky above Kingwood, Texas","Sighting Duration":"Undisclosed","Object Flight Path":"Other","Weather Factors":"Unknown","Date of the Event":"10/10/2009 07:50 UTC","Viewing Distance":"Unknown"}