{"Longitude":"-6.264594","Date of the Event":"12/05/2008 06:00 UTC","Region":"County Dublin","Disposition":"Unresolved","Summary":"I saw it on the main evening news on TV","Date Submitted":"10/11/2009 05:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.353054,+-6.264594(19896)&iwloc=A&hl=en\"> mufon case (19896) map </A>","Object Features":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Object Shape":"Other, Unknown","Log Number":"IE-10112009-0008","Latitude":"53.353054","divs":["sighting detailsi wrote this email to the newsdesk in rte (irish national tv broadcaster). this will explain. i got no reply. i also reported it to a ufo society here in ireland. they tried contacting rte but they also got no reply. i've attached a photo i took of my tv in pause mode as a time and visual reference for rte. heres the email i sent to rte... from xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx to newsonline@rte.ie, newsdesk@rte.ie date 5 december 2008 21:33 subject i saw a ufo on tonights six one news - in the footage mailed-by gmail.com hide details 05\\12\\2008 hi i had recorded tonights 6-1 news on my sky digital and i noticed there was a ufo in the footage. having looked at it a few times i can't figure out what it is but it does make a strange sharp manoeuvre. where you can find it .... 14 minutes into the news there is a report by george lee about oil prices 'oil prices slumped below $40 this afternoon the lowest for 4 years, and more than $100 below the peak of last july' at the same time of the blue writing, if you look at the middle of the screen and move 3\\4 of the way to the left you will see this strange object floating around ! not sure what you should do with it but you guys should be able to zoom in and perhaps get a better look. keep me updated please! regards, greg"],"Viewing Distance":"Unknown","Country":"Ireland","City":"Dublin","files":["/var/www/straped/mufon/html2text/19896.html.txt","/var/www/straped/mufon/more/19896_submitter_file1__ufo.jpg","/var/www/straped/mufon/org/19896.html"],"Case Number":"19896","Object Flight Path":"Undisclosed","trends":["There have been 12 other sightings in Dublin","There were no other sightings in Dublin on or around December 5th 2008","This sighting has never been favorited.",""]}