{"files":["/var/www/straped/mufon/html2text/19903.html.txt","/var/www/straped/mufon/more/19903_submitter_file1__image005.jpg","/var/www/straped/mufon/org/19903.html"],"Object Shape":"Other","Viewing Distance":"Unknown","Log Number":"US-10112009-0015","Case Number":"19903","Latitude":"33.917308","Longitude":"-98.485297","Object Flight Path":"Path then hovering","Region":"Texas","Country":"United States","divs":["Sighting DetailsI travel for a living and my route takes me down I287. For a couple of weeks around my taking this picture I had noticed numerous sightings but wasn't (freaked out and didn't think of it until later) able to get a picture until the day in question. I didn't remember the exact day. (on a previous encounter I had a hooded \"person\" outside my bedroom window that I reported previously I think) About two or three weeks later after seeing the clay county event I had something happen while I was asleep. It happened on three occasions and I had an awareness of more recently. (Remembrance) 1. I have two small dogs. The first \"dream\" I had I saw my dog (5 lb. one) being drug around viciously by a tomcat and I was shocked and couldn't help her because she was too far away. (Fast in & out dream) 2. Second \"dream\" I see the dog (5 lb. one) closer to me and being attacked by two tomcats and I couldn't separate them so I balled up my fist and raised it up to hit the cat. (Fast in & out dream) 3. Third \"dream\" my first recollection is being in a state of paralysis and floating through the air with a group of beings, one was an older asian man with a dark jacket (maybe a military garb?). We moved with one accord and I noticed I was dressed very royally. We sat at a round table (like a coffee table) and couches like a pit group. I remember looking (transfixed) at the asian man and I thought we were going to have tea when my smaller (3 lb.) dog was placed in my lap and a knife was placed in my hand. I instinctively knew to do an operation which I started and then noticed that it wasn't going right and freaked out. At that point I got up and started walking away and noticed a large what I thought at the time was a dog like figure walking around \"talking\" to me. I remember \"telling\" him as they brought my dog to another room, please don't kill her as they related that they would take care of it from there. The large figure had a very narrow face like a doberman but I now believe it to be a reptilian because I noticed a space between the back like a hole which I believe now was the tail lifted as it walks. It came up to me to take the knife which I was terrified and I gave it the knife. After that I was shown by another creature which I can't describe how to navigate or move from upper level to lower level within the craft. I was shown how to go off the edge of it and down to a lower level and the creature went with me and we chatted (very friendly). When I was asked to do it myself, I couldn't a. it is not intuitive to me to walk off the edge of one area of a height for any reason even if I was just shown this b. one minor thought was that my shoes would come off and I was shown a pair of shoes on me that I wore 30 years ago that strapped around my leg, (and c. why was I being asked to go there? (very fast, after this - was out of the \"dream\"). with no explanation. I don't believe it was a dream due to the nature of this and the fact that I am a very lucid dreamer. I had nothing going on in my life to indicate a concern about my dogs and stray cats as they are either with me or at home with a dog door that only lets them in and the 3 lb. one thinks she is a doberman and lunges at anything that moves and the 5 lb. one I think wouldn't go without a fight. Also, after this happened about a week ago I wanted very much to remember more about how this happened because I don't like being taken either physically or mentally anywhere for experiments of any kind and remembered my head being pinned down from behind and carefully lifted up by something that was very afraid of me, seems like I opened my eyes momentarily. Also, one a side note, I have a poster print of some art I saw at the Kimball in Fort Worth, TX. and the figures are dressed very royally. 1.(dog picture is the size of my dogs) 2. (picture hard to see but I blew it up on Corel and it looks like some of the images are beyond the ufo image. My husband says it looks like the space station above it) I can send directly from my iphone if I have an email address, thanks."],"Object Features":"Wings","Source":"MUFON","Date Submitted":"10/11/2009 10:30 UTC","Weather Factors":"Windy, Light","trends":["There have been 12 other sightings in Wichita Falls","There were no other sightings in Wichita Falls on or around August 15th 2009","This sighting has never been favorited.",""],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"08/15/2009 12:00 UTC","City":"Wichita Falls","map":"<A HREF = \"http://maps.google.com/maps?q=33.917308,+-98.485297(19903)&iwloc=A&hl=en\"> mufon case (19903) map </A>","Summary":"Took a picture on my iPhone, can send to you if I have an email address","Tags":"City"}