{"Source":"MUFON","Latitude":"35.156244","Date of the Event":"11/24/2002 07:30 UTC","Weather Factors":"Unknown","Summary":"DARK GRAY OBJECT FLOATING THROUGH DOWNTOWN MEMPHIS","Object Features":"Appendage(s)","Object Flight Path":"Straight-line path","Object Shape":"Blimp","files":["/var/www/straped/mufon/html2text/1990.html.txt","/var/www/straped/mufon/org/1990.html"],"Case Number":"1990","Longitude":"-90.04739","City":"Memphis","trends":["There have been 62 other sightings in Memphis","There were no other sightings in Memphis on or around November 24th 2002"],"Region":"Tennessee","Log Number":"","Tags":"City","Disposition":"Insufficient Data","Sighting Duration":"00:05:00","Viewing Distance":"101-500 Feet","Country":"United States","Date Submitted":"11/24/2002 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.156244,+-90.04739(1990)&iwloc=A&hl=en\"> mufon case (1990) map </A>","divs":["Sighting DetailsI WAS ON 21ST FLOOR OF FRIENDS APT BLDG WATCHING THE PLANES APPROACH THE AIRPORTWHICH IS HALFWAY ACROSS MEMPHIS. I WAS DOWNTOWN LOOKING EASTWARD. I SAW ANOBJECT WHICH AT FIRST I THOUGHT WAS A CARGO JET BUT QUICKLY REALIZED HAD NOLIGHTS AND NO SOUND, AND WAS TOO CLOSE TO BE A JET BEING IN THE MIDDLE OFDOWNTOWN. I CALLED MY FRIEND TO SEE IT AND WE WITNESSED IT FLOAT BEHIND ABUILDING ACROSS THE STREET AND THEN COME OUT THE OTHER SIDE AND KEEP GOINGTOWARD THE CITY. THE OBJECT WAS DARK AND IT WAS NIGHTTIME AROUND 730 SO IT WASHARD TO SEE THE EXACT SHAPE BUT IT APPEARED ABOUT 20-30 FEET LONG AND HAD SOMEKIND OF SMALLER OBJECTS ATTATCHED TO IT ALMOST LIKE JET ENGINES ON A WING. THEOBJECT CAME IN FROM THE NORTH AND PASSED BY US ABOUT 200-300 FEET AWAY THEN KEPTON ITS PATH HEADED SOUTHEAST. IT APPEARED TO BE FLOATING IN THE WIND BUT I DONTKNOW WHAT DIRECTION THE WIND WAS. IT WAS EYE LEVEL TO US ABOUT 200 FEET MOVINGABOUT 20 mph. AS IT FLOATED AWAY, WE LOST SIGHT OF IT INTO THE DARKNESS OFNIGHT. THE SHAPE WAS VERY HARD TO DISTINGUISH. MY FRIEND SAID IT LOOKED MORELIKE A CUBE TO HIM. I HAVE NOT ASKED HIM ABOUT HIS ANONYMITY YET BUT WILL ASSOON AS I TALK TO HIM AGAIN. THAT NIGHT I FELT AN ACUTE SENSE OF RELAXATION FORTHE REST OF THE NIGHT. WHEN I BROUGHT IT UP AT WORK, 2 MEN SAID THEY HADWITNESSED A GRAY CRAFT NEAR THE AIRPORT IN THE DAYTIME THE WEEK BEFORE WHICHLOOKED JUST LIKE AN AIRLINER BUT WAS STAIONARY IN THE SKY, THEN BOLTED OFF INONE DIRECTION, STOPPED AGAIN, THEN BOLTED AGAIN AND LEFT. I CANT HELP BUT THINKTHE TWO ARE RELATED BUT WHAT I SAW DID NOT STOP AND WAS MUCH SMALLER THAN ANAIRLINER. I AM INTERESTED TO SEE IF ANYONE ELSE IN MEMPHIS HAS REPORTED ANYTHINGLIKE THIS. I WOULD BE GRATEFUL TO GET AN EMAIL OR CALL IF THIS IS TRUE."]}