{"Disposition":"Unknown","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/19915.html.txt","/var/www/straped/mufon/org/19915.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=45.533242,+-122.666747(19915)&iwloc=A&hl=en\"> mufon case (19915) map </A>","Log Number":"US-10122009-0011","divs":["sighting details10 oct 2009, 00:30 in the morning. skies were clear. last night, while we were at club 9 downtown, the whole patio saw a triangular ufo pass from west to east over south ptown (halfway between ohsu and pioneer square), then turn south over the i5\\405 interchange. it was maybe 50' above the downtown buildings. it was about 75'(give or take) across and was moving rather quickly. the triangle seemed to have round corners and the three main lights underneath were grayish in color. when it turned south, it banked at a 40 degree angle. there was a slight anomoly with the air - it seemed to shimmer as though there was intense heat, a shimmer that one would see coming off of a road during the summer sun, but it was slight. the ship was extremely clear to see, although it seemed to be solid flat black (minus the lights of course). i made a quick animation of what we saw (attached) from my perspective. there was no sound. i was trying to take a photograph of three girls, but the camera wasn't working, when someone yelled 'that's a f'n ufo!' i looked up and to my right, i immediatly saw it as it passed right in front of us. there was no doubt that it was a huge craft gliding through the night sky. we lost sight of the object in the distance. note: i had lazik eye surgery a few years ago, giving me perfect 20\\20 vision. a negative result of the surgery though makes all lights at night have a slight halo and star effect len's flare. the three lights i saw off of the craft did not give these effects, even though all of the other lights in the city and the hills behind did. ps - the exact time was 12:30am 10 oct 2009, i put in the time of 12am and got an error msg, so i'm redoing this with the time of 1am instead"],"Date of the Event":"10/10/2009 01:30 UTC","Case Number":"19915","Object Flight Path":"Path with directional change","Weather Factors":"None","Source":"MUFON","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around October 10th 2009","This sighting has never been favorited.",""],"Longitude":"-122.666747","Tags":"City","Object Shape":"Triangle","Region":"Oregon","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"10/12/2009 03:29 UTC","City":"Portland","Latitude":"45.533242","Sighting Duration":"Undisclosed","Summary":"Triangle UFO, three gray lights underneath moving west to east"}