{"map":"<A HREF = \"http://maps.google.com/maps?q=36.855469,+-76.276253(19911)&iwloc=A&hl=en\"> mufon case (19911) map </A>","Viewing Distance":"101-500 Feet","City":"Norfolk","Object Flight Path":"Straight-line path","Summary":"moved over our car silently and slowly","Object Shape":"Blimp, Sphere","Log Number":"US-10122009-0007","divs":["Sighting DetailsI was taking my friend to work about 5 in the morn heading west and we were just coming out of the toll booth on highway 264(at that time it was rt.44)coming up to Mt. Trashmore park on our left. My friend commented that the stars seemed to be blocked out over the park. I slowed down and looked,saw something really big moving across the sky.It was black but like a flat black,there was no light reflecting off of it.It moved very slow and as it got closer you could see a small row of Vee shaped lights towards the front of it.They were small compared to the size of this thing. I pulled over and listen to see if we could hear anything because I thought at first that it was a blimp. It was making no sound at all,just drifting slowly across the highway.I know it wasn't more than 100 to 200 yards above the tree tops. We took the exit off the highway at Newtown road and watched it head towards (I'm assuming ) to the northeast and we lost sight of it. We never told anyone around us about it because we thought they wouldn't believe us.We weren't scared at the time,just excited and really freaked.."],"Object Features":"Dome","Disposition":"Unknown","Source":"MUFON","Date of the Event":"10/07/1992 05:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around October 7th 1992"],"Latitude":"36.855469","Weather Factors":"Unknown","Date Submitted":"10/12/2009 09:56 UTC","Region":"Virginia","Longitude":"-76.276253","Tags":"City","files":["/var/www/straped/mufon/html2text/19911.html.txt","/var/www/straped/mufon/org/19911.html"],"Case Number":"19911","Country":"United States"}