{"Date of the Event":"10/12/2009 05:28 UTC","Summary":"disc shape bright orange low pitch whirring sound","trends":["There have been 3 other sightings in Elizabethtown","There were no other sightings in Elizabethtown on or around October 12th 2009"],"Source":"MUFON","Case Number":"19916","Country":"United States","Log Number":"US-10122009-0012","Longitude":"-76.602746","Object Flight Path":"Undisclosed","Region":"Pennsylvania","Disposition":"Insufficient Data","divs":["Sighting DetailsOccured approx 530am, right before dawn today. I was sleeping in bed and was awakened by what sounded like a very low flying airplane, however the \"whirring\" sound sounded a bit strange to me. I didnt think too much of it, other than it sounding odd, until my son in the next room came running into my room scared out of his mind, he too was awakened from it. So I then got up to look out the window and seen an bright orange colored disc shaped object, unlike any aircraft Ive ever seen, slowly making its way south I believe, midway above the tree lines, quite low. The sound faded as it went further away until the \"orange glow\" faded. Ive seen some unexplained orb formations in the past but nothing like this, and witnessed the recent Nasa Black Brandt launch that was an explainable sight. Even the sound of this thing as it passed by made was almost as tacky as a low budget sound effect heard in sci fi movies as well. It was very bizzare, my youngest son was also a witness to this. Very traumatizing to him, because of not having a logical explaination to what this was. Very strange. Im not sure what scientifically could explain it besides of being a genuine ufo? I wouldnt have believed I really seen it if it wasnt for my son being with me as well, because it was just such an unbeleivable experience. I had to question myself a few times afterwards what the heck Id just seen."],"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/19916.html.txt","/var/www/straped/mufon/org/19916.html"],"Tags":"City","Object Shape":"Disc","Object Features":"Undisclosed","Date Submitted":"10/12/2009 05:31 UTC","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.152872,+-76.602746(19916)&iwloc=A&hl=en\"> mufon case (19916) map </A>","City":"Elizabethtown","Viewing Distance":"Unknown","Latitude":"40.152872"}