{"divs":["Sighting DetailsI and my wife \"Sheila\" were driving home from Albion at about 2.00 am to 3.00 am. It was a vry dark night, and there was no other traffic oh the intire trip home. We were in an area where the farm land was very spread out, with large fields and no houses. A pair of very, very bright lights that were deffenetly connedted, were comming in our direction, but high in the sky. all of a sudden they decended all the way down to about fifty feet off the ground. At this point they sere still 6 or 700 yards away off to our left. They leveled off at about ten to twenty feet off the ground and came directly at us. They came very fast at us untill they were fifty yards away and then slowed down but still moving directly at us. When I thought maybe it was going to hit us, they went up over us. They didn't keep going because we could see the area around the car and the road ahead and behind was still bright with light from them. At this point we couldn't see the light because they were diredtly above us, and neither of wanted to open a window to look out and up. I don't remember leaving the area, my next memory was many miles dwon the road. At this time I remember telling my wife that it must have been a cropduster. Seh replyed \"at night\". That responce hit me like bolt, she was right, there was NO way a cropduster could see power lines, trees. and other obstacles. I can't say there was a lost amount of time or any thing like that, because we never thought about time or anything else, except what we had seen. We just went home and to bed still discussing what happened, but not thinking to check time or anything like that. My wifes memory is excatly the same as mine, as we still discuss it once in a while. even though it happened about thirty years ago. We never wanted ti admit to ourselves that it might have been a UFO, untill the last ten or fifteen years. Now we both know what it was, and neither of us can be told differently."],"Source":"MUFON","Object Features":"Unknown","trends":[],"Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/19913.html.txt","/var/www/straped/mufon/org/19913.html"],"Object Flight Path":"Path then hovering","Viewing Distance":"21-100 Feet","Country":"United States","Longitude":"-85.600214","Log Number":"US-10122009-0009","Sighting Duration":"Undisclosed","Latitude":"44.317144","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=44.317144,+-85.600214(19913)&iwloc=A&hl=en\"> mufon case (19913) map </A>","Summary":"two connected very bright lights buzzed our car","Object Shape":"Unknown","Date of the Event":"06/30/1975 03:00 UTC","Case Number":"19913","City":"Undisclosed","Date Submitted":"10/12/2009 12:59 UTC","Tags":"City","Weather Factors":"None"}