{"Sighting Duration":"Undisclosed","Object Features":"None","Object Shape":"Saturn-like, Square, Rectagular","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 13th 2009","This sighting has never been favorited.",""],"Date of the Event":"10/13/2009 08:00 UTC","files":["/var/www/straped/mufon/html2text/19926.html.txt","/var/www/straped/mufon/more/19926_submitter_file1__chicago-object.jpg","/var/www/straped/mufon/org/19926.html"],"City":"Chicago","map":"<A HREF = \"http://maps.google.com/maps?q=41.99825,+-87.760342(19926)&iwloc=A&hl=en\"> mufon case (19926) map </A>","divs":["Sighting Details We live under the flight path for Ohare Airport - noted a pulsing coppery colored light southbound that appeared to be near the broken clouds. The color was unique and reminded me of a previous sighting of the same style that we did not report to mufon a few months previously, that was a southbound object flying over the airport. This object appeared in the northeast over the trees of the park preserve and went straight south at about the same height as Jupiter, just past jupiter and then vanished. When I first saw it I ran inside and grabbed my Celestron 10 x 80 binoculars, and got it into focus, what I saw was what appeared to be a large rectangular translucent object, (atleast it was a rectangle on the bottom, I could not see the top it was dark) whose bottom appeared to be illuminated by the beacon in the center of its bottom edge, as it was traveling left to right. The illumination from the light source on the bottom was flame like but the color was odd, I dont know what to compare it to. And the bottom may have been V shaped or curved as the light from the bottom tapered off, gradiently as you looked up the side of it. My arms were shaking with excitement so I ran to the porch wall to steady my arms but then it simply vanished. blinked out... gone. The entire sighting was approximately 90 seconds, in the beginning when when I first saw it I hear a loud jet blast coming from behind me in the direction of Ohare however I never saw a plane, and the jet blasy sounded different from the normal air traffic we deal with every day. Im sorry I can not add more details... ------------- Mufon Questions: 1) Went out back for a smoke, chairs face east, and Ive always been into astronomy, I look up all the time. 2) First noticed it because of peculiar color and modulation of light and fact we are in Ohare ATC area. 4) When I ran for binoculars I hoped it would not turn out to be juts a helicopter or airplane. 5) I admit being excited when I could see the object instead of just 'an odd light' 6) it vanished in a blink of eye."],"Disposition":"Unresolved","Latitude":"41.99825","Region":"Illinois","Source":"MUFON","Case Number":"19926","Weather Factors":"Unknown","Log Number":"US-10132009-0008","Viewing Distance":"Unknown","Summary":"bright copper color - amber/red/gold pulsing dot viewed breifly in 10 x 80 binoculars","Country":"United States","Date Submitted":"10/13/2009 08:43 UTC","Longitude":"-87.760342","Object Flight Path":"Straight-line path","Tags":"City"}