{"Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/1992.html.txt","/var/www/straped/mufon/org/1992.html"],"Disposition":"Insufficient Data","Sighting Duration":"01:59:00","City":"Central Point","Source":"MUFON","Country":"United States","Case Number":"1992","Date Submitted":"11/28/2002 10:30 UTC","Longitude":"-122.942223","Object Features":"Undisclosed","Region":"Oregon","Summary":"triangle in the night skies of central oregon","Latitude":"42.340321","map":"<A HREF = \"http://maps.google.com/maps?q=42.340321,+-122.942223(1992)&iwloc=A&hl=en\"> mufon case (1992) map </A>","Object Flight Path":"Stationary","Log Number":"","trends":["There has been one other sighting in Central Point","There were no other sightings in Central Point on or around November 28th 2002"],"Object Shape":"Undisclosed","divs":["Sighting DetailsI went out to smoke and i looked off in the distance and i saw a light i hadseen the night before, well the night before i thought it was the space stationthe news had reported. i went in to get my mother to come out to look and whenshe did i noticed a second light. we watched these two lights and as we did theystarted to move up and down, side to side, and in angles. i thought it was myeyes playing tricks with me but i had made myself stationary so my body wouldnot move from side to side and the objects still appeard to have moved theywould go behind trees and then a second later be above the trees.well afterabout an hour of watching this one of the lights moved way off in the distanceto the point where it looked like a star and has remained there since. i hadgotten in my truck and drove in the same direction as the object but the more idrove the further they would get. as i got home i looked up and it seemed asthey where coming back. after about 10 minutes a third light had appeared frombehind some trees to our left. it was low eough that we thought it was asecurity light on the house but it to started to move. now the lights make aperfect very large triangle in the sky."],"Viewing Distance":"Over One Mile","Tags":"City","Date of the Event":"11/28/2002 10:30 UTC"}