{"trends":["There have been 4 other sightings in Jackson","There were no other sightings in Jackson on or around September 24th 1973"],"Latitude":"35.617887","Case Number":"19922","files":["/var/www/straped/mufon/html2text/19922.html.txt","/var/www/straped/mufon/org/19922.html"],"Log Number":"US-10132009-0004","Summary":"Every since my last encounter in my bedroom on 3/27/09. They've been showing up!","Object Flight Path":"Stationary,Other,Unknown","Object Features":"None","Weather Factors":"Unknown","Date Submitted":"10/13/2009 02:46 UTC","City":"Jackson","Country":"United States","Disposition":"Unknown","Source":"MUFON","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.617887,+-88.808407(19922)&iwloc=A&hl=en\"> mufon case (19922) map </A>","divs":["Sighting DetailsWhen I was 10 years old. As I WOULD PUT IT; Advanced humanoid beings have been visiting me every so often. They called themselves 'ZONS'. I was told I had a special gift called; 'reshaping reality'. At that age I didn't understand what was going on. It felt like a dream until I started getting telepathic messages. These messages would tell me to look at certain areas of the sky. There they were positioning themselves as stars. These stars had diffrent tumbling colors such as red,blue,yellow,and green. As I've grown older. The message I got clearer as time had past. They told me they would look after me until the time was right. I thought I was going crazy but hearing about certain abductions. They told me things and have shown me things about the past and the future. One, that they are from a distant sister planet in our solar system millions of years ahead in technology. Some are called 'WATCHERS'. Those are the diamond craft that charge by the sun's energy. These craft were told to me to be interceptors. Because of the fact we have entered the 'nuclear decision threshold'. As said, they started the same way we have. From primitive bicameral tendencies to see the 'light'. I could go on and on about my story. But, you'd probably think I'm lying to you. I see them all the time on clear nights. If you don't believe me. I'll show you. I have what you call one of the 'watchers' position themselves over my house every night. Something big is about to happen. I feel I'm joining the civilization of the universe! Contact me. I'm proof positive! Come and see for yourself, Gregg"],"Object Shape":"Diamond, Triangle","Region":"Tennessee","Sighting Duration":"Undisclosed","Date of the Event":"09/24/1973 10:00 UTC","Longitude":"-88.808407","Viewing Distance":"20 Feet or Less"}