{"files":["/var/www/straped/mufon/html2text/19923.html.txt","/var/www/straped/mufon/org/19923.html"],"trends":["There have been 4 other sightings in Jennings","There were no other sightings in Jennings on or around September 17th 2009"],"Date Submitted":"10/13/2009 03:23 UTC","Region":"Louisiana","Latitude":"30.222428","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=30.222428,+-92.657085(19923)&iwloc=A&hl=en\"> mufon case (19923) map </A>","Log Number":"US-10132009-0005","Weather Factors":"None","Object Shape":"Sphere","divs":["Sighting DetailsOn September 17, 2009 at approximately 1430 hours central time, I was working outside with another individual. The second individual who I will refer to as \"Dan\" was the first to see the object. Dan asked me if I was able to see the object, and at first, I could not. Dan spent a few seconds trying to describe the location of the object and then I was able to see it. The object appeared to be stationary or moving very slowly. The object was a silver sphere and appeared to be at approximately 20,000 feet. The object was in the eastern sky north of Interstate 10 and east of LA Hwy 102. A quick look at my Suunto watch indicated that the object was on an azimuth of 117 degrees. After approximately two minutes of watching this object, Dan saw a second object that was a few thousand feet lower than the first object and slightly south of the first object's position. Dan was able to point the second object out to me. The second object was on a azimuth of 119 degrees. The second object was also stationary or moving very slowly. After a few minutes of observing the second object, Dan saw a third object. Despite Dan's efforts, I was never able to see the third object. The two objects that I saw seemed to disappear immediately. No sound was heard from either object. The sky was slightly cloudy, but clear enough to track the objects. I have served in the military and know for a fact that these objects were not helicopters or jets. The speed at which the objects left the area would indicate something other than conventional aircraft technology. I can't say that it was alien, but it was certainly not normal. Unfortunately, the event happened so quickly that I was able to get any photos or footage of the objects. I attempted to photograph the objects with my Blackberry, but the distance and altitude of the objects made that impossible. I will meet with a MUFON investigator, but said investigator will have to contact me by email."],"Object Flight Path":"Stationary","Date of the Event":"09/17/2009 02:30 UTC","Tags":"City","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Longitude":"-92.657085","Case Number":"19923","Object Features":"Dome","Disposition":"Unknown","Summary":"Two stationary spheres viewed.","City":"Jennings","Source":"MUFON"}