{"Date of the Event":"10/13/2009 11:41 UTC","City":"Orlando","map":"<A HREF = \"http://maps.google.com/maps?q=28.540056,+-81.373806(19933)&iwloc=A&hl=en\"> mufon case (19933) map </A>","Disposition":"Unknown","Region":"Florida","Latitude":"28.540056","Object Flight Path":"Straight-line path","Case Number":"19933","Country":"United States","Summary":"Came out of Northern Sky headed due South. Crossed horizon in 5-6 seconds","Source":"MUFON","Weather Factors":"None","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around October 13th 2009"],"Tags":"City","Object Features":"Unknown","Date Submitted":"10/14/2009 12:16 UTC","Sighting Duration":"Undisclosed","Longitude":"-81.373806","files":["/var/www/straped/mufon/html2text/19933.html.txt","/var/www/straped/mufon/org/19933.html"],"Object Shape":"Disc","divs":["Sighting DetailsCame out of Northern Sky headed due South. Crossed horizon in 5-6 seconds Walked outside on pool deck going to the backyard to walk the pup before bed and saw the disc out of corner of my right eye. It appeared and disappeared so quick that my initial reaction was, \"that was a UFO\" It was changing colors from brilliant white to ice blue and back to white. There was no trail like a comet or shooting star. Also there was no sound from the object. There was a commercial 757 heavy on approach to the South East setting up for a landing at MCO. The speed of the disc was 6-7 times faster than the 757. I grew up flying with my dad; we owned a small municipal airport in east Tennessee. I have been flying since I was 12 and a licensed pilot since I became legal at 16, multi rated,I have over 3500 hours single & twin engine left seat and with over 150 hours in right seat of a Lear 7. This was a UFO, not a star, comet or swamp gas. There have to be other reported sightings of this disc all over central Florida. It was on an approximate path from Daytona to Sarasota."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-10142009-0001"}