{"Date of the Event":"10/10/2009 07:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.882334,+-117.560028(19932)&iwloc=A&hl=en\"> mufon case (19932) map </A>","Log Number":"US-10132009-0014","files":["/var/www/straped/mufon/html2text/19932.html.txt","/var/www/straped/mufon/org/19932.html"],"Weather Factors":"Unknown","Latitude":"33.882334","Summary":"My family and i were driving in slow frwy traffic and seen a disc shaped object move slowly across the sky.","Case Number":"19932","divs":["Sighting Details Myself my daughter and my mother in law were comming back from a party that my daughter was attending. It was about 7:30 pm when we driving home on the 15 frwy north the we proceeded to take the 91 west and the on ramp was bumper to bumper and came to a complete stop. My daughter in a very excited voice said (dad look at this pointing to my left)we were facing north, about 100 ft in the northern sky was a large aproximately 60 ft across disc shaped craft just gliding effortlessly with no sound we had our windows open and heard nothing but the traffic from the frwy below. It was black with a reddish orange glow in the center and many white lights on the outer edge that moved around it,as it moved across from north to northeast and just dissapeard into the overcast sky. My daughter tried to tak a cell phone pic but it didnt come out. We we all amazed and didnt even realize what we had seen until we got home and talked about it later. I was not a believer, a fellow co-worker of mine had an experience and had video of it and he seen a bright light enery source of some kind that moved around the back of his house just off the santa ana river bed where the 60 frwy crosses over the river, this light moved to and fro then dropped some spinning type objects into the river bed. the video is chilling. I was a skeptic even after seeing my co-workers video,But I believe now and cant wait to see more."],"Longitude":"-117.560028","Object Flight Path":"Hovering then path","City":"Corona","Object Shape":"Disc","Object Features":"Undisclosed","Disposition":"IFO","Date Submitted":"10/13/2009 11:17 UTC","trends":["There have been 36 other sightings in Corona","There were no other sightings in Corona on or around October 10th 2009"],"Region":"California","Country":"United States","Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Sighting Duration":"00:00:40"}