{"Object Features":"Unknown","Latitude":"38.913582","Longitude":"-75.5181","Date of the Event":"09/25/2009 05:30 UTC","Case Number":"19934","Object Shape":"Unknown","trends":[""],"Object Flight Path":"Straight-line path","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19934.html.txt","/var/www/straped/mufon/more/19934_submitter_file1__WashingtonDCTwitterTrip010.JPG","/var/www/straped/mufon/more/19934_submitter_file2__WashingtonDCTwitterTrip011.JPG","/var/www/straped/mufon/org/19934.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.913582,+-75.5181(19934)&iwloc=A&hl=en\"> mufon case (19934) map </A>","Tags":"City","Country":"United States","Summary":"Long tail on object flying west to east in sky.","Region":"Delaware","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Date Submitted":"10/14/2009 04:37 UTC","Log Number":"US-10142009-0002","Weather Factors":"None","divs":["Sighting DetailsThis object was observed on September 25, 2009 at approximately 5:30 pm - While riding the bus back to New York City after attending the NASA astronauts STS-127 Tweetup in DC the day before, I happened to see what at first I thought was a contrail in the sky. But after a closer look, I realized that the 'contrail' was moving steadily across the sky from west to east, not elongating, but following this object. It was like the tail of a comet, but only it was white, like the smoke a space shuttle leaves behind while hurtling through space. This 'tail or trail' followed behind the object never gaining length, but remaining the same size as it proceeded across the sky. Whatever the object was, it was moving at a fairly fast clip, dragging this 'tail' behind it, but I was unable to see the object. It did not appear to be a plane, if it was, it was so high up as to be invisible at this distance. I tried to photograph it and this is the result. As you can see, the 'tail' is a certain length. It never got longer as a contrail would. Instead, it just continued to move behind this object as it crossed the sky. The woman sitting across from me looked up curiously as she saw me take a photo, but neither of us commented on it. I am hoping someone can tell me if a satellite or military plane was making a normal flight that day at that time. The 'tail' was not as thick as it appears in the photo. I don't know why it photographed this way, it was definitely a 'tail' not at all a thick cloud. The first photo is a blurr and not very good. The second one shows the tail as it moved across the sky. I was puzzled as it reminded me of nothing but a space shuttle or satellite and I believe a satellite does not carry a tail and there was no shuttle scheduled to fly that course that I was aware. We were on the road, not yet at the Jersey Turnpike and there was a treeline to our right as we zipped past towns. I could not see any houses at this time, only trees or wooded area on the ground. We had left DC at 2:30 pm and hit a lot of traffic before Baltimore so we were running about an hour behind schedule. Location: Somewhere between Delaware and New Jersey"],"City":"Undisclosed","Sighting Duration":"Undisclosed"}