{"files":["/var/www/straped/mufon/html2text/19937.html.txt","/var/www/straped/mufon/org/19937.html"],"Latitude":"33.128327","Log Number":"US-10142009-0005","divs":["Sighting DetailsI live in So. California, every night after 9pm if you look up towards alterus (the brightest star) you will see stars that are farther away than most of them just gliding across the sky. I've to come make it a habit each night for the past 6-9 months to go outside, prop my head up and watch this amazing thing happen. I've learned that they just fly back and forth from over where Area 51 would be (miles away from San Diego)Northwest I think to past where Mexico would be (Southeast I think)...they are not shooting stars, they are not satellites and they are deifinitely not airplanes or any manmade vehicle. I once heard that UFOs will sit out there for hours and pretend to be stars, I believe this now. I've made it into a family thing....my husband and children thought I was crazy and did not believe me until they sat out there and watched for themselves. These crafts are like monitoring our skies (especially here in So.Cal), where my house is located, I believe it is like their runway where they take off and return. It's absolutely amazing to see! You can follow them from the time you see them until they like disappear. Up until last night, we watched with the naked eye. Last night, we got out binoculars and the craft that seemed to be moving slowly across the sky are actually going at a speed that nothing manmade could ever do and they are much higher than we thought. They look exactly like stars! Except they are the ones are the tiniest in the sky! Attached is amateur video of one that we took one night in August of this year. Check it out for yourself and if you ever show up at my house when it gets dark, I WILL SHOW YOU SOMETHING THAT WILL BE AMAZING TO EVEN YOU. Unless you are already aware of this. I'm sure NASA and the government are already. There is no way that I am the only seeing this."],"Disposition":"Unknown","Case Number":"19937","City":"Escondido","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.128327,+-117.078741(19937)&iwloc=A&hl=en\"> mufon case (19937) map </A>","Date of the Event":"08/07/2009 12:00 UTC","Summary":"witnessed what seemed like stars moving back and forth","Country":"United States","Region":"California","trends":["There have been 28 other sightings in Escondido","There were no other sightings in Escondido on or around August 7th 2009","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Object Features":"None","Tags":"City","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering,Other","Longitude":"-117.078741","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Source":"MUFON","Date Submitted":"10/14/2009 12:06 UTC"}