{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.444479,+-87.631431(19938)&iwloc=A&hl=en\"> mufon case (19938) map </A>","Weather Factors":"Unknown","Latitude":"41.444479","Log Number":"US-10142009-0006","Object Flight Path":"Undisclosed","Disposition":"Insufficient Data","Date of the Event":"11/30/1994 08:30 UTC","Country":"United States","trends":["There has been one other sighting in Crete","There were no other sightings in Crete on or around November 30th 1994"],"Region":"Illinois","Date Submitted":"10/14/2009 01:05 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/19938.html.txt","/var/www/straped/mufon/org/19938.html"],"Case Number":"19938","divs":["Sighting DetailsThis was in or around 1995 when me and my girlfriend stopped at a park by a school in crete il to sit and talk as soon as we arrived we looked at the time and it was eight thirty she had to be home at nine pm so we had a half hour. we walked a very short distance and she sat down right away and suddenly before i even sat down she was wide eyed i turned my head to see what it was and i first noticed three airplane lights attached to a craft that was the size of a sky scraper turned on its side the middle was wider than the ends and its color must of been black because it was alot darker than the clear night sky.Be fore she could finish asking me if I saw it I replied yes. It was jaw dropping but my curiosity was greater than my fear. The perrimiter of the park was surrounded by peoples back yards. I immediately began to yell for anyone with a camera or if they were out could they see this in the sky. As it began to drift i ran through the field it was a very short run. I wanted to see more it was drifting out of my sight so I ran through one persons back yard and suddenly I was just standing in a strange spot and heard my girlfriend calling my name jason where are you. I walked out of the yard to her and back into the field. She said she was looking for me forever I have to go home but I argued I only went into that yard and came right back. When we got into the car it was 9 pm and I asked her how that was possible and again she said she was looking for me for a long time. Well we arrived at 8 30 pm it wasn't more than five minutes we saw the craft or more than a minute after that I ended up in the yard. The field is very short you could walk across it in two minutes and all this happened so quickly. There is no explanation for where I was or where the time went. A week later my friend introduces me to a book hes reading called communion after i tell him my story. He explains the connection between lost time and abduction? Its the only reasonable explanation. Since then I have only had many realistic dreams of ufo sightings."],"Longitude":"-87.631431","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","Summary":"rectangle shaped craft blacker than night like a sky scraper turned on its side with little airplanr lights","Tags":"City","City":"Crete"}