{"Case Number":"19944","trends":["There have been 5 other sightings in Farmington Hills","There was one other sighting in Farmington Hills on or around July 10th 1977"],"Weather Factors":"Unknown","Latitude":"42.485152","Date Submitted":"10/14/2009 11:17 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsOn June 10th 1978 at about 4pm, My mother and I were sitting on the covered porch of our Farmington Hills MI home when we heard a light buzzing or humming sound above us. I was curiuos and stepped out onto the sidewalk that leads to our driveway. When I looked up into the direction we thought the sound was coming from, I saw a circular object about 1200 feet directly above and slightly to the left of my position. I estimate the object to be about 75 to 100 feet accross and light grey in color. Even though it was the middle of the day, I could clearly see white lights pulsing around the perimeter of the object in a clockwise direction. Each pulse last about one second and i viewed these pulses for about 10 seconds before my mother joined me on the sidewalk. We watched it together for about 20 seconds and immediately identified it as a UFO because it hovered for about 30-40 seconds in one spot. My mother then went into the house the get her camera. As she came back out from the house (camera in hand) the UFO proceeded north at about 75-100 miles per hour for about 5 seconds before it made an abrupt 90 degree turn to the left at a very high rate of speed of what i estimate to be about 500-700 miles per hour. I would imagine that no human would be able to survive a g-force like that. From a straight flight line at about 100 miles per hour to an abrupt left turn at at least 500 miles per hour and stayed at that same speed from the exact point in the turn until it was out of our view. My mother never did get a picture as she could not get the lense cap off and get the camera focused in time. We were both in awe of what we had seen. I was excited as I now had proof that we are not alone. It apraked my interest in all unknown things such as UFO's, the Bermuda Triangle and other similar things such as USO's. Over the years following I have read many accounts of UFO & USO sightings and abductions. I also have more information that is of a personal nature that would be of great interest to anyone that has researched these kind of sightings."],"Summary":"circular object hovered then moved about 1/2 mile to north before accelerating at high speed in opposite direction","files":["/var/www/straped/mufon/html2text/19944.html.txt","/var/www/straped/mufon/org/19944.html"],"Region":"Michigan","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-83.416372","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=42.485152,+-83.416372(19944)&iwloc=A&hl=en\"> mufon case (19944) map </A>","Source":"MUFON","Log Number":"US-10142009-0012","Disposition":"Unknown","Date of the Event":"07/10/1977 12:00 UTC","Tags":"City","Object Flight Path":"Undisclosed","City":"Farmington Hills","Object Shape":"Circle"}