{"Viewing Distance":"21-100 Feet","trends":["There have been 12 other sightings in Rio de Janeiro","There was one other sighting in Rio de Janeiro on or around June 13th 1970"],"files":["/var/www/straped/mufon/html2text/1994.html.txt","/var/www/straped/mufon/org/1994.html"],"Tags":"City","City":"Rio de Janeiro","Object Shape":"Disc","Object Features":"Window(s)","Object Flight Path":"Stationary","Longitude":"-43.209587","Date of the Event":"06/13/1970 03:45 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=-22.903539,+-43.209587(1994)&iwloc=A&hl=en\"> mufon case (1994) map </A>","Weather Factors":"Unknown","Log Number":"","Summary":"Large UFO descended over Brazilian couple in 1970.","divs":["Sighting DetailsP.S. This form has a HTMLJavaScript coding error - this is a foreign report, sothere is no Stateprovince applicable, but it requires it. As I already lived inCA, I filled in just for submission acceptance.A detailed description of a strange but very real fact.I was just 17 years old, and it was Saturday, about a week before my 18 Junebirthday in Rio de Janeiro. When the weather was nice, I and my friendssometimes went to a distant neighborhood named Barra da Tijuca now full of plushskyscrapers to bowl, drink and enjoy a good time in front of a beautiful beachwith our girlfriends. There is also a nice restaurant at the very end of the15-mile long beach.This scene is pretty common, but one day I was driving back in my blue OpalaChevrolet from this restaurant at 315 AM, speeding over 120 kmh 75 mih on thebumpy beach side road, to arrive to the girl92s home before her mother woke up. Singing happy while listening to the radio,and seeing the beautiful night sky with a full moon and bright stars, I wastotally unconcerned while my special yellow high headlights were vanishing thedarkness ahead of us. When the road was"],"Case Number":"1994","Sighting Duration":"01:59:00","Latitude":"-22.903539","Date Submitted":"06/13/1970 03:45 UTC","Country":"Brazil","Region":"Rio de Janeiro","Disposition":"Unresolved"}