{"Object Flight Path":"Undisclosed","Region":"Maryland","Weather Factors":"Unknown","Case Number":"19948","Tags":"City","Object Shape":"Flash","files":["/var/www/straped/mufon/html2text/19948.html.txt","/var/www/straped/mufon/more/19948_submitter_file1__BeamofLightSketch.jpg","/var/www/straped/mufon/org/19948.html"],"Disposition":"Unknown","Country":"United States","Log Number":"US-10152009-0002","Longitude":"-77.403421","Summary":"Very bright, white-blue light descended from a clear sky; no sound","City":"Frederick","Sighting Duration":"Undisclosed","trends":["There have been 16 other sightings in Frederick","There were no other sightings in Frederick on or around September 19th 2009","This sighting has never been favorited.",""],"Date Submitted":"10/15/2009 01:01 UTC","Latitude":"39.419199","Source":"MUFON","Date of the Event":"09/19/2009 07:45 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.419199,+-77.403421(19948)&iwloc=A&hl=en\"> mufon case (19948) map </A>","Object Features":"Undisclosed","divs":["Sighting DetailsThis was odd and stayed with me. I was driving on two-lane highway Alt.40W going east through the Maryland mountains just across the Washington County line in Frederick County, Maryland. These are low mountains or high hills, around 300-500 feet. This incident occurred between 7:30pm and 8:00pm; the western sky to the right and behind me was still dimly lit along the horizon, and the eastern sky ahead of me and to the left was black. There was no moon that night. As I drove around a big curve in the road, I saw a light in my upper left peripheral vision, turned my head and looked there, and observed a large bright bluish white light quickly descending from the cloudless, black (new-moon) sky. It wasn't a flash, it was more like a huge searchlight from above in a wide short beam; however, nothing was visible above it, i.e., it wasn't attached to anything. I quickly opened the car window to listen but there was no sound. The light was maybe 30 feet above the tops of the highest trees on the mountain ridge. The span of the light was wider than a helicopter search light. It shot down and remained there for a short count, then disappeared from left to right. It lasted about 5-15 seconds--my guess is about seven seconds. I was driving at approximately 25mph at the time and almost drove off the road I was so astonished. There was a line of cars behind me because I was driving so slowly as I stared up and to my left; I recall wondering at the time if any of the drivers behind me saw it. None of them honked. The light was unnatural-looking in color, size and motion and it was very dense, not diffuse; however, the quick flash of a lightning bolt is comparable in intensity--but this was not, as I mentioned, a quick flash nor was it a slow blink. Its color was similar to diode lights, a.k.a. extremely bright bluish white. No trees, no mountains obscured my view. I continued driving and, about 5-10 seconds later, I rounded the mountain and saw the valley immediately to my left. I could see the stationary low lights of the homes scattered around this farmland area of Frederick County. There were no helicopters (my first thought) behind above nor around, no aircraft, nothing, just silence."]}