{"Object Features":"None","Source":"MUFON","Date Submitted":"10/14/2009 11:22 UTC","Country":"United States","Viewing Distance":"21-100 Feet","Object Shape":"Triangle","Date of the Event":"10/10/2009 07:45 UTC","Tags":"City","Disposition":"Hoax","Object Flight Path":"Stationary,Hovering then path","Summary":"Large Black Triangle with three bright lights one bright red light in center","Case Number":"19945","trends":["There have been 19 other sightings in Peru","There were no other sightings in Peru on or around October 10th 2009"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.762153,+-86.061011(19945)&iwloc=A&hl=en\"> mufon case (19945) map </A>","Longitude":"-86.061011","Region":"Indiana","divs":["Sighting DetailsWe went out to the Okie Pinoki to go check out the rumors of the ghosts that suppose to haunt the area. After wandering around the area for about 2 hours with our friends. My boyfriend and I decided to take off by ourselves for a little \"alone\" time. As we sat in our car talking and discussing our plans for the coming year, we noticed a car pull onto the road with some people in it. I waved at them as they drove off into the woods. As we sat there in the dark for another 10 minutes talking and listening to the radio, we noticed what looked like lightning in the distance. All of a sudden, the radio started to jump around and not stay on one radio station. As we looked at the radio, the entire area around us became as bright as daylight, we could see the trees and the grass around us. We looked up to see a large object above us, we also jumped out of the car, both out of curiosity as well as scared completely out or wits. The next thing I remember we were standing outside of our car as we watched a large black triangular craft slowly move away from us. The craft slowly angled upwards and out of view in the clouds. As we got into the car, we thought that only a few seconds had passed, much to our horror THREE HOURS has passed!!!!!!!!!!!!!!!!!!!!!!!!!!!! I did not want to report this incident, but this sighting has really affected my life. I am scared to sleep in complete dark, I feel that someone is watching me now. My boyfriend has completely freaked out and sleeps with his lights on now, he is scared and so am I."],"Latitude":"40.762153","City":"Peru","Log Number":"US-10142009-0013","Weather Factors":"Windy, Light","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19945.html.txt","/var/www/straped/mufon/org/19945.html"]}