{"Longitude":"-97.468345","divs":["Sighting DetailsI live on Lake belton, across from Fort Hood testing (firing) range, (they own that half of lake, we sometimes feel like we live in one of those countries being bombed sometimes). I was watching the aproaching storm, we have a kind of tree top home, all windows, we can see forever because of the height of our home, and we love to watch the storms coming from counties away. I was on the phone with my mother in law in NJ, when all of a sudden I saw 4 of the UFO's before the approaching storm, I started screaming at her that I was seeing them, and how they were appearing and disappearing. Then I realized no one would believe me without pictures, and I found my camera, they were appearing, in a \"W\" pattern, then 2 would dissapear, then reapear, I have 2 pictures of 2 of them, the other 2 disappeared, one is showing them as crafts with a white light across the whole bottom - then the next picture was amazing to me when I put them on my computer and zoomed in - they look like they were turning- but they appear as 2 little baby lightning bolts, then they disappeared as the storm got here, my husband was driving up Kykendall Mountain road, at the time on his way home from work, and he saw them as well. It was absolutely amazing!!!! I have always believed, but I never thought I would see them, let alone get a picture of them!!! The storm was one of the most amazing I had seen, I have those as well if you need them, with mammatos clouds, and then the sun was setting under the clouds and everything was amazing yellow. I will never forget the feeling, that I knew we were not alone. I watched the History channel last night, there was a series on the area 51, and you were mentioned, and I knew I had to send them to you, and I am happy to have found you. Thank You for taking the time to read this, and look at the pictures."],"Latitude":"31.199897","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.199897,+-97.468345(19951)&iwloc=A&hl=en\"> mufon case (19951) map </A>","Date of the Event":"06/11/2009 07:30 UTC","Weather Factors":"Unknown","Region":"Texas","Object Features":"Dome","Date Submitted":"10/15/2009 08:01 UTC","Tags":"City","Viewing Distance":"Unknown","Object Shape":"Disc, Other","Country":"United States","Source":"MUFON","Object Flight Path":"Straight-line path","Summary":"They were flying in fron of approaching bad storm, I live on hill on lake","files":["/var/www/straped/mufon/html2text/19951.html.txt","/var/www/straped/mufon/more/19951_submitter_file1__storm002.JPG","/var/www/straped/mufon/more/19951_submitter_file2__storm003.JPG","/var/www/straped/mufon/more/19951_submitter_file3__storm001.JPG","/var/www/straped/mufon/org/19951.html"],"trends":["There have been no other sightings in Moffat","This sighting has never been favorited."],"City":"Moffat","Sighting Duration":"Undisclosed","Case Number":"19951","Log Number":"US-10152009-0005"}