{"Country":"United States","divs":["Sighting DetailsI at first saw a helicopter, and red and blue lights separated by 2-3 hundred yards. I thought they were normal signal lights of the heli, then noticed they were WAY too far apart to be a part of the same aircraft. The blue light, which looked more like an orb with an internal light source, was about a third the size of the heli, and about 300 yards in front and above the heli. All of the sudden, the blue orb light accelerated WAY faster than the heli, evened out to the same altitude, then stoped and waited for the heli to catch up. Once it did catch up, the blue orb made more manuvers \"avoiding\" or more like playing or teasing the heli. After focusing on the heli trying to keep up with the orb for about 2 minutes, I noticed a large flat grey colored craft IN FRONT of the blue orb, about the same distance away from the orb that the orb was from the heli (300 yrds). The large craft had NO LIGHTS, which is why I didn't notice it until later in the experience. The large craft was being followed by the blue orb, was silent, classic UFO shape(but not shiny, flat grey in color), and kept a slow steady pace at around 60 mph. It seemed as though the blue orb was accompanying the larger UFO craft, and protecting it, or trying to divert the heli away from the craft. The orb was an aqua blueish color, somewhat \"seethrough\", had a small trail that followed behind it, and was capable of moving in all directions and stopping in mid air. The UFO craft however kept a straight heading, and had no lights in, on, or around it, besides the heli lights and the blue orb of course. I am CERTAIN these were not the traditional blinking lights all aircraft have. They moved independently, went in different directions, and held different speeds. The heli only had one red light, ONE, not two. It was ONE RED light on the heli, the weird aqua blue orb, and a UFO all moving in the same general direction with the orb being the only object to deviate from a straight heading. I watch the skies EVERY night because I have seen things 2 other times in my lifetime which started my interest. I was outside having a ciggarette and happened to witness this little \"game\" play out between the heli and the orb. The event lasted about 5 minutes, and I didn't about 6 double takes to make sure I wasn't imagining something that wasn't really happening. I am SURE this was NOT normal craft. It looked like a chase by us after \"them\", with them laughing at our inability to keep up with them, and them having to alter their operations in order for us to keep up. Strange to say the least. And I am of sound mind and have a Master's degree. What I saw was definitely not ordinary. I did not have a camera of any kind at the time of the sighting unfortunately..."],"Tags":"City","Object Shape":"Circle, Disc, Fireball, Oval, Other","files":["/var/www/straped/mufon/html2text/19959.html.txt","/var/www/straped/mufon/org/19959.html"],"Region":"California","Longitude":"-117.148985","Weather Factors":"None","City":"San Diego","Object Features":"Dome","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around October 15th 2009"],"Latitude":"32.716989","Disposition":"IFO","Summary":"Helicopter chasing blue orb that could outmanuever the heli and a UFO. 3 objects total, 2 unidentified","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"10/15/2009 11:06 UTC","Case Number":"19959","Date of the Event":"10/15/2009 07:33 UTC","Sighting Duration":"00:05:00","Log Number":"US-10152009-0013","map":"<A HREF = \"http://maps.google.com/maps?q=32.716989,+-117.148985(19959)&iwloc=A&hl=en\"> mufon case (19959) map </A>","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile"}