{"Country":"United States","files":["/var/www/straped/mufon/html2text/19952.html.txt","/var/www/straped/mufon/org/19952.html"],"Latitude":"41.507477","Region":"New York","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"10/17/2009 10:31 UTC","Log Number":"US-10152009-0006","Case Number":"19952","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.507477,+-74.005398(19952)&iwloc=A&hl=en\"> mufon case (19952) map </A>","Object Shape":"Other","divs":["Sighting Detailsi was sitting outside smoking as i do every night, sky watching. I live 2 miles from Stewart Airpiort in newburgh, N. Y..I am a disabled airforce veteran and use a powerwheelchair. I've seen many aircraft,and also worked on the flightline. Was watghing flashing white, and red.The blinking pattern started to change as it flew west to east. Low cloud coverage, broken up to very clear sky obove clouds. What i thiought was a aircraft went overhead about 2oooft, the lights i was wathching flash and thought were the approximate size of it, turned out to be a group of 3-4 light and as i could see better [overhead] they were attached to something in front of it wich was a HUGE white cloud colored, semi-transparent craft shape of a PLANE with a fuselodge twice as ling as a 767. The light's i was seeng were on the very top tip of tail, no Faa wingtip strobes not another Light on this whole Massive craft, As it went overhead i heard a very strong elecrical hummmm, like the power lines give off. The humm lasted until it got about 2-3 miles to east, away. Couldnt here the woode around me,everything else was like blocked out. Ive seen crafrt before here in Pine` Bush, N.Y. and hudsonvalley This is one that creeped me out because i heard or maybe even felt that HUMM!!I actually felt uncomfortable outside and when in, LOL, yeah scary .Called my brother to tell him and in the middle i had to hang up told em i call back bloodpressure was up short breathe. I lost sight of it as it continued east."],"Disposition":"Unresolved","Summary":"sitting outside my home was watching red,white flashing. As it got closer was listening for engine nosem nothinh. It went directly overhaed about 2000ft up. The object , \" plane\"made a very strong humming as it went by.","Tags":"City","Longitude":"-74.005398","Date Submitted":"10/15/2009 01:31 UTC","City":"Newburgh","Weather Factors":"Unknown","trends":["There have been 8 other sightings in Newburgh","There were no other sightings in Newburgh on or around October 17th 2009"],"Object Flight Path":"Undisclosed"}