{"Latitude":"32.842334","Object Flight Path":"Straight-line path","Source":"MUFON","Date Submitted":"10/15/2009 02:05 UTC","Longitude":"-104.403296","Object Features":"None, Unknown","divs":["sighting detailsi was laying on my lawn chair as usual in my back yard looking for any unusual objects to film. i had the night scope\\jvc camera next to me. from over the top of me from behind me came this huge oval orange object. i switched the camera on as fast as i could. by that time the object was by the trees in front of me. i was able to film some of it. it was so bright it easily shown through the trees! i jumped up from my lawn chair after a few second of taping it and tried to get a lock on it again. i was able to film it some more as it passed from the trees then in front of the house. i would of run to the front but unfortunately earlier the battery went dead and i was plugged into the power cord, or i defiantly would have. i hope someone else in this area got it on tape. it was huge, about the size of the half moon but was oval shaped. it appeared to be a dark orange in the middle(kind of a burnt orange, i don't think i have really seen that exact hue before) and lighter orange on the outer. it also seemed to be one craft but kind of raggedy around the edges. this i am sure would of looked great with a color camcorder. the 40 second film i shot, the object is green because it was shot with a gen 2+ atn night scope attached to a jvc mini-dv camcorder and because of the very bright nature of it looked completely round. i feel super lucky to even get any of it! i was facing east the object flew silently over me going west. time was approximately 21:56 hrs. i also posted this to youtube channel ufonv. thank you, jim"],"Date of the Event":"10/14/2009 09:56 UTC","Log Number":"US-10152009-0004","Weather Factors":"None, Does Not Apply","Sighting Duration":"00:00:50","City":"Artesia","trends":["There have been 5 other sightings in Artesia","There were no other sightings in Artesia on or around October 14th 2009","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/19950.html.txt","/var/www/straped/mufon/org/19950.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.842334,+-104.403296(19950)&iwloc=A&hl=en\"> mufon case (19950) map </A>","Case Number":"19950","Tags":"City","Summary":"Large burnt orange oval shapped object at least half size of full moon.","Region":"New Mexico","Object Shape":"Oval","Disposition":"Unknown","Viewing Distance":"Unknown","Country":"United States"}