{"Object Shape":"Disc","Disposition":"Unknown","Date of the Event":"09/05/1974 01:00 UTC","divs":["sighting detailspaul hicks field investigator mufon. this is a report i obtained from my brother. i talked to him about the sighting and did an interview. mufon report was sent to ray boeche, nebraska state director, 2\\27\\1989. i received additional information from jay 4\\1\\1989 and 1\\28\\1990. and recently 8\\10\\2009. anyone wishing to contact jay may do so via his email address. jay lived on a ranch near south bend, ne. he had horses in the pasture, and dogs and cats. on this night his wife and 6 or 7 kids were in the trailer also. they apparently didn't wake up. he didn't know the date at first. weekend or he was on vacation. jay was a truck driver. between 12 and 2 am he was awakened by a loud roar and whistling sound accompanied by very bright flashing or rotating light. he said it was so loud he couldn't have heard the dogs bark. the light was blended yellow-gold mixed with red. they appeared to be coming down. the sound had quieted to a buzz or hum like an electric generator. he was in the bedroom in the west end of the trailer. object was to the north 100' or less away. he believes it came down in the horse arena either landed or hovering. he believes it sat down. there was a window on the west wall. there were lights reflecting off the tin barn and cars. he couldn't see the arena. out of the bedroom and to the left was the north door. he thought to go and look and the object took off, \"like it read my mind\". he feels it knew he was aware of it. almost gone instantly. 3 or 4 seconds. he said the event lasted 4 or 5 seconds, probably longer. he never actually saw an object. he said his dreams were illogical, this was real. he looked in the arena the next day and nothing. there was dry dust in the arena, deep. he had just disked it. (he is very confused about some of the events either because it was years ago or something else. he said he can't remember clearly what happened. at various times he has told me different happenings. 1. after he thought to go to the door and it took off, he doesn't remember anything. thinks he went back to sleep. 2. i woke up and went back to sleep. don't know why i didn't go to the back door or living room window. 3. i went to the door and nothing. 4. he said he may have went to the door and went out. 5. i got up and thought i was dreaming and went back to bed. i got up again and it was still happening. more to come..."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19958.html.txt","/var/www/straped/mufon/org/19958.html"],"Source":"MUFON","Country":"United States","City":"South Bend","Weather Factors":"Does Not Apply","Case Number":"19958","map":"<A HREF = \"http://maps.google.com/maps?q=41.001665,+-96.245291(19958)&iwloc=A&hl=en\"> mufon case (19958) map </A>","Object Features":"Appendage(s)","Tags":"City","Log Number":"US-10152009-0012","Region":"Nebraska","Summary":"Woke up between 12 and 2 AM. Loud roar, colored lights coming down outside. Thought to go and look and it shot back up.","Latitude":"41.001665","Viewing Distance":"21-100 Feet","Longitude":"-96.245291","trends":["There have been 2 other sightings in South Bend","There were 2 other sightings in South Bend on or around September 5th 1974"],"Date Submitted":"10/15/2009 07:37 UTC","Object Flight Path":"Path then hovering"}