{"Country":"United States","Source":"MUFON","divs":["Sighting DetailsI was trvelling n. on I95 along side the Phila. Intrn. Airport when I noticed the goodyear bimp off in the distance to my left probably just over the phila. sports stadium.However,there were also 4 huge parallelograms just floating languid around the blimp.Intrigued,as i approached the I95 bridge,i studied the objects.Traffic wes slowed over the bridge due to the ballgame to about 5-7mph.Suddenly, one ofthe parallelograms on the right changed from a darker color to a brilliant white. The parallelograms were all so large that they would completely block out the blimp when one of them passed between the blimp and my line of sight.Finally the parallelograms moved in a northerly direction and disappeared over the horizon in about 5-6 minutes-a distance of 5-6 miles away.Also,one of these objects had 8-10 horizontal stripes,alternately one on top of the other in first a rusty red,then dirty green,then rusty red then dirty green pattern.there were no airplanes in the immediate vicinity.Remarkably,as i looked at the other drivers,no one seemed to be paying any mind to this odd scene,just myself.If you have any other reports of this incident or an explanation thereof,i'd appreciate the insight.My reactions were to the sighting were mild awe with a desire to see if these objects were ufos or whether I could determine that they were identifiable.My conclusion is that at least I could not identify the objects and that they were ufos."],"Object Features":"Other","Disposition":"IFO","Date Submitted":"10/15/2009 05:18 UTC","Date of the Event":"10/11/2009 11:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.958575,+-75.156979(19956)&iwloc=A&hl=en\"> mufon case (19956) map </A>","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 11th 2009"],"Object Flight Path":"Hovering then path","Viewing Distance":"Over One Mile","Case Number":"19956","City":"Philadelphia","Region":"Pennsylvania","Log Number":"US-10152009-0010","Weather Factors":"None","Sighting Duration":"00:12:00","Object Shape":"Square, Rectagular, Other","Longitude":"-75.156979","Summary":"3-4 large parallelograms","files":["/var/www/straped/mufon/html2text/19956.html.txt","/var/www/straped/mufon/org/19956.html"],"Tags":"City","Latitude":"39.958575"}