{"Sighting Duration":"Undisclosed","Summary":"UFO was cigar shaped, with three orb lights and was being followed by helicopter on forrester road near Brawley.","Latitude":"32.987987","Case Number":"19961","files":["/var/www/straped/mufon/html2text/19961.html.txt","/var/www/straped/mufon/org/19961.html"],"City":"Brawley","Disposition":"IFO","Tags":"City","Object Shape":"Cigar","Date of the Event":"10/15/2009 08:00 UTC","divs":["Sighting DetailsI was driving down Forrester road heading toward Westmorland, when all of a sudden a helicopter with red blinking lights caught my attention. As I focused in on the helicopter I noticed another object, which was right in front of the helicopter. I shouted to my significant other and her mother, \"look at that\" they quickly took notice. At first I thought the ufo was a highway patrol plane but once it approached i quickly knew it was out of this world. As for the helicopter that was not dought a helicopter because I was able to see the propellers, the entry door, and lights. As for the UFO it was cigar shaped with three bluish orb lights underneath the object, it had no windows and no wings. The object and the helicopter were close to the road that I could see the windows to the helicopter and am sure there was nothing on the other object. It seemed as if the UFO was traveling around 60 to 70mph which is an estimated speed. The speed i was traveling at was 60mph and this took around l minute, but was enough time to detail the sighting until we lost track of helicopter and the object, but it was headed toward Mexicali or San Diego. We lost track by continuing our trip home. As this happened we stayed completely stunned, and did not know what to say, we were speachless. I was in shock and felt as if it were a dream. This is 100% true people, I know what i saw and nobody can tell me different, we are not alone."],"Longitude":"-115.528017","Object Features":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.987987,+-115.528017(19961)&iwloc=A&hl=en\"> mufon case (19961) map </A>","Viewing Distance":"Unknown","Log Number":"US-10162009-0002","Region":"California","trends":["There have been 4 other sightings in Brawley","There were no other sightings in Brawley on or around October 15th 2009"],"Date Submitted":"10/16/2009 02:34 UTC","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Country":"United States"}