{"Region":"Oregon","Summary":"Very bright light that faded in and out for almost twenty minutes until a second light approached, then they both disappeared.","Latitude":"45.526282","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/19962.html.txt","/var/www/straped/mufon/org/19962.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.526282,+-122.674617(19962)&iwloc=A&hl=en\"> mufon case (19962) map </A>","Object Features":"Unknown","Sighting Duration":"00:30:00","trends":["There have been 158 other sightings in Portland","There were no other sightings in Portland on or around October 15th 2009"],"City":"Portland","Longitude":"-122.674617","Log Number":"US-10162009-0003","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Date Submitted":"10/16/2009 02:43 UTC","Viewing Distance":"Over 1 Mile, Unknown","Case Number":"19962","Country":"United States","Object Shape":"Circle","Date of the Event":"10/15/2009 11:08 UTC","divs":["Sighting DetailsI walked outside with my girlfriend for a cigarette. We were talking about stars and I pointed one out that was bright enough to shine through a cloud to the Southwest. She said, \"That's not a star, that's a UFO.\" And immediately after, it faded completely out, then reappeared but this time in the middle of the cloud below it. Over the next fifteen to twenty minutes, we watched it blink in and out. It would get bright enough at it's peak to rule out it's being a star, and at it's dimmest point it would vanish completely. After about twenty minutes, my girlfriend's brother, who we'd called out to come look, noticed a second light blinking red and white going toward it. When they got close to each other they both disappeared. They were gone for about ten minutes before, while I was writing this, the first light reappeared further to the west. Right now I have to walk off of my back porch and look around a tree to see it, it's at roughly the same elevation and is still blinking."],"Object Flight Path":"Other"}