{"Case Number":"19965","map":"<A HREF = \"http://maps.google.com/maps?q=32.231713,+-110.918859(19965)&iwloc=A&hl=en\"> mufon case (19965) map </A>","Summary":"On ground not seen directly/showed up in picture.","files":["/var/www/straped/mufon/html2text/19965.html.txt","/var/www/straped/mufon/org/19965.html"],"Log Number":"US-10162009-0006","Weather Factors":"None","Latitude":"32.231713","Country":"United States","Region":"Arizona","Sighting Duration":"Undisclosed","City":"Tucson","Viewing Distance":"Unknown","Object Shape":"Disc","Longitude":"-110.918859","divs":["Sighting DetailsMy mother was visiting my aunt in Tucson and they went for a ride out in the open range country, takeing pictures and just riding around. After she returned home she didnot get the pictures developed right-away. itwas about a year later she developed them and at least 6 months after that before I seen them, as soon as i seen what was in the pictures I took them and put them in a lock box with the negitives and she kept the remaining pictures. The pictures i took were of a close-up view of a landed craft, it was golden colored and shaped like a sourcer compleat with landing gear. and the golden color was like a high energy field that showed up the film only. About a week after I had the pictures, I noticed the lockbox was opened with the lock still locked, and the only thing missing was the pictures and the negetives. I went to my mothers and checked the remaining pictures and found them stuck together. I managed to find one picture with a ship in the distance, but it still shows up golden and you can make out the shape also in this picture there is somthing odd in the forground, it looks like golden dots in a distorted area with horses or caddle. The distorted area looks round like a flatend bubble on the ground. I only have the one picture and no negetives."],"Source":"MUFON","Date Submitted":"10/16/2009 12:50 UTC","Object Features":"Undisclosed","Date of the Event":"03/06/2004 12:00 UTC","Disposition":"IFO","Tags":"City","trends":["There have been 173 other sightings in Tucson","There were no other sightings in Tucson on or around March 6th 2004"],"Object Flight Path":"Undisclosed"}