{"Date Submitted":"11/28/2002 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=44.080543,+-103.231015(1996)&iwloc=A&hl=en\"> mufon case (1996) map </A>","Log Number":"","Viewing Distance":"101-500 Feet","Tags":"City","Sighting Duration":"00:05:00","Object Shape":"Unknown","divs":["Sighting DetailsMy daughters I were driving north on a deserted country road at approx. 7pm 28Nov 2002. We saw a glowing green light slowly descending over a field NE of us. It looked round to me, but teardrop shaped to my daughters. I was driving wasafraid to stop, so I didnt get to stare at it like my daughters did, I keptglancing at it every few seconds. We saw nothing go up, so we do not believethat it was a flare. The light glowed steadily for 2-3 minutes and thendisappeared behind a hill. We did not see anything for the 3-5 minutes it tookus to reach the road we live on. We all kept looking in the direction we sawthe light. We didnt see the glow again, but when we started up our hill we saw5-10 cars stopped with their lights on beyond the hill where the light wentdown. There were several people with flashlights along the road out in thepastures bordering the road. Near the cars was an object that flashed white red. I drove very slowly up our hill we kept the cars in sight for at least 5minutes. I was afraid to stop, because if we could see them, they could see us. The road on our hill leads to our complex no where else I didnt want anyoneto come looking for us."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/1996.html.txt","/var/www/straped/mufon/org/1996.html"],"City":"Rapid City","Object Features":"Undisclosed","Latitude":"44.080543","Summary":"Glowing green light descending.","Longitude":"-103.231015","Object Flight Path":"Straight-line path","trends":["There have been 10 other sightings in Rapid City","There were no other sightings in Rapid City on or around November 28th 2002"],"Country":"United States","Date of the Event":"11/28/2002 07:00 UTC","Case Number":"1996","Region":"South Dakota","Disposition":"IFO","Weather Factors":"Unknown"}