{"divs":["Sighting DetailsI got home from at 6.58 pm on friday october 2009. I had dinner plans and thus had a good grip on the exact time as I was running a little late. After getting home I let the cat out and stood to lok over the bay from the houseboat we live on looking back over Mill Valley from just east of Marin City. I'm very familiar with satellites, planes, planets, starts, meteorites etc being an engineer who spends a lot of time researching in that field and I consider my observing skills and 20:10 vision to be strong. I can regularly observe satellites tracking regular orbital paths when they appear horizon to horizon for example. I have observed booster rockets re-enter and burn their fuel off spectacularly, launch vehicles take payloads into orbit, and many shooting stars and regular astronomical objects do their thing. I am also highly skeptical of \"ufo\" sightings and believe 99% of them are non events. Anyhow, as usual was looking out over Mill Valley to watch the stars rise - the sun had already set and dusk was turning to night. The sky was particularly clear and there was no fog tonight. This piece of sky from Sausalito to Tiburon in particular has quite a lot of plane activity coming into Oakland and SFO - so I often take a look at it from the front deck. Tonight I happened to notice a very faint star like object or possible a satellite tracking from south to north in a straight path. I would put it at about the same magnitude as a star observable at magnitude 0.5 to 1 - faint yet quite visible and constant. From my observing position it was at about a 20-23 degree elevation from the true horizon, whilst facing I was directly NW. At first nothing was unusual - it was however moving slowly and was not flashing, nor had any trace of FAA lights like a plane in the distance. I stuck with it, and after it had moved perhaps 5-6 degrees across the S to N sky for about 30-40 seconds it turned to begin heading roughly ENE from my observing position. This is where it got very interesting - and hence this report. As it complete the turn from the S->N->ENE it began accelerating - accelerating like nothing I had ever witnessed before. In my estimation this object crossed about 80 degrees of arc accelerating from very slow as above to covering this range in about 3 seconds, all the time accelerating. For those interested, the path where the object tracked the longest path was between Ursa Major and Leo Minor, closer to Ursa major. I was stunned - but then as I continuously observed it - eyes glued to the object it turn again - this time in a an incredible smooth arc - all the time accelerating to head W - after which it accelerated out of sight within about 1 second and I could not locate it nor any trail nor otherwise. The speed at which it moved was simply incredible. So, here we have what looked like a satellite accelerate radically across a huge degree of arc across the sky in three different directions, make rather drastic turns that were not those one would expect of a natural object like a meteor nor a man made object in orbit,nor multiple co-incidental objects appearing as one - this was a single object making smooth controlled turns. I have never seen anything quite like it. I did not have my camera, and I doubt if I did I would have had time to set the exposure to capture this in time."],"trends":["There have been no other sightings in Marin","This sighting has never been favorited."],"Date of the Event":"10/16/2009 07:05 UTC","Object Features":"Unknown","Latitude":"38.083403","Object Flight Path":"Path with directional change","Object Shape":"Star-like","Summary":"Initially like a satellite, but it turned twice in a controlled arc and acclerated and vanished after crossing 120 degrees of the sky in a minute","Sighting Duration":"00:02:00","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=38.083403,+-122.763304(19978)&iwloc=A&hl=en\"> mufon case (19978) map </A>","Region":"California","Date Submitted":"10/17/2009 01:41 UTC","Weather Factors":"Unknown","Log Number":"US-10172009-0004","Tags":"City","Case Number":"19978","Longitude":"-122.763304","Country":"United States","files":["/var/www/straped/mufon/html2text/19978.html.txt","/var/www/straped/mufon/org/19978.html"],"Viewing Distance":"Over One Mile","City":"Marin"}