{"Disposition":"Unresolved","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19981.html.txt","/var/www/straped/mufon/org/19981.html"],"Object Shape":"Sphere","trends":["There have been no other sightings in Eugenia","This sighting has never been favorited."],"Country":"Canada","Case Number":"19981","Date of the Event":"09/08/2009 10:30 UTC","Date Submitted":"10/17/2009 06:05 UTC","divs":["Sighting DetailsThat night I was lying in bed watching t.v. Outside the window, which is directly in front of the bed, I saw a bright white light appear above the tree line. The object didn't look like a typical airplane, because it did not blink and the light was larger and brighter than that of an airplane. I went outside on the patio to take a look, then I saw a second object appear directly behind it. Both objects look exactly the same. Both had bright white lights and were globe shaped. Both objects flew in perfect line with each other, one in front and one behind. They were flying to the north quite fast, faster than an airplane. They appeared to be flying quite high. I watched as they passed above me, still in formation.I did not hear any noise coming from these objects. I kept watching as they flew farther north. Then I saw an airplane ahead, at a lower altitude, flying east. I watched the airplane for only a couple seconds, then I looked back at the objects, and that's when they dissappeared. Their lights just faded, kind of like a light from a spark would fade and extinguish. I watched for a couple minutes to see if they would reappear, but they never did. I honestly can not say for sure what I witnessed. I can say for sure that these objects were unlike any aircraft I have ever seen before. The fact that I didn't hear any engine noise, and the speed that these things were flying at. Plus, the way they flew in formation with each other, and the fact that their lights would shut off and they would fly in complete darkness kind of puzzles me. The only explaination I could think of is these were some kind of military craft, or possible sattelites. These were not shooting stars.what I've described here is exactly what I saw. I'm not looking for recongnition, just wanted to share me story with others that might believe it. Since I didn't have a camera with me at the time I have no proof. Anyway, if you like to contact me and give me your thoughts on this you have my e-mail."],"City":"Eugenia","Tags":"City","Source":"MUFON","Weather Factors":"Unknown","Summary":"Two bright objects flying in formation.","Sighting Duration":"Undisclosed","Latitude":"44.303406","map":"<A HREF = \"http://maps.google.com/maps?q=44.303406,+-80.51655(19981)&iwloc=A&hl=en\"> mufon case (19981) map </A>","Region":"Ontario","Log Number":"CA-10172009-0007","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Longitude":"-80.51655"}