{"Source":"MUFON","trends":["There have been 16 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around October 18th 2009"],"Disposition":"Unresolved","Summary":"bright organge object enter atmoshere and leave visible evidence","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.097949,+-79.082208(19985)&iwloc=A&hl=en\"> mufon case (19985) map </A>","City":"Niagara Falls","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/17/2009 09:11 UTC","Region":"Ontario","Longitude":"-79.082208","Object Features":"Undisclosed","Log Number":"CA-10172009-0011","Object Flight Path":"Straight-line path","Date of the Event":"10/18/2009 08:30 UTC","Latitude":"43.097949","divs":["Sighting DetailsI was walking home and noticed in the sky this orange object moving very fast and then exited the atmosphere because it dissapeared. The object was visible for no longer than 5 seconds. 15 minutes later I noticed an atmospheric phenomenon along with my mother because I showed her. It looked like there were these lines in the sky which the one was lighting up very well when the city spotlights that pollute the sky with light hit the right angle (because the light is 4 spotlights that rotate) only for a second on each rotation of ~15 seconds does the one line light up. There was some patterns I could barely where the lines were coming from so there was a lot more I could not see. Because of light pollution its not that visible except for that one that got the spotlight on when it had the right angle with the rotation. The others were too high in the air too recieve much light? Its as if its the reminisce of whatever I observed and left in the atmosphere. I do not have a camera to take a picture. Its slowly dissapearing but still visible 30 minutes later faintly. Should this have been reported at all or is this clearly a meteroite."],"Country":"Canada","Tags":"City","Object Shape":"Fireball","Case Number":"19985","files":["/var/www/straped/mufon/html2text/19985.html.txt","/var/www/straped/mufon/org/19985.html"]}