{"files":["/var/www/straped/mufon/html2text/19986.html.txt","/var/www/straped/mufon/org/19986.html"],"Latitude":"34.409419","Sighting Duration":"Undisclosed","Region":"New Mexico","trends":["There have been 6 other sightings in Clovis","There were no other sightings in Clovis on or around October 17th 2009"],"Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-10172009-0012","Tags":"City","Viewing Distance":"Unknown","Date Submitted":"10/17/2009 10:09 UTC","Weather Factors":"Unknown","Disposition":"IFO","Case Number":"19986","Summary":"Started as a large bright circle.","Object Shape":"Circle","Date of the Event":"10/17/2009 06:15 UTC","City":"Clovis","map":"<A HREF = \"http://maps.google.com/maps?q=34.409419,+-103.195727(19986)&iwloc=A&hl=en\"> mufon case (19986) map </A>","Source":"MUFON","Longitude":"-103.195727","divs":["Sighting DetailsI had just put a batch of cookies in the oven and set the timer for 10 minutes. I went to put my dog in the backyard, when I opened the door which faces east I noticed a large very bright round light in the sky, it was still daylight. I watched it for a minute then went thru the house to go to the front yard to see if anyone was outside so I could show it to them. The neighbors were just coming out of their house and the three of us watched it for a short time then they had to leave. On my way thru the house I noticed the oven timer still had a little over 3 minutes left. I stood on the back porch to look at it. The oven timer went off, I took the cookies out then went back outside. After a couple of minutes it looked liked it was changing shape, kind of like a blobby circle-ish shape. Then I saw a very small red light on the bottom of it. It was only there for a few seconds, then it dropped off of the big light. As the red light fell down the bright light was getting smaller. I saw the bigger light circle around the small light. Then they both went higher into the sky eastward until I couldnt see them anymore. It was 6:32 p.m."]}