{"Region":"California","Log Number":"US-10172009-0009","Object Features":"None","City":"Undisclosed","Object Shape":"Sphere","Disposition":"IFO","Tags":"City","Case Number":"19983","Country":"United States","divs":["Sighting Detailsmy father an i were driving south on rd. 222, it was around 9:PM, i noticed a bright object out the driver side window directly east of us,i looked up and saw a round bright light falling to earth.it was as if the moon had suddenly fallin to earth.if you held a dime out at arms length this object would barely be covered by the dime, this thing was huge.i couldn't take my eyes off it.i watched as it fell, and it began to change froom a brilliant white to an amber color.just before it vanished behind the sierras ,it seemed to be on fire, i could see flames comming from the top of it.i watched and was expecting to see and hear a large explosion,but nothing, not even a flicker did we see after that.i looked at my father and said, did you see that,dad answered yep, sure did.i listened for any radio reports ,but never heard a thing.my question to you people is, did any one else report this objet to you.any body traveling east on highway 198 just east of visalia calif,and due north of exeter at that time, couldn,t have missed seeing this thing, it was impossible to miss it.one thing is for certain ,somthing very big hit the ground that night. i might mention, area 51 is in that general direction to where this thig feel."],"files":["/var/www/straped/mufon/html2text/19983.html.txt","/var/www/straped/mufon/org/19983.html"],"Latitude":"36.783141","Weather Factors":"None","Longitude":"-119.409432","trends":[],"Viewing Distance":"Unknown","Summary":"an object fell to earth east of my house.it was as though the moon feel to earth. it was as big as a dime at arms length.","Date Submitted":"10/17/2009 08:24 UTC","Date of the Event":"03/01/2006 09:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.783141,+-119.409432(19983)&iwloc=A&hl=en\"> mufon case (19983) map </A>"}