{"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/19989.html.txt","/var/www/straped/mufon/more/19989_submitter_file1__MIB2.jpg","/var/www/straped/mufon/org/19989.html"],"Viewing Distance":"Unknown","Latitude":"33.20017","Source":"MUFON","Longitude":"-117.369563","Tags":"City","Object Shape":"Other","Case Number":"19989","Summary":"unwelcomed man in dark near in my property","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI am an old lady that was startled by someone trying to open my side house door yesterday night. before this happened i have had multiple ufo sightings near my son's house in death valley california. One incident was when we were driving in the interstate and saw two triangles hovering in the sky and presumed to follow us for about an hour. My son is an evid astronomer and now believes in ufos. I personally don't but yesterday night around 10:30 p.m i was startled by a door being slammed, mydoor being shooken. i grabbed my camera and took pictures of a man near my curb. i am frighten for my life. i have called my son and he is coming to pick me up tomorrow. i did not call the police because i am afraid of something happening to me. i hear stories of men in black appearing out of nowhere but i alwasys never believed them, as of yesterday, i do now. if anyone wants to contact me, my sons email address is armandomadrigal123@hotmail.com if you want to ask questions i will personally answer them back as soon as i can,"],"Region":"California","Country":"United States","Date of the Event":"10/16/2009 10:30 UTC","City":"Oceanside","Weather Factors":"Unknown","Date Submitted":"10/18/2009 12:13 UTC","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around October 16th 2009","This sighting has never been favorited.",""],"Object Features":"Undisclosed","Disposition":"IFO","Log Number":"US-10182009-0002","map":"<A HREF = \"http://maps.google.com/maps?q=33.20017,+-117.369563(19989)&iwloc=A&hl=en\"> mufon case (19989) map </A>"}