{"Sighting Duration":"00:20:00","Log Number":"US-10172009-0010","Summary":"Triangular shaped object with bright lights at the points","Weather Factors":"Unknown","divs":["Sighting DetailsMy wife and I had gone out to dinner and upon returning to our car we saw this very bright object in the north western sky. We stood outside our car for a minute or two wondering what it was and then we got in our car and drove home. We arrived home about 10 minutes later and I got out of the car and looked to see if it was still there. It was still there as it was apparrently not moving. I then ran into the house to get my binoculars and went back outside to try and get a look. I trained the binoculars on the light and was astonished to see that it was triangular shaped with big bright lights at the points. I then decided to go in and get my 8 inch reflecting telescope to try and get a better look. I got my telescope and went into the backyard and I kept an eye on it as I was setting up the scope. I heard my neighbor in his backyard so I drew his attention to it as well. As we watched it, we saw a smaller light leave the main object. From our vantage point, it seemed to drop several feet below the main object and then stop. Then both objects completely faded out and disappeared before I could get my scope trained on them! The whole time I witnessed the main object, it did not seem to be moving at all. The smaller one moved at a steady rate. I can't even guess at the speed of it. I am an avid watcher of UFO Files and UFO hunters. And when I first saw this thing through my binoculars, I immediately recognized it as apparrently one of those flying triangles I had seen on these shows! It was absolutely amazing!!!"],"Disposition":"IFO","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/19984.html.txt","/var/www/straped/mufon/org/19984.html"],"Object Shape":"Diamond, Triangle","Case Number":"19984","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.584663,+-101.851996(19984)&iwloc=A&hl=en\"> mufon case (19984) map </A>","Source":"MUFON","Tags":"City","Latitude":"33.584663","Country":"United States","City":"Lubbock","trends":["There have been 18 other sightings in Lubbock","There were 2 other sightings in Lubbock on or around October 17th 2009"],"Region":"Texas","Longitude":"-101.851996","Object Flight Path":"Stationary","Date Submitted":"10/17/2009 09:04 UTC","Date of the Event":"10/17/2009 07:30 UTC"}