{"Date of the Event":"10/06/2009 09:00 UTC","Latitude":"39.250239","Tags":"City","divs":["Sighting DetailsI had a discussion at the end of September with a co-worker who told me that a few days earlier he had been traveling south on highway 93 in Nevada about 50 miles south of Wells, Nevada and had stopped at what is called Lages Junction. There were 20 or so vehicles stopped at a rest area. Everyone was outside watching what appeared to be orange lights just above the horizon looking east toward Utah. He told me that there were both single and double lights and that they were perfectly stationary. They would appear for a few seconds and then fade to nothing. He said at the time that his young son had gotten scared so they continued their trip to Ely. At work we discussed the sighting for awhile and of course the usual kidding took place among the members of our crew. I am a truck driver at a open pit copper mine in Ruth, Nevada just East of Ely, Nevada. On the night of 6 October at about 9:00 pm I was traveling east onto one of the dumps where we are dumping waste rock and I was looking directly East over the Schell Creek Range of mountains. As I looked I saw what appeared to be a very bright star just a few degrees above the horizon. I see the eastern sky at night on a regular basis and was surprised to see such a bright star at that time. I no sooner had the thought than the star blossomed into a sparkling orange sphere and brightened considerably. The size of the sphere was about half the size of a full moon in the sky. It lasted for about 5 or 6 seconds and then faded to nothing. All of the equipment on the minesite is equiped with radios and I immediately called the co-worker who had observed the event on the highway and I described what I had seen and he said that it was exactly what he had observed. I am an ex Army officer and served in Combat Arms units in the Army. I have seen just about every piece of ordinance that the military detonates and I have never seen anything like this. It was perfectly stationary. It was definitely NOT a flare. In fact it did not appear to be an explosive at all. It seemed to be carefully directed as it changed size and as it faded it did not act as though it was being extinguished but rather turned down like a dimming switch for a household light. I have no logical explanation for what this was. This area of Nevada is very close to many military and energy department test sites including area 51 and the sites the military has in Utah. I do not know but suspect that it could be connected to these facilities. Other than that I cannot come up with any explanation. It was by far the strangest thing I have ever witnessed and it left me with questions I will never be able to answer. To put it in one word, \"WOW\". I was not the only witness on my crew. An equipment operator who was working on the dump saw the phenomenon twice and another truck driver also witnessed the event once. I must tell you that one of my co-workers says it was the \"Great Pumpkin\" which is quite funny but this was a real event for which I have no explanation. I took a digital camera with a telescopic lens for the preceeding night shifts but did not observe it again but plan to continue taking the camera for a few more night shifts."],"Disposition":"Unresolved","City":"Ely","Log Number":"US-10172009-0008","Object Features":"Other","Source":"MUFON","Object Flight Path":"Stationary","Summary":"bright star turned into sparkling sphere","Date Submitted":"10/17/2009 08:21 UTC","Longitude":"-114.88457","map":"<A HREF = \"http://maps.google.com/maps?q=39.250239,+-114.88457(19982)&iwloc=A&hl=en\"> mufon case (19982) map </A>","files":["/var/www/straped/mufon/html2text/19982.html.txt","/var/www/straped/mufon/org/19982.html"],"Weather Factors":"None","Case Number":"19982","Region":"Nevada","Viewing Distance":"Unknown","Country":"United States","Object Shape":"Sphere, Star-like","trends":["There have been 9 other sightings in Ely","There were no other sightings in Ely on or around October 6th 2009"],"Sighting Duration":"Undisclosed"}