{"Log Number":"US-10182009-0001","Sighting Duration":"Undisclosed","Object Features":"None","Case Number":"19988","files":["/var/www/straped/mufon/html2text/19988.html.txt","/var/www/straped/mufon/org/19988.html"],"City":"Sunrise","Date of the Event":"10/17/2009 10:45 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.167114,+-80.278296(19988)&iwloc=A&hl=en\"> mufon case (19988) map </A>","Disposition":"Unknown","Longitude":"-80.278296","Region":"Florida","trends":["There have been 12 other sightings in Sunrise","There were no other sightings in Sunrise on or around October 17th 2009"],"Source":"MUFON","Date Submitted":"10/18/2009 12:04 UTC","Tags":"City","divs":["Sighting DetailsWas by myself at the community pool(I was there because I live in south florida and I wanted to enjoy the cold front coming in)when I sat down on a chair and looked straight up and saw a light brown shaped boomerang object flying across the sky for about 10 seconds.When I first saw it I had thought it was some kind of atmosheric light but I quickly realized it was not.it then blended and disappeared into the night sky. After seeing this object I continued to watch the sky for ten minutes,then another one came this time not as high in altitude as the first one. This one was the same shape except it was more gray in color and came from the same direction as the first one which was North to South. It to also completely vanished in the sky; this wasnt the first time ive seen these ufos. The first time was 4 night before this date. When I saw the object for the first time I felt really excited and felt slightly scared. The motion of the ufos werent that unusual in nature,it flew vertically but it was faster then any conventional air plane it is also able to disguise its color and visibility exceptionally."],"Latitude":"26.167114","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Object Flight Path":"Straight-line path","Summary":"2 boomerang ufos seen within 15 min.","Object Shape":"Boomerang"}